{"khai vi thap cam": [], "goi go": [], "pho chin nam gau gan sach": [], "pho toi nam gau gan sachi": [], "pho tai chin": [], "pho tai gan": [], "pho tai bo vien": [], "pho tai": [{"excerpts": ["Got the Pho Tai, Bo Vien. ", "If you get the special, the bowl is actually larger. ", "The regular size, as is, is already pretty big. ", "The pricing is a little more than average, but the quantity justifies it. "], "author": "James N.", "review": "Got the Pho Tai, Bo Vien. If you get the special, the bowl is actually larger. The regular size, as is, is already pretty big. The pricing is a little more than average, but the quantity justifies it. Never have I ever left a pho place before and felt full.\n\nThe broth is pretty decent and it comes out fast. You don't have to worry too much about a wait as people come and go.", "rating": 4, "date": "2017-03-05"}, {"excerpts": ["Other order was #13 pho tai a staple with good broth and plenty of bef mystery meat in the soup.\n\n", "Then my buddy gets an upset stomach from #13 Pho Tai.\n\n"], "author": "Estiff S.", "review": "+2 Stars for #1 fresh spring rolls\n\nTra thai should be made to order not ahead of time and sitting in refrigeration.\n\nQuite disappointed with over priced #31 dry mealy clearly over cooked well ahead of my order shrimp.\n\nOther order was #13 pho tai a staple with good broth and plenty of bef mystery meat in the soup.\n\nCmon people staple pho should be spot on every time.\n\nThen my buddy gets an upset stomach from #13 Pho Tai.\n\nNot going back.", "rating": 2, "date": "2017-08-18"}, {"excerpts": ["I decided to go with the Pho Tai which is my go to. ", "There is only one size here as oppose to other pho places where you can get a medium or large. ", "The bowl was a good size and I was more than content with the portion. ", "The meat was great! ", "Quality was better than most of the other pho places around the city, and for the price I thought it was a great deal ", "$9. ", "My only complaint is the quality of the broth. ", "I needed to add a good amount of Sriracha and lemon to get it to where I wanted which is never a good thing. ", "Still pretty tasty nonetheless.\n", "Overall I would definitely come back, the meat quality was awesome and the portions were great for the price."], "author": "Josue V.", "review": "Came by for a late lunch here yesterday afternoon. The space is pretty big, lots of tables, definitely room for some large parties. We were quickly seated and placed our orders.\nI decided to go with the Pho Tai which is my go to. There is only one size here as oppose to other pho places where you can get a medium or large. The bowl was a good size and I was more than content with the portion. The meat was great! Quality was better than most of the other pho places around the city, and for the price I thought it was a great deal $9. My only complaint is the quality of the broth. I needed to add a good amount of Sriracha and lemon to get it to where I wanted which is never a good thing. Still pretty tasty nonetheless.\nOverall I would definitely come back, the meat quality was awesome and the portions were great for the price.", "rating": 4, "date": "2016-11-21"}, {"excerpts": ["I get the Pho Tai and it is always fresh, a great amount and perfectly sliced. ", "Unfortunately, there is a lot of construction on the street right now so be prepared to drive around a few times for parking."], "author": "Crystal K.", "review": "I've been coming here for years and unfortunately due to the city's ever growing prices, Pho Vietnam has had to follow suit. You pay quite a bit for a bowl of pho, but it is delicious! The brothis flavorful and unlike anything else in the city. But the quality of meat tops it off. I get the Pho Tai and it is always fresh, a great amount and perfectly sliced. Unfortunately, there is a lot of construction on the street right now so be prepared to drive around a few times for parking.", "rating": 4, "date": "2017-09-01"}, {"excerpts": ["I came down with food poisoning from a bowl of Pho Tai ", "and I'm going on 24 hours still with strong symptoms. ", "I won't be going back."], "author": "Liam M.", "review": "I've been to Pho Vietnam a handful of times and although the soup is nothing special, I've generally not had any huge complaints until recently. I came down with food poisoning from a bowl of Pho Tai and I'm going on 24 hours still with strong symptoms. I won't be going back.", "rating": 1, "date": "2017-04-06"}, {"excerpts": ["I always get the pho tai. ", "The broth and stock is essential to good pho and these guys get it right. ", "When the broth is that good you want lots of noodles to slurp up.  ", "They get that right too. ", "Loads of noodles and great thinly sliced rare beef."], "author": "Roddy M.", "review": "I love this place. Have been coming here for 10 years. Best pho in the area. I always get the pho tai. The broth and stock is essential to good pho and these guys get it right. When the broth is that good you want lots of noodles to slurp up.  They get that right too. Loads of noodles and great thinly sliced rare beef.", "rating": 5, "date": "2015-06-29"}, {"excerpts": ["The quality of the food was okay, but the prices were a little more expensive than what I'm used to -- ~$10 for a regular bowl of pho tai with added veggies.  ", "The service was also quite slow -- which is odd for a pho restaurant, and considering there was only one other customer in the restaurant.  ", "Probably not coming back."], "author": "Anna C.", "review": "The quality of the food was okay, but the prices were a little more expensive than what I'm used to -- ~$10 for a regular bowl of pho tai with added veggies.  The service was also quite slow -- which is odd for a pho restaurant, and considering there was only one other customer in the restaurant.  Probably not coming back.", "rating": 2, "date": "2010-12-18"}, {"excerpts": ["2 bowls of pho tai, waiting 25 minutes and counting.  ", "I'll stick to socal pho where it's out in 2 minutes"], "author": "Scott M.", "review": "The slowest service ever.  And I'm speaking in asian standards.  2 bowls of pho tai, waiting 25 minutes and counting.  I'll stick to socal pho where it's out in 2 minutes", "rating": 1, "date": "2015-01-01"}, {"excerpts": ["I ordered pho tai, chin, and it was super tasty. ", "I also ordered the fresh coconut and che ba mao, which is 3 color vietnamese bean dessert-yellow mung bean is my FAVORITE and they filled the cup halfway with this yellow bean-so sweet and yummy. ", "I would definitely recommend this pho restaurant to anyone craving vietnamese food! ", "I will definitely be coming back and I am happy to call this my neighborhood pho restaurant!"], "author": "CHristine J.", "review": "I am pretty picky when it comes to Vietnamese food. This place is absolutely awesome. I ordered pho tai, chin, and it was super tasty. I also ordered the fresh coconut and che ba mao, which is 3 color vietnamese bean dessert-yellow mung bean is my FAVORITE and they filled the cup halfway with this yellow bean-so sweet and yummy. I would definitely recommend this pho restaurant to anyone craving vietnamese food! I will definitely be coming back and I am happy to call this my neighborhood pho restaurant!", "rating": 4, "date": "2015-05-17"}, {"excerpts": ["(I always get pho tai). ", "I have been to several places in the city in an attempt to branch out from Pho Vietnam and I never like them as much (and I especially don't get the hype about Turtle Tower). \n", "Lastly, the owners are always the only two people working in the front of the house and are fast and friendly. ", "I come here often and they ALWAYS know my order as soon as I walk in and bring me all the specific extras I want without having to ask."], "author": "Kristina W.", "review": "Caveat: I have ONLY ever had pho here so I have no idea if the other items are good or not.\nHaving said that, I LOVE the pho at Pho Vietnam.  Being a pho fan (I always get pho tai). I have been to several places in the city in an attempt to branch out from Pho Vietnam and I never like them as much (and I especially don't get the hype about Turtle Tower). \nLastly, the owners are always the only two people working in the front of the house and are fast and friendly. I come here often and they ALWAYS know my order as soon as I walk in and bring me all the specific extras I want without having to ask.", "rating": 4, "date": "2014-01-04"}, {"excerpts": ["I ordered and noshed on the #12 (Pho Tai, Bo Vien in ", "case you're wondering) which is the pho noodle soup containing thin slices of rare steak and beef balls. ", "The noodles were clumpy, and the beef slices were thin and non-plentiful in my bowl. ", "The beef balls consisted of two balls that were cut in quad-pieces (ie, eight quad-pieces). "], "author": "Derek N.", "review": "I ordered and noshed on the #12 (Pho Tai, Bo Vien in case you're wondering) which is the pho noodle soup containing thin slices of rare steak and beef balls. The noodles were clumpy, and the beef slices were thin and non-plentiful in my bowl. The beef balls consisted of two balls that were cut in quad-pieces (ie, eight quad-pieces). The soup was just okay.\n\nI would have gone to Turtle Tower or Pho 2000 except it was pouring rain that afternoon and this place was about two blocks from an account of mine. \n\nI chose convenience over a known-commodity. When will I learn?", "rating": 3, "date": "2012-03-28"}, {"excerpts": ["So excited to find this places I would recommend the pho tai Bo vein.\n\n"], "author": "Thach N.", "review": "Not a bad place at all. Super surprised by the quality and authenticity of the soup considering it was in Polk. Will definitely b coming back! So excited to find this places I would recommend the pho tai Bo vein.\n\ntip: if u can tho, i would advise u to venture a few bblocks down to pho 2000 which has more authentic pho, but be ready for a bit of a scary walk...", "rating": 4, "date": "2013-02-12"}, {"excerpts": ["I ordered the Pho Tai and while the service was decently quick, I was disappointed by the result. ", "I found the broth to taste like it had come from instant paste, it was about the worst pho broth I have ever had (from sampling pho places across three cities). ", "Combine that with old, diseased looking basil "], "author": "Zeke K.", "review": "I know a lot of people really like this place, but I fear my experience was not so positive however.\n\nI came here with a houseguest for a dinner. I ordered the Pho Tai and while the service was decently quick, I was disappointed by the result. I found the broth to taste like it had come from instant paste, it was about the worst pho broth I have ever had (from sampling pho places across three cities). Combine that with old, diseased looking basil and I was not a huge fan. \n\nAgain a lot of people like it so give it a try, it is perfectly possible that I went on an off night for them, unfortunately I am unlikely to give them another chance with the abundance of other shops just a bit farther from my apartment.", "rating": 2, "date": "2010-09-10"}, {"excerpts": ["I ordered up the Pho Tai and was excited at the prospect of some good food.  ", "I was so disappointed at the bland broth, even after putting in my normal basil, sprouts, and chili sauce, it needed something else -- yes, flavor! "], "author": "Katie M.", "review": "In a search for some good pho, I stumbled in here for lunch one day.  I ordered up the Pho Tai and was excited at the prospect of some good food.  I was so disappointed at the bland broth, even after putting in my normal basil, sprouts, and chili sauce, it needed something else -- yes, flavor! The portions were generous, but does it count when the food is not very good?\n\nSo, I decided to give this place another chance.  I had given up on the pho, so I tried the bun -- vermicelli.  I had the grilled pork and imperial rolls over vermicelli.  The flavors were not so bad, but the noodles were way overcooked and were a soggy mess.\n\nMuch to my chagrin, I am still on the hunt for some good pho.  I guess I will be venturing into Little Saigon next...", "rating": 2, "date": "2006-08-24"}, {"excerpts": ["My pho tai came in a bowl bigger than my head, and I finished ALL of it.  ", "My noodles were a bit soft, but otherwise, this dish hit the spot for $5.95. ", "Best of all, no need to hit the TL or Chinatown anymore for a pho fix."], "author": "M A N I K.", "review": "I feared the worst. Why? Because this place is clean and in a nice part of Polk St. Could a place like this make good Vietnamese food? Yes, actually, they can.  My pho tai came in a bowl bigger than my head, and I finished ALL of it.  My noodles were a bit soft, but otherwise, this dish hit the spot for $5.95. Best of all, no need to hit the TL or Chinatown anymore for a pho fix.", "rating": 4, "date": "2006-03-16"}, {"excerpts": ["I tried the Pho Tai, my usual. ", "The soup was very flavorful and the noodles, just the right consistency.  ", "Service was fast and friendly, although they forgot my water initially.  ", "It's in a convenient and comfortable location and feels very clean.  ", "I'll be back to try the bun bo (rice noodle salad dish)  ", "That will be the true test... stay tuned!!"], "author": "Haru K.", "review": "Vietnamese food is probably my second favorite food (after Japanese food.)  And this place was pretty good.  I tried the Pho Tai, my usual. The soup was very flavorful and the noodles, just the right consistency.  Service was fast and friendly, although they forgot my water initially.  It's in a convenient and comfortable location and feels very clean.  I'll be back to try the bun bo (rice noodle salad dish)  That will be the true test... stay tuned!!", "rating": 4, "date": "2005-12-25"}, {"excerpts": ["The Pho Tai is cheap, HUGE, and is fresh and tasty.  ", "The decor could use some work (I don't think it's helping the very sweet owners attract customers - especially at night when the fluorescents are in full swing).  ", "Overall, though - great Pho if you're down for a cheap quick bowl in the Polk Gulch.  ", "One drawback is that I don't think they serve alcohol of any kind."], "author": "Jes H.", "review": "The Pho Tai is cheap, HUGE, and is fresh and tasty.  The decor could use some work (I don't think it's helping the very sweet owners attract customers - especially at night when the fluorescents are in full swing).  Overall, though - great Pho if you're down for a cheap quick bowl in the Polk Gulch.  One drawback is that I don't think they serve alcohol of any kind.", "rating": 4, "date": "2006-03-20"}, {"excerpts": ["get a large bowl of pho tai "], "author": "K K.", "review": "great cheap-o place to get your grub on and still have room to dish some more goodies in your mouth (stop laughing cuz you got a dirty mind!)\n\nfish cakes and the egg rolls are fantastic faves. get a large bowl of pho tai and it's just bliss.\n\nwell go nuts, order a bunch of stuff and share it with friends cuz it's a great, casual place without the fuss and fluff that soo many sf joints like to hype up.\n\nthis is were the real foodies come to dine!", "rating": 5, "date": "2006-10-18"}, {"excerpts": ["We ordered, the Goi Cuon (Spring rolls) for 2 and a bowl of Pho Tai (rare beef) and an order of Bun Cha Hanoi.  ", "The food took a lot longer than we anticipated.  ", "The Goi Cuon was adequate, but the bean sprouts were brownish, probably sat around for too long. ", "I took out the sprouts and ate it anyway, hate to waste food.  ", "Then came my bowl of Pho Tai, the broth was a little sweet and a bit heavy on the star anise for my taste, I would rate it a 2 out of 5, not a total disaster, but I wouldn't go back here for Pho.  ", "Next is the Bun Cha Hanoi, which is a northern specialty - grilled pork with vermicelli dish, if done the right, this dish is heaven.  ", "However, Pho Vietnam butchered this dish in a way that I've never seen or tasted before, anywhere.  ", "The broth of fish sauce was way too salty, the meat was pinkish (unrecoqnizable), they put some kind of cabbage in the broth that's too weird to describe.  ", "We tried 2 pieces of meat and left the rest alone.  ", "The older waitress came by and asked why we didn't eat, my better half flashes her a smile, then she asked if we wanted to take it home, again another smile, the waitress looked puzzled, but took our plates away.  ", "We paid our bill and left the Pho Vietnam for our intended destination, Nick's Tacos where we should have been in the first place."], "author": "Kevin T.", "review": "Cruising on Polk with the intention of going to Nick's Tacos.  We passed by a well-lighted Pho joint that I haven't seen before.  We're always looking for a good Pho place in the City.  Since we're both hungry and thought that Pho will be quick, we decided to stop.  \n\nLooking into the restaurant, we were encouraged by the number of occupied tables at around 7PM.  We ordered, the Goi Cuon (Spring rolls) for 2 and a bowl of Pho Tai (rare beef) and an order of Bun Cha Hanoi.  The food took a lot longer than we anticipated.  The Goi Cuon was adequate, but the bean sprouts were brownish, probably sat around for too long. I took out the sprouts and ate it anyway, hate to waste food.  Then came my bowl of Pho Tai, the broth was a little sweet and a bit heavy on the star anise for my taste, I would rate it a 2 out of 5, not a total disaster, but I wouldn't go back here for Pho.  Next is the Bun Cha Hanoi, which is a northern specialty - grilled pork with vermicelli dish, if done the right, this dish is heaven.  However, Pho Vietnam butchered this dish in a way that I've never seen or tasted before, anywhere.  The broth of fish sauce was way too salty, the meat was pinkish (unrecoqnizable), they put some kind of cabbage in the broth that's too weird to describe.  We tried 2 pieces of meat and left the rest alone.  The older waitress came by and asked why we didn't eat, my better half flashes her a smile, then she asked if we wanted to take it home, again another smile, the waitress looked puzzled, but took our plates away.  We paid our bill and left the Pho Vietnam for our intended destination, Nick's Tacos where we should have been in the first place.", "rating": 1, "date": "2009-08-18"}, {"excerpts": ["The broth and noodles were good, but I wasn't too sure about the beef in the pho tai.  "], "author": "N C.", "review": "Pho Vietnam serves authentic, delicious, cheap Vietnamese food.\n\nI go to Pho Vietnam not for their pho, which I've only tried once and would give 3.5.  The broth and noodles were good, but I wasn't too sure about the beef in the pho tai.  Perhaps I'll try it again when I have a hankering for pho.\n\nInstead, I've tried several other dishes (generous portions) that are delicious and upon which I base the 5-star rating.\n#6 chicken salad (goi ga):  Fresh veggies (mainly uncooked cabbage, not lettuce) with fried shallots, ground peanuts, and boiled chicken.  Add some red chili to the fish sauce (nuoc mam) and then pour that over the salad.\n#29 spicy noodle soup (bun bo hue): Thicker rice noodles, beef (I think brisket), and tendon in a spicy broth.\n#17 wonton noodle soup (mi hoanh thanh):  You get at least half a dozen wontons filled with pork.  In addition, the broth contains thin slices of pork and ground pork.\n#31 grilled shrimp over vermicelli (bun tom nuong):  Pretty generous # of shrimp over cold, thin rice vermicelli noodles.  Don't forget to pour the fish sauce (nuoc mam) over the shrimp and noodles.\n#32 pork shish-ke-bab with rice (com thit nuong):  The pork isn't really in the form of a shish-ke-bab, but that's not the point.  It is very well-seasoned in the manner that \"thit nuong\" should be.  If you feel so inclined, try ordering the fried egg with this or any other of the rice dishes that feature pork.\n\nI also like that soft drinks are served from a fountain rather than from a can, and you get a large glass.\n\nThe restaurant isn't located with most of the other Vietnamese restaurants in the heart of the Tenderloin, so I don't feel uneasy eating here at all.  Service is fast and friendly.  The decor is not anything to remark about except that it's very clean.", "rating": 5, "date": "2009-04-12"}], "pho kho dac biet": [], "mi hoanh thanh": [{"excerpts": ["#17 wonton noodle soup (mi hoanh thanh):  ", "You get at least half a dozen wontons filled with pork.  ", "In addition, the broth contains thin slices of pork and ground pork.\n"], "author": "N C.", "review": "Pho Vietnam serves authentic, delicious, cheap Vietnamese food.\n\nI go to Pho Vietnam not for their pho, which I've only tried once and would give 3.5.  The broth and noodles were good, but I wasn't too sure about the beef in the pho tai.  Perhaps I'll try it again when I have a hankering for pho.\n\nInstead, I've tried several other dishes (generous portions) that are delicious and upon which I base the 5-star rating.\n#6 chicken salad (goi ga):  Fresh veggies (mainly uncooked cabbage, not lettuce) with fried shallots, ground peanuts, and boiled chicken.  Add some red chili to the fish sauce (nuoc mam) and then pour that over the salad.\n#29 spicy noodle soup (bun bo hue): Thicker rice noodles, beef (I think brisket), and tendon in a spicy broth.\n#17 wonton noodle soup (mi hoanh thanh):  You get at least half a dozen wontons filled with pork.  In addition, the broth contains thin slices of pork and ground pork.\n#31 grilled shrimp over vermicelli (bun tom nuong):  Pretty generous # of shrimp over cold, thin rice vermicelli noodles.  Don't forget to pour the fish sauce (nuoc mam) over the shrimp and noodles.\n#32 pork shish-ke-bab with rice (com thit nuong):  The pork isn't really in the form of a shish-ke-bab, but that's not the point.  It is very well-seasoned in the manner that \"thit nuong\" should be.  If you feel so inclined, try ordering the fried egg with this or any other of the rice dishes that feature pork.\n\nI also like that soft drinks are served from a fountain rather than from a can, and you get a large glass.\n\nThe restaurant isn't located with most of the other Vietnamese restaurants in the heart of the Tenderloin, so I don't feel uneasy eating here at all.  Service is fast and friendly.  The decor is not anything to remark about except that it's very clean.", "rating": 5, "date": "2009-04-12"}], "mi bo kho": [], "mi hoi san": [], "hu tieu hai san": [], "hu tieu ca  ga": [], "hu tieu bo kho": [], "hu tieu dai ba nam sa dec": [{"excerpts": ["This wouldn't be my top choice when craving for Pho, but sometimes when I want something slightly different, like their \"Hu Tieu Dai Ba Nam Sa Dec (seafood, quail egg, slices of pork, ground pork, spare rib in a clear rice noodle soup)\"", "...this is where I go. ", "I prefer this slippery choice dry with soup on the side ", "so I can add my concoction of spicy things. ", "It can be a bit greasy, but I kinda like that sort of thing."], "author": "Helen L.", "review": "Holy MSG! I think this place probably ranks highest in aftermath thirst attacks. I can't complain though...I still enjoyed my meals. I've reviewed plenty of other places serving MSG soup, and they were less than satisfying. This wouldn't be my top choice when craving for Pho, but sometimes when I want something slightly different, like their \"Hu Tieu Dai Ba Nam Sa Dec (seafood, quail egg, slices of pork, ground pork, spare rib in a clear rice noodle soup)\"...this is where I go. I prefer this slippery choice dry with soup on the side so I can add my concoction of spicy things. It can be a bit greasy, but I kinda like that sort of thing.", "rating": 3, "date": "2010-08-23"}], "hu tieu nam vang banh pho": [], "bun thit nuong cha gio": [], "bun ga nuong ngu vi": [], "bun bo nuong": [], "banh canh tom cua": [{"excerpts": ["So instead, I ordered the Banh canh tom cua which is basically a spicy version of seafood soup. "], "author": "Jenn K.", "review": "After a long ass night I was in desperate need of some good pho. I saw that this was only a 10 min walk from where I was staying at and they had a vegetarian menu so to Pho Vietnam i went! Spacious place with lots of tables and pleasantly very clean too! \n\nUnfortunately, I didn't bother to check out their veggie menu completely bc when I got there I saw that they did not have veggie pho. So instead, I ordered the Banh canh tom cua which is basically a spicy version of seafood soup. It had mainly crab (a big ass crab claw as well) and shrimp and yummy thick noodles.\n\nPortions are good..I was only able to finish half of it but I had also ordered one shrimp roll which tasted pretty standard. I mean....you would have to really try to mess up a shrimp roll, right? Their thai tea is not sweet at all which was perfect to my taste. \n\nOh, ask for cilantro..it doesn't come with the soup :]", "rating": 4, "date": "2015-12-23"}], "bun tom nuong": [{"excerpts": ["#31 grilled shrimp over vermicelli (bun tom nuong):  ", "Pretty generous # of shrimp over cold, thin rice vermicelli noodles.  ", "Don't forget to pour the fish sauce (nuoc mam) over the shrimp and noodles.\n", "#32 pork shish-ke-bab with rice (com thit nuong):  ", "The pork isn't really in the form of a shish-ke-bab, but that's not the point.  ", "It is very well-seasoned in the manner that \"thit nuong\" should be.  "], "author": "N C.", "review": "Pho Vietnam serves authentic, delicious, cheap Vietnamese food.\n\nI go to Pho Vietnam not for their pho, which I've only tried once and would give 3.5.  The broth and noodles were good, but I wasn't too sure about the beef in the pho tai.  Perhaps I'll try it again when I have a hankering for pho.\n\nInstead, I've tried several other dishes (generous portions) that are delicious and upon which I base the 5-star rating.\n#6 chicken salad (goi ga):  Fresh veggies (mainly uncooked cabbage, not lettuce) with fried shallots, ground peanuts, and boiled chicken.  Add some red chili to the fish sauce (nuoc mam) and then pour that over the salad.\n#29 spicy noodle soup (bun bo hue): Thicker rice noodles, beef (I think brisket), and tendon in a spicy broth.\n#17 wonton noodle soup (mi hoanh thanh):  You get at least half a dozen wontons filled with pork.  In addition, the broth contains thin slices of pork and ground pork.\n#31 grilled shrimp over vermicelli (bun tom nuong):  Pretty generous # of shrimp over cold, thin rice vermicelli noodles.  Don't forget to pour the fish sauce (nuoc mam) over the shrimp and noodles.\n#32 pork shish-ke-bab with rice (com thit nuong):  The pork isn't really in the form of a shish-ke-bab, but that's not the point.  It is very well-seasoned in the manner that \"thit nuong\" should be.  If you feel so inclined, try ordering the fried egg with this or any other of the rice dishes that feature pork.\n\nI also like that soft drinks are served from a fountain rather than from a can, and you get a large glass.\n\nThe restaurant isn't located with most of the other Vietnamese restaurants in the heart of the Tenderloin, so I don't feel uneasy eating here at all.  Service is fast and friendly.  The decor is not anything to remark about except that it's very clean.", "rating": 5, "date": "2009-04-12"}], "com thit nuong bi  cho": [], "com thit nuong  cha gio": [], "com ga nuong ngu vi": [], "com ga nuong ngu vi  cha gio": [], "com bi cha trung ga chien opio": [], "com ca xao xa ot": [], "com go xao xo ot": [], "com bo xao sate dau hu": [], "com bo xao chua ngot": [], "com xao dau hu rau coi": [], "com tom xao rau cai": [], "com xao thap cam": [{"excerpts": ["The Com Xao Thap Cam was nearly barely edible. ", "Every piece of protein (beef, chicken, shrimp, calamari) was tough, dry and tasteless, as if it was prepped in the morning or the day before. ", "This dish besides the noodles and vegetables was not prepared in the timeframe my order was taken. ", "Most of what was ordered was left on the table."], "author": "M m.", "review": "Absolutely my worst meal ever in SF. I'm a personal Chef specializing in Japanese and Italian cuisine and this meal was quite disappointing. The Beef Pho had processed roast beef in it. Absolutely atrocious. With all the great Ramen in this town, I'm shocked this place is still open. Mere Chicken broth out of a can and noodles compares. The Com Xao Thap Cam was nearly barely edible. Every piece of protein (beef, chicken, shrimp, calamari) was tough, dry and tasteless, as if it was prepped in the morning or the day before. This dish besides the noodles and vegetables was not prepared in the timeframe my order was taken. Most of what was ordered was left on the table.", "rating": 1, "date": "2016-10-15"}], "nem nuong cuon": [{"excerpts": ["I ordered Pork with fresh spring roll (Nem Nuong Cuon). "], "author": "Roger A.", "review": "I came here with intentions of getting my fresh spring roll cravings taken cared of.\n\nthe place is spacious, but also on a busy street, I parked around the block at the parking garage.\n\nthe place is decently big and good size tables.\n\nI ordered Pork with fresh spring roll (Nem Nuong Cuon). I took a good 10 minutes.\n\n2 rolls for about $9.\n\nIt was what I expected and good!", "rating": 4, "date": "2018-01-12"}], "canh go chien don": [], "bun cha ha noi": [], "mi toi tom": [], "ca tim dau hu": [], "com chien thap cam": [], "pho chay": [{"excerpts": ["I was happy to find very tasty vegan pho (pho chay) at this restaurant. ", "The portion was nice and large and the service was good."], "author": "Carina B.", "review": "I was happy to find very tasty vegan pho (pho chay) at this restaurant. The portion was nice and large and the service was good.", "rating": 4, "date": "2018-05-29"}, {"excerpts": ["I always get the pho chay and a pot of green tea.  ", "They don't give me any odd looks when I ask them to leave out the cabbage.  ", "I heart this place."], "author": "Catherine G.", "review": "Sure, I've had better pho back in 'Nam, but I've gone to this place so often that their pho itself has become its own entity and my comfort food.  I crave it when its cold, when I'm sick, when I'm tired, stressed...ok, or even just hungry.  When I come here by myself, the servers are nicer and will chat with me.  There's a very grandmotherly little woman there who I LOVE to pieces.  \n\nI always get the pho chay and a pot of green tea.  They don't give me any odd looks when I ask them to leave out the cabbage.  I heart this place.", "rating": 4, "date": "2008-04-20"}], "mi xao chay": [], "cha gio chay": [], "dia tai rieng": [], "chen bo vien": [{"excerpts": ["He also went for the small $3.50 bowl of Beef Ball Soup (Chen Bo Vien) but couldn't quite get over the rubbery texture of the balls for reasons that were all too clear (see photo). ", "So I was the one that went for the pho, the big $8.25 bowl of Pho Dac Biet with all the meat fit to eat - the rare steak, the well done flank, the brisket, the tendon, the tripe and the beef balls (yes, me too...) ", "And of course, it came with the thin vermicelli noodles, the snap-ready bean sprouts, the basil, the lemon wedges, and the pepper slices (see photo). ", "Everything was there that you would expect from a combo bowl of pho, but the beef broth was just too diluted to lend any flavor impact. ", "That was the most disappointing aspect to my dish, and uncharacteristically, I left most of the broth in my bowl. ", "Oh well, it was worth a shot. "], "author": "Ed U.", "review": "I'd walk a mile for a good bowl of pho, but even more adventurously, I'd take my life in my hands and take the 19 through the 'Loin if that was the goal. In this case, Jamie W. and I just took the California Street cable car over Nob Hill and jumped off at Polk to get here. Thank goodness, as the pho at Pho Vietnam is merely decent. What makes the difference between great and middling pho is the broth. Turtle Tower, at least the original one on Larkin, does it right, while others not so much. I'd put this pho in the middle of the pack. Good enough to slurp but not enough to remember for a return visit.\n\nPart of the problem is that the waitress refuses to crack a smile here. Not sure why the frown, but it made us feel like we were being sent to our room for our supper. Things started on a promising note with the $3 half order of the Vietnamese Spring Rolls (Goi Cuon) which were crispy-fresh with the standard combo of shrimp, lettuce and vermicelli noodles accompanied by a thick, dark peanut sauce (see photo). What was weird was that I thought I ordered the full portion for the both of us to share, but we let is pass since more food was coming. Jamie felt he took a wrong turn with an order of the $8.75 Grilled Pork with Imperial Rolls (Com Thit Nuong, 3 Cha Gio), which turned out to be blandly generic in flavor and execution (see photo).\n\nHe also went for the small $3.50 bowl of Beef Ball Soup (Chen Bo Vien) but couldn't quite get over the rubbery texture of the balls for reasons that were all too clear (see photo). So I was the one that went for the pho, the big $8.25 bowl of Pho Dac Biet with all the meat fit to eat - the rare steak, the well done flank, the brisket, the tendon, the tripe and the beef balls (yes, me too...) And of course, it came with the thin vermicelli noodles, the snap-ready bean sprouts, the basil, the lemon wedges, and the pepper slices (see photo). Everything was there that you would expect from a combo bowl of pho, but the beef broth was just too diluted to lend any flavor impact. That was the most disappointing aspect to my dish, and uncharacteristically, I left most of the broth in my bowl. Oh well, it was worth a shot. And please smile, will ya?\n\nFOOD - 3 stars...middling Vietnamese fare would put it somewhere near the DMZ, wouldn't it?\nAMBIANCE - 3 stars...large, sunny space but...\nSERVICE - 2 stars...unhappy, unsunny people serve here\nTOTAL - 3 stars...I'd walk a mile for good pho, so I better keep walking to Little Saigon", "rating": 3, "date": "2011-12-20"}], "chen com trang": [], "chuoi chien": [], "kem chien": [], "cafe sua da": [{"excerpts": ["The Cafe Sua Da (iced Vietnamese coffee with condensed milk) is a must order and great for the asian-kopi-missing souls. \n", "I had a piping bowl of Pho with beef slices and brisket which was tasty and pretty authentic. ", "You could ask for fish sauce and lightly dip the beef slices in for an extra umami kick."], "author": "Yizhi A.", "review": "The Cafe Sua Da (iced Vietnamese coffee with condensed milk) is a must order and great for the asian-kopi-missing souls. \nI had a piping bowl of Pho with beef slices and brisket which was tasty and pretty authentic. You could ask for fish sauce and lightly dip the beef slices in for an extra umami kick.", "rating": 4, "date": "2016-08-27"}, {"excerpts": ["Try the cafe sua da.  ", "Delicious."], "author": "lauralee s.", "review": "Okay, so I didn't try the Pho.  The only place I've ever liked it is Vietnam, so after reading all the reviews about bad vietnamese food in San Francisco I thought I should go with my favorite and have the bun.  It was delicious and filling.  The ingrediants were fresh and it was served by the cutest, kindest old lady.  The noodles verged on over done, which is the reason for the three stars, but when I go back and try the pho, it could very well change to four stars.   Try the cafe sua da.  Delicious.", "rating": 3, "date": "2008-05-26"}], "cafe sua nong": [], "cafe da": [], "cafe nong": [], "sua dau nanh": [], "soda xi muoi": [], "che  mau": [], "nuoc dua tuoi": [], "do chanh": [], "tra hong kong": [], "tra thai": [{"excerpts": ["Tra thai should be made to order not ahead of time and sitting in refrigeration.\n\n"], "author": "Estiff S.", "review": "+2 Stars for #1 fresh spring rolls\n\nTra thai should be made to order not ahead of time and sitting in refrigeration.\n\nQuite disappointed with over priced #31 dry mealy clearly over cooked well ahead of my order shrimp.\n\nOther order was #13 pho tai a staple with good broth and plenty of bef mystery meat in the soup.\n\nCmon people staple pho should be spot on every time.\n\nThen my buddy gets an upset stomach from #13 Pho Tai.\n\nNot going back.", "rating": 2, "date": "2017-08-18"}], "soda sua hot ga": [], "nuoc ngot": [], "tra da": []}