{"cha gio": [{"excerpts": ["I also have some love for the bun thit nuong cha gio, otherwise known as vermacelli with pork chop and spring rolls. "], "author": "Jando S.", "review": "I really had higher hopes for Pho Huynh Hiep 2 aka Kevin's Noodle House. San Francisco has never really been known for its Vietnamese food and it's place like this that prove the notion to be true. Most of all I've sampled here in some way remind me of the Vietnamese fare back home in NYC. which is not a good thing. Hence, 3.5 stars rounded down is the best I can do for now.\n\nLike most Vietnamese spots that specialize in noodles and soups, pho is a natural benchmark to go on. Only problem is, the broth is mad bland. I've had my fair share of pho tai and pho tai chin / nam bowls here, all priced accordingly at less than $7 each but either its loaded with MSG (likely) and / or prepped with subpar seasoning (also likely). In the unlikelihood its just bad luck, I still haven't mustered a decent bowl of pho here just yet.\n\nThe other noodle soups, like bun rieu, hu tieu, and bun bo hue  or even mi hai son (seafod) are also low on the Viet totem pole of deliciousness. The broth in all need some work. From a noodle standpoint, the consistency is there, but the broth is one essential that locks everything in place; an equalizer of sorts. It's just not there and that strikes out a sizeable portion of the menu. \n\nRice plates have fared better, which is their saving grace. Their meaty combo platter - com suon lap xuong tau hu ky (aka Chinese sausage, pork chop, and shrimp cake) is a mean dish, especially when doused with a tangy but sweet nuoc mam fish sauce. I also have some love for the bun thit nuong cha gio, otherwise known as vermacelli with pork chop and spring rolls. It's got a lot of textures going on, served in a decent portion if I've ever seen one.\n\nWhile there are some Viet servers, let us not forget this is The Richmond area. Most everyone will be Chino, which includes lots of the wait staff. They're not the friendliest bunch, so make sure you've got your orders straight before they ask (unhappily) again.", "rating": 3, "date": "2014-03-11"}, {"excerpts": ["For the Appetizers I have had the Goi Cuon and Cha Gio. ", "Goi Cuon is pretty standard, but I think each roll is lacking in one half of a shrimp. ", "Their peanut sauce tastes heavy in peanut and is thick. ", "I think they should add pickled carrots and radishes in their peanut sauce. ", "Im not a fan of their Cha Gio for how its made. "], "author": "Bill L.", "review": "This is one of the better Vietnamese Restaurants I have gone to. They have somewhat attentive staff and serve pretty decent food.I love Vietnamese food and this restaurant is probably up there compared to the ones I have tried. \n\nAt Vietnamese restaurants I will almost always order a rice plate unless its a cold day. If its a cold day I would order something Pho related. I've had multiple rice plates of theirs and my favorite would probably be Com Bo Nuong. The Beef is cooked well and has nice flavors all throughout. Something I don't really like would be their fish sauce. The flavors are not of equal balance and I taste more spicy than I do of anything else. For soups I would get Mi Hai San which consists of seafood. They give a fair amount of meats in this dish but I think it can be slightly more. I love Egg Noodles when it comes to soup and that's why I order it instead of   other kinds. For the Appetizers I have had the Goi Cuon and Cha Gio. Goi Cuon is pretty standard, but I think each roll is lacking in one half of a shrimp. Their peanut sauce tastes heavy in peanut and is thick. I think they should add pickled carrots and radishes in their peanut sauce. Im not a fan of their Cha Gio for how its made. It looks like a normal chinese egg roll and does not look appetizing.\n\nOverall this restaurant has good flavors and I would recommend going here. The staff can sometimes rush you but it isn't that bad. The food also comes in decent portions even though I think it can be just a small bit more. Presentation and atmosphere is standard and nice as well.", "rating": 4, "date": "2017-04-16"}, {"excerpts": ["Cha Gio which is deep fried vietnamese egg rolls taro, clear vermicelli, pork, shrimp ....really good...and nice dipping sauce.\n\n"], "author": "David G.", "review": "Pho Huynh Hiep 2 ( I did not know there was a 1???) is one banging pho house....and so much more.\n\nThank you Yelp for steering me to this great little resto.\n\nWe ordered the Pho Ga Xe Lua  (aka bonless chicken soup with noodles)...that shit was really fly...medium order is huge. Plop in the basil, lime, bean sprouts, and jalapeno pepers....add a dash of fish sauce......best pho I have had in a long time.\n\nThe broth is really flavorful, deep , and tasty.\n\nOrdered two apps:\n\n\nCha Gio which is deep fried vietnamese egg rolls taro, clear vermicelli, pork, shrimp ....really good...and nice dipping sauce.\n\nGoi Cuon which is another roll consisting of shrimp, pork, lettuce, vermicelli wrapped in soft rice pepper ....did not care for as much but the sauce which was thicker with peanuts was AWESOME.\n\nFor three people 2 med chicken pho, 1 small chicken pho and the apps.....35 bucks including tip....this place is awesome.\n\nkiem tra xem nó ra", "rating": 4, "date": "2013-04-12"}, {"excerpts": ["pho tai and hu tieu nam vang with cha gio. ", "a bit disappointing since the fried egg rolls were lacking enough meat and noodles clumped. ", "broth light on pho, ", "ok on hu tieu and thirsty after. ", "fast but not that good as the total reviews portray"], "author": "Rob C.", "review": "pho tai and hu tieu nam vang with cha gio. a bit disappointing since the fried egg rolls were lacking enough meat and noodles clumped. broth light on pho, ok on hu tieu and thirsty after. fast but not that good as the total reviews portray", "rating": 3, "date": "2015-12-13"}, {"excerpts": ["The cha gio was an upset , pretty much just sat on our plate. ", "I can make ten times better and that's exactly what the kids said. ", "So don't get that.  \n", "Will I be back. ", "Never. ", "Fellow Sanfranscian  Yelpers, I have to think twice before checking out these spots. ", "Where do I find good Westminster food in SanFran? ", "(hmm...did i just answer my own question?)Maybe someone can help...\n", "is wasn't worth the effort to park and the total bill was reasonable but ", "it just wsn't good. ", "it felt like the broth was broth, not beef stock...", "and yes there is a difference. ", "ANd another weird thing the server asked me was did i want chicken broth or beef broth...? ", "huh? ", "i was a bit dumbfounded for a moment. ", "We do get BEEF broth with pho  correct?(unless its chicken pho)  ", "is what i should have said..."], "author": "Mrs H.", "review": "Ugh... The parking in San Fran is driving me bonkers... I hate parking here... It's worse than LA. \nWell. So I figured all the good Asian food must be out of Chinatown since I couldn't find any there. Came all the way out here after a long day of walking. \nAll I can say is... Everyone who loves this place hasn't been to Westminster to eat pho in LA. \nSo it's not the greatest and I left feeling disappointed since reviews were so high. We had ordered a large plain noodles pho just for kids and the amount of noodles was basically a med just in a larger bowl. Ok. The pho dac biet in medium size was fair in price but just lacked flavor in the broth. The cha gio was an upset , pretty much just sat on our plate. I can make ten times better and that's exactly what the kids said. So don't get that.  \nWill I be back. Never. Fellow Sanfranscian  Yelpers, I have to think twice before checking out these spots. Where do I find good Westminster food in SanFran? (hmm...did i just answer my own question?)Maybe someone can help...\nis wasn't worth the effort to park and the total bill was reasonable but it just wsn't good. it felt like the broth was broth, not beef stock...and yes there is a difference. ANd another weird thing the server asked me was did i want chicken broth or beef broth...? huh? i was a bit dumbfounded for a moment. We do get BEEF broth with pho  correct?(unless its chicken pho)  is what i should have said...", "rating": 2, "date": "2012-10-22"}, {"excerpts": ["I ordered the cha gio and it was quite mediocre, tho correctly served with lettuce to wrap around it.\n\n"], "author": "Duy L.", "review": "I ordered the cha gio and it was quite mediocre, tho correctly served with lettuce to wrap around it.\n\nI had the Pho Tai Gau (small) and it was good, though nothing to rave about.\n\nA day after, I had terrible stomach pains and I can only suspect this meal =(", "rating": 3, "date": "2009-04-07"}], "goi cuon": [{"excerpts": ["the spring rolls (goi cuon), which my fiancé usually doesn't go for even in the South Bay, are fresh and delicious here. ", "The consistency when you bite into them is just perfect. ", "Probably because they are made to order, with good quality rice paper and fresh shrimp and veggies. "], "author": "Kate V.", "review": "Pho Huynh Hiep did the impossible: got my Vietnamese fiancé, who grew up near San Jose (where a plethora of good Vietnamese food is abundantly available), to find a bowl of pho in San Francisco that he actually likes. I'm basically writing this review on his behalf, since he doesn't really write Yelp reviews anymore. Hi, Michael N.!\n\nUp until we recently came here together, my fiancé had been underwhelmed, disappointed, disgusted, disgruntled, or all of the above with every pho restaurant he had ever tried in the city. This includes Pho Ha Tien (he will never, ever go back), Evergreen Restaurant (convenient to our place but just ok), Mau (overpriced hipster pho, though he thinks the other items are good), Good Noodle/old Pho Clement (nothing special), and Turtle Tower (yes, he even turns his nose up at Turtle Tower!). \n\nAt Pho Huynh Hiep, he's a big fan of the broth, which is the most difficult ingredient in pho to win his approval. The cuts of beef in the soup are good quality, and the noodles are fine. And he appreciates that \"small\" sizes are available (\"People from Vietnam think it's weird how our bowls of pho in the U.S. are so big\").\n\nParking is not always the greatest in this part of the Sunset, but during the weeknights it's not so bad. The restaurant is pretty spacious, and the longest we've ever waited for a seat is 5 minutes.\n\nSide note to the pho: the spring rolls (goi cuon), which my fiancé usually doesn't go for even in the South Bay, are fresh and delicious here. The consistency when you bite into them is just perfect. Probably because they are made to order, with good quality rice paper and fresh shrimp and veggies. We always order them as an appetizer now. \n\nIt is likely that Pho Huynh Hiep is the only place in SF we will ever eat pho again (I mean, we HAVE been there 4 times in the past month). And I am totally ok with that!", "rating": 5, "date": "2015-08-31"}, {"excerpts": ["For the Appetizers I have had the Goi Cuon and Cha Gio. ", "Goi Cuon is pretty standard, but I think each roll is lacking in one half of a shrimp. ", "Their peanut sauce tastes heavy in peanut and is thick. ", "I think they should add pickled carrots and radishes in their peanut sauce. ", "Im not a fan of their Cha Gio for how its made. "], "author": "Bill L.", "review": "This is one of the better Vietnamese Restaurants I have gone to. They have somewhat attentive staff and serve pretty decent food.I love Vietnamese food and this restaurant is probably up there compared to the ones I have tried. \n\nAt Vietnamese restaurants I will almost always order a rice plate unless its a cold day. If its a cold day I would order something Pho related. I've had multiple rice plates of theirs and my favorite would probably be Com Bo Nuong. The Beef is cooked well and has nice flavors all throughout. Something I don't really like would be their fish sauce. The flavors are not of equal balance and I taste more spicy than I do of anything else. For soups I would get Mi Hai San which consists of seafood. They give a fair amount of meats in this dish but I think it can be slightly more. I love Egg Noodles when it comes to soup and that's why I order it instead of   other kinds. For the Appetizers I have had the Goi Cuon and Cha Gio. Goi Cuon is pretty standard, but I think each roll is lacking in one half of a shrimp. Their peanut sauce tastes heavy in peanut and is thick. I think they should add pickled carrots and radishes in their peanut sauce. Im not a fan of their Cha Gio for how its made. It looks like a normal chinese egg roll and does not look appetizing.\n\nOverall this restaurant has good flavors and I would recommend going here. The staff can sometimes rush you but it isn't that bad. The food also comes in decent portions even though I think it can be just a small bit more. Presentation and atmosphere is standard and nice as well.", "rating": 4, "date": "2017-04-16"}, {"excerpts": ["Goi Cuon which is another roll consisting of shrimp, pork, lettuce, vermicelli wrapped in soft rice pepper ....did not care for as much but the sauce which was thicker with peanuts was AWESOME.\n\n"], "author": "David G.", "review": "Pho Huynh Hiep 2 ( I did not know there was a 1???) is one banging pho house....and so much more.\n\nThank you Yelp for steering me to this great little resto.\n\nWe ordered the Pho Ga Xe Lua  (aka bonless chicken soup with noodles)...that shit was really fly...medium order is huge. Plop in the basil, lime, bean sprouts, and jalapeno pepers....add a dash of fish sauce......best pho I have had in a long time.\n\nThe broth is really flavorful, deep , and tasty.\n\nOrdered two apps:\n\n\nCha Gio which is deep fried vietnamese egg rolls taro, clear vermicelli, pork, shrimp ....really good...and nice dipping sauce.\n\nGoi Cuon which is another roll consisting of shrimp, pork, lettuce, vermicelli wrapped in soft rice pepper ....did not care for as much but the sauce which was thicker with peanuts was AWESOME.\n\nFor three people 2 med chicken pho, 1 small chicken pho and the apps.....35 bucks including tip....this place is awesome.\n\nkiem tra xem nó ra", "rating": 4, "date": "2013-04-12"}], "bi coun": [], "canh ga chien bo": [], "cha ca chien": [], "tau hu ky": [{"excerpts": ["Tau Hu Ky/Fried Shrimp Cakes - Great appetizer! \n\n"], "author": "Chelsea W.", "review": "Amazing broth! I came here under the recommendation that this is the best place for pho in SF and it definitely lived up to the hype in my opinion.\n\nThe menu is very extensive, you'll basically find all the variations of noodle soup, vermicelli and rice bowls on the menu. They even have a section for boba and smoothies. Prices are pretty inexpensive too, around $7 for small, $8 for medium and $9 for large. Food comes out almost immediately after you order. \n\nThe restaurant is pretty large and has plenty of tables so it'd be easy to come in bigger groups. Service is pretty efficient and fast.\n\n#A6 - Tau Hu Ky/Fried Shrimp Cakes - Great appetizer! \n\n#22B Pho Ga Tom - Boneless chicken & shrimp rice noodle soup. The broth was super addicting, it definitely stands out compared to a lot of other pho I've tried in SF. Chicken was very aromatic and flavorful, but I would have liked if there were more than 2 pieces of shrimp.. didn't feel like this justified the extra $1 compared to just having the chicken noodle soup. My main criticism was that the noodles were slightly overcooked and stuck together. Perhaps this was because we came pretty late in the afternoon, around 3 PM and the cooks were just finishing up the lunch batch. (Update: The noodles had a much better consistency when I came the second time around!)\n\nGrilled Chicken & Shrimp Vermicelli - Forgot which number this was, but the second time around I decided to go in on the vermicelli and it was very worthwhile. I personally liked the vermicelli over the noodle soup.\n\nOverall I feel like for the standard Viet dishes you'd find at any restaurant you can't really go wrong here!", "rating": 4, "date": "2017-08-13"}, {"excerpts": ["I LOVE the Tau Hu Ky  from this place (fried shrimp wrapped in crispy bean curd skin). ", "It's kind of hard for restaurants to distinct their tau "], "author": "Tram N.", "review": "Being Vietnamese and spoiled with my Mom's homecooking makes it hard for any Pho restaurant to please me. I'm glad to say that both my experiences with Kevin's Noodle House was pretty good :) \n\n(+) Rice plate. The Com Tam dish was extra filling and delicious. I LOVE the Tau Hu Ky  from this place (fried shrimp wrapped in crispy bean curd skin). It's kind of hard for restaurants to distinct their tau hu ky from each other because it's very simple to make so Kevin's did a great job and making an impression on me with their com tam plate. \n\n(+) Seafood Hu Tieu . The second time I came to Kevin's was on a very windy and cold day so their noodle soup hit the spot. I'm really not a Pho person (probably because I don't eat meat but I'm also just sick of it). The broth for the Hu Tieu was on point, not watered down like many other places where you cannot even distinct the different broths from each other. The portion was just right for a large !\n\nPrices for KNH is pretty decent for the quality of the food. I've had worst food for a ridiculous price so I as pretty happy. Expect to wait a long time if you come with a large group or at the wrong hour. The place isn't that big but the service is pretty fast!", "rating": 5, "date": "2014-02-18"}], "dac biet xe lua": [{"excerpts": ["my friends also rave about the Dac Biet Xe Lua ", "but I'm not a tripe fan. ", "the broth is perfect, just the right amount of savory without the bubble of fat floating around like some places, plenty of vegetables, and huge portions. "], "author": "Mike V.", "review": "Usually my favorite pho in the city and a good price (granted, you are driving out to the Sunset). Always get the pho tai, or the pho tai gau (steak and brisket). my friends also rave about the Dac Biet Xe Lua but I'm not a tripe fan. the broth is perfect, just the right amount of savory without the bubble of fat floating around like some places, plenty of vegetables, and huge portions. plus, even when there is a line of 5 or 6 couples, they seem to have you seated within 5-10 minutes. \n\nThe only knock on this place is the rare beef comes already in the bowl and can be pretty well cooked by the time it gets to your table. if you like your pho tai on the rarer side, then you should try to ask them to deliver the meat on the side and uncooked.", "rating": 4, "date": "2017-01-11"}, {"excerpts": ["I ordered a medium dac biet bo vien and he ordered the dac biet xe lua. ", "The noodles and broth were fantastic. ", "Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles.", "Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles."], "author": "Lily H.", "review": "I jokingly asked my boyfriend (whose name is Kevin) if he opened a pho restaurant when we saw this place for the first time and even though we were only in the city for a night, he immediately wanted us to try this place out for breakfast/lunch the next morning.\n\nI'm going to say this place definitely lives up to its hype. I ordered a medium dac biet bo vien and he ordered the dac biet xe lua. The noodles and broth were fantastic. Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles.", "rating": 4, "date": "2017-01-12"}], "dac biet bo vien": [{"excerpts": ["I ordered the small Pho Dac Biet Bo Vien, the combo pho with beef balls (an extra $1.25 for the beef balls) ", "options include small, medium, and large. ", "This was served within 5-10 minutes (wow!) and the bowl admittedly was small, but given the alternate options and relatively cheap price, the portion seemed to make sense. ", "Due to the size of the bowl, there was less soup though ", "seemingly a lot of everything else. ", "The consistency of the noodles was perfect and the meat was standard and aplenty. ", "My main complaint was the soup tasted as if they relied a little bit too much on MSG for flavor, and was quite salty. "], "author": "Vivian L.", "review": "Came here on a Tuesday night after struggling to find parking. There was a good amount of people, though luckily the restaurant has plenty of seating and we were immediately seated. The restaurant has this lovely authentic aroma of pho and the workers are also truly Vietnamese, which was a relief among the many unauthentic hipster pho places in San Francisco.\n\nI ordered the small Pho Dac Biet Bo Vien, the combo pho with beef balls (an extra $1.25 for the beef balls) options include small, medium, and large. This was served within 5-10 minutes (wow!) and the bowl admittedly was small, but given the alternate options and relatively cheap price, the portion seemed to make sense. Due to the size of the bowl, there was less soup though seemingly a lot of everything else. The consistency of the noodles was perfect and the meat was standard and aplenty. My main complaint was the soup tasted as if they relied a little bit too much on MSG for flavor, and was quite salty. I was not that hungry to begin with, but the small size honestly was pretty small and I realized at the end that there was quite less noodles than I had thought. \n\nMy boyfriend got the same dish but the large size and agreed the portion sizes were not the greatest. Particular he noted that his bowl, while significantly larger than mine, was mostly just soup and not enough noodles. He thought the meat was dry and bland, and that the soup could be more rich and flavorful.\n\nOverall: Not my favorite pho joint, but not bad.", "rating": 3, "date": "2016-11-09"}, {"excerpts": ["I ordered a medium dac biet bo vien and he ordered the dac biet xe lua. ", "The noodles and broth were fantastic. ", "Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles.", "Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles."], "author": "Lily H.", "review": "I jokingly asked my boyfriend (whose name is Kevin) if he opened a pho restaurant when we saw this place for the first time and even though we were only in the city for a night, he immediately wanted us to try this place out for breakfast/lunch the next morning.\n\nI'm going to say this place definitely lives up to its hype. I ordered a medium dac biet bo vien and he ordered the dac biet xe lua. The noodles and broth were fantastic. Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles.", "rating": 4, "date": "2017-01-12"}, {"excerpts": ["My boyfriend got the dac biet bo vien with steak on the side and was very pleasantly surprised at how good it was. \n\n"], "author": "Melissa C.", "review": "The service here is very fast. There were at least 20 peole ahead of us and our wait was still only about 15 mins. Food came out within 10 mins of ordering.\n\nI got the pho ga tom, it was a little more oily than what I'm used to and the pho had more of a pure chicken flavor with no hint of any other spices. Despite those factors it was still good and my soup cravings were satisfied. If wanting something a little less straight forward stick with actual pho.\n\nMy boyfriend got the dac biet bo vien with steak on the side and was very pleasantly surprised at how good it was. \n\nSpring rolls were \"meh\" for me seeing as I felt they didn't taste very fresh.\n\nFour stars mainly because it's the most satisfying bowl of pho my boyfriend (the ex connoisseur) has had outside of San Jose so definitely recommended if you're in the city!", "rating": 4, "date": "2015-11-17"}, {"excerpts": ["Had the pho dac biet bo vien.  ", "It comes with steak, well-done brisket, flank, tendon, and beef ball.  ", "The broth is pretty good and the noodles weren't bad. \n", "The spring rolls were questionable though.  ", "The vegetables inside it seemed like they were sitting out and wilted and the shrimp was really fishy."], "author": "Heejin L.", "review": "3.5 \nPretty good pho. \nHad the pho dac biet bo vien.  It comes with steak, well-done brisket, flank, tendon, and beef ball.  The broth is pretty good and the noodles weren't bad. \nThe spring rolls were questionable though.  The vegetables inside it seemed like they were sitting out and wilted and the shrimp was really fishy.", "rating": 3, "date": "2014-04-02"}, {"excerpts": ["(I usually get the Dac Biet Bo Vien (#2?) or #1 (x large)).  "], "author": "Max L.", "review": "I've been here way too many times to count.  Really good price point for some pretty tasty pho (I usually get the Dac Biet Bo Vien (#2?) or #1 (x large)).  I've also tried the beef stewed noodles and they were pretty tasty.  \n\nThe fried chicken wings are kinda meh (not super crispy, kinda grease soaked), but the spring rolls are solid, and the rice dishes are pretty good too.  They also make a pretty good Vietnamese coffee and Thai ice tea.\n\nAs expected with this kind of food, super fast service!  We usually get our noodles about 5 minutes after ordering.", "rating": 4, "date": "2013-09-01"}, {"excerpts": ["My boyfriend ordered a large 'Dac Biet Bo Vien' ($8.25) pho, which was HUGE (seriously massive! ", "but my 6'4\" bf loved it so much he said he could have eaten 3 bowls) and full of all sorts of beef & beef derivatives. "], "author": "Kaden F.", "review": "4 stars for low prices + high quality. \n\nI don't know why, but it's a rare day that I'm in the mood for vietnamese food...luckily today was that day, & I used the fact that I had to move my car as an excuse to drive out to the sunset for some PHO! \n\nBut when it came down to it, I actually didn't order the pho, I got the beef stew with wide rice noodle. \n\nAnd I'm so glad I did. \n\nI ordered a small bowl ($5.75),  which was more than enough for me (mind you I don't always have the biggest appetite) & I left with enough leftovers for lunch tomorrow. \n \nThe stew had a very mild sweetness to it and did not skimp when it came to the chunks of beef. Very full flavored and after a couple spoonfuls of chili oil, I found it had a nice kick to it. \n\nMy boyfriend ordered a large 'Dac Biet Bo Vien' ($8.25) pho, which was HUGE (seriously massive! but my 6'4\" bf loved it so much he said he could have eaten 3 bowls) and full of all sorts of beef & beef derivatives. He was super happy with his order, as evidenced by the fact that he ate it ALL. \n\nI'm not the biggest pho fan, and I found the broth to have a strong beefy flavor, which was a little heavy for my taste, but I think that's a matter or personal preference. Luckily, I preferred my beef stew to the pho my bf ordered, and he preferred his pho to my stew. \n\nThe restaurant had a somewhat sparse feel to it, a big room with lots of tables & a few paintings (with a distinctly 'asian' theme) lining the walls, but the place was full & lively. Very low-key and casual, which I had no problem with. The service was EXTREMELY quick...I'd say it was a 3 or 5 minute wait between ordering and getting our food. Kudos for the fact that one of the waitresses was able to let me know whether or not the beef stew had any sort of shellfish in it (allergy), which is sometimes a bit more complicated to figure out. \n\nConsidering the price, quantity, flavor & expediency, this place definitely earned 4 stars in my book. Great for a foggy evening out in Inner Sunset!", "rating": 4, "date": "2013-07-09"}, {"excerpts": ["Had a medium bowl, Dac Biet Bo Vien, Combination beef with beef balls. ", "Very good. ", "Lots of noodles, meat and had a good aroma. ", "Service was attentive, the place is clean, well lit and spacious. "], "author": "Phuoc K.", "review": "Good solid Pho. Had a medium bowl, Dac Biet Bo Vien, Combination beef with beef balls. Very good. Lots of noodles, meat and had a good aroma. Service was attentive, the place is clean, well lit and spacious. Not something you can say about all vietnamese joints. \n\nPrices I noticed were also pretty good. I think my medium bowl, which was a very decent size was only $6 I think. Definitely a good stop for a cold day.", "rating": 4, "date": "2011-11-29"}], "dac biet": [{"excerpts": ["My boyfriend and I ordered two large number 2 which is just pho dac biet with meatballs and it came out to be less than $23 which is a steal in my opinion because the bowls were hella large. ", "TRUST ME when I say this because a large will definitely fill you up!! "], "author": "Quynh L.", "review": "My boyfriend and I had pho here two nights in a row.... I guess you can say we love it here. The line can get pretty long but they work extremely fast! \n\nThe prices are super good considering the size of the bowl. They offer three sizes for most of the pho options. My boyfriend and I ordered two large number 2 which is just pho dac biet with meatballs and it came out to be less than $23 which is a steal in my opinion because the bowls were hella large. TRUST ME when I say this because a large will definitely fill you up!! The broth taste amazing and the service is great.\n\nThis is my first Vietnamese restaurant here in San Francisco and I will definitely be coming back for a quick meal.", "rating": 5, "date": "2018-10-12"}, {"excerpts": ["The service here was fast and out came what I always get a Large Dac Biet.  ", "I enjoyed the broth (still needed some Hoison sauce) and they gave a fair amount of meat as well. ", "I can see why this place is so popular and give the taste and price point ", "I can say that I'd go here again ", "but I wouldn't say that this place is amazing either.\n", "The world needs a SF Bay Area Pho Rankings..."], "author": "Rod M.", "review": "With all these Ramen spots I've been visiting recently I just had to get a bowl of Pho somewhere (but took it easy on the noodles since I'm trying to cut down on carbs these days). The service here was fast and out came what I always get a Large Dac Biet.  I enjoyed the broth (still needed some Hoison sauce) and they gave a fair amount of meat as well. I can see why this place is so popular and give the taste and price point I can say that I'd go here again but I wouldn't say that this place is amazing either.\nThe world needs a SF Bay Area Pho Rankings...so I'm here to provide my humble list/rankings.\n\nRanking explained:  #1 (listed at the top)  is my favorite/ #?  (listed at the bottom) is my least favorite. Check out my latest reviews for my latest up to date Rankings. \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. If you're curious, I have rankings for Boba, Bakeries and Ramen , Chicken and Waffles as well (random right?)  Follow my profile to see my most recent reviews.  I hope I can be helpful since so many Yelpers have helped me discover new places. \nRod's Pho Rankings for SF Bay Area:\n\n1 Ly's Vietnamese Cuisine\n2 Turtle Tower\n3 Rang Dong Restaurant\n4 Golden Star Vietnamese Restaurant\n5 Pho Huynh Hiep 2 - Kevin's Noodle House\n6 R&D Café\n7 Mai's Kitchen\n8 Noodles Pho Me\n9 Chopsticks Pho & Grill\n10 Rice and Spoon Vietnamese Cuisine\n11 Pho VN Vietnamese Restaruant\n12 Pho 2000\n13 Pho Vi Hoa\n14 Bistro Viet House\n15 Pho Ty II\n16 Pho Pasteur\n17 Kim Huong\n18 Pho 99", "rating": 4, "date": "2017-12-18"}, {"excerpts": ["my friends also rave about the Dac Biet Xe Lua ", "but I'm not a tripe fan. ", "the broth is perfect, just the right amount of savory without the bubble of fat floating around like some places, plenty of vegetables, and huge portions. "], "author": "Mike V.", "review": "Usually my favorite pho in the city and a good price (granted, you are driving out to the Sunset). Always get the pho tai, or the pho tai gau (steak and brisket). my friends also rave about the Dac Biet Xe Lua but I'm not a tripe fan. the broth is perfect, just the right amount of savory without the bubble of fat floating around like some places, plenty of vegetables, and huge portions. plus, even when there is a line of 5 or 6 couples, they seem to have you seated within 5-10 minutes. \n\nThe only knock on this place is the rare beef comes already in the bowl and can be pretty well cooked by the time it gets to your table. if you like your pho tai on the rarer side, then you should try to ask them to deliver the meat on the side and uncooked.", "rating": 4, "date": "2017-01-11"}, {"excerpts": ["I ordered the small Pho Dac Biet Bo Vien, the combo pho with beef balls (an extra $1.25 for the beef balls) ", "options include small, medium, and large. ", "This was served within 5-10 minutes (wow!) and the bowl admittedly was small, but given the alternate options and relatively cheap price, the portion seemed to make sense. ", "Due to the size of the bowl, there was less soup though ", "seemingly a lot of everything else. ", "The consistency of the noodles was perfect and the meat was standard and aplenty. ", "My main complaint was the soup tasted as if they relied a little bit too much on MSG for flavor, and was quite salty. "], "author": "Vivian L.", "review": "Came here on a Tuesday night after struggling to find parking. There was a good amount of people, though luckily the restaurant has plenty of seating and we were immediately seated. The restaurant has this lovely authentic aroma of pho and the workers are also truly Vietnamese, which was a relief among the many unauthentic hipster pho places in San Francisco.\n\nI ordered the small Pho Dac Biet Bo Vien, the combo pho with beef balls (an extra $1.25 for the beef balls) options include small, medium, and large. This was served within 5-10 minutes (wow!) and the bowl admittedly was small, but given the alternate options and relatively cheap price, the portion seemed to make sense. Due to the size of the bowl, there was less soup though seemingly a lot of everything else. The consistency of the noodles was perfect and the meat was standard and aplenty. My main complaint was the soup tasted as if they relied a little bit too much on MSG for flavor, and was quite salty. I was not that hungry to begin with, but the small size honestly was pretty small and I realized at the end that there was quite less noodles than I had thought. \n\nMy boyfriend got the same dish but the large size and agreed the portion sizes were not the greatest. Particular he noted that his bowl, while significantly larger than mine, was mostly just soup and not enough noodles. He thought the meat was dry and bland, and that the soup could be more rich and flavorful.\n\nOverall: Not my favorite pho joint, but not bad.", "rating": 3, "date": "2016-11-09"}, {"excerpts": ["I ordered Pho Dac Biet, which should include briskets and tripe as well. ", "Also, broth came out pretty lukewarm."], "author": "Thao T.", "review": "This review is based on their pho only.\n\nI really don't understand how they're rated so highly. The broth was soooo flat and bland. I could barely taste any traces of beef stock at all. Not to mention they gave me a few slices of beef and tendons, only. I ordered Pho Dac Biet, which should include briskets and tripe as well. Also, broth came out pretty lukewarm.", "rating": 1, "date": "2017-01-25"}, {"excerpts": ["I ordered a medium dac biet bo vien and he ordered the dac biet xe lua. ", "The noodles and broth were fantastic. ", "Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles.", "Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles."], "author": "Lily H.", "review": "I jokingly asked my boyfriend (whose name is Kevin) if he opened a pho restaurant when we saw this place for the first time and even though we were only in the city for a night, he immediately wanted us to try this place out for breakfast/lunch the next morning.\n\nI'm going to say this place definitely lives up to its hype. I ordered a medium dac biet bo vien and he ordered the dac biet xe lua. The noodles and broth were fantastic. Though I'd probably recommend getting the dac biet xe lua which comes in a standard large sizing over what I ordered which costed like a quarter more but had less noodles.", "rating": 4, "date": "2017-01-12"}, {"excerpts": ["My boyfriend got the dac biet bo vien with steak on the side and was very pleasantly surprised at how good it was. \n\n"], "author": "Melissa C.", "review": "The service here is very fast. There were at least 20 peole ahead of us and our wait was still only about 15 mins. Food came out within 10 mins of ordering.\n\nI got the pho ga tom, it was a little more oily than what I'm used to and the pho had more of a pure chicken flavor with no hint of any other spices. Despite those factors it was still good and my soup cravings were satisfied. If wanting something a little less straight forward stick with actual pho.\n\nMy boyfriend got the dac biet bo vien with steak on the side and was very pleasantly surprised at how good it was. \n\nSpring rolls were \"meh\" for me seeing as I felt they didn't taste very fresh.\n\nFour stars mainly because it's the most satisfying bowl of pho my boyfriend (the ex connoisseur) has had outside of San Jose so definitely recommended if you're in the city!", "rating": 4, "date": "2015-11-17"}, {"excerpts": ["Had the pho dac biet bo vien.  ", "It comes with steak, well-done brisket, flank, tendon, and beef ball.  ", "The broth is pretty good and the noodles weren't bad. \n", "The spring rolls were questionable though.  ", "The vegetables inside it seemed like they were sitting out and wilted and the shrimp was really fishy."], "author": "Heejin L.", "review": "3.5 \nPretty good pho. \nHad the pho dac biet bo vien.  It comes with steak, well-done brisket, flank, tendon, and beef ball.  The broth is pretty good and the noodles weren't bad. \nThe spring rolls were questionable though.  The vegetables inside it seemed like they were sitting out and wilted and the shrimp was really fishy.", "rating": 3, "date": "2014-04-02"}, {"excerpts": ["We ordered 2 items:\n\nDac Biet (Medium) special combo with thin slice of steak, brisket, flank, tendon & tripe - really disappointed, the beef broth was bland, not much dept, taste water down compare to other Vietnamese place, really lack of that beefy soup flavor.\n\n"], "author": "Sandi C.", "review": "After walking around Ocean Beach area, we went to Sunset for dinner option and decided to try out Pho Huynh Hiep 2 AKA Kevin's Noodle House. This place was clean and fully packed. Turn around time was pretty good, we only waited 10mins for a table.\n\nWe ordered 2 items:\n\nDac Biet (Medium) special combo with thin slice of steak, brisket, flank, tendon & tripe - really disappointed, the beef broth was bland, not much dept, taste water down compare to other Vietnamese place, really lack of that beefy soup flavor.\n\nBun Tom Thit Nuong grilled shrimp & pork with veggies and vermicelli - portion was small :( usually I couldn't finish this plate at the normal place I go to in Milpitas. And sadly I finished this plate and still have room for dessert! The fish sauce was nearly water, no hint of sourness or spicy-ness?", "rating": 2, "date": "2014-03-10"}, {"excerpts": ["Gotta go for pho dac biet with everything in it. ", "All the tendons and tripe. ", "Yum. ", "The pho broth is delicious. ", "I usually spend the first few minutes just drinking the broth. ", "This place really hits the spot for pho. ", "Good broth, fast service, good prices."], "author": "Truc D.", "review": "This is the go-to place in the city for the best tasting pho.  Definitely my favorite place in the city. Basically everyone orders pho here. Service is fast. Get seated, order and they usually bring your order out right away (if you ordered pho).\n\nGotta go for pho dac biet with everything in it. All the tendons and tripe. Yum. The pho broth is delicious. I usually spend the first few minutes just drinking the broth. This place really hits the spot for pho. Good broth, fast service, good prices.", "rating": 4, "date": "2013-08-21"}, {"excerpts": ["(I usually get the Dac Biet Bo Vien (#2?) or #1 (x large)).  "], "author": "Max L.", "review": "I've been here way too many times to count.  Really good price point for some pretty tasty pho (I usually get the Dac Biet Bo Vien (#2?) or #1 (x large)).  I've also tried the beef stewed noodles and they were pretty tasty.  \n\nThe fried chicken wings are kinda meh (not super crispy, kinda grease soaked), but the spring rolls are solid, and the rice dishes are pretty good too.  They also make a pretty good Vietnamese coffee and Thai ice tea.\n\nAs expected with this kind of food, super fast service!  We usually get our noodles about 5 minutes after ordering.", "rating": 4, "date": "2013-09-01"}, {"excerpts": ["I like to get the #2 Pho Dac Biet. ", "If you're new to trying pho, definitely try anything that says Dac Biet - it means \"special\" in Vietnamese...and usually means you get everything in it ", ":)"], "author": "V L.", "review": "I've lived in SF for 2.5 years now and have yet to have a decent bowl of pho, until I came here. Most Vietnamese pho places in the city that I've been to have been Chinese-influenced but I think the family that owns this one is actually Vietnamese (maybe that's why its good). Their broth is tasty, they give you a good amount of meat, reasonable portions and the restaurant looks clean. You can't really ask for more!\n\nI like to get the #2 Pho Dac Biet. If you're new to trying pho, definitely try anything that says Dac Biet - it means \"special\" in Vietnamese...and usually means you get everything in it :)", "rating": 3, "date": "2013-09-16"}, {"excerpts": ["My companion ordered the Dac Biet (the combo beef and noodle dish), and was well pleased also. \n", "Kevin's can get crowded, and those waiting have no place to stand except right in the entrance--which can be a nuisance. ", "The host managed the queue entirely by memory, without aid of writing down who came when, but it seemed to work fine. ", "The restaurant is situated half a block off of 19th Ave., which can be a boon or a curse. ", "As anyone remotely familiar with the area can tell, parking can be a challenge."], "author": "Brian G.", "review": "Small: Medium: Large. Kevin gives a choice to consumers of his tasty bowls of pho, something unique in my experience. This last visit I wasn't as hungry, so ordered a small bowl of Mi Bo Khov (Beef Stew w/ yellow noodles). It was delicious, with ample chunks of meat and tasty, meaty broth. My companion ordered the Dac Biet (the combo beef and noodle dish), and was well pleased also. \nKevin's can get crowded, and those waiting have no place to stand except right in the entrance--which can be a nuisance. The host managed the queue entirely by memory, without aid of writing down who came when, but it seemed to work fine. The restaurant is situated half a block off of 19th Ave., which can be a boon or a curse. As anyone remotely familiar with the area can tell, parking can be a challenge.", "rating": 4, "date": "2014-08-17"}, {"excerpts": ["My boyfriend ordered a large 'Dac Biet Bo Vien' ($8.25) pho, which was HUGE (seriously massive! ", "but my 6'4\" bf loved it so much he said he could have eaten 3 bowls) and full of all sorts of beef & beef derivatives. "], "author": "Kaden F.", "review": "4 stars for low prices + high quality. \n\nI don't know why, but it's a rare day that I'm in the mood for vietnamese food...luckily today was that day, & I used the fact that I had to move my car as an excuse to drive out to the sunset for some PHO! \n\nBut when it came down to it, I actually didn't order the pho, I got the beef stew with wide rice noodle. \n\nAnd I'm so glad I did. \n\nI ordered a small bowl ($5.75),  which was more than enough for me (mind you I don't always have the biggest appetite) & I left with enough leftovers for lunch tomorrow. \n \nThe stew had a very mild sweetness to it and did not skimp when it came to the chunks of beef. Very full flavored and after a couple spoonfuls of chili oil, I found it had a nice kick to it. \n\nMy boyfriend ordered a large 'Dac Biet Bo Vien' ($8.25) pho, which was HUGE (seriously massive! but my 6'4\" bf loved it so much he said he could have eaten 3 bowls) and full of all sorts of beef & beef derivatives. He was super happy with his order, as evidenced by the fact that he ate it ALL. \n\nI'm not the biggest pho fan, and I found the broth to have a strong beefy flavor, which was a little heavy for my taste, but I think that's a matter or personal preference. Luckily, I preferred my beef stew to the pho my bf ordered, and he preferred his pho to my stew. \n\nThe restaurant had a somewhat sparse feel to it, a big room with lots of tables & a few paintings (with a distinctly 'asian' theme) lining the walls, but the place was full & lively. Very low-key and casual, which I had no problem with. The service was EXTREMELY quick...I'd say it was a 3 or 5 minute wait between ordering and getting our food. Kudos for the fact that one of the waitresses was able to let me know whether or not the beef stew had any sort of shellfish in it (allergy), which is sometimes a bit more complicated to figure out. \n\nConsidering the price, quantity, flavor & expediency, this place definitely earned 4 stars in my book. Great for a foggy evening out in Inner Sunset!", "rating": 4, "date": "2013-07-09"}, {"excerpts": ["Had a medium bowl, Dac Biet Bo Vien, Combination beef with beef balls. ", "Very good. ", "Lots of noodles, meat and had a good aroma. ", "Service was attentive, the place is clean, well lit and spacious. "], "author": "Phuoc K.", "review": "Good solid Pho. Had a medium bowl, Dac Biet Bo Vien, Combination beef with beef balls. Very good. Lots of noodles, meat and had a good aroma. Service was attentive, the place is clean, well lit and spacious. Not something you can say about all vietnamese joints. \n\nPrices I noticed were also pretty good. I think my medium bowl, which was a very decent size was only $6 I think. Definitely a good stop for a cold day.", "rating": 4, "date": "2011-11-29"}, {"excerpts": ["Great Pho Dac Biet! ", "Similar to Pho Dac Biet in at Pho An in Bankstown, Sydney Australia!!\n\n"], "author": "Steven T.", "review": "Great Pho Dac Biet! Similar to Pho Dac Biet in at Pho An in Bankstown, Sydney Australia!!\n\nWould definitely recommend!\n\nFYI Tip around 15% or higher", "rating": 4, "date": "2013-10-15"}, {"excerpts": ["I had the Pho Dac Biet and it was delicious. ", "The soup was a little on the sweet side, but I like sweetness. "], "author": "Katherine T.", "review": "Extremely fast service. Even though the place was bustling with people we were seated right when we entered, and our orders were taken a few moments after we were ready. A few minutes later, our table was filled with hot, yummy smelling food.\n\nI had the Pho Dac Biet and it was delicious. The soup was a little on the sweet side, but I like sweetness. I loved that they had 3 different types of chili sauces (sriracha, garlic chili sauce, and hot chili oil).\n\nI took one star off because one of my friends ordered the fried chicken and she said it wasn't crispy at all, like it was just microwaved.\n\nSo, come here on a cold day (pretty much every day in SF), for a quick piping hot bowl of pho!", "rating": 4, "date": "2011-10-03"}, {"excerpts": ["The pho dac biet in medium size was fair in price but just lacked flavor in the broth. "], "author": "Mrs H.", "review": "Ugh... The parking in San Fran is driving me bonkers... I hate parking here... It's worse than LA. \nWell. So I figured all the good Asian food must be out of Chinatown since I couldn't find any there. Came all the way out here after a long day of walking. \nAll I can say is... Everyone who loves this place hasn't been to Westminster to eat pho in LA. \nSo it's not the greatest and I left feeling disappointed since reviews were so high. We had ordered a large plain noodles pho just for kids and the amount of noodles was basically a med just in a larger bowl. Ok. The pho dac biet in medium size was fair in price but just lacked flavor in the broth. The cha gio was an upset , pretty much just sat on our plate. I can make ten times better and that's exactly what the kids said. So don't get that.  \nWill I be back. Never. Fellow Sanfranscian  Yelpers, I have to think twice before checking out these spots. Where do I find good Westminster food in SanFran? (hmm...did i just answer my own question?)Maybe someone can help...\nis wasn't worth the effort to park and the total bill was reasonable but it just wsn't good. it felt like the broth was broth, not beef stock...and yes there is a difference. ANd another weird thing the server asked me was did i want chicken broth or beef broth...? huh? i was a bit dumbfounded for a moment. We do get BEEF broth with pho  correct?(unless its chicken pho)  is what i should have said...", "rating": 2, "date": "2012-10-22"}, {"excerpts": ["I usually have their Pho Dac Biet or Beef Stew noodles. ", "Both delicious."], "author": "Alton Y.", "review": "I've gone to this place many times through the years and they seem to be consistently good. I think they're better than the PPQ across the street. Unfortunately, there's no Bon Bo Hue or Vietnamese sandwiches, but it's not on the menu anyways. I usually have their Pho Dac Biet or Beef Stew noodles. Both delicious.", "rating": 4, "date": "2012-01-02"}, {"excerpts": ["You can stray away and try to get all the fancy smancy soups, but they definitely have the right combination for their special soup (dac biet).  "], "author": "Isaac L.", "review": "AKA Pho \"Hip Hop\"!  Nah, they don't got no rap in here.  The only rap they got here are the lettuce wraps.  Which, btw are pretty damn good.  I'm talking about the fried egg rolls (gia gio).  One may be fooled into thinking these are your typical eggrolls from your favorite chinese dive, but you will be happily surprised by the rice paper they use.  Its the thin translucent kind, not the yellow parchment paper.  Wrap these bad boys up in some lettuce, pop in some springs of mint, a quick dip in the nuoc mam (orangy fish sauce) and be on your way to eggroll heaven.\n\nIn conjunction with the tasty fried treats, they by far, have a lock on their beef noodle soup.  You can stray away and try to get all the fancy smancy soups, but they definitely have the right combination for their special soup (dac biet).  Usually positioned at the top of the soup list, the #1, it's your basic noodle soup combination special with flank, brisket, tripe, and all that good stuff.\n\nDefinitely the spot to hit up Saturday morning after a long festive evening, the soup here will replenish the fluids to the bones.   You;ll almost want to pick the bowl off and drink it like it was the nectar of the gods.\n\nTo conclude, this is THE spot for pho in the City, hands down.  Two thumbs and an eggroll up!\n\nOne unisex bathroom.  Not the prettiest of it's kind.  Hit up the bar across the street if you gotta sit down.", "rating": 5, "date": "2007-01-31"}], "tai nam gau gan sach": [], "chin nam gau gan sach": [], "tai chin gau gan sach": [], "tai chin nam gan sach": [], "tai bo vien": [{"excerpts": ["Tai Bo Vien like four stars, same for the regular Pho Tai... pretty typical awesome viet food... "], "author": "Blake C.", "review": "I give the Pho Tai Bo Vien like four stars, same for the regular Pho Tai... pretty typical awesome viet food... huge servings of tasty homemade soup, etc.\n\nFree hot tea is always nice.\n\nThe A1 fried viet egg roll appetizer was good on the inside, but not the viet egg roll wrappers I am used to enjoying; more of a spring roll type thing.\n\nAll in all, I dig it.  Soup delivers beegtimes.", "rating": 3, "date": "2009-10-31"}], "tai nam gam": [], "tai nam sach": [{"excerpts": ["I get the tai nam sach. ", "The small is plenty, I think they just give you more broth in the larger bowl. ", "They give you plenty of basil and sprouts and stuff. ", "My only complaint is that my sprouts and basil are always presented sopping wet. ", "I suppose that it's good to know that they wash the stuff ", "but couldn't they put it through a salad spinner or something? ", "Also parking really sucks on Irving ", "so I often find myself debating whether I want to drive the extra distance to go to the one in Daly City or drive around the block 5 times looking for a meter. ", "Circling the block usually wins"], "author": "Melanie V.", "review": "Now, I grew up in San Jose, so even though I am not Vietnamese I would like to think that I know my way around a bowl of pho. That being said, this is a very decent place for me to get my noodle fix. The broth is rich and tasty and they load up those bowls with meat and noodles. I usually order pho tai nam, if i'm feeling adventurous I get the tai nam sach. The small is plenty, I think they just give you more broth in the larger bowl. They give you plenty of basil and sprouts and stuff. My only complaint is that my sprouts and basil are always presented sopping wet. I suppose that it's good to know that they wash the stuff but couldn't they put it through a salad spinner or something? Also parking really sucks on Irving so I often find myself debating whether I want to drive the extra distance to go to the one in Daly City or drive around the block 5 times looking for a meter. Circling the block usually wins", "rating": 3, "date": "2007-08-19"}], "nam ve don": [], "chin gau": [], "tai gau": [{"excerpts": ["Always get the pho tai, or the pho tai gau (steak and brisket). "], "author": "Mike V.", "review": "Usually my favorite pho in the city and a good price (granted, you are driving out to the Sunset). Always get the pho tai, or the pho tai gau (steak and brisket). my friends also rave about the Dac Biet Xe Lua but I'm not a tripe fan. the broth is perfect, just the right amount of savory without the bubble of fat floating around like some places, plenty of vegetables, and huge portions. plus, even when there is a line of 5 or 6 couples, they seem to have you seated within 5-10 minutes. \n\nThe only knock on this place is the rare beef comes already in the bowl and can be pretty well cooked by the time it gets to your table. if you like your pho tai on the rarer side, then you should try to ask them to deliver the meat on the side and uncooked.", "rating": 4, "date": "2017-01-11"}, {"excerpts": ["I ordered Pho Tai Gau, medium. ", "The broth was pretty good, a decent balance of sweet and sour. ", "Not too mucked up with extras, but nice onions. ", "The noodles were good, clumped as is typical, but not falling apart, or milky or mushy. ", "The meat was average in quantity, but it was tougher than my now standard near Concord,  ", "Pho ", "Lee Hoa Phat (which also has several locations in the east bay). "], "author": "Wanugee N.", "review": "I think this is Pho review number 115 for me. You sort of lose track after 100 bowls, (actually maybe thousands) in over 100 places. There is a book title somewhere in there. \n\nI have been to Pho Hunyh Hiep 5  - one of the other Kevin's Noodle Houses - many times as my local go-to Pho diner when i worked in Concord near the Park and Shop mall where it was located.\n\nNumber 2 here is similar in set up, with about 3 rows of tables in a pretty large room that has about 20 tables and the same familiar drill at most Pho specialty places. \n\nHere, for the first time on Yelp, are the instructions from the standard Vietnamese Pho Restaurant Operating Manual, that secret and sacred document revealed here in public for the first time to educate and expand the appreciation of the growing Low Fan (foreigner) Pho loving masses: \n\n1. Number tables sequentially so you can put it on the guests check and manage the logistics of payment after the meal. The numbers must be in standard gold and black sticker decals of regulation height and placement, centered on the wall next to the table, or affixed prominently on the side of the silver napkin holder or silver table accessories caddy if there is no nearby wall. \n\n2. The guest check must be in 2 parts, with a detachable small bottom that you throw randomly on the table, where you can write the table number that matches the table, and the top part of the check, which you leave at the cashier in random cascaded piles. \n\n3. Have the standard Chinese/Vietnamese silver table caddy for: \na) Faux marble plastic beige chopsticks (must hold at least 50, try green/red if you want to look different, but not recommended) \nb) Soup spoons, must be plastic with faux blue porcelain appearance, rice or fish design\nOptions C - room for red squeeze bottle of Hoy Sin Sauce and off the 99 Ranch store shelf Sri Racha Tung Ot sauce, soy sauce, and glass dish for hot chili oil with silver lid and plastic spoon. If not room in caddy, place on table as if there was. \nOption D - add room for mini-saucer for condiments, i.e. Hoy Sin sauce and Sri Racha, to dip your Pho meat to season and eat, instead of dumping all of that into the broth and spoiling the 4 hour broth flavor you tried to create \n(but let Low Fan squeeze into broth, because that is what they are trained to do with catsup bottle on French Fries, or mustard on Hot Dogs, or thousand Island on Salads) \n\n4. Have 1 man serve as arbitrator of guest seating, and order taking. Must know menu by number and name, and good at pointing. Must know how to decipher Low Fan pronunciation in Vietnamese of Pho (Foh instead of Fa-uh). \n\n5. Substitute for man only when necessary with young cute girl (preferable a relative) who is tough and doesn't smile, otherwise leave women at cashier desk to handle money and sort out guest checks (preferable matriarch from Vietnam with poor English skills). Secret is, women are observant, so even though guests don't know their table number, she does, and can find the right check within 3 attempts, max, usually in 1 try.  \n\n6. Have older male staff as food runners, because their skin isn't as sensitive.  Must be able to handle hot bowls of soup, possibly with thumb over lip into bowl, for balance. No English skills required, in fact avoid. Refer to #4 man/arbitrator for questions. Cart/bussing skills a plus. \n\nI ordered Pho Tai Gau, medium. The broth was pretty good, a decent balance of sweet and sour. Not too mucked up with extras, but nice onions. The noodles were good, clumped as is typical, but not falling apart, or milky or mushy. The meat was average in quantity, but it was tougher than my now standard near Concord,  Pho Lee Hoa Phat (which also has several locations in the east bay). I also ordered Cafe Sua (Viet coffee). \n\nThis being SF, with the strong Chinese influence, it is common to be served a pot of tea in Vietnamese places. In the South Bay, it is more common to be served ice water in a glass. \n\nWhen I came in, everything was per Manual steps 1 and 2. I had to ask #4 for Hoy Sin, because it wasn't on every table per the manual rule number 3 Option, C above. I promptly got that from the #4. #6 did as instructed. The Matriarch settled my bill, as required in rule #5.", "rating": 3, "date": "2014-08-01"}, {"excerpts": ["I had the Pho Tai Gau (small) and it was good, though nothing to rave about.\n\n"], "author": "Duy L.", "review": "I ordered the cha gio and it was quite mediocre, tho correctly served with lettuce to wrap around it.\n\nI had the Pho Tai Gau (small) and it was good, though nothing to rave about.\n\nA day after, I had terrible stomach pains and I can only suspect this meal =(", "rating": 3, "date": "2009-04-07"}], "tai nam": [{"excerpts": ["I usually order pho tai nam, if i'm feeling adventurous ", "I get the tai nam sach. ", "The small is plenty, I think they just give you more broth in the larger bowl. ", "They give you plenty of basil and sprouts and stuff. ", "My only complaint is that my sprouts and basil are always presented sopping wet. ", "I suppose that it's good to know that they wash the stuff ", "but couldn't they put it through a salad spinner or something? ", "Also parking really sucks on Irving ", "so I often find myself debating whether I want to drive the extra distance to go to the one in Daly City or drive around the block 5 times looking for a meter. ", "Circling the block usually wins"], "author": "Melanie V.", "review": "Now, I grew up in San Jose, so even though I am not Vietnamese I would like to think that I know my way around a bowl of pho. That being said, this is a very decent place for me to get my noodle fix. The broth is rich and tasty and they load up those bowls with meat and noodles. I usually order pho tai nam, if i'm feeling adventurous I get the tai nam sach. The small is plenty, I think they just give you more broth in the larger bowl. They give you plenty of basil and sprouts and stuff. My only complaint is that my sprouts and basil are always presented sopping wet. I suppose that it's good to know that they wash the stuff but couldn't they put it through a salad spinner or something? Also parking really sucks on Irving so I often find myself debating whether I want to drive the extra distance to go to the one in Daly City or drive around the block 5 times looking for a meter. Circling the block usually wins", "rating": 3, "date": "2007-08-19"}], "tai gan": [{"excerpts": ["I got the Pho Tai Gan.  ", "This time I paid more attention to the tendon.  ", "This place had nice juicy thick pieces that quivered and shook in my unsteady hands.  ", "The tendon was substantial and not chopped up in to sliced like the TL plcaes. "], "author": "Christina C.", "review": "A curse on your family (at the other place that was closed 15 mins before their posted closing sign)!  May warts grow all over the feet of your proverbial walks in life.\n\nMoving on.  Were it not for the cursed place I mentioned above, Marina and I would not have found our way over here.  It was around 9:15 on a Saturday night.  We found parking about a block away.  We had previously been shopping in Union Square.  I was getting a suit (grown up clothing!) and she got this nice pair of knee lenth clam-digger type jeans.  All on sale.  \n\nAfter attempting to go to Chez Papa Resto and realizing how incredibly small that place was, we looked around at another french place before getting in to the car.  Whilst in the car, I told her about the amazing broth of pho.  It was spiced, cinnamon, anise, a bit of cardamon.  I sold it so well that we headed straight for the sunset.  \n\nThere was a false start (and we'd found such GOOD PARKING too), we ended up here.  I was famished.  Hadn't eaten since noon.  Not even a snack.  I ordered the Imperial rolls and the fried chicken wings.  The imperial rolls were nice and compact.  Meaty, tight, turgid tubes of fried loveliness.  \n\nThe chicken wings were HUGE.  I don't know what chickens these came off of, but the wingspan was the size of my hand!  Not just the palm.  I'm talking about the biggest wings ever.  The drumette looked like a full size leg drumstick.  \n\nAnd now the pho.  Marina go the Pho Tai.  I got the Pho Tai Gan.  This time I paid more attention to the tendon.  This place had nice juicy thick pieces that quivered and shook in my unsteady hands.  The tendon was substantial and not chopped up in to sliced like the TL plcaes. It was something I could sink my teeth in to.  \n\nI made sure to sip the broth before adding anything.  While I could still smell the anise and a bit of cinnamon, the fragrance was not as strong as at Yummy Yummy or Pho King.  But it was there.  A different style of broth.  It's ok.  Not all pho broth has to taste the same.  \n\nLet us not allow pho broth to go the way of expensive trendy wines: suiting the tastebuds of that guy who gives out points just so they get a high score.  Let us embrace the individualism and characteristics of the broth.  Celebrate it by having a different kind each day.", "rating": 5, "date": "2009-07-12"}], "tai sach": [{"excerpts": ["and i always get pho tai sach, but ", "can you say msg.  ", "i always leave feeling tired=/ cheap and good"], "author": "Hong T.", "review": "pho on a nice rainy cold day is the best.  this place being the one of my favorite place in the city is a plus also.\n\nwhen ever the family is in the city, this will be their kick it spot for food.   before/after doctors appts, airport pickups, or class, this is were they go. \n\nand i always get pho tai sach, but can you say msg.  i always leave feeling tired=/ cheap and good", "rating": 4, "date": "2010-10-12"}], "pho bo vien": [{"excerpts": ["If I get the Pho Bo Vien, I usually only get about 3-5 slices of beef ball. ", "At this place, they gave me a whole bowl full! ", "I got like 12 pieces of beef ball! ", "I was incredibly happy. "], "author": "Jennifer M.", "review": "LOVE this place. \n\nI'm from Boston and I've eaten my fair share of pho--probably way more than my fair share, actually,\n\nFirst of all, the guy who greeted us was super nice and friendly. He told us there was a bit of a wait due to an issue in the kitchen, and even after we left to go get a drink while we waited and we came back, he seated us right away. The service was a little slow after that, but it was probably just because of the problems in the kitchen. No big deal.\n\nAt every other pho restaurant I've ever eaten at, they have been SO stingy with the beef balls. If I get the Pho Bo Vien, I usually only get about 3-5 slices of beef ball. At this place, they gave me a whole bowl full! I got like 12 pieces of beef ball! I was incredibly happy. The quality of the food was great as well. \n\nOverall, I loved this place and would definitely come here again when I visit SF next time!", "rating": 5, "date": "2014-08-21"}], "com suon": [{"excerpts": ["Their meaty combo platter - com suon lap xuong tau "], "author": "Jando S.", "review": "I really had higher hopes for Pho Huynh Hiep 2 aka Kevin's Noodle House. San Francisco has never really been known for its Vietnamese food and it's place like this that prove the notion to be true. Most of all I've sampled here in some way remind me of the Vietnamese fare back home in NYC. which is not a good thing. Hence, 3.5 stars rounded down is the best I can do for now.\n\nLike most Vietnamese spots that specialize in noodles and soups, pho is a natural benchmark to go on. Only problem is, the broth is mad bland. I've had my fair share of pho tai and pho tai chin / nam bowls here, all priced accordingly at less than $7 each but either its loaded with MSG (likely) and / or prepped with subpar seasoning (also likely). In the unlikelihood its just bad luck, I still haven't mustered a decent bowl of pho here just yet.\n\nThe other noodle soups, like bun rieu, hu tieu, and bun bo hue  or even mi hai son (seafod) are also low on the Viet totem pole of deliciousness. The broth in all need some work. From a noodle standpoint, the consistency is there, but the broth is one essential that locks everything in place; an equalizer of sorts. It's just not there and that strikes out a sizeable portion of the menu. \n\nRice plates have fared better, which is their saving grace. Their meaty combo platter - com suon lap xuong tau hu ky (aka Chinese sausage, pork chop, and shrimp cake) is a mean dish, especially when doused with a tangy but sweet nuoc mam fish sauce. I also have some love for the bun thit nuong cha gio, otherwise known as vermacelli with pork chop and spring rolls. It's got a lot of textures going on, served in a decent portion if I've ever seen one.\n\nWhile there are some Viet servers, let us not forget this is The Richmond area. Most everyone will be Chino, which includes lots of the wait staff. They're not the friendliest bunch, so make sure you've got your orders straight before they ask (unhappily) again.", "rating": 3, "date": "2014-03-11"}, {"excerpts": ["Com Suon Bi Hot Ga Op La, but did acknowledge that the soup was pretty delicious ", "and he would be trying one of those next time."], "author": "Daphne W.", "review": "I loved Kevin's Noodle House. I was feeling under the weather a few weeks ago and just wanted a big bowl of chicken noodle soup. While the chicken noodle soup I got here wasn't exactly how mom used to make, it was delicious! \n\nMy boyfriend did not get a bowl of soup and was not as pleased with his meal, Com Suon Bi Hot Ga Op La, but did acknowledge that the soup was pretty delicious and he would be trying one of those next time.", "rating": 4, "date": "2015-06-14"}], "com suon bi": [{"excerpts": ["Com Suon Bi Hot Ga Op La, but did acknowledge that the soup was pretty delicious ", "and he would be trying one of those next time."], "author": "Daphne W.", "review": "I loved Kevin's Noodle House. I was feeling under the weather a few weeks ago and just wanted a big bowl of chicken noodle soup. While the chicken noodle soup I got here wasn't exactly how mom used to make, it was delicious! \n\nMy boyfriend did not get a bowl of soup and was not as pleased with his meal, Com Suon Bi Hot Ga Op La, but did acknowledge that the soup was pretty delicious and he would be trying one of those next time.", "rating": 4, "date": "2015-06-14"}], "com suon hot ga": [], "com suon bi hot ga op la": [{"excerpts": ["Com Suon Bi Hot Ga Op La, but did acknowledge that the soup was pretty delicious ", "and he would be trying one of those next time."], "author": "Daphne W.", "review": "I loved Kevin's Noodle House. I was feeling under the weather a few weeks ago and just wanted a big bowl of chicken noodle soup. While the chicken noodle soup I got here wasn't exactly how mom used to make, it was delicious! \n\nMy boyfriend did not get a bowl of soup and was not as pleased with his meal, Com Suon Bi Hot Ga Op La, but did acknowledge that the soup was pretty delicious and he would be trying one of those next time.", "rating": 4, "date": "2015-06-14"}], "com bo nuong": [{"excerpts": ["I've had multiple rice plates of theirs and my favorite would probably be Com Bo Nuong. ", "The Beef is cooked well and has nice flavors all throughout. ", "Something I don't really like would be their fish sauce. ", "The flavors are not of equal balance and I taste more spicy than I do of anything else. "], "author": "Bill L.", "review": "This is one of the better Vietnamese Restaurants I have gone to. They have somewhat attentive staff and serve pretty decent food.I love Vietnamese food and this restaurant is probably up there compared to the ones I have tried. \n\nAt Vietnamese restaurants I will almost always order a rice plate unless its a cold day. If its a cold day I would order something Pho related. I've had multiple rice plates of theirs and my favorite would probably be Com Bo Nuong. The Beef is cooked well and has nice flavors all throughout. Something I don't really like would be their fish sauce. The flavors are not of equal balance and I taste more spicy than I do of anything else. For soups I would get Mi Hai San which consists of seafood. They give a fair amount of meats in this dish but I think it can be slightly more. I love Egg Noodles when it comes to soup and that's why I order it instead of   other kinds. For the Appetizers I have had the Goi Cuon and Cha Gio. Goi Cuon is pretty standard, but I think each roll is lacking in one half of a shrimp. Their peanut sauce tastes heavy in peanut and is thick. I think they should add pickled carrots and radishes in their peanut sauce. Im not a fan of their Cha Gio for how its made. It looks like a normal chinese egg roll and does not look appetizing.\n\nOverall this restaurant has good flavors and I would recommend going here. The staff can sometimes rush you but it isn't that bad. The food also comes in decent portions even though I think it can be just a small bit more. Presentation and atmosphere is standard and nice as well.", "rating": 4, "date": "2017-04-16"}], "combo plate": [{"excerpts": ["The rice combo plate was very good - once again just small portions than we're used to in Texas."], "author": "Lilan N.", "review": "This was a HIT! I'm not too fond of pho, but with the cold San Fran weather, I was feeling for some soup. We found this on yelp and gave it a try. \nService was decent, as quick as it usually is for asian restaurants. We wrote down our name and waited around 5 minutes before getting seated. \nWe got complimentary tea, and ordered Thai tea and iced coffee. Both were great. The Thai tea was strong and flavorful! And iced coffee was VERY strong, which I like but wasn't fully expected. \nThe PHO!! Wow I thought the soup was very tasty, and perfected seasoned, without hoisin or sriracha. Great!!! Ahhhh I loved it. Portions are smaller than I'm used to, but it was perfect. The chicken pho was decent, but I like my beef pho better. The rice combo plate was very good - once again just small portions than we're used to in Texas.", "rating": 5, "date": "2018-05-24"}, {"excerpts": ["For lunch, I ordered the #41 combo plate. ", "For $7.50, the rice plate had an egg roll, two pieces of fried chicken wings, a thin pork chop and vegetables with the customary dipping sauce. ", "As you know, chicken parts do take time to cook. ", "The chicken wings were decent. ", "The thin pork chops were too salty for my satisfaction. "], "author": "Matt G.", "review": "If you are hungry and short on time, forget fast-food burger joints and eat Vietnamese instead. I have found another Vietnamese restaurant that cooks your pho/meal in a blink of an eye...maybe two blinks!\n\nUnlike PPQ, located right across the street on Asian-friendly Irving St., this is a bigger and cleaner restaurant with Health Department score of 94. Also listening to music on my nano was not necessary either. \n\nFor lunch, I ordered the #41 combo plate. For $7.50, the rice plate had an egg roll, two pieces of fried chicken wings, a thin pork chop and vegetables with the customary dipping sauce. As you know, chicken parts do take time to cook. The chicken wings were decent. The thin pork chops were too salty for my satisfaction. The rice plate sounds good initially when I ordered, but turned below average. \n\nThe workers were very nice to me. I might come back and check other items from here. \n\nYou gotta love Irving Street.", "rating": 3, "date": "2012-03-05"}, {"excerpts": ["When I'm not in the mood for noodles, I go for their combo plate which is great.  ", "Everything here is reasonably priced."], "author": "Kevin N.", "review": "My favorite pho in SF!!  I'm here once a week and hIghly recommend.  I also love their beef stew.  When I'm not in the mood for noodles, I go for their combo plate which is great.  Everything here is reasonably priced.", "rating": 5, "date": "2016-12-27"}], "com suon hot ga tau hu ky": [], "com bo tau hu ky": [], "com ga tau hu ky": [], "com tom nuong": [], "com suon lap xuong tau hu ky": [], "com bo kho": [], "hu tieu hai san": [], "pho hai san": [], "mi hai san": [{"excerpts": ["For soups I would get Mi Hai San which consists of seafood. ", "They give a fair amount of meats in this dish but I think it can be slightly more. ", "I love Egg Noodles when it comes to soup ", "and that's why I order it instead of   other kinds. "], "author": "Bill L.", "review": "This is one of the better Vietnamese Restaurants I have gone to. They have somewhat attentive staff and serve pretty decent food.I love Vietnamese food and this restaurant is probably up there compared to the ones I have tried. \n\nAt Vietnamese restaurants I will almost always order a rice plate unless its a cold day. If its a cold day I would order something Pho related. I've had multiple rice plates of theirs and my favorite would probably be Com Bo Nuong. The Beef is cooked well and has nice flavors all throughout. Something I don't really like would be their fish sauce. The flavors are not of equal balance and I taste more spicy than I do of anything else. For soups I would get Mi Hai San which consists of seafood. They give a fair amount of meats in this dish but I think it can be slightly more. I love Egg Noodles when it comes to soup and that's why I order it instead of   other kinds. For the Appetizers I have had the Goi Cuon and Cha Gio. Goi Cuon is pretty standard, but I think each roll is lacking in one half of a shrimp. Their peanut sauce tastes heavy in peanut and is thick. I think they should add pickled carrots and radishes in their peanut sauce. Im not a fan of their Cha Gio for how its made. It looks like a normal chinese egg roll and does not look appetizing.\n\nOverall this restaurant has good flavors and I would recommend going here. The staff can sometimes rush you but it isn't that bad. The food also comes in decent portions even though I think it can be just a small bit more. Presentation and atmosphere is standard and nice as well.", "rating": 4, "date": "2017-04-16"}, {"excerpts": ["I come here all the time I usually order Mi Hai San pho &  ", "I also like their spring rolls. ", "The service is friendly & good, prices are fair ,place is clean as far as I can tell, no complaints!  ", "Be aware you can order ", "3 different size bowls of Pho & everything is measured out by the size you select.\n", "I like this place & will keep going back!"], "author": "Sparky W.", "review": "I come here all the time I usually order Mi Hai San pho &  I also like their spring rolls. The service is friendly & good, prices are fair ,place is clean as far as I can tell, no complaints!  Be aware you can order 3 different size bowls of Pho & everything is measured out by the size you select.\nI like this place & will keep going back!", "rating": 4, "date": "2010-01-27"}], "dai hai san": [], "pho ga xe lua": [{"excerpts": ["We ordered the Pho Ga Xe Lua  (aka bonless chicken soup with noodles)...that shit was really fly...medium order is huge. ", "Plop in the basil, lime, bean sprouts, and jalapeno pepers....add a dash of fish sauce......", "best pho "], "author": "David G.", "review": "Pho Huynh Hiep 2 ( I did not know there was a 1???) is one banging pho house....and so much more.\n\nThank you Yelp for steering me to this great little resto.\n\nWe ordered the Pho Ga Xe Lua  (aka bonless chicken soup with noodles)...that shit was really fly...medium order is huge. Plop in the basil, lime, bean sprouts, and jalapeno pepers....add a dash of fish sauce......best pho I have had in a long time.\n\nThe broth is really flavorful, deep , and tasty.\n\nOrdered two apps:\n\n\nCha Gio which is deep fried vietnamese egg rolls taro, clear vermicelli, pork, shrimp ....really good...and nice dipping sauce.\n\nGoi Cuon which is another roll consisting of shrimp, pork, lettuce, vermicelli wrapped in soft rice pepper ....did not care for as much but the sauce which was thicker with peanuts was AWESOME.\n\nFor three people 2 med chicken pho, 1 small chicken pho and the apps.....35 bucks including tip....this place is awesome.\n\nkiem tra xem nó ra", "rating": 4, "date": "2013-04-12"}], "pho ga tom": [{"excerpts": ["#22B Pho Ga Tom - Boneless chicken & shrimp rice noodle soup. ", "The broth was super addicting, it definitely stands out compared to a lot of other pho I've tried in SF. ", "Chicken was very aromatic and flavorful, but I would have liked if there were more than 2 pieces of shrimp.. ", "didn't feel like this justified the extra $1 compared to just having the chicken noodle soup. ", "My main criticism was that the noodles were slightly overcooked and stuck together. ", "Perhaps this was because we came pretty late in the afternoon, around 3 PM and the cooks were just finishing up the lunch batch. "], "author": "Chelsea W.", "review": "Amazing broth! I came here under the recommendation that this is the best place for pho in SF and it definitely lived up to the hype in my opinion.\n\nThe menu is very extensive, you'll basically find all the variations of noodle soup, vermicelli and rice bowls on the menu. They even have a section for boba and smoothies. Prices are pretty inexpensive too, around $7 for small, $8 for medium and $9 for large. Food comes out almost immediately after you order. \n\nThe restaurant is pretty large and has plenty of tables so it'd be easy to come in bigger groups. Service is pretty efficient and fast.\n\n#A6 - Tau Hu Ky/Fried Shrimp Cakes - Great appetizer! \n\n#22B Pho Ga Tom - Boneless chicken & shrimp rice noodle soup. The broth was super addicting, it definitely stands out compared to a lot of other pho I've tried in SF. Chicken was very aromatic and flavorful, but I would have liked if there were more than 2 pieces of shrimp.. didn't feel like this justified the extra $1 compared to just having the chicken noodle soup. My main criticism was that the noodles were slightly overcooked and stuck together. Perhaps this was because we came pretty late in the afternoon, around 3 PM and the cooks were just finishing up the lunch batch. (Update: The noodles had a much better consistency when I came the second time around!)\n\nGrilled Chicken & Shrimp Vermicelli - Forgot which number this was, but the second time around I decided to go in on the vermicelli and it was very worthwhile. I personally liked the vermicelli over the noodle soup.\n\nOverall I feel like for the standard Viet dishes you'd find at any restaurant you can't really go wrong here!", "rating": 4, "date": "2017-08-13"}, {"excerpts": ["I got the pho ga tom", ", it was a little more oily than what I'm used to and the pho had more of a pure chicken flavor with no hint of any other spices. ", "Despite those factors it was still good and my soup cravings were satisfied. "], "author": "Melissa C.", "review": "The service here is very fast. There were at least 20 peole ahead of us and our wait was still only about 15 mins. Food came out within 10 mins of ordering.\n\nI got the pho ga tom, it was a little more oily than what I'm used to and the pho had more of a pure chicken flavor with no hint of any other spices. Despite those factors it was still good and my soup cravings were satisfied. If wanting something a little less straight forward stick with actual pho.\n\nMy boyfriend got the dac biet bo vien with steak on the side and was very pleasantly surprised at how good it was. \n\nSpring rolls were \"meh\" for me seeing as I felt they didn't taste very fresh.\n\nFour stars mainly because it's the most satisfying bowl of pho my boyfriend (the ex connoisseur) has had outside of San Jose so definitely recommended if you're in the city!", "rating": 4, "date": "2015-11-17"}, {"excerpts": ["I usually got the pho ga tom, which is the seafood chicken soup. ", "It's alright, but I could probably make a noodle soup just as tasty at home with half the sodium. ", "Same with the beef pho bowls which also have some . ", "The broth is riddled with essentially a ladle of MSG in every bowl. "], "author": "Cindy L.", "review": "This use to be my to-go place for a cheap meal. There's a reason why it's cheap because the quality is terrible and half the people working there don't know what they're doing. It's sad I use to be a weekly regular with my friends, but now we don't come back here for many reasons.\n\nI usually got the pho ga tom, which is the seafood chicken soup. It's alright, but I could probably make a noodle soup just as tasty at home with half the sodium. Same with the beef pho bowls which also have some . The broth is riddled with essentially a ladle of MSG in every bowl. Now if you think food that gives you 1,000% of your daily sodium intake is bad, it gets worse.\n\nI have gotten a disgusting amount of PLASTIC in my order one time and they did not take it off the bill or even offer a replacement bowl. The lady had the nerve to give us the STINK EYE and muttered she knew we wouldn't tip when she picked up the bill. Be LUCKY we paid at all.\n\nThere's lots of cheap pho places in SF that are equal or higher quality than Kevin's. I mainly came to Kevin' since they had more chicken selections than other places, but that's not good enough of an excuse to come back. Now that I think about it, this place is REALLY dirty and unsanitary.\n\nRude service, bad food. Avoid this place at all costs unless you want to choke on plastic or an MSG induced headache. This place, even though it's nothing fancy, focuses more on QUANTITY than QUALITY. \n\nSave your money and go to PPQ across the street for 10x better food. You'll at least get a welcome when you enter the restaurant.", "rating": 1, "date": "2014-08-11"}], "pho tom": [], "beef balls": [{"excerpts": ["This time however I felt like trying the #2 medium which is similar to #1 but #2 has beef balls. ", "($9.25 for a #2 medium) ", "The food came out quickly! ", "Came with 6 beef balls. ", "Broth was flavorful..just like how I remember it! ", "Noodles were on the chewier side ", "but I didn't mind it. ", "I finished my bowl of pho, paid, and left. ", "My meal was about 30 min overall. ", "And right away my seats were taken by one of the three parties waiting and standing by the door. \n", "Kevin's doesn't mess around when it comes to serving customers quickly and efficiently. ", "Food quality is good, yummy enough to have locals like me coming back for YEARS. ", "Stay you Kevin's, stay true."], "author": "Debby N.", "review": "Kevin's is my go-to pho place in sf since my high school days! Consistent food quality, large portions for the price, fast and efficient service... no frills no fancy treatment, just order your food, enjoy, pay & dip. Kevin's is pretty popular and if you ever come here, you know it because it always has customers no matter what time of day or night. All in all, I only have good things to say about this place. \nI came here an hour ago and was seated right away by the young gentleman. The prices have gone up so it's now $9.00 for a #1. I normally order #1 because it's the bang for your buck: large bowl of pho for a cheap price with a lot of variety in it. This time however I felt like trying the #2 medium which is similar to #1 but #2 has beef balls. ($9.25 for a #2 medium) The food came out quickly! Came with 6 beef balls. Broth was flavorful..just like how I remember it! Noodles were on the chewier side but I didn't mind it. I finished my bowl of pho, paid, and left. My meal was about 30 min overall. And right away my seats were taken by one of the three parties waiting and standing by the door. \nKevin's doesn't mess around when it comes to serving customers quickly and efficiently. Food quality is good, yummy enough to have locals like me coming back for YEARS. Stay you Kevin's, stay true.", "rating": 4, "date": "2017-11-02"}, {"excerpts": ["Also, I paid $9.25 for a small #8 (rare steak and beef balls) and the portion was way too small. \n\n"], "author": "Vanessa Z.", "review": "After a long hiatus from Kevin's the Broth is still good, but what happened to the noodles?? It was super over cooked and slimy and the noodles basically stuck together. I'm not sure what the management is doing but these noodles isn't the same as before. \n\nAlso, I paid $9.25 for a small #8 (rare steak and beef balls) and the portion was way too small. \n\nI have had Kevin's at westlake and the noodle was also over cooked in which I overlooked because I thought it could have been an off day. But the noodles are consistently over cooked which is no good. I would not be coming back to Kevin's for the poor noodle quality.", "rating": 1, "date": "2017-08-23"}, {"excerpts": ["I ordered the small Pho Dac Biet Bo Vien, the combo pho with beef balls (an extra $1.25 for the beef balls) ", "options include small, medium, and large. ", "This was served within 5-10 minutes (wow!) and the bowl admittedly was small, but given the alternate options and relatively cheap price, the portion seemed to make sense. ", "Due to the size of the bowl, there was less soup though ", "seemingly a lot of everything else. ", "The consistency of the noodles was perfect and the meat was standard and aplenty. ", "My main complaint was the soup tasted as if they relied a little bit too much on MSG for flavor, and was quite salty. "], "author": "Vivian L.", "review": "Came here on a Tuesday night after struggling to find parking. There was a good amount of people, though luckily the restaurant has plenty of seating and we were immediately seated. The restaurant has this lovely authentic aroma of pho and the workers are also truly Vietnamese, which was a relief among the many unauthentic hipster pho places in San Francisco.\n\nI ordered the small Pho Dac Biet Bo Vien, the combo pho with beef balls (an extra $1.25 for the beef balls) options include small, medium, and large. This was served within 5-10 minutes (wow!) and the bowl admittedly was small, but given the alternate options and relatively cheap price, the portion seemed to make sense. Due to the size of the bowl, there was less soup though seemingly a lot of everything else. The consistency of the noodles was perfect and the meat was standard and aplenty. My main complaint was the soup tasted as if they relied a little bit too much on MSG for flavor, and was quite salty. I was not that hungry to begin with, but the small size honestly was pretty small and I realized at the end that there was quite less noodles than I had thought. \n\nMy boyfriend got the same dish but the large size and agreed the portion sizes were not the greatest. Particular he noted that his bowl, while significantly larger than mine, was mostly just soup and not enough noodles. He thought the meat was dry and bland, and that the soup could be more rich and flavorful.\n\nOverall: Not my favorite pho joint, but not bad.", "rating": 3, "date": "2016-11-09"}, {"excerpts": ["I ordered the #8 Tái Bò Viên, pho with sliced rare steak and beef balls. ", "Juicy beef balls. ", "Chewy noodles. ", "Delicious broth. "], "author": "Steven L.", "review": "TL;DR: Excellent classic pho. Low prices. Huge portions. \n\nThe place was packed when we got there, but we were seated within a few minutes. \n\nEverything on the menu is very cheap. Most medium sized items range from $6 to 10. I ordered the #8 Tái Bò Viên, pho with sliced rare steak and beef balls. The medium was 9.25, a little pricier than the other items, probably because it was pure meat and none of the tripe/tendon that I wasn't quite feeling that day. \n\nIt was amazing. Their \"medium\" = huge. Tender meat. Juicy beef balls. Chewy noodles. Delicious broth. We got a huge plate of bean sprouts, basil, and lime on the side and it was fresh and not wilted like other pho places. \n\nUtensils and condiments are at each table, just like a classic pho place. Tea is served and is regularly refilled. I especially enjoyed their hot chili oil. They also take credit cards, much to my surprise!\n\nI'm definitely going back if I'm ever in the Irving district again!", "rating": 5, "date": "2015-12-10"}, {"excerpts": ["just the broth and the beef balls.\n", "It's an ok pho ", "and I like the place because the service is good although sometimes is hit or miss.\n", "Price is cheap the place is good ", "but I still prefer Y&Y in Inner Richmond.\n", "I'll return if I am in the area."], "author": "Ty N.", "review": "Every time I come here I always order the same thing: medium size beef ball pho and sometimes I ordered extra beef ball. I never really eat the noodle just the broth and the beef balls.\nIt's an ok pho and I like the place because the service is good although sometimes is hit or miss.\nPrice is cheap the place is good but I still prefer Y&Y in Inner Richmond.\nI'll return if I am in the area.", "rating": 3, "date": "2015-04-03"}, {"excerpts": ["When I'm in the mood for pho, I always go for the medium sized bowls of beef balls and noodles or the #2 (which is like the XL, but medium sized). "], "author": "Kathleen S.", "review": "Whenever I'm craving vietnamese food, the first place that comes to mind is Kevins Noodle House.\n\nI really like their vermicelli bowls with beef and pork as well as their eggrolls. So good! I think the amount of veggies in the bowl was just right and the taste was not bland at all. When I'm in the mood for pho, I always go for the medium sized bowls of beef balls and noodles or the #2 (which is like the XL, but medium sized). Super flavorful and perfect for the chilly SF weather.\n\nTheir service never fails either! I feel like no matter how big my party is, we always get seated immediately or within 5 minutes. Plus the wait for food has always been under 10 minutes. \n\nVery clean place and decent prices but it sucks they only have one restroom :(", "rating": 5, "date": "2012-09-19"}, {"excerpts": ["I like their Beef Rice Noodles Soup with beef balls and their brisket. ", "The meat and noodles pair well with the salty broth and the condiments on the side (hot sauce, sriracha, and hoisin sauce). ", "Other dishes that are good includes any of their vermicelli noodle plates. ", "The fish sauce mixed with the noodles create this sweet, yet tangy flavor. ", "The grilled meat is also nicely cooked and compliments the dish."], "author": "Jessica E.", "review": "Come to Kevin's Noodle House for good, cheap, and consistent Vietnamese food. I don't just come to Kevin's for the food, I come here for the quick service. When the restaurant is not packed, the food can come out in under 5 minutes. That's faster than any other fast food chain! However, when there is a wait, it still doesn't take too long. \n\nThey have a large menu to satisfy those Pho cravings plus other Vietnamese noodle dishes. I like their Beef Rice Noodles Soup with beef balls and their brisket. The meat and noodles pair well with the salty broth and the condiments on the side (hot sauce, sriracha, and hoisin sauce). Other dishes that are good includes any of their vermicelli noodle plates. The fish sauce mixed with the noodles create this sweet, yet tangy flavor. The grilled meat is also nicely cooked and compliments the dish.", "rating": 4, "date": "2014-06-30"}, {"excerpts": ["I enjoyed the skirt steak, but not so much the beef balls. ", "They were a little tough. ", "(Insert tough beef ball joke here.) ", "All in all, we had a good (and filling, for the small size which was super inexpensive) lunch here and ", "if in the neighborhood again, I might swing by this place for a second try. ", "More steak, less balls. ", "And I'll demand ice water!"], "author": "Amanda R.", "review": "I am halfway familiar with the popular Vietnamese dish, Pho, and wanted to seek some out while in San Francisco. We basically did a search by location and this was the best that came up. It was a cute little place, not super hole in the wall, but just one big dining room with not a ton of space. We got our own table against a wall and in time, our server brought us tea. I remember asking for ice water, but it never came. I didn't press the issue. \n\nThe noodles were actually really, really good and came out super fast. I think that's why you come here, not for the stellar service. We had a huge plate of cilatro and bean sprouts and jalapenos for the table, and lots of hot sauces and hoison sauce to play around with. I enjoyed the skirt steak, but not so much the beef balls. They were a little tough. (Insert tough beef ball joke here.) All in all, we had a good (and filling, for the small size which was super inexpensive) lunch here and if in the neighborhood again, I might swing by this place for a second try. More steak, less balls. And I'll demand ice water!", "rating": 3, "date": "2013-03-14"}, {"excerpts": ["http://www.yelp.com/biz_photos/Bfc3RwM7UAEohk9e19Q1xw?select=pLFp-BrLFH1GBFjNhkojJw\n- #20 kid size pho with beef balls http://www.yelp.com/biz_photos/Bfc3RwM7UAEohk9e19Q1xw?select=i9Tc02nixsrhmzhvgy6GGg\n- (2) #52A rice noodles with beef, carrots, various greens & a spring roll http://www.yelp.com/biz_photos/Bfc3RwM7UAEohk9e19Q1xw?select=IPhpTLISm1FMIodFxmV_0A\n\n"], "author": "Kylie L.", "review": "Lots of people loitering outside, you think there's a line but there isn't, just walk in.\n\n4 of us:\n- #1 XL pho with tripe, bean sprouts, various meats... http://www.yelp.com/biz_photos/Bfc3RwM7UAEohk9e19Q1xw?select=pLFp-BrLFH1GBFjNhkojJw\n- #20 kid size pho with beef balls http://www.yelp.com/biz_photos/Bfc3RwM7UAEohk9e19Q1xw?select=i9Tc02nixsrhmzhvgy6GGg\n- (2) #52A rice noodles with beef, carrots, various greens & a spring roll http://www.yelp.com/biz_photos/Bfc3RwM7UAEohk9e19Q1xw?select=IPhpTLISm1FMIodFxmV_0A\n\nEverything was good.\nWe were all stuffed.\nAll Kevin noodle houses are reliable and delicious.\nThis one is less cramped than the one at Westlake.\n\n5 stars: no wait, food comes out fast, cheap, & delicious.", "rating": 5, "date": "2010-06-23"}, {"excerpts": ["At every other pho restaurant I've ever eaten at, they have been SO stingy with the beef balls. "], "author": "Jennifer M.", "review": "LOVE this place. \n\nI'm from Boston and I've eaten my fair share of pho--probably way more than my fair share, actually,\n\nFirst of all, the guy who greeted us was super nice and friendly. He told us there was a bit of a wait due to an issue in the kitchen, and even after we left to go get a drink while we waited and we came back, he seated us right away. The service was a little slow after that, but it was probably just because of the problems in the kitchen. No big deal.\n\nAt every other pho restaurant I've ever eaten at, they have been SO stingy with the beef balls. If I get the Pho Bo Vien, I usually only get about 3-5 slices of beef ball. At this place, they gave me a whole bowl full! I got like 12 pieces of beef ball! I was incredibly happy. The quality of the food was great as well. \n\nOverall, I loved this place and would definitely come here again when I visit SF next time!", "rating": 5, "date": "2014-08-21"}, {"excerpts": ["Had a medium bowl, Dac Biet Bo Vien, Combination beef with beef balls. ", "Very good. ", "Lots of noodles, meat and had a good aroma. ", "Service was attentive, the place is clean, well lit and spacious. "], "author": "Phuoc K.", "review": "Good solid Pho. Had a medium bowl, Dac Biet Bo Vien, Combination beef with beef balls. Very good. Lots of noodles, meat and had a good aroma. Service was attentive, the place is clean, well lit and spacious. Not something you can say about all vietnamese joints. \n\nPrices I noticed were also pretty good. I think my medium bowl, which was a very decent size was only $6 I think. Definitely a good stop for a cold day.", "rating": 4, "date": "2011-11-29"}, {"excerpts": ["I always order their number 1 (typically the combination pho at most places) with extra beef balls, and it's never let me down. ", "I especially like the texture of their noodles, which are slightly chewier than at other pho places."], "author": "Nevin L.", "review": "Solid pho at a reasonable price. I always order their number 1 (typically the combination pho at most places) with extra beef balls, and it's never let me down. I especially like the texture of their noodles, which are slightly chewier than at other pho places.", "rating": 4, "date": "2011-12-12"}, {"excerpts": ["Brisket, beef balls, tendons, and tripe are all flavorful.\n", "-The Pork chop is thin, tender, and perfectly seasoned. ", "The piece of fat at the end just melts in your mouth.\n", "-The fresh spring rolls are light and refreshing. ", "The wrapper has perfect consistency. ", "The shrimp and vermicelli are both fresh and tasty.\n", "-The chicken wings are fried to perfection but lack spices and seasonings.\n", "Overall, this is a spacious and clean place to enjoy some good ole Vietnamese home cooking. ", "Its also nice that you can come here after dark without looking over your shoulder for those wacky TL characters!"], "author": "Siao W.", "review": "It is what it is...an awesome affordable place to get authentic Vietnamese soul food.\n-The Pho is tasty, authentic, and warms you up from head to toe on a cold winter (or summer) day. Brisket, beef balls, tendons, and tripe are all flavorful.\n-The Pork chop is thin, tender, and perfectly seasoned. The piece of fat at the end just melts in your mouth.\n-The fresh spring rolls are light and refreshing. The wrapper has perfect consistency. The shrimp and vermicelli are both fresh and tasty.\n-The chicken wings are fried to perfection but lack spices and seasonings.\nOverall, this is a spacious and clean place to enjoy some good ole Vietnamese home cooking. Its also nice that you can come here after dark without looking over your shoulder for those wacky TL characters!", "rating": 4, "date": "2012-01-16"}, {"excerpts": ["We ordered the pho with beef balls, tripe, rare beef and a pork chop rice with shrimp paste and egg.  \n\n"], "author": "Betty C.", "review": "Came here for a late lunch after going to Lake Merced and it was a satisfying lunch experience.\n\nWe ordered the pho with beef balls, tripe, rare beef and a pork chop rice with shrimp paste and egg.  \n\nThe pho noodles were good and the meat selection/combo was good. The pork chop rice was also grilled with a great flavor and the deep fried shrimp paste was good. If they offered the egg casserole as most traditional Vietnamese restaurants do with their pork chop rice I would give it an extra star as it is my favorite side dish but they only had a fried egg on this one.  \n\nWe also had the Vietnamese coffee (really strong and delicious) and the watermelon slush with boba (fresh watermelon taste and the boba was soft and sweet). \n\nOur bill came out to $23, definitely not bad but a little bit more pricey than what we normally pay for pho down in L.A. \n\nDon't know if we would come back \"pho\" sure but wouldn't rule it out =)", "rating": 3, "date": "2009-09-07"}, {"excerpts": ["The combination beef noodle soup (the one with the beef balls) or ", "if I'm really hungry, go for the #1 because its an X-Large.  ", "Sometimes I'll go for the chicken pho, but only if I don't feel like going to the Tenderloin for Turtle Tower.  ", "Other times I might try a rice plate or vermicelli as pho gets boring after so many times.  ", "The imperial rolls are okay, have had better.  ", "The chicken wings are VERY oily and not the best also.  ", "The plus with their chicken wings though, is that they make it themselves in the back.  ", "Other places uses frozen stuff and just toss it in the fryer ", "(ABC on Noriega).  ", "Food is okay.  "], "author": "Kevin K.", "review": "Kevin's Noodle house is just an example of Asian \"fast-food.\"\n\nThe food always comes out near instantly, making one wonder whether the food was precooked and just reheated (rice plates and vermicelli).  Noodle soups also come out almost right after you order.  Talk about fast food.\n\nI usually opt for the #2 The combination beef noodle soup (the one with the beef balls) or if I'm really hungry, go for the #1 because its an X-Large.  Sometimes I'll go for the chicken pho, but only if I don't feel like going to the Tenderloin for Turtle Tower.  Other times I might try a rice plate or vermicelli as pho gets boring after so many times.  The imperial rolls are okay, have had better.  The chicken wings are VERY oily and not the best also.  The plus with their chicken wings though, is that they make it themselves in the back.  Other places uses frozen stuff and just toss it in the fryer (ABC on Noriega).  Food is okay.  Very cheap and very filling.   \n\nJust wish the soup didn't look like dirty toilet water -_-  But hey, what pho restaurant has soup that doesn't look like that? Always ask for extra lime as it makes your food taste better, and gets rid of the smell.  I also wish the quality of their food was better.  The beef is rubbery a lot of times and has too much fat.  The tendon, which should be very soft, is always too tough for my liking.  Tripe is something I forgo at this place because of how chewy and raw it feels when I try to eat it.\n\nService isn't the best here.  A group of around 5-6 I came with, asked for ice water, and they just laughed and yelled \"ice water.\"  We never did get that ice water until we asked them for the 3rd time.  Terrible.  If we ask once, you should just bring it and not be so rude about it.  \n\nI guess I'll be coming back here whenever PPQ -right across the street -  is packed like it always is when I go.  If this place is also packed, then I'm waiting for PPQ.  For what you pay, and how fast the food comes out, it gets a 3 star in my book.  If the food was a little better, or if they even had what I could call \"service,\" they would probably get a 4 star.", "rating": 3, "date": "2011-05-30"}, {"excerpts": ["I tried  c Bit Bò Viên - special combo w/thin slices of steak, well-done brisket, flank, tendon & beef balls. "], "author": "Linda b.", "review": "I love pho! Nothing quite hits the spot on cold rainy nights after a long day at work.\n\nThis place does it right - cheap, fast and friendly. I tried  c Bit Bò Viên - special combo w/thin slices of steak, well-done brisket, flank, tendon & beef balls. It was truly spectacular!\n\nI will be back for more!", "rating": 5, "date": "2011-03-05"}, {"excerpts": ["My dad asked her if he could substitute his Tripe for Beef Balls instead.  ", "He's not a fan of Tripe.  ", "Now truth be told, the tripe", ", I'm sure is more expensive and Beef Balls.  ", "But the servers response was definitely very unnecessary. ", "She responded to our \"INSANE\" request with a stern NO, plain and simple...as if it was a huge inconvenience or something.  ", "I mean she could've said \"Sorry, no substitutions."], "author": "Cass J.", "review": "I enjoy the Pho here.  The broth is flavorful, and the portion of meat is reasonable.  \n\nFor a Vietnamese restaurant, this place definitely a lot cleaner than others that I have dined at.  A nice plus sign for Kevin's Noodle House.\n\nWhile ordering however, our server was extremely rude.  My dad asked her if he could substitute his Tripe for Beef Balls instead.  He's not a fan of Tripe.  Now truth be told, the tripe, I'm sure is more expensive and Beef Balls.  But the servers response was definitely very unnecessary. She responded to our \"INSANE\" request with a stern NO, plain and simple...as if it was a huge inconvenience or something.  I mean she could've said \"Sorry, no substitutions.\"   \n\nShe can't use the \"I don't speak English \" card, I won't buy it.  She was speaking perfect English to me as I was ordering my food.\n\nWhile this experience is somewhat petty, it started off our meal on the wrong foot.  \n\nOverall, this place is great getting food out quickly.  But our sour server really needs have an attitude check.", "rating": 3, "date": "2009-08-25"}, {"excerpts": ["I had the small #8, thinly sliced beef and beef balls...the bowl seems smaller than other vietnamese places ", "but eh maybe it was just me. "], "author": "Crystal C.", "review": "It's alright. Not the best I've had but one thing I do like is the choice between blending my red bean drink or keeping it whole. I had the small #8, thinly sliced beef and beef balls...the bowl seems smaller than other vietnamese places but eh maybe it was just me. The broth had a heavy in oil consistency so don't expect much. \n\nAlthough it was busy, service was good and obviously run by a family judging from the young kids working the counter.", "rating": 3, "date": "2010-07-18"}, {"excerpts": ["Usual dishes: fried shrimp cakes, beef stew with rice noodles, the #1, the #2 (same as #1 but one size down and with beef balls). ", "Definitely try the avocado shake!"], "author": "Stephen Y.", "review": "This is my local pho house. Sometimes we'll come here two or three times a week. Great portions, good value, friendly service, super fast - from ordering to your table in less than 4 minutes. Usual dishes: fried shrimp cakes, beef stew with rice noodles, the #1, the #2 (same as #1 but one size down and with beef balls). Definitely try the avocado shake!", "rating": 5, "date": "2010-02-04"}, {"excerpts": ["I ordered a #3 - which is basically a medium combination beef noodle soup without the beef balls. ", "The soup was very tasty and full of flavor. ", "Nothing like a hot bowl of noodles on a cold day right? ", "My friend order the glass noodles seafood soup - which looked really good too. ", "The fish cake appetizers was on the salty side, and nothing special ", "and I probably won't get this again - but this is called Kevin's noodle house, and not Kevin's appetizer house!"], "author": "Betty S.", "review": "This is a great pho place. I didn't think so at first - then I tried PPQ across the street and I realize how much better PPH was. The restaurant is big inside, plenty of tables and chairs and people just come get their noodles and go out- so getting a table is pretty easy here. If you don't want noodle soup, they have rice plates and bun (rice noodle) bowls. \n\nCame here last night with a friend because I had a craving for pho. I ordered a #3 - which is basically a medium combination beef noodle soup without the beef balls. The soup was very tasty and full of flavor. Nothing like a hot bowl of noodles on a cold day right? My friend order the glass noodles seafood soup - which looked really good too. The fish cake appetizers was on the salty side, and nothing special and I probably won't get this again - but this is called Kevin's noodle house, and not Kevin's appetizer house!", "rating": 4, "date": "2009-05-14"}, {"excerpts": ["The beef balls were good but not good enough to redeem the steak. ", "The crispy spring rolls tasted authentic but they look like regular Chinese spring rolls and the texture is different. "], "author": "Jordan G.", "review": "I wouldn't call myself a vietnamese food connoisseur by any stretch of the imagination, but I was slightly underwhelmed by my Kevin's Noodle House experience (who is this Kevin anyway? very elusive...) I ordered a large steak and beef ball soup and was a bit disappointed by how dry the steak was. The beef balls were good but not good enough to redeem the steak. The crispy spring rolls tasted authentic but they look like regular Chinese spring rolls and the texture is different. If you've had vietnamese fried rolls with the rice paper wrapping, you'd know what I mean.\n\nTo echo my fellow yelpers, the choice of size is KEY. My lady friend who has a significantly smaller appetite than myself ordered a smaller version of my beef noodle soup and we were both duly satisfied.", "rating": 3, "date": "2010-03-16"}, {"excerpts": ["I got a # one with beef balls, which is simply a combiniation pho containing the regular suspects: tripe, beef slices, tendon and beef brisket; I really felt like beef balls that night ", "so I got an addition order of those, which seemed to be the popular choice seeing how half the table did the same.\n", "In any case, the food came out within 10 minutes and having experienced a number of extra large bowls throughout pho places from norcal to socal the bowl I got seemed generous for the price that  I got it for ~ 7$ for a decent bowl, which really meant I had nothing to complain about the size haha. \n", "Now the first thing I do whenever I get a bowl of Pho is mix the contents and try the soup. ", "Of course the soup is going to smell amazing, but that's because the whole room is already filled with the smell of all the aromatic ingredients that it took to make the broth. ", "Anyway, the broth was delcious: rich and flavorful, you could tell that they actually brewed for atleast a night because you could taste all the rich flavors of the spices and meats. \n", "Overall, this place really hit the spot and the rest of my team can vouch; would I come again? ", "Of course! ", "Given i'm in the area and craving soup, this place would be my near the top of my list of places to fulfill my hunger! ", "Fair prices, friendly servers, decent decor, and tasty food, what more could you ask for? ", "Oh i know...more beef balls! ", "=D (they complimented the broth really well haha."], "author": "Jon K.", "review": "My first time here was a few weeks ago with my dragonboat team after practice; we came in ~25 people all with obvious signs of hunger. We asked for a table and we got it pretty quickly, only took a few minutes for whoever seemed to be in charge to get the other servers to arrange tables for us. The moment we sat down, waters and menus we in front of us and within a couple minutes we were all ready to order. I got a # one with beef balls, which is simply a combiniation pho containing the regular suspects: tripe, beef slices, tendon and beef brisket; I really felt like beef balls that night so I got an addition order of those, which seemed to be the popular choice seeing how half the table did the same.\nIn any case, the food came out within 10 minutes and having experienced a number of extra large bowls throughout pho places from norcal to socal the bowl I got seemed generous for the price that  I got it for ~ 7$ for a decent bowl, which really meant I had nothing to complain about the size haha. \nNow the first thing I do whenever I get a bowl of Pho is mix the contents and try the soup. Of course the soup is going to smell amazing, but that's because the whole room is already filled with the smell of all the aromatic ingredients that it took to make the broth. Anyway, the broth was delcious: rich and flavorful, you could tell that they actually brewed for atleast a night because you could taste all the rich flavors of the spices and meats. \nOverall, this place really hit the spot and the rest of my team can vouch; would I come again? Of course! Given i'm in the area and craving soup, this place would be my near the top of my list of places to fulfill my hunger! Fair prices, friendly servers, decent decor, and tasty food, what more could you ask for? Oh i know...more beef balls! =D (they complimented the broth really well haha.", "rating": 5, "date": "2010-09-09"}, {"excerpts": ["I recommended their  pho with beef balls very good."], "author": "Aniko N.", "review": "I recommended their  pho with beef balls very good.", "rating": 4, "date": "2012-03-18"}, {"excerpts": ["I always get a number 1 and add beef balls, and fresh spring rolls.  "], "author": "Terence P.", "review": "It is what it is.  \n\nI have been going to this place ever since i was just a little high school student.  That was over 10 years ago, and i still frequent this place.  The service, if you can even call it that is pretty much non existent, but the food is so good.  I always get a number 1 and add beef balls, and fresh spring rolls.  I usually ask for water which never comes out, but hey, they give you tea.  \n\nThe bowl of PHO is pretty big and packed with loads of goodness.  I went through a phase where i ate that 5 days in a row, and i usually am seen here at least once a week.  I work right around the corner.\n\nIm actually craving some right now....", "rating": 4, "date": "2009-06-14"}, {"excerpts": ["It had beef balls, slices of beef, tripe, and beef fat with plenty of noodles and plenty of broth. ", "It was supposedly a medium but boy was I stuffed. "], "author": "Stu M.", "review": "I don't really even know what I ordered, as in what the name of it was. My dining companions were slightly rude and said \"we\" were ready when I in fact had just arrived. And I wasn't bold enough to speak up because I just met them.\n\nIn any case, I quickly looked down and picked the \"number two\" because it was pho and it had beef in it. What a great choice this turned out to be. It had beef balls, slices of beef, tripe, and beef fat with plenty of noodles and plenty of broth. It was supposedly a medium but boy was I stuffed. And I had been holding back on my caloric intake the rest of the day in preparation, but I was still stuffed.\n\nAnd then the bill came. Of course, mine was cheap, $6 or something. But then my dining companions pulled another one out of their hat and were trying to short the bill. $22 for a $20.40 bill? I think not. I had to prod them until there was $24 on the table, which still didn't seem like enough really but it was good enough.\n\nOverall I don't know if it was mainly my hunger that convinced me this was so awesome, but I do know that I left thoroughly satisfied. Coming in after drinking a couple Tecates across the street, I didn't really notice much of what was going on around me but I also know that the service was good enough for me to not be in want of anything. Our food arrived very quickly.\n\nI am going to dream about my pho (I hope).", "rating": 5, "date": "2008-10-08"}, {"excerpts": ["I love how their beef balls are well-cooked and not all chewy . ", "I LOVE their shrimp spring rolls . ", "I love how its small & wrapped tightly . ", "I think it tastes better that way =] ", "The thai iced tea is pretty good too . ", "It's nice how they give you to-go cups instead of glass . ", "Btw , the thai iced tea does not have ice cubes in it .. ", "it has shaved ice ."], "author": "Eileen L.", "review": "3.5 stars\n\nI don't know why my friends keep telling me not to come here because their pho is actually not that bad . Their pho is not the best , but it's alright . I love how their beef balls are well-cooked and not all chewy . I LOVE their shrimp spring rolls . I love how its small & wrapped tightly . I think it tastes better that way =] The thai iced tea is pretty good too . It's nice how they give you to-go cups instead of glass . Btw , the thai iced tea does not have ice cubes in it .. it has shaved ice .", "rating": 4, "date": "2008-11-12"}, {"excerpts": ["I ordered pho with beef and beef balls. ", "Since i just took my wisdom tooth out it was difficult for me to eat. ", "But it was really good, I still had a delicious dinner. ", "I have to say they didn't disappoint, it came in like 5 min. ", "What more can you ask?"], "author": "Andrew H.", "review": "Honestly this place was a lot better than i expected to be. Tonight i just dropped by and ate with a friend. And the prices are so much better than the one across the street. And this place is a lot cleaner than the other one. I am glad that i finally got to check this place out. Probably from now on im going to eat here instead of the one across. Not bad. Not bad at all. \n\nOK now the food. I ordered pho with beef and beef balls. Since i just took my wisdom tooth out it was difficult for me to eat. But it was really good, I still had a delicious dinner. I have to say they didn't disappoint, it came in like 5 min. What more can you ask?", "rating": 5, "date": "2009-09-10"}, {"excerpts": ["My favorite is #2, medium special combo with thin slices of steak, brisket, flank, tendon, tripe and beef balls."], "author": "Jess H.", "review": "My go-to pho place, especially great on a cold day. Quick service, cheap and delicious pho. My favorite is #2, medium special combo with thin slices of steak, brisket, flank, tendon, tripe and beef balls.", "rating": 4, "date": "2012-01-21"}, {"excerpts": ["Number 1 FTW (unless u want beef balls)", ", BBQ is pretty good if u want a break from delicious noodles, tender beef and amazing broth (i usually drink it all)."], "author": "Ryan Y.", "review": "OMFG!!!! you want a bowl of pho? get ur ass over to kevins. Its not fancy or exotic. its just legit pho and bbq cooked by legit vietnamese ppl who are super chill. Kevins isnt the most beautiful place but thats not why u came here with a terrible hangover or maybe slightly tipsy. its simply good food unlike PPQ across the street.\n\nThis is my fav place on irving and ive been coming here for YEARS. My proudest moment was getting tipsy with a bunch of white friends and piling over to Kevins for somedeliciousness and introducing the world of pho to them. WIN!\n\nNumber 1 FTW (unless u want beef balls), BBQ is pretty good if u want a break from delicious noodles, tender beef and amazing broth (i usually drink it all).", "rating": 5, "date": "2009-06-17"}, {"excerpts": ["Anyway, I usually order the steak flank and beef balls with beef noodle soup.  ", "Their rice dishes are very good as well."], "author": "Lily T.", "review": "Love the Pho here. I think it's the best in the city!  If my friend hadn't introduced me to the Pho restaurant  in Sunnyvale, I'd give Pho Hao Hiep 5 stars.  Anyway, I usually order the steak flank and beef balls with beef noodle soup.  Their rice dishes are very good as well.", "rating": 4, "date": "2007-02-03"}, {"excerpts": ["The only thing about their pho that I don't like is the beef balls - a bit peppery and too much filler. ", "But that broth is damn good."], "author": "Scott M.", "review": "Somehow my old review of this place ended up under \"Pho Clement\" (never been there). Anyway, this place has tasty pho. The only thing about their pho that I don't like is the beef balls - a bit peppery and too much filler. But that broth is damn good.", "rating": 4, "date": "2006-09-17"}, {"excerpts": ["The waiter couldn't quite understand my friend's order, which was for only beef balls, but he got it taken care of. ", "It's affordable ", "and I always leave really full. ", "The atmosphere's nice ", "and it's pretty to sit in and just enjoy with friends."], "author": "Peyton L.", "review": "This place was really good. I had the seafood pho, #28. The waiter couldn't quite understand my friend's order, which was for only beef balls, but he got it taken care of. It's affordable and I always leave really full. The atmosphere's nice and it's pretty to sit in and just enjoy with friends.", "rating": 5, "date": "2009-01-11"}], "chinese sausage": [{"excerpts": ["hu ky (aka Chinese sausage, pork chop, and shrimp cake) is a mean dish, especially when doused with a tangy but sweet nuoc mam fish sauce. "], "author": "Jando S.", "review": "I really had higher hopes for Pho Huynh Hiep 2 aka Kevin's Noodle House. San Francisco has never really been known for its Vietnamese food and it's place like this that prove the notion to be true. Most of all I've sampled here in some way remind me of the Vietnamese fare back home in NYC. which is not a good thing. Hence, 3.5 stars rounded down is the best I can do for now.\n\nLike most Vietnamese spots that specialize in noodles and soups, pho is a natural benchmark to go on. Only problem is, the broth is mad bland. I've had my fair share of pho tai and pho tai chin / nam bowls here, all priced accordingly at less than $7 each but either its loaded with MSG (likely) and / or prepped with subpar seasoning (also likely). In the unlikelihood its just bad luck, I still haven't mustered a decent bowl of pho here just yet.\n\nThe other noodle soups, like bun rieu, hu tieu, and bun bo hue  or even mi hai son (seafod) are also low on the Viet totem pole of deliciousness. The broth in all need some work. From a noodle standpoint, the consistency is there, but the broth is one essential that locks everything in place; an equalizer of sorts. It's just not there and that strikes out a sizeable portion of the menu. \n\nRice plates have fared better, which is their saving grace. Their meaty combo platter - com suon lap xuong tau hu ky (aka Chinese sausage, pork chop, and shrimp cake) is a mean dish, especially when doused with a tangy but sweet nuoc mam fish sauce. I also have some love for the bun thit nuong cha gio, otherwise known as vermacelli with pork chop and spring rolls. It's got a lot of textures going on, served in a decent portion if I've ever seen one.\n\nWhile there are some Viet servers, let us not forget this is The Richmond area. Most everyone will be Chino, which includes lots of the wait staff. They're not the friendliest bunch, so make sure you've got your orders straight before they ask (unhappily) again.", "rating": 3, "date": "2014-03-11"}, {"excerpts": ["#46 hits the spot - It's porkchop with rice served with chinese sausage, a shrimp cake, and soup rounding out to be a very incredible and satisfying meal. ", "Also, people that I go with tend to like getting an egg on top. "], "author": "Lillian N.", "review": "OK, so, I have gave Kevin's another try (alright...make that.. 10+ additional tries) since my last post. After reviewing this place and giving it a 2 on my last yelp review, I knew that there was something that I must have missed about this place my first go-around, so I came back... and then back at least 10 times since then within a span of probably 2 months or so. I LOVE Kevin's... it's affordable, delicious, and almost ALWAYS on point.\n\n#46 hits the spot - It's porkchop with rice served with chinese sausage, a shrimp cake, and soup rounding out to be a very incredible and satisfying meal. Also, people that I go with tend to like getting an egg on top. Apparently it \"seals the deal\" on this meal.\n\nKevin's... I'm so sorry that I didn't believe in you my first time around, but best believe that I will be a loyal customer for many many Sunday morning hung over meals to come... :)", "rating": 5, "date": "2013-02-05"}], "fried eggroll": [{"excerpts": ["Their fried eggroll did not impress me at all. ", "I would not get it again. ", "It's not what I expected from typical Vietnamese places."], "author": "Carmen C.", "review": "I come here twice a week and order the exact same thing... that's how much I like this place!\nThere is absolutely no wait (for dinner on a weekday), but I'd suggest coming during non-peak hours on the weekends. Wait time is usually pretty fast considering they get their food out in less than 10 minutes.\n\nPho - Their pho is so good! Warm and served super fast! They don't skimp on the noodles or the meat and the broth is flavorful. They bring out the beansprouts, basil, mint, limes, peppers for you to add too. I order the pho with raresteak and brisket. Absolutely delicious.\n\nRice plates - When I'm not feeling pho, rice plates are the way to go! Their porkchop rice plates sure hit the spot. They're large plates with flavorful porkchop grilled to perfection. Sometimes it's a little burnt, but you just deal with it. Haha I get the plate with the sunny side up egg, porkchop, shrimpcake and rice. Also comes with a side of soup (broth).\n\nEggroll - Their fried eggroll did not impress me at all. I would not get it again. It's not what I expected from typical Vietnamese places.", "rating": 5, "date": "2014-06-19"}], "shredded pork": [{"excerpts": ["I usually order #37 (Grilled pork chop, shredded pork, egg with steamed rice) and # 41(Grilled pork chop, fried shrimp cakes, egg with steamed rice) the steamed rice is so fluffy, I donno how they do it. ", "Can't find better rice plates anywhere else!! ", "True story!!"], "author": "R C.", "review": "Most people come here for pho. Yes, sure,  their pho is very yummy. I agree. But what's also really good here is their rice plates and fried shrimp cakes!!! I usually order #37 (Grilled pork chop, shredded pork, egg with steamed rice) and # 41(Grilled pork chop, fried shrimp cakes, egg with steamed rice) the steamed rice is so fluffy, I donno how they do it. Can't find better rice plates anywhere else!! True story!!", "rating": 4, "date": "2017-03-08"}, {"excerpts": ["As an appetizer, we had some shredded pork spring rolls. ", "Their #1 was the noodle soup with tripe and flank steak. ", "Lastly, Mona had the smaller version of mine.\n \n", "[M] ", "Everything tasted pretty normal as usual. ", "The only thing is that I usually enjoy the Shrimp Spring Rolls with the peanut sauce but the Shredded Pork Spring Roll was quite interesting as well. ", "The noodle soup tastes like any other noodle soup with the raw bean sprouts, basil, tripe, tendon, and flank steak. ", "Just remember to add that hoisin sauce and it'll taste even better : )"], "author": "Mona C.", "review": "[M]ona: 3.5 Stars\n[W]ayne: 3 Stars\nAverage: 3.25 Stars\n\n+ VERY Fast Service\n+ Accepts Credit Cards\n+ Spacious\n \n[W] Kevin's Noodle House.....man there's like a million of these! This is a place to be if you want to get something quick and cheap. The nice thing about this type of restaurant is that they're usually open late. So when everything else fails, you can always rely on a pho place haha. Nothing really special about this Kevin's Noodle House from the rest. Their menu is the same as everyone elses, and the food as well. As an appetizer, we had some shredded pork spring rolls. Their #1 was the noodle soup with tripe and flank steak. Lastly, Mona had the smaller version of mine.\n \n[M] Everything tasted pretty normal as usual. The only thing is that I usually enjoy the Shrimp Spring Rolls with the peanut sauce but the Shredded Pork Spring Roll was quite interesting as well. The noodle soup tastes like any other noodle soup with the raw bean sprouts, basil, tripe, tendon, and flank steak. Just remember to add that hoisin sauce and it'll taste even better : )", "rating": 3, "date": "2009-12-29"}, {"excerpts": ["Yummy, meat, shredded pork and eggs! "], "author": "Mandy D.", "review": "I love their rice plate! Yummy, meat, shredded pork and eggs! The way to eat!\n\nIt just sucks that there is only one bathroom. Especially when you have a group of 6 and half of them wanted to go to the bathroom before we left.", "rating": 4, "date": "2010-07-24"}, {"excerpts": ["Wasn't fan of the shredded pork though, a little too dry.\n\n"], "author": "Rodney J.", "review": "Cheap, quick, and somewhat clean (compared to other Viet places in city).\nA1 nice and crispy.  \n\nPho broth not too bad.  A little watered down home-made chicken broth, but can't complain.  Still tasty.  \n\nRice dishes are okay (chicken/pork).  Wasn't fan of the shredded pork though, a little too dry.\n\nService very quick so even if 5 tables in front of you, it's only a 15min wait.  Guy someone remembers everyone's placement too without writing down names.  That's amazing in itself.", "rating": 4, "date": "2014-08-26"}, {"excerpts": ["So instead, I ordered Rice with Pork Chop with Shredded Pork.\n\n", "The pork chop, the shredded pork all sitting on top of the white rice.. so beautiful. ", "It came with some soup. ", "It taste delicious too. ", "I'm lovin "], "author": "Yohann S.", "review": "Made new friends down here. Kudos to Willie for paying for the foods.\n\nParking.. is a little bit difficult.. since it's right in the middle of the area that surrounded by groceries stores, corner stores and restaurants.\n\nI went there with my gf, her friend and her friend's friends. So it's like there are 5 of us altogether. All of them ordered some type of pho and stew. I got tired of having pho every single time I went to Vietnamese restaurant. So instead, I ordered Rice with Pork Chop with Shredded Pork.\n\nTheir orders came out first.. obviously - it's pho.. it's like the quickest to make and serve. But I don't mind waiting a little longer. I've been trying to get a taste of their (Vietnamese) infamous Pork Chop Rice. And then it came.\n\nThe pork chop, the shredded pork all sitting on top of the white rice.. so beautiful. It came with some soup. It taste delicious too. I'm lovin every bite of my food.\n\nI'm also glad that the price of a Pho house in SF also the same with the one in my city, Philadelphia. Cheap!\n\nService.. just the same with every Pho restaurant out there. Regular. Nothing special.\n\nThere's a reason behind this 4 stars.. and not 5. When my new friend paid for all of our meals, and he already gave them tips and all.. we were still staying there to chat while drinking tea and stuffs. About 1/2 hour passed by.. suddenly one of their waiter stood closely to our table and started to glare at us repeatedly.. like wanted us to just get out and moved our conversation somewhere else. We got the hint and felt uncomfortable. So we decided to bounce. Too bad...", "rating": 4, "date": "2011-01-27"}, {"excerpts": ["I usually go there for the vermicelli (cold noodles) with their shredded pork, shrimp rolls, and grilled chicken with fish-sauce vinegarette.  ", "Their soup bowls are in three sizes so you have control of how much you want to eat.  ", "Some places bring one standard size and you basically throw away uneaten food or you force feed yourself.  ", "Yay, no need to gorge yourself of pho noodles!  ", "They also have bubble tea drinks as well as smoothies.  ", "The sound can get a little over the legal decibel limit but it also adds to the feel of being at a traditional pho house.  ", "Writing this makes me hungry again even though I just ate dinner..."], "author": "01010110 0.", "review": "Great place to get Pho and other dishes.  I usually go there for the vermicelli (cold noodles) with their shredded pork, shrimp rolls, and grilled chicken with fish-sauce vinegarette.  Their soup bowls are in three sizes so you have control of how much you want to eat.  Some places bring one standard size and you basically throw away uneaten food or you force feed yourself.  Yay, no need to gorge yourself of pho noodles!  They also have bubble tea drinks as well as smoothies.  The sound can get a little over the legal decibel limit but it also adds to the feel of being at a traditional pho house.  Writing this makes me hungry again even though I just ate dinner...", "rating": 5, "date": "2013-06-19"}, {"excerpts": ["The shredded pork and grilled pork rice plate was delicious. ", "The shredded pork wasn't too dry. ", "There was a good ratio of meat to rice. ", "A great place to go for cheap and delicious food. ", "You will leave feeling just right."], "author": "Eve C.", "review": "A great pho place in the city. The broth is not too salty compared to many of the other pho places. The portions are perfect and not too large. The shredded pork and grilled pork rice plate was delicious. The shredded pork wasn't too dry. There was a good ratio of meat to rice. A great place to go for cheap and delicious food. You will leave feeling just right.", "rating": 4, "date": "2010-10-28"}, {"excerpts": ["I ordered the shredded pork and grilled pork chop rice, because I wasn't in a mood for pho. ", "It came and it was delicious. ", "The shredded pork wasn't what I expected ", "but it sure it taste good. ", "The lady back there always making drinks was cool. ", "It was fun sitting there and watching her juggle between making drinks. ", "They sure do need a second blender! ", "Haha. ", "Good stuff. "], "author": "Danielle Y.", "review": "Ah. To put it simply, I just love this place. Atmosphere here is quite refreshing. Shaved ice machine, skylights. So I just recently came here with my friends for food. I ordered the shredded pork and grilled pork chop rice, because I wasn't in a mood for pho. It came and it was delicious. The shredded pork wasn't what I expected but it sure it taste good. The lady back there always making drinks was cool. It was fun sitting there and watching her juggle between making drinks. They sure do need a second blender! Haha. Good stuff. Good stuff. \n\nP.S. It always seems like there's a line for the bathroom.", "rating": 5, "date": "2009-06-20"}], "beef boneless pork or chicken": [], "chicken wing": [{"excerpts": ["but i do see people enjoy the combo meals like porkchop and fried chicken wing or something."], "author": "Vincent K.", "review": "This is my pho place for now.  It's the closest, tastiest place to my house in the other side of the GGP.  The soup is very flavorful and perfect.  I usually get the large #1 pho and the amount is very satisfying for only $7.  Their fried chicken wings is alright, same with egg rolls.  but i never really try the other things but i do see people enjoy the combo meals like porkchop and fried chicken wing or something.", "rating": 4, "date": "2007-10-17"}], "shrimp cake": [{"excerpts": ["My friend ordered the grilled beef and shrimp cake, which I got to try some of. ", "It was quite tasty... whatever they use to marinate their meat is on point! ", "And the shrimp cake was well done too. ", "I don't think I've ever had shrimp cake stuffed in a thin tofu pocket and deep fried! \n\n"], "author": "Sherry L.", "review": "I could probably eat here every night and my wallet would still be happy! I came here on the recommendation of a friend who I trust with any and all SF restaurant recommendations.\n\nThey only seat complete parties, and rightfully so. They were packed when we got there! Thankfully, the \n\nI was impressed with how extensive the menu was. There were more options for pho than I've seen at other places, with options for different cuts of meat to different levels of doneness. In addition to the pho, there were also vermicelli bowls and rice plates, as well as an assortment of drinks. \n\nI ordered a medium #5 pho mostly because I'm terrified of eating rare meat, but I also wanted something other than just the brisket. The medium was actually quite a bit of food. I rarely struggle to finish a bowl of pho, but I was super stuffed by the time I finished all of the noodles! \n\nMy friend ordered the grilled beef and shrimp cake, which I got to try some of. It was quite tasty... whatever they use to marinate their meat is on point! And the shrimp cake was well done too. I don't think I've ever had shrimp cake stuffed in a thin tofu pocket and deep fried! \n\nI will definitely be back, and am so excited to bring my parents here as well!", "rating": 4, "date": "2018-07-19"}, {"excerpts": ["the shrimp cake look good but my friend didnt like it either"], "author": "Michael P.", "review": "This place looked crowded... we tried it and we didnt like it.... the pho, the pork chop on the rice place.... it dont taste that good... they gave me the wrong flat fresh noodle that i ordered too... that big noodle usually for chow fun chinese food kind of style... the shrimp cake look good but my friend didnt like it either", "rating": 3, "date": "2018-06-15"}, {"excerpts": ["It's basically a fried shrimp cake that comes with fish sauce, and it's pretty good to eat with some pho since it contrasts it with its crispiness and chewiness. ", "I ordered their pho here ", "and it's pho-licious. ", "It comes out quick and it comes out hot. ", "There's not much to say about it except that it's a pretty good bowl of pho. ", "If you're not down for pho, however, they also have a wide selection of dishes such as vermicelli, beef stew, bbq rice plates, and more!"], "author": "Joshua M.", "review": "Kevin's Noodle House is everywhere nowadays and is always poppin' with lots of hungry people!\n\nI came here with a group of friends after watching the Warriors destroy the Cavs during the NBA Finals. We got their Tàu H Ky to share as an appetizer. It's basically a fried shrimp cake that comes with fish sauce, and it's pretty good to eat with some pho since it contrasts it with its crispiness and chewiness. I ordered their pho here and it's pho-licious. It comes out quick and it comes out hot. There's not much to say about it except that it's a pretty good bowl of pho. If you're not down for pho, however, they also have a wide selection of dishes such as vermicelli, beef stew, bbq rice plates, and more!", "rating": 4, "date": "2017-06-16"}, {"excerpts": ["Their fried shrimp cake appetizers are great!! "], "author": "Nancy C.", "review": "This is THE spot during my high school days. It wasn't until I expanded my pho experiences at other places that I have realized this place wasn't all that great. I would still come here once in awhile. They get the job done.\n\nI like their vermicelli bowls! Imperial rolls are always on point. Their noodle soups are very mediocre, nothing special. Broth is on the salty side. Noodles are sometimes too chewy. \n\nOh!! Their fried shrimp cake appetizers are great!! Probably my favorite thing off the menu. \n\nService is always good and the line is never too long. Still probably one of my go-to pho places.", "rating": 3, "date": "2016-07-02"}, {"excerpts": ["Grilled pork, shrimp cake and egg! "], "author": "Carol Y.", "review": "5 stars for quick service\n\nFavorite is number 32 - beef stew noodle soup. So many beef in one bowl! They don't skim on the portions!\n\nIf I had to choose a rice plate - number 42! Grilled pork, shrimp cake and egg! Yumm!!\n\nCheap and satisfying!", "rating": 5, "date": "2017-01-29"}, {"excerpts": ["We get this every time we are in the city, we usually get the rice plate with pork chop and shrimp cake & egg :)"], "author": "Lyn X.", "review": "We get this every time we are in the city, we usually get the rice plate with pork chop and shrimp cake & egg :)", "rating": 5, "date": "2017-09-24"}, {"excerpts": ["hu ky (aka Chinese sausage, pork chop, and shrimp cake) is a mean dish, especially when doused with a tangy but sweet nuoc mam fish sauce. "], "author": "Jando S.", "review": "I really had higher hopes for Pho Huynh Hiep 2 aka Kevin's Noodle House. San Francisco has never really been known for its Vietnamese food and it's place like this that prove the notion to be true. Most of all I've sampled here in some way remind me of the Vietnamese fare back home in NYC. which is not a good thing. Hence, 3.5 stars rounded down is the best I can do for now.\n\nLike most Vietnamese spots that specialize in noodles and soups, pho is a natural benchmark to go on. Only problem is, the broth is mad bland. I've had my fair share of pho tai and pho tai chin / nam bowls here, all priced accordingly at less than $7 each but either its loaded with MSG (likely) and / or prepped with subpar seasoning (also likely). In the unlikelihood its just bad luck, I still haven't mustered a decent bowl of pho here just yet.\n\nThe other noodle soups, like bun rieu, hu tieu, and bun bo hue  or even mi hai son (seafod) are also low on the Viet totem pole of deliciousness. The broth in all need some work. From a noodle standpoint, the consistency is there, but the broth is one essential that locks everything in place; an equalizer of sorts. It's just not there and that strikes out a sizeable portion of the menu. \n\nRice plates have fared better, which is their saving grace. Their meaty combo platter - com suon lap xuong tau hu ky (aka Chinese sausage, pork chop, and shrimp cake) is a mean dish, especially when doused with a tangy but sweet nuoc mam fish sauce. I also have some love for the bun thit nuong cha gio, otherwise known as vermacelli with pork chop and spring rolls. It's got a lot of textures going on, served in a decent portion if I've ever seen one.\n\nWhile there are some Viet servers, let us not forget this is The Richmond area. Most everyone will be Chino, which includes lots of the wait staff. They're not the friendliest bunch, so make sure you've got your orders straight before they ask (unhappily) again.", "rating": 3, "date": "2014-03-11"}, {"excerpts": ["I had their #13 and shrimp cake appetizer and they were both delicious! ", "I will definitely return for more!"], "author": "Young Y.", "review": "Excellent pho broth. I had their #13 and shrimp cake appetizer and they were both delicious! I will definitely return for more!", "rating": 5, "date": "2016-10-21"}, {"excerpts": ["Rice plate w/ BBQ pork, egg, shrimp cake, salad. ", "Excellent ! ", "As good as their Pho', and almost as good as the rice plates in San JO. ", "Dunno why they wouldn't go fully authentic w/ ", "a Com tam (broken rice) style meal since they have all the ingredients, except that broken rice. ", "On second thought, I don't like Broken Rice, too much drama."], "author": "Matsuo U.", "review": "Went the rice route this time, which is not an uncommon path for me. Rice plate w/ BBQ pork, egg, shrimp cake, salad. Excellent ! As good as their Pho', and almost as good as the rice plates in San JO. Dunno why they wouldn't go fully authentic w/ a Com tam (broken rice) style meal since they have all the ingredients, except that broken rice. On second thought, I don't like Broken Rice, too much drama.", "rating": 4, "date": "2015-12-28"}, {"excerpts": ["The shrimp cake was good as well, crunchy on a the outside with the cake on the inside having the shrimpy goodness I expected.\n\n"], "author": "Veasna H.", "review": "3.5 \n\nPretty solid Pho here for it being SF.  I grew up in San Jose, so my Pho benchmark is pretty high.  Actually with that being said, this is top tier SF pho.  The broth is what distinguishes it from other SF spots.  \n\nThe rice plates here are standard.  They pork chops are well seasoned and the fish sauce is pretty good. The shrimp cake was good as well, crunchy on a the outside with the cake on the inside having the shrimpy goodness I expected.\n\nService here is quick and efficient.  It does get pretty busy because of its location and parking can be a disaster.  \n\nIf you are looking for good pho within the city limits, this is probably your best shot.  Authentic and reasonably priced!", "rating": 3, "date": "2014-10-06"}, {"excerpts": ["We also shared the fried shrimp cake appetizer, which was pretty good. "], "author": "Abby S.", "review": "Food (3/5): The other two in my group got the medium sized pho (#2 and #8), while I got the vermicelli with grilled pork and egg roll. All the food was good but not outstanding. The vermicelli had good flavors, but it didnt look very fresh when it came out, and that was a bit off-putting. We also shared the fried shrimp cake appetizer, which was pretty good. The flavor reminds me of those pink shrimp chips! \n\nService (4/5): We were seated quickly, and food came out quickly too. \n\nValue (4/5): Each bowl of noodles was less than $10, and the portions were pretty sizable. I think Yummy Yummy has way better value, though.\n\nOverall I think this is a solid place to get your pho fix, but I wasn't as impressed as I expected to be. Maybe I ordered the wrong thing?", "rating": 3, "date": "2016-01-26"}, {"excerpts": ["The pork chop was very flavorful and juicy and the shrimp cake itself was simply delicious. ", "The only thing i would complain about is the swarm of flies which most restaurants have trouble dealing with but overall the dishes are always consistent in leaving you satisfied."], "author": "Bernard W.", "review": "Kevin's Pho Place is now my pho place  the rice dish has decent portion size to fill a hungry college student's belly while meeting your eating budget. The pork chop was very flavorful and juicy and the shrimp cake itself was simply delicious. The only thing i would complain about is the swarm of flies which most restaurants have trouble dealing with but overall the dishes are always consistent in leaving you satisfied.", "rating": 4, "date": "2015-08-13"}, {"excerpts": ["I order fried egg rolls, fried shrimp cake, and grilled beef and rice. ", "The wait wasn't  too bad consider the amount of orders they had to prepare. ", "I really loved their appetizers.  ", "The shrimp cake was delicious!  \n\n"], "author": "Olivia C.", "review": "I stopped by for lunch to grab some food to go. The place was packed and super busy so I thought the foods going to be great. I order fried egg rolls, fried shrimp cake, and grilled beef and rice. The wait wasn't  too bad consider the amount of orders they had to prepare. I really loved their appetizers.  The shrimp cake was delicious!  \n\nThe only weird thing I noticed is I felt a bit nausea and shaky hours later. I think it might be the msg. Or simply the amount of fried food I ate which gave me a sodium over load. It's a good place to eat but in moderation.", "rating": 4, "date": "2015-09-30"}, {"excerpts": ["The bbq pork was flavorful and the shrimp cake wasn't too oily (like some other places I've been to). ", "Overall nice place ", "and I would come back"], "author": "Kris T.", "review": "Fast service and good food. Clean place and the iced coffee is good to perk up ur meal if ur feeling tired. I ordered #42 and it was good. The bbq pork was flavorful and the shrimp cake wasn't too oily (like some other places I've been to). Overall nice place and I would come back", "rating": 4, "date": "2013-06-03"}, {"excerpts": ["#46 hits the spot - It's porkchop with rice served with chinese sausage, a shrimp cake, and soup rounding out to be a very incredible and satisfying meal. ", "Also, people that I go with tend to like getting an egg on top. "], "author": "Lillian N.", "review": "OK, so, I have gave Kevin's another try (alright...make that.. 10+ additional tries) since my last post. After reviewing this place and giving it a 2 on my last yelp review, I knew that there was something that I must have missed about this place my first go-around, so I came back... and then back at least 10 times since then within a span of probably 2 months or so. I LOVE Kevin's... it's affordable, delicious, and almost ALWAYS on point.\n\n#46 hits the spot - It's porkchop with rice served with chinese sausage, a shrimp cake, and soup rounding out to be a very incredible and satisfying meal. Also, people that I go with tend to like getting an egg on top. Apparently it \"seals the deal\" on this meal.\n\nKevin's... I'm so sorry that I didn't believe in you my first time around, but best believe that I will be a loyal customer for many many Sunday morning hung over meals to come... :)", "rating": 5, "date": "2013-02-05"}, {"excerpts": ["I got a thin steak pho and the BF had grilled chicken, shrimp cake and rice.\n", "Pho was really hot and tasty got takeout and was still super hot when i got home.\n", "rice dish was good but the shrimp cake was kinda blah.\n\n\n"], "author": "Adriana L.", "review": "not too experienced in the Pho world but i thought this place was really good. Drove by and decided to stop in, staff was super friendly and order came out really quick \n(less that 10 min) for takeout.\n\nI got a thin steak pho and the BF had grilled chicken, shrimp cake and rice.\nPho was really hot and tasty got takeout and was still super hot when i got home.\nrice dish was good but the shrimp cake was kinda blah.\n\n\ndefinitely stop by this place if you need some pho its well worth it!", "rating": 4, "date": "2013-05-23"}, {"excerpts": ["The shrimp cake that was included with my rice plate was out of the world. ", "Appetizer fried spring rolls were perfectly cooked. ", "My friends had pho and said it was their best. ", "Fast service and was busy during noon lunchtime on Saturday. ", "Parking is hard to come by in the neighborhood area so be patient and will be worth the wait."], "author": "Bill M.", "review": "Definitely one of the best pho place I've been to - just happened to find the nearest one after leaving Golden Gate Bridge and driving south. Had #42 rice plate - excellent! The shrimp cake that was included with my rice plate was out of the world. Appetizer fried spring rolls were perfectly cooked. My friends had pho and said it was their best. Fast service and was busy during noon lunchtime on Saturday. Parking is hard to come by in the neighborhood area so be patient and will be worth the wait.", "rating": 5, "date": "2015-01-03"}, {"excerpts": ["Shrimp cake was delicious by the way"], "author": "Francis A.", "review": "I usually go to Westlake, but at Irving St. very friendly service, that is why I give them 5 stars. Shrimp cake was delicious by the way", "rating": 5, "date": "2014-12-20"}, {"excerpts": ["Very good shrimp cake. ", "Some of the waiters were not very friendly."], "author": "Suwito S.", "review": "Love their bbq chicken over rice. Very good shrimp cake. Some of the waiters were not very friendly.", "rating": 3, "date": "2014-10-16"}, {"excerpts": ["The bean curd skin on the shrimp cake wasnt crispy.  ", "The meat marinate was average.  ", "I guess SF dont have good Viet restaurants?  ", "With 400 reviews, I was expecting at least average."], "author": "Tommy D.", "review": "Came here early in the morning with my family.  We were all underwhelmed.  Usually there should be a big plate of veggies with bean sprouts, basil, and saw leaf.  We had 2 bowls of pho and they gave us a small plate of veggies with bean sprouts and TWO stems of basil.  Where is the saw leaf?!  The pho wasn't that great.  The broth was lacking and the servings seem smaller than other places.  \n\nMy bro and sis got the rice plates.  They don't have traditional broken rice.  The bean curd skin on the shrimp cake wasnt crispy.  The meat marinate was average.  I guess SF dont have good Viet restaurants?  With 400 reviews, I was expecting at least average.", "rating": 2, "date": "2010-07-08"}, {"excerpts": ["My friend got the grilled beef & shrimp cake with rice (#43). ", "I didn't get to try the beef ", "but he gave me one of the fried shrimp cakes ", "and I really liked it, especially the crispy tofu skin (dried bean curd) ", "it's wrapped in. ", "We also split an order of shrimp spring rolls, which, again, were good but tasted like spring rolls you can find at any other Vietnamese restaurant."], "author": "Steph L.", "review": "The food was good, but nothing really sets it apart from all the pho places I go to in Chinatown and the TL. Plus they don't have two of my favourite dishes - bun bo hue and beef carpaccio with lemon - both of which I can get at Golden Star. On the plus side, their prices are extremely reasonable.\n\nI got the beef stew with clear noodles for an extra 50¢. I thought clear noodles meant the skinny glass noodles, but instead they were like regular pho noodles, but clear and chewier/gummier (called hu tieu, I think). Though there was lots of beef brisket, there wasn't enough broth and most of my noodles were left uneaten just because I ran out of soup. The broth itself was ok but could've been more flavourful.\n\nMy friend got the grilled beef & shrimp cake with rice (#43). I didn't get to try the beef but he gave me one of the fried shrimp cakes and I really liked it, especially the crispy tofu skin (dried bean curd) it's wrapped in. We also split an order of shrimp spring rolls, which, again, were good but tasted like spring rolls you can find at any other Vietnamese restaurant.", "rating": 3, "date": "2010-08-23"}, {"excerpts": ["#43 was my usual order (Grilled beef, shrimp cake w/ steamed rice). ", "I usually order this at almost any Vietnamese restaurant I go to."], "author": "Anio D.", "review": "When I was pregnant most of 2009, I always had major munchies for Vietnamese food (and I still do). We found this place just walking around our neighborhood at the time, and I was always pleased with their food and service. It's usually always crowded, but nothing crazy that I had to wait in line outside for. Of the many Asian restaurants Irving St has to offer, Kevin's is most definitely my #1 choice.\n\n#43 was my usual order (Grilled beef, shrimp cake w/ steamed rice). I usually order this at almost any Vietnamese restaurant I go to.", "rating": 5, "date": "2010-06-25"}, {"excerpts": ["Porkchops, shrimp cake and an egg over rice. ", "Oh, and I love the msg soup they serve with it. ", "Haha, the pho is good too! ", "I love the tripe! ", "Sometimes I get the 3 color jelly drink, which I love. ", "The green jelly thing gets really hard sometimes (compare to other viet restaurants which the green jelly part is usually soft) and can like plastic, but.. the coconut milk with it is yummay. ", "Will leave you satisfied for under 10 bucks!"], "author": "Heather W.", "review": "This restaurant has been our default place for the past 4 years! Not only because we cant think of anywhere else to eat, but it usually satisfies our cravings.\n\nEverytime I come here, I want pho, but I always end up getting a rice place! #42 is crackin! Porkchops, shrimp cake and an egg over rice. Oh, and I love the msg soup they serve with it. Haha, the pho is good too! I love the tripe! Sometimes I get the 3 color jelly drink, which I love. The green jelly thing gets really hard sometimes (compare to other viet restaurants which the green jelly part is usually soft) and can like plastic, but.. the coconut milk with it is yummay. Will leave you satisfied for under 10 bucks!", "rating": 4, "date": "2009-09-05"}, {"excerpts": ["Oh, and they have really good smoothies with boba in them and their rice dishes are delicious, however I think that the best item there is still their shrimp cake (hu ky). ", "Like seriously... ", "Om nom nom~"], "author": "Jeffery P.", "review": "I love this restaurant so much! I've been going here since middle school since my mom knows the owners and dang it is still good. We eat here like at least once a month since it's pretty much my mom's favorite Vietnamese restaurant that's close enough to where we live. This place has it's good days and it's bad but most of them are good(: Their pho is delicious and the raw slices of beef (tai) are cut really well! instead of being too chewy it's really easy to eat(: Oh, and they have really good smoothies with boba in them and their rice dishes are delicious, however I think that the best item there is still their shrimp cake (hu ky). Like seriously... Om nom nom~", "rating": 4, "date": "2011-08-06"}, {"excerpts": ["I  recommend the grilled chicken and fried shrimp cake rice plate. "], "author": "upper d.", "review": "I only go here to eat Vietnamese food if I can help it. (And don't go to the one in Daly city, it's not the same!!!)\n\nRight when you walk in you are greeted and seated with smiling faces. They bring out a pot of tea for you right away. Once you order, the food comes out very quickly.\n\nThe pho is always piping piping hot! The kid's size is more than enough for me; very good portion! The fresh spring rolls are always a must when we go here! Great way to start off and the rolls come out within 2-5 minutes of ordering.\n\nThe rice plates are tasty as well! I  recommend the grilled chicken and fried shrimp cake rice plate. Very very good!\n\nThe pearl drinks are DELICIOUS. Even if they are the powder kind, they are so good. I like the mango shake.\n\nThis place has affordable prices for wonderful authentic Vietnamese food and you can't beat the service at this particular location.", "rating": 5, "date": "2011-02-10"}, {"excerpts": ["I do like their rice dishes and if PPQ across the street is busy, I'll come here for some rice, shrimp cake, egg cake, and grilled meat.\n\n"], "author": "Amanibhavam K.", "review": "Almost decent #1 pho.  It's like they fall short in every way and at the end of your meal you wish you ordered the medium bowl.  I do like their rice dishes and if PPQ across the street is busy, I'll come here for some rice, shrimp cake, egg cake, and grilled meat.\n\nThe eaters here are more hard-core than the PPQ crowd.\n\nPho Hoa Hiep gets two stars (from a base of three) because I'll come here only if PPQ is busy, and I don't order the pho.", "rating": 2, "date": "2007-06-01"}, {"excerpts": ["Lastly the appetizers are pretty good especially the shrimp cake. ", "If you want alright Pho and good appetizers go to this place ", "if you want a rice or Vermicelli dish don't come here go across the street to PPQ"], "author": "mea f.", "review": "I used to come here to eat Pho but than I realized it was better across the street.  Personally I think that the only thing that is worth it on the menu is probably the Pho.  The rice dishes in my opinion are not good at all and neither are any of the Vermicelli dishes.  The Pho is good but from my experience depending on when you go to eat you will get a better blend of soup.  Lastly the appetizers are pretty good especially the shrimp cake. If you want alright Pho and good appetizers go to this place if you want a rice or Vermicelli dish don't come here go across the street to PPQ", "rating": 3, "date": "2009-09-19"}, {"excerpts": ["The rice plates are delicious... try the one with the shrimp cake and barbecue chicken... mmmm.  ", "This place also has lower prices in contrast to Y2, which is a great plus"], "author": "Grace M.", "review": "Good pho.  I like how this place gives you size options for the pho (which means you have a choice in how much you can spend too), in cases when I just want a small bowl and not some ginormous XL one that is customary in other places (e.g. Yummy Yummy).  The rice plates are delicious... try the one with the shrimp cake and barbecue chicken... mmmm.  This place also has lower prices in contrast to Y2, which is a great plus", "rating": 3, "date": "2006-03-06"}, {"excerpts": ["The shrimp cake is good - really fresh. ", "And I usually don't like fish/shrimp cake. ", "The pork chops are thin. ", "The place is immaculate - the owners are OCD. ", "The sauces are all clean - nothing sticky. ", "Bathroom is clean. ", "The milk iced tea with tapioca was different. ", "They refrigerate the pearls in separate cups so they are a little too chewy and dry."], "author": "P B.", "review": "The shrimp cake is good - really fresh. And I usually don't like fish/shrimp cake. The pork chops are thin. The place is immaculate - the owners are OCD. The sauces are all clean - nothing sticky. Bathroom is clean. The milk iced tea with tapioca was different. They refrigerate the pearls in separate cups so they are a little too chewy and dry.", "rating": 4, "date": "2009-12-07"}], "extra noodle": [], "clear noodle substitution": [], "xung sa hot luu": [], "che ba mau": [{"excerpts": ["got the che ba mau which was good too\nfast service ", ":)\nwould definitely like to come back here next time I'm in SF!"], "author": "T H.", "review": "Restaurant was packed when we arrived.\nWas seated within 10 minutes or so.\nreally good pho.\ngot the che ba mau which was good too\nfast service :)\nwould definitely like to come back here next time I'm in SF!", "rating": 4, "date": "2014-02-09"}], "che dau do": [], "che dau xanh": []}