{"shredded pork rolls": [], "fried veggie rolls": [{"excerpts": ["The fried veggie rolls with taro and vegetables came out piping hot as well, and were served with a spicy soy as opposed to fish sauce.  ", "The rolls were Slanted Door esque; fried while still wet so that the wrapper is bubbly and airy.  ", "We were lucky enough last night not to have to wait for a table, but that was a first."], "author": "Sandy K.", "review": "There's nothing like a piping hot bowl of pho on a cold day, especially when you're feeling under the weather.  The veggie pho was delicious; the vegetables (bok choy and broccoli) were fresh and crisp, and the tofu was soft and creamy.  I really enjoyed the simplicity and clean flavors.  I saw someone eating my old go to, the spicy chicken curry pho, but the veggie pho was just as satisfying.  The fried veggie rolls with taro and vegetables came out piping hot as well, and were served with a spicy soy as opposed to fish sauce.  The rolls were Slanted Door esque; fried while still wet so that the wrapper is bubbly and airy.  We were lucky enough last night not to have to wait for a table, but that was a first.", "rating": 3, "date": "2010-05-06"}, {"excerpts": ["I can't really speak to the other dishes except for the fried veggie rolls which are also scrumptious.  ", "If you're going to PPQ, try pho first and then wander into other dishes.  ", "If you go during off hours - before 6pm - it is less crowded except on the weekends when it can be crowded around lunch time."], "author": "Mary H.", "review": "I'm a huge fan of PPQ.  The rare beef pho can range from simply delicious to magnificent depending on the day.   I can't really speak to the other dishes except for the fried veggie rolls which are also scrumptious.  If you're going to PPQ, try pho first and then wander into other dishes.  If you go during off hours - before 6pm - it is less crowded except on the weekends when it can be crowded around lunch time.", "rating": 5, "date": "2012-01-02"}, {"excerpts": ["and I ordered the vegetable tofu pho, plus fried veggie rolls that contained taro. ", "J enjoyed his dish very much.  ", "We both liked the imperial rolls. ", "My pho had only type of veggie (chinese broccoli) but the tofu tasted fresh. ", "Unfortunately, either the pho or rolls had much MSG b/c ", "the second I got into the car (J drove), I fell into a stupor and it was the kind of langor that didn't feel welcome. ", "Upon arriving home, I fell into bed and didn't wakeup until 11 hours later. ", "For the rest of today, I felt tired. ", "So far, I'm having two types of MSG reactions: ", "1. ", "Severe headache or 2. ", "Immediate sleepiness. ", "Woke up thirsty. ", "Also, J informed me the bathroom was not clean. ", "Bill for two including 20% tip was ", "$24.There is a Vietnamese restaurant next to San Tung a few blocks away whose veggie pho I prefer. ", "If I weren't allergic to MSG and didn't care about bathroom cleanliness, I'm sure I would eat at PPQ again. ", "As it stands, I won't be returning. ", "My search for msg-free Pho continues!"], "author": "Grace C.", "review": "J and I ate here last night after J's dragon dance practice at a middle school on Ortega. J had the spicy satay beef pho and I ordered the vegetable tofu pho, plus fried veggie rolls that contained taro. J enjoyed his dish very much.  We both liked the imperial rolls. My pho had only type of veggie (chinese broccoli) but the tofu tasted fresh. Unfortunately, either the pho or rolls had much MSG b/c the second I got into the car (J drove), I fell into a stupor and it was the kind of langor that didn't feel welcome. Upon arriving home, I fell into bed and didn't wakeup until 11 hours later. For the rest of today, I felt tired. So far, I'm having two types of MSG reactions: 1. Severe headache or 2. Immediate sleepiness. Woke up thirsty. Also, J informed me the bathroom was not clean. Bill for two including 20% tip was $24.There is a Vietnamese restaurant next to San Tung a few blocks away whose veggie pho I prefer. If I weren't allergic to MSG and didn't care about bathroom cleanliness, I'm sure I would eat at PPQ again. As it stands, I won't be returning. My search for msg-free Pho continues!", "rating": 2, "date": "2009-01-24"}], "chicken or pork skewers": [], "shrimp or beef skewers": [], "deep fried calamari or prawns": [], "vietnamese carpaccio": [{"excerpts": ["Wow , what great food , delicious , clean , hot  food, my new find is the Vietnamese Carpaccio ( raw beef) soooooo good , I have eaten all the Pho noddle soup and find this change fun and delicious for a little $\n", "Ann Chu"], "author": "walton c.", "review": "Wow , what great food , delicious , clean , hot  food, my new find is the Vietnamese Carpaccio ( raw beef) soooooo good , I have eaten all the Pho noddle soup and find this change fun and delicious for a little $\nAnn Chu", "rating": 5, "date": "2016-12-16"}, {"excerpts": ["Vietnamese carpaccio has good meat quality but was over sugared. "], "author": "Kit T.", "review": "Food here is over seasoned with salt, sugar, and msg to make up for the lack of flavor depth. \n\nThe pho soup barely tastes of beef... The kitchen over salts to compensate. \n\nVietnamese carpaccio has good meat quality but was over sugared. It tasted like I was eating raw beef candy. \n\nI suspect the restaurant has a change of chef or ownership recently, because the recipes appear solid, but execution is very shoddy. \n\nThey are also tight with ingredients compared to other restaurants in the area.... This isn't a restaurant that takes pride in its food.", "rating": 1, "date": "2014-06-14"}, {"excerpts": ["Pho's good\n\nGET THE VIETNAMESE CARPACCIO!!! "], "author": "Jonathan C.", "review": "Pho's good\n\nGET THE VIETNAMESE CARPACCIO!!! MUST HAVE!!!\n\nGreat Hangover food!!!", "rating": 4, "date": "2011-06-08"}, {"excerpts": ["Must order - Pho,  vietnamese carpaccio, imperial rolls (fried egg rolls, order the full order and it comes with lettuce/mint leaves that you can wrap it in).\n\n"], "author": "Noah P.", "review": "I was brought here by a friend touting it was best pho in san francisco so maybe my expectations were a little high...\n\nThe pho was good... the best? probably not. I tried regular pho the first time I came here and the curry pho the 2nd time (and regular pho again the third time).\n\nIf you are in the mood for some hot steaming pho on a cold day or to cure a hangover, DO NOT get the curry pho. While good, it doesn't have that soothing feeling. \n\nMust order - Pho,  vietnamese carpaccio, imperial rolls (fried egg rolls, order the full order and it comes with lettuce/mint leaves that you can wrap it in).\n\nThe one major thing PPQ has going for it versus some of the better pho joints in the tenderloin is CLEANLINESS. If you are turned off by the cleanliness issues that are rumored to plague many of the great pho restaurants in the tenderloin... this is the place for you.", "rating": 4, "date": "2011-04-19"}, {"excerpts": ["PPQ has the best Vietnamese Carpaccio. ", "Their food is consistent. ", "Best to get there by 6pm or you'll have to wait for a table. ", "Their curry noodle soup, charbroil shrimp and beef and the egg loaf are the best items on their menu."], "author": "Samantha C.", "review": "PPQ has the best Vietnamese Carpaccio. Their food is consistent. Best to get there by 6pm or you'll have to wait for a table. Their curry noodle soup, charbroil shrimp and beef and the egg loaf are the best items on their menu.", "rating": 4, "date": "2013-02-18"}, {"excerpts": ["Peanuts and fried garlic top this \"Vietnamese carpaccio\" that is tasty, juicy, easy to eat, and never has made me sick.\n\n"], "author": "James T.", "review": "Been a fan of his place ever since i was introduced to it 6 years ago. The quality is always the best and i have never been disappointed by anything in this place. Standouts are the coconut curry (not too rich or spicy) the five spice chicken on vermicelli (healthy servings with great flavor) and the raw beef salad. This last dish takes a bit of courage to order and eat at first but is well wroth it. Peanuts and fried garlic top this \"Vietnamese carpaccio\" that is tasty, juicy, easy to eat, and never has made me sick.\n\nCASH ONLY and good luck finding parking.", "rating": 5, "date": "2010-02-12"}, {"excerpts": ["For appetizers, we get the Vietnamese carpaccio, cabbage salad with chicken and imperial rolls. ", "I usually alternate between #1(combo beef noodle soup) and #4(rare beef & meatball noodle soup). "], "author": "Patra I.", "review": "I love pho! \n\nMy roommate introduced me to PPQ, and I've been coming here for the past 2 years. Its within walking distance from my house, which is good, since parking is really difficult on the weekends. \n\nFor appetizers, we get the Vietnamese carpaccio, cabbage salad with chicken and imperial rolls. I usually alternate between #1(combo beef noodle soup) and #4(rare beef & meatball noodle soup). I always ask for extra limes because I like my soup tangy.....mmmm mmmm goooood. \n\nHere are some other dishes that I sometimes get: \n-Five spice chicken noodle soup \n-Seafood combo noodle soup \n-Imperial rolls and charbroiled pork vermicelli \n-Charbroiled pork rice plate \n\nWe come here for good, quick eats and to nurse the post-party hangover. There's nothing better than a warm bowl of pho when your head is pounding and you feel like puking your brains out! =) \n\nA major plus is that they now take credit cards!!! YAY!!!!", "rating": 4, "date": "2008-11-30"}, {"excerpts": ["My friends love this place because of their Vietnamese Carpaccio. ", "It's OK. ", "I don't know what the big deal is. ", "It's not my thing, I guess. ", "Too much red meat gives you gout anyways."], "author": "Hue L.", "review": "I have to say, the decor might not be much, but the service here is very efficient. Once the order is put in, the food comes out quickly. This place is good for those times when you're dying of hunger. (Just make sure you start dying of hunger after you find a parking space, because that might take you a while!)\r\n\r\nI'm not a big Pho person. I tend to order rice plates at vietnamese restaurants. The bbq pork rice plate I got here was pretty good, but I guess I expected a little more pork. There was a HUGE mound of rice and a small pile of pork. I like my pork-rice ratio to be about 0.65. heh.\r\n\r\nMy friends love this place because of their Vietnamese Carpaccio. It's OK. I don't know what the big deal is. It's not my thing, I guess. Too much red meat gives you gout anyways.", "rating": 3, "date": "2006-06-05"}, {"excerpts": ["You must order the Vietnamese Carpaccio.....best $13.00 I've ever spent. ", "Tender (ginormous) mound of raw beef sprinkled with basil, peanuts and crispy shallots.  ", "Phenomenal."], "author": "Christina S.", "review": "You must order the Vietnamese Carpaccio.....best $13.00 I've ever spent. Tender (ginormous) mound of raw beef sprinkled with basil, peanuts and crispy shallots.  Phenomenal.", "rating": 4, "date": "2008-08-12"}, {"excerpts": ["All the apps we had were decent- imperial rolls, spring rolls, and vietnamese carpaccio.  ", "However, the pho was meh- ", "noodles were good and chewy but the broth was bland and the meat was cut oddly so it cooked way too fast.  ", "My friends thought the 5 spice chicken was akin to jerky."], "author": "Amina B.", "review": "Eh- I guess PPQ will do the job if you're craving some comforting noodle soup or rice plate on a cold day.  All the apps we had were decent- imperial rolls, spring rolls, and vietnamese carpaccio.  However, the pho was meh- noodles were good and chewy but the broth was bland and the meat was cut oddly so it cooked way too fast.  My friends thought the 5 spice chicken was akin to jerky.", "rating": 2, "date": "2009-07-24"}, {"excerpts": ["vietnamese carpaccio is amazing!\n", "chicken salad too."], "author": "Rick H.", "review": "fresh and hot food,clean, polite, and fast.\nvietnamese carpaccio is amazing!\nchicken salad too.", "rating": 4, "date": "2008-04-16"}, {"excerpts": ["vietnamese carpaccio...and curry chicken vermicelli soup...and call it a day"], "author": "Supah D.", "review": "how about you order a taro root drink.. an order of the shrimp rolls...vietnamese carpaccio...and curry chicken vermicelli soup...and call it a day", "rating": 5, "date": "2009-08-14"}, {"excerpts": ["Try the Vietnamese Carpaccio (Angus!), with its caramelized scallions, peanuts, and vinegarette you'll be picking the plate for scraps. ", "The beef Pho is fantastic and the curry chicken is awesome but my favorite is still the 5 spice chicken and Imperial rolls! ", "(Wrap the mint leaf AROUND the roll then dip) Yum."], "author": "Al Stickler X.", "review": "Mmm... sooo yummy! I never thought I'd eat raw beef! Try the Vietnamese Carpaccio (Angus!), with its caramelized scallions, peanuts, and vinegarette you'll be picking the plate for scraps. The beef Pho is fantastic and the curry chicken is awesome but my favorite is still the 5 spice chicken and Imperial rolls! (Wrap the mint leaf AROUND the roll then dip) Yum.", "rating": 4, "date": "2008-10-24"}], "hot and sour catfish or shrimp soup": [], "asparagus and crab meat soup": [], "hot and sour veggie soup": [], "cabbage salad with chicken": [{"excerpts": ["The cabbage salad with chicken was also delicious with a slightly tangy dressing. ", "All the spring rolls were tasty with either peanut or fish sauce and the noodle soups were delectable as well. ", "For vegetarians, you can request a vegetable based broth as an alternative to the beef or chicken broth. "], "author": "Sarah K.", "review": "A great family friendly Vietnamese restaurant if you are in the sunset area! Definitely recommend the five spices chicken garlic noodle - it had good flavor and the noodles were soft and well seasoned. The cabbage salad with chicken was also delicious with a slightly tangy dressing. All the spring rolls were tasty with either peanut or fish sauce and the noodle soups were delectable as well. For vegetarians, you can request a vegetable based broth as an alternative to the beef or chicken broth. All in all, our family had a great meal! \n\nFor parking there's a metered public lot on 20th between Irving and Lincoln.", "rating": 5, "date": "2018-01-28"}, {"excerpts": ["For appetizers, we get the Vietnamese carpaccio, cabbage salad with chicken and imperial rolls. ", "I usually alternate between #1(combo beef noodle soup) and #4(rare beef & meatball noodle soup). "], "author": "Patra I.", "review": "I love pho! \n\nMy roommate introduced me to PPQ, and I've been coming here for the past 2 years. Its within walking distance from my house, which is good, since parking is really difficult on the weekends. \n\nFor appetizers, we get the Vietnamese carpaccio, cabbage salad with chicken and imperial rolls. I usually alternate between #1(combo beef noodle soup) and #4(rare beef & meatball noodle soup). I always ask for extra limes because I like my soup tangy.....mmmm mmmm goooood. \n\nHere are some other dishes that I sometimes get: \n-Five spice chicken noodle soup \n-Seafood combo noodle soup \n-Imperial rolls and charbroiled pork vermicelli \n-Charbroiled pork rice plate \n\nWe come here for good, quick eats and to nurse the post-party hangover. There's nothing better than a warm bowl of pho when your head is pounding and you feel like puking your brains out! =) \n\nA major plus is that they now take credit cards!!! YAY!!!!", "rating": 4, "date": "2008-11-30"}], "cabbage salad with tofu": [{"excerpts": ["Cabbage salad with tofu rocks too!\n\n...eat here "], "author": "Kristofer B.", "review": "The Satay (Angus) Beef Pho and Curry Chicken Pho are both equally amazing, making the choice always a difficult one. \nImperial Rolls are a MUST! (**warning: they're addictive and me order may not be enough).\nLooking for grilled meats? Yep! They got 'em and they're delectable (my fave is Grilled Pork with rice stick).\nCabbage salad with tofu rocks too!\n\n...eat here & you'll walk away well-fed at a great price.", "rating": 5, "date": "2014-04-26"}], "papaya salad with beef": [{"excerpts": ["I haven't strayed too far from pho on the menu, but the papaya salad with beef is astoundingly good -- a perfect marriage of flavors.\n\n"], "author": "Val P.", "review": "Although I love the taste of beef pho, it's just a bit too rich for me, so I've settled on chicken pho as a yummy, healthier (for me) alternative. After eating bowls and bowls and bowls of chicken pho at Vietnamese joints around town, I've settled on PPQ as my favorite. (Mind you, the actual chicken meat that comes in chicken pho isn't very good anywhere, so I usually get veggies or just plain noodles in chicken broth.) \n\nUnlike some other places, which are big on baby corn and other canned vegetables, the ones you get at PPQ are always fresh and tasty. And if I really want meat, I'll get the delicious five spices chicken pho with chicken broth instead of beef broth. \n\nI haven't strayed too far from pho on the menu, but the papaya salad with beef is astoundingly good -- a perfect marriage of flavors.\n\nAs others have noticed, the service isn't super-friendly, but I've never had anyone be rude to me either. More important to me is having hot, fresh food delivered to my table quickly -- and that always happens here.", "rating": 4, "date": "2011-03-28"}, {"excerpts": ["I always have to get the shredded pork roll and green papaya salad with beef. \n\n"], "author": "Karen C.", "review": "I go here all the time becuase it is so delicious and super cheap. I always have to get the shredded pork roll and green papaya salad with beef. \n\nI brought, my now fiance, Paul W here when we were first dating, right when he was about to give up on me. Not only was he dazzled with my wit and charm, but also my impeccable taste in food. We had a great time together. So this place has a special place in my memories .... :)", "rating": 5, "date": "2007-05-23"}, {"excerpts": ["My favorite dishes are the green papaya salad with beef and the imperial roll over vermicelli.  "], "author": "Paul W.", "review": "5 star because the yumminess per dollar is waaaaay above normal here.\n\nMy favorite dishes are the green papaya salad with beef and the imperial roll over vermicelli.  Haven't tried the five spice chicken yet, but can't wait to.\n\nService here is whatevers, and atmosphere is crowded and busy.  Food standing alone is 4 star.  It's all about yums per buck.", "rating": 5, "date": "2007-07-18"}], "papaya salad with shrimp": [{"excerpts": ["Jamie impressed me by ordering the $9.50 Papaya Salad with Shrimp, which was quite refreshing after a long afternoon at the park with julienned papaya, basil and carrots topped with poached shrimp, chopped peanuts and fried shallots (see photo). ", "It was a nice mix of textures and flavors - crunchy, sweet and slightly savory. "], "author": "Ed U.", "review": "Jamie W. and I caught the near-tail-end of Hardly Strictly Bluegrass watching Dwight Yoakam have an onstage hissy fit about his bleeding finger when we realized we didn't want to struggle with the crowds who would pour back into the eastbound MUNI express buses. We were a short stroll from 19th Avenue and Irving, so I thought it would be a good opportunity to try Pho Phu Quoc since we both like Perilla a lot. That's the mini-chain of Vietnamese restaurants that shares the same owner. This pretty standard-looking place looks to be just as popular - although we were lucky to catch it in between waves of dining packs.\n\nPho Phu Quoc doesn't have quite the same menu as there is a greater emphasis on - big surprise! - pho, as we saw a lot of slurp-worthy bowls on the other tables around us. Jamie impressed me by ordering the $9.50 Papaya Salad with Shrimp, which was quite refreshing after a long afternoon at the park with julienned papaya, basil and carrots topped with poached shrimp, chopped peanuts and fried shallots (see photo). It was a nice mix of textures and flavors - crunchy, sweet and slightly savory. We followed this with a $6.75 plate of Imperial Rolls, three of them deep-fried, cut in half and stuffed with ground pork, taro, shredded carrots and silver noodles with a ramekin of puckery nuoc mam sauce (see photo).\n\nNot so healthy a choice but delicious nonetheless. We both went for the $9 rice plates for our entrees which come with a bit of a side salad and more of the nuoc mam sauce. Jamie ordered the Charbroiled Pork Rice Plate, which was very much like a plate you can order at Hahn's Hibachi (see photo). Foolproof and tasty but not terribly unique in execution. Mine was more unusual, the Shredded Pork, Charbroiled Pork & Baked Egg-Loaf Rice Plate, a combination plate of savory carnivery with the egg-loaf a frittata-like creation that must surely have Gallic origins (see photo). Quite good with a good variety of flavors. We'll definitely make a return visit when we're in the 'hood, probably to try the pho. People were really slurping that loud and clear.\n\nFOOD - 4 stars...good, sturdy, no-frills Vietnamese well executed\nAMBIANCE - 3 stars...standard-looking\nSERVICE - 3.5 stars...fast and furious\nTOTAL - 4 stars...worthy fare if you're in the area", "rating": 4, "date": "2012-11-08"}, {"excerpts": ["I can't comment on their other dishes because the Spicy Curry Chicken Vermicelli is the only dish I get, other than the papaya salad with shrimp (also very good). ", "This place is always packed even on a weeknight."], "author": "Anson C.", "review": "My favorite dish at this place is the Spicy Curry Chicken Vermicelli. This is the only Vietnamese restaurant that serves this dish that I am aware of. The portion is filling and inexpensive. For a quick bite to eat, this dish is by far the best. I can't comment on their other dishes because the Spicy Curry Chicken Vermicelli is the only dish I get, other than the papaya salad with shrimp (also very good). This place is always packed even on a weeknight.", "rating": 4, "date": "2011-09-29"}], "charbroiled chicken wraps": [], "charbroiled pork wraps": [{"excerpts": ["- The Imperial rolls are perfectly fried and not at all greasy.\n- If you sort of wanted Mexican but got conned into Vietnamese, get the charbroiled pork wraps and pretend you're eating an Asian burrito. \n", "- This is not a place for a romantic first date - it's a place to get your grub on; the ambiance is what you'd expect from a pho house in the Sunset - bright lights, kitchen-style tables/chairs and Asian-motifs.  ", "Go there for the food.\n", "- Consider biking or walking.  ", "Parking is a real pain in the ass."], "author": "Veronica Y.", "review": "I eat at PPQ once a week for consistently solid Vietnamese comfort food/hangover remedies.  \n\n- The soup base is amaze-balls.  Toss in some Siracha and hoisin sauce, a few serrano chilis, a handful of bean sprouts, and tear some basil up - you're golden! The #1 PPQ Beef Noodle Soup has all the goods - I get it sans tripe.\n- The Imperial rolls are perfectly fried and not at all greasy.\n- If you sort of wanted Mexican but got conned into Vietnamese, get the charbroiled pork wraps and pretend you're eating an Asian burrito. \n- This is not a place for a romantic first date - it's a place to get your grub on; the ambiance is what you'd expect from a pho house in the Sunset - bright lights, kitchen-style tables/chairs and Asian-motifs.  Go there for the food.\n- Consider biking or walking.  Parking is a real pain in the ass.", "rating": 4, "date": "2012-12-31"}], "charbroiled beef wraps": [{"excerpts": ["The imperial rolls and charbroiled beef wraps is what kept me coming back to this place for over a decade.  ", "The level of service is where they lost me as a long-time customer.  "], "author": "Frank T.", "review": "As far as the overall quality of food is concerned, I'd rate Pho Phu Quoc between 3 and 4 stars.  The imperial rolls and charbroiled beef wraps is what kept me coming back to this place for over a decade.  The level of service is where they lost me as a long-time customer.  There are two separate situations that motivated me to try out new restaurants.\n\nThe first instance was where I ordered the Ox Tail \"with\" potatoes and carrots in a savory sauce.  The savory sauce was there, ox tails, but no potatoes.  When I received the dish, I really didn't eat much of it.  I explained the situation to the waiting staff, and showed the description of the entry on the menu.  \"I ordered the Ox Tail, and as you can see here your menu says \"with potatoes\".  However there are no potatoes?\"\n\nThe response from the waitress was a blank stare with really no explanation for the missing ingredient.  Considering I ate very little of the dish I was expecting at least some sort of concession to be made.  Nothing was offered.  After some insistence and pressure on my end, they finally agreed to remove the entrée from the bill.\n\nThe second instance of poor service was when I ordered two items for pick up.  After driving across town to pick up the order, it appeared nothing had been processed.  I indicated I had spoken with a man over the phone who according to the lady at the register had never received my order.  They offered to take the order right then and there while again not offering any sort of concession for the miscommunication.  I declined the order and instead went to the restaurant across the street. \n\nI understand that mistakes can happen, but the response should never be a blank stare, especially in the restaurant business.  I've decided to find another restaurant for my occasional imperial roll craving.  Perhaps it's a language barrier.  Either way, I feel the level of service at this establishment needs major improvement.  If both situations were handled with a sense of courtesy and respect, I'd likely still be ordering meals here.", "rating": 2, "date": "2013-11-02"}], "charbroiled pork sausage wraps": [], "charbroiled shrimp wraps": [], "sugarcane shrimp wraps": [], "five spices chicken": [{"excerpts": ["Food;\nThe five spices chicken noodle soup was so delicious! ", "The chicken was crispy and cut into strips on a side plate. ", "The pho broth was very flavorful. ", "Both things went well together. ", "Overall;\nOne of favorite pho restaurants, especially for the five spices chicken pho!!"], "author": "Wesley S.", "review": "Service;\nArrived at the restaurant around 1pm on a Sunday. There was a short line of people waiting, had to wait about 5 minutes to get seated. They promptly took our order and gave us water. Free hot tea was also provided upon request. Food took about 10 minutes to get to our table after ordering.\n\nFood;\nThe five spices chicken noodle soup was so delicious! The chicken was crispy and cut into strips on a side plate. The pho broth was very flavorful. Both things went well together. This is probably my favorite restaurant to get five spice chicken pho.\n\nAtmosphere;\nIt's a bit of a small restaurant. Tables and seats are a bit close to each other. Can feel a bit squished if your seat has someone sitting behind you.\n\nOverall;\nOne of favorite pho restaurants, especially for the five spices chicken pho!!", "rating": 5, "date": "2018-08-14"}, {"excerpts": ["Definitely recommend the five spices chicken garlic noodle - it had good flavor and the noodles were soft and well seasoned. "], "author": "Sarah K.", "review": "A great family friendly Vietnamese restaurant if you are in the sunset area! Definitely recommend the five spices chicken garlic noodle - it had good flavor and the noodles were soft and well seasoned. The cabbage salad with chicken was also delicious with a slightly tangy dressing. All the spring rolls were tasty with either peanut or fish sauce and the noodle soups were delectable as well. For vegetarians, you can request a vegetable based broth as an alternative to the beef or chicken broth. All in all, our family had a great meal! \n\nFor parking there's a metered public lot on 20th between Irving and Lincoln.", "rating": 5, "date": "2018-01-28"}, {"excerpts": ["At $13.95 their Five Spices Chicken leans on the expensive side of other dishes offered here. ", "Their Five Spices Chicken Vermicelli is $8.75. ", "I make it a combo and add three shrimp for another $2.25 and this $11.00 dish still falls just a bit short. ", "I then add another $1.50 for a generous bowl of their overly salty chicken broth on the side. \n", "Many places do this better for less yet these guys are open late ", "so I'm a repeat offender."], "author": "Caesar A.", "review": "Open from 11 o'clock to 11 o'clock PPQ serves up decent inexpensive Pho. It can be \"meat market\" busy but the service and foods served will hit the spot.\n\nMy friends and I come for a few basic things like the $6.75 shrimp rolls. They are nothing special just very basic with the standard peanut sauce.\n\nAt $13.95 their Five Spices Chicken leans on the expensive side of other dishes offered here. It's a boneless quarter chicken marinated, roasted and then fried to serve with steamed Jasmine rice and a bite of salad.\n\nTheir Five Spices Chicken Vermicelli is $8.75. I make it a combo and add three shrimp for another $2.25 and this $11.00 dish still falls just a bit short. I then add another $1.50 for a generous bowl of their overly salty chicken broth on the side. \nMany places do this better for less yet these guys are open late so I'm a repeat offender.", "rating": 3, "date": "2017-09-07"}, {"excerpts": ["Instead, I ordered the Five Spices Chicken Garlic Noodle ($10.25) and it was the best decision of the day. ", "Trust me, get this! ", "The garlic flavor covered the strands of noodles and were incredibly delicious. ", "Slices of charred chicken topped with green onions were very flavorful and a great addition to the noodles with the fish sauce. ", "It even came with a little salad to complete the meal. ", "I seriously loved the garlic noodles here so much. ", "The only letdown was their slow and rude service, but then again that's almost expected at Asian places."], "author": "Cindy Z.", "review": "Although a Vietnamese spot, I wasn't feeling pho for the day. Instead, I ordered the Five Spices Chicken Garlic Noodle ($10.25) and it was the best decision of the day. Trust me, get this! The garlic flavor covered the strands of noodles and were incredibly delicious. Slices of charred chicken topped with green onions were very flavorful and a great addition to the noodles with the fish sauce. It even came with a little salad to complete the meal. I seriously loved the garlic noodles here so much. The only letdown was their slow and rude service, but then again that's almost expected at Asian places.", "rating": 4, "date": "2016-11-07"}, {"excerpts": ["Five Spices chicken - good but a little bland to me", ".  ", "I was expecting more flavor fulness with the name \"five spices\". ", "Did not live up to the hype.\n"], "author": "Navin W.", "review": "HIGHLIGHTS:\nIMPERIAL ROLLS - just short of over-fried, crispy and flavorful\nRARE FLANK BEEF PHO - solid all the way around, the beef in here is excellent!\n\nOK:\nFive Spices chicken - good but a little bland to me.  I was expecting more flavor fulness with the name \"five spices\". Did not live up to the hype.\nChinese broccoli with oyster sauce and garlic - pretty standard, sold veggie to balance out the other dishes\n\nYou definitely get more than you pay for here at PPQ. Prices are good.  It's not amaaaazing, but it's a good neighborhood spots - If I lived in the area, I imagine I'd hit this place up frequently.", "rating": 3, "date": "2012-12-15"}, {"excerpts": ["Five Spices Chicken Rice Plate \n"], "author": "May G.", "review": "Updated on 6-20-2016 after a horrible meal\n\nI had first eaten at this restaurant about a month ago and wrote the review below just recently. Thinking about it made me want it tonight so off we went and now must downplay the rating from 4 stars to 2stars. There were 4 of us last time & we all ordered our own dish but today decided to order family style. What a mistake. The five spice chicken was the only dish that came out ok. They served the grilled beef & grilled pork on a cast iron platter which cause the meat to be way overcooked. It costed much more and didn't seem like it was worth it. I thought I'd give the oxtails a try since we love ox tails. If you've never ordered it, don't! There were 2 pieces of decent sized oxtails, 3 pieces that were smaller than my pinkie and these white floating things that we thought were potatoes! Imagine how disgusted we were when we bit into a mouth full of FAT. It had no taste and was so greasy. I'm so disappointed & disgusted.\n\nBy the time I got home, I was literally sick to my stomach. I'll spare you of further details. \n\nOx tail stewed with potatoes and carrots in a savory sauce\n15.75\n..............................................................................................................................\nIt's been awhile since i've given a 4 star rating but everything we ordered was really good. I've seen this place for years but just never stopped in. I was craving Viet food at 10pm and this place was open. We ordered the following:\n\n17. 炸春卷\nImperial Rolls - Crispy fried rolls filled with ground pork, taro, carrots, and silver noodles. Served with lettuce, mint leaves and cucumber with nuoc mam (3 rolls) \n(Cha Gio) $6.95  \n\n43. 五香雞飯\nFive Spices Chicken Rice Plate \n(Com Ga Quay Chao) $8.25  \n\n45. 燒牛肉飯\nCharbroiled Beef Rice Plate \n(Com Bo Nuong) $9.25\n\n46. 燒豬肉飯\nCharbroiled Pork Rice Plate \n(Com Thit Nuong) $8.25\n\n47. 燒豬扒飯\nCharbroiled Pork Chop Rice Plate \n(Com Suon Nuong) $9.25 \n\nMost of us replaced the rice for garlic noodles, I don't remember how much they added but it didn't matter b/c it was good. My son's girlfriend ordered a plain pho and said it was good. I don't know, I don't eat pho. I will be back and will order meat as ala carte so we can eat \"family style\".", "rating": 2, "date": "2016-06-20"}, {"excerpts": ["I also tasted the five spices chicken noodle soup which was very good.  ", "I was not a fan of the satay beef noodle soup, as I found it to be a little bland.  ", "But the person who ordered it in my group did like (not love) it.  ", "Did I mention how good the curry chicken soup was??"], "author": "Nina K.", "review": "Do yourself a favor and order the curry chicken vermicelli noodle soup.  This is one of the best soups I have EVER had.  I might move to San Francisco just so I can eat it again.  I also tasted the five spices chicken noodle soup which was very good.  I was not a fan of the satay beef noodle soup, as I found it to be a little bland.  But the person who ordered it in my group did like (not love) it.  Did I mention how good the curry chicken soup was??", "rating": 4, "date": "2015-04-29"}, {"excerpts": ["Highly recommend  Five Spices Chicken Vermicelli (Bun Ga Quay Chao). ", "When I want to eat something light I think of PPQ. "], "author": "Elsa Y.", "review": "Highly recommend  Five Spices Chicken Vermicelli (Bun Ga Quay Chao). When I want to eat something light I think of PPQ. The Vermicelli topped with big chunks of chicken marinated in the five spices really adds flavor to this dish.\n\n I also love the spring rolls they have there which is stuffed with taro too! so yummy! This is by far the best Vietnamese food I've ever had, portions are big, prices are reasonable and they also remodeled the place a bit so it's much more comfortable to dine in.", "rating": 5, "date": "2011-06-20"}, {"excerpts": ["It's the noodle soup with five spices chicken. ", "They serve it on two separate dishes so you can decide the fate of the chicken, they leave the meat drowning to you. ", "Well, the bean sprouts definitely took a dive with the leaves, and peppers. "], "author": "Ryan R.", "review": "My vegetarianisms become questionably non existent whenever I enter the realm of my favorite all time soups... Pho.\n\nOkay, I love PPQ for it's menu overall. I've picked off plates of other friends that I've brought here. I've been eating here for years and just now had the inkling to write a review. Why now? Why PPQ? I've been to the best pho places in town, and I always order the same thing. I'm so predictable. I always order the number 1. It's a repetitive yet pretentious habit.\n\nTonight, things changed. I ordered the number 7. What is number 7 you ask? It's the noodle soup with five spices chicken. They serve it on two separate dishes so you can decide the fate of the chicken, they leave the meat drowning to you. Well, the bean sprouts definitely took a dive with the leaves, and peppers. But the chicken had to be savored by itself.\n\nGood service? Sure! Too bad they don't take American Express, but that's expected from most asian restaurants. Heck, if I had a restaurant I'd be cheap too. =P\n\nBut hey, where's the dessert? If you've also eaten at the other pho restaurant across the street, which will remain nameless during this review, you'd know. They have better desserts. In fact, they have one of the best avocado shakes around, as long as they're in season of course.\n\nOh no, I can't believe I just mentioned it without having the liberty of grasping it's ultimate (fattening) power in my hands. What now? Come on PPQ, I know you're reading this. Get it together for that final star!", "rating": 4, "date": "2009-06-09"}, {"excerpts": ["I've heard great things about the Five Spices Chicken, which came out really flavorful and crispy. "], "author": "Patty L.", "review": "Between you and me, this is the spot to go for after a day long hike in Marin with friends. Hungry, lost, and in need of some angus lovin, we parked our tired and sore bums in this pho gem in the Sunset. \n\nI've heard great things about the Five Spices Chicken, which came out really flavorful and crispy. Top some vermicelli with chicken and fresh egg rolls and you've got yourself a post hiking feast. \n\nTo avoid slipping into a food coma, try the Vietnamese iced coffee. It's quite flavorful and strong, though a little too much condensed milk for my taste. I diluted it with 1 part water and all was good again. \n\nI think I mentioned that PPQ proudly serves 100% black angus beef, which comes thinly sliced with your pho. It looked quite delicious but given the Indian summer we're in, I passed on noodle soup today and went for the vermicelli bowl. Fresh ingredients, generous portions, and hot items. PPQ I shall return!", "rating": 4, "date": "2010-09-26"}, {"excerpts": ["Love their five spices chicken, except that its a bit oily sometimes...\n", "The pho was good too, at least for me :)\n", "Papaya salad..."], "author": "Shirley H.", "review": "Not the best pho i've every had, but i'd say it's one of the top choices in the city.\n\nLove their five spices chicken, except that its a bit oily sometimes...\nThe pho was good too, at least for me :)\nPapaya salad...meh~\n\nBest of all...loveeee the vietnamese iced coffee doesn't add excessive sweetened condensed milk and is hella strong which kicks my butt!", "rating": 3, "date": "2010-12-13"}, {"excerpts": ["And if I really want meat, I'll get the delicious five spices chicken pho with chicken broth instead of beef broth. \n\n"], "author": "Val P.", "review": "Although I love the taste of beef pho, it's just a bit too rich for me, so I've settled on chicken pho as a yummy, healthier (for me) alternative. After eating bowls and bowls and bowls of chicken pho at Vietnamese joints around town, I've settled on PPQ as my favorite. (Mind you, the actual chicken meat that comes in chicken pho isn't very good anywhere, so I usually get veggies or just plain noodles in chicken broth.) \n\nUnlike some other places, which are big on baby corn and other canned vegetables, the ones you get at PPQ are always fresh and tasty. And if I really want meat, I'll get the delicious five spices chicken pho with chicken broth instead of beef broth. \n\nI haven't strayed too far from pho on the menu, but the papaya salad with beef is astoundingly good -- a perfect marriage of flavors.\n\nAs others have noticed, the service isn't super-friendly, but I've never had anyone be rude to me either. More important to me is having hot, fresh food delivered to my table quickly -- and that always happens here.", "rating": 4, "date": "2011-03-28"}, {"excerpts": ["There other dishes here that are also good like the five spices chicken..rice plate or pho bowl.  ", "Overall a solid four . ", "Note this is not the only place ", "i", "ve had spicy pho. ", "Fact. ", "I purposely order spicy pho where ever i eat Vietnamese food to see if it tops PPQ", "..", "its been over 5 years ", "and i havent found one yet."], "author": "Chris O.", "review": "This place has the BEST spicy pho around (satay beef pho). Bold, i know but this dish alone makes ppq my favorite pho joint.  There other dishes here that are also good like the five spices chicken..rice plate or pho bowl.  Overall a solid four . Note this is not the only place ive had spicy pho. Fact. I purposely order spicy pho where ever i eat Vietnamese food to see if it tops PPQ..its been over 5 years and i havent found one yet.", "rating": 4, "date": "2011-10-18"}, {"excerpts": ["I ordered my usual, the Five Spices Chicken rice plate. ", "My cousin got the same chicken except with vermicelli and Imperial rolls, and my aunts got pho. "], "author": "Felix C.", "review": "Really, really, REALLY good Vietnamese food. You can't go wrong with anything from here, pho, rice plate, or vermicelli. I ordered my usual, the Five Spices Chicken rice plate. My cousin got the same chicken except with vermicelli and Imperial rolls, and my aunts got pho. The food here is inexpensive yet fulfilling and delicious, but who knows how much MSG they use.\n\nThe restaurant is getting old and it could use a makeover, but it does its job. There's not much decor inside. The servers are kind of nonexistent, especially if you're sitting in the corner facing the front windows of the restaurant: they're the kind of servers who would give you your first kettle of tea, take your order, and drop off food. Then they just fall off the face of the Earth, and you'll need to get up and walk to the counter to get your check or a box.\n\nIn the end this is the best place I've ever encountered for Vietnamese food, and I've been returning here for years. I do wish they would improve their decor and customer service, but if you're ever in the Irving area searching for a bang-for-the-buck place to eat at, PPQ is always a safe bet.", "rating": 3, "date": "2010-03-27"}, {"excerpts": ["There are a lot of great Vietnamese restaurants in the city, but  PPQ is way better, because PPQ has bomb ass five spices chicken. ", "I don't know what they put in their chicken, but it keeps me coming back for more. ", "i don't think I've ever tried anything else on their menu. "], "author": "Vanessa W.", "review": "There are a lot of great Vietnamese restaurants in the city, but  PPQ is way better, because PPQ has bomb ass five spices chicken. I don't know what they put in their chicken, but it keeps me coming back for more. i don't think I've ever tried anything else on their menu. The chicken is juicy and tender and perfect with vermicelli noodles. \n\nPrices: cheap\nStaff: fast\nYou: happy", "rating": 4, "date": "2008-12-21"}, {"excerpts": ["I wasn't quite sure what to order, so I just picked the five spices chicken soup.  ", "Ha!  ", "Some soup.  ", "I wasn't convinced!  ", "I just received a soup with chicken broth with a bunch of rice noodles thrown in, served with a SIDE OF CHICKEN.  ", "Uh, no.  ", "I am not going to add stuff in my soup.  ", "They should have put it in in the first place!  ", "I scoffed and declared pho overrated.  "], "author": "Christine S.", "review": "My boyfriend had been telling me about PPQ's pho for months, and I never bothered to check it out, since I was wary of soup being *that* amazing.  I had never tried pho and figured it couldn't be more amazing than posole or gumbo.  \n\nAnyway, I found myself at PPQ one night recently when el bf decided that I should finally try it.  I wasn't quite sure what to order, so I just picked the five spices chicken soup.  Ha!  Some soup.  I wasn't convinced!  I just received a soup with chicken broth with a bunch of rice noodles thrown in, served with a SIDE OF CHICKEN.  Uh, no.  I am not going to add stuff in my soup.  They should have put it in in the first place!  I scoffed and declared pho overrated.  My bf cautioned me and said to give it another shot sometime.  \n\nWell...I did... at Yummy Yummy.  That awful cold snap in early January drove me to eat anything that was piping hot.  That time, it wasn't that bad, so I decided that PPQ was worth another shot.  So, we were back at PPQ celebrating le bf's birthday, which happened to be about a month later from the first time I was there.  This time, I got the spicy chicken curry dish and MAN, was I won over.  This time, I was served an aromatic bowl of semi-sweet and spicy curry with tender pieces of all-white chicken meat and the most pillowy potatoes I have ever put in my mouth.  This one was most definitely a winner.  \n\nSince then, I have found myself thinking about their glorious pho.  I tried other curry pho, hoping I could relive the magic, but they failed.  PPQ: expect me there this weekend slurping up every last drop of your delicious soup.", "rating": 4, "date": "2009-02-05"}, {"excerpts": ["but I only had their five spices chicken, one of the best chicken i've had in a while...\n\n"], "author": "Genesis K.", "review": "I really love this place, usually pho has really crappy broth but you can tell that they cook it well and right, as hard as it is to perfect pho this place has perfected the broth, the only soup I can take is the PHO DAC BIET.  Usually I like getting the Beef stew but this place doesn't do it quite right, I heard their rice plates were really good but I only had their five spices chicken, one of the best chicken i've had in a while...\n\nThe veggies that come with the pho were surprisingly fresh, usually other pho places don't really have all the fresh bean sprouts and what not but here it was fresh every single time i've went...and i go here alot!", "rating": 4, "date": "2009-02-10"}, {"excerpts": ["Favor curry chicken noodle soup, five spices chicken noodle soup, spring roll. "], "author": "Nancy T.", "review": "One of my favorite vietnamese restaurant in town. It's cheap and it's good. Consider pretty clean for an asian restaurant. Favor curry chicken noodle soup, five spices chicken noodle soup, spring roll. Not much fond of there ice vietnamese coffee.\n\nThey only accept cash. And if you go by car don't go to Irving Street on Saturday or Sunday around noon till 2pm. Very very difficult to find parking space unless you happened to be very lucky.", "rating": 4, "date": "2007-11-04"}, {"excerpts": ["Their Five Spices Chicken is a must get on the side (at least).  ", "It's a hole in the wall place, typical Asian restaurant.  ", "Imperial rolls are AWESOME."], "author": "Kimberly L.", "review": "Best pho in the area.  It's not blow you away good, but best in San Francisco.  The broth is good, the PPQ pho is always a safe call.  Their beef balls are not so good, but all their other meats are good.  Their Five Spices Chicken is a must get on the side (at least).  It's a hole in the wall place, typical Asian restaurant.  Imperial rolls are AWESOME.", "rating": 5, "date": "2010-09-29"}, {"excerpts": ["I've had their five spices chicken soup noodle. ", "They give you the bowl of soup noodles, and on a second plate the chicken. ", "Not a great idea to dump the chicken into the soup, you'll wash away the spices.\r\n\r\n", "Parking can be hard at times, but nothing too crazy."], "author": "qirk z.", "review": "aka PPQ.\r\n\r\nDecent place.  Been coming here on and off for a few years now.\r\n\r\nHad the five spices rice plate for ~$6. Not bad. You get about 8 strips of chicken with skin that are spiced up and sorta glazed. You get a good portion of rice. \r\n\r\nTheir shrimp spring roll is good too.\r\n\r\nI've had their five spices chicken soup noodle. They give you the bowl of soup noodles, and on a second plate the chicken. Not a great idea to dump the chicken into the soup, you'll wash away the spices.\r\n\r\nParking can be hard at times, but nothing too crazy.", "rating": 3, "date": "2006-10-29"}, {"excerpts": ["love their five spices chicken noodle soup.  ", "skin is crispy, meat is juicy.  ", "perfect combination with the pho.....", "YUM.  ", "gonna go get some now!"], "author": "Allene J.", "review": "love their five spices chicken noodle soup.  skin is crispy, meat is juicy.  perfect combination with the pho.....YUM.  gonna go get some now!", "rating": 3, "date": "2008-11-09"}], "sizzling iron platter beef": [{"excerpts": ["For example, the Sizzling Iron Platter beef I keep coming back for, but some noodle soups I've had contained questionable inedible meats, even though the broth and noodles were excellent. ", "I keep coming back though, perhaps that's just what the food is supposed to be like. ", "I claim no expertise whatsoever with Vietnamese food, I'm going by my own taste buds."], "author": "Rob C.", "review": "PPQ is a mixed bag, some dishes are yummy superb, and other are disgusting. For example, the Sizzling Iron Platter beef I keep coming back for, but some noodle soups I've had contained questionable inedible meats, even though the broth and noodles were excellent. I keep coming back though, perhaps that's just what the food is supposed to be like. I claim no expertise whatsoever with Vietnamese food, I'm going by my own taste buds.", "rating": 3, "date": "2015-08-30"}], "sizzling iron platter pork": [], "smoky lemongrass pork chop": [], "sizzling iron platter prawns": [], "roasted catfish": [], "beef stew": [{"excerpts": ["The beef stew bowl is a good choice too! \n\n"], "author": "Deanna Y.", "review": "If you love anything fried, then you will fall in love with PPQs Imperial Rolls! They're stuffed with vermicelli noodles, shredded carrots, and pork, and are deep-fried to a crisp perfection. Once you dip 'em into that fish sauce and take a bite, you'll be smitten too! \n\nPPQ is my go-to spot for pho in the Sunset. I've been here at least a dozen times and they consistently turn out delicious and inexpensive noodle bowls that keep me coming back. Most people order #1-3, which are the beef noodle pho bowls with brisket, tendon, tripe, beef balls, etc. The Spicy Chicken Curry Pho is another solid pick and one that I overlooked for awhile. Once I tried it though, it became a common order! The broth has a mild curry flavor that is slightly creamy it really does pack a lot of heat, so if you're a lightweight, beware! Still can't decide? The beef stew bowl is a good choice too! \n\nIf you want to splurge or are feeling adventurous, try the Beef Carpaccio. It's fresh, tangy, and delicious! Just beware of the peanuts they throw on top if you're allergic.\n\nNot the greatest service because they're always pretty packed, but they're good about acknowledging you when you flag them down. It's also standard for them not to clear your dishes until you're finished with your meal, so just push those empty plates aside and chow down!", "rating": 4, "date": "2015-02-20"}, {"excerpts": ["its expensive especially their beef stew wide noodle soup. ", "$10.25 for a large when it doesnt even look big and ", "next time when im craving for beef stew ill be heading over to Kevins!"], "author": "Carol Y.", "review": "prices are reasonable but compare to Kevin's noodle house across the block its expensive especially their beef stew wide noodle soup. $10.25 for a large when it doesnt even look big and Kevin is only 8.25 and soo good and flavorful!\n\nAnd i agree with all the reviews the lady cashier is rude. She never smiles nor say anything? Shes just there to collect money.\n\nnext time when im craving for beef stew ill be heading over to Kevins!", "rating": 3, "date": "2015-09-23"}, {"excerpts": ["Our table a bun bowl, a #2 pho and the beef stew vietnamese flat rice noodles. \n\n", "I personally had the beef stew and it was alright. ", "The beef was tender however the carrots were not cooked all the way. "], "author": "Stephanie W.", "review": "Eh. \n\nI would walk across the street and go to Kevin's Pho. Came here on a Friday night and was seated right away. Our table a bun bowl, a #2 pho and the beef stew vietnamese flat rice noodles. \n\nI personally had the beef stew and it was alright. The beef was tender however the carrots were not cooked all the way. YUCK. \n\nIf you're craving pho, and Kevin's is full - and you're still craving pho, I would go here. \n\nthey do take cc!", "rating": 2, "date": "2013-10-24"}, {"excerpts": ["Big portions too with lots of meat, noodles and vegetables for their beef stew and phò. ", "The broth is so good that we bring some home if there's any left after our meal."], "author": "Courtney W.", "review": "Best broth ever, especially the beef broth that has been cooked all day! Big portions too with lots of meat, noodles and vegetables for their beef stew and phò. The broth is so good that we bring some home if there's any left after our meal.", "rating": 5, "date": "2016-08-28"}, {"excerpts": ["We also had a beef stew which was a standard along with a crispy chicken dish which went well with steamed rice. \n\n"], "author": "Danster L.", "review": "My nickname for this place is PPQ cause saying the whole name is just a mouthful. But the food here is definitely a good kind of mouthful. My party and I had the grilled pork which was divine. It was served on a sizzling platter and had the flavors of garlic, shallots, lemongrass and more. It was tender and full of amazing flavor. We also had a beef stew which was a standard along with a crispy chicken dish which went well with steamed rice. \n\nThe highlights were the imperial rolls which were tasty and my friends and I had fun rolling them in the butter lettuce. The cabbage salad is definitely worth the hype with so much different flavors and a great dressing. It is like the Vietnamese version of a Burmese rainbow salad. I enjoyed my meal and thanks to PPQ, I found my new favorite sandwich shop, Toastie's which is also owned by PPQ.", "rating": 4, "date": "2009-06-08"}, {"excerpts": ["I ordered the beef stew and it had about a quarter inch of fat floating on top and very little flavor. ", "I got there about 30 minutes before they closed, and judging by the other reviews ", "I suspect the kitchen gave me tomorrow's pho which they hadn't skimmed yet. ", "I tried skimming the fat off myself, but after filling up my tea cup and still having a thick layer of fat in my bowl, I gave up, ate my 3 fatty pieces of beef, and called it a night."], "author": "Natalie W.", "review": "Just came back from this place and had to write a review. That was the absolute worst pho I've ever had. I ordered the beef stew and it had about a quarter inch of fat floating on top and very little flavor. I got there about 30 minutes before they closed, and judging by the other reviews I suspect the kitchen gave me tomorrow's pho which they hadn't skimmed yet. I tried skimming the fat off myself, but after filling up my tea cup and still having a thick layer of fat in my bowl, I gave up, ate my 3 fatty pieces of beef, and called it a night.", "rating": 1, "date": "2015-04-19"}, {"excerpts": ["and (yes the bowl is big) however, three strings of beef stew and bundle of noodle swimming in the broth. ", "As I was saving beef to consume at the end of the meal, that's when the front desk lady took my bowl away (just because she couldn't see any bundle of noodle swimming in my broth anymore.) "], "author": "Celene S.", "review": "Dear cashier lady who counts dollar bills at the front desk, you are not allowed to take my pho soup bowl away just because there are three people waiting in line. Yes, she literally took my half finished bowl away because she assumed I was done eating. Even though I told her that I haven't done eating, she hesitated to let go of my bowl and put the bill on the table. As I was patient enough to wait in line for lunch, I'm sure everyone else in line can wait for their turn to be served. Anyway, I ordered medium satay beef pho noodle soup and (yes the bowl is big) however, three strings of beef stew and bundle of noodle swimming in the broth. As I was saving beef to consume at the end of the meal, that's when the front desk lady took my bowl away (just because she couldn't see any bundle of noodle swimming in my broth anymore.) Thank you for your hospitality. \n\nPeople say this place is cheap but they served you less meat. I'd say this place is overpriced, especially satay beef noodle soup.", "rating": 2, "date": "2012-08-15"}, {"excerpts": ["very good bun (cold noodle salad) incredible curry chicken pho with egg noodles and the beef stew noodles and satay beef noodles are fantastic. \n", "outside of the t-loin, this is really the best spot for vietnamese pho is SF. ", "consistently good, and much cleaner than the pho restaurant across the street. ", "this is a no-brainer."], "author": "Jeff W.", "review": "very good chicken pho with flat noodles. awesome beef pho. very good cha gio (vietnamese spring rolls) very good bun (cold noodle salad) incredible curry chicken pho with egg noodles and the beef stew noodles and satay beef noodles are fantastic. \noutside of the t-loin, this is really the best spot for vietnamese pho is SF. consistently good, and much cleaner than the pho restaurant across the street. this is a no-brainer.", "rating": 4, "date": "2010-01-04"}, {"excerpts": ["The Beef Stew was really hearty, though the carrots were under cooked. "], "author": "Lisa C.", "review": "I'm a fan of the flat rice noodles, and I rarely find Vietnamese restaurants that serve them. It's a bonus this place offers them.  The Beef Stew was really hearty, though the carrots were under cooked. The beef had too much tendon and not enough meat and the broth was oily, but loved the flat rice noodles.\n\nCon: no small option and the medium size was a very generous portion. I'd come back and order and ask for the flat rice noodles for my pho.", "rating": 3, "date": "2011-04-23"}, {"excerpts": ["I also recommend trying their beef stew with flat noodles and five spice chicken rice plate --- all very delicious and you won't be disappointed, trust!  \n\n"], "author": "Ellen W.", "review": "Hole is the wall joints are the SHIET! I love their fatty, big portions shamelessly slathered with oil and grease. YUMMY--- I LOVE  PPQ! I love their mildly washed self-service utensil trays perched on each table and their mom&pop's style cuisines. I love their super speedy service, even though you sometimes have to ask twice to get water or extra whatnots. \n\nI love their No. 8 Curry Chick PHO--One of the my all time favorite dishes in the world!--you have to get it with pho noodle though because honestly, those thin vermicelli rice noodle are just not cutting it. PPQ has perfected their curry chicken PHO---a impeccable blend of creamy, sweet, spicy, and flavorful coconut milk and curry powder, mixed with the most tender chicken breast, and springy pho noodles. Omg I want some right now as I'm typing this review! Also their imperial rolls are to die for. It comes sizzling hot out of the kitchen within seconds after placing your order and you can actually taste the taro inside the rolls. Wraps the imperial rolls in the lettuce leaves, dip it in some tangy fish sauce and enjoy! I also recommend trying their beef stew with flat noodles and five spice chicken rice plate --- all very delicious and you won't be disappointed, trust!  \n\nPPQ is what locals in the city eat on a regular basis and I come here almost every week, no joke. Sure the service is not quiet up to par, but who cares? You get all your basics met and it is super affordable and always delicious!", "rating": 4, "date": "2010-08-15"}, {"excerpts": ["So yesterday i step in here and ordered the beef stew with noodles,i thought it would be just like any other beef stew i ordered from any other restaurant ", "but i was dead wrong.\n", "When the bowl came it was filled with at least 12 pieces of beef, plenty of noodles and under-cooked carrots ", "but otherwise it was worth it.\n", "I also ordered the famous imperial rolls they were pretty good,all in all i would say i got my money's worth.\n", "The service was decent not great but good enough.\n", "And it wasn't crowded ", "so i got to enjoy my meal in peace."], "author": "Corey W.", "review": "Ive always seen this place but i always go to kevin's noodle house because i thought it was better.\nSo yesterday i step in here and ordered the beef stew with noodles,i thought it would be just like any other beef stew i ordered from any other restaurant but i was dead wrong.\nWhen the bowl came it was filled with at least 12 pieces of beef, plenty of noodles and under-cooked carrots but otherwise it was worth it.\nI also ordered the famous imperial rolls they were pretty good,all in all i would say i got my money's worth.\nThe service was decent not great but good enough.\nAnd it wasn't crowded so i got to enjoy my meal in peace.", "rating": 5, "date": "2014-03-13"}, {"excerpts": ["I tried their beef stew and it was delicious! ", "Although I wished they had more noodles. ", "ITS GOOD. ", "I finished it hella fast, and the food came quick! ", "Good service too and not so crowded. ", "I left the restaurant, full and happy(:"], "author": "Sandy C.", "review": "I decided to come here to try out their pho, since I heard it was reallly good. I tried their beef stew and it was delicious! Although I wished they had more noodles. ITS GOOD. I finished it hella fast, and the food came quick! Good service too and not so crowded. I left the restaurant, full and happy(:", "rating": 4, "date": "2011-02-01"}, {"excerpts": ["These are my go to pho soups when I go to PPQ:\n\nBeef stew pho noodles   \n"], "author": "Peachie Y.", "review": "These are my go to pho soups when I go to PPQ:\n\nBeef stew pho noodles   \nCurry chicken pho noodles    \nPho Dac Biet Beef noodles", "rating": 4, "date": "2012-06-11"}, {"excerpts": ["but i wish their beef stew was better - its not even up to par with the Westlake Pho's beef stew"], "author": "Justin A.", "review": "This is my number one go-to-pho-spot. My favorite dish right now is the Coconut Milk Curry Chicken w/ flat noodles and a side of fried tofu. Flat noodles give you more for the same price. My #2 is the satay beef.\n\nI wanna give this place a five but i wish their beef stew was better - its not even up to par with the Westlake Pho's beef stew", "rating": 4, "date": "2010-07-11"}, {"excerpts": ["I ordered their PPQ Beef Noodle Soup (#1 on the menu), which had plenty of meat (rare flank steak, well done brisket, tendon, tripe, beef meatball), while my family tried their Satay Beef (#5) and Seafood Noodle Soups (#6) and Beef Stew Rice Plate. ", "The soups each had a distinct and great flavor: ", "#1 was earthy from the beef broth, #5 leaned toward the sour & spicy, and #6 was sweet. ", "I wouldn't suggest getting the Seafood pho and Beef Stew, for their wasn't much seafood and the stew was average, respectively.\n\n"], "author": "Cliff W.", "review": "I managed to finish their large-size noodle soups without feeling overly stuffed; at other pho places, my stomach is usually uncomfortably distended. I ordered their PPQ Beef Noodle Soup (#1 on the menu), which had plenty of meat (rare flank steak, well done brisket, tendon, tripe, beef meatball), while my family tried their Satay Beef (#5) and Seafood Noodle Soups (#6) and Beef Stew Rice Plate. The soups each had a distinct and great flavor: #1 was earthy from the beef broth, #5 leaned toward the sour & spicy, and #6 was sweet. I wouldn't suggest getting the Seafood pho and Beef Stew, for their wasn't much seafood and the stew was average, respectively.\n\nThe place can feel cramped but service was cordial and efficient and the setting was adequately clean. I noticed prices on their take-out menu is higher than in their dine-in menu. They accept credit cards, including Discover.", "rating": 4, "date": "2012-05-19"}, {"excerpts": ["I used to come here weekly for (1) beef stew over ho fun and (2) five spice chicken over ho fun.  ", "And for some CRAZY reason they stopped making the beef stew!!!!!!!\n\n"], "author": "Jenny K.", "review": "A decade ago...damn am i old?...anyway....I used to come here weekly for (1) beef stew over ho fun and (2) five spice chicken over ho fun.  And for some CRAZY reason they stopped making the beef stew!!!!!!!\n\nBut...I came here today and it's back!  It's probably been back, but I just haven't gone...and yes, it's still hella good.  And the five spice chicken...its the best in town.  It's a deboned thigh, yes, I hate bones.  I love boneless.  That's the only way meat should be served.\n\nBut shoot, when I found out my friends were eating at Roxie...my noodles started not tasting as good....damn it Roxie's....", "rating": 4, "date": "2008-09-13"}, {"excerpts": ["Wanting to get away from my usual vermicelli dish, I ordered the BEEF STEW with RICE. ", "It was delicious! ", "The beef was tender and flavorful. ", "Attached to each piece of meat are tendon pieces (", "as there should be, my mom later told me). ", "I am not a fan of tendon, but even without eating about  1/2 of my dish, I was still extremely full. ", "For those of you who are ordering pho, be warned that the SMALL bowl is quite large as is. "], "author": "Rona J.", "review": "(3.5 rounded up to 4)\n\nLast night, while waiting to be seated in this cramped restaurant without any standing room, I tried to look for the health inspection paper. It's interesting, this green piece of paper. It appears that many restaurants have it pretty well hidden. To find it is a scavenger hunt. Perhaps this is what they do to keep you entertained while you wait. In this case, the hunt had a clue but no answer. We looked everywhere! The inspection score was nowhere to be found.\n\nWe had a party of 8 that eventually grew to 11. Every table was packed and there were a few other people waiting, but they somehow managed to make enough room for all of us to sit down. Wanting to get away from my usual vermicelli dish, I ordered the BEEF STEW with RICE. It was delicious! The beef was tender and flavorful. Attached to each piece of meat are tendon pieces (as there should be, my mom later told me). I am not a fan of tendon, but even without eating about  1/2 of my dish, I was still extremely full. For those of you who are ordering pho, be warned that the SMALL bowl is quite large as is. Most of the guys at my table ordered the small bowl, and it was just right. \n\nBig portions at tiny prices ($6.95 for my dish). The food came fast. Service is non-existent, but expected. Due to our earlier failure at finding the inspection score card, I was a bit on-guard all through dinner. My eyes scanned the room more frequently than usual as I was nervous about finding a roach or another critter of sorts crawling on the walls. Thankfully, I did not (although that doesn't mean they are not there--i just can't say for sure). \n\nWhat I did find was that they were cash only. Good thing it costs less than $10. Otherwise, I may have been ordered to dish washing duties in the kitchen to pay off my meal...or worse, the person who cleans up the restaurant for the next health inspection.", "rating": 4, "date": "2008-08-11"}, {"excerpts": ["I also recommend: \n- 5 spice chicken over rice\n- beef stew soup with flat noodles\n", "- vietnamese chicken salad \n", "You won't be disappointed!\n", "I want to try a lot of their dishes sound really good ", "but I usually walk in with a curry chicken pho craving "], "author": "Helen L.", "review": "I wouldn't come here to eat regular pho as their non-pho noodle soups definitely take the cake here. \n\nCurry chicken pho = amazing! I'm from the city but am always away at college and I find myself craving PPQ's curry chicken pho all the freakin time. It has a coconut milk based soup with curry, obviously, and tons of spices. The soup might be a little bit on the spicier side for some people like me but that doesn't stop me. Just ask for more water refills, the service is good. Back to the pho..They throw in chunks of potatoes which are really flavorful and taste like they might've been fried/cooked before being dumped into the soup. REALLY TASTY! The chicken in it is just right, not too soft, not too dry. I recommend it with pho noodles as opposed to the usual vermicelli. My only complaint about this dish is the layer of oil that sits on top of the broth. I diligently scoop it off with a spoon everytime though so it's no biggie. \n\nI also recommend: \n- 5 spice chicken over rice\n- beef stew soup with flat noodles\n- vietnamese chicken salad \nYou won't be disappointed!\nI want to try a lot of their dishes sound really good but I usually walk in with a curry chicken pho craving so I'll wait til my cravings settle to try those.\n\nTheir dessert drinks are also the best I've had at any Vietnamese restaurant. Try the 3-color drink or red bean ice! =]\n\nQuality here is good and really consistent. Prices are really good, too. Today, we ordered two larges and two smalls (a small can definitely fill you up and then some) and the total came out to just $30 including tax. The restaurant can get really cramped when it's busy though. \n\n4.5 stars", "rating": 4, "date": "2008-06-19"}, {"excerpts": ["Usually I like getting the Beef stew but this place doesn't do it quite right", ", I heard their rice plates were really good "], "author": "Genesis K.", "review": "I really love this place, usually pho has really crappy broth but you can tell that they cook it well and right, as hard as it is to perfect pho this place has perfected the broth, the only soup I can take is the PHO DAC BIET.  Usually I like getting the Beef stew but this place doesn't do it quite right, I heard their rice plates were really good but I only had their five spices chicken, one of the best chicken i've had in a while...\n\nThe veggies that come with the pho were surprisingly fresh, usually other pho places don't really have all the fresh bean sprouts and what not but here it was fresh every single time i've went...and i go here alot!", "rating": 4, "date": "2009-02-10"}, {"excerpts": ["Beef stew Pho is a bit too greasy for me."], "author": "Jasmin Y.", "review": "Above average vietnamese food and consistant quality.  I go there often if i want something quick  and simple.  Among the dishes i usually order, 3 color rice plate and 5 spice chicken are good.  The beef pho is good too, but portion is a bit light even with the big size.  Beef stew Pho is a bit too greasy for me.", "rating": 4, "date": "2009-01-09"}], "ox tail": [{"excerpts": ["Ordered the ox tail stew rice plate but was a little disappointed as the stew was on the soupy side.   ", "I'm sure this would compliment the pho better in this state - was just expecting more thickness in the sauce.\n", "Will try something else next time."], "author": "Drew B.", "review": "Ordered the ox tail stew rice plate but was a little disappointed as the stew was on the soupy side.   I'm sure this would compliment the pho better in this state - was just expecting more thickness in the sauce.\nWill try something else next time.", "rating": 3, "date": "2016-10-11"}, {"excerpts": ["I ordered the ox tail stew rice plate. ", "The place was empty because it was not quite dinnertime, yet I still waited for my food for 10+min while everyone else was already halfway through their pho. ", "Nevertheless, I enjoyed my ox tail stew. ", "Obviously, the people with whom I came also enjoyed their food very much as they did not think twice about waiting with me."], "author": "Judge F.", "review": "Definitely come here for the pho. The price and portion size are reasonable, and the wait time for your pho is within 5 minutes.\n\nFor other kinds of dishes, the price will be higher and wait time much longer. I ordered the ox tail stew rice plate. The place was empty because it was not quite dinnertime, yet I still waited for my food for 10+min while everyone else was already halfway through their pho. Nevertheless, I enjoyed my ox tail stew. Obviously, the people with whom I came also enjoyed their food very much as they did not think twice about waiting with me.", "rating": 4, "date": "2015-03-07"}, {"excerpts": ["Ox tail stewed with potatoes and carrots in a savory sauce\n15.75\n..............................................................................................................................\n", "It's been awhile since i've given a 4 star rating but everything we ordered was really good. ", "I've seen this place for years but just never stopped in. ", "I was craving Viet food at 10pm and this place was open. "], "author": "May G.", "review": "Updated on 6-20-2016 after a horrible meal\n\nI had first eaten at this restaurant about a month ago and wrote the review below just recently. Thinking about it made me want it tonight so off we went and now must downplay the rating from 4 stars to 2stars. There were 4 of us last time & we all ordered our own dish but today decided to order family style. What a mistake. The five spice chicken was the only dish that came out ok. They served the grilled beef & grilled pork on a cast iron platter which cause the meat to be way overcooked. It costed much more and didn't seem like it was worth it. I thought I'd give the oxtails a try since we love ox tails. If you've never ordered it, don't! There were 2 pieces of decent sized oxtails, 3 pieces that were smaller than my pinkie and these white floating things that we thought were potatoes! Imagine how disgusted we were when we bit into a mouth full of FAT. It had no taste and was so greasy. I'm so disappointed & disgusted.\n\nBy the time I got home, I was literally sick to my stomach. I'll spare you of further details. \n\nOx tail stewed with potatoes and carrots in a savory sauce\n15.75\n..............................................................................................................................\nIt's been awhile since i've given a 4 star rating but everything we ordered was really good. I've seen this place for years but just never stopped in. I was craving Viet food at 10pm and this place was open. We ordered the following:\n\n17. 炸春卷\nImperial Rolls - Crispy fried rolls filled with ground pork, taro, carrots, and silver noodles. Served with lettuce, mint leaves and cucumber with nuoc mam (3 rolls) \n(Cha Gio) $6.95  \n\n43. 五香雞飯\nFive Spices Chicken Rice Plate \n(Com Ga Quay Chao) $8.25  \n\n45. 燒牛肉飯\nCharbroiled Beef Rice Plate \n(Com Bo Nuong) $9.25\n\n46. 燒豬肉飯\nCharbroiled Pork Rice Plate \n(Com Thit Nuong) $8.25\n\n47. 燒豬扒飯\nCharbroiled Pork Chop Rice Plate \n(Com Suon Nuong) $9.25 \n\nMost of us replaced the rice for garlic noodles, I don't remember how much they added but it didn't matter b/c it was good. My son's girlfriend ordered a plain pho and said it was good. I don't know, I don't eat pho. I will be back and will order meat as ala carte so we can eat \"family style\".", "rating": 2, "date": "2016-06-20"}, {"excerpts": ["I come here for the ox tail lo mein. ", "Cant find it as well made anywhere else in the city. ", "The 5 spice chicken is very good and the pho is on point. ", "Can get crowded at lunchtime."], "author": "Jay Rome M.", "review": "I come here for the ox tail lo mein. Cant find it as well made anywhere else in the city. The 5 spice chicken is very good and the pho is on point. Can get crowded at lunchtime.", "rating": 5, "date": "2015-06-25"}, {"excerpts": ["Bring floss if you are going for the ox tail.  ", "A nice tender ox tail needs to be  braised properly also with a little bit of love.  ", "No love here either.  ", "The ox tail is rather tough, fibrous, and surely lacking flavor.  ", "If you happen to try it out anyway and didn't bring floss, you're in luck... ", "they have plenty of toothpicks. "], "author": "Colin M.", "review": "Been coming here since I was in high school so nostalgia befalls me for 3 stars.  It's more of a 2.5 for me.  I was also here last week when I had no other option later in the evening.\n\nI'm pretty sure there are a bunch of PHO'real jokes out there already so I'll skip that however tempting it might be. Props to Ringo M. newly Elite yelper for the Fergie reference calling it PHOgalicious. I see you. \n\nLet's start off on a good note and to the point (PHO jokes aside) with what you should order because I wouldn't come here if I didn't have to.\n\nGo for the curry chicken noodle.  If you are anything like me and love some fresh aroma and flavor added ask for extra onions and cilantro to brighten up that light tasty curry. The curry isn't strong and pungent like that of an Indian style of curry and not super sweet like that of a Thai curry.  It's more in the middle on both ends of smell and taste.  The pleasant and subtle sweetness of the curry soup is thanks to the coconut milk they put in there.   There's a much better spot for this on Noriega but over here this is on the top of my list.\n\nThe five spice chicken is alright here. They always use a marinated dark meat so it always comes out juicy and tender.\n\nYou can't go wrong with the appetizers like the fresh spring rolls and egg rolls.  Any restaurant that can manage to screw this one up is a failure.\n\nThe 3 stars for this review is because I personally don't like their pho broth as much as other pho spots. Beef soup of the pho is the star of the show here and yet it falls short.  I ordered the Pho Dac Biet aka Combination Beef Noodle Soup.  A little more on the bland side with not much going on.  What I mean is that you can taste a soup that has been cooking for hours on end creating depth of flavor in the soup base from its ingredients. Then there are some that just seem like it has been cooking for the minimal amount of time needed to get it boiling lacking depth, and rather monotonous to the taste.  Keep in mind that although I speak in terms of depth, most restaurants would load up the MSG so it's hard to say what they do here.  I love a good soup without the MSG if possible. Nonetheless there's gotta be a great base before all else. Some of my friends like their soup so I'm sure it is a preference thing.  For me I want some love in my soup.  Whoever it is behind that range stove should be making love to my soup for hours before it even gets to me.  No love here.\n\nBring floss if you are going for the ox tail.  A nice tender ox tail needs to be  braised properly also with a little bit of love.  No love here either.  The ox tail is rather tough, fibrous, and surely lacking flavor.  If you happen to try it out anyway and didn't bring floss, you're in luck... they have plenty of toothpicks. Take full advantage of those.\n\n2 stars for their service.  A little slow side most often times.  We could be sitting there for awhile and still no one comes to take our order just like last week.  There's also this one girl that always has this funny attitude.  It's hard to ask her anything because she expects us to know every detail on the menu as a customer.  She's been there working there forever so I had a few instances of that.\n\nI'd very much rather head 6 blocks down to Yummy Yummy for better service, variety, and depth of flavors or to Quan Ngon on Irving for better soup bases.", "rating": 3, "date": "2014-08-19"}, {"excerpts": ["The first instance was where I ordered the Ox Tail \"with\" potatoes and carrots in a savory sauce.  ", "The savory sauce was there, ox tails, but no potatoes.  ", "When I received the dish, I really didn't eat much of it.  ", "I explained the situation to the waiting staff, and showed the description of the entry on the menu.  ", "\"", "I ordered the Ox Tail, and as you can see here your menu says \"with potatoes\".  "], "author": "Frank T.", "review": "As far as the overall quality of food is concerned, I'd rate Pho Phu Quoc between 3 and 4 stars.  The imperial rolls and charbroiled beef wraps is what kept me coming back to this place for over a decade.  The level of service is where they lost me as a long-time customer.  There are two separate situations that motivated me to try out new restaurants.\n\nThe first instance was where I ordered the Ox Tail \"with\" potatoes and carrots in a savory sauce.  The savory sauce was there, ox tails, but no potatoes.  When I received the dish, I really didn't eat much of it.  I explained the situation to the waiting staff, and showed the description of the entry on the menu.  \"I ordered the Ox Tail, and as you can see here your menu says \"with potatoes\".  However there are no potatoes?\"\n\nThe response from the waitress was a blank stare with really no explanation for the missing ingredient.  Considering I ate very little of the dish I was expecting at least some sort of concession to be made.  Nothing was offered.  After some insistence and pressure on my end, they finally agreed to remove the entrée from the bill.\n\nThe second instance of poor service was when I ordered two items for pick up.  After driving across town to pick up the order, it appeared nothing had been processed.  I indicated I had spoken with a man over the phone who according to the lady at the register had never received my order.  They offered to take the order right then and there while again not offering any sort of concession for the miscommunication.  I declined the order and instead went to the restaurant across the street. \n\nI understand that mistakes can happen, but the response should never be a blank stare, especially in the restaurant business.  I've decided to find another restaurant for my occasional imperial roll craving.  Perhaps it's a language barrier.  Either way, I feel the level of service at this establishment needs major improvement.  If both situations were handled with a sense of courtesy and respect, I'd likely still be ordering meals here.", "rating": 2, "date": "2013-11-02"}, {"excerpts": ["I got asparagus and crab soup and a tofu salad and my boyfriend ordered the ox tail pho.  ", "He basically just dropped all of the items on the table and ran away.  ", "My salad was okay", "--the tofu was tasted fake and overly fried but the dressing was pretty good.  ", "The soup, however, looked like chopped up asparagus thrown into dish water.  ", "It tasted bland and flavorless with no discernable sign of crab (I wouldn't mind if they scrimped on the crab ", "but it was $8).  ", "My boyfriend's dish looked like ramen cooked in beef broth.  ", "The ox tail was so tough and undercooked that he couldn't even eat it--", "LITERALLY because neither of the waiters came back over to us to ask how things were and didn't give us silverware or even water.  ", "There was no way this meat was coming off the bone without a heavy duty knife.  "], "author": "Kate R.", "review": "I hesitate to rate a place so poorly but PPQ actually deserves zero stars.  My boyfriend and I decided to try it last Sunday night--what a mistake.  We were sat and given menus and after five minutes a waitress, who seemed friendly enough, came over and asked us what we wanted.  I was hemming and hawing a lot, also my boyfriend had never had pho before so we told her we needed a bit longer.  Probably 20 minutes later, another waiter finally came over and very rudely took our order.  I was planning on ordering a drink but was so taken aback by his rudeness/apparent disdain for us (gave him the benefit of the doubt and figured maybe he was just busy) and decided to wait to order it when he brought the food.  \n\nI got asparagus and crab soup and a tofu salad and my boyfriend ordered the ox tail pho.  He basically just dropped all of the items on the table and ran away.  My salad was okay--the tofu was tasted fake and overly fried but the dressing was pretty good.  The soup, however, looked like chopped up asparagus thrown into dish water.  It tasted bland and flavorless with no discernable sign of crab (I wouldn't mind if they scrimped on the crab but it was $8).  My boyfriend's dish looked like ramen cooked in beef broth.  The ox tail was so tough and undercooked that he couldn't even eat it--LITERALLY because neither of the waiters came back over to us to ask how things were and didn't give us silverware or even water.  There was no way this meat was coming off the bone without a heavy duty knife.  We were pretty angry at this point because plenty of other tables had water and silverware, and if the staff was so busy, they wouldn't all be staring into space or looking at their smart phones near the counter.  \n\ntl;dr: Horrible service, incredibly rude staff, food is terrible, do not eat here.", "rating": 1, "date": "2014-04-17"}, {"excerpts": ["I had the ox tail and it sucked.  ", "My daughter had the A3 and she didn't like it either.  ", "But the service was pretty nice. ", "I gave them an extra star for service"], "author": "Pernell N F.", "review": "I don't like this place at all.  Sorry.  I had the ox tail and it sucked.  My daughter had the A3 and she didn't like it either.  But the service was pretty nice. I gave them an extra star for service", "rating": 2, "date": "2014-09-01"}, {"excerpts": ["My husband ordered the ox tail noodles -- excellent as well.  ", "The kids shared a pork chop over rice, with shrimp extra.  ", "We didn't ask, but when the bill came, I found that they had charged us an extra $4 for those three little shrimp.  ", "Ah well, this was still spring break, so a little bit extra splurge doesn't hurt."], "author": "Patty W.", "review": "After a failed attempt to go to the CA Academy of Sciences, we decided to make a day out of it in the city.  PPQ hit the spot.  I ordered the chicken curry noodles, which was so delicious that I asked the broth to be boxed up (I used the broth for my lunch the next day with a batch of noodles that I boiled up from scratch).  My husband ordered the ox tail noodles -- excellent as well.  The kids shared a pork chop over rice, with shrimp extra.  We didn't ask, but when the bill came, I found that they had charged us an extra $4 for those three little shrimp.  Ah well, this was still spring break, so a little bit extra splurge doesn't hurt.", "rating": 4, "date": "2009-04-22"}, {"excerpts": ["I love their five spice chicken, vermicelli salad, ox tail rice, egg rolls, curry seafood noodle soup, and raw beef lemon grass salad, satay beef noodle soup. ", "All of which has been by far the best I've tried from anywhere else in SF."], "author": "John W.", "review": "I love their five spice chicken, vermicelli salad, ox tail rice, egg rolls, curry seafood noodle soup, and raw beef lemon grass salad, satay beef noodle soup. All of which has been by far the best I've tried from anywhere else in SF.", "rating": 5, "date": "2010-09-22"}], "broccoli or chinese broccoli": [], "asparagus or tender green": [], "mixed greens and tofu": [], "deep fried tofu": [], "seasoned veggies": [], "three color drink": [{"excerpts": ["The one thing that I was disappointed with however was the three color drink. ", "First of all, it was way too beany and instead of those green jelly ", "noodle things, they used clear ones. ", "Also it was a bit too sweet for me. ", "I was also a bit disappointed because I think they overcharged me for my pho. ", "I asked for rare flank and meatball with some tendon. ", "they tacked on a charge for the extra tendon, presumably. ", "but had i just order something else but asked for no tripe, then they probably wouldn't have charged me extra. ", "i was a bit peeved by that. ", "nevertheless, the quality of food was pretty good, and I will definitely go again."], "author": "Bernie L.", "review": "PPQ is one of the best pho places I've come across in the city (probably tied with pho hoa on clement). All sorts of beefy goodness packed in one ginormous bowl.  They have some pretty good quality meat and a flavorful broth. They also provide you with a choice of noodles which is good because i tend to prefer the flat fun noodles.\r\n\r\nThe one thing that I was disappointed with however was the three color drink. First of all, it was way too beany and instead of those green jelly noodle things, they used clear ones. Also it was a bit too sweet for me. I was also a bit disappointed because I think they overcharged me for my pho. I asked for rare flank and meatball with some tendon. they tacked on a charge for the extra tendon, presumably. but had i just order something else but asked for no tripe, then they probably wouldn't have charged me extra. i was a bit peeved by that. nevertheless, the quality of food was pretty good, and I will definitely go again.", "rating": 4, "date": "2006-05-30"}], "red bean drink": [{"excerpts": ["My faves: \n- Bun Bo Hue - Spicy beef soup with rice noodles\n- Combo Beef Pho - has rare beef slices, flank, brisket, trip, tendon, and beef balls\n- Five Spice Chicken\n- BBQ Pork Rice Plate\n- BBQ Pork Vermicelli with Imperial Rolls\n- Red Bean Drink"], "author": "Sharon L.", "review": "This is definitely my go to Pho restaurant in SF! It has never failed me, and always satisfies my random cravings for Vietnamese food! \n\nPPQ has delicious food at great prices that don't break the bank. \n\nMy faves: \n- Bun Bo Hue - Spicy beef soup with rice noodles\n- Combo Beef Pho - has rare beef slices, flank, brisket, trip, tendon, and beef balls\n- Five Spice Chicken\n- BBQ Pork Rice Plate\n- BBQ Pork Vermicelli with Imperial Rolls\n- Red Bean Drink", "rating": 5, "date": "2011-03-07"}, {"excerpts": ["The BBQ beef and rice is good and the Red Bean drink is definitely worth checking out."], "author": "Deborah H.", "review": "I love this place!! Always has people at it; which is always a good sign...\n\nThe chicken salad is amazing...the dressing and the mint in the salad is awesome. I never knew mint in a salad would be so good... refreshing dish for sure. \n\nThe BBQ beef and rice is good and the Red Bean drink is definitely worth checking out.", "rating": 5, "date": "2009-05-28"}], "taro root tapioca drink": []}