{"traditional irish breakfast": [], "phoenix scramble": [{"excerpts": ["I had an amazing \"Phoenix Scramble\"  (irish bacon, sausage, mushroom, jack-cheddar & potatoes)\n\n"], "author": "Jessica C.", "review": "Wow!!!  Woke before last away Niners game and went for breakfast at the Phoenix  and not only did the 49ers win, but I felt like a winner too after and amazing breakfast!!!\n\nIt all started with the irish soda bread ... waitress was amazing trying to please everyone by adjusting the tv stations to accomadate everyone's football game of choice!\n\nLarge portions and food is well seasoned and make!  I had an amazing \"Phoenix Scramble\"  (irish bacon, sausage, mushroom, jack-cheddar & potatoes)\n\nMy boyfriend had the corn beef hash with eggs over easy... = sooo yummy!!!  I woke up this morning wishing I could take off work and go back for another fabulous breakfast!!!\n\nKitchen open til 1am !! OOOh Weeee!!", "rating": 5, "date": "2013-10-16"}, {"excerpts": ["I have tried the Dolores Omelet and the Phoenix Scramble and was happy with both. \n\n"], "author": "Joy L.", "review": "Despite all the mixed reviews, I really like The Phoenix. Yes, it does get super crowded and so busy when there is a game on, but that is to be expected. Happy Hour is between 4pm to 7pm on Mondays-Fridays, and it does get busy, but they have really good deals.  \n\nI have been here for brunch, and it was super crowded. Service was borderline non-existent but the food was good. I have tried the Dolores Omelet and the Phoenix Scramble and was happy with both. \n\nI have also been here for dinner and have had the Shepherd's Pie, the Farmhouse Vegetable Pie, and the Braised Lamb Shank. Everything was above average and reasonably priced.", "rating": 4, "date": "2014-01-10"}, {"excerpts": ["You should get the Huevos Valencianos w/ Sausage (has avocado, salsa, eggs, beans and good tortillas), Phoenix Scramble is always a safe call and my personal fav is the Skirt Steak w/ eggs & potatoes (it is a special on weekends so look out for it!) which has caramelized onions, mushrooms and a yummy sauce on top.  "], "author": "Ivan M.", "review": "The Phoenix is a great place.  It is my local, local and there are my great things about it that I'll divide in groupings:\n\nFood-\nFood is actually pretty good for bar food.  Should have the spicy wings (best in the City in my opinion) at least once.  Potato nachos sounds like a weird concept but they are very tasty here.  The Chipotle burger is the burger they have there.  They give you 2 big slices of chicken it comes w/ caramelized onions and mushrooms!!  For dinner entrees have the Chicken Pot Pie, chicken is really well made and the pie is so good and creamy.  My favorite is the breakfast.  You should get the Huevos Valencianos w/ Sausage (has avocado, salsa, eggs, beans and good tortillas), Phoenix Scramble is always a safe call and my personal fav is the Skirt Steak w/ eggs & potatoes (it is a special on weekends so look out for it!) which has caramelized onions, mushrooms and a yummy sauce on top.  Don't expect anything fancy w/ the food, just solid good bar food at decent prices.\n\nDrinks-\nNever have mixed drinks here to be honest but the Bloody Mary's are extremely popular w/ patrons, it is a must to try once.  Beers are not too expensive but they stopped serving Carlsberg which is a bummer.  Freshly squeezed OJ on weekends is always a good call.  Also try the Irish Coffees but good whiskey pls.  \n\nPeople-\nThe bartenders and servers are very nice.  Never had a bad experience w/ them.  The owner usually hires pretty chill girls as bartenders/waitresses (sorry ladies no eye candy for you).   They are all very nice and if you sit at the bar you can easily strike up a nice convo.  sadly there is always big turnover but they always seem to hire cool ppl.\n\nFootball/sports-\nThey have about 8 or 9 flat screen, HD TVs which are great for sports.  Place has become an absolute mad house on Sundays.  Get there early if you want a seat to watch the games.  If you get a good seat in the back you can watch like 4 to 5 games at once!  As long as you POLITELY ask the waitress to put your game on she'll do.  Just don't be rude to them and yell out stuff.  If you get there late, it will be standing room only.  For the Euro Cup finals, Champions League final or World Cup of course the place gets REALLY packed!!  As in people over flowing to the sidewalks trying to catch  glimpse of the game.  Good spot for Giants games esp now that they won it all..surprise, surprise...\n\nAtmosphere-\nThey have a bunch of Irish posters, pictures, paraphernalia all around the bar.  I've struck a bunch of interesting conversations w/ random strangers there.  It's nice and relaxed on the mornings (expect for Football of course) and at nights it becomes a good crowd/scene.  Folks that frequent the place are pretty cool too.  It'll never be a lounge or club (i hope!) but it's still great to go out to on Fri/Sat night.  \n\nBest advice is to sit at the bar.  Met some pretty nice/interesting folks in the 4+ years i've been coming here.  place attracts way chill people.  check it out!", "rating": 5, "date": "2009-09-25"}], "fresh homemade corned beef hash": [], "two eggs with irish bacon or sausage": [], "fried chicken  eggs": [], "hot  spicy chicken wings": [], "irish nachos": [{"excerpts": ["The 4 of us ordered 3 Guinness, an Oatmeal Stout, Irish Nachos, Calamari, and Sliders... with 2 Jamesons w/Ginger Ale cost about $95 with tip. ", "I think the portions are much bigger than happy hour prices, but it's way cheaper!! ", "Their Nachos were packed with a lot of sour cream and beans. ", "An order of sliders came in fours with some onions in it, it could be a little juicier, butfor me, it was a little dry. ", "Last but not least, CALAMARI, it was good with a pile of lettuce and arugula underneath. "], "author": "Eugenia W.", "review": "I love this place but parking is really crappy and when you do find parking, it's either super far away or it's a metered but it is $5.25 an hour!!! \n\nToday we went there for happy hour for our dear coworker who is leaving. We've been here many many many times before but the last time we've been here, we had another coworker tossing her cookies in the bathroom.....*hee*\n\nAnyway, in the beginning around 2:30-4:00, it's not as loud and it's not as hot so the atmosphere is pretty good. But then when it's actually happy hour hours.... it gets louder as more people gets packed and packed. They have happy hour specials and deals.\n\nThe 4 of us ordered 3 Guinness, an Oatmeal Stout, Irish Nachos, Calamari, and Sliders... with 2 Jamesons w/Ginger Ale cost about $95 with tip. I think the portions are much bigger than happy hour prices, but it's way cheaper!! Their Nachos were packed with a lot of sour cream and beans. An order of sliders came in fours with some onions in it, it could be a little juicier, butfor me, it was a little dry. Last but not least, CALAMARI, it was good with a pile of lettuce and arugula underneath. Other than that, it's pretty good.\n\nI don't like the bathrooms because it's always super cramped. I'm really tall (for a girl) and it was hard for me to maneuver in the stalls. \n\nIt's a good hang out place for after work.", "rating": 4, "date": "2016-03-09"}, {"excerpts": ["The Irish nachos are delicious, best Irish nachos ", "I've ever had. ", "We have a tradition of going to get the Irish nachos when it's raining. ", "Something comforting & cozy about the Phoenix in the rain. ", "Friendly service as well. ", "One of the better Irish bars in SF and my favorite Irish bar in the Mission."], "author": "Marybeth S.", "review": "Homey Irish bar with good food. The Irish nachos are delicious, best Irish nachos I've ever had. We have a tradition of going to get the Irish nachos when it's raining. Something comforting & cozy about the Phoenix in the rain. Friendly service as well. One of the better Irish bars in SF and my favorite Irish bar in the Mission.", "rating": 4, "date": "2017-11-11"}, {"excerpts": ["I had the Irish nachos and forgot to ask for chips instead of potatoes so when the nachos came out in realized it was on potatoes vs chips. ", "So no problem I ask for a side of chips, literally a handful was $3."], "author": "Koby G.", "review": "Drinks were good, but the food was just okay nothing to get excited about. I had the Irish nachos and forgot to ask for chips instead of potatoes so when the nachos came out in realized it was on potatoes vs chips. So no problem I ask for a side of chips, literally a handful was $3.", "rating": 3, "date": "2016-04-24"}, {"excerpts": ["We even had Irish Nachos (potatoes instead of chips) and Jalapeno poppers for game watching snacks. \n\n"], "author": "Rebekah T.", "review": "I came here to watch the World Series Giants game and during any major sports game, you'll find this bar crowded with the team spirit. \n\nMy friend saved seats at the bar, so we had excellent viewing. I couldn't imagine standing in that over crowded bar for 9 whole innings. I already knew we were going to sweep the Tigers, but it's fun to sit on the edge of your stool waiting for it. \n\nWe had beers, more beers and an irish car bomb. Irish Bars and Irish Car Bombs go together sweetly. We even had Irish Nachos (potatoes instead of chips) and Jalapeno poppers for game watching snacks. \n\nThe Phoenix is so lively, I left shortly and heard the people in the neighborhood commenting on the crowsd at the Phoenix. Filled to capacity and a whole lotta fun.", "rating": 4, "date": "2012-11-05"}, {"excerpts": ["What I liked the most was their Irish nachos. ", "Potato wedges slathered with cheese, guacamole, olives, and sour cream. ", "(Think nachos but without the nachos). ", "Yummmm. ", "Their artichoke dip was also pretty good!"], "author": "Christina C.", "review": "I came here for the World Cup Final and I'm so glad I napped a table (though it didn't really matter as I had to resort to standing at the end. Too many tall people!) It was super fun and lively during the game and I'm sure it's like that for all major sporting games and possibly any given night!\n\nWhat I liked the most was their Irish nachos. Potato wedges slathered with cheese, guacamole, olives, and sour cream. (Think nachos but without the nachos). Yummmm. Their artichoke dip was also pretty good!", "rating": 4, "date": "2014-07-30"}, {"excerpts": [".. got hungry and ordered the Irish nachos of the happy hour menu.. ", "they were just okay.. ", "Gave a star back to the bartender (Paula?) for the great bar service.."], "author": "Ron N.", "review": "Came in before a show at the Chapel.. Boddingtons on tap?.. yes, please.. shot of jameson on the side for happy hour?.. done!.. got hungry and ordered the Irish nachos of the happy hour menu.. they were just okay.. Gave a star back to the bartender (Paula?) for the great bar service..", "rating": 4, "date": "2016-04-20"}, {"excerpts": ["I ordered the blonde (the beer, not a woman), wings, and Irish nachos.  ", "The wings were good and appropriately messy.   "], "author": "Pam S.", "review": "This is my second foray into the world of the Phoenix- the first was for St. Patrick's Day when I was supposed to meet a group of friends, couldn't find them, so I left.  \n\nOf course I was first again for DYL, but then Stephan (and posse), as well as our organizer Kristina A showed up, so we were on our way to making it an epic evening.  \n\nFirst of all, I had been detoxing all week- so I was ready for some pub food and a couple of beers.  Nothing too crazy, as I wanted to get to the gym the next day.  \n\nThey have some killer deals- I ordered the blonde (the beer, not a woman), wings, and Irish nachos.  The wings were good and appropriately messy.   The nachos were okay, but I really wish PLACES WOULD TELL YOU WHEN THEY PUT GREEN ONIONS ON THINGS.  \n\nIn any case, the company I kept more than made up for some pesky quasi-vegetable that annoys me.  Got to see many of my old favorites, met some new people, managed to get drunk enough to tell people things I probably shouldn't have, as well as drunk dialed people who probably wish I didn't.  Sadly I didn't get an ass grab, which would have made my night.\n\nIt's a good space, and the staff was very nice and accommodating.   \n\nWould I come back?  Oh yes I would.", "rating": 4, "date": "2010-01-11"}, {"excerpts": ["I also got some Irish Nachos, which were quite tasty.\n\n"], "author": "Robert S.", "review": "I came here the day after Halloween.  Worth noting that the day after Halloween may be one of the few days you can sneak in with orange tights.  CUZ IT'S A BAR FOR REAL MEN, HOOAH!\n\nSeriously though, I really liked this place.  Sat down, and got started with my Smithwick's at 10 am sharp!  They kept feeding me, and feeding me, and feeding me, but unlike Method Man, it was for my benefit!\n\nI ordered some food too.  A sausage scramble.  It took a really, really long time to come out, which made me sad.  However, the bartender comped it for me, which I greatly appreciated.  I also got some Irish Nachos, which were quite tasty.\n\nThe people here are really great too.  I came in to watch the Niners game, and stayed for some extra football.  The crowd here was extremely knowledgeable, and we had some good football chatter going.  Definitely appreciated.  I even won a bet with another bar patron about where Dashon Goldson was from.  I correctly knew he was from UW, where he thought he was from LSU.  He got confused with Mark Roman and Curtis Taylor.  Duh ;)\n\nI'll def come again if I'm in the hood and need somewhere to watch some foosball.", "rating": 4, "date": "2009-11-15"}, {"excerpts": ["I just had the Irish Nachos and the buffalo wings ", "but they were amazing. ", "Buffalo wings were huge, moist, gooey, w/ enough heat. ", "Irish nachos were basically steak fries covered in cheese, guac, sour cream, black beans; ohh so good. \n", "4. ", "I got there too late ", "but I heard that the apps are 1/2 off during happy hour. "], "author": "Angelo F.", "review": "Arguably the best DYL since Kristina took the helm; the Phoenix proves to be one hott/happening place. Funny thing is that I was going to last minute \"sounds cool\" the event. I'm so glad I did not flake out, as I have been feeling really really exhausted the first week of January. If you have never worked in the Insurance Industry (Health Insurance particularly), you don't know how insane January is. People (including me) NEVER read their benefits pack from the HR. They always insist on a play by play by calling their insurance company. So in January, there is no scheduled PTO for any employee (except for Dr. appts.). \n\nThe place is pretty roomy w/ a bar on your left side, booths to the right when you enter. A couple of big screen TV's hang over the bar. In the back, there are more tables and the bathrooms, more TV's. When we went, there was a Monster Truck Rally playing. Awesome. \n\nHuge plus's: \n1. Bartenders were very attractive. Adam makes a very good point that calling a girl \"hot\" makes her seem unattainable, but very attractive is still in the ballpark. Also \"hot\" is so 2000 late. \n2. They take plastic (maybe this is also a minus as I have signed away an entire paycheck before). \n3. The food!!! I thought I knew what good bar food was until I ate at The Phoenix. I was moded! I just had the Irish Nachos and the buffalo wings but they were amazing. Buffalo wings were huge, moist, gooey, w/ enough heat. Irish nachos were basically steak fries covered in cheese, guac, sour cream, black beans; ohh so good. \n4. I got there too late but I heard that the apps are 1/2 off during happy hour. Must make it back there to confirm. \n\nThe only problem that night was when a drunk asshole \"demanded\" we sit down as we were blocking his view of the Golden State game. Amazing how entitled he felt. Apparently he thought there was enough seating there to accommodate everyone in the place.", "rating": 4, "date": "2010-01-11"}, {"excerpts": ["Yummy \"Irish Nachos\".  "], "author": "Napoleon R.", "review": "Good fish and chips.  Yummy \"Irish Nachos\".  Too many distracting TVs.  \n\nI give an extra star for their new late night kitchen hours:  Open until 1a.m.!", "rating": 4, "date": "2011-01-08"}, {"excerpts": ["The last time I went with a girlfriend we got a Hoegarden, Boddington, irish nachos, and garlic fries for like $13.  ", "Whaaaaaat.  ", "But srsly, their Irish nachos are no joke.  "], "author": "Christie C.", "review": "Phoenix is one of my favorite HH spots, and it's reallyreallyreally close to my place so I'm always pulling for it when the coworkers are deciding where to go on a Friday night.  Happy Hour specials go til 7 and they are amazing.  The last time I went with a girlfriend we got a Hoegarden, Boddington, irish nachos, and garlic fries for like $13.  Whaaaaaat.  But srsly, their Irish nachos are no joke.  Can't come here and not get them.\n\nMy only complaint was that we were sitting at the tables by the windows which were open, and a guy was standing there smoking.  We asked him if he could move to the other side (nicely, of course!) and he chose to be a dick about it.  C'mon srsly?  But it wasn't the Phoenix's fault, so I won't fault them for it.  But if you come here, please don't douche it up for the rest of us.", "rating": 4, "date": "2010-09-06"}, {"excerpts": ["The Irish nachos (fries with black beans, cheese, and sour cream) are excellent, in fact. \n\n"], "author": "Donna Z.", "review": "Casual, friendly, Irish, beer before noon. Six of my favorite words right there.\n\nThe Guinness is poured with wait time and precision and the food isn't bad. The Irish nachos (fries with black beans, cheese, and sour cream) are excellent, in fact. \n\nYou know it's good if real Irish people are inside (on both sides of the bar).", "rating": 4, "date": "2008-12-31"}, {"excerpts": ["Mm Irish Nachos and onions rings with some Guinness. ", "And my happy hour bill is only $10 for all of that? ", "Yes please!"], "author": "Analisa S.", "review": "Mm Irish Nachos and onions rings with some Guinness. And my happy hour bill is only $10 for all of that? Yes please!", "rating": 5, "date": "2011-08-16"}, {"excerpts": ["The Phoenix has Irish Nachos, which are like normal nachos, but made with potatoes instead of tortilla chips. "], "author": "Maia B.", "review": "Man, if you put \"Irish\" in front of anything, it makes it better. \n\nThink about it.  \n\nirish coffee != normal coffee\n\nOk, that's the only one I can think of right now.\n\nBUT! The Phoenix has Irish Nachos, which are like normal nachos, but made with potatoes instead of tortilla chips. So like, the best meal ever.\n\nirish pub != normal pub", "rating": 4, "date": "2009-06-10"}, {"excerpts": ["so we opted for the Irish Nachos: roasted potato wedges smothered in black beans, guacamole, cilantro and creme fraiche. ", "We wolfed that ish down in no time. ", "The hot wings also fared well. ", "The wings maintained their crispness even after it was tossed in the buffalo sauce. "], "author": "Monica N.", "review": "I knew this place was legit when our server started talking with an Irish accent. Whether real or phony, it brought a certain je-ne-sais-quoi authenticity to the place.\n\nTheir bar snacks were like Irish/Mexican fusion. And in my opinion, they pulled it off nicely. We were going to be boring and get the calamari but our server informed us that they were all out so we opted for the Irish Nachos: roasted potato wedges smothered in black beans, guacamole, cilantro and creme fraiche. We wolfed that ish down in no time. The hot wings also fared well. The wings maintained their crispness even after it was tossed in the buffalo sauce. If there's one thing I hate, it's soggy buffalo wings!\n\nLoved the retro Guinness poster that adorned the wall, saying \"My Goodness, My Guinness\" as well as the other sort of kitschy Irish pub decor. I was into it!", "rating": 4, "date": "2008-03-28"}, {"excerpts": ["The irish nachos are a must get. ", "I had the charboiled chipotle sandwich and it wasn't all that tasty... "], "author": "Eugenia Y.", "review": "This place is pretty awesome. \n\nThe irish nachos are a must get. I had the charboiled chipotle sandwich and it wasn't all that tasty... but really... was I ever there to eat? \n\nnope...\n\nJust go, grab some beers, and enjoy!!! It's a nice pubby feel, the server, I don't know her name but she's got a great memory and a nice accent.", "rating": 4, "date": "2008-07-25"}, {"excerpts": ["Irish nachos (aka cheese potatoes) were yummy\n\nGREAT wings\n\nCajun Chicken sandwich rocked.\n\n"], "author": "Matt V.", "review": "pretty damn good!\n\nIrish nachos (aka cheese potatoes) were yummy\n\nGREAT wings\n\nCajun Chicken sandwich rocked.\n\nWaitress (blond cute thing) rocked too...", "rating": 4, "date": "2008-05-27"}, {"excerpts": ["Stay away from the Irish Nachos:  ", "potato wedges covered with greasy cheese and sour cream.  "], "author": "Val K.", "review": "Two words:  Happy Hour.\n\nThis place has fantastic fish tacos for $3 during Happy hour.  Add that to the $3 garlic fries... Nummers!!   And, all big enough to share (or not).\n\nStay away from the Irish Nachos:  potato wedges covered with greasy cheese and sour cream.  If you do get them, eat them FAST because otherwise they solidify into a weird dairy/potato pile.  \n\nWe like going here to watch all the sports on TV, while sitting at the bar, and gorging ourselves for Happy Hour prices.     (4-7PM)", "rating": 4, "date": "2008-04-16"}, {"excerpts": ["The Irish nachos were fantastic and you can't beat the happy hour prices.  ", "The prices do go up quite a bit after happy hour.  "], "author": "Ed W.", "review": "The Mission is not my usual neighborhood but when I am there and want to grab a drink and a bite, I usally come here.  Went to the bar to watch the game on a Thursday night with a buddy.  Got there during happy hour and basically ordered everything on the happy hour menu!  The wait for the food was a little on the long side, but the place was full so maybe it's to be expected.  The fish tacos were great and so was the sliders.  The Irish nachos were fantastic and you can't beat the happy hour prices.  The prices do go up quite a bit after happy hour.  If you have to order from the regular menu, I'd go with the shepards pie.\n\nIt's a cool place to watch a game - they have plenty of TVs, expecially in the back, so every seat is pretty decent.  I'm a beer guy, so I can't comment on the quality of mixed drinks.  I sometimes wish they had more servers because things can get hectic, expecially during dinner time, but the servers are friendly and helpful when you get their attention.\n\nSo if you are bumming around the Mission and looking for some pub grub, a drink and maybe a little TV viewing, this may be the spot for you.", "rating": 4, "date": "2009-12-03"}, {"excerpts": ["The sweet tea vodkas, Irish nachos, and hot wings are my favorite! ", "The service here is very friendly, which is always a plus :0)"], "author": "Jenee Y.", "review": "This is my favorite happy hour place in the city. They offer great deals on food ranging from $3-$5. The sweet tea vodkas, Irish nachos, and hot wings are my favorite! The service here is very friendly, which is always a plus :0)", "rating": 5, "date": "2011-08-17"}, {"excerpts": ["I would've loved to try some of the bar food, especially the \"Irish Nachos\" and their fish and chips, but the server told us the kitchen was closed.\n\n"], "author": "Yvonne C.", "review": "I could not have pick a more appropriate day to check out this little Irish pub than on St. Paddy's Day.  It's only 8:30 and it's jam-packed. It's loud, full of drunk asses spilling beer all over the place, stuffy and fortunately, they serve great beer - now how can anyone go wrong with Stella Atrois on tap? Although, I felt like I was dishonoring St. Patrick by not throwing back an Irish car bomb or just plain ol' Guinness.  Oh well.   \n\nI would've loved to try some of the bar food, especially the \"Irish Nachos\" and their fish and chips, but the server told us the kitchen was closed.\n\nI give it 2.5 stars.  Half star goes to the bouncer who let me in without my ID.", "rating": 2, "date": "2008-03-19"}, {"excerpts": ["Get the Irish Nachos. ", "Yum!"], "author": "Kacie O.", "review": "Perfect if you want good food with your drinks in the mission.  Also, it is possible to sit and talk to friends here.  Get the Irish Nachos. Yum!", "rating": 4, "date": "2011-02-12"}, {"excerpts": ["We got two big dishes of garlic fries, a plate of southwestern potato skins (they call them Irish Nachos), a soda and a half pint of Guinness... for about $10. ", "Cheap delicious filling snackage FTW!!!"], "author": "Kathleen P.", "review": "Me and two of my friends visited this place during happy hour the other day. We got two big dishes of garlic fries, a plate of southwestern potato skins (they call them Irish Nachos), a soda and a half pint of Guinness... for about $10. Cheap delicious filling snackage FTW!!!", "rating": 5, "date": "2010-06-28"}, {"excerpts": ["Irish nachos, vegetarian pot pie, a side of butternut squash...these words induce Pavlovian salivation as I write them. ", "just beware how many pints you put away if you're having dinner here, portions are huge. ", "i have accidentally made myself agonzingly full at this place on a few occassions...", "I also love any bar that serves breakfast, and where you can get food or drinks, or coffee, and where you can not even know what you're doing or what you want and still find it there."], "author": "d v.", "review": "Irish nachos, vegetarian pot pie, a side of butternut squash...these words induce Pavlovian salivation as I write them. just beware how many pints you put away if you're having dinner here, portions are huge. i have accidentally made myself agonzingly full at this place on a few occassions...I also love any bar that serves breakfast, and where you can get food or drinks, or coffee, and where you can not even know what you're doing or what you want and still find it there.", "rating": 5, "date": "2008-06-16"}, {"excerpts": ["The Irish Nachos are the perfect drunk food - cheesy, guac, potato wedges, yum!!!  ", "The vibe...", "I haven't made a decision about yet...when we walked in (4 women - late 20s) ", "we noticed there were a lot of older guys around the bar giving us the once over.  ", "That was a tiny bit creepy, but at least they stuck to their seats and didn't offer to buy us a drink.  ", "I would've been out of there faster than you can say GROSS!  ", "In sum, good place to hang out with friends in the Mission (good food, inexpensive drinks, and lots of comfortable booths for the fat ass who eats too many Irish Nachos)."], "author": "Tabatha Y.", "review": "The Irish Nachos are the perfect drunk food - cheesy, guac, potato wedges, yum!!!  The vibe...I haven't made a decision about yet...when we walked in (4 women - late 20s) we noticed there were a lot of older guys around the bar giving us the once over.  That was a tiny bit creepy, but at least they stuck to their seats and didn't offer to buy us a drink.  I would've been out of there faster than you can say GROSS!  In sum, good place to hang out with friends in the Mission (good food, inexpensive drinks, and lots of comfortable booths for the fat ass who eats too many Irish Nachos).", "rating": 4, "date": "2006-09-08"}], "hot spinach and artichoke dip": [], "fried pickle spears": [], "two tacos": [], "chipotle chicken quesadilla": [], "crispy chicken strips": [], "sliders": [{"excerpts": ["The 4 of us ordered 3 Guinness, an Oatmeal Stout, Irish Nachos, Calamari, and Sliders... with 2 Jamesons w/Ginger Ale cost about $95 with tip. ", "I think the portions are much bigger than happy hour prices, but it's way cheaper!! ", "Their Nachos were packed with a lot of sour cream and beans. ", "An order of sliders came in fours with some onions in it, it could be a little juicier, butfor me, it was a little dry. ", "Last but not least, CALAMARI, it was good with a pile of lettuce and arugula underneath. "], "author": "Eugenia W.", "review": "I love this place but parking is really crappy and when you do find parking, it's either super far away or it's a metered but it is $5.25 an hour!!! \n\nToday we went there for happy hour for our dear coworker who is leaving. We've been here many many many times before but the last time we've been here, we had another coworker tossing her cookies in the bathroom.....*hee*\n\nAnyway, in the beginning around 2:30-4:00, it's not as loud and it's not as hot so the atmosphere is pretty good. But then when it's actually happy hour hours.... it gets louder as more people gets packed and packed. They have happy hour specials and deals.\n\nThe 4 of us ordered 3 Guinness, an Oatmeal Stout, Irish Nachos, Calamari, and Sliders... with 2 Jamesons w/Ginger Ale cost about $95 with tip. I think the portions are much bigger than happy hour prices, but it's way cheaper!! Their Nachos were packed with a lot of sour cream and beans. An order of sliders came in fours with some onions in it, it could be a little juicier, butfor me, it was a little dry. Last but not least, CALAMARI, it was good with a pile of lettuce and arugula underneath. Other than that, it's pretty good.\n\nI don't like the bathrooms because it's always super cramped. I'm really tall (for a girl) and it was hard for me to maneuver in the stalls. \n\nIt's a good hang out place for after work.", "rating": 4, "date": "2016-03-09"}, {"excerpts": ["Tried the half orders of the fish and chips, chicken tenders, and sliders plus a side order of fries...", "the tenders were a bust but the rest of it was bar food, slightly elevated and crazy greasy good.  "], "author": "Justin B.", "review": "Came by for dinner last night with a friend to watch the end of the Eagles/Falcons game then the first half of the Niners game; great mix of locals-only bar, great bar food, and dive bar prices for happy hour.\n\nAtmosphere was on point; a couple of TVs, but not so many TVs that it's a full-on sports bar...a couple of bartenders, both of whom made and served beer and rail drinks as fast as any place I have ever been...locals yelling about how terrible the Niners were playing (at least, in the first half) mixed with people like me who just wanted a place to finish a pint.\n\nTried the half orders of the fish and chips, chicken tenders, and sliders plus a side order of fries...the tenders were a bust but the rest of it was bar food, slightly elevated and crazy greasy good.  And the HH prices are solid here--$4-$6 per plate, so after we got a bunch of food (doubled up on the fish) and a few drinks, our bill was around $60, so I think we did pretty well given our location and the amount of time we were in there, about three hours.\n\nA nice find if you are visiting town!", "rating": 4, "date": "2015-09-15"}, {"excerpts": ["They have great burgers and sliders, made with either beef or lamb. "], "author": "Jake S.", "review": "We love this place. They serve food until 11 on weeknights, which is hard to find on this street. They have great burgers and sliders, made with either beef or lamb. The weeknight bar tender is efficient and has this \"all business\" attitude that I appreciate. \n\nThere is only one thing. Do not order the garlic hot wings. They are horrible. They smell horrible. Jus don't do it. So disappointing.", "rating": 4, "date": "2014-09-15"}, {"excerpts": ["So you can get some traditional favorites from the Isles, like Bangers and Mash, Shepherd's pie and the like, or you can go Cali Sports bar with Buffalo Wings, Burgers and Sliders. \n\n"], "author": "Wanugee N.", "review": "This is sort of an Irish Mission Dive Bar meets a Fusion Diner Sports bar. \n\nPhoenix is a couple of steps up from your classic Mission Dive Bar, there aren't enough hipsters and dingy decor for that, albeit there are plenty of skinny jeans and knit caps hiding bad hair. \n\nIt is a fun and friendly place, with the bartenders down home, and our waitress in the back was superbly professional and really nice, which is remarkable considering she was serving a group of loosely confederated real and virtually friended individuals that morphed between 10 and 30 through the night, who were partly from the Bay, and partly from San Diego, thanks to Mariela. \n\nBesides the long bar on the left, there are a lot of tables to get your grub sit-down style on the right and in the rear. They serve what one might call Irish-Cali sports bar comfort food. So you can get some traditional favorites from the Isles, like Bangers and Mash, Shepherd's pie and the like, or you can go Cali Sports bar with Buffalo Wings, Burgers and Sliders. \n\nThen there are the unique \"Fusion\" dishes fit for a half Irish, half Cali person who goes to major sporting events wanting Nachos Irish style, with potatoes instead of chips. \n\nGood fun place to gather that is relaxed with decent food and libations.", "rating": 4, "date": "2013-02-24"}, {"excerpts": ["Sliders are pretty small, but tasty."], "author": "Angela Z.", "review": "Came here a few weeks back the night the Giants made it into the World Series! That was the exciting part!\nThe place is cool for a dive bar. \nI didn't feel their happy hour was too great. I've had better for better prices.\nThe service was kinda crappy. We had to ask our server 4 times for a glass of water, finally the bar back took over our table and he was awesome!\nSliders are pretty small, but tasty.", "rating": 3, "date": "2014-10-28"}, {"excerpts": ["Phoenix has decent sliders, good shepards pie, and fantastic wings. ", "Good job guys."], "author": "andy s.", "review": "First off, I will say that I'm not really a huge sports guy. That being said, Phoenix boasts some of the best wings in the bay, super impressed.  I'm from the Midwest my whole life, and have been a bit disappointed in sf. Phoenix has decent sliders, good shepards pie, and fantastic wings. Good job guys.", "rating": 4, "date": "2014-11-05"}, {"excerpts": ["I had one of their sliders, and garlic fries, and they were very tasty. \n", "I wish this place was in the East Bay, mainly so I could visit it more often. ", "It's got, like, everything I want in a bar."], "author": "Jamie B.", "review": "Ahhh! Can't believe I've gone this long without writing a review for this place!\n\nAbout eight of us were going to a book signing at Borderlands, and came here first for a bite and a drink. We were lucky in that we snagged one of the last two tables to fit our group. \nIt's a bar, seating's first come first served. \nWe came during happy hour, so we all sampled from the HH menu. I had a cider on draft (so much better than from a bottle) another of my friends had a Guinness, and everyone else had mixed drinks. No complaints as far as alcohol content goes, so nice to know they don't water down the well for the cheapies out there. \nThe food was GREAT. Not a cluttered plate in the lot, and not much sharing at all. I had one of their sliders, and garlic fries, and they were very tasty. \nI wish this place was in the East Bay, mainly so I could visit it more often. It's got, like, everything I want in a bar.", "rating": 5, "date": "2012-11-27"}, {"excerpts": ["Nevertheless, stick to the brews (good, if a bit pricey) and the snacks (yum, though be sure to ask for your sliders medium rare)."], "author": "Jillian Y.", "review": "I'm...torn.  On the one hand, they HAVE margaritas.  On the other hand, their margaritas taste like Kool-Aid.\n\nOf course, you might be thinking to yourself, \"Why would someone order a margarita at an Irish bar anyway?\"  Valid question.  The answer, my friend, is Cinco de Mayo.  The answer is also \"The Mission,\" if the question were \"Why does an Irish bar serve margaritas at all?\"\n\nNevertheless, stick to the brews (good, if a bit pricey) and the snacks (yum, though be sure to ask for your sliders medium rare).", "rating": 3, "date": "2011-05-07"}, {"excerpts": ["The sliders were DELICIOUS, as were the chicken fingers and fries.  ", "Good Happy Hour deals. ", "I'd definitely come back, esp for a game as they had lots of TV's."], "author": "Genevieve S.", "review": "Came here to watch opening night football and I was impressed.  They have a good draft beer selection including a few great IPAs, which had me sold.  The sliders were DELICIOUS, as were the chicken fingers and fries.  Good Happy Hour deals. I'd definitely come back, esp for a game as they had lots of TV's.", "rating": 4, "date": "2011-09-09"}, {"excerpts": ["The fish tacos were great and so was the sliders.  "], "author": "Ed W.", "review": "The Mission is not my usual neighborhood but when I am there and want to grab a drink and a bite, I usally come here.  Went to the bar to watch the game on a Thursday night with a buddy.  Got there during happy hour and basically ordered everything on the happy hour menu!  The wait for the food was a little on the long side, but the place was full so maybe it's to be expected.  The fish tacos were great and so was the sliders.  The Irish nachos were fantastic and you can't beat the happy hour prices.  The prices do go up quite a bit after happy hour.  If you have to order from the regular menu, I'd go with the shepards pie.\n\nIt's a cool place to watch a game - they have plenty of TVs, expecially in the back, so every seat is pretty decent.  I'm a beer guy, so I can't comment on the quality of mixed drinks.  I sometimes wish they had more servers because things can get hectic, expecially during dinner time, but the servers are friendly and helpful when you get their attention.\n\nSo if you are bumming around the Mission and looking for some pub grub, a drink and maybe a little TV viewing, this may be the spot for you.", "rating": 4, "date": "2009-12-03"}], "poutine fries": [], "apple  goat cheese salad": [], "chipotle chicken salad": [{"excerpts": ["I ordered the Chipotle Chicken Salad which was actually really good and asked for Jalapenos which came with it.  ", "My bf ordered the cheese sticks and he also enjoyed his.  ", "The service from our waitress was great but what we really enjoyed was watching the cook.  ", "He is a young Latino guy working the kitchen by himself and pumping out finished dishes left and right.  ", "He wasn't even timing the fryer but everything came out golden fried to perfection.  "], "author": "Brandy B.", "review": "Based on my last three experiences here, I would have rated the Phoenix a two.  The wings were chewy, the service was terrible, and the doorman was ridiculously rude.  That all changed on my last visit to watch the NBA Finals.  Soo, SF is definitely not a basketball town and it is so hard to find any place that is playing a game, especially if there is a Giants game on.  My boyfriend and I stopped by Phoenix after we just couldn't stand standing anymore at Hi-Tops.  I was famished and although I've never really enjoyed any of the food I'd had here, I gave in. \n\nWe walked in and there wasn't really any seating but I asked a waitress anyways and she offered us a corner counter top area, which had a good view of the kitchen (which I always like).  I ordered the Chipotle Chicken Salad which was actually really good and asked for Jalapenos which came with it.  My bf ordered the cheese sticks and he also enjoyed his.  The service from our waitress was great but what we really enjoyed was watching the cook.  He is a young Latino guy working the kitchen by himself and pumping out finished dishes left and right.  He wasn't even timing the fryer but everything came out golden fried to perfection.  Everything looked good!!!\n\nAlthough I was so reluctant to come here, I'm glad I did because they must have changed the waitstaff and the cooks because I was actually impressed.  I can't wait to go back but I'll make sure its the same cook before I order any food.", "rating": 4, "date": "2013-06-17"}], "homemade soup of the day": [], "irish blt with avocado": [], "homemade corned beef reuben": [], "grilled hamburger choice of beef turkey or veggie": [], "black  blue burger": [], "grilled rack of lamb": [], "grilled ribeye steak": [], "irish lamb stew": [], "bangers  mash": [], "guinness braised beef pot roast": [], "oven baked chicken pot pie with a side salad": [], "shepherds pie with a side salad": [], "baked macaroni  cheese": [], "homemade coleslaw": [], "creamy mashed potatoes with gravy": [], "side fresh vegetables": [], "mac  cheese cup": []}