{"butter lettuce fresh herbs": [], "chilled mussels frise croutons shallots chives aged red wine vinegar": [], "marinated smoked herring gigante bean salad": [], "dungeness crab txangurro orange grapefruit basil aioli": [], "warm sheeps milk cheeseham terrine aged sherry": [], "beef crudo chile granny smith fingerling chips": [], "seasonal mushroom tartlet thyme garlic": [], "endive salad perfect blondes pear pomegranate walnut oil": [], "calamari a la plancha fennel olive caper mint lemon": [], "piquillo peppers goat cheese pistachios golden raisins": [], "artisanal cheese selection": [], "serrano ham arrels olive oil": [], "cinco jotas ibrico de bellota oz": [], "garlic soup rock shrimp bacon egg bread": [], "piprade": [], "roasted cornish hen flageoletchorizo leeks chimichurri": [], "pacific snapper spinach fried garlic vinaigrette": [], "sauted california swordfish brussels sprouts butternut squash brown butter froth": [], "braised seafoodshellfish stew red pepper sauce": [], "roasted rack of lamb merguez fennel breadcrumb pecan cumindate relish": [], "oven roasted liberty duck breast parsnips caramelized quince": [], "new york steak romesco broccolini garlic ossauiraty": [], "mondays  albacore marmitako saffron potatoes": [], "tuesdays  calamari txipiroa ink sauce rice": [], "wednesdays  seafoodshellfish soup ttoro": [], "thursdays  duck confit braised green lentils": [], "fridays  black cod porrusalda potatoes leeks": [], "saturdays  braised veal cheeks with peppers": [], "pommes frites": [{"excerpts": ["We ordered the pommes frites as well, and they were amongst the best shoestring french fries I've ever had. ", "The Calamari Txipiroa, however, which was their special of the night, was really not a dish I enjoyed at all. ", "I don't know what \"ink sauce\" is supposed to taste like, and perhaps the dish was prepared flawlessly ", "and I simply have a peasant's palate, but to me the entire dish tasted like smoke and rice. ", "I actually left it mostly unfinished on my plate. "], "author": "Sean B.", "review": "Disappointing, for an upscale establishment in the Financial District. I have the sense that they often do better than they did last night, but last night was \"off\" in a few important ways.\n\nI arrived quite early, at 6:45pm for a 7:15pm reservation; and as such, had absolutely no expectation that I would be seated early. My expectation was to have a cocktail at the bar and await my friend's arrival. However, since I was there anyway, I figured I'd announce myself to the Maître d so they would know I was present. So I did, then I went to take a seat at the bar, however there weren't any seats. So I walked outside and took a seat on the stairs of the chiropractor's office nextdoor and waited a bit. Understandable, so far everything was as one would expect.\n\nMy friend arrived and we announced ourselves at 7:10pm for our 7:15pm reservation. We were told that our table wasn't ready yet, but that there were two seats at the bar, and we were welcome to sit there until they were ready for us. So we walked through the crowded restaurant to the two seats at the back of the bar, to be informed by someone that they were \"saved\" for his two friends who were in the restroom. So we cancelled our order with the bartender and walked BACK to the front of the restaurant to wait again.\n\nAt 7:30pm we were told our table (7:15 reservation) was almost ready. And again at 7:45pm. At 7:50pm we were offered complimentary cocktails since we had to wait so long. At 8:00pm we were finally seated. In the meantime, I had to call and cancel an appointment I had made for after dinner; there was no way I could make it on time. That appointment had to be rescheduled for next Friday, as they had no other openings beforehand... so now my schedule for the week is skewed and my weekend plans have to be adjusted. Really annoying.\n\nThe food was fairly hit-or-miss. Credit where credit is due; the stuffed piquillo pepper was flavorful and delicious. Though the menu said peppers and it was, in reality, one small pepper (for $14). It was fantastic and totally worth getting, even at that price, but a bit misleading and I was already cranky at this point.\nWe ordered the pommes frites as well, and they were amongst the best shoestring french fries I've ever had. The Calamari Txipiroa, however, which was their special of the night, was really not a dish I enjoyed at all. I don't know what \"ink sauce\" is supposed to taste like, and perhaps the dish was prepared flawlessly and I simply have a peasant's palate, but to me the entire dish tasted like smoke and rice. I actually left it mostly unfinished on my plate. The orange blossom beignets somewhat made up for this, as they were perfection.\n\nIn summary, a delightful aesthetic, poor organization and time management, cursory efforts to compensate us for a fairly ridiculous wait, some really good dishes, some really unpleasant dishes, and pricey.\n\nI probably wouldn't return; in a city with so many high-end restaurants, I suspect that there's just better out there.", "rating": 3, "date": "2014-10-01"}, {"excerpts": ["We shared a bunch of plates: Fried Manchego, Beef Crudo, Calamari \"a la Plancha\", \nStuffed Piquillo Peppers, Steamed White Sea Bass, Duck Confit, Pommes Frites, and Potato + Manchego Gratin (probably the best dish we had).\n\n"], "author": "Meredith K.", "review": "I wanted to like you, I really did...\nI was pretty disappointed all around.  I've heard and read good things but everything lacked - service and food.  The restaurant was nearly empty then again it was early in the weekday for dinner in what I'm sure is a bustling area during the work hours.  \n\nWe shared a bunch of plates: Fried Manchego, Beef Crudo, Calamari \"a la Plancha\", \nStuffed Piquillo Peppers, Steamed White Sea Bass, Duck Confit, Pommes Frites, and Potato + Manchego Gratin (probably the best dish we had).\n\nAll in all it was just ok.  Our server must have been anxious to leave since she was pushy about collecting the bill.  There was one point she was staring at our table while my gf was sobbing telling us a story of her dad w/ cancer.  I never need to come back here.", "rating": 1, "date": "2014-07-16"}, {"excerpts": ["And the pommes frites we got on the side were simply store-bought frozen fries. "], "author": "Kazu O.", "review": "I really hope this was just an off-night for Piperade; otherwise, I would think you fellow Yelpers giving the high marks here are on crack! Come on.. raw chicken?\n\nWe came here by default because it was the only place that could accommodate a party of 6 on short notice on a Saturday night.  We had 2 appetizers: the cold mussels with bread salad was okay, but the \"bread\" was just straight up CROUTONS. The open mushroom pie though, was AMAZING. This was the best piece of food of the entire night.\n\nThe entrees were nothing but disappointment. I ordered the lamb. It was decent, but the rack I had at Chouchou less than a month ago was way better. Also, it was way more overcooked than the medium rare that I had ordered. In fact, I'm sure the lamb that went to the other person at our table was medium rare when she had ordered medium. Umm.. when the waiter brought the food, didn't I ask, \"Is this the medium rare?\" As for the other entrees.. well.. I have nothing good to say. The sea bass was very overcooked and bland. The sauce/toppings that came with the chicken was good, but one of the chickens at our table was so undercooked that it was raw in the center. Shouldn't a chef know how long to cook a chicken breast? And the pommes frites we got on the side were simply store-bought frozen fries. Yea... totally not worth it.\n\nService was not good, either. My water glass was empty for most of the meal and no one came back to check on us, even when my friend was waiting for someone to come by to take back the raw chicken. Horrible.\n\nI guess we weren't the only ones who were dissatisfied, because the couple at the table next to us just walked out of the restaurant since their food never came out.\n\nNope, not going back there again.", "rating": 2, "date": "2010-02-14"}, {"excerpts": ["Pommes frites were outstanding and so was the service."], "author": "K K.", "review": "Dined on a Friday night at 8 pm. We arrived on the dot and we were escorted to the table with a smile. The crowd was mostly 40+.  Starting with calamari was warm and tasty. I loved the brussels sprouts slaw with pickled herring. The sautéed serano ham with poached egg was just okay, not what we expected, a bit of a let down really (too much red pepper sauce).  The sole was a very healthy portion, good though a bit lackluster over a bed of spinach. It was a treat to have a bottle of txakoli and reminisce of past trips times in Basque Country.  Pommes frites were outstanding and so was the service.", "rating": 4, "date": "2013-02-05"}, {"excerpts": ["i would def recommend the butter lettuce salad, the crab and mango stack, the pommes frites, the creamy and heavy potato au gratin and the amazing cherry and heirloom tomato tart w a balsamic reduction!! ", "ohh and they make a pretty mean arnold palmer!!"], "author": "Kaylan S.", "review": "4.75!!\ndeeelish!!\nclean, modern atmosphere. service is excellent. good location. and even if all of these weren't true, and the food was served in a dark dingy alley atop old dirty trash can lids i would still devour it and give em a stellar rating!!! i would def recommend the butter lettuce salad, the crab and mango stack, the pommes frites, the creamy and heavy potato au gratin and the amazing cherry and heirloom tomato tart w a balsamic reduction!! ohh and they make a pretty mean arnold palmer!!", "rating": 5, "date": "2008-10-08"}], "seasonal vegetables": [{"excerpts": ["The vegetarian entree was \"Basque Rice \"Gaxuxa,\" Seasonal Vegetables, Sheep's Milk Cheese, Espelette,\" the espelette being the only thing that sets this dish apart from every other mediocre risotto in town. ", "But hey, the kitchen even forgot to add the espelette. "], "author": "Kirsten N.", "review": "Service was abysmal but I guess they don't need to provide good service since they tack on an 18% service charge (for a party of 3).  I can't comment too much on the food because it was not a great choice for a vegetarian, which I knew. The vegetarian entree was \"Basque Rice \"Gaxuxa,\" Seasonal Vegetables, Sheep's Milk Cheese, Espelette,\" the espelette being the only thing that sets this dish apart from every other mediocre risotto in town. But hey, the kitchen even forgot to add the espelette. Nice quality control. \n\nThe dark chocolate dessert was great.", "rating": 2, "date": "2015-06-24"}], "potatomanchego gratin": [], "basquerak": [{"excerpts": ["We had 2 cocktails (Basquerak and Donostia), and some Voss still water as far as beverages go.  ", "The Basquerak is similar to a Sazarac - not sweet and made with bitters.  ", "I had the Donostia, which is gin based, and also not sweet.  ", "Both of these drinks are very good and strong , but to be savored slowly.   ", "The appetizers (Ttipiak)  are small plates, similar to tapas, so we went for three of them: piquillo peppers,  calamari \"a la Plancha\", and the marinated mussel salad.  ", "All three were outstanding.  ", "For entrees, we had the steamed pacific rockfish with bed of spinach, and the chicken breast, roasted gernika peppers, white beans, and chorizo.  ", "The gernika peppers are mild and very flavorful, and complements the chicken breast and white beans well.  ", "The restaurant feels warm and comfortable, and the service is excellent.  ", "For desert we had the gateau basque (marzipan cake with cherry preserves) and gateau warm chocolate cake - both were mind blowing."], "author": "John H.", "review": "My wife and I picked this restaurant based on very positive Yelp feedback, and because it is Basque cuisine, and we wanted to try something different.  Basque is not French or Spanish, but its own distinct style of food.  We had 2 cocktails (Basquerak and Donostia), and some Voss still water as far as beverages go.  The Basquerak is similar to a Sazarac - not sweet and made with bitters.  I had the Donostia, which is gin based, and also not sweet.  Both of these drinks are very good and strong , but to be savored slowly.   The appetizers (Ttipiak)  are small plates, similar to tapas, so we went for three of them: piquillo peppers,  calamari \"a la Plancha\", and the marinated mussel salad.  All three were outstanding.  For entrees, we had the steamed pacific rockfish with bed of spinach, and the chicken breast, roasted gernika peppers, white beans, and chorizo.  The gernika peppers are mild and very flavorful, and complements the chicken breast and white beans well.  The restaurant feels warm and comfortable, and the service is excellent.  For desert we had the gateau basque (marzipan cake with cherry preserves) and gateau warm chocolate cake - both were mind blowing.", "rating": 5, "date": "2011-09-03"}], "elkano": [{"excerpts": ["* Elkano (Botran Reserva Rum, King GInger, Pineapple, Peach Bitters. ", "$10) - 4 stars\n", "This was light & refreshing, just like I asked our server to recommend me, ", "quite boozy yet well-balanced. "], "author": "Ziyan C.", "review": "I always think of Piperade as a nice hidden gem. Close to a lot, yet on its own quiet litle street. Romantic, lively but not noisy, but a little overpriced.\n\nTHE COST\nWe got a TravelZoo deal: $79 for 2 glasses of wine, 2 starters, 2 entrees, & 2 desserts. It was worth it, though I would've found it a little much at full price ($148 value).\n\nSERVICE\nThe hostess was great: friendly, came around often to fill water & other little things. Our server, however, didn't show up at our table for a good 10 minutes, even after we were looking around the restaurant quite obviously. He acted a little too suave & could've been more apologetic about (or even just acknowledged) ignoring us for so long. He did let me upgrade my glass of wine (part of our TravelZoo deal) to a cocktail for free.\n\nCOCKTAILS: http://www.yelp.com/biz_photos/piperade-san-francisco?select=KoYaJDlobS-3wt7udyCg3Q#KoYaJDlobS-3wt7udyCg3Q\n* Elkano (Botran Reserva Rum, King GInger, Pineapple, Peach Bitters. $10) - 4 stars\nThis was light & refreshing, just like I asked our server to recommend me, quite boozy yet well-balanced. My bf usually doesn't like the cocktails I get but was floored by this one.\n\nTTIPIAK (Small): http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#UinIriSngshUjphtMN9F2A\n* Stuffed Piquillo Peppers, Goat Cheese, Pistachios, Golden Raisins ($14) - 4 stars\npic: http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#lRyC9u_fWrR_WBkMpy71GA\nThe thick sweet cheese inside was the best part. I'm not sure what the green streak on the plate was, & it didn't have too much flavor.\n\n* Warm Sheep's Milk Cheese + Ham Terrine, Aged Sherry ($15) - 4 stars\npic: http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#ZeljWHl_gQ18Pj7BR5NLxw\ncross-section: http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#M_weTOlpY9xoG0lG96QfIQ\nLike the last time I had this, it was very salty, but this was countered well by the greens in balsamic. Unlike last time, I did notice the the layers of cheese in the ham, but the meat was definitely much more prominent. It was lightly breaded & crisped - great texture!\n\nEUSKALDUNENAK (Traditional Basque Specials): http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#0Q2Zn1SCEMl5zHkc-nlxoQ\n* Veal Stew \"Axoa,\" Braised Peppers (Saturdays. $26) - 4 stars\npic: http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#ew7oTmHG79o_1ooqlss5FA\nThis had very very hearty & moist chunks of meat. Good flavor to the soup, too.\n\nHAUNDIAK (\"Larger things\"): http://www.yelp.com/biz_photos/piperade-san-francisco?select=zOGrylgtKmplZAODw9EQpQ#zOGrylgtKmplZAODw9EQpQ\n* Rack of Lamb, Merguez, Fennel, Breadcrumb, Pecan, Cumin + Date Relish ($32) - 3.5 stars\npic: http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#bnObyzJgnW1wuFocUreRUw\nVery rare, mostly pink. I had very high expectations & found the meat, despite being so rare, to be surprisingly tough to cut through. This wasn't bad by any stretch, but I've just had way better cuts of meat as well as flavor of lamb.\n\nDESSERT: http://www.yelp.com/biz_photos/piperade-san-francisco?select=1QOsrStL7C16F94Xz1qfhA#1QOsrStL7C16F94Xz1qfhA\n* Milk Chocolate + Hazelnut \"Biarritz Rocher\" ($9) - 5 stars\npic: http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#gfNhG0QZYs1SyOoTosMpbw\nI didn't think I would really like this, but OMG the crust at the bottom - we both went CRAZY for this! It was thick, had a wafer-like crunch to it, but was a little more dense than you'd imagine. This perfect crisp when you chewed into it, coupled with a burst of flavor, made this fantastic.\n\n* Yogurt Cake, Honey, Apricots ($9) - 4 stars\npic: http://www.yelp.com/biz_photos/piperade-san-francisco?select=HXkzPVUZulffieOfbHIIqA#HXkzPVUZulffieOfbHIIqA\nThis was good to balance with the intense chocolate dessert above. The yogurt itself was really great w/ a thick texture, & the honey went well. The cake was like a light cheesecake, & came together well with the honey & apricots.", "rating": 4, "date": "2014-09-23"}, {"excerpts": ["The Elkano: Two of us hated it. ", "The other two LOVED it. ", "I fall into the \"Love\" column. "], "author": "Jonathan R.", "review": "Beautiful is the best word to describe pretty much anything and everything about Piperade. \n\nThe interior is dimly and is very lounge like, making you feel so much more relaxed. We were seated in a smaller dining room off to the left of the host stand and for the first half of our meal we were alone. Separating our dining room with the other, more full dining room, is a wine cooler.\n\nI was here for a business meeting with five other people, so a variety of different food was tried and enjoyed. The very first thing we enjoyed was the bread. Even though the bread was cold, it still tasted good and instead of serving it with butter, bottles of olive oil are placed on the table. \n\nWe shared plates of the sea scallops, the four cheese plate, a crab cake, and bowls of tomato puree bisque. The scallops come with parsnip puree and a shaved apple salad. \n\nThe scallops were cooked beautifully, so I didn't have to pull a Gordan Ramsey and smash them against the table. The parsnip puree I couldn't taste much of but the shaved apple salad paired very well with the scallops. \n\nThe four cheese plate was minimal in quantity, but all four had amazing flavor. My favorites would have to be both the blue cheese, and the goat cheese that was served. The cheese is served with a Spanish fig cake that was very delicious and paired great with every piece of cheese on the plate. \n\nThe only \"cake\" like about the crab cake, was the shape. The circle of crab was very easy to pull apart with your fork for bite after bite of deliciousness. \n\nThree of us ordered the tomato bisque, which were then passed around so all could try. It tasted pretty good, but nothing too special. \n\nFor my entree I ordered the blue nose sea bass, which was served with sautéed spinach and fried garlic vinaigrette. My first time having bass, and I must say I am now a fan: Very flaky, and with marvelous flavor. The bass was great but the spinach with the garlic vinaigrette was spectacular. I could have probably eaten plate after plate of just that. \n\nI was able to sample a bite of both the pork cheeks and the prunes they are served with. Both are excellent. The cheeks are tender, and the prunes are just delicious. \n\nAlso must have are the potato and manchego gratin. We had four orders of this, and all four orders were completly emply by the time we left. I would say this dish was probably the star of the night. \n\nFour of us ordered the same cocktail. The Elkano: Two of us hated it. The other two LOVED it. I fall into the \"Love\" column. Being that I love rum and being that this drink really packs the rum into it, plus adding all the fruity flavors to it, the drink was pretty damn good. \n\nThe service was pretty OK and average. Everyone who waited on us, seemed to be in such a hurry to the point where I for one felt a little rushed. No orders were served wrong and everyone was happy with their meals.\n\nPiperade is for lack of a better word, PHENOMENAL.", "rating": 4, "date": "2015-02-10"}, {"excerpts": ["From cocktail, I tried Elkano which wasn't bad but made me peek into their wine list!"], "author": "Roshni G.", "review": "Went there for a date night. Ambience is nice, I had a reservation so they were able to seat us as soon as we got in. The place was packed and noisy- so definitely not a best option for a date night! Staff were okay, not great!\n\nFood was pretty good! I liked the appetizers that we had ordered - toy box tomato tartlet  and stuffed piquillo peppers were pretty good! Main course didn't impress me that much! From cocktail, I tried Elkano which wasn't bad but made me peek into their wine list!", "rating": 3, "date": "2016-09-26"}], "picon punch": [{"excerpts": ["We were seated and immediately ordered a Picon Punch (Basque tradition, usually cheap red wine and coca cola, or is that just done in Elko? - because this one was WAY better), and a blood orange and vanilla cocktail for me. ", "I'd order the Picon Punch again.\n\n"], "author": "Jaime L.", "review": "The five stars may be a bit biased. Perhaps it was only four and a half stars? About five years ago I attended the Basque Festival in Elko, NV, and found out about Chef Gerald Hirigoyen by purchasing Pintxos and The Basque Kitchen, two incredible Basque cookbooks. A couple of my favorite recipes are from these books - so yes, I might be a little biased to have finally attended his restaurant.\n\nThe boyfriend felt bad rolling up in jeans, and I in leggings, but the hostess assured us that it would be fine - however, just keep in mind this place is a bit dressy. We just didn't want to pack anything fancy for a 36 hour SF trip - :\\\n\nThe service here is wonderful. The ambience is quaint, and beautiful. Soft, romantic lighting, cool decor, minimalist but still fancy. We were seated and immediately ordered a Picon Punch (Basque tradition, usually cheap red wine and coca cola, or is that just done in Elko? - because this one was WAY better), and a blood orange and vanilla cocktail for me. I'd order the Picon Punch again.\n\nWe had a sheep's milk cheese and ham terrine - split for us - and it was divine. I mean, literally divine. It was perfect. I wanted like, eight more. But alas, we had to eat the main courses, so I enjoyed it while I could, savoring each bite to the fullest. Grand.\n\nUsually I stay away from seafood unless it's sushi or Plouf (mussels). However, since the Basque are well known for their seafood dishes, Ryan suggested I try the stew - and it was amazing. Seriously, it was. The mussels were perfect, the scallops were so good, whatever fish was in there I savored, all in this magnificent stew sauce. I mean, I was amazed. And Ryan's steak - buttery, cooked perfectly - he was incredibly satiated.\n\nSave the best for last: dessert. We ordered two, the almond mousse and the orange blossom beignets, accompanied by a 20 year Tawny.\n\nIn August 2010, I had dinner at Ad Hoc with my cousins. Afterward we walked to a ridiculously fancy hotel in Yountville for drinks, and I passed by the most fragrant bushes - orange blossoms. I could have stood there for hours just breathing deeply, and to my companions, it felt like I did.\n\nThe orange blossom beignets ignited that peaceful memory of a perfect night. The beignets themselves, hallowed and crunchy, could not have possibly been made any better. Their orange blossom scent lifted through the back of the throat and back down the nose, in a fragrant cycle. I was almost afraid of tasting the mousse - how could anything live up to the beignets? Surprisingly, it did. The almond mousse was perfect. Everything was perfect. The whole thing.\n\nI want to come back here. Forever and ever.", "rating": 5, "date": "2015-04-14"}, {"excerpts": ["From picon punch to caramel \"koka\" our meals are always excellent.\n\n"], "author": "stephanie c.", "review": "I've been to Piperade many times and had a great experience each and every time. I've tried much of the menu, lamb chops, piperade, rabbit stew, halibut, garlic soup, ham and sheep's milk cheese terrine, etc and found all of the dishes to be enjoyable, comforting and made with the highest quality ingredients.  From picon punch to caramel \"koka\" our meals are always excellent.\n\nBoth my BF and I have Basque grandparents and both of us have taken our parents here with great results. My father says the piperade reminds him of how his mother made it and my BF's mother who is the toughest critic of all has had nothing but praise for our meals there. Without sounding overly sentimental, my boyfriend and I learn something new about our Basque heritage every time we share a meal with our families here. \n\nPiperade has a menu that manages to be sophisticated and homey and service that is crisp and professional yet never pretentious. One of my favorites in the city, bar none.", "rating": 5, "date": "2007-04-09"}], "gascon": [{"excerpts": ["Had the gascon mixed drink, stuffed pequillo peppers, butternut squash soup, black bass on leeks and potatoes and dessert.  ", "All of it was tasty and pretty light.  ", "A perfect lunch."], "author": "Nancy L.", "review": "Really delicious food! Had the gascon mixed drink, stuffed pequillo peppers, butternut squash soup, black bass on leeks and potatoes and dessert.  All of it was tasty and pretty light.  A perfect lunch.", "rating": 4, "date": "2015-10-13"}, {"excerpts": ["w/ caramelized shallots, gascon fries and portobellos\n\n"], "author": "Katie K.", "review": "Must order: \n- artisan foie gras sauteed with Monterey squid, grapes and verjus\n- bistro steak w/ caramelized shallots, gascon fries and portobellos\n\n* they also had a special duck confit which was equally superb", "rating": 5, "date": "2007-08-28"}, {"excerpts": ["I had the Bistro steak with caramelized shallots, gascon fries and portobellos for dinner.  ", "The steak was cooked properly (medium rare) and a good texture, but completely flavorless. ", "It tasted like they cooked it with no seasoning at all. ", "The caramelized shallots did not mask the lack of flavor either.  \n", "My date had the Orange blossom beignets for desert and they were fabulous.  ", "If I dine here again, perhaps I will try the small plates."], "author": "PictureGirl F.", "review": "The atmosphere is charming with lots of wood, windows and mellow lighting.  The waiters are very personable and attentive.  The wine was very good.\n\nWe started with the Warm sheep's milk and ham terrine.  It was tasty. I had the Bistro steak with caramelized shallots, gascon fries and portobellos for dinner.  The steak was cooked properly (medium rare) and a good texture, but completely flavorless. It tasted like they cooked it with no seasoning at all. The caramelized shallots did not mask the lack of flavor either.  \nMy date had the Orange blossom beignets for desert and they were fabulous.  If I dine here again, perhaps I will try the small plates.", "rating": 3, "date": "2007-07-29"}, {"excerpts": ["Cooked to perfection - with wonderful gascon fries and caramelized shallots. \n", "My first visit ", "a month or so prior - I sat at the bar with a friend. ", "I ordered a manhattan on the rocks. ", "The bartender was so personable - the cocktail was perfection. ", "I really like this bar. ", "We ate at the bar that night ", "and I have to say I will be doing that many more times. \n", "This is a beautiful dining experience - worth every penny you may spend. ", "This establishment is seriously devoted to making your experience within its 4 walls worth the effort of the visit. ", "I hope they save a seat at the bar for me......this Wednesday."], "author": "Tom R.", "review": "Somehow I fell in love with Piperade. The atomsphere is romantic and warm. The decor is masculine without being overbearing or overly noticable. The staff is friendly and extremely knowledgeable. The proximity to my job is unbeatable. Hoping across the street for an expertly mixed manhattan or a well selected half-bottle of wine (well, you have to make the visit worthwhile don't you?) is so convenient. \nSo this was my second visit. On this visit I had reservations for dinner with a friend. And we seriously needed to catch up. So away we went - yakking up a storm from the moment I walked in the door. So the only negative thing I'm going to say here - the waiter did not seem amused by our rapid-fire conversation. On the contrary he seemed determined to make me feel bad about it. I was not up for that. I ignored him once I realized he was irritated with our lack of attention to him. The service - was fine. Water glasses filled, wine attended to, food explained -  all adequately. Enough about him. I hope he doesn't wait on me next time. \nThe food was delicious. I ordered the piquillo peppers stuffed w/ goat cheese - oozing with melty goat cheese. Fantastic. I ordered a half bottle of a pinot noir for myself - reasonably priced and delicious as well. My companion ordered the calamari \"a la plancha\" - offered me a bite - and thank god for generosity! Another great dish - fresh, refreshing, just the right size. I ordered the New York steak and was extremely pleased. Cooked to perfection - with wonderful gascon fries and caramelized shallots. \nMy first visit a month or so prior - I sat at the bar with a friend. I ordered a manhattan on the rocks. The bartender was so personable - the cocktail was perfection. I really like this bar. We ate at the bar that night and I have to say I will be doing that many more times. \nThis is a beautiful dining experience - worth every penny you may spend. This establishment is seriously devoted to making your experience within its 4 walls worth the effort of the visit. I hope they save a seat at the bar for me......this Wednesday.", "rating": 4, "date": "2009-04-11"}], "lsagarra": [], "winter in biarritz": []}