{" lb hamburger": [], "double burger": [], " spaghetti   ravioli": [], " loaf garlic toast": [], " loaf pesto toast": [], "garlic toast with mozzarella": [], "pesto toast with mozzarella": [], "mozzarella cheese pizza": [], "topping pizza": [], "star fleet pizza": [{"excerpts": ["But after ordering THE STAR FLEET PIZZA, I realized I wasn't on a television show...", "I was in hell. ", "Hell. ", "This pile of greased was literally dripping and oozing from the za getting all over my new trousers. ", "After eating a slice, I called it quits and pulled the trigger in the bathroom. ", "And no, it was not time to rally after. ", "So once I check out she swiped my card and there was only three options to tip: ", "No tip, 18%, or 25%. ", "And she was HOVERING over me while I decide pressuring me to just click 18% and gtfo of there. ", "Taraval was cool in the 50s, but gawd damn ", "it's over! ", "Go check out gentle cuts for a fresh fade!"], "author": "Matthew K.", "review": "Sad! Absolutely sad! I walk in this restaurant and it looks like it something that would appear on Gordon Ramsey's show Kitchen Nightmares. Where do I start??? HM! maybe when I asked for a water and she gave me a bottle of arrowhead water AND CHARGED ME $1.50 for it! Not only was I mad about the price, but ARROWHEAD. The nastiest bottled water ever. But after ordering THE STAR FLEET PIZZA, I realized I wasn't on a television show...I was in hell. Hell. This pile of greased was literally dripping and oozing from the za getting all over my new trousers. After eating a slice, I called it quits and pulled the trigger in the bathroom. And no, it was not time to rally after. So once I check out she swiped my card and there was only three options to tip: No tip, 18%, or 25%. And she was HOVERING over me while I decide pressuring me to just click 18% and gtfo of there. Taraval was cool in the 50s, but gawd damn it's over! Go check out gentle cuts for a fresh fade!", "rating": 1, "date": "2018-08-24"}], "clams and garlic pizza": [], "mediterranean pizza": [], "greek pizza": [], "pirros special pizza": []}