{"two medium twotopping pizzas special": [], "twotopping extra large pizza special": [], "buy any jumbo  pizza  get liter of soda for free": [], "can of soda": [{"excerpts": ["one time they ran out of sausage which is my Numero uno topping choice so the guy on the phone offered me a free can of soda for the inconvenience. ", "They are worth a try!"], "author": "Arthur S.", "review": "As you can see this is my first post. i decided to try out these guys a few times before opening a yelp account to review them. the truth is, there is no more point in waiting. i have now ordered pizza from them at least 12 times and haven't been dissappointed once. one time they ran out of sausage which is my Numero uno topping choice so the guy on the phone offered me a free can of soda for the inconvenience. They are worth a try!", "rating": 5, "date": "2011-04-28"}], "arizona": [], "two liter of soda": [], "garlic bread with cheese": [{"excerpts": ["Ordered an XL Pizza with pepperoni and sausage as well as some garlic bread with cheese. ", "The garlic bread was nothing special. "], "author": "John W.", "review": "The Pizza was incredible! Much better than I expected. Ordered from Eat24 and the pizza arrived earlier than expected. Ordered an XL Pizza with pepperoni and sausage as well as some garlic bread with cheese. The garlic bread was nothing special. Looked like sandwich bread with butter and a little cheese on it. However the pizza was incredible! The crust was thin and crispy and there was plenty of cheese and toppings. This is going to be my goto pizza place in the sunset!", "rating": 4, "date": "2017-01-10"}], "garlic bread with pesto and chicken": [], "mozzarella cheese sticks": [{"excerpts": ["Mozzarella Cheese Sticks = were they from the local gas station?? ", "Avoid. "], "author": "Fannie S.", "review": "Delivery only. \n\nFood = hit or miss. Generous portions. \n\nBuffalo Wings = okay. $6.99.\n\n3-topping Pizza (12\" small) with pepperoni, olives, fresh jalapenos = okay. Crust isn't thin but a bit doughy. $17.75.\n\nMozzarella Cheese Sticks = were they from the local gas station?? Avoid. $7.50.\n\nGreen Salad = okay. $6.49\n\nSpaghetti with Meat Sauce = sweet, soggy and odd. $9.99.\n\nPrices = moderate. $52.98.\n\nService = Delivery arrived on time. \n\nIn a pinch, I'd order the basics again--pizza, wings & salad and skip the rest. Seriously.", "rating": 2, "date": "2017-07-04"}], "jalapeno poppers": [{"excerpts": ["Spicy Red Sauce, Tomatoes, Barbecue Chicken, Fresh Cilantro, and Fresh Jalapenos\n- Jalapeno Poppers\n- Buffalo Wings\n\n"], "author": "Shauna S.", "review": "We ordered delivery from them last night and the first thing we noted upon looking at the online menu is the awesome pizzas named after astrology signs. Okay, sure, it's silly, but come on, it's pretty awesome. We kept it simple and ordered our signs:\n\n- Pisces: Shrimp, Clams, and Fresh Garlic\n- Sagittarius: Spicy Red Sauce, Tomatoes, Barbecue Chicken, Fresh Cilantro, and Fresh Jalapenos\n- Jalapeno Poppers\n- Buffalo Wings\n\nEverything was delicious and the pizzas were spot on. I loved the spiciness of the Sagittarius and the Pisces was a great blend of seafood. The appetizers were also perfectly prepared and arrived in good condition (crisp and tasty in their fried glory).", "rating": 5, "date": "2013-06-13"}], "caesar salad with chicken": [], "chefs salad": [], "one topping pizza": [], "two topping pizza": [], "three topping pizza": [{"excerpts": ["Also going for the three topping pizza is a good deal "], "author": "Cristian R.", "review": "I would say this is probably the best pizza I've had in the city. I normally get the all meat pizza (cancer) and sometimes add pesto to it. It's pretty good and filling. Also, the crust is a little thick, and nice and crisp. When you chew on it, it's still soft and not hard like other places. But like all pizza, it can get a little pricey sometimes when you include other add ons. \n\nAlso going for the three topping pizza is a good deal :)\n\nThey deliver super fast. So if you are counting on that \"full hour,\" order it later. This is definitely the place you want to hit up when you are starving and want good pizza fast.", "rating": 5, "date": "2017-06-04"}], "four topping pizza": [], "capricorn pizza": [], "aquarius pizza": [], "pisces pizza": [{"excerpts": ["Loved the Pisces pizza, also lived the turkey sandwich came in like 30 mins. ", "So glad I tried this spot out workers are friendly."], "author": "Chris R.", "review": "Loved the Pisces pizza, also lived the turkey sandwich came in like 30 mins. So glad I tried this spot out workers are friendly.", "rating": 4, "date": "2015-04-06"}], "aries pizza": [], "taurus pizza": [], "gemini pizza": [], "cancer pizza": [{"excerpts": ["Ordered a Cancer Pizza via Eat24 on a Tuesday night. ", "Pretty reasonable prices. ", "I got my pizza and it only had pepperoni, not the other toppings! "], "author": "Michael M.", "review": "Ordered a Cancer Pizza via Eat24 on a Tuesday night. Pretty reasonable prices. I got my pizza and it only had pepperoni, not the other toppings! Pizza Joint gave me a discount and re-delivered the right pizza in like 15 minutes!!! \n\nLove this kind of customer service. I don't expect perfection. But if an establishment makes a mistake, they go out and fix it. \n\nWill be ordering again! Best pizza I've had in Outer Richmond.", "rating": 5, "date": "2016-01-26"}, {"excerpts": ["I ordered the cancer pizza and the chicken caesar salad. \n\n", "Cancer pizza was good. "], "author": "Annette F.", "review": "I ordered the cancer pizza and the chicken caesar salad. \n\nCancer pizza was good. The bread was tasty. \n\nChicken caesar sald was not so good. It was drenched in dressing and the chicken tasted like sweet teriyaki chicken. Blah! After a few bites, I was done and threw it out in the trash. Thank god it was only $5 and some change. \n\nDelivery took a little over an hour. Not bad, especially for a weekend.", "rating": 3, "date": "2014-07-25"}], "leo pizza": [], "virgo pizza": [], "libra pizza": [{"excerpts": ["Go for the Libra pizza ", "-- it's perfect in all ways. ", ":)"], "author": "Julie D.", "review": "Wonderful service, absolutely delicious food. Love this neighborhood pizza joint! ;)\n\nGo for the Libra pizza -- it's perfect in all ways. :)", "rating": 5, "date": "2018-05-16"}], "scorpio pizza": [{"excerpts": ["so it's been a year or so since I last ordered and I had a craving for a Scorpio pizza.  ", "Just got it ", "and there was a little mix up, just wanna ", "thank the super nice delivery guy for how he handled it ", ":)  this review is for him.  ", "Thanks dude .  ", "Although I didn't get exactly what I ordered, my pizza was still very enjoyable and delivery took less than the estimated time"], "author": "Angela K.", "review": "Ok- so it's been a year or so since I last ordered and I had a craving for a Scorpio pizza.  Just got it and there was a little mix up, just wanna thank the super nice delivery guy for how he handled it :)  this review is for him.  Thanks dude .  Although I didn't get exactly what I ordered, my pizza was still very enjoyable and delivery took less than the estimated time", "rating": 5, "date": "2016-08-29"}], "sagittarius pizza": [], "cheese slice": [{"excerpts": ["the first time it was a good cheese slice . ", "Cheese pizza is my favorite kind of pizza ", "and it was really  good ."], "author": "Lacrimosa L.", "review": "Review from my 7 year old daughter:\nI went to pizza joint  and ate a slice of cheese pizza. I really liked it .For the first time it was a good cheese slice . Cheese pizza is my favorite kind of pizza and it was really  good .", "rating": 5, "date": "2013-10-20"}, {"excerpts": ["$2.50 for my traditional cheese slice.  ", "I liked the light sprinkling of cheese on the outer crust and the sauce was solid.  ", "A large slice ", "but it cannot be described as thin crust.  ", "A bit too bready for my tastes but again that's me.  ", "Clean place, good service, soft drinks only."], "author": "Jeff J.", "review": "Standing alone down the hill from Washington High School (where my parents met) is Pizza Joint.  Basically a take out place, it enjoys more space due to its locations and has 10 or so tables to sit at.  Because it is relatively isolated, the pizza slices do sit for awhile.  $2.50 for my traditional cheese slice.  I liked the light sprinkling of cheese on the outer crust and the sauce was solid.  A large slice but it cannot be described as thin crust.  A bit too bready for my tastes but again that's me.  Clean place, good service, soft drinks only.", "rating": 2, "date": "2010-12-02"}], "pepperoni slice": [], "combo slice": [{"excerpts": ["I got the combo slice which was generously loaded with quality toppings. ", "Highly recommend."], "author": "Will S.", "review": "Amazing zah! Nice crispy (but not dry) crust and a little bit of spice. Seriously some of the best.  I got the combo slice which was generously loaded with quality toppings. Highly recommend.", "rating": 5, "date": "2011-08-29"}], "cheese calzone": [], "topping calzone": [], "blta sandwich": [], "italian sub": [], "italian wedding sandwich": [], "the godfather sandwich": [], "triple og sandwich": [], "dog walker special sandwich": [], "eagles nest sandwich": [], "balbalicious rotisserie chicken sandwich": [], "hawaii fiveo sandwich": [], "italian stallion sandwich": [], "rated r sandwich": [], "juicy lucy sandwich": [], "jokers sandwich": [], "white owl sandwich": [], "fat bear sandwich": [], "skinny jeans sandwich": [], "double trouble sandwich": [], "meat lover sandwich": [], "pizza sub sandwich": [], "hangover sandwich": [], "hang loose sandwich": [], "sandwich": [{"excerpts": ["I also had the meatball sandwich. ", "Also tasty and well made. ", "Man, just go here sometime."], "author": "Ketan H.", "review": "I came back to yelp because of this restaurant. The 12 piece wings were so damned delicious. Can't say much to do them justice, go grab a dozen. The owner is a nice guy, too. This place was just... A feel good spot to grab a corner with homies and talk Star Wars, politics, and recent reading selections. I had a fine Saturday here, and you probably would too. I also had the meatball sandwich. Also tasty and well made. Man, just go here sometime.", "rating": 5, "date": "2018-10-07"}, {"excerpts": ["We had the meatball sandwich. ", "The portion was perfect to share between my daughter and I. ", "The taste was delicious. ", "The service was friendly and great. ", "If we lived here it would be a regular place of ours. ", "Thank you!"], "author": "Tara A.", "review": "Just driving around getting lost in San Francisco and we found this little gem. The selection is awesome. We had the meatball sandwich. The portion was perfect to share between my daughter and I. The taste was delicious. The service was friendly and great. If we lived here it would be a regular place of ours. Thank you!", "rating": 5, "date": "2017-07-26"}, {"excerpts": ["I've tried just about every sandwich on the menu and they're all incredible, whatever you're in the mood for. \n\n\n"], "author": "Lauren W.", "review": "My Boyfriend has been coming here since he went to High School down the street & inteoduced me to it when we first met. It is AMAZING. The pizza, the sandwiches, the appetizers, the deserts. Everything is bomb! \n\nI get a cookie warmed up every time I come here & they treat you like family. Soon as we walk in they put it in the microwave cuz they remember! I love places like that. \n\nYou gotta Try the Capricorn w/ Jalapeños !! \n\n& This place puts Bacon on their pizza, & when I say bacon I mean FULL ON STRIPS of bacon.. not bacon crumbs or small pieces. \n\nThe sandwiches are also hella good. I've tried just about every sandwich on the menu and they're all incredible, whatever you're in the mood for. \n\n\nDefinitely worth trying if you're looking for a new spot that does it all!", "rating": 5, "date": "2017-02-16"}, {"excerpts": ["Looked like sandwich bread with butter and a little cheese on it. ", "However the pizza was incredible! ", "The crust was thin and crispy and there was plenty of cheese and toppings. ", "This is going to be my goto pizza place in the sunset!"], "author": "John W.", "review": "The Pizza was incredible! Much better than I expected. Ordered from Eat24 and the pizza arrived earlier than expected. Ordered an XL Pizza with pepperoni and sausage as well as some garlic bread with cheese. The garlic bread was nothing special. Looked like sandwich bread with butter and a little cheese on it. However the pizza was incredible! The crust was thin and crispy and there was plenty of cheese and toppings. This is going to be my goto pizza place in the sunset!", "rating": 4, "date": "2017-01-10"}, {"excerpts": ["Got a sandwich TO-GO. ", "It really was a bad sandwich. ", "Dry and little taste. ", "But to top it off the cashier yelled thanks as he's helping a customer, in the most sarcastic tone ever. ", "Cause I didn't tip. ", "You did no service. ", "I pay for good service. ", "You handed me food as if it were drive-thru. ", "Service and food... horrible...avoid at all cost"], "author": "Matt B.", "review": "Got a sandwich TO-GO. It really was a bad sandwich. Dry and little taste. But to top it off the cashier yelled thanks as he's helping a customer, in the most sarcastic tone ever. Cause I didn't tip. You did no service. I pay for good service. You handed me food as if it were drive-thru. Service and food... horrible...avoid at all cost", "rating": 1, "date": "2017-08-18"}, {"excerpts": ["The guy that made it was extremely nice and my food was outstanding, the best toasted sandwich I've had since I moved here from Chicago, 18 months ago. \n\n"], "author": "Sarah S.", "review": "I would post a picture of my pizza sub, but I ate the entire thing because it was so amazing. The pizza is great too. \n\nTonight was my first time eating here and I had a great experience overall. I was greeted by a friendly guy as I walked in, I looked at the impressive menu and finally settled on a pizza sub. The guy that made it was extremely nice and my food was outstanding, the best toasted sandwich I've had since I moved here from Chicago, 18 months ago. \n\nThe guy that helped me was so nice and I learned that they deliver to my neighborhood and he made sure I had a menu before I left. Great little casual place, nice people, clean, really good food and a solid delivery area. I will absolutely be eating here again.", "rating": 5, "date": "2014-07-30"}, {"excerpts": ["I love to grab a sandwich on the go for a picnic in the park, or even a slice of pizza.\n", "Everyone is super nice and friendly which is always a big plus."], "author": "Marï Ä.", "review": "Pizza Joint is my delivery Pizza by excellence!\nI am a fan of thick fluffy pizza and thats what you get at Pizza Joint! The crust is buttery and fluffy.\nI always go for a whole pizza and they usually have coupons for delivery.\nI love to grab a sandwich on the go for a picnic in the park, or even a slice of pizza.\nEveryone is super nice and friendly which is always a big plus.", "rating": 4, "date": "2015-10-06"}, {"excerpts": ["I also loved their meatball sandwich.  ", "Actually, I can't think  of a better Pizza place in the city at their price range -- and I have been to many, but I guess it depends on what kind of crust you like (I'm not into thins soggy crust anymore-- while here it is just right -- easy to sink teeth into, light and fluffy).  "], "author": "Gibo M.", "review": "This is simply the best cafe in the vicinity; not pretentious, with a good selection of sandwiches  -- excellent crust, and sauce on the Pizza, unlike some of the more fufu places that allow those who spend a lot imagine they are getting something higher -- when it's just the bill and some fancy garnishment/small size.    I also loved their meatball sandwich.  Actually, I can't think  of a better Pizza place in the city at their price range -- and I have been to many, but I guess it depends on what kind of crust you like (I'm not into thins soggy crust anymore-- while here it is just right -- easy to sink teeth into, light and fluffy).  Pretty much need to go the East Bay and Zachary's to beat this.\n\nNo experience with their delivery (so cant' comment on that), but cute little place to dine in.  Support your local Pizza joint, give it a try, if you live in the hood, no doubt you will return.", "rating": 4, "date": "2016-10-19"}, {"excerpts": ["Impressively broad pizza & sandwich menu. ", "It's not the best out there, but good value for the price."], "author": "David L.", "review": "Solid neighborhood pies. Crust is above average and so is the cheese. Red sauce isn't too sweet which is nice. People are friendly in the way you'd expect from a neighborhood corner joint. Impressively broad pizza & sandwich menu. It's not the best out there, but good value for the price.", "rating": 4, "date": "2016-04-25"}, {"excerpts": ["Loved the Pisces pizza, also lived the turkey sandwich came in like 30 mins. ", "So glad I tried this spot out workers are friendly."], "author": "Chris R.", "review": "Loved the Pisces pizza, also lived the turkey sandwich came in like 30 mins. So glad I tried this spot out workers are friendly.", "rating": 4, "date": "2015-04-06"}, {"excerpts": ["One sandwich that stood out to me was one with spam and bacon, omgz. ", "Have to try one of these days. "], "author": "Mariel A.", "review": "The BF and I just HAD to get pizza since it was National Pizza Day (February 9). Look it up, it's Wikipedia official! Anywho, wanted to grab something close to our hood, but didn't want a full pie, so we found Pizza Joint! They sell by the slice, but little did we know that EACH slice was probably equivalent to the size of a personal pizza. SLICES BIGGER THAN MY FACE. Seriously. \n\nTasty pizza, but downside was we didn't realize that 4 slices would cost us more than a small pizza! $18 something for 4 slices. Now, that may sound ridiculous, but honestly because of the size and the fact that we didn't just get plain cheese slices, I felt that it was worth it. I couldn't even finish my slices. They didn't have the thin crust style kind of crust--more of the thick crust, bready, yet still crunchy kind. I personally liked it and would go back, but maybe just for 1 slice at a time. Haha. The guys behind the counter were nice and the decor of the place was cute. They have sandwiches too! The names of the pizzas and the sandwiches are fun as well. One sandwich that stood out to me was one with spam and bacon, omgz. Have to try one of these days. Hahaha. \n\nUntil the next National Pizza Day, Pizza Joint! or maybe sooner! More than likely sooner. :]", "rating": 3, "date": "2015-02-12"}, {"excerpts": ["It takes them quite a while to make one sandwich & their pizzas are quite expensive for the quality.\n\n", "If you must go here, I suggest a sandwich over a pizza. ", "They're average, but pretty cheap!"], "author": "Junel S.", "review": "This place is just okay for me. I went here a few times because I lived about a block away. It takes them quite a while to make one sandwich & their pizzas are quite expensive for the quality.\n\nIf you must go here, I suggest a sandwich over a pizza. They're average, but pretty cheap!", "rating": 3, "date": "2011-09-29"}, {"excerpts": ["Given that a sandwich we ordered is expensive and they didn't tell us that they had no cranberry sauce until we called after our food was delivered, this was annoying. ", "They demanded that we give back all food to get a return for our money. ", "Do not order from here--I hope they don't give food back. ", "Why else would they demand so from a customer? ", "It was very awkward asking the delivery person what he was going to do with the food."], "author": "April M.", "review": "We tried to get delivery twice. First time--they had no Coke, and \"substituded\" Sprite at our door. Second time, they had no cranberry sauce. Given that a sandwich we ordered is expensive and they didn't tell us that they had no cranberry sauce until we called after our food was delivered, this was annoying. They demanded that we give back all food to get a return for our money. Do not order from here--I hope they don't give food back. Why else would they demand so from a customer? It was very awkward asking the delivery person what he was going to do with the food.", "rating": 1, "date": "2016-10-16"}, {"excerpts": ["$3.50 for A REAL SANDWICH!\n", "Why?\n", "Because there is a high school is right behind.\n", "So, 5 bucks including drinks.\n \n", "The sandwich is REALL GOOD.\n", "$4 if you want cheese.\n", "INCLUDING TAX!!!!\n", "So, I must say that it is $8 sandwich is $4.\n\n", "I ordered a turkey sandwich.\n", "The sandwich takes a bit because they do oven toast.\n", "Nice and crunchy!\n", "The bun is awesome.\n", "It's a killer sandwich!\n\n"], "author": "Nobu K.", "review": "$3.50 for A REAL SANDWICH!\nWhy?\nBecause there is a high school is right behind.\nSo, 5 bucks including drinks.\n \nThe sandwich is REALL GOOD.\n$4 if you want cheese.\nINCLUDING TAX!!!!\nSo, I must say that it is $8 sandwich is $4.\n\nBut you have to get there before the high school kids get there.\nHuman centipedes again!\nSmell sweat of period of rapid growth.\nFXXX!\nI was there at i think it was 11:20 am.\nThe guys are crazy working there, making many Pizzas and things for lunch menu.\nI ordered a turkey sandwich.\nThe sandwich takes a bit because they do oven toast.\nNice and crunchy!\nThe bun is awesome.\nIt's a killer sandwich!\n\nSo, while I was waiting, I saw kids coming in little by little, but soon later it became a long line like human caterpillars.\n\nI didn't want to be a part of the line.\nBut, at the same time, I was thinking,\nWhat a lucky high school kids they are!\n\nMy boys didn't go the high school.\nThe school they went, they got nothing.\nNothing like this place near there.\nI took them to their high school almost every day.\nFXXX!\nI wish they went the high school right behind the Pizza Joint.\n\nI can't wait for \"off school season\".\nAre they open for \"off school season\" ?\nI hope so.\nBut I just wondering how the place make the business going with out the high school kids?\n\nPeople, listen!\nSupport The Pizza Joint especially off school season!\n\nHuman centipedes free season.\n\nUrrrrr, sorry, forgot to mention, the pizza is good too by the way.\nSpam Musubi too for Asian Kids!", "rating": 5, "date": "2010-09-11"}, {"excerpts": ["They have an extensive sandwich menu written on the wall that extends across half of one side of the place. ", "Nowhere on this menu or anywhere in the entire place does it say that sandwiches are only served during certain hours (which I don't think is actually the case?). ", "But walking in the other night excited for a Pizza Joint sub, I was met with two employees with their backs turned from the door doing nothing except chatting. ", "They didn't even greet me and my boyfriend. ", "But as our eyes turned to the ENORMOUS portion of their menu listing the sandwiches, they immediately said \"No sandwiches. ", "All the stuff is put away.", "\" ", "This was at 9pm and they close at 10pm... ", "Like I understand that it's *almost* closing time, but an hour before? ", "Give me a break. ", "Why should more than half their menu already be put away? ", "It was very weird and their hostile attitude was annoying. "], "author": "Courtney W.", "review": "I honestly want to give this place a better rating because the food is actually pretty good, which is why I've had a few weird experiences with them but have continued to go back. After tonight though, I think I've been pushed over the edge and will never order from them again. Their treatment of customers, even frequent customers like myself (I live right around the corner), is strange and pretty rude that I don't want to give them my business at all. \n\n1) They have an extensive sandwich menu written on the wall that extends across half of one side of the place. Nowhere on this menu or anywhere in the entire place does it say that sandwiches are only served during certain hours (which I don't think is actually the case?). But walking in the other night excited for a Pizza Joint sub, I was met with two employees with their backs turned from the door doing nothing except chatting. They didn't even greet me and my boyfriend. But as our eyes turned to the ENORMOUS portion of their menu listing the sandwiches, they immediately said \"No sandwiches. All the stuff is put away.\" This was at 9pm and they close at 10pm... Like I understand that it's *almost* closing time, but an hour before? Give me a break. Why should more than half their menu already be put away? It was very weird and their hostile attitude was annoying. If that's how it is every night as well, they should clarify that on the menu...\n\n2) On their website, they advertise 2 medium 2 topping pizzas for $18. They have an extensive topping selection which is a huge part of their appeal for me. But a lot of the topping are labeled with as asterisk (*) and explained as being priced as 2 toppings instead of 1. A lot of their stuff is labeled as such, and I get why so it usually doesn't bother me. But thinking that I could order one of the toppings priced as 2 and another and just pay extra, I called to do so. Nowhere on the coupon does it explain that this can't be done and that there are \"no exceptions.\" If the rules of using this coupon were explained in fine print, I wouldn't complain. But the guy told me he \"literally couldn't do that\" when I asked to get both pineapple and shrimp on my pizza because shrimp counts as 2 toppings on their menu. I told him I was willing to pay whatever extra charge because that's the pizza I wanted. But no he \"just couldn't do that.\" So they lost out on business from me because they couldn't charge me extra? Very weird, and I didn't appreciate the way he talked to me especially since technically the pizza DID have only 2 toppings on it, and I was very willing to pay an extra charge.\n\nThey won't be getting my business again, regardless of the good food. There's a way to treat customers properly and they never succeed at it.", "rating": 2, "date": "2014-05-08"}, {"excerpts": ["i got a grilled turkey sandwich and a drink ", "and i was only six bucks! ", "the guys that work there are really friendly and the service was great. ", "i am getting it again tonight ", ":) they do have weird hours though so check online or call first"], "author": "Marceline K.", "review": "so yummy! i got a grilled turkey sandwich and a drink and i was only six bucks! the guys that work there are really friendly and the service was great. i am getting it again tonight :) they do have weird hours though so check online or call first", "rating": 5, "date": "2012-08-13"}, {"excerpts": ["Quality of sandwich and low price is un-matched.  ", "They also have specialty sandwiches, which I haven't tried."], "author": "Luke S.", "review": "Never had the Pizza.  I'm a regular buyer of their oven baked sandwiches, which are only 3.99 plus extra for cheese or bacon and stuff.  Quality of sandwich and low price is un-matched.  They also have specialty sandwiches, which I haven't tried.", "rating": 3, "date": "2012-05-11"}], "double  sandwich": [], "snowflake sandwich": [], "skateboarders delight sandwich": [], "san franpsycho sandwich": [], "capricorn sandwich": [], "back stabber sandwich": [], "fat box sandwich": [], "wash house sandwich": [], "grandaddy sandwich": [], "oven baked sandwich": [], "joes favorite sandwich": [], "mr lowrys favorite sandwich": [], "aliens favorite sandwich": [], "meat lasagna": [], "spaghetti with meat sauce": [{"excerpts": ["$6.49\n\nSpaghetti with Meat Sauce = sweet, soggy and odd. "], "author": "Fannie S.", "review": "Delivery only. \n\nFood = hit or miss. Generous portions. \n\nBuffalo Wings = okay. $6.99.\n\n3-topping Pizza (12\" small) with pepperoni, olives, fresh jalapenos = okay. Crust isn't thin but a bit doughy. $17.75.\n\nMozzarella Cheese Sticks = were they from the local gas station?? Avoid. $7.50.\n\nGreen Salad = okay. $6.49\n\nSpaghetti with Meat Sauce = sweet, soggy and odd. $9.99.\n\nPrices = moderate. $52.98.\n\nService = Delivery arrived on time. \n\nIn a pinch, I'd order the basics again--pizza, wings & salad and skip the rest. Seriously.", "rating": 2, "date": "2017-07-04"}], "ravioli with meat sauce": [], "spaghetti with meat balls": [], "half of a baked chicken": [], "half of a bbq chicken": [], "chocolate cake": [{"excerpts": ["The chocolate cake is good, too!"], "author": "Emma M.", "review": "Good pepperoni pizza! The only complaint I have is that the crust is a little on the larger size so you miss out on topping real estate. \n\nThe chocolate cake is good, too!", "rating": 4, "date": "2016-04-12"}, {"excerpts": ["The salad and chocolate cake was also good.  ", "We will continue to order from them."], "author": "Debra B.", "review": "We moved here from OKC, OK, where you can get surprisingly good pizzas from local owners at a great price. We moved to SF nine months ago and have tried pizza 2 or 3 times from different places that tasted just 'so so' but were very expensive.  We have ordered from Pizza Joint twice (delivery) and both times it was excellent and reasonably priced.  Our fav is the Aquarius but the pizzas  with red sauce were also great.  The salad and chocolate cake was also good.  We will continue to order from them.", "rating": 5, "date": "2016-04-01"}]}