{"can of san pellegrino aranciata": [], "shishito peppers": [{"excerpts": ["*Blistered Shishito Peppers: ", "Tossed in olive oil and sea salt over lemon aioli ($6)\n", "I adore shishito peppers, so I enjoyed these. ", "Could have used a little more seasoning, but the lemon aioli helped. ", "The portion was pretty hefty as this was the one dish we couldn't finish. ", "I thought the meatballs were pretty standard. ", "Though one wasn't quite a whole meatball. ", "It almost looked like someone had a bite taken out of it? ", "I know that wasn't the case, but I did notice one was smaller than the rest. "], "author": "Elena N.", "review": "3.5 STARS\n\nFor dinner, the roommate wanted pizza. I gave him a couple options and he picked Pizzeria Avellino. We place a delivery order on the way home via DoorDash on Monday, February 26th at 5:36pm. Our order arrived at 6:40pm. We live in Outer Richmond.\n\n*The Lombard Special: Pepperoni, Italian sausage, mushrooms, no black olives, sub Jalapenos ($22 for Medium 15\")\n*Blistered Shishito Peppers: Tossed in olive oil and sea salt over lemon aioli ($6)\n*Meatballs: Pork and beef meatballs, marinara, parmesan, crostini ($7)\n\nI like thin crust pizza, so this was more my style. The pizza was pretty big circumference wise for a medium. Managed to feed both of us for this one meal. (I had two slices and the roomie had the rest.) The crust was soft, but also had a nice chew. A good amount of cheese and toppings as well. I adore shishito peppers, so I enjoyed these. Could have used a little more seasoning, but the lemon aioli helped. The portion was pretty hefty as this was the one dish we couldn't finish. I thought the meatballs were pretty standard. Though one wasn't quite a whole meatball. It almost looked like someone had a bite taken out of it? I know that wasn't the case, but I did notice one was smaller than the rest. I do love my meat and sauce, so this fulfilled that craving.\n\nEven though the roommate just prefers to order from a particular chain pizza restaurant, I like trying new spots. Not necessarily on my list of go-tos for pizza delivery, but I'm glad I tried them out.", "rating": 4, "date": "2018-03-06"}, {"excerpts": ["The best were the blistered shishito peppers with lemon aioli!"], "author": "Sharon S.", "review": "The pizza slices were large and filling. Great taste! The best were the blistered shishito peppers with lemon aioli!", "rating": 5, "date": "2015-06-20"}], "garlic cheesy bread": [{"excerpts": ["The garlic cheesy bread was super awesome but the pizza was just ok."], "author": "John R.", "review": "The ambiance was great staff was super cool. The garlic cheesy bread was super awesome but the pizza was just ok.", "rating": 3, "date": "2016-04-27"}], "housemade meatballs": [], "ny style thin crust pizza slice": [], "sicilian style deep dish pizza slice": [], "the lombard pizza": [{"excerpts": ["The order came pretty quickly but the Lombard pizza had been substituted with a simple one topping cheese and Meatball pizza (no extra meatballs). ", "The driver offered to bring the right one and we agreed, but that order never arrived. ", "We called 10 minutes before they closed to see where the hell it was. ", "But they said the ovens were off ", "and it was too late. ", "The defensive and argumentative employee on the phone claimed they tried to call us several times, but they were calling Eat24 not our number, even though our phone number was clearly shown on the emailed receipt. ", "We did not enjoying getting either the wrong pizza (Nine bucks cheaper than the one we wanted) and the rude argumentative employee on the phone. ", "Do not order delivery from these people if you want the right order, their customer service sucks! ", "Not ordering from this place again!"], "author": "Darin H.", "review": "Our 1 star review is not necessarily based on the quality of the Pizza, this rating is based on the service. We ordered a cheese pizza and a Lombard pizza with extra meatballs through Eat24. The order came pretty quickly but the Lombard pizza had been substituted with a simple one topping cheese and Meatball pizza (no extra meatballs). The driver offered to bring the right one and we agreed, but that order never arrived. We called 10 minutes before they closed to see where the hell it was. But they said the ovens were off and it was too late. The defensive and argumentative employee on the phone claimed they tried to call us several times, but they were calling Eat24 not our number, even though our phone number was clearly shown on the emailed receipt. We did not enjoying getting either the wrong pizza (Nine bucks cheaper than the one we wanted) and the rude argumentative employee on the phone. Do not order delivery from these people if you want the right order, their customer service sucks! Not ordering from this place again!", "rating": 1, "date": "2017-12-22"}, {"excerpts": ["The Lombard pizza is really good. "], "author": "Melissa T.", "review": "Perfect spot to grab some delicious thin crust, New York style pizza. The slices are cut large just like in New York. The best part is the pizza is not oily and crust is crispy so you don't need to fold the pizza in half to eat it. A much healthier version of NY pizza.\n\nThere are only a couple of pizza options, including pizza of the day special. They make the pizza when you order it, so it comes right out of the oven! We tried the vegetarian and Lombard. There's only two pie sizes available: L and XL. For 6 people we finished off 2 XL. The Lombard pizza is really good. The vegetarian was mediocre.\n\nIt's a small and narrow place. Fortunately it wasn't crowded when we came and was able to secure a table for our group. It seems to be a local favorite spot for many. The staff are really nice and cool.\n\nA bonus is this is only 2 blocks away from the Palace of Fine Arts! It's perfect walking distance to go grab some food before a show.", "rating": 4, "date": "2010-02-10"}, {"excerpts": ["I love the Lombard pizza. ", "It's a family favorite.  "], "author": "Tiffany J.", "review": "I'm originally from the east coast and have had my fair share of slices. This is by far the best pizza I've had since I've moved to the city.\n\nI've ordered from Pizzeria Avellino a couple of times now and it's always been a wonderful experience.  Their delivery is super fast and they put Parmesan and peppers in the box.  \n\nThe staff is awesome!  It was a great place to take my family. When I stopped by after a day out in the Presidio, my daughter was pretty fussy and hungry. The employee who took our order provided my daughter with a coloring book and crayons and turned the TV to cartoons to calm her down. Awesome!\n\nThe pizza is fan-tastic! Always fresh and tasty, they have a great thin crust. The toppings are generous and delicious. I love the Lombard pizza. It's a family favorite.  They also serve coffee in the morning, so I'm gonna stop by for a cappuccino after my run.\n\nOverall, tasty affordable pizza and friendly staff. I will be there again soon!", "rating": 5, "date": "2011-08-26"}], "fuggedaboutit pizza": [], "veggie jackson pizza": [], "sweet heat pizza": [], "meat lovers pizza": [{"excerpts": ["A few of my favorites are meat lovers pizza.\n", "However I judge most pizza places on their pepperoni pizza. ", "So check it out!"], "author": "Chad I.", "review": "This is the best pizza in SF. For sure! Like a great sauce to bread to cheese to toppings ratio. Anyway, check them out. They deserve your business! \n\nA few of my favorites are meat lovers pizza.\nHowever I judge most pizza places on their pepperoni pizza. So check it out!", "rating": 5, "date": "2017-09-04"}], "cheese please pizza": [], "roaster coaster pizza": [], "the brooklyn italian white pizza": [], "pesto chicken white pizza": [], "green chile chicken white pizza": [], "meatball parmesan sandwich": [], "sausage and peppers sandwich": [], "caprese pannini sandwich": [], "nutty pizzetta": []}