{"louisiana tenders": [], "mild": [{"excerpts": ["Did half mild and half spicy at the time ", "but we didnt know how spicy it was at the time. ", "Decided to get all spicy since the spicy had more flavor than the mild ", "and it isnt that spicy from the time my family went here couple months ago. "], "author": "Julie N.", "review": "Haven't been to this place for 15 years. Looks like it has been remodel since the last time i was here. Luckily came at a time where there wasnt a lot of people so it made the service go quick. First time i came back was couple months ago. Order the 16 pieces family pack which cost 37.51 total. Kinda of expensive but had a lot of food. Did half mild and half spicy at the time but we didnt know how spicy it was at the time. Other then the 16 pieces chickens, you had the biscuits plus 3 more side orders which i got the cole shaw, fries, and mash potatoes.\n\nThen came back again yesterday but order 8 pieces family pack. Only difference from the 16 piece family pack is they give you one side other than the biscuits. Decided to get all spicy since the spicy had more flavor than the mild and it isnt that spicy from the time my family went here couple months ago. Service was quick since my family only order spicy. \n\nThe chicken here is good. Definitely come back whenever my family crave for their chicken again", "rating": 4, "date": "2013-08-06"}, {"excerpts": ["I've also tried a Po'Boy with mild chicken. "], "author": "Priscilla W.", "review": "Fast food - love it and hate it. Love it because it's so delicious and cheap. Hate it because it makes me break out the next day. I'm not a big fan of food that sits under heat lamps all day long, but if I'm craving unhealthy food and near the neighborhood, Popeye's wins!\n\nI usually get an order of small fries for about $1.80, incl tax. I think the fries here are better than those at McDonald's (don't hate me if you disagree). They have that Cajun spice/seasoning added in for you, which gives Popeye's fries an extra oomph. I've also tried a Po'Boy with mild chicken. It was decent, but I'd prefer lettuce over cabbage, fresh moist bread over old dry stale bread, and possibly some sauce inside.\n\nSince this Popeye's is located on the corner of Mission and Geneva, be patient trying to squeeze into the crowd of people outside that are waiting for the MUNI. Also, sometimes it is so packed inside. Better get your meal to-go. You can smell the food across the street, but when you're close, you also smell urine from last night on the corners of the street. Eww.", "rating": 3, "date": "2008-08-07"}, {"excerpts": ["My friend ordered the mild chicken instead of spicy. ", "The mild tasted... like regular fried chicken. ", "No heat factor. ", "But I can't complain - it tasted a whole lot better than the fried chicken from KFC. ", "Maybe it's all the oil and grease in the delicious skin."], "author": "Annie S.", "review": "I am 18 years old and today was my first day eating Popeyes. Don't laugh at me. I was deprived as a child.\n\nI came on a good day cause they had a promo. Two pieces (thigh and breast) of chicken for 99cents... what the heck?! Nice. My friend ordered the mild chicken instead of spicy. The mild tasted... like regular fried chicken. No heat factor. But I can't complain - it tasted a whole lot better than the fried chicken from KFC. Maybe it's all the oil and grease in the delicious skin.", "rating": 4, "date": "2009-06-23"}, {"excerpts": ["My cat Zoe eats one breast mild (not spicy) without the skin every single day.  ", "It keeps the flesh on her bones since she's a geriatric kitty (14-15 years). ", "She runs up and down the hall, screaming for her chicken breast when I get home from work.  ", "Woe to me if she doesn't get one.  ", "Major meow-lashing.  ", "So basically, she thinks she's Cleopatra ", "and I peel her a chicken breast every day instead of a grape. ", "OK, she wants more than that: "], "author": "Priscilla L.", "review": "My cats--Zoe and Little Guy--and I love Popeye's.  \n\nMy cat Zoe eats one breast mild (not spicy) without the skin every single day.  It keeps the flesh on her bones since she's a geriatric kitty (14-15 years). She runs up and down the hall, screaming for her chicken breast when I get home from work.  Woe to me if she doesn't get one.  Major meow-lashing.  So basically, she thinks she's Cleopatra and I peel her a chicken breast every day instead of a grape. OK, she wants more than that: Zoe wants it deboned, shredded, and on a plate--thank you very much.\n\nI live up the block from Popeye's so I'm there just about every single day ordering the breast, no biscuit.  We eat chicken from there too.\n\nSo far, Popeye's seems like the only fast food chicken place with real crispy skin that tastes good as opposed to that soggy spiced up garbage at KFC.  With KFC, it might as well have been sitting in the car on a hot day--it tastes that bad.\n\nWhen I was little and hardcore Chinese, I wondered why KFC--we called it Mustache Chicken on account of the Colonel having a mustache--was considered fried chicken.  My aunts bland fried chicken was better than theirs because at least the skin was crispy.  CRUNCH.\n\nPopeye's is consistently good.  The breast pieces are big. It doesn't taste greasy.  The sides are good.  I love the mash potatoes and gravy.  My husband loves the mac and cheese.  \n\nMy husband loves the little fried shrimps there.  He can eat three orders.\n\nI like Popeye's so much, I'm trying to work it into my South Beach diet.", "rating": 4, "date": "2007-10-17"}], "all bonafide chicken items available in": [], "combos": [], "family meals": [], "kids chicken leg meal": [], "naked": [], "all tenders items available in": [], "kids naked tender meals": [], "try our recommended sauces for tenders": [], "butterfly shrimp tackle box": [], "shrimp poboy": [], "all seafood items available in": [], "try our recommended seafood sauces": [], "chicken poboy": [], "naked bbq chicken poboy": [], "loaded chicken wrap": [], "naked chicken wrap": [], "naked tenders combo": [], "kids naked tenders meal": [], "piece bonafide meal": [], "kids chicken nugget meal": [], "kids chicken tender meal": [], "red beans  rice": [], "biscuits": [{"excerpts": ["Biscuits ", "just right \n", "Chicken not bad, crispy outside"], "author": "Mack A.", "review": "Last time when I had Popeyes was over 2 years ago, \nBetter than I expected.\n\nMash potato good\nCajun Fries was ok \nBiscuits just right \nChicken not bad, crispy outside", "rating": 3, "date": "2018-04-10"}, {"excerpts": ["I love their fries n their biscuits,", "they're quick at taking your order ", "but they're slow at giving your food."], "author": "Lizzie G.", "review": "I don't really like fast-food but if I'm going to eat chicken then I would come here and I like the spicy crispy I love their fries n their biscuits,they're quick at taking your order but they're slow at giving your food.", "rating": 3, "date": "2017-03-31"}, {"excerpts": ["Other then the 16 pieces chickens, you had the biscuits plus 3 more side orders which i got the cole shaw, fries, and mash potatoes.\n\n", "Only difference from the 16 piece family pack is they give you one side other than the biscuits. "], "author": "Julie N.", "review": "Haven't been to this place for 15 years. Looks like it has been remodel since the last time i was here. Luckily came at a time where there wasnt a lot of people so it made the service go quick. First time i came back was couple months ago. Order the 16 pieces family pack which cost 37.51 total. Kinda of expensive but had a lot of food. Did half mild and half spicy at the time but we didnt know how spicy it was at the time. Other then the 16 pieces chickens, you had the biscuits plus 3 more side orders which i got the cole shaw, fries, and mash potatoes.\n\nThen came back again yesterday but order 8 pieces family pack. Only difference from the 16 piece family pack is they give you one side other than the biscuits. Decided to get all spicy since the spicy had more flavor than the mild and it isnt that spicy from the time my family went here couple months ago. Service was quick since my family only order spicy. \n\nThe chicken here is good. Definitely come back whenever my family crave for their chicken again", "rating": 4, "date": "2013-08-06"}, {"excerpts": ["This location has the worst biscuits. ", "Discoloration on the bottom of the biscuit from the metal pan. ", "I do not want that, ever! ", "(No, it's not burnt.) ", "Go AWAY."], "author": "Fannie S.", "review": "Chicken, fish, red beans and rice, Cajun fries, mashed potatoes are all great. I can't complain about any of those things.\n\nPrices = moderate. \n\nService = NOT attentive. Or they just don't give a rat's ass. Fix your customer service. NOW. \n\nEvery time I order, I say I do NOT want the biscuit. Yes, I'll pay for it (dinner or combo, since I like the sides) so you can KEEP IT. They always give me the effin' biscuit, and I end up THROWING it out.  Listen to your PAYING customer. How hard is that??!  \n\nThis location has the worst biscuits. Discoloration on the bottom of the biscuit from the metal pan. I do not want that, ever! (No, it's not burnt.) Go AWAY.", "rating": 4, "date": "2014-10-11"}, {"excerpts": ["Biscuits are way better than KFC in that its less saltier and taste fresher and also goes well with a little bit of their honey sauce\n\n"], "author": "Joanne K.", "review": "I must say I like popeyes way more than KFC. Located on geneva and mission its usually quite busy making the wait a bit more than usual at times. \n\nSpicy chicken is usually really crispy and has a good amount of chicken meat rather than being filled with just batter. It tastes pretty well with their honey sauce.\n\nBiscuits are way better than KFC in that its less saltier and taste fresher and also goes well with a little bit of their honey sauce\n\nMy absolute favorite is their mac and cheese. It has a yummy cheesy taste to it that definitely beats KFC mac and cheese. This is a go to spot for a fast meal for on the go.", "rating": 3, "date": "2015-03-25"}, {"excerpts": ["Their biscuits are so buttery, crumbly, and addictive. ", "I could eat an obscene amount of those in one sitting. "], "author": "Nancy C.", "review": "The floors are sticky. The air feels greasy. The restaurant smells kind of funky inside...which is complemented by the sickly smell of urine outside. (What do you expect? It is San Francisco after all and it's right in front of a bus stop.) \n\nAll those factors aside, I will occasionally tolerate the grossness when I have a craving for my guilty pleasure/PMS combo of popcorn shrimp and Cajun fries. Everything tastes better slathered in tartar sauce. Their biscuits are so buttery, crumbly, and addictive. I could eat an obscene amount of those in one sitting. Their chicken is okay too. \n\nIf you come here, take your food to go. Sitting here to eat is depressing. The seats are dirty and the tables are sticky. Also, it's kind of weird eating right by the bright windows with people constantly walking by and looking at you. The corner where the tables are at is at a weird steep angle. I imagine it's like being in a human fishbowl with the huge clear slanted windows and the bright sunlight illuminating the heavily deep fried food, which will be clogging your arteries a mere milliseconds later. No regrets!", "rating": 3, "date": "2011-12-31"}, {"excerpts": ["But I am addicted to their soft, buttery, flaky and fluffy biscuits.  ", "I usually pad it with artery clogging butter and drizzle a little honey before eating through 3 of them easily.\r\n\r\n", "My sister usually orders the 12 piece, spicy, and have to confess, there have been times where the entire carload of people can't wait and ", "a drumstick ends up devoured before we get home.  ", "Popeye's is definitely not your local KFC.......", "the outer layer is crunchier and spicier, with more flavor.  \r\n\r\n", "Don't bother looking at the bottom of the box, because it will just depress you with the amount of congealed fat nodding at you in evil apprehension."], "author": "Miika M.", "review": "I find it somewhat interesting that most of the Popeye's locations in the Sacramento region are located in ghetto spots of missed opportunities because one would have to drive to odd and remote locations to order their famous cajun style fried chicken.  That drive plus a bullet-proof vest.\r\n\r\nBut I am addicted to their soft, buttery, flaky and fluffy biscuits.  I usually pad it with artery clogging butter and drizzle a little honey before eating through 3 of them easily.\r\n\r\nMy sister usually orders the 12 piece, spicy, and have to confess, there have been times where the entire carload of people can't wait and a drumstick ends up devoured before we get home.  Popeye's is definitely not your local KFC.......the outer layer is crunchier and spicier, with more flavor.  \r\n\r\nDon't bother looking at the bottom of the box, because it will just depress you with the amount of congealed fat nodding at you in evil apprehension.", "rating": 3, "date": "2006-11-08"}, {"excerpts": ["So 4 stars for the spicy chicken strips, french fries, mashed potatoes and the YUMMY biscuits!"], "author": "Alice E.", "review": "I love Popeyes. I am not overly fond of this location. Nothing against the staff or the food, just the location is on a very busy intersection.. alot of \"shady\" characters chill outside. This place makes a ton of money anyway tho, so it doesn't matter about who's around the area. Chicken is chicken! \n\nSo 4 stars for the spicy chicken strips, french fries, mashed potatoes and the YUMMY biscuits!", "rating": 3, "date": "2010-11-17"}, {"excerpts": ["Get some honey packets for the biscuits, the sweet and salty is yum. ", "The sweet cane tea is pretty good- ", "I don't like my teas overly sweet like the ones coming out of the soda machines.  ", "Surprisingly their fish sandwich (catfish ", "I think) is tasty.  ", "And last but not least their mashed potatoes and gravy is good enough to rival the one my auntie makes for thanksgiving. "], "author": "Liz A.", "review": "Leeme tell you that I live just a few blocks from KFC but I would rather drive my ass here than succumb to eat KF nasty/ taco bell blah.\n\nI come on their 2piece Tuesdays and buy a sh*t load of chicken. Leftovers baked in the oven for a couple minutes are just as good the next day.  Get some honey packets for the biscuits, the sweet and salty is yum. The sweet cane tea is pretty good- I don't like my teas overly sweet like the ones coming out of the soda machines.  Surprisingly their fish sandwich (catfish I think) is tasty.  And last but not least their mashed potatoes and gravy is good enough to rival the one my auntie makes for thanksgiving. Okok nothing rivals my autie's mash n gravy but popeye's is pretty darn good. \n\nFor a fast-food joint it deserves the 4 for feeding my family frugally with fabulously fried chicken.", "rating": 4, "date": "2011-01-26"}, {"excerpts": ["Popeyes Chicken & Biscuits should be awarded the Nobel Peace Prize.\n", "Why you say? ", "You will be surprised once you walk in and notice that their are customers of all races and age. "], "author": "Dorian T.", "review": "Popeyes Chicken & Biscuits should be awarded the Nobel Peace Prize.\nWhy you say? You will be surprised once you walk in and notice that their are customers of all races and age. They have the asians, the latinos, the blacks and the whites all for the common goal: Louisiana Fried Chicken. \n\nThe Tuesday Special 2 pieces legs and thighs for 99c has officially placed Popeyes over KFC. Their chicken is delicious. Skin is crunchy, meat is juicy and bill is cheap. Their fries are suspiciously good too. what ingredients do they use? I dont know. Maybe trans fat, maybe chipotle seasoning, maybe just salt and pepper. All I do know is they are a party in my mouth.\n\nThe only thing that might turn someone off to Popeyes is the fact that it is a little ghetto. But really ... Have you been to a Popeyes that is not ghetto? That being said, Popeyes deserve 5 star because The chicken taste great, sides are also great, its affordable to all, its close to the bus stop and of course last but not least, their asian employees speak fluent spanish. MUY BUENO!", "rating": 5, "date": "2009-12-15"}, {"excerpts": ["The biscuits are moist and flaky and every time I take a bite of Chicken in combo with mashed potatoes, I just about jizz in my pants.\n\n"], "author": "Alvin T.", "review": "I would sell my only daughter for Popeyes chicken. The biscuits are moist and flaky and every time I take a bite of Chicken in combo with mashed potatoes, I just about jizz in my pants.\n\nHowever, minus one star because I'd rather not get pistol whipped and robbed while ordering a 3-piece.", "rating": 4, "date": "2009-11-27"}, {"excerpts": ["I eat about 5 pieces of chicken, 2 biscuits, and mashed potatoes.\n\n"], "author": "phillip w.", "review": "I love fried chicken....\n\nWhenever I need to fill my craving of Fried Chicken I come here..\n\nI eat about 5 pieces of chicken, 2 biscuits, and mashed potatoes.\n\nYea it sounds crazy...but I cant help it. My love for fried chicken is like Garfields love for lasagna.\n\nService is quick and somewhat friendly but I know when it gets busy they kind of change into a different mode whick makes the line move pretty quickly so I dont gotta wait forver for my food akakakaka...", "rating": 4, "date": "2008-09-16"}, {"excerpts": ["Freakin' SOUTHERN style fried chicken....with southern style mashed potatoes and gravy...with biscuits......thumbs up.\n\n"], "author": "Dave L.", "review": "He's Popeye the sailor man....\nHe lives in the garbage can....\nHe turned on the heater.....\nAnd burn-ed his wiener.....\nHe's Popeye the sailor maaaaaaan.\n\nThat song popped in my head every time someone mentions Popeye's Chicken...you see...as a kid, I was....DEPRIVED from fast food.  It was only a few years ago that I found out Popeye's has nothing to do with Spinach at all......it's all southern style fried chicken dooood!\n\nFreakin' SOUTHERN style fried chicken....with southern style mashed potatoes and gravy...with biscuits......thumbs up.\n\nAdd some Louisiana Hot Sauce....two thumbs up.  \n\nI love coming to his place cuz there once was a worker there that looks very close to a good friend of mine....same height, same ethnicity, same speech impairment.....but with a uni-brow!!!", "rating": 4, "date": "2007-09-25"}, {"excerpts": ["They have the best biscuits and their sides are great. ", "Usually, I end up eating only one or two pieces of chicken and destroying all of the sides, much to my family's chagrin -- oops. ", "Their fried chicken is great too of course. ", "Biscuits;\n2. ", "Mashed potatoes with cajun gravy (although KFC's gravy kicks ass obviously)", ";\n3. "], "author": "Rick C.", "review": "I love Popeye's! It's friggin' fantastic! It really amazes me how diverse their employees are in that sense that all of them know Spanish. Seriously, my jaws practically dropped as after I order, two Asian girls behind the counter shout in Spanish. I am not even kidding you in the slightest bit. \n\nThey have the best biscuits and their sides are great. Usually, I end up eating only one or two pieces of chicken and destroying all of the sides, much to my family's chagrin -- oops. Their fried chicken is great too of course. I do hate how sometimes I'll get monster pieces and other times some weak pieces that are barely bigger than my fist. \n\nPopeye's beats KFC in the following in my opinion:\n1. Biscuits;\n2. Mashed potatoes with cajun gravy (although KFC's gravy kicks ass obviously);\n3. Fries.\n\nWatch out for the panhandlers and the annoying people waiting for the bus outside.", "rating": 4, "date": "2008-08-07"}, {"excerpts": ["But their BISCUITS.. almost out of this world. ", "So yummy and buttery ", "(no butter packets needed)."], "author": "Elaine H.", "review": "I usually don't crave chicken of any sort, but I've been craving Popeyes every now and then for the past FEW MONTHS (and I STILL haven't had it!) I recall it being some GOOD chicken. But what I love is the SIDES! YUM! And I love sitting by the window seat on a somewhat sunny day, just looking outside. And I love how walking down with my friend from her house, she always tries to do this ARMLOCK thing with me so that we don't get \"robbed\". HAHA. Shes fckin hilarious! Parking super sucks ass here, so WALK if you're around the area. And its not likely you'll get robbed. Especially not during the day. Right???\n\nedit: 5/25 finally went to grab me a large cole slaw yesterday. It was yummy and crunchy. But I hate how their lids aren't as tight as KFC (paper vs. plastic). Now I'm craving their chicken..\n\nedit 5/31/08 Ok, so I came here and ordered the #11. Their chicken isn't THAT GREAT (but maybe cuz I'm not a fan of fried chicken anyway). But their BISCUITS.. almost out of this world. So yummy and buttery (no butter packets needed).", "rating": 4, "date": "2008-04-29"}, {"excerpts": ["Chicken and Biscuits... ", "OH ", "Yeah!!! "], "author": "Scotty B.", "review": "Chicken and Biscuits... OH Yeah!!! Get it spicy add some honey.\n\nRed Beans and Rice...Oh Yeah!!!  Add some hot sauce.\n\nI don't what that mystery meat is in the gravy but gimme some.\n\nSorry Colonel they got you beat.\n\nWould get the big 5 stars but its fast food", "rating": 4, "date": "2008-04-19"}, {"excerpts": ["The biscuits were too salty the the chicken was GREEEESSAYYY!!\n\n"], "author": "Alberto L.", "review": "Went there one time when I was really hungry and came out disappointed...\n\nThe biscuits were too salty the the chicken was GREEEESSAYYY!!\n\nSmells good, but don't let that deceive you. \n\nHad this chicken before back in So-Cal and it sucked then just as it sucks now.\n\nTo tell you the truth I'm not even sure that even chicken at all??\n\nI don't know about you but I think I lost half-day of life just by eating this nasty stuff!\n\nGive me Pollo Loco any day!\n\nOh wait there is no Pollo Loco here in the City!\n\nDAMN!..........", "rating": 1, "date": "2008-09-17"}, {"excerpts": ["we also got the mashed potatoes with cajun gravy, coleslaw, biscuits, and rice and beans. ", "our couple friends were not disappointed when we told them we weren't cooking dinner and had bought popeyes instead. "], "author": "Sheri N.", "review": "our day seemed a bit rushed, and the lashing rain was delaying things even more. we had to be at the opera for 8pm, and my girlfriend was coming over to do my hair and makeup because she said she wanted me to look nice for my birthday date that my boyfriend was taking me to. i told her to bring her boyfriend and that we'd have dinner for them. it was nearing 5pm and i drove into the parking lot of lucky's, and asked my boyfriend if he really wanted to make his lamb chop and fish dinner spread. the thoughts of rushing and knowing that the dishes would be left until the morning didn't sound too appealing. i asked him what day it was, and he replied tuesday. i remembered driving by popeye's and seeing the thigh and leg deal sign for $0.99 on tuesdays, and suggested it to him. soon enough we were headed to the popeye's near our house. \n\nwe waited nearly half an hour to order and get our food. people do not take this deal lightly and queue up to get that hot chicken. we also got the mashed potatoes with cajun gravy, coleslaw, biscuits, and rice and beans. our couple friends were not disappointed when we told them we weren't cooking dinner and had bought popeyes instead. they actually drove by that popeyes and started to crave their chicken, so it was a win win situation. \n\ni don't think i will ever come on a tuesday. although the chicken is tasty, i don't have the patience to brace the line for cheap chicken.", "rating": 4, "date": "2009-10-15"}, {"excerpts": ["i love popeyes chicken, biscuits, red beans & rice, and their po' boys...but damn, parking near here is a bitch! and be careful whenever you try to drop someone off in front..."], "author": "Ray R.", "review": "i love popeyes chicken, biscuits, red beans & rice, and their po' boys...but damn, parking near here is a bitch! and be careful whenever you try to drop someone off in front...it's a bus stop/red zone, and i've seen plenty of people get ticketed here...\n\noh and p.s. - get their ready to cook turkeys near thanksgiving...hella good!", "rating": 3, "date": "2008-05-06"}, {"excerpts": ["Popeye's makes my mouth water when I say it, and the biscuits make sure to get a couple of biscuits, because they are better than any biscuit I've ever made!"], "author": "Cassie L.", "review": "If you ever go to KFC again (despite reasons of laziness which are completely understandable), after going to this place I'm not sure that we can be friends, or at least can never eat fried chicken together... Popeye's makes my mouth water when I say it, and the biscuits make sure to get a couple of biscuits, because they are better than any biscuit I've ever made!", "rating": 5, "date": "2006-06-24"}], "applesauce": [], "cajun rice": [{"excerpts": ["Not a fan of their cajun rice but love their mashed potato with cajun gravy (it's not as spicy as it sounds). ", "The gravy has pieces of meat in it. "], "author": "Andy W.", "review": "Can you say ghetto? I would not advise ordering your meal \"for here\". However, if you want take out, they have some damn good fried chicken here.\n\nThe Tuesday 2-pieces special is no longer $.99 cents. It's $1.29 now but it's still a good deal for a leg and a thigh (no limit per person). The line gets pretty long on Tuesdays (esp. after 6pm) but it does move faster than it looks.\n\nTheir fried apple pies are not bad. They have cinnamon sugar coated on the outside and are $.99 each but KFC's taste better and I believe it's a bit cheaper too. \n\nNot a fan of their cajun rice but love their mashed potato with cajun gravy (it's not as spicy as it sounds). The gravy has pieces of meat in it. Totally my kind of gravy.\n\nI will be back on Tuesdays for take out.", "rating": 3, "date": "2011-07-09"}, {"excerpts": ["Their side of Cajun Rice beats everything they got.  ", "(Churches mac and cheese is WAY too GREASY & KFC doesn't even offer you rice!!) "], "author": "Bernardo C.", "review": "Easily, the best of the best in the fast food chicken industry.  KFC and Churches have nothing on Popeye's.  Their side of Cajun Rice beats everything they got.  (Churches mac and cheese is WAY too GREASY & KFC doesn't even offer you rice!!) (I'M Asian!) \n\nTheir spicy fried chicken is simply awesome for a fast food joint.  Sure the price is just a bit more expensive then KFC but the quality surly makes up for the price.", "rating": 4, "date": "2006-04-04"}], "bayou buffalo": [], "barbeque": [], "sweet heat": [{"excerpts": ["But really you're charging me a quarter for your delectable sweet heat sauce when I just spent $10 bucks on chicken?\n\n", "So I will pay the damn quarter for sweet heat."], "author": "Rocco B.", "review": "I had this for lunch today and besides the impending heart disease, it was sooooooo awesome. \n\nBut really you're charging me a quarter for your delectable sweet heat sauce when I just spent $10 bucks on chicken?\n\nAnyway Popeyes spicy is some of my favorite fried chicken of all time--including fancy restaurants that charge 4X the price. So I will pay the damn quarter for sweet heat.", "rating": 4, "date": "2015-08-07"}], "mardi gras mustard": [], "buttermilk ranch": [], "blackened ranch": [], "cocktail": [], "tartar": [{"excerpts": ["Everything tastes better slathered in tartar sauce. "], "author": "Nancy C.", "review": "The floors are sticky. The air feels greasy. The restaurant smells kind of funky inside...which is complemented by the sickly smell of urine outside. (What do you expect? It is San Francisco after all and it's right in front of a bus stop.) \n\nAll those factors aside, I will occasionally tolerate the grossness when I have a craving for my guilty pleasure/PMS combo of popcorn shrimp and Cajun fries. Everything tastes better slathered in tartar sauce. Their biscuits are so buttery, crumbly, and addictive. I could eat an obscene amount of those in one sitting. Their chicken is okay too. \n\nIf you come here, take your food to go. Sitting here to eat is depressing. The seats are dirty and the tables are sticky. Also, it's kind of weird eating right by the bright windows with people constantly walking by and looking at you. The corner where the tables are at is at a weird steep angle. I imagine it's like being in a human fishbowl with the huge clear slanted windows and the bright sunlight illuminating the heavily deep fried food, which will be clogging your arteries a mere milliseconds later. No regrets!", "rating": 3, "date": "2011-12-31"}], "cinnamon apple pie": [], "sweet potato pie": [], "mardi gras cheesecake": [], "noncarbonated": [], "cane sweeeet tea": [], "fruit punch": [], "carbonated": [], "fanta strawberry": [], "fanta orangecherry": []}