{"dr pepper": [], "hawaiian punch": [], "strawberry fanta": [], "gallon of lemonade": [], "gallon of sweet tea": [], "piece meal": [], "wings meal": [], "tenders meal": [], "nuggets meal": [], "piece cajun fish meal": [], "popcorn shrimp meal": [], "butterfly shrimp meal": [], "jambalaya bowl meal": [], "piece family box": [], "pieces": [{"excerpts": ["And I like the fact that they have a tuesday special, around $2.50 for two pieces of chicken. ", "I know, it's dirty cheap, and that's why people are lining up to buy their chicken. "], "author": "Judy O.", "review": "The taste of their chicken is so  so so much better than the ones from KFC. And I like the fact that they have a tuesday special, around $2.50 for two pieces of chicken. I know, it's dirty cheap, and that's why people are lining up to buy their chicken. This ensures every order of Chicken we get is hot & fresh, at least on Tuesday. \n\nHowever, the good part ends here. The one thing I hate about their chicken is, THERE IS A FREAKING AFTER TASTE!! Everytime after I eat their chicken, I feel like I just rainsed my mouth in some chemicals. I don't know if it's antibiotics from the chicken. Came for 3 times and they all have this awful after taste. Anyways, probably won't come back again just cuz of the after taste.", "rating": 3, "date": "2018-03-22"}, {"excerpts": ["Big disappointment on the 3 pieces of (1 white, 2 dark ) spicy chicken from this place. ", "They were not spicy, but overly or twice/or more times frayed(tough). ", "I did not know chicken wing was considered part of the dark meat selection. ", "Since wings were offered & sold separately. ", "Our chicken pieces( tiny, tiny) were like a child portion. ", "We ordered small coleslaw and 1 biscuit(dry). ", "No drinks and the total was $9.20. \n", "Fortunately we live in SF and can find good honest food 24/7. ", "Addio Popeyes!"], "author": "Angel O.", "review": "Big disappointment on the 3 pieces of (1 white, 2 dark ) spicy chicken from this place. They were not spicy, but overly or twice/or more times frayed(tough). I did not know chicken wing was considered part of the dark meat selection. Since wings were offered & sold separately. Our chicken pieces( tiny, tiny) were like a child portion. We ordered small coleslaw and 1 biscuit(dry). No drinks and the total was $9.20. \nFortunately we live in SF and can find good honest food 24/7. Addio Popeyes!", "rating": 1, "date": "2018-06-08"}, {"excerpts": ["bought 10 pieces of mixed chicken there and had them for dinner. \n\n"], "author": "Wai C.", "review": "bought 10 pieces of mixed chicken there and had them for dinner. \n\nwife and I got stomach flu then for the next 4 days. \n\ncannot say they are related for legal reasons but just the coincidence makes me not feeling the urge to return to this place or any Popeyes again.", "rating": 1, "date": "2018-01-27"}, {"excerpts": ["When we got home, I counted how many pieces were in the box-there was only 11 pieces in it. ", "I hope the person, who picked my order, did not do this intentionally. ", "I hope it was just a miscount. ", "The next time I go in there again, I will keep my eye on the person, who's doing the picking."], "author": "Ken Y.", "review": "Went to the Popeyes on Fillmore Street tonight to buy dinner-a take out. What I ordered were the 12 piece spicy fried chicken and two side dishes. When we got home, I counted how many pieces were in the box-there was only 11 pieces in it. I hope the person, who picked my order, did not do this intentionally. I hope it was just a miscount. The next time I go in there again, I will keep my eye on the person, who's doing the picking.", "rating": 3, "date": "2018-03-24"}, {"excerpts": ["Don't forget to get your receipt back after your Popeyes restaurants are offering a receipt survey for 2 free pieces of chicken and a biscuit with the purchase of any large drink. \n\n"], "author": "Porsche C.", "review": "Did someone say Popeyes? YES PLEASE!\n\nPopeye's is my #1 spot to go to for some delicious fried chicken!\n\nI was in the mood for some after spending the morning in San Francisco and this location came to mind. Located in the Safeway Fillmore plaza you cannot miss this small local restaurant! \n\nI came in during lunch time and I got there right before the line got extremely long! Thank goodness because after a while they did start to run out of food.\nI asked for a special request of freshly made fried chicken which was a 10 minute wait. I don't mind waiting for freshly cooked chicken (it's definitely worth it). \n\nI ordered:\n~Butterfly shrimp with fries\n~2 Piece chicken with a biscuit \n\nThe cashier lady was so nice but I have to admit she was so slow! They have about 4 different men that prepare the food in the back and although the cashier was slow the food does come out quickly.\n\nMy favorite was the biscuits! OMG, it makes my mouth water just thinking about it! It was so freshly hot and just melted right in my mouth! So damn delicious!\nOne thing that turned me off were the dirty tables. UGH! I couldn't eat at this place even if my life depended on it! I do understand they are busy but they should at least do a check every so often to check the cleanness of the store, right?\n\nI would definitely come and order there good food again especially because they make it so fresh! Hopefully those biscuits don't stick in my head for too long or I'm going to have to make a special visit sooner than I thought! HAHA\n\nPsst...Don't forget to get your receipt back after your Popeyes restaurants are offering a receipt survey for 2 free pieces of chicken and a biscuit with the purchase of any large drink. \n\nOh how I love you Popeyes!", "rating": 3, "date": "2015-05-22"}, {"excerpts": ["Newsflash: 2 pieces of chicken by themselves is NOT a deal! ", "Look  people who eat at this location, you can walk the few extra feet to Safeway, and get 2 pieces of chicken, for the same price or not much more. ", "And, you can have a choice of rotisserie or fried. ", "The employees, will actually talk to you politely, and without stank attitude. ", "If everyone went there, and Popeyes saw a decline in their profits, they would have to re-think the way they do business."], "author": "Ebony S.", "review": "I wish there was a way to stop people from eating at this location. The entire staff stands around talking, even when there is a long line, while 1 person takes all the orders. The dining area consistently has dirty tables, maybe that's what they're talking about! All I know is, they are now  making $14/hr. to socialize with each other, and ignore their customers! Tuesdays they have a 2 piece deal, and the line is out the door (Arghhh!), Because the franchise owner is a greedy a**, they don't include a biscuit with this \"deal\", like every other Popeye's in states outside of CA would.  Newsflash: 2 pieces of chicken by themselves is NOT a deal! Then, they want you to pay over $1 for a biscuit, and if you want sides, they'll be overpriced and extra too! This is obviously a ripoff. Yet, there are the lemmings, lined up every Tuesday.  I don't know why so many people in SF patronize these restaurants. No matter how f'd up they are!  Look  people who eat at this location, you can walk the few extra feet to Safeway, and get 2 pieces of chicken, for the same price or not much more. And, you can have a choice of rotisserie or fried. The employees, will actually talk to you politely, and without stank attitude. If everyone went there, and Popeyes saw a decline in their profits, they would have to re-think the way they do business.", "rating": 1, "date": "2017-09-12"}, {"excerpts": ["They still honor a promotional deal for 11 pieces and nothing else that expired forever ago. ", "That's good too."], "author": "Dog M.", "review": "The chicken is pretty good!\n\nThey still honor a promotional deal for 11 pieces and nothing else that expired forever ago. That's good too.", "rating": 5, "date": "2016-12-02"}, {"excerpts": ["okay, but half of the box was wrong - incorrect chicken pieces from what I had ordered.\n\n"], "author": "Luis C.", "review": "This could probably be the worst location out of the 4 Popeye's stores in SF, although it has plenty of foot traffic being next to a Safeway. I think they have problems retaining staff, and the new staff receives poor training.\n\nService at the register was friendly and efficient when I visited, but lately the baggers don't know what they're doing and the kitchen staff needs better training because food preparation and consistency are subpar. This place used to be so much better in the past.\n\nList of mistakes from a recent visit:\n- mac & cheese was VERY watery and overcooked - like baby food,\n- the Cajun dirty rice was not mixed well, with clumps of seasonings,\n- a large order of red beans and rice didn't have enough rice,\n- they forgot a side order of cole slaw but gave me Cajun fries instead,\n- the fried chicken tasted okay, but half of the box was wrong - incorrect chicken pieces from what I had ordered.\n\nThe one nice feature is the free Safeway's large parking lot.", "rating": 2, "date": "2010-05-28"}, {"excerpts": ["i always feel like this specific location rips people off with smaller pieces of chickens compared to other locations. ", "When i order the 2 for 99 cent deal tuesdays i always get bigger pieces elsewhere and i believe they put a limit here on how many you can actually purchase. "], "author": "Jenny G.", "review": "ooo how i love me a piece of fried chicken from Popeyes! i normally don't come to this location but i stopped by last night because i was in the area and order the 2 piece snack deal that comes with a biscuit. It was good, but not great! i always feel like this specific location rips people off with smaller pieces of chickens compared to other locations. When i order the 2 for 99 cent deal tuesdays i always get bigger pieces elsewhere and i believe they put a limit here on how many you can actually purchase. not saying i'm a big eater that LOVE fried chicken but from time to time i love me a piece of those killer fried chickens. \n\nthe people who work here are fast and nice. i will maybe stop by again if i'm feening for a piece of toxic in my stomach, only if im in the area..", "rating": 2, "date": "2011-01-24"}, {"excerpts": ["Two pieces (no biscuit) for only .99 cents!  ", "When I got there, I could see that a bunch of other people had the same idea.  ", "To say the crowd was 'interesting' would probably be the understatement of the year, but I tried to remain positive ", "so I figured ", "at least it was entertaining.  ", "so I figured why not as it's only three dollars for six pieces.  ", "At that price, I ordered both regular and spicy.  ", "Despite the crazy line and crowds, the chicken was super hot and fresh out of the kitchen when I checked my order (a must at any fast food place before leaving nowadays) so we decided to drive down to the marina green and eat it out there by the yacht club.  "], "author": "Roy N.", "review": "Forgive me for I have sinned....\n\nSo this is what I have been reduced to...reviewing fast food!  I've been so fortunate to dine in so many incredible places in the past...I guess I'm okay with that.  At least no one can say I'm a snob.\n\nThe weather was so beautiful today that we took a nice long walk down Fillmore in Pac Heights.  All of a sudden, I was really hungry and realized that I had not had lunch yet.  Naturally, my stomach started screaming for the worst possible thing I could have on my diet...Popeye's Tuesday fried chicken special!  Two pieces (no biscuit) for only .99 cents!  When I got there, I could see that a bunch of other people had the same idea.  To say the crowd was 'interesting' would probably be the understatement of the year, but I tried to remain positive so I figured at least it was entertaining.  That soon changed.  \n\nWow, I'm not kidding when I say this place is GHETTO!!!!  Unreal what people will go through to get a killer deal, but honestly, it was in the area, I was hungry, and fortunately, it was really good!  The staff seemed a little more coordinated than the last time I was here too.  On one visit, it was like a bad movie with the workers running around like a comedy of errors.  Things were much better this time although still slow.\n\nNoticed everyone was placing three orders (you can order up to four specials) so I figured why not as it's only three dollars for six pieces.  At that price, I ordered both regular and spicy.  Despite the crazy line and crowds, the chicken was super hot and fresh out of the kitchen when I checked my order (a must at any fast food place before leaving nowadays) so we decided to drive down to the marina green and eat it out there by the yacht club.  Stopped at a couple other places to pick up a few more things to eat and it turned into a really pleasant lunch by the water.\n\nI should be embarassed to admit this, but I was so hungry and I haven't had anything this bad for me (it was so bad that it was good!) in such a long time that I tore through it like a great white shark on a feeding frenzy.  Keep your arms and limbs clear!  \n\nAnyway, my reputation as an epicure may now be in jeopardy after this review, but I am still a happy and satisfied foodie.  As an added plus, I didn't have to eat it in front of my bird.  As I may have mentioned before, I always feel strangely guilty when I eat fried chicken in front of my bird. :)\n\nIt's fast food and on Tuesdays, it's surprisingly cheap and satisfying.  If you're willing to brave the crowds and environment, it's not a bad deal.", "rating": 4, "date": "2010-05-04"}, {"excerpts": ["and not that bougie stuff at $18 for 2 pieces ", "SF restaurants likes to do-- scribblin' designs on your plate with gravy. ", "2 pieces for $1.29. ", "there is a consistent line on tuesdays bc of the special. ", "this place is small with about 7 seats and without a doubt, dirty. "], "author": "Melissa N.", "review": "what can you say except that sometimes the heart wants what the heart wants and the heart wants fried chicken?\n\nand not that bougie stuff at $18 for 2 pieces SF restaurants likes to do-- scribblin' designs on your plate with gravy. if you're going to add gravy to my plate it better be the molten lava to my mashed potato volcano. \n\nanyway, so KFC was a bust the last time i went (never again) so of course we had to make our way to good 'ol reliable popeyes. and it was tuesday. 2 pieces for $1.29. there is a consistent line on tuesdays bc of the special. this place is small with about 7 seats and without a doubt, dirty. empty boxes filled with chicken bones and corn cobs sat on the 1 table beside the counter seating the entire hour we were there. but it's so busy that the staff likely doesn't get a second to step from behind the counter to throw away the trash/clean the tables, so i guess i'll give them that.\n\njust take your food to go and enjoy your fried chicken and yummy biscuits.", "rating": 3, "date": "2012-09-28"}, {"excerpts": ["I then intervened & offered to let her use one of my \"two per family limit\" so that she'd end up w/ six pieces. "], "author": "Tadashi Y.", "review": "An Afro-american woman accompanied by four children tried to order four orders of the Tuesday 2 for 99cent specials, but was told that there is a \"two per family limit\". Since there was five in her party, did the employee expect one of the kids to just watch the other four eat? I then intervened & offered to let her use one of my \"two per family limit\" so that she'd end up w/ six pieces. I ordered one order for myself. \n\nThe cashier glared at me for assisting the woman & retaliated by making me wait for my order. When the woman (who was dining in store) asked for some kind of plates that the kids could eat off of, she was charged 25 cents each. Another customer also asked for sauce & was levied 25 cents each. Popeyes claims they do not charge for them, so I assume the cashier was pocketing the money.\n\nAnyhow, long after the woman's orders were filled, I asked where mine was. I was told, \"Still waiting!\" After about 15 minutes, I got impatient & asked again. The cashier pulled my order which was sitting on the side (NOT under the heat lamps) & shoved it towards me. It was of course, no longer hot. I confronted her as to why she was playing games. She pretended not to understand then I asked for her name & a contact number. She refused.She openly boasted that that is an independently-owned franchise & that even if I complained, it'll never get to corporate but to the owner, who will side w/ her.\n\nIt turns out she was correct. Although I've called the 877-767-3937 number, I've never been able to speak to anyone to address the problems in this store. Problems plural.\n\nSeveral months before this (when this location did not participate in the Tuesday special & briefly touched on in my original review), a woman physically assaulted another woman in front of her toddler right where the register area was. I was astonished when the employee not only did not care about the safety of the customers (especially the little girl) & refused to even try to ask them to stop, much less call the police. She merely told them to move aside so she can take the next person's order. Making money superceeds public safety?...\n\nI called the police & the woman ran off. The cashier said it was none of my business & refused to give me any information. I called the next day when it was another shift & got a number of supposedly either the owner or the manager. I left several messages & NEVER received a single response. That tells me that this location's ownership/management not only doesn't care about public relations or worse, condones the employees' actions. \n\nOne of the employees put it, \"Your kind will still buy chicken\". Since it's in a predominantly minority area, that comment borders on racism & demonstrates her appalling hubris. She even went as far as to say that most of the customers can't even use computers & the phone line directs most options to the internet. The later which is true. \n\nI strongly recommend AGAINST going to this location, but love Popeye's chicken. I do however, strongly recommend the one on 22nd & Mission. Besides, they do not limit orders, have a restroom, & has free refills.\n\nSanta's Yelper sez: \"Stay away from this location! Go to nearby KFC, Safeway Deli, or the Popeyes on 22nd & Mission!\"", "rating": 1, "date": "2009-07-09"}, {"excerpts": [", it's like $2.50 for 2 pieces and a side!  "], "author": "Josie M.", "review": "post oral surgery and starving because you can't eat anything?  popeye's with mashed potatoes hits the spot.\n\nand go on tuesday, it's like $2.50 for 2 pieces and a side!  that's practically free!\n\neasy parking in the safeway parking lot makes this a much better location then the divisadero street one.", "rating": 5, "date": "2011-11-01"}, {"excerpts": ["BUT they didn't clean the chook pieces before frying. ", "There was battered and fried feather on my wing piece. ", "Also the under side of the breast piece was not cleaned so a lot of the gut was still on the piece. ", "Hey it might sound picky - "], "author": "Joyce L.", "review": "Sure, its junk food. But as a former fried chicken shop employee... there were just a few things that weren't quite, er, right.\n\nBefore I go into my whiny self... just want to clarify that the meal tasted fine. Just like any other Popeye's. Grease yet fluffy and very satisfying. The fries rock as usual.\n\nMy gripe is with the store - there were 3 staff on, myself plus one other customer in the store... and it still took 5 minutes before someone took my order! This is not fast food.\n\nSecondly... the chicken. It taste good. BUT they didn't clean the chook pieces before frying. There was battered and fried feather on my wing piece. Also the under side of the breast piece was not cleaned so a lot of the gut was still on the piece. Hey it might sound picky - but it was my job to wash, plug left over feathers and remove the gut in my teenage job.\n\nWill I go back? Probably. Just not anytime soon.", "rating": 2, "date": "2008-07-24"}, {"excerpts": ["purveyor of super-cheap two-pieces-for-$1.29 specials on Tuesdays ... provider of awesome cajun rice and rice and beans ... ", "the sole fast food joint which it is acceptable, nay, desirable! ", "to have in my neighborhood ... better than your average fast food, for sure, and the perfect hangover remedy when you're too broke to go to the ribs joint. ", "Popeye's, don't ever change."], "author": "David K.", "review": "Oh, Popeye's ... namesake of the Popeye's Gulch neighborhood of San Francisco (don't you DARE call it 'Nopa'!) ... purveyor of super-cheap two-pieces-for-$1.29 specials on Tuesdays ... provider of awesome cajun rice and rice and beans ... the sole fast food joint which it is acceptable, nay, desirable! to have in my neighborhood ... better than your average fast food, for sure, and the perfect hangover remedy when you're too broke to go to the ribs joint. Popeye's, don't ever change.", "rating": 4, "date": "2011-10-28"}, {"excerpts": ["They had a special of 10 pieces for $9.99 which was a deal, since normally 8 pieces is $11-12. ", "Spicy or regular? ", "Heck ", "yeah, ", "I spiced it up! ", "To my surprise it really wasn't that spicy. "], "author": "Catherine O.", "review": "I don't care what all of you say, 4 stars for ultimate junky greasy fake to the max food. Yes it was fulfilling, yes I felt like a pig afterwards, but hey we only live once right? \n\nI think this is my new spot, sorry KFC..I think I found a new love. They had a special of 10 pieces for $9.99 which was a deal, since normally 8 pieces is $11-12. Spicy or regular? Heck yeah, I spiced it up! To my surprise it really wasn't that spicy. They have sides such as mashed potatoes, red beans and rice, fries, and mac & cheese. I decided I had a craving for mac & cheese...fake as can be, but yummy! \n\nService wasn't bad. Walked in, and got help right away. I was thankful since we initially ordered the 8 piece, but he pointed out the 10 piece was cheaper. Yay! \n\nAs for the place itself, probably not the place to eat. I dont even remember there really even being a spot to eat at. Not the cleanliest  or nicest neck of the woods. I suggest take out! \n\nWell 4 peaces later,  I was pretty satisfied & full. Oh, popeyes you now hold a place in my heart for my junk food melt downs!\n\nAND p.s. yes i did say \"4 peaces\"...it was peaceful ok? :)", "rating": 4, "date": "2008-02-28"}, {"excerpts": ["I usually order the strips, which they cook for you when you order them; unlike the chicken pieces, which are pre-cooked and might be sitting out for a bit. ", "I will say that I was unhappy with an order of the crawfish one time, but let's let bygones be bygones. ", "The mashed potatoes are excellent, along with the cajun fries. "], "author": "Gregg K.", "review": "Oh Popeyes, how I love thee! Sorry it took so long to write a review for you. Ever since moving into the Fillmoe Center I have been a frequent customer at this fine establishment. After a long game of futbol last night, I was way too tired to cook, and paid my good friends a visit just before closing time. The kitchen was shut down and they were only serving the breasts and thighs that were already cooked. The main guy who is here most nights welcomed me and I asked if they were still cooking anything.. he said No, but knows I am a big fan of the #7 combo with the chicken tenders (spicy of course). He asked if I wanted the strips and I gave him confirmation. Other people who came in right after me did not get this offer, they were only given the option of the food that was already made. So I guess you could say I'm kind of a big deal... but seriously that was awesome service, thanks guys!\n\nThe food has always been very fresh and tasty. I usually order the strips, which they cook for you when you order them; unlike the chicken pieces, which are pre-cooked and might be sitting out for a bit. I will say that I was unhappy with an order of the crawfish one time, but let's let bygones be bygones. The mashed potatoes are excellent, along with the cajun fries. I highly recommend asking for some honey and strawberry jam to go along with the biscuit.\n\nThe only request I have is that they offer an online delivery service.. honestly some nights I just don't feel like walking the half-block or so. Keep cooking a mean bird Popeyes, I will see you soon!!", "rating": 5, "date": "2010-07-22"}], "biscuit": [{"excerpts": ["the food was horrible the biscuit was the only thing semi good, chicken was fatty and greasy, fries were ok....", "this is the 1st time I have ever been disappointed eating a Popeyes, but this particular establishment ", "I WILL NEVER AGAIN!!!"], "author": "Kenyetta W.", "review": "Nasty asf!!!! Horrible customer service, no where to wash your hands,no restroom and did I mention nasty asf crumbs all over the floor the tables, the chairs health inspection 85 of course I noticed after getting my food.\nIf I could no  the food was horrible the biscuit was the only thing semi good, chicken was fatty and greasy, fries were ok....this is the 1st time I have ever been disappointed eating a Popeyes, but this particular establishment I WILL NEVER AGAIN!!!", "rating": 1, "date": "2017-03-19"}, {"excerpts": ["And sure, it's not the cleanest (but hey, they seem to pass inspection!), but who am I to judge, especially when I'm craving a buttery biscuit!!\n\n"], "author": "Tracy T.", "review": "I don't care what anyone says, I love Popeyes biscuits and their popcorn shrimp!!! So what if it's filled with trans fat, nor organic, and greasy, it's all kinds of delicious! And sure, it's not the cleanest (but hey, they seem to pass inspection!), but who am I to judge, especially when I'm craving a buttery biscuit!!\n\nI like coming to this location specifically because there's a big parking lot, so I don't have to circle around attempting to find parking. Service is relatively fast, but hey, you get what you pay for!\n\nWord of caution though: if you come late, chances are they may be out of the Mac and cheese or any of their other more popular sides. But otherwise, it's a solid meal at a solid price in my book.\n\nLikes:\n-fast service\n-good options \n\nDislikes:\n-runs out of sides sometimes \n-not the cleanest location", "rating": 4, "date": "2016-12-12"}, {"excerpts": ["Piece chicken with a biscuit \n\n", "Don't forget to get your receipt back after your Popeyes restaurants are offering a receipt survey for 2 free pieces of chicken and a biscuit with the purchase of any large drink. \n\n"], "author": "Porsche C.", "review": "Did someone say Popeyes? YES PLEASE!\n\nPopeye's is my #1 spot to go to for some delicious fried chicken!\n\nI was in the mood for some after spending the morning in San Francisco and this location came to mind. Located in the Safeway Fillmore plaza you cannot miss this small local restaurant! \n\nI came in during lunch time and I got there right before the line got extremely long! Thank goodness because after a while they did start to run out of food.\nI asked for a special request of freshly made fried chicken which was a 10 minute wait. I don't mind waiting for freshly cooked chicken (it's definitely worth it). \n\nI ordered:\n~Butterfly shrimp with fries\n~2 Piece chicken with a biscuit \n\nThe cashier lady was so nice but I have to admit she was so slow! They have about 4 different men that prepare the food in the back and although the cashier was slow the food does come out quickly.\n\nMy favorite was the biscuits! OMG, it makes my mouth water just thinking about it! It was so freshly hot and just melted right in my mouth! So damn delicious!\nOne thing that turned me off were the dirty tables. UGH! I couldn't eat at this place even if my life depended on it! I do understand they are busy but they should at least do a check every so often to check the cleanness of the store, right?\n\nI would definitely come and order there good food again especially because they make it so fresh! Hopefully those biscuits don't stick in my head for too long or I'm going to have to make a special visit sooner than I thought! HAHA\n\nPsst...Don't forget to get your receipt back after your Popeyes restaurants are offering a receipt survey for 2 free pieces of chicken and a biscuit with the purchase of any large drink. \n\nOh how I love you Popeyes!", "rating": 3, "date": "2015-05-22"}, {"excerpts": ["I ordered the 5 piece chicken tender dinner (spicy, of course) with fries and a biscuit. ", "They made the chicken tenders to order, and they happened to be making a fresh batch of fries when I placed my order. ", "Needless to say, my meal was outstanding. ", "The chicken strips were crisp and spicy, and the chicken was really juicy. ", "The fries were actually crisp (generally they tend to get soggy after a pretty short amount of time). "], "author": "Ravi S.", "review": "Last Thursday night, I was running late to a show at The Fillmore, so I wanted to have a quick dinner. Popeye's was just a block away from the venue, so I decided to check it out. \n\nPopeye's is definitely my favorite fast food fried chicken place (over KFC and Church's). Popeye's at its freshest is 5 stars. However, many locations can be hit or miss. I happened to have a great experience at this location, but I noticed that other customers were not as happy with their experiences. \n\nI ordered the 5 piece chicken tender dinner (spicy, of course) with fries and a biscuit. They made the chicken tenders to order, and they happened to be making a fresh batch of fries when I placed my order. Needless to say, my meal was outstanding. The chicken strips were crisp and spicy, and the chicken was really juicy. The fries were actually crisp (generally they tend to get soggy after a pretty short amount of time). The buffalo bayou sauce, which is really just Louisiana hot sauce, was the perfect dipping sauce for the chicken. \n\nI do have to take away one star though, because while I was eating my food, several customers tried to order items like cajun rice and jambalaya only to be told that Popeye's was out of them. It was only 7:30, and they stay open until 10, so I would be kind of annoyed if I had wanted to order one of those items. \n\nOverall, I'd recommend this Popeye's location. It's certainly better than Subway or Panda Express.", "rating": 4, "date": "2015-04-25"}, {"excerpts": ["**, they don't include a biscuit with this \"deal\", like every other Popeye's in states outside of CA would.  ", "Then, they want you to pay over $1 for a biscuit, and if you want sides, they'll be overpriced and extra too! ", "This is obviously a ripoff. ", "Yet, there are the lemmings, lined up every Tuesday.  ", "I don't know why so many people in SF patronize these restaurants. ", "No matter how f'd up they are!  "], "author": "Ebony S.", "review": "I wish there was a way to stop people from eating at this location. The entire staff stands around talking, even when there is a long line, while 1 person takes all the orders. The dining area consistently has dirty tables, maybe that's what they're talking about! All I know is, they are now  making $14/hr. to socialize with each other, and ignore their customers! Tuesdays they have a 2 piece deal, and the line is out the door (Arghhh!), Because the franchise owner is a greedy a**, they don't include a biscuit with this \"deal\", like every other Popeye's in states outside of CA would.  Newsflash: 2 pieces of chicken by themselves is NOT a deal! Then, they want you to pay over $1 for a biscuit, and if you want sides, they'll be overpriced and extra too! This is obviously a ripoff. Yet, there are the lemmings, lined up every Tuesday.  I don't know why so many people in SF patronize these restaurants. No matter how f'd up they are!  Look  people who eat at this location, you can walk the few extra feet to Safeway, and get 2 pieces of chicken, for the same price or not much more. And, you can have a choice of rotisserie or fried. The employees, will actually talk to you politely, and without stank attitude. If everyone went there, and Popeyes saw a decline in their profits, they would have to re-think the way they do business.", "rating": 1, "date": "2017-09-12"}, {"excerpts": ["Got a 2 piece fried chicken meal with a breast and a thigh with mashed potatoes and a biscuit for about $5. ", "I can't beat that! ", "Honestly I used to love kfc until they changed their oil. ", "Now their chicken is bland. ", "But I love popeyes spicy fried chicken. ", "The skin is crispy and has a slight kick. "], "author": "Elena N.", "review": "Got a 2 piece fried chicken meal with a breast and a thigh with mashed potatoes and a biscuit for about $5. I can't beat that! Honestly I used to love kfc until they changed their oil. Now their chicken is bland. But I love popeyes spicy fried chicken. The skin is crispy and has a slight kick. Yum!\n\nOur cashier was super nice and quick so I would have probably given this location 4 stars, but minus 1 star cuz the place is a little sketchy. I felt slightly uncomfortable walking in. Parking is super easy as it's in the safeway shopping center so they almost got the star back. But minus that same star for being out of mac and cheese. Boo!", "rating": 3, "date": "2013-04-10"}, {"excerpts": ["Luckily, we only got the spicy 2 piece (drumstick and thigh) snack with biscuit at $2.49?   ", "These are the smallest drumstick and thigh we have ever seen!  ", "Maybe they are from a game hen.   ", "After pulling off all the batter and skin, there were probably 2 bits worth of meat. ", "Size aside, it was not spicy and not very good.  ", "I didn't even bother trying the biscuit but hubby did and he said it was not good.\n\n"], "author": "Gloria H.", "review": "We saw this lady eating fried chicken and got us wanting some.  When we saw Popeye's, we knew we wanted some.  Having had good experience with Popeye in New Orleans, we were expecting the same - boy, were we wrong!  Luckily, we only got the spicy 2 piece (drumstick and thigh) snack with biscuit at $2.49?   These are the smallest drumstick and thigh we have ever seen!  Maybe they are from a game hen.   After pulling off all the batter and skin, there were probably 2 bits worth of meat. Size aside, it was not spicy and not very good.  I didn't even bother trying the biscuit but hubby did and he said it was not good.\n\nNo more Popeye in SF for me.  If I have any cravings, I'll just have to take care of it when we return to New Orleans.\n\n$5 minimum for credit card purchase.  Operated (owned too?) by Chinese.", "rating": 2, "date": "2012-07-07"}, {"excerpts": ["The biscuit should also not be overlooked. \n\n"], "author": "Denise N.", "review": "Looking for a great date spot? You got it. It's a good test - if your man don't like his chicken fried, then you know what it is. \n\nI recommend crispy strip box with potato wedges and mac n' cheese. The biscuit should also not be overlooked. \n\nThere are fewer Popeyes in the city than Michelin-star rated restaurants: just think about that.", "rating": 5, "date": "2015-10-05"}, {"excerpts": ["I usually get 3 wings which come with a biscuit &\norder a red beans & rice on the side. ", "If I'm eating inside\n", "The store ", "then I'd get the combo which comes with a \nbiscuit, side & drink. ", "I also enjoy their mashed potatoes &\ngravy, the fries & butterfly shrimp !"], "author": "Denisha D.", "review": "The store isn't that spacious but the food is delicious.\nI love Popeyes chicken & will take them over KFC any\nDay ! I usually get 3 wings which come with a biscuit &\norder a red beans & rice on the side. If I'm eating inside\nThe store then I'd get the combo which comes with a \nbiscuit, side & drink. I also enjoy their mashed potatoes &\ngravy, the fries & butterfly shrimp !", "rating": 3, "date": "2013-05-05"}, {"excerpts": ["I ordered the 3pc chicken strips with mac and cheese, biscuit and drink - but I didn't want the drink cause I had my boba, so he gave me an extra biscuit instead. ", "Turns out they were \"sold out\" of mac and cheese. ", "Cause that happens right? ", "You just sell out of sides at a fast food restaurant ", "-____- ", "then he points to the pictures of all the sides and draws invisible x", "'s on the greens beans and some other side..."], "author": "Lydia L.", "review": "I don't normally (or ever) eat fast food but it was a fat day. I walked in with a large tapioca drink in my hand and the cashier looked like he wanted to kill himself. It was about 8:45pm and it was a ghost town. \n\nI ordered the 3pc chicken strips with mac and cheese, biscuit and drink - but I didn't want the drink cause I had my boba, so he gave me an extra biscuit instead. Turns out they were \"sold out\" of mac and cheese. Cause that happens right? You just sell out of sides at a fast food restaurant -____- then he points to the pictures of all the sides and draws invisible x's on the greens beans and some other side...then circles 3 other ones that were available. \n\nI am dying laughing at his descriptive technique! I went with the mashed potatoes and WOW....biggest let down ever!! It tasted like what I would imagine cat food to taste like. It was like thanksgiving flavored gerber with salt and pepper on top lol \n\nRequested spicy strips and they were nothing of the sort - delicious, but not spicy. The biscuits drizzled with honey were on point.", "rating": 2, "date": "2013-02-26"}, {"excerpts": ["i normally don't come to this location but i stopped by last night because i was in the area and order the 2 piece snack deal that comes with a biscuit. ", "It was good, but not great! "], "author": "Jenny G.", "review": "ooo how i love me a piece of fried chicken from Popeyes! i normally don't come to this location but i stopped by last night because i was in the area and order the 2 piece snack deal that comes with a biscuit. It was good, but not great! i always feel like this specific location rips people off with smaller pieces of chickens compared to other locations. When i order the 2 for 99 cent deal tuesdays i always get bigger pieces elsewhere and i believe they put a limit here on how many you can actually purchase. not saying i'm a big eater that LOVE fried chicken but from time to time i love me a piece of those killer fried chickens. \n\nthe people who work here are fast and nice. i will maybe stop by again if i'm feening for a piece of toxic in my stomach, only if im in the area..", "rating": 2, "date": "2011-01-24"}, {"excerpts": ["Two pieces (no biscuit) for only .99 cents!  ", "When I got there, I could see that a bunch of other people had the same idea.  ", "To say the crowd was 'interesting' would probably be the understatement of the year, but I tried to remain positive ", "so I figured ", "at least it was entertaining.  ", "so I figured why not as it's only three dollars for six pieces.  ", "At that price, I ordered both regular and spicy.  ", "Despite the crazy line and crowds, the chicken was super hot and fresh out of the kitchen when I checked my order (a must at any fast food place before leaving nowadays) so we decided to drive down to the marina green and eat it out there by the yacht club.  "], "author": "Roy N.", "review": "Forgive me for I have sinned....\n\nSo this is what I have been reduced to...reviewing fast food!  I've been so fortunate to dine in so many incredible places in the past...I guess I'm okay with that.  At least no one can say I'm a snob.\n\nThe weather was so beautiful today that we took a nice long walk down Fillmore in Pac Heights.  All of a sudden, I was really hungry and realized that I had not had lunch yet.  Naturally, my stomach started screaming for the worst possible thing I could have on my diet...Popeye's Tuesday fried chicken special!  Two pieces (no biscuit) for only .99 cents!  When I got there, I could see that a bunch of other people had the same idea.  To say the crowd was 'interesting' would probably be the understatement of the year, but I tried to remain positive so I figured at least it was entertaining.  That soon changed.  \n\nWow, I'm not kidding when I say this place is GHETTO!!!!  Unreal what people will go through to get a killer deal, but honestly, it was in the area, I was hungry, and fortunately, it was really good!  The staff seemed a little more coordinated than the last time I was here too.  On one visit, it was like a bad movie with the workers running around like a comedy of errors.  Things were much better this time although still slow.\n\nNoticed everyone was placing three orders (you can order up to four specials) so I figured why not as it's only three dollars for six pieces.  At that price, I ordered both regular and spicy.  Despite the crazy line and crowds, the chicken was super hot and fresh out of the kitchen when I checked my order (a must at any fast food place before leaving nowadays) so we decided to drive down to the marina green and eat it out there by the yacht club.  Stopped at a couple other places to pick up a few more things to eat and it turned into a really pleasant lunch by the water.\n\nI should be embarassed to admit this, but I was so hungry and I haven't had anything this bad for me (it was so bad that it was good!) in such a long time that I tore through it like a great white shark on a feeding frenzy.  Keep your arms and limbs clear!  \n\nAnyway, my reputation as an epicure may now be in jeopardy after this review, but I am still a happy and satisfied foodie.  As an added plus, I didn't have to eat it in front of my bird.  As I may have mentioned before, I always feel strangely guilty when I eat fried chicken in front of my bird. :)\n\nIt's fast food and on Tuesdays, it's surprisingly cheap and satisfying.  If you're willing to brave the crowds and environment, it's not a bad deal.", "rating": 4, "date": "2010-05-04"}, {"excerpts": ["Popeyes Chicken & Biscuit rocks and makes KFC appear a distant second.\n\n"], "author": "Rayfil W.", "review": "Boy, when I crave something, I just gotta have it.  Growing up in Brooklyn, I was introduced to this fast food restaurant at an early age.\n\nPopeyes Chicken & Biscuit rocks and makes KFC appear a distant second.\n\nOne bite into the tender chicken, the crispy crust shatters making the start of the marathon.  A mixture of spices that is both savory and pungent makes my mouth water as I write this entry.\n\nFlaky biscuits with the comfort food tones of butter hug the senses.  Trekking along the comfort food path, rice and beans finish the meal.\n\nLocation: there is a parking lot", "rating": 4, "date": "2009-02-11"}, {"excerpts": ["For a quick fix of fatty fried goodness, the chicken biscuit sandwich for $1.50 and a side of small fries works wonders.\n\n", "Since KFC went and changed their biscuit recipe, the biscuit at Popeye's wins over KFC's hands down.   ", "The cajun fries are flavorful and have just the right amount of kick.  "], "author": "Sus... B.", "review": "For a quick fix of fatty fried goodness, the chicken biscuit sandwich for $1.50 and a side of small fries works wonders.\n\nThe batter is flavorful and I haven't detected a whole lot of mystery chicken-related material, only meat and batter.  Since KFC went and changed their biscuit recipe, the biscuit at Popeye's wins over KFC's hands down.   The cajun fries are flavorful and have just the right amount of kick.  Red beans and rice aren't bad either.\n\nAs far as complaints about the customers go, once you enter the door it's all about the chicken.  I've never experienced any weirdness here, people are generally very polite and no one has ever been rude.  Since that's all I care about when getting food, I couldn't care less about any extracurricular pharmaceutical sales going down at the plaza or in the parking lot, much less anyone who asks me for money (even if they're standing right outside as this tactic makes it far less likely that I'll give them any).  \n\nThe only reason I'm giving 3 stars as opposed to four is due to the slow service.  For whatever reason, it takes a really long time to get your food at this location.   If I were in a big hurry, I'd probably head to Burger King or even Safeway before getting something here.  However, the wait is usually worth it if you're not on a deadline.", "rating": 3, "date": "2008-11-08"}, {"excerpts": ["The biscuit was good "], "author": "Rick P.", "review": "What would be better for dinner after a nice Dim Sum luncheon with some fellow Yelpers than some greasy fried chicken!  LOL!  This is only my second time trying Popeye's and at this location.  I'd say definitely better than KFC but I like Church's better.  The cajun mash potatoes weren't bad but didn't like their coleslaw much...prefer KFC's coleslaw.  The biscuit was good but I think I like the honey biscuits from Church's better.\n\nAs far as the location...kinda sketchy...noticed a few questionable people hanging around the Safeway parking lot of the complex where this Popeye's was located.  Advice: park close, order quick, hurry home.", "rating": 2, "date": "2008-03-02"}, {"excerpts": ["Perhaps from the chemical \"buttery\" biscuit?  ", "I'm not sure, but it definitely changed my pleasant experience into a slighty disturbing one... a filmy mouth is one thing - I just hope my arteries are still in tact :("], "author": "Laura W.", "review": "There isn't much of a restaurant selection in my immediate area, so when I'm in a rush I often have to chose between Burger King, Subway, and Panda Express.  Sad, I know...\n\nAnyway, today I was in a rush and somehow couldn't stand to eat at any of these places again... and then my roommie suggested Popeye's.  Chicken!  Biscuits!  Fast food, but yet, different from the other fast food... so we went for it!\n\nLocated around the corner from Fillmore Street, hidden in Safeway's parking lot, the sidewalk and surrounding area was dirty - but I'm used to that from going grocery shopping there, anyway.  The place itself was clean and not even too sketchy.\n\nService was a little slow, but at least the workers seemed very friendly and relaxed, making sure to get everyone's orders right.  The food was definitely higher quality than regular fast food.  You get a lot of food for a very low price, and it's comfort food - who doesn't love biscuits?!  I especially like the fries - much better than any of its fast food competitors.\n\nAfter finishing the meal, I actually had resolved to give Popeye's 4 stars.  That is a very high rating for a fast food place in my view.  However, a few minutes later I noticed the roof of my mouth was still filmy... how mysterious!  Was it from the juicy crunchy chicken skin, loaded with preservatives?  Perhaps from the chemical \"buttery\" biscuit?  I'm not sure, but it definitely changed my pleasant experience into a slighty disturbing one... a filmy mouth is one thing - I just hope my arteries are still in tact :(", "rating": 3, "date": "2007-10-09"}, {"excerpts": ["Quick and Tasty\n\nI got the chicken biscuit for 1.40 \nand a small fries\n\n"], "author": "Tony C.", "review": "Quick and Tasty\n\nI got the chicken biscuit for 1.40 \nand a small fries\n\nThe fries are soooo tasty. Much better than other fast food joints\n\nI would give it five stars if they wouldve offered my ketchup or other sauces. But I had to go back and ask for some.\nI didnt bother asking for other sauces because those wouldve cost me 25 cents. \n\nOther than that. the food was delicious.", "rating": 4, "date": "2009-08-02"}, {"excerpts": ["I think the biscuit was pretty standard, nothing special.\n\n"], "author": "CE Y.", "review": "One of the other reviewers was right.  This location has some CRAZY customers.  We were waiting in line, when one of the other patrons was making disgusting puking noises.  I don't think he really did vomit, but I didn't bother looking.  He was probably just craving attention.  He apologized about causing a mess that the workers there would have to clean up.  I don't think there was a mess, but either way, pretty gross, when I'm about to order my dinner.  This was my first ever visit to a Popeyes, too!  \n\nSurprisingly, they have fish and shrimp on the menu, too.  I ordered the 2 piece spicy chicken and 2 piece fried catfish (I think that's what the fish was) meal, with a side of red beans & rice.  Back at home, we got to enjoy the meal, away from nutzoid customers.  The chicken wasn't super spicy, probably so that anyone could handle the heat.  Both the chicken and the fish were pretty crunchy.  The red beans & rice were good.  I had a taste of the mashed potatoes and gravy, but not enough to determine how good it was.  I think the biscuit was pretty standard, nothing special.\n\nI would go back for more.  This is a different type of bird from KFC.  Definitely isn't as good as Powell's Place.  But when you're desperate for fried chicken to go, there's not much to choose from in SF.", "rating": 3, "date": "2008-04-20"}, {"excerpts": ["This location does get its share of weirdos coming in to buy like one wing or a biscuit, but in general the place is safe.  ", "The decor doesn't feel that warm, so prepare to probably want to take your food to go."], "author": "Aaron W.", "review": "Popeye's has some of the best fried chicken around.  Much better than KFC and on par with Church's.  This location does get its share of weirdos coming in to buy like one wing or a biscuit, but in general the place is safe.  The decor doesn't feel that warm, so prepare to probably want to take your food to go.", "rating": 4, "date": "2006-10-19"}, {"excerpts": ["I highly recommend asking for some honey and strawberry jam to go along with the biscuit.\n\n"], "author": "Gregg K.", "review": "Oh Popeyes, how I love thee! Sorry it took so long to write a review for you. Ever since moving into the Fillmoe Center I have been a frequent customer at this fine establishment. After a long game of futbol last night, I was way too tired to cook, and paid my good friends a visit just before closing time. The kitchen was shut down and they were only serving the breasts and thighs that were already cooked. The main guy who is here most nights welcomed me and I asked if they were still cooking anything.. he said No, but knows I am a big fan of the #7 combo with the chicken tenders (spicy of course). He asked if I wanted the strips and I gave him confirmation. Other people who came in right after me did not get this offer, they were only given the option of the food that was already made. So I guess you could say I'm kind of a big deal... but seriously that was awesome service, thanks guys!\n\nThe food has always been very fresh and tasty. I usually order the strips, which they cook for you when you order them; unlike the chicken pieces, which are pre-cooked and might be sitting out for a bit. I will say that I was unhappy with an order of the crawfish one time, but let's let bygones be bygones. The mashed potatoes are excellent, along with the cajun fries. I highly recommend asking for some honey and strawberry jam to go along with the biscuit.\n\nThe only request I have is that they offer an online delivery service.. honestly some nights I just don't feel like walking the half-block or so. Keep cooking a mean bird Popeyes, I will see you soon!!", "rating": 5, "date": "2010-07-22"}, {"excerpts": ["the biscuit is also good. ", "easy parking."], "author": "Allentine T.", "review": "compare to other fast food, this place is great! the spicy crispy chicken is so delicious. the biscuit is also good. easy parking.", "rating": 5, "date": "2012-11-07"}], "biscuits": [{"excerpts": ["The biscuits were good as well, flavorful and tender lightly golden brown. "], "author": "Ray F.", "review": "This has to be one of the smallest Popeyes around. This little eatery was packed with people even in the late afternoon of my visit. A line out the door literally, I was about four outside the door when I got on line. It does move pretty quickly though and the walk up counter service is friendly and efficient. Paid, got my ticket and drink, it really only took a few minutes and my food was ready, hot and fresh and delivered to me.\n\nMenu boards are overhead at the counter, with multiple choices and options. There's a small \"dining\" area along with a few window seats, otherwise most folks get it to go. Which was my intent and plan.\n\nThe food is Popeyes norm, the beans and rice are/were good as was/is the mac n cheese, the spicy chicken nicely fried, moist and tender, and piping hot. The biscuits were good as well, flavorful and tender lightly golden brown. A good option for fast food.\n\nThis little shops location is in a very busy Safeway parking lot with no drive through. So you have to park and walk in, the only downside. \n\n3 Stars it serves its purpose\n\n00591", "rating": 3, "date": "2018-10-05"}, {"excerpts": ["I don't care what anyone says, I love Popeyes biscuits and their popcorn shrimp!!! ", "So what if it's filled with trans fat, nor organic, and greasy, it's all kinds of delicious! "], "author": "Tracy T.", "review": "I don't care what anyone says, I love Popeyes biscuits and their popcorn shrimp!!! So what if it's filled with trans fat, nor organic, and greasy, it's all kinds of delicious! And sure, it's not the cleanest (but hey, they seem to pass inspection!), but who am I to judge, especially when I'm craving a buttery biscuit!!\n\nI like coming to this location specifically because there's a big parking lot, so I don't have to circle around attempting to find parking. Service is relatively fast, but hey, you get what you pay for!\n\nWord of caution though: if you come late, chances are they may be out of the Mac and cheese or any of their other more popular sides. But otherwise, it's a solid meal at a solid price in my book.\n\nLikes:\n-fast service\n-good options \n\nDislikes:\n-runs out of sides sometimes \n-not the cleanest location", "rating": 4, "date": "2016-12-12"}, {"excerpts": ["My favorite was the biscuits! ", "OMG, it makes my mouth water just thinking about it! ", "It was so freshly hot and just melted right in my mouth! ", "So damn delicious!\n", "One thing that turned me off were the dirty tables. ", "UGH! ", "I couldn't eat at this place even if my life depended on it! ", "I do understand they are busy but they should at least do a check every so often to check the cleanness of the store, ", "Hopefully those biscuits don't stick in my head for too long or I'm going to have to make a special visit sooner than I thought! "], "author": "Porsche C.", "review": "Did someone say Popeyes? YES PLEASE!\n\nPopeye's is my #1 spot to go to for some delicious fried chicken!\n\nI was in the mood for some after spending the morning in San Francisco and this location came to mind. Located in the Safeway Fillmore plaza you cannot miss this small local restaurant! \n\nI came in during lunch time and I got there right before the line got extremely long! Thank goodness because after a while they did start to run out of food.\nI asked for a special request of freshly made fried chicken which was a 10 minute wait. I don't mind waiting for freshly cooked chicken (it's definitely worth it). \n\nI ordered:\n~Butterfly shrimp with fries\n~2 Piece chicken with a biscuit \n\nThe cashier lady was so nice but I have to admit she was so slow! They have about 4 different men that prepare the food in the back and although the cashier was slow the food does come out quickly.\n\nMy favorite was the biscuits! OMG, it makes my mouth water just thinking about it! It was so freshly hot and just melted right in my mouth! So damn delicious!\nOne thing that turned me off were the dirty tables. UGH! I couldn't eat at this place even if my life depended on it! I do understand they are busy but they should at least do a check every so often to check the cleanness of the store, right?\n\nI would definitely come and order there good food again especially because they make it so fresh! Hopefully those biscuits don't stick in my head for too long or I'm going to have to make a special visit sooner than I thought! HAHA\n\nPsst...Don't forget to get your receipt back after your Popeyes restaurants are offering a receipt survey for 2 free pieces of chicken and a biscuit with the purchase of any large drink. \n\nOh how I love you Popeyes!", "rating": 3, "date": "2015-05-22"}, {"excerpts": ["...cold slaw was good...\nbut amount not a serving..\nBiscuits hard and cold...\n"], "author": "Jim B.", "review": "this location is the worst...chicken must have been the size of a pigeon...\ngot two 8 piece \"deals\"...breasts were mostly oily breading, legs were 3\ninches long, wings so small no meat, thighs ok...cold slaw was good...\nbut amount not a serving..\nBiscuits hard and cold...\nsafeway deli has best carry out chicken in san francisco\n\nFriday special: 4 thighs and 4 legs 4 five bucks", "rating": 1, "date": "2018-01-14"}, {"excerpts": ["I love the taste of the Fried Chicken and I often get biscuits and a soft drink to go along with it. ", "I am not a fan of their fries though; they are not crispy enough and often seems to get limber as soon as you take it out of the box. ", "As long as the quality of service remains the same I'll continue eating here, it's too good to go somewhere else."], "author": "Mia M.", "review": "Popeye's is among my go-to spots for a fast and cheap meal (actually, I go there when I do not have much time and I need to be in and out in 30 minutes or less). Nothing can beat the service I get at this specific location -- way better than any other one I have been to. I love the taste of the Fried Chicken and I often get biscuits and a soft drink to go along with it. I am not a fan of their fries though; they are not crispy enough and often seems to get limber as soon as you take it out of the box. As long as the quality of service remains the same I'll continue eating here, it's too good to go somewhere else.", "rating": 4, "date": "2017-10-21"}, {"excerpts": ["I also like their biscuits. ", "J ordered the sides once, they ate just ok, "], "author": "lovetoeat a.", "review": "When I am in the mood for some fried chicken,it would be Popeye's. This review is for the Fillmore location. \n\nOn Tuesday, they have a special, a thigh and a drumstick for 1.99$... it is now raised to 2.29$...\nI like Popeye's because it is much crispier than KFC... but I don't know if it was because of the oil, I kept burping after each time I ate their chicken! Weird, but it's true! I also like their biscuits. J ordered the sides once, they ate just ok, so I don't get them any more. \n\nThe lady cashier was cheerful, but sometimes it was a younger Asian guy... and he was pretty rude. \n\nParking is horrendous here. The Safeway lot is always full, have to drive around and around till I was lucky enough to see somebody pull out. And street parking in Fillmore is not any better.", "rating": 3, "date": "2017-05-16"}, {"excerpts": ["The real shinning star, so to speak, is the biscuits...and they is aight as well.\n\n"], "author": "David G.", "review": "Anytime you have a popeyes and a dialysis clinic in the same mall....its all good.\n\nSeriously this place is aight. Spicy chicken is not that spicy...is not that great for that matter.\n\nFries are so so. \n\nThe real shinning star, so to speak, is the biscuits...and they is aight as well.\n\nPlenty of parking. Plenty of entertaining characters abound around.....\n\nGrab a meal deal and a seat at the davita clinic ( I hope none of you ever have to)....and enjoy.", "rating": 3, "date": "2013-04-12"}, {"excerpts": ["They don't understand the \"biscuits\" portion of their name.  ", "You have to stand out the door of this tiny storefront to wait your turn, and with that kind of customer volume, there's not need to be polite, or try to get your order right.  ", "It helps if you match the ethnicity of the owner/manager for better service.  ", "Seemed a bit racist."], "author": "Eric S.", "review": "They don't understand the \"biscuits\" portion of their name.  You have to stand out the door of this tiny storefront to wait your turn, and with that kind of customer volume, there's not need to be polite, or try to get your order right.  It helps if you match the ethnicity of the owner/manager for better service.  Seemed a bit racist.", "rating": 1, "date": "2017-04-25"}, {"excerpts": ["The spicy isn't actually spicy at all, but the chicken is moist and the biscuts (oh, the biscuits!!) manage to be sweet and slightly salty all at once (black magic, I say!), and the red beans are rice are fine as well. ", "Top it off with a Hi-C fruit punch, and you've got yourself ", "a Saturday afternoon stroll down ", "diabetes lane - "], "author": "Craig P.", "review": "Yes, I am aware that I am writing a review for Popeye's, don't judge.\n\nI avoided this place for a while, mainly because there's so much good food in SF, but after riding the 24 up and down Divis with people getting on with bags of this nectar from the gods, I had to give it a go. \n\nThe staff is beyond rude - but I would be too if I worked at Popeye's - and I'll put up with a lot of bullshit for reasonably priced fried chicken. The spicy isn't actually spicy at all, but the chicken is moist and the biscuts (oh, the biscuits!!) manage to be sweet and slightly salty all at once (black magic, I say!), and the red beans are rice are fine as well. Top it off with a Hi-C fruit punch, and you've got yourself a Saturday afternoon stroll down diabetes lane - no seriously, there's a dialysis clinic like next door. \n\nENJOY!", "rating": 4, "date": "2013-07-08"}, {"excerpts": ["Love the biscuits...", "I think they're far better than kfc's..."], "author": "Jen W.", "review": "It's crazy how there's 2 chicken joints within a block radius...how do you choose?  KFC or popeye's?  Well, this popeye's location is always super busy....it doesn't matter what time of the day.  I'd like to think that because of that, the chicken is always freshly fried.  \n\nThe people that work there look miserable...although they are quick and efficient.  I guess that's all you need to get in and out within a matter of minutes.  \n\nDon't even bother going on Tuesdays...they have a 2 piece chicken for 1.99 deal...lines out to the streets!  \n\nLove the biscuits...I think they're far better than kfc's...but the chicken war will still be left unsaid.  \n\nOh, and they've got dirty rice...can't beat that!", "rating": 3, "date": "2012-02-08"}, {"excerpts": ["The biscuits drizzled with honey were on point."], "author": "Lydia L.", "review": "I don't normally (or ever) eat fast food but it was a fat day. I walked in with a large tapioca drink in my hand and the cashier looked like he wanted to kill himself. It was about 8:45pm and it was a ghost town. \n\nI ordered the 3pc chicken strips with mac and cheese, biscuit and drink - but I didn't want the drink cause I had my boba, so he gave me an extra biscuit instead. Turns out they were \"sold out\" of mac and cheese. Cause that happens right? You just sell out of sides at a fast food restaurant -____- then he points to the pictures of all the sides and draws invisible x's on the greens beans and some other side...then circles 3 other ones that were available. \n\nI am dying laughing at his descriptive technique! I went with the mashed potatoes and WOW....biggest let down ever!! It tasted like what I would imagine cat food to taste like. It was like thanksgiving flavored gerber with salt and pepper on top lol \n\nRequested spicy strips and they were nothing of the sort - delicious, but not spicy. The biscuits drizzled with honey were on point.", "rating": 2, "date": "2013-02-26"}, {"excerpts": ["just take your food to go and enjoy your fried chicken and yummy biscuits."], "author": "Melissa N.", "review": "what can you say except that sometimes the heart wants what the heart wants and the heart wants fried chicken?\n\nand not that bougie stuff at $18 for 2 pieces SF restaurants likes to do-- scribblin' designs on your plate with gravy. if you're going to add gravy to my plate it better be the molten lava to my mashed potato volcano. \n\nanyway, so KFC was a bust the last time i went (never again) so of course we had to make our way to good 'ol reliable popeyes. and it was tuesday. 2 pieces for $1.29. there is a consistent line on tuesdays bc of the special. this place is small with about 7 seats and without a doubt, dirty. empty boxes filled with chicken bones and corn cobs sat on the 1 table beside the counter seating the entire hour we were there. but it's so busy that the staff likely doesn't get a second to step from behind the counter to throw away the trash/clean the tables, so i guess i'll give them that.\n\njust take your food to go and enjoy your fried chicken and yummy biscuits.", "rating": 3, "date": "2012-09-28"}, {"excerpts": ["Flaky biscuits with the comfort food tones of butter hug the senses.  "], "author": "Rayfil W.", "review": "Boy, when I crave something, I just gotta have it.  Growing up in Brooklyn, I was introduced to this fast food restaurant at an early age.\n\nPopeyes Chicken & Biscuit rocks and makes KFC appear a distant second.\n\nOne bite into the tender chicken, the crispy crust shatters making the start of the marathon.  A mixture of spices that is both savory and pungent makes my mouth water as I write this entry.\n\nFlaky biscuits with the comfort food tones of butter hug the senses.  Trekking along the comfort food path, rice and beans finish the meal.\n\nLocation: there is a parking lot", "rating": 4, "date": "2009-02-11"}, {"excerpts": ["Biscuits, mashed pataters n gravy, and friend chicken all make for a solid, inexpensive meal. ", "I come here once a month or so when I'm doing some grocery shopping at Safeway. ", "I know it's not good for me ", "but it's nice to eat some greasy but tasty food every now and then. ", "Highly recommend this place. ", "The cool thing is that you get more options in terms of fried meats. "], "author": "Tushar K.", "review": "I love ghetto food. Biscuits, mashed pataters n gravy, and friend chicken all make for a solid, inexpensive meal. I come here once a month or so when I'm doing some grocery shopping at Safeway. I know it's not good for me but it's nice to eat some greasy but tasty food every now and then. Highly recommend this place. The cool thing is that you get more options in terms of fried meats. Unlike KFC, you also have some seafood options.\n\nIf it weren't so unhealthy, I'd give it 5 stars. \n\nExpected bill: $6", "rating": 4, "date": "2010-05-31"}, {"excerpts": ["but I think I like the honey biscuits from Church's better.\n\n"], "author": "Rick P.", "review": "What would be better for dinner after a nice Dim Sum luncheon with some fellow Yelpers than some greasy fried chicken!  LOL!  This is only my second time trying Popeye's and at this location.  I'd say definitely better than KFC but I like Church's better.  The cajun mash potatoes weren't bad but didn't like their coleslaw much...prefer KFC's coleslaw.  The biscuit was good but I think I like the honey biscuits from Church's better.\n\nAs far as the location...kinda sketchy...noticed a few questionable people hanging around the Safeway parking lot of the complex where this Popeye's was located.  Advice: park close, order quick, hurry home.", "rating": 2, "date": "2008-03-02"}, {"excerpts": ["Biscuits!  ", "Fast food, but yet, different from the other fast food", "You get a lot of food for a very low price, and it's comfort food - who doesn't love biscuits?!  "], "author": "Laura W.", "review": "There isn't much of a restaurant selection in my immediate area, so when I'm in a rush I often have to chose between Burger King, Subway, and Panda Express.  Sad, I know...\n\nAnyway, today I was in a rush and somehow couldn't stand to eat at any of these places again... and then my roommie suggested Popeye's.  Chicken!  Biscuits!  Fast food, but yet, different from the other fast food... so we went for it!\n\nLocated around the corner from Fillmore Street, hidden in Safeway's parking lot, the sidewalk and surrounding area was dirty - but I'm used to that from going grocery shopping there, anyway.  The place itself was clean and not even too sketchy.\n\nService was a little slow, but at least the workers seemed very friendly and relaxed, making sure to get everyone's orders right.  The food was definitely higher quality than regular fast food.  You get a lot of food for a very low price, and it's comfort food - who doesn't love biscuits?!  I especially like the fries - much better than any of its fast food competitors.\n\nAfter finishing the meal, I actually had resolved to give Popeye's 4 stars.  That is a very high rating for a fast food place in my view.  However, a few minutes later I noticed the roof of my mouth was still filmy... how mysterious!  Was it from the juicy crunchy chicken skin, loaded with preservatives?  Perhaps from the chemical \"buttery\" biscuit?  I'm not sure, but it definitely changed my pleasant experience into a slighty disturbing one... a filmy mouth is one thing - I just hope my arteries are still in tact :(", "rating": 3, "date": "2007-10-09"}, {"excerpts": ["My next pit stop after I walk out the door of his office is just across the Safeway grocery store's parking lot - the only Popeye's Chicken & Biscuits restaurant that is somewhat near downtown (granted, JapanTown is no hop and a jump from downtown - especially with all the characters who ride the MUNI 38 and 38L buses). "], "author": "Jamie W.", "review": "First, I need to apologize to my doctor. Yes, I tell him, I am working on eating better. Yes, I tell him, I'm especially trying to stay away from fatty foods.\n\nMy next pit stop after I walk out the door of his office is just across the Safeway grocery store's parking lot - the only Popeye's Chicken & Biscuits restaurant that is somewhat near downtown (granted, JapanTown is no hop and a jump from downtown - especially with all the characters who ride the MUNI 38 and 38L buses). Sorry doc, but I just cannot resist that once in a blue moon chance to get some of Popeyes crispy, spicy (just mildly) fried chicken and that lovely tasting cajun rice.\n\nThis location has easy parking (thanks to the grocery store parking lot). The help inside is hit or miss - but it isn't about the help at fast food joints for me - not really. They have a bag with the goods in my hands within 5 minutes, and that's what I'm there for.\n\nYou may need to hurdle over a vagrant or dope head while visiting this Popeyes, but the food is well worth it if you enjoy good 'ole southern fried chicken. Yes, it is greasy. Yes, it is about as fatty as it gets. Just remember that this stuff is only meant to be enjoyed once every few months - not daily or even weekly.  I'm glad I don't live near Japantown to test my willpower on that point.\n\n5 - stars totally based on the good tasting food and quick turnaround. Everything else about this location is average or worse.\n\nEnjoy! And definitely give the cajun rice a try!", "rating": 5, "date": "2006-08-28"}, {"excerpts": ["To hell with the Chicken and biscuits! \n\n"], "author": "Clarissa S.", "review": "To hell with the Chicken and biscuits! \n\nIt's all about the mashed potatoes. Those luscious lumpy potatoes coupled with nondescript meat based cajun gravy are good enough to make me ignore the fact that there are people blatantly dealing drugs outside of the establishment and the fact that I am always heckled by a homeless person on my way in and out of this location.", "rating": 5, "date": "2008-01-12"}, {"excerpts": ["When you have a sign up saying that for $8 you can purchase 2 large sides & 4 biscuits with ANY meal, know that I know ANY means I can pick a 2 piece combo & order this.  ", "HOWEVER, these IDIOTS try to convince me that you have to order this with one of the large 10+ piece meals...just because you've decided to tape this to a 10 piece chicken meal sign doesn't make it so, Tonto!!!   ", "After a 10 minute argument about the definition of the word \"any\", I say screw it & place the rest of my order; once I get home, I see that they haven't given me my soda or one of my sides.  ", "I went back as usual the following Tuesday, at which time they gave me what they missed on the previous occasion but managed to forget my red beans & rice...", "wth?!  ", "I again didn't realize this until I got home; I called the store & let them know, & the Filipino manager told me that I could pick it up the next time that I came in.   ", "Fast forward to today - Arthur, the lil Mario Brother-looking so-called manager, tells me that he can't honor my request because he didn't know anything about it...yet ANOTHER phone call to customer service...", "we'll see what lame azz excuse Henry ", "(I'm assuming the owner?) comes up with for his sorry azz employees this go-around...", "every time I come here, at least 1 customer has an issue with something they've managed to jack up; say it with me..."], "author": "Amoura B.", "review": "This location SUCKS...the employees are IDIOTS...\n\nLet me help you morons out -English is my FIRST language.  When you have a sign up saying that for $8 you can purchase 2 large sides & 4 biscuits with ANY meal, know that I know ANY means I can pick a 2 piece combo & order this.  HOWEVER, these IDIOTS try to convince me that you have to order this with one of the large 10+ piece meals...just because you've decided to tape this to a 10 piece chicken meal sign doesn't make it so, Tonto!!!   After a 10 minute argument about the definition of the word \"any\", I say screw it & place the rest of my order; once I get home, I see that they haven't given me my soda or one of my sides.  I went back as usual the following Tuesday, at which time they gave me what they missed on the previous occasion but managed to forget my red beans & rice...wth?!  I again didn't realize this until I got home; I called the store & let them know, & the Filipino manager told me that I could pick it up the next time that I came in.   Fast forward to today - Arthur, the lil Mario Brother-looking so-called manager, tells me that he can't honor my request because he didn't know anything about it...yet ANOTHER phone call to customer service...we'll see what lame azz excuse Henry (I'm assuming the owner?) comes up with for his sorry azz employees this go-around...every time I come here, at least 1 customer has an issue with something they've managed to jack up; say it with me...it's not us, it's YOU!!!\n\nShould you crave Popeye's, go to the one on Divisadero or the Geneva...more expensive, but way less hassle involved with what's supposed to be FAST food...", "rating": 1, "date": "2010-03-30"}, {"excerpts": ["yet...biscuits dry...dirty rice good", ".....mashed pototoes ", "watery.....", "coleslaw creamy.....go for the gold...", "golden fried chicken...."], "author": "Hen A.", "review": "thick battered...crispy fried chicken....always best in the shadiest of neghborhoods....panhandler by the door.....check.....popeye's chicken...grubbin' fried chicken....yet...biscuits dry...dirty rice good.....mashed pototoes watery.....coleslaw creamy.....go for the gold...golden fried chicken....", "rating": 4, "date": "2007-05-13"}, {"excerpts": ["Minus one star for changing their biscuits from the cone-shaped ones years back which were a lot crispier."], "author": "Kim K.", "review": "There is a God.  This place makes the BEST fried chicken, despite the fact that it is fast food.  Sure, the area is a little shady, but the easy parking and awesome gravy clearly make up for it.  Minus one star for changing their biscuits from the cone-shaped ones years back which were a lot crispier.", "rating": 4, "date": "2007-10-11"}, {"excerpts": ["And the cole slaw is good for $1.69 and the biscuits are 69 cents each.  ", "Two of  us for dinner ", "less than $7....choices are spicy and mild."], "author": "Brian L.", "review": "Can you say 99 cents for a drumstick and thigh?  What a deal!  And the cole slaw is good for $1.69 and the biscuits are 69 cents each.  Two of  us for dinner less than $7....choices are spicy and mild.", "rating": 3, "date": "2009-07-16"}], "mashed potatoes with cajun gravy": [{"excerpts": ["Some of the items I ordered were:\n- Cajun Fries (Small)\n- Mashed Potatoes with Cajun Gravy (Small)\n\n"], "author": "Bennett W.", "review": "It was lunch time when I walked by and had felt the need to get something to eat.\n\nSome of the items I ordered were:\n- Cajun Fries (Small)\n- Mashed Potatoes with Cajun Gravy (Small)\n\nThe staff members here are pleasant and friendly. Plus, the service here is actually very good. I am so into visiting Popeyes for fried chicken cravings. They make fried chicken that is tender, delicious and crispy with little to no grease. Overall, good experience here so I am definitely coming in again for fried chicken.", "rating": 4, "date": "2015-10-21"}], "mac and cheese": [{"excerpts": ["Word of caution though: if you come late, chances are they may be out of the Mac and cheese or any of their other more popular sides. "], "author": "Tracy T.", "review": "I don't care what anyone says, I love Popeyes biscuits and their popcorn shrimp!!! So what if it's filled with trans fat, nor organic, and greasy, it's all kinds of delicious! And sure, it's not the cleanest (but hey, they seem to pass inspection!), but who am I to judge, especially when I'm craving a buttery biscuit!!\n\nI like coming to this location specifically because there's a big parking lot, so I don't have to circle around attempting to find parking. Service is relatively fast, but hey, you get what you pay for!\n\nWord of caution though: if you come late, chances are they may be out of the Mac and cheese or any of their other more popular sides. But otherwise, it's a solid meal at a solid price in my book.\n\nLikes:\n-fast service\n-good options \n\nDislikes:\n-runs out of sides sometimes \n-not the cleanest location", "rating": 4, "date": "2016-12-12"}, {"excerpts": ["But minus that same star for being out of mac and cheese. ", "Boo!"], "author": "Elena N.", "review": "Got a 2 piece fried chicken meal with a breast and a thigh with mashed potatoes and a biscuit for about $5. I can't beat that! Honestly I used to love kfc until they changed their oil. Now their chicken is bland. But I love popeyes spicy fried chicken. The skin is crispy and has a slight kick. Yum!\n\nOur cashier was super nice and quick so I would have probably given this location 4 stars, but minus 1 star cuz the place is a little sketchy. I felt slightly uncomfortable walking in. Parking is super easy as it's in the safeway shopping center so they almost got the star back. But minus that same star for being out of mac and cheese. Boo!", "rating": 3, "date": "2013-04-10"}, {"excerpts": ["I ordered the 3pc chicken strips with mac and cheese, biscuit and drink - but I didn't want the drink cause I had my boba, so he gave me an extra biscuit instead. ", "Turns out they were \"sold out\" of mac and cheese. ", "Cause that happens right? ", "You just sell out of sides at a fast food restaurant ", "-____- ", "then he points to the pictures of all the sides and draws invisible x", "'s on the greens beans and some other side..."], "author": "Lydia L.", "review": "I don't normally (or ever) eat fast food but it was a fat day. I walked in with a large tapioca drink in my hand and the cashier looked like he wanted to kill himself. It was about 8:45pm and it was a ghost town. \n\nI ordered the 3pc chicken strips with mac and cheese, biscuit and drink - but I didn't want the drink cause I had my boba, so he gave me an extra biscuit instead. Turns out they were \"sold out\" of mac and cheese. Cause that happens right? You just sell out of sides at a fast food restaurant -____- then he points to the pictures of all the sides and draws invisible x's on the greens beans and some other side...then circles 3 other ones that were available. \n\nI am dying laughing at his descriptive technique! I went with the mashed potatoes and WOW....biggest let down ever!! It tasted like what I would imagine cat food to taste like. It was like thanksgiving flavored gerber with salt and pepper on top lol \n\nRequested spicy strips and they were nothing of the sort - delicious, but not spicy. The biscuits drizzled with honey were on point.", "rating": 2, "date": "2013-02-26"}], "french fries": [], "cajun rice": [{"excerpts": ["I do have to take away one star though, because while I was eating my food, several customers tried to order items like cajun rice and jambalaya only to be told that Popeye's was out of them. "], "author": "Ravi S.", "review": "Last Thursday night, I was running late to a show at The Fillmore, so I wanted to have a quick dinner. Popeye's was just a block away from the venue, so I decided to check it out. \n\nPopeye's is definitely my favorite fast food fried chicken place (over KFC and Church's). Popeye's at its freshest is 5 stars. However, many locations can be hit or miss. I happened to have a great experience at this location, but I noticed that other customers were not as happy with their experiences. \n\nI ordered the 5 piece chicken tender dinner (spicy, of course) with fries and a biscuit. They made the chicken tenders to order, and they happened to be making a fresh batch of fries when I placed my order. Needless to say, my meal was outstanding. The chicken strips were crisp and spicy, and the chicken was really juicy. The fries were actually crisp (generally they tend to get soggy after a pretty short amount of time). The buffalo bayou sauce, which is really just Louisiana hot sauce, was the perfect dipping sauce for the chicken. \n\nI do have to take away one star though, because while I was eating my food, several customers tried to order items like cajun rice and jambalaya only to be told that Popeye's was out of them. It was only 7:30, and they stay open until 10, so I would be kind of annoyed if I had wanted to order one of those items. \n\nOverall, I'd recommend this Popeye's location. It's certainly better than Subway or Panda Express.", "rating": 4, "date": "2015-04-25"}, {"excerpts": ["I love this cajun fried chicken, the cajun rice and corn.\n\n"], "author": "Kenneth G.", "review": "I just wish there were more in the area!  I love this cajun fried chicken, the cajun rice and corn.\n\nThis location always has a line out the door, but well worth the wait!", "rating": 5, "date": "2013-03-09"}, {"excerpts": ["Out of mash potatoes and out of Cajun rice.!!! ", "No acceptable !!!! ", "It's only 840 pm!!"], "author": "Wesley W.", "review": "Here on Tuesday special. Out of mash potatoes and out of Cajun rice.!!! No acceptable !!!! It's only 840 pm!!", "rating": 1, "date": "2014-09-30"}, {"excerpts": ["purveyor of super-cheap two-pieces-for-$1.29 specials on Tuesdays ... provider of awesome cajun rice and rice and beans ... ", "the sole fast food joint which it is acceptable, nay, desirable! ", "to have in my neighborhood ... better than your average fast food, for sure, and the perfect hangover remedy when you're too broke to go to the ribs joint. ", "Popeye's, don't ever change."], "author": "David K.", "review": "Oh, Popeye's ... namesake of the Popeye's Gulch neighborhood of San Francisco (don't you DARE call it 'Nopa'!) ... purveyor of super-cheap two-pieces-for-$1.29 specials on Tuesdays ... provider of awesome cajun rice and rice and beans ... the sole fast food joint which it is acceptable, nay, desirable! to have in my neighborhood ... better than your average fast food, for sure, and the perfect hangover remedy when you're too broke to go to the ribs joint. Popeye's, don't ever change.", "rating": 4, "date": "2011-10-28"}, {"excerpts": ["Sorry doc, but I just cannot resist that once in a blue moon chance to get some of Popeyes crispy, spicy (just mildly) fried chicken and that lovely tasting cajun rice.\n\n", "And definitely give the cajun rice a try!"], "author": "Jamie W.", "review": "First, I need to apologize to my doctor. Yes, I tell him, I am working on eating better. Yes, I tell him, I'm especially trying to stay away from fatty foods.\n\nMy next pit stop after I walk out the door of his office is just across the Safeway grocery store's parking lot - the only Popeye's Chicken & Biscuits restaurant that is somewhat near downtown (granted, JapanTown is no hop and a jump from downtown - especially with all the characters who ride the MUNI 38 and 38L buses). Sorry doc, but I just cannot resist that once in a blue moon chance to get some of Popeyes crispy, spicy (just mildly) fried chicken and that lovely tasting cajun rice.\n\nThis location has easy parking (thanks to the grocery store parking lot). The help inside is hit or miss - but it isn't about the help at fast food joints for me - not really. They have a bag with the goods in my hands within 5 minutes, and that's what I'm there for.\n\nYou may need to hurdle over a vagrant or dope head while visiting this Popeyes, but the food is well worth it if you enjoy good 'ole southern fried chicken. Yes, it is greasy. Yes, it is about as fatty as it gets. Just remember that this stuff is only meant to be enjoyed once every few months - not daily or even weekly.  I'm glad I don't live near Japantown to test my willpower on that point.\n\n5 - stars totally based on the good tasting food and quick turnaround. Everything else about this location is average or worse.\n\nEnjoy! And definitely give the cajun rice a try!", "rating": 5, "date": "2006-08-28"}], "red beans and rice": [{"excerpts": ["List of mistakes from a recent visit:\n- mac & cheese was VERY watery and overcooked - like baby food,\n- the Cajun dirty rice was not mixed well, with clumps of seasonings,\n- a large order of red beans and rice didn't have enough rice,\n- they forgot a side order of cole slaw but gave me Cajun fries instead,\n- the fried chicken tasted "], "author": "Luis C.", "review": "This could probably be the worst location out of the 4 Popeye's stores in SF, although it has plenty of foot traffic being next to a Safeway. I think they have problems retaining staff, and the new staff receives poor training.\n\nService at the register was friendly and efficient when I visited, but lately the baggers don't know what they're doing and the kitchen staff needs better training because food preparation and consistency are subpar. This place used to be so much better in the past.\n\nList of mistakes from a recent visit:\n- mac & cheese was VERY watery and overcooked - like baby food,\n- the Cajun dirty rice was not mixed well, with clumps of seasonings,\n- a large order of red beans and rice didn't have enough rice,\n- they forgot a side order of cole slaw but gave me Cajun fries instead,\n- the fried chicken tasted okay, but half of the box was wrong - incorrect chicken pieces from what I had ordered.\n\nThe one nice feature is the free Safeway's large parking lot.", "rating": 2, "date": "2010-05-28"}, {"excerpts": ["I love it so much that I would eat their red beans and rice out of a horse trough for my last meal on death row.  "], "author": "Gabriel S.", "review": "It's a goddamned shame that I have to write this because I love Popeyes.  I love it so much that I would eat their red beans and rice out of a horse trough for my last meal on death row.  But I'd rather be the janitor at Power Exchange than go to this location even though it's only a few blocks away from my home.\n\n1.  The store is so trashed that they even have graffiti on the cash register\n2.  The service is SLOW.  When you are 6 people deep in line and it takes a full 35 minutes for you to get one small order there's something wrong\n3.  Last time I went I waited in line for 20 minutes only to find out that they had run out of EVERYTHING except for cole slaw and chicken thighs.  Literally ran out of 90% of the items on their menu by 6pm... \n\nPlaces like this are why stereotypes exist.", "rating": 1, "date": "2012-03-29"}, {"excerpts": ["Red beans and rice aren't bad either.\n\n"], "author": "Sus... B.", "review": "For a quick fix of fatty fried goodness, the chicken biscuit sandwich for $1.50 and a side of small fries works wonders.\n\nThe batter is flavorful and I haven't detected a whole lot of mystery chicken-related material, only meat and batter.  Since KFC went and changed their biscuit recipe, the biscuit at Popeye's wins over KFC's hands down.   The cajun fries are flavorful and have just the right amount of kick.  Red beans and rice aren't bad either.\n\nAs far as complaints about the customers go, once you enter the door it's all about the chicken.  I've never experienced any weirdness here, people are generally very polite and no one has ever been rude.  Since that's all I care about when getting food, I couldn't care less about any extracurricular pharmaceutical sales going down at the plaza or in the parking lot, much less anyone who asks me for money (even if they're standing right outside as this tactic makes it far less likely that I'll give them any).  \n\nThe only reason I'm giving 3 stars as opposed to four is due to the slow service.  For whatever reason, it takes a really long time to get your food at this location.   If I were in a big hurry, I'd probably head to Burger King or even Safeway before getting something here.  However, the wait is usually worth it if you're not on a deadline.", "rating": 3, "date": "2008-11-08"}, {"excerpts": ["They have sides such as mashed potatoes, red beans and rice, fries, and mac & cheese. "], "author": "Catherine O.", "review": "I don't care what all of you say, 4 stars for ultimate junky greasy fake to the max food. Yes it was fulfilling, yes I felt like a pig afterwards, but hey we only live once right? \n\nI think this is my new spot, sorry KFC..I think I found a new love. They had a special of 10 pieces for $9.99 which was a deal, since normally 8 pieces is $11-12. Spicy or regular? Heck yeah, I spiced it up! To my surprise it really wasn't that spicy. They have sides such as mashed potatoes, red beans and rice, fries, and mac & cheese. I decided I had a craving for mac & cheese...fake as can be, but yummy! \n\nService wasn't bad. Walked in, and got help right away. I was thankful since we initially ordered the 8 piece, but he pointed out the 10 piece was cheaper. Yay! \n\nAs for the place itself, probably not the place to eat. I dont even remember there really even being a spot to eat at. Not the cleanliest  or nicest neck of the woods. I suggest take out! \n\nWell 4 peaces later,  I was pretty satisfied & full. Oh, popeyes you now hold a place in my heart for my junk food melt downs!\n\nAND p.s. yes i did say \"4 peaces\"...it was peaceful ok? :)", "rating": 4, "date": "2008-02-28"}, {"excerpts": ["I lived near here and came on occasion for some good spicy chicken and red beans and rice.  ", "The food and service was fine.  ", "The one consistent problem I noticed here are crazy customers!   ", "Here is just one example ", "- A lady dining in was yapping away complaining about this and that at the top of her lungs.  ", "After another lady got her order she scolded the complaining lady and told her to shut up and walked out the door.   ", "Then when the guy in front of me ordered, he commended the cashier for working here and having to deal with this kind of stuff every day.  "], "author": "J M.", "review": "I lived near here and came on occasion for some good spicy chicken and red beans and rice.  The food and service was fine.  The one consistent problem I noticed here are crazy customers!   Here is just one example - A lady dining in was yapping away complaining about this and that at the top of her lungs.  After another lady got her order she scolded the complaining lady and told her to shut up and walked out the door.   Then when the guy in front of me ordered, he commended the cashier for working here and having to deal with this kind of stuff every day.  The cashiers eyes just glazed ahead.\n\nUpdate:  So here we are 7 years later.  I've been back a handful of times and it's practically guaranteed something interesting will occur.  My last few visits featured customers arguing with the staff about how they want their food as if this was a restaurant and there's a cook in the back ready to prepare their meals as requested.  Funny stuff and the food is still decent so I'm increasing my review to 3 stars.", "rating": 3, "date": "2008-02-24"}, {"excerpts": ["Best Red Beans and Rice!!!!  ", "The chicken is ok....way better than mine ...but I am working really hard at that....but the Red Beans and Rice are wonderful! ", "My new comfort food...", "oh..and the bisquits."], "author": "Nancy P.", "review": "Best Red Beans and Rice!!!!  The chicken is ok....way better than mine ...but I am working really hard at that....but the Red Beans and Rice are wonderful! My new comfort food...oh..and the bisquits.", "rating": 5, "date": "2008-01-03"}], "green beans": [{"excerpts": ["And all the sides they offer, such as the green beans (which has it's own special sign) they were out of! ", "They weren't even busy and yet they managed to screw up my order! ", "This is the kind of establishment that Madea would drive her car through ", "& I hope the staff is replaced soon. ", "I don't know what kind of jobs they should have - but it's not in face-to-face interaction with customers. ", "If you receive bad service, speak up, complain to corporate - ignite change. ", "I know it's just Popeye's ", "but if it is JUST Popeye's how difficult can fast-food fried chicken be? ", "These employees don't need a degree, but they do need basic customer service skills!"], "author": "Jules F.", "review": "There's a Popeye's on Divisadero & it proves a 5-star restaurant compared to this dump and the poor attitude of it's employees! I waited 15 minutes for chicken & asked what the deal was. \"Mo\" the female clerk that rang me up just looked at me clueless, she couldn't even tell me what was going on with my order. Her manager \"Robert\" wasn't much help either. Their attitude was like they hadn't done anything wrong. They just got very defensive. And all the sides they offer, such as the green beans (which has it's own special sign) they were out of! They weren't even busy and yet they managed to screw up my order! This is the kind of establishment that Madea would drive her car through & I hope the staff is replaced soon. I don't know what kind of jobs they should have - but it's not in face-to-face interaction with customers. If you receive bad service, speak up, complain to corporate - ignite change. I know it's just Popeye's but if it is JUST Popeye's how difficult can fast-food fried chicken be? These employees don't need a degree, but they do need basic customer service skills!", "rating": 1, "date": "2013-10-23"}], "corn": [{"excerpts": ["I love this cajun fried chicken, the cajun rice and corn.\n\n"], "author": "Kenneth G.", "review": "I just wish there were more in the area!  I love this cajun fried chicken, the cajun rice and corn.\n\nThis location always has a line out the door, but well worth the wait!", "rating": 5, "date": "2013-03-09"}, {"excerpts": ["empty boxes filled with chicken bones and corn cobs sat on the 1 table beside the counter seating the entire hour we were there. ", "but it's so busy that the staff likely doesn't get a second to step from behind the counter to throw away the trash"], "author": "Melissa N.", "review": "what can you say except that sometimes the heart wants what the heart wants and the heart wants fried chicken?\n\nand not that bougie stuff at $18 for 2 pieces SF restaurants likes to do-- scribblin' designs on your plate with gravy. if you're going to add gravy to my plate it better be the molten lava to my mashed potato volcano. \n\nanyway, so KFC was a bust the last time i went (never again) so of course we had to make our way to good 'ol reliable popeyes. and it was tuesday. 2 pieces for $1.29. there is a consistent line on tuesdays bc of the special. this place is small with about 7 seats and without a doubt, dirty. empty boxes filled with chicken bones and corn cobs sat on the 1 table beside the counter seating the entire hour we were there. but it's so busy that the staff likely doesn't get a second to step from behind the counter to throw away the trash/clean the tables, so i guess i'll give them that.\n\njust take your food to go and enjoy your fried chicken and yummy biscuits.", "rating": 3, "date": "2012-09-28"}], "jalapeno pepper": [], "pecan pie": [], "mud cake pie": [], "fried hot apple cinnamon pie": [], "piece chicken strips with biscuit": [], "piece chicken strips combo": [], "piece chicken strips dinner": [], "piece chicken strips dinner combo": [], "piece chicken strips with biscuit combo": [], "piece chicken strips with  biscuits": [], "piece party order with  biscuits": []}