{"can soda": [], "oz bottle soda": [], "giant chicken tenders": [], "mozzarella cheese sticks": [], "create your own sandwich": [], "primo salad": [], "primo special pizza": [], "fog city special pizza": [], "chicken primo pizza": [], "bbq special pizza": [], "primo meatball pizza": [], "veggie special pizza": [], "meat eaters pizza": [], "la margarita pizza": [], "primo buffalo special pizza": [], "chicken gourmet pizza": [], "veggie gourmet pizza": [], "ny cheesecake": [], "berry cheesecake": [], "milkshake": [{"excerpts": ["At exactly 11:12pm I ordered a pizza and milkshake (don't judge). ", "The man who answered the phone said that the milkshake machine was \"down\". ", "This wasn't surprising as for the past year or so, anytime I ordered a shake later in the evening it was either \"down\" or they \"ran out of ice cream\" or some silly excuse covering the fact that they shut it down early and weren't going to clean it again. ", "Fine, pizza it is. ", "He then tells me that they're not delivering this late either. ", "I said that I've ordered there plenty of times this same time of night and it's never been a problem before, to which he has a long winded excuse as to why they just couldn't tonight ending with \"sorry, you'll have to pick it up\". ", "Fine, it's a block away, I'll come pick it up. ", "He calls me back at 11:36pm to tell me that I need to come and pick up my pizza now cause they're going to close in five minutes. ", "Now, I'm a 40yr self employed professional and having orders barked at me has never been easy to swallow, not to mention I'm very aware that they're open till midnight. ", "I asked if their hours have changed and he confirmed they hadn't. ", "I told him I was on my way and would be there in a minute. ", "Before I get my second shoe on, another call from Primo; a younger more aggressive person telling me I need to come and get my food now. ", "When asked for his manager, the original man who called before gets back on the phone and just confirmed that he would cancel my order if I wasn't there soon. ", "I then asked for the name of the store manager and/or owner, to which I got some very muffled responses and only after repeatedly asking for the name did I get an official \"Dave\"! ", "When I asked for his name I got some more muffled responses and after asking three times he barks \"Tommy\" (due to his strong Indian accent, I highly doubt this was his name). ", "I asked for the name of the young man who passed the phone to him and he hands the phone over to someone (assuming the younger guy) and I hear \"he wants your name\" right before the phone hangs up! ", "Service at ", "it's finest, "], "author": "Ryan A.", "review": "Before shedding light on the horrible service that they are so great at, I would like to say that I have lived in the neighborhood for nearly ten years and I was very much a fan when they opened a few years back. The staff was friendly and the food was good, everything you'd expect from a neighborhood pizza joint and since I'm an advocate for supporting neighborhood/local businesses you could find me there weekly. It was when the evening staff had changed a while back that I started to notice some serious changes in service. Not sure if that was the reason, I can only assume. If you care to learn the dirty little details read on. Short if it is horrible service and mediocre food. The long narrative is in hopes that the owners will read this and do something about it.\n\nThey market that they're open late, midnight on the weekdays and 3am on weekends (according to friends and neighbors, this is likely the only reason they're still in business at all). At exactly 11:12pm I ordered a pizza and milkshake (don't judge). The man who answered the phone said that the milkshake machine was \"down\". This wasn't surprising as for the past year or so, anytime I ordered a shake later in the evening it was either \"down\" or they \"ran out of ice cream\" or some silly excuse covering the fact that they shut it down early and weren't going to clean it again. Fine, pizza it is. He then tells me that they're not delivering this late either. I said that I've ordered there plenty of times this same time of night and it's never been a problem before, to which he has a long winded excuse as to why they just couldn't tonight ending with \"sorry, you'll have to pick it up\". Fine, it's a block away, I'll come pick it up. He calls me back at 11:36pm to tell me that I need to come and pick up my pizza now cause they're going to close in five minutes. Now, I'm a 40yr self employed professional and having orders barked at me has never been easy to swallow, not to mention I'm very aware that they're open till midnight. I asked if their hours have changed and he confirmed they hadn't. I told him I was on my way and would be there in a minute. Before I get my second shoe on, another call from Primo; a younger more aggressive person telling me I need to come and get my food now. When asked for his manager, the original man who called before gets back on the phone and just confirmed that he would cancel my order if I wasn't there soon. I then asked for the name of the store manager and/or owner, to which I got some very muffled responses and only after repeatedly asking for the name did I get an official \"Dave\"! When I asked for his name I got some more muffled responses and after asking three times he barks \"Tommy\" (due to his strong Indian accent, I highly doubt this was his name). I asked for the name of the young man who passed the phone to him and he hands the phone over to someone (assuming the younger guy) and I hear \"he wants your name\" right before the phone hangs up! Service at it's finest, right? \n\nAs a business owner I pride myself on stellar customer service and also expect it from businesses that I support. I don't have high standards for a neighborhood pizza joint but they took a minimal expectation, and stomped it out with the hanging up of their phone. To the owners of the SF location of Primo Pizza, you might want to cross reference any drops in revenue/sales with the hire dates of your employees; I'm sure there'd be a connection. As for me, no need to send me any coupons. I won't be returning.", "rating": 1, "date": "2017-10-10"}, {"excerpts": ["Milkshake was luke warm. ", "Mozzarella sticks were soggy and cheese was a solid block. ", "I couldn't drown the pizza in enough ranch to make it edible and ended up throwing it all away."], "author": "Kevin B.", "review": "The worst pizza I have had in the city. The driver some how ended up at a completely different location which made the total delivery time around an hour and 45 minutes. Food was ice cold. Milkshake was luke warm. Mozzarella sticks were soggy and cheese was a solid block. I couldn't drown the pizza in enough ranch to make it edible and ended up throwing it all away.", "rating": 1, "date": "2017-02-04"}, {"excerpts": ["I ordered chicken strips, a slice of cheesecake, and a chocolate milkshake for my friend. \n\n", "The chicken strips were overcooked, the cheesecake was pre-packaged (yes, in a plastic sleeve....imagine if Hostess made cheesecake), and the milkshake was melted and thin. \n\n"], "author": "Lily K.", "review": "As a college student, restaurants that deliver decent food during late hours for affordable prices are one of the greatest little things in life to appreciate. When I found Primo Pizza on Eat24, I was pleasantly surprised by the amount of options this place had, and for good prices! I ordered chicken strips, a slice of cheesecake, and a chocolate milkshake for my friend. \n\nFast forward two hours, when the food finally decided to arrive. Yes, it took them 2 hours to deliver my order. I didn't order anything complicated, not to mention the fact that I live 3 miles away from Primo. \n\nThe chicken strips were overcooked, the cheesecake was pre-packaged (yes, in a plastic sleeve....imagine if Hostess made cheesecake), and the milkshake was melted and thin. \n\nI would rather spend double the amount of money than to ever order from this place again. They took forever, and the food was nowhere near being worth the wait.", "rating": 1, "date": "2015-01-15"}, {"excerpts": ["Food was soggy and undercooked when it arrived and my milkshake was completely melted. ", "Overall pretty gross."], "author": "Joshua K.", "review": "Despite being only a 5 min drive from my house delivery took close to two hours! Food was soggy and undercooked when it arrived and my milkshake was completely melted. Overall pretty gross.", "rating": 1, "date": "2014-11-15"}], "cookie pizza": [{"excerpts": ["On the high note, that cookie pizza is one to kill for , YES."], "author": "Jalisa B.", "review": "I've been meaning to write this rave review. These people rock!!!!!  The pizza I will never get enough of it's so wonderful!!!  The dough is truly homemade with love and the sauce and cheese sheer perfection. Let me put it this way, I have ordered from this place more than 10x and consistently i have only ordered the cheese pizza , I have yet to try anything else! My only suggestion and hope is that there milkshakes get better, sometimes they are thick and then other times they are milky/liquidity.  On the high note, that cookie pizza is one to kill for , YES.", "rating": 5, "date": "2015-11-03"}], "ben  jerry pint ice cream": []}