{"house made onion rings": [{"excerpts": ["Then the house made onion rings which was the star of the night. ", "Not too greasy and not to thick where one bite is all onion.. "], "author": "Mias R.", "review": "Came here mid-week,. 3 hours before first pitch and the place was jumping . Its open seating so keep on the balls of your feet! Was lucky to find a table quickly, but expect to wait 10-20 minutes if you come on a game day. \n\nStarted with the Chipotle buffalo wings plenty flavorful and solid. Then the house made onion rings which was the star of the night. Not too greasy and not to thick where one bite is all onion.. Our waiter was attentive, genuine and was knowledgable about the entire menu. \n\nCool atmosphere before games, reasonable prices, the wait may be the only qualm. I will look to come back on a non game-day for their happy hour.", "rating": 4, "date": "2015-05-18"}], "public house chipotle buffalo wings ranch": [], "mini corn dogs honey mustard": [], "garlic parmesan pretzel sticks": [], "mijita nachos jack poblanos beans salsa guacamole": [], "meat  cheese board": [], "crispy cauliflower": [{"excerpts": ["We also went with a $6 order of the Crispy Cauliflower with Sweet Pepper Relish, which was a pretty healthy choice for a bar bite (photo: http://bit.ly/2t0UJvO). ", "The vibe was still the same since it first opened, still an extravaganza of flatscreen TVs in a warehouse-size space with a lot of loud youngsters. ", "Regardless, I'd still come back for the Impossible Burger. "], "author": "Ed U.", "review": "So have you heard about the Impossible Burger? Well, Jamie W. read about it and thought we should try it here since we are on a continual quest to eat healthier. Sure, we've had veggie burgers before, some really good ones like the Black Bean Chipotle Veggie Burger at the Garden Grill up in Guerneville (photo: http://bit.ly/2sn9ifr) and our personal favorite, the Butterbean Burger at the Boiler Room Oyster Bar in Kinston, North Carolina (photo: http://bit.ly/2sAkJAS). So we were intrigued enough by this all-plant variation that we ordered a couple of the $14 ones they served here where our previous dining experiences involved jalapeno poppers, deviled eggs, their regular PH burger, and oh yeah, beer on tap to facilitate the guzzling of such cholesterol-infested grub.\n\nWell, apparently there is no cholesterol in an Impossible Burger nor antibiotics nor meat of any kind. What gives the burger its meaty flavor is heme, which is the non-protein, insoluble, iron protoporphyrin constituent of hemoglobin. Say what? I just copy-pasted that from an online medical dictionary, but that's what makes the patty look, smell, sizzle, bleed, and taste like a regular burger (photo: http://bit.ly/2rgs1pq). And amazingly it did. I was dumbfounded how a vegan burger could taste so carnivorous, but it did even if beef purists likely balk at the notion. It came with provolone melted on top with caramelized onions and a smoke & spice sauce to give it even more of a barbecue flavor (photo: http://bit.ly/2szkciw). Hell, I liked it.\n\nBut it's not a perfect substitute since it has five times the sodium and more saturated fats than a regular burger. It's also about the same number of calories in case you are counting, about 220 calories for the patty itself. Give us credit though since we did add the $3 Mixed Greens as a side rather than the fries and ignored the free chips on our plates (photo: http://bit.ly/2rgljQn). We also went with a $6 order of the Crispy Cauliflower with Sweet Pepper Relish, which was a pretty healthy choice for a bar bite (photo: http://bit.ly/2t0UJvO). The vibe was still the same since it first opened, still an extravaganza of flatscreen TVs in a warehouse-size space with a lot of loud youngsters. Regardless, I'd still come back for the Impossible Burger. It was delish...and so good for me?\n\nFOOD - 4 stars...that Impossible Burger seems kinda impossible and a bit overpriced but the meatiness tastes real\nAMBIANCE - 2.5 stars...same loud, cavernous bar it's been since it opened \nSERVICE - 3 stars...perhaps tired from his shift, the first server seemed bored with us from the outset but the second was more enthusiastic\nTOTAL - 4 stars...definitely will come back for the Impossible Burger", "rating": 4, "date": "2017-06-13"}, {"excerpts": ["Started with the crispy cauliflower with raisins and capers.  ", "Sounded strange but was sooo delicious. ", "High recommend. ", "I had the chicken breast sandwich which was great also. ", "Very moist and the bread was super fresh. ", "Great selection of beers as well.  ", "Overall, yummy lunch.  ", "Very pleased."], "author": "Michelle P.", "review": "Was pleasantly surprised with the food we ordered.  Started with the crispy cauliflower with raisins and capers.  Sounded strange but was sooo delicious. High recommend. I had the chicken breast sandwich which was great also. Very moist and the bread was super fresh. Great selection of beers as well.  Overall, yummy lunch.  Very pleased.", "rating": 4, "date": "2014-01-25"}], "romaine": [{"excerpts": ["We shared the Vegetarian Nacho appetizer, the Romaine/Jicama/Radish/Cucumber/Cotija Cheese/Lime Vinaigrette salad and the Public House Burger.  ", "The service was FANTASTIC, the food was fresh, the game viewing was phenomenal and surprisingly we were able to watch the game and converse and eat at the same time.  ", "It was the closest thing to having a seat in the ballpark without having a seat at the ballpark.  ", "I would go back again anytime."], "author": "Maura S.", "review": "We went to Public House for Opening Day 4/13/2015 for lunch and Giants game watching.  It was GREAT!  There were two of us posted up at one of the bar tables.  Figured it would be too much of a zoo, but we got a table and had a great time.  We shared the Vegetarian Nacho appetizer, the Romaine/Jicama/Radish/Cucumber/Cotija Cheese/Lime Vinaigrette salad and the Public House Burger.  The service was FANTASTIC, the food was fresh, the game viewing was phenomenal and surprisingly we were able to watch the game and converse and eat at the same time.  It was the closest thing to having a seat in the ballpark without having a seat at the ballpark.  I would go back again anytime.", "rating": 3, "date": "2015-04-20"}, {"excerpts": ["My wife enjoyed the romaine salad with lemon-anchovy dressing ($7) and said the dressing was tangy.  ", "The house made chips ($3) were good, but cold and soggy in the center. "], "author": "Robert K.", "review": "So, we stopped by Public House before the Giant's game.  It was a good spot to grab a few beers and food before the game with some friends.  We started at the bar, and then sat at a table before heading into the game:\n\nBeer-4 stars\nThe beer selection is very good.  They have several beers on tap, as well as some unique bottled beers.  Between our party, we had a few Sierra Nevada Torpedoes ($7), a Stella ($6), two Chimays ($10), and a German Dunkel ($14).  The only reason I cannot give 5 stars is that everything was overpriced.  \n\nFood-3\nThe Italian sausage with peppers and onions ($12) was very flavorful.  My wife enjoyed the romaine salad with lemon-anchovy dressing ($7) and said the dressing was tangy.  The house made chips ($3) were good, but cold and soggy in the center. Expected them to be hot.\n\nService-2\nOur table server was a four.  He was friendly, attentive, and helped explain some of the more unique beers on the menu.  The bartender, however, needs an attitude check.  There are two bars in the restaurant, and apparently they do not have the same beers on tap (yet  the menu does not specify).  The Sierra Nevada Torpedo was on tap at a different bar.  When we first ordered a beer, the bartender went over to the other bar to grab the beer.  However, when another member of our party ordered the Torpedo, the bartender rolled his eyes and said if we wanted that beer we needed to order it from the other bar.  Really?  Not only was her rude, but perhaps PH shouldn't put beers on their menu if you cannot order them.  OK, I am off my soapbox.  Other than that, the service was fine.\n\nDecor-3\nThere are plenty of seats and tables to enjoy a drink and a snack before the game.", "rating": 3, "date": "2010-08-16"}, {"excerpts": ["My most recent was the pulled pork sliders and romaine salad with anchovy vinaigrette. ", "The pork was DRY. ", "The salad dressing was SALTY. ", "2 stars. "], "author": "Bib G.", "review": "An improvement over ACME in terms of convenience. Casual is better than upscale when just dropping in for a beer and a snack. \n\nThe beer selection is good - many good local micros on tap, several Belgians in bottles, and even a few Belgian-style micros on tap. Big plus for a selection of (2) beers from the cask. \n\nMy food experience has been going downhill steadily. My first meal - andouille sausage - was a winner. I was thinking 4 stars based on the food/beer. My next meal was the cheese steak sandwich. Huge disappointment, especially after the hype on the menu. 3 stars. My most recent was the pulled pork sliders and romaine salad with anchovy vinaigrette. The pork was DRY. The salad dressing was SALTY. 2 stars. Come on Public House, you're losing me, fast. \n\nAnother problem is the price. With 2 beers, and a simple meal, my bill came to about $45 with tax and tip. That's going to make it tough for me to keep coming back. Maybe coupons for locals?", "rating": 2, "date": "2010-04-24"}], "iceberg wedge": [{"excerpts": ["i had the iceberg wedge salad with mac and cheese and my friends had a burger, fries, onion rings, and sliders. ", "everything was really tasty. ", "the mac and cheese was creamy but not too sludgy thick "], "author": "laura f.", "review": "you know i have to say, i was kinda impressed.\n\nwe went on a tuesday night when the giants were away - so i'm wondering if that has something to do with it.\n\nthe double bars were quite impressive - and on game days i bet they make sense. but anyway.\n\nservice was attentive and really good on suggesting beer and food.\n\ni had the iceberg wedge salad with mac and cheese and my friends had a burger, fries, onion rings, and sliders. everything was really tasty. the mac and cheese was creamy but not too sludgy thick and my salad was HUGE.\n\nmy only complaint is the price - for these things plus a beer for each person our tab came to 75.00 pre tip. holy cow!", "rating": 4, "date": "2010-09-23"}], "crab louie": [], "pork belly potato skins": [], "spicy pulled pork sliders cabbage onion slaw": [], "public house burger bacon cheddar secret sauce": [], "grilled chicken breast avocado bacon blue cheese": [], "grilled portobello zucchini red pepper herb goat cheese": [], "cubano roasted pork loin niman ranch ham provolone": [], "california tri tip cheesesteak gouda poblanos onions": [], "lemon chicken pot pie seasonal vegetables mixed greens": [], "anchor steam battered fish  chips tartar sauce": [], "sauteed shrimp cheese grits collard greens": [], "smoked beef short ribs": [], "grilled flat iron steak french fries red wine jus": [], "beer steamed mussels sour ale fennel grilled bread": [], "ballpark brownie sundae": [{"excerpts": ["We also ended our meal with a Ballpark Brownie Sundae. ", "It was pretty good, but WAY too thick and rich. "], "author": "Theo T.", "review": "My company came here before a Giants game to relax and have some fun before we watched the game. This place is really fun, but you also have to take into consideration that it is a fast paced restaurant. You also have to go into this restaurant knowing that it is slightly upscale bar food. Don't come in here thinking that it is going to be quiet and 5 star food. It simply isn't. It's just a good fun time.\n\nI ended up ordering the Baked Mac and Cheese. It was rich, creamy, and a little bit too heavy, but it definitely hit the spot. It had the perfect blend of 3 different cheeses, but I wish there was some bacon on it too. I mean, if you are gonna order a heavy mac and cheese, you gotta just go ALL THE WAY. We also ended our meal with a Ballpark Brownie Sundae. It was pretty good, but WAY too thick and rich. The brownie was a little too hard for my liking, but overall wasn't too bad.\n\nWhenever I am going to the game, I will definitely be back here for a few drinks and some yummy bar food.", "rating": 4, "date": "2014-11-04"}, {"excerpts": ["Sweet Potato Fries\nand for dessert... the Ballpark Brownie Sundae, w/ Fluffer Nutter Ice Cream (Humphrey Slocombe), Chocolate Sauce, Kracker Jax. \n\n"], "author": "Rebekah T.", "review": "There are many things I miss when Baseball Season ends. I miss the players of course, getting all decked out in my Giants gear, the excitement of competition and going to the Ballpark. This is where I meet up with my folks and occasionally get to hang with the best bartender. \n\nPublic House is not only the cornerstone restaurant, it's also a beer lover's paradise. Because what goes better with Baseball, than a nice cold beer. You can get a Racer 5 for $6.00, which is like 2-for-1 when it comes to the beer prices inside the park. \n\nThese are a few of my favorite brews of the many they have on tap and in bottles. Why go for the average beer when you can try something new, delicious and with a high APV%. \n\nDraft Beers: \n* BEAR REPUBLIC RACER 5 IPA * 7.0% Healdsburg, CA\n* SIERRA NEVADA TORPEDO EXTRA IPA * 7.2% * Chico, CA\nBottles:\n* SAISON DUPONT * 6.5% * Belgium \n* ALLAGASH CURIEUX * 11.0% * Pórtland, Maine \n* WESTMALLE TRIPEL * 9.5% * Belgium \n* HITACHINO NEST WHITE * 7.5% * Japan \n\nIf you want a little spin on the traditional Irish Coffee, try the Cafe Granada, with Flor de Cana Rum, Coffee, Brown Sugar Whipped Cream. It's really great and unique. Great for those cold San Francisco nights. \n\nOther than that the food is delicious, I try something new each time. So far, I've had the:\n*Housemade Jalapeño Poppers, Tomatillo Salsa \n*Hand Battered Mini Corn Dogs, Spicy Mustard Dip\n*Mac-n-Cheese: Mozzarella, Proovolone, Gruyere, Jack Cheeses topped with Mimmolette\n*Public House Burger, Bacon, Avocado, Cheddar \n*California Cheese Steak, Tri-Tip, Smoked Gouda, Roasted Poblano Peppers, Caramelized Onions\n* Pressed Cubano Sandwich, Roasted Pork, Niman Ham, Provolone, Gruyere, Pickles\n*Sweet Potato Fries\nand for dessert... the Ballpark Brownie Sundae, w/ Fluffer Nutter Ice Cream (Humphrey Slocombe), Chocolate Sauce, Kracker Jax. \n\nI absolutely love the Public House and will try and come back off season. This is a fun place to watch the game, drink quality beers and eat amazing bar food. See you soon!", "rating": 5, "date": "2011-10-04"}], "butterscotch pudding cream cookie crumbles": [], "humphrey slocombe ice cream sandwiches": [], "public house cracker jax": [], "ancho caramel": [], "tahitian vanilla": [{"excerpts": ["*Secret Breakfast and Tahitian Vanilla craving- fulfilled. \n\n"], "author": "S Y.", "review": "Okaaay, I cannot tell a lie. I only came here to use their nice and clean bathroom after drinks somewhere else. They welcomed me to do so. \n\n*Very friendly staff! \n\nExtensive menu of drinks and I spotted Humphry Slocombe ice cream (http://www.yelp.com/biz/humphry-slocombe-ice-cream-san-francisco). This bathroom trip has now turned into a dessert trip. \n\n*Secret Breakfast and Tahitian Vanilla craving- fulfilled. \n\nI tried Acme Chophouse when it was here once. But I think I liked it. I heard Public House is affiliated- something to look into. I'll be baaack! \n\nP.S. GOOOO GIANTS! =)", "rating": 3, "date": "2010-11-06"}, {"excerpts": ["Everyone had a scoop of their ice cream: peanut butter, Tahitian vanilla and salted choc (this one was the best for me). \n", "I tried the 'adult root beer float\".  ", "The server comp this dessert for me because they didn't get the order right until she fixed it.  ", "It's a small amt of beer poured over a small scoop of vanilla ice cream.  ", "Kind of a rip off given the sm quantity, it's less than 1/2 the size of a root beer you'd get at any A&W.  ", "It tasted odd until you mixed up the beer into the ice cream and turned it into a shake.  ", "I wouldn't order it again and no one at the table liked it after a taste.\n"], "author": "Ry T.", "review": "3.5 stars.\nEveryone liked this place.  Quite casual and spacious.  There's a bar with a huge selection of beer on tap. We ate in the dining area facing the open kitchen and tried the following:\n1. iron skirt steak - Hubby liked it a lot, I thought it was OK.  Tasted like any other steak to me.  Had beans with it. \n2. Onion rings - thin slices but I thought the batter was soggy at times.  Wouldn't order again. (should've read your review beforehand, Genevieve Y.!)\n3. Fries - came in a cone and were really good when hot, but at the bottom, got hard and crunchy.\n4. Wedge salad - very good and tasty, would order again. Came as a 1/2 of a small lettuce sliced into 2 wedges.\n5. Pork sliders - shredded pork in 3 tiny buns. Tasty if you're interested in lighter fares. \n6.  BFF had their potato soup. I had a taste, rather bland to me.\n\nDesserts - can skip this next time.\nEveryone had a scoop of their ice cream: peanut butter, Tahitian vanilla and salted choc (this one was the best for me). \nI tried the 'adult root beer float\".  The server comp this dessert for me because they didn't get the order right until she fixed it.  It's a small amt of beer poured over a small scoop of vanilla ice cream.  Kind of a rip off given the sm quantity, it's less than 1/2 the size of a root beer you'd get at any A&W.  It tasted odd until you mixed up the beer into the ice cream and turned it into a shake.  I wouldn't order it again and no one at the table liked it after a taste.\nOur server was really sweet and that water glass was constantly being filled. \n\nThis is probably going to be our to go place the next time we're in the AT&T park area for a Cirque du Soleil show again.", "rating": 3, "date": "2011-11-26"}, {"excerpts": ["Philly Cheese Steak, wings, buttermilk onion rings, fries, cinnamon sugar cookie, Tahitian vanilla ice cream, pulled pork sliders, mac 'n' cheese, and raspberry lemonade (with vodka), \n", "The wife had crab cake sliders and deviled eggs, and more of the lemonade than I did. "], "author": "Ramon V.", "review": "I was lucky enough to get an invite to the preview of Public House. \nHere is my review: \n\nFirst of all, it was all free! So, yes, I did make a pig of myself. \n\nI had: Philly Cheese Steak, wings, buttermilk onion rings, fries, cinnamon sugar cookie, Tahitian vanilla ice cream, pulled pork sliders, mac 'n' cheese, and raspberry lemonade (with vodka), \nThe wife had crab cake sliders and deviled eggs, and more of the lemonade than I did. She also helped me with the wings and rings. \n\nThe Philly was pretty good. I sent the first one back, because they put some kind of sauce on it, and that is just wrong. It was almost as good as the one I used to get at Momo's, and nothing like what you'd get in Philadelphia. I will get one again. \n\nThe pulled pork sliders were OK. They were missing something. BBQ sauce, maybe? \n\nThe wings were very tasty, but the wife felt they could have been cooked a little bit more.   I would order again.\n\nThe fries were mediocre, at best, and went half-eaten. \nThe onion rings were very good. Can't go wrong with buttermilk.  I will definitely get them again.\n\nThe mac 'n' cheese was very good. Not as good as the mac 'n' cheese at Mustard's, but less expensive, too. Wife was a little put off by the bright orange cheese on top.   Another item I would buy again.\n\nThe wife enjoyed her food, especially the crab cake sliders. \n\nThe cookie was good, but not really worth $2.00. The ice cream was excellent. \n\nOur server (Stephani) was very friendly and helpful.\n\nYou can sit almost anywhere and see at least one TV, as they are everywhere.  \nYoung, friendly good-looking staff.\nReasonable prices, good food, good service.\n\nYay!", "rating": 4, "date": "2010-03-27"}, {"excerpts": ["We had the Tahitian vanilla and the butterscotch pudding (which was yummy but super creamy and thick).\n\n"], "author": "Cynthia C.", "review": "Nice place to get together with friends to watch the game on their nice tv screens and have a drink. They also have food on their menu but we already ate when we got here. \n\nWe did order some drinks and desserts. They carry ice cream from one of the popular ice cream shops in SF (Humphrey B?). We had the Tahitian vanilla and the butterscotch pudding (which was yummy but super creamy and thick).\n\nIt's in my hood so prolly will be back again.", "rating": 3, "date": "2010-09-25"}], "seasonal sorbet": [], "buttermilk waffle maple syrup": [], "seasonal frittata mixed greens": [], "poached eggs cheesy grits chorizo salsa": []}