{"fried crab meat rangoon": [{"excerpts": ["the Fried Crab Meat Rangoon is a pretty safe bet. ", "The potstickers, while less fried, are a pretty tasty deal. "], "author": "Galen M.", "review": "I wasn't going to write a review of Red Jade because I have already given up on this place and am not looking to ruin anybody's business. But it would not be in the true spirit of Yelp to only write good reviews, which I am guilty of usually doing. Plus all the positive reviews of Red Jade really started to get me riled up.\n\nLet me first state that due to the close proximity to my residence I have been to Red Jade more than a handful of times, mostly as take-out. If you are looking for something fried, greasy and sure to make your left side go numb the Fried Crab Meat Rangoon is a pretty safe bet. The potstickers, while less fried, are a pretty tasty deal. That, however, is about all that is remotely decent on the menu.\n\nThe soups are inedible with chunks of meat and veggies that are obviously (fresh) out of the freezer. You know, the type of chinese food where all the ingredients seem to be water-logged from de-thawing.\n\nEvery entree I have ordered has been as disappointing as a Jack Shepherd 'Lost' episode. If you order something crispy it will be soggy. If you order veggies they will be covered in glutenous goo. Not like this description is different from any other cheap chinese restaurant, it's just that Red Jade delivers the cheap and the chinese without the guilty payoff at the end.\n\nIn short, don't let the interior design fool you: Red Jade is no better than the buffet-style dim sum joints scattered about San Francisco. The only difference being that Red Jade tries to pretend it is something it is not, a fine dinning establishment, at twice the price.", "rating": 2, "date": "2009-02-23"}, {"excerpts": ["Then the Fried Crab Meat Rangoon, as well as the Pot Stickers. ", "The Combination Plate Appetizers is amazing too if you want to share with others. ", "My favorites on the entree menu are Walnut Prawns With Honey Dew Melon, House Eggplant Special, Peking Duck Special (order first thing), Original Dry Fried Chicken and any scallop dish. ", "I like all the different Fun plates as well ", "but they're pretty fattening if you're on a diet. ", "Most of the other entree-type items are good but of course I haven't tried them all yet. ", "Also I would advise that you go to this place during the week if you can because weekends are fairly crowded and the kitchen can't always keep up with the demand. ", "I really enjoy this place for sure, and recommend it to all my family and friends. ", "I hope you like it too."], "author": "Tony G.", "review": "As you all know there are hundreds of chinese restaurants in San Francisco so we are fortunate in this respect. But I have to say that I enjoy Red Jade more than most. First of all I like the way this place looks, how I'm treated by the wait staff and of course the food. I would say though as a preface to this review, there are some items on the menu that I've tried and not especially liked. I'm not sure if this is my own preferences or what. Anyway these are my favorite dishes at Red Jade for sure. Try the Green Onion Pancake. It's the best I've ever had. Then the Fried Crab Meat Rangoon, as well as the Pot Stickers. The Combination Plate Appetizers is amazing too if you want to share with others. My favorites on the entree menu are Walnut Prawns With Honey Dew Melon, House Eggplant Special, Peking Duck Special (order first thing), Original Dry Fried Chicken and any scallop dish. I like all the different Fun plates as well but they're pretty fattening if you're on a diet. Most of the other entree-type items are good but of course I haven't tried them all yet. Also I would advise that you go to this place during the week if you can because weekends are fairly crowded and the kitchen can't always keep up with the demand. I really enjoy this place for sure, and recommend it to all my family and friends. I hope you like it too.", "rating": 4, "date": "2010-01-18"}], "fried prawns": [{"excerpts": ["We got chow mein , pork fried rice , fried prawns , pork ribs , beef broccoli and orange chicken.. ", "Didn't care for orange chicken very dry meat and you had to add the sauce but over all good eats."], "author": "Rebecca T.", "review": "My family and I were staying the weekend in San Francisco and we were near market so I yelped Chinese food and this place came up good reviews so we ordered came very quickly and very hot only thing we asked for 5 forks we got 2 and no plates we were staying in a hotel so we had to go them. We got chow mein , pork fried rice , fried prawns , pork ribs , beef broccoli and orange chicken.. Didn't care for orange chicken very dry meat and you had to add the sauce but over all good eats.", "rating": 4, "date": "2015-04-25"}, {"excerpts": ["The stir-fried prawns with Jade greens more green then Jade-not to sound like Gorge but four prawns!!! "], "author": "swys -.", "review": "Check please... \n\nThat's the last time I take culinary  advice from a Muni driver.  \n\nI was really hoping this place was going to get me out of my crummy Sf Chinese mall food experience I have had as of late. Hey don't hate - I did read the Fortune Cookie Chronicles there's some truth to my statement. \n\nOK, the place was packed for lunch and it was your blue collar crowd which implies large portion at a good value. The service was good even though they got my order wrong: I wanted String beans not braised beans and the crispy tofu not so crispy. The stir-fried prawns with Jade greens more green then Jade-not to sound like Gorge but four prawns!!! I did like their salt and paper pork which was juicy and plentiful and this is one of my favorite dishes and Red Jade's menu still has plenty of classics that I'm willing to try. \n\nI guess still in a Chinese funk for now.", "rating": 3, "date": "2009-05-20"}], "vegetarian egg rolls": [{"excerpts": ["She got the Hunan fish and the vegetarian egg rolls. ", "Our order total was a little over $17, including tax. ", "Delivery was prompt and way faster than the 30 minutes quoted over the phone.  ", "I was also pleasantly surprised to find, in addition to the two fortune cookies, two sesame balls. ", "Apparently if you order over $15 in food they include a free dessert. ", "Yay dessert!\n", "I didn't care for the soup that came with the meal, egg-drop-corn-something-gross kind of texture-soup of the day.  ", "My meal was okay, not memorable but fresh and plentiful. ", "It was cheap and there was enough food to last another meal. ", "Which I am going to now eat for dinner", ", cuz I'm thrifty like that."], "author": "Jill D.", "review": "I'd like to err on the 3 1/2 star side but I'm rounding up because there were a lot of factors that made this a 4 star-ish review.\nMy roomie recommended that I try this place with her as she found they were a great value and had fast delivery and decent food. I chose to order from the lunch menu and had a rice plate (which comes with soup) consisting of brown rice and salmon with asparagus in black bean sauce.  She got the Hunan fish and the vegetarian egg rolls. Our order total was a little over $17, including tax. Delivery was prompt and way faster than the 30 minutes quoted over the phone.  I was also pleasantly surprised to find, in addition to the two fortune cookies, two sesame balls. Apparently if you order over $15 in food they include a free dessert. Yay dessert!\nI didn't care for the soup that came with the meal, egg-drop-corn-something-gross kind of texture-soup of the day.  My meal was okay, not memorable but fresh and plentiful. It was cheap and there was enough food to last another meal. Which I am going to now eat for dinner, cuz I'm thrifty like that.", "rating": 4, "date": "2008-09-11"}, {"excerpts": ["The fried crab rangoon was about as good as anywhere else, as were the vegetarian egg rolls. ", "The wok-fried beef fillet with snow peas was ok - the meat was decent, not too stringy. ", "The kung pao chicken is average as is the General Tso's spicy boneless chicken. ", "The steamed tofu with combination seafood was like Ma Po tofu or like Korean soon-doobu. ", "The beef fried rice is actually pretty good - it might be my favorite dish here. ", "I liked the beef chow fun ", "ok too, but I thought there was too much beef (I know, strange complaint). ", "The ratio was a little off. "], "author": "Christine P.", "review": "-Update-\n\nThe Roommate, the Roommate's Boyfriend, the Boyfriend and a Friend and I were starving but we didn't want to leave the house as we had just busted open Ticket to Ride (we're big games people). New food recommendations: the lettuce wraps are good. Nice, fresh lettuce and taste-full chicken. The dry-fried chicken wings are also tasty but they're very saucy so get ready to lick your fingers.\n\n-End of Update-\n\nThe Boyfriend introduced me to Red Jade after his protestations of Chow's Kitchen (which I found three-stars-acceptable). I was pleased to discover that the food is a step above Chow's but still three stars because it's not San Tung. The fried crab rangoon was about as good as anywhere else, as were the vegetarian egg rolls. The wok-fried beef fillet with snow peas was ok - the meat was decent, not too stringy. The kung pao chicken is average as is the General Tso's spicy boneless chicken. The steamed tofu with combination seafood was like Ma Po tofu or like Korean soon-doobu. The beef fried rice is actually pretty good - it might be my favorite dish here. I liked the beef chow fun ok too, but I thought there was too much beef (I know, strange complaint). The ratio was a little off. I do like how they give you free sesame balls/BBQ pork buns with your delivery order. There's a minimum $15 delivery charge and they're pretty fast - I'd say about 30-45 minutes, depending on where you live. You can order online, which I love, too.", "rating": 3, "date": "2009-10-27"}], "bbq pork": [{"excerpts": ["I really enjoy the sizzling rice and seafood soup, BBQ pork fried rice, fried chicken wings, and cream cheese fried dumplings. \n", "What do you know, everything I like is fried.\n", "I don't recommend the seafood birds nest. \n", "They don't make a noodle basket like most places, instead it's some sort of dough paper basket. ", "Odd and not fulfilling. \n", "What really sets this place apart is that with everyone of my take out orders are 2 steam BBQ Pork Buns, Sesame Balls, and Fortune cookies. \n", "It's like a little dim sum dessert of awesomeness with every meal. \n", "Most Chinese restaurants are not this generous. \n", "Check it out!"], "author": "Charlie L.", "review": "This is my go to place for Chinese Take Out. \nStandard Chinese Restaurant that's quick, clean, and hits the spot. \nI really enjoy the sizzling rice and seafood soup, BBQ pork fried rice, fried chicken wings, and cream cheese fried dumplings. \nWhat do you know, everything I like is fried.\nI don't recommend the seafood birds nest. \nThey don't make a noodle basket like most places, instead it's some sort of dough paper basket. Odd and not fulfilling. \nWhat really sets this place apart is that with everyone of my take out orders are 2 steam BBQ Pork Buns, Sesame Balls, and Fortune cookies. \nIt's like a little dim sum dessert of awesomeness with every meal. \nMost Chinese restaurants are not this generous. \nCheck it out!", "rating": 4, "date": "2014-12-03"}, {"excerpts": ["Ordered delivery service - no charge for delivery fee and comes with free sesame balls, bbq pork buns and fortune cookies! ", "Hostess who took my order was patient and gave a reliable time estimate (much appreciated given how impatient / rude so many SF eateries are!) ", "Food was hot upon arrival and very affordable for large portions. ", "Definitely will be ordering from here again!"], "author": "Taryn Q.", "review": "Ordered delivery service - no charge for delivery fee and comes with free sesame balls, bbq pork buns and fortune cookies! Hostess who took my order was patient and gave a reliable time estimate (much appreciated given how impatient / rude so many SF eateries are!) Food was hot upon arrival and very affordable for large portions. Definitely will be ordering from here again!", "rating": 5, "date": "2016-03-14"}, {"excerpts": ["BBQ pork buns", ": This was a pleasant surprise! ", "We knew we would get the free sesame balls, but the buns were an added bonus! "], "author": "Jenna H.", "review": "3.5 Stars but I'll round up for free food! Ordered delivery through Eat24 and I was semi-pleasantly surprised. Quoted time was 45-60min and they were definitely within that window. Driver was friendly enough and they packed up forks/chopsticks/napkins/etc.\n\nWHAT WE ORDERED:\n~Fried Crab Meat Rangoon (6pcs for $6.25): For the love of god I do not know why this has a \"what's good\" mark on Eat24. I've never had rangoons, but my coworker ordered this for her appetizer. It tasted like cream cheese and green onion in a fried wonton skin. Granted it was tasty with the sweet and sour dipping sauce, however for being called CRAB MEAT rangoon there was ZERO crab meat except for flecks of red which is assumed was artificial crab meat. Call it deep fried cream cheese & green onion rangoon and you got yourself a winner! Crab meat rangoon-- complete and utter fail. However, I blame the people of Eat24 who gave this a \"what's good\" ranking. (2/5)\n\n~Mango Special with Chicken ($9.95): For being a \"Special\" there was nothing special about it. First time having cooked hot mango in a dish, and I'm not sure how I feel about it. Again this was a coworker's choice.(2/5)\n\n~Green Onion Pancake ($5.25): Yum. A bit dense, a bit greasy, but still very tasty. (4/5)\n\n~Tomato Beef Chow Mein ($7.25): OH. MY. GOD. A place that does a good tomato beef chow mein AND lists it on the menu?! I frequently order this with my family when we want chinese take out on the weekends for lunch, and our usual go-to is inconsistent. (We noticed they make it better on the weekdays--must be different chefs) I digress. ANYWAYS, I was pleasantly surprised how well this turned out. (5/5)\n\n~Sesame Balls (Free with order over $15): They gave us 3. Taste better eating them fresh rather than hours later. Nothing special, but it's free!\n\n~Steamed BBQ pork buns: This was a pleasant surprise! We knew we would get the free sesame balls, but the buns were an added bonus! Standard steamed cha siu bao.\n\nDefinitely would order the tomato beef chow mein again to see if they are consistently good.", "rating": 4, "date": "2014-10-28"}, {"excerpts": ["And they threw in a bunch of free stuff, as is routinely mentioned - the two big bbq pork buns and some sesame balls. "], "author": "Lisa K.", "review": "The delivery was easy, prompt, and pleasant, which is more than I can say for many delivery options I've dealt with. And they threw in a bunch of free stuff, as is routinely mentioned - the two big bbq pork buns and some sesame balls. But the food was just ok. \n\nPart of the problem was that we order the lemon chicken, which was fried. By the time it got to us, it was lukewarm and starting to get soggy. The string beans and bean curd faired a lot better, although I found the dish to be on the bland side. We probably enjoyed the appetizer combination the best - a hearty assortment of 2 each of chicken wings, potstickers, egg rolls, and crab rangoon. They were all pretty tasty.\n\nI wouldn't rule it out for delivery again, but we'll probably continue our quest for Decent Chinese Delivery.", "rating": 3, "date": "2011-10-31"}, {"excerpts": ["Thank you for the freebie BBQ pork buns, fortune cookies, and sesame balls.\n\n"], "author": "Amy C.", "review": "Dear Red Jade Delivery Guy,\n\nThank you for the easy online ordering. \n\nThank you for being at my door just 30 min. later.\n\nThank you for not running away screaming when you saw sickly me in my scruffy robe and nappy hair.\n\nThank you for bringing me the \"Yee\" Wor Wonton with Fresh Chicken Soup.  The wontons were nicely filled with shrimp and pork, I liked the veggies sprinkled throughout, the broth was soothing, and the portion size was generous.\n\nThank you for bringing me my favorite Green Onion Pancake.  Its crisp, savory, slightly greasy doughiness always makes me feel better.\n\nThank you for the $15 minimum delivery requirement because it gave me an excuse to order more.\n\nThank you for the Fire-House Spicy String Beans with Minced Pork and Rice that I will eat for dinner.\n\nThank you for the freebie BBQ pork buns, fortune cookies, and sesame balls.\n\nThank you for giving me sustenance to take a nap and watch back episodes of The Daily Show.\n\nBut mostly, thank you for NOT putting multiple sets of utensils in the big bag of food that I ordered just for me.  \n\nYou da man!\n\nxoxo\nAmy C.", "rating": 4, "date": "2010-01-05"}, {"excerpts": ["This dish had very little flavor, the shrimp were frozen at one time, the BBQ Pork was of decent quality, but I don't think any of this would have mattered if it had actually been seasoned correctly.  "], "author": "Jason B.", "review": "Ugh, I know my food and this was bad.  I order delivery.  Got the Appetizer Sampler, with the Crab Rangoons, Potstickers, Eggrolls, and Fried Chicken Wings.  I think they advertised the wings as hot/spicy, it was not.  The sampler was bland, the Rangoons could have been initially frozen, they were definitely not made fresh, chicken had no flavor, the eggrolls were fine and the potstickers were just not good at all.  I also order the Singapore Style Rice Noodles.  I am a huge fan of this dish in general, so when it's poorly made I get really pissed.  We pay money to have a place like this make good food, why is it that so many places service horrible food?  This dish had very little flavor, the shrimp were frozen at one time, the BBQ Pork was of decent quality, but I don't think any of this would have mattered if it had actually been seasoned correctly.  Will definitely never order from here again.  \n\nSuch a waste of money and it took about an hour and a half to get the food, so such a waste of time too.", "rating": 1, "date": "2012-08-02"}, {"excerpts": ["They are one of the few restaurants left that makes a mean Egg Foo Yung (BBQ pork variety is the best).  ", "Other good dishes include:  Hunan Beef, Spicy Salted Fish, Cashew Nut Chicken, and Green Onion Pancake.  "], "author": "Karen C.", "review": "We ate at Red Jade the first week they were open, having just moved to the neighborhood, and have been back regularly since.\n\nTheir potstickers are great.  They are one of the few restaurants left that makes a mean Egg Foo Yung (BBQ pork variety is the best).  Other good dishes include:  Hunan Beef, Spicy Salted Fish, Cashew Nut Chicken, and Green Onion Pancake.  We usually get out of there for $30 for two people, including appetizer, entrees, drinks, and tip.\n\nRed Jade may not offer The Most Amazing Cuisine On Earth, but the food is good, the restaurant is clean, and the staff is friendly!", "rating": 4, "date": "2010-12-21"}, {"excerpts": ["I enjoy the green onion pancakes, mongolian lamb, and the bbq pork buns / sesame balls that come free with my order!"], "author": "Madeline F.", "review": "Yum! \n\nMy favorite Chinese place to order delivery from.\n\nI enjoy the green onion pancakes, mongolian lamb, and the bbq pork buns / sesame balls that come free with my order!", "rating": 4, "date": "2010-04-13"}, {"excerpts": ["The only other perk to this is they gave me free BBQ Pork Buns and sesame ", "bun with this."], "author": "Helen V.", "review": "I would say the only thing I liked about this was the Crab Rangoon I ordered. \n\nThe Mongolian Beef was yucky. I tasted one bite and then threw it in the fridge to where I eventually just tossed it out.  \n\nThe chinese broccoli was wayyy to soggy for its own good. And the oyster sauce I requested with it was soo watered down that it didn't taste so great. \n\nThe only other perk to this is they gave me free BBQ Pork Buns and sesame bun with this.", "rating": 2, "date": "2009-11-13"}, {"excerpts": ["The BBQ pork dim sum ", "was good actually. ", "But I didn't really enjoy the food because of that beef."], "author": "Brandon R.", "review": "The sesame chicken and orange chicken were edible (maybe good), but wtf happened with the rest of the food. The mongolian beef tasted like absolute crap. The beef was definitely old (like leave out the steak in the sun smelly old). How the f do people give this place more than 2 maybe 3 stars. The bok choy beef also tasted the same. The BBQ pork dim sum was good actually. But I didn't really enjoy the food because of that beef.", "rating": 2, "date": "2011-10-22"}, {"excerpts": ["They even threw in some steamed buns with BBQ pork. ", "The food was hot and the chicken dishes were all white meat. ", "The price was great for quality of food and swiftness of delivery. ", "the only draw back was the General Chicken wasn't crispy anymore and the pieces stuck to your teeth. ", "But it's a delivery thing. ", "We will definitely order from here again."], "author": "Jena D.", "review": "We were feeling the need for a good dinner, but didn't want to leave the house, so out came the takeout folder. Red jade won with their prices and their lack of MSG on the menu, We had the Lemon Chicken, Steamed Rice, General Chicken, Pot Stickers, and Crab Rangoon. They told us about 40 minutes, but they showed up in under thirty. It was great. We opened to HUGE bag of food. BONUS! They even threw in some steamed buns with BBQ pork. The food was hot and the chicken dishes were all white meat. The price was great for quality of food and swiftness of delivery. the only draw back was the General Chicken wasn't crispy anymore and the pieces stuck to your teeth. But it's a delivery thing. We will definitely order from here again.", "rating": 4, "date": "2010-03-26"}, {"excerpts": ["I do like how they give you free sesame balls/BBQ pork buns with your delivery order. ", "There's a minimum $15 delivery charge and they're pretty fast - ", "I'd say about 30-45 minutes, depending on where you live. ", "You can order online, which I love, too."], "author": "Christine P.", "review": "-Update-\n\nThe Roommate, the Roommate's Boyfriend, the Boyfriend and a Friend and I were starving but we didn't want to leave the house as we had just busted open Ticket to Ride (we're big games people). New food recommendations: the lettuce wraps are good. Nice, fresh lettuce and taste-full chicken. The dry-fried chicken wings are also tasty but they're very saucy so get ready to lick your fingers.\n\n-End of Update-\n\nThe Boyfriend introduced me to Red Jade after his protestations of Chow's Kitchen (which I found three-stars-acceptable). I was pleased to discover that the food is a step above Chow's but still three stars because it's not San Tung. The fried crab rangoon was about as good as anywhere else, as were the vegetarian egg rolls. The wok-fried beef fillet with snow peas was ok - the meat was decent, not too stringy. The kung pao chicken is average as is the General Tso's spicy boneless chicken. The steamed tofu with combination seafood was like Ma Po tofu or like Korean soon-doobu. The beef fried rice is actually pretty good - it might be my favorite dish here. I liked the beef chow fun ok too, but I thought there was too much beef (I know, strange complaint). The ratio was a little off. I do like how they give you free sesame balls/BBQ pork buns with your delivery order. There's a minimum $15 delivery charge and they're pretty fast - I'd say about 30-45 minutes, depending on where you live. You can order online, which I love, too.", "rating": 3, "date": "2009-10-27"}, {"excerpts": ["In addition, we received free BBQ pork buns with our meal, and those were fairly good. \n\n"], "author": "Lisa H.", "review": "After moving to my current apartment, I found it necessary to immediately locate the nearest, most delicious Chinese restaurant that delivered. \n\nMy roommates and I are nearly connoisseurs of Chinese delivery food at this point, and have always managed to find something that suited us in each of our previous residences. I have to say, we were very disappointed. We ordered orange chicken, Mongolian beef, and the Hong Kong pan fried noodles with seafood. \n\nThe orange chicken was terrible. It came with the sauce on the side, so when I initially opened the chicken I noticed that it appeared as if it had been frozen and then thawed for this occasion. The sauce was thin, and tasted synthetic - almost like a citrus household cleaner. Honestly, you can get better frozen asian-style chicken from Trader Joe's. The beef was nothing to write home about - not terrible, but not good either. I've definitely had better before. The noodles seemed to be half pan fried. The top edges were crispy, but the bottom was soggy. There was no sauce or flavor to the dish. \n\nWhile the food was mostly lackluster, there were some upsides to the meal. The delivery service was right on time, and the food was hot. It was also very convenient to order online. In addition, we received free BBQ pork buns with our meal, and those were fairly good. \n\nOverall, I would say that there is definitely better Chinese food out there. It might just be that we happened to order the wrong dishes and missed the real gems at Red Jade. However, from my experience, I would say that you're better off eating elsewhere.", "rating": 2, "date": "2009-06-28"}, {"excerpts": ["pros: the kind of appetizers you are craving (bbq pork buns, egg rolls, scallion pancakes), brown rice, you can order from delivery.com (feels shady "], "author": "Kris P.", "review": "the epitome of \"meh\".\n\npros: the kind of appetizers you are craving (bbq pork buns, egg rolls, scallion pancakes), brown rice, you can order from delivery.com (feels shady but i didn't have a problem).\n\ncons: very low quality meat... makes the whole ordeal feel like a gastronomic mistake.", "rating": 2, "date": "2006-07-14"}], "house special dim sum for": [{"excerpts": ["The appetizers are worth a meal in themselves - the $3.95 Green Onion Pancake is flaky perfection, while the $5.95 House Special Dim Sum for Two is a nice treat without the burden of a Tourettes-screeching woman clanking by with a steam cart. ", "Best of all, they offer lunch specials that range between $4.50 and $5.95 that include soup and rice. ", "They even deliver the specials as long as you hit the $15.00 minimum.\r\n\r\n", "By the way, the restaurant itself is perfectly nice and worth visiting. ", "The service is fine, and I've yet to be there when the whole place has been crowded. ", "But, c'mon, free delivery...how can you beat that? ", "Plus you get those addictive fried sesame balls plus if you hit a $20.00 tab, free Bar-B-Q Pork Buns. ", "Enough said. \r\n\r\n", "FOOD - 4.5 stars...fresh and hot\r\n", "AMBIENCE - 4 stars...nice and wide-open and just a stone's throw from Market\r\nSERVICE - 5 stars...", "did I mention they deliver for free??\r\n", "OVERALL - 4.5 stars...getting my donor card now"], "author": "Ed U.", "review": "A dependable Hunan or Mandarin restaurant is worth giving up a kidney, and one that delivers makes me want to get a frequent organ donor card. And one that has great, fresh-tasting food can only mean one thing: a brain transplant.\r\n\r\nThat's why I am thrilled that a good friend of mine made me aware of Red Jade on Church. There are plenty of Chinese restaurants that deliver in my neck of SOMA, but they all seem to serve from the same vat of mystery brown sauce that covers all their food no matter what you order. Whatever it's made of, I believe it's the same ingredient that Ron Popeil uses in his spray-on hair aerosol can.\r\n\r\nRed Jade, on the other hand, serves fresh Mandarin cuisine superbly prepared. I can always tell how good a Chinese restaurant will be by their garlic chicken. I've been to one that actually deep fried their chicken like McNuggets and ladles some kind of goop with just a half-clove of garlic in it. At $6.95, Red Jade's is fresh with a light marinade but heavy on the garlic. I also like their tangy Fire House Spicy String Beans with Minced Pork ($6.95), heartier than your average veggie side, especially with all that meat.\r\n\r\nTheir $8.50 Lettuce Wraps are much better than what they serve at Long Life. The appetizers are worth a meal in themselves - the $3.95 Green Onion Pancake is flaky perfection, while the $5.95 House Special Dim Sum for Two is a nice treat without the burden of a Tourettes-screeching woman clanking by with a steam cart. Best of all, they offer lunch specials that range between $4.50 and $5.95 that include soup and rice. They even deliver the specials as long as you hit the $15.00 minimum.\r\n\r\nBy the way, the restaurant itself is perfectly nice and worth visiting. The service is fine, and I've yet to be there when the whole place has been crowded. But, c'mon, free delivery...how can you beat that? Plus you get those addictive fried sesame balls plus if you hit a $20.00 tab, free Bar-B-Q Pork Buns. Enough said. \r\n\r\nFOOD - 4.5 stars...fresh and hot\r\nAMBIENCE - 4 stars...nice and wide-open and just a stone's throw from Market\r\nSERVICE - 5 stars...did I mention they deliver for free??\r\nOVERALL - 4.5 stars...getting my donor card now", "rating": 4, "date": "2006-08-21"}], "combination plate for": [], "celery salad": [], "seaweed salad": [{"excerpts": ["delicious ginger pork filling in standard a pot sticker \nSeaweed Salad- standard Seaweed salad.  ", "May not be authentic, but it is tasty.\n", "Original Dry Fried ", "Chicken- fried chicken thighs that have been coated in a spicy red pepper sauce.  ", "Not what I expected, but I liked it!\n"], "author": "Nicole R.", "review": "Standard Mandarin Food in the Castro. The  restaurant is clean and the decor  is Chinese inspired.  The waitstaff is fast and efficient.\n\nFree Pot of hot tea!\nPot Stickers- delicious ginger pork filling in standard a pot sticker \nSeaweed Salad- standard Seaweed salad.  May not be authentic, but it is tasty.\nOriginal Dry Fried Chicken- fried chicken thighs that have been coated in a spicy red pepper sauce.  Not what I expected, but I liked it!\nFire House Spicy String Beans with Minced Pork-huge sting beans sauteed in red pepper and pork.  \nVegetarian Delight- Standard steamed and sauteed vegetable mix.  Good to get your daily serving of mixed vegetables.\n\nThe check came with fortune cookies and red bean sesame buns.  I love red bean buns!  And I love sesame buns!  I double love the  red bean sesame buns!!!\n\nEnough food to feed 4 or 5 and I left with boxes of left overs for about $50.  I will be coming back for takeout!", "rating": 4, "date": "2013-05-08"}], "steam bbq pork bun": [], "sesame ball": [{"excerpts": ["Basically specials under $9 that include soup, hot tea, a sesame ball, and fortune cookie! ", "And it's not like they only have a handful of lunch specials, ", "in fact, I think it's closer to 25-30 choices! "], "author": "Eric R.", "review": "\"Be kind to pigeons. A statue one day will be made of you\" - My Fortune Cookie Saying\n\nRed Jade has been my go-to Chinese restaurant since pre-Yelp! Yup over a decade of loyalty here! \nIs Red Jade the best ever? Nope. Yet if you combine quality + quantity + presentation = a happy customer! And why I keep returning.\n\nRed Jade is located on the corner of Church St. & Market St. On my latest visit, after a year hiatus, I enter remembering to go during lunch special time. Basically specials under $9 that include soup, hot tea, a sesame ball, and fortune cookie! And it's not like they only have a handful of lunch specials, in fact, I think it's closer to 25-30 choices! My favorites include the Lemon Chicken, General Tso's Chicken, Mongolian Beef, and Sweet & Sour Pork. \n\nOn my last visit I ordered the Lemon Chicken which includes freshly steamed broccoli, a bed of steamed rice, egg drop soup, and the extras I mentioned above. I have zero complaints here. I wouldn't exactly call the specials authentic as it's more targeting us Americans with huge appetites lol, but it really does hit the spot. More authentic dishes can be had on their very large menu offerings. For American me, the specials are just fine! And under $9! Oh baby! Keep the Hamilton! \n\nAll in all, I recommend Red Jade to all. Families or solo communist diners too. It's clean, furnished with care, hey it's a \"real\" restaurant that uses \"real\" dishes & table clothes! I've been coming here for over a decade and have always been treated with respect and taken care of, maybe it's my tattoo of Chairman Mao, but who really knows, eh?", "rating": 4, "date": "2018-07-11"}, {"excerpts": ["For ten bucks including tip you get most entrees with rice, soup and a sesame ball for dessert. "], "author": "Tim P.", "review": "The lunch special can't be beat. For ten bucks including tip you get most entrees with rice, soup and a sesame ball for dessert. My go to is the vegetarian delight! Yum! A plate full of veggies that are still crisp! The beef broccoli is consistently good as well. \n\nWarning to you chicken eaters: specify white meat. You'll get thigh meat if you don't.", "rating": 4, "date": "2017-08-13"}, {"excerpts": ["Love the bean paste-filled sesame ball at the end.\n\n"], "author": "Crabcakes C.", "review": "My go-to for good-quality, reasonable Chinese lunch. Always fresh vegetables and hearty portions. Soups are very good, too. Love the bean paste-filled sesame ball at the end.\n\nVery clean and excellent service. What more could you want?", "rating": 4, "date": "2017-05-27"}, {"excerpts": ["It's cheap, plenty of seating, and you get complimentary tea, fortune cookie, and sesame ball. ", "I like the lunch deals here. ", "It comes with the soup du jour, which is usually a sour and spicy or egg drop. ", "Both are delicious. ", "I enjoy the mapo tofu. ", "The general tso's chicken is okay if you like fried meat covered in a mysterious sauce. ", "The spicy eggplant and twice cooked pork is yummy. ", "The lunch specials come with a giant heap of rice. ", "I usually can't finish ", "so it's like 1.5 meals. ", "Food is fast and service is excellent. ", "No frills kind of place."], "author": "Jennifer W.", "review": "It's cheap, plenty of seating, and you get complimentary tea, fortune cookie, and sesame ball. I like the lunch deals here. It comes with the soup du jour, which is usually a sour and spicy or egg drop. Both are delicious. I enjoy the mapo tofu. The general tso's chicken is okay if you like fried meat covered in a mysterious sauce. The spicy eggplant and twice cooked pork is yummy. The lunch specials come with a giant heap of rice. I usually can't finish so it's like 1.5 meals. Food is fast and service is excellent. No frills kind of place.", "rating": 4, "date": "2015-04-09"}, {"excerpts": ["And the sesame ball at the end yay. \n", "Haters Laters!"], "author": "Styn V.", "review": "Loove. Compared to any other Chinese place, the chicken and beef dishes are effing Fabulous. Pot stickers too. And the sesame ball at the end yay. \nHaters Laters!", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["When I got my order, my coworker gave me Hot & Sour soup, my huge Onion pancake and a sesame ball. ", "The results? ", "Disappointed =(  ", "The soup was okay but a little too tart for me, onion pancake was too greasy ", "but I did eat 3 pieces of it and my tummy was feeling sick", ", my sesame ball was A-OK. ", "I won't be ordering from there anymore."], "author": "Kathy V.", "review": "So one of my coworkers asked me if I wanted to order lunch from Red Jade Restaurant. I never heard of the place, but I was willing to try it out. Of course I decided to Yelp it, so it seemed to me that they were well known for their Onion Pancakes. They had $5.00 lunch specials, which was cheap but I didn't feel like eating rice.\n\nWhen I got my order, my coworker gave me Hot & Sour soup, my huge Onion pancake and a sesame ball. The results? Disappointed =(  The soup was okay but a little too tart for me, onion pancake was too greasy but I did eat 3 pieces of it and my tummy was feeling sick, my sesame ball was A-OK. I won't be ordering from there anymore.", "rating": 2, "date": "2010-06-19"}, {"excerpts": [": I got soup, a pot of tea, General tso's chicken (with brown rice for a $0.25 up charge), a fortune cookie and a GREAT sesame ball.  "], "author": "Amy W.", "review": "So \"food quality\" gets 3 stars (A-okay) but overall bang for your buck brings it up to 4 stars.\n\nfor the lunch special: I got soup, a pot of tea, General tso's chicken (with brown rice for a $0.25 up charge), a fortune cookie and a GREAT sesame ball.  Total: including tax AND tip $7.50.  \n\nYou cannot beat that with a stick.  \n\nI do question how the food comes out about 2 minutes after you order it (pre-made?) AND the ratio of breading to chicken was higher than I would like.  Still though, that is a lot of food in a clean place with nice (and fast) servers. 4 solid stars.\n\nI wanna get that scallion pancake!", "rating": 4, "date": "2012-02-29"}, {"excerpts": ["Sesame Ball - very good\n\n"], "author": "Angela D.", "review": "Ordered:\n\nFire House Spicy String Beans with Minced Pork - so minced I didn't see them but the string beans were very good.\n\nChicken Chow Fun with Black Bean Sauce - normally my favorite dish at Chinese places but will never order this again here.  Noodles were all slimy.\n\nPot Stickers - only order if you like them soft.  Not crispy whatsoever.\n\nGreen Onion Pancake - very good\n\nSesame Ball - very good\n\nOverall, will never order from again as the city has too many better Chinese restaurants.", "rating": 3, "date": "2016-02-23"}, {"excerpts": ["I also find it strange that they give you sesame ball that isn't covered or anything. ", "It's like they just throw it in the take-out bag and when you finally find it, it looks like it was in there by accident."], "author": "Andrew D.", "review": "I've only ordered take-out so my review doesn't really cater to the dine-in experience.\n\nThe food is mediocre at best. I wouldn't say it's bland, but usually seems too saucy or greasy.\n\nI also find it strange that they give you sesame ball that isn't covered or anything. It's like they just throw it in the take-out bag and when you finally find it, it looks like it was in there by accident.", "rating": 3, "date": "2013-03-24"}, {"excerpts": ["Sesame ball surprise at the end for dessert and hot sake in my belly, not much more I need on a cold winter's night."], "author": "Jessica P.", "review": "I have to minus one star bc one of my friends thinks they got food poisoning from a shellfish dish here :(. My meal, however, was great. Quick service, friendly staff, water refilled and the plates that just kept on coming!\n\nWe had reservations for 5 people and were seated right away since thankfully it was not a busy night. I had to order the onion pancakes - which did not disappoint. A little on the greasy side, but thick and delicious. A friend and I split the crab rangoons bc that's just what you do if you're going to get Chinese, get the fried crap and share for less guilt.\n\nMy main meal was the lettuce wrap special. I really enjoyed them as my main course and for breakfast the next day! Great, hearty portions, and the chicken was well seasoned chunks, not ground up or barely recognizable.\n\nThere were a bevvy of different veggie dishes at our table and everyone seemed to lick their plates clean. Sesame ball surprise at the end for dessert and hot sake in my belly, not much more I need on a cold winter's night.", "rating": 4, "date": "2011-12-19"}, {"excerpts": ["I am not a fan of the sesame ball, but it was free! \n\n"], "author": "A I.", "review": "Having used Waiters on Wheels, what a pleasure this was. \n\nWait time: When I see 45-60 minutes, the cup half empty expects 60 minute, so I was pleasantly surprised when the door bell range at 45 minutes! \n\nFood: Chow fun was delicious, but not the charred taste, that would make it excellent. The egg plant was savory/sweet and cooked to perfection. The Peking duck was more like roast duck, but had light pancakes with them. The ma po tofu had large chunks of tofu in a savory sauce. I am not sure why I ordered the original chicken wings, but they were crispy and moist. \n\nFree food: The free pork buns were a nice touch. I love those things. It was an unexpected and appreciated addition. I am not a fan of the sesame ball, but it was free! \n\nThanks for a timely delivery!", "rating": 4, "date": "2011-07-24"}, {"excerpts": ["The little fried sesame ball filled with the sweet lotus paste was the perfect ending to a delicious meal.  ", "A bowl of complimentary egg flower soup preceded the meal.  ", "There was nothing special about the soup though just broth, eggs, some chopped green onion and lots of corn starch.  "], "author": "Wilhelm Y.", "review": "I noticed the restaurant's sign last week while riding a trolley to upper Market, and I'm not sure why, but the name \"Red Jade\" kind of made me want to check it out.  I made a special trip out that way, and I had a late lunch / early dinner at the Red Jade for the first time on President's Day, and I was quite pleased.\n\nThe order of potstickers would have been a meal in itself.  Large and plump I especially liked how the ginger and pork flavors in the filling overpowered the cabbage.  For me cabbage is only a necessity with corned beef or cole slaw; I am not a fan of cabbage.  Anyway, the skin was relatively thin and the flavor of the filling was very good.  \n\nIt took a bit of wait time before my seafood combination chow fun arrived.  I ordered it dry as opposed to the slimy, saucy version which I hate.  The serving was quite large with lots of fun ( flat rice noodles), lots of calamari and scallops and some shrimp.  A small amount of bean sprouts, slivered white onions, green onions and scallions made the whole dish wickedly good.  I ended up stuffing myself silly.\n\nThe little fried sesame ball filled with the sweet lotus paste was the perfect ending to a delicious meal.  A bowl of complimentary egg flower soup preceded the meal.  There was nothing special about the soup though just broth, eggs, some chopped green onion and lots of corn starch.  The service was very good too.\n\nThe restaurant is very clean compared to the Chinese restaurants I normally frequent, and I will return.", "rating": 4, "date": "2007-02-20"}, {"excerpts": ["And they do have a very generous lunch special ($5.95 for soup, entree, rice, and sesame ball).  "], "author": "Ravena F.", "review": "They just don't do it for me the way they used to.\n\nSomehow the veggies don't seem quite as fresh.  The flavor has moved more toward the American-Chinese end of the continuum (vs the Chinese-Chinese end), meaning it's rather bland, and many of the dishes taste the same.\n\nThey remain as friendly and welcoming as ever.  And they do have a very generous lunch special ($5.95 for soup, entree, rice, and sesame ball).  Oh, and those greasy sesame balls are as addictive as ever.  \n\nMmmm, greasy balls . . . (Aren't you hungry now?)", "rating": 3, "date": "2010-07-06"}, {"excerpts": ["I think the lunch special comes with soup and a sesame ball & fortune cookie. ", "Oh yeah, try their potstickers! "], "author": "Sandy M.", "review": "I come here almost every week for lunch since I work around the corner. Their lunch specials are so cheap and they come in big portions! And they're not that bad. Probably the best place to get Chinese food in that area.\n\nI think the lunch special comes with soup and a sesame ball & fortune cookie. Oh yeah, try their potstickers! They're really big for some reason lol $6 for 6 pieces though...\n\nI'm positive there are places in SF that have better Chinese food, but for a place that gets you your food quick and affordable, if you're in the area... come here!", "rating": 3, "date": "2011-05-08"}, {"excerpts": ["The free fried sesame ball was actually the best part of my meal. \r\n\r\n", "* http://www.yelp.com/biz/qlA-O6c4-lp092I6kzibUA?hrid=NTgxT10iusircPilzDZS1A"], "author": "Maria D.", "review": "Oh yes. The Gourmet Carousel* of the Castro. That's exactly what I needed. More shitty Chinese food in my life. The free fried sesame ball was actually the best part of my meal. \r\n\r\n* http://www.yelp.com/biz/qlA-O6c4-lp092I6kzibUA?hrid=NTgxT10iusircPilzDZS1A", "rating": 1, "date": "2006-09-13"}, {"excerpts": ["Also, including a sesame ball with the fortune cookie was a nice touch.\n\n"], "author": "Jeff A.", "review": "Mediocre Chinese food, but if you're in the mood for Chinese comfort food, this place is great.  Your food is ready alarmingly quick, and they have a surprisingly wide menu.\n\nI got General Tso's which had a ton of flavor.  It's also a plus that brown rice is only a tad more expensive than white rice.  (yay complex carbs).  They don't rush you out either, another plus.  Food could have been hotter out of the kitchen.\n\nAlso, including a sesame ball with the fortune cookie was a nice touch.\n\nMy fortune: \"You will have a successful entertainment career.\"   For everyone else's sake, let's hope not.", "rating": 3, "date": "2009-03-22"}, {"excerpts": ["Quick delivery and even though I ordered 2 minutes before the kitchen closed they threw in free pork buns and little sesame ball cookies.  : )"], "author": "Nicole C.", "review": "Super yummy. Quick delivery and even though I ordered 2 minutes before the kitchen closed they threw in free pork buns and little sesame ball cookies.  : )", "rating": 4, "date": "2013-10-29"}, {"excerpts": ["At the end of the meal, they'd give you a sesame ball for dessert...and perhaps a Fortune cookie as well. ", "Though last time I went, they gave me a stale sesame ball. "], "author": "Jen L.", "review": "Red Jade is not my regular \"hang out\" as far as Chinese restaurants are concerned, but their Lunch Special is definitely worth going for. \n\nThe lunch specials are very reasonably priced. It comes with soup of the day usually \"Hot & Sour\" or \"Egg Flower with Corn\" soup. There are a good variety of lunch specials on the menu for you to choose from. \n\nAt the end of the meal, they'd give you a sesame ball for dessert...and perhaps a Fortune cookie as well. Though last time I went, they gave me a stale sesame ball. Thus, minus one star.\n\nOne of my favarite dishes there is the Salt and Pepper Spareribs. \n\nOverall rating:\n3 stars for food\n1 star for service", "rating": 4, "date": "2007-05-28"}, {"excerpts": ["It also includes a fortune cookie and small sesame ball for dessert, brought out with the check.\n\n"], "author": "Ryan G.", "review": "I come here more often than anywhere else in SF.  I order the sweet & sour chicken lunch special, with steamed rice.  The sweet & sour chicken is crispy, not soggy, with ample amounts of sweet & sour sauce, and the lunch special--an extraordinary deal at just under $6--includes soup (egg drop or a spectacular hot & sour with tofu and seaweed in it, depending on the day) & a pot of tea, both brought out before the main course.  It also includes a fortune cookie and small sesame ball for dessert, brought out with the check.\n\nThe service is amazing.  I normally don't like being waited on, because I honestly don't like the forced social interaction with strangers that entails, especially with tipping involved, which makes me feel like an American Idol judge, but these guys are great.  The soup & tea come out right after you order; the main course comes out right after the soup & tea; the plates are cleared and the check comes as soon as you finish the main course.  Other than that, they leave you alone to read Tom Tomorrow or Savage Love in the copies of the SF Weekly & Guardian you've brought over from nearby Aardvark Books.\n\nThe ambiance, also perfect.  Very clean, no tablecloths, paper napkins, a good amount of natural light if you sit toward the front of the restaurant, and nonintrusive muzak playing in the background.  An oasis of calm and order.", "rating": 5, "date": "2008-11-02"}, {"excerpts": ["Also they give you a sesame ball with red bean paste for dessert...bonus.\n\n"], "author": "Venatius P.", "review": "I was surprised...good chinese food in the Castro! I had lunch here so dinner might be a different situation. The restaurant was quite nice and service was great! The prices were cheap for an entree, soup, and tea. They have brown rice too! Also they give you a sesame ball with red bean paste for dessert...bonus.\n\nIt's worth going to if you're in the Castro and craving some chinese food.", "rating": 4, "date": "2008-11-07"}, {"excerpts": ["But I did get a free sesame ball and puffy white buns ", "(I don't know the name... anyone? ", "anyone?) ", "with my order."], "author": "Andy A.", "review": "The fourth star is for the extras I got for my delivery order. Otherwise, its 3 star food at 3 star prices (which I guess is a good thing).\n\nAppetizer mixed platter - oily and tastey, the crab fried wontons were thick\n\nOther than that, I can't remember the food. But I did get a free sesame ball and puffy white buns (I don't know the name... anyone? anyone?) with my order.", "rating": 4, "date": "2007-02-08"}, {"excerpts": ["Also, the whole deal--eggplant & surprise chicken, rice, soup, fortune cookie, and little sesame ball of yum only cost $4.50.  ", "I think I have a new Delivery.com favorite."], "author": "Katie S.", "review": "When I'm eating Chinese I often go for the eggplant in an attempt to be healthy (I know, I'm kidding myself here).  So I was secretly overjoyed to find that my eggplant lunch special from Red Jade included little, delicious bits of chicken.  So yummy I practically licked the container clean.  Also, the whole deal--eggplant & surprise chicken, rice, soup, fortune cookie, and little sesame ball of yum only cost $4.50.  I think I have a new Delivery.com favorite.", "rating": 5, "date": "2006-06-13"}, {"excerpts": ["And in addition to the fortune cookie, they give you a sesame ball that is pretty delicious too. ", "Yum!"], "author": "Natascha D.", "review": "Good lunch. Cheap and tasty. Waitress said that they don't use MSG so that's definitely another plus. And in addition to the fortune cookie, they give you a sesame ball that is pretty delicious too. Yum!", "rating": 3, "date": "2009-07-24"}], "combination wor wonton soup": [{"excerpts": ["i recommend the potstickers (full of ginger), yang chow fried rice (i'm a bit biased towards any fried rice dish), and combination wor wonton soup."], "author": "kim n.", "review": "i order delivery from this place about once per week.  \n\nit's affordable and fast.  of course, it's not gourmet chinese food - but works when you're a couch potato.\n\ni recommend the potstickers (full of ginger), yang chow fried rice (i'm a bit biased towards any fried rice dish), and combination wor wonton soup.", "rating": 3, "date": "2007-07-19"}], "yee wor wonton with fresh chicken": [], "spinach mushroom chicken soup": [], "empress seafood soup": [], "chicken and sweet corn soup": [{"excerpts": ["The chicken and sweet corn soup is tasty, not at all oily.  ", "The spicy salted spare ribs were also very tasted.  "], "author": "Hiromi N.", "review": "I came here on this past Monday night with some friends after a brutal cardio work out at 24 hour fitness down the street.  This was my first experience eating at Red Jade and as many of you know, I am open to all sorts of experiences.\n\nFirst impressions:\n1) Clean\n2) Fast seating\n3) Moderately priced\n4) Well-prepared food\n\nYet, the staff, while initially courteous, mixed up our order forgot our duck and then, after forgetting our duck told us that the KITCHEN WAS CLOSED....*breathe*....okay, I'm practicing ZEN....and going to my happy place now.\n\nThe chicken and sweet corn soup is tasty, not at all oily.  The spicy salted spare ribs were also very tasted.  The food came out quickly.\n\n I hope to go back to try additional things on the menu to provide some more feedback.", "rating": 3, "date": "2009-10-31"}], "tofu mushroom soup with seaweed": [], "a happy family": [{"excerpts": ["If you're looking for \"Prawns with Walnuts\", ie, my favorite dish, you'll find it on their menu under the name \"A Happy Family\".  ", "Don't ask me why.  ", "Just order it :)"], "author": "Amy L.", "review": "Red Jade is the perfect Chinese restaurant for the Castro neighborhood:  stylish, not overly cramped, clean feeling, with lots of eye candy at the tables around you, and all of your favorite Chinese dishes done well.  \n\nIn a city that is practically overwhelmed by good Chinese restaurants, what sets this place apart is that the owners have really tried to make the experience about more than just the food:  in other words, they've decorated.  \n\nAnd they care about your fussy weird no-white-foods diet, too, because you can either get white jasmine or brown rice...I don't know of any other Chinese restaurant that offers that choice!  And the white rice is good, too: it isn't overly dry, isn't too sticky or glutenous, and the grains aren't all broken up...so, a detail as small as the rice is noticed and cared for here. \n\nThere are a lot of vegetarian options, too, and this restaurant can accomodate large parties.  Their lunch specials are seriously inexpensive (think $4.25-6.25) and definitely fill you up!\n\nAs far as location, you couldn't ask for better:  It's right by Muni, in the midst of many things to do and places to go.  You can walk to a number of coffee shops, dessert places, clubs and bars from here, should you feel so inclined, and the neighborhood feels safe to walk around in, even very late at night.  The only downside is that parking seriously sucks in this neighborhood, so give yourself extra time to drive around and around for 10-20 minutes before finding a spot.  \n\nAll in all, I highly recommend this place to people on dates, large groups, and anyone who is less concerned with food snobbery about how \"authentic\" their Chinese food is (I can hear it now: \"What?!  No chicken feet on their menu???  Honey, let's just go...\") and more concerned with just having a tasty, affordable meal in a nice environment.\n\n**Note:  If you're looking for \"Prawns with Walnuts\", ie, my favorite dish, you'll find it on their menu under the name \"A Happy Family\".  Don't ask me why.  Just order it :)", "rating": 5, "date": "2007-06-12"}], "b portabello mushroom with shrimp": [], "c lamb chops": [], "d mango chicken": [], "e stir fried salmon with broccoli": [], "f chinese broccoli with scallops and beef": [], "g mongolian lamb": [], "h triple mushroom with chicken": [], "i seafood combination with crispy birds nest": [], "j lettuce wraps": [], "k prawns with snow peas": [], "l princess prawns": [], "m asparagus prawns and scallops with black bean sauce": [], "n spicy chicken with basil": [], "o house eggplant": [], "p garlic prawns": [], "q bitter melon with protein": [], "r spicy salt and pepper soft shell crabs": [], "s stirfried fish with mixed vegetables": [], "t portabello mushroom with mixed vegetables": [], "u peking duck": [], "v spicy salted fish": [], "d mango shrimp": [], "d mango beef": [], "two kinds of scallop": [], "jumbo prawns in a spicy szechuan sauce": [{"excerpts": ["*Jumbo Prawns in a Spicy Szechuan Sauce - although the menu stated \"spicy\" there was no spice, no heat.  \n\n"], "author": "Donna P.", "review": "Excellent Customer Service and on time delivery.  Awful food.  \n\nThis evening my daughter and I finally got around to giving Red Jade a try after seeing it favorably show cased on Check Please Bay Area.   I can't for the life of me figure out the disparity between the positive responses on that show, numerous rave Yelp reviews and what was delivered this evening.  My food was edible but I'm not keeping the leftovers for tomorrow's lunch.  And, there are a lot of leftovers.  All three of the dishes ordered were almost identical in taste.\n\n*Jumbo Prawns in a Spicy Szechuan Sauce - although the menu stated \"spicy\" there was no spice, no heat.  \n\n*House Eggplant with Shrimp, chicken, fresh basil, and chili peppers - barely edible, and again, no flavor.\n\n*String Bean Chicken - Edible and tasted like the other two dishes.\n\nPositive note: They sent a couple of complimentary pork buns with the order, which was rather nice.\n\nThere are far better Chinese restaurants in the city.", "rating": 2, "date": "2013-09-13"}], "stirfried prawns with jade greens": [], "golden scallops wokfried with a spicy herb salt": [], "golden calamari wokfried with a spicy herb salt": [], "wokfried spicy whole prawns with fresh herb": [], "asparagus salmon with black bean sauce": [{"excerpts": ["The asparagus salmon with black bean sauce, for example, is excellent. ", "I also try to find good crab rangoon anytime "], "author": "Maisha J.", "review": "This place is soo good! I'm pretty picky about Chinese food and I was convinced there was no good Chinese food in the city, so I was so happy when my roommate introduced me to Red Jade.\n\nTheir lunch specials are inexpensive and very filling. I'm a vegetarian, except that I eat seafood (so I'm technically a pescatarian), and they have plenty of delicious options for me. The asparagus salmon with black bean sauce, for example, is excellent. I also try to find good crab rangoon anytime I go to a Chinese food restaurant -- and Red Jade makes superb crab rangoon.\n\nThe staff is friendly, sometimes they seem super busy but they always serve you well. Free pork buns with a big delivery (I don't eat them, but my roommate is happy to oblige), and the sesame balls that come with every meal are yummmmy. Yay Red Jade!", "rating": 5, "date": "2009-02-20"}, {"excerpts": ["On to the food: We ordered broccoli and cashew chicken, asparagus salmon with black bean sauce, and Mandarin eggplant. ", "The chicken was what you would expect anywhere but my favorite was the salmon even though at first glance it didn't seem like it would anything great. ", "It was pieces of salmon that came with a lot of green peppers but the fish was tender with the right amount of black bean sauce and totally hit the spot. ", "Eggplant was a bit oily "], "author": "Julia T.", "review": "So bf and I didn't feel like cooking after work and we were really craving some Chinese food. What to do? We'd always pass by Red Jade without going in so we thought this would be the perfect time to try it. Our first impressions: it's very clean and a place that has put some attention to ambiance which not usually true for Chinese joints (usually it's very over the top or just down right dirty). \n\nOn to the food: We ordered broccoli and cashew chicken, asparagus salmon with black bean sauce, and Mandarin eggplant. The chicken was what you would expect anywhere but my favorite was the salmon even though at first glance it didn't seem like it would anything great. It was pieces of salmon that came with a lot of green peppers but the fish was tender with the right amount of black bean sauce and totally hit the spot. Eggplant was a bit oily but that's kind of how it always is when cooked Chinese style. \n\nNote: They have white AND brown rice. Very happy about that! You gotta be healthy somewhere.. :)\n\nWe ended our meal with the standard free fortune cookies but they also threw in two sesame balls! YUM! Good place for a cheap Chinese meal in a clean and nice setting. I'll try the delivery next time when I'm feeling even more lazy.", "rating": 4, "date": "2008-09-24"}], "broccoli and cashew chicken": [{"excerpts": ["On to the food: We ordered broccoli and cashew chicken, asparagus salmon with black bean sauce, and Mandarin eggplant. ", "The chicken was what you would expect anywhere but my favorite was the salmon even though at first glance it didn't seem like it would anything great. ", "It was pieces of salmon that came with a lot of green peppers but the fish was tender with the right amount of black bean sauce and totally hit the spot. ", "Eggplant was a bit oily "], "author": "Julia T.", "review": "So bf and I didn't feel like cooking after work and we were really craving some Chinese food. What to do? We'd always pass by Red Jade without going in so we thought this would be the perfect time to try it. Our first impressions: it's very clean and a place that has put some attention to ambiance which not usually true for Chinese joints (usually it's very over the top or just down right dirty). \n\nOn to the food: We ordered broccoli and cashew chicken, asparagus salmon with black bean sauce, and Mandarin eggplant. The chicken was what you would expect anywhere but my favorite was the salmon even though at first glance it didn't seem like it would anything great. It was pieces of salmon that came with a lot of green peppers but the fish was tender with the right amount of black bean sauce and totally hit the spot. Eggplant was a bit oily but that's kind of how it always is when cooked Chinese style. \n\nNote: They have white AND brown rice. Very happy about that! You gotta be healthy somewhere.. :)\n\nWe ended our meal with the standard free fortune cookies but they also threw in two sesame balls! YUM! Good place for a cheap Chinese meal in a clean and nice setting. I'll try the delivery next time when I'm feeling even more lazy.", "rating": 4, "date": "2008-09-24"}], "original dry fried chicken wings": [], "general tsos spicy boneless chicken": [], "string bean chicken": [{"excerpts": ["*String Bean Chicken - Edible and tasted like the other two dishes.\n\n"], "author": "Donna P.", "review": "Excellent Customer Service and on time delivery.  Awful food.  \n\nThis evening my daughter and I finally got around to giving Red Jade a try after seeing it favorably show cased on Check Please Bay Area.   I can't for the life of me figure out the disparity between the positive responses on that show, numerous rave Yelp reviews and what was delivered this evening.  My food was edible but I'm not keeping the leftovers for tomorrow's lunch.  And, there are a lot of leftovers.  All three of the dishes ordered were almost identical in taste.\n\n*Jumbo Prawns in a Spicy Szechuan Sauce - although the menu stated \"spicy\" there was no spice, no heat.  \n\n*House Eggplant with Shrimp, chicken, fresh basil, and chili peppers - barely edible, and again, no flavor.\n\n*String Bean Chicken - Edible and tasted like the other two dishes.\n\nPositive note: They sent a couple of complimentary pork buns with the order, which was rather nice.\n\nThere are far better Chinese restaurants in the city.", "rating": 2, "date": "2013-09-13"}], "half crispy fried chicken": [], "spicy tangy chicken": [{"excerpts": ["For the main meal, I ordered the spicy tangy chicken and asked for brown rice instead of white.  ", "It wasn't a problem or an extra charge, which was nice.  ", "Unfortunately, the brown rice tasted old and half cooked.  ", "The spicy tangy chicken was good, but the chicken pieces were oddly small--think peanut sized.  ", "It was odd.  "], "author": "Jason S.", "review": "I was in the neighborhood and stopped in.  Red Jade was busy, so I thought it had promise.  Boy was I wrong.\n\nA table was quickly cleared and I was seated.  Given 30 seconds to look at the menu, a waiter stopped by to take my order.  I asked for another minute.  Another waiter stopped by to take my order after another 30 seconds, so I ordered.\n\nQuick quick quick.  Why is every worker in this restaurant moving so fast?  There are so many waiters and they are all moving at this ridiculously fast speed.  Slow down, please.  It was the least relaxing meal I have ever had.\n\nI ordered the pot stickers.  They were pretty okay.  They came out pretty quick (seems to be the theme at Red Jade).  For the main meal, I ordered the spicy tangy chicken and asked for brown rice instead of white.  It wasn't a problem or an extra charge, which was nice.  Unfortunately, the brown rice tasted old and half cooked.  The spicy tangy chicken was good, but the chicken pieces were oddly small--think peanut sized.  It was odd.  The prices were all pretty good, but I would have gladly paid a little more for something special (and properly cooked brown rice).\n\nAnd then I sat.  The mad rush of waiters running by, holding up two fingers and shouting as people came into the door, \"Two? Two?! Right here!\" and pointing to a table.  Then quickly running off to take care of something else.\n\nAnd I sat some more.  15 minutes after finishing my meal, my beer, my water, the check was brought to me.  I sat down my credit card and WHOOSH! another waiter snapped it up as he ran by and took care of the check.  Gah!\n\nThere  are too many other restaurants in San Francisco--I won't be coming back here.\n\n(And then I left to get on Muni--wishing that quickness was at least their style)", "rating": 2, "date": "2011-02-03"}, {"excerpts": ["The spicy tangy chicken is fantastic as well."], "author": "t l.", "review": "Love it!  A lot of fantastic entrees occupy space on the menu.  The prices are cheap.  The surroundings are clean.  You never have to wait for a table.  This is one of my favorite places for Chinese food.\n\nThe sweet and sour is way better than most.  The beef with garlic sauce is really great.  The spicy tangy chicken is fantastic as well.", "rating": 4, "date": "2007-05-17"}], "beef with spicy garlic sauce": [], "broccoli bok choy with beef": [], "house special beef": [{"excerpts": ["We ordered the orange chicken, chicken chow mein and the house special beef.  ", "The orange chicken and chow-mein came out real quick (like 3-5 minutes later!).  ", "No complains there "], "author": "Little E.", "review": "SLOW DOWN, PLEASE!!!  Seriously!\n\nI just got back from this restaurant and was very disappointed.  I've been here a few times and it was so-so...until tonight.  \nWe ordered the orange chicken, chicken chow mein and the house special beef.  The orange chicken and chow-mein came out real quick (like 3-5 minutes later!).  No complains there but, my complain is that the other dish we ordered never came out!\n\nSaving my appetite for it,  I stopped eating cause the waiter (Male, late 40's) said it will come soon.  15 minutes later, nada!  NOTHING!  Just the waiter coming back to ask if everything was good.  And if we wanted to take the food to go.  REALLY?  \nWe told him we never got the other food, so he went back to the kitchen to check, only to come back saying he forgot, or the kitchen forgot it.  He then took our plates, which we weren't even done eating, then gave us our check.  WTF!  \n\nThey really need to SLOW DOWN!  That guy needs to slow down and pay attention and not mad rush the customers!  Its like I'm eating at a fast food restaurant!", "rating": 2, "date": "2011-10-12"}], "beef filet with black pepper sauce": [], "stirfried beef with oyster sauce": [], "wokfried beef filet with snow peas": [], "mandarin beef": [], "fire house spicy string beans with minced pork": [{"excerpts": ["Ordered:\n\nFire House Spicy String Beans with Minced Pork - so minced I didn't see them "], "author": "Angela D.", "review": "Ordered:\n\nFire House Spicy String Beans with Minced Pork - so minced I didn't see them but the string beans were very good.\n\nChicken Chow Fun with Black Bean Sauce - normally my favorite dish at Chinese places but will never order this again here.  Noodles were all slimy.\n\nPot Stickers - only order if you like them soft.  Not crispy whatsoever.\n\nGreen Onion Pancake - very good\n\nSesame Ball - very good\n\nOverall, will never order from again as the city has too many better Chinese restaurants.", "rating": 3, "date": "2016-02-23"}, {"excerpts": ["Fire House Spicy String Beans with Minced Pork-huge sting beans sauteed in red pepper and pork.  \n", "Vegetarian Delight- ", "Standard steamed and sauteed vegetable mix.  "], "author": "Nicole R.", "review": "Standard Mandarin Food in the Castro. The  restaurant is clean and the decor  is Chinese inspired.  The waitstaff is fast and efficient.\n\nFree Pot of hot tea!\nPot Stickers- delicious ginger pork filling in standard a pot sticker \nSeaweed Salad- standard Seaweed salad.  May not be authentic, but it is tasty.\nOriginal Dry Fried Chicken- fried chicken thighs that have been coated in a spicy red pepper sauce.  Not what I expected, but I liked it!\nFire House Spicy String Beans with Minced Pork-huge sting beans sauteed in red pepper and pork.  \nVegetarian Delight- Standard steamed and sauteed vegetable mix.  Good to get your daily serving of mixed vegetables.\n\nThe check came with fortune cookies and red bean sesame buns.  I love red bean buns!  And I love sesame buns!  I double love the  red bean sesame buns!!!\n\nEnough food to feed 4 or 5 and I left with boxes of left overs for about $50.  I will be coming back for takeout!", "rating": 4, "date": "2013-05-08"}, {"excerpts": ["I also like their tangy Fire House Spicy String Beans with Minced Pork ($6.95), heartier than your average veggie side, especially with all that meat.\r\n\r\n", "Their $8.50 Lettuce Wraps are much better than what they serve at Long Life. "], "author": "Ed U.", "review": "A dependable Hunan or Mandarin restaurant is worth giving up a kidney, and one that delivers makes me want to get a frequent organ donor card. And one that has great, fresh-tasting food can only mean one thing: a brain transplant.\r\n\r\nThat's why I am thrilled that a good friend of mine made me aware of Red Jade on Church. There are plenty of Chinese restaurants that deliver in my neck of SOMA, but they all seem to serve from the same vat of mystery brown sauce that covers all their food no matter what you order. Whatever it's made of, I believe it's the same ingredient that Ron Popeil uses in his spray-on hair aerosol can.\r\n\r\nRed Jade, on the other hand, serves fresh Mandarin cuisine superbly prepared. I can always tell how good a Chinese restaurant will be by their garlic chicken. I've been to one that actually deep fried their chicken like McNuggets and ladles some kind of goop with just a half-clove of garlic in it. At $6.95, Red Jade's is fresh with a light marinade but heavy on the garlic. I also like their tangy Fire House Spicy String Beans with Minced Pork ($6.95), heartier than your average veggie side, especially with all that meat.\r\n\r\nTheir $8.50 Lettuce Wraps are much better than what they serve at Long Life. The appetizers are worth a meal in themselves - the $3.95 Green Onion Pancake is flaky perfection, while the $5.95 House Special Dim Sum for Two is a nice treat without the burden of a Tourettes-screeching woman clanking by with a steam cart. Best of all, they offer lunch specials that range between $4.50 and $5.95 that include soup and rice. They even deliver the specials as long as you hit the $15.00 minimum.\r\n\r\nBy the way, the restaurant itself is perfectly nice and worth visiting. The service is fine, and I've yet to be there when the whole place has been crowded. But, c'mon, free delivery...how can you beat that? Plus you get those addictive fried sesame balls plus if you hit a $20.00 tab, free Bar-B-Q Pork Buns. Enough said. \r\n\r\nFOOD - 4.5 stars...fresh and hot\r\nAMBIENCE - 4 stars...nice and wide-open and just a stone's throw from Market\r\nSERVICE - 5 stars...did I mention they deliver for free??\r\nOVERALL - 4.5 stars...getting my donor card now", "rating": 4, "date": "2006-08-21"}], "stirfried pork with asparagus": [], "braised pork chops in a pungent sauce": [], "spicy salted spareribs": [], "panfried pork loin with black pepper sauce": [], "szechuan eggplant with minced pork": [], "string beans with bean curd": [], "eggplant tofu": [{"excerpts": ["I also like the Eggplant Tofu.  ", "I tried their General Tso's Chicken the other day and was impressed."], "author": "Lawree S.", "review": "3 1/2 stars.  Pretty decent stuff!  They do awesome Kung Pao Chicken.  I also like the Eggplant Tofu.  I tried their General Tso's Chicken the other day and was impressed.", "rating": 3, "date": "2015-01-07"}, {"excerpts": ["I ordered the eggplant tofu lunch special. ", "My co-worker came back from picking it up and at first I thought that they forgot to add tofu ", "and it was only eggplant, which was okay. ", "As I was eating I discovered little pieces of beef. ", "It wasn't just one or two by mistake either. ", "I decided to ditch the entree ", "and I ate the rice alone with soy sauce. "], "author": "Anthony H.", "review": "This is the second time that I ate at Red Jade. The first time It was much better that is why I am putting 2 stars instead of 1.\n\nThe first time, last week, my co-worker and I called to order for pick-up. We both ordered the veggie fried rice with no egg and we added tofu. It was great and a very large portion for a decent price.\n\nWe then decided to call and order for pick-up a second time today. We both got lunch specials which came with rice and soup. I ordered the eggplant tofu lunch special. My co-worker came back from picking it up and at first I thought that they forgot to add tofu and it was only eggplant, which was okay. As I was eating I discovered little pieces of beef. It wasn't just one or two by mistake either. I decided to ditch the entree and I ate the rice alone with soy sauce. My co-worker said that his mongolian beef lunch special was \"ok\" and that it felt like it had been sitting out for a while.\n\nThere are plenty of Chinese restaurants in the city and some with a lot more vegetarian options. I understand that mistakes happen, but It is a huge turn off to see meat in my vegetarian dishes.", "rating": 2, "date": "2011-09-11"}, {"excerpts": ["I would recommend the eggplant tofu, as well as ", "the General Tso's chicken.  ", "They are very hospitable and have friendly customer service.  ", "Rarely have I waited more than 10 minutes for my meal.  ", "I would recommend going here.  ", "We go at least 2x/mo."], "author": "Paul W.", "review": "I've been here many times!  It's not the absolute greatest but it's very affordable and quality is good.  I would recommend the eggplant tofu, as well as the General Tso's chicken.  They are very hospitable and have friendly customer service.  Rarely have I waited more than 10 minutes for my meal.  I would recommend going here.  We go at least 2x/mo.", "rating": 4, "date": "2013-11-23"}, {"excerpts": ["Eggplant tofu dish is delicious."], "author": "Saweni S.", "review": "Decent to delicious food - depending on chef on duty, but solid Chinese fare in the Mission/Castro area and good prices, fresh food.  Great lunch special before 5pm.  Sometimes they skimp on sauce, which always makes me sad, but usually great.  Waitstaff are friendly and welcoming, but sometimes can rush you if it's a busy evening.  Overall good stuff.  I recommend it.  Eggplant tofu dish is delicious.", "rating": 4, "date": "2011-10-22"}], "vegetarian kung pao tofu": [], "crispy fried tofu": [{"excerpts": ["The tasty CRISPY FRIED TOFU comes in bite-sized portions, and is really delicious for those who crave good (non-greasy) fried tofu! \n\n"], "author": "Addadada A.", "review": "RED JADE is a GREAT Chinese-American Restaurant !\n\nThere are many styles of Chinese cooking and RED JADE is  Chinese-American cusine, that's GOOD Chinese-American cusine at a resonable price!\n\nADDA is a vegetarian, and VEGGIES will find a slew of wonderful dishes to choose!  The SAUTEED SNOW PEAS with WATER CHESTNUTS ($6.95) in a lighly flavored sauce is THE BEST! \n\nThe tasty CRISPY FRIED TOFU comes in bite-sized portions, and is really delicious for those who crave good (non-greasy) fried tofu! \n\nRED JADE's LUNCH SPECIALS are resonably priced at $5.25-$5.95 with soup, white or brown rice, seseme ball/fortune cookie, & tea! \n\nVEGETARIAN DELIGHT ($5.25 lunch) has a HUGE plateful of wonderful veggies in a light sauce. (ADDA always asks for EXTRA GARLIC to really give it a super taste kick!!)\n\nMeat/fish eaters should try the LEMON CHICKEN ($5.25 lunch-$7.50 dinner) is a nice crispy chicken with a very light coating of lemon sauce. Not overpowering at all...TASTYLICIOUS! \n  \nThe SHRIMP with MIXED VEGETABLES ($5.95 lunch) is also a lighty-flavored enjoyable treat. \n\nActually, there are so many selections on the menu, it would be impossible to review each and every dish there, but one can be assured that EVERYTHING IS SO FRESH !!!!!!\n\nRED JADE's wonderful staff is very attentative and kind. They are open to any changes or dietary restrictions/additions!  \n\nFor CHINESE-AMERICAN CUISINE...RED JADE is a wonderful inexpensive \"'GEM\"!", "rating": 5, "date": "2010-01-29"}], "fish tofu": [], "szechuan sauteed broccoli": [{"excerpts": ["I was starving, and I got the vegetable egg rolls, sesame chicken, and szechuan sauteed broccoli, which all was easily enough for two to share. ", "The chicken tasted like chicken (already it's winning me over), the sauce was sweet but not overpowering and the portion was huge. ", "The broccoli was crisp and the sauce was delicious", "--I mixed the two dishes together ", "and it was awesome. "], "author": "Allison G.", "review": "Yum! If you want reasonably priced, delicious, HOT, and quickly-delivered, slightly Americanized Mandarin-style Chinese takeout, Red Jade is your new favorite restaurant. My skeptical, unsure self ordered from delivery.com for the first time, and wondered how long it would be before they got to my house. Answer: in under a half hour. My lack of cash was even worse than my lack of fridge food, which was fine because I was able to pay the bill and tip with my credit card--yesss. \n\nAnd the food--sent from the takeout Chinese gods themselves. I was starving, and I got the vegetable egg rolls, sesame chicken, and szechuan sauteed broccoli, which all was easily enough for two to share. The chicken tasted like chicken (already it's winning me over), the sauce was sweet but not overpowering and the portion was huge. The broccoli was crisp and the sauce was delicious--I mixed the two dishes together and it was awesome. The egg rolls were nice and crispy, just as they should be.\n\nAnd, I got 2 FREE pork buns, 2 FREE sesame seed balls with red bean paste, and the usual fortune cookies to complete the meal. I'll have plenty left over for lunch and maybe even dinner again tomorrow, and it's good enough that I won't mind eating it that often.  I'll definitely be a repeat customer as long as I'm living in the Castro. Take note though--rice is not included unless you order it.", "rating": 5, "date": "2008-07-14"}], "hoisin string beans": [{"excerpts": ["the Hoisin String beans were nicely done with some onions. ", "And there was a lot of food which was good for this table of 7 sharing. ", "All in all, I'd go back and may do so today for lunch: pot stickers!  ", ";-)"], "author": "Richard A.", "review": "Met some previous coworkers here last night for dinner. I was a little worried because of the varied Yelp reviews. Pleasantly surprised: Service was good, food was good, price was good. I really liked the pot stickers, lemon chicken and Mu Shu. the Hoisin String beans were nicely done with some onions. And there was a lot of food which was good for this table of 7 sharing. All in all, I'd go back and may do so today for lunch: pot stickers!  ;-)", "rating": 4, "date": "2016-08-24"}, {"excerpts": ["We usually order Hoisin String Beans, Sweet & Sour Pork, Green Onion Pancake, and a large order of Steamed Rice. ", "(you can get brown, or white rice.) ", "The string beans are tender, and FRESH. ", "The sweet & Sour Pork--Chopped in smaller pieces. ", "In my opinion, this is better. ", "It allows the pork to cook quicker w/o turning the outer crust to turn to HARD, inedible, rock hard mess. ", "Their S&S Pork has a crunchy exterior w/ tender, juicy interior!! ", "And, honey, the Green Onion Pancake is DEEEEEEEEE-Liciously crunchy & Flavorful!! ", "Delivered HOT!! ", "We always get it ", "within30 Min. ", "Great service. ", "Cordial staff."], "author": "Sabrina R.", "review": "ECSTATIC!!!! My hubby & I have used their delivery service several times now. The food is OFF THE CHAIN!! The consistency is impressive. I mean, sometimes--Well, you know how you order one time--it's good. Then, it starts to go downhill? Their food is BEYOND delicious EVERY time! We usually order Hoisin String Beans, Sweet & Sour Pork, Green Onion Pancake, and a large order of Steamed Rice. (you can get brown, or white rice.) The string beans are tender, and FRESH. The sweet & Sour Pork--Chopped in smaller pieces. In my opinion, this is better. It allows the pork to cook quicker w/o turning the outer crust to turn to HARD, inedible, rock hard mess. Their S&S Pork has a crunchy exterior w/ tender, juicy interior!! And, honey, the Green Onion Pancake is DEEEEEEEEE-Liciously crunchy & Flavorful!! Delivered HOT!! We always get it within30 Min. Great service. Cordial staff.", "rating": 5, "date": "2015-12-12"}], "mandarin eggplant": [{"excerpts": ["On to the food: We ordered broccoli and cashew chicken, asparagus salmon with black bean sauce, and Mandarin eggplant. ", "The chicken was what you would expect anywhere but my favorite was the salmon even though at first glance it didn't seem like it would anything great. ", "It was pieces of salmon that came with a lot of green peppers but the fish was tender with the right amount of black bean sauce and totally hit the spot. ", "Eggplant was a bit oily "], "author": "Julia T.", "review": "So bf and I didn't feel like cooking after work and we were really craving some Chinese food. What to do? We'd always pass by Red Jade without going in so we thought this would be the perfect time to try it. Our first impressions: it's very clean and a place that has put some attention to ambiance which not usually true for Chinese joints (usually it's very over the top or just down right dirty). \n\nOn to the food: We ordered broccoli and cashew chicken, asparagus salmon with black bean sauce, and Mandarin eggplant. The chicken was what you would expect anywhere but my favorite was the salmon even though at first glance it didn't seem like it would anything great. It was pieces of salmon that came with a lot of green peppers but the fish was tender with the right amount of black bean sauce and totally hit the spot. Eggplant was a bit oily but that's kind of how it always is when cooked Chinese style. \n\nNote: They have white AND brown rice. Very happy about that! You gotta be healthy somewhere.. :)\n\nWe ended our meal with the standard free fortune cookies but they also threw in two sesame balls! YUM! Good place for a cheap Chinese meal in a clean and nice setting. I'll try the delivery next time when I'm feeling even more lazy.", "rating": 4, "date": "2008-09-24"}], "sauteed asparagus with black bean sauce": [], "sauteed snow peas with water chestnuts": [{"excerpts": ["The SAUTEED SNOW PEAS with WATER CHESTNUTS ($6.95) in a lighly flavored sauce is THE BEST! \n\n"], "author": "Addadada A.", "review": "RED JADE is a GREAT Chinese-American Restaurant !\n\nThere are many styles of Chinese cooking and RED JADE is  Chinese-American cusine, that's GOOD Chinese-American cusine at a resonable price!\n\nADDA is a vegetarian, and VEGGIES will find a slew of wonderful dishes to choose!  The SAUTEED SNOW PEAS with WATER CHESTNUTS ($6.95) in a lighly flavored sauce is THE BEST! \n\nThe tasty CRISPY FRIED TOFU comes in bite-sized portions, and is really delicious for those who crave good (non-greasy) fried tofu! \n\nRED JADE's LUNCH SPECIALS are resonably priced at $5.25-$5.95 with soup, white or brown rice, seseme ball/fortune cookie, & tea! \n\nVEGETARIAN DELIGHT ($5.25 lunch) has a HUGE plateful of wonderful veggies in a light sauce. (ADDA always asks for EXTRA GARLIC to really give it a super taste kick!!)\n\nMeat/fish eaters should try the LEMON CHICKEN ($5.25 lunch-$7.50 dinner) is a nice crispy chicken with a very light coating of lemon sauce. Not overpowering at all...TASTYLICIOUS! \n  \nThe SHRIMP with MIXED VEGETABLES ($5.95 lunch) is also a lighty-flavored enjoyable treat. \n\nActually, there are so many selections on the menu, it would be impossible to review each and every dish there, but one can be assured that EVERYTHING IS SO FRESH !!!!!!\n\nRED JADE's wonderful staff is very attentative and kind. They are open to any changes or dietary restrictions/additions!  \n\nFor CHINESE-AMERICAN CUISINE...RED JADE is a wonderful inexpensive \"'GEM\"!", "rating": 5, "date": "2010-01-29"}], "chinese broccoli with ginger sauce": [{"excerpts": ["The Chinese Broccoli with ginger sauce was a bit intense with ginger flavor-", "I liked it "], "author": "Mandy F.", "review": "Ughhhh \nI have found my new favorite Chinese takeout place.  \n-lemon chicken\n-beef chow fun\n-FREE PORK BUNS & SESAME BALLS?!?\nWe used their online ordering system and it was delivered within in 45min.\nThe Chinese Broccoli with ginger sauce was a bit intense with ginger flavor-I liked it but my boyfriend wasn't into it. \n\nHands down-my new go-to for takeout. It helps that everyone I know loves this place as well", "rating": 5, "date": "2015-08-24"}, {"excerpts": ["Chinese Broccoli with Ginger Sauce.  ", "Man, you can actually feel REALLY GOOD about eating this.  ", "Super healthy.  ", "Clean, light, not dripping in cornstarch sauce.  "], "author": "FoodDudeS F.", "review": "Just got DELIVERY from Red Jade for the first time.  Once again, these guys ROCK!  Honestly, this is how a Chinese restaurant is supposed to be.  If other Chinese restaurants COPIED THESE GUYS our city would be a better place.\n\n1) Delivery in 20 minutes!!!  Are you kidding?  Unbelievable, but true.  I must've caught them at the perfect time.  Amazing, when you think about it.  He even told me on the phone \"40 minutes\", so I was SHOCKED when I heard the doorbell ring.  \n\n2) Delivery dude was friendly, personable, spoke English just fine.  Not in a hurry to leave, told me to \"Enjoy my meal!\".  Why can't more delivery guys be like this?\n\n3) FREE STEAMED PORK BUNS!!  Didn't have to ask for them, didn't have present a coupon, they just showed up with the order.  Nice.  Thank you.\n\n4) Chinese Broccoli with Ginger Sauce.  Man, you can actually feel REALLY GOOD about eating this.  Super healthy.  Clean, light, not dripping in cornstarch sauce.  Thumbs up.\n\nNo wonder this place has been around for at least 20 years.  They KNOW WHAT THEY'RE DOING!  Props!!", "rating": 4, "date": "2014-05-31"}], "vegetarian delight": [{"excerpts": ["I ordered Vegetarian Delight. ", "I requested spicy (not an option but on side note had made the request).\n", "I would say that it was a damn good dish.\n", "This was probably the best vegetarian dish I've had at a Chinese restaurant. ", "Portions were not great but a hair on acceptable. ", "The rice had good texture and moisture balance though had to be ordered as a separate dish.\n", "I would have this meal again as I enjoyed it immensely.  ", "The added spice was critical to the success of the dish for me but the Sauce carried it well also. ", "With that said, the meal is a 4 and portions, 3.5 stars. ", "The dinner was $10 for a small container of veggies in sauce and should have included a small rice. ", "Other than that, high marks for flavor and the veggies were cooked well. ", "Rice was acceptable. ", "Overall, good meal! ", "Would return."], "author": "John B.", "review": "Ordered in with a food delivery. I ordered Vegetarian Delight. I requested spicy (not an option but on side note had made the request).\nI would say that it was a damn good dish.\nThis was probably the best vegetarian dish I've had at a Chinese restaurant. Portions were not great but a hair on acceptable. The rice had good texture and moisture balance though had to be ordered as a separate dish.\nI would have this meal again as I enjoyed it immensely.  The added spice was critical to the success of the dish for me but the Sauce carried it well also. With that said, the meal is a 4 and portions, 3.5 stars. The dinner was $10 for a small container of veggies in sauce and should have included a small rice. Other than that, high marks for flavor and the veggies were cooked well. Rice was acceptable. Overall, good meal! Would return.", "rating": 4, "date": "2018-04-18"}, {"excerpts": ["My go to is the vegetarian delight! ", "Yum! ", "A plate full of veggies that are still crisp! "], "author": "Tim P.", "review": "The lunch special can't be beat. For ten bucks including tip you get most entrees with rice, soup and a sesame ball for dessert. My go to is the vegetarian delight! Yum! A plate full of veggies that are still crisp! The beef broccoli is consistently good as well. \n\nWarning to you chicken eaters: specify white meat. You'll get thigh meat if you don't.", "rating": 4, "date": "2017-08-13"}, {"excerpts": ["VEGETARIAN DELIGHT ($5.25 lunch) has a HUGE plateful of wonderful veggies in a light sauce. "], "author": "Addadada A.", "review": "RED JADE is a GREAT Chinese-American Restaurant !\n\nThere are many styles of Chinese cooking and RED JADE is  Chinese-American cusine, that's GOOD Chinese-American cusine at a resonable price!\n\nADDA is a vegetarian, and VEGGIES will find a slew of wonderful dishes to choose!  The SAUTEED SNOW PEAS with WATER CHESTNUTS ($6.95) in a lighly flavored sauce is THE BEST! \n\nThe tasty CRISPY FRIED TOFU comes in bite-sized portions, and is really delicious for those who crave good (non-greasy) fried tofu! \n\nRED JADE's LUNCH SPECIALS are resonably priced at $5.25-$5.95 with soup, white or brown rice, seseme ball/fortune cookie, & tea! \n\nVEGETARIAN DELIGHT ($5.25 lunch) has a HUGE plateful of wonderful veggies in a light sauce. (ADDA always asks for EXTRA GARLIC to really give it a super taste kick!!)\n\nMeat/fish eaters should try the LEMON CHICKEN ($5.25 lunch-$7.50 dinner) is a nice crispy chicken with a very light coating of lemon sauce. Not overpowering at all...TASTYLICIOUS! \n  \nThe SHRIMP with MIXED VEGETABLES ($5.95 lunch) is also a lighty-flavored enjoyable treat. \n\nActually, there are so many selections on the menu, it would be impossible to review each and every dish there, but one can be assured that EVERYTHING IS SO FRESH !!!!!!\n\nRED JADE's wonderful staff is very attentative and kind. They are open to any changes or dietary restrictions/additions!  \n\nFor CHINESE-AMERICAN CUISINE...RED JADE is a wonderful inexpensive \"'GEM\"!", "rating": 5, "date": "2010-01-29"}, {"excerpts": ["The lettuce wraps are fantastic as is the \"Vegetarian Delight.\"  "], "author": "Ryan G.", "review": "I have only ordered from Red Jade and have never been in person.  HOWEVER, I think very highly of them and definitely recommend them.  They are extremely courteous, prompt with their delivery, and the food is extremely tasty.  Great potions too!\n\nThe lettuce wraps are fantastic as is the \"Vegetarian Delight.\"  The food is delivered with complimentary pork buns and/or sesame rolls which are little bites of decadence.\n\nI need to go to the place in person I admit, but ordering for delivery is just so damn good.  Call them up, order your food, wait briefly, and enjoy!", "rating": 4, "date": "2008-04-18"}, {"excerpts": ["The \"vegetarian delight\" wasn't exactly delightful, but the broth had a nice flavor and the kale was delicious (a little heavy on the water chestnuts though). \n\n"], "author": "Megan B.", "review": "There is much more than meets the eye at Red Jade... walking in, I didn't expect much. After being born and raised in Asia, I have pretty high standards for Chinese food -- but I've also adjusted to Americhinese. \n\nThe food Red Jade actually didn't disappoint! The vegetarian hot and sour soup was deeeelicious AND they had white pepper on the table, so I didn't even have to ask. The \"vegetarian delight\" wasn't exactly delightful, but the broth had a nice flavor and the kale was delicious (a little heavy on the water chestnuts though). \n\nYou also get free tea with your meal, and the lunch specials are a total bargain: it's a TON of food! What sold me was the fact that they serve jin deui (sesame balls) with your bill... I haven't had those since Singapore! Kudos Red Jade, kudos.\n\nI have to admit, they lost a star for service. It was busy when we came in, but service was prompt. By the time we were ready for our check the place was empty (and no, we weren't there forever), but we ended up having to go ask for the bill. Tsk tsk.\n\nNow if only they'll deliver to my 'hood? We'll see. If so, bonus stars to come.", "rating": 3, "date": "2008-07-29"}, {"excerpts": ["and sweet; vegetarian delight was over-salty (though the vegetables weren't too bad underneath; MaPo Tofu was OK, but I didn't write home."], "author": "Patrick M.", "review": "The price is right, but the food is wrong. Inauthentic: spicy garlic pork was not spicy, and was inexplicably dark (soy sauce?) and sweet; vegetarian delight was over-salty (though the vegetables weren't too bad underneath; MaPo Tofu was OK, but I didn't write home.", "rating": 2, "date": "2010-12-13"}], "sauteed baby bokchoy with garlic": [], "foo young": [{"excerpts": ["I ordered a pork egg foo young and the worst egg foo young ", "i had. ", "Food looked like a deep fried hash brown and no pork at all or no trace of other vegetables at all. ", "They mixed the shredded pork in sauce (never saw shredded meat in sauce before- only at this place)."], "author": "Don P.", "review": "I ordered a pork egg foo young and the worst egg foo young i had. Food looked like a deep fried hash brown and no pork at all or no trace of other vegetables at all. They mixed the shredded pork in sauce (never saw shredded meat in sauce before- only at this place).", "rating": 1, "date": "2018-02-24"}, {"excerpts": ["I recommend the shrimp egg foo young. ", "Hard to find in the Bay Area ", "but it is so good!  ", "One of my favorite dishes here."], "author": "Frequent T.", "review": "I recommend the shrimp egg foo young. Hard to find in the Bay Area but it is so good!  One of my favorite dishes here.", "rating": 4, "date": "2016-07-01"}, {"excerpts": ["We ordered vegetarian spring rolls, broccoli with garlic sauce, foo young vegetarian and vegetable delight. ", "A friend had the lemon chicken. ", "Service was quick and efficient. ", "Came with free soup, tea and sesame balls for dessert with fortune cookies. ", "Food was affordable, but nothing great. ", "As others have mentioned, seemed to have the same brown sauce for everything! ", "Doubt if i would visit again."], "author": "Sara V.", "review": "It was ok.. We ordered vegetarian spring rolls, broccoli with garlic sauce, foo young vegetarian and vegetable delight. A friend had the lemon chicken. Service was quick and efficient. Came with free soup, tea and sesame balls for dessert with fortune cookies. Food was affordable, but nothing great. As others have mentioned, seemed to have the same brown sauce for everything! Doubt if i would visit again.", "rating": 3, "date": "2015-07-11"}, {"excerpts": ["Egg foo young was just okay. ", "Lettuce wraps were okay. ", "They were fast on delivery and friendly."], "author": "Piper W.", "review": "I didn't like this Chinese food. Salty yet flavors were off on generals chicken and chow mein. Egg foo young was just okay. Lettuce wraps were okay. They were fast on delivery and friendly.", "rating": 2, "date": "2014-01-26"}, {"excerpts": ["Egg Foo Young? ", "Check! ", "It has been exceedingly difficult to find Chop suey and egg foo young at San Francisco Chinese food restaurants although I have researched and it seems the dish was invented here. ", "Well, these dishes are mainstays at Chicago take out Chinese restaurants "], "author": "Lem B.", "review": "Chop suey? Check! Egg Foo Young? Check! It has been exceedingly difficult to find Chop suey and egg foo young at San Francisco Chinese food restaurants although I have researched and it seems the dish was invented here. Well, these dishes are mainstays at Chicago take out Chinese restaurants and I was really interested in eating it here in SF.\n\nRed Jade serves both and they are both good; and greasy. I don't try to fool myself. When I go for Chinese, I prepare my stomach and know it may be grease-filled; that's okay. This is definitely flavorful and it is pretty nice ambiance. The wait for food was moderate and it wasn't that crowded. Definitely going to continue to eat here.", "rating": 5, "date": "2014-11-26"}], "shrimp foo young": [], "chicken chop suey": [], "house chop suey": [], "hong kong style pan fried noodle with seafood": [], "chicken chow fun with black bean sauce": [{"excerpts": ["My favorite dishes at Red Jade are the Yee Wor Wonton Soup ($9.50), the Happy Family Special (Jumbo prawns, fresh fruits, and glazed walnuts) at $12.95, and the Chicken Chow Fun with Black Bean Sauce ($8.95)."], "author": "Clayton L.", "review": "If you like Chinese food, don't like noisy restaurants, and are put off by the unreasonably high prices charged by most restaurants in the Castro Street area of San Francisco, then you should give Red Jade a try.\n\nI eat at Red Jade with my spouse and friends several times each month and make use of their take-out service just as often. The food is excellent and the portions are substantial - when we go there we always order more than we expect to eat so that we can take the rest home for future meals.\n\nService at the Red Jade is friendly and efficient. Even when most of the tables are occupied, the noise level is low enough for comfortable conversation - not like most San Francisco restaurants, where you have to shout to talk to the person across the table from you.\n\nMy favorite dishes at Red Jade are the Yee Wor Wonton Soup ($9.50), the Happy Family Special (Jumbo prawns, fresh fruits, and glazed walnuts) at $12.95, and the Chicken Chow Fun with Black Bean Sauce ($8.95).", "rating": 5, "date": "2016-01-21"}, {"excerpts": ["Chicken Chow Fun with Black Bean Sauce - normally my favorite dish at Chinese places ", "but will never order this again here.  "], "author": "Angela D.", "review": "Ordered:\n\nFire House Spicy String Beans with Minced Pork - so minced I didn't see them but the string beans were very good.\n\nChicken Chow Fun with Black Bean Sauce - normally my favorite dish at Chinese places but will never order this again here.  Noodles were all slimy.\n\nPot Stickers - only order if you like them soft.  Not crispy whatsoever.\n\nGreen Onion Pancake - very good\n\nSesame Ball - very good\n\nOverall, will never order from again as the city has too many better Chinese restaurants.", "rating": 3, "date": "2016-02-23"}, {"excerpts": ["General tso's chicken - tends to be a little mushy, but is still ok\nChicken chow fun with black bean sauce - simply rocks. \nsalt and pepper squid - light  crispy batter, squid is never chewy\n\"special crispy tofu with seaweed\" - should be avoided, as it just consists of a few flavorless cubes of fried tofu with a couple of pieces of seaweed thrown in.  \n", "Hot and Sour Soup - "], "author": "Joshua W.", "review": "This place remains my usual choice for delivery Chinese food.  It's nothing amazing, but then delivery Chinese doesn't really have to be.  Let me run down some of the things I've had here.\n\nPot stickers - massive and always worth getting\nMa Po tofu - spiced well and really flavorful\nGeneral tso's chicken - tends to be a little mushy, but is still ok\nChicken chow fun with black bean sauce - simply rocks. \nsalt and pepper squid - light  crispy batter, squid is never chewy\n\"special crispy tofu with seaweed\" - should be avoided, as it just consists of a few flavorless cubes of fried tofu with a couple of pieces of seaweed thrown in.  \nHot and Sour Soup - a bit bland\n\nAnyway, the food is always delivered quickly, and piping hot.  Plus with any order of $20 or more they throw in free char siu bao!  I'm a sucker for freebies, so given that, the tasty food, and the convenience of ordering on delivery.com means you have no excuse not to give Red Jade a try if you're in their delivery area.", "rating": 4, "date": "2008-12-22"}], "singapore style rice noodle": [], "house special dim sum lunch": [], "curry chicken lunch": [], "kung pao chicken lunch": [], "vegetarian delight lunch": [], "garlic chicken lunch": [{"excerpts": ["Garlic Chicken Lunch Special : "], "author": "Rachit A.", "review": "Ordered :\nGeneral Tso's Spicy Boneless Chicken Lunch Special : 3/5\nMongolian Lamb Lunch Special : 2/5\nGarlic Chicken Lunch Special : 2/5\n\nWill order again : 2/5 NO\nFood was pretty bland and tasteless.", "rating": 2, "date": "2014-09-07"}], "lemon chicken lunch": [], "general tsos spicy boneless chicken lunch": [], "braised bean curd with mixed vegetables lunch": [], "fried sauteed string bean with minced pork lunch": [], "spicy salted spare ribs lunch": [], "broccoli beef lunch": [], "beef with snow pea lunch": [], "shrimp with mixed vegetables lunch": [], "scrambled eggs with shrimp lunch": [], "scrambled eggs with beef lunch": [], "shrimp with lobster sauce lunch": [], "twice cooked pork lunch": [], "szechuan eggplant with minced pork lunch": [], "cashew chicken lunch": [], "ma po tofu with minced pork lunch": [], "shrimp with black bean sauce lunch": [], "hunan fish lunch": [], "sesame chicken lunch": [], "spicy chicken with basil lunch": [], "portabello mushroom with shrimp lunch": [], "mango beef lunch": [], "mongolian lamb lunch": [{"excerpts": ["Mongolian Lamb Lunch Special : ", "2/5\n"], "author": "Rachit A.", "review": "Ordered :\nGeneral Tso's Spicy Boneless Chicken Lunch Special : 3/5\nMongolian Lamb Lunch Special : 2/5\nGarlic Chicken Lunch Special : 2/5\n\nWill order again : 2/5 NO\nFood was pretty bland and tasteless.", "rating": 2, "date": "2014-09-07"}], "asparagus salmon with black bean sauce lunch": [], "mixed vegetables lunch": [], "eggplant tofu lunch": [{"excerpts": ["I ordered the eggplant tofu lunch special. ", "My co-worker came back from picking it up and at first I thought that they forgot to add tofu ", "and it was only eggplant, which was okay. ", "As I was eating I discovered little pieces of beef. ", "It wasn't just one or two by mistake either. ", "I decided to ditch the entree ", "and I ate the rice alone with soy sauce. "], "author": "Anthony H.", "review": "This is the second time that I ate at Red Jade. The first time It was much better that is why I am putting 2 stars instead of 1.\n\nThe first time, last week, my co-worker and I called to order for pick-up. We both ordered the veggie fried rice with no egg and we added tofu. It was great and a very large portion for a decent price.\n\nWe then decided to call and order for pick-up a second time today. We both got lunch specials which came with rice and soup. I ordered the eggplant tofu lunch special. My co-worker came back from picking it up and at first I thought that they forgot to add tofu and it was only eggplant, which was okay. As I was eating I discovered little pieces of beef. It wasn't just one or two by mistake either. I decided to ditch the entree and I ate the rice alone with soy sauce. My co-worker said that his mongolian beef lunch special was \"ok\" and that it felt like it had been sitting out for a while.\n\nThere are plenty of Chinese restaurants in the city and some with a lot more vegetarian options. I understand that mistakes happen, but It is a huge turn off to see meat in my vegetarian dishes.", "rating": 2, "date": "2011-09-11"}], "scrambled eggs with chinese sausage lunch": []}