{"pearl rice cracker prawns": [], "chawanmushi braised pork belly": [], "the rock": [{"excerpts": ["The Rock - we mainly ordered this for the \"cool\" factor of cooking our meat on a hot rock. ", "It seemed quite gimmicky and we assumed we would only be given a few slices of meat, but we went for it anyway ", "and I'm so glad we did! ", "The dish came with a good amount of thinly sliced wagyu beef, and it was soft, tender, and had a great flavor all on its own. ", "Plus, it was fun :P ", "This comes with a trio of sauces - spicy korean sauce (similar to gojuchang), kizami carrot sauce, and cilantro puree (my favorite one). \n"], "author": "Nicole M.", "review": "My fiance surprised me with a date night at Anzu and we had an amazing time here. The ambience is on point, the service is phenomenal, and we really enjoyed our meal. He made a reservation on Open Table, and apparently being an \"early bird\" in the evening meant that we'd get two complimentary glasses of rosé. It was delicious and a perfect level of sweetness.\n\nTitus roll - this wasn't bad, but also not great. I felt that there wasn't enough flavor in the roll itself, although the ingredients tasted fresh (especially the spicy tuna). This isn't something I'd order again because I could get a great sushi roll elsewhere and at a lower price. My fiance wanted to try the Local Motion roll that he saw on Yelp, but the chef was not willing to make it because it wasn't on the current menu. We understood though, and were happy to choose an alternative.\nThe Rock - we mainly ordered this for the \"cool\" factor of cooking our meat on a hot rock. It seemed quite gimmicky and we assumed we would only be given a few slices of meat, but we went for it anyway and I'm so glad we did! The dish came with a good amount of thinly sliced wagyu beef, and it was soft, tender, and had a great flavor all on its own. Plus, it was fun :P This comes with a trio of sauces - spicy korean sauce (similar to gojuchang), kizami carrot sauce, and cilantro puree (my favorite one). \nMisoyaki black cod - absolutely delicious. The fish was cooked perfectly and was very soft and moist. The truffle dashi broth was awesome and we drank all of it at the end. The pumpkin gnocchi had a good bounce to it, and the braised daikon radish absorbed the broth's flavor so well. We both thoroughly enjoyed this.\nTruffle mushroom risotto - this was a side order to supplement our meal. It smelled strongly of truffle, but the actual truffle flavor was lighter. The rice wasn't as soft as usual risotto, but my fiance actually preferred this texture. Finally, there were lots of mushrooms, just the way we like it.\n\nWe ordered the perfect amount of food and were completely satisfied. What made the meal amazing and worthy of that fifth star, however, is the service. Our waiter Acen was extremely nice right from the beginning, always had a smile on his face, and was so attentive to us throughout the meal. When he found out it was our anniversary, he let us choose a dessert item and came out with two glasses of dessert wine. The salted caramel pot de creme was delicious and Acen even wrote out \"Happy Anniversary\" on the plate with chocolate sauce and little crispies. This was a perfect cap to our dinner. David was also wonderful and we really appreciated his great service! He was quick to get us whatever we needed, and he definitely made our meal a fun one with lots of laughter! We loved asking about hobbies shown on everyone's name tags - what a great idea to include that. The hostess in the front greeted us so warmly, and a manager stopped by our table to check in on us. Anzu's staff is top notch and we were very impressed.\n\nMy fiance and I had such a great night, and it is one of the best dining experiences I have had in a while. We will be sharing this place with others and look forward to coming back!", "rating": 5, "date": "2018-02-10"}, {"excerpts": ["Some of my favorite dishes is the beef on the rock, their cod entree, and duck. ", "The plating of all the dishes are beautiful. ", "Chef Chris was also very accommodating of our requests as well as went above and beyond to create such an amazing dessert platter to celebrate special occasions."], "author": "Chelsea H.", "review": "Great atmosphere, service, and food! This restaurant is inside the Nikko Hotel. It's easy to make a reservation. Some of my favorite dishes is the beef on the rock, their cod entree, and duck. The plating of all the dishes are beautiful. Chef Chris was also very accommodating of our requests as well as went above and beyond to create such an amazing dessert platter to celebrate special occasions.", "rating": 5, "date": "2018-08-12"}, {"excerpts": ["We ordered maguro nigiri (me), a sushi roll (him), The Rock (thinly sliced wagyu beef that you cook on a hot rock table side - both), and we eat got a filet in their signature Binchotan grill cooking style. \n\n", "The Rock was okay but nothing amazing. "], "author": "Sheila C.", "review": "I took my husband here for his birthday and it was disappointing. We ordered maguro nigiri (me), a sushi roll (him), The Rock (thinly sliced wagyu beef that you cook on a hot rock table side - both), and we eat got a filet in their signature Binchotan grill cooking style. \n\nThe maguro was not fresh - the fish was tough and chewy. I've had way better sushi in Japantown in San Jose!\n\nMy husband liked the sushi roll and said it was the high point of the meal. \n\nThe Rock was okay but nothing amazing. It came with three sauces and only one was good. \n\nThe steaks were fine (good for filet), but the sides were not. My wasabi mashed potatoes were yummy but cold and my Brussels sprouts with pancetta had one tiny piece of pancetta. His mushrooms and truffle Mac n cheese we're both very bland with no flavor. \n\nHe did really enjoy the free dessert they gave him (caramel pot de crepe) and I liked the Nutella bread pudding (although it could've used more Nutella).\n\nThe atmosphere was very nice and the staff were all super accommodating and nice. But it was $$$$ in terms of price and I didn't feel happy with the meal overall. I wasn't pissed, but I wouldn't return.", "rating": 3, "date": "2018-04-09"}, {"excerpts": ["I started with \"The Rock\", a stone heated to 400F on which you could cook thin slices of Wagyu beef. ", "It was fun, entertaining and delicious. "], "author": "Sarah T.", "review": "I visited Anzu for SF Restaurant Week with some friends and am so glad to have tried this gem of a restaurant! Anzu is tucked away in the glamorous Hotel Nikko and boasts a classy, upscale ambiance with fantastic service. The food, while on the pricey side is very good. I'm already planning my next trip back!\n\nFood:\n1. Unfortunately, the Restaurant Week menu was disappointing. For $40 you received a Bean Salad starter , Crusted Tuna Entree and a Fondue dessert. The bean salad looked fresh, but uninteresting, and while the crusted tuna entree was very generous, the tuna was under seasoned and tough. In short, I would not recommend coming to Anzu for Restaurant Week. \n\nTheir ala carte menu on the other hand, was very good. I started with \"The Rock\", a stone heated to 400F on which you could cook thin slices of Wagyu beef. It was fun, entertaining and delicious. We also tried the Ceviche sampler which was light and refreshing. \n\nFor the main, the waitress recommended the cod which was DELICIOUS. The cod was tender and cooked to perfection in a light dashi broth. I loved my dish and thought it was well worth $26 considering the quality and quantity served. \n\nThe highlight of the night, however was the chocolate fondue. It was a revelation. I have never experienced such deliciousness EVER. The chocolate fondue was nutty, creamy and yet surprisingly light. We polished off almost the entire pot and still wanted more and were extremely perplexed by how light, fluffy and addictive the fondue was. If I was on my own I'd have licked the pot clean :D I would definitely come back just to have their fondue again.\n\nIn short, I had a fabulous experience at Anzu and will definitely be back. I would say you can probably skip over this place for Restaurant Week (Lusk 25 has a much better RW menu), but you should absolutely visit on your own time to try the delectable black cod dish and of course, their fondue.", "rating": 5, "date": "2016-01-21"}, {"excerpts": ["We elected to start with \"The Rock\", which was sliced beef that we cooked on a 400 degree rock.  "], "author": "Marc M.", "review": "Wisdom would say that the best Japanese food would be in a Japanese hotel (Hotel Nikko in this case).  \n\nWe came in on a Monday night.  There were several tables of Japanese business men no doubt celebrating a contract for the next UHDTV, SUHDVD or Walkman :)\n\nOur server, Liz, was a spunky girl from Erie, PA.  She verbally played with us throughout the meal and was well deserving of the 20+% tip we gave her.  Her favorite thing on the menu is the miso black cod.  I am not a FoC (fan of cod), plus we were there for sushi.\n\nThe menu is quite diverse: there is a four course fixe-prix menu ($41) or $65 with wine.  There are \"japanese staples\" like sushi and waygu beef.  We elected to start with \"The Rock\", which was sliced beef that we cooked on a 400 degree rock.  There were a trio of dipping sauces, but it was nothing to write home about.\n\nThe sushi was okay - not great and I hesitate to say it was good enough to order again here.  There were a number of other entrees that I could try.  It wasn't bad, but for a japanese restaurant, I expect better.\n\nThe best part was dessert.  I had the bread pudding, which was more like a pecan pie.  Two guys in our party had the sorbet, which was nicely presented.\n\nWe had good service - not great.  The sushi took a long time to come out, as did the dessert.  I fear that dining patrons later on in the evening were overwhelming the kitchen.  Poor Lize started off with just us and one other table, and then as the evening went on, she was running around like crazy.", "rating": 3, "date": "2015-10-20"}, {"excerpts": ["We decided to order the rock, the pork belly, lobster ravioli, and crispy duck. ", "It was my first time cooking food over a sizzling rock. ", "Quite interesting. ", "The quality of the beef was great. ", "I also enjoyed the lobster ravioli which came in three pieces. ", "The pork belly was alright. ", "I thought the crispy duck was too hard to chew. "], "author": "Christina G.", "review": "A beautiful hotel restaurant. The ambience was quiet and classy, but being casually dressed was okay. I came here with a friend and we had no idea what to expect. We wanted to try the happy hour, but learned that it was only available at the bar and had already been seated.\n\nWe decided to order the rock, the pork belly, lobster ravioli, and crispy duck. It was my first time cooking food over a sizzling rock. Quite interesting. The quality of the beef was great. I also enjoyed the lobster ravioli which came in three pieces. The pork belly was alright. I thought the crispy duck was too hard to chew. I was worried that we would be too full because we had previously eaten a late lunch, but turned out to not get too full off dinner. \n\nOverall this is a nice place with elegant food presentation and a slightly pricy menu. I would come back again next time and try the desserts.", "rating": 4, "date": "2015-09-22"}, {"excerpts": ["To start, we ordered a half dozen oysters and the rock (wagyu beef cooked on a hot rock). ", "The oysters were solid - nothing really special but still good oysters. ", "The rock was really cool to see and fun to cook at the table, but I thought as a dish "], "author": "Andy H.", "review": "I do a good amount of fine dining, so I think my expectations are a bit on the higher side, but I didn't really leave this restaurant thinking I had a great dining experience. I think 3.5 stars is the accurate rating for this restaurant. \n\nTo start, we ordered a half dozen oysters and the rock (wagyu beef cooked on a hot rock). The oysters were solid - nothing really special but still good oysters. The rock was really cool to see and fun to cook at the table, but I thought as a dish it was pretty lacking in flavor. \n\nWe also ordered the 15pc sashimi platter. I think this was definitely one of the better dishes of the night. They give you a lot of variety and the fish is pretty good.\n\nWe also ordered the ANZU roll, which they forgot to give to us so we ended up eating it after all our entrees which was not a big deal, but not ideal either. The roll itself was okay - I had high expectation for it but I was a bit disappointed. \n\nAs for our entrees, we got the black cod, the risotto, and the beef strip loin. The black cod had good flavor and came in a nice broth with a bunch of vegetables, but it was really small. And all of us left the restaurant not really full, and I think that's mostly because of how small the cod was (we all shared). The risotto was great, definitely one of the better dishes. They don't use rice - it's something with more of a wheat texture, which actually made it really interesting. The beef strip loin was good. Some bites I thought were great and some were just okay. Although I do feel it came out kinda lukewarm. \n\nFor dessert we ordered the pot de creme, pavlova, and bread pudding. My personal favorite was the bread pudding, but a lot of us also really liked the pot de creme. Pavlova was pretty good as well. \n\nNone of the dishes were bad, but the fact that all 5 of us left not really full (some still wanted to eat afterward) was the biggest thing, especially since we ordered so much (4 courses). \n\nThe ambiance and the service, however, are really nice - so it's definitely worth a visit.", "rating": 3, "date": "2016-05-09"}, {"excerpts": ["The rock is amazing, the 35 sushi price plate amazing, the wasabi mash amazing, great place to eat even if you aren't staying at the hotel :)"], "author": "Tony G.", "review": "Went there last weekend, amazing food. The rock is amazing, the 35 sushi price plate amazing, the wasabi mash amazing, great place to eat even if you aren't staying at the hotel :)", "rating": 5, "date": "2017-10-03"}, {"excerpts": ["The Rock - where one self-cooks thin slices of Wagyu beef on a hot rock the shape and size of a bsked potato. ", "The rock wasn't hot enough to caramelize the meat, and cooled from there, so it was more warning meat than cooking. ", "(In contrast,  recently in the UK, we had a hot rock caramelize a steak & continue to cook it.) ", "The beef, cut to the size of a postage stamp, was strangely tasteless. "], "author": "Michael S.", "review": "Had high expectations for restaurant in a Nikko hotel. Poor execution; regret; warning to others.\n\nThe Rock - where one self-cooks thin slices of Wagyu beef on a hot rock the shape and size of a bsked potato. The rock wasn't hot enough to caramelize the meat, and cooled from there, so it was more warning meat than cooking. (In contrast,  recently in the UK, we had a hot rock caramelize a steak & continue to cook it.) The beef, cut to the size of a postage stamp, was strangely tasteless. The three simple, lackluster sauces made a bad situation worse.\n\nKampachi Carpaccio - has jalapeño & lemon, but rather than spicy the mouth feel is unappealingly bitter.\n\n72-Hour Beef Cheek - billed as \"like pot roast\" it had a texture of tongue, with the additional charm of gristle. Sent back; staggeringly unappealing.\n\nCrispy Skin 38 North Duck Breast - didn't have crispy skin, not seasoned, but rescued by the accompanying sauce.\n\nTitus Roll - honeybunny substituted mango for cucumbers: tasty roll, reasonable portion. Would eat again.\n\nTried to blame Groupon for a \"mandatory 18% tip\" added to bill. Upon being shown no such clause in the fine print, reluctantly removed unearned tip.\n\nVerdict: with so many places with better kitchen execution & more attentive wait staff, take your business elsewhere.", "rating": 1, "date": "2015-10-06"}, {"excerpts": ["We all shared The Rock, which seemed interesting and fun.  "], "author": "Karen L.", "review": "I was here for SF Restaurant week back in January but I opted to order from the regular menu instead.  While my friends ordered from the special menu, the items didn't seem to be worth the price.  \n\nWe all shared The Rock, which seemed interesting and fun.  However, entertaining as it was to grill pieces of beef on a hot rock, the three sauces that accompanied them were quite tasteless, we couldn't quite differentiate the difference between the three.\n\nFor my entree, I decided to get the 38 North Duck Breast.  Small pieces of duck but it was tender.  I couldn't quite make out which was the chestnut puree in the things that came along with it, but they were all delicious.  My highlight was the Bread pudding.  Dessert is $9, but it was definitely worth the price compared to the Petite option from my friends' SF Restaurant week menu.  It was delicious and is a big enough portion to share.\n\nBefore leaving, we were given a free cupcake.  We were all quite full already, but it's a nice gesture.  The restaurant is in Hotel Nikko, so look that up before coming here.", "rating": 3, "date": "2015-03-02"}, {"excerpts": [", The Rock (winning), and the salted caramel pot de creme (extra winning!!!). \n\n"], "author": "Sarah G.", "review": "I don't understand why the overall rating isn't higher! Maybe we chose our food especially well, but everything I ordered for dinner was exceptional. We went with the 4-course dinner with wine pairings (winning), striped bass nigiri (winning!), the mussels (winning!!), The Rock (winning), and the salted caramel pot de creme (extra winning!!!). \n\nDid I mention the caramel? \n\nEverything was perfect, from presentation to taste, the wine pairings well-chosen, and our server, Liz, needs a raise or a bonus and a commendation and a vacation or multiples of whatever Anzu has decided to reward stellar employees with, because she was seriously one of the best examples of waitstaff that I have ever seen.", "rating": 5, "date": "2016-01-06"}, {"excerpts": ["The rock - thinly sliced wagyu beef with three different kinds of sauce ( cilantro, kizamo carrot and spicy korean)\n"], "author": "Latifa S.", "review": "Girls night dinners in a perfect atmosphere! \n\nI've been to Anzu about 4 times now. First time I came here was over a year ago and I loved it so much, I came back three more times on my SF trips last year.\n\nAnzu is beautiful. I love their decor. It is located in Hotel Nikko right in Union Square. First time around, we took a cab from our fisher's man wharf hotel and the cab driver didn't know where it was. It was hard to see the sign from the street but the past few times, I've stayed at Hotel Nikko and it was a much easier way to get here.\n\nDecor~ beautiful! White coushy chairs, white couches. All white! \n\nService~ One of the waiter not only recognized me from my previous visit, he actually remembers my name. As I did his! He was so impressed, he bought me my favorite dessert from there. Insert a child like gleeeee for days! :)\n\nFood~ this isn't jut a sushi place. We had uni, we had oysters, we had lamb chops! So many things on their menu and got to try them all. Menu also did change in the past year or so but no complains here.\n\nStarters \nCeviche - sea bass with chillis and tobiko, Nice!\nKampachi carpaccio - this was so refreshingly good. I love the jalapeno kick.\nThe rock - thinly sliced wagyu beef with three different kinds of sauce ( cilantro, kizamo carrot and spicy korean)\nUni (2 pieces)\n\nMain\nMisoyaki black cod - yummm!\nTitus roll - with spicy tuna, cilantro and ponzu sauce.\nDuck! Love my duck entree here. Duck breast with poached cranberries and yummy jus. Of course you'd have to love this.\nStriped sea bass with lobster sambal sauce. That was delish too.\nAnd 15 piece sashimi that I can't recall. All I remember was they all tasted so refreshing. \n\nAnd my favorite part. Don julio shots and dessert. The macarons and italian coffee were all great. As well as the white chocolate mousse but the star? The star of all the dessert is - THE FOG!!! \n\nIt's like entering a magical Forrest covered in fog. It also came to your table in such a fantastic presentation, you won't care what it taste like. But thank god, it has dark chocolate ( I discriminate on all the other kinds of chocolate except this), banana cream and butternut scotch sauce. Oh the picutresssss. Yes, I have many fog covered pictures from every possible angle. \n\nThey also stayed open late for us for a few times. Like I said, service is fantastic. And if I remember correctly, Ben was our rocking server. (Can't remember now-doh!) It was a pleasant, relaxing experience(s) that will you make you ooh and ahh for the entire time. Either that or I'm just being me and my super excited self for food. Either way, I love Anzu! You should too :) Definitely is a little higher on the pricey side but experience makes it worth it. Yumm Yumm yummm. Can't wait to get lost in that fog again.", "rating": 4, "date": "2014-01-13"}, {"excerpts": ["We then cooked the beef right at our table by placing it on the rock and dipping it into some complex sauces. "], "author": "Ross H.", "review": "If this place was \"just\" a sushi restaurant, all I would give it would be 4 stars. Sushi is usually either good or bad- and the sushi here is good. They do go the extra mile and customize their rolls a bit, the Titus was the best.\n\nWhat really won me over for the food was the presentation of the apps and deserts. The wagyu beef strips came to our table with a smoking (steaming?) hot rock. We then cooked the beef right at our table by placing it on the rock and dipping it into some complex sauces. For desert, the brownie came out with a dry ice fog pouring out of the plate - again, adding to a dining experience.\n\nAdditionally, the servers did a great job of being attentive without being intrusive- thats a fine line to walk. Also, the seating is really comfortable - I think that is overlooked in many restaurants.\n\nHonestly, I was skeptical at first given the history of reviews. But a friend recommended and mentioned they had a change in management - I'm glad I gave it a chance for date-night.", "rating": 5, "date": "2013-11-24"}, {"excerpts": ["We had the Rock, Anzu Roll, Salmon and Seabass. ", "The Rock is a must try: wagyu beef grilled on River Rock at your table - it is delicious"], "author": "Minna W.", "review": "We had the Rock, Anzu Roll, Salmon and Seabass. The Rock is a must try: wagyu beef grilled on River Rock at your table - it is delicious", "rating": 4, "date": "2015-12-15"}, {"excerpts": ["Sigh, I wanted to really like the food but the only thing our table ooo'd over was The Rock. ", "It was very intriguing and tasted very good. ", "I ordered the Crispy Duck Breast and it was literally three small pieces of breast. ", "It was slightly undercooked, very red and chewy. ", "The duck confit that came with it looked like dog food or my table said \"a protein bar.", "\" ", "My fiance and my bff had the Pan Roasted Atlantic Salmon. ", "The size of the salmon was very inconsistent. ", "My bff's salmon was noticeably bigger than my fiance's. ", "The salmon was dry and very salty in some parts, very inconsistent with flavor. ", "My bff's bf dish was probably the best. ", "He ordered the Short Ribs. "], "author": "Serena F.", "review": "Three stars are mainly for service. I was given a restaurant.com gift certificate and I invited my fiance along with my bff and her bF. \n\nService was fantastic. I couldn't ask for a better server. She was genuine and did not make us feel awkward or uncomfortable.\n\nFood. Sigh, I wanted to really like the food but the only thing our table ooo'd over was The Rock. It was very intriguing and tasted very good. I ordered the Crispy Duck Breast and it was literally three small pieces of breast. It was slightly undercooked, very red and chewy. The duck confit that came with it looked like dog food or my table said \"a protein bar.\" My fiance and my bff had the Pan Roasted Atlantic Salmon. The size of the salmon was very inconsistent. My bff's salmon was noticeably bigger than my fiance's. The salmon was dry and very salty in some parts, very inconsistent with flavor. My bff's bf dish was probably the best. He ordered the Short Ribs. Good portion size and with my bff picking off his plate shows an idea of how good it is. \n\nDessert was offered but we didn't take it. With the gift certificate, each couple still had to pay about $65. We were not impressed. \n\n*Tip : Complimentary 2h valet with restaurant.", "rating": 3, "date": "2015-02-04"}, {"excerpts": ["We started with The Rock which was as entertaining and elegant as it was delicious. ", "The Cod was was tender ", "and I am convinced that I will never taste a better dashi in my life. ", "My desert was the cheese plate which included cheeses from a local creamery, grapes, lightly toasted bread, and some sort of palate cleansing baked pineapple with cinnamon. "], "author": "Andy G.", "review": "Food: Beyond compare! We started with The Rock which was as entertaining and elegant as it was delicious. The Cod was was tender and I am convinced that I will never taste a better dashi in my life. My desert was the cheese plate which included cheeses from a local creamery, grapes, lightly toasted bread, and some sort of palate cleansing baked pineapple with cinnamon. All of these are HIGHLY recommended!\n\nDrinks: Full bar, impressive wine list, quality beer on tap, and master mixologists. My drink for the evening was the Spicy Kappa, which is an absolute must for anyone who enjoys good Mezcal.\n\nService: A strong balance of friendly, informative, helpful, polite, and graceful from the moment we talked to the hostess to our last steps out the door. At the end of our meal our waiter presented us with a beautifully wrapped vanilla cupcake with an apricot vanilla frosting topped with blueberries. A perfect ending!\n\nAmbience: Intimate, sophisticated, classy, quiet, and romantic.\n\nIf I were a richer man, I would come here at least once a week. Any more than that and I might get spoiled!", "rating": 5, "date": "2015-01-10"}, {"excerpts": ["Then, the Rock, which was so much fun to do. ", "My friends ordered Scallop Yaki, which they said was only okay (chopped scallop fried) and ANZU Ssam, which she said was only okay too (sauces were the best part and I stole them for my Rock). ", "I also had the Titus roll, which was pretty good but a lot of different flavors going on - lime, jalapeno, etc. "], "author": "Cari R.", "review": "We stopped here before our red eye after our Napa trip and were able to check our baggage with the bellhop - HUGE. We could walk around a bit before dinner without being weighted down. Dinner was fantastic. The bartender was super nice and the waiter was incredibly friendly and helpful. I ordered the special cauliflower soup, which was probably the best cauliflower soup I've had. Then, the Rock, which was so much fun to do. My friends ordered Scallop Yaki, which they said was only okay (chopped scallop fried) and ANZU Ssam, which she said was only okay too (sauces were the best part and I stole them for my Rock). I also had the Titus roll, which was pretty good but a lot of different flavors going on - lime, jalapeno, etc. My friends both ordered the Grilled Filet of Brandt Beef, which was melt in your mouth delicious. \n\nWe were told by our waiter that the restaurant and hotel are shutting down in late December for three months to accommodate upgrades that will make the hotel/restaurant 5 stars. I would definitely come back. \n\nNotes: $25 corkage fee if you bring your own wine bottle. They also have a cook book!", "rating": 5, "date": "2016-09-07"}, {"excerpts": ["Came here for the first time and shared The Rock as an appetizer in which we were served thinly sliced wagyu to cook on a sizzling hot rock. ", "It was great, but nothing spectacular & definitely was not worth $18. ", "For my main dish, I had the salmon which also was delicious but nothing memorable. "], "author": "Yvette H.", "review": "Mmmm!\n\nCame here for the first time and shared The Rock as an appetizer in which we were served thinly sliced wagyu to cook on a sizzling hot rock. It was great, but nothing spectacular & definitely was not worth $18. For my main dish, I had the salmon which also was delicious but nothing memorable. Overall first impression of my dining experience at ANZU was decent, but not a place I would come again.\n\nLittle did I know that my date for Valentine's day made reservations at ANZU. First, I was skeptical about coming here again and also about their set menu. However, I left it up to my date to decide our Valentine's day dinner plans. When we were seated, my date and I decided to get different dishes for each course so we both were able to try more on the menu. My hands down F-A-V-O-R-I-T-E has to be the Wagyu Beef Onglet, cooked to perfection! Everything about that dish: the purple cauliflower mash, heirloom baby carrots, leek fondue (!!!!!), and star anise-shiitake mushroom sauce was impeccable.\n\nI would love to dine here again for another preset menu or just the Wagyu Beef Onglet, but this time, please, I mean PLEASE don't seat me next to a table of drunkards again; it took away from the elegance of the occasion and restaurant.", "rating": 4, "date": "2013-06-12"}, {"excerpts": ["She suggested the Rock as a starter - cook beaf on a stone heated to 400 degrees at your table, and have three dipping sauces. "], "author": "Scott R.", "review": "We had the privilege of meeting Marsha, the head of events for Anzu. She suggested the Misoyaki Black Cod as an entree. No too much food, and the fish will melt in your mouth.\n\nOur waitress was very helpful in guiding us on what to order. She suggested the Rock as a starter - cook beaf on a stone heated to 400 degrees at your table, and have three dipping sauces. For desert, the sticky rice with mangos dish (not sure of the name) was also very good.\n\nOverall, fantastic service, and the food was delicious and well-portioned.", "rating": 5, "date": "2014-08-23"}, {"excerpts": ["The hot rock beef was fun, but the rock cools down fast, so don't dawdle on that one.  "], "author": "Brian T.", "review": "The food and drinks were nice, if a bit pricey.  We spent $140 for two people and I wasn't blown away.  The sushi was tasty but they couldn't make any rolls with soft-shell crab for texture.  There were too many rolls listed on the menu with either mayo or \"crab\" in them.  The hot rock beef was fun, but the rock cools down fast, so don't dawdle on that one.  Dining area ambiance was kind of meh.\n\nComing from Manhattan, I tend to avoid Asian restaurants that don't have Asians in the dining area, but I had a coupon from restaurants.com that I won at a breast cancer cure fundraiser.   It was the first time I tried to use such a coupon and I had two of them, only to be informed that I could only use one of them -- within 30 days!  Not impressed.  I didn't ask for a manager because I didn't want to be a buzzkill for my date, but the server could have offered that I could speak to his manager instead of me having to ask.  \n\nSo I still have a coupon that I can't use anywhere else and apparently I have to go back here to use it since restaurants.com is not responsive to let me use it somewhere else.  I think I will go see if their lunch is priced less obnoxiously.", "rating": 3, "date": "2014-05-28"}, {"excerpts": ["We had a party of 6 and shared the Rock and two rolls of sushi. ", "The sushi and the rock were great. ", "We also had entrees of the filet, crispy duck and veal. ", "The veal had a strong iron flavor and was sub par. ", "The crispy duck was not crispy and just okay. ", "The steak was the only entree anyone enjoyed. ", "Cooked to perfection and tender. ", "So, order the rock, sushi or steak or risk being unsatisfied. ", "The service was also not the greatest. ", "Is was not busy be ", "we continually had to ask other people to grab out server for us. ", "He also told us eel was uni. ", "Eel is not uni my friends."], "author": "Karen A.", "review": "The last time I was at ANZU was in 2013 and this visit was not the same. We had a party of 6 and shared the Rock and two rolls of sushi. The sushi and the rock were great. We also had entrees of the filet, crispy duck and veal. The veal had a strong iron flavor and was sub par. The crispy duck was not crispy and just okay. The steak was the only entree anyone enjoyed. Cooked to perfection and tender. So, order the rock, sushi or steak or risk being unsatisfied. The service was also not the greatest. Is was not busy be we continually had to ask other people to grab out server for us. He also told us eel was uni. Eel is not uni my friends.", "rating": 2, "date": "2015-12-24"}, {"excerpts": ["We started off with The Rock a very tasty and fun appetizer, and then onto some sushi which was fresh and well prepared.  ", "The Titus was my favorite.  ", "For desert we got The Fog, a great presentation with dry ice 'fog.'  "], "author": "Elizabeth G.", "review": "I've eaten here twice now and both times it was a Fantastic experience!  First time was for two.  We started off with The Rock a very tasty and fun appetizer, and then onto some sushi which was fresh and well prepared.  The Titus was my favorite.  For desert we got The Fog, a great presentation with dry ice 'fog.'  This chocolate cake with banana flavor I couldn't get enough of.\n\nThe second time was a group of 10.  Once again the service was exceptional.  And the food fantastic.  We ordered quite a bit so I got to try a little of everything.  More sushi, Tortellini pasta, Duck, Chive Crusted Filet of Beef, Misoyaki Black Cod.  Everything was cooked to perfection!  The cod literally melted in my mouth.  The duck and beef were perfectly cooked medium rare.  Desert we had the fog, one giant macaroon and bread pudding.  The fog was still my favorite, but the others were pretty tasty.\n\nI'm looking forward to my next meal at Anzu!", "rating": 5, "date": "2013-11-24"}, {"excerpts": ["The rock is nice as you are getting a 350 degres stone on your table and you sear your own meat. ", "Lobster salad could have more taste, hamachi and black truffle missing taste. \n", "We would have to go back to make sure that the Sunday chef is not the sous chef who need a bit more seasoning."], "author": "Christophe K.", "review": "We went at Anzu yesterday. Ambiance is nice, service super friendly. Good wine recommendation.\nFood very creative yet mostly missing a kick. The rock is nice as you are getting a 350 degres stone on your table and you sear your own meat. Lobster salad could have more taste, hamachi and black truffle missing taste. \nWe would have to go back to make sure that the Sunday chef is not the sous chef who need a bit more seasoning.", "rating": 4, "date": "2014-02-17"}, {"excerpts": ["We enjoyed \"The Rock\" appetizer which was thinly sliced wagyu beef cooked tableside on a sizzling stone.  "], "author": "Heather C.", "review": "We had dinner here once and breakfast every morning.  Dinner was okay, but definitely not worth the high price tag.  We enjoyed \"The Rock\" appetizer which was thinly sliced wagyu beef cooked tableside on a sizzling stone.  My pasta dish was okay, but some of the ravioli were underdone and had too much of a bite to them.\n\nANZU does have a nice breakfast buffet with both American & Japanese offerings, but I believe it was $30 per person.  Not that nice.  However, since breakfast was included in our room rate, we took advantage and enjoyed it.\n\nIf you're staying at the hotel and don't want to go out, ANZU is just fine.  However, with so many other options in the area, I wouldn't necessarily make this a destination.", "rating": 3, "date": "2013-07-10"}, {"excerpts": ["Because of said Manhattans, I can't really tell you everything we ordered, but we did have The Rock (can you smell what it's cooking?) which was good, but agree with another reviewer that the sauces weren't memorable.  ", "The sushi was fantastic as well as the pork belly."], "author": "Scott C.", "review": "Great food, and exceptional service.  I also really enjoyed the drinks...had a few Manhattans that were top notch (very surprising).  Because of said Manhattans, I can't really tell you everything we ordered, but we did have The Rock (can you smell what it's cooking?) which was good, but agree with another reviewer that the sauces weren't memorable.  The sushi was fantastic as well as the pork belly.", "rating": 4, "date": "2015-03-13"}, {"excerpts": ["The Rock*  ", "the beef was nice and flavorful. ", "The sauces were all different and interesting. "], "author": "Vicki T.", "review": "Anzu* Crab, shrimp tempura, spicy tuna, cucumber, eel sauce, spicy mayonnaise: not the best - crunch on the tempura was good but I generally don't like much sauce on my sushi.\nOcean Green* Spicy scallop, crabmeat, cucumber, tobiko, sea weed salad - this was 2nd best of the 3 rolls we got; the seaweed salad was good on top of the sushi.\nTitus* Spicy tuna, salmon, avocado, cucumber, lime, cilantro, jalapeño, ponzu sauce - best roll, very light and refreshing. could taste the fish and loved the jalapeno on it. \n\nThe Rock*  the beef was nice and flavorful. The sauces were all different and interesting. I think I would order this again for a special occasion.\n\nChilled Kaffir Lime Pea Soup* Rock shrimp, coconut shavings, blood orange oil - I don't like cold soup and I don't know why I ordered it (probably because it sounded cool); wasn't a big fan but the taste wasn't awfully strong or anything.\n\nLobster Raviolo* would not necessarily order again. I'm not sure if its because we had this come out last of the dishes... it just wasn't spectacular, I guess.\n\nRyan, our awesomely cheerful/friendly waiter, overheard that it was my birthday and sent me a complementary dessert:\n\"The Fog\"- Dark chocolate cake, banana cream, butterscotch sauce: it was really good and I would say that I would probably stop by just to have this dessert again and to sit at Ryan's section, just because he was so nice and genuine.", "rating": 4, "date": "2013-07-13"}, {"excerpts": ["--We ordered two and it's too good\n- Truffle Hamachi\n- Sashimi\n- The rock\n- The fog"], "author": "Xiaoyan H.", "review": "The best Japanese restaurant in the area! We total 7 people came here on a Saturday night after watching the biggest Chinese New Year parade.  My friend has been coming to Anzu over  5 years.  We are so grateful that she took us here.  It turned out amazing!   \n\nQuality of the food is the very best along with the sensation taste. The dining environment is quiet and elegant.  The service is great!  David is the most attentive wait I've ever see.\n\nStrongly recommend:\n- Misoyaki Black Cod--We ordered two and it's too good\n- Truffle Hamachi\n- Sashimi\n- The rock\n- The fog", "rating": 5, "date": "2015-03-18"}, {"excerpts": ["The sushi, the sashimi, the soup, the appetizer \"the rock\". ", "All fantastic. ", "The decor was stunning, the entrance grand, the casual lobby chairs that are an elegant white leather. ", "All of it was absolutely amazing. ", "Anzu alone would deserve 5 stars, but "], "author": "Wael S.", "review": "We hosted our prewedding welcome lunch here for 70 guests. It was an absolute smashing success. Everyone- absolutely - everyone loved the food, the hospitality, the light and relaxing atmosphere. The guests didn't have to worry about a thing. It started the wedding festivities on a great foot. The Miso Cod was absolutely to die for. The sushi, the sashimi, the soup, the appetizer \"the rock\". All fantastic. The decor was stunning, the entrance grand, the casual lobby chairs that are an elegant white leather. All of it was absolutely amazing. Anzu alone would deserve 5 stars, but what set's Anzu above and beyond the rest is its staff. \n\nThe absolute star of Anzu though- Marcia Striffeler, who is the event planner and whose husband is the executive chef. We first met Marcia as we were considering Hotel Nikko for a hotel block for the wedding. We then had lunch at Anzu and ended up choosing Anzu (over Cityhouse, Farallon, Yank Sing, and a number of other locations) for the prewedding event. Marcia always made us feel welcome and loved. I wish I could go on about her- We loved her so much, we were considering inviting her to our wedding. \n\nShe helped set us up with a honeymoon room in the hotel, gave us signed copies of Anzu's chef book, set up a food tasting for four, was there personally to supervise the event, calmed us when we freaked out, arranged the tables so everyone was together, advised us on things to do and order, what food will work, and how it will work. She emailed us afterwards, sent us a holiday card, and took care of us each time we returned to Anzu for another meal. We would go to any restaurant where she worked. Add in the fact that Anzu would have earned our business through its food, decor, and reputation, and you never have to go anywhere else.", "rating": 5, "date": "2014-12-28"}, {"excerpts": ["Our appetizer was the rock, a hot rock is brought out to cook some thinly sliced beef yourself, kind of cool. ", "The black cod was very good with a great sauce, and had a dark chocolate mousse with dry ice for effect.  ", "The service was very good."], "author": "Tony M.", "review": "Our appetizer was the rock, a hot rock is brought out to cook some thinly sliced beef yourself, kind of cool. The black cod was very good with a great sauce, and had a dark chocolate mousse with dry ice for effect.  The service was very good.", "rating": 3, "date": "2014-07-18"}, {"excerpts": ["We got the appetizer called \"the ROCK\".  ", "It's a pretty cool concept!  ", "They heat up this black rock to a reallllllly high temperature, so high that you can see the steam coming off of it when it comes out.  ", "You cook strips of sirloin on the rock and dip it into 3 different kinds of sauces.  ", "The rock only stays hot for about 6 minutes, and begins to cool down.  "], "author": "Diane L.", "review": "I mainly chose this restaurant because it seemed like an upscale restaurant that was worth going to on Restaurant.com and the other yelp reviews said this is a famous chef???  I'm not big on knowing famous or great chefs... but I took the yelpers' word for it =P  Regardless of your certificate, you're bound to pay like an extra $70 out of pocket.  The restaurant is in Hotel Nikko, which is in Union Sq.  It's a really nice hotel, and thus, a really nice restaurant, small but nice.  When you walk in, there's a sushi/oyster bar just past the hostess station and in the lounge area.\n\nWe got the appetizer called \"the ROCK\".  It's a pretty cool concept!  They heat up this black rock to a reallllllly high temperature, so high that you can see the steam coming off of it when it comes out.  You cook strips of sirloin on the rock and dip it into 3 different kinds of sauces.  The rock only stays hot for about 6 minutes, and begins to cool down.  I wish they gave you more meat... but nonetheless, it was really good.... and cost an arm and a leg ($18 for the appetizer)!\n\nFor our entrees, we got the miso black cod with risotto in broth.  THIS WAS O-M-F-G  DELICIOUS!!!!!  I really enjoyed this dish.  The fish was cooked perfectly, and had lots of flavor.  To be exact, it is:\nSMOKED BLACK COD \nsmoked misoyaki black cod fillet, kabocha pumpkin and sage risotto, \nhonshimeji mushrooms, edamame, truffle dashi / 27 \n\nWe also got the filet mignon with sweet potatoes, which was ok...  The meat was a little dry, and I would have liked for it to be a little more tender.\n\nThe food was really good overall, and the service was excellent.  I would love to come here again if I had more money =P  With the Restaurant.com gift certificate, I still paid $70 for 1 appetizer and 2 entrees for 2 people.  \n\nParking can be difficult, but you can park about 1-2 blocks away towards the TL and just walk over.  Parking is free at meters after 6, so get there about 6pm and you'll have no problems finding parking.  It wasn't too bad of a walk either.", "rating": 5, "date": "2009-05-29"}, {"excerpts": ["we had The Rock for appetizers which was different and good, but I could use a little bit more Wagyu of course. ", "For entree's I've gotten the Beef Onglet and was always happy with it. ", "Plus the fact that they serve it with my favorite type of steak knife makes the experience even more enjoyable."], "author": "Miko L.", "review": "I've been to Anzu twice now and I always thought its a solid 4* place. The prices aren't that bad and the food is always consistently good. The last time my gf and I went we had The Rock for appetizers which was different and good, but I could use a little bit more Wagyu of course. For entree's I've gotten the Beef Onglet and was always happy with it. Plus the fact that they serve it with my favorite type of steak knife makes the experience even more enjoyable.", "rating": 4, "date": "2011-04-30"}, {"excerpts": ["Don't forget to order the rock appetizer though it is pricey. ", "Everything was good! ", "I'm definitely going back!"], "author": "Dura M.", "review": "Great service and the food was delicious!! My boyfriend still can't find duck confit that's comparable to what he had here. Don't forget to order the rock appetizer though it is pricey. Everything was good! I'm definitely going back!", "rating": 5, "date": "2015-03-31"}, {"excerpts": ["The most memorable thing was \"The Rock\" appetizer: \"Thinly sliced wagyu beef coulotte cooked tableside on a sizzling japanese river stone.", "\" "], "author": "Java G.", "review": "We had a very nice date here quite awhile back. I'm trying to backfill this review, because I had started it on the tab that night and it only consisted of \"Joe had chicken\". Startling! He hardly ever has chicken, he is a beef man. However, I remember we  both really liked our drinks and meals.\n\nI remember we ordered fancy martinis off the drink menu. Unfortunately, I don't remember which ones we had, but whatever they were we liked 'em. \n\nThe most memorable thing was \"The Rock\" appetizer: \"Thinly sliced wagyu beef coulotte cooked tableside on a sizzling japanese river stone.\" It was very tasty, fun presentation, and it gave our night a festive atmosphere. \n\nLooking at the menu now, I'm sure I had the Maguro Poke appetizer for my main dish. I love that stuff, and I always order it if it's on the menu. Mmmm, since it's lunch time, I wish I had some right now! \n\nJoe apparently had the \"Oven Roasted Mary's Farm Chicken\". I remember he enjoyed it. It was pretty good \"for chicken\". :) \n\nI would like to go back there again soon.", "rating": 4, "date": "2011-08-15"}, {"excerpts": ["We ordered Hamachi Trio, Surf and Turf Roll, The Rock, and the Ribeye.\n\n", "The Rock was a fun experience tho! ", "They give you Wagyu beef sirloin that you cook yourself on a hot Japanese rock. ", "The sauces that came with the dish were delicious, as well! ", "One was a pesto, one was a wasabi mustard, and one was a spicey miso. "], "author": "Jean T.", "review": "My boyfriend and I came here for dinner to celebrate Valentine's Day. It was our first time here and weren't sure what to get. We ordered Hamachi Trio, Surf and Turf Roll, The Rock, and the Ribeye.\n\nThe Hamachi Trio was ok...We've had better. The oyster was tiny.\n\nThe Surf and Turf Roll was ok. Couldn't really taste the lobster inside. \n\nThe Rock was a fun experience tho! They give you Wagyu beef sirloin that you cook yourself on a hot Japanese rock. The sauces that came with the dish were delicious, as well! One was a pesto, one was a wasabi mustard, and one was a spicey miso. Our fav was the wasabi mustard!\n\nThe Ribeye was pretty good was well. The side of garlic potato and sweet potato fries were pretty good as well. You can choose your own sauce as well and opted for the wasabi mustard again. Yummy!\n\nOverall, the experience was nice. There was a party of 10 sitting next to us but apparently only available table didnt fit them all. The table they had fit only 6. So my boyfriend and I offered our table so they could combine tables. There were 3 other open table for 2 so it wasn't a big deal for us. One lady from the party of 10 thanked us and the waiter was so grateful that he gave us 2 desserts on the house! The chocolate souffle was pretty good but a little on the sweet side. And the 3 cupcakes were ok, but I'm not really a cupcake person.", "rating": 3, "date": "2011-02-12"}, {"excerpts": ["The Rock: wagyu, with three Japanese sauces:  spicy (Korean sauce) ", "Kazami wasabi  mustard (yum!), and cilantro pesto\n- ", "All 3 are delish!\n"], "author": "Michele T.", "review": "First night in San Fran was a hit!\n\nDinner Selection:\nB.R. Cohn, 2008 north coast silver label, Cab Sav\n- rubber, butter and leather on the nose\n- butter and rubber on the palate, some tartness on first sip\n\nThe Rock: wagyu, with three Japanese sauces:  spicy (Korean sauce) Kazami wasabi  mustard (yum!), and cilantro pesto\n- All 3 are delish!\nWagyu is wonderful, cooked on a hot stone\nOur waiter informed us that the Japanese  waterstone is held in the broiler 24/7 to make sure it's at the right temp to serve and cook Kobe beef.\n\nSeared Striped Bass\n- /w lobster nage,  acorn squash risotto, red carrots and artichokes\n- the lobster nage lightens up the heaviness of the risotto\n- artichoke in the mix is to die for :)\n- using the wasabi dipping sauce with the bass and risotto is excellent! ... Save the sauce!\n\nUpside-down Bartlett Pear Tart\n- /w cinnamon, cookie crust, strawberries and raspberry  purée\nMmmm...awesome finish to the night!\n\nThis was a great dining experience :)", "rating": 4, "date": "2011-03-28"}, {"excerpts": ["The Rock is a nice appetizer, the plating of it however, was done very poorly, and made it difficult to eat. ", "The Caesar was decent. ", "The sushi was average. ", "However, with these prices, I am not coming here for average. "], "author": "David H.", "review": "I went to ANZU for a nice New Years Dinner with my date, given the location and the price, I was ready for great food.\n\nBut, what I got was fairly average food, extremely slow service, and a below average dining experience.\n\nAmbiance. 2/5 The decor is nice but it felt very cramped and while the chairs were nice, the tables were rather cheap (which is concealed by the table cloth). It was annoying to have a rickety table at a place like this. Next, it felt like there was a night club directly below us, as we could hear the distinct UNTZ UNTZ UNTZ of some techno for the first half of dinner. When that went away, we were treated to the rather loud street traffic that is quite audible. The window view is not much to look at and I'm a bit surprised they wouldn't place the restaurant on a higher floor. \n\nService 2/5. While the service was courteous, the way they managed plating was poorly thought out and I spent most of dinner awkwardly reaching for dishes etc. Even though we ordered sushi and appetizers it took over an hour to get the sushi. Our waiter apologized for how long it was taking-- and Sashimi is not exactly the hardest thing to prepare. We also had to wait at the front of the restaurant for a good while with no hostess in sight.\n\nFood 3/5. Very average. The Rock is a nice appetizer, the plating of it however, was done very poorly, and made it difficult to eat. The Caesar was decent. The sushi was average. However, with these prices, I am not coming here for average. A $50 dinner should be an above average experience. \n\nThe entrees also looked average. Nothing seemed to be worth the menu prices.\n\nI have no problem paying for quality, but when you pay for quality, you should get quality.\n\nOverall, 2.5 stars.", "rating": 2, "date": "2010-01-02"}, {"excerpts": ["The have a dish call \"The Rock\" which is a very hot, very large, river stone on which diners place pieces of thinly sliced beef.  ", "It is a little strange, and actually sounds like sizzling fajitas and makes a bit of an oily smoke on the restaurant.  "], "author": "Greg J.", "review": "We dined here pre-theatre on Saturday, February 12, 2011 at 6 PM\n\nThe restaurant is in the Hotel Nikko.\n\nWe ate there pre-theatre, so a bit earlier than normal and we were the second table in the house.  The entry is a little odd, chairs with big fluffy chair covers and white clothed tables, it looks a bit like a lady's afternoon tea than a asian-pacific restaurant.  The actual dining area is more contemporary, but nothing inpiring.  Also, we sat by the window, but the view is really nothing special, you mostly look at the Parc 55 across the street.\n\nOur first courses were dungeness crab chowder and the zinfandel braised veal cheeks.  My partner liked the crab chowder, I thought it a little bland, but ok.  The veal cheeks were flavorful, but a little one note, as the sauce really was the strongest flavor.\n\nEntrees were American Waygu Onglet (with an asked for substitution of the truffled scalloped potatoes) and Pork Belly Pot Roast.  While neither were surprising, they were both very good, deef rich flavor, but possibly a little one-note for the plate again.\n\nWe actually had time and room for dessert and decided on the bread pudding.  To be honest the server did remind us that it had bacon in it, but we didn't really expect it to be so savory.  Mixed with the icecream and whipped cream, it was OK, but not really my taste.  Partially a bad dessert and partially a bad selection on my part, I'll split the difference with them.\n\nWe brought wine and the corkage was $30, a bit high, even for SF, but not the worst I've seen.\n\nWe also didn't try any of the sushi, which looked good and was ordered by quite a few people around us.\n\nOh yeah, one more thing.  The have a dish call \"The Rock\" which is a very hot, very large, river stone on which diners place pieces of thinly sliced beef.  It is a little strange, and actually sounds like sizzling fajitas and makes a bit of an oily smoke on the restaurant.  Diners seemed to like it, but it was a little too much for me.\n\nAll in all, we might dine here again pre-theatre, but it's not a place I would specifically go downtown for (and that is because there are so few good places to eat in the theatre district - which is a shame considering).", "rating": 3, "date": "2011-02-16"}, {"excerpts": ["Get the Rock as an appetizer. ", "It's fun to do and good food ", "(that's all I'm saying aboiut it). ", "The sushi is glorious! ", "The duck is great and almost a little too much food, which is always a good thing. ", "The Waygu was very good, the Bread Pudding is fantastic, and the Green Beans (Haricot Verts) were exceptional. ", "I love a good green bean. ", "My husband said the coffee was incredibly good.  ", "This may be pointless ", "but I love the plates and coffee cups. ", "The restuarant is in the Hotel Nikko which is always awesome. ", "Ohh, I almost forgot breakfast. ", "AWESOME! ", "the buffet is just as good (better) than ordering ala carte. ", "Eggs Bene were delicious and bottomless Mimosas were wonderful too."], "author": "Jessica M.", "review": "Fantastic food, atmosphere and staff. Get the Rock as an appetizer. It's fun to do and good food (that's all I'm saying aboiut it). The sushi is glorious! The duck is great and almost a little too much food, which is always a good thing. The Waygu was very good, the Bread Pudding is fantastic, and the Green Beans (Haricot Verts) were exceptional. I love a good green bean. My husband said the coffee was incredibly good.  This may be pointless but I love the plates and coffee cups. The restuarant is in the Hotel Nikko which is always awesome. Ohh, I almost forgot breakfast. AWESOME! the buffet is just as good (better) than ordering ala carte. Eggs Bene were delicious and bottomless Mimosas were wonderful too.", "rating": 5, "date": "2012-07-23"}, {"excerpts": ["The Rock appetizer - definitely a really fun and yummy highlight on the menu (everything we had was great!)"], "author": "Lacy T.", "review": "5 stars for food, 3 stars on atmosphere, 5 stars for staff. We had a birthday celebration here and the food was incredible, however the atmosphere is lacking. We were there on a Sunday night, so it may have been quieter than normal, but there was just something off about the venue itself. However, would totally go back as the food was AWESOME.\n\nOrder The Rock appetizer - definitely a really fun and yummy highlight on the menu (everything we had was great!)", "rating": 4, "date": "2010-12-27"}, {"excerpts": ["It took a long time to get our second course after finishing our first which was the Rock cooked meat on a hot rock, which was a nice presentation, the meat wasn't great they could have used tri-tip instead of kobe steak ", "and I wouldn't have known the difference, the second course was sushi. ", "6 cuts of fish and a roll which should have taken no time at all. ", "He forgot the miso soup that came with the platter, and when the bill came he charged us for food and cupcakes that we did not order. ", "It must have been from the family that got their food before us even though they came later. "], "author": "may n.", "review": "I have been here twice the first time was on a busy night it took us forever to get a bar stool seat, then forever to get someone to serve us.  The food was good, but it's one of those pretentious places that thinks throwing food on a fancy plate is going to make it worth $10 more than it really is.  We had a poke/chip appetizer, oysters on the half shell, rack of lamb with quinoa, and I forget what else.  The good thing was none of the food was smelly no fishy or gamey smell, presentation was nice I would give it 3 stars, but.... \n\nthe second time we went was on a Sunday evening it was not busy at all, our server was very dimwitted quiet speaking caucasian male. He served another table their food that got there after we did. It took a long time to get our second course after finishing our first which was the Rock cooked meat on a hot rock, which was a nice presentation, the meat wasn't great they could have used tri-tip instead of kobe steak and I wouldn't have known the difference, the second course was sushi. 6 cuts of fish and a roll which should have taken no time at all. He forgot the miso soup that came with the platter, and when the bill came he charged us for food and cupcakes that we did not order. It must have been from the family that got their food before us even though they came later. On top of that he overcharged us for our sushi items. \n\nHe said the prices changed that day, but the menu did not reflect it. I made him change it anyway because he didn't say and the menu didn't say either. The sushi was already overpriced for basic tuna, salmon, hamachi, unagi, shrimp, whitefish at 28$ they wanted to charge 32$ for that plate! The other was a roll they wanted to charge $16 instead of $14 for. Not only did he want to charge for food we didn't order, he forgot the miso soup that came with the platter, and wanted to overcharge for food as well. Needless to say I paid him in an even dollar amount leaving him 14 cents tip. The last thing he said because he saw my girlfriend writing a long critique on the back of the receipt was, \"At least let me give you a discount,\" AFTER I already put my money down.\n\nOn a slow night there's no excuse to give such poor service especially in an upscale restaurant. Had he said he was new there that may have changed my opinion, but he didn't so this restaurant is a FAIL! The only way a restaurant can get away with bad service is if their food is worth the money they charge for it, but this place was not.", "rating": 1, "date": "2010-08-26"}, {"excerpts": ["So \"The Rock\" was cool, though way overpriced.  ", "Our sashimi appetizer was ok, though not the best I've had in SF.  ", "Our server was cool and very attentive, probably because there were only two other couples in the restaurant... ", "I ordered the Miso Butter-Poached Lobster.  ", "The description is basil-ricotta gnocchi, forest mushrooms, micro herbs, tobiko caviar, truffle butter sauce / $29.  ", "I was expecting more lobster with a side of gnocchi.  ", "I was so wrong!  ", "A lot of gnocchi, a little lobster and a lot of money.  ", "The dish was tasty, but I was disappointed by the amount of lobster.  ", "Our bill was $250 for \"The Rock\" and some sashimi, my gnocchi w/ lobster, husband's lamb and a bottle of sake.  ", "Good food, but not worth the price."], "author": "Mrs. G.", "review": "So \"The Rock\" was cool, though way overpriced.  Our sashimi appetizer was ok, though not the best I've had in SF.  Our server was cool and very attentive, probably because there were only two other couples in the restaurant... I ordered the Miso Butter-Poached Lobster.  The description is basil-ricotta gnocchi, forest mushrooms, micro herbs, tobiko caviar, truffle butter sauce / $29.  I was expecting more lobster with a side of gnocchi.  I was so wrong!  A lot of gnocchi, a little lobster and a lot of money.  The dish was tasty, but I was disappointed by the amount of lobster.  My husband got the lamb porterhouse and thought it was good.  \n\nWe came here because it was listed as a romantic restaurant on Open Table... if having hardly anybody else in the restaurant equals romantic, then yes it was that.  It was a bit too quiet and awkward being in a restaurant with only four people in San Francisco.\n\nOur bill was $250 for \"The Rock\" and some sashimi, my gnocchi w/ lobster, husband's lamb and a bottle of sake.  Good food, but not worth the price.", "rating": 2, "date": "2009-07-12"}, {"excerpts": ["My husband was intrigued by the rock cooking, so he ordered that item. ", "A black oval rock is delivered to your table at a zillion degrees. ", "You are advised not to touch it. ", "You place surgically slice pieces of raw Kobe beef onto the sizzling rock and turn them to your liking. ", "Then you dip them in one of three sauces. ", "It was fun and as my husband said, right up my alley because I do all the grilling in the family. ", "The next course I had salmon encrusted with pistachios and black rice with an egg I had to look up ", "(Jidori, a very special chicken) and kizami wasabe beurre blanc sauce with a sprinkling of vegies. ", "Divine. ", "My husband raved about his cod in black truffle sauce and said it was like butter fish. ", "Wine was reasonably priced, service attentive and with good humor. ", "The rock had a lot of takers around us, so it was entertainment! ", "Highly recommend this restaurant and would return again many nights in a row!!"], "author": "Sharon B.", "review": "When I first made reservations for Anzu, I told my husband, \"It's a sushi place, we're in San Francisco, it should be fine.\" Anzu was more than fine and it was much more than a sushi place. Surprise number 1, it's in the Nikko Hotel, one of the finest hotels we've ever stayed in. Surprise number 2, it's nestled away in a quiet corner of the hotel, which made the dining experience more relaxing. Surprise number 3, the menu is not just sushi, but also a blend of Japanese, American and I'm not sure what you call cooking Kobe beef on a rock at the table style. We started with the house special rolls, (the Anzu YUM). My husband was intrigued by the rock cooking, so he ordered that item. A black oval rock is delivered to your table at a zillion degrees. You are advised not to touch it. You place surgically slice pieces of raw Kobe beef onto the sizzling rock and turn them to your liking. Then you dip them in one of three sauces. It was fun and as my husband said, right up my alley because I do all the grilling in the family. The next course I had salmon encrusted with pistachios and black rice with an egg I had to look up (Jidori, a very special chicken) and kizami wasabe beurre blanc sauce with a sprinkling of vegies. Divine. My husband raved about his cod in black truffle sauce and said it was like butter fish. Wine was reasonably priced, service attentive and with good humor. The rock had a lot of takers around us, so it was entertainment! Highly recommend this restaurant and would return again many nights in a row!!", "rating": 5, "date": "2014-10-28"}, {"excerpts": ["We ordered  \"The Rock\", which was a huge disappointment. ", "It sounded exciting on paper but our excitement quickly fizzled once we tried to pick the beef off the rock. ", "We then ordered the Chicken and Salmon from the prefix menu with the Chocolate Torte and Cupcakes as desserts. ", "The entrees were well seasoned and cooked perfectly. ", "The desserts were also good with the torte being the favorite of the two. ", "The Rock appetizer, hard to find (hidden in a hotel)"], "author": "Yan W.", "review": "My friend took me here for a birthday dinner. The restaurant was completely empty when we arrived but it quickly filled up. We ordered  \"The Rock\", which was a huge disappointment. It sounded exciting on paper but our excitement quickly fizzled once we tried to pick the beef off the rock. We then ordered the Chicken and Salmon from the prefix menu with the Chocolate Torte and Cupcakes as desserts. The entrees were well seasoned and cooked perfectly. The desserts were also good with the torte being the favorite of the two. Overall we had a good dinner service.\n\nThe Good: Quite, perfect for a special occasion\nThe Bad: The Rock appetizer, hard to find (hidden in a hotel)", "rating": 3, "date": "2010-07-28"}, {"excerpts": ["The only reason to order The Rock appetizer is to experience cooking your raw meat on a 400 degree rock. ", "The Sushi Combination was nothing special. ", "The main dishes were much better though. \n"], "author": "T K.", "review": "Went here with a group of 7 on a Friday night and had no problem getting a table. The restaurant is in the Hotel Nikko- and like most hotel restaurants the place had zero ambiance. \nAppetizers were overpriced and average tasting. The only reason to order The Rock appetizer is to experience cooking your raw meat on a 400 degree rock. The Sushi Combination was nothing special. The main dishes were much better though. \nOne thing that I did enjoy there was their specialty cocktails. \n\nOverall, I would say there are too many other more interesting restaurants to go to in the City before ever coming back to this place.", "rating": 3, "date": "2009-09-07"}, {"excerpts": ["We began with the Hamachi Crudo, which featured grapefruit and a slice of jalapeño, and The Rock which is the house specialty. "], "author": "Ben W.", "review": "Located in Hotel Nikko, ANZU is elegant in it's setting and its cuisine. We began with the Hamachi Crudo, which featured grapefruit and a slice of jalapeño, and The Rock which is the house specialty. It is literally a glossy smooth black rock, hot to the core, on which you place thin slices of Wagyu sirloin for mere seconds before dipping into a selection of sauces; a unique and impressive start.\n\nI enjoyed the Smoked Black Cod, and Samantha P. ordered the Shiso-Garlic Crusted Lamb. The fish was served over a sort of rough squash puree and a perfect risotto, adding great texture and flavor to the dish. The lamb's piquillo pepper sauce and blue cheese bread pudding were quite memorable as well.\n\nThe service was prompt and transparent, the way it should be, making up for the slightly pricey menu. Ideal place for a good conversation with a dear friend over a bottle of wine and some great food.", "rating": 4, "date": "2008-08-09"}, {"excerpts": ["I went with a large group of friends, and aside from a shared appetizer (\"the rock\") and some shared rolls, we each got an entree, and we put away ", "*", "everything*. ", "This explains the food coma, slowly dealt with for the two following hours over CSI and Gossip Girl. ", "The most memorable dishes were the steak with shiitake bordelaise, the seafood risotto (they really don't skimp on the seafood btw"], "author": "kay v.", "review": "I'm really surprised at some of the low-rated reviews, so all I can say is that perhaps this place is a hit or miss, and that I've been lucky to hit it every time on a good chef day. My most recent trip to Anzu was right before Thanksgiving, and post-dinner the night included laying 3/4ths comatose in my friend's hotel room at Nikko, jeans unbuttoned, trying to force air into my too-full body. That was the closest I've come to eating myself to death, ahh gluttony.\n\nI went with a large group of friends, and aside from a shared appetizer (\"the rock\") and some shared rolls, we each got an entree, and we put away *everything*. This explains the food coma, slowly dealt with for the two following hours over CSI and Gossip Girl. The most memorable dishes were the steak with shiitake bordelaise, the seafood risotto (they really don't skimp on the seafood btw, it was more like a shellfish dish with a little rice), and the amazing succulent pork osso bucco - the meat just slid off the bone. \n\nA big plus for a social diner like myself: it's spacious and great for groups.", "rating": 4, "date": "2008-01-31"}, {"excerpts": ["I think the rock is a little overpriced at $18 for 3oz of sirloin and the dipping sauces are not that great.  ", "Try not to overcook it."], "author": "Amy D.", "review": "Their smoked cod is really something special.  I think that the risotto and broth are not a good combination as the bed for the cod.  The rice soaks up all the broth.  About a year ago, the cod was served with nice vegetables including slices of kabocha squash.  (Yum).\n\nI think the rock is a little overpriced at $18 for 3oz of sirloin and the dipping sauces are not that great.  Try not to overcook it.", "rating": 4, "date": "2009-04-26"}, {"excerpts": ["I ordered the rock appetizer to share. ", "It was a huge hit, should have got two of them. ", "Our server hit us with the standard grat for a large party, so maybe service is better with a smaller table...get the Rock appetizer, get two if you're with more than 4 people."], "author": "Blake H.", "review": "Seven of us went to dinner New Years evening, and we were definitely the loudest table in the restaurant. I knew the service would be questionable when our server told someone they did not have Stella; but then when listing the beers Stella WAS available...and then I had to order our sake 3 times before it came to the table (after appetizers). So, the service wasn't so great. \n\nI ordered the rock appetizer to share. It was a huge hit, should have got two of them. Thinly sliced beef that you cook on a Japanese stone, very fun and delicious. \n\nI split some rolls and sushi with a few people, the rest of the table ordered entrees. They all seemed to be pleased, the sushi/rolls were OK. \n\nOverall, we had a great time and the food was above average. Our server hit us with the standard grat for a large party, so maybe service is better with a smaller table...get the Rock appetizer, get two if you're with more than 4 people.", "rating": 3, "date": "2009-01-02"}, {"excerpts": ["We ordered 3 different appetizers: The Rock (thin slices of beef that you cook on a hot rock, served with 3 dipping sauces), hamachi crudo, and seafood kaiyaki, and all 3 were delicious!  ", "If you go, you MUST order The Rock; it's an experience on its own, and it's good!  ", "The seafood kaiyaki is also an excellent choice. "], "author": "Meg P.", "review": "Anzu's menu recently got an overhaul from new chef, Barney Brown, so my friends and I decided to give it a try.  Overall, I think the overhaul was successful.  We ordered 3 different appetizers: The Rock (thin slices of beef that you cook on a hot rock, served with 3 dipping sauces), hamachi crudo, and seafood kaiyaki, and all 3 were delicious!  If you go, you MUST order The Rock; it's an experience on its own, and it's good!  The seafood kaiyaki is also an excellent choice. We should have ordered more of these when we went.\n\nFor entrees, I decided to go with the grilled lamb, and my friends ordered the black cod, seafood risotto, and grilled salmon.  I absolutely loved the lamb; it was cooked perfectly and the accompanying sauce was very tasty.  However, my friend did not like her cod, which was served in a broth.  I didn't try it so I can't pass judgment on it, but everyone else seemed to like their dish.\n\nThe one part of the menu that needs to be improved is the dessert menu.  There weren't many choices, and being a chocoholic, I always assumed that any dessert menu would have something chocolate-y for me.  Well, the only chocolate-y thing this menu had was a chocolate fondue, which came with marshmallows, macaroons, strawberries, sliced bananas, and something else I can't remember.  The chocolate was good, but I can make fondue at home; I certainly don't need to come to a posh restaurant to get it.  My friends tried the cream puffs, but nobody liked them.  The desserts were the only downside to what otherwise was a perfectly good meal.", "rating": 4, "date": "2007-07-12"}, {"excerpts": ["I would recommend the rock. ", "If you are looking for a Californian cuisine with a Japanese twist, this would be the place to go."], "author": "Summer E.", "review": "Anzu was very friendly and helpful. They served delicious food with a very modern plating. I would recommend the rock. If you are looking for a Californian cuisine with a Japanese twist, this would be the place to go.", "rating": 4, "date": "2013-05-05"}, {"excerpts": ["We ordered the ROCK for appetizer, although it was a little pricy, it was totally worth a try.  ", "It was a fun experience to cook your slices of beef on a sizzling rock.  ", "One recommendation, you got to save the Trio dipping sauce for later, if you were going to order any steak.  ", "The spicy miso and wasabi mustard were the best to combine with your steak entrée. ", "So, hubby ordered the Filet Mignon with Shiitake Mushroom Bordelaise sauce and Roasted Japanese Sweet Potatoes.  ", "Ordered Medium, however, it felt like a medium well to us.  ", "Dipping with sauce we saved from the appetizer, it was still a 4.5 out of 5 stars dish.  ", "Then, my order of Smoke Black Cod really deserved 5 stars.  ", "It was very refresh and the taste was just right.  ", "I finish the whole bowl (consider I usually have half of my dish to go) in no time.  ", "The fish was silky smooth.  ", "The risotto, mushroom and edamame were such a wonderful combination.  ", "Even hubby wants to steal my dish!!!  \n", "Toward the end, they send out a complimentary desert for our anniversary.  ", "What a surprise!  ", "It was also very good, not something you can order from the menu.  ", "Simple, but special.   \n", "Toward the end, there were about 4 tables in the entire restaurant (around 7:00pm).  ", "It was a little sad to see not many tables in a nice restaurant on Friday night."], "author": "Mimi W.", "review": "We had such a great dinning experience in Anzu!  It was our anniversary, and to catch a concert after dinner, we made a very early reservation.  5:30 pm was the time the restaurant open for dinner.  We were the first one there, and yes, it was really quiet.  We felt a little odd at first, felt like we booked the whole restaurant.  Anyhow, the hosts welcome us warmly and even said \" Happy Anniversary\" when she was walking us to our table.  The waitress and waiter are totally nice, and very attentive.  \nRegarding the food--I really felt like I was eating in heaven.  Thanks Yelpers for the dish recommendation.  It was awesome!  We ordered the ROCK for appetizer, although it was a little pricy, it was totally worth a try.  It was a fun experience to cook your slices of beef on a sizzling rock.  One recommendation, you got to save the Trio dipping sauce for later, if you were going to order any steak.  The spicy miso and wasabi mustard were the best to combine with your steak entrée. So, hubby ordered the Filet Mignon with Shiitake Mushroom Bordelaise sauce and Roasted Japanese Sweet Potatoes.  Ordered Medium, however, it felt like a medium well to us.  Dipping with sauce we saved from the appetizer, it was still a 4.5 out of 5 stars dish.  Then, my order of Smoke Black Cod really deserved 5 stars.  It was very refresh and the taste was just right.  I finish the whole bowl (consider I usually have half of my dish to go) in no time.  The fish was silky smooth.  The risotto, mushroom and edamame were such a wonderful combination.  Even hubby wants to steal my dish!!!  \nToward the end, they send out a complimentary desert for our anniversary.  What a surprise!  It was also very good, not something you can order from the menu.  Simple, but special.   \nToward the end, there were about 4 tables in the entire restaurant (around 7:00pm).  It was a little sad to see not many tables in a nice restaurant on Friday night.", "rating": 5, "date": "2009-09-14"}, {"excerpts": ["We ordered \"The Rock\", a Wagyu sirloin that was cooked at the table on a sizzling rock. ", "Good dips and wasabe made this a great first choice. ", "We then had a very generous Farmer's Market salad that we could have shared. ", "Great transition from the appetizer. ", "Sushi was fresh and tasty. ", "We decided to split the Wild Salmon entree that while not a whole lot of food for $30 split, was seasoned perfectly and cooked well. ", "Great flavor, great choice. ", "We finished our evening with a smallish key lime tartlet that was incredible. ", "All in all a great evening!"], "author": "Jan G.", "review": "This Hotel Nikko based restaurant was a natural as we were staying in the hotel and had reservations at 10pm at Biscuit and Blues nearby. After taking a minute to seat us, we settled into a nice table in the back of this small open room restaurant. Tastefully decorated we felt comfortable immediately. We ordered \"The Rock\", a Wagyu sirloin that was cooked at the table on a sizzling rock. Good dips and wasabe made this a great first choice. We then had a very generous Farmer's Market salad that we could have shared. Great transition from the appetizer. Sushi was fresh and tasty. We decided to split the Wild Salmon entree that while not a whole lot of food for $30 split, was seasoned perfectly and cooked well. Great flavor, great choice. We finished our evening with a smallish key lime tartlet that was incredible. All in all a great evening!", "rating": 4, "date": "2009-06-10"}, {"excerpts": ["We began with The Rock and a heirloom tomato salad both of which were not only creative but delicious.  ", "Next was Kampachi and the Anzu roll.  ", "They were absolutely flawless.  ", "They were the rock-paper-scissors of outstanding cuisine with each seemingly better than the other.  ", "The dishes were perfectly prepared and beautifully presented. ", "They finished with a tray of absolutely sinful deserts accompanied by \"The Fog\"  In the end, our out of town guests were lavishing superlatives about their experience as we drive them back to their hotel.  ", "Thank you Anzu for one of the best dining evenings we have been privileged to enjoy."], "author": "Michael B.", "review": "My step sister and her husband flew into town ilast evening and my wife and I took them to the Nikko for dinner at Anzu.  We were seated promptly and had some of their very creative cocktails.  We began with The Rock and a heirloom tomato salad both of which were not only creative but delicious.  Next was Kampachi and the Anzu roll.  They were absolutely flawless.  Dinner consisted of the Misoyaki Black Cod, Shizo Crusted Beef Medallion and North 38 Duck Breast.  They were the rock-paper-scissors of outstanding cuisine with each seemingly better than the other.  The dishes were perfectly prepared and beautifully presented. They finished with a tray of absolutely sinful deserts accompanied by \"The Fog\"  In the end, our out of town guests were lavishing superlatives about their experience as we drive them back to their hotel.  Thank you Anzu for one of the best dining evenings we have been privileged to enjoy.", "rating": 5, "date": "2014-09-27"}, {"excerpts": ["I had \"The Rock\" for lunch and it was amazing!! ", "My friends say I have to try one of their martinis so I might have to go back for that."], "author": "Ashley F.", "review": "Stopped at the Hotel Nikko for lunch at their restaurant Anzu. Really enjoyed the atmosphere of the restaurant. All of the employees in the hotel were really helpful directing me to the restaurant and the wait staff was very attentive. I had \"The Rock\" for lunch and it was amazing!! My friends say I have to try one of their martinis so I might have to go back for that.", "rating": 5, "date": "2009-06-17"}, {"excerpts": ["The Rock appetizer is a unique experience worth trying. ", "The fish used in sushi and sashimi are very fresh."], "author": "Erik C.", "review": "(1 visit, from out of town) Great food, a little bit pricey but it's in a hotel (Nikko) so you should expect that. The Rock appetizer is a unique experience worth trying. The fish used in sushi and sashimi are very fresh.", "rating": 4, "date": "2009-07-05"}, {"excerpts": ["We thought the food was great - we had the cod and some makimono (i think it was called titus) and \"the rock\" which was thinly sliced beef on cooking stone. ", "The ambiance was typical stuffy hotel, but service was good. ", "Relatively expensive, I guess, but not really so much so for san francisco."], "author": "hugh k.", "review": "We thought the food was great - we had the cod and some makimono (i think it was called titus) and \"the rock\" which was thinly sliced beef on cooking stone. The ambiance was typical stuffy hotel, but service was good. Relatively expensive, I guess, but not really so much so for san francisco.", "rating": 4, "date": "2007-10-06"}, {"excerpts": ["I've eaten here twice because my daughter loves the appetizer \"THE ROCK\".  ", "It's boring and expensive."], "author": "Tina B.", "review": "I've eaten here twice because my daughter loves the appetizer \"THE ROCK\".  It's boring and expensive.", "rating": 2, "date": "2010-07-06"}], "kabocha pumpkin  miso soup": [], "heirloom beet salad": [], "little gem lettuce": [{"excerpts": ["For starters, I ordered the Little Gems Salad which consisted of little gem lettuce, smoke cured wagyu beef, castroville artichoke, and anchovy-lime gremoulatta.  ", "This was delicious. "], "author": "Al L.", "review": "Was watching a show tonight at The Razz Room and decided to have dinner beforehand upstairs at Anzu.\n\nWe checked in with the hostess and she walked us past the sushi bar to the main dining room.  The decor is very beautiful and the restaurant had a nice ambiance. \n\nFor starters, I ordered the Little Gems Salad which consisted of little gem lettuce, smoke cured wagyu beef, castroville artichoke, and anchovy-lime gremoulatta.  This was delicious. Never had smoke cured wagyu and it tasted like tender beef jerky.  \n\nFor entrees, we ordered the Anderson Valley Ranch Lamb Loin, which consisted of Salina's purple cauliflower puree, blue lakes green beans, brentwood corn, and anis essence.  The order consisted of two good sized loin and was medium rare as ordered.  The lamb was tender and the purple cauliflower puree was different, but went well with the meat.  \n\nOur other entree was the Sonoma Duck Breast which consisted of toy box tomato & braised duck leg salad, balsamic vinaigrette, and creamy risotto. The duck was moist and the risotto was rich and creamy.\n\nService was attentive.  Water glasses were refilled/topped off multiple times and dishes were cleared promptly.\n\nOverall, very good experience.", "rating": 4, "date": "2012-05-09"}], "anzu caesar salad": [], "hour short ribs": [], "flame grilled  north duck": [], "misoyaki black cod": [{"excerpts": ["Misoyaki black cod - absolutely delicious. ", "The fish was cooked perfectly and was very soft and moist. ", "The truffle dashi broth was awesome and we drank all of it at the end. ", "The pumpkin gnocchi had a good bounce to it, and the braised daikon radish absorbed the broth's flavor so well. ", "We both thoroughly enjoyed this.\n", "Truffle mushroom risotto - this was a side order to supplement our meal. ", "It smelled strongly of truffle, but the actual truffle flavor was lighter. ", "The rice wasn't as soft as usual risotto, but my fiance actually preferred this texture. "], "author": "Nicole M.", "review": "My fiance surprised me with a date night at Anzu and we had an amazing time here. The ambience is on point, the service is phenomenal, and we really enjoyed our meal. He made a reservation on Open Table, and apparently being an \"early bird\" in the evening meant that we'd get two complimentary glasses of rosé. It was delicious and a perfect level of sweetness.\n\nTitus roll - this wasn't bad, but also not great. I felt that there wasn't enough flavor in the roll itself, although the ingredients tasted fresh (especially the spicy tuna). This isn't something I'd order again because I could get a great sushi roll elsewhere and at a lower price. My fiance wanted to try the Local Motion roll that he saw on Yelp, but the chef was not willing to make it because it wasn't on the current menu. We understood though, and were happy to choose an alternative.\nThe Rock - we mainly ordered this for the \"cool\" factor of cooking our meat on a hot rock. It seemed quite gimmicky and we assumed we would only be given a few slices of meat, but we went for it anyway and I'm so glad we did! The dish came with a good amount of thinly sliced wagyu beef, and it was soft, tender, and had a great flavor all on its own. Plus, it was fun :P This comes with a trio of sauces - spicy korean sauce (similar to gojuchang), kizami carrot sauce, and cilantro puree (my favorite one). \nMisoyaki black cod - absolutely delicious. The fish was cooked perfectly and was very soft and moist. The truffle dashi broth was awesome and we drank all of it at the end. The pumpkin gnocchi had a good bounce to it, and the braised daikon radish absorbed the broth's flavor so well. We both thoroughly enjoyed this.\nTruffle mushroom risotto - this was a side order to supplement our meal. It smelled strongly of truffle, but the actual truffle flavor was lighter. The rice wasn't as soft as usual risotto, but my fiance actually preferred this texture. Finally, there were lots of mushrooms, just the way we like it.\n\nWe ordered the perfect amount of food and were completely satisfied. What made the meal amazing and worthy of that fifth star, however, is the service. Our waiter Acen was extremely nice right from the beginning, always had a smile on his face, and was so attentive to us throughout the meal. When he found out it was our anniversary, he let us choose a dessert item and came out with two glasses of dessert wine. The salted caramel pot de creme was delicious and Acen even wrote out \"Happy Anniversary\" on the plate with chocolate sauce and little crispies. This was a perfect cap to our dinner. David was also wonderful and we really appreciated his great service! He was quick to get us whatever we needed, and he definitely made our meal a fun one with lots of laughter! We loved asking about hobbies shown on everyone's name tags - what a great idea to include that. The hostess in the front greeted us so warmly, and a manager stopped by our table to check in on us. Anzu's staff is top notch and we were very impressed.\n\nMy fiance and I had such a great night, and it is one of the best dining experiences I have had in a while. We will be sharing this place with others and look forward to coming back!", "rating": 5, "date": "2018-02-10"}, {"excerpts": ["The next course was the misoyaki Black cod and the fish and truffle dashi ", "was good but the pumpkin gnocchi was chewy and had no flavor.  ", "They were willing to make me another batch ", "but I declined.  "], "author": "Vince M.", "review": "Went to dinner during SF restaurant week and the restaurant is in the Nikko hotel and was looked nice.\n\nWe had the prix fixe dinner and this was there chance to win over new patrons and it was not doing it.  First came the arugula salad and I got big pieces of radicchio and small pieces of endive and little pieces of Roquefort; the description did not even have radicchio.  It also had a 1 piece of pickled carrot.  The next course was the misoyaki Black cod and the fish and truffle dashi was good but the pumpkin gnocchi was chewy and had no flavor.  They were willing to make me another batch but I declined.  The dessert was a goat cheese cheesecake and it seem like it was pre made and sat in the fridge for awhile because there a musty ness to it.\n\nThe service was okay but my wife ordered a hot tea and they forgot it.  The server after the first course thought were done with dinner.  It was not that crowded but it seemed like service was slow.  And after I brought up the issues with food they comped my daughters dessert.  \n\nMaybe, I caught them on a bad day but it should not be an excuse on the poor execution of the food preparation.  If they short on arugula don't just dumped radicchio.", "rating": 2, "date": "2018-01-31"}, {"excerpts": ["The food was actually good, but the portions were pretty minimal (we (each) had the Misoyaki Black Cod). "], "author": "Juan R.", "review": "I was there for Restaurant Week. The food was actually good, but the portions were pretty minimal (we (each) had the Misoyaki Black Cod). We had to order more food on top of the special dinner menu because we were still pretty hungry.\n\nBefore ordering the Restaurant Week dinner menu, we considered ordering a regular three course dinner, as the price seemed to be pretty close to the price of the RW dinner menu. There was no beef/pork option there! I had chosen this restaurant because of a picture I had seen on Yelp, and I was disappointed with their selection. To reiterate, what I ended up eating was pretty tasty, so I can't really speak negatively about it.", "rating": 3, "date": "2018-01-26"}, {"excerpts": ["You have to try the misoyaki black cod....", "OMG.  ", "The perfectly cooked and seasoned cod sits on top of edamame wontons, shitake mushrooms, shaved leeks and carrots in a ginger dashi. ", "You can taste each of the elements I just listed - it's very hard to showcase each ingredient and then have all of them work cohesively together in one bite....but this dish does exactly that.  ", "I'm in love."], "author": "Caroline K.", "review": "Sleek, modern, romantic, classy... was the first impression I had upon entering Anzu.  Located on the 2nd floor of Hotel Nikko, there is a full bar and lounge area in addition to the dining area.\n\nThe servers were very attentive, responsive and genuinely NICE.  I don't think my water was every less than half-filled for more than a few minutes.  There's a pre-fix menu where you receive appetizer, soup, entree and dessert so of course I had to indulge. \n\n4 Course Dinner:\n-The cute savory cone filled with spicy ahi tuna topped with tobiko...I wish they would have given me 5 and not just one.  It was sooooo good! \n-They move you on to the soup de jour, which was a white bean and veggie soup.  Be careful - it's hot!  Paired well with the soft, fresh, warm bread and butter.\n-The entree comes as you finish your soup...macadamia encrusted king salmon.  The fish is moist and fresh and sits on top of black rice and a poached egg. I forgot what kind of egg it is, but the yolk is rich and creamy and lends a great flavor to the rice.  The entire dish is pulled together by the wasabi beurre blanc sauce.\n- Just when you feel like you can't eat anymore, they gently place the Sweet Ginger Panna Cotta on the table.  And of course, you have to oblige.  The thing is so damn pretty!  Candied ginger pieces are sprinkled on top of the creamy and refreshing panna cotta.  There's a smear of tart raspberry sauce which balances the dessert and cuts through the slight richness of the panna cotta.\n\nDoesn't this sound so good?  But WAIT.... I saved the best for last.  You have to try the misoyaki black cod....OMG.  The perfectly cooked and seasoned cod sits on top of edamame wontons, shitake mushrooms, shaved leeks and carrots in a ginger dashi. You can taste each of the elements I just listed - it's very hard to showcase each ingredient and then have all of them work cohesively together in one bite....but this dish does exactly that.  I'm in love.", "rating": 5, "date": "2016-02-16"}, {"excerpts": ["I ordered the Misoyaki Black Cod which was delicious.  "], "author": "Jeanie L.", "review": "A lovely place to end our day in San Francisco...\n\nThe bar was beautifully lighted in a calming blue and the ambiance was romantic and intimate.\n\nI'm a gal who loves a great martini!  To start the evening off, I ordered an Apple Martini.  I'm pretty sure that my taste buds were not off, but the martini was not mixed the way I like.  It was a little too tart and had very little apple taste; it was closer to a Grapefruit Martini.  Our waitress gladly took it back to the bartender to tweak it a bit; it was better the second time around.\n\nI ordered the Misoyaki Black Cod which was delicious.  I savored each bite, as it was seasoned and cooked to perfection!\n\nWe also had the Anzu and Titus Specialty Rolls.  They were delicious as well.  \n\nOverall, our dinner was very good.  I'd love to return and try some other items on their menu.  Our waitress was very helpful in guiding us on what to order.  The waiter bringing bread visited us several times, making sure we were never without.", "rating": 4, "date": "2014-03-21"}, {"excerpts": ["Main\nMisoyaki black cod - yummm!\n", "Titus roll - with spicy tuna, cilantro and ponzu sauce.\n", "Duck! ", "Love my duck entree here. ", "Duck breast with poached cranberries and yummy jus. ", "Of course you'd have to love this.\n", "Striped sea bass with lobster sambal sauce. ", "That was delish too.\n", "And 15 piece sashimi that I can't recall. "], "author": "Latifa S.", "review": "Girls night dinners in a perfect atmosphere! \n\nI've been to Anzu about 4 times now. First time I came here was over a year ago and I loved it so much, I came back three more times on my SF trips last year.\n\nAnzu is beautiful. I love their decor. It is located in Hotel Nikko right in Union Square. First time around, we took a cab from our fisher's man wharf hotel and the cab driver didn't know where it was. It was hard to see the sign from the street but the past few times, I've stayed at Hotel Nikko and it was a much easier way to get here.\n\nDecor~ beautiful! White coushy chairs, white couches. All white! \n\nService~ One of the waiter not only recognized me from my previous visit, he actually remembers my name. As I did his! He was so impressed, he bought me my favorite dessert from there. Insert a child like gleeeee for days! :)\n\nFood~ this isn't jut a sushi place. We had uni, we had oysters, we had lamb chops! So many things on their menu and got to try them all. Menu also did change in the past year or so but no complains here.\n\nStarters \nCeviche - sea bass with chillis and tobiko, Nice!\nKampachi carpaccio - this was so refreshingly good. I love the jalapeno kick.\nThe rock - thinly sliced wagyu beef with three different kinds of sauce ( cilantro, kizamo carrot and spicy korean)\nUni (2 pieces)\n\nMain\nMisoyaki black cod - yummm!\nTitus roll - with spicy tuna, cilantro and ponzu sauce.\nDuck! Love my duck entree here. Duck breast with poached cranberries and yummy jus. Of course you'd have to love this.\nStriped sea bass with lobster sambal sauce. That was delish too.\nAnd 15 piece sashimi that I can't recall. All I remember was they all tasted so refreshing. \n\nAnd my favorite part. Don julio shots and dessert. The macarons and italian coffee were all great. As well as the white chocolate mousse but the star? The star of all the dessert is - THE FOG!!! \n\nIt's like entering a magical Forrest covered in fog. It also came to your table in such a fantastic presentation, you won't care what it taste like. But thank god, it has dark chocolate ( I discriminate on all the other kinds of chocolate except this), banana cream and butternut scotch sauce. Oh the picutresssss. Yes, I have many fog covered pictures from every possible angle. \n\nThey also stayed open late for us for a few times. Like I said, service is fantastic. And if I remember correctly, Ben was our rocking server. (Can't remember now-doh!) It was a pleasant, relaxing experience(s) that will you make you ooh and ahh for the entire time. Either that or I'm just being me and my super excited self for food. Either way, I love Anzu! You should too :) Definitely is a little higher on the pricey side but experience makes it worth it. Yumm Yumm yummm. Can't wait to get lost in that fog again.", "rating": 4, "date": "2014-01-13"}, {"excerpts": ["Misoyaki Black Cod and the Striped Seabass were tender!!!\n\n"], "author": "Vee V.", "review": "Second time was a charm! Came here for my bday dinner and the staff were nice and very helpful. Several friends came late and were well taken care of. \n\nAll the nigiri (salmon, hamachi, etc) were fresh, esp the Uni (my all time fav)\nOrdered a bunch of their rolls...one that stood out the most was the Snow Mountain!!  Cherry Blossom and Anzu was just as well presented. Misoyaki Black Cod and the Striped Seabass were tender!!!\n\nWe stayed till the very end and no one gave us 'the look' to get out =)", "rating": 4, "date": "2014-01-30"}, {"excerpts": ["My husband ordered prix fixe ($41) and I ordered the truffle hamachi and misoyaki black cod.\n", "Fresh warm bread with softened butter was gracious way to start the meal. ", "Misoyaki black cod is not to be missed. ", "Served in a broth with edamame ravioli, shiitake mushrooms, and slivers of veggies, it's the quintessential Asian fusion dish. ", "Black cod was perfectly cooked and just the right portion.\n", "The pan seared salmon, which was prepared in a macadamia crust, was exquisite. ", "The texture could be described as \"fluffy\".  ", "Delicate, moist, it was supported by the crust.  ", "Accompanying the fish was a very nice black rice, topped by a poached egg.  \n", "Final touch was panna cotta served with berries. ", "Clean refreshing finish to a delightful meal. \n", "Kudos to waiter Acen for excellent  recommendations and to manager ", "Robert for attention to customer service."], "author": "Liana T.", "review": "Elegant venue inside Hotel Nikko. Everyone starting from the hostess to the waiters, is warm and friendly. My husband ordered prix fixe ($41) and I ordered the truffle hamachi and misoyaki black cod.\nFresh warm bread with softened butter was gracious way to start the meal. Gorgeous presentation of each dish.\n\nTiny poke presented in a silver cone: tiny but tasty. Truffle oil, onion, and caviar complimented the hamachi. The dressing was so good that we soaked it up with bread!\nCaesar kale salad worked well. Parmesan cheese was generously distributed and salad decorated with radish slivers and fried chick peas. The flavorful dressing was perfect for kale.\nMisoyaki black cod is not to be missed. Served in a broth with edamame ravioli, shiitake mushrooms, and slivers of veggies, it's the quintessential Asian fusion dish. Black cod was perfectly cooked and just the right portion.\nThe pan seared salmon, which was prepared in a macadamia crust, was exquisite. The texture could be described as \"fluffy\".  Delicate, moist, it was supported by the crust.  Accompanying the fish was a very nice black rice, topped by a poached egg.  \nFinal touch was panna cotta served with berries. Clean refreshing finish to a delightful meal. \nKudos to waiter Acen for excellent  recommendations and to manager Robert for attention to customer service.", "rating": 5, "date": "2016-01-18"}, {"excerpts": ["She suggested the Misoyaki Black Cod as an entree. "], "author": "Scott R.", "review": "We had the privilege of meeting Marsha, the head of events for Anzu. She suggested the Misoyaki Black Cod as an entree. No too much food, and the fish will melt in your mouth.\n\nOur waitress was very helpful in guiding us on what to order. She suggested the Rock as a starter - cook beaf on a stone heated to 400 degrees at your table, and have three dipping sauces. For desert, the sticky rice with mangos dish (not sure of the name) was also very good.\n\nOverall, fantastic service, and the food was delicious and well-portioned.", "rating": 5, "date": "2014-08-23"}, {"excerpts": ["More sushi, Tortellini pasta, Duck, Chive Crusted Filet of Beef, Misoyaki Black Cod.  ", "Everything was cooked to perfection!  ", "The cod literally melted in my mouth.  ", "The duck and beef were perfectly cooked medium rare.  ", "Desert we had the fog, one giant macaroon and bread pudding.  "], "author": "Elizabeth G.", "review": "I've eaten here twice now and both times it was a Fantastic experience!  First time was for two.  We started off with The Rock a very tasty and fun appetizer, and then onto some sushi which was fresh and well prepared.  The Titus was my favorite.  For desert we got The Fog, a great presentation with dry ice 'fog.'  This chocolate cake with banana flavor I couldn't get enough of.\n\nThe second time was a group of 10.  Once again the service was exceptional.  And the food fantastic.  We ordered quite a bit so I got to try a little of everything.  More sushi, Tortellini pasta, Duck, Chive Crusted Filet of Beef, Misoyaki Black Cod.  Everything was cooked to perfection!  The cod literally melted in my mouth.  The duck and beef were perfectly cooked medium rare.  Desert we had the fog, one giant macaroon and bread pudding.  The fog was still my favorite, but the others were pretty tasty.\n\nI'm looking forward to my next meal at Anzu!", "rating": 5, "date": "2013-11-24"}, {"excerpts": ["For my main, I had the smoked misoyaki black cod fillet (cooked perfectly, nice sauce flavor), kurobuta braised pork belly ", "(this was ok, didn't like the layer of fat right on top so much), daikon cake (not too flavorful", ", I added a little bit of butter to it), pea shoots (good balance to the meal), a side of kimchee (looooved this!!) ", "with a nice glass of Malbec (niiiice!).  "], "author": "Maile N.", "review": "3.5 points rounded up.\n\nIt's amazing how many restaurants there are nearby that I haven't been to - thanks to restaurant.com and their coupons, I have a good excuse to give them a try.  We came here for dinner with a friend, and enjoyed a nice meal together over great conversation.  \n\nLoved the bread and butter - I was starved and probably shouldn't have had 2, but I just couldn't help myself!  For my main, I had the smoked misoyaki black cod fillet (cooked perfectly, nice sauce flavor), kurobuta braised pork belly (this was ok, didn't like the layer of fat right on top so much), daikon cake (not too flavorful, I added a little bit of butter to it), pea shoots (good balance to the meal), a side of kimchee (looooved this!!) with a nice glass of Malbec (niiiice!).  Both my bf and our friend each had the salmon, and they were happy with their tasty dishes.  \n\nNice service, classy ambiance, great location off of Union Square - in all, pretty good.", "rating": 4, "date": "2010-08-06"}, {"excerpts": ["Strongly recommend:\n- Misoyaki Black Cod"], "author": "Xiaoyan H.", "review": "The best Japanese restaurant in the area! We total 7 people came here on a Saturday night after watching the biggest Chinese New Year parade.  My friend has been coming to Anzu over  5 years.  We are so grateful that she took us here.  It turned out amazing!   \n\nQuality of the food is the very best along with the sensation taste. The dining environment is quiet and elegant.  The service is great!  David is the most attentive wait I've ever see.\n\nStrongly recommend:\n- Misoyaki Black Cod--We ordered two and it's too good\n- Truffle Hamachi\n- Sashimi\n- The rock\n- The fog", "rating": 5, "date": "2015-03-18"}, {"excerpts": ["Traits on the menu (such as the truffle-ginger dashi broth that tasted like basic shoyu-dashi broth-on the Misoyaki Black Cod, which tastes as good as $7 mom and pop restaurants in Tokyo) sound better than they are."], "author": "Max H.", "review": "Pretty good food and decent service yet the glass of Cab Sav from Chile I had was the highlight. Kind of motivated me to stop trying to eat good Japanese influenced food in the US, although I guess I knew what I was getting into as soon as I found out the chef was French. Traits on the menu (such as the truffle-ginger dashi broth that tasted like basic shoyu-dashi broth-on the Misoyaki Black Cod, which tastes as good as $7 mom and pop restaurants in Tokyo) sound better than they are.", "rating": 3, "date": "2014-07-21"}, {"excerpts": ["The excellent Misoyaki Black Cod was accompanied by okra, cherry tomato concasse, yamaimo and ginger truffle dashi.  ", "I finished with 'The Fog' a dessert of dark chocolate cake, banana cream and butterscotch sauce. ", "The presentation was great, with supercooled liquid creating a cloud surrounding the dish."], "author": "J M.", "review": "i started by ordering the 2012 Seaglass, a light white Pinot Gris from Santa  Barbara.  The heirloom tomato salad was very good and started the meal off nicely.  The excellent Misoyaki Black Cod was accompanied by okra, cherry tomato concasse, yamaimo and ginger truffle dashi.  I finished with 'The Fog' a dessert of dark chocolate cake, banana cream and butterscotch sauce. The presentation was great, with supercooled liquid creating a cloud surrounding the dish.", "rating": 5, "date": "2014-02-27"}, {"excerpts": ["To be exact, it is:\nSMOKED BLACK COD \nsmoked misoyaki black cod fillet, kabocha pumpkin and sage risotto, \nhonshimeji mushrooms, edamame, truffle dashi / 27 \n\n"], "author": "Diane L.", "review": "I mainly chose this restaurant because it seemed like an upscale restaurant that was worth going to on Restaurant.com and the other yelp reviews said this is a famous chef???  I'm not big on knowing famous or great chefs... but I took the yelpers' word for it =P  Regardless of your certificate, you're bound to pay like an extra $70 out of pocket.  The restaurant is in Hotel Nikko, which is in Union Sq.  It's a really nice hotel, and thus, a really nice restaurant, small but nice.  When you walk in, there's a sushi/oyster bar just past the hostess station and in the lounge area.\n\nWe got the appetizer called \"the ROCK\".  It's a pretty cool concept!  They heat up this black rock to a reallllllly high temperature, so high that you can see the steam coming off of it when it comes out.  You cook strips of sirloin on the rock and dip it into 3 different kinds of sauces.  The rock only stays hot for about 6 minutes, and begins to cool down.  I wish they gave you more meat... but nonetheless, it was really good.... and cost an arm and a leg ($18 for the appetizer)!\n\nFor our entrees, we got the miso black cod with risotto in broth.  THIS WAS O-M-F-G  DELICIOUS!!!!!  I really enjoyed this dish.  The fish was cooked perfectly, and had lots of flavor.  To be exact, it is:\nSMOKED BLACK COD \nsmoked misoyaki black cod fillet, kabocha pumpkin and sage risotto, \nhonshimeji mushrooms, edamame, truffle dashi / 27 \n\nWe also got the filet mignon with sweet potatoes, which was ok...  The meat was a little dry, and I would have liked for it to be a little more tender.\n\nThe food was really good overall, and the service was excellent.  I would love to come here again if I had more money =P  With the Restaurant.com gift certificate, I still paid $70 for 1 appetizer and 2 entrees for 2 people.  \n\nParking can be difficult, but you can park about 1-2 blocks away towards the TL and just walk over.  Parking is free at meters after 6, so get there about 6pm and you'll have no problems finding parking.  It wasn't too bad of a walk either.", "rating": 5, "date": "2009-05-29"}, {"excerpts": ["Dinner consisted of the Misoyaki Black Cod, Shizo Crusted Beef Medallion and North 38 Duck Breast.  "], "author": "Michael B.", "review": "My step sister and her husband flew into town ilast evening and my wife and I took them to the Nikko for dinner at Anzu.  We were seated promptly and had some of their very creative cocktails.  We began with The Rock and a heirloom tomato salad both of which were not only creative but delicious.  Next was Kampachi and the Anzu roll.  They were absolutely flawless.  Dinner consisted of the Misoyaki Black Cod, Shizo Crusted Beef Medallion and North 38 Duck Breast.  They were the rock-paper-scissors of outstanding cuisine with each seemingly better than the other.  The dishes were perfectly prepared and beautifully presented. They finished with a tray of absolutely sinful deserts accompanied by \"The Fog\"  In the end, our out of town guests were lavishing superlatives about their experience as we drive them back to their hotel.  Thank you Anzu for one of the best dining evenings we have been privileged to enjoy.", "rating": 5, "date": "2014-09-27"}], "niman ranch burger": [], "campanelli pasta": [], "sea urchin carbonara": [], "roasted japanese eggplant": [], "jidori organic chicken roulade": [], "crispy skin scottish salmon": [], "bassian farms filet mignon": [], "niman ranch flat iron steak": [], "expresso rubbed hanger steak": [], "biaggio farms pork tomahawk": [], "grilled spicy corn": [], "sauteed wild mushroom": [], "roasted brussels sprout": [], "kaffirlime risotto": [], "garlic whipped potato": [], "kimchi fried rice": []}