{"los idolos decaf colombia": [], "colombian microlots": [], "poor baby seasonal espresso": [], "sweet tooth el naranjo cumbrita el salvador": [], "hunapu guatemala": [], "los horizontes costa rica": [], "sweet tooth": [{"excerpts": ["Got the sweet tooth espresso ($3, tax included) and it wasn't sweet.  ", "Turns out this is what they call their \"coffee of the day\".  ", "Still, it was good.  \n", "It evens comes with a shot of sparkling water as a chaser.  "], "author": "David W.", "review": "Had this bookmarked forever and finally got a chance to come here.\n\nThis place is super classy and very hipster.  Love this about SF.  When will the rest of the bay catch on?! \n\nGot the sweet tooth espresso ($3, tax included) and it wasn't sweet.  Turns out this is what they call their \"coffee of the day\".  Still, it was good.  \nIt evens comes with a shot of sparkling water as a chaser.  Fancy!!!\n\nThey have lots of different coffee cards that explain the different drinks and how to make them.  Very cool and fun! =)\n\nWill be back to try their other drinks.", "rating": 5, "date": "2015-06-30"}, {"excerpts": ["However, I will testify that, \nsour, sweet, or bitter,\nSWEET TOOTH ESPRESSO creates a magical optimal state of mind I have not achieved from any other coffee drink.\n\n", "My morning routine begins with a light jog on the beach of my private island and a sweet tooth espresso."], "author": "Mary L.", "review": "Every espresso I've ever tried has been concentrated sour-awful...my palate's not mature enough to be a coffee connoisseur.\n\nHowever, I will testify that, \nsour, sweet, or bitter,\nSWEET TOOTH ESPRESSO creates a magical optimal state of mind I have not achieved from any other coffee drink.\n\nI predict it will take its place on those lists of habits of successful people: \n\"My morning routine begins with a light jog on the beach of my private island and a sweet tooth espresso.\"\n\nFood coma? Gone. Headache? Gone. Pain, stress and heavy burdens are lifted away after one sip. \n\nThis is the Universe's blessing of clarity, productivity, and positivity in a tiny cup.", "rating": 5, "date": "2016-08-01"}, {"excerpts": ["I bought a pound of the Sweet Tooth expresso for my son, and he said it's the best coffee he's had yet. ", "I agree...reminds me of the coffee that is the norm at the cafés in Italy."], "author": "Shannon S.", "review": "My son asked me to go to Ritual and get him a mug...he heard about Ritual from Adam Savage of MythBusters (me: who's he?). The place is cool...along with a mug (!) I bought a pound of the Sweet Tooth expresso for my son, and he said it's the best coffee he's had yet. I agree...reminds me of the coffee that is the norm at the cafés in Italy.", "rating": 5, "date": "2016-09-03"}, {"excerpts": ["I headed over to the barista making drinks and asked for the Sweet Tooth Espresso. ", "So I order one Sweet Tooth Espresso made with Altos del Abejonal, Costa Rican beans. ", "I assumed this was *sweet* and drank it right away. "], "author": "Rebekah T.", "review": "People will always have a difference in opinion when it comes to our tastes. I admit that my opinion of Ritual Coffee has changed since my last review, so an update is in order. \n\nI met up with friends at Ritual and noticed almost no line for coffee. Nice. I headed over to the barista making drinks and asked for the Sweet Tooth Espresso. He mentioned that it was tiny (showed the little espresso cup) and so I ordered another coffee beverage to balance my coffee fix. \n\nSo I order one Sweet Tooth Espresso made with Altos del Abejonal, Costa Rican beans. I assumed this was *sweet* and drank it right away. It was not sweet, but good and really strong. \n\nMy other beverage, the decaf Cappuchino was up next. Perfectly decorated with a heart, it was adorable. I didn't want to be over caffeinated, so the balance worked perfectly. \n\nLoved both coffee drinks and the heavy metal music selection. \\m/ Yeah!", "rating": 4, "date": "2011-12-15"}, {"excerpts": ["I get the single origin Sweet Tooth (forget where it came from). ", "They take a while to pull the shot. "], "author": "Norman S.", "review": "Walking down Valencia on a Sunday when the street is closed, we chance upon the line outside. Got to be good right? Friend walking with us also recommends it. Of course, I had to try it. \n\nYou wait in line that leads to the barista who takes your order and then you pay after. Wait a few more minutes to get your coffee. \n\nI get the single origin Sweet Tooth (forget where it came from). They take a while to pull the shot. A good sign since single origin coffee takes some effort to pull correctly for a good cup. \n\nTrue enough, this is good stuff. On par with Blue Bottle's single origin. Flavor is a bit different as it's milder, sweeter initial notes, acidic in the middle and clean finish. Beautiful stuff.\n\nNow I know where to find fantastic coffee in the Mission.", "rating": 4, "date": "2013-04-15"}, {"excerpts": ["Going to Ritual Coffee Roasters for a cup of their Sweet Tooth Mocha may now become a SF ritual of mine.\n\n", "Their menu is fairly small but one item caught both our eyes right away and that was their Sweet Tooth Mocha. "], "author": "Craig R.", "review": "Going to Ritual Coffee Roasters for a cup of their Sweet Tooth Mocha may now become a SF ritual of mine.\n\nMy wife and I had been walking around the Mission on a cold, drizzling SF night when we decided we needed something to warm us up.\nRitual was the perfect place. It's big, cozy, and they had lots of available seating even though the place was pretty busy. They also were playing some relaxing music throughout the big dining room. \n \nTheir menu is fairly small but one item caught both our eyes right away and that was their Sweet Tooth Mocha. At almost $5 bucks for a large I was hesitant to purchase this drink but since I saw Ritual has over 1200 reviews on Yelp with an overall 4 star rating, I knew it would be good. \n\nAnd it was. It was not too sweet and not too strong. It was actually perfect. I loved the chocolaty aftertaste I got in my mouth after ever sip. If I lived in SF I may not go here daily because of the high prices but I would definitely come often.\n\nCheck this place out if you're in the area. It's really worth a try if you're into gourmet coffee.", "rating": 4, "date": "2011-12-08"}, {"excerpts": ["I personally liked the more roasted, astringent bitterness (apt given the hipster vibe of the place...) of the seasonal espresso in my latte, but others may want to try the sweet tooth instead. ", "Pay at the second counter, then take your drink and mingle amongst the busy crowd of hipsters on their macs enjoying the free (but unfortunately sort of spotty) wifi."], "author": "Clarice W.", "review": "Nothing crazy here - just some straghtforward, choice coffee. Order an espresso, macchiato, latte, capuccino, mocha, or coffee at the first counter. I personally liked the more roasted, astringent bitterness (apt given the hipster vibe of the place...) of the seasonal espresso in my latte, but others may want to try the sweet tooth instead. Pay at the second counter, then take your drink and mingle amongst the busy crowd of hipsters on their macs enjoying the free (but unfortunately sort of spotty) wifi.", "rating": 4, "date": "2013-03-28"}, {"excerpts": ["Also, if you stop by and they have any of their Sweet Tooth beans available, drink something made with those. ", "It's worth the extra couple of cents."], "author": "Allison S.", "review": "Is it bad that I sometimes go to Ritual Coffee to see if my coffee boyfriend is working? You know who I'm talking about: the blond boy with the eyes and barista skills, the one who once asked me if I wanted him to remake my macchiato because he thought he saw an errant grind in the foam? I hear he's an award winner. \n\nOf course, he's not the only reason to go; the coffee *is* excellent, and this location has a good amount of sitting space and a slightly caffeinated ambiance. The music... excited, let's just put it that way. Busy during rush hours and on the weekends, but the line moves quick enough, and it's a great spot on this side of the Mission. \n\nAlso, if you stop by and they have any of their Sweet Tooth beans available, drink something made with those. It's worth the extra couple of cents.", "rating": 5, "date": "2012-09-26"}, {"excerpts": ["I came here for their single-origin espresso--their current \"Sweet Tooth\", the El Alto.  ", "There is something weird about their unique origin espresso, as my macchiato was very one-dimensional in my opinion.  ", "Overall, the espresso is good, but it was just lacking the subtle nuances and balance of the more conventional espresso blend.  ", "Don't get me wrong--at the hands of a good barista, I have experienced excellent single-origin espresso.  "], "author": "Gail S.", "review": "I came here for their single-origin espresso--their current \"Sweet Tooth\", the El Alto.  There is something weird about their unique origin espresso, as my macchiato was very one-dimensional in my opinion.  Overall, the espresso is good, but it was just lacking the subtle nuances and balance of the more conventional espresso blend.  Don't get me wrong--at the hands of a good barista, I have experienced excellent single-origin espresso.  I might just need a few more tries on this one.  \n\nRows and rows of 12oz bags of coffee beans that were almost a week past roast date. Disappointing. I ended up leaving with a bag of Hacienda Carmona, Guatemala that was roasted a few days prior.  \n\nI wore my square glasses in a veiled attempt to \"fit in\" at this place.  But I think everyone just looked at me thinking, \"Look at that dumb girl wearing square glasses in a veiled attempt to fit in with us.\"  Then they crossed their legs in another fashion in order to readjust their nutsacks in their tight jeans.\n\nThe logo scares me just a little... which makes it awesome.", "rating": 5, "date": "2010-05-13"}, {"excerpts": ["He recommended several coffees including Sweet Tooth and Organic Hama.  ", "The coffees were spot on, not too acidic and not overly strong.  ", "Each coffee on the menu had a description of what it taste like such as: peaches and watermelon, or lilac and lavender.  ", "The coffees I had a sweet note to them, but I wasn't sure if it tasted like the description. ", "Nonetheless I was hooked and decided to buy 1lb each of the coffees I sampled. ", "At $20 a pound it can be a bit pricey, but since I was on vacation I decided to splurge."], "author": "William T.", "review": "Tired of the standard trendy coffee places such as Starbucks, Peet's, and CBT, I decided to see what San Francisco had to offer and found Ritual on Yelp. Deciding to follow the advice of fellow yelpers I trekked over to Ritual and found myself staring at the coffee makers (should I call them baristas?) delicately making coffee through paper cone filters using flasks and then pouring them into 12oz coffee cups. It seemed more like art than anything else I've experienced at the national chains.  The gentleman making the coffee was very helpful as I explained I was a newbie and was looking at specific tastes. He recommended several coffees including Sweet Tooth and Organic Hama.  The coffees were spot on, not too acidic and not overly strong.  Each coffee on the menu had a description of what it taste like such as: peaches and watermelon, or lilac and lavender.  The coffees I had a sweet note to them, but I wasn't sure if it tasted like the description. Nonetheless I was hooked and decided to buy 1lb each of the coffees I sampled. At $20 a pound it can be a bit pricey, but since I was on vacation I decided to splurge.", "rating": 5, "date": "2016-07-15"}, {"excerpts": ["I also tried their Sweet Tooth espresso. ", "It was pretty awesome. "], "author": "Susan J.", "review": "Great Coffee\n\nDaughter and I went coffee crawling in the City after I came up for a conference. They had this  \"Siberia Processing Experiment Coffee #3\" from El Salvador. We tried it and it was pretty good. Had a slightly different taste, but that was okay. I also tried their Sweet Tooth espresso. It was pretty awesome. Second best I've ever had.\n\nComfortable surroundings too. They didn't make you feel like you had to drink and run, like some places do.\n\nDefinitely worth a SHOT when in the City.", "rating": 5, "date": "2013-09-01"}, {"excerpts": ["I did buy a bag of their sweet tooth espresso that I'm excited to try at home, hoping for the same good coffee minus the line of hipsters.\n\n"], "author": "Charlene D.", "review": "My bf saw their coffee menu and was confused, like hold on,  I just want a plain old cup of coffee, why are there 3 of them and is that one really 4 bucks? You sure you wanna go here, I mean I want my coffee to taste like, you know, coffee, not like gooseberries and plums. what the hell is a gooseberry anyway? \n\nThen he has his coffee and we're walking down the street, and he's like, okay, this is pretty damn good coffee. I still don't know what a gooseberry is, but this is good.\n\nI think that just about sums up the Ritual Grounds experience. You wait in a long line, spend three times as much as you would for a cup of coffee, ogle at the hipsters a little, wonder why some people in there are so rude and snooty, can't quite understand how you can describe coffee like wine, then you have the coffee and you kinda get it. \n\nI don't know if I could ever make this my regular coffee place because the ambiance is just a little too hipster for me, though I must say, those robot and donut paintings totally make up for it, because, well, they're just awesome. That said, if I'm in the area and the line isn't too long and annoying, I will definitely get a cup. I did buy a bag of their sweet tooth espresso that I'm excited to try at home, hoping for the same good coffee minus the line of hipsters.\n\nNot like I'm a hipster-hater, I'm in an MFA program in SF, so I have a few hipster friends and the hipster stereotype is far too narrow (hipsters are people too. There's a person behind those thick rimmed glasses and skinny jeans drinking PBR) It's only the  \"I'm too cool for cool\" thing I can't stand. Lighten up, have a cup of coffee and smile once in awhile. \n\nIn short, the coffee is good.", "rating": 4, "date": "2013-02-12"}, {"excerpts": ["The Sweet Tooth is a nice consistent blend.  ", "I usually only get this when I'm not too fond of the seasonal blend.  "], "author": "Anthony L.", "review": "I'm pretty sure I've written a review of my favorite coffee roasters in the City.   It's okay though, I'll rewrite over and over if I have to!\n\nLet me preface by saying that I love Blue Bottle Coffee and that I will not do a disservice to Ritual or Blue Bottle by comparing them to Philz.  don't get me wrong, I like Philz too but THEY ARE DIFFERENT STYLES OF ROASTERS!  Sorry for the caps but I still don't understand why people try to compare them.\n\nRitual happens to be my favorite for the seasonal Blends.  The Hibernator is like Hall of Fame beans.  I'm a sucker for espressos and if you are too, then you must try their seasonals.  Right now, I think it's called the Poor Baby which I think is lacking in flavor and is high in acidity/tartness.  I know a lot of people like that combination for the summer but I miss the richness and cleanness of their past seasonals.\n\nThe Sweet Tooth is a nice consistent blend.  I usually only get this when I'm not too fond of the seasonal blend.  This one is mild yet satisfying with a mild citrus and a bit of creamy aftertaste.\n\nStill my favorite after all these years!", "rating": 5, "date": "2012-06-26"}, {"excerpts": ["I am totally warm for his form and the way he makes my Sweet Tooth (single origin) cappuccino. ", "It's worth the extra dollar ($4 total) to Sweet Tooth-icize your drink order here. \n\n", "Will be back for another Sweet Tooth capp!"], "author": "Kat F.", "review": "Ritual, I've been looking for you, and I finally found you. Deadly sharp coffee served up in a beautiful setting - exactly what I was looking for. \n\nThe blond barista that works here is like a glistening Adonis of a man. I am totally warm for his form and the way he makes my Sweet Tooth (single origin) cappuccino. It's worth the extra dollar ($4 total) to Sweet Tooth-icize your drink order here. \n\nWifi is free and without hassles or limits. There's ample seating for singletons or groups, but don't come here with an uncharged device because plugs are somewhat scarce.\n\nThe hot chocolate needs work - I expected it to taste better but it was very watery and not bitter or rich enough. Will be back for another Sweet Tooth capp!", "rating": 4, "date": "2010-09-17"}, {"excerpts": ["We ordered 2 mochas ($7.50); the friendly brunette recommended the sweet tooth of the month, Chapadao de Ferro from Brasil. ", "Not bad at all. "], "author": "Fancypants X.", "review": "Gah, it is such a SCENE up in here. I know, I know, if I'm so sick of hipsters, why do I keep coming back to the Mission? Because I was here first. I was here before you guys & I will be here long after you & your skinny jeans & weird frames have gone the hell away. I am embarrassed that my old neighborhood has turned into this. \n\nWhat were we talking about? Oh, coffee...so, Sunday, it's raining cats & dogs & the best friend & I stop in for a cup of something warm. We ordered 2 mochas ($7.50); the friendly brunette recommended the sweet tooth of the month, Chapadao de Ferro from Brasil. Not bad at all. Much better than the regular drip we had last week, which was bitter & too acidic & pretty much undrinkable. \n\nWe found an empty table & inhaled our drinks (perfect temperature for immediate drinking, no blowing required.) Like I said, not a bad mocha at all, but I am sticking to Philz & Blue Bottle because their regular drip coffee tastes so much better & that's usually what I prefer over a fancyass mocha anyday. \n\nI don't think I will make a ritual of hitting up Ritual Coffee Roasters every Sunday. However, I *will* continue my Sunday ritual of: sleeping in, getting a short but intense workout in, paying bills, reading a magazine cover-to-cover (this week was my latest copy of \"Everyday with Rachael Ray\") & watching my favorite reality show \"Keeping Up With The Kardashians.\" \n\nWhat's your Sunday ritual? Do tell.", "rating": 3, "date": "2010-02-22"}, {"excerpts": ["As much as I sorta hate to admit it, Ritual's Sweet Tooth Santa Lucia (Brasil) puts a few of my favorite northwest roasters to shame. ", "I will be stockpiling my freezer with more packages soon."], "author": "Ellen T.", "review": "On an out of town visit, I stumbled cross Ritual seeking a place with wifi. The crowd and vibe overall seemed chill and sorta hipstery but overall friendly. I bought two packages of coffee to take back to Seattle on my way out. Holy greatness! Sorry Stumptown Roasters, you're my second favorite roaster now. As much as I sorta hate to admit it, Ritual's Sweet Tooth Santa Lucia (Brasil) puts a few of my favorite northwest roasters to shame. I will be stockpiling my freezer with more packages soon.", "rating": 5, "date": "2012-06-25"}, {"excerpts": ["Try the Sweet Tooth macchiato!  ", "Today it was Sweet Tooth for me...yum."], "author": "Rodel B.", "review": "Try the Sweet Tooth macchiato!  It's the bomb!\n\nI've been going to Ritual since it first opened and I can't believe I haven't praised them yet! This was one of the first coffee joints that I found into the Third Wave Coffee culture. Amazing single origin coffees, awesome latte art, and they host coffee cuppings!\n\nAlthough there are tons of seating, it still has hard to grab a table. So a double espresso shot at the coffee bar is my usual ritual. The coffees are complex, the milk is steamed silky smooth and the latte art is always spot on! I also love that they give you options on espresso for your drinks. Today it was Sweet Tooth for me...yum.", "rating": 4, "date": "2010-07-24"}, {"excerpts": ["Sweet tooth double shot (I forgot which bean it was) - ", "Much better, smoother, more mellow. "], "author": "Kenny J.", "review": "I went back last weekend with a couple friends for coffee. It was the first stop in our Mission progressive for brunch. lol!\n\nSundae espresso double shot - A blend of three beans, fairly acidic, with a tart/bitter finish.\n\nSweet tooth double shot (I forgot which bean it was) - Much better, smoother, more mellow. Good crema.\n\nHad a cup of clover coffee as well. Very good, totally worth it.\n\nThe double shots are pulled extremely short. I've never had such a small double shot anywhere. Blended beans can be hard to pull off for espresso (zoka in seattle is one of the few i would buy blended beans from), so I recommend to stick to single origin if you're gonna have espresso here. Or just get a clover and that will last you much longer. I downed both double shots before my friends even got their coffees. ;P\n\nThere's always a line, so be prepared to wait.", "rating": 4, "date": "2009-09-01"}, {"excerpts": ["(maybe I had the \"sweet tooth\" shot though).  ", "Restroom was alright.  ", "Sparse seating, or maybe it was incredibly busy, but I was surprised how few seats there were for so much square footage.  ", "Cool emblem though, indirectly resembling the old Soviet Union flag somewhat."], "author": "Albert H.", "review": "Espresso just wasn't in the same league as other top rated places in the area (Blue Bottle).  Ritual was much more bitter and if memory serves me well, it actually cost more here too (maybe I had the \"sweet tooth\" shot though).  Restroom was alright.  Sparse seating, or maybe it was incredibly busy, but I was surprised how few seats there were for so much square footage.  Cool emblem though, indirectly resembling the old Soviet Union flag somewhat.", "rating": 3, "date": "2010-10-31"}, {"excerpts": ["Their Sweet Tooth espresso is one of the best I've ever tasted.  ", "Quick and friendly service makes me a repeat customer."], "author": "Abby H.", "review": "Their Sweet Tooth espresso is one of the best I've ever tasted.  Quick and friendly service makes me a repeat customer.", "rating": 5, "date": "2011-11-05"}, {"excerpts": ["Then I tried the Sweet Tooth Espresso fresh ground and brewed at home.  ", "I have never made a cup of coffee that good at home before.  ", "So yummy!  ", "I am sold and  now buy their coffee beans \"ritually\". \n", "I don't really have a problem with the too-cool-for-school \"fixie\" vibe of the place.  ", "It is entertaining, and it is clean and well kept.  ", "The neighborhood around it is wonderful for a walk as well, so I have never stayed to drink my coffee there.  ", "Perhaps I'll try that next."], "author": "Liz R.", "review": "Initially I ignored them because I did not want to stand in line.  One day I stopped for a latte and a slice of vegan banana bread.  All yummy, even the vegan bread.  I went there a few more times.  Always crowded and always good.  I even tried their drip coffee and it was also good.  Then I tried the Sweet Tooth Espresso fresh ground and brewed at home.  I have never made a cup of coffee that good at home before.  So yummy!  I am sold and  now buy their coffee beans \"ritually\". \nI don't really have a problem with the too-cool-for-school \"fixie\" vibe of the place.  It is entertaining, and it is clean and well kept.  The neighborhood around it is wonderful for a walk as well, so I have never stayed to drink my coffee there.  Perhaps I'll try that next.", "rating": 5, "date": "2009-11-02"}, {"excerpts": ["I tried the Sweet Tooth Ethiopian and it was great.   ", "Nice floral and berry like finish."], "author": "Norm P.", "review": "Never tried Ritual's although they have one in Napa.  Never took a chance till now.   I figured, I'm in La Mission, so why not?   I walked in it was freakin' hipsters paradise.  Hipsters with laptops galore.  Whoever made this place is marketing/design genius.  I can see how it's a cool place to hang.  But on to more importantly, the coffee.   Not bad.  Not as good as Blue Bottle.  Definitely not as good as Peets.   But they're not bad.  Above average I'd say.  They have a great selection of single origins.   I tried the Sweet Tooth Ethiopian and it was great.   Nice floral and berry like finish.", "rating": 3, "date": "2010-03-02"}, {"excerpts": ["We got espressos of both types offered (sweet tooth and 33 Amigos), a machiato, a cappuccino, and a latte. ", "The sweet tooth was definitely what it advertised - sweet, bright, acidic. ", "It had a real pop to it and a short but excellent finish. ", "I am at a total loss to describe the 33 Amigos. ", "I keep wanting to describe it as muddy, but I mean it in a good way. ", "It was solid, good body, low acidity. ", "I really liked it. "], "author": "Mitch H.", "review": "6 of us were on an espresso crawl in San Francisco...\n\nStaff were friendly and nice and two people managed to serve the 6 of us quickly and efficiently. Nice.\n\nWe got espressos of both types offered (sweet tooth and 33 Amigos), a machiato, a cappuccino, and a latte. The sweet tooth was definitely what it advertised - sweet, bright, acidic. It had a real pop to it and a short but excellent finish. I am at a total loss to describe the 33 Amigos. I keep wanting to describe it as muddy, but I mean it in a good way. It was solid, good body, low acidity. I really liked it. The other drinks were good, the milk was perfectly steamed, but they didn't blow us away.\n\nIt ranked well in comparison to our usual East Bay haunt, Zocalo Coffeehouse, but the milk based drinks weren't quite as good.", "rating": 4, "date": "2010-04-28"}, {"excerpts": ["They currently are doing a special called Sweet Tooth Espresso, Jan and Feb were amazing.  ", "I stocked up on Jan, it' still my favorite...... "], "author": "Skip L.", "review": "I am not a hipster, I'm just a guy that loves the true flavor of coffee and Ritual has found it(Four Barrels was started by the same crew, so they are on par as well).  \n\nThey understand that an espresso is not a cup of coffee.  It's to be pulled short, a double is to look like a 1/4 of a single, I kid you not, this is how it should be.  The espresso is bursting with flavors, citrus, nuts, chocolate and so on, just depends on the variety they are pulling.  \n\nThey currently are doing a special called Sweet Tooth Espresso, Jan and Feb were amazing.  I stocked up on Jan, it' still my favorite...... It's more expensive, but worth it.\n\nOne last note, avoid the crowd, go early, I'm there at 6:30 and the staff is always fun to talk coffee with!", "rating": 4, "date": "2009-03-04"}, {"excerpts": ["I haven't been there since the changed their espresso blend, but their Sweet Tooth espresso blend was bright, citrusy, and enjoyable as an espresso; its acidic nature allows it to perform in milk as well.  ", "They have friendly baristas with some serious skills - last time I was in, my coffee came from Chris Baca (probably one of the top baristas in the country).  ", "One of the few places I make sure to visit everytime ", "I am in the city."], "author": "Andrew C.", "review": "I haven't been there since the changed their espresso blend, but their Sweet Tooth espresso blend was bright, citrusy, and enjoyable as an espresso; its acidic nature allows it to perform in milk as well.  They have friendly baristas with some serious skills - last time I was in, my coffee came from Chris Baca (probably one of the top baristas in the country).  One of the few places I make sure to visit everytime I am in the city.", "rating": 5, "date": "2009-04-18"}, {"excerpts": ["6/13/08: I picked up a couple pounds of the \"sweet tooth espresso\" and am looking forward to pulling some shots at home."], "author": "Jesse W.", "review": "6/13/08: I picked up a couple pounds of the \"sweet tooth espresso\" and am looking forward to pulling some shots at home.", "rating": 3, "date": "2008-06-14"}, {"excerpts": ["The Sweet Tooth Macchiato was awesome! ", "Hey, I have an idea. ", "Put a Ritual in NYC. ", "Then maybe ithis town will actually be on ", "it's way to having decent coffee some day... maybe some day."], "author": "Carlie D.", "review": "The Sweet Tooth Macchiato was awesome! Hey, I have an idea. Put a Ritual in NYC. Then maybe ithis town will actually be on it's way to having decent coffee some day... maybe some day.", "rating": 5, "date": "2010-09-20"}, {"excerpts": ["They make great coffee: my favorite is the Sweet tooth Latte. ", "Rituals has a good atmosphere and the staffers are generally pretty nice."], "author": "Jed C.", "review": "I love this place. I go there nearly every weekend. They make great coffee: my favorite is the Sweet tooth Latte. Rituals has a good atmosphere and the staffers are generally pretty nice.", "rating": 5, "date": "2010-02-25"}]}