{"extra salad dressing": [], "breaded salmon fries": [{"excerpts": ["Ordered breaded salmon fries with sweet potato and this is what I got. ", "There are a few clumps of breading and these are regular fries. ", "This is the most expensive thing I got and I got totally screwed. ", "Called and spoke to the manager who said he would usually call ahead to let know the error and forgot. ", "Won't ever return . ", "Don't waste your money here. ", "I wish I could give them zero stars. ", "Not even good fries"], "author": "Yi J.", "review": "Ordered breaded salmon fries with sweet potato and this is what I got. There are a few clumps of breading and these are regular fries. This is the most expensive thing I got and I got totally screwed. Called and spoke to the manager who said he would usually call ahead to let know the error and forgot. Won't ever return . Don't waste your money here. I wish I could give them zero stars. Not even good fries", "rating": 1, "date": "2018-01-13"}], "crab cake": [], "toasted raviolis": [], "plain cheese pizza": [], "sunday special pizza": [], "zorba the greek pizza": [], "super special pizza": [], "amazon vegitarian pizza": [], "chicken chipotle pizza": [], "bad boy pizza": [], "picante chile pizza": [], "quattro formaggio": [], "portuguese pizza": [], "veal scallopini with creamy mushroom sauce entree": [], "veal parmigiana entree": [], "chicken parmigiana entree": [], "baked chicken entree": [], "bbq pork ribs entree": [{"excerpts": ["I ordered the bbq pork ribs entree and it came with spaghetti and soup. ", "It was pretty good. ", "Actually the pork ribs was very flavorful and saucy as it should taste. ", "The soup was a potato soup and was savory and yummy. ", "I think my only complaint was the delivery took so long ", "and it wasn't even during rush hour. ", "I ordered delivery at 12 midnight."], "author": "Jennifer N.", "review": "I ordered the bbq pork ribs entree and it came with spaghetti and soup. It was pretty good. Actually the pork ribs was very flavorful and saucy as it should taste. The soup was a potato soup and was savory and yummy. I think my only complaint was the delivery took so long and it wasn't even during rush hour. I ordered delivery at 12 midnight.", "rating": 3, "date": "2018-07-21"}], "ny steak entree": [], "bbq chicken entree": [], "cornish hen entree": [], "salmon entree": [], "spaghetti with meat sauce": [], "roma rigatoni": [], "fettuccine seafood": [], "fettuccine chicken": [], "guss favorite": [], "fettuccine shrimp": [], "linguini scampi": [{"excerpts": ["The linguini scampi, mango crepe, and ny steak is  PERFECT. ", "I will continue to order from here as well as share it!"], "author": "Carmen N.", "review": "Hands down my favorite place to order online! Though delivery is a bit slower than I would want, the food is always hot and amazing. The linguini scampi, mango crepe, and ny steak is  PERFECT. I will continue to order from here as well as share it!", "rating": 4, "date": "2014-10-29"}], "spaghetti with shrimp": [], " spaghetti and  ravioli": [], "roma crepe": [], "hawaiian crepe": [], "veggie greek crepe": [], "chicken avocado sandwich": [{"excerpts": ["Beautiful little pizzeria, good vibes, and some of the best chicken Parmesan sandwich, and chicken avocado sandwich I have tried. ", "Fries were really great paired with a sandwich of choice. ", "This is my first stop when I head to the bay area."], "author": "Jay S.", "review": "Beautiful little pizzeria, good vibes, and some of the best chicken Parmesan sandwich, and chicken avocado sandwich I have tried. Fries were really great paired with a sandwich of choice. This is my first stop when I head to the bay area.", "rating": 5, "date": "2018-10-07"}, {"excerpts": ["BUT, the last time I've ordered a pizza (delicious even it was cold) and a Chicken AVOCADO sandwich, which came WITHOUT AVO! . ", "The fries also were cold as the pizza... ", "Sooooo ", "I've assumed the delivery gal got lost and lost my warm food and the avocado... on the way to my place. \n", "I'm not giving a bad review to this place, because I understand we can make mistakes. ", "I hope somebody in Roma Pizzeria read this review and found my avocado for my next sandwich (which was... delicious! ", "even without Avocado)."], "author": "Beautytraveler G.", "review": "I liked this place since it's  open till late and the delivery is, mostly on time & pretty fast (and FREE!). BUT, the last time I've ordered a pizza (delicious even it was cold) and a Chicken AVOCADO sandwich, which came WITHOUT AVO! . The fries also were cold as the pizza... Sooooo I've assumed the delivery gal got lost and lost my warm food and the avocado... on the way to my place. \nI'm not giving a bad review to this place, because I understand we can make mistakes. I hope somebody in Roma Pizzeria read this review and found my avocado for my next sandwich (which was... delicious! even without Avocado).", "rating": 4, "date": "2018-02-27"}, {"excerpts": ["Chicken Alfredo, Chicken Avocado Sandwich are so tasty! ", "Fries are...meh and so is the Tiramisu cake. ", "The House salad is very fresh. ", "First time eating at this place ", "and it was great. ", "I can't wait to try their Pizza next time! ", "GrubHub delivery at 12am."], "author": "Marie M.", "review": "Chicken Alfredo, Chicken Avocado Sandwich are so tasty! Fries are...meh and so is the Tiramisu cake. The House salad is very fresh. First time eating at this place and it was great. I can't wait to try their Pizza next time! GrubHub delivery at 12am.", "rating": 5, "date": "2016-02-09"}], "ham  cheese sandwich": [], "ny steak sandwich": [], "whole bbq chicken with garlic bread  large salad": [], "large  topping pizza   buffalo wings": [], "pastas rigatoni ravioli  spaghetti with meat sauce": [], "large  topping pizza with large salad  garlic bread": [], "medium topping pizzas": [], "xlarge  topping pizza with  buffalo wings": [], "xlarge  topping pizzas and liter of coke": [], "large  topping pizzas with  buffalo wings and liter of coke": [], "xlarge   topping pizza and free small   topping pizza pick up only": [], "san pelligrino water": [], "sweet crepe": [{"excerpts": ["Ordered for delivery.. came more than an hour, the sweet crepe tasted like over used oil. ", "Pizza was so greasy. ", "Never again."], "author": "Jojo P.", "review": "Ordered for delivery.. came more than an hour, the sweet crepe tasted like over used oil. Pizza was so greasy. Never again.", "rating": 1, "date": "2017-11-10"}], "chicken chipotle salad": [], "spinach deluxe salad": [], "sunday special salad": [], "meat calzone": [], "baby fries": [], "baby  pizza": [], "baby salad": [], "baby spaghetti": []}