{"frozen pomegranate": [{"excerpts": ["Oh yes, a frozen pomegranate margarita. \n\n"], "author": "Carlos M.", "review": "It was a sunny Friday afternoon in San Francisco, and there I was walking into Rosa Mexicano for a lunch date with a friend. This was my first time going, so naturally I had no idea what to expect. \n\nImmediately the first thing I noticed was the decor. The restaurant is set up in a way I think Bobby Berk from Queer Eye, you know the one who flips houses, would appreciate. \n\nNow it is time for the food. I first started out with ceviche, which I was swimming in it. The guacamole was so thick and creamy I wanted to rub it all over my body; you know millennials and guac. Since it was a lunch date and Friday I didn't want to gorge myself with food. I had people to impress later on that night. So I orders some tacos, and let me just say the tacos and I had a moment. As I was sitting there eating some juicy meat, I couldn't help but wonder... what would be the icing on top of a fantastic lunch? Oh yes, a frozen pomegranate margarita. \n\nYou know that feeling you get when a cutie at a bar approaches you. Well, this was so much better then that!", "rating": 5, "date": "2018-10-01"}, {"excerpts": ["I tried the Frozen Pomegranate, loved it!  ", "Truly Rosa Mexicano did not disappoint."], "author": "Charmaine J.", "review": "Upon my arrival, Appreciated the hostess with a welcoming smile . Absolutely loved the best friendly service and the ambiance was sexy and contemporary.  The food was an elaborate Mexican cuisine and went well with the fabulous spicy cucumber drinks that I ordered.   I will definitely return to try more on the menu!\n\nIt had to come back & try the main cuisine this time!  Highly recommended by my excellent server, Leslie, was the Salmon Poblano that I ordered.  It was crispy outside & tender inside flavored with the kale & Poblano sauce made a great combination!  I loved their version of Mexican Elote! I tried the Frozen Pomegranate, loved it!  Truly Rosa Mexicano did not disappoint.", "rating": 5, "date": "2018-07-22"}, {"excerpts": ["We capped our meal with one of their signature \"Frozen Pomegranate\" agave cocktails. ", "Their Frozen Pomegranate has been on the menu since 1984 and is made with blacno tequila, triple sec, fresh pomegranate and lime."], "author": "Renia L.", "review": "After a long ferry ride from Napa to San Francisco my hubby and I were tired, tipsy and starving. Not really knowing where to go or what to eat, we hit the streets walking from the ferry building. The streets of San Francisco happened to be quite \"dead\" on a Friday night. As we walked down Mission St. we saw Rosa Mexicano, a modern Mexican chain eatery known for table-side guacamole & creative margaritas.\n\nReading the words \"Mexican Food\" was like music to our ears because in Texas it's comfort food... and after our long day, comfort food is just what we needed.\n\nWe ordered the Nachos de Tres Quesos topped with queso fresco, white cheddar, Menonita cheese and the Tinga de Res Guerrero, Braised beef brisket with tomatillo-habanero salsa, house-made slaw and pickled red onion. The Tingas come with  Served with esquites, achiote rice and black beans. The Equites or \"Mexican corn salad\" was a life changer. So yummy and creamy!\n\nWe capped our meal with one of their signature \"Frozen Pomegranate\" agave cocktails. Their Frozen Pomegranate has been on the menu since 1984 and is made with blacno tequila, triple sec, fresh pomegranate and lime.", "rating": 4, "date": "2016-09-21"}, {"excerpts": ["Is the service impeccable, and the frozen pomegranate margarita delicious? - Yes.  ", "I also really like their Mole, and the fresh Guacamole made to order at your table."], "author": "Greg F.", "review": "I've been a fan of Rosa since I lived in DC. So, I'm a bit biased. Is it the best Mexican food that ever was? - No, but it is excellent. \n\n Is the service impeccable, and the frozen pomegranate margarita delicious? - Yes.  I also really like their Mole, and the fresh Guacamole made to order at your table.", "rating": 5, "date": "2014-06-08"}, {"excerpts": ["The frozen pomegranate margarita was fantastic! ", "And they had green tomatillo salsa, which is always my personal favorite. ", "We tried the shrimp tacos (camarones capeados) and enchiladas rancheras. ", "They were both fantastic and filling. ", "If you can't be bothered to get to the Mission, the Mexican food here will do!"], "author": "Cassandra J.", "review": "We stopped into Rosa's for lunch on a Saturday. Decor is lovely and service was okay. The frozen pomegranate margarita was fantastic! And they had green tomatillo salsa, which is always my personal favorite. We tried the shrimp tacos (camarones capeados) and enchiladas rancheras. They were both fantastic and filling. If you can't be bothered to get to the Mission, the Mexican food here will do!", "rating": 4, "date": "2016-01-02"}], "frozen tropical": [], "la única": [], "mango chile": [], "mezcalisco": [], "mexican colada": [], "strawberry daisy": [], "la tradicional": [{"excerpts": ["La Tradicional margarita was a bit disappointing--mostly ice and barely any salt. ", "Service needs improvement--interaction was limited to taking our orders, and removing the dishes."], "author": "David W.", "review": "The tortilla chips and the guacamole were good. The chile relleno did not have much flavor other than the goat cheese in the filling. The poblano chile was supposed to be roasted, but I really couldn't tell. The interior ambiance was nice. La Tradicional margarita was a bit disappointing--mostly ice and barely any salt. Service needs improvement--interaction was limited to taking our orders, and removing the dishes.", "rating": 3, "date": "2018-08-16"}], "pineapple jalapeño": [], "paloma": [{"excerpts": ["We talked mom (really had to twist her arm) into ordering a Paloma cocktail, this is the cocktail I had, ok fine, a few I had when I was there the first time in my date.  ", "A very mild and smooth tequila with red grapefruit juice, the rim covered in their original concoction of amazing.  "], "author": "Gregory M.", "review": "This was my second visit here to Rosa Mexicano and would highly recommend this restaurant for a date or just a causal afternoon lunch.  We were promptly greeted by the smiling hostess who asked if there were any vegetarians in the party so she could bring the additional menu.  She had a great smile and made us feel very welcome.  This time I dined with my family and my mom was present, Party of 4.  We were promptly greeted with a friendly smile, chips, salsa (amazing , chunky and flavorful) and water.  The server asked if we dined there before and welcomed us back.  Suggested the guacamole to start, the cart was rolled over to the table and a beautiful mocajete was the foundation of our soon to be devoured perfect guacamole.  I was telling the table the queso fundido was to die for, so we ordered that as a second appetizer.  When the cast iron skillet of ooey' gooey melted deliciousness was brought to the table, we served our mom first with one of the perfectly cooked and homemade I might add, corn tortilla.  I mean honestly, if butter was served with them, I would have proposed.  The peppers in the queso fundido add a small amount of heat and the vibrant green cilantro adds a freshness to the melted, salty, creamy cheese we were about to enjoy.  Two native Texans agreed the cheer was authentic and clearly imported!  We talked mom (really had to twist her arm) into ordering a Paloma cocktail, this is the cocktail I had, ok fine, a few I had when I was there the first time in my date.  A very mild and smooth tequila with red grapefruit juice, the rim covered in their original concoction of amazing.  A must try!\n\nWe then moved on to entrees, after all the apps I had the chicken tortilla soup which was absolutely delightful.  It is a unique soup here because the broth is more of a sauce (like a red enchilada sauce) with moist and flavorful chicken, plenty of cheese, tortilla strips and fresh cilantro.  Mom had the tinga de res tacos, which were served with a very generous portion of flavorful, juicy and well seasoned meat.  Of course the home made corn tortillas were divine!  The pickled red onions was a great addition of acidity to the tacos!  I love that they serve the tacos on a plate with the cool taco stand so the tacos stay upright, whoever invented this was pure genius.  The others had the Arrachera which was a perfectly cooked medium, with a warm pink center served a top beautifully grilled green and red peppers and onions, oh and I did I forget to mention, more cheese?  It was also served with two other salsas, a green tomatillo salsa, which had a sweet note and a fiery red salsa that had heat.  The entrees were also served with perfectly cooked, fluffy and well seasoned Mexican rice and black beans (retired style).  Both were a great accompaniment to the meal and we were all very impressed with the flavor extracted from the beans and rice.  \n\nLastly our outstanding waiter suggested churros for dessert, he painted a picture I could taste, but unfortunately we were stuffed from the lunch.  We will definitely be back to enjoy the rest of the menu and our new found favorites!  \n\nI hope you give this amazing restaurant a try, it is only two blocks from Embarcadero BART stop and they have a great outdoor eating area and bar area!", "rating": 5, "date": "2017-04-23"}, {"excerpts": ["Also enjoyed the Partida Paloma cocktail.  ", "Can't wait to come back."], "author": "Jennifer S.", "review": "Loved the happy hour here.  It was bustling but we didn't have to fight for a drink or a barstool.  We selected a few of the appetizers.  Highly recommend the Layered Duck Tortilla Pie...amazing.  Also enjoyed the Partida Paloma cocktail.  Can't wait to come back.", "rating": 4, "date": "2013-08-02"}], "la suprema": [{"excerpts": ["We also ordered drinks la suprema and the chile mango. ", "They were very generous with alcohol poured in. ", "Food was ok and right on point. ", "We loved the ambience and the water wall in the dining room had us change our seats from the lounge. ", "Overall it's a good time for Mexican food but even better for the stronger cocktails."], "author": "Anthony P.", "review": "The guacamole made table side was great. We also ordered drinks la suprema and the chile mango. They were very generous with alcohol poured in. Food was ok and right on point. We loved the ambience and the water wall in the dining room had us change our seats from the lounge. Overall it's a good time for Mexican food but even better for the stronger cocktails.", "rating": 4, "date": "2015-01-18"}], "spicy cucumber": [{"excerpts": ["The food was an elaborate Mexican cuisine and went well with the fabulous spicy cucumber drinks that I ordered.   "], "author": "Charmaine J.", "review": "Upon my arrival, Appreciated the hostess with a welcoming smile . Absolutely loved the best friendly service and the ambiance was sexy and contemporary.  The food was an elaborate Mexican cuisine and went well with the fabulous spicy cucumber drinks that I ordered.   I will definitely return to try more on the menu!\n\nIt had to come back & try the main cuisine this time!  Highly recommended by my excellent server, Leslie, was the Salmon Poblano that I ordered.  It was crispy outside & tender inside flavored with the kale & Poblano sauce made a great combination!  I loved their version of Mexican Elote! I tried the Frozen Pomegranate, loved it!  Truly Rosa Mexicano did not disappoint.", "rating": 5, "date": "2018-07-22"}], "dos agaves barrelaged cocktail": [], "la tradicional picante": [], "cocojito": [], "el viejo": [], "fresarita": [], "sangría de rosa mexicano": [{"excerpts": ["Being the thirsty person I am, I ordered a pitcher of Sangría de Rosa Mexicano: Red wine, apricot brandy, triple sec, fresh orange, pineapple, cucumber and apple ($36 for 60 oz pitcher). ", "Luckily, one of my gfs said she'd help me drink it. ", "It was smooth and fruity with a little slight alcoholic punch. ", "The rest of our party had wine. ", "A Cabernet Sauvignon: Sean Miner, Napa, California ($10 glass) ", "×2 and a Malbec: "], "author": "Elena N.", "review": "My girlfriends and I were meeting up Bobby L for dinner. Since we were right around the corner at Americano and it had just started pouring rain, we decided to go to Rosa Mexicano. I made a reservation about an hour before through OpenTable for Thursday, March 10th at 7:30pm.\n\nBeing the thirsty person I am, I ordered a pitcher of Sangría de Rosa Mexicano: Red wine, apricot brandy, triple sec, fresh orange, pineapple, cucumber and apple ($36 for 60 oz pitcher). Luckily, one of my gfs said she'd help me drink it. It was smooth and fruity with a little slight alcoholic punch. The rest of our party had wine. A Cabernet Sauvignon: Sean Miner, Napa, California ($10 glass) ×2 and a Malbec: Llama, \"Old Vines\", Mendoza, Argentina ($8 glass).\n\n*Guacamole en Molcajete: Famous Tableside Preparation - Since 1984, preparing freshly made guacamole with avocado, jalapeno, tomato, onion and cilantro, Served with warm tortilla chips and salsa ($15)\n*Empanadas de Pollo con Chorizo: Corn masa empanadas stuffed with Shredded chicken, Mexican chorizo and Menonita cheese, served with mestiza crema ($11)\n*Flautas de Pollo: Crispy corn tortillas filled with chicken tinga, topped with salsa pasilla de Oaxaca, salsa verde, queso fresco and crema ($10)\n*Ceviche de Camarones: Wild shrimp marinated in citrus with avocado, jalapeno, cucumber, jicama, mint, chile de arbol, red plum and yellow teardrop tomatoes ($15) ×2\n*Elotes: Mexican Street Corn ($6)\n\nWe started with the guac. It's prepared tableside which I adored since we could tell them the spice level we wanted. I love everything super spicy, but some in our party can't handle spice. I ended up getting a side of jalapenos so I could add some to the guac as I was eating it. I got the flauntas which were just eh. I felt like there was too much going on in terms of toppings and sauce. It was crunchy, but I wanted more flavor from the chicken. The enjoyed the elote I ordered. The corn was cooked nicely for me. Not overcooked and mushy. Yum!\n\nThe ambiance here is festive. I think we were one of the last parties there and they never made us feel rushed which was much appreciated. Easy and fun given our last minute dinner planning.", "rating": 3, "date": "2016-03-18"}], "siete leguas blanco": [], "casa noble crystal": [], "fortaleza blanco": [], "herradura silver": [{"excerpts": ["I tried their tequila sunrise, made with Herradura silver tequila, house-made pomegranate grenadine, and fresh orange juice. ", "Two cherries on top of the glass... ", "The staff assured me they were nothing special, but they tasted infused with an alcohol, or something... ", "Not sure what. ", "EVERYTHING at this restaurant tastes a little different, better than normal. "], "author": "Adam M.", "review": "I went to Rosa Mexicano today to try the Dine About Town menu. The restaurant is close to home for me, a short walk. I had a reservation through OpenTable, and was quickly seated.\n\nI really like the interior of this restaurant. It has a fun color scheme, with lots of eye candy - artistic lighting fixtures, earthy colors, and the divers leaping off the waterfall is certainly creative (see pictures). Music is a mix of modern latin flavor & downtempo, I liked it a lot. Sadly I didn't hear Vamos A La Playa, not even once. (I'm joking.)\n\nOn the Dine About Town menu, they list the table-side guacamole. Unfortunately, you can't get that unless you're a party of two, using your mutual two first course options to get the guacamole. Or, you can pay $7 more to get it as a single eater. It normally costs $14, so I guess I can understand that, considering the whole DAT lunch is $18.95. The way they word this on the menu is not the best, and I can see how it would disappoint some people. Generally when I get guacamole prepared at a table, the waiter brings over avocados, salsa, lime, other fixins & the container to crush everything in in a small hand held tray or basket, makes it, takes the tray or basket & leaves. At Rosa Mexicano, they have a cart they wheel to your table, a little retro, but everything on the cart looks tasty. They prepare your guacamole with some of the biggest avocados I've ever seen (I watched as another table got theirs); I believe Bruce Willis shot down the errant asteroid in Armageddon with one of those. I'm sure it was delicious, I love fresh guac.\n\nThe chips came with two salsas, a red salsa that got a smoky flavor from some of the chiles used, and a green salsa that was milder. That said, have a glass of water or drink ready to go. The sauces are delicious, so you eat a lot of them, but the spicy heat will sneak up on you & all of a sudden you realize you need water.\n\nMy first course was flautas de pollo, which are rolled crispy chicken tacos (think taquitos), covered in red & green salsas, Mexican cheese & sour cream. These were delicious, with so many different flavors, spices, and heat & cooling levels (physical & spice level).\n\nSecond course was enchiladas rancheras, cheese enchiladas in a roasted tomato sauce. From my photo you would not think these were different than what you're used to, but they are. Once again, there are a variety of subtle flavors & spices that hit you. The cheese doesn't entirely melt, and both the cheese & corn tortilla give texture to the dish. This is served with a healthy bowl of refried black beans, which seemed very fresh, unlike some Mexican restaurants where refried beans can taste dried out & generally old. They also include a bowl of brown rice. Now normally, brown rice tastes flavorless & sad, like you're on a diet you hate. This rice was full of flavor, from the cilantro, mint, and chile it was prepared with. Once again, many subtle flavors playing on your palette.\n\nThird course, I got their pastel de queso, a cheesecake. Their cheesecake is light compared to what you're probably used to, and had a razor-thin slice of baked apple which gave a nice flavor. The cheesecake & plate had a drizzle of something that had a flavor & consistency somewhere between applesauce & caramel, hard to describe, but wonderful, and walnuts.\n\nThey're currently running \"The Art of Mexican Mixology,\" a special cocktail menu from Jun 5-30. I believe they do different events like this throughout the year. I tried their tequila sunrise, made with Herradura silver tequila, house-made pomegranate grenadine, and fresh orange juice. Two cherries on top of the glass... The staff assured me they were nothing special, but they tasted infused with an alcohol, or something... Not sure what. EVERYTHING at this restaurant tastes a little different, better than normal. They even had a recipe for it printed on a card attached to the bill, a nice touch.\n\nWaitstaff was attentive & friendly, and either knew the answer to my questions about what chile or spice I was sensing, or was willing to go find out. Water was always topped off; one of the guys was joking with me, that since he started eating there he drinks a lot more water. I believe it!\n\nI love Mexican food, and I really love fancy Mexican food when the chef plays with different chiles that all have different heat levels & spice flavors. This is a fantastic restaurant, and I'm lucky they're close to me. I throughly enjoyed every single thing I ate, and I will be back for more. It was literally difficult to wipe the smile from my face at the end of this feast, I felt so completely sated. Thank you for a wonderful meal.\n\n- Adam", "rating": 5, "date": "2013-06-08"}], "don fulano fuerte": [], "tromba blanco": [], "riazul plata": [], "milagro reposado": [], "hibiscus pomegranate iced tea": [], "strawberrymango": [], "cucumber mint refresco": [], "nonalcohol michelada": [], "jarritos grapefruit": [], "jarritos mandarin": [], "jarritos tamarind": [], "mexican cocacola": [], "pinot grigio principato trentino it": [], "albarino paco  lola rias baixas es": [], "sauvignon blanc haras maipo valley cl": [], "sauvignon blanc kim crawford marlborough nz": [], "chardonnay seven falls wahluke slope": [], "chardonnay sonomacutrer russian river sonoma": [], "white blend hugel gentil alsace fr": [], "riesling chateau ste michelle columbia valley": [], "riesling eroica columbia valley": [], "brut chandon napa ca nv  ml": [], "cava juvé y camps penedes es": [], "champagne vueve cliquot brut reims fr nv": [], "pinot noir cono sur bicicleta rapel valley cl": [], "pinot noir robert mondavi carneros napa": [], "tempranillo torres coronas catalunya es": [], "tempranillo bodega numanthia numanthi toro es": [], "merlot tilia mendoza ar": [], "malbec terrazas mendoza ar": [], "malbec salentien reserve valle de uco mendoza ar": [], "cabernet sauvignon los vascos colchugua valley cl": [], "cabernet sauvignon jordan alexander valley": [], "rosé jean luc colombo cape bleu provence fr": [], "michelada": [], "corona light": [], "negra modelo": [{"excerpts": ["Good service, interesting margs and cocktails (negra modelo + sangria?), huge bowls of guac, not too noisy, good layout and table space."], "author": "Sonya Z.", "review": "Good service, interesting margs and cocktails (negra modelo + sangria?), huge bowls of guac, not too noisy, good layout and table space.", "rating": 4, "date": "2013-11-18"}], "modelo especial": [], "pacifico": [{"excerpts": ["$18 for2 Pacifico beers?!!  ", "Aye yay aye...  ", "Excellent Mesacal selection, but no real ginger beer to mak Oaxcan Mules.  ", "I won't be back - way overpriced and bartender didn't even know the extensive mescal selection."], "author": "Jim H.", "review": "$18 for2 Pacifico beers?!!  Aye yay aye...  Excellent Mesacal selection, but no real ginger beer to mak Oaxcan Mules.  I won't be back - way overpriced and bartender didn't even know the extensive mescal selection.", "rating": 1, "date": "2016-09-22"}], "victoria": [], "dos equis amber": [], "breckenridge agave wheat": [], "clausthaler na": [], "allende ipa": []}