{"fresh cofffee": [], "oz bottled soda": [], "crystal geyser water bottle": [], "oz smart water": [], "bagel": [{"excerpts": ["Yes, you can't beat the am egg bagel sandwiches. "], "author": "El B.", "review": "Yes, the sandwiches are good and reasonably priced. Yes the coffee is hot and fresh. Yes, you can't beat the am egg bagel sandwiches. And without fail customer service will be friendly..and friendly toward everyone no matter their walk of life.\n\nBut the absolute best thing? Pfeffenusse and Lebkuchen are available here during the holidays!! Nope, not made in house, but packages of the really good imported stuff.\nThank you Rossi's for helping make my holidays merry!", "rating": 5, "date": "2018-10-06"}, {"excerpts": ["but I mainly get either a sandwich or a bagel.  ", "The thing I like most about this shop though is the very friendly service.  ", "Always greeted with a smile and a hello.  ", "This \"ma and pop\" deli is they kind of place ", "I want to go to spend my money because of the polite service and the positive energy."], "author": "Kyle W.", "review": "Rossi's Deli is one of those spots that you might have missed at first when walking by it.  It is a little shop that has obviously a deli and lots of snack and alcohol choices.  They also sell lotto tickets so prepare for that line when the jackpot is up.  A very small space barely enough room for two people to walk side by side in the one aisle they have but they have good quality food but I mainly get either a sandwich or a bagel.  The thing I like most about this shop though is the very friendly service.  Always greeted with a smile and a hello.  This \"ma and pop\" deli is they kind of place I want to go to spend my money because of the polite service and the positive energy.", "rating": 5, "date": "2018-11-08"}, {"excerpts": ["I live a block away and come here all the time for their very cheap breakfast bagel sandwiches - hummus, tomato and cucumber is my regular breakfast for super cheap.  ", "Their falafel deluxe and avogobble are my favorite sandwiches and still relatively cheap.  ", "Best part though is the very very friendly family that runs the place. ", "I look forward to the hellos and the smiles I get from them every time I walk in. ", "It's the neighborhood deli you've always wanted."], "author": "Brian B.", "review": "I love this place. I live a block away and come here all the time for their very cheap breakfast bagel sandwiches - hummus, tomato and cucumber is my regular breakfast for super cheap.  Their falafel deluxe and avogobble are my favorite sandwiches and still relatively cheap.  Best part though is the very very friendly family that runs the place. I look forward to the hellos and the smiles I get from them every time I walk in. It's the neighborhood deli you've always wanted.", "rating": 5, "date": "2018-02-15"}, {"excerpts": ["I got the sausage egg and cheese on a sesame bagel with a drink -- ", "Bagel is pretty good, and it was made on the spot. ", "bagel was all toasty and yummy. ", "balance of bread and filling were equal. ", "The sausage was not bland at all! ", "Also, that brand of Lychee oolong tea is pretty hard to find (granted i havent reallllllyyy looked LOL) but its not a very common drink that is found in convenience stores. "], "author": "Vivian H.", "review": "I came into the store awhile back when i was looking for a bite to eat while exploring Castro by myself. I got the sausage egg and cheese on a sesame bagel with a drink -- Noyu brand Lychee Oolong tea! \n\nBagel is pretty good, and it was made on the spot. bagel was all toasty and yummy. balance of bread and filling were equal. The sausage was not bland at all! Also, that brand of Lychee oolong tea is pretty hard to find (granted i havent reallllllyyy looked LOL) but its not a very common drink that is found in convenience stores. It was really refreshing and not too sweet.\n\nThe cashier and workers are extremely nice and patient. I remember i was short a penny and he told me it was fine lol. There was a line, so i'm sure the rest of their items are delicious.THey have an good selection of lunch food as well as a very large variety of cheeses and meats. If i wanted to have some kind of wine and cheese/meat party, you must definitely come here. They're very well stocked. they also have baklava!", "rating": 4, "date": "2015-04-23"}, {"excerpts": ["I ordered a ham, egg, and cheese bagel that was perfectly toasted and delicious. ", "Many different bagels and cheeses to choose from. ", "In and out within 5 minutes and very satisfied."], "author": "Edward W.", "review": "Stopped by for a quick grab-n-go breakfast. I ordered a ham, egg, and cheese bagel that was perfectly toasted and delicious. Many different bagels and cheeses to choose from. In and out within 5 minutes and very satisfied.", "rating": 4, "date": "2017-01-23"}, {"excerpts": ["Sesame Bagel Toasted with cream cheese, cucumbers, and tomatoes. ", "Sesame Bagel Toasted with hummus, cucumbers, and tomatoes. ", "(It wasn't per my taste. ", "The seasoning inside wasn't to my liking)"], "author": "Hiral P.", "review": "Their Staff is really nice. I have tried the following:\n\n1. Sesame Bagel Toasted with cream cheese, cucumbers, and tomatoes. (They only carry plain cream cheese.)\n\n2. Sesame Bagel Toasted with hummus, cucumbers, and tomatoes. (It wasn't per my taste. The seasoning inside wasn't to my liking)", "rating": 3, "date": "2016-04-10"}, {"excerpts": ["Be it for a sandwich, cold cuts, dolmas, a bagel, falafel, a drink, or speciality sweets from Europe. ", "Sam and his family have run this Deli for over 40 years in the Castro and they are all very sweet. ", "When I used to work in the Castro, I came here nearly every day for an Avogobble, a Bagel w/ Cucumber and Hummus, a BLT, or a Reuben during my lunch break. ", "Everything is so delicious, fresh, and reasonably priced. "], "author": "Megan D.", "review": "Do yourself a favor and drop by Rossi's sometime. Be it for a sandwich, cold cuts, dolmas, a bagel, falafel, a drink, or speciality sweets from Europe. Sam and his family have run this Deli for over 40 years in the Castro and they are all very sweet. When I used to work in the Castro, I came here nearly every day for an Avogobble, a Bagel w/ Cucumber and Hummus, a BLT, or a Reuben during my lunch break. Everything is so delicious, fresh, and reasonably priced. Fun fact: you can also buy single beers from here.\n\nDefinitely the most affordable place for lunch in the Castro.", "rating": 4, "date": "2016-05-31"}, {"excerpts": ["$3.50 for a fresh made bagel with egg and your choice of cheese and the people who work there are incredibly friendly and nice! ", "Much better quality food/price/service than Posh bagel IMO."], "author": "Mary S.", "review": "I stopped by this little deli/liquor store on my way to muni to get a quick breakfast sandwich on the go one day... Happy to have found my new breakfast spot in the Castro! $3.50 for a fresh made bagel with egg and your choice of cheese and the people who work there are incredibly friendly and nice! Much better quality food/price/service than Posh bagel IMO.", "rating": 4, "date": "2016-02-23"}, {"excerpts": ["Their breakfast sandwich on a bagel may be the new standard for that classic item."], "author": "Saad H.", "review": "Rossi's is the jam. Sam and the rest of his family are extremely nice, and they serve up some great sandwiches. The deli itself is reminiscent of corner stores of the Middle East, with shelves jam packed with goodies. Their breakfast sandwich on a bagel may be the new standard for that classic item.", "rating": 5, "date": "2016-07-17"}, {"excerpts": ["Possibly because next door to where I work is a bagel shop (that I now despise, but that's a separate review) that seemed \"easier\" to get to.. ", "When I learned that Rossi's also did breakfast and their prices were more competitive than places like Posh Bagel and Castro Tarts, I decided to give them a try! ", "Conveniently placed between muni (where I off board) and my job which is down the hill! ", "An awesome selection of breakfast sandwiches to pick from, and for the best price that I have seen in the neighborhood! ", "And Sam (the owner) is such a great fellow, friendly as can be and the rest of the staff there are just as amazing! ", "Two of his children work there from time to time and they are fun to chat with on my way home after finishing up work.. ", "Rossi's takes the crown for best breakfast spot around, and when I get a craving of some kind, like a Yerba Matte tea midday or an ice cold brew when I have finished a 10 hour shift, they are there! ", "Such an seemingly innate friendliness with that group, you could go in upset and walk out with a more pleasant attitude! ", "Been 2+ years ", "and I have never gone to back to Posh of Castro Tarts since discovering Rossi's, at it was always there! \n", "Give them a shot"], "author": "J M.", "review": "Where to begin!? I slept hard on this place for the longest time and I'm not really sure why.. Possibly because next door to where I work is a bagel shop (that I now despise, but that's a separate review) that seemed \"easier\" to get to.. When I learned that Rossi's also did breakfast and their prices were more competitive than places like Posh Bagel and Castro Tarts, I decided to give them a try! Conveniently placed between muni (where I off board) and my job which is down the hill! An awesome selection of breakfast sandwiches to pick from, and for the best price that I have seen in the neighborhood! And Sam (the owner) is such a great fellow, friendly as can be and the rest of the staff there are just as amazing! Two of his children work there from time to time and they are fun to chat with on my way home after finishing up work.. Rossi's takes the crown for best breakfast spot around, and when I get a craving of some kind, like a Yerba Matte tea midday or an ice cold brew when I have finished a 10 hour shift, they are there! Such an seemingly innate friendliness with that group, you could go in upset and walk out with a more pleasant attitude! Been 2+ years and I have never gone to back to Posh of Castro Tarts since discovering Rossi's, at it was always there! \nGive them a shot", "rating": 5, "date": "2015-10-10"}, {"excerpts": ["Everything bagel with hummus tomatoes and cucumber. ", "On point. ", "Coffee. ", "...... ? ", "Um hit or miss.  ", "Today was definitely miss. ", "Sandwiches also the bizz"], "author": "Kenneth S.", "review": "Everything bagel with hummus tomatoes and cucumber. On point. Coffee. ...... ? Um hit or miss.  Today was definitely miss. Sandwiches also the bizz", "rating": 4, "date": "2015-04-14"}, {"excerpts": ["I get the bacon, egg and cheese bagel every time.. man that is tasty! "], "author": "Rob B.", "review": "I get the bacon, egg and cheese bagel every time.. man that is tasty! And they are always so nice.\n\nShould give the lunch a try next.", "rating": 5, "date": "2013-05-07"}, {"excerpts": ["I come here every morning though, for my breakfast bagel. ", "I get the bacon, cheese and egg bagel sandwich and I LOVE IT!!! "], "author": "Pretty O.", "review": "There are not a lot of great deli places like it used to be, with that said Rossis' Deli is truly ONE OF A KIND. This establishment has been in the neighborhood for more than 35 years!!! They are mostly known for their deviled eggs, the avogobble (which is a fresh roasted turkey with avocado) and their variety of affordable cheese. \n\nI come here every morning though, for my breakfast bagel. I get the bacon, cheese and egg bagel sandwich and I LOVE IT!!! Toasted perfectly and a full-filling meal before I go to work. \n\nThis establishment is a one stop shop...there are so many goodies to chose from that its often difficult to just buy one thing. \n\nAs for their customer service, it's GREAT! Rossis' Deli is family owned and they are genuine, friendly people. :)", "rating": 5, "date": "2011-12-08"}, {"excerpts": ["Best bacon, egg, and cheese on a bagel I have ever had! ", "Their customer service is tops to boot. ", "Definitely becoming a regular."], "author": "Craig J.", "review": "Best bacon, egg, and cheese on a bagel I have ever had! Their customer service is tops to boot. Definitely becoming a regular.", "rating": 5, "date": "2011-11-27"}, {"excerpts": ["I regrettably have only tried the bacon egg and cheese bagel so far (I only say \"regrettably\" because they have so much more to offer as well!), and boy does it pack a punch.  ", "I sometimes add vegetables and avocado to my sandwich, and they always taste fresh.  "], "author": "Funky C.", "review": "I only just started going into Rossi's recently.  It wasn't on purpose, and it certainly wasn't for the purpose of ordering great food, but boy am I glad I checked it out.\n\nFirst off all, I am a huge fan of great customer service.  Rossi's has some of the best customer service I have ever encountered.  It's a family owned business, complete with who I believe to be the brothers Rossi, and their wives and children.  I am always greeted with a smile and enthusiasm, and it shows in the product that they produce.  I regrettably have only tried the bacon egg and cheese bagel so far (I only say \"regrettably\" because they have so much more to offer as well!), and boy does it pack a punch.  I sometimes add vegetables and avocado to my sandwich, and they always taste fresh.  Not to mention, Rossi's is EXTREMELY clean and well taken care of, so eat with confidence.\n\nWhether you need a bottled water or a breakfast sandwich, do yourself a favor on a long drawn out Monday and step into Rossi's; it'll turn your day around for the better.", "rating": 5, "date": "2013-06-22"}, {"excerpts": ["I often stop in for a morning bagel sandwich or a turkey sandwich on Dutch crunch later in the day. ", "The falafel is reasonably priced and delicious. ", "Good cheese selection too."], "author": "P P.", "review": "Love this place. Friendly, fast service, and good fresh food at a reasonable price.  I often stop in for a morning bagel sandwich or a turkey sandwich on Dutch crunch later in the day. The falafel is reasonably priced and delicious. Good cheese selection too.", "rating": 5, "date": "2014-10-31"}], "bagel and plain cream cheese": [], "bacon egg and cheese": [{"excerpts": ["I regrettably have only tried the bacon egg and cheese bagel so far (I only say \"regrettably\" because they have so much more to offer as well!), and boy does it pack a punch.  ", "I sometimes add vegetables and avocado to my sandwich, and they always taste fresh.  "], "author": "Funky C.", "review": "I only just started going into Rossi's recently.  It wasn't on purpose, and it certainly wasn't for the purpose of ordering great food, but boy am I glad I checked it out.\n\nFirst off all, I am a huge fan of great customer service.  Rossi's has some of the best customer service I have ever encountered.  It's a family owned business, complete with who I believe to be the brothers Rossi, and their wives and children.  I am always greeted with a smile and enthusiasm, and it shows in the product that they produce.  I regrettably have only tried the bacon egg and cheese bagel so far (I only say \"regrettably\" because they have so much more to offer as well!), and boy does it pack a punch.  I sometimes add vegetables and avocado to my sandwich, and they always taste fresh.  Not to mention, Rossi's is EXTREMELY clean and well taken care of, so eat with confidence.\n\nWhether you need a bottled water or a breakfast sandwich, do yourself a favor on a long drawn out Monday and step into Rossi's; it'll turn your day around for the better.", "rating": 5, "date": "2013-06-22"}], "ham egg and cheese": [], "fresh muffin": [], "bagel with butter": [], "egg and cheese": [{"excerpts": ["I got the sausage egg and cheese on a sesame bagel with a drink -- ", "Bagel is pretty good, and it was made on the spot. ", "bagel was all toasty and yummy. ", "balance of bread and filling were equal. ", "The sausage was not bland at all! ", "Also, that brand of Lychee oolong tea is pretty hard to find (granted i havent reallllllyyy looked LOL) but its not a very common drink that is found in convenience stores. "], "author": "Vivian H.", "review": "I came into the store awhile back when i was looking for a bite to eat while exploring Castro by myself. I got the sausage egg and cheese on a sesame bagel with a drink -- Noyu brand Lychee Oolong tea! \n\nBagel is pretty good, and it was made on the spot. bagel was all toasty and yummy. balance of bread and filling were equal. The sausage was not bland at all! Also, that brand of Lychee oolong tea is pretty hard to find (granted i havent reallllllyyy looked LOL) but its not a very common drink that is found in convenience stores. It was really refreshing and not too sweet.\n\nThe cashier and workers are extremely nice and patient. I remember i was short a penny and he told me it was fine lol. There was a line, so i'm sure the rest of their items are delicious.THey have an good selection of lunch food as well as a very large variety of cheeses and meats. If i wanted to have some kind of wine and cheese/meat party, you must definitely come here. They're very well stocked. they also have baklava!", "rating": 4, "date": "2015-04-23"}, {"excerpts": ["I get the bacon, egg and cheese bagel every time.. man that is tasty! "], "author": "Rob B.", "review": "I get the bacon, egg and cheese bagel every time.. man that is tasty! And they are always so nice.\n\nShould give the lunch a try next.", "rating": 5, "date": "2013-05-07"}, {"excerpts": ["I regrettably have only tried the bacon egg and cheese bagel so far (I only say \"regrettably\" because they have so much more to offer as well!), and boy does it pack a punch.  ", "I sometimes add vegetables and avocado to my sandwich, and they always taste fresh.  "], "author": "Funky C.", "review": "I only just started going into Rossi's recently.  It wasn't on purpose, and it certainly wasn't for the purpose of ordering great food, but boy am I glad I checked it out.\n\nFirst off all, I am a huge fan of great customer service.  Rossi's has some of the best customer service I have ever encountered.  It's a family owned business, complete with who I believe to be the brothers Rossi, and their wives and children.  I am always greeted with a smile and enthusiasm, and it shows in the product that they produce.  I regrettably have only tried the bacon egg and cheese bagel so far (I only say \"regrettably\" because they have so much more to offer as well!), and boy does it pack a punch.  I sometimes add vegetables and avocado to my sandwich, and they always taste fresh.  Not to mention, Rossi's is EXTREMELY clean and well taken care of, so eat with confidence.\n\nWhether you need a bottled water or a breakfast sandwich, do yourself a favor on a long drawn out Monday and step into Rossi's; it'll turn your day around for the better.", "rating": 5, "date": "2013-06-22"}], "sausage egg and cheese": [{"excerpts": ["I got the sausage egg and cheese on a sesame bagel with a drink -- ", "Bagel is pretty good, and it was made on the spot. ", "bagel was all toasty and yummy. ", "balance of bread and filling were equal. ", "The sausage was not bland at all! ", "Also, that brand of Lychee oolong tea is pretty hard to find (granted i havent reallllllyyy looked LOL) but its not a very common drink that is found in convenience stores. "], "author": "Vivian H.", "review": "I came into the store awhile back when i was looking for a bite to eat while exploring Castro by myself. I got the sausage egg and cheese on a sesame bagel with a drink -- Noyu brand Lychee Oolong tea! \n\nBagel is pretty good, and it was made on the spot. bagel was all toasty and yummy. balance of bread and filling were equal. The sausage was not bland at all! Also, that brand of Lychee oolong tea is pretty hard to find (granted i havent reallllllyyy looked LOL) but its not a very common drink that is found in convenience stores. It was really refreshing and not too sweet.\n\nThe cashier and workers are extremely nice and patient. I remember i was short a penny and he told me it was fine lol. There was a line, so i'm sure the rest of their items are delicious.THey have an good selection of lunch food as well as a very large variety of cheeses and meats. If i wanted to have some kind of wine and cheese/meat party, you must definitely come here. They're very well stocked. they also have baklava!", "rating": 4, "date": "2015-04-23"}], "bagel lox and cream cheese": [], " pint of macaroni salad": [], " pint of fresh fruit salad": [], " pint of pesto pasta salad": [], " pint of carrot and raisin salad": [], " pint of chicken salad": [], " pint of seafood salad": [], " pint of taboleh": [], " pint of hummus": [], " pint of coleslaw": [], " pint of antipasto salad": [], " pint of mediterranean pasta salad": [], " pint of gourmet potato salad": [], " pint of tuna salad": [], " pint of greek pasta salad": [], " pint of dolma": [], " pint of tomato and cucumber salad": [], "hummus in a pita": [], "garden delight sandwich": [], "assorted cheese sandwich": [], "fresh roasted turkey sandwich": [{"excerpts": ["With that said, Rossi's has a really tasty fresh roasted turkey sandwich, which I get on a toasted dutch crunch roll. ", "Cheese? ", "Why not. ", "Extra pickles and olives. ", "Hells yes. ", "It's not your typical subway sliced meat. ", "Nope, this is shredded turkey meat, which I was a nice surprise the first time I ever bit into it. ", "For a little more than $5, you really can't ask for more in a sandwich. "], "author": "Mike A.", "review": "My sandwich world revolved around the likes of Ike's, and when they closed up shop, I was pretty devastated. I knew there had to be pretty good sandwiches around the city as alternatives, but I didn't realize that delicious sandwiches would come out of Rossi's in Castro.\n\nI'm not connoisseur for the simple bread and meat meal, but I will say that I am a little selective. With that said, Rossi's has a really tasty fresh roasted turkey sandwich, which I get on a toasted dutch crunch roll. Cheese? Why not. Extra pickles and olives. Hells yes. It's not your typical subway sliced meat. Nope, this is shredded turkey meat, which I was a nice surprise the first time I ever bit into it. For a little more than $5, you really can't ask for more in a sandwich. Also, if you're still hungry you can pick up some greek pasta salad or a piroshki.\n\nThe guys behind the counter are always friendly and quick. I work near Union Square but I still make it to Castro for lunch at Rossi's. Try it out!", "rating": 4, "date": "2011-03-19"}, {"excerpts": ["I love their fresh roasted turkey sandwich, falafel, and deviled eggs, I like all their sandwiches but those are my favorites.  \n\n"], "author": "Jay G.", "review": "I love this place !! The people/owners are always friendly and funny. It's a family owned deli that have been there for over 30 yrs. Its nice to still see a mom and pop shop (instead of Starbucks on every corner) in the City. And btw this place has fresh brewed coffee ! \n\nI love their fresh roasted turkey sandwich, falafel, and deviled eggs, I like all their sandwiches but those are my favorites.  \n\nIt's a cute little hole in the wall with a lot of character and good food. It's a \"to go\" deli, no seating but great to pick up some sandwiches, chips, salads, wines, cheeses, chocolate, soda, beer, and the list goes on and hit the park for a picnic. \n\nI saw some of the negative reviews and I've never had a bad experience and have been going there as long as they have been in business...I recommend giving them one more shot before calling them quits !!! (I mean nobody's perfect right). \n\nps. To daphne who complained about the lady saying she would charge .10 for a bag, you should've asked for a bag before you paid, you know we have to pay for bags now !!!!! No disrespect but just saying!!!!!", "rating": 5, "date": "2014-06-19"}], "smoked turkey sandwich": [{"excerpts": ["As I waited for my smoked turkey sandwich to be made this morning, I checked out their salad selection and made note of what to order next time.  ", "It's a woman I've never seen before at the register today, and she just handed me the wrapped sandwich with a couple of napkins.  ", "When I asked for a brown bag, as she bagged the sandwich.  ", "\""], "author": "daphne w.", "review": "It's on my way to metro, and it's open before 8am.  Seems good enough for me.   I had a smoked ham sandwich first time and falafel deluxe the next.  The food was okay, very typical quality from a deli, but the male owner and the female cashier were very friendly both times.\n\nAs I waited for my smoked turkey sandwich to be made this morning, I checked out their salad selection and made note of what to order next time.  It's a woman I've never seen before at the register today, and she just handed me the wrapped sandwich with a couple of napkins.  When I asked for a brown bag, as she bagged the sandwich.  \"Next time,\" she emphasized, \"I'm going to charge you 10 cents for the bag.\"  \n\nThis was a first, and maybe they're just starting to enforce it, but Deli Lady if you're reading, \"Next time, I'll buy my $7 sandwich elsewhere.\"", "rating": 2, "date": "2013-02-04"}], "roast beef sandwich": [], "smoked ham sandwich": [{"excerpts": ["I had a smoked ham sandwich first time and falafel deluxe the next.  "], "author": "daphne w.", "review": "It's on my way to metro, and it's open before 8am.  Seems good enough for me.   I had a smoked ham sandwich first time and falafel deluxe the next.  The food was okay, very typical quality from a deli, but the male owner and the female cashier were very friendly both times.\n\nAs I waited for my smoked turkey sandwich to be made this morning, I checked out their salad selection and made note of what to order next time.  It's a woman I've never seen before at the register today, and she just handed me the wrapped sandwich with a couple of napkins.  When I asked for a brown bag, as she bagged the sandwich.  \"Next time,\" she emphasized, \"I'm going to charge you 10 cents for the bag.\"  \n\nThis was a first, and maybe they're just starting to enforce it, but Deli Lady if you're reading, \"Next time, I'll buy my $7 sandwich elsewhere.\"", "rating": 2, "date": "2013-02-04"}], "kosher salami sandwich": [], "mortadella sandwich": [], "seafood salad sandwich": [], "sams special sandwich": [], "hot pastrami sandwich": [{"excerpts": ["I tried the hot pastrami sandwich. ", "The menu is a little confusing because there are so many options that sound the same. ", "I just asked the guy behind the counter to give me a suggestion on the type of bread, cheese, and produce to put with the sandwich, and it turned out great. ", "My default for sandwiches is the nearby Subway, but now that I know this exists, perhaps I'll be venturing here much more often."], "author": "Stefanie C.", "review": "The thing that stands out most about this delicatessan is the service. Everyone is super friendly and really takes pride in this cute little shop on Castro. You can buy the meats and cheeses that are displayed in the window, and while you're at it, why not get a sandwich to go with it? \n\nI tried the hot pastrami sandwich. The menu is a little confusing because there are so many options that sound the same. I just asked the guy behind the counter to give me a suggestion on the type of bread, cheese, and produce to put with the sandwich, and it turned out great. My default for sandwiches is the nearby Subway, but now that I know this exists, perhaps I'll be venturing here much more often.", "rating": 4, "date": "2015-10-31"}, {"excerpts": ["Came here for a quick sandwich dinner one Thursday night, and the hot pastrami sandwich was pretty good. ", "There's not too much meat, so you can still bite into the sandwich without making a big mess. ", "The bread was very soft and all the ingredients were very fresh as well. ", "Prices were good at around $6.25 for a sandwich, plus they accept credit card."], "author": "Audrey L.", "review": "Wouldn't have thought to stop by here, but a friend recommended it. Came here for a quick sandwich dinner one Thursday night, and the hot pastrami sandwich was pretty good. There's not too much meat, so you can still bite into the sandwich without making a big mess. The bread was very soft and all the ingredients were very fresh as well. Prices were good at around $6.25 for a sandwich, plus they accept credit card.", "rating": 4, "date": "2014-04-21"}], "blt sandwich": [], "prosciutto di parma sandwich": [], "avogobble sandwich": [{"excerpts": ["Split a Rueben and an Avogobble sandwich on dutch crunch. ", "The sandwiches are decently sized, and you get a good bang for your buck. "], "author": "Courtney Q.", "review": "Went here for Lunch. Split a Rueben and an Avogobble sandwich on dutch crunch. The sandwiches are decently sized, and you get a good bang for your buck. Two sandwiches ended up being ~$16 total.\n\nThe Reuben felt like it didn't have enough meat/filling in it. It was satiating, but the thousand island really overpowered the sauerkraut. The sandwich tasted too sweet with no nice sour offset you usually get in a reuben.\n\nThe Avogobble was a bit dry (even with the mustard and tomato in it). I found myself enjoying the parts where the tomato/pickle were, but not so much when I had a bit that didn't. Could barely taste/see the avocado. Turkey is usually dry though, so it might just be the sandwich. \n\nI enjoy sandwiches a lot, so I'll probably be back, but I'll definitely be giving some of their other sandwiches a try. Perhaps the hot pastrami.", "rating": 3, "date": "2015-11-23"}], "corned beef sandwich": [], "black forest ham sandwich": [], "ham sandwich": [{"excerpts": ["I had a smoked ham sandwich first time and falafel deluxe the next.  "], "author": "daphne w.", "review": "It's on my way to metro, and it's open before 8am.  Seems good enough for me.   I had a smoked ham sandwich first time and falafel deluxe the next.  The food was okay, very typical quality from a deli, but the male owner and the female cashier were very friendly both times.\n\nAs I waited for my smoked turkey sandwich to be made this morning, I checked out their salad selection and made note of what to order next time.  It's a woman I've never seen before at the register today, and she just handed me the wrapped sandwich with a couple of napkins.  When I asked for a brown bag, as she bagged the sandwich.  \"Next time,\" she emphasized, \"I'm going to charge you 10 cents for the bag.\"  \n\nThis was a first, and maybe they're just starting to enforce it, but Deli Lady if you're reading, \"Next time, I'll buy my $7 sandwich elsewhere.\"", "rating": 2, "date": "2013-02-04"}], "genoa salami sandwich": [], "bologna sandwich": [], "deviled egg salad sandwich": [], "combination sandwich": [], "meat loaf sandwich": []}