{"vegetable samosas": [{"excerpts": ["We settled in and ordered some drinks [which were topped up throughout - we don't drink much alcohol, so diet coke and sprite were our choices] and then ordered the mixed appetisers [vegetable pakoras, vegetable samosas, popadom, mint raita, and some kind of sweet dipping sauce], mixed bread basket [three types of naan], Murgh Madras, plain rice, and Bhuna Gosht. \n\n"], "author": "Lindsey B.", "review": "What a great find! \n\nAfter a bit of research, we went by another Indian restaurant to find that it was closed, and looked like it had been for a while, so we jumped on Yelp to see what else was in the area. Roti looked quite appetising, but with the good reviews and interesting looking menu, we thought it would be fully booked. \n\nWe thought we would check it out anyway and we arrived at about 19:30 to be warmly greeted and offered our choice of tables [from about 5]. Parking was free [after 18:00] and out outside the front window. \n\nThe place was already bustling and the atmosphere was welcoming. The first thing we noticed when we opened the door was the lovely smell, which is a great start. \n\nWe settled in and ordered some drinks [which were topped up throughout - we don't drink much alcohol, so diet coke and sprite were our choices] and then ordered the mixed appetisers [vegetable pakoras, vegetable samosas, popadom, mint raita, and some kind of sweet dipping sauce], mixed bread basket [three types of naan], Murgh Madras, plain rice, and Bhuna Gosht. \n\nThe appetisers came quickly, but not *too* quickly, and we were given plenty of time to enjoy them before the mains came out. A fresh, warm plate was given after the appetiser, in time for the main course. I'm not sure if the warm plates were intentional or if they were just warm out of the washer, but in any case, it was a nice touch. \n\nThe main courses were superb. We're from England and we like our curries spicy, however, these were so tasty [well balanced, delicious flavours] that this didn't matter. However, the owner [??] came and asked us if the meal was spicy enough for us [perhaps the waitress mentioned something to him?] and then brought us over a pot of homemade chilli sauce to add some spice to our meal. The chilli sauce was superb; fresh, very spicy, and plentiful. \n\nThe bread basket was also delicious - we could really taste the ghee, and the garlic naan was a highlight for us. \n\nAll the staff in the restaurant were really lovely, especially our waitress who chatted with us about her travels to England and made us feel very welcomed. We could not have been happier with the service. We were also given a complimentary rice pudding and chai tea at the end of our meal. \n\nWe're so pleased that we happened across this place, and hopefully, on one of our future trips to San Francisco, we will return. \n\nThank you Roti!", "rating": 4, "date": "2014-08-09"}, {"excerpts": ["The vegetable samosas wee okay, little burnt, but they tasted fine. ", "We also ordered a lamb and chicken korma. ", "First, they both came out without the almonds and the nuts. ", "When I asked they waitress, she said she was sorry, but didn't do anything about it. ", "The chicken wasn't well cooked, and it tasted like it was just added to the sauce. ", "For the money I paid for, I could have gone to several place that actually live up to the taste of Indian food. ", "I will not go back and definitely don't recommend it."], "author": "Zara C.", "review": "I went here expecting good food, however, the food is adequate. The people who were pouring us water the cleaning off the table were really nice. But, the food was bad. The vegetable samosas wee okay, little burnt, but they tasted fine. We also ordered a lamb and chicken korma. First, they both came out without the almonds and the nuts. When I asked they waitress, she said she was sorry, but didn't do anything about it. The chicken wasn't well cooked, and it tasted like it was just added to the sauce. For the money I paid for, I could have gone to several place that actually live up to the taste of Indian food. I will not go back and definitely don't recommend it.", "rating": 2, "date": "2016-10-02"}, {"excerpts": ["Try the  vegetable samosas,chicken Vindaloo or  tikka , along with any of the rice entrees and enjoy this all together with an order of  palak paneer (spinach with cheese and spices) for a winning combination!!  ", "All these spices and flavor always seems to make me very satisfied and hyper!!!  ", "Can't wait to eat here again!"], "author": "Jessica C.", "review": "Definitely one of my favorite restaurants!!!  Where do I start... well, this fun, lively neighborhood Indian restaurant located on West Portal is a great place to go with a group of 3+ and enjoy a family style shared meal.  I think its best like this so you can try a little bit of many different plates together...  my recommendation to try - naan bread is amazing especially   when eaten and dipped in all the flavorful foods and sauces!  Kabuli naan\nis my choice as it is coated on the inside with pure sweetness (raisins, nuts and cherries).   Try the  vegetable samosas,chicken Vindaloo or  tikka , along with any of the rice entrees and enjoy this all together with an order of  palak paneer (spinach with cheese and spices) for a winning combination!!  All these spices and flavor always seems to make me very satisfied and hyper!!!  Can't wait to eat here again!", "rating": 5, "date": "2011-04-02"}, {"excerpts": ["For appetizers we ordered the Vegetable Samosas (spelling?).  ", "It was this huge fried ball filled with curry, potatoes, green peas and a whole bunch of other veggies.  ", "For the main course we had Kashmiri Biryani, Lamb \"Popsicles\" and Keenan Naan (spelling?).  ", "I loved the exotic taste of the Kashmiri Biryani!  ", "It had 2-3 different types of rice (not your typical Asian white rice), curry, green peas, pineapples and dried raisins.  ", "The Lamb \"Popsicles\" came out on a sizzling platter and literally made it go \"pop\" ", "- I can see where that came from now.  ", "The lamb chops were very juicy and tender but a little too spicy for me.  ", "As for the Keenan Naan?  "], "author": "Chris Y.", "review": "Came here on a Wednesday night with the girlfriend since she was craving something with curry in it.  It's located at the edge of West Portal with a movie theater on its left and the MUNI tunnel to its right (forgot what that tunnel is called haha).  Parking here is cut-throat so if you've made reservations I'd suggest coming here a little bit earlier.\n\nWe walked in at 630PM without reservations and was seated within seconds by a waitress who looked no more than 16 years old (a foreshadow of the service to come).  We get seated near the back register at the edge of the kitchen.  That night it was Thanksgiving Eve so it was pretty lively in there with a bunch of white folks trying to be \"worldly\" before the year ended.  \n\nWe ordered the Indian Lemonade but was told they were out of lemons so we had to settle for Limeade....boo for them since it tasted like a Mojito without alcohol.  For appetizers we ordered the Vegetable Samosas (spelling?).  It was this huge fried ball filled with curry, potatoes, green peas and a whole bunch of other veggies.  For the main course we had Kashmiri Biryani, Lamb \"Popsicles\" and Keenan Naan (spelling?).  I loved the exotic taste of the Kashmiri Biryani!  It had 2-3 different types of rice (not your typical Asian white rice), curry, green peas, pineapples and dried raisins.  The Lamb \"Popsicles\" came out on a sizzling platter and literally made it go \"pop\" - I can see where that came from now.  The lamb chops were very juicy and tender but a little too spicy for me.  As for the Keenan Naan?  Well...it wasn't too memorable since I've already forgotten it.\n\nService here could use some work since it consists mainly of high schoolers trying to make enough money to go out on the weekends.  They appear to be understaffed because although there were three cooks sweating their balls off in the open kitchen, the 5 waiters were either hanging out at the register talking about how much tips they DIDN'T get (we were sitting right in front of them) or gossiping in the kitchen hallway about a fellow employee (I passed them on my way out of the restroom).\n\nIn the end I'd suggest looking for another restaurant if you really want authentic Indian food because last I checked, Indian food didn't require two forks, a knife and a spoon.  Would I come here again?  Sure but not for awhile.\n\n==========\n\n-1 Star for service\n-1 Star for mediocre food\n\n*3 Stars out of 5*", "rating": 3, "date": "2009-11-28"}, {"excerpts": ["I would recommend getting the vegetable Samosas as an appetizer. ", "They are great and something i don't seem to find at every indian restaurant. ", "I also love the chicken tikka masala... but i always love that. \n", "Go here for a good meal. ", "Good ambiance. ", "And enjoy a different part of the city than the norm."], "author": "Wes P.", "review": "most restaurants on West Portal seem to be excellent. This one is no different. \nI love how this restaurant is decorated. Unlike other indian restaurants. the style leans more towards sheik and sophisticated. The service is great and the food usually comes out in a timely fashion. \nI would recommend getting the vegetable Samosas as an appetizer. They are great and something i don't seem to find at every indian restaurant. I also love the chicken tikka masala... but i always love that. \nGo here for a good meal. Good ambiance. And enjoy a different part of the city than the norm.", "rating": 4, "date": "2009-01-20"}, {"excerpts": ["Vegetable Samosas: ", "Yeah, they are samosa's alright. ", "Not exactly what I was expecting in terms of spice though. ", "Bear in mind that I can eat very spicy food. "], "author": "S M.", "review": "I did not stay for the ambiance as I was too tired and wanted to get back to  my hotel room ASAP so I got take out. \n\nI got the following items and will describe them accordingly:\n\nVegetable Samosas: Yeah, they are samosa's alright. Not exactly what I was expecting in terms of spice though. Bear in mind that I can eat very spicy food. Just that the samoas did seem very mediocre. \n\nSeekh Kebab: Not bad actually! The flavor of the Lamb was definitely significant. Squeezed some lemon on them and enjoyed with my..\n\nParantha: Layed whole wheat bread, pretty much a roti on steroids. Very good indeed.\n\nNow this was the first night and I ordered enough for two nights, so for dinner on the next night I had:\n\nPaneer Makhani: Not what I expected but it was good regardless. I was expecting a dish known as Shahi Paneer which is sweet and has dry fruits in it with a similar sauce to Paneer Makhani.\n\nVegetable Biriyani: It was kind of bland. Could have used some more spices in it actually. \n\nOnion Naan/Kulchas: The onions used for these seemed like they were cooked beforehand with some Haldi and various spices. It didn't go very well with the flavor of the naan. I would like my Onion naans to be made with chopped raw onions, some cumin, cilantro, and some salt sprinkled on top. Delicious.\n\nSo overall, not a bad experience, but not a place I would take some Indian friends too. (Not that we would insist on going out for Indian considering we supposedly eat it every night.)", "rating": 3, "date": "2007-03-17"}, {"excerpts": ["We had lovely pankora, and vegetable samosas which were crisp and not greasy, yummy spinach with a type of cheese and mixed Tandori to die for.  ", "Everything was perfectly cooked, wonderfully spiced.  ", "We had a complimentary raita with our rice and complimentary drinks after the meal.  ", "They demonstrated to us back in the kitchen how they cooked Nan in the Tandoori oven by slapping it against the wall and watched it bubble and then ate it hot from the stove. ", "An excellent meal in very pleasant atmosphere."], "author": "Liz S.", "review": "Slipped into Roti 12/230/2011 and we were treated to excellent service, a charming staff including the Maitre'D and the chef/owner.  We had lovely pankora, and vegetable samosas which were crisp and not greasy, yummy spinach with a type of cheese and mixed Tandori to die for.  Everything was perfectly cooked, wonderfully spiced.  We had a complimentary raita with our rice and complimentary drinks after the meal.  They demonstrated to us back in the kitchen how they cooked Nan in the Tandoori oven by slapping it against the wall and watched it bubble and then ate it hot from the stove. An excellent meal in very pleasant atmosphere.", "rating": 4, "date": "2012-01-04"}], "bengan pakoras": [], "assorted appetizers": [{"excerpts": ["My party of three started with assorted appetizers. ", "Papadum (lentil wafer), vegetable pakoras (mixed veggies fried in a chick pea batter--crisp & flavorful), & veggie samosa (filled w/ potatoes, peas, curry spice--"], "author": "Fancypants X.", "review": "If BFF had his way (& he usually gets his way, unless not one, but TWO girls are putting the kibosh on his plans), we would've had an Indian-themed day starting with yoga & ending with a Bollywood movie marathon. We skipped all that & just lunched at Roti in West Portal. \n\nMy party of three started with assorted appetizers. Papadum (lentil wafer), vegetable pakoras (mixed veggies fried in a chick pea batter--crisp & flavorful), & veggie samosa (filled w/ potatoes, peas, curry spice--I enjoyed it considering I don't love curry.)\n\nOther dishes included lamb chops (which I did not try) & a salmon dish (which was a tad fishy tasting. Also, sauce was not appetizing to a few of us at the table.)\n\nThe one thing I thoroughly enjoyed was running huge pieces of garlic & basil naan through the sauce in our murgh makhani dish (tandoori chicken cooked in tomatoes, butter, & cream--that *cant* be bad!) I opted for white meat chicken, which was firm & slightly dried out. \n\nLunch is served with chai tea, which was mildly spiced & flavored... just like everything else on the menu. Believe me, I'm not saying I want to be hit with super strong Indian spices (I actually enjoy 'fusion' cooking), but it seems Roti is walking on eggshells in the kitchen, so as not to offend patrons with robust flavors. Your diners are here for Indian food, so don't be afraid to give it to 'em.", "rating": 3, "date": "2012-12-19"}, {"excerpts": ["We ordered the assorted appetizers (samosas, pakoras and pappadum), chicken tikka masala, saag aloo, rice and naan. "], "author": "Miriam W.", "review": "I make no claims to be any sort of expert in authenticity. I do, however, believe I know a bit about what tastes good. And Roti tastes GOOD! After fetching my favorite Washingtonian at the airport last week he mentioned Indian food and suspecting he'd never seen West Portal I figured Roti might be a good detour on our way home. We ordered the assorted appetizers (samosas, pakoras and pappadum), chicken tikka masala, saag aloo, rice and naan. We thoroughly enjoyed all of the food and were particularly impressed with the quality of the cucumber raita. \n\nI've rarely, if ever, had the chance to have Indian food in such a beautiful, modern setting. Authentic or not, the food here is delicious and I look forward to returning!", "rating": 4, "date": "2006-12-11"}, {"excerpts": ["We decided to start off with the assorted appetizers ($10) - which had 1 samosa, 2 deep fried veggies. "], "author": "Betty S.", "review": "Came here for dinner tonight with my friend hoping to convince him to enjoy Indian food! We found parking rather easily (lots of street parking on the side) and were seated quickly. We decided to start off with the assorted appetizers ($10) - which had 1 samosa, 2 deep fried veggies. These were pretty good, but pretty standard.\n\nWe also ordered the chicken tikka masala ($16) - which was pretty good. Lots of flavor, and lots of chunks of boneless chicken breast. We also ordered the spinach with potatoes ($9) which was okay - not a lot of flavor to it. The lamb briyani ($17) was good but very spicy and so I did not eat alot of this. We also got 1 roti and 1 naan ($4 each) and while it was hot and fresh, I'm used to fluffy naan - and this was kinda flat and lacked substance. Also I thought both breads were pretty oily. The mango lassi ($5) was very yummy and a big glass of it too!\n\nWhile the food was decent, the prices are on the high side for Indian food. The service here was excellent, very attentive. They also have a nice wine list. I like how its an open kitchen, and the restaurant as a whole is very clean. Even the bathrooms were clean! Overall, a little pricey for Indian food, but the ambiance and service were great.", "rating": 3, "date": "2010-04-28"}, {"excerpts": ["I will never order the assorted appetizers ever again, that was horrible.  ", "The vegetable pakoras were a bit on the burnt side and wasn't even close to being authentic in any way .  ", "I'm seriously disappointed today with the food tonight.  "], "author": "Twist' D.", "review": "I haven't been here in about 9 months and I just confirmed I won't be back for another 9 months if ever.  Here lies the problem of ordering take out from this place.  About 9 months ago I order some take out, very simple an order of the fish and a veggie dish, when they tell you 1 hour, it's actually 1 1/2 hours.  As for today, I order food around 5:10 and got there about 5:45, they told me 30 minutes.  I left after 6:30 with my order.  \n\nThere were a few more people who waited unhappily for their take out.  \n\nI was offered a free dish for the wait.  I thought about for all of half a second, I didn't want to be stuck there waiting for another 30 minutes for a free dish.  Hell No.  I opt to take my food and leave.\n\nThe naan I brought home wasn't fully cook and had a doughy taste. as was the aloo gobi (the cauliflower is completely crisp as if only just dumped into the curry and pulled out).  I will never order the assorted appetizers ever again, that was horrible.  The vegetable pakoras were a bit on the burnt side and wasn't even close to being authentic in any way .  I'm seriously disappointed today with the food tonight.  The tandoori murgh was very spicy (which I like but my daughter couldn't eat) was the only dish that was decent.  \n\nI've never had problems with the food when I eat there, but take out is a nightmare.", "rating": 1, "date": "2008-08-24"}, {"excerpts": ["Well, soon was at least 10 minutes before our almost unidentifiable Assorted Appetizers arrived. ", "The Vegetable Pakoras were a big stuck together, slightly burnt mess. ", "All the while I continued to observe our waiter speaking to the cooks when at the open kitchen (at the rear of the restaurant) and he did not look pleased. ", "The entire staff was running around like the Keystone Kops, although as my oft quoted significant other said, that would be an insult to the Keystone Kops. ", "The only exception was the buffoonish manager who most of the time was standing at the cash register located at the rear bar. ", "At one point another patron who was sitting quite close to him stood up and extended his arms outward to inquire as to what the hell was going on!! ", "I could see that they too had been waiting an inordinate amount of time for their food. ", "I applauded him! ", "We still had another very long wait for dinner to arrive. ", "Our waiter did come over to say that dinner would be out soon. ", "I asked him what the problem was, and he said that the kitchen has been slow despite his requests. ", "When dinner finally did arrive, ironically the Chicken Tandoori (which should be served sizzling) was barely warm after the long wait. ", "When I told our waiter he offered to reheat it, but I was afraid that they would just dry it out. ", "The Saag Gosht, Basmati rice and naan were all OK, but nothing memorable. ", "I'm sure partly because we had such a long wait. ", "By this time the restaurant was not crowded at all. ", "The table of younger, overly loud and inappropriately dressed group (flip flops on a 40 something degree evening) behind us which arrived way after we did received all of their food quite quickly. ", "Obviously, I DO NOT RECOMMEND Roti and WILL NOT BE GOING BACK! ", "BTW, they didn't charge us for the appetizers."], "author": "Dan B.", "review": "This is my very first review on Yelp. I will proceed to give positive reviews for the restaurants and businesses that I do like, however after our experience this evening at Roti I feel compelled to post this. We've been to Roti many times and have had good experiences, but this evening they were just a mess. The restaurant was busy (though not full) when we arrived and were told that they were having trouble with their reservation system. We had a reservation and were seated immediately. We ordered relatively quickly and our mango lassis and water were brought, however I could tell that our waiter was not in a great mood. We waited a long time before our waiter came over to say that our appetizers would be out soon. Well, soon was at least 10 minutes before our almost unidentifiable Assorted Appetizers arrived. The Vegetable Pakoras were a big stuck together, slightly burnt mess. All the while I continued to observe our waiter speaking to the cooks when at the open kitchen (at the rear of the restaurant) and he did not look pleased. The entire staff was running around like the Keystone Kops, although as my oft quoted significant other said, that would be an insult to the Keystone Kops. The only exception was the buffoonish manager who most of the time was standing at the cash register located at the rear bar. At one point another patron who was sitting quite close to him stood up and extended his arms outward to inquire as to what the hell was going on!! I could see that they too had been waiting an inordinate amount of time for their food. I applauded him! We still had another very long wait for dinner to arrive. Our waiter did come over to say that dinner would be out soon. I asked him what the problem was, and he said that the kitchen has been slow despite his requests. When dinner finally did arrive, ironically the Chicken Tandoori (which should be served sizzling) was barely warm after the long wait. When I told our waiter he offered to reheat it, but I was afraid that they would just dry it out. The Saag Gosht, Basmati rice and naan were all OK, but nothing memorable. I'm sure partly because we had such a long wait. By this time the restaurant was not crowded at all. The table of younger, overly loud and inappropriately dressed group (flip flops on a 40 something degree evening) behind us which arrived way after we did received all of their food quite quickly. Obviously, I DO NOT RECOMMEND Roti and WILL NOT BE GOING BACK! BTW, they didn't charge us for the appetizers.", "rating": 2, "date": "2011-01-02"}, {"excerpts": ["Had their Assorted Appetizers: one samosa (tasty and filling), two veggie pakoras (lots of spices and greasy, like it should be), and one lentil wafer with sauces on the side.\n"], "author": "sarisha h.", "review": "Came here with a friend on a Thursday night.  The place was packed but we were seated quickly.\nHad their Assorted Appetizers: one samosa (tasty and filling), two veggie pakoras (lots of spices and greasy, like it should be), and one lentil wafer with sauces on the side.\nAlso had Half order of their Tandoori Murgh.  Even though it was a half order, it was plenty.  It came out on a sizzling plate full of onions and bell peppers.  It reminded me of the sizzling plates Korean restaurants serve their ribs on.  Anyhow, I was surprised by how tender and flavorful the chicken was.  I was expecting a yogurty taste b/c the menu says it was marinated in yogurt, but it had none.  It was really good.\nWe also had Saag Gosht--lamb and spinach.  This was the best plate, I think.  I usually don't like lamb but this one was really tender and the spinach/cilantro complemented it well.\nWe had all of this with one wheat and one regular naan.  Couldn't tell which one was which.\nWarning: you will come out smelling like smoke and your clothes will reek of it for days.  \nOverall great experience.", "rating": 4, "date": "2009-02-03"}, {"excerpts": ["To start, we ordered the assorted appetizers which included a samosa, vegetable pakoras, and papadum. ", "We didn't care too much for the papadum, the samosa was good, but we all like the vegetable pakoras -- especially with the mint chutney or plum sauce they served with it. \n", "For our entrees, we got the Chicken Tikka Masala, Chicken Vindaloo, and the Lamb Korma, along with an order of Roti's Basmati Pulao (rice) as well as an order of Garlic & Basil and an order of Onion Kulcha roti (breads).\n", "At first we were hesitant, trying everything with caution and helping ourselves to modest servings, but all of it was so tasty that we quickly threw a munch! ", "The Lamb Korma was a recommendation from the server, and a good one at that! ", "It had this delicious, creamy sauce. ", "The Chicken Vindaloo was really good too! "], "author": "Crys L.", "review": "Not really ever having Indian food before, we weren't too sure what to expect. But since a couple of us were on an Indian food kick, and with a recommendation from a friend, we decided to give this place a try.\n\nIf this is what Indian food is like, we're definitely fans! \nTo start, we ordered the assorted appetizers which included a samosa, vegetable pakoras, and papadum. We didn't care too much for the papadum, the samosa was good, but we all like the vegetable pakoras -- especially with the mint chutney or plum sauce they served with it. \nFor our entrees, we got the Chicken Tikka Masala, Chicken Vindaloo, and the Lamb Korma, along with an order of Roti's Basmati Pulao (rice) as well as an order of Garlic & Basil and an order of Onion Kulcha roti (breads).\nAt first we were hesitant, trying everything with caution and helping ourselves to modest servings, but all of it was so tasty that we quickly threw a munch! The Lamb Korma was a recommendation from the server, and a good one at that! It had this delicious, creamy sauce. The Chicken Vindaloo was really good too! It was pretty spicy, but it was so delicious you can't stop eating it, even if you start to sweat from the heat, as one of us did, haha.\n\nThe service could've been a bit better though. Eating such spice-full dishes, our water glasses were often empty and we had to wait awhile for drink refills. And, when the restaurant started to get busier, we saw less and less of our server.\n\nOverall, we thoroughly enjoyed our dinner. The food was super tasty, we left full and satisfied, and we're happy to say that we're definitely down with Indian food now!", "rating": 4, "date": "2009-02-19"}], "machchi pakoras": [], "roti calamari": [{"excerpts": ["Example:  Roti Calamari.  ", "It's pretty good, with an Indian spice aftertaste.\r\n\r\n", "The Chicken Tikka Masala is good, as are the other familiar dishes - Chicken Korma, Palak Paneer.  ", "I had a very tasty special chicken dish the other night which had a lovely green sauce and light flavor.  ", "Look for it on the October specials menu.\r\n\r\n", "Service is very friendly.  ", "We were offered a complimentary glass of wine or port for no reason other than it was Halloween night.  \r\n\r\n", "Not my first choice for Indian food, but a nice neighborhood restaurant."], "author": "Liz S.", "review": "When I was in kindergarten, my teacher Mrs. Turley would tell us to sit \"Indian Style\" on the big rug.  I had no idea what this had to do with Indians, but we all knew what to do.\r\n\r\nI think of Roti as \"Indian Style\" food.   Although they do serve many authentic dishes, you're not going to think for a second that you are in Bombay.  If you prefer to sweat out mouth-burning spices while listening to high octave singing, this is not the place for you.  If you're ok with variations on a theme, you will probably be OK with Roti.\r\n\r\nExample:  Roti Calamari.  It's pretty good, with an Indian spice aftertaste.\r\n\r\nThe Chicken Tikka Masala is good, as are the other familiar dishes - Chicken Korma, Palak Paneer.  I had a very tasty special chicken dish the other night which had a lovely green sauce and light flavor.  Look for it on the October specials menu.\r\n\r\nService is very friendly.  We were offered a complimentary glass of wine or port for no reason other than it was Halloween night.  \r\n\r\nNot my first choice for Indian food, but a nice neighborhood restaurant.", "rating": 3, "date": "2006-11-03"}, {"excerpts": ["I could come here just for the Roti Calamari.  ", "Perfectly fried - best fried calamari ", "I've ever had.  ", "As for the main stuff...the bread basket and curry were just okay.  ", "I've had better...in cheaper places."], "author": "Dylan's Aunt E.", "review": "I could come here just for the Roti Calamari.  Perfectly fried - best fried calamari I've ever had.  As for the main stuff...the bread basket and curry were just okay.  I've had better...in cheaper places.", "rating": 3, "date": "2009-01-12"}, {"excerpts": ["some good dishes worth trying include: roti calamari, boti kabab, and mixed seafood biryani.  ", "while the chicken tikka masala was a bit dry, the dessert kulfi was surprisingly good.  ", "anytime i'm craving indian, this place would be one of my choices."], "author": "Paulina C.", "review": "i love the mango lassi and bread basket.  some good dishes worth trying include: roti calamari, boti kabab, and mixed seafood biryani.  while the chicken tikka masala was a bit dry, the dessert kulfi was surprisingly good.  anytime i'm craving indian, this place would be one of my choices.", "rating": 4, "date": "2007-09-17"}], "rotis mixed green salad": [], "kachumber": [{"excerpts": ["The Kachumber salad appetizer is a treat and goes well with the main dishes.  ", "The garlic nan with the mint cilantro chutney should be outlawed for being addictive."], "author": "Ernest F.", "review": "My latest obsession.  I stopped by for take out on a whim, and since then I've had several tasty and generously-portioned meals delivered to my home.  My favorite is the Murgh Madras, but I haven't quite worked my way through the entire menu.  The Kachumber salad appetizer is a treat and goes well with the main dishes.  The garlic nan with the mint cilantro chutney should be outlawed for being addictive.", "rating": 5, "date": "2016-12-14"}, {"excerpts": ["We received assorted samosas and pakoras which we promptly subdivided, a mixed tandoori plate, murgh masala, dal, pulao, kachumber, raita, naan, kheer and chai. "], "author": "Ed U.", "review": "Y'know, when you go to the movies and you see those Fandango commercials before the previews? The ones with the paper bag puppets. Yeah, those ads. Well, my favorite is the Bollywood musical number (http://www.youtube.com/watch?v=pqCKoGhc-qA). That has nothing to do with this review except I just had some great Indian food. OK, maybe that's still a stretch...\n\nEven though West Portal sounds like a gateway to heaven or at least the entrance to a really pricey Greek-style spa, it's actually one of those neighborhoods in which I rarely venture. I'm a downtown type of guy that refers to anything in this area as \"somewhere over Twin Peaks\". Shame on me for having such a limited vantage point since there are a lot of cool eateries around here of which this is one of the best.\n\nFive of us commandeered a table in this low-key Indian restaurant (...not to be mistaken for Rotee, the also stellar and slightly more casual place in the Haight). It was abuzz with activity that night, but the decor was soothing to this savage beast. Mustard walls. Silk fabrics framed on the walls. Soft lighting. Just the right vibe for the type of dinner that five friends, who hadn't seen each other in a while, wanted to have. On our appetite meter, we were definitely more than peckish moving toward full-blown famished.\n\nSo to cut to the chase, we went for two orders of the $33-per-person Roti's Feast, which you may see as our lazy way to get around the menu. Yes, t'is true...but that's because everything looked so good. We received assorted samosas and pakoras which we promptly subdivided, a mixed tandoori plate, murgh masala, dal, pulao, kachumber, raita, naan, kheer and chai. If you recognize more than three names on that list, you have a more sophsticated palate than mine.\n\nI actually don't recall the chai, but I was so wrapped up in the dinner conversation that I may have overlooked it in favor of the wine. We also went for the dessert-like $16 Lamb Korma, which was bathing in a spicy cream sauce and topped with almonds & cashew nuts. Very tasty. We also shared the $10 Aloo Gobi, which had cauliflower and potato chunks cooked with onions, turmeric, and fresh herbs. The $4 Onion Kulcha was excellent as it was naan stuffed with herbs, spices and onions The dishes were becoming a blur of furious flavors at this point in the evening.\n\nNo matter as I plan to return to the wilds of West Portal even if it means going outside my geographic comfort zone. Even with all the Indian options in my part of town, including Rotee and Indian Oven, the food is just that good here. So prepare the horses and the wagons and if you are not of such pioneer stock, you are still allowed to take a Muni train. It's worth the trek in any case.\n\nFOOD - 5 stars...rich, tasty Indian food in the Wild, Wild West Portal area\nAMBIANCE - 4.5 stars...warm, not ostentatious and seemingly quite popular\nSERVICE - 4 stars...relatively prompt and serviceable\nTOTAL - 5 stars...for the food mainly...scale Twin Peaks and bring a Fandango-inspired paper bag puppet to entertain yourself in case there is a wait", "rating": 5, "date": "2007-11-01"}, {"excerpts": ["Kachumber salad messed up with mustard? ", "Overcooked tandoori prawns. ", "Never again. ", "Makes me sad."], "author": "Judith H.", "review": "What happened to this place? We were here last about four years ago and loved it, though we usually went to their branch in Burlingame. Took our son recently and it was awful! Kachumber salad messed up with mustard? Overcooked tandoori prawns. Never again. Makes me sad.", "rating": 2, "date": "2012-04-18"}], "rotis feast": [], "vegetarian thali": [{"excerpts": ["Our server identified all the items on the menu that could be made vegan (of which there were many!)-- including modifying the vegetarian thali for us. ", "Stellar service and stellar food. ", "My favorite restaurant on West Portal."], "author": "Anastasia Z.", "review": "Delicious and accommodating! Our server identified all the items on the menu that could be made vegan (of which there were many!)-- including modifying the vegetarian thali for us. Stellar service and stellar food. My favorite restaurant on West Portal.", "rating": 5, "date": "2018-04-22"}, {"excerpts": ["We shared a Vegetarian Thali, the Roti's Feast (both combo platters) and the Tandoori Paneer and had a huge dinner plus leftovers. \n", "The Tandoori Paneer was great, and came on a bed of grilled vegetables. ", "The dishes in the Vegetarian Thali, especially the curry roasted cauliflower, the eggplant one, and the Dal, could have been spicier but that may be a matter of personal taste.\n", "The dessert included Gulab Jamun, which are sort of like donut holes, and were delicious."], "author": "Izzy S.", "review": "Roti was really good for a family dinner. We shared a Vegetarian Thali, the Roti's Feast (both combo platters) and the Tandoori Paneer and had a huge dinner plus leftovers. \nThe Tandoori Paneer was great, and came on a bed of grilled vegetables. The dishes in the Vegetarian Thali, especially the curry roasted cauliflower, the eggplant one, and the Dal, could have been spicier but that may be a matter of personal taste.\nThe dessert included Gulab Jamun, which are sort of like donut holes, and were delicious.", "rating": 4, "date": "2017-06-01"}, {"excerpts": ["I ordered the vegetarian thali and I definitely recommend that! ", "It doesn't seem like much since everything comes in small-looking bowls, but I assure you, I left with a food baby. ", "I don't even know what I ate, but I know that I loved everything, especially two of the bowls. ", "The cucumber salads that came with all our dishes were all really good too! ", "I think anyone who likes honey mustard will like it. ", "And of course, the naan. ", "Oh naan. ", "Soft, bready naan. ", "The naan here was great. ", "It was great alone, but duh you had to dip it in everything which accentuated all the flavors even more. ", "I loved everything, and again, the vegetarian thali was amazing. ", "It lets you try a variety of things and for sure, you'll be filled with eating all the naan along with it. ", "It also comes with a milky chai that's super warming! ", "Love the ambiance and the nice waitress we had. ", "Definitely coming back (:"], "author": "Holly P.", "review": "As Guy Fieri would say, \"We've arrived at Flavortown!\" Roti Indian Bistro was better than I expected! I had a craving for Indian and I remembered seeing this place whilst eating across the street at El Toreador one day and made the decision to get my family to come here for an after-church lunch (:\n\nMy parents both ordered the Naanini and honestly, I don't like the metallic-like, earthy lamb flavor, but the lamb was delicious. Moist, soft, and of course spice enriched, it was super yummy. My brother got some kind of chicken curry and it was good but nothing I'd craze over. I ordered the vegetarian thali and I definitely recommend that! It doesn't seem like much since everything comes in small-looking bowls, but I assure you, I left with a food baby. I don't even know what I ate, but I know that I loved everything, especially two of the bowls. The cucumber salads that came with all our dishes were all really good too! I think anyone who likes honey mustard will like it. And of course, the naan. Oh naan. Soft, bready naan. The naan here was great. It was great alone, but duh you had to dip it in everything which accentuated all the flavors even more. We also got a garlic basil naan and that was like garlic bread on naan on crack!! \n\nI really recommend coming here for a good Indian fix. All the spices and flavors that I got from them were intoxicating. I was full but couldn't help myself from constantly dipping back into the food. I loved everything, and again, the vegetarian thali was amazing. It lets you try a variety of things and for sure, you'll be filled with eating all the naan along with it. It also comes with a milky chai that's super warming! Love the ambiance and the nice waitress we had. Definitely coming back (:", "rating": 5, "date": "2015-04-19"}, {"excerpts": ["The fish was pretty good, but the vegetarian thali lacked any resemblance to good Indian food.  "], "author": "Spike S.", "review": "I probably shouldn't have come here one week after returning from India...\n\nThe roti is Singapore-style, not Indian-style.  It's not that tasty.  In India, you get better roti on the street for twenty cents.\n\nThe food was lacking in spice and aromatics.  The fish was pretty good, but the vegetarian thali lacked any resemblance to good Indian food.  The whole place seems blanded out for Americans.\n\nThere are much better places downtown and near the Tenderloin.  This place has a nice dining atmosphere, but that's the beginning and end of it.  \n\nThis was my second visit, I attributed the low quality of the  first to a visit on a slow lunch day for the place.", "rating": 2, "date": "2008-02-21"}, {"excerpts": ["We ordered basic Indian fare - fish curry, okra, vegetarian thali for dad etc. \n\n"], "author": "Matin N.", "review": "Okay I have to be honest. I have had a major bias against this restaurant, I don't know if it's the \"bistro\" suffix or the highly suspect location, or the fact that I'd much rather eat at one of the dive restaurants in the Tenderloin. Or all of the above. Anyway, with much trepidation I took my parents to this restaurant to celebrate my dad's birthday. Our food showed up exactly 9 minutes after we had ordered, which can be a good thing. We ordered basic Indian fare - fish curry, okra, vegetarian thali for dad etc. \n\nOur meal was very satisfying and the service was above average. I feel the prices are a tad more than I would normally pay, but then the portions are sizable so I guess that cancels out. All in all, we had a good time and the owner was a very friendly gentleman that went out of his way to make sure we were having a good time. A decent option for someone that's new to Indian food, or wants to dine at a restaurant with a good ambience.", "rating": 3, "date": "2008-04-24"}], "aachar pachranga": [], "rotis mixed tandoori": [], "tandoori murgh": [{"excerpts": ["We had Tandoori Murgh Malai,Tandoori Game Hen & Chicken Biryani.", "All were exceptionally well crafted & delicious.", "We could really taste the high quality ingredients.", "We are excited to be eating our leftovers again tonight!!"], "author": "Andee F.", "review": "Ate here for the first time last night & I have to say it's my new fave Indian restaurant.What makes it so different is the finer quality of the food.We had Tandoori Murgh Malai,Tandoori Game Hen & Chicken Biryani.All were exceptionally well crafted & delicious.We could really taste the high quality ingredients.We are excited to be eating our leftovers again tonight!!", "rating": 5, "date": "2018-07-29"}, {"excerpts": ["Some of the highlights were the goat cheese naan, mango chutney, boti kabab and tandoori murgh.  ", "Amazing service and delicious food.  ", "I will definitely be back soon."], "author": "EVELYNE E.", "review": "This was my first time dining in an Indian restaurant and what an experience it was!  As soon as the waitress and manager heard that I had never before had Indian food, they brought over 3 additional items for us to try.  They are truly proud of their food and were so happy for us to try it.  Some of the highlights were the goat cheese naan, mango chutney, boti kabab and tandoori murgh.  Amazing service and delicious food.  I will definitely be back soon.", "rating": 5, "date": "2011-10-24"}, {"excerpts": ["The tandoori murgh was very spicy (which I like "], "author": "Twist' D.", "review": "I haven't been here in about 9 months and I just confirmed I won't be back for another 9 months if ever.  Here lies the problem of ordering take out from this place.  About 9 months ago I order some take out, very simple an order of the fish and a veggie dish, when they tell you 1 hour, it's actually 1 1/2 hours.  As for today, I order food around 5:10 and got there about 5:45, they told me 30 minutes.  I left after 6:30 with my order.  \n\nThere were a few more people who waited unhappily for their take out.  \n\nI was offered a free dish for the wait.  I thought about for all of half a second, I didn't want to be stuck there waiting for another 30 minutes for a free dish.  Hell No.  I opt to take my food and leave.\n\nThe naan I brought home wasn't fully cook and had a doughy taste. as was the aloo gobi (the cauliflower is completely crisp as if only just dumped into the curry and pulled out).  I will never order the assorted appetizers ever again, that was horrible.  The vegetable pakoras were a bit on the burnt side and wasn't even close to being authentic in any way .  I'm seriously disappointed today with the food tonight.  The tandoori murgh was very spicy (which I like but my daughter couldn't eat) was the only dish that was decent.  \n\nI've never had problems with the food when I eat there, but take out is a nightmare.", "rating": 1, "date": "2008-08-24"}, {"excerpts": ["Also had Half order of their Tandoori Murgh.  ", "Even though it was a half order, it was plenty.  ", "It came out on a sizzling plate full of onions and bell peppers.  ", "It reminded me of the sizzling plates Korean restaurants serve their ribs on.  ", "Anyhow, I was surprised by how tender and flavorful the chicken was.  ", "I was expecting a yogurty taste b/c ", "the menu says it was marinated in yogurt, but it had none.  ", "It was really good.\n", "We also had Saag Gosht--lamb and spinach.  ", "This was the best plate, I think.  ", "I usually don't like lamb but this one was really tender and the spinach/cilantro complemented it well.\n", "We had all of this with one wheat and one regular naan.  ", "Couldn't tell which one was which.\n", "Warning: you will come out smelling like smoke and your clothes will reek of it for days.  \n", "Overall great experience."], "author": "sarisha h.", "review": "Came here with a friend on a Thursday night.  The place was packed but we were seated quickly.\nHad their Assorted Appetizers: one samosa (tasty and filling), two veggie pakoras (lots of spices and greasy, like it should be), and one lentil wafer with sauces on the side.\nAlso had Half order of their Tandoori Murgh.  Even though it was a half order, it was plenty.  It came out on a sizzling plate full of onions and bell peppers.  It reminded me of the sizzling plates Korean restaurants serve their ribs on.  Anyhow, I was surprised by how tender and flavorful the chicken was.  I was expecting a yogurty taste b/c the menu says it was marinated in yogurt, but it had none.  It was really good.\nWe also had Saag Gosht--lamb and spinach.  This was the best plate, I think.  I usually don't like lamb but this one was really tender and the spinach/cilantro complemented it well.\nWe had all of this with one wheat and one regular naan.  Couldn't tell which one was which.\nWarning: you will come out smelling like smoke and your clothes will reek of it for days.  \nOverall great experience.", "rating": 4, "date": "2009-02-03"}], "rotis lamb popsicles": [], "tandoori prawns jheenga": [], "tandoori machchi": [], "murgh makhani": [{"excerpts": ["Murgh Makhani (butter chicken): pretty good. ", "The chicken was soft and not overcooked, but it could have used a little more time in the curry to give it that extra flavor.\n", "Bhindi Masala (sauteed okra): delicious variety of sweetness and spice with a hearty serving of okra.\n", "Garlic/basil naan: Although it's not as fluffy as traditional naan ", "this packs a delicious flavor punch! "], "author": "Josh L.", "review": "Looking for a spot last minute to grab dinner, my girlfriend and I decided to give this place a try after seeing it on Yelp. Upon entering, we were greeted by the host who let us choose our table. Once we were seated I noticed he tried his best to level the table which was uneven - very nice of him as most places wouldn't even do this. Our waitress was very cheery and did a good job checking on us.\n\nMurgh Makhani (butter chicken): pretty good. The chicken was soft and not overcooked, but it could have used a little more time in the curry to give it that extra flavor.\nBhindi Masala (sauteed okra): delicious variety of sweetness and spice with a hearty serving of okra.\nGarlic/basil naan: Although it's not as fluffy as traditional naan this packs a delicious flavor punch! The oiliness just adds more to the flavor!\n\nWe also had an order of Basmati rice which was fine. Portion size was great and I liked how everything was served together - each dish was fresh and hot. The place is on the louder side inside and when we left the place was full. Not a good place for a first date or a romantic evening. Parking on this street is tough to find, so you'll have to look elsewhere or on the side streets.", "rating": 4, "date": "2015-07-08"}, {"excerpts": ["Then had the Goat Cheese stuffed Naan and a Murgh Makhani. ", "Nice spice to the chicken and very flavorful. ", "Portions were big, which is nice change in a Indian restaurant. ", "I had a very nice lunch the next day! ", "I don't live near by, but when I'm back in SF or coming home from work, I will definitely stop by again. ", "Wish they were in my town, I would go there all the time!"], "author": "Michella F.", "review": "So I was coming home from SFO and was hungry. Thought I wanted some Indian food, but couldn't think of where, so I went to my Yelp and looked at things around me and found this place. Decided because of the review to try it out! \n\nWOW!!! What an amazing place! I lucked out and found parking right in the front, but I'm told that was only because there was a Niners game going on. I was met by a VERY nice staff including the Owner who, I had an extensive chat with and was very kind! The FOOD...outstanding! I had the Basil Lemonade. Good, but different and hard to explain. Then had the Goat Cheese stuffed Naan and a Murgh Makhani. Nice spice to the chicken and very flavorful. Portions were big, which is nice change in a Indian restaurant. I had a very nice lunch the next day! I don't live near by, but when I'm back in SF or coming home from work, I will definitely stop by again. Wish they were in my town, I would go there all the time!", "rating": 5, "date": "2012-12-26"}, {"excerpts": ["The one thing I thoroughly enjoyed was running huge pieces of garlic & basil naan through the sauce in our murgh makhani dish (tandoori chicken cooked in tomatoes, butter, & cream--", "that *cant* be bad!) "], "author": "Fancypants X.", "review": "If BFF had his way (& he usually gets his way, unless not one, but TWO girls are putting the kibosh on his plans), we would've had an Indian-themed day starting with yoga & ending with a Bollywood movie marathon. We skipped all that & just lunched at Roti in West Portal. \n\nMy party of three started with assorted appetizers. Papadum (lentil wafer), vegetable pakoras (mixed veggies fried in a chick pea batter--crisp & flavorful), & veggie samosa (filled w/ potatoes, peas, curry spice--I enjoyed it considering I don't love curry.)\n\nOther dishes included lamb chops (which I did not try) & a salmon dish (which was a tad fishy tasting. Also, sauce was not appetizing to a few of us at the table.)\n\nThe one thing I thoroughly enjoyed was running huge pieces of garlic & basil naan through the sauce in our murgh makhani dish (tandoori chicken cooked in tomatoes, butter, & cream--that *cant* be bad!) I opted for white meat chicken, which was firm & slightly dried out. \n\nLunch is served with chai tea, which was mildly spiced & flavored... just like everything else on the menu. Believe me, I'm not saying I want to be hit with super strong Indian spices (I actually enjoy 'fusion' cooking), but it seems Roti is walking on eggshells in the kitchen, so as not to offend patrons with robust flavors. Your diners are here for Indian food, so don't be afraid to give it to 'em.", "rating": 3, "date": "2012-12-19"}, {"excerpts": ["I ordered the murgh makhani (butter chicken), garlic & basil naan, and a half portion of rice for $25 and felt a bit cheated at the end of the meal: I paid a lot of money for something I didn't particularly enjoy.\n\n"], "author": "Daniel L.", "review": "Having just moved to West Portal, I've been slowly trying all the restaurants in this foggy neighborhood. I recently tried Indian food at Roti and am sorry to report that the food was rather underwhelming. To sum it up briefly, the portions were small, food mediocre, and prices high. \n\nI ordered the murgh makhani (butter chicken), garlic & basil naan, and a half portion of rice for $25 and felt a bit cheated at the end of the meal: I paid a lot of money for something I didn't particularly enjoy.\n\nFirst let me review my order of butter chicken. For some reason, the curry here is light in consistency--almost watery. It translates into a lighter taste that unfortunately detracts from the flavor and spice of the curry. The dish was still pleasant enough to eat, but in all honesty, it was a little too bland, especially for curry. It just didn't pack the punch I was looking for. \n\nSecond, the rice. I think this was the worst part of the meal. My rice was mushy and not very good. I'm guessing I got a bad batch because this stuff was horrible and made the whole meal hard to enjoy.\n\nThird, the naan. Fortunately, the naan was good and I was able to finish the curry eating the naan and forgoing the rice. It was charred nicely and had a nice fluffy, buttery taste. A must-order if you eat here, and in general when you order indian food IMO.\n\nI will note that the wait staff and owner were very nice and additionally the overall decor of the restaurant is excellent. I don't think these things are enough to warrant another visit however. I preferred the indian food down the street at clay oven. Although it's not quite as fancy as Roti, the curry and rice taste better there and the prices are more reasonable.", "rating": 3, "date": "2013-08-23"}, {"excerpts": ["Our party of 3 ordered:\n Murgh Makhani -boneless tandoori chicken cooked in mild spices, tomatoes, butter and cream \n"], "author": "Henry L.", "review": "Located in the slightly upscale West Portal area, this restaurant is a trendy upscale version of Indian cuisine that's been elevated by quality ingredients and tailored for American palates.  It has a great atmosphere and would be great place to take a date.\n\nTried out this restaurant on a Friday night around 730 PM and the restaurant was bustling with a full crowd.  Reservations are recommended to ensure your seat without a small wait.\n\nService was excellent and attentive throughout the night.\n\nOur party of 3 ordered:\n Murgh Makhani -boneless tandoori chicken cooked in mild spices, tomatoes, butter and cream \nRoti's Rogan Josh - classic lamb curry with garlic, ginger, peppercorns, onions and saffron\n Mixed Seafood Biryani - fresh fish, prawns and calamari cooked with basmati rice, saffron, butter and fresh herbs \nGoat Cheese Naan - Warm fresh buttery naan topped with a goat cheese blend as an appetizer.\nTandoori Roti - Soft roti bread that paired well wtih our entrees\n\nAll of the dishes were very flavorful, and while not spicy to the taste, were chock full of spices that will give you the Indian cuisine experience.  The dishes were very mild and catered to a more Americanized palate.\n\nThe owner stopped by near the end of the meal and had a nice chat about the ingredients and the ambiance.  Definitely recommended if you're craving a new dining experience and want to venture out for Indian food.", "rating": 4, "date": "2012-11-17"}, {"excerpts": ["Murgh Makhani: Not typically my favorite chicken dish, but the meat was very tender and the flavor was excellent.\n\n"], "author": "Jason G.", "review": "Went to visit our friends in SF, and we ordered out from Roti.\n\nLocation: On West Portal Ave, in one of those neighborhoods of San Francisco that most of us Peninsula types would never find.\n\nLook and feel: We did take out, so I only glimpsed the inside when I picked up our order.  Looked like a nice upscale bistro.\n\nMenu: Seems like a fairly standard Indian menu, with a bit of upscale nature to it.\n\nThe food: We ordered the following dishes:\n\nBengan Bharta: Good flavor, with a small kick.  Not as smoky as I would have liked, but still damn tasty.\n\nBhindi Masala: We've really become fans of okra in Indian dishes.  This was an excellent sauteed and spiced okra dish.\n\nDal Saag: First time I've ever had saag with dal.  (We'll typically order lamb saag or saag paneer.)  It was an okay dish, but if I hadn't known the name of it I wouldn't have known it was a saag.  I'd much prefer ordering one of our staple saag dishes, and get the lentils on their own plate.\n\nMacchi (Fish) Korma:  This was really good.  Perfectly cooked pieces of sea bass in a wonderful yellow cream sauce.  It could have used a few more pieces of fish, though, as this quickly became just a bowl of sauce.\n\nMurgh Makhani: Not typically my favorite chicken dish, but the meat was very tender and the flavor was excellent.\n\nRoti's bread basket: Tandoori Roti, Onion Kulcha, and Garlic & Basil Naan were all good, although a bit on the chewy side, but I don't think I could have always told you which was which.  Both of those complaints might have to do with it being takeout.  You just can't compete with breads right out of the kitchen.\n\nParatha: I wasn't all that impressed with the Paratha.  It was chewy like the others, yet at the same time it was falling apart in my wife's hands as she tried to break it into pieces for dipping.  I thought she'd have been better off putting it on her place like spaghetti and covering it with curry.\n\nService: The host quickly retrieved my takeout order and sent me on my merry, hungry way.\n\nValue: It's on the expensive side for Indian food (similar to Amber India, in Mountain View.)  I did appreciate that this place charged $5-6 less for their vegetarian entrees than their meat dishes.  \n\nWill I go back? I am quite sure this will get into the rotation of places we take out from when we visit out friends in this part of the city, and I'm totally okay with that.", "rating": 4, "date": "2007-11-18"}], "murgh palak": [], "murgh madras": [{"excerpts": ["We ordered the Murgh Madras and I loved the raisins that were in it.  "], "author": "Karen L.", "review": "A nice Indian place around the area.  Good quality, tasty food, very filling.\n\nThe few curries we tried were sweet.  We ordered the Murgh Madras and I loved the raisins that were in it.  For the Machchi Masala with salmon, the curry was a bit bland.  However, overall they were all great.", "rating": 4, "date": "2017-09-19"}, {"excerpts": ["We settled in and ordered some drinks [which were topped up throughout - we don't drink much alcohol, so diet coke and sprite were our choices] and then ordered the mixed appetisers [vegetable pakoras, vegetable samosas, popadom, mint raita, and some kind of sweet dipping sauce], mixed bread basket [three types of naan], Murgh Madras, plain rice, and Bhuna Gosht. \n\n"], "author": "Lindsey B.", "review": "What a great find! \n\nAfter a bit of research, we went by another Indian restaurant to find that it was closed, and looked like it had been for a while, so we jumped on Yelp to see what else was in the area. Roti looked quite appetising, but with the good reviews and interesting looking menu, we thought it would be fully booked. \n\nWe thought we would check it out anyway and we arrived at about 19:30 to be warmly greeted and offered our choice of tables [from about 5]. Parking was free [after 18:00] and out outside the front window. \n\nThe place was already bustling and the atmosphere was welcoming. The first thing we noticed when we opened the door was the lovely smell, which is a great start. \n\nWe settled in and ordered some drinks [which were topped up throughout - we don't drink much alcohol, so diet coke and sprite were our choices] and then ordered the mixed appetisers [vegetable pakoras, vegetable samosas, popadom, mint raita, and some kind of sweet dipping sauce], mixed bread basket [three types of naan], Murgh Madras, plain rice, and Bhuna Gosht. \n\nThe appetisers came quickly, but not *too* quickly, and we were given plenty of time to enjoy them before the mains came out. A fresh, warm plate was given after the appetiser, in time for the main course. I'm not sure if the warm plates were intentional or if they were just warm out of the washer, but in any case, it was a nice touch. \n\nThe main courses were superb. We're from England and we like our curries spicy, however, these were so tasty [well balanced, delicious flavours] that this didn't matter. However, the owner [??] came and asked us if the meal was spicy enough for us [perhaps the waitress mentioned something to him?] and then brought us over a pot of homemade chilli sauce to add some spice to our meal. The chilli sauce was superb; fresh, very spicy, and plentiful. \n\nThe bread basket was also delicious - we could really taste the ghee, and the garlic naan was a highlight for us. \n\nAll the staff in the restaurant were really lovely, especially our waitress who chatted with us about her travels to England and made us feel very welcomed. We could not have been happier with the service. We were also given a complimentary rice pudding and chai tea at the end of our meal. \n\nWe're so pleased that we happened across this place, and hopefully, on one of our future trips to San Francisco, we will return. \n\nThank you Roti!", "rating": 4, "date": "2014-08-09"}, {"excerpts": ["My favorite is the Murgh Madras, but I haven't quite worked my way through the entire menu.  "], "author": "Ernest F.", "review": "My latest obsession.  I stopped by for take out on a whim, and since then I've had several tasty and generously-portioned meals delivered to my home.  My favorite is the Murgh Madras, but I haven't quite worked my way through the entire menu.  The Kachumber salad appetizer is a treat and goes well with the main dishes.  The garlic nan with the mint cilantro chutney should be outlawed for being addictive.", "rating": 5, "date": "2016-12-14"}, {"excerpts": ["Murgh madras - Chicken curry cooked southern Indian style with coconut and golden raisins.  ", "This dish is amazing.  ", "We finished it rather quickly.  "], "author": "Jenny L.", "review": "03.08.10\n\nTo wine or not to wine?  Their list was extensive.  Yet they ran out of the Lone Duck sauvignon blanc on the menu.  And offered something off the menu for the same price.  Whoohoo!  The pourer has a heavy hand.  Definitely worth it.  Good call to wine.\n\nMurgh madras - Chicken curry cooked southern Indian style with coconut and golden raisins.  This dish is amazing.  We finished it rather quickly.  Goes well with both naan and rice.\n\nGarlic and basil naan - four pieces, $5.  Totally not worth it.  Especially when it was not delicious.  We only ate half.\n\nMakki asparagus paneer tikka - Grilled asparagus, two pieces of corn rubbed in cheese and spices, and potatoes on the side.  Sadly, we ignored this dish for the most part because the chicken curry was so good.\n\nFinished off with a side of Roti's basmati pulao.  Good rice!\n\nDefinitely need to venture to West Portal more often.", "rating": 3, "date": "2010-03-09"}], "chicken jalfrezi": [{"excerpts": ["Me and my guest ordered the Chicken Jalfrezi and Aloo Gobi (cauliflower plate). ", "Both were curries carnivorous and vegetarian friendly, respectively. ", "While both plates were decently spiced, they seriously lacked palatably, and I wasn't eager to dive in for a second taste. ", "It was like eating a PB&J sandwich without the jelly, but then again I don't like jelly, bad analogy. "], "author": "Annie L.", "review": "Let me preface this review with the fact I'm a wuss when it comes to spicy food. The slightest hint of jalapeno triggers five-alarm signals to my poor taste buds. Don't judge. Having said that, Roti disappoints in fusing flavor and spiciness that Indian food is known for. Me and my guest ordered the Chicken Jalfrezi and Aloo Gobi (cauliflower plate). Both were curries carnivorous and vegetarian friendly, respectively. While both plates were decently spiced, they seriously lacked palatably, and I wasn't eager to dive in for a second taste. It was like eating a PB&J sandwich without the jelly, but then again I don't like jelly, bad analogy. The only reason i kept eating was to have something to dip my naan in, which you really can't go wrong with, even if it's just plain naan.  \n\nAll in all, the experience was pleasant: servers were attentive and polite, dim ambiance. May I add, it was a little noisy but maybe it was just that particular night due to 3 separate big parties taking place, one being a group of drunk 40-something cougars.  However, the food fell a little short of prompting future visits.", "rating": 3, "date": "2009-06-10"}, {"excerpts": ["I ordered the Chicken Jalfrezi, which is braised chicken with tomatoes, onions, peppers, basil and other spices.  ", "Sounds good?  ", "You bet! ", "Since the chicken stews in the sauce, it makes it moist and tender to the bite.  ", "The infusion of herbs and spices is perfect.  ", "The presentation looks simple, but the taste is complex with many different layers and textures.  "], "author": "myiken n.", "review": "A must go to if you happen to get lost in West Portal :).\n\nThe inside of the restaurant is clean and has a gentle serene feel to it.  Definitely a great place for a date, however, be forewarned that when you are finished with the delicious meal the smell of curry will linger on your clothes for the rest of the night.\n\nI ordered the Chicken Jalfrezi, which is braised chicken with tomatoes, onions, peppers, basil and other spices.  Sounds good?  You bet! Since the chicken stews in the sauce, it makes it moist and tender to the bite.  The infusion of herbs and spices is perfect.  The presentation looks simple, but the taste is complex with many different layers and textures.  The dish had the perfect about of heat from the chili -- not too spicy or too mild!\n\nNann comes with the meal which is an excellent dipping companion with the sauce.  You do have a choice between either nann or rice.\n\nA must visit!  Delicious! And the price was right!", "rating": 5, "date": "2008-07-05"}], "rotis rogan josh": [], "lamb chop masala": [{"excerpts": ["So a Lamb Chop Masala ($22) was a no brainer although it didn't occur to me before ordering it was another tandoori dish. ", "It did result in tandoori overkill. ", "I assume masala refers to garam masala, an exotic blend of Indian spices that was rubbed into the lamb chops.  ", "Again, like the tandoori hen, the charring on the ribs brought out the best of the tandoor. ", "The only negative was the meat was a tad salty. ", "Although I am not on a low sodium diet, I am still mindful of my sodium intake. "], "author": "Geoff G.", "review": "I thought I had made a mental bookmark of Roti Indian Bistro West Portal after viewing a rerun on \"Checks Please\" but I didn't realize  that the show featured its sister restaurant in San Mateo that had since closed. Yelp confirmed my confusion and so West Portal it was gonna be! lt turned out fortuitous anyway  as the evening was indeed memorable. \n\nWest Portal is a charming and quaint little shopping enclave with a plethora of unique stores and eateries. It used to be my stomping ground when I lived in this 'hood years ago. Parking might be a little challenging though not impossible. As we walked in, I noticed the subdued lighting with an open kitchen against the back wall and pleasing color schemes on the sidewalls. The ambiance was eye soothing with contemporary artwork adorning the walls and none of the boisterous conviviality of Bollywood that is often associated with other Indian restaurants. The furniture though was a little dated and I'm sure that would be an easy fix. \n\nI am usually a sucker for specials regardless of whether they're daily, weekly or monthly. Something unusual caught my eye. How would Spicy Tomato, Mango, Papaya Chaat ($8) grab you? It turned out to be a refreshing fruit salad using authentic Indian ingredients like grounded cumin, crushed black peppers, chopped mint leaves and fresh ginger and lime juice. The heirloom tomatoes were sweet, the fruits were just ripe giving a good crunch and boy, the whole platter was scrumptious as well! (4/5)\n\nContinuing on with the monthly special was a Tandoori Chicken Hen ($18). I have to admit I am not too sure what the technical difference is between a game hen and chicken but as a consumer, I do know from experience the former is usually smaller size-wise, the meat is tenderer and costs a little more. With this in mind, I've to say RIB's tandoori hen was the most mouth-watering tandoori bird I have ever bitten into! This is a classic Indian preparation in a tandoor (clay oven) that consisted of a hen roasted in mesquite charcoal after being marinated in Indian spices and yogurt. There was a fragrant blackened char on the edges; the meat was moist and fried chicken was no contest. (5/5)\n\nI have a soft spot for lamb chops that is now becoming a rarity in an Indian restaurant. So a Lamb Chop Masala ($22) was a no brainer although it didn't occur to me before ordering it was another tandoori dish. It did result in tandoori overkill. I assume masala refers to garam masala, an exotic blend of Indian spices that was rubbed into the lamb chops.  Again, like the tandoori hen, the charring on the ribs brought out the best of the tandoor. The only negative was the meat was a tad salty. Although I am not on a low sodium diet, I am still mindful of my sodium intake. (4/5)\n\nAs far as I am concerned, no Indian meal is quite complete without a curry dish. I opted for the quintessential Chicken Vindaloo ($15). It paled compared to the tandoori dishes as it lacked the fragrance and tastes from the mystifying concoction of spices and I didn't just mean the heat. Strangely, I enjoyed being kicked while savoring Indian curries! The gravy was watered down with no discernable oomph! It wasn't bad but definitely not the best. (3/5)\n\nThe owner was an unassuming soft-spoken man who periodically checked in with us in his low-keyed manner and without being disruptive or intrusive.  He surprised us by comping us the fruit salad as a token of his appreciation that we drove the distance to eat at his establishment. He had unwittingly gained our loyalty!", "rating": 4, "date": "2016-07-02"}], "boti kabab masala": [], "gosht vindaloo": [{"excerpts": ["My favorite is the Gosht Vindaloo. ", "It's delicious. ", "Other dishes are a bit strange for my pallet, but the overall food quality is good. ", "The decor is very modern. ", "The other major critique I have about Roti is its service. ", "The waitpeople are horrible. ", "They are rude, and slow, and so complacent when it comes to checking on the customers. ", "I hate being ignored and having to wait 10-15 minutes to get their attention when trying to order more food, or get the check. ", "In the end, Roti is a good place if you haven't had Indian food. ", "The price range is average (from some $7-25). ", "The average price for the dishes there is about $16-17. ", "Bottom line: try Roti, just don't expect 5 star quality at this 3.5 star restaurant."], "author": "Kevin D.", "review": "Roti is my favorite Indian restaurant by far. So why then am I giving this place a 3-star rating and not higher one? To start off, I am very picky; in order for a place to get a 4 or 5-star rating, I feel like the place must earn it, and though Roti is my favorite Indian place, it has not yet earned a high rating. The noise level at Roti is almost unbearable. Talk about din while having din-din(dinner).  The food is ok, depending on what you get. My favorite is the Gosht Vindaloo. It's delicious. Other dishes are a bit strange for my pallet, but the overall food quality is good. The decor is very modern. The other major critique I have about Roti is its service. The waitpeople are horrible. They are rude, and slow, and so complacent when it comes to checking on the customers. I hate being ignored and having to wait 10-15 minutes to get their attention when trying to order more food, or get the check. In the end, Roti is a good place if you haven't had Indian food. The price range is average (from some $7-25). The average price for the dishes there is about $16-17. Bottom line: try Roti, just don't expect 5 star quality at this 3.5 star restaurant.", "rating": 3, "date": "2009-06-16"}], "bhuna gosht": [{"excerpts": ["We settled in and ordered some drinks [which were topped up throughout - we don't drink much alcohol, so diet coke and sprite were our choices] and then ordered the mixed appetisers [vegetable pakoras, vegetable samosas, popadom, mint raita, and some kind of sweet dipping sauce], mixed bread basket [three types of naan], Murgh Madras, plain rice, and Bhuna Gosht. \n\n"], "author": "Lindsey B.", "review": "What a great find! \n\nAfter a bit of research, we went by another Indian restaurant to find that it was closed, and looked like it had been for a while, so we jumped on Yelp to see what else was in the area. Roti looked quite appetising, but with the good reviews and interesting looking menu, we thought it would be fully booked. \n\nWe thought we would check it out anyway and we arrived at about 19:30 to be warmly greeted and offered our choice of tables [from about 5]. Parking was free [after 18:00] and out outside the front window. \n\nThe place was already bustling and the atmosphere was welcoming. The first thing we noticed when we opened the door was the lovely smell, which is a great start. \n\nWe settled in and ordered some drinks [which were topped up throughout - we don't drink much alcohol, so diet coke and sprite were our choices] and then ordered the mixed appetisers [vegetable pakoras, vegetable samosas, popadom, mint raita, and some kind of sweet dipping sauce], mixed bread basket [three types of naan], Murgh Madras, plain rice, and Bhuna Gosht. \n\nThe appetisers came quickly, but not *too* quickly, and we were given plenty of time to enjoy them before the mains came out. A fresh, warm plate was given after the appetiser, in time for the main course. I'm not sure if the warm plates were intentional or if they were just warm out of the washer, but in any case, it was a nice touch. \n\nThe main courses were superb. We're from England and we like our curries spicy, however, these were so tasty [well balanced, delicious flavours] that this didn't matter. However, the owner [??] came and asked us if the meal was spicy enough for us [perhaps the waitress mentioned something to him?] and then brought us over a pot of homemade chilli sauce to add some spice to our meal. The chilli sauce was superb; fresh, very spicy, and plentiful. \n\nThe bread basket was also delicious - we could really taste the ghee, and the garlic naan was a highlight for us. \n\nAll the staff in the restaurant were really lovely, especially our waitress who chatted with us about her travels to England and made us feel very welcomed. We could not have been happier with the service. We were also given a complimentary rice pudding and chai tea at the end of our meal. \n\nWe're so pleased that we happened across this place, and hopefully, on one of our future trips to San Francisco, we will return. \n\nThank you Roti!", "rating": 4, "date": "2014-08-09"}], "gosht madras": [{"excerpts": ["The eggplant curry was definitely on the bland side and overspiced, but the chicken tikka masala, gosht madras (lamb), and Aloo Gobi (cauliflower) were all excellent dishes and worth trying.  ", "There are enough strong classic dishes, ambiance and some eye catching art that will keep me a fan of this place."], "author": "Darren B.", "review": "I've always wanted to try this place and finally got my chance a few weeks ago.  I'm not a die hard on Indian food but was feeling the craving for a few basic Indian classics.  Came on a Sunday night around 5:30 and the place started jumping from 6pm on.  The service looked a little stretched as they didn''t seem to have a designated host.  I guess my puzzled look was enough for one of the waiters to notice us and he quickly seated us and apologized.  The place gets cold but they had little space heaters above the booths to combat the draft...creative, yet ghetto.\n\nThe food is decent and they kept the water filled, which is necessary if you can't take the heat.  I learned to ask how spicy their dishes were at baseline before they added more spice.  The naan and tandoori roti were as good as I expected and we enjoyed flavorful & cripsy chicken pakoras as appetizers.  The eggplant curry was definitely on the bland side and overspiced, but the chicken tikka masala, gosht madras (lamb), and Aloo Gobi (cauliflower) were all excellent dishes and worth trying.  There are enough strong classic dishes, ambiance and some eye catching art that will keep me a fan of this place.", "rating": 3, "date": "2011-01-18"}, {"excerpts": ["For lamb lovers, the Gosht Madras, cooked southern Indian-style with coconut sauce was delicious!  ", "The lamb is lean and tender.  ", "For cheese lovers, the goat cheese naan bread (served with a generous extra dollop of goat cheese, was creamy and so tasty.  ", "All very good with a glass of the excellent Barbera.  ", "The helpings are generous, the decor tasteful, and the music is soft so that diners can converse.  ", "The greatest pleasure of all here is the warm and hospitable owner who is attentive to the comfort of every diner present, both at the time of seating and during the meal.   ", "When chicken was served (instead of the lamb we ordered) in the Madras sauce, he gladly returned with the lamb, and treated us to 2 glasses of after-dinner dessert wine for the mistake.  ", "We can't say enough about this gem of a restaurant, and we will be back again."], "author": "Donna A.", "review": "YUM!!!  Our favorite place for Indian food!  Nothing run-of-the-mill here...this is gourmet all the way.  Having sampled Indian food all over the world (including India), we can honestly say that this is the best of the best.  Returned for the nth time to try dishes we've never had here before.  This is consistently the best Indian food ever.  Tried the Murgh Malai...the chicken was succulent, fresh, and perfectly spicy. For lamb lovers, the Gosht Madras, cooked southern Indian-style with coconut sauce was delicious!  The lamb is lean and tender.  For cheese lovers, the goat cheese naan bread (served with a generous extra dollop of goat cheese, was creamy and so tasty.  All very good with a glass of the excellent Barbera.  The helpings are generous, the decor tasteful, and the music is soft so that diners can converse.  The greatest pleasure of all here is the warm and hospitable owner who is attentive to the comfort of every diner present, both at the time of seating and during the meal.   When chicken was served (instead of the lamb we ordered) in the Madras sauce, he gladly returned with the lamb, and treated us to 2 glasses of after-dinner dessert wine for the mistake.  We can't say enough about this gem of a restaurant, and we will be back again.", "rating": 5, "date": "2014-05-04"}], "machchi masala": [{"excerpts": ["For the Machchi Masala with salmon, the curry was a bit bland.  ", "However, overall they were all great."], "author": "Karen L.", "review": "A nice Indian place around the area.  Good quality, tasty food, very filling.\n\nThe few curries we tried were sweet.  We ordered the Murgh Madras and I loved the raisins that were in it.  For the Machchi Masala with salmon, the curry was a bit bland.  However, overall they were all great.", "rating": 4, "date": "2017-09-19"}, {"excerpts": ["Here's what we ordered:\n\nMachchi Masala (19)\n"], "author": "Nina M.", "review": "We went here late at night (around 8PM) and was starving and luckily found this place.  It's not the best Indian food I've had, but it's fairly decent.\n\nOur server, Jake, was very helpful in his suggestions.  There was only 2 of us, so we didn't want to overspend on the amount of dishes we ordered.  He helped us figure out the portions and whatnot.\n\nHere's what we ordered:\n\nMachchi Masala (19)\nRogan Josh (17)\nBasmati Pulao (5)\nParantha (5)\n\nThe fish wasn't that great, but I absolutely loved the Rogan Josh (lamb curry).  Another thing I loved?  The Basmati Pulao.  If I ever return, I would order the Rogan Josh with the Basmati Pulao.  \n\nThe price that they charge for the food is a bit extreme when it's only two people.  So you need to choose carefully on what you order, but I have a feeling that either way you'll be walking out with a significant dent on  your wallet (The overall price charged is $50.37 without tip).", "rating": 3, "date": "2011-01-02"}, {"excerpts": ["After that, I ordered a chicken tandoori (murgh)and my BF a Machchi Masala (sea bass curry dish). ", "I almost fainted because my chicken was too spicy. ", "I was in pain, my mouth, my throat and my stomach were burning like hell. ", "I called the waiter and told him that I could not eat it  because it was too spicy. ", "The waiter was confrontational and simply said that \" this is the way the food is here\" ! \n", "I was horrified and told him to take it away. ", "He offered me to change it and make another one not spicy. ", "My BF's curry was too salty/msg, inedible and the seabass was overcooked and soaked in the rich and salty sauce. ", "The waiter came back 15mns later and my BF told him about his dish. ", "The waiter answered him agressively\" you too you want to change that\"?? \n", "He said no, but give me more rice in order to be able to mix my fish with .\n", "I felt bad because it was our Friday date night ", "and it was screwed up. \n", "2 hours have passed since the end of the meal and I am still in pain, having stomach cramps. \n", "And on top of that it is very expensive for the quality of food and service."], "author": "Mary A.", "review": "My boyfriend and myself had dinner at Roti tonite and we were extremely disappointed. To start the hostess seemed confused about where to seat us and eventually she sat us at a table not finished to be cleaned up and put the menus on the dirty table! We had to call someone to clean it up. After that, I ordered a chicken tandoori (murgh)and my BF a Machchi Masala (sea bass curry dish). I almost fainted because my chicken was too spicy. I was in pain, my mouth, my throat and my stomach were burning like hell. I called the waiter and told him that I could not eat it  because it was too spicy. The waiter was confrontational and simply said that \" this is the way the food is here\" ! \nI was horrified and told him to take it away. He offered me to change it and make another one not spicy. My BF's curry was too salty/msg, inedible and the seabass was overcooked and soaked in the rich and salty sauce. The waiter came back 15mns later and my BF told him about his dish. The waiter answered him agressively\" you too you want to change that\"?? \nHe said no, but give me more rice in order to be able to mix my fish with .\nI felt bad because it was our Friday date night and it was screwed up. \n2 hours have passed since the end of the meal and I am still in pain, having stomach cramps. \nAnd on top of that it is very expensive for the quality of food and service.", "rating": 1, "date": "2010-08-27"}], "machchi korma": [], "jheenga palak": [{"excerpts": ["Our favorite dishes include: chicken pakoras, served with Roti's amazing mint chutney, the chicken tikka masala, the lamb korma and the jheenga palak (jumbo prawns with spinach). ", "We always over-order ", "so we can take food home with us. ", "The service is friendly, personable and speedy. ", "The staff make a special effort to welcome children, bringing delicious mango lassis soon after arrival. \n", "The stylish, smart interior, inviting lighting and attractive wall hangings make for a great ambiance too. ", "Well worth the excursion to West Portal if you've never been out here."], "author": "Rachel B.", "review": "This is undoubtedly our favorite Indian restaurant in San Francisco. I was reminded of how authentic and excellent the food is recently when I had the opportunity to compare it with that of another highly rated Indian restaurant as I dined at both within less than a week and ordered exactly the same dishes. The Roti versions were more flavorsome, fresher tasting and less greasy. Our favorite dishes include: chicken pakoras, served with Roti's amazing mint chutney, the chicken tikka masala, the lamb korma and the jheenga palak (jumbo prawns with spinach). We always over-order so we can take food home with us. The service is friendly, personable and speedy. The staff make a special effort to welcome children, bringing delicious mango lassis soon after arrival. \nThe stylish, smart interior, inviting lighting and attractive wall hangings make for a great ambiance too. Well worth the excursion to West Portal if you've never been out here.", "rating": 5, "date": "2016-04-14"}], "rotis mixed seafood curry": [], "rotis dal makhani": [], "rotis dal": [], "paneer jalfrezi": [{"excerpts": ["For our entrees we shared Paneer Jalfrezi (vegetarian dish) and Tandoori Chicken Tikka. ", "Sides- ", "Basmati Pulau rice and regular Naan. ", "The tandoori chicken came out on a hot plate, still sizzling, and the Jalfrezi was steaming hot. ", "Everything was so delicious and super filling. ", "The combo between veggie dish and the chicken dish was perfect. ", "We had the right amount of meat and veggies. ", "The restaurant was set up very unique, with the kitchen being open so we can see them cooking. ", "The waitress Mary was very nice and helpful. ", "She took great care of us. ", "After we finished, they boxed up our leftovers for us very neatly, that's a great perk! ", "Highly recommend."], "author": "Britany B.", "review": "While in San Francisco area we got hungry for something filling, what better than Indian food. After our search we stumbled upon Roti, looking over the reviews, we decided to stop in for an early dinner. We started with a chai tea and veggie samosas. The appetizer was great, with the mint dip they serve with it. For our entrees we shared Paneer Jalfrezi (vegetarian dish) and Tandoori Chicken Tikka. Sides- Basmati Pulau rice and regular Naan. The tandoori chicken came out on a hot plate, still sizzling, and the Jalfrezi was steaming hot. Everything was so delicious and super filling. The combo between veggie dish and the chicken dish was perfect. We had the right amount of meat and veggies. The restaurant was set up very unique, with the kitchen being open so we can see them cooking. The waitress Mary was very nice and helpful. She took great care of us. After we finished, they boxed up our leftovers for us very neatly, that's a great perk! Highly recommend.", "rating": 5, "date": "2018-02-02"}, {"excerpts": ["The paneer jalfrezi, part from being oily and the worst ever, actually had lettuce in it. ", "Since when did people start \"cooking\" lettuce, and especially in Indian cuisine?! ", "This is the first time Ive ever had lettuce in a vegetable gravy dish. ", "I could make better paneer at home. "], "author": "Soniya R.", "review": "This is a review by a vegetarian Indian!\nI dont know how the other food is, but all the vegetarian food we ordered was tasteless and oily. All we could taste was the raw chopped green chillies added last minute, since we asked for spicy food.\nThe only good thing was the goat cheese naan as an appetizer.\n\nThe paneer jalfrezi, part from being oily and the worst ever, actually had lettuce in it. Since when did people start \"cooking\" lettuce, and especially in Indian cuisine?! This is the first time Ive ever had lettuce in a vegetable gravy dish. I could make better paneer at home. The naans/rotis/parathas were huuuge and super oily. \n\nI think the chefs may have changed recently, Ive eaten here ebfore, and at their Burlingame restaurant as well, and it was much better. The food was so bad, that we didn't even want to box it up!\n\nApart from this, great service and staff.", "rating": 1, "date": "2009-05-18"}], "paneer bhujia": [{"excerpts": ["We even got the puri with paneer bhujia which was good as well, maybe a little sweet\nFood was prepared fresh and came to us piping hot.\n", "Overall happy with the food and service. \n", "Would definitely visit again."], "author": "Pooja M.", "review": "Went here for lunch. Food and service were excellent .\nMenu for weekday lunch is limited but the food is tasty.\nWe got the karai paneer which came with salad and naan. It was a bit more oily than I would want it but the taste was great. \nWe even got the puri with paneer bhujia which was good as well, maybe a little sweet\nFood was prepared fresh and came to us piping hot.\nOverall happy with the food and service. \nWould definitely visit again.", "rating": 5, "date": "2018-07-27"}, {"excerpts": ["We ordered the Paneer Bhujia, the Cholay, the Chicken Tikka Masala, and the special Badami Chicken. ", "I'm veg, so I only tasted the sauces on the chicken dishes, but it was all really tasty, and sufficiently spicy for my mirchi-loving companions. ", "The naan basket was really yummy as well. "], "author": "Vandana M.", "review": "I'll admit, I walked into this place with a bad attitude. Anyplace that labels itself as an \"Indian Bistro\" is highly suspect in my opinion. I mean, calamari at an Indian restaurant? Please. \n\nSo when the waiter couldn't pronounce the word \"lassi\" correctly, it got my panties in a bunch. When I saw the prices, my fists started to clench. And when he informed me that they were out of mango juice, I think smoke may have started coming out of my ears.\n\nBut to my surprise, the food was really good. We ordered the Paneer Bhujia, the Cholay, the Chicken Tikka Masala, and the special Badami Chicken. I'm veg, so I only tasted the sauces on the chicken dishes, but it was all really tasty, and sufficiently spicy for my mirchi-loving companions. The naan basket was really yummy as well. My \"special Indian style lemonade\" was waaaaaaay too sweet though, and at five bucks for a mango lassi (or laaaaahsi, as the waiter pronounced it), it had better have diamond chips floating in it (it didn't).\n\nOnce we were presented with our hefty bill (about $100 for five of us, which is a lot for Indian food, especially when Indians are eating it), it took the staff a good 15 minutes to pick up our credit cards, and then there was huge confusion about how to split the bill between three cards. It was a bit insane, especially since they seemed to have more waitstaff than customers at the time.\n\nAnyway, I agree with those reviewers who've said they'd come here again, as long as someone else is paying. Otherwise I'll be in the Tandoorloin.", "rating": 3, "date": "2007-06-04"}], "rotis mixed vegetables": [], "garlic and basil naan": [{"excerpts": ["so you can taste a variety of naans, including my personal favorite, the garlic and basil naan.\n\n"], "author": "Sejal D.", "review": "My family and I have been coming to Roti Indian Bistro for years, as it is our go-to for Indian food at a nicer-than-average restaurant. The service is great, and the food is plentiful and tasty, and you aren't breaking the bank as you would at some of the other higher end Indian restaurants in San Francisco.\n\nFor those looking for truly \"authentic\" Indian food, Roti is a great place to start. While they boast their modern Indian cuisine and get creative with their naans, you are getting the traditional flavors of North India with every dish.\n\nRoti's staff and service create a warm and welcoming vibe, which simply enhances your dining experience. They are responsive and friendly, and the owner will take time to meet with you, and check up on you.\n\nFor vegetarians, I recommend the paneer makhani, the navrattan korma, and palak paneer. Always get the \"Roti's Bread Basket\" so you can taste a variety of naans, including my personal favorite, the garlic and basil naan.\n\nParking isn't always easy so plan to spend a few extra minutes looking on the side streets to park. It's all worth it!", "rating": 4, "date": "2017-09-13"}, {"excerpts": ["Everything tasted good with a dab of Raita on it, especially the Garlic and Basil Naan.\n\n"], "author": "Jordan I.", "review": "Where do I even begin?! \n\nMy family of 13 dined at Roti Indian Bistro this past weekend to celebrate a birthday and everything was amazing! First of all, for such a small and intimate restaurant, the staff was very accommodating with the size of our party. We called ahead to make a reservation since there were so many of us and when we arrived, they had tables reserved for us towards the back of the restaurant. \n\nI'm ashamed to say this, but it was my first time trying Indian food and I can't believe it's taken me this long! The food here at Roti is absolutely wonderful! Everything we ordered was delicious and even the picky eaters in my family found something that they liked!\n\nCucumber Raita- Homemade yogurt with cucumber, caraway, and cumin. The Raita reminded me of Tzatziki, a similar dish that originates in Greece. Everything tasted good with a dab of Raita on it, especially the Garlic and Basil Naan.\n\nGarlic and Basil Naan- Don't even think twice about it. You have to order this! I don't know what this stuff is made of, but it was flavorful and extremely fresh. I mean, it was so fresh that it was too hot to touch! The Naan was crispy and thin, perfect to dip in the leftover sauce from the Chicken Tikka Masala. Do it!\n\nRoti's Basmati Pulao- Basmati rice cooked with saffron, cumin, cardamon, and bay leaves. Us Filipinos eat just about everything with rice and there was no way in hell that I was going to have curry without rice. It's just not right! The Basmati Pulao smelled wonderful. It was extremely aromatic! Long-grain, similar to Jasmine rice, it was very light and definitely went well with all of the dishes.\n\nChicken Vindaloo- Would this meal have been complete without curry? Absolutely not, people. The chicken was very tender and the potatoes were cooked just right. Sauce was amazing. I ordered it a little milder than it usually comes because the \"hot and spicy\" description on the menu scared me. To my surprise, the mild sauce didn't have much spiciness to it. I'd definitely order it again, but next time, bring on the heat! \n\nChicken Tikka (Tandoori Specialties)- Boneless chicken breasts marinated with ginger, garlic, spices and herbs. Presentation of this dish was awesome. The chunks of chicken breast were plated on top of mixed vegetables and the entire dish was steaming when the server brought it out from the kitchen. Don't forget to squeeze a little fresh lemon on the chicken!\n\nRoti serves the dishes family-style, so the portions are huge. The menu is reasonably priced, considering you're in West Portal. No complaints here!\n\nOur dining experience at Roti was amazing and I'm looking forward to my next visit to San Francisco just to eat here again! The staff was friendly and professional, ambiance of the restaurant was very warm and relaxing, and the food was of good quality. Thank you, Roti!", "rating": 5, "date": "2017-09-22"}, {"excerpts": ["Add some garlic and basil naan and prepare to have your mind blown.\n\n"], "author": "K E.", "review": "This restaurant is just so incredible. SO GOOD. EVERYTHING IS SOOOOO GOOD!\nI've been here at least 20 times and I always try to make sure I taste new things and I've seriously never had anything that wasn't excellent. My favorites are the Tandoori Salmon (which I top with a otherworldly mixture of raita, green sauce and hot sauce), Chana masala, paneer makhani and this amazing whole cauliflower dish (that is a seasonal special). Add some garlic and basil naan and prepare to have your mind blown.\n\nDamn I want to go there right this second.", "rating": 5, "date": "2017-05-17"}, {"excerpts": ["For appetizers, we have the Garlic and Basil Naan, Keema Naan (naan stuffed with grounded lamb) & Fried calamari. ", "Entree we had Tandoori Duck Breast & Keema Aloo Matter .  ", "My favorite is Tandoori Duck Breast. ", "It's only on the December Special menu. ", "The meat is juicy, not over or under cooked, & not greasy at all.   ", "Both Keema dishes are spiced so well that the gamy nature of lamb is minimized.  ", "The fried calamari is distinctively marinated  with Indian spice.  ", "Ambience and service are great.  ", "All is very good here ", "Except the noise level is relatively high inside, may be due to inadequate sound protection.  ", "Must come back soon."], "author": "Sunny B.", "review": "Tonight I'm very grateful to my partner's advice to go to this old place for a very wonderful dinner.  Old means they are doing so well that they can survive all these years with all competition.  For appetizers, we have the Garlic and Basil Naan, Keema Naan (naan stuffed with grounded lamb) & Fried calamari. Entree we had Tandoori Duck Breast & Keema Aloo Matter .  My favorite is Tandoori Duck Breast. It's only on the December Special menu. The meat is juicy, not over or under cooked, & not greasy at all.   Both Keema dishes are spiced so well that the gamy nature of lamb is minimized.  The fried calamari is distinctively marinated  with Indian spice.  Ambience and service are great.  All is very good here Except the noise level is relatively high inside, may be due to inadequate sound protection.  Must come back soon.", "rating": 5, "date": "2015-12-16"}, {"excerpts": ["Bliss\n\nOnion kulcha and garlic and basil naan offered in their \"bread basket\" assortment.\n\n"], "author": "Antoinette S.", "review": "ROTI IS THE BEST INDIAN RESTAURANT IN SF!!! \nWe just discovered this after living in the Parkside for over 3 years. Well, better late than never! This is a very elegant restaurant that seems to \"dress up\" every dish with extra touches, ie; lovely bits of onions and herbs. We ordered a wide variety of food from their menu and each selection, whether it was lamb curry or a humble cucumber salad were garnished with these little extras.\nIn fact, we started with that Kuchumber salad which was filled with chunks of cucumber, cherry tomatoes, red onions, and herbs in a light vinegar dressing. I find that this salad is usually a rudimentary starter at most Indian restaurants. But, Roti heightened their offering with what seemed to be a variety of fresh herbs.\nThe Bombay Calamari was very fresh and light, not greasy.\nOur mains included:\nLiterally the best Tandoori Chicken that we have ever had! Succulent, moist, and very intense BBQ flavor. The incidentals are usually just onions and lemon at most places,but here included several kinds of bell peppers and veggies. We discussed the possibility in the future of stopping here to pick up a couple of whole chickens to take home and build a meal around...\n\nSeafood Curry: This had the best creamy tomato sauce covering salmon, squid, and shrimp. Sublime\n\nLamb Boti Kebab with masala sauce. Quite a bit of meat slices in this!\n\nVery good saag (creamed spinach)\n \nAbsolutely the best Keema Naan: the bread was blistered, yet buttery with very thick layers of ground lamb. Bliss\n\nOnion kulcha and garlic and basil naan offered in their \"bread basket\" assortment.\n\nBasically, Roti Indian Bistro offers gourmet Indian food for very reasonable prices in West Portal.", "rating": 5, "date": "2016-09-11"}, {"excerpts": ["My favorite dish is the tandoori game hen and the garlic and basil naan. ", "The restaurant's owner is very attentive and amiable. ", "You can tell that he values giving his customers the best dining experience possible. ", "The restaurant can be a little noisy but the clamor just adds to the festive environment. ", "They are a bit more expensive than their competitors but the higher price tag is warranted because the good is so yummy!"], "author": "Angela W.", "review": "This is my favorite Indian restaurant. I love the food. My favorite dish is the tandoori game hen and the garlic and basil naan. The restaurant's owner is very attentive and amiable. You can tell that he values giving his customers the best dining experience possible. The restaurant can be a little noisy but the clamor just adds to the festive environment. They are a bit more expensive than their competitors but the higher price tag is warranted because the good is so yummy!", "rating": 5, "date": "2016-04-02"}, {"excerpts": ["Garlic and Basil Naan\nRoti's Basmati Pulao\n& of COURSE....."], "author": "Emerald I.", "review": "Garlic and Basil Naan\nRoti's Basmati Pulao\n& of COURSE.....Chicken Tikka Masala\n\n\nthat's it that's all for two. delicious. $40 . you will feel like royalty. YUM.", "rating": 5, "date": "2012-04-30"}, {"excerpts": ["Garlic and basil naan - four pieces, $5.  ", "Totally not worth it.  ", "Especially when it was not delicious.  "], "author": "Jenny L.", "review": "03.08.10\n\nTo wine or not to wine?  Their list was extensive.  Yet they ran out of the Lone Duck sauvignon blanc on the menu.  And offered something off the menu for the same price.  Whoohoo!  The pourer has a heavy hand.  Definitely worth it.  Good call to wine.\n\nMurgh madras - Chicken curry cooked southern Indian style with coconut and golden raisins.  This dish is amazing.  We finished it rather quickly.  Goes well with both naan and rice.\n\nGarlic and basil naan - four pieces, $5.  Totally not worth it.  Especially when it was not delicious.  We only ate half.\n\nMakki asparagus paneer tikka - Grilled asparagus, two pieces of corn rubbed in cheese and spices, and potatoes on the side.  Sadly, we ignored this dish for the most part because the chicken curry was so good.\n\nFinished off with a side of Roti's basmati pulao.  Good rice!\n\nDefinitely need to venture to West Portal more often.", "rating": 3, "date": "2010-03-09"}, {"excerpts": ["Great service, good food, and the garlic and basil naan was off the hook!\n\n"], "author": "Nancy M.", "review": "PRO'S: Great service, good food, and the garlic and basil naan was off the hook!\n\nCON'S: You have to wait FOREVER for a seat, it's really pricey for food that is better at naan and chutney, and the goat cheese naan may \"sound\" like a good idea...but really, it's not. They go over kill on the goat cheese, and I love goat cheese, but even I know when too much takes away from the meal.\n\nI really like this place, I would go again...but I have had better and bigger portioned indian food at other places in the city that didn't cost over $40 for two people.", "rating": 3, "date": "2008-02-05"}, {"excerpts": ["We went with the Garlic and Basil Naan, Murgh Masala curry, one of the Veggie curries with farmer's cheese (this dish was my favorite, the cheese tasted like tofu - YUM), Kashmiri Biryani rice - this was EXCELLENT and the Halibut special. ", "We were VERY happy with our choices. "], "author": "S N.", "review": "After a quick intimate wedding at Grace Cathedral 9/12 evening we decided to celebrate the nuptials at Roti. What a treat, because Roti is soooo good! We got to Roti around 9pm and it was a packed house, luckily we didn't have to wait long. You wouldn't think you were eating in an Indian restaurant from the decor since it's modern. The atmosphere is very casual and a bit loud. \n\nThe good stuff: the meal! We went with the Garlic and Basil Naan, Murgh Masala curry, one of the Veggie curries with farmer's cheese (this dish was my favorite, the cheese tasted like tofu - YUM), Kashmiri Biryani rice - this was EXCELLENT and the Halibut special. We were VERY happy with our choices. I also ordered the mango lassi... mmm mmm.\n\nI'm only giving 4-stars because the service was lacking. After our food was taken away to be packaged, we must have waited 20 mins for the bill, our server apologized and offered us tea, coffee and dessert on the house - but being so late, we decided to pass. \n\nOverall, I would come back to this cute West Portal dining establishment.", "rating": 4, "date": "2008-09-14"}], "rotis bread basket": [], "rotis basmati pulao": [], "gosht biryani": [{"excerpts": ["chicken tikka masala not spicy, sauce hearty literally hearty as hell, chicken chunks are proportioned and can be cut up into 3 small pieces and each piece was juicy and not dry\n\ngosht biryani - each bite flavorul and lamb slices large in size similar to the chicken tikki masala in regards to size of meat", "**** my cup of water never hit the bottom it was always refilled, asked for recommendations from the waiter she was dead on about the gosht biryani and the cucumber raita \nambiance ", "*", "*"], "author": "Clarence A.", "review": "as another yelper sed this is the grown up Naan Curry!!!\n\nmajority of all dishes we ordered had heat, except for the naan, I'm not a fan of hot food but this place makes you want to take bite after bite after bite even though you can no longer feel your tongue and your lips start to swell haha, it is really that good.\n\nchicken tikka masala not spicy, sauce hearty literally hearty as hell, chicken chunks are proportioned and can be cut up into 3 small pieces and each piece was juicy and not dry\n\ngosht biryani - each bite flavorul and lamb slices large in size similar to the chicken tikki masala in regards to size of meat, this place gives you far amount of meat over the rice, not like most places where there is 90% rice and 10% meat the serving here is more like 60% rice and 40% meat, and it packs heat after your 4th bite you will notice a lil sweat beat forming on the top of you head\n\nshakooti lamb - peppered lamb in a brownish reddish curry take the heat meter up another notch with this plate you can see the black peppers and smell the hear lingering through your sense as you wait for the plate to drop so you can get some on your plate directly into your mouth haha\n\ngarlic & basil naan - not like naan curry's but good just the same, alot thinner but the flavor is all there, dip it in with the tikka masala sauce if not the shakooti lamb sauce for a more full flavored effect\n\nthe cucumber raita was also ordered to take the heat down to some effect, lil salty yogurt with cucumber, caraway and cumin put this on top of your naan, your shakooti lamb, or biryani to ease the heat you probably already have while eating here at Roti\n\nfood ****\nprice $$ lil pricey but food is excellent\nservice ***** my cup of water never hit the bottom it was always refilled, asked for recommendations from the waiter she was dead on about the gosht biryani and the cucumber raita \nambiance **** very modern restaurant, dark hard wood, lil dark in the inside, pictures from india on the walls\n\nparking = ( it is in the city kinda, west portal so parking can become difficult if you heading out during prime times, try to carpool if you can", "rating": 4, "date": "2009-11-30"}], "jheenga biryani": [], "mixed seafood biryani": [{"excerpts": ["Roti's Rogan Josh - classic lamb curry with garlic, ginger, peppercorns, onions and saffron\n Mixed Seafood Biryani - fresh fish, prawns and calamari cooked with basmati rice, saffron, butter and fresh herbs \n", "Goat Cheese ", "Naan - Warm fresh buttery naan topped with a goat cheese blend as an appetizer.\n"], "author": "Henry L.", "review": "Located in the slightly upscale West Portal area, this restaurant is a trendy upscale version of Indian cuisine that's been elevated by quality ingredients and tailored for American palates.  It has a great atmosphere and would be great place to take a date.\n\nTried out this restaurant on a Friday night around 730 PM and the restaurant was bustling with a full crowd.  Reservations are recommended to ensure your seat without a small wait.\n\nService was excellent and attentive throughout the night.\n\nOur party of 3 ordered:\n Murgh Makhani -boneless tandoori chicken cooked in mild spices, tomatoes, butter and cream \nRoti's Rogan Josh - classic lamb curry with garlic, ginger, peppercorns, onions and saffron\n Mixed Seafood Biryani - fresh fish, prawns and calamari cooked with basmati rice, saffron, butter and fresh herbs \nGoat Cheese Naan - Warm fresh buttery naan topped with a goat cheese blend as an appetizer.\nTandoori Roti - Soft roti bread that paired well wtih our entrees\n\nAll of the dishes were very flavorful, and while not spicy to the taste, were chock full of spices that will give you the Indian cuisine experience.  The dishes were very mild and catered to a more Americanized palate.\n\nThe owner stopped by near the end of the meal and had a nice chat about the ingredients and the ambiance.  Definitely recommended if you're craving a new dining experience and want to venture out for Indian food.", "rating": 4, "date": "2012-11-17"}, {"excerpts": ["some good dishes worth trying include: roti calamari, boti kabab, and mixed seafood biryani.  ", "while the chicken tikka masala was a bit dry, the dessert kulfi was surprisingly good.  ", "anytime i'm craving indian, this place would be one of my choices."], "author": "Paulina C.", "review": "i love the mango lassi and bread basket.  some good dishes worth trying include: roti calamari, boti kabab, and mixed seafood biryani.  while the chicken tikka masala was a bit dry, the dessert kulfi was surprisingly good.  anytime i'm craving indian, this place would be one of my choices.", "rating": 4, "date": "2007-09-17"}]}