{"single can": [], "liter": [{"excerpts": ["We order a large BBQ beef whatever and a two liter of Dr. Pepper. ", "They quote us 26.60 and an hour. ", "Whoa. ", "Pricey. ", "And lengthy - especially for a room full of sub-seven foot twenty-something men. ", "And demure little me. ", "I have misgivings. ", "I feel like chocolate lava crunch cakes from Dominos. "], "author": "Raina H.", "review": "Ugh. Round Table. I will never stray from Domino's again.\n\nMe and four of the boys - first televised Giants game of the season. First commercial - the Round Table Barbeque Beef and Bacon pizza - cheers go up. We decide to order. It's 6:41. We order a large BBQ beef whatever and a two liter of Dr. Pepper. They quote us 26.60 and an hour. Whoa. Pricey. And lengthy - especially for a room full of sub-seven foot twenty-something men. And demure little me. I have misgivings. I feel like chocolate lava crunch cakes from Dominos. After ordering, I, online, order some cheesy bread and lava cakes from Dominos.\n\nThe Dominos arrived, hot and delivered by a happy, funny guy, in about twenty, twenty five minutes. No kidding. And they came all the way from the lower Fillmore. \n\nThe Round Table came at 8:18. The delivery boy seemed unhappy with his $3.40 tip. The ninety minute plus pizza was cold. Partially cooked. A size smaller than ordered. Coming from less than a mile away. Honestly, in a city like this, you're THAT busy? \n\nAnd they sent Diet Pepsi. Diet Pepsi. Gross me out twice. I have no recourse. I, being the demure female, was ordered to call and complain. The guy who answered the phone hung up on me. I called back. This time he told me HE was the manager. Do people still do this? I guess so - even in the day and age of online complaints. \n\nSkip it. The pizza, even after I threw it in the oven and finished cooking it (I mean, really? 90 mins and it isn't even cooked? The cheese was still shredded!) it tasted like death on crust.  Just, ew. Okay? Ew.\n\nAnd for the record? I hate writing reviews. It seems like I only do it when something really shitty has happened. Now I have to write a second to prove I'm not a bitch. And the Giants lost. What a crappy night.", "rating": 1, "date": "2012-03-05"}, {"excerpts": ["The guy even restated that over the phone and we added a 2 liter of pepsi (which they charge over $3 for mind you).  ", "Somehow the bill was $28.  ", "I'm not that great at math but "], "author": "Dawn L.", "review": "I usually love Roundtable, but not this location.  Several times I've gone in off the street and things were okay, however recently my boyfriend and I ordered delivery and have decided to never order or go here again.  \n\nWhat happened?  Well not only was the pizza an hour PAST the 45 minute delivery time quoted, but the pizza was stone cold, the garlic twists were cold and kinda burnt and they over charged me.  We ordered the \"Big Vinnie\" meal that was supposed to come with a large Big Vinnie and breadsticks for $18.99 per the commercial.  The guy even restated that over the phone and we added a 2 liter of pepsi (which they charge over $3 for mind you).  Somehow the bill was $28.  I'm not that great at math but 18.99 and 3.00 do not add up to 28.00, even if you add in tax.  \n\nJust to add a cherry to the bad experience we only live 20 blocks away in the direction away from traffic.  I can (and have) walked from the Round Table to my home in 20 minutes and a pizza takes 10 minutes or so when you walk in so there was no reason a pizza driver needed to take a hour and 45 minutes to get there.", "rating": 2, "date": "2009-01-24"}], "pack": [{"excerpts": ["the thought of roundtable pizza with a side of garlic twists along with (for some odd reason) a 12 pack of miller high life bottles (only bottles, no cans) that are put in the freezer and become either ice cold or borderline slush. "], "author": "Andrew D.", "review": "always a treat to go this place. well ordering from it at least. way back when as a kid this was always the place to go for anything from birthday parties to post-basketball game meals with friends. these days i generally only go when i get my \"roundtable cravings\". they usually begin sometime in the mid afternoon and only when im at work. the thought of roundtable pizza with a side of garlic twists along with (for some odd reason) a 12 pack of miller high life bottles (only bottles, no cans) that are put in the freezer and become either ice cold or borderline slush. one of those things in my life that i cant really explain, but i do however recommend to absolutely everyone. \n\nbut everytime lately that these cravings have come about i always get my order over the phone done fast and efficiently and the delivery always comes sooner than expected. sure it costs a little bit more than the average pizza you might get at other spots but as ive learned that when i crave roundtable NOTHING else will do.", "rating": 5, "date": "2010-04-14"}], "oz cup pick up only": [], "kids size pick up only": [], "garlic bread with cheese": [], "garlic bread": [], "garden party salad": [], "party chicken caesar salad": [], "one topping personal pizza and kids cup kids meal for pick up only": [], "club sandwich": [], "rt pizza sandwich": [], "maui zaui pizza": [], "ultimeat pizza": [], "wombo combo pizza": [], "pepperoni smokehouse combo pizza": [], "chicken smokehouse combo pizza": [], "gourmet veggie pizza": [], "personal cheese pizza": [{"excerpts": ["I asked to have a large combo and a personal cheese pizza with extra cheese but only provolone and they could not do it since it was all prepackaged.  ", "I thought they made everything fresh.  ", "Guess not that fresh.  "], "author": "kenny l.", "review": "I had to stop eating to write this review.\n\nI ordered by phone and asked what the prices were and he gave them to me and included a delivery charge.  Delivery Charge??? Isn't delivery what keeps them in business and they charge for it?  \n\nI asked to have a large combo and a personal cheese pizza with extra cheese but only provolone and they could not do it since it was all prepackaged.  I thought they made everything fresh.  Guess not that fresh.  So I canceled the personal pizza and had extra cheese on the combo and the cost was about $26.  \n\nThe pizza arrived and it was horrible.  Crust was thin and had no taste.  I saw no extra cheese.  Very disappointed.  I could've madea better pie.", "rating": 1, "date": "2007-10-14"}], "small cheese pizza": [], "medium cheese pizza": [], "large cheese pizza": [], "extra large cheese pizza": [], "one topping personal pizza salad bar and soda lunch combo pickup only": [], "any gourmet sandwich chips and soda lunch combo pickup only": [], "one topping personal pizza and soda lunch combo pickup only": [], "salad bar twists and soda lunch combo pickup only": [], "fresh cream cheesecake": []}