{"garlic parmesan twists": [], "boneless wings": [{"excerpts": ["I had simple orders small pep and 6 boneless wings, what happens when i get there ", "you may ask? ", "They havn't ", "even started making the damn thing, guy behing the counter tells me i have to wait another 10-15. ", "Also the white kid behind the counter needs a new role he was freaking out the entire time, the phone rang he had to step away and grab his head yelling i can't do this anymore. ", "I will never order from or come to this location ever again."], "author": "Alex S.", "review": "I honestly have no clue how this location is still open, they are completly unorganized. I really didn't want to write a negative review but after todays trip I had do. I called 40 min before i came to the location which i was told would be ready in 20. I had simple orders small pep and 6 boneless wings, what happens when i get there you may ask? They havn't even started making the damn thing, guy behing the counter tells me i have to wait another 10-15. Also the white kid behind the counter needs a new role he was freaking out the entire time, the phone rang he had to step away and grab his head yelling i can't do this anymore. I will never order from or come to this location ever again.", "rating": 1, "date": "2018-05-16"}], "classic wings": [], "dipping sauce": [{"excerpts": ["They took an hour(qouted 45mins) but the pizza was piping hot, the garlic twists are soo good, and we got an extra dipping sauce... "], "author": "Benjamin B.", "review": "This location never delivered to my spot  before. There use t be a west portal location, and im sad its gone. I like my pizza full of toppings, crispy and thin. And RT essentially delivers just that. I used the easy online ordering system, took advantage of the online coupon and got an XL half extra cheese, half pepperoni, and a garlic twist side. They took an hour(qouted 45mins) but the pizza was piping hot, the garlic twists are soo good, and we got an extra dipping sauce... Didnt need to request parm and pepper flakes too. \n\nIll give this location a few more shots and hope the service doesnt chance.", "rating": 4, "date": "2014-01-28"}], "plain garlic bread": [], "create your own original crust pizza": [], "create your own pan pizza": [], "create your own skinny crust pizza": [], "italian garlic supreme pizza": [{"excerpts": ["Couple of months ago, I called in an order here for a large Italian Garlic Supreme pizza for the Super Bowl, and I was told that it would take the usual 20 mins or so.  ", "I showed up to pick up my order, and it turns out that they had some sort of error (computer problem ", "I was told) that resulted in the wrong pizza being made.  ", "They quickly threw together the right pizza for me, and promised me it would take no more than 7 minutes.  "], "author": "Mike L.", "review": "In general, I find the idea of yelping pizza/fast food chains somewhat pointless - being franchises, the food is supposed to be rather uniform across the board at all of their locations.  Unless we're talking about some major failure, it's all relatively the same.  At that point, you're just commenting on the workers and general service.  That said, I just wanted to write a brief note about this Round Table.\n\nCouple of months ago, I called in an order here for a large Italian Garlic Supreme pizza for the Super Bowl, and I was told that it would take the usual 20 mins or so.  I showed up to pick up my order, and it turns out that they had some sort of error (computer problem I was told) that resulted in the wrong pizza being made.  They quickly threw together the right pizza for me, and promised me it would take no more than 7 minutes.  I was a little miffed, since it meant not getting back until after the game started, but nothing I could do but sit and wait.\n\nHowever, to help make up for the problem, the girl was nice enough to give me a drink while I waited (not that big of a deal), but also threw in an order of Garlic Cheesey Breadsticks (bigger deal).  For her to volunteer it without me putting up a stink or asking was a nice and unexpected gesture, especially at a place like this.  Sure enough, about 7 minutes later, the pizza was good to go and I was on my way home.  In general, I usually don't come to places like this unless I'm in a time crunch, but I appreciate the gesture they made to make up for their mistake.", "rating": 3, "date": "2010-03-28"}], "guineveres garden delight pizza": [], "gourmet veggie pizza": [], "maui zaui pizza": [], "chicken and garlic gourmet pizza": [], "montagues all meat marvel pizza": [], "ultimeat pizza": [], "king arthurs supreme pizza": [], "wombo combo pizza": [], "pepperoni smokehouse combo pizza": [], "chicken smokehouse combo pizza": [], "hearty bacon supreme pizza": [], "west coast combo": [], "liter pepsi": [], "kids soda": [], "sixpack soda": [], "large soda": [], "kids drink": [], "liter bottled soda pick up only": [], "ham club sandwich": [], "the rt pizza sandwich": [], "rt veggie sandwich": [], "veggie pizza sandwich": [], "all meat pizza sandwich": [], "hawaiian pizza sandwich": [], "kids topping personal pizza": [], "kids  piece boneless wings": [], "onetopping personal pizza and individual garden salad lunch": [], "any sandwich with chips lunch": [], "onetopping personal pizza lunch": [], "fresh salad lunch": [], "king arthurs supreme skinny pizza": [], "montagues all meat marvel skinny pizza": [], "italian garlic supreme skinny pizza": [], "ultimeat skinny pizza": [], "wombo combo skinny pizza": [], "maui zaui skinny pizza": [], "hearty bacon supreme skinny pizza": [], "chicken and garlic gourmet skinny pizza": [], "bbq chicken skinny pizza": [], "guineveres garden delight skinny pizza": [], "gourmet veggie skinny pizza": [], "pepperoni smokehouse combo skinny pizza": [], "chicken smokehouse combo skinny pizza": [], "hawaiian skinny pizza": [], "cheese skinny pizza": []}