{"party garden salad": [], "party caesar salad": [], "party chicken caesar salad": [], "can": [{"excerpts": ["unfortunately I can not give them ZERO STAR"], "author": "Ihsan A.", "review": "Today Friday June 29 and time is 10.30 This business is closed at yelp business hours for this location is 12.30 this is their respect to their patrons they are not reliable they do not deserve any star unfortunately I can not give them ZERO STAR", "rating": 1, "date": "2018-06-29"}, {"excerpts": ["I would give it  0 star if I can"], "author": "Leighann M.", "review": "I ordered online saying it will be fufilled at 7:45,  when I called to check the status since I was confused by that everytime they put me on hold and they would send a driver before that time which was at 7pm and he still is not here. They don't offer discounts for me waiting 1hr after they said they would send a driver. Never order from them again!!!! I order 2x from them before and never issues but now. I would give it  0 star if I can", "rating": 1, "date": "2018-02-08"}, {"excerpts": ["If you are looking to order pizza then try other places that are much cheaper, have great service, and can have your order to your doorstep within a reasonable time frame."], "author": "Unique U.", "review": "This location has the worst delivery drivers ever! I have tried out weighting the cons but they really suck. Not only do you not get your food on time but when it's delivered it's freezing cold. I always tip $6+ dollars regardless of the service but for some reason the drivers feel entitled to much more although the experience is always horrible. If you are looking to order pizza then try other places that are much cheaper, have great service, and can have your order to your doorstep within a reasonable time frame.", "rating": 1, "date": "2018-03-29"}, {"excerpts": ["and they can give me a '5 dollar discount', they refused to give me my money back. ", "im honestly never ordering from this location again."], "author": "Victoria H.", "review": "I love round table, i mean who doesn't? But my experience today was horrible, I ordered an extra large pizza which cost me about 30 something, i was really exited to eat it, the guy delivers it to me, i go home; the first slice was really good, but the second one i took a bite off my raw, the crust wasn't even cooked and the dough was still mushy, i called to get a refund and they said i should of called the exact time the incident happened and they can give me a '5 dollar discount', they refused to give me my money back. im honestly never ordering from this location again.", "rating": 1, "date": "2017-11-05"}, {"excerpts": ["Ain't nothing fancy, though I'm sure they can do that. ", "If you're looking for foofoo, exotic ingredients, hipster sweat, etc. ", "Round Table probably isn't for you. ", "The place was clean, the staff was as nice as can be expected."], "author": "john W.", "review": "I miss exactly two things about the West Coast. \n\n1. In-n-Out\n2. Round Table pizza. \n\nAin't nothing fancy, though I'm sure they can do that. If you're looking for foofoo, exotic ingredients, hipster sweat, etc. Round Table probably isn't for you. If you're looking for an exceptional pepperoni pizza, walk right in.\n\nGarlic twists, get 'em.\n\nNow, location, well it's Van Ness, so it's a mixed bag, but I've eaten in worse. It's pretty good sized, and during my lunch only two homeless/unbalanced folks came in.\n\nThe place was clean, the staff was as nice as can be expected.", "rating": 4, "date": "2016-06-20"}, {"excerpts": ["I called when they opened to verify if my order was correct and to ask if they can bring paper plates and peppers and cheese to. ", "The worker who answered the phone verified my pizza and it didnt have what I ordered and paid xtra for  ", "So I asked them to please make sure they read the notes on how i want my pizza and the cashier or whoever answered the phone stated that they dont read the notes  ", "I am very upset because I spend my hard working money ", "& I expect my order to be 100% accurate. ", "I am very disappointed that they had such horrible customer service today because Round Tables pizza is one of my favorite pizza joints. ", "They dont accommodate customers satisfactions or orders. ", "They are rude & they just robbed me for 35$."], "author": "Patricia C.", "review": "Today was not my first time being a customer here. I literally work around the corner. I placed a delivery order online and I ordered a Large pizza for 35$ and there were certain ingredients i wanted, so i wrote it in the notes. I called when they opened to verify if my order was correct and to ask if they can bring paper plates and peppers and cheese to. The worker who answered the phone verified my pizza and it didnt have what I ordered and paid xtra for  So I asked them to please make sure they read the notes on how i want my pizza and the cashier or whoever answered the phone stated that they dont read the notes  I am very upset because I spend my hard working money & I expect my order to be 100% accurate. I am very disappointed that they had such horrible customer service today because Round Tables pizza is one of my favorite pizza joints. They dont accommodate customers satisfactions or orders. They are rude & they just robbed me for 35$.", "rating": 1, "date": "2018-02-14"}, {"excerpts": ["Then they said we can have a free pizza for next time. ", "Well... the next time came, we explained what happen at last time and about the free pizza. ", "They said we already used the offer up.", "Really???When???\n ", "I don't wanna waste time with them anymore."], "author": "Keiko W.", "review": "My husband ordered pizza from here.They didn't show up 2.5hours...\nWe called them few time to make sure,they said it should be there in any time. \nThe pizza finally arrived was cold. So we complained about that and didn't take the cold pizza.\nThen they said we can have a free pizza for next time. Well... the next time came, we explained what happen at last time and about the free pizza. They said we already used the offer up.Really???When???\n I don't wanna waste time with them anymore.", "rating": 1, "date": "2015-03-07"}, {"excerpts": ["1) Tried to cancel order almost immediately after placing it online: \"I can cancel the order but you won't get a refund.\"\n2) ", "Time Estimate was 1 hour...", "got it 2 hours later! ", "This place is less than 2 miles from me.\n", "3) ", "The delivery guy cannot speak English so forget about communicating with them.\n", "4) ", "And that's probably why he delivered it to the wrong address.\n", "5) Got my crust wrong.\n", "6) Cold pizza."], "author": "Mitchsweets D.", "review": "1) Tried to cancel order almost immediately after placing it online: \"I can cancel the order but you won't get a refund.\"\n2) Time Estimate was 1 hour...got it 2 hours later! This place is less than 2 miles from me.\n3) The delivery guy cannot speak English so forget about communicating with them.\n4) And that's probably why he delivered it to the wrong address.\n5) Got my crust wrong.\n6) Cold pizza.", "rating": 1, "date": "2016-06-13"}, {"excerpts": ["OK, what can I get for you?\n\n", "- Can you repeat your order please?\n\n", "What was your selection, again?\n\n- Can you say that again? \n\n", "- Can you repeat your order?\n\n", "What can I get for you?\n\n", "Can you please repeat your order? "], "author": "Raul A.", "review": "I walked in at dinner time, the place was deserted.  The man at the counter just stood there for a while, doing something behind the counter.  I waited for a while before approaching and placing an order:\n\nMe: I'll take a vegetarian personal pizza and a diet coke please\n\nHim: (continues tinkering behind the counter) A personal....A personal....\n\nMe: Yes, a personal pizza and a diet coke please\n\nHim: (mumbles) a personal.....A personal...\n\nME: Yes, and a diet coke please.\n\nHim: (practically screams at me) A PERSONAL WHAT???!!!\n\nMe: A vegetarian personal pizza and a diet coke (I had already said that, he was just not paying attention to me)\n\nHim: (Acts all put upon and continues puttering at the cash register)\n\nMe: (He doesn't give me a total. I wonder if I should just wait there until he is done)  If you are busy I'll just come back....(I walked out)\n\n\nSeriously.  If you are too busy to serve customers, close your doors.  If you didn't hear my order, say that. Use your words. I'll give you some acceptable examples:\n\n- Greetings. Give me a minute please. OK, what can I get for you?\n\n- Can you repeat your order please?\n\n- Sorry, I didn't get that. \n\n- What was your selection, again?\n\n- Can you say that again? \n\n- Can you repeat your order?\n\n- Sorry, I didn't see you there. What can I get for you?\n\n- Let me repeat this back to you....It was a personal pizza, what kind?\n\n-  I was in the middle of something, sorry I didn't mean to ignore you. I'm grumpy and cranky and underpaid and I can't figure out how to balance this cash register. I don't meant to take it out on you.  Can you please repeat your order? I didn't get that.  \n\n\nWe are all human and have bad days, but NEVER YELL AT A CUSTOMER, specially if there is no reason for it.", "rating": 1, "date": "2014-07-23"}, {"excerpts": ["Service can use some help though. ", "I come here atleast once a week and the quality and taste is consistently good."], "author": "David S.", "review": "Great pizza.  Service can use some help though. I come here atleast once a week and the quality and taste is consistently good.", "rating": 5, "date": "2016-02-21"}, {"excerpts": [", I get the entire can. ", "There is a reason I state LIGHT sauce 1) I don't like much tomato sauce and 2) ", "I'm allergic to tomato sauce. ", "When it's light tomato sauce I can muddle through the stomach burning and mild hives but, a pizza bleeding tomato sauce is just money I've thrown away because I can't eat it. ", "I'm over ordering out ", "and I'm over this place - can't seem to ever get anything right or follow directions. ", "What's the point of telling them how I want something I am paying for if they are just going to do whatever they want anyways. ", "Must be nice to make so much money that you can just throw away dedicated customers like they were trash. ", "Really wish I could post pictures of the disaster I just threw away ", "but, there are no options for posting pics. ", "I'm really surprised by the reviews and to be mary (you can be frank)"], "author": "Jamilah A.", "review": "Edit: I should have known that once I left a positive review their service / food would go to hell. The last 5 times we have not gotten what we've paid for - it's either missing toppings (normally the linguica is non-existant from the pizza) or it's a swimming pool of pizza sauce. I have ALWAYS stated LIGHT sauce yet, I get the entire can. There is a reason I state LIGHT sauce 1) I don't like much tomato sauce and 2) I'm allergic to tomato sauce. When it's light tomato sauce I can muddle through the stomach burning and mild hives but, a pizza bleeding tomato sauce is just money I've thrown away because I can't eat it. I'm over ordering out and I'm over this place - can't seem to ever get anything right or follow directions. What's the point of telling them how I want something I am paying for if they are just going to do whatever they want anyways. Must be nice to make so much money that you can just throw away dedicated customers like they were trash. Really wish I could post pictures of the disaster I just threw away but, there are no options for posting pics. ~sigh~\n\nI'm really surprised by the reviews and to be mary (you can be frank), I usually wait until after 3 - 4 visits first before writing a review - you know, just in case the first time was a \"fluke of excellence\". \n\nI tend to be a little intimidated by eateries with bright lights (I prefer ambient) but, I walked in with my roommate and Cyrus greeted us with a big happy smile and took our order. My first reaction was, \"Wow! He's in a good mood!\" which is more than I could say when I worked food service. He very happily took our order and while doing so, I was my typical observant self and noticed the place was very clean and it appeared everyone was working (despite how slow it was that night). \n\nIt was indeed, quite slow that night, there were only 2 other tables taken. The T.V. wasn't blaring loud and this is the one place I actually approve of a television - television and pizza just go together. We honestly didn't wait very long when the pizza arrived at our table and was cooked EXACTLY the way we like it - crispy pepperoni, stringy cheese...... Ohhhh, I couldn't stop eating but,  if I hadn't I would have leaked all the way home not to mention, I still had to get through my salad. Speaking of which, their salad bar was awesome! All the vegies were fresh and crisp though, I really wish they had a few more items, one being red beans.\n\nThe girl who brought our pizza to the table was incredibly nice and had a smile on her face. Good and friendly service is important to me and I base my gratuities on such - not a percentage. My gratuities are usually much higher than the percentage and I always tip at the end of my meal to ensure the entire experience was pleasant. I was really surprised that Cyrus was surprised when I tossed a few bucks in the tip jar. Don't people tip anymore for service? \n\nOverall, this was a very pleasant experience, the place was clean (though there were several stacks of pizza boxes in the back area which indicated that they were often busy), the dining booths were large (big ++) and the atmosphere was pleasant. My only regret was not sitting closer to the TV while I enjoyed my crisp salad and delicious pizza.\n\nOh! And to the corporate peoples - SERVE BUFFET! IT IS VAN NESS AFTER ALL! HELLO?!? LOTS OF FOOT TRAFFIC!\n\nUPDATE (11/29/16): These people haven't gotten any better - still completely and totally incompetent. Ordered a pizza with NO SAUCE because of tomato allergy. Ended up eating 95% of the pizza and discovered THERE WAS TOMATO SAUCE ON IT! You people trying to kill your customers?! Done and over with these people - so much for forgiveness and second chances! Geez, food has really gone DOWN HILL in San Francisco!", "rating": 1, "date": "2014-01-28"}, {"excerpts": ["If they don't, they can be fined. ", "(Resource: http://www.dca.ca.gov/)"], "author": "Stephen Y.", "review": "Wow I'm not surprised to see so many 1 and 2 star reviews for this Round Table. They DO overcharge! Albeit my overcharge was $0.10 but still I'm not surprise to read that it happened to others. I ordered the #4 lunch combo today (salad bar, 3 twists, and a drink) $8.29 posted price. My receipt says $8.39... I'm not a stickler about the $ but moreso the principle. This one star review is more for the one-trip salad bar policy... the Round Tables I've been to in the past have two options: a single trip salad bar for a reasonable price around $5-6 and an unlimited salad bar for $8-10. Granted it is SF but still THE PRINCIPLE!!!! Plus I felt like the guy, whom I assume is either the manager or owner, was watching me like a hawk making sure I only go once. Maybe it's all in my head, but I felt very discriminated... not on race, sex, age, or any of the usual stuff but just for being a patron.\n\nOh almost forgot... California has a consumers rights law that says all establishments must honor the price marked/advertised. If they don't, they can be fined. (Resource: http://www.dca.ca.gov/)", "rating": 1, "date": "2011-04-12"}, {"excerpts": ["but I just cannot hold off anymore. ", "We order a medium Wombo, 6 garlic twisties, and a 2-liter for delivery. ", "Comes within 45 minutes, but they forgot our ", "2-liter. ", "I call and she says there was a mix-up ", "(oh really? ", "tell me more, I was unaware) and a new one would be coming in 5-10 minutes (cue Maury \"and the lie detector test determined THAT was a lie\"). ", "Then we notice the ranch is also nowhere to be found for the twisties. ", "I didn't even call back, it'd be a waste of time - had to go to walgreens to get some ranch and by then pizza was cold and 2-liter still not delivered. ", "Long story short, order from a different location or pick another pizza joint. ", "Place is riddled with incompetence."], "author": "David B.", "review": "I absolutely love Round Table and I've held off on giving this location one star in the past but I just cannot hold off anymore. We order a medium Wombo, 6 garlic twisties, and a 2-liter for delivery. Comes within 45 minutes, but they forgot our 2-liter. I call and she says there was a mix-up (oh really? tell me more, I was unaware) and a new one would be coming in 5-10 minutes (cue Maury \"and the lie detector test determined THAT was a lie\"). Then we notice the ranch is also nowhere to be found for the twisties. I didn't even call back, it'd be a waste of time - had to go to walgreens to get some ranch and by then pizza was cold and 2-liter still not delivered. Long story short, order from a different location or pick another pizza joint. Place is riddled with incompetence.", "rating": 1, "date": "2014-09-30"}, {"excerpts": ["It can take hours for your pizza to arrive, by which time it'll be luke-warm and stale.\n\n"], "author": "Tyson M.", "review": "Just like everyone says: delivery is *glacial*. It can take hours for your pizza to arrive, by which time it'll be luke-warm and stale.\n\nIf you call them to ask about it, they'll always just tell you that it's \"on its way\".", "rating": 1, "date": "2012-12-30"}, {"excerpts": ["Can I give negative stars?\n\n"], "author": "Kylie H.", "review": "Can I give negative stars?\n\nI ordered a pizza at 6:15. After waiting 2 hours, I called at 8:00 and was told my order never went through. Funny, because I was charged the $26 regardless of whether it \"went through\" or not.\nI called and explained the situation and was offered a $2 discount, but I'd have to pay for my new order and wait for the other charge to be reversed. I'm sorry, but is a $2 discount supposed to appease me? I cancelled the entire thing and ordered pizza hut.\nRemarkably bad service. Very disappointing.", "rating": 1, "date": "2014-08-29"}, {"excerpts": ["I picked this order up and from what I can tell the cooked looked backed up. ", "This is a reflection of the quality in the food, I would like my money back seriously not good at all. ", "Please contact me for a refund and fix the pizza problem this place did not have the taste of a round table at all it tasted like a frozen pizza"], "author": "Familia C.", "review": "We just bought a pizza tripple pep special and extra cheese.  Although the pizza looked good it was far from it.  There was no extra cheese and very little peperoni also the dough tasted like a cardboard box pizza. I picked this order up and from what I can tell the cooked looked backed up. This is a reflection of the quality in the food, I would like my money back seriously not good at all. Please contact me for a refund and fix the pizza problem this place did not have the taste of a round table at all it tasted like a frozen pizza", "rating": 1, "date": "2015-02-09"}, {"excerpts": ["On the other hand, it's an all-you-can-eat for $8, which is a deal.  ", "The pizza is passable."], "author": "Drew T.", "review": "It's Round Table.  If you haven't had it before, this is as good a place as any to try it in SF.  They have a salad bar that kind of skeeves me out because of how \"not fresh\" the pasta and potato salads look.  But who eats that stuff anyway?  On the other hand, it's an all-you-can-eat for $8, which is a deal.  The pizza is passable.", "rating": 3, "date": "2014-07-30"}, {"excerpts": ["I pay with my credit card online because I cannot pick the pizza up. ", "Instead one of my co-worker went there to pick up the pizza. ", "The girl working there \"KIM\" (name on the receipt) told my co-worker that the pizza has not been pay yet. ", "Therefore, my co-worker pay for the pizza (pay partial with cash and the rest on his credit card). ", "Then, my co-worker told me that he pay for the pizza and that the girl did not charge my credit card because it has not been pay. ", "When I called the store to confirm, they say they have canceled my credit card and it will be in pending state for couple days. ", "Couple days later, I checked my credit card statement, the charge went through. ", "I called them again, they told me they cannot find anything and they will call me back. ", "After two days, they never called me. ", "I call them again and they say the owner of the store is not in and they will leave a note for the owner to call me. ", "Once again, I did not get any calls. ", "I call them once again and they say to call in the morning. ", "After at least 5 times of trying to reach the owner of the place, I finally got through him today on 3/17/2015. ", "Of course the attitude of the owner was @#$@#% and they cannot view the transaction online and nothing they can do about it. ", "Then they told me that they reversed the credit card charge on my co-worker and the partial cash is in-store ready for us to pick it up. ", "Service like this is piece of !", "and I told him if I can call him back in 5 minute because I need my co-worker information. ", "He told me \"Im leaving in less than 5 minutes, call me tomorrow\". ", "What kind of service is this? ", "Fix the problem before you go home. ", "Not drag the problem until the customer forget about it."], "author": "Dong H.", "review": "One of the worst pizza place. I ordered my pizza on 3/4/2015 for 3/5/2015 pickup. I pay with my credit card online because I cannot pick the pizza up. Instead one of my co-worker went there to pick up the pizza. The girl working there \"KIM\" (name on the receipt) told my co-worker that the pizza has not been pay yet. Therefore, my co-worker pay for the pizza (pay partial with cash and the rest on his credit card). Then, my co-worker told me that he pay for the pizza and that the girl did not charge my credit card because it has not been pay. When I called the store to confirm, they say they have canceled my credit card and it will be in pending state for couple days. Couple days later, I checked my credit card statement, the charge went through. I called them again, they told me they cannot find anything and they will call me back. After two days, they never called me. I call them again and they say the owner of the store is not in and they will leave a note for the owner to call me. Once again, I did not get any calls. I call them once again and they say to call in the morning. After at least 5 times of trying to reach the owner of the place, I finally got through him today on 3/17/2015. Of course the attitude of the owner was @#$@#% and they cannot view the transaction online and nothing they can do about it. Then they told me that they reversed the credit card charge on my co-worker and the partial cash is in-store ready for us to pick it up. Service like this is piece of !@#!@$.\n\nSide Note: When I finally talk with the owner of the store(3/17/2015), I was going to gather some information and I told him if I can call him back in 5 minute because I need my co-worker information. He told me \"Im leaving in less than 5 minutes, call me tomorrow\". What kind of service is this? Fix the problem before you go home. Not drag the problem until the customer forget about it.", "rating": 1, "date": "2015-03-17"}, {"excerpts": ["I cannot take this crappy treatment from people- their food is not worth it."], "author": "Jennifer D.", "review": "This place sucks. I have been coming here for years because of their amazing breadsticks. Lately, I have been ordering here from work and their delivery time is off about 20 minutes. I call and they simply hang up on me. This time, I called and the person on the phone said that the delivery person was here. Ten minutes later I still had no pizza. I called and she said the delivery person was lost. I am no longer going to order from here anymore. I cannot take this crappy treatment from people- their food is not worth it.", "rating": 2, "date": "2013-12-05"}, {"excerpts": ["I was pretty excited to order a Round Table pizza, because they can be pretty darn good. ", "Pricey for a chain, but good. "], "author": "Jenn T.", "review": "Sooo....you only get two stars because I love Round Table in general. Otherwise I'd give you one. I was pretty excited to order a Round Table pizza, because they can be pretty darn good. Pricey for a chain, but good. This was my first time ordering from a Round Table in San Francisco.  \n\n1) We ordered the thin crust pizza that was advertised at a special price. Sweet! When it was delivered to us, I opened the box, and the pizza was ICE COLD!! NO sh**. Cold cold cold. The delivery guy wasn't even using one of those cushy warmer thingys.  We had to put our freshly delivered pizza in the oven, the second it was delivered. Why not just got to Safeway and spend less than half on a frozen pizza?! \n\n2)  I was sincerely disappointed, because, as stated above, I LIKE Round Table and would actually ORDER from this place, if it was any good.  I called them to let them know what happened, and give them a chance to redeem themselves, before I write them off. The manager said he would send me a gift certificate in the mail for the next time I order. (I didn't want him to redeliver another pizza because we had already waited almost an hour and were starving) So I thought, sweet! This guy cares about his customers (a little bit) and at least I'll get to give them another chance for free. I wouldn't pay to have another pizza delivered from them. \n\n3) The gift certificate never came. \n\nExpensive cold pizza + unresponsive management = I will not ever call you again. \n\nEnd of story. \n\n(PS: Go to the one on Geary...They are AWESOME!!!)", "rating": 2, "date": "2011-04-21"}, {"excerpts": ["You can eat there or to go.  "], "author": "Cynthia B.", "review": "If you like Round Table Pizza then you like this one.  It's like the Mc Donalds of pizza.  \n\nSometimes there are annoying homeless druggies inside and the place is a little greasy but it's ok.  Tables to sit at.  You can eat there or to go.  Ok salad bar.\n\nSometimes there are a lot of kids waiting to get their pizza so that slows things down.  Parking meters don't really give you enough time.\n\nPrices could be better considering thatthis isn't gourmet pizza.  Lots of better pizza options in SF.", "rating": 3, "date": "2007-07-13"}, {"excerpts": ["Yes the service can be iffy at times, but boy you cannot beat the pepperoni pizza"], "author": "Aiqx J.", "review": "Pizza is very good here for being a chain in my opinion. Yes the service can be iffy at times, but boy you cannot beat the pepperoni pizza", "rating": 5, "date": "2012-08-07"}, {"excerpts": ["online.the website sucks big time as you can never fine specials unless you call! ", "That's not how it should be!"], "author": "Peter D.", "review": "They never seem tot have the specials advertised on tv. It's impossible to find specials online.the website sucks big time as you can never fine specials unless you call! That's not how it should be!", "rating": 1, "date": "2012-07-13"}, {"excerpts": ["He did say we can make it in 15 minutes. ", "I asked to speak to Manager. ", "He replied the Manager Carlos was not there. ", "I then asked for a credit on my card that I used to purchase the pizza and he was reluctant to do that. ", "He finally gave me a credit receipt, but still have not seen anything. ", "This cashier never apologized or offered any solution other than waiting another 15 or 20 minutes. ", "I walked out."], "author": "joe c.", "review": "Worst experience at a Round Table Pizza place. Called ahead to order pizza for pick up. I was on time for order. A Hispanic male verified my order and I paid for pizza's. He went back to get pizza and found out the order was never put in or pizza maker just forgot. First he said its \"in the oven, not done\" I asked him if that was true and he said no. We just didn't make it.  He did say we can make it in 15 minutes. I asked to speak to Manager. He replied the Manager Carlos was not there. I then asked for a credit on my card that I used to purchase the pizza and he was reluctant to do that. He finally gave me a credit receipt, but still have not seen anything. This cashier never apologized or offered any solution other than waiting another 15 or 20 minutes. I walked out.", "rating": 1, "date": "2011-09-18"}, {"excerpts": ["Avoid this place if you possibly can, it does suck."], "author": "Todd H.", "review": "Judging from the other reviews I've read, my awful experience at this Round Table was not an exception. One time I was in there and saw an exposed bulb hanging from the ceiling in one part of the store. Hmmm not a good sign. One of the employees was making fun of another employee to a customer. They screwed up my order and when I tried to complain I essentially was told to shut up. Avoid this place if you possibly can, it does suck.", "rating": 1, "date": "2012-06-19"}, {"excerpts": ["Can someone please tell me how it could possibly take over an hour and a half to make a frickin pizza and deliver it to my house 10 blocks away??  ", "It just absolutely blows me away.... ", "the pizza, once I got it, was great.  ", "This made me remember why i stopped ordering from national pizza chains... ", "Round Table, Domino's, and Pizza Hut all blow. ", "Ridiculous...."], "author": "A B.", "review": "Can someone please tell me how it could possibly take over an hour and a half to make a frickin pizza and deliver it to my house 10 blocks away??  It just absolutely blows me away.... the pizza, once I got it, was great.  This made me remember why i stopped ordering from national pizza chains... Round Table, Domino's, and Pizza Hut all blow. Ridiculous....", "rating": 2, "date": "2008-10-31"}], "pack": [], "liter": [], "personal topping pizza": [], "small topping pizza": [], "medium topping pizza": [], "large topping pizza": [], "extra large topping pizza": [], "kids pizza": [], "italian garlic supreme pizza": [], "king arthurs supreme pizza": [], "maui zaui pizza": [], "montagues allmeat marvel pizza": [], "ultimeat pizza": [], "guineveres garden delight pizza": [], "gourmet veggie pizza": [], "smokehouse combo pizza": [], "the rt pizza sandwich": [], "the rt veggie sandwich": [], "one topping personal pizza salad bar and soda lunch combo pickup only": [], "any gourmet sandwich chips and soda lunch combo pickup only": [], "one topping personal pizza and soda lunch combo pickup only": [], "salad bar twists and soda lunch combo pickup only": [], "french cream cheesecake": [], "fudge brownie": []}