{"salt lassi": [], "sweet lassi": [{"excerpts": ["My one criticism would be that the sweet lassi wasn't sweet enough, but that is easily corrected.\n\n"], "author": "John K.", "review": "I have been to almost every Indian restaurant in S.F. over the last 40 years. I think that I know good Indian food when I taste it. I tasted it at Royal Indian in its new location on Fillmore. First off everything looked fresh and clean. The walls had the same interesting artwork that was in the previous Indian restaurant there. Everything we tried was excellent. The samosas were stunning. The potato stuffing was mashed together with spices and peas, not lumps of potatoes as with some samosas.  The Tikka Chicken Kabob was perfectly done neither dry nor undercooked. The portions were very generous and the prices were very reasonable. \n\nMy one criticism would be that the sweet lassi wasn't sweet enough, but that is easily corrected.\n\nI rate this one of the best Indian restaurants I have ever been to and highly recommend it to anyone who loves to eat.", "rating": 5, "date": "2017-05-08"}, {"excerpts": ["Also got sweet lassi which was ok.\n\n"], "author": "Nishith M.", "review": "Originally planned to go to DOSA but it was closed for lunch. That is when we decided to try out this little gem.\n\nInteriors were nice and clean. We got the vegetarian thali which was basically a three course meal for two. It consisted of samosas for starter, followed by Saag paneer and Dal makhani served with butter naan and rice. I loved the kheer for desert. Would recommend. Also got sweet lassi which was ok.\n\nOverall good service and solid food at a decent price point (under $50 for 2)", "rating": 5, "date": "2017-05-07"}], "masala chai": [{"excerpts": ["Masala chai was super good too. ", "Can't wait to come back for dinner!"], "author": "Shevawn T.", "review": "We didn't have any entrees here but the Tandoori Chicken Wings were the best chicken wings I've ever tasted. Masala chai was super good too. Can't wait to come back for dinner!", "rating": 5, "date": "2018-08-22"}], "indian iced tea": [], "tandoori chicken wings": [{"excerpts": ["Tandoori Chicken Wings - $9.95\n"], "author": "Jenn H.", "review": "I miss the very affordable AYCE place it once used to be, but I LOVE this new place. All the food we ordered came out hot, seasoned to perfection, and reasonably portioned. My husband and I ordered the following:\n\nTandoori Assorted (chicken, lamb, grilled veggies) - $10.95\nTandoori Chicken Wings - $9.95\nKashmiri Chicken - $11.95\nGarlic Naan - $2.95\nTandoori Roti - $2.00\nChai - $4.00\n\nCannot go wrong with any of the above. Our favorite was the Kashmiri Chicken. It is a sweet, creamy, and rich chicken curry dish. The chicken was buttery soft. The curry could be spicier though.", "rating": 5, "date": "2017-10-27"}, {"excerpts": ["We didn't have any entrees here but the Tandoori Chicken Wings were the best chicken wings I've ever tasted. "], "author": "Shevawn T.", "review": "We didn't have any entrees here but the Tandoori Chicken Wings were the best chicken wings I've ever tasted. Masala chai was super good too. Can't wait to come back for dinner!", "rating": 5, "date": "2018-08-22"}], "tandoori assorted": [{"excerpts": ["My husband and I ordered the following:\n\nTandoori Assorted (chicken, lamb, grilled veggies) - $10.95\n", "Tandoori Chicken Wings - $9.95\n", "Kashmiri Chicken - $11.95\n", "Our favorite was the Kashmiri Chicken. ", "It is a sweet, creamy, and rich chicken curry dish. ", "The chicken was buttery soft. ", "The curry could be spicier though."], "author": "Jenn H.", "review": "I miss the very affordable AYCE place it once used to be, but I LOVE this new place. All the food we ordered came out hot, seasoned to perfection, and reasonably portioned. My husband and I ordered the following:\n\nTandoori Assorted (chicken, lamb, grilled veggies) - $10.95\nTandoori Chicken Wings - $9.95\nKashmiri Chicken - $11.95\nGarlic Naan - $2.95\nTandoori Roti - $2.00\nChai - $4.00\n\nCannot go wrong with any of the above. Our favorite was the Kashmiri Chicken. It is a sweet, creamy, and rich chicken curry dish. The chicken was buttery soft. The curry could be spicier though.", "rating": 5, "date": "2017-10-27"}], "chicken": [{"excerpts": ["- Chicken Tikka masala - too creamy ", "I would not reccomend this. \n", "- ", "Chana Saag - really tasty but chickpeas were overcooked\n- Muligitawney soup - ", "had either too much coconut milk or cream, oily, taste of Dal didn't come through\n", "- Tandoori Chicken - came out on a sizzling platter and was nicely cooked but the marinade left a lot to be desired \n- Service - excellent!"], "author": "Anjali P.", "review": "Based off what I ordered, the food here is tasty but doesn't cater to homestyle Indian taste. The curry portions were pretty small. \n\n- Chicken Tikka masala - too creamy I would not reccomend this. \n- Chana Saag - really tasty but chickpeas were overcooked\n- Muligitawney soup - had either too much coconut milk or cream, oily, taste of Dal didn't come through\n- Tandoori Chicken - came out on a sizzling platter and was nicely cooked but the marinade left a lot to be desired \n- Service - excellent!", "rating": 3, "date": "2018-10-10"}, {"excerpts": ["*Chicken Momo: ", "Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n", "*", "Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce, Extra spicy ($12.95)\n", "*Garlic Naan: ", "Naan layered with freshly minced garlic and chopped cilantro ($2.95)\n"], "author": "Elena N.", "review": "I stayed out a little too late on Friday. So when I woke up, I was starving. Decided to get delivery through Eat24 on Saturday, September 22nd. I placed my lunch order at 2:45pm. It arrived at 3:45pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour and tamarind chutney, All batters are signature chickpea (garbanzo batter) prepared by our chef ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce, Extra spicy ($12.95)\n*Garlic Naan: Naan layered with freshly minced garlic and chopped cilantro ($2.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n\nI adored the curry. It was creamy and comforting. Could have used a little more spice as I wanted it extra spicy, but it had a good amount of heat. The naan were both soft with a nice chew. Though, I do think they could have used more garlic and chili. The flavors weren't strong enough for me. The samosas were good. Crispy on the outside and soft on the inside. Though their mint chutney was very bland and watery. Didn't really stick to the samosas. I love dumplings so the momos were tasty. The dipping sauce complemented them well.\n\nIndian is my comfort food and this hit the spot. Especially since I was feeling a little delicate that day.", "rating": 4, "date": "2018-09-29"}, {"excerpts": ["My staples are the chicken tikka masala which has a nice rich flavor, perfect over their basmati rice. ", "Samosas are packed full of goodness. ", "And the garlic naan, oh my, the stuff dreams are made of!"], "author": "Ashley G.", "review": "I'll start with saying that I have only ordered takeout from this restaurant. I should probably dine in at some point but their takeout is just so dang good and easy. My staples are the chicken tikka masala which has a nice rich flavor, perfect over their basmati rice. Samosas are packed full of goodness. And the garlic naan, oh my, the stuff dreams are made of!", "rating": 5, "date": "2018-11-11"}, {"excerpts": ["We ordered roti, butter naan and butter chicken, the gravy was amazinggg!! ", "Creamy and delicious!! ", "The quantity was enough for 2 people. "], "author": "Saarthak C.", "review": "Craving for Indian food? This is an amazing restaurant: heads up: they don't have buffers !! I was surprised too since I've rarely seen an Indian restaurant without a buffet.\n\nWe ordered roti, butter naan and butter chicken, the gravy was amazinggg!! Creamy and delicious!! The quantity was enough for 2 people. The roti bread was good food, and with prompt servers, I had no complains whatsoever.\n\nGreat food,  wish the restaurant was a bit bigger in size, but I didn't have to wait so no complains :)", "rating": 5, "date": "2018-07-29"}, {"excerpts": ["My favorites are chicken tikka masala (spicy), garlic naan, lamb chops, and of course, chicken momos. \n\n", "Also very fragrant and flavorful- the chicken biryani, Shrimp tikka masala (spicy), and the seekh kabobs. \n\n"], "author": "K C.", "review": "If you crave that spice fix you can only get from authentic Indian food, this is the place! My favorites are chicken tikka masala (spicy), garlic naan, lamb chops, and of course, chicken momos. \n\nAlso very fragrant and flavorful- the chicken biryani, Shrimp tikka masala (spicy), and the seekh kabobs. \n\nEverything tastes a little bit better spicy, as hot as you can eat it, and followed by a delicious mango lassi.\n\nThe ambiance is very nice and comfortable. The service is really great.", "rating": 5, "date": "2018-07-31"}, {"excerpts": ["We ordered kadai paneer but got chicken pieces along with paneer. ", "When we asked them to check, first they mentioned it should be paneer ", "but we requested them to check with chef ", "and they confirmed it was chicken indeed and then mentioned it is \"No problem\" for them and can prepare a new one. ", "It may be no problem but its a big deal for vegetarians. ", "We left the place immediately. ", "Horrible experience"], "author": "Pray D.", "review": "VEGETARIANS AVOID THIS PLACE! We ordered kadai paneer but got chicken pieces along with paneer. When we asked them to check, first they mentioned it should be paneer but we requested them to check with chef and they confirmed it was chicken indeed and then mentioned it is \"No problem\" for them and can prepare a new one. It may be no problem but its a big deal for vegetarians. We left the place immediately. Horrible experience", "rating": 1, "date": "2018-11-04"}, {"excerpts": ["We ordered two appetizers, Chicken 65 (pieces of yogurt-marinated, seasoned crispy chicken breast,  $9.95) and Chicken Momo (steamed/pan-fried Nepalese chicken dumplings, $8.95). ", "Tandoori Mixed Grill ($18.95) entree was truly delicious with tikka and boti kebabs and tandoori chicken and salmon. ", "Suggestions would be including a small container of plain yogurt (especially if you order more heat) and to slice the salmon bigger in the Mixed Grill plate because it looked identical to the pieces of chicken. "], "author": "Jennifer O.", "review": "After the delivery guy left and I peeked into the bag, I frowned when I saw the jumble of containers and a cup of Mango Lassi nearly overturned. The mango lassi was a bit warm, too. \n\nMy grumpiness immediately dissipated when I popped open the trays and the fragrant aroma of spices and grilled meats perfumed my kitchen.\n\nAnd everything was really delicious, juicy and perfectly cooked. \n\nWe ordered two appetizers, Chicken 65 (pieces of yogurt-marinated, seasoned crispy chicken breast,  $9.95) and Chicken Momo (steamed/pan-fried Nepalese chicken dumplings, $8.95). Both were solid but didn't bowl me over.\n\nTandoori Mixed Grill ($18.95) entree was truly delicious with tikka and boti kebabs and tandoori chicken and salmon. The grilled onions pulled all the proteins and flavors together. \n\nPlain basmati rice and garlic naan ($2.95 each) rounded out the meal.\n\nThat I have to nitpick shows you everything was delicious. Suggestions would be including a small container of plain yogurt (especially if you order more heat) and to slice the salmon bigger in the Mixed Grill plate because it looked identical to the pieces of chicken. When I found it, I was too full to try it. \n\nPlenty of leftovers means there's enough for two full meals tomorrow, no skimping necessary. \n\nAnd PS...That was the best mango lassi I've ever tasted.", "rating": 4, "date": "2018-03-08"}, {"excerpts": ["The chicken was ok, but it wasn't extraordinary. ", "Same for the naan. ", "The basmati rice was a better in quality compared to other places ", "but I'm not really here for the rice."], "author": "Denise L.", "review": "3.5 Stars.\n\nService was great and there were some in-house appetizers. This is one of the most upscale Indian restaurants I've ever eaten at but I'm not surprised since it's around the Lower PacHeights area. The food was decent but I'm not sure I can justify the price for the quality of the food. The curry I had was in medium spicy and IT WAS ON FIRE. And mind you, I've done the fire noodles challenge 2x in my life (on a tangent but there are tons of videos on this challenge on Youtube). Anyway, I also love MALA dishes, so it's safe to say that I have a high tolerance for spicy food. This medium spicy curry will sure make you sweat...or swear. \n\nThe food was good but not something that wow'ed me, for some reason the wow-factor wasn't there. The chicken was ok, but it wasn't extraordinary. Same for the naan. The basmati rice was a better in quality compared to other places but I'm not really here for the rice.", "rating": 3, "date": "2017-09-26"}, {"excerpts": ["My go-to order is the chicken tikka masala and the salmon tandoori. ", "Both are amazing!"], "author": "Nicole D.", "review": "My absolute favorite food to order-in in the city. The portions are generous for the price and the flavors are exceptionally good. Food is always fresh and tasty. My go-to order is the chicken tikka masala and the salmon tandoori. Both are amazing!", "rating": 5, "date": "2018-09-08"}, {"excerpts": ["I got chicken vindaloo with garlic naan and my friends got chicken tikka masala, butter chicken masala, chicken korma. ", "They were all delicious!"], "author": "Theresa H.", "review": "We went here for dinner on a Sunday. There was no wait and got a table right away. The food was great- portions were big and flavorful! I got chicken vindaloo with garlic naan and my friends got chicken tikka masala, butter chicken masala, chicken korma. They were all delicious!", "rating": 5, "date": "2018-03-01"}, {"excerpts": ["We ordered the butter tikki chicken (spicy) and the chicken vindaloo (very spicy). "], "author": "Crystal L.", "review": "After a long day running around for my birthday,  hubby and I decided to stay at the hotel and order delivery for my birthday dinner.\n\nAfter endlessly pouring over yelp reviews for the best restaurants in the area, we settled on two choices and dug into the reviews for each. \n\nThis restaurant had far fewer reviews, but most were highly complimentary,  so we decided to take a chance. We were so glad we did!\n\nWe ordered the butter tikki chicken (spicy) and the chicken vindaloo (very spicy). We also ordered some samso.\n\nSo before I talk about the food, let me be a Debby  downer.  My issues which prevent this from being a five star review are that 1. The order took 25 minutes after the quoted delivery time, which was already an hour from the time I placed the order. 2. No silverware was provided, but thankfully we were able to get some from the hotel staff. Umm, it's a delivery...provide some cutlery!! 3. Since it took so long for the food to arrive, it was not as temperature hot as I prefer and we couldn't warm up our food,  so we had to eat it as delivered. \n\nSo the food. OMG,  it was FANTASTIC! We love love Indian food and this seriously could be the BEST Indian food we've ever eaten. The spice level was accurate and we definitely got mouthful of heat and perfect spiciness. \n\nThe garlic naan was good, and the rice was perfectly cooked. If our delivery was this good, I'm sure it would be the same in the restaurant. \n\nOverall great experience and we can't wait to eat here again!", "rating": 4, "date": "2018-01-12"}, {"excerpts": ["Next time we'll try the chicken or vegetable Momo which is a Himalayan dish. ", "FYI their chai comes already lightly sweetened with sugar."], "author": "Genie O.", "review": "Sweet intimate feel and we scored the table by a window. Very nice people and very good food. We had the vegan coconut curry vegetable and they made the dahl mahkani vegan, using coconut milk. Not outstanding but really good and we thoroughly enjoyed the feel of the place. \"Medium\" price was a bit not spicy so I would order it spicy next time. And then see what happens!\n\nNext time we'll try the chicken or vegetable Momo which is a Himalayan dish. FYI their chai comes already lightly sweetened with sugar.", "rating": 4, "date": "2017-06-07"}, {"excerpts": ["My husband and I ordered the following:\n\nTandoori Assorted (chicken, lamb, grilled veggies) - $10.95\n", "Tandoori Chicken Wings - $9.95\n", "Kashmiri Chicken - $11.95\n", "Our favorite was the Kashmiri Chicken. ", "It is a sweet, creamy, and rich chicken curry dish. ", "The chicken was buttery soft. ", "The curry could be spicier though."], "author": "Jenn H.", "review": "I miss the very affordable AYCE place it once used to be, but I LOVE this new place. All the food we ordered came out hot, seasoned to perfection, and reasonably portioned. My husband and I ordered the following:\n\nTandoori Assorted (chicken, lamb, grilled veggies) - $10.95\nTandoori Chicken Wings - $9.95\nKashmiri Chicken - $11.95\nGarlic Naan - $2.95\nTandoori Roti - $2.00\nChai - $4.00\n\nCannot go wrong with any of the above. Our favorite was the Kashmiri Chicken. It is a sweet, creamy, and rich chicken curry dish. The chicken was buttery soft. The curry could be spicier though.", "rating": 5, "date": "2017-10-27"}, {"excerpts": ["We didn't have any entrees here but the Tandoori Chicken Wings were the best chicken wings I've ever tasted. "], "author": "Shevawn T.", "review": "We didn't have any entrees here but the Tandoori Chicken Wings were the best chicken wings I've ever tasted. Masala chai was super good too. Can't wait to come back for dinner!", "rating": 5, "date": "2018-08-22"}, {"excerpts": ["I've ordered several entrees ranging from vegetarian to chicken to lamb. ", "All of them were perfectly seasoned, the meat was always very succulent. "], "author": "Michelle B.", "review": "What a gem! When you're feeling tired of hitting up all the trendy SF restaurants in Hayes, the mission, and nopa, come here for some truly excellent, well prepared Indian food. Many Indian food restaurants in America make the food overly rich, but not Royal Indian! I've ordered several entrees ranging from vegetarian to chicken to lamb. All of them were perfectly seasoned, the meat was always very succulent. I can't handle a lot of spice and they prepared the food to my tolerance level without sacrificing flavor. \n\nOn top of the fabulous food, the prices are reasonable and the ambiance is nice.", "rating": 5, "date": "2018-03-31"}, {"excerpts": ["Got the tandoori chicken, lamb vindaloo and garlic Nan. ", "Delivery experience was fine. ", "Food is pretty bland, sauces are watery and meat is dry. ", "Tandoori chicken tasted mostly like tomatoes. ", "Garlic nan is ok, but again not well seasoned."], "author": "Bill L.", "review": "Meh. Second time ordering food via delivery. Got the tandoori chicken, lamb vindaloo and garlic Nan. Delivery experience was fine. Food is pretty bland, sauces are watery and meat is dry. Tandoori chicken tasted mostly like tomatoes. Garlic nan is ok, but again not well seasoned.", "rating": 3, "date": "2018-08-24"}, {"excerpts": ["Chicken Tikka Masala, Saag Paneer, Tandoori Chicken with Boti, Side of Rice & Naan. ", "DESSERT: "], "author": "Jen W.", "review": "Apparently under new management and slightly remodeled, this place has improved slightly from the previous owners.  We had a hankering for some Indian food after work and remembered this spot out in the Fillmore.  No buffet options anymore either.  \n\nAlthough they were busy, there was an table available for us and didn't have to wait.  We decided to go with the Thali special for 2:  STARTER: Pappadum, Samosa ENTREES: Chicken Tikka Masala, Saag Paneer, Tandoori Chicken with Boti, Side of Rice & Naan. DESSERT: Kheer.  Such a steal for a little over $40.  \n\nMy favorite dish was the tandoori which was perfectly spiced and came out sizzling on a hot plate.  The naan also stood out as the texture was spot on.  The not so greats?  The saag paneer was quite plain and the tikka masala was also slightly bland.  Were they terrible?  No, but I've definitely had better.\n\nI have to say that the portions were huge though.  We definitely needed doggie bags and had dinner for the next night.  \n\nService was slow but they were efficient.  3.5 stars and a good option for Indian food in the area.", "rating": 4, "date": "2017-07-02"}, {"excerpts": ["The chicken vindaloo is so flavorful and just enough heat. ", "Tonight I had the tandoori chicken and again, very flavorful. ", "I had the tandoori chicken, rice, laccha paratha, and a glass of wine which set me back $29 for meal and $6 for tip. ", "Btw, I have enough leftovers for another meal and snack."], "author": "Juliette H.", "review": "I don't know Indian cuisine that well and I've only had a few dishes here but this is a place that I will keep coming to because it's so damn tasty and I plan on working my way through the whole menu. The chicken vindaloo is so flavorful and just enough heat. Tonight I had the tandoori chicken and again, very flavorful. I thought I hated rice but the jeera rice was like something I want with every meal now but I can't make it so I guess I'll just have to keep eating here. \n\nThe ambiance is casual and the service has always been great. Also it's pretty cheap for SF. I had the tandoori chicken, rice, laccha paratha, and a glass of wine which set me back $29 for meal and $6 for tip. Btw, I have enough leftovers for another meal and snack.", "rating": 4, "date": "2018-01-13"}, {"excerpts": ["And basically, the chicken dish was missing. "], "author": "T D.", "review": "I rarely if ever give bad reviews. So I will clarify here. There food is good but the delivery system is bad. I ordered food two nights in a row. The first day, the food was delivered on time at the room (motel) & the delivery man got his tip from us. \n\nThe second night, the delivery guy called up 5 minutes before reaching and asked me to collect the food from the street. It MAY be linked to me having paid the tip online.\n\nThen, on opening the food containers, we realized that the order was mixed up.  And basically, the chicken dish was missing. I tried calling twice but wasn't any use.\n\n\nSo, to summarize. Good food.\n\nBad delivery system. So you guys should either eat in, or find some place else to deliver. RAAVI is better and professionally managed.", "rating": 1, "date": "2018-02-21"}, {"excerpts": ["Chicken tandoori, we asked for dark meat only and our waiter confirmed the order but still we got breast pieces and thigh. ", "They are audio loading like 1.5 pounds of onion on top of this tandoori to make it look like a large dish. ", "You don't fool anyone.\n"], "author": "Nariman R.", "review": "Lamb shank was so undercooked that it was hard to chew soi we left our. The tomato sauce was clearly just added to the cooked lamb shank right before they served it. Basmati rice was also not cooked well. Chicken tandoori, we asked for dark meat only and our waiter confirmed the order but still we got breast pieces and thigh. They are audio loading like 1.5 pounds of onion on top of this tandoori to make it look like a large dish. You don't fool anyone.\nWaiter forgot to bring us Jeera rice. Then instead of bringing it, he said he will go check if we ordered it. \n\nWe last more that half of what we ordered on the table and asked for check. The waiter did not even ask why the lamb shank was untouched and most of the 3 orders of basmati rice was not eaten. \n\nTo those San Francisco folks who think this is awesome Indian food, you have not had good Indian food. Go eat at Amber at least. Or go 3 doors down and eat at Dosa.", "rating": 2, "date": "2018-04-21"}, {"excerpts": ["this was good, I'd give it 4.5 Stars \n2) Chicken Tikka Masala, spicy - the chicken was incredibly dry and tasteless and the sauce was thin and milky lacking the thickness and depth of taste I expect. ", "2 Stars\n3) chicken Vindaloo, extra spicy - incredibly watery, very disappointing. ", "1.5 Stars\n4) ", "garlic Naan, good, not amazing. ", "3.5 Stars\n5) mango lassi - excellent. ", "5 Stars\n6) basmati rice - average. ", "Like that it had peas. "], "author": "Hayley J.", "review": "I was disappointed.  It's been hard to find good Indian food in my neck of the woods and I was hoping this could be it based on all the reviews. Unfortunately we did not like 2 out of 3 of the main dishes and could not be bothered to finish them. \n\nI give it 2.5 stars but because the main dishes were so disappointing, I'm rounding down. For $55 for the meal, I  expect better. \n\nDelivery took a long time (1hr 20min), which was predicted by the ordering app, so I do not take off any stars for that. \n\nWe ordered 6 things:\n1) Saag Paneer, medium spice - this was good, I'd give it 4.5 Stars \n2) Chicken Tikka Masala, spicy - the chicken was incredibly dry and tasteless and the sauce was thin and milky lacking the thickness and depth of taste I expect. 2 Stars\n3) chicken Vindaloo, extra spicy - incredibly watery, very disappointing. 1.5 Stars\n4) garlic Naan, good, not amazing. 3.5 Stars\n5) mango lassi - excellent. 5 Stars\n6) basmati rice - average. Like that it had peas. 3.5 Stars \n\nPortion sizes of the main dishes: below expectations. I would have expected 50% more for what I paid. \nRice and naan and lassi portion sizes were about right.", "rating": 2, "date": "2018-04-07"}, {"excerpts": ["Chicken tikka masala = good. ", "Great flavor, white meat chicken, creamy and slightly sweet. "], "author": "Fannie S.", "review": "We came in expecting the previous restaurant--Indian buffet. This was great though. Apparently, it was day 2 of their grand opening. \n\nFood = great. Clean. \n\nComplimentary papadum = great. Fresh, hot and full of flavor. \n\nChicken tikka masala = good. Great flavor, white meat chicken, creamy and slightly sweet. He loved it. \n\nBasmati rice = okay. \n\nService = friendly. Attentive.\n\nPrices = moderate. \n\nWe'll be back for a return visit.", "rating": 5, "date": "2017-05-06"}, {"excerpts": ["Chicken tikka kebab smoking hot.\n", "2. ", "Delicious creamy Chicken tikka masala.\n", "3. ", "Crispy crispy Onion kulcha and garlic naan.\n", "4. "], "author": "Phani C.", "review": "First thing that attracted me is the name then the ambience while coming to the main stream of any particular restaurant is \"FOOD\" because,with out great flavour or the special essence the ambience or the name doesn't make any magic....\nAmazed by their hospitality and the food tastes beyond awesome,small place with great taste love it.\n\n1. Chicken tikka kebab smoking hot.\n2. Delicious creamy Chicken tikka masala.\n3. Crispy crispy Onion kulcha and garlic naan.\n4. Mango kulfi.\nAmazing lunch under 50$.\n\nI wish you guys all the very best.", "rating": 5, "date": "2017-04-16"}, {"excerpts": ["I ordered chicken korma, my brother ordered shrimp tikka masala. ", "The chicken korma was definitely solid, but I thought it could've been a little thicker. ", "The portion was pretty small as well - too small for 1 serving of naan. ", "The service was good. ", "If I live here I'd visit this place on a regular basis."], "author": "Karl S.", "review": "We came here with empty stomachs. We shared samosa, rice, and garlic naan. I ordered chicken korma, my brother ordered shrimp tikka masala. The samosa was great: clean and not salty but perfectly spiced. The naan was great but I thought it could've been crispier, perhaps I was just biased since my goto Indian place in NYC had really crispy (yet soft inside) naan. The chicken korma was definitely solid, but I thought it could've been a little thicker. The portion was pretty small as well - too small for 1 serving of naan. The service was good. If I live here I'd visit this place on a regular basis.", "rating": 4, "date": "2017-05-19"}, {"excerpts": ["Great chicken tikka. ", "The mild option is not spicy at all. ", "Suggest medium hot if you like it a little spicy."], "author": "Casey A.", "review": "Great chicken tikka. The mild option is not spicy at all. Suggest medium hot if you like it a little spicy.", "rating": 5, "date": "2018-09-22"}, {"excerpts": ["The butter chicken is sweet, the naan was chewy and delicious. ", "Love the chicken momo! ", "Great flavors all around."], "author": "Hannah S.", "review": "Delicious! The butter chicken is sweet, the naan was chewy and delicious. Love the chicken momo! Great flavors all around.", "rating": 5, "date": "2017-11-14"}, {"excerpts": ["The chicken tikka marsala was superb. ", "The entire staff was very attentive...this is a classy restaurant among area restaurant that are not."], "author": "David S.", "review": "I was greeted promptly. The service staff was polite and responsive. The chicken tikka marsala was superb. The entire staff was very attentive...this is a classy restaurant among area restaurant that are not.", "rating": 5, "date": "2018-06-13"}, {"excerpts": ["Entrees: chicken tikka masala, saag paneer, tandoori chicken with boti, side of rice and naan. "], "author": "Emma B.", "review": "I was really pleased with delivery from this restaurant. It came quickly and was still warm.\nWe ordered the \n\"Royal Thali Special for 2: Starter: pappadum, samosa. Entrees: chicken tikka masala, saag paneer, tandoori chicken with boti, side of rice and naan. Dessert: kheer\" for $42. \n\nWe got four meals out of it! The entrees didn't have very much protein in them, but to be fair it was supposed to be for two meals. The naan came a little tough but I bet if we had it fresh at the restaurant it would have been better. It also came with a variety of dipping sauces which were fun to try and all tasty.\n\nThis was a fun way to try out multiple dishes from a new restaurant at a great price.", "rating": 4, "date": "2017-06-19"}, {"excerpts": ["I ordered the chicken korma and butter chicken with garlic naan. ", "Chicken korma was better than the butter chicken but again, it is nowhere close to what you would get in Shalimar, which is not very far from this place. ", "I didn't try the kebabs ", "but I am pretty sure I didn't miss anything. ", "If you're looking for a restaurant which serves kebabs cooked in a proper tandoor and have a nice char on them, or tandoori naans which are crisp on the outside and soft on the inside, then this is not the place. ", "Go to shalimar instead ", ":)"], "author": "Akshat G.", "review": "Same old average, non-authentic indian food that you get pretty much all across the US. I ordered the chicken korma and butter chicken with garlic naan. Chicken korma was better than the butter chicken but again, it is nowhere close to what you would get in Shalimar, which is not very far from this place. I didn't try the kebabs but I am pretty sure I didn't miss anything. If you're looking for a restaurant which serves kebabs cooked in a proper tandoor and have a nice char on them, or tandoori naans which are crisp on the outside and soft on the inside, then this is not the place. Go to shalimar instead :)", "rating": 3, "date": "2018-04-21"}, {"excerpts": ["The chicken kebabs were my favorite!"], "author": "D R.", "review": "Great flavor, variety of options on the menu and everything we ordered was delicious!  I found it hard to find truly good tasting Indian food in this area and this will be my go to place!  I loved it!  The samosas were flavorful and not oily.  The chicken kebabs were my favorite!", "rating": 4, "date": "2018-04-27"}, {"excerpts": ["I got the chicken tikka Marsala, garlic naan, and chicken mo mo. ", "It was okay but not great. ", "Very light flavor but good texture."], "author": "Tina L.", "review": "This restaurant is a little tacky but kind of in the best way. The waiter is in a suit and there is candlelight. I got the chicken tikka Marsala, garlic naan, and chicken mo mo. It was okay but not great. Very light flavor but good texture.", "rating": 3, "date": "2017-09-23"}, {"excerpts": ["We ordered vegetable momo, butter naan, chicken tikka masala, coconut vegetable curry, and rice (you do have to order rice separately- ", "it does not come with the entrees). ", "Flavors were full and fantastic. ", "Servings were generous."], "author": "Elizabeth D.", "review": "Some of the best Indian food that I've had. We ordered vegetable momo, butter naan, chicken tikka masala, coconut vegetable curry, and rice (you do have to order rice separately- it does not come with the entrees). Flavors were full and fantastic. Servings were generous.", "rating": 5, "date": "2018-04-12"}, {"excerpts": ["However, the chicken tikka masala was bland and the shrimp vindaloo was really watery and also very bland. ", "Hopefully this was just an off night for them."], "author": "Lester W.", "review": "There were obviously a lot of fake 5-star reviews for this restaurant, but we tried it anyways.\n\nDelivery was faster than expected. The garlic naan bread was delicious. The aloo gobi had the perfect amount of spices.\n\nHowever, the chicken tikka masala was bland and the shrimp vindaloo was really watery and also very bland. Hopefully this was just an off night for them.", "rating": 3, "date": "2017-06-15"}, {"excerpts": ["I ordered chicken tikka masala (chicken was a little dry), saag paneer (yummy), garlic naan (good), and eggplant fritters (loved the sauce). ", "Overall, experience was okay but not my favorite in the neighborhood."], "author": "Robyn B.", "review": "Portions were good. I ordered chicken tikka masala (chicken was a little dry), saag paneer (yummy), garlic naan (good), and eggplant fritters (loved the sauce). Overall, experience was okay but not my favorite in the neighborhood.", "rating": 4, "date": "2018-03-24"}, {"excerpts": ["Chicken masala - 4/5 ", "- the chicken was a little tough but the curry was absolutely silky & delicious! \n\n"], "author": "Tifany M.", "review": "Just got my postmates order and overall some things were delicious and others I wouldn't order again. I think the order may have been rushed as things could've been better. Examples; no silverware, no sauce for my samosas and no rice! They probably charge extra for it but this was a huge disappointment! How do you eat curry without rice??? \n\nAnywho...\n\n1. Chicken masala - 4/5 - the chicken was a little tough but the curry was absolutely silky & delicious! \n\n2. Saag Paneer - 4.5/5 - the cheese was cut into enormous steak-like chunks, they should be bite size. Overall the dish was incredibly tasty! \n\n3. Samosa - 3/5 - incredibly average samosas. I was really disappointed that they didn't include a sauce with my order. It definitely needed it as they were a little bland and nothing spectacular. Kudos for arriving hot and crispy though. \n\n4. Garlic Naan - 1/5 - probably the worst naan I've ever had! So disappointed! The dough was super chewy/almost raw, and had a very bitter taste to it. The garlic made it even worse. The whole bread was submerged in bright yellow garlic butter (normally I'm a fan) but it was just soggy. Also the garlic was cut into large raw chunks, and there was tons of it which rendered an even more unappetizing bitter, stringent taste. And this is coming from a garlic fan! Yuck! \n\nMaybe they are better when you dine in?", "rating": 3, "date": "2017-09-15"}, {"excerpts": ["The Tikka Chicken Kabob was perfectly done neither dry nor undercooked. "], "author": "John K.", "review": "I have been to almost every Indian restaurant in S.F. over the last 40 years. I think that I know good Indian food when I taste it. I tasted it at Royal Indian in its new location on Fillmore. First off everything looked fresh and clean. The walls had the same interesting artwork that was in the previous Indian restaurant there. Everything we tried was excellent. The samosas were stunning. The potato stuffing was mashed together with spices and peas, not lumps of potatoes as with some samosas.  The Tikka Chicken Kabob was perfectly done neither dry nor undercooked. The portions were very generous and the prices were very reasonable. \n\nMy one criticism would be that the sweet lassi wasn't sweet enough, but that is easily corrected.\n\nI rate this one of the best Indian restaurants I have ever been to and highly recommend it to anyone who loves to eat.", "rating": 5, "date": "2017-05-08"}, {"excerpts": ["After taking a seat I this quaint restaurant the waiter recommended 2 dishes Chicken Marsala & Lamb something.  ", "Both were medium to heavy spice & we added rice & garlic nan.  ", "I mean, why not!  ", "My 10 yr old & ", "I loved it!  ", "Recommend u stop by soon!  ", "21% tip!"], "author": "Dave S.", "review": "Great Indian spice!  This place is exactly what I expect in delicious ethnic food.  After taking a seat I this quaint restaurant the waiter recommended 2 dishes Chicken Marsala & Lamb something.  Both were medium to heavy spice & we added rice & garlic nan.  I mean, why not!  My 10 yr old & I loved it!  Recommend u stop by soon!  21% tip!", "rating": 5, "date": "2017-06-08"}, {"excerpts": ["Chicken Tikka Kebab: ", "The portion was generous, however the chicken was dry and had no flavor. ", "The menu claimed it is marinated- "], "author": "Gene G.", "review": "Chicken Tikka Kebab: The portion was generous, however the chicken was dry and had no flavor. The menu claimed it is marinated- it clearly had not been.\n\nBaigan Bharta (eggplant curry): Too oily. Did not have peas as promised in the menu. Flavor was OK.\n\nSaag Paneer: Too oily. Good flavor though.\n\nKabuli Naan: Good flavor, however for $4 it was too small. Other than the pink, shredded coconut, you couldn't taste or see any of the other ingredients it was supposed to have.\n\nSamosas: Crispy and chewy- I think they use a little cornstarch in the dough. Filling was flavorful.\n\nVegetarian Momos: The filling was unremarkable- some kind of green paste with no defining flavor. The dough was some kind of thin, translucent rice paper or cornstarch mixture- not at all what you expect from momos. The skins dried out almost immediately. They try to mitigate this by brushing them in oil- yuck.\n\nService was polite and the decor/ambiance pleasant. Would not return for the food though.", "rating": 2, "date": "2018-02-15"}, {"excerpts": ["For entrees, I asked the waiter to recommend something with chicken and he suggested the Chicken Chilli, which I had never had before. "], "author": "Jeff K.", "review": "I noticed this new spot had multiple 5 star reviews and decided to try it out. Noticed some Yelpers were doubting all the positive feedback. This just made me more curious, and hungry! Sometimes you just need to see for yourself. \n\nStarted with a Papadum appetizer, which is like a big cracker with 3 dipping sauces. We also had the Garlic Naan which was so fresh and delicious,....I could eat it all day.\n\nFor entrees, I asked the waiter to recommend something with chicken and he suggested the Chicken Chilli, which I had never had before. It was a solid choice and I'd surely get it again.\n\nI was craving lamb so we got the Lamb Shank. It was tender and moist and I loved the flavor of the marinade, it really hit the spot!\n\nFor dessert, we had Rice pudding.\n\n***At the end of the meal, we saw another couple had ordered Tandoori. They brought it out on a sizzling platter, filling the place with an intoxicating aroma,....Oh God. Even though I was full, it smelled so good that I vowed to order it when we return, which we will! \n\nNo question, easy 5 stars.", "rating": 5, "date": "2017-04-24"}, {"excerpts": ["Also solid were the butter chicken and daal saag. ", "I'd return!"], "author": "Andrew K.", "review": "Most of the reviews are fake for sure, but I liked it, especially the missi roti (chick pea bread). Also solid were the butter chicken and daal saag. I'd return!", "rating": 4, "date": "2017-04-17"}, {"excerpts": ["We got the samosa, chicken tikka masala and butter chicken masala. ", "Everything was really good and the service was amazing. ", "They were on top of their service. ", "Their heat level was very low. ", "We got the spicy and the guy kept warning us and asking are we sure. ", "We got it and tried it we all agreed it was mild at best. ", "Great food, amazing service!"], "author": "Sarah T.", "review": "My friend wanted to go here and I must say I was dragging my feet trying to convince him otherwise. Boy am I glad I'm not such a great convincer because the food was really good. We got the samosa, chicken tikka masala and butter chicken masala. Everything was really good and the service was amazing. They were on top of their service. Their heat level was very low. We got the spicy and the guy kept warning us and asking are we sure. We got it and tried it we all agreed it was mild at best. Great food, amazing service!", "rating": 4, "date": "2017-05-13"}, {"excerpts": ["I had the Chicken Korma, basmati rice and naan bread. ", "The Korma was delicious. ", "I got it medium to mild spicy ", "and although I could have done spicier I liked the mild kick with the sweet raisins. ", "The chicken was dark meat and was moist and flavor full. ", "The rice was good although I can't think of words to describe rice. ", "I guess good is the best I can do.. ", "The naan bread was different than any naan I have ever had. ", "It was flat and sort of doughy. ", "I thought it could have used some salt and overall was kind of tasteless ", "although good when dipped in the sauce. \n", "As I sat there and waited from my order, the staff was very welcoming and offer a cup of chai that was very tasty and not overly sweet. \n", "If I am at a hotel near the Royal Indian I will definitely be back. ", "My mouth is already watering for more Chicken Korma"], "author": "Linda M.", "review": "Did take out from here last night. I had the Chicken Korma, basmati rice and naan bread. The Korma was delicious. I got it medium to mild spicy and although I could have done spicier I liked the mild kick with the sweet raisins. The chicken was dark meat and was moist and flavor full. The rice was good although I can't think of words to describe rice. I guess good is the best I can do.. The naan bread was different than any naan I have ever had. It was flat and sort of doughy. I thought it could have used some salt and overall was kind of tasteless although good when dipped in the sauce. \nAs I sat there and waited from my order, the staff was very welcoming and offer a cup of chai that was very tasty and not overly sweet. \nIf I am at a hotel near the Royal Indian I will definitely be back. My mouth is already watering for more Chicken Korma", "rating": 5, "date": "2017-06-13"}, {"excerpts": ["Chicken tikka masala\n2. ", "Chicken Momo\n", "I expected my delivery for one hour ", "but I got delivered hot by 30 minutes of my order, awesome!!!"], "author": "Asif R.", "review": "Try this it's really delicious \n1. Chicken tikka masala\n2. Chicken Momo\nI expected my delivery for one hour but I got delivered hot by 30 minutes of my order, awesome!!!", "rating": 5, "date": "2017-04-19"}, {"excerpts": ["We tried \nAchare chicken - mouth watering taste\nAloo Gobi - very fresh\nButter Chicken- very rich\nChicken vindaloo - spicy tasty\nNaans- "], "author": "Laxman A.", "review": "This should be a place to go restaurant for the locals and visitors in the area. They changed the ambiance of previous establishment with upgrade in whatnot. Very comfortable seating arrangement and very homely service, not a foppy so-called professional palace service. \n\nThe food is very flavorful with perfect texture of spices and ingredients. \n\nWe tried \nAchare chicken - mouth watering taste\nAloo Gobi - very fresh\nButter Chicken- very rich\nChicken vindaloo - spicy tasty\nNaans- hot and crispy\nCumin rice - aromic delight.\n\nI already tried 2 times. I will definitely go back next time soon as it is my place to go restaurant.", "rating": 5, "date": "2017-04-13"}, {"excerpts": ["We had butter chicken and veggie biryani, our go-to Indian dishes, and both were cooked well and tasted delicious. ", "The Naan was nice and soft but crispy on the edges like it should be. ", "The ambience was also great as it was well decorated from inside, but I wish they had a more welcoming sign outside instead of the old one."], "author": "Abdul H.", "review": "This in my new favorite Indian place! I live in the Richmond and Indian cuisine isn't very popular there, so my girlfriend and I went to try this newly renovated restaurant and we were impressed!\nWe had butter chicken and veggie biryani, our go-to Indian dishes, and both were cooked well and tasted delicious. The Naan was nice and soft but crispy on the edges like it should be. The ambience was also great as it was well decorated from inside, but I wish they had a more welcoming sign outside instead of the old one.", "rating": 5, "date": "2017-04-12"}, {"excerpts": ["The chicken was tender, the sauce was quite flavorful, and the naan was deliciously chewy. ", "The rice was also done very well, and wasn't a distraction to the meal. "], "author": "James P.", "review": "We were very pleasantly surprised with the quality of food. The chicken was tender, the sauce was quite flavorful, and the naan was deliciously chewy. The rice was also done very well, and wasn't a distraction to the meal. The service is great, I was treated very warmly and when my initial order seemed to be less than ideal, it was promptly replaced. \n\nBe warned that the \"mild\" sauce is quite spicy, so unless you have a high tolerance, I wouldn't recommend anything spicier.\n\nI am sure that the first order I had was a fluke. 5 stars all around.", "rating": 5, "date": "2017-08-19"}, {"excerpts": ["Chicken tikka masala had way too much cream and no flavor. ", "The chicken momos were ok (but Red Chili is way better). ", "The samosas were soggy. ", "Lamb biryani was fine.\n", "All of the chutneys were watered down. ", "Super disappointing."], "author": "Jennifer S.", "review": "Ordered delivery because it was new and had good ratings. Naan was horrible and flat, more like roti. Chicken tikka masala had way too much cream and no flavor. The chicken momos were ok (but Red Chili is way better). The samosas were soggy. Lamb biryani was fine.\nAll of the chutneys were watered down. Super disappointing.", "rating": 2, "date": "2017-06-16"}, {"excerpts": ["We ordered chicken momo which was juicy and delicious. ", "Garlic naan was long and big, rice was okay. ", "Chicken tikka masala was very flavorful and rich in taste. ", "Welcoming customer service. ", "Definitely recommend. ", "Tried their delivery service fast,\nPrompt and accurate."], "author": "Steve W.", "review": "Another great Indian restaurant in San Francisco. I and my girlfriend went there for Friday night dinner. We only had to wait 15 mins. We ordered chicken momo which was juicy and delicious. Garlic naan was long and big, rice was okay. Chicken tikka masala was very flavorful and rich in taste. Welcoming customer service. Definitely recommend. Tried their delivery service fast,\nPrompt and accurate.", "rating": 5, "date": "2018-02-22"}, {"excerpts": ["Chicken Tandoori, Lamb Vindaloo, vegetable salad, samosas, and rice/naan were all cooked perfectly and order accuracy was impressive! ", "We were delighted with the food taste and variety of options which satisfied our entire party's appetite! ", "If you're looking for a warm and inviting atmosphere to enjoy some Indian cuisine, this place will meet your needs!"], "author": "Abel G.", "review": "Went for a business dinner meal and everything we ordered was to our liking! Chicken Tandoori, Lamb Vindaloo, vegetable salad, samosas, and rice/naan were all cooked perfectly and order accuracy was impressive! We were delighted with the food taste and variety of options which satisfied our entire party's appetite! If you're looking for a warm and inviting atmosphere to enjoy some Indian cuisine, this place will meet your needs!", "rating": 5, "date": "2017-10-10"}, {"excerpts": ["Tandoori chicken was flavorful and fresh. "], "author": "Betty D.", "review": "Nicely decorated. Tandoori chicken was flavorful and fresh. Samosa and Chana-pretty good. Can't say the same for the basmati rice as it had a funny taste. Not a big deal as it was just a side order of white rice.", "rating": 3, "date": "2018-01-04"}, {"excerpts": ["Ordered for delivery based upon the reviews but food was just not worth the wait...\n\nTandoori chicken came covered in sauce - in other words 'wet' and covered with cooked onions, etc. ", "Great for a stewed chicken but not what I expected - and of course it was not 'spicy' as I had requested...\n\n"], "author": "Leake L.", "review": "Ordered for delivery based upon the reviews but food was just not worth the wait...\n\nTandoori chicken came covered in sauce - in other words 'wet' and covered with cooked onions, etc. Great for a stewed chicken but not what I expected - and of course it was not 'spicy' as I had requested...\n\nLamb biryani was dry, and seasoned with cloves... Let me tell you, after crunching down on a couple of those you get very timid about your next bite! The dish had the appearance of having been thrown together from just rice and some precooked lamb pieces, not prepared together.\n\nI picked up some seasoned rice that was better. A small portion of cumin and turmeric seasoned basmati - not exactly the typical saffron rice one might be used to.\n\nI tried a couple of breads - paratha and a buttered naan that were nice. But the order did not include the advertised \"2 free papadums\"...\n\nOverall I'd rather drive to Pakwan in the Tenderloin for a more authentic and satisfying meal. Not going to order from these guys again...", "rating": 2, "date": "2018-01-04"}, {"excerpts": ["And the chicken tandoori mix is good "], "author": "Kunal G.", "review": "This is tooo good taste \n\nI like momos they r to good and stuff inside momo r perfect \n\nAnd the chicken tandoori mix is good every piece is like well marinated \n\nThe chef is too good in presentation of dish and flavors are so perfect and mild \n\n\nto good \n\nThis is for chef ‍", "rating": 5, "date": "2017-04-19"}, {"excerpts": ["The baighan bharta (eggplant) dish, the chicken curry and the saag paneer were delicious and perfectly seasoned. ", "Loved the garlic naan as well. ", "One of the best Indian places that I've been too."], "author": "Reena P.", "review": "Yummy food. I do miss the buffet that was here before but I love the food at this place more. The baighan bharta (eggplant) dish, the chicken curry and the saag paneer were delicious and perfectly seasoned. Loved the garlic naan as well. One of the best Indian places that I've been too.", "rating": 5, "date": "2018-01-26"}, {"excerpts": ["My wife and i ordered the butter chicken masala and vegetarian mushroom Matar. ", "It was perfectly cooked fresh.  ", "It was not too spicy and the sauce was savory with sweet tomatoe undertones... ", "Kabuli naan was pretty good too."], "author": "Allen W.", "review": "This place is under new management.  It does not have the buffet anymore but they really beautified the establishment with new chairs and decor..  Its really nice and intimate. My wife and i ordered the butter chicken masala and vegetarian mushroom Matar. It was perfectly cooked fresh.  It was not too spicy and the sauce was savory with sweet tomatoe undertones... Kabuli naan was pretty good too.", "rating": 4, "date": "2017-08-27"}, {"excerpts": ["Coconut chicken and tikka masala were both average. ", "Saag paneer was the best of the three. ", "Little Delhi, which is now temporarily closed has much much better food."], "author": "Q Q.", "review": "I really wanted to like this place, but was disappointed in the food. Coconut chicken and tikka masala were both average. Saag paneer was the best of the three. Little Delhi, which is now temporarily closed has much much better food.", "rating": 3, "date": "2018-04-21"}, {"excerpts": ["The best Indian restaurant we'hv ever been to , great service and the food was to delicious chicken tika masala , garlic bread, chicken momo were the best we'hv \n", "Definitely be back \n", "Thank you"], "author": "Bharat C.", "review": "The best Indian restaurant we'hv ever been to , great service and the food was to delicious chicken tika masala , garlic bread, chicken momo were the best we'hv \nDefinitely be back \nThank you", "rating": 5, "date": "2017-05-02"}, {"excerpts": ["I ordered the Chicken Saag in mild spiciness and it was delicious, but it was much spicier than what I wanted to order."], "author": "Vivian C.", "review": "Good service and overall atmosphere of the restaurant. I ordered the Chicken Saag in mild spiciness and it was delicious, but it was much spicier than what I wanted to order.", "rating": 4, "date": "2017-10-14"}, {"excerpts": ["I love their chicken korma the most, it's so sweet and savory. ", "I have tried a bunch of their other dishes and each time I want to come back again. ", "I've been trying to find a good Indian restaurant for a long long time and I finally found my go to spot!!!"], "author": "Jennifer T.", "review": "I love this place. Been here multiple times for takeout and they never fail to impress! The portions are big, prices are right, and food is delicious! I love their chicken korma the most, it's so sweet and savory. I have tried a bunch of their other dishes and each time I want to come back again. I've been trying to find a good Indian restaurant for a long long time and I finally found my go to spot!!!", "rating": 5, "date": "2017-11-16"}, {"excerpts": ["The garlic naan and butter chicken masala are really good. ", "The renovation this place just completed under new management makes for a brighter experience that is a step above the previous buffet style that it replaced. ", "Highly recommended."], "author": "Brian R.", "review": "So awesome to live close to this place! The garlic naan and butter chicken masala are really good. The renovation this place just completed under new management makes for a brighter experience that is a step above the previous buffet style that it replaced. Highly recommended.", "rating": 5, "date": "2017-05-16"}, {"excerpts": ["When we got seated we placed our order (chicken tandoori and lamb biryani and samosa for appetizer). ", "Omg, their food is very good. ", "The staff are very friendly and we didn't wait that very long for our food to be served. "], "author": "Thea G.", "review": "My family and I were supposed to dine in at Curry Leaf on Columbus because it has high reviews but when we got there the wait was long and it was getting late for dinner.\n\nI searched for another Indian restaurant and came across Royal Indian Cuisine along Fillmore street with 5 stars review. I called the place and the person who answered was very friendly and told me that they have table available. \n\n When we got there, there were 2 people ahead of us. When the table for 6 became available they offered us if we don't mind to sit with the 2 people ahead of us but we decided to wait for a different table. \n\nWhen we got seated we placed our order (chicken tandoori and lamb biryani and samosa for appetizer). Omg, their food is very good. The staff are very friendly and we didn't wait that very long for our food to be served. I highly recommend this  restaurant if you're in the mood for Indian, Himalayan and Nepalese cuisine. \n\nWe will definitely come back to this place next we visit San Francisco.", "rating": 5, "date": "2017-05-29"}, {"excerpts": ["I had samosas, lamb curry, and chicken korma, and all were perfect. ", "The lamb was so tender I could smash it with a fork with no effort."], "author": "Dan L.", "review": "Possibly best Indian food I've ever had. Inexpensive for anywhere but especially for San Francisco, fast service. I had samosas, lamb curry, and chicken korma, and all were perfect. The lamb was so tender I could smash it with a fork with no effort.", "rating": 5, "date": "2017-07-12"}, {"excerpts": ["We ordered the chicken tikka masala, vegan vegetable curry, rice, garlic naan, and ", "last but not least the vegetable momos(dumplings filled w/love) all of which arrived hot! ", "Will definitely order again! ", "Momos all day everyday..."], "author": "Ray N.", "review": "First time ordering from this place and we are just simply impressed with not only the awesome food but the quick delivery as well. We ordered the chicken tikka masala, vegan vegetable curry, rice, garlic naan, and last but not least the vegetable momos(dumplings filled w/love) all of which arrived hot! Will definitely order again! Momos all day everyday...", "rating": 5, "date": "2017-07-09"}, {"excerpts": ["I ordered delivery tonight -- chicken tikka masala, aloo gobi, plain naan and rice. ", "The food was fresh and tasty. ", "I will definitely order from this place again!"], "author": "Esther L.", "review": "I ordered delivery tonight -- chicken tikka masala, aloo gobi, plain naan and rice. The food was fresh and tasty. I will definitely order from this place again!", "rating": 5, "date": "2017-06-25"}, {"excerpts": ["Their mango lassi's are delicious and the chicken tikka masala is to die for. ", "It's a perfect location on Fillmore. ", "Definitely a place I will come back to."], "author": "Leah N.", "review": "Really clean and bright atmosphere when you walk in. The staff is super nice and the food is amazing. Their mango lassi's are delicious and the chicken tikka masala is to die for. It's a perfect location on Fillmore. Definitely a place I will come back to.", "rating": 5, "date": "2017-04-30"}, {"excerpts": ["We ordered the chicken tikka masala and the tandoori chicken. ", "You do have to order rice and naan separately, but the prices are very reasonable. ", "The chicken tikka masala had a  deliciously creamy sauce. ", "The tandoori chicken arrived sizzling on a cast iron plate and stayed warm throughout the meal. ", "The ambiance feels like you are at a dinner party in someone's living room, and the service was perfectly attentive. ", "We will be back for more!"], "author": "Amy K.", "review": "When looking for a place to eat before show at the Fillmore we saw that this place had five stars. And it earned its five stars! \n\nWe ordered the chicken tikka masala and the tandoori chicken. You do have to order rice and naan separately, but the prices are very reasonable. The chicken tikka masala had a  deliciously creamy sauce. The tandoori chicken arrived sizzling on a cast iron plate and stayed warm throughout the meal. The ambiance feels like you are at a dinner party in someone's living room, and the service was perfectly attentive. We will be back for more!", "rating": 5, "date": "2017-05-30"}, {"excerpts": ["Split the Vegetarian Thali for 2 with a side of chicken biryani. ", "Of the 5 Indian places in the city I've tried it has been by far the best. ", "Ordering our meal \"spicy\" actually resulted in spicy food. "], "author": "R M.", "review": "Split the Vegetarian Thali for 2 with a side of chicken biryani. Of the 5 Indian places in the city I've tried it has been by far the best. Ordering our meal \"spicy\" actually resulted in spicy food. The daal makhani and the biryani were standout. It's not the best I've ever had, but the the best I've had in SF. Will definitely return.", "rating": 5, "date": "2017-05-29"}, {"excerpts": ["We ordered a chicken tikka masala, saag paneer over rice, and I was immensely satisfied after my meal. ", "The menu was thorough, and I plan to venture back soon to explore more of their curries. ", "Ooh, and the samosas at a nearby table caught my eye."], "author": "Jake P.", "review": "I and a group of friends visited here on a Sunday afternoon. It was well occupied but I didn't feel crowded & service was quick. We ordered a chicken tikka masala, saag paneer over rice, and I was immensely satisfied after my meal. The menu was thorough, and I plan to venture back soon to explore more of their curries. Ooh, and the samosas at a nearby table caught my eye.", "rating": 5, "date": "2017-05-29"}, {"excerpts": ["The tandoori chicken was tasty and moist. ", "The chai tea is also recommended."], "author": "Elaine S.", "review": "Excellent food and service. We ordered 8 different items and everything was fantastic. The tandoori chicken was tasty and moist. The chai tea is also recommended.", "rating": 5, "date": "2017-04-16"}, {"excerpts": ["This is just for the chicken momos! ", "4.5 ", "*s Went for a solo lunch in the city, being Nepali myself was craving some momos and figured would check this new place out! ", "Served in bamboo containers, the Momo was delicious and the sauce was authentic! ", "Was hoping for greasiness that tends to be the case with most momos in the Bay Area but was delighted that it was light and fresh. ", "Will be back :)"], "author": "Mo S.", "review": "This is just for the chicken momos! 4.5 *s Went for a solo lunch in the city, being Nepali myself was craving some momos and figured would check this new place out! Served in bamboo containers, the Momo was delicious and the sauce was authentic! Was hoping for greasiness that tends to be the case with most momos in the Bay Area but was delighted that it was light and fresh. Will be back :)", "rating": 5, "date": "2017-06-09"}, {"excerpts": ["I was there last night chicken saag , butter chicken veg & naan ", "was amazing they did add acid in food ."], "author": "Jigna P.", "review": "It's is one of the best restaurant in town I was there last night chicken saag , butter chicken veg & naan was amazing they did add acid in food .", "rating": 5, "date": "2017-07-21"}, {"excerpts": ["Butter chicken and Kadai chicken are delicious! ", "Ordered them twice ", "and they were good both times. ", "Good delivery service, once they reached early! ", "5/5"], "author": "Thejas K.", "review": "Butter chicken and Kadai chicken are delicious! Ordered them twice and they were good both times. Good delivery service, once they reached early! 5/5", "rating": 5, "date": "2017-06-13"}, {"excerpts": ["Have been coming once a week since they opened and their chicken tandoori is the best I have ever had. ", "Friendly people and overall a great find!"], "author": "Alexis B.", "review": "Absolutely love this place. Have been coming once a week since they opened and their chicken tandoori is the best I have ever had. Friendly people and overall a great find!", "rating": 5, "date": "2017-09-30"}, {"excerpts": ["Chicken tikka masala samosa garlic naan basmati rice. ", "Seriously delicious yummy food great services. ", "I wish this restaurant will Seattle  ", "so I could eat here regularly !!!!\n", "Thank you Royal Indian cuisine for delicious food we will see again"], "author": "Khem G.", "review": "Live around the corner from this spot.After new renovation Me and my friend went there last night  for dinner. Seriously delicious .we order bunch of stop. Chicken tikka masala samosa garlic naan basmati rice. Seriously delicious yummy food great services. I wish this restaurant will Seattle  so I could eat here regularly !!!!\nThank you Royal Indian cuisine for delicious food we will see again", "rating": 5, "date": "2017-04-14"}, {"excerpts": ["The chicken tikka masala is extraordinary, filled with large chunks of white meat chicken garnished with a rich spicy sauce.  ", "Kudos to the chicken curry as and lamb korma as well!  ", "Portions are generous, so we are able to have two meals from one delivery.  ", "All the staff are dependable and courteous, and delivery is prompt.  ", "Our favorite Indian restaurant!"], "author": "Laurie W.", "review": "My husband and I order from this incredibly delicious restaurant almost every week, and we could not be more pleased.  Everything we've ordered from this establishment has been flavorful, and I enjoy that we can choose the spice levels since I prefer more kick.  We've been trying all their tasty breads and have successfully discovered our favorite in the keema naan.  The chicken tikka masala is extraordinary, filled with large chunks of white meat chicken garnished with a rich spicy sauce.  Kudos to the chicken curry as and lamb korma as well!  Portions are generous, so we are able to have two meals from one delivery.  All the staff are dependable and courteous, and delivery is prompt.  Our favorite Indian restaurant!", "rating": 5, "date": "2017-07-22"}, {"excerpts": ["We ordered vegetable pankora for an app, chicken tikka massla and chicken vindaloo for entries and we couldn't be more impressed. ", "Add this to fantastic service you got one of the best Indian spots around. ", "Check it out"], "author": "Matthew T.", "review": "It takes a lot to get me to review, and this place KILLED IT! We ordered vegetable pankora for an app, chicken tikka massla and chicken vindaloo for entries and we couldn't be more impressed. Add this to fantastic service you got one of the best Indian spots around. Check it out", "rating": 5, "date": "2017-04-28"}, {"excerpts": ["I ordered the Chicken tikka masala and was content with the amount of meat. ", "The sauce was also sweet."], "author": "Robert A.", "review": "Good food. I ordered the Chicken tikka masala and was content with the amount of meat. The sauce was also sweet.", "rating": 4, "date": "2017-06-28"}, {"excerpts": ["The chicken korma was beyond, and the garlic naan was so fresh and hot ", "we wanted a second one. ", "My husband loves okra ", "so we had the masala bhindi and it made me an okra fan. "], "author": "Lisa M B.", "review": "Wow, what a find. My daughter lives on this block, and my husband and I stopped in for a mid afternoon dinner/lunch. Unbelievable. I knew it was under new management..you really need to try this place. I ordered a glass of wine and got an incredibly generous pour of a sauvignon blanc. The chicken korma was beyond, and the garlic naan was so fresh and hot we wanted a second one. My husband loves okra so we had the masala bhindi and it made me an okra fan. They start with papadam and chutnies, and the Samosa was piping hot and good also. We'll be back for sure.", "rating": 5, "date": "2017-04-28"}, {"excerpts": ["Just avoid the chicken vindaloo perhaps."], "author": "B H.", "review": "I wasn't going to leave a review since this place is new, but the food destroyed my stomach, and not in the good way that Indian food normally destroys one's stomach. The food was meh. Entirely possible I just had a bad experience and this place is in fact excellent. Just avoid the chicken vindaloo perhaps.", "rating": 3, "date": "2017-04-16"}, {"excerpts": ["I ordered the vegetable soup and the Kashmiri chicken.  ", "The soup was spicy and very tasty.  ", "Since I hadn't been here before, I decided discretion was the better part of valor and ordered the spice level on the chicken \"mild.", "\"  It was a delicious  dish but ", "even for my timid taste buds it could have been spicier.  ", "Will definitely ordered \"medium\" spicy next time and there certainly will be a next time.  ", "For me the servings were generous and I took about half the chicken dish home in a box.  ", "One caveat, service was slow.  ", "We were in no hurry and felt the dishes were prepared to order and not just dished up from a steam table.  ", "Therefore, it was worth the wait."], "author": "Claire L.", "review": "Live in the neighborhood and pass this place frequently.  With all the restaurants on Fillmore, I just never got around to trying it.  My loss.  Finally went for the first time today.  Charming decor and pleasant ambiance, very attractive table service.  My companion, a vegetarian, had quite a long selection of vegetarian dishes to choose from.  He ordered samosas and the vegetable momo, a Nepali dish very like light steamed dumplings.  He loved the spice combinations in both the samosa filling and the momo.  I ordered the vegetable soup and the Kashmiri chicken.  The soup was spicy and very tasty.  Since I hadn't been here before, I decided discretion was the better part of valor and ordered the spice level on the chicken \"mild.\"  It was a delicious  dish but even for my timid taste buds it could have been spicier.  Will definitely ordered \"medium\" spicy next time and there certainly will be a next time.  For me the servings were generous and I took about half the chicken dish home in a box.  One caveat, service was slow.  We were in no hurry and felt the dishes were prepared to order and not just dished up from a steam table.  Therefore, it was worth the wait.", "rating": 4, "date": "2018-01-14"}, {"excerpts": ["But the chicken tikka masala was pretty decent, the bhindi masala good, and the saag paneer passed my wife's saag paneer test. ", "Don't get me wrong, I am grading on a curve here..but expectations exceeded, so will order again. ", "If the quality drops, I reserve the right to reconsider my generosity."], "author": "Gibu T.", "review": "Was conflicted between giving 4 or 5 stars, and perhaps we can chalk this up to my low expectations when I ordered, I am going to be generous. Saffron Grill has gone downhill these days, it used to be my go to place. So I was really hoping for a new place to pop up, but anytime you see a crazy number of 5-star reviews by a predominantly newbie crowd, you tend to be suspicious, as I was. But the chicken tikka masala was pretty decent, the bhindi masala good, and the saag paneer passed my wife's saag paneer test. Don't get me wrong, I am grading on a curve here..but expectations exceeded, so will order again. If the quality drops, I reserve the right to reconsider my generosity.", "rating": 5, "date": "2017-06-09"}], "samosa": [{"excerpts": ["*Samosa: ", "Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour and tamarind chutney, All batters are signature chickpea (garbanzo batter) prepared by our chef ($4.95)\n"], "author": "Elena N.", "review": "I stayed out a little too late on Friday. So when I woke up, I was starving. Decided to get delivery through Eat24 on Saturday, September 22nd. I placed my lunch order at 2:45pm. It arrived at 3:45pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour and tamarind chutney, All batters are signature chickpea (garbanzo batter) prepared by our chef ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce, Extra spicy ($12.95)\n*Garlic Naan: Naan layered with freshly minced garlic and chopped cilantro ($2.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n\nI adored the curry. It was creamy and comforting. Could have used a little more spice as I wanted it extra spicy, but it had a good amount of heat. The naan were both soft with a nice chew. Though, I do think they could have used more garlic and chili. The flavors weren't strong enough for me. The samosas were good. Crispy on the outside and soft on the inside. Though their mint chutney was very bland and watery. Didn't really stick to the samosas. I love dumplings so the momos were tasty. The dipping sauce complemented them well.\n\nIndian is my comfort food and this hit the spot. Especially since I was feeling a little delicate that day.", "rating": 4, "date": "2018-09-29"}, {"excerpts": ["Pappadum, Samosa ENTREES: "], "author": "Jen W.", "review": "Apparently under new management and slightly remodeled, this place has improved slightly from the previous owners.  We had a hankering for some Indian food after work and remembered this spot out in the Fillmore.  No buffet options anymore either.  \n\nAlthough they were busy, there was an table available for us and didn't have to wait.  We decided to go with the Thali special for 2:  STARTER: Pappadum, Samosa ENTREES: Chicken Tikka Masala, Saag Paneer, Tandoori Chicken with Boti, Side of Rice & Naan. DESSERT: Kheer.  Such a steal for a little over $40.  \n\nMy favorite dish was the tandoori which was perfectly spiced and came out sizzling on a hot plate.  The naan also stood out as the texture was spot on.  The not so greats?  The saag paneer was quite plain and the tikka masala was also slightly bland.  Were they terrible?  No, but I've definitely had better.\n\nI have to say that the portions were huge though.  We definitely needed doggie bags and had dinner for the next night.  \n\nService was slow but they were efficient.  3.5 stars and a good option for Indian food in the area.", "rating": 4, "date": "2017-07-02"}, {"excerpts": ["We shared samosa, rice, and garlic naan. ", "The samosa was great: clean and not salty but perfectly spiced. ", "The naan was great ", "but I thought it could've been crispier", ", perhaps I was just biased since my goto Indian place in NYC had really crispy (yet soft inside) naan. "], "author": "Karl S.", "review": "We came here with empty stomachs. We shared samosa, rice, and garlic naan. I ordered chicken korma, my brother ordered shrimp tikka masala. The samosa was great: clean and not salty but perfectly spiced. The naan was great but I thought it could've been crispier, perhaps I was just biased since my goto Indian place in NYC had really crispy (yet soft inside) naan. The chicken korma was definitely solid, but I thought it could've been a little thicker. The portion was pretty small as well - too small for 1 serving of naan. The service was good. If I live here I'd visit this place on a regular basis.", "rating": 4, "date": "2017-05-19"}, {"excerpts": ["Starter: pappadum, samosa. "], "author": "Emma B.", "review": "I was really pleased with delivery from this restaurant. It came quickly and was still warm.\nWe ordered the \n\"Royal Thali Special for 2: Starter: pappadum, samosa. Entrees: chicken tikka masala, saag paneer, tandoori chicken with boti, side of rice and naan. Dessert: kheer\" for $42. \n\nWe got four meals out of it! The entrees didn't have very much protein in them, but to be fair it was supposed to be for two meals. The naan came a little tough but I bet if we had it fresh at the restaurant it would have been better. It also came with a variety of dipping sauces which were fun to try and all tasty.\n\nThis was a fun way to try out multiple dishes from a new restaurant at a great price.", "rating": 4, "date": "2017-06-19"}, {"excerpts": ["Samosa - 3/5 - incredibly average samosas. ", "I was really disappointed that they didn't include a sauce with my order. ", "It definitely needed it as they were a little bland and nothing spectacular. "], "author": "Tifany M.", "review": "Just got my postmates order and overall some things were delicious and others I wouldn't order again. I think the order may have been rushed as things could've been better. Examples; no silverware, no sauce for my samosas and no rice! They probably charge extra for it but this was a huge disappointment! How do you eat curry without rice??? \n\nAnywho...\n\n1. Chicken masala - 4/5 - the chicken was a little tough but the curry was absolutely silky & delicious! \n\n2. Saag Paneer - 4.5/5 - the cheese was cut into enormous steak-like chunks, they should be bite size. Overall the dish was incredibly tasty! \n\n3. Samosa - 3/5 - incredibly average samosas. I was really disappointed that they didn't include a sauce with my order. It definitely needed it as they were a little bland and nothing spectacular. Kudos for arriving hot and crispy though. \n\n4. Garlic Naan - 1/5 - probably the worst naan I've ever had! So disappointed! The dough was super chewy/almost raw, and had a very bitter taste to it. The garlic made it even worse. The whole bread was submerged in bright yellow garlic butter (normally I'm a fan) but it was just soggy. Also the garlic was cut into large raw chunks, and there was tons of it which rendered an even more unappetizing bitter, stringent taste. And this is coming from a garlic fan! Yuck! \n\nMaybe they are better when you dine in?", "rating": 3, "date": "2017-09-15"}, {"excerpts": ["We got the samosa, chicken tikka masala and butter chicken masala. ", "Everything was really good and the service was amazing. ", "They were on top of their service. ", "Their heat level was very low. ", "We got the spicy and the guy kept warning us and asking are we sure. ", "We got it and tried it we all agreed it was mild at best. ", "Great food, amazing service!"], "author": "Sarah T.", "review": "My friend wanted to go here and I must say I was dragging my feet trying to convince him otherwise. Boy am I glad I'm not such a great convincer because the food was really good. We got the samosa, chicken tikka masala and butter chicken masala. Everything was really good and the service was amazing. They were on top of their service. Their heat level was very low. We got the spicy and the guy kept warning us and asking are we sure. We got it and tried it we all agreed it was mild at best. Great food, amazing service!", "rating": 4, "date": "2017-05-13"}, {"excerpts": ["Samosa and Chana-pretty good. ", "Can't say the same for the basmati rice as it had a funny taste. ", "Not a big deal as it was just a side order of white rice."], "author": "Betty D.", "review": "Nicely decorated. Tandoori chicken was flavorful and fresh. Samosa and Chana-pretty good. Can't say the same for the basmati rice as it had a funny taste. Not a big deal as it was just a side order of white rice.", "rating": 3, "date": "2018-01-04"}, {"excerpts": ["Samosa are bomb!! ", "Curries bomb!! ", "Lamb is bomb! ", "I'm from hawaii and we only have one good Indian restaurant ", "so while we were in SF it was on my priority list to get good Indian food and ", "this place definitely hit the spot."], "author": "Mikela B.", "review": "Samosa are bomb!! Curries bomb!! Lamb is bomb! I'm from hawaii and we only have one good Indian restaurant so while we were in SF it was on my priority list to get good Indian food and this place definitely hit the spot.", "rating": 4, "date": "2017-11-06"}, {"excerpts": ["When we got seated we placed our order (chicken tandoori and lamb biryani and samosa for appetizer). ", "Omg, their food is very good. ", "The staff are very friendly and we didn't wait that very long for our food to be served. "], "author": "Thea G.", "review": "My family and I were supposed to dine in at Curry Leaf on Columbus because it has high reviews but when we got there the wait was long and it was getting late for dinner.\n\nI searched for another Indian restaurant and came across Royal Indian Cuisine along Fillmore street with 5 stars review. I called the place and the person who answered was very friendly and told me that they have table available. \n\n When we got there, there were 2 people ahead of us. When the table for 6 became available they offered us if we don't mind to sit with the 2 people ahead of us but we decided to wait for a different table. \n\nWhen we got seated we placed our order (chicken tandoori and lamb biryani and samosa for appetizer). Omg, their food is very good. The staff are very friendly and we didn't wait that very long for our food to be served. I highly recommend this  restaurant if you're in the mood for Indian, Himalayan and Nepalese cuisine. \n\nWe will definitely come back to this place next we visit San Francisco.", "rating": 5, "date": "2017-05-29"}, {"excerpts": ["Chicken tikka masala samosa garlic naan basmati rice. ", "Seriously delicious yummy food great services. ", "I wish this restaurant will Seattle  ", "so I could eat here regularly !!!!\n", "Thank you Royal Indian cuisine for delicious food we will see again"], "author": "Khem G.", "review": "Live around the corner from this spot.After new renovation Me and my friend went there last night  for dinner. Seriously delicious .we order bunch of stop. Chicken tikka masala samosa garlic naan basmati rice. Seriously delicious yummy food great services. I wish this restaurant will Seattle  so I could eat here regularly !!!!\nThank you Royal Indian cuisine for delicious food we will see again", "rating": 5, "date": "2017-04-14"}, {"excerpts": ["They start with papadam and chutnies, and the Samosa was piping hot and good also. ", "We'll be back for sure."], "author": "Lisa M B.", "review": "Wow, what a find. My daughter lives on this block, and my husband and I stopped in for a mid afternoon dinner/lunch. Unbelievable. I knew it was under new management..you really need to try this place. I ordered a glass of wine and got an incredibly generous pour of a sauvignon blanc. The chicken korma was beyond, and the garlic naan was so fresh and hot we wanted a second one. My husband loves okra so we had the masala bhindi and it made me an okra fan. They start with papadam and chutnies, and the Samosa was piping hot and good also. We'll be back for sure.", "rating": 5, "date": "2017-04-28"}, {"excerpts": ["He loved the spice combinations in both the samosa filling and the momo.  "], "author": "Claire L.", "review": "Live in the neighborhood and pass this place frequently.  With all the restaurants on Fillmore, I just never got around to trying it.  My loss.  Finally went for the first time today.  Charming decor and pleasant ambiance, very attractive table service.  My companion, a vegetarian, had quite a long selection of vegetarian dishes to choose from.  He ordered samosas and the vegetable momo, a Nepali dish very like light steamed dumplings.  He loved the spice combinations in both the samosa filling and the momo.  I ordered the vegetable soup and the Kashmiri chicken.  The soup was spicy and very tasty.  Since I hadn't been here before, I decided discretion was the better part of valor and ordered the spice level on the chicken \"mild.\"  It was a delicious  dish but even for my timid taste buds it could have been spicier.  Will definitely ordered \"medium\" spicy next time and there certainly will be a next time.  For me the servings were generous and I took about half the chicken dish home in a box.  One caveat, service was slow.  We were in no hurry and felt the dishes were prepared to order and not just dished up from a steam table.  Therefore, it was worth the wait.", "rating": 4, "date": "2018-01-14"}], "baigan pakora": [], "palak pakora": [], "chicken pakora": [], "fish pakora": [], "calamari pakora": [], "paneer pakora": [], "spicy mixed vegetables soup": [], "daal soup": [{"excerpts": ["I always find myself craving their Daal soup & the Baigan Bharta. ", "While I've never eaten in, the inside of the restaurant looks nice and cozy, with white linen covered tables. ", "Good dinner option for a night out on Filmore St at a more affordable price point than DOSA down the block. ", "I appreciate the fact that they have a good variety of vegan/vegetarian options, also ", "when they mean spicy, they mean SPICY (Thank you) :D"], "author": "Daniella O.", "review": "One of my favorite Indian food places to order delivery from.\nI always find myself craving their Daal soup & the Baigan Bharta. While I've never eaten in, the inside of the restaurant looks nice and cozy, with white linen covered tables. Good dinner option for a night out on Filmore St at a more affordable price point than DOSA down the block. I appreciate the fact that they have a good variety of vegan/vegetarian options, also when they mean spicy, they mean SPICY (Thank you) :D", "rating": 5, "date": "2017-10-01"}], "chicken mulligatwany soup": [], "cucumber tomato salad": [{"excerpts": ["From there, I started my true order with the $4.95 Cucumber Tomato Salad, a simple and small plate of freshness with tomato slices covered fort-like by cucumber slices lightly seasoned with chat masala and accompanied by a vinegary dipping sauce (photo: http://bit.ly/2kl1Y1N). "], "author": "Ed U.", "review": "I was in a particularly zen mood when I entered this familiar Indian restaurant because I just came out of a low and slow afternoon at the Kabuki Springs & Spa down the block. After all, it was men-only Monday, so I was au naturale in the hot bath but fortunately not at this restaurant. No, I was fully clothed and feeling quite serene in here, even though I recall taking advantage of their busy all-you-can-eat buffet more than a decade back, probably stuffing my gullet with chewy naan and saucy korma. Those gluttonous days are gone (fingers crossed), and I decided to keep it light, at least as light as my head was feeling. A complimentary flat of papadum arrived on my table with three flavorful dipping sauces (photo: http://bit.ly/2iL45vC).\n\nJust wished there was more papadum. From there, I started my true order with the $4.95 Cucumber Tomato Salad, a simple and small plate of freshness with tomato slices covered fort-like by cucumber slices lightly seasoned with chat masala and accompanied by a vinegary dipping sauce (photo: http://bit.ly/2kl1Y1N). For my entree, I ordered an old veggie favorite, the $10.95 Baigan Bharta, clay oven-roasted eggplant cooked into a stew-like consistency with green peas & spices in an onion & tomato gravy (photo: http://bit.ly/2BwU6O9). Quite hearty and tasty with plenty of umami flavor and complemented nicely by the $2.95 dish of Basmati Rice (photo: http://bit.ly/2AoBGSr). So I did manage to keep things light and maintain my sense of calm. Ummmmmmm.\n\nFOOD - 4 stars...a surprisingly refreshing Indian vegan meal\nAMBIANCE - 3.5 stars...the space looks more open than it did before\nSERVICE - 4 stars...efficient & polite\nTOTAL - 4 stars...a fine post-bath meal if Dosa is packed", "rating": 4, "date": "2017-12-02"}], "mixed green salad": [], "chicken momo": [{"excerpts": ["*Chicken Momo: ", "Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n", "*", "Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce, Extra spicy ($12.95)\n", "*Garlic Naan: ", "Naan layered with freshly minced garlic and chopped cilantro ($2.95)\n"], "author": "Elena N.", "review": "I stayed out a little too late on Friday. So when I woke up, I was starving. Decided to get delivery through Eat24 on Saturday, September 22nd. I placed my lunch order at 2:45pm. It arrived at 3:45pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour and tamarind chutney, All batters are signature chickpea (garbanzo batter) prepared by our chef ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce, Extra spicy ($12.95)\n*Garlic Naan: Naan layered with freshly minced garlic and chopped cilantro ($2.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n\nI adored the curry. It was creamy and comforting. Could have used a little more spice as I wanted it extra spicy, but it had a good amount of heat. The naan were both soft with a nice chew. Though, I do think they could have used more garlic and chili. The flavors weren't strong enough for me. The samosas were good. Crispy on the outside and soft on the inside. Though their mint chutney was very bland and watery. Didn't really stick to the samosas. I love dumplings so the momos were tasty. The dipping sauce complemented them well.\n\nIndian is my comfort food and this hit the spot. Especially since I was feeling a little delicate that day.", "rating": 4, "date": "2018-09-29"}, {"excerpts": ["We ordered two appetizers, Chicken 65 (pieces of yogurt-marinated, seasoned crispy chicken breast,  $9.95) and Chicken Momo (steamed/pan-fried Nepalese chicken dumplings, $8.95). ", "Tandoori Mixed Grill ($18.95) entree was truly delicious with tikka and boti kebabs and tandoori chicken and salmon. ", "Suggestions would be including a small container of plain yogurt (especially if you order more heat) and to slice the salmon bigger in the Mixed Grill plate because it looked identical to the pieces of chicken. "], "author": "Jennifer O.", "review": "After the delivery guy left and I peeked into the bag, I frowned when I saw the jumble of containers and a cup of Mango Lassi nearly overturned. The mango lassi was a bit warm, too. \n\nMy grumpiness immediately dissipated when I popped open the trays and the fragrant aroma of spices and grilled meats perfumed my kitchen.\n\nAnd everything was really delicious, juicy and perfectly cooked. \n\nWe ordered two appetizers, Chicken 65 (pieces of yogurt-marinated, seasoned crispy chicken breast,  $9.95) and Chicken Momo (steamed/pan-fried Nepalese chicken dumplings, $8.95). Both were solid but didn't bowl me over.\n\nTandoori Mixed Grill ($18.95) entree was truly delicious with tikka and boti kebabs and tandoori chicken and salmon. The grilled onions pulled all the proteins and flavors together. \n\nPlain basmati rice and garlic naan ($2.95 each) rounded out the meal.\n\nThat I have to nitpick shows you everything was delicious. Suggestions would be including a small container of plain yogurt (especially if you order more heat) and to slice the salmon bigger in the Mixed Grill plate because it looked identical to the pieces of chicken. When I found it, I was too full to try it. \n\nPlenty of leftovers means there's enough for two full meals tomorrow, no skimping necessary. \n\nAnd PS...That was the best mango lassi I've ever tasted.", "rating": 4, "date": "2018-03-08"}, {"excerpts": ["Love the chicken momo! ", "Great flavors all around."], "author": "Hannah S.", "review": "Delicious! The butter chicken is sweet, the naan was chewy and delicious. Love the chicken momo! Great flavors all around.", "rating": 5, "date": "2017-11-14"}, {"excerpts": ["Chicken Momo\n", "I expected my delivery for one hour ", "but I got delivered hot by 30 minutes of my order, awesome!!!"], "author": "Asif R.", "review": "Try this it's really delicious \n1. Chicken tikka masala\n2. Chicken Momo\nI expected my delivery for one hour but I got delivered hot by 30 minutes of my order, awesome!!!", "rating": 5, "date": "2017-04-19"}, {"excerpts": ["We ordered chicken momo which was juicy and delicious. ", "Garlic naan was long and big, rice was okay. ", "Chicken tikka masala was very flavorful and rich in taste. ", "Welcoming customer service. ", "Definitely recommend. ", "Tried their delivery service fast,\nPrompt and accurate."], "author": "Steve W.", "review": "Another great Indian restaurant in San Francisco. I and my girlfriend went there for Friday night dinner. We only had to wait 15 mins. We ordered chicken momo which was juicy and delicious. Garlic naan was long and big, rice was okay. Chicken tikka masala was very flavorful and rich in taste. Welcoming customer service. Definitely recommend. Tried their delivery service fast,\nPrompt and accurate.", "rating": 5, "date": "2018-02-22"}, {"excerpts": ["The best Indian restaurant we'hv ever been to , great service and the food was to delicious chicken tika masala , garlic bread, chicken momo were the best we'hv \n", "Definitely be back \n", "Thank you"], "author": "Bharat C.", "review": "The best Indian restaurant we'hv ever been to , great service and the food was to delicious chicken tika masala , garlic bread, chicken momo were the best we'hv \nDefinitely be back \nThank you", "rating": 5, "date": "2017-05-02"}], "vegetable momo": [{"excerpts": ["Next time we'll try the chicken or vegetable Momo which is a Himalayan dish. ", "FYI their chai comes already lightly sweetened with sugar."], "author": "Genie O.", "review": "Sweet intimate feel and we scored the table by a window. Very nice people and very good food. We had the vegan coconut curry vegetable and they made the dahl mahkani vegan, using coconut milk. Not outstanding but really good and we thoroughly enjoyed the feel of the place. \"Medium\" price was a bit not spicy so I would order it spicy next time. And then see what happens!\n\nNext time we'll try the chicken or vegetable Momo which is a Himalayan dish. FYI their chai comes already lightly sweetened with sugar.", "rating": 4, "date": "2017-06-07"}, {"excerpts": ["We ordered vegetable momo, butter naan, chicken tikka masala, coconut vegetable curry, and rice (you do have to order rice separately- ", "it does not come with the entrees). ", "Flavors were full and fantastic. ", "Servings were generous."], "author": "Elizabeth D.", "review": "Some of the best Indian food that I've had. We ordered vegetable momo, butter naan, chicken tikka masala, coconut vegetable curry, and rice (you do have to order rice separately- it does not come with the entrees). Flavors were full and fantastic. Servings were generous.", "rating": 5, "date": "2018-04-12"}, {"excerpts": ["For starters, we ordered the samosas and vegetable momo. ", "The samosas were incredibly flavorful and cooked to perfection. ", "The momos had a nice mix of flavors and spicy sauce on the side. "], "author": "Mary S.", "review": "This restaurant certainly earned its 5 star rating! We came in around 6pm on a Thursday and we're seated immediately. For starters, we ordered the samosas and vegetable momo. The samosas were incredibly flavorful and cooked to perfection. The momos had a nice mix of flavors and spicy sauce on the side. We also ordered vegetable tikka masala, which was creamy and full of vegetables. To finish the meal we got an order of garlic naan, which was fresh, warm and covered in delicious garlic. Will definitely return to try more of what the menu has to offer!", "rating": 5, "date": "2017-06-09"}, {"excerpts": ["He ordered samosas and the vegetable momo, a Nepali dish very like light steamed dumplings.  "], "author": "Claire L.", "review": "Live in the neighborhood and pass this place frequently.  With all the restaurants on Fillmore, I just never got around to trying it.  My loss.  Finally went for the first time today.  Charming decor and pleasant ambiance, very attractive table service.  My companion, a vegetarian, had quite a long selection of vegetarian dishes to choose from.  He ordered samosas and the vegetable momo, a Nepali dish very like light steamed dumplings.  He loved the spice combinations in both the samosa filling and the momo.  I ordered the vegetable soup and the Kashmiri chicken.  The soup was spicy and very tasty.  Since I hadn't been here before, I decided discretion was the better part of valor and ordered the spice level on the chicken \"mild.\"  It was a delicious  dish but even for my timid taste buds it could have been spicier.  Will definitely ordered \"medium\" spicy next time and there certainly will be a next time.  For me the servings were generous and I took about half the chicken dish home in a box.  One caveat, service was slow.  We were in no hurry and felt the dishes were prepared to order and not just dished up from a steam table.  Therefore, it was worth the wait.", "rating": 4, "date": "2018-01-14"}], "mixed vegetable": [], "navaratna korma": [], "baigan bharta": [{"excerpts": ["For my entree, I ordered an old veggie favorite, the $10.95 Baigan Bharta, clay oven-roasted eggplant cooked into a stew-like consistency with green peas & spices in an onion & tomato gravy (photo: http://bit.ly/2BwU6O9). ", "Quite hearty and tasty with plenty of umami flavor and complemented nicely by the $2.95 dish of Basmati Rice (photo: http://bit.ly/2AoBGSr). ", "So I did manage to keep things light and maintain my sense of calm. "], "author": "Ed U.", "review": "I was in a particularly zen mood when I entered this familiar Indian restaurant because I just came out of a low and slow afternoon at the Kabuki Springs & Spa down the block. After all, it was men-only Monday, so I was au naturale in the hot bath but fortunately not at this restaurant. No, I was fully clothed and feeling quite serene in here, even though I recall taking advantage of their busy all-you-can-eat buffet more than a decade back, probably stuffing my gullet with chewy naan and saucy korma. Those gluttonous days are gone (fingers crossed), and I decided to keep it light, at least as light as my head was feeling. A complimentary flat of papadum arrived on my table with three flavorful dipping sauces (photo: http://bit.ly/2iL45vC).\n\nJust wished there was more papadum. From there, I started my true order with the $4.95 Cucumber Tomato Salad, a simple and small plate of freshness with tomato slices covered fort-like by cucumber slices lightly seasoned with chat masala and accompanied by a vinegary dipping sauce (photo: http://bit.ly/2kl1Y1N). For my entree, I ordered an old veggie favorite, the $10.95 Baigan Bharta, clay oven-roasted eggplant cooked into a stew-like consistency with green peas & spices in an onion & tomato gravy (photo: http://bit.ly/2BwU6O9). Quite hearty and tasty with plenty of umami flavor and complemented nicely by the $2.95 dish of Basmati Rice (photo: http://bit.ly/2AoBGSr). So I did manage to keep things light and maintain my sense of calm. Ummmmmmm.\n\nFOOD - 4 stars...a surprisingly refreshing Indian vegan meal\nAMBIANCE - 3.5 stars...the space looks more open than it did before\nSERVICE - 4 stars...efficient & polite\nTOTAL - 4 stars...a fine post-bath meal if Dosa is packed", "rating": 4, "date": "2017-12-02"}, {"excerpts": ["I always find myself craving their Daal soup & the Baigan Bharta. ", "While I've never eaten in, the inside of the restaurant looks nice and cozy, with white linen covered tables. ", "Good dinner option for a night out on Filmore St at a more affordable price point than DOSA down the block. ", "I appreciate the fact that they have a good variety of vegan/vegetarian options, also ", "when they mean spicy, they mean SPICY (Thank you) :D"], "author": "Daniella O.", "review": "One of my favorite Indian food places to order delivery from.\nI always find myself craving their Daal soup & the Baigan Bharta. While I've never eaten in, the inside of the restaurant looks nice and cozy, with white linen covered tables. Good dinner option for a night out on Filmore St at a more affordable price point than DOSA down the block. I appreciate the fact that they have a good variety of vegan/vegetarian options, also when they mean spicy, they mean SPICY (Thank you) :D", "rating": 5, "date": "2017-10-01"}, {"excerpts": ["Baigan Bharta (eggplant curry): ", "Too oily. ", "Did not have peas as promised in the menu. "], "author": "Gene G.", "review": "Chicken Tikka Kebab: The portion was generous, however the chicken was dry and had no flavor. The menu claimed it is marinated- it clearly had not been.\n\nBaigan Bharta (eggplant curry): Too oily. Did not have peas as promised in the menu. Flavor was OK.\n\nSaag Paneer: Too oily. Good flavor though.\n\nKabuli Naan: Good flavor, however for $4 it was too small. Other than the pink, shredded coconut, you couldn't taste or see any of the other ingredients it was supposed to have.\n\nSamosas: Crispy and chewy- I think they use a little cornstarch in the dough. Filling was flavorful.\n\nVegetarian Momos: The filling was unremarkable- some kind of green paste with no defining flavor. The dough was some kind of thin, translucent rice paper or cornstarch mixture- not at all what you expect from momos. The skins dried out almost immediately. They try to mitigate this by brushing them in oil- yuck.\n\nService was polite and the decor/ambiance pleasant. Would not return for the food though.", "rating": 2, "date": "2018-02-15"}], "jeera aloo": [], "saag aloo": [], "aloo matar": [], "daal makhani": [{"excerpts": ["The daal makhani and the biryani were standout. ", "It's not the best I've ever had, but the the best I've had in SF. ", "Will definitely return."], "author": "R M.", "review": "Split the Vegetarian Thali for 2 with a side of chicken biryani. Of the 5 Indian places in the city I've tried it has been by far the best. Ordering our meal \"spicy\" actually resulted in spicy food. The daal makhani and the biryani were standout. It's not the best I've ever had, but the the best I've had in SF. Will definitely return.", "rating": 5, "date": "2017-05-29"}], "coconut vegetables curry": [], "bhindi masala": [{"excerpts": ["But the chicken tikka masala was pretty decent, the bhindi masala good, and the saag paneer passed my wife's saag paneer test. ", "Don't get me wrong, I am grading on a curve here..but expectations exceeded, so will order again. ", "If the quality drops, I reserve the right to reconsider my generosity."], "author": "Gibu T.", "review": "Was conflicted between giving 4 or 5 stars, and perhaps we can chalk this up to my low expectations when I ordered, I am going to be generous. Saffron Grill has gone downhill these days, it used to be my go to place. So I was really hoping for a new place to pop up, but anytime you see a crazy number of 5-star reviews by a predominantly newbie crowd, you tend to be suspicious, as I was. But the chicken tikka masala was pretty decent, the bhindi masala good, and the saag paneer passed my wife's saag paneer test. Don't get me wrong, I am grading on a curve here..but expectations exceeded, so will order again. If the quality drops, I reserve the right to reconsider my generosity.", "rating": 5, "date": "2017-06-09"}], "chana palak": [], "paneer korma": [], "mushroom matar": [{"excerpts": ["My wife and i ordered the butter chicken masala and vegetarian mushroom Matar. ", "It was perfectly cooked fresh.  ", "It was not too spicy and the sauce was savory with sweet tomatoe undertones... ", "Kabuli naan was pretty good too."], "author": "Allen W.", "review": "This place is under new management.  It does not have the buffet anymore but they really beautified the establishment with new chairs and decor..  Its really nice and intimate. My wife and i ordered the butter chicken masala and vegetarian mushroom Matar. It was perfectly cooked fresh.  It was not too spicy and the sauce was savory with sweet tomatoe undertones... Kabuli naan was pretty good too.", "rating": 4, "date": "2017-08-27"}], "aloo baingan": [], "dal tadka": [], "paneer tika masala": [], "malai kofta": [{"excerpts": ["I've gotten their saag paneer, paneer tikka masala, vegetable korma, and malai kofta. ", "Everything has been excellent. ", "Great spot for vegetarians!"], "author": "Shelby B.", "review": "I eat here probably more than I should. This isn't a place for really spicy Indian dishes, it's more for creamy, indulgent flavors. I love it. If I'm extra hungry at first I'll get the veggie momo's which are excellent. I've gotten their saag paneer, paneer tikka masala, vegetable korma, and malai kofta. Everything has been excellent. Great spot for vegetarians!", "rating": 5, "date": "2018-11-02"}, {"excerpts": ["We ordered the baigan bhartha, shahi paneer, and malai kofta. ", "Everything was very well seasoned, and just as spicy as we asked for. ", "I especially recommend the malai kofta. ", "They all had a little too much cream, but that's to be expected from restaurant food. ", "The downside is naan or rice are not included with the entrees, so you have to order them separately. "], "author": "Apoorva A.", "review": "Delicious food! We ordered the baigan bhartha, shahi paneer, and malai kofta. Everything was very well seasoned, and just as spicy as we asked for. I especially recommend the malai kofta. They all had a little too much cream, but that's to be expected from restaurant food. The downside is naan or rice are not included with the entrees, so you have to order them separately. I ordered a serrano chili naan, which I really loved and recommend.\n\nWe came during lunch time on a Sunday, and it was pretty busy. Turns out, this place is owned by the same people who run Om Indian Cuisine in Haight-Ashbury, and they just opened another restaurant as well. The ambience is alright, a little dark (I think Om does a better job here). Service was also a little slow. They brought out our three different appetizers one at a time, perhaps in order to buy time for the entrees, which came a good 25 minutes after the order was placed. However, it was well worth the wait, and, overall, made for a great meal.", "rating": 5, "date": "2017-10-23"}, {"excerpts": ["Excellent malai kofta, great bread, and friendly service. ", "I was dining alone, that night, and the staff didn't give me any attitude, or try to sit me at the worst table. ", "I can't wait to go back to try other dishes!"], "author": "Thomas D.", "review": "Excellent malai kofta, great bread, and friendly service. I was dining alone, that night, and the staff didn't give me any attitude, or try to sit me at the worst table. I can't wait to go back to try other dishes!", "rating": 5, "date": "2017-11-04"}, {"excerpts": ["The malai kofta and kabuli naan are particularly delicious, as is the kebab."], "author": "Lane E.", "review": "Had a lot of Indian food. This is the best. The malai kofta and kabuli naan are particularly delicious, as is the kebab.", "rating": 5, "date": "2017-07-17"}, {"excerpts": ["Tikka masala, baingan bharta and malai kofta were mediocre. ", "Too creamy for me. ", "Would definitely come back for the okra though!"], "author": "Kendy L.", "review": "Okra and naan were amazing. Tikka masala, baingan bharta and malai kofta were mediocre. Too creamy for me. Would definitely come back for the okra though!", "rating": 3, "date": "2017-07-29"}], "daal saag": [{"excerpts": ["Also solid were the butter chicken and daal saag. ", "I'd return!"], "author": "Andrew K.", "review": "Most of the reviews are fake for sure, but I liked it, especially the missi roti (chick pea bread). Also solid were the butter chicken and daal saag. I'd return!", "rating": 4, "date": "2017-04-17"}], "shahi paneer": [{"excerpts": ["We ordered the baigan bhartha, shahi paneer, and malai kofta. ", "Everything was very well seasoned, and just as spicy as we asked for. ", "I especially recommend the malai kofta. ", "They all had a little too much cream, but that's to be expected from restaurant food. ", "The downside is naan or rice are not included with the entrees, so you have to order them separately. "], "author": "Apoorva A.", "review": "Delicious food! We ordered the baigan bhartha, shahi paneer, and malai kofta. Everything was very well seasoned, and just as spicy as we asked for. I especially recommend the malai kofta. They all had a little too much cream, but that's to be expected from restaurant food. The downside is naan or rice are not included with the entrees, so you have to order them separately. I ordered a serrano chili naan, which I really loved and recommend.\n\nWe came during lunch time on a Sunday, and it was pretty busy. Turns out, this place is owned by the same people who run Om Indian Cuisine in Haight-Ashbury, and they just opened another restaurant as well. The ambience is alright, a little dark (I think Om does a better job here). Service was also a little slow. They brought out our three different appetizers one at a time, perhaps in order to buy time for the entrees, which came a good 25 minutes after the order was placed. However, it was well worth the wait, and, overall, made for a great meal.", "rating": 5, "date": "2017-10-23"}], "kadai paneer": [{"excerpts": ["We ordered kadai paneer but got chicken pieces along with paneer. ", "When we asked them to check, first they mentioned it should be paneer ", "but we requested them to check with chef ", "and they confirmed it was chicken indeed and then mentioned it is \"No problem\" for them and can prepare a new one. ", "It may be no problem but its a big deal for vegetarians. ", "We left the place immediately. ", "Horrible experience"], "author": "Pray D.", "review": "VEGETARIANS AVOID THIS PLACE! We ordered kadai paneer but got chicken pieces along with paneer. When we asked them to check, first they mentioned it should be paneer but we requested them to check with chef and they confirmed it was chicken indeed and then mentioned it is \"No problem\" for them and can prepare a new one. It may be no problem but its a big deal for vegetarians. We left the place immediately. Horrible experience", "rating": 1, "date": "2018-11-04"}], "vegetable tikka masala": [{"excerpts": ["The vegetable korma and vegetable tikka masala were both amazingly flavorful, full to the brim with vegetables, and not too heavy. ", "I would also recommend getting the kabuli naan because the sweetness of the cherries baked into the naan complements the creamy sauces perfectly, and all of the naan portions are enormous. ", "The food was so good that we ate every last bite even though we weren't very hungry! ", "We're looking forward to our next visit."], "author": "Vijay N.", "review": "The korma and masala are heavenly, and the service felt warm and personal compared to last year.  We stopped in for an early dinner last weekend and were immediately seated. We got an unexpected free serving of excellent papadum and chutneys to start the meal. The vegetable korma and vegetable tikka masala were both amazingly flavorful, full to the brim with vegetables, and not too heavy. I would also recommend getting the kabuli naan because the sweetness of the cherries baked into the naan complements the creamy sauces perfectly, and all of the naan portions are enormous. The food was so good that we ate every last bite even though we weren't very hungry! We're looking forward to our next visit.", "rating": 5, "date": "2018-10-30"}, {"excerpts": ["We also ordered vegetable tikka masala, which was creamy and full of vegetables. ", "To finish the meal we got an order of garlic naan, which was fresh, warm and covered in delicious garlic. ", "Will definitely return to try more of what the menu has to offer!"], "author": "Mary S.", "review": "This restaurant certainly earned its 5 star rating! We came in around 6pm on a Thursday and we're seated immediately. For starters, we ordered the samosas and vegetable momo. The samosas were incredibly flavorful and cooked to perfection. The momos had a nice mix of flavors and spicy sauce on the side. We also ordered vegetable tikka masala, which was creamy and full of vegetables. To finish the meal we got an order of garlic naan, which was fresh, warm and covered in delicious garlic. Will definitely return to try more of what the menu has to offer!", "rating": 5, "date": "2017-06-09"}], "butter chicken masala": [{"excerpts": ["I got chicken vindaloo with garlic naan and my friends got chicken tikka masala, butter chicken masala, chicken korma. ", "They were all delicious!"], "author": "Theresa H.", "review": "We went here for dinner on a Sunday. There was no wait and got a table right away. The food was great- portions were big and flavorful! I got chicken vindaloo with garlic naan and my friends got chicken tikka masala, butter chicken masala, chicken korma. They were all delicious!", "rating": 5, "date": "2018-03-01"}, {"excerpts": ["We got the samosa, chicken tikka masala and butter chicken masala. ", "Everything was really good and the service was amazing. ", "They were on top of their service. ", "Their heat level was very low. ", "We got the spicy and the guy kept warning us and asking are we sure. ", "We got it and tried it we all agreed it was mild at best. ", "Great food, amazing service!"], "author": "Sarah T.", "review": "My friend wanted to go here and I must say I was dragging my feet trying to convince him otherwise. Boy am I glad I'm not such a great convincer because the food was really good. We got the samosa, chicken tikka masala and butter chicken masala. Everything was really good and the service was amazing. They were on top of their service. Their heat level was very low. We got the spicy and the guy kept warning us and asking are we sure. We got it and tried it we all agreed it was mild at best. Great food, amazing service!", "rating": 4, "date": "2017-05-13"}, {"excerpts": ["My wife and i ordered the butter chicken masala and vegetarian mushroom Matar. ", "It was perfectly cooked fresh.  ", "It was not too spicy and the sauce was savory with sweet tomatoe undertones... ", "Kabuli naan was pretty good too."], "author": "Allen W.", "review": "This place is under new management.  It does not have the buffet anymore but they really beautified the establishment with new chairs and decor..  Its really nice and intimate. My wife and i ordered the butter chicken masala and vegetarian mushroom Matar. It was perfectly cooked fresh.  It was not too spicy and the sauce was savory with sweet tomatoe undertones... Kabuli naan was pretty good too.", "rating": 4, "date": "2017-08-27"}, {"excerpts": ["The garlic naan and butter chicken masala are really good. ", "The renovation this place just completed under new management makes for a brighter experience that is a step above the previous buffet style that it replaced. ", "Highly recommended."], "author": "Brian R.", "review": "So awesome to live close to this place! The garlic naan and butter chicken masala are really good. The renovation this place just completed under new management makes for a brighter experience that is a step above the previous buffet style that it replaced. Highly recommended.", "rating": 5, "date": "2017-05-16"}], "chicken mushroom": [], "coconut chicken curry": [], "daal chicken": [], "chicken chili": [], "kashmiri chicken": [{"excerpts": ["Kashmiri Chicken - $11.95\n", "Our favorite was the Kashmiri Chicken. "], "author": "Jenn H.", "review": "I miss the very affordable AYCE place it once used to be, but I LOVE this new place. All the food we ordered came out hot, seasoned to perfection, and reasonably portioned. My husband and I ordered the following:\n\nTandoori Assorted (chicken, lamb, grilled veggies) - $10.95\nTandoori Chicken Wings - $9.95\nKashmiri Chicken - $11.95\nGarlic Naan - $2.95\nTandoori Roti - $2.00\nChai - $4.00\n\nCannot go wrong with any of the above. Our favorite was the Kashmiri Chicken. It is a sweet, creamy, and rich chicken curry dish. The chicken was buttery soft. The curry could be spicier though.", "rating": 5, "date": "2017-10-27"}, {"excerpts": ["I ordered the vegetable soup and the Kashmiri chicken.  ", "The soup was spicy and very tasty.  ", "Since I hadn't been here before, I decided discretion was the better part of valor and ordered the spice level on the chicken \"mild.", "\"  It was a delicious  dish but ", "even for my timid taste buds it could have been spicier.  ", "Will definitely ordered \"medium\" spicy next time and there certainly will be a next time.  ", "For me the servings were generous and I took about half the chicken dish home in a box.  ", "One caveat, service was slow.  ", "We were in no hurry and felt the dishes were prepared to order and not just dished up from a steam table.  ", "Therefore, it was worth the wait."], "author": "Claire L.", "review": "Live in the neighborhood and pass this place frequently.  With all the restaurants on Fillmore, I just never got around to trying it.  My loss.  Finally went for the first time today.  Charming decor and pleasant ambiance, very attractive table service.  My companion, a vegetarian, had quite a long selection of vegetarian dishes to choose from.  He ordered samosas and the vegetable momo, a Nepali dish very like light steamed dumplings.  He loved the spice combinations in both the samosa filling and the momo.  I ordered the vegetable soup and the Kashmiri chicken.  The soup was spicy and very tasty.  Since I hadn't been here before, I decided discretion was the better part of valor and ordered the spice level on the chicken \"mild.\"  It was a delicious  dish but even for my timid taste buds it could have been spicier.  Will definitely ordered \"medium\" spicy next time and there certainly will be a next time.  For me the servings were generous and I took about half the chicken dish home in a box.  One caveat, service was slow.  We were in no hurry and felt the dishes were prepared to order and not just dished up from a steam table.  Therefore, it was worth the wait.", "rating": 4, "date": "2018-01-14"}], "chicken bharta": [], "kadai chicken": [{"excerpts": ["Butter chicken and Kadai chicken are delicious! ", "Ordered them twice ", "and they were good both times. ", "Good delivery service, once they reached early! ", "5/5"], "author": "Thejas K.", "review": "Butter chicken and Kadai chicken are delicious! Ordered them twice and they were good both times. Good delivery service, once they reached early! 5/5", "rating": 5, "date": "2017-06-13"}], "lamb curry": [{"excerpts": ["I had samosas, lamb curry, and chicken korma, and all were perfect. ", "The lamb was so tender I could smash it with a fork with no effort."], "author": "Dan L.", "review": "Possibly best Indian food I've ever had. Inexpensive for anywhere but especially for San Francisco, fast service. I had samosas, lamb curry, and chicken korma, and all were perfect. The lamb was so tender I could smash it with a fork with no effort.", "rating": 5, "date": "2017-07-12"}], "lamb rogan josh": [{"excerpts": ["To add to my previous review: also love the Lamb rogan josh."], "author": "JJ M.", "review": "To add to my previous review: also love the Lamb rogan josh.", "rating": 4, "date": "2018-10-26"}, {"excerpts": ["Lamb Rogan josh, Serrano naan, Jeera rice, with a glass of red wine. ", "Perfect evening. ", "Prices are ok, service is swift. ", "I'll go again. ", "Thank you Royal."], "author": "Feroz C.", "review": "Another great place for Indian food \"Royal Indian cuisine\" located exactly at Fillmore st between post st and sutter st has won my heart with its great taste and rich flavors. Lamb Rogan josh, Serrano naan, Jeera rice, with a glass of red wine. Perfect evening. Prices are ok, service is swift. I'll go again. Thank you Royal.", "rating": 5, "date": "2017-05-14"}], "lamb tikka masala": [], "kadai ghost": [], "daal ghost": [], "coconut lamb curry": [], "lamb shank": [{"excerpts": ["But the aforementioned exclamation and subsequent explanation came from the awe provoking lamb shank.\n\n"], "author": "Dubl A.", "review": "Oh sjit!!! Thus spaketh the dude who ordered, when he opened his to go platter.\n\nThis freaking spot actually lives up to its name..\n\nOrder the veggie momo nice spicy flavor\n\nBut the aforementioned exclamation and subsequent explanation came from the awe provoking lamb shank.\n\nThis mofo was like the size of mr T.'s bicep!!  No baby ill equipped veal box baby here!!!\n\nFelt like a dog gone sultan eating this prized specimen..  \n\nTrue royalty while eating on my drive down Fillmore Street in my Chrysler minivan... \n\nA+ guys. Job well done. Excellent portions. Flavor, freshness... And hooked me up with extra naan!", "rating": 5, "date": "2018-09-24"}, {"excerpts": ["Ive been coming here for Lamb shank ", "it's so good \n", "I also have tried other stuff which was good"], "author": "Mohammad Z.", "review": "Ive been coming here for Lamb shank it's so good \nI also have tried other stuff which was good", "rating": 5, "date": "2018-05-20"}, {"excerpts": ["Lamb shank was so undercooked that it was hard to chew soi ", "we left our. ", "The tomato sauce was clearly just added to the cooked lamb shank right before they served it. ", "Basmati rice was also not cooked well. ", "The waiter did not even ask why the lamb shank was untouched and most of the 3 orders of basmati rice was not eaten. \n\n"], "author": "Nariman R.", "review": "Lamb shank was so undercooked that it was hard to chew soi we left our. The tomato sauce was clearly just added to the cooked lamb shank right before they served it. Basmati rice was also not cooked well. Chicken tandoori, we asked for dark meat only and our waiter confirmed the order but still we got breast pieces and thigh. They are audio loading like 1.5 pounds of onion on top of this tandoori to make it look like a large dish. You don't fool anyone.\nWaiter forgot to bring us Jeera rice. Then instead of bringing it, he said he will go check if we ordered it. \n\nWe last more that half of what we ordered on the table and asked for check. The waiter did not even ask why the lamb shank was untouched and most of the 3 orders of basmati rice was not eaten. \n\nTo those San Francisco folks who think this is awesome Indian food, you have not had good Indian food. Go eat at Amber at least. Or go 3 doors down and eat at Dosa.", "rating": 2, "date": "2018-04-21"}, {"excerpts": ["We decided to try the Lamb Shank and were so glad we did, thanks to the waiter for the awesome recommendation! ", "It was super tender, moist, and the sauce was absolutely delicious. ", "(10/10 would recommend!) ", "For dessert, we ordered Rice Pudding and it wasn't the jello-like substance I was expecting "], "author": "Ashley O.", "review": "My friend and I were craving some Indian food the other day and looked on Yelp for some inspiration when we found this place! For the appetizer, we had Papadum which is like a thin, crispy, biscuit accompanied with three yummy sauces. What really grabbed my attention was the Garlic Naan. Never really been a fan of naan but this Garlic Naan was sooo fresh and perfectly toasted, I got a little sad when I looked down and realized I had already finished it so quick. We decided to try the Lamb Shank and were so glad we did, thanks to the waiter for the awesome recommendation! It was super tender, moist, and the sauce was absolutely delicious. (10/10 would recommend!) For dessert, we ordered Rice Pudding and it wasn't the jello-like substance I was expecting but it was really good and definitely satisfied my sweet tooth :)\n\nIn addition to good quality food and service, the ambiance was also great. Some restaurants either have super loud music playing or obnoxious bright lights, but I noticed that this place had a nice, dim lighting configuration and soft music playing in the background. (Perfect place to bring a date!)\n\nDefinitely coming back for round 2.", "rating": 5, "date": "2017-04-25"}, {"excerpts": ["so we got the Lamb Shank. ", "It was tender and moist "], "author": "Jeff K.", "review": "I noticed this new spot had multiple 5 star reviews and decided to try it out. Noticed some Yelpers were doubting all the positive feedback. This just made me more curious, and hungry! Sometimes you just need to see for yourself. \n\nStarted with a Papadum appetizer, which is like a big cracker with 3 dipping sauces. We also had the Garlic Naan which was so fresh and delicious,....I could eat it all day.\n\nFor entrees, I asked the waiter to recommend something with chicken and he suggested the Chicken Chilli, which I had never had before. It was a solid choice and I'd surely get it again.\n\nI was craving lamb so we got the Lamb Shank. It was tender and moist and I loved the flavor of the marinade, it really hit the spot!\n\nFor dessert, we had Rice pudding.\n\n***At the end of the meal, we saw another couple had ordered Tandoori. They brought it out on a sizzling platter, filling the place with an intoxicating aroma,....Oh God. Even though I was full, it smelled so good that I vowed to order it when we return, which we will! \n\nNo question, easy 5 stars.", "rating": 5, "date": "2017-04-24"}], "salmon tikka masala": [], "salmon vindaloo": [{"excerpts": ["We got seekh kebab and salmon vindaloo with some rice and naan. ", "The spices were right on point ", "but however I do think that they should give some complimentary rice with curries."], "author": "Vimpy G.", "review": "We ordered through Ubereats  and it took forever for the driver to deliver the food to us. We had called the restaurant so many times to ask about the status and the guy over the phone was extremely helpful and the good part is we found out that they do free home delivery . Now lets talk about food. OMG  food over here is amazing. We got seekh kebab and salmon vindaloo with some rice and naan. The spices were right on point but however I do think that they should give some complimentary rice with curries.", "rating": 5, "date": "2018-11-07"}], "salmon saag curry": [], "shrimp curry": [], "shrimp tikka masala": [{"excerpts": ["Also very fragrant and flavorful- the chicken biryani, Shrimp tikka masala (spicy), and the seekh kabobs. \n\n"], "author": "K C.", "review": "If you crave that spice fix you can only get from authentic Indian food, this is the place! My favorites are chicken tikka masala (spicy), garlic naan, lamb chops, and of course, chicken momos. \n\nAlso very fragrant and flavorful- the chicken biryani, Shrimp tikka masala (spicy), and the seekh kabobs. \n\nEverything tastes a little bit better spicy, as hot as you can eat it, and followed by a delicious mango lassi.\n\nThe ambiance is very nice and comfortable. The service is really great.", "rating": 5, "date": "2018-07-31"}, {"excerpts": ["I ordered chicken korma, my brother ordered shrimp tikka masala. ", "The chicken korma was definitely solid, but I thought it could've been a little thicker. ", "The portion was pretty small as well - too small for 1 serving of naan. ", "The service was good. ", "If I live here I'd visit this place on a regular basis."], "author": "Karl S.", "review": "We came here with empty stomachs. We shared samosa, rice, and garlic naan. I ordered chicken korma, my brother ordered shrimp tikka masala. The samosa was great: clean and not salty but perfectly spiced. The naan was great but I thought it could've been crispier, perhaps I was just biased since my goto Indian place in NYC had really crispy (yet soft inside) naan. The chicken korma was definitely solid, but I thought it could've been a little thicker. The portion was pretty small as well - too small for 1 serving of naan. The service was good. If I live here I'd visit this place on a regular basis.", "rating": 4, "date": "2017-05-19"}, {"excerpts": ["I love their shrimp tikka masala!  ", "Full of flavor!  ", "Not to mention the texture of the shrimp is perfect with the luscious texture of the tikka sauce.  ", "Service is great and I will definitely recommend this to family and friends.  ", "Of course, I have a favorite spot now for Indian food!"], "author": "Hazel B.", "review": "I love their shrimp tikka masala!  Full of flavor!  Not to mention the texture of the shrimp is perfect with the luscious texture of the tikka sauce.  Service is great and I will definitely recommend this to family and friends.  Of course, I have a favorite spot now for Indian food!", "rating": 4, "date": "2018-06-01"}], "shrimp vindaloo": [{"excerpts": ["However, the chicken tikka masala was bland and the shrimp vindaloo was really watery and also very bland. ", "Hopefully this was just an off night for them."], "author": "Lester W.", "review": "There were obviously a lot of fake 5-star reviews for this restaurant, but we tried it anyways.\n\nDelivery was faster than expected. The garlic naan bread was delicious. The aloo gobi had the perfect amount of spices.\n\nHowever, the chicken tikka masala was bland and the shrimp vindaloo was really watery and also very bland. Hopefully this was just an off night for them.", "rating": 3, "date": "2017-06-15"}], "shrimp saag curry": [], "shrimp korma": [], "mixed seafood curry": [], "jeera rice": [{"excerpts": ["I thought I hated rice but the jeera rice was like something I want with every meal now ", "but I can't make it "], "author": "Juliette H.", "review": "I don't know Indian cuisine that well and I've only had a few dishes here but this is a place that I will keep coming to because it's so damn tasty and I plan on working my way through the whole menu. The chicken vindaloo is so flavorful and just enough heat. Tonight I had the tandoori chicken and again, very flavorful. I thought I hated rice but the jeera rice was like something I want with every meal now but I can't make it so I guess I'll just have to keep eating here. \n\nThe ambiance is casual and the service has always been great. Also it's pretty cheap for SF. I had the tandoori chicken, rice, laccha paratha, and a glass of wine which set me back $29 for meal and $6 for tip. Btw, I have enough leftovers for another meal and snack.", "rating": 4, "date": "2018-01-13"}, {"excerpts": ["Waiter forgot to bring us Jeera rice. "], "author": "Nariman R.", "review": "Lamb shank was so undercooked that it was hard to chew soi we left our. The tomato sauce was clearly just added to the cooked lamb shank right before they served it. Basmati rice was also not cooked well. Chicken tandoori, we asked for dark meat only and our waiter confirmed the order but still we got breast pieces and thigh. They are audio loading like 1.5 pounds of onion on top of this tandoori to make it look like a large dish. You don't fool anyone.\nWaiter forgot to bring us Jeera rice. Then instead of bringing it, he said he will go check if we ordered it. \n\nWe last more that half of what we ordered on the table and asked for check. The waiter did not even ask why the lamb shank was untouched and most of the 3 orders of basmati rice was not eaten. \n\nTo those San Francisco folks who think this is awesome Indian food, you have not had good Indian food. Go eat at Amber at least. Or go 3 doors down and eat at Dosa.", "rating": 2, "date": "2018-04-21"}, {"excerpts": ["Lamb Rogan josh, Serrano naan, Jeera rice, with a glass of red wine. ", "Perfect evening. ", "Prices are ok, service is swift. ", "I'll go again. ", "Thank you Royal."], "author": "Feroz C.", "review": "Another great place for Indian food \"Royal Indian cuisine\" located exactly at Fillmore st between post st and sutter st has won my heart with its great taste and rich flavors. Lamb Rogan josh, Serrano naan, Jeera rice, with a glass of red wine. Perfect evening. Prices are ok, service is swift. I'll go again. Thank you Royal.", "rating": 5, "date": "2017-05-14"}], "vegetable biryani": [], "shrimp biryani": [], "mixed seafood biryani": [], "raita": [], "mango chutney": [], "mixed pickle": [], "vegetarian thali for": [{"excerpts": ["Split the Vegetarian Thali for 2 with a side of chicken biryani. ", "Of the 5 Indian places in the city I've tried it has been by far the best. ", "Ordering our meal \"spicy\" actually resulted in spicy food. "], "author": "R M.", "review": "Split the Vegetarian Thali for 2 with a side of chicken biryani. Of the 5 Indian places in the city I've tried it has been by far the best. Ordering our meal \"spicy\" actually resulted in spicy food. The daal makhani and the biryani were standout. It's not the best I've ever had, but the the best I've had in SF. Will definitely return.", "rating": 5, "date": "2017-05-29"}], "royal thali special for": [{"excerpts": ["We ordered the \n\"Royal Thali Special for 2: "], "author": "Emma B.", "review": "I was really pleased with delivery from this restaurant. It came quickly and was still warm.\nWe ordered the \n\"Royal Thali Special for 2: Starter: pappadum, samosa. Entrees: chicken tikka masala, saag paneer, tandoori chicken with boti, side of rice and naan. Dessert: kheer\" for $42. \n\nWe got four meals out of it! The entrees didn't have very much protein in them, but to be fair it was supposed to be for two meals. The naan came a little tough but I bet if we had it fresh at the restaurant it would have been better. It also came with a variety of dipping sauces which were fun to try and all tasty.\n\nThis was a fun way to try out multiple dishes from a new restaurant at a great price.", "rating": 4, "date": "2017-06-19"}], "chicken achari": [], "chicken tikka kebab": [{"excerpts": ["Chicken tikka kebab smoking hot.\n", "2. ", "Delicious creamy Chicken tikka masala.\n", "3. ", "Crispy crispy Onion kulcha and garlic naan.\n", "4. "], "author": "Phani C.", "review": "First thing that attracted me is the name then the ambience while coming to the main stream of any particular restaurant is \"FOOD\" because,with out great flavour or the special essence the ambience or the name doesn't make any magic....\nAmazed by their hospitality and the food tastes beyond awesome,small place with great taste love it.\n\n1. Chicken tikka kebab smoking hot.\n2. Delicious creamy Chicken tikka masala.\n3. Crispy crispy Onion kulcha and garlic naan.\n4. Mango kulfi.\nAmazing lunch under 50$.\n\nI wish you guys all the very best.", "rating": 5, "date": "2017-04-16"}, {"excerpts": ["Chicken Tikka Kebab: ", "The portion was generous, however the chicken was dry and had no flavor. ", "The menu claimed it is marinated- "], "author": "Gene G.", "review": "Chicken Tikka Kebab: The portion was generous, however the chicken was dry and had no flavor. The menu claimed it is marinated- it clearly had not been.\n\nBaigan Bharta (eggplant curry): Too oily. Did not have peas as promised in the menu. Flavor was OK.\n\nSaag Paneer: Too oily. Good flavor though.\n\nKabuli Naan: Good flavor, however for $4 it was too small. Other than the pink, shredded coconut, you couldn't taste or see any of the other ingredients it was supposed to have.\n\nSamosas: Crispy and chewy- I think they use a little cornstarch in the dough. Filling was flavorful.\n\nVegetarian Momos: The filling was unremarkable- some kind of green paste with no defining flavor. The dough was some kind of thin, translucent rice paper or cornstarch mixture- not at all what you expect from momos. The skins dried out almost immediately. They try to mitigate this by brushing them in oil- yuck.\n\nService was polite and the decor/ambiance pleasant. Would not return for the food though.", "rating": 2, "date": "2018-02-15"}], "boti kebab": [], "tandoori salmon": [], "tandoori shrimp": [{"excerpts": ["The tandoori shrimp was the best I have had, even in England. ", "Can't recommend this place enough......try it you won't be sorry."], "author": "Barbara D.", "review": "What a wonderful surprise.....there was another Indian restaurant here but when we thought we were going to that one we walked into Royal Indian and immediately knew it was different and much more attractive. The food was really really good and the service very pleasant and timely. The tandoori shrimp was the best I have had, even in England. Can't recommend this place enough......try it you won't be sorry.", "rating": 5, "date": "2017-04-25"}], "lamb chops": [{"excerpts": ["My favorites are chicken tikka masala (spicy), garlic naan, lamb chops, and of course, chicken momos. \n\n", "Also very fragrant and flavorful- the chicken biryani, Shrimp tikka masala (spicy), and the seekh kabobs. \n\n"], "author": "K C.", "review": "If you crave that spice fix you can only get from authentic Indian food, this is the place! My favorites are chicken tikka masala (spicy), garlic naan, lamb chops, and of course, chicken momos. \n\nAlso very fragrant and flavorful- the chicken biryani, Shrimp tikka masala (spicy), and the seekh kabobs. \n\nEverything tastes a little bit better spicy, as hot as you can eat it, and followed by a delicious mango lassi.\n\nThe ambiance is very nice and comfortable. The service is really great.", "rating": 5, "date": "2018-07-31"}], "paneer tikka kebab": [], "tandoori mixed grilled": [], "laccha paratha": [{"excerpts": ["I had the tandoori chicken, rice, laccha paratha, and a glass of wine which set me back $29 for meal and $6 for tip. ", "Btw, I have enough leftovers for another meal and snack."], "author": "Juliette H.", "review": "I don't know Indian cuisine that well and I've only had a few dishes here but this is a place that I will keep coming to because it's so damn tasty and I plan on working my way through the whole menu. The chicken vindaloo is so flavorful and just enough heat. Tonight I had the tandoori chicken and again, very flavorful. I thought I hated rice but the jeera rice was like something I want with every meal now but I can't make it so I guess I'll just have to keep eating here. \n\nThe ambiance is casual and the service has always been great. Also it's pretty cheap for SF. I had the tandoori chicken, rice, laccha paratha, and a glass of wine which set me back $29 for meal and $6 for tip. Btw, I have enough leftovers for another meal and snack.", "rating": 4, "date": "2018-01-13"}, {"excerpts": ["We had laccha paratha and butter naan. ", "The paratha was super wheaty, which was fit the bill for whole wheat. "], "author": "masa s.", "review": "I really liked the old place. I mean, it wasn't all that good, and, even though they'd raised their prices, it was still a pretty good deal on the buffet. So, when I saw this new place, I was skeptical, but still willing to give it a try.\n\nThe food was delicious. We started with the baingan pakora. It was good for what it was, but I think I'd get the mixed vegetables. Our two entrees were spot on good. They vary the spiciness, but the mild/medium/spicy is still pretty subjective. I thought they did it appropriately - medium hit the range for my wife and me (max comfort for her, just enough to taste for me). We had laccha paratha and butter naan. The paratha was super wheaty, which was fit the bill for whole wheat. The naan was both fluffy *and* crispy.\n\nI went in dehydrated, so I was gulping down water, and the waiter was constantly running over to refill my water right on cue - attentive without hovering.\n\nWe'll definitely go back, and might be doing delivery or pick up.", "rating": 5, "date": "2017-05-13"}], "butter naan": [{"excerpts": ["We ordered roti, butter naan and butter chicken, the gravy was amazinggg!! ", "Creamy and delicious!! ", "The quantity was enough for 2 people. "], "author": "Saarthak C.", "review": "Craving for Indian food? This is an amazing restaurant: heads up: they don't have buffers !! I was surprised too since I've rarely seen an Indian restaurant without a buffet.\n\nWe ordered roti, butter naan and butter chicken, the gravy was amazinggg!! Creamy and delicious!! The quantity was enough for 2 people. The roti bread was good food, and with prompt servers, I had no complains whatsoever.\n\nGreat food,  wish the restaurant was a bit bigger in size, but I didn't have to wait so no complains :)", "rating": 5, "date": "2018-07-29"}, {"excerpts": ["We ordered vegetable momo, butter naan, chicken tikka masala, coconut vegetable curry, and rice (you do have to order rice separately- ", "it does not come with the entrees). ", "Flavors were full and fantastic. ", "Servings were generous."], "author": "Elizabeth D.", "review": "Some of the best Indian food that I've had. We ordered vegetable momo, butter naan, chicken tikka masala, coconut vegetable curry, and rice (you do have to order rice separately- it does not come with the entrees). Flavors were full and fantastic. Servings were generous.", "rating": 5, "date": "2018-04-12"}, {"excerpts": ["We had laccha paratha and butter naan. ", "The paratha was super wheaty, which was fit the bill for whole wheat. "], "author": "masa s.", "review": "I really liked the old place. I mean, it wasn't all that good, and, even though they'd raised their prices, it was still a pretty good deal on the buffet. So, when I saw this new place, I was skeptical, but still willing to give it a try.\n\nThe food was delicious. We started with the baingan pakora. It was good for what it was, but I think I'd get the mixed vegetables. Our two entrees were spot on good. They vary the spiciness, but the mild/medium/spicy is still pretty subjective. I thought they did it appropriately - medium hit the range for my wife and me (max comfort for her, just enough to taste for me). We had laccha paratha and butter naan. The paratha was super wheaty, which was fit the bill for whole wheat. The naan was both fluffy *and* crispy.\n\nI went in dehydrated, so I was gulping down water, and the waiter was constantly running over to refill my water right on cue - attentive without hovering.\n\nWe'll definitely go back, and might be doing delivery or pick up.", "rating": 5, "date": "2017-05-13"}, {"excerpts": ["It consisted of samosas for starter, followed by Saag paneer and Dal makhani served with butter naan and rice. "], "author": "Nishith M.", "review": "Originally planned to go to DOSA but it was closed for lunch. That is when we decided to try out this little gem.\n\nInteriors were nice and clean. We got the vegetarian thali which was basically a three course meal for two. It consisted of samosas for starter, followed by Saag paneer and Dal makhani served with butter naan and rice. I loved the kheer for desert. Would recommend. Also got sweet lassi which was ok.\n\nOverall good service and solid food at a decent price point (under $50 for 2)", "rating": 5, "date": "2017-05-07"}], "serrano chili naan": [{"excerpts": ["*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n\nI adored the curry. "], "author": "Elena N.", "review": "I stayed out a little too late on Friday. So when I woke up, I was starving. Decided to get delivery through Eat24 on Saturday, September 22nd. I placed my lunch order at 2:45pm. It arrived at 3:45pm. I live in Outer Richmond.\n\n*Samosa: Homemade crispy Indian pastry stuffed with spiced peas and potatoes, Served with homemade mint chutney, hot and sour and tamarind chutney, All batters are signature chickpea (garbanzo batter) prepared by our chef ($4.95)\n*Chicken Momo: Nepali delicacy cooked with ground chicken and Himalayan spices filled in cover with thin flour dough and steamed ($8.95)\n*Chicken Tikka Masala: Roasted chicken breast cooked in creamy tomato and onion sauce, Extra spicy ($12.95)\n*Garlic Naan: Naan layered with freshly minced garlic and chopped cilantro ($2.95)\n*Serrano Chili Naan: Naan brushed with blended green chili ($2.95)\n\nI adored the curry. It was creamy and comforting. Could have used a little more spice as I wanted it extra spicy, but it had a good amount of heat. The naan were both soft with a nice chew. Though, I do think they could have used more garlic and chili. The flavors weren't strong enough for me. The samosas were good. Crispy on the outside and soft on the inside. Though their mint chutney was very bland and watery. Didn't really stick to the samosas. I love dumplings so the momos were tasty. The dipping sauce complemented them well.\n\nIndian is my comfort food and this hit the spot. Especially since I was feeling a little delicate that day.", "rating": 4, "date": "2018-09-29"}, {"excerpts": ["I ordered a serrano chili naan, which I really loved and recommend.\n\n"], "author": "Apoorva A.", "review": "Delicious food! We ordered the baigan bhartha, shahi paneer, and malai kofta. Everything was very well seasoned, and just as spicy as we asked for. I especially recommend the malai kofta. They all had a little too much cream, but that's to be expected from restaurant food. The downside is naan or rice are not included with the entrees, so you have to order them separately. I ordered a serrano chili naan, which I really loved and recommend.\n\nWe came during lunch time on a Sunday, and it was pretty busy. Turns out, this place is owned by the same people who run Om Indian Cuisine in Haight-Ashbury, and they just opened another restaurant as well. The ambience is alright, a little dark (I think Om does a better job here). Service was also a little slow. They brought out our three different appetizers one at a time, perhaps in order to buy time for the entrees, which came a good 25 minutes after the order was placed. However, it was well worth the wait, and, overall, made for a great meal.", "rating": 5, "date": "2017-10-23"}], "paneer naan": [], "spinach naan": [], "chicken naan": [], "aloo paratha": [], "pudina paratha": [], "piece puri": [], "missi roti": [{"excerpts": ["Most of the reviews are fake for sure, but I liked it, especially the missi roti (chick pea bread). "], "author": "Andrew K.", "review": "Most of the reviews are fake for sure, but I liked it, especially the missi roti (chick pea bread). Also solid were the butter chicken and daal saag. I'd return!", "rating": 4, "date": "2017-04-17"}, {"excerpts": ["Tried the momos, dal soup, navratan korma, baingan bartha, missi roti, pudina parata, and lacha parata. ", "Service is excellent."], "author": "Karthik G.", "review": "Coming in, I was wondering how can a place have so many 5 stars. Am now convinced that this places deserves it's unanimous MVP rating. Tried the momos, dal soup, navratan korma, baingan bartha, missi roti, pudina parata, and lacha parata. Service is excellent.", "rating": 5, "date": "2017-09-27"}], "assorted bread": [], "gulab jamun": [{"excerpts": ["Gulab jamun ", "and you bring rasmali and say that every restaurant has its own menu and food.\n", "No! ", "There are some things which are standard and you need to stick to what they are when you are naming them.", "What you served was a Three course meal and not a Thali.\n", "And to the point where you said we questioned only when the bill came up,of course we were taken aback to see 85$ for 2 Thalis which would have normally costed us less than 50$.And in the beginning when we were given 4 samosas the server told us that 2 Thalis were a lot of food,then I immediately told we will cancel one and he said no you cannot as we already brought the samosas!(if he would have cancelled then, all this chaos wouldn't have happened)\n", "So the whole situation arose because you used a Standard item Thali and made it into whatever you want.", "You are free to do it ", "but it's your responsibility to explain it to your customers and not think that it's a headache to the servers.\n", "You wasted our time,money and we left your restaurant completely disappointed with your hospitality."], "author": "Ramya R.", "review": "This update is in response to Mr.Ajay's reply to my review-\nFirst of all please Google or find out from restauranteurs in India what a\"Thali\" is- your justification is -when I order Gulab jamun and you bring rasmali and say that every restaurant has its own menu and food.\nNo! There are some things which are standard and you need to stick to what they are when you are naming them.What you served was a Three course meal and not a Thali.\nAnd to the point where you said we questioned only when the bill came up,of course we were taken aback to see 85$ for 2 Thalis which would have normally costed us less than 50$.And in the beginning when we were given 4 samosas the server told us that 2 Thalis were a lot of food,then I immediately told we will cancel one and he said no you cannot as we already brought the samosas!(if he would have cancelled then, all this chaos wouldn't have happened)\nSo the whole situation arose because you used a Standard item Thali and made it into whatever you want.You are free to do it but it's your responsibility to explain it to your customers and not think that it's a headache to the servers.\nYou wasted our time,money and we left your restaurant completely disappointed with your hospitality.", "rating": 1, "date": "2018-10-04"}], "kheer": [{"excerpts": ["Kheer.  "], "author": "Jen W.", "review": "Apparently under new management and slightly remodeled, this place has improved slightly from the previous owners.  We had a hankering for some Indian food after work and remembered this spot out in the Fillmore.  No buffet options anymore either.  \n\nAlthough they were busy, there was an table available for us and didn't have to wait.  We decided to go with the Thali special for 2:  STARTER: Pappadum, Samosa ENTREES: Chicken Tikka Masala, Saag Paneer, Tandoori Chicken with Boti, Side of Rice & Naan. DESSERT: Kheer.  Such a steal for a little over $40.  \n\nMy favorite dish was the tandoori which was perfectly spiced and came out sizzling on a hot plate.  The naan also stood out as the texture was spot on.  The not so greats?  The saag paneer was quite plain and the tikka masala was also slightly bland.  Were they terrible?  No, but I've definitely had better.\n\nI have to say that the portions were huge though.  We definitely needed doggie bags and had dinner for the next night.  \n\nService was slow but they were efficient.  3.5 stars and a good option for Indian food in the area.", "rating": 4, "date": "2017-07-02"}, {"excerpts": ["Dessert: kheer\" for $42. \n\n"], "author": "Emma B.", "review": "I was really pleased with delivery from this restaurant. It came quickly and was still warm.\nWe ordered the \n\"Royal Thali Special for 2: Starter: pappadum, samosa. Entrees: chicken tikka masala, saag paneer, tandoori chicken with boti, side of rice and naan. Dessert: kheer\" for $42. \n\nWe got four meals out of it! The entrees didn't have very much protein in them, but to be fair it was supposed to be for two meals. The naan came a little tough but I bet if we had it fresh at the restaurant it would have been better. It also came with a variety of dipping sauces which were fun to try and all tasty.\n\nThis was a fun way to try out multiple dishes from a new restaurant at a great price.", "rating": 4, "date": "2017-06-19"}, {"excerpts": ["I loved the kheer for desert. ", "Would recommend. "], "author": "Nishith M.", "review": "Originally planned to go to DOSA but it was closed for lunch. That is when we decided to try out this little gem.\n\nInteriors were nice and clean. We got the vegetarian thali which was basically a three course meal for two. It consisted of samosas for starter, followed by Saag paneer and Dal makhani served with butter naan and rice. I loved the kheer for desert. Would recommend. Also got sweet lassi which was ok.\n\nOverall good service and solid food at a decent price point (under $50 for 2)", "rating": 5, "date": "2017-05-07"}], "kulfi": [{"excerpts": ["Mango kulfi.\n"], "author": "Phani C.", "review": "First thing that attracted me is the name then the ambience while coming to the main stream of any particular restaurant is \"FOOD\" because,with out great flavour or the special essence the ambience or the name doesn't make any magic....\nAmazed by their hospitality and the food tastes beyond awesome,small place with great taste love it.\n\n1. Chicken tikka kebab smoking hot.\n2. Delicious creamy Chicken tikka masala.\n3. Crispy crispy Onion kulcha and garlic naan.\n4. Mango kulfi.\nAmazing lunch under 50$.\n\nI wish you guys all the very best.", "rating": 5, "date": "2017-04-16"}], "mango kulfi": [{"excerpts": ["Mango kulfi.\n"], "author": "Phani C.", "review": "First thing that attracted me is the name then the ambience while coming to the main stream of any particular restaurant is \"FOOD\" because,with out great flavour or the special essence the ambience or the name doesn't make any magic....\nAmazed by their hospitality and the food tastes beyond awesome,small place with great taste love it.\n\n1. Chicken tikka kebab smoking hot.\n2. Delicious creamy Chicken tikka masala.\n3. Crispy crispy Onion kulcha and garlic naan.\n4. Mango kulfi.\nAmazing lunch under 50$.\n\nI wish you guys all the very best.", "rating": 5, "date": "2017-04-16"}], "nut allergies": []}