{"shakshuka": [{"excerpts": ["I came here for breakfast one weekend morning and had the \"Shakshuka,\" a bold breakfast item that consisted of a poached egg that was swimming in chickpeas, some spicy tomato sauce, which I think had some jalapenos even, although my memory is a bit fuzzy. ", "Let me just say that the Shakshuka and coffee did not go together like two peas in a pod. ", "Next time, I'd probably opt for the more traditional breakfast sandwich (which looks delicious from the pictures), but I did enjoy all the flavors of the Shakshuka", "; it was great to try it once, but it just felt weird eating something like that for breakfast with a hot cup of coffee. "], "author": "Alex L.", "review": "It's a modern style coffee bar in the heart of the Castro district. I came here for breakfast one weekend morning and had the \"Shakshuka,\" a bold breakfast item that consisted of a poached egg that was swimming in chickpeas, some spicy tomato sauce, which I think had some jalapenos even, although my memory is a bit fuzzy. I also had one of their very smooth and strong cups of coffee.\n\nLet me just say that the Shakshuka and coffee did not go together like two peas in a pod. Next time, I'd probably opt for the more traditional breakfast sandwich (which looks delicious from the pictures), but I did enjoy all the flavors of the Shakshuka; it was great to try it once, but it just felt weird eating something like that for breakfast with a hot cup of coffee. Guess I'm just not used to it.\n\nA+ gold star for myself for a healthy choice though! I enjoyed the atmosphere here, especially in the morning with the electronic music playing; felt like I was in a fancy hotel lobby or something..ha.", "rating": 4, "date": "2018-08-29"}, {"excerpts": ["I got myself a Cappuccino (pictured) and a Shakshuka which was really great although not ordering the Avocado toast required more restraint on my part than I thought. \n\n"], "author": "Gouthaman K.", "review": "This is a solid place to go get some coffee and a quick brunch. I got myself a Cappuccino (pictured) and a Shakshuka which was really great although not ordering the Avocado toast required more restraint on my part than I thought. \n\nMy only real gripe is that they can fill up quite a bit over the weekend which results in not much place to sit around if and relax if you're the type to read a book or get some work done.", "rating": 4, "date": "2016-05-25"}, {"excerpts": ["I've heard tell of the fabulous Avocado Toast ($4.50/$6.50 with fried egg) and Shakshuka, a pricey poached egg with roasted tomato and chickpea ($11).\n\n"], "author": "Ed U.", "review": "Compared to the cacophony of the Columbus Avenue location where United Nations delegations pass through at alarming rates, this Réveille has a downright low-key vibe, and this is the Castro for Harvey's sake. It may be because I was here a half-hour before closing when all the overly caffeinated hipsters were already in rehab shelters for the night. I liked the look of the place with the front patio made for serious gawking and the neo-vintage cross-hatch wallpaper and faux-firewood accent wall made for the interior decorator in all of us (photo: http://bit.ly/1IlDYeL). I've heard tell of the fabulous Avocado Toast ($4.50/$6.50 with fried egg) and Shakshuka, a pricey poached egg with roasted tomato and chickpea ($11).\n\nBut alas, I never think about having an actual meal at Réveille, but I'll fix that misconception at some point. In the meantime, I decided to saunter in after a hearty bowl of Spicy Oxtail Pho at Mekong Kitchen across the street. There were only two laptoppers in the place, so I had plenty of choice as to where to sit. The $4.50 Mocha calmed my fiery digestive system in no time at all (photo: http://bit.ly/1OMqyMB). The Newbury brothers, Tommy and Chris, started Réveille in a delivery truck five years ago, and while they're not yet in the same playpen as Philz or Blue Bottle, I like the richness and finishing style they display with their coffee. Besides, they're not nearly as pretentiously elitist as they are at Sightglass. Oh no, he didn't. Oh yeah, I went there.\n\nCOFFEE - 4 stars...silky goodness in that mocha\nAMBIANCE - 3.5 stars...the trendiness comes off as trendy but somehow it works\nSERVICE - 3.5 stars...nicer than anyone at Sightglass\nTOTAL - 4 stars...give it up for the Traveling Newburys", "rating": 4, "date": "2015-08-03"}, {"excerpts": ["Looking at you Shakshuka.\n", "But until then, avocado toast dreams all the way."], "author": "Candice G.", "review": "The avocado toast. \nIt's so simple, but so good. \nIt's so simple that it's actually kind of dumb how fantastic it is. \nIt's so simple that I fooled myself into thinking I could recreate it at home. \nI was wrong. \nSo very, very wrong. \nEverything I make looks like cat food. \n\n\nIngredients: Avocado, Salt + Pepper, Olive Oil, Acme Levain\nIt's $4.50.\nYou can also add a fried egg (I do) for an additional $2\n\n\nThis place is within' a downhill walk from my best friend's place.\nPerfect for those sudzy nights where I need to couch crash. \nEven better for those hungover mornings where calories and single-stall bathroom with a good flush are necessary.\nThey have great coffee here.\nSo great that even a person like me who appreciates creamer more than coffee can stomach it black. \nThough their iced tea is pretty on point and far better for the hangover curing process than a mimosa. \n\n\nThey have a few tables inside and a really nice, sunny patio.\nIt's super casual.\nOrder at the counter, wait with your number, then get brought back to life with this delicious dish. \nOne day I'll get something else here.\nLooking at you Shakshuka.\nBut until then, avocado toast dreams all the way.", "rating": 5, "date": "2015-06-22"}, {"excerpts": ["Reveille's Shakshuka is tasty ", "but it's not really Shakshuka. ", "It's more of a Mexican version. "], "author": "Carl M.", "review": "The coffee, pastries and food at Reveille are actually decent, especially for the Castro.\n\nThe reason for me so-so review is the atmosphere. When I take a break from work and head out for breakfast or a coffee, the LAST thing I want to see is a crowd of people on their laptops, and that's pretty much all one finds at Reveille. Call me old fashioned, but staring at my OWN screen for 12 hours a day is enough. I don't need to see everyone else's, or hear their business conversations. It's always impossible to get a seat as the crowd settles in with their laptops and STAYS. Hey good for them. Not so good for me.\n\nSo yes- fine coffee and all that, but I'd rather head to Thoroughbread on Church for their amazing scones, or up to Peet's on Market for just coffee. Or even Four Barrel if I'm feeling trendy.\n\nOne note on the food- Reveille's Shakshuka is tasty but it's not really Shakshuka. It's more of a Mexican version. Spicy and good, but not the real thing.\n\nI did quite like the Avocado toast. But count me out as long as the laptops reign supreme.", "rating": 2, "date": "2016-04-27"}, {"excerpts": ["The Shakshuka (poached egg/kale/tomato/chickpea/feta) breakfast bowl was delicious and filling. ", "Generally I would cast a side of toast aside but even the Starter Bakery levain that came with the dish looked (and was) too good to pass up. ", "Also they were playing music by FKA Twigs and two people working there complimented me on my outfit."], "author": "Kyle L.", "review": "Good coffee, food, music AND a friendly demeanor are a winning combo to help a customer start their day right. The cold brew coffee tasted balanced and velvety -- not bitter or acidic like at some coffee shops that leave you wondering if it's actually just regular coffee on ice. The Shakshuka (poached egg/kale/tomato/chickpea/feta) breakfast bowl was delicious and filling. Generally I would cast a side of toast aside but even the Starter Bakery levain that came with the dish looked (and was) too good to pass up. Also they were playing music by FKA Twigs and two people working there complimented me on my outfit.", "rating": 5, "date": "2015-12-02"}, {"excerpts": ["The shakshuka, which was recommended to my by a friend, is not available after breakfast. ", "Instead I had the avocado toast, which is pretty good. ", "For some reason they treat it as a breakfast item. ", "Third: I'm from the south, and I don't particularly like my iced tea to taste that floral."], "author": "Nik K.", "review": "Nothing wrong with a good ol' hipster cafe. When I asked how it was pronounced, the guy behind the counter said it was \"ri-Vay\": \"Ri\" as in ribbon and \"vay\" like \"Oy vey!\" Anyway, I'm not a coffee drinker, I come here for the tea. I could see it being kind of annoying, but I actually appreciate the fact that they seep your tea for you (assuming they aren't re-seeping the same leaves after someone else's order.)\nEdit: After going back to try Reveille as an internet cafe, I was annoyed by 3 things: One: Though they clearly encourage people to work on their computers, there are NO outlets. Once your computer runs out (very quickly for mine) then you'll have to move on. Two: The shakshuka, which was recommended to my by a friend, is not available after breakfast. Instead I had the avocado toast, which is pretty good. For some reason they treat it as a breakfast item. Third: I'm from the south, and I don't particularly like my iced tea to taste that floral.", "rating": 3, "date": "2015-01-01"}], "vegetable frittata": [], "prosciutto frittata": [], "biscuit with butterjam": [], "yogurtgranola": [], "chia seed pudding bowl": [], "brle grapefruit": [], "prosciuttopoachedegg": [], "peanut butterjelly": [], "egg": [{"excerpts": ["I came here for breakfast one weekend morning and had the \"Shakshuka,\" a bold breakfast item that consisted of a poached egg that was swimming in chickpeas, some spicy tomato sauce, which I think had some jalapenos even, although my memory is a bit fuzzy. ", "Let me just say that the Shakshuka and coffee did not go together like two peas in a pod. ", "Next time, I'd probably opt for the more traditional breakfast sandwich (which looks delicious from the pictures), but I did enjoy all the flavors of the Shakshuka", "; it was great to try it once, but it just felt weird eating something like that for breakfast with a hot cup of coffee. "], "author": "Alex L.", "review": "It's a modern style coffee bar in the heart of the Castro district. I came here for breakfast one weekend morning and had the \"Shakshuka,\" a bold breakfast item that consisted of a poached egg that was swimming in chickpeas, some spicy tomato sauce, which I think had some jalapenos even, although my memory is a bit fuzzy. I also had one of their very smooth and strong cups of coffee.\n\nLet me just say that the Shakshuka and coffee did not go together like two peas in a pod. Next time, I'd probably opt for the more traditional breakfast sandwich (which looks delicious from the pictures), but I did enjoy all the flavors of the Shakshuka; it was great to try it once, but it just felt weird eating something like that for breakfast with a hot cup of coffee. Guess I'm just not used to it.\n\nA+ gold star for myself for a healthy choice though! I enjoyed the atmosphere here, especially in the morning with the electronic music playing; felt like I was in a fancy hotel lobby or something..ha.", "rating": 4, "date": "2018-08-29"}, {"excerpts": ["I had the avocado toast here the other day with a fried egg. ", "It was lackluster PRIMARILY because of the toast. ", "It was far too stiff and crunchy, which, with how it was served, made it very difficult to eat (had to cut it with fork and nice because of the fried egg). ", "Mind you, the presentation was beautiful. ", "It came out on a black chunk of wood. ", "So hip. ", "Ya know how we do in SF. ", "Good amount of avocado and the fried egg was perfectly cooked. ", "That's my only qualm. ", "Wouldn't order the avocado toast here again but DEFINITELY would come here for coffee. ", "Often."], "author": "Amy T.", "review": "Reveille is an adorable coffee shop. There's a gorgeous outdoor seating area that's literally covered in leaves and whatnot from trees (it's even prettier when the flowers are blooming!). Great spot for people watching or doing some work. There's ample seating indoors too. It's a hip establishment serving up delicious coffee, and the staff are super friendly as well! \n\nI've tried a few items from Reveille. The coffee is pretty great! Not the best I've ever had, but it's a solid cup of joe. I've also had soy cappuccinos from here and they're delicious as well -- strong but not overwhelming. I had the avocado toast here the other day with a fried egg. It was lackluster PRIMARILY because of the toast. It was far too stiff and crunchy, which, with how it was served, made it very difficult to eat (had to cut it with fork and nice because of the fried egg). Mind you, the presentation was beautiful. It came out on a black chunk of wood. So hip. Ya know how we do in SF. If the toast was served on a different type of bread or better bread ya know, it would be perfect. Good amount of avocado and the fried egg was perfectly cooked. That's my only qualm. Wouldn't order the avocado toast here again but DEFINITELY would come here for coffee. Often.", "rating": 4, "date": "2017-12-24"}, {"excerpts": ["The breakfast sandwich was pretty darn good and it looked fancy with the egg baked into the bread and all. \n\n"], "author": "Paul L.", "review": "Hey Reveille,\n\nSo I was looking for something for breakfast.\nSomething to jump start my day of work.\nSomething quick, something simple but also something good and somewhat hearty.\n\nThen I saw you. So I went. The Reveille Breakfast Sandwich looked pretty good so I ordered.\n\nIt was pricey, more than i was hoping to pay for my morning meal, but hey it was my first time with you so just this once and...\n\nThe breakfast sandwich was pretty darn good and it looked fancy with the egg baked into the bread and all. \n\nUnfortunately I can only speak to your sandwich because that's all I ordered this time. Yea I didn't order coffee. I know I am an evil human being. Next time I promise! Decor was nice, simple, quaint. I'll visit again soon.", "rating": 3, "date": "2017-07-19"}, {"excerpts": ["I also like their salads and egg sandwiches."], "author": "Parastoo E.", "review": "I love their breakfast and tea.  My favorite is the avocado on toast or their peanut butter and nutela with bananas on top.   I also like their salads and egg sandwiches.", "rating": 5, "date": "2018-07-18"}, {"excerpts": ["We ordered the Biscuit with house made jam, Avocado toast, and Egg sandwich. ", "First let me applaud them on the portions of avocado. ", "I actually, truly, enjoyed eating avocado with my meal and not having just a taste like every other place teases you with. \n", "Our two Cappuccino's were also incredible. ", "The taste was just enough to wake me up and not too strong where I couldn't finish it. ", "The design also had me taking pictures. \n", "Keep doing what you're doing, you've got a happy customer in me."], "author": "Nicole A.", "review": "Intimate, quiet, cozy, and great vibes. We ordered the Biscuit with house made jam, Avocado toast, and Egg sandwich. First let me applaud them on the portions of avocado. I actually, truly, enjoyed eating avocado with my meal and not having just a taste like every other place teases you with. \nOur two Cappuccino's were also incredible. The taste was just enough to wake me up and not too strong where I couldn't finish it. The design also had me taking pictures. \nKeep doing what you're doing, you've got a happy customer in me.", "rating": 5, "date": "2017-07-27"}, {"excerpts": ["I opted for that nice nectarine danish... but another time, I might go for one of those exciting egg sandwiches or something sensational from their mesmerizing menu! \n\n"], "author": "Cassandra E.", "review": "Oh, pretty little cappuccino, you make my heart sing! \n\nI just love, love, love it when there is a caring, fancy, possible coffee snob, throwin' down some precious gifts of coffee and steamed milk for coffee feen/lovers/fanatics like me! \n\nYou can get your fancy cappuccino, latte or whatever kind of coffee you happen to be craving here, along with a variety of breakfast items. I opted for that nice nectarine danish... but another time, I might go for one of those exciting egg sandwiches or something sensational from their mesmerizing menu! \n\nCan't wait to return... YUM.", "rating": 5, "date": "2016-08-26"}, {"excerpts": ["I've heard tell of the fabulous Avocado Toast ($4.50/$6.50 with fried egg) and Shakshuka, a pricey poached egg with roasted tomato and chickpea ($11).\n\n"], "author": "Ed U.", "review": "Compared to the cacophony of the Columbus Avenue location where United Nations delegations pass through at alarming rates, this Réveille has a downright low-key vibe, and this is the Castro for Harvey's sake. It may be because I was here a half-hour before closing when all the overly caffeinated hipsters were already in rehab shelters for the night. I liked the look of the place with the front patio made for serious gawking and the neo-vintage cross-hatch wallpaper and faux-firewood accent wall made for the interior decorator in all of us (photo: http://bit.ly/1IlDYeL). I've heard tell of the fabulous Avocado Toast ($4.50/$6.50 with fried egg) and Shakshuka, a pricey poached egg with roasted tomato and chickpea ($11).\n\nBut alas, I never think about having an actual meal at Réveille, but I'll fix that misconception at some point. In the meantime, I decided to saunter in after a hearty bowl of Spicy Oxtail Pho at Mekong Kitchen across the street. There were only two laptoppers in the place, so I had plenty of choice as to where to sit. The $4.50 Mocha calmed my fiery digestive system in no time at all (photo: http://bit.ly/1OMqyMB). The Newbury brothers, Tommy and Chris, started Réveille in a delivery truck five years ago, and while they're not yet in the same playpen as Philz or Blue Bottle, I like the richness and finishing style they display with their coffee. Besides, they're not nearly as pretentiously elitist as they are at Sightglass. Oh no, he didn't. Oh yeah, I went there.\n\nCOFFEE - 4 stars...silky goodness in that mocha\nAMBIANCE - 3.5 stars...the trendiness comes off as trendy but somehow it works\nSERVICE - 3.5 stars...nicer than anyone at Sightglass\nTOTAL - 4 stars...give it up for the Traveling Newburys", "rating": 4, "date": "2015-08-03"}, {"excerpts": ["Avocado, egg, and coffee. ", "Throw in a cute little shop with a cool ambience and friendly workers. ", "What else do you need? ", "There egg in a hole toast sandwich thing (actually just called egg sandwich) was super filling and delicious. ", "It had bacon, braised kale and leek, and gruyere. ", "The bread is toasted to perfection and the top piece of bread has an egg in it. "], "author": "Maleah M.", "review": "Avocado, egg, and coffee. Throw in a cute little shop with a cool ambience and friendly workers. What else do you need? When you walk into Reveille (reh-vay) coffee co, it gives you that feeling like you just found a good one. \n\nI don't know what it is about avocado toast that makes it so amazing. Yes I could just make it at home, but eating it at a cute shop is always better! There egg in a hole toast sandwich thing (actually just called egg sandwich) was super filling and delicious. It had bacon, braised kale and leek, and gruyere. The bread is toasted to perfection and the top piece of bread has an egg in it. So much simplicity going on, but so good.\n\nOnly downside would be parking and space to sit. It gets crowded so you may have to stalk people to get a table.", "rating": 5, "date": "2015-07-31"}, {"excerpts": ["You can also add a fried egg (I do) for an additional $2\n\n\n"], "author": "Candice G.", "review": "The avocado toast. \nIt's so simple, but so good. \nIt's so simple that it's actually kind of dumb how fantastic it is. \nIt's so simple that I fooled myself into thinking I could recreate it at home. \nI was wrong. \nSo very, very wrong. \nEverything I make looks like cat food. \n\n\nIngredients: Avocado, Salt + Pepper, Olive Oil, Acme Levain\nIt's $4.50.\nYou can also add a fried egg (I do) for an additional $2\n\n\nThis place is within' a downhill walk from my best friend's place.\nPerfect for those sudzy nights where I need to couch crash. \nEven better for those hungover mornings where calories and single-stall bathroom with a good flush are necessary.\nThey have great coffee here.\nSo great that even a person like me who appreciates creamer more than coffee can stomach it black. \nThough their iced tea is pretty on point and far better for the hangover curing process than a mimosa. \n\n\nThey have a few tables inside and a really nice, sunny patio.\nIt's super casual.\nOrder at the counter, wait with your number, then get brought back to life with this delicious dish. \nOne day I'll get something else here.\nLooking at you Shakshuka.\nBut until then, avocado toast dreams all the way.", "rating": 5, "date": "2015-06-22"}, {"excerpts": ["They have excellent coffee, delicious hipster egg dishes on artisanal bread, and decent wifi. ", "Prices aren't cheap, but what is in SF?  ", "It's especially popular on weekends, but pretty easy to find a seat mid-week."], "author": "Rachel R.", "review": "They have excellent coffee, delicious hipster egg dishes on artisanal bread, and decent wifi. Prices aren't cheap, but what is in SF?  It's especially popular on weekends, but pretty easy to find a seat mid-week.", "rating": 4, "date": "2016-08-02"}, {"excerpts": ["Next time will add the egg to the toast!"], "author": "Tyler G.", "review": "Really enjoyed the atmosphere - great location. Avocado toast was so flavorful and the orange juice was fresh squeezed. Great cappuccino as well. Next time will add the egg to the toast!", "rating": 5, "date": "2017-05-29"}, {"excerpts": ["I ordered the avocado toast (without the fried egg this time, but count me in on my next visit!) and a capp. ", "The coffee was good, and the food was even better. ", "I saw a dad cut a pastry in half for his daughters, and I have to say that I'm also looking forward to ordering some sugar behind the glass case."], "author": "Natasha P.", "review": "I wish my garage was this chic. Surprisingly bright and cozy, black and white Moroccan tiling, tables and stools perfect for some company or going solo. There's also some outdoor space in the front - perfect for people watching. \n\nI ordered the avocado toast (without the fried egg this time, but count me in on my next visit!) and a capp. The coffee was good, and the food was even better. I saw a dad cut a pastry in half for his daughters, and I have to say that I'm also looking forward to ordering some sugar behind the glass case.", "rating": 4, "date": "2014-12-07"}, {"excerpts": ["I came here with my friend on a Saturday morning and we got two cold brews, an avocado toast with a fried egg, and yogurt with granola. ", "The cold brews were great - not too acidic. ", "The avocado toast had good bread and the egg was also cooked nicely. ", "I don't even like eggs normally, but my friend insisted on protein and toast to nurse my hangover. ", "My friend's yogurt was super filling - big bowl with lots of granola and fruit. "], "author": "Steph V.", "review": "A great coffee shop in the Castro! I came here with my friend on a Saturday morning and we got two cold brews, an avocado toast with a fried egg, and yogurt with granola. The cold brews were great - not too acidic. The avocado toast had good bread and the egg was also cooked nicely. I don't even like eggs normally, but my friend insisted on protein and toast to nurse my hangover. My friend's yogurt was super filling - big bowl with lots of granola and fruit. Also sheep's milk yogurt is used and is very good.\n\nGreat ambiance - super chill baristas, crowd of people, and fun music. People were here doing work, catching up with friends, or just grabbing coffee on the go. \n\nWill be back for sure!", "rating": 4, "date": "2015-10-24"}, {"excerpts": ["I got the avocado toast with a fried egg on top. ", "Delicious! ", "I know it's something I can make at home myself ", "but it was reasonably priced and something healthy. ", "I've also gotten the prosciutto and poached egg, bruleed grapefruit, and the cheddar biscuit. "], "author": "Nina Y.", "review": "My friend has enjoyed this place so I decided to finally check this place out. Figured I should support some local restaurant especially places with good food and coffee. \n\nThe first time I went I got the avocado toast with a fried egg on top. Delicious! I know it's something I can make at home myself but it was reasonably priced and something healthy. I also got the black iced tea which was great for the warm days in SF. \n\nI've also gotten the prosciutto and poached egg, bruleed grapefruit, and the cheddar biscuit. I'll definitely say I'm in love with a biscuit.  \n\nDelicious food and very enjoyable.  People are nice and a great area to hang out (inside or out) and grab some great food. \n\nProtip: find a place to sit and grab some food.", "rating": 4, "date": "2015-10-06"}, {"excerpts": ["The gruyere, kale, bacon and egg sandwich is particularly satisfying and is now my ideal breakfast sandwich. "], "author": "Esther A.", "review": "In addition to their great coffee I love that they have a full kitchen with an excellent menu offering up very nice options that I've ever seen in a coffee shop. The gruyere, kale, bacon and egg sandwich is particularly satisfying and is now my ideal breakfast sandwich. The avocado toast was also very nice.\n\nI felt like we stepped into some cafe somewhere in Scandinavia. The inside decor had a slight retro vibe and the outdoor seating offers a nice hangout spot; perfect for people watching whether sunny or gloomy out. Also the staff are quick and efficient to boot. \n\nA great addition to the neighborhood.", "rating": 5, "date": "2014-03-02"}, {"excerpts": ["+ poached egg that cost $6.50 and made my heart cry. "], "author": "Carolyn F.", "review": "5 stars for cold brew so yummy\n1 star for the sad imitation of avocado toast + poached egg that cost $6.50 and made my heart cry. The avocado barely hung on to the disappointingly thin piece of toast.\n\nCute space. Most people in workout clothes on a Sat morning.", "rating": 3, "date": "2015-05-27"}, {"excerpts": ["Their egg is on top of the sandwich! ", "They also have brûlée grapefruit which was super refreshing and topped with candied kumquat (amazing!!). ", "Definitely my go to spot in SF"], "author": "Erica C.", "review": "My favorite coffee shop in SF! I love their environment, decor, amazing coffee and delicious food. I'm usually picky about coffee but this place just has the best beans! I got an almond milk latte and couldn't stop drinking it. For brunch, I ordered their breakfast sandwich which is the best breakfast sandwich that I've ever had! Not too oily and extremely flavorful. Their egg is on top of the sandwich! They also have brûlée grapefruit which was super refreshing and topped with candied kumquat (amazing!!). Definitely my go to spot in SF", "rating": 5, "date": "2016-05-26"}, {"excerpts": ["My favorite is the avocado toast with an egg on top."], "author": "Larry R.", "review": "Great coffee, excellent and friendly service.  The food is quite good as well.  My favorite is the avocado toast with an egg on top.", "rating": 5, "date": "2016-12-13"}, {"excerpts": ["The avocado toast and egg sandwich were very good."], "author": "Jen G.", "review": "This was a very spacious place to grab a nice cup of coffee and a light breakfast. The avocado toast and egg sandwich were very good.", "rating": 4, "date": "2016-06-24"}, {"excerpts": ["and I both got the egg sandwich and both thought it was delicious. ", "The sauce was so delicious, and really makes it stand out from other sandwiches. ", "It was the perfect place to grab a quick breakfast while staying nearby. ", "If I'm ever back, I'll certainly try this place again."], "author": "Elizabeth T.", "review": "Came here while visiting from out of town. My boyfriend and I both got the egg sandwich and both thought it was delicious. The sauce was so delicious, and really makes it stand out from other sandwiches. It was the perfect place to grab a quick breakfast while staying nearby. If I'm ever back, I'll certainly try this place again.", "rating": 5, "date": "2017-05-21"}, {"excerpts": ["And then I saw it; avocado toast, with optional egg...suddenly the air was filled with Ludwig van and I swear next time I'll take photos, but not today...gone too soon.\n\n"], "author": "William M.", "review": "Having walked by dozens of times, I began to look for happy faces on the patio, and there they were! Bunches of them, happy people eating and drinking. That's always the best advert a biz can have, so in I went today.\n\nChill vibe, not over caffinated or anything like that, and the menu was interesting. And then I saw it; avocado toast, with optional egg...suddenly the air was filled with Ludwig van and I swear next time I'll take photos, but not today...gone too soon.\n\nAnd with a Dirty Chai (featuring that all time fave Espresso Shot), I'm one happy fellah!\n\nEnjoy!", "rating": 4, "date": "2015-05-07"}, {"excerpts": ["Love the avocado toast with a poached egg and the frittatas are perfect 'on the go' treats. ", "Nice cozy comfy neighborhood spot."], "author": "Doug L.", "review": "Hidden gem. Great coffee with even better fresh breakfast snacks. Love the avocado toast with a poached egg and the frittatas are perfect 'on the go' treats. Nice cozy comfy neighborhood spot.", "rating": 5, "date": "2016-12-28"}, {"excerpts": ["For breakfast food you can't go wrong with the egg sandwich, the toast with egg and avocado or the perfectly crispy biscuit and jam. \n\n"], "author": "Nikki M.", "review": "I tried really hard to hate on this place because there's so much damn coffee in the Castro (and now even more) but I caved. First of all, their patio is almost always in the sun and there's a nook my mutt just loves to curl up in for sunbathing while we sip. I'm a big fan of the ice lattes and cold brew and the staff is really great. We've since been in a lot and I appreciate how they always seem to go the extra mile (even if my husband heard my order wrong and told them the wrong thing or when our ticket gets lost and there's a bit of a delay). For breakfast food you can't go wrong with the egg sandwich, the toast with egg and avocado or the perfectly crispy biscuit and jam. \n\nCongratulations, Reveille you won over this little hater.", "rating": 4, "date": "2015-01-03"}, {"excerpts": ["Delicious Haas avocado on levain toast with fried egg, salt and pepper and olive oil for the win. ", "So simple, yet so amazing. ", "You may think it is simple enough to recreate at home, but they are so good at making perfect toast and deciphering avocado peak ripeness. ", "I could eat avocado toast with or without fried egg for breakfast, lunch and dinner, especially with Kayla Itsines' army of bbg girls instagramming lovely pics of avocado toast. ", "Great coffee, too. ", "A friend who lived in the neighborhood introduced me to this place. ", "He knows my style, and I was definitely happy with the menu offerings, tasty food and hip setting."], "author": "Liv K.", "review": "Delicious Haas avocado on levain toast with fried egg, salt and pepper and olive oil for the win. So simple, yet so amazing. You may think it is simple enough to recreate at home, but they are so good at making perfect toast and deciphering avocado peak ripeness. I could eat avocado toast with or without fried egg for breakfast, lunch and dinner, especially with Kayla Itsines' army of bbg girls instagramming lovely pics of avocado toast. Great coffee, too. A friend who lived in the neighborhood introduced me to this place. He knows my style, and I was definitely happy with the menu offerings, tasty food and hip setting.", "rating": 5, "date": "2015-09-23"}, {"excerpts": ["I was not a fan of the egg sandwich because it seemed greasy, but I liked that the egg wasn't scrambled.  \n", "Prosciutto sandwich is good."], "author": "Chelsea D.", "review": "Good coffee. Kinda neat little location.  Sunny seating in the morning.  I was not a fan of the egg sandwich because it seemed greasy, but I liked that the egg wasn't scrambled.  \nProsciutto sandwich is good.", "rating": 4, "date": "2016-04-16"}, {"excerpts": ["Ordered an avocado toast with egg and a dirty chai and spent 2 lovely hours here on a weekday morning (not sure how packed it gets on the weekends, but it wasn't hard to get a table when I went). ", "Food was yummy, but not extraordinary. ", "I've definitely made the same thing at home myself. ", "I'd love to try their breakfast sandwich next time, though!"], "author": "Kathy L.", "review": "Great space to spend a relaxing morning. Ordered an avocado toast with egg and a dirty chai and spent 2 lovely hours here on a weekday morning (not sure how packed it gets on the weekends, but it wasn't hard to get a table when I went). Food was yummy, but not extraordinary. I've definitely made the same thing at home myself. I'd love to try their breakfast sandwich next time, though!", "rating": 3, "date": "2014-12-26"}, {"excerpts": ["I had the egg sandwich and a latte. ", "The freshness and taste were great. ", "I look forward to going again soon."], "author": "Luis C.", "review": "I was walking by this location and the decor drew me in. I received excellent service from the order taking to the quality of the food. I had the egg sandwich and a latte. The freshness and taste were great. I look forward to going again soon.", "rating": 5, "date": "2016-11-09"}, {"excerpts": ["Also had the avocado toast + fried egg. ", "The egg was cooked perfectly. "], "author": "Amy O.", "review": "Perfect little meal + coffee after Sunday morning Farmer's Market.\n\nGreat cappuccino - and the barista was super nice.\n\nAlso had the avocado toast + fried egg. The egg was cooked perfectly. Priced perfectly as well. \n\nLike the vibe of the place, the decor is friendly/warm, and the seating lovely. We sat at the counter, and had a warm snack.", "rating": 5, "date": "2014-05-18"}, {"excerpts": ["The sandwich is the first one on the menu - Egg Sandwich w/ Bacon (fried egg, braised kale + leek, and gruyere on Della Fattoria levain). ", "There are two prices $7.50 (egg sandwich) and $9 (w/ bacon). ", "And of course #5 - a soft cooked egg in a hole on top.\n\n"], "author": "Jean K.", "review": "So lucky me when I saw the SFist's best breakfast sandwich list (http://sfist.com/2014/02/26/the_best_breakfast_sandwiches_and_b.php) and one of the items on the list was at the new Réveille Coffee down the street from me. \n\nFor clarification, even though the 18th St location isn't listed on their website, it's there, it's open and it has the exact same menu. Breakfast until 11:30 but you can get takeaway and essentially make the breakfast sandwich your lunch, as I did because I can't ever get up early enough to have that big of a breakfast followed by a lunch.\n\nThe sandwich is the first one on the menu - Egg Sandwich w/ Bacon (fried egg, braised kale + leek, and gruyere on Della Fattoria levain). There are two prices $7.50 (egg sandwich) and $9 (w/ bacon). Not as apparent as they might have thought because I had to ask. \n\nI have to admit, when I opened the takeaway box and saw a plain looking sandwich I was a little disappointed. It just looked so plain. It looks exactly like the photos so I didn't feel tricked, I think I just wasn't paying attention. However one bite and my mind was blown. Such attention to detail really made an amazing sandwich. #1 - the slices of bread were toasted/grilled with butter/olive oil on both sides before being assembled into a sandwich. #2 - the bacon was perfectly cooked to crispy without being burnt. #3 - they use some quality gruyere because it had a whiff of that stinky funky cheese smell. I kept sniffing like what's that smell then realized it was the cheese. #4 - the cheese was melted into the kale and leeks while the bacon was kept crispy. And of course #5 - a soft cooked egg in a hole on top.\n\nSeriously good breakfast sandwich and it's so close to me! I'd put it up right up there with my other favorite breakfast sandwich at Devil's Teeth Baking.\n\nPS This is a small place and by the time i showed up at 11:15 all the tables were taken with (surprise surprise) people on laptops leaving just the outside tables and inside bar free. Though that's fine with me it felt a little weird to be the only person eating there so I got mine to go.", "rating": 5, "date": "2014-03-08"}, {"excerpts": ["Was bummed that I didn't make it in time for the egg breakfast sandwich, so I settled with the turkey sandwich which was delicious! ", "It also comes with a side of green with this lemony dressing that I loved. ", "I also had the cappuccino, but it was nothing special."], "author": "Yanni C.", "review": "Was bummed that I didn't make it in time for the egg breakfast sandwich, so I settled with the turkey sandwich which was delicious! It also comes with a side of green with this lemony dressing that I loved. I also had the cappuccino, but it was nothing special.", "rating": 4, "date": "2016-03-12"}, {"excerpts": ["Food: ordered the egg sandwich WITH bacon. ", "It was 9 bucks with BACON. ", "Shocking (not shocking) ", "when I finally got to eating it having took it out, there was no bacon added to the sandwich.", "So I paid 9 bucks for two pieces of toast with the middle cut out for an egg and spinach . ", "NOT EVEN CHEESE!Get ", "your bs together ", ", you're not that dope"], "author": "Lauren V.", "review": "I would usually go to Philz across the street because it's consistently awesome, but it is the day after Turkey death and was overpacked. I had been walking by this spot for a few months and was meaning to try it , and it didn't look too bad so I went for it.\n\nCoffee: pretty good. \nService: register person super friendly, barista squad I didn't like the aura I peeped on you all . \nFood: ordered the egg sandwich WITH bacon. It was 9 bucks with BACON. Shocking (not shocking) when I finally got to eating it having took it out, there was no bacon added to the sandwich.So I paid 9 bucks for two pieces of toast with the middle cut out for an egg and spinach . NOT EVEN CHEESE!Get your bs together , you're not that dope", "rating": 2, "date": "2014-11-28"}, {"excerpts": ["Had the avocado, egg and a latte. ", "Breakfast was extremely average. ", "Can't complain about bad food but it was nothing to rave about. ", "Sat down and there was no sugar on the table. ", "It was put at a station that was out by the door. ", "Then, the latte is served in a Cappuccino cup, rather than a latte glass. ", "If this is a place that raves about its coffee and wants to be known for its coffee, then serve it right. ", "I'd like to try the other location before coming to a final decision of whether i'd go back or not."], "author": "Van-Anh N.", "review": "I came here with high hopes because of the raving reviews from everyone. Had the avocado, egg and a latte. Breakfast was extremely average. Can't complain about bad food but it was nothing to rave about. Sat down and there was no sugar on the table. It was put at a station that was out by the door. Then, the latte is served in a Cappuccino cup, rather than a latte glass. If this is a place that raves about its coffee and wants to be known for its coffee, then serve it right. I'd like to try the other location before coming to a final decision of whether i'd go back or not.", "rating": 3, "date": "2015-09-23"}, {"excerpts": ["Their egg sandwich and mocha were delicious. ", "So glad we got to try it before we left. ", "Give them a try if you are in the area."], "author": "Angelie S.", "review": "On our trip to San Francisco in November, we tried Reveille Coffee Co. It was our last day in the City so this was our last stop on the way to the airport. It was pouring that morning so before we headed to the airport we wanted warm coffee and breakfast. With packed bags we show up to Reveille Coffee and it did not disappoint. This place was cozy and warm. Their egg sandwich and mocha were delicious. So glad we got to try it before we left. Give them a try if you are in the area.", "rating": 4, "date": "2016-01-22"}, {"excerpts": ["I like the avocado toast and the \"egg-in-a-hole\" breakfast open-face sandwich.  \n\n"], "author": "Matt Y.", "review": "I have been to the Castro location a few times and the staff has always been friendly. It is located in the downstairs of a building with a little front patio overlooking 18th Street. \n\nThe latte has pretty latte art but the coffee is too acidic for my liking. Have tried latte on a few occasions and the coffee is acidic. Food is the highlights at Reveille. Simple and healthy. I like the avocado toast and the \"egg-in-a-hole\" breakfast open-face sandwich.  \n\nAmbiance is great. Relaxing and comfy, but laptop people hog up most of the tables. I would come here early before they get there and enjoy the morning.", "rating": 3, "date": "2014-07-07"}, {"excerpts": ["The food here is great, they have an amazing breakfast sandwich with an egg cooked into the bread, it'd definitely worth trying.  ", "Though they do have some quick pastries to go here, they often times seem to run out of these so don't expect to really find any in the evening."], "author": "Bryson L.", "review": "Great coffee and food, I only wish they had a bit more seating available. It definitely seems like a place where people just come by and occupy the seating for hours.  But the coffee and food are great.  The baristas really seem to know what they're doing.  The food here is great, they have an amazing breakfast sandwich with an egg cooked into the bread, it'd definitely worth trying.  Though they do have some quick pastries to go here, they often times seem to run out of these so don't expect to really find any in the evening.", "rating": 4, "date": "2015-01-09"}, {"excerpts": ["And so is the food: my toast with the real-deal jam was over the moon amazing, and my girlfriend's breakfast sandwich with a perfect egg also incredible.\n\n"], "author": "Diane B.", "review": "yummy yum yum: here's an example where the pomp of hand dripped coffee pays off. It's good! And so is the food: my toast with the real-deal jam was over the moon amazing, and my girlfriend's breakfast sandwich with a perfect egg also incredible.\n\nIt's super close and sadly always crowded. Because it's GOOD!", "rating": 4, "date": "2015-01-16"}, {"excerpts": ["I had a Bacon and Kale Sandwich with a sunny side egg that really hit the spot. ", "There are other options like Creme Brulee Grapefruit, Avacado Toast, and Spinach Egg Scramble which I will need to try. ", "It's an awesome place to chill as they have bar, outdoor, and bench seating. ", "Great music, friendly staff, and comfy interior design round up this 5 star establishment. ", "Try it out!"], "author": "Charlie L.", "review": "Hip is the last word that comes to mind whenever I think of an establishment in the Castro but that's exactly what Reveille Coffee is. A great addition to the neighborhood, Reveille offers Four Barrel coffee but really separates itself with its fantastic breakfast and lunch options. I had a Bacon and Kale Sandwich with a sunny side egg that really hit the spot. There are other options like Creme Brulee Grapefruit, Avacado Toast, and Spinach Egg Scramble which I will need to try. It's an awesome place to chill as they have bar, outdoor, and bench seating. Great music, friendly staff, and comfy interior design round up this 5 star establishment. Try it out!", "rating": 5, "date": "2014-02-16"}, {"excerpts": ["Heard great things about the avocado and egg toast, just wasn't feeling it this morning. ", "I may come back to try that, as it has raving reviews!"], "author": "Victoria O.", "review": "Ordered the dirty chai as recommended from fellow yelpers. Crazy spice bomb. Awesome flavors, yet a little on the watery side. Which it was a little bit more creamy. Decided on the peanut butter and toast to accompany it. Decent, but The Mill doesn't have anything to worry about. Considering they are both $4 save your money for the next time you are on Divis. Heard great things about the avocado and egg toast, just wasn't feeling it this morning. I may come back to try that, as it has raving reviews!", "rating": 4, "date": "2014-07-23"}, {"excerpts": ["(I wanted the avocado toast with egg but breakfast had just ended).  \n\n"], "author": "Lynn S.", "review": "Stopped in around 11:30 one weekday morning by myself, and loved the design and bustling atmosphere and menu.  I had the BLAP (like a BLT with pear and avocado) and really enjoyed it (I wanted the avocado toast with egg but breakfast had just ended).  \n\nI hate to be that person, but I wish they'd limit the free wifi.  I barely found a place to sit because every spot had someone camped out with their laptop.  There's a long row of tables for two, and each table had just one person ... and their laptop.  Or maybe they could add a communal table for folks with laptops.  I'll definitely be back, but I'm not looking forward to the seating situation.", "rating": 4, "date": "2015-11-16"}, {"excerpts": ["Had the Egg and Avocado on Toast for breakfast, then stuck around for lunch and had the Kale salad. ", "Kale, eggs, and avo are pretty much my favorite foods, so this place is heaven sent :)) "], "author": "K C.", "review": "My hunt for the ultimate coffee shop continues, and so far, Reveille is in the lead :D I've been a Philz phanatic for years, but sometimes I really just need a latte. Wandered down the street to find this place. Not only are the lattes here top notch, but they have the PERFECT breakfast/lunch menu. Had the Egg and Avocado on Toast for breakfast, then stuck around for lunch and had the Kale salad. Kale, eggs, and avo are pretty much my favorite foods, so this place is heaven sent :)) Not to mention the super friendly, non-pretentious staff and great chill music selection.\n\n I've spent about three hours here now, and moving to the Castro has crossed my head multiple times :P", "rating": 5, "date": "2014-03-30"}, {"excerpts": ["Avocado, bacon & egg open-faced breakfast toast was fresh and tasty.  ", "Chia pudding topped with fresh fruit was overpriced yet pleasant and mild."], "author": "Anne J.", "review": "Small, low-key, and quality-conscious.  Pleasant staff.  Robust house coffee.\n\nIt's OK that it's a limited menu - they did a good job of our two meals.\n\nAvocado, bacon & egg open-faced breakfast toast was fresh and tasty.  Chia pudding topped with fresh fruit was overpriced yet pleasant and mild.", "rating": 4, "date": "2016-01-02"}, {"excerpts": ["The Shakshuka (poached egg/kale/tomato/chickpea/feta) breakfast bowl was delicious and filling. ", "Generally I would cast a side of toast aside but even the Starter Bakery levain that came with the dish looked (and was) too good to pass up. ", "Also they were playing music by FKA Twigs and two people working there complimented me on my outfit."], "author": "Kyle L.", "review": "Good coffee, food, music AND a friendly demeanor are a winning combo to help a customer start their day right. The cold brew coffee tasted balanced and velvety -- not bitter or acidic like at some coffee shops that leave you wondering if it's actually just regular coffee on ice. The Shakshuka (poached egg/kale/tomato/chickpea/feta) breakfast bowl was delicious and filling. Generally I would cast a side of toast aside but even the Starter Bakery levain that came with the dish looked (and was) too good to pass up. Also they were playing music by FKA Twigs and two people working there complimented me on my outfit.", "rating": 5, "date": "2015-12-02"}, {"excerpts": ["Breakfast sandwich with egg and avocado on freshly made toast was delicious and served quickly.\n\n"], "author": "Roxanne D.", "review": "Hip spot with morning sunshine and some outdoor seating, serving breakfast til 1 pm. I love breakfast sandwiches  - which makes for a great crossover menu item if you are looking for lunch early, as I was today. Breakfast sandwich with egg and avocado on freshly made toast was delicious and served quickly.\n\nAwesomely courteous and attentive staff. It's President's Day, and he toasted to a woman prez, coming soon to a country near us! Me and my friend appreciated the woman shout out.\n\nFamily-friendly too.", "rating": 5, "date": "2014-02-17"}, {"excerpts": ["Avocado toast is delicious, the egg sandwich beautifully constructed. ", "Only missing one star for the dearth of outlets!"], "author": "Emily R.", "review": "Love the ambiance,  strong coffee & strong wifi. Avocado toast is delicious, the egg sandwich beautifully constructed. Only missing one star for the dearth of outlets!", "rating": 4, "date": "2014-07-09"}, {"excerpts": ["Their egg/bacon/kale sandwich is delicious too. ", "Cute and comfortable locale."], "author": "Shahrzad K.", "review": "This place is quite pricey for coffee, but, hands down, they've got the best almond milk cappuccino I've had in the city. Their egg/bacon/kale sandwich is delicious too. Cute and comfortable locale.", "rating": 4, "date": "2014-11-02"}, {"excerpts": ["Egg sandwich is amazing! ", "But expect to wait a long time if you ordered breakfast. ", "Two times in a row I had to go back to the kitchen to check on my order after waiting for more than 15 mins."], "author": "Shelly H.", "review": "Great coffee!! Egg sandwich is amazing! But expect to wait a long time if you ordered breakfast. Two times in a row I had to go back to the kitchen to check on my order after waiting for more than 15 mins.", "rating": 3, "date": "2014-09-29"}, {"excerpts": ["I didn't have coffee, but the avocado and egg on toast was delicious. ", "The only downside is that the cashier was a little ", "\"yeah, whatever\" and didn't seem too interested in the customers, but as it was a Tuesday morning, I don't blame him."], "author": "Lia R.", "review": "Went here for the first time today with a friend. The prices are shockingly inexpensive for being a hipster place in the middle of the Castro in the US's most expensive city. I didn't have coffee, but the avocado and egg on toast was delicious. The only downside is that the cashier was a little \"yeah, whatever\" and didn't seem too interested in the customers, but as it was a Tuesday morning, I don't blame him.", "rating": 4, "date": "2014-08-12"}, {"excerpts": ["We almost could not focus on our food die to the hotness  try the avocado fried egg breakfast. ", "One thing I do not get is the add on tip when you are paying at the register. ", "But it is a nice spot so enjoy."], "author": "Yaya L.", "review": "This place is super laid back with plenty of locals. Lots of beautiful people. We almost could not focus on our food die to the hotness  try the avocado fried egg breakfast. One thing I do not get is the add on tip when you are paying at the register. But it is a nice spot so enjoy.", "rating": 4, "date": "2014-04-05"}, {"excerpts": ["Enjoyed the hearty egg sandwich here. ", "Also love the service and ambience of the place."], "author": "Xteethx B.", "review": "Enjoyed the hearty egg sandwich here. Also love the service and ambience of the place.", "rating": 5, "date": "2014-03-13"}, {"excerpts": ["Favourite items on the menu are the egg and bacon sandwich, the kale salad with turkey and the flatbreads. \n\n"], "author": "Verne S.", "review": "These guys are great. Good coffee, very tasty food. As a recent Aussie transplant I've been looking for my weekend breakfast spot and Reveille tops the list for me right now. \n\nFavourite items on the menu are the egg and bacon sandwich, the kale salad with turkey and the flatbreads. \n\nOne thing: I wish they had juices. Everything else I am digging. Keep it up!", "rating": 5, "date": "2014-04-06"}, {"excerpts": ["For my breakfast I orderd the egg sandwhich, it was delicious! ", "The bread was amazing, the egg, kale, (and I think cheese was in there) were all very flavorful-it kind of tasted like a quiche. "], "author": "Jena W.", "review": "Just stopped by for my first time this morning for some coffee and breakfast. \n\nVery friendly staff (although for some reason there were ONLY men employees, no women, which was a little weird to me) but despite that they were all very friendly, very beautiful interior design (great ambience, very clean)-they even had a cute ass bathroom.\n\nThe coffee was great, I ordered a latte. I usually like my coffee sweet but I didn't need to add any sugar, the natural flavor of great coffee and milk was just right. For my breakfast I orderd the egg sandwhich, it was delicious! The bread was amazing, the egg, kale, (and I think cheese was in there) were all very flavorful-it kind of tasted like a quiche. My meal cost me $12.\n\nThis place has great coffee and food and a beautiful interior/ambience. This place made me feel classy. If you're ever in the Castro I think you'll have a good experience here.", "rating": 4, "date": "2014-02-14"}, {"excerpts": ["Tried half of the egg breakfast sandwich and half of the avocado toast with egg ", "and they were both very flavorful with perfectly cooked Sunnyside up eggs. ", "This place will definitely be receiving a visit from me in the near future!"], "author": "J M.", "review": "Their iced lattes are anything but watered down. It had the perfect balance and I actually liked it better than the way they make it at four barrel even though they use the same beans. Tried half of the egg breakfast sandwich and half of the avocado toast with egg and they were both very flavorful with perfectly cooked Sunnyside up eggs. This place will definitely be receiving a visit from me in the near future!", "rating": 5, "date": "2014-03-23"}, {"excerpts": ["Had a looked-good-but-just-OK egg sandwich for $7.50, with a cup of black coffee, $11.15 total. ", "Ouch. ", "But OK, it's San Francisco. ", "However, the oddest thing they do is, after they enter your order into their computer screen, they turn the screen towards you and have you then choose a tip amount from three choices on screen. ", "It looked as if it was -$1-$2 ", "-or $3 if you got just a drink, and 15%- 20% -or 25% if you got more than just a drink.  ", "I can't say this for sure, but it's my best guess. ", "And of course everyone in line is watching you, so you don't dare be cheap. ", "This place may be trendy, but not for me."], "author": "J S.", "review": "I was in the City and thought I would try something different. REVEILLE COFFEE looked nice. Long line, must be good. Turned out to be a long line because it was a slow line. I agree with others about the attitude...and so early in the morning. Asked for the wireless password, which turned out to be a phrase with the word \"don't\" in it. I spell don't with an apostrophe. Not them. I asked a second time and got a good dose of the acclaimed attitude. I guess they don't put an apostrophe in don't. Had a looked-good-but-just-OK egg sandwich for $7.50, with a cup of black coffee, $11.15 total. Ouch. But OK, it's San Francisco. However, the oddest thing they do is, after they enter your order into their computer screen, they turn the screen towards you and have you then choose a tip amount from three choices on screen. It looked as if it was -$1-$2 -or $3 if you got just a drink, and 15%- 20% -or 25% if you got more than just a drink.  I can't say this for sure, but it's my best guess. And of course everyone in line is watching you, so you don't dare be cheap. This place may be trendy, but not for me.", "rating": 2, "date": "2014-08-15"}], "inna jam": [], "bread": [{"excerpts": ["If the toast was served on a different type of bread or better bread ", "ya know, it would be perfect. "], "author": "Amy T.", "review": "Reveille is an adorable coffee shop. There's a gorgeous outdoor seating area that's literally covered in leaves and whatnot from trees (it's even prettier when the flowers are blooming!). Great spot for people watching or doing some work. There's ample seating indoors too. It's a hip establishment serving up delicious coffee, and the staff are super friendly as well! \n\nI've tried a few items from Reveille. The coffee is pretty great! Not the best I've ever had, but it's a solid cup of joe. I've also had soy cappuccinos from here and they're delicious as well -- strong but not overwhelming. I had the avocado toast here the other day with a fried egg. It was lackluster PRIMARILY because of the toast. It was far too stiff and crunchy, which, with how it was served, made it very difficult to eat (had to cut it with fork and nice because of the fried egg). Mind you, the presentation was beautiful. It came out on a black chunk of wood. So hip. Ya know how we do in SF. If the toast was served on a different type of bread or better bread ya know, it would be perfect. Good amount of avocado and the fried egg was perfectly cooked. That's my only qualm. Wouldn't order the avocado toast here again but DEFINITELY would come here for coffee. Often.", "rating": 4, "date": "2017-12-24"}, {"excerpts": ["The breakfast sandwich was pretty darn good and it looked fancy with the egg baked into the bread and all. \n\n"], "author": "Paul L.", "review": "Hey Reveille,\n\nSo I was looking for something for breakfast.\nSomething to jump start my day of work.\nSomething quick, something simple but also something good and somewhat hearty.\n\nThen I saw you. So I went. The Reveille Breakfast Sandwich looked pretty good so I ordered.\n\nIt was pricey, more than i was hoping to pay for my morning meal, but hey it was my first time with you so just this once and...\n\nThe breakfast sandwich was pretty darn good and it looked fancy with the egg baked into the bread and all. \n\nUnfortunately I can only speak to your sandwich because that's all I ordered this time. Yea I didn't order coffee. I know I am an evil human being. Next time I promise! Decor was nice, simple, quaint. I'll visit again soon.", "rating": 3, "date": "2017-07-19"}, {"excerpts": ["while the slices look prettier than a mash, mash stays on the bread better."], "author": "Misha T.", "review": "I'm shocked I haven't' reviewed this place because I've gone a ton. They have my favorite ice tea in the city. There's this crazy mint elderflower concoction they got that's incredible. Sadly you'll probably down it in 5 minutes and it's probably too expensive to get two.\n\nI like the avocado toast well enough but while the slices look prettier than a mash, mash stays on the bread better.", "rating": 4, "date": "2017-08-19"}, {"excerpts": ["The bread had crusty texture and superb chew, the chicken was fresh and really juicy, even the side salad was tasty. ", "This is just the kind of modern, albeit pricey, experience I want from the hip Castro."], "author": "Laura G.", "review": "I ate the chicken sandwich (but with green goddess aioli instead of whatever spread it came with) and it was sooooo good. The bread had crusty texture and superb chew, the chicken was fresh and really juicy, even the side salad was tasty. This is just the kind of modern, albeit pricey, experience I want from the hip Castro.", "rating": 5, "date": "2018-06-21"}, {"excerpts": ["The bread is toasted to perfection and the top piece of bread has an egg in it. "], "author": "Maleah M.", "review": "Avocado, egg, and coffee. Throw in a cute little shop with a cool ambience and friendly workers. What else do you need? When you walk into Reveille (reh-vay) coffee co, it gives you that feeling like you just found a good one. \n\nI don't know what it is about avocado toast that makes it so amazing. Yes I could just make it at home, but eating it at a cute shop is always better! There egg in a hole toast sandwich thing (actually just called egg sandwich) was super filling and delicious. It had bacon, braised kale and leek, and gruyere. The bread is toasted to perfection and the top piece of bread has an egg in it. So much simplicity going on, but so good.\n\nOnly downside would be parking and space to sit. It gets crowded so you may have to stalk people to get a table.", "rating": 5, "date": "2015-07-31"}, {"excerpts": ["They have excellent coffee, delicious hipster egg dishes on artisanal bread, and decent wifi. ", "Prices aren't cheap, but what is in SF?  ", "It's especially popular on weekends, but pretty easy to find a seat mid-week."], "author": "Rachel R.", "review": "They have excellent coffee, delicious hipster egg dishes on artisanal bread, and decent wifi. Prices aren't cheap, but what is in SF?  It's especially popular on weekends, but pretty easy to find a seat mid-week.", "rating": 4, "date": "2016-08-02"}, {"excerpts": ["The avocado toast had good bread and the egg was also cooked nicely. ", "I don't even like eggs normally, but my friend insisted on protein and toast to nurse my hangover. ", "My friend's yogurt was super filling - big bowl with lots of granola and fruit. "], "author": "Steph V.", "review": "A great coffee shop in the Castro! I came here with my friend on a Saturday morning and we got two cold brews, an avocado toast with a fried egg, and yogurt with granola. The cold brews were great - not too acidic. The avocado toast had good bread and the egg was also cooked nicely. I don't even like eggs normally, but my friend insisted on protein and toast to nurse my hangover. My friend's yogurt was super filling - big bowl with lots of granola and fruit. Also sheep's milk yogurt is used and is very good.\n\nGreat ambiance - super chill baristas, crowd of people, and fun music. People were here doing work, catching up with friends, or just grabbing coffee on the go. \n\nWill be back for sure!", "rating": 4, "date": "2015-10-24"}, {"excerpts": ["so I can enjoy toasted bread all day, every day, forever. \n\n", "The toasted bread... ", "Was it wheat? ", "Or sourdough? ", "Perhaps it was white bread. ", "So exquisite. ", "And toasted to perfection. ", "The chef really has this skill down. ", "Not too toasted. ", "Not under toasted. ", "But just right. ", "As far as culinary delights are concerned, toast is the new bacon. ", "Or is it the new cupcake?  ", "Or new cronut? ", "Whatever it is, it's nothing less than revolutionary. "], "author": "Jade D.", "review": "How can you say no to five dollar toast!?\n\nSerious!?\n\nSan Diego is really behind the food trends these days. I'm just waiting for a toastery to open down the block so I can enjoy toasted bread all day, every day, forever. \n\nThe toasted bread... Was it wheat? Or sourdough? Perhaps it was white bread. So exquisite. And toasted to perfection. The chef really has this skill down. Not too toasted. Not under toasted. But just right. As far as culinary delights are concerned, toast is the new bacon. Or is it the new cupcake?  Or new cronut? Whatever it is, it's nothing less than revolutionary. Thank you chefs of San Francisco!\n\nAnd the coffee... So stinking good. \nAnd the people watching from the patio is the proverbial 'cherry on top'. What more can you ask?", "rating": 5, "date": "2014-08-05"}, {"excerpts": ["#1 - the slices of bread were toasted/grilled with butter/olive oil on both sides before being assembled into a sandwich. ", "#2 - the bacon was perfectly cooked to crispy without being burnt. ", "#3 - they use some quality gruyere because it had a whiff of that stinky funky cheese smell. ", "I kept sniffing like what's that smell then realized it was the cheese. ", "#4 - the cheese was melted into the kale and leeks while the bacon was kept crispy. "], "author": "Jean K.", "review": "So lucky me when I saw the SFist's best breakfast sandwich list (http://sfist.com/2014/02/26/the_best_breakfast_sandwiches_and_b.php) and one of the items on the list was at the new Réveille Coffee down the street from me. \n\nFor clarification, even though the 18th St location isn't listed on their website, it's there, it's open and it has the exact same menu. Breakfast until 11:30 but you can get takeaway and essentially make the breakfast sandwich your lunch, as I did because I can't ever get up early enough to have that big of a breakfast followed by a lunch.\n\nThe sandwich is the first one on the menu - Egg Sandwich w/ Bacon (fried egg, braised kale + leek, and gruyere on Della Fattoria levain). There are two prices $7.50 (egg sandwich) and $9 (w/ bacon). Not as apparent as they might have thought because I had to ask. \n\nI have to admit, when I opened the takeaway box and saw a plain looking sandwich I was a little disappointed. It just looked so plain. It looks exactly like the photos so I didn't feel tricked, I think I just wasn't paying attention. However one bite and my mind was blown. Such attention to detail really made an amazing sandwich. #1 - the slices of bread were toasted/grilled with butter/olive oil on both sides before being assembled into a sandwich. #2 - the bacon was perfectly cooked to crispy without being burnt. #3 - they use some quality gruyere because it had a whiff of that stinky funky cheese smell. I kept sniffing like what's that smell then realized it was the cheese. #4 - the cheese was melted into the kale and leeks while the bacon was kept crispy. And of course #5 - a soft cooked egg in a hole on top.\n\nSeriously good breakfast sandwich and it's so close to me! I'd put it up right up there with my other favorite breakfast sandwich at Devil's Teeth Baking.\n\nPS This is a small place and by the time i showed up at 11:15 all the tables were taken with (surprise surprise) people on laptops leaving just the outside tables and inside bar free. Though that's fine with me it felt a little weird to be the only person eating there so I got mine to go.", "rating": 5, "date": "2014-03-08"}, {"excerpts": ["The food here is great, they have an amazing breakfast sandwich with an egg cooked into the bread, it'd definitely worth trying.  ", "Though they do have some quick pastries to go here, they often times seem to run out of these so don't expect to really find any in the evening."], "author": "Bryson L.", "review": "Great coffee and food, I only wish they had a bit more seating available. It definitely seems like a place where people just come by and occupy the seating for hours.  But the coffee and food are great.  The baristas really seem to know what they're doing.  The food here is great, they have an amazing breakfast sandwich with an egg cooked into the bread, it'd definitely worth trying.  Though they do have some quick pastries to go here, they often times seem to run out of these so don't expect to really find any in the evening.", "rating": 4, "date": "2015-01-09"}, {"excerpts": ["it has asian pear, avocado, arugula, lemon vinaigrette, candied walnuts herbed goat cheese served on Acme levain bread. ", "I tried it for the first time today and will probably be back this week to get it again. ", "the ambiance and energy of the cafe is amazing as well."], "author": "Anthony A.", "review": "their vegetarian sandwich is amazing 10/10. it has asian pear, avocado, arugula, lemon vinaigrette, candied walnuts herbed goat cheese served on Acme levain bread. I tried it for the first time today and will probably be back this week to get it again. the ambiance and energy of the cafe is amazing as well.", "rating": 5, "date": "2016-10-11"}, {"excerpts": ["Fantastic coffee, excellent service, good pastries (today our bread broke on its way out of the case, so it was given to us on the house), and a great layout, providing lots of seating and good flow in a relatively tiny space. ", "Reveille draws a really good crowd too. ", "I've always had friendly interactions and my toddler acts really at ease sitting at the banquettes, watching the crowd and munching a snack. ", "Bonus points for being kid-friendly, and it's loud enough that little ones don't violate the vibe."], "author": "Quinn S.", "review": "Fantastic coffee, excellent service, good pastries (today our bread broke on its way out of the case, so it was given to us on the house), and a great layout, providing lots of seating and good flow in a relatively tiny space. Reveille draws a really good crowd too. I've always had friendly interactions and my toddler acts really at ease sitting at the banquettes, watching the crowd and munching a snack. Bonus points for being kid-friendly, and it's loud enough that little ones don't violate the vibe.", "rating": 5, "date": "2015-05-30"}, {"excerpts": ["The avocado toast came out quickly afterwards, and was well seasoned, although the bread (a French country?) was surprisingly dry. ", "Excellent customer service: while working quickly, the three counter people were all really nice and conversational. ", "Cool location, too, as it's conveniently tucked into the ground floor of the building and away from the street, with clean, contemporary decor. ", "I'll be back!"], "author": "Brian C.", "review": "Stopped into Réveille for coffee and a snack on a Saturday afternoon. As expected, it was busy, but I found a spot at the bar in the center of the café. Even with six people's tickets ahead of mine, my latte was ready in just a couple of minutes. Carefully poured and plated. The avocado toast came out quickly afterwards, and was well seasoned, although the bread (a French country?) was surprisingly dry. Excellent customer service: while working quickly, the three counter people were all really nice and conversational. Cool location, too, as it's conveniently tucked into the ground floor of the building and away from the street, with clean, contemporary decor. I'll be back!", "rating": 4, "date": "2015-07-25"}, {"excerpts": ["They used real rotisserre meat, good quality bread (think it was acme), not too much cheese, and arugla side salad was dressed perfectly with right amount of acid.  "], "author": "Christopher T.", "review": "I like this place a lot.   Only major complaint is that  I am a tea drinker and it would be nice if they have a more generic  black english breakfast tea but can't be too picky.\n\n Just had the chicken sandwich and it was as good as a chicken sandwich could be.  They used real rotisserre meat, good quality bread (think it was acme), not too much cheese, and arugla side salad was dressed perfectly with right amount of acid.  I hate how places  put too little acid in dishes.\n\nAlso people said the service is lacking in their reviews.  I could not disagree more.  The service is amazing here on all four different visits and I am NOT a pretty castro boy or girl just you average joe person.    The only thing I would dock them for is value.  The value is not bad but not amazing either..... its acceptable,  but on the other hand the quality of food is better than starbucks and you get more so I guess you get what you pay for.\n\nOne more thing the crowd is not as disheveled  and roudy as the starbucks  on 18th street.\n\nFood 4 Stars\nService 5 Stars\nAtmosphere 5 Stars\nValue 3.5 Stars", "rating": 4, "date": "2014-05-04"}, {"excerpts": ["I shared one of the flat bread items and it was delish.  ", "Also great breakfast sandwiches.  ", "I'll be back."], "author": "Jim D.", "review": "Yes, I'm a fan.  Great addition to the 'stro and a fantastic alternative to Starbucks just down the block.  Coffee is great, but the food is awesome - I shared one of the flat bread items and it was delish.  Also great breakfast sandwiches.  I'll be back.", "rating": 4, "date": "2014-02-08"}, {"excerpts": ["The bread was amazing, the egg, kale, (and I think cheese was in there) were all very flavorful-it kind of tasted like a quiche. "], "author": "Jena W.", "review": "Just stopped by for my first time this morning for some coffee and breakfast. \n\nVery friendly staff (although for some reason there were ONLY men employees, no women, which was a little weird to me) but despite that they were all very friendly, very beautiful interior design (great ambience, very clean)-they even had a cute ass bathroom.\n\nThe coffee was great, I ordered a latte. I usually like my coffee sweet but I didn't need to add any sugar, the natural flavor of great coffee and milk was just right. For my breakfast I orderd the egg sandwhich, it was delicious! The bread was amazing, the egg, kale, (and I think cheese was in there) were all very flavorful-it kind of tasted like a quiche. My meal cost me $12.\n\nThis place has great coffee and food and a beautiful interior/ambience. This place made me feel classy. If you're ever in the Castro I think you'll have a good experience here.", "rating": 4, "date": "2014-02-14"}], "zoes applewood bacon": []}