{"big clams with clam soup": [], "french style escargots": [], "grilled prawns with bacon": [], "baked mussels topped with garlic sauce": [], "baked mussels topped with tomato cheese": [], "french fries topped with meat sauce and cheese": [], "sauteed rice roll with xo sauce": [], "sauteed turnip cake with xo sauce": [], "marinated chicken wings": [], "crispy egg roll": [], "hong kong style rice roll": [], "fried fish balls": [{"excerpts": ["I order salt and pepper chicken wings and fried fish balls. ", "Those are really good. ", "I definitely will return here. ", "Hope I can try some good new stuff."], "author": "Annie Z.", "review": "The food is pretty good. I order salt and pepper chicken wings and fried fish balls. Those are really good. I definitely will return here. Hope I can try some good new stuff.", "rating": 4, "date": "2016-10-06"}], "curry sauce fish balls": [], "portuguese sauce fish balls": [], "scallion pancake": [], "avocado and fruit salad": [], "baked seafood soup with pastry": [], "dong yum kung soup": [], "clam chowder": [{"excerpts": ["I like the clam chowder with the flaky bread top thing. "], "author": "Garrett C.", "review": "Cozy little place for classic HK/Chinese cafe style food. I like the clam chowder with the flaky bread top thing. Love the baked beef tongue + spagett with red sauce. Tried the escargots my last visit and those were surprisingly good: very tender, not chewy at all. I've had the ribeye steak and the eel here, which were both delicious. Best part is they're open late!", "rating": 5, "date": "2017-01-02"}, {"excerpts": ["For the Soup we were served clam chowder, not the usual wonton or egg drop ", "so it was a change and thought how different. ", "Have to say it was good and enjoyed the soup. ", "So if your looking for something a little different I would try this place. ", "Can't wait to go back and try something else off the menu."], "author": "rudy a.", "review": "Had the Fish Filet & Pork Chops over spaghetti and Portuguese sauce for the first time and have to say was amazing. It was the first time I ate here thought what a Unique menu. I highly recommend the Bacon Prawns which were recommended by the nice waitress and were sooooo good. For the Soup we were served clam chowder, not the usual wonton or egg drop so it was a change and thought how different. Have to say it was good and enjoyed the soup. So if your looking for something a little different I would try this place. Can't wait to go back and try something else off the menu.", "rating": 4, "date": "2013-01-04"}, {"excerpts": ["the best part of the meal was the dinner roll and clam chowder!  ", "If I just ate that I would be satisfied.  ", "My friend ordered dried egg noodles with chicken (tasted exactly like chow mein).  ", "Hubby ordered bbq pork, won ton, noodle soup.  ", "Looked amazing, tasted so-so.  ", "Bottom line: ", "Chill spot with variety of Chinese dishes/snacks for late-night munchies =)"], "author": "Steph W.", "review": "Late night options tend to be restricted to A) Denny's, B) Seniore's, C) In-and-Out/Fast food.  Hubby was craving Chinese food so we decided to go to S & E for the first time.  When you walk in, this place is packed, filled with young and old alike, craving a late night snack.  There are nice flat screens on the wall, of course showcasing E News in Chinese, displaying the Bieb.  This reminds me of San Jose's VIP without the bar.  \n\nI ordered the baked, creamy porkchop with noodles.  In hindsight, I should've ordered that with rice.  The porkchop was so-so and the noodles were plain with no taste.  the best part of the meal was the dinner roll and clam chowder!  If I just ate that I would be satisfied.  My friend ordered dried egg noodles with chicken (tasted exactly like chow mein).  Hubby ordered bbq pork, won ton, noodle soup.  Looked amazing, tasted so-so.  Bottom line: Chill spot with variety of Chinese dishes/snacks for late-night munchies =)", "rating": 3, "date": "2011-03-03"}, {"excerpts": ["My friend got the clam chowder and it took forever to come. ", "When it finally did, it was the consistency of watery rice porridge and had gross canned clams in it. ", "It was unappetizing.  ", "They could have done better by just opening a can of Progresso.\n", "And speaking of soups, my bf had a soup with his meal and it was this cheesy bacon thing. ", "it wasn't even real cheese. ", "Seriously, it tasted like they used the powdered cheese packet from the Kraft's mac n cheese box. ", "Ughhh....just thinking about it right now makes me want to throw up.\n", "All in all, the reason why i didn't just give one star is because they are open late...catering for night-time owls who eat dinner late sometimes. ", "This to me is the only reason why this place is even popular."], "author": "Ivy L.", "review": "I don't really like this place. The food here is really bad and half-assed. The only reason why I frequently eat here is because it's open til really late and my friends like a sit down place to eat (which seniores across the street doesn't offer). \n\nWhenever I come here...i really don't see anything appealing that I would like to eat. On one of my latest visits here, I thought I was playing it safe by getting the grilled cheese. That was a mistake. Basically, they're version of the grilled cheese is to put two pieces of bread into the toaster and then putting cheese in between in hopes that the toast is hot enough to melt the cheese in the middle. Well, they were wrong. I could tell that they used two slices of american cheese because the cheese had not melted together! This was a disgrace to the All-American Grilled Cheese Sandwich...they neglected the grill part. \nMy plate wasn't the only bad thing. My friend got the clam chowder and it took forever to come. When it finally did, it was the consistency of watery rice porridge and had gross canned clams in it. It was unappetizing.  They could have done better by just opening a can of Progresso.\nAnd speaking of soups, my bf had a soup with his meal and it was this cheesy bacon thing. it wasn't even real cheese. Seriously, it tasted like they used the powdered cheese packet from the Kraft's mac n cheese box. Ughhh....just thinking about it right now makes me want to throw up.\nAll in all, the reason why i didn't just give one star is because they are open late...catering for night-time owls who eat dinner late sometimes. This to me is the only reason why this place is even popular.", "rating": 2, "date": "2009-10-03"}], "ox tail soup": [], "russian borscht": [{"excerpts": ["They also gave us their soup of the day, which was Russian borscht. ", "I never tried it ", "but I'm glad I did because I am so in love with it. ", "I even drank all of my bf's and the guy gave me a complimentary one since it didn't come with my meal but it came with my bf's. ", "The food was really good at a decent price and had huge portions. ", "The waiter was so friendly and energetic that it kind of rubs off on you. ", "I will definitely return to try their other items and they are opened till 2am, which is great for those late night hungers. ", "Their lemon iced tea is also very good. ", "It's just lemon iced tea but at smiling house, which is a block away, their lemon iced tea tasted like a Lipton tea bag and a lemon. ", "It lacked flavor. ", "In comparison to smiling house, come to s&e because the waiters are actually kind and not rude, and the food is actually good and worth paying for. ", "They also accept card!"], "author": "Brenda K.", "review": "I would always pass by this place because I would always go to sushi raw and this place is across the street from it. The location is a little off from the busy street but it's close enough. Thought I would give it a try since I love Chinese food at cafés. I ordered the stir fried flat noodle with beef and my bf ordered a Macau baked porkchop over rice. They also gave us their soup of the day, which was Russian borscht. I never tried it but I'm glad I did because I am so in love with it. I even drank all of my bf's and the guy gave me a complimentary one since it didn't come with my meal but it came with my bf's. The food was really good at a decent price and had huge portions. The waiter was so friendly and energetic that it kind of rubs off on you. I will definitely return to try their other items and they are opened till 2am, which is great for those late night hungers. Their lemon iced tea is also very good. It's just lemon iced tea but at smiling house, which is a block away, their lemon iced tea tasted like a Lipton tea bag and a lemon. It lacked flavor. In comparison to smiling house, come to s&e because the waiters are actually kind and not rude, and the food is actually good and worth paying for. They also accept card!", "rating": 5, "date": "2014-04-24"}], "cream of mushroom": [], "cream of corn": [], "house special curry beef stew instant noodle soup": [], "fresh style oxtail macaroni soup": [], "prawns soup": [], "seaweed seafood rice noodle in fish soup": [], "seaweed prawns rice noodle in fish soup": [], "seaweed clams rice noodle in fish soup": [], "beef and vegetable lo mein soup": [], "pork chop egg noodle soup": [], "chicken egg noodle soup": [], "cutlet pork chop soup": [], "cutlet chicken soup": [], "shredded pork with preserved soup": [], "snow veggie with preserved soup": [], "ham and chicken strips udon soup": [], "fish ball and hot link sausage vermicelli soup": [], "fish ball and sliced fish flat rice noodle soup": [], "spam with fried egg noodle soup": [], "ham with fried egg noodle soup": [], "chinese beef stew mein soup": [], "chinese beef stew and wonton mein soup": [], "wonton lo mein soup": [], "oyster sauce lo mein soup": [], "satay beef with enoki mushroom": [], "satay seafood with enoki mushroom": [], "prawns with enoki mushroom": [], "seafood and hairy gourd braised rice stick": [], "shredded pork with preserved veggie braised rice stick": [], "shredded pork with snow veggie braised rice stick": [], "pan fried beef with fresh tomato": [], "chives and shredded pork crispy noodle": [], "three shredded trio crispy noodle": [], "beef steak fried instant noodle": [], "satay seafood fried instant noodle": [], "satay prawns fried instant noodle": [], "hot link sausage with seafood": [], "beef tongue fried instant noodle": [], "fish fillet with scramble egg": [], "thai style stir fried vermicelli": [], "singapore style chow fun": [], "singapore style stir fried vermicelli": [], "spareribs in black bean sauce": [], "beef with dry fried flat rice noodle": [], "chicken with dry fried flat rice noodle": [], "beef with scramble egg": [], "beef with fresh tomato": [], "spam fried instant noodle": [], "pork chop strips instant noodle": [], "soy sauce stir fried egg noodle": [], "seafood with vegetable": [], "three pieces rack of lamb": [], "house combination steaks": [], "ribeye steak": [{"excerpts": ["I've had the ribeye steak and the eel here, which were both delicious. ", "Best part is they're open late!"], "author": "Garrett C.", "review": "Cozy little place for classic HK/Chinese cafe style food. I like the clam chowder with the flaky bread top thing. Love the baked beef tongue + spagett with red sauce. Tried the escargots my last visit and those were surprisingly good: very tender, not chewy at all. I've had the ribeye steak and the eel here, which were both delicious. Best part is they're open late!", "rating": 5, "date": "2017-01-02"}], "japanese style eel with rice": [], "fresh tomato with seafood over fried rice": [], "grilled salmon fillet": [], "french style oxtail": [{"excerpts": ["Ordered both the hk style pork chop with tomato sauce over rice, and a french style oxtail.  ", "The hk pork chop was really bland and had zero flavor.  ", "They should have fried the pork chop, but it was griled and dry.  ", "The tomato sauce was ehhh, no flavor at all, it tasted like watered down tomato sauce from a can.  ", "On a brighter side, the french style oxtail was delicious, a perfectly made tomato based sauce, rich and satisfying.  "], "author": "Terence N.", "review": "Came here for a quick hk food lunch.  The restaurant is spacious and clean, friendly staff.  Food is hit and miss. Ordered both the hk style pork chop with tomato sauce over rice, and a french style oxtail.  The hk pork chop was really bland and had zero flavor.  They should have fried the pork chop, but it was griled and dry.  The tomato sauce was ehhh, no flavor at all, it tasted like watered down tomato sauce from a can.  The bed of fried rice on the bottom was also really bad.\n\nOn a brighter side, the french style oxtail was delicious, a perfectly made tomato based sauce, rich and satisfying.  My only complaint is that there wasnt that much oxtail meat, the dish is a little pricey, but at least it was satisfying.\n\nLike most asian places, some items are good, and some items are bad.  I just wish they could make all their food taste good consistently.", "rating": 3, "date": "2016-06-20"}], "grilled ox tongue with onion": [], "grilled fish fillet": [], "grilled cutlet": [], "grilled chicken steak": [], "cutlet pork chops": [], "cutlet chicken steak": [], "pork chop with ham and fried egg": [], "chicken steak with ham and fried egg": [], "chicken steak with teriyaki sauce": [], "pork chop with teriyaki sauce": [], "beef steak sandwich": [], "smoked salmon with avocado sandwich": [], "fish fillet cutlet with avocado sandwich": [], "bacon and turkey with avocado sandwich": [], "ham and egg sandwich": [], "spam and egg sandwich": [], "hong kong style peanut butter toast": [], "hong kong style jam french toast": [], "condensed milk butter toast": [], "peanut butter toast": [], "fresh clam and seafood": [], "fresh clam and shrimp": [], "fish fillet": [{"excerpts": ["1 Tiny slice of so call fish fillet\n\nOther "], "author": "Guess G.", "review": "This place actually isn't bad if you want a HK style type food.  I've been here a couple and the food is decent, nothing special but decent.   A word of advice, order the HK style cuisine and you'll be ok.   I have tried their other stuff like fry noodle and it was uh ... a bad MISS.   Don't suggest you try anything on the wall too like their \"specials\".  \n\nWas here for Valentine day dinner ... I know, I know.... it was late and we were tired from work and happen to be in the Sunset.  $34 bucks for one order of the Valentine day special:\n\n1 Salad (from Costco, saw the box in the kitchen)\n1 So call Giant lobster tail (Tiny as hell .... also from costco)\n1 Pumpkin soup with lobster meat (hardly any lobster in there)\n1 Strip Steak (WTF ... they cut the steak strip in half ... one tiny piece...suspect from Costco also)\n1 Tiny slice of so call fish fillet\n\nOther then that, ok place,", "rating": 3, "date": "2013-03-01"}], "fresh clam and chicken": [], "lettuce and fish ball": [], "raw egg and minced beef": [], "beef": [{"excerpts": ["We ordered off the menu items like sautéed gailan, black bean garlic ginger leek crab, yu choi, and hk style beef ho fun. ", "Good clear broth house soup and taro tapioca dessert in hot coconut soup on the house like the house soup. ", "The crab was live swimming in tank minutes before served to us!"], "author": "Kimi W.", "review": "Real deal Hong Kong style food. We ordered off the menu items like sautéed gailan, black bean garlic ginger leek crab, yu choi, and hk style beef ho fun. Good clear broth house soup and taro tapioca dessert in hot coconut soup on the house like the house soup. The crab was live swimming in tank minutes before served to us!", "rating": 4, "date": "2018-02-19"}, {"excerpts": ["My last visit I had the minced beef with raw egg, which was not bad. ", "I was craving protein ", "so I ordered this dish but the rice was slightly under cooked and the sauce slightly on the bland side. ", "The raw egg was hiding snuggled in the rice under the blanket of hot minced meat sauce. "], "author": "David K.", "review": "I haven't been here in a while, but I remembered the good portions and homey feel of the place.  I came by for a second visit in about a year recently because I was looking for dinner before we karaoke it up at VOIZ a few blocks away. They cleaned up the place and everything looks very nice from what I last remember. Maybe it is a fresh coat of paint? \n\nHong Kong cafes are in my \"comfort food\" zone. My favorite is generally the baked pork chop or chicken over spaghetti. They generally make really good scrambled egg over noodles or rice dishes. The last two visits, the scrambled egg \"gravy\" dishes were tasty. My last visit I had the minced beef with raw egg, which was not bad. I was craving protein so I ordered this dish but the rice was slightly under cooked and the sauce slightly on the bland side. The raw egg was hiding snuggled in the rice under the blanket of hot minced meat sauce. Not a bad choice on a regular day I imagine. \n\nThe servers were busy and running around in haste, but they usually respond to your requests unlike some restaurants where they ignore you usually because of being short staffed or what not. We were able to get refills on tea and the check promptly.", "rating": 4, "date": "2017-01-25"}, {"excerpts": ["Order a Beef chow fun with veggies, there was only six pieces of beef(see pic) and you charge me $9?!? ", "Speechless.  \n", "I'll think twice before I'll come back again!"], "author": "JC C.", "review": "Five stars for service.\nZero star for value.  Order a Beef chow fun with veggies, there was only six pieces of beef(see pic) and you charge me $9?!? Speechless.  \nI'll think twice before I'll come back again!", "rating": 1, "date": "2016-07-16"}, {"excerpts": ["Love the baked beef tongue + spagett with red sauce. ", "Tried the escargots my last visit and those were surprisingly good: very tender, not chewy at all. "], "author": "Garrett C.", "review": "Cozy little place for classic HK/Chinese cafe style food. I like the clam chowder with the flaky bread top thing. Love the baked beef tongue + spagett with red sauce. Tried the escargots my last visit and those were surprisingly good: very tender, not chewy at all. I've had the ribeye steak and the eel here, which were both delicious. Best part is they're open late!", "rating": 5, "date": "2017-01-02"}, {"excerpts": ["I have only had a few dishes here, but the ones I always go to now are the Curry Beef Stew over rice and the Macau-style chicken over rice (with white sauce).\n\n"], "author": "Sihoon Y.", "review": "I order take-out from this place pretty often. I have only had a few dishes here, but the ones I always go to now are the Curry Beef Stew over rice and the Macau-style chicken over rice (with white sauce).\n\nIf I sit down to eat, I will occasionally order the rib-eye. For the price, you can't beat it. \n\nMy only complaint is I wish the rice was a bit higher quality.", "rating": 4, "date": "2017-01-05"}, {"excerpts": ["Both are delicious but my friend who ordered beef egg over rice, the rice is a little hard."], "author": "Mack A.", "review": "Service was great. Fast and responsive.\n\nFood is could be better but good enough for me.\n\nI ordered salmon salad, XO Chinese Changfun \n\nBoth are delicious but my friend who ordered beef egg over rice, the rice is a little hard.", "rating": 4, "date": "2017-01-02"}, {"excerpts": ["Curry beef stew over rice ", "$14 or $15 forgot !!\n", "But come on, you charge everything expensive than other place, but the taste is worst than other place.  \n", "Plus you don't have any fancy interior .. "], "author": "Kevin K.", "review": "The most expensive Hk style cafe in sunset district or San Francisco I believe ..  Curry beef stew over rice $14 or $15 forgot !!\nBut come on, you charge everything expensive than other place, but the taste is worst than other place.  \nPlus you don't have any fancy interior .. Why everything expensive than other cafe over $2-$5 different \n\nSMH", "rating": 1, "date": "2016-05-07"}, {"excerpts": ["I ordered Mongolian beef, my go-to safe dish, and it was decent. ", "I felt that the sauce to meat ratio could be adjusted "], "author": "Wing C.", "review": "Pros - cheap, tables for a small party, conveniently located\nCons - long wait for food, rice dishes are heavy on rice and skimpy on meat/veggies.\n\nAn hour wait for the food. AN HOUR!\nIs this acceptable? No, never. \nDid they apologize or tried to recompense us for the wait? No.\nI'm still a little irked by the whole experience.\n\nAnyways, the food was alright. It wasn't anything special. I ordered Mongolian beef, my go-to safe dish, and it was decent. I felt that the sauce to meat ratio could be adjusted but that's my own personal preference in taste.\n\nAs for my friends, their rice to meat/veggies ratio was severely out of whack. It seriously seemed like they were trying to cut the cost by filling the plate with rice rather than meat and vegetables. Pretty disappointing. \n\nAfter today, I'm sad to say, S&E is now on my list of \"never again\" restaurants.", "rating": 2, "date": "2016-07-24"}, {"excerpts": ["The house special curry beef had a decent back of the throat kick and the meat was tender. ", "I enjoyed the consistency but will admit it's not like most Chinese curries that I have tried. ", "My sister in law actually had to send a dish back because the sauce, cream based, tasted sour. ", "They said that the sauce was finished with lemon juice which is why it was on the sour side. "], "author": "Eddie W.", "review": "Another Hong Kong Style Chinese place for me to see how they stack up against other places. My go to dish is always Pork chop over rice with tomato sauce. This was the very first dish I had when I tried Hong Kong style Chinese food so it's only fitting I use that as my base of comparison.\n\nThe pork chop was seasoned adequately but felt it was too dry. It came pre-sliced which was disappointing since it deprived me of the joy of making the first cut. That aside, I found the tomato sauce to be on the saltier side and lacked the balance I have found in other versions. As for the pork, it had a grainy quality to it as I chewed.\n\nThe house special curry beef had a decent back of the throat kick and the meat was tender. I enjoyed the consistency but will admit it's not like most Chinese curries that I have tried. My sister in law actually had to send a dish back because the sauce, cream based, tasted sour. They said that the sauce was finished with lemon juice which is why it was on the sour side. They brought back her dish without lemon juice and it was fine. \n\nI do like the fact that they provide soup, drink and dessert with your meal! \n\nOverall Thoughts\n\nUnfortunately, the pork chop was a bust", "rating": 2, "date": "2013-04-28"}, {"excerpts": ["I had the minced beef with egg rice and it was below average and tasted chunky. ", "My dad had the baked pork chop rice which was better "], "author": "Natalie Y.", "review": "Ever since they switched owners, the place is definitely not as good and the Yelp check in offer no longer works :/ \n\nI had the minced beef with egg rice and it was below average and tasted chunky. My dad had the baked pork chop rice which was better but it was strange that the baked dish was way faster than my rice plate. \n\nWaitresses and waiters are very sweet but definitely amateur at serving food. As one of the waitresses placed a bowl of soup on the table, she spilled some of it into my milk tea and had to replace it.", "rating": 3, "date": "2014-12-12"}, {"excerpts": ["I had the beef stew won ton mein ", "and I enjoyed it. ", "It's a good place to get something quick or if where you go doesn't matter. ", "It's almost like any Chinese cafe kinda deal. ", "Service wasn't bad either"], "author": "Maggie W.", "review": "We came here to get something quick and warm. I had the beef stew won ton mein and I enjoyed it. It's a good place to get something quick or if where you go doesn't matter. It's almost like any Chinese cafe kinda deal. Service wasn't bad either", "rating": 3, "date": "2015-06-21"}, {"excerpts": ["I've been coming here for a while and the things I get are the beef strips, spaghetti, pork katsu, and chicken pineapple fried rice. ", "This time I ordered the beef strips with white sauce and it was pretty good. ", "Except the sauce didn't have much taste on its own. ", "It looks big but it's actually not that much. ", "This dish is pricey, $13.50 but the other food I listed are under $10 I believe."], "author": "Adrienne S.", "review": "If you come here around 5, there's practically no one. So service is decent. \n\nSince the change of ownership, there have also been changes in the menus. Depending on what dish you get, you may also get complimentary soup and dessert (both varies). I've been coming here for a while and the things I get are the beef strips, spaghetti, pork katsu, and chicken pineapple fried rice. This time I ordered the beef strips with white sauce and it was pretty good. Except the sauce didn't have much taste on its own. It looks big but it's actually not that much. This dish is pricey, $13.50 but the other food I listed are under $10 I believe.", "rating": 4, "date": "2014-10-15"}, {"excerpts": ["So far I've ordered the beef chow fun (not as much beef as I would have liked) but the noodles didn't seem to greasy - OKAY\n", "Pan fried noodles with chicken and veggies (super good! ", "They loaded up on so much bok choy ", "and I LOVED IT! ", "- must order next time!!"], "author": "Anh Thu P.", "review": "Precisely what it is. A chinese cafe open late and YES, i am a fan! The portions are relatively large, the servers were super courteous, open late and decent food! What more can you ask for?? Not to mention you get a free soda check in deal?! Holy cow, I will come back for my drunken late night munchies!! S&E cafe, you will soon see me on a regular basis :)\n\nTIPS:\nSo far I've ordered the beef chow fun (not as much beef as I would have liked) but the noodles didn't seem to greasy - OKAY\nPan fried noodles with chicken and veggies (super good! They loaded up on so much bok choy and I LOVED IT! - must order next time!!", "rating": 4, "date": "2012-11-18"}, {"excerpts": ["Good: spaghetti; any of the steaks; the Angus beef in cream sauce over rice is surprisingly good.\n\n"], "author": "Peter L.", "review": "Good: spaghetti; any of the steaks; the Angus beef in cream sauce over rice is surprisingly good.\n\nOkay: seafood udon noodle soup since it's bland to me; shrimp and \"wet\" egg over rice; pork chop (both deep fried and with grilled onions versions).\n\nThe meat combination (steak, chicken breast, sausages, pork chop) is the best deal. All the entrees come with veggies, a dinner roll and soup so you'll be full/stuffed, yeah? The HK milk tea is sweet so you may want to ask for less condensed milk, and the hot Coke w/ginger & lemon is good for a cough.", "rating": 4, "date": "2009-03-27"}, {"excerpts": ["Comes in a big bowl of rice with mince beef, onions, bell pepper, and an egg. \n\n"], "author": "Karen H.", "review": "I dont care for anything here, but THE MA'S SPECIAL RICE (LO MO FAN....yum meaning MOM RICE) It is so good! Comes in a big bowl of rice with mince beef, onions, bell pepper, and an egg. \n\nPrice is not bad since you get bread, soup, tea or coffee, and a dessert.", "rating": 4, "date": "2012-07-02"}, {"excerpts": ["and it was so late in the night, we just ordered a baked chicken steak over rice and a beef stew lo mein with thick egg noodles.  "], "author": "Janetto L.", "review": "Man, I've been missing out on this Sunset gem for quite some time now!!  Back in days, we would always hit up S&E after a night of partying since they are open till 2am everyday.  However, it's been awhile since I have visited this place and boy, am I glad I did!\n\nThey did a complete facelift, definitely an improvement with a much more modern feel, I like!  :)  I cannot tell you when the last time I was here, but it must have been awhile (I feel so bad that I've been missing out on something so good and so close for so long!).  Menu item is still pretty much the same, your typical Chinese/American baked spaghetti and rice joint, but man, their wait staff is far better than any service I have ever gotten at ABC or other café joints with the same caliber.  I cannot say enough about how impressed I was with their service!  Granted, you don't expect much service from Chinese places, especially during late night when everyone is tired and cannot wait to go home.  However, that was not the case here.  It was 11pm on a Sunday night, 2 waitress and 2 owners in the back.  Everyone was working hard and super perky!  The waitresses were both super friendly and kept on coming over to check if we needed refills on our milk teas.  That alone sold me, I didn't have to wave them down for stuff, they were so attentive on their own!\n\nSince there were only 2 of us and it was so late in the night, we just ordered a baked chicken steak over rice and a beef stew lo mein with thick egg noodles.  Both dishes were very flavorful and more than enough for the two of us, especially since the baked chicken steak came with bread and soup as well.  \n\nI'm definitely going to make more of an effort to come here more often!", "rating": 4, "date": "2010-03-19"}, {"excerpts": ["I don't recommend anything to do with beef/steak (except the fried rice). ", "They just mess it up somehow the two times we ordered it."], "author": "Wilson T.", "review": "Pros: Open until 2 AM\nReally good cheung fun(rice roll with the peanut and satay sauce)\nGood prices and good sizes.\n\nCons:Parking\nService\nI don't recommend anything to do with beef/steak (except the fried rice). They just mess it up somehow the two times we ordered it.", "rating": 3, "date": "2011-12-04"}, {"excerpts": ["The oxtail and the beef tongue were not cooked long \n     enough so they were tough.  "], "author": "Susan L.", "review": "Disappointing for four reasons.  \n\n1). It was my sons graduation day and he wanted prime rib.  We called S &E and \n     we asked do you have prime rib.  They said \"yes\".  We asked how much.  They\n     said around $21.00.  We went there and ordered prime rib and they said \"we don't\n     have prime rib tonight.\"  I was mad and disappointed. I even told them someone \n     here said that you have it. \n2)  When it was time for dessert, the waitress said we have red bean soup.  We asked\n      is this included  in our meal.  She said \"I will give this to you.\"  Keep in mind this  \n      Hong Kong style restaurant which I think dessert is included.  \n3)  We got our bill, it showed the cost of the meal, tax and total.  I noticed the \n     gratuity section showed the gratuity was based on the meal.  So I gave them my \n     credit card.  When I got the bill back to sign, the gratuity was higher because it  \n     was based on the total bill. \n4)  The soup was very bland.  The oxtail and the beef tongue were not cooked long \n     enough so they were tough.  My sons steak was good but for the price $18.50, it \n     was thin.  \n\nWe came here once (about two years ago) and thought it was much better then. We would not come here again.  Sorry", "rating": 2, "date": "2015-05-28"}, {"excerpts": ["I ordered the stir fried flat noodle with beef and my bf ordered a Macau baked porkchop over rice. "], "author": "Brenda K.", "review": "I would always pass by this place because I would always go to sushi raw and this place is across the street from it. The location is a little off from the busy street but it's close enough. Thought I would give it a try since I love Chinese food at cafés. I ordered the stir fried flat noodle with beef and my bf ordered a Macau baked porkchop over rice. They also gave us their soup of the day, which was Russian borscht. I never tried it but I'm glad I did because I am so in love with it. I even drank all of my bf's and the guy gave me a complimentary one since it didn't come with my meal but it came with my bf's. The food was really good at a decent price and had huge portions. The waiter was so friendly and energetic that it kind of rubs off on you. I will definitely return to try their other items and they are opened till 2am, which is great for those late night hungers. Their lemon iced tea is also very good. It's just lemon iced tea but at smiling house, which is a block away, their lemon iced tea tasted like a Lipton tea bag and a lemon. It lacked flavor. In comparison to smiling house, come to s&e because the waiters are actually kind and not rude, and the food is actually good and worth paying for. They also accept card!", "rating": 5, "date": "2014-04-24"}, {"excerpts": ["Or try their beef spaghetti with pesto sauce (not on ", "menu)...", "this is what I usually get.  "], "author": "Patrick C.", "review": "They've definitely improved in their quality of food since a year ago.  I think this is due to the fact that they have a new kitchen staff that is very creative with their menu.  I like their Hong Kong style milk tea, chicken wings, escargots, and curry fish balls.  Try their angus rib-eye steak with the mushrooms sauce...tastes great!!  Or try their beef spaghetti with pesto sauce (not on menu)...this is what I usually get.  Beware...their servings are huge!!\n\nThe place is super clean for a Chinese restaurant...much more comfortable then ABC.  They are also open till 2am every night and closed on Tuesdays.  They just started to do late-late night on Friday and Saturdays with a limited menu but still that great taste and huge portions until 4am.", "rating": 5, "date": "2011-01-14"}, {"excerpts": ["My dinner was more delicious but sort of expensive: I ordered the braised beef and tendon with noodles soup.  ", "The beef was very well seasoned, and the broth was delicious (light and flavorful, but not way too full of the beef sauce, like some places do it), but the portion was pretty small--maybe four small pieces of beef and four pieces of tendon, with about a fistful of noodles.  "], "author": "Megan S.", "review": "I came here with my parents and boyfriend for a quick dinner in the city.  It was on the tasty side of \"meh.\"  \n\nThe oven baked entrees seem like a good value--$9 for a drink, soup, a dinner roll, and a large plate of rice or noodles, topped with a choice of meat and sauce--although given the location, you could probably find similar food for cheaper.  I tried my parents' Portugese style pork chop, and thought it was good, but not anything special.  It also had a disturbing taste of Velveeta... but maybe it was just the orange color that made me think of it.\n\nMy dinner was more delicious but sort of expensive: I ordered the braised beef and tendon with noodles soup.  The beef was very well seasoned, and the broth was delicious (light and flavorful, but not way too full of the beef sauce, like some places do it), but the portion was pretty small--maybe four small pieces of beef and four pieces of tendon, with about a fistful of noodles.  For $8, it was definitely not worth it.  \n\nOverall, I had a pretty good experience here, but with all the options for Chinese food on 19th street, I'm not sure I'd come back.", "rating": 2, "date": "2009-10-08"}, {"excerpts": ["Any of your basic HK fusion style dishes can be found here, such as Portuguese chicken/pork chop, curry beef stew, baked seafood covered in cheese, chicken/pork chop with corn, etc. ", "all over rice or spaghetti. "], "author": "Eric W.", "review": "Whenever I'm in and around the Sunset area on the latenight tip, this is the spot I hit. It's pretty much your typical HK style cafe, similar to ABC (http://www.yelp.com/biz/ezLa_XcMRNBAgDEU6eeeAA) or Broadway Bistro (http://www.yelp.com/biz/V8OScvscIu3y8TPhKyRhAg?fsid=MfNMwhggv4VovbcpT3AJ2g). However, it's not as trashy as the first, nor as stuffy as the second.\n\nAnyhow, the food itself is decent, but nowhere near the best in town. Any of your basic HK fusion style dishes can be found here, such as Portuguese chicken/pork chop, curry beef stew, baked seafood covered in cheese, chicken/pork chop with corn, etc. all over rice or spaghetti. At 1:17 am, it's plenty good to fill me up, although it's not exactly a scintillating feast by any means.\n\nThe service can be a bit shoddy at times, with the waitresses sometimes acting like they don't want to be there. The good thing is that they have never kick us out no matter how long we sit and chill.\n\nS&E is actually a cool hangout spot for the local teenagers and college aged kids, and it looks like many of Sunset's finest like to patronize at the wee hours of the morning. My crew and I have been known to spit a few lines or two at the customers here.  =P\n\nThere is also nightclub right above, but I have never been inside. I don't know if they are connected or not, but it seems a bit shady to me, and always gated up. Maybe one day, I'll have to check it out.", "rating": 3, "date": "2006-12-31"}, {"excerpts": ["Many HK-style equivalents of American cuisine, as well as the staple entries for late-night Chinese eateries - Beef Dry-fried Chow Fun, Singapore Rice Noodle or Chow Fun, Won Ton, practically ANYTHING over steamed rice, etc..\n\n"], "author": "Harry W.", "review": "I want to say I am a big fan of this place, but their menu seems simpler than before, with fewer choices.  The service is very nice and friendly, which is a bit unusual for this genre of Hong-Kong-Style Chinese cafes.    Open 'til 2am, so this place is usually on my short-list.\n\nFor the uninitiated, think of this as the Cantonese equivalent of Dennys, complete with fried porkchops, but over rice.  Many HK-style equivalents of American cuisine, as well as the staple entries for late-night Chinese eateries - Beef Dry-fried Chow Fun, Singapore Rice Noodle or Chow Fun, Won Ton, practically ANYTHING over steamed rice, etc..\n\nThat said, I STILL prefer S&E over T-28.  What schlock over there!", "rating": 3, "date": "2007-03-03"}, {"excerpts": ["The curry beef chow fun ( my favorite dish ) ", "no longer tastes as good as it used to . ", "It's not as flavorful ): ", "The chicken wings are good though .. ", "I like how they're fun-sized haha ! ", "The radish cake is okay ."], "author": "Eileen L.", "review": "The food has really gone downhill .. it seem like ever since the place was redecorated , the food got worse . The curry beef chow fun ( my favorite dish ) no longer tastes as good as it used to . It's not as flavorful ): The chicken wings are good though .. I like how they're fun-sized haha ! The radish cake is okay .", "rating": 3, "date": "2008-12-05"}, {"excerpts": ["All I ever order here is either the oven baked fish with white sauce or the oven baked beef with white sauce. ", "Both are pretty good, as well as some of the other dishes my friends have ordered so I can say this place is well worth visiting. ", "They also serve hot Coca Cola with lemon which is interesting. ", "The only think I hate is the location (19th and Taraval) because of parking."], "author": "Rommel N.", "review": "I like this place cause it's open pretty late and I have an affinity for oven baked entrees. All I ever order here is either the oven baked fish with white sauce or the oven baked beef with white sauce. Both are pretty good, as well as some of the other dishes my friends have ordered so I can say this place is well worth visiting. They also serve hot Coca Cola with lemon which is interesting. The only think I hate is the location (19th and Taraval) because of parking.", "rating": 4, "date": "2008-06-01"}, {"excerpts": ["Food ain't graet & way high, got the steak special, & you'll agree with the \"where's the beef saying, a thin slice of  who know's what! ", "looks like they took one steak & fileted into 3 steaks & call it  the special. ", "waitresses trained to work their ass off", ", boss is always sitting there having tea or coffee & eagle eyeing the staff. ", "He's got a head waiter or something that thinks he god's gift to waiters, everthing he says goes! ", "Stay away, for that amount of $$$$ & leave hungry, better off going to taco bell/panda express! ", "wish yelp had a negative star! ", "ordered a cup of clam chow. ", "to go & ", "it took 45 mins & was no more than 8 oz. & costs more than $4.00. ", "should've walked up to safeway & bought two cans! ", "Ripped Off!"], "author": "david c.", "review": "Was going in there quite often, cause of the convenience, sorry to say not any longer! Owner only caters to his friends & customers of his dance club above the cafe. have you ever heard of refill your coffee only after you drank the last drop. I go to Denny's & take one sip & they come to refill the dam thing! Food ain't graet & way high, got the steak special, & you'll agree with the \"where's the beef saying, a thin slice of  who know's what! looks like they took one steak & fileted into 3 steaks & call it  the special. waitresses trained to work their ass off, boss is always sitting there having tea or coffee & eagle eyeing the staff. He's got a head waiter or something that thinks he god's gift to waiters, everthing he says goes! Stay away, for that amount of $$$$ & leave hungry, better off going to taco bell/panda express! wish yelp had a negative star! ordered a cup of clam chow. to go & it took 45 mins & was no more than 8 oz. & costs more than $4.00. should've walked up to safeway & bought two cans! Ripped Off!", "rating": 1, "date": "2010-03-08"}], "preserved egg and pork": [], "chinese donut": [{"excerpts": ["About 5mins after ordering, the waitress came by to tell us the pastry chef was out and they couldn't make the Chinese donut. ", "The buds didn't want rice porridge without Chinese donut, and opted for a seafood soup with the pastry topping, but was told the same thing - pastry dude is OOO. "], "author": "Jennifer L.", "review": "Whoa a HK cafe spot that's actually clean, has friendly waitstaff, and pretty damn tasty food actually exists?! \n\nArrived just after 11am to a completely empty restaurant. The waitress was especially patient and understanding, speaking thru her broken English and listening thru my broken Cantonese. We ordered scrambled egg hao fun with fish, baked clams and scallop white sauce rice, and pork rice porridge with Chinese donuts. \n\nAbout 5mins after ordering, the waitress came by to tell us the pastry chef was out and they couldn't make the Chinese donut. The buds didn't want rice porridge without Chinese donut, and opted for a seafood soup with the pastry topping, but was told the same thing - pastry dude is OOO. But whyyyy. \n\nWelp, we got the other two carbs on carbs dishes and it ended up being more than enough. Was honestly pleased with the overall experience, despite the pastry options mishaps. 4 stars!", "rating": 4, "date": "2017-12-20"}, {"excerpts": ["A group of 5 of us had preserved egg and meat porridge, soy sauce pan-fried noodles, Hong Kong style rice noodle rolls, Chinese donut, salt and pepper chicken wings, baked clam spaghetti, and 2 puff pastry soups. ", "The noodles and porridge were a great combo and provided a nice balance between bland and salty. ", "The salt and pepper chicken wings were perfectly juicy and had a nice crispy texture to it. ", "The rice noodle rolls had the classic peanut butter, hoisin sauce, and srircha sauce to it. ", "the puff pastry soups were good but took WAY too long to come out. ", "It came out at the end of the meal when everyone was done eating already. ", "Next time, I would probably opt for the soups without puff pastry, especially since they're an additional $2.50 for puff pastry."], "author": "Cindy C.", "review": "+/- THE FOOD\nThe food is pretty decent Hong Kong style cafe food. A group of 5 of us had preserved egg and meat porridge, soy sauce pan-fried noodles, Hong Kong style rice noodle rolls, Chinese donut, salt and pepper chicken wings, baked clam spaghetti, and 2 puff pastry soups. The noodles and porridge were a great combo and provided a nice balance between bland and salty. The salt and pepper chicken wings were perfectly juicy and had a nice crispy texture to it. The rice noodle rolls had the classic peanut butter, hoisin sauce, and srircha sauce to it. the puff pastry soups were good but took WAY too long to come out. It came out at the end of the meal when everyone was done eating already. Next time, I would probably opt for the soups without puff pastry, especially since they're an additional $2.50 for puff pastry.", "rating": 3, "date": "2017-02-13"}], "petite beef steak kids": [], "baked cheese prawns kids": [], "baked fish fillet with tomato sauce kids": [], "sausage with pork chop kids": [], "sausage with chicken steak kids": [], "egg with spaghetti and meat sauce kids": [], "hong kong style milk tea": [{"excerpts": ["I like their Hong Kong style milk tea, chicken wings, escargots, and curry fish balls.  ", "Try their angus rib-eye steak with the mushrooms sauce...tastes great!!  "], "author": "Patrick C.", "review": "They've definitely improved in their quality of food since a year ago.  I think this is due to the fact that they have a new kitchen staff that is very creative with their menu.  I like their Hong Kong style milk tea, chicken wings, escargots, and curry fish balls.  Try their angus rib-eye steak with the mushrooms sauce...tastes great!!  Or try their beef spaghetti with pesto sauce (not on menu)...this is what I usually get.  Beware...their servings are huge!!\n\nThe place is super clean for a Chinese restaurant...much more comfortable then ABC.  They are also open till 2am every night and closed on Tuesdays.  They just started to do late-late night on Friday and Saturdays with a limited menu but still that great taste and huge portions until 4am.", "rating": 5, "date": "2011-01-14"}], "lemon tea": [{"excerpts": ["They give you honey lemon tea for starters and taro soup for dessert. ", "Overall, the food was mediocre, but if you're in the mood for cheap large portions of Asain food then I would say come here."], "author": "Alice Y.", "review": "I was pretty excited for this place because I was really craving some Asian food. However, I can't say I was super satisfied with what I got. I ordered the minced pork rice with a raw egg because in the photo there was a pretty raw egg in the middle (and I LOVE eggs). When I received the dish, I didn't see any egg. Only after mixing it all up did I realize the egg was stuffed at the bottom but now I lost it because I already mixed up my dish. Also, the dish was incredibly salty. I will have to say they give big portions so its worth the money especially since everything in the city is so darn expensive. We also ordered the fish balls, which were pretty decent. I got a shrimp and egg fried rice to go. It was pretty good except there was way more rice than actual shrimp, egg, and seafood. They give you honey lemon tea for starters and taro soup for dessert. Overall, the food was mediocre, but if you're in the mood for cheap large portions of Asain food then I would say come here.", "rating": 3, "date": "2016-09-08"}, {"excerpts": ["You better brush up on you canto or you kind of can't order and when I showed the waitress the check-in deal to get a free Honey Lemon Tea ", "she looked at me like I asked her for her first born son, ", "so don't bother!\n", "Overall its not a bad place, you just have to go at the right time/ in the right state of mind."], "author": "Antonio W.", "review": "This place serves your standard HK/Chinese cafe food, tossed noodle, chow fun, baked spaghetti etc. nothing too special here though. \nThis place is best suited for getting fed while on a budget OR getting fed when you're drunk as Fuh after the club. \nThe service is also what you would expect of a HK cafe if you know what I mean. \nYou better brush up on you canto or you kind of can't order and when I showed the waitress the check-in deal to get a free Honey Lemon Tea she looked at me like I asked her for her first born son, so don't bother!\nOverall its not a bad place, you just have to go at the right time/ in the right state of mind.", "rating": 3, "date": "2013-08-25"}, {"excerpts": ["If you check in on Yelp, you also get a free iced lemon tea or soda. ", "Great service and awesome prices!"], "author": "S D.", "review": "Stopped by yesterday to pick up my usual- ketchup sauce baked pork chop over rice. It comes with a small side of soup and a crostini. Yummm!! If you check in on Yelp, you also get a free iced lemon tea or soda. Great service and awesome prices!", "rating": 4, "date": "2013-04-23"}, {"excerpts": ["If you've got a Yelp account, check in and they'll give you a free soda or iced lemon tea (one of my favorite drinks at HK restaurants)! \n\n"], "author": "Cheston W.", "review": "My family and I have always been a fan of this place. Unfortunately since the change in management, S&E Cafe isn't open for lunch anymore as it once was. Nonetheless, it's open super late and is a great (and delicious) option for those of you craving HK cuisine!\n\nDefinitely have to say the place has definitely upgraded since it first opened some years ago. The restaurant itself is much cleaner than some of the other HK style restaurants that you might find in the city. The staff is very friendly and the menu features a variety of dishes that will surely satisfy most if not all of your cravings. I would definitely recommend any of the baked dishes! You can choose from a range of sauces including a cream-based white sauce, tomato sauce, or black pepper sauce. I would definitely recommend the Baked Pork Chop Over Rice, the Portuguese Style Chicken Over Rice, or the Hong Kong Style Chicken Steak Over Rice! The meat(s) are savory and, once you add in the sauce and the rice, you've got a delicious meal to enjoy. These are a staple in the HK cuisine and the portions here are more than enough - each dish comes with a soup and bread (both of which are delicious and a nice starter) and milk tea or coffee. The milk tea is quite good and has a nice hint of sweetness when you ask for the condensed milk. If baked dishes aren't your thing, there's also sandwiches, noodle soups, and other rice and noodle dishes to choose from.\n\nIf you've got a Yelp account, check in and they'll give you a free soda or iced lemon tea (one of my favorite drinks at HK restaurants)! \n\nWord of caution: parking sometimes sucks in the area so be prepared to walk a block or two if necessary.", "rating": 4, "date": "2012-11-24"}], "lemon water": [], "honey lemon": [{"excerpts": ["They give you honey lemon tea for starters and taro soup for dessert. ", "Overall, the food was mediocre, but if you're in the mood for cheap large portions of Asain food then I would say come here."], "author": "Alice Y.", "review": "I was pretty excited for this place because I was really craving some Asian food. However, I can't say I was super satisfied with what I got. I ordered the minced pork rice with a raw egg because in the photo there was a pretty raw egg in the middle (and I LOVE eggs). When I received the dish, I didn't see any egg. Only after mixing it all up did I realize the egg was stuffed at the bottom but now I lost it because I already mixed up my dish. Also, the dish was incredibly salty. I will have to say they give big portions so its worth the money especially since everything in the city is so darn expensive. We also ordered the fish balls, which were pretty decent. I got a shrimp and egg fried rice to go. It was pretty good except there was way more rice than actual shrimp, egg, and seafood. They give you honey lemon tea for starters and taro soup for dessert. Overall, the food was mediocre, but if you're in the mood for cheap large portions of Asain food then I would say come here.", "rating": 3, "date": "2016-09-08"}, {"excerpts": ["You better brush up on you canto or you kind of can't order and when I showed the waitress the check-in deal to get a free Honey Lemon Tea ", "she looked at me like I asked her for her first born son, ", "so don't bother!\n", "Overall its not a bad place, you just have to go at the right time/ in the right state of mind."], "author": "Antonio W.", "review": "This place serves your standard HK/Chinese cafe food, tossed noodle, chow fun, baked spaghetti etc. nothing too special here though. \nThis place is best suited for getting fed while on a budget OR getting fed when you're drunk as Fuh after the club. \nThe service is also what you would expect of a HK cafe if you know what I mean. \nYou better brush up on you canto or you kind of can't order and when I showed the waitress the check-in deal to get a free Honey Lemon Tea she looked at me like I asked her for her first born son, so don't bother!\nOverall its not a bad place, you just have to go at the right time/ in the right state of mind.", "rating": 3, "date": "2013-08-25"}], "horlick": [], "lemon coke": [], "mix fruit punch": [], "glass jelly": [], "longan": [], "up float": [], "honey pomelo": [], "green tea red bean milk": [], "green tea shake": [], "cookie and cream shake": [], "banana shake": [], "avocado green tea shake": [], "ovaltine shake": [], "horlick shake": [], "avocado juice": []}