{"thai iced tea with fresh squeeze lime": [], "thai iced tea with fresh squeezed lime": [], "whole fresh young coconut": [], "hot ginger tea": [], "damman french hot tea": [], "fountain": [], "crispy larb wontons": [{"excerpts": ["We ordered the pad thai hor kai, tom yum soup, crispy larb wontons and the fresh rolls. ", "We definitely will go back to try more. ", "It's nice to have another thai option in the area."], "author": "Bethany D.", "review": "My boyfriend and I had heard about this place when it first opened and finally got a chance to try it this past weekend. We were not disappointed. It was probably some of the best thai I've had in the city. The only downside is that the menu is really extensive so it's easy to order too much food :) You'll probably want to try everything.\n\nIt's a casual spot, but fun decor and the staff is super friendly. A good setting for groups and/or happy hour. Maybe a little pricier than your average takeout but so worth it.\n\nWe ordered the pad thai hor kai, tom yum soup, crispy larb wontons and the fresh rolls. We definitely will go back to try more. It's nice to have another thai option in the area.", "rating": 5, "date": "2016-05-23"}], "garlic pepper pork spare rib": [], "crispy prawn rolls": [{"excerpts": ["but my staples are: 1) Crispy prawn rolls, 2) samosas (very different but bomb), 3) ", "Ka pow chicken (medium), 4) crab fried rice (omg so good)! ", "The Thai milk tea is really good too. ", "Their new cocktail menu is small but good. ", "They have a couple of drinks that are served inside fruit and you can watch the bartender carve out the center of the pineapple when you order. ", "All in all, highly recommend!"], "author": "Kendra W.", "review": "I probably come here once a week because its that good (I also live very close which helps). Anyways, this place is awesome! The atmosphere is fun but relaxed; great place for a group or to sit at the bar and watch a game. Before coming I was not the biggest on Thai food but this place changed the game for me as you can select the spiciness of your dishes (they always ask mild, medium or hot). I started at mild and am now working my way up to hot! I've tried a lot now and it's  all good but my staples are: 1) Crispy prawn rolls, 2) samosas (very different but bomb), 3) Ka pow chicken (medium), 4) crab fried rice (omg so good)! The Thai milk tea is really good too. Their new cocktail menu is small but good. They have a couple of drinks that are served inside fruit and you can watch the bartender carve out the center of the pineapple when you order. All in all, highly recommend!", "rating": 5, "date": "2018-05-31"}, {"excerpts": ["4 stars for the ambiance and the crispy prawn rolls.  ", "Really like the decor here, a lot of effort went into it.  ", "The shrimp here is large and fresh in all the dishes we tried. ", "The Pineapple fried rice was ok. ", "The service could've been a bit better, but for lunch time it was decent, no complaints like others had about dinner. ", "The bathrooms are spacious but could be cleaned better. ", "Will be back to try out the attractive happy hour specials."], "author": "Jon L.", "review": "4 stars for the ambiance and the crispy prawn rolls.  Really like the decor here, a lot of effort went into it.  The shrimp here is large and fresh in all the dishes we tried. The Pineapple fried rice was ok. The service could've been a bit better, but for lunch time it was decent, no complaints like others had about dinner. The bathrooms are spacious but could be cleaned better. Will be back to try out the attractive happy hour specials.", "rating": 4, "date": "2017-07-08"}], "gai satay": [], "salted wings": [{"excerpts": ["We ordered the salted wings which, IMO, is wings & drums chopped in half (so, pieces are smaller), seasoned with salt & pepper, then deep fried. ", "It's served with a sweet chili sauce. ", "Main course were eggplant basil with calamari, a penang curry chicken, pad siu with prawn and pad thai with beef. ", "Thai ice tea is not very sweet. ", "The place can get a little noisy, but a very positive atmosphere overall. ", "Personally, I like the movie poster plastered walls and the art theme used throughout, including menu. ", "Overall, Saap Ver is one of the better Thai restaurants I've been to in the bay area. ", "I'll definitely go back with more friends!"], "author": "Cris L.", "review": "Stopped by Saap Ver for dinner with friends. The service is good, wait-staff attentive... though it can take a little longer when the place is packed.... which is understandable. The dishes are flavorful and not too salty. We ordered the salted wings which, IMO, is wings & drums chopped in half (so, pieces are smaller), seasoned with salt & pepper, then deep fried. It's served with a sweet chili sauce. Main course were eggplant basil with calamari, a penang curry chicken, pad siu with prawn and pad thai with beef. Thai ice tea is not very sweet. The place can get a little noisy, but a very positive atmosphere overall. Personally, I like the movie poster plastered walls and the art theme used throughout, including menu. Overall, Saap Ver is one of the better Thai restaurants I've been to in the bay area. I'll definitely go back with more friends!", "rating": 4, "date": "2017-06-09"}, {"excerpts": ["* Salted wings - they split the flats to make them easier to eat.  ", "Decent option if you prefer extra crisp wings.\n"], "author": "Lee S.", "review": "Retro Thai movie posters adorn the walls and menus achieve an ambience of not taking themselves too seriously.  While the menu is quite extensive, the result is that the handful of \"good\" dishes are hidden among a selection of mediocre entries.\n* Salt-grilled whole fish - fish was cooked well, and the accompaniment of sauces added a lot of flavor.\n* Salted wings - they split the flats to make them easier to eat.  Decent option if you prefer extra crisp wings.\n* Crying tiger - was cooked really tender and flavorful, but seemed a bit spendy compared to the other dishes\n* Crab fried rice - ok dish, not a ton of crab but enough to impart flavor\n* Basil chicken - meh, not very basilly, so it missed on the premise\n\nWhile they were pretty busy on a Saturday night (there were multiple rowdy birthday groups), there were lengthy gaps where we were left looking for staff to no avail.  To echo many of the other reviewers, we found small flies in some of our drinks as well.", "rating": 2, "date": "2016-09-26"}], "tom kha chicken": [], "tom yam goong": [], "potak": [], "thai seaweed tofu soup": [{"excerpts": ["Wanting a simple, healthy soup as i'm recovering from food poisoning, so I ordered Thai seaweed tofu soup. ", "It was fantastic, and I bet it hardly ever gets ordered. ", "The tofu was soft and fresh and the seaweed was delicious. ", "Glass noodles complimented it nicely. ", "Try it."], "author": "Michele H.", "review": "They are open, for sure. Wanting a simple, healthy soup as i'm recovering from food poisoning, so I ordered Thai seaweed tofu soup. It was fantastic, and I bet it hardly ever gets ordered. The tofu was soft and fresh and the seaweed was delicious. Glass noodles complimented it nicely. Try it.", "rating": 5, "date": "2016-06-06"}], "spicy tom yum pork noodle soup": [], "grilled pork shoulder salad": [], "grilled prawn salad": [], "naked prawns salad": [], "seafood silver noodle salad": [], "rice field crab som tum salad": [], "som tum grilled prawns salad": [], "salted eggs som tum salad": [], "tum sua salad": [], "som tum thai": [], "red curry beef": [{"excerpts": ["We got the beef noodle soup, pork rad na moo, red curry beef, yellow curry chicken, and fresh rolls. "], "author": "Novelty B.", "review": "Had a nice dinner with friends here. We got the beef noodle soup, pork rad na moo, red curry beef, yellow curry chicken, and fresh rolls. The food was tasty enough and consistent with American Thai flavors. \n\nTheir spice levels are on the high side, my friends said, but I thought my \"medium\" spicy dish was fairly mild.\n\nService was solid, as was the ambiance. The giant Thai movie posters on the walls were interesting, and it was loud, but not deafening, inside.", "rating": 4, "date": "2018-08-18"}], "green curry pork": [], "yellow curry chicken": [{"excerpts": ["Tom yum noodle soup, pad sew ew and yellow curry chicken. "], "author": "Tiffany L.", "review": "Dine in and takeout equally delicious. I really love the vibe here and all the employees are friendly and attentive. Haven't had a bad experience yet and I've come over 10 times now. Tonight I saw their gin and watermelon fruit bowl and had to order it. So good! See photo. We ate all the watermelon and scrapped the rest out \n\nMy go to dishes are chicken wings, pork shoulder salad, Tom yum noodle soup, pad sew ew and yellow curry chicken. Their menu is quite extensive and we haven't explored yet.\n\nThere usually have their projector on. Watched a few Giants and Warriors games here.", "rating": 4, "date": "2018-06-20"}, {"excerpts": ["We got the beef noodle soup, pork rad na moo, red curry beef, yellow curry chicken, and fresh rolls. "], "author": "Novelty B.", "review": "Had a nice dinner with friends here. We got the beef noodle soup, pork rad na moo, red curry beef, yellow curry chicken, and fresh rolls. The food was tasty enough and consistent with American Thai flavors. \n\nTheir spice levels are on the high side, my friends said, but I thought my \"medium\" spicy dish was fairly mild.\n\nService was solid, as was the ambiance. The giant Thai movie posters on the walls were interesting, and it was loud, but not deafening, inside.", "rating": 4, "date": "2018-08-18"}], "pumpkin curry tofu": [], "tofu mixed vegetables": [], "pad kana": [], "chicken ginger rice": [{"excerpts": ["My main event was the $12 Chicken Ginger Rice, their take on Hainan chicken which I dared to ask if I could have paleo.\n\n"], "author": "Ed U.", "review": "On the hunt for yet another order of steamed chicken, I traipsed along 8th Street from Market all the way down to the Design District to find this rather lively large space on Division Street. The moment I entered at around 7PM on a Thursday evening, the bustling space evoked the spirited atmosphere of a Singaporean hawker center with a touch of San Francisco kitsch in the vintage movie magazine covers being used as wallpaper and Christmas drop lights hanging from the ceiling (photo: http://bit.ly/2pcEn2f). The dining profile was young, mostly Asian, and likely working at start-ups nearby judging from the Ben Sherman vibe of their clothing.\n\nI was seated straight away on a lonely banquette table and perused their rather lengthy menu to see what I could get away with for dinner. I also learned the literal translation of Saap Ver was 'Damn Delicious'. OK, fair enough. I started with the $8 Fresh Rolls, purely vegetarian with an extra thin rice paper wrapper and an extra thick peanut sauce. They were stuffed with lettuce, cabbage, cucumber, carrot, vermicelli noodles, and tofu (photo: http://bit.ly/2FQHoPV). Damn, it was delicious though not entirely unique in execution. My main event was the $12 Chicken Ginger Rice, their take on Hainan chicken which I dared to ask if I could have paleo.\n\nThe server asked the chef who refused as he felt the rice was the point of ordering the dish. It was indeed as the plump chicken thigh was resting on top of a large mound of ginger-infused rice with cucumber slices and soy sauce on the side (photo: http://bit.ly/2pioeZd). The poultry was tender and just what I wanted as it was boneless but not skinless. I added a $5 side of Steamed Broccoli in order to make it more paleo, and it worked for the most part since the veg was fresh (photo: http://bit.ly/2HC86t4). But hell, it didn't stop me from devouring the ginger rice much to my nutritional chagrin. Damn, it was delicious and probably worthy of a return visit with Jamie W.\n\nFOOD - 4 stars...saap ver!\nAMBIANCE - 4 stars...the Southeast Asian party vibe worked for me...surprisingly\nSERVICE - 4 stars...pretty attentive to this solo diner\nTOTAL - 4 stars...nice to find a Hainan chicken worth getting at a real hawker center", "rating": 4, "date": "2018-03-14"}, {"excerpts": ["My lunch of  steamed Chicken Ginger rice was accompanied by a  lively chili sauce that gave the dish some punch. ", "Look forward to exploring the menu further."], "author": "Steve T.", "review": "My lunch of  steamed Chicken Ginger rice was accompanied by a  lively chili sauce that gave the dish some punch. Look forward to exploring the menu further.", "rating": 3, "date": "2018-04-28"}, {"excerpts": ["The Pad Thai and the Fried Chicken Ginger Rice are my favorites. ", "And try their Happy Hour too!"], "author": "Jaching H.", "review": "The food and cocktails are super tasty! A fun spot for both lunch and dinner. They even have a full bar, and lots of TVs to watch games! But it doesn't have that sports bar feel, and the TVs are easy to ignore (in the bar area) if you want to. \n\nThe Pad Thai and the Fried Chicken Ginger Rice are my favorites. And try their Happy Hour too!", "rating": 4, "date": "2016-11-30"}], "fried chicken ginger rice": [{"excerpts": ["The Pad Thai and the Fried Chicken Ginger Rice are my favorites. ", "And try their Happy Hour too!"], "author": "Jaching H.", "review": "The food and cocktails are super tasty! A fun spot for both lunch and dinner. They even have a full bar, and lots of TVs to watch games! But it doesn't have that sports bar feel, and the TVs are easy to ignore (in the bar area) if you want to. \n\nThe Pad Thai and the Fried Chicken Ginger Rice are my favorites. And try their Happy Hour too!", "rating": 4, "date": "2016-11-30"}], "spices pork leg": [{"excerpts": ["Unlike other Thai places I've been to, they have some more regional dishes that I don't normally see on menus like khao kha moo (five spices pork leg). "], "author": "Jessie L.", "review": "TLDR - Solid Thai restaurant, very reasonable prices, some regional dishes, lively vibe\n\nNot your typical Thai restaurant. Saap Ver has more of a lively bar vibe that was reminiscent of the nightlife in Thailand. Retro decor. Casual, energetic ambiance.\n\nThe menu is very extensive here, like most Thai restaurants, and can be a little overwhelming. Unlike other Thai places I've been to, they have some more regional dishes that I don't normally see on menus like khao kha moo (five spices pork leg). The prices are very reasonable here, especially given it's SF, and they don't skimp on portion sizes to compensate. \n\nWe ordered 4 dishes between the 3 of us and it was more than plenty. I found the more \"American\" dishes like pad thai and curry to be disappointing while the less commonly ordered som tom and BBQ chicken tasted more authentic in flavor. I'd come back to try more of their regional dishes!\n\n* SOM TOM GRILLED PRAWNS ($13) - 4.5/5\n[green papaya salad, chili, cherry tomato, green bean, ground peanut, grilled prawn, fish sauce]\nVery well balanced papaya salad! Spicy, acidic, salty and sweet - just like in Thailand. My only disappointment was that there was literally just one grilled prawn, sliced into two halves.\n\n* BBQ CHICKEN ($12) - 4/5\n[thai style bbq chicken with sweet chili sauce]\nSolid. Came with 4 large pieces of chicken - 2 drumsticks and 1 thigh cut into 2 pieces - served with a sweet chili dipping sauce as well as a salty/fish chili dipping sauce. The meat wasn't the best I've had in texture and was a little dry at spots, but the skin was crispy and it was a generous portion for the price.\n\n* PAD THAI HOR KAI ($16) - 3/5\n[egg wrap pad thai - pan-fried rice noodle, prawn, peanut, bean sprouts]\nDisappointing. I had this in Bangkok and haven't seen it anywhere in SF except Saap Ver, so I was eager to try it. I honestly wasn't expecting it to be anything like the one I had in Bangkok, but their pad thai really fell short. The noodles were too chewy and stuck together in clumps, and the flavor was too sweet.\n\n* YELLOW CURRY WITH BEEF ($12) - 3/5\n[curry powder, turmeric, coconut milk, potato, carrot, yellow onion]\nStandard curry flavor. We got ours medium spicy but it tasted very mild to me. The potato, carrots and onion were tender soft, but the texture of the beef was tough and chewy. Felt like cheap cuts, but at least they were pretty generous with the amount of it. Maybe go with a different protein, but nothing special about the curry itself.", "rating": 4, "date": "2017-01-19"}], "roasted pork with crispy pork belly": [{"excerpts": ["Roasted Pork with Crispy Pork Belly\n   over rice\n   Chinese sausage\n   "], "author": "S.K. Y.", "review": "If you want food that differs 90% of the Thai restaurant.\nThis is the place.\n\nRoasted Pork with Crispy Pork Belly\n   over rice\n   Chinese sausage\n   boiled egg\n\nGrilled Salted Whole Tilapia \n    Lemongrass\n    Grilled Eggplant\n    Thai Spices", "rating": 4, "date": "2018-08-28"}], "thai sausagecrispy rice salad": [], "grilled eggplant salad": [], "crispy duck salad": [{"excerpts": ["Crispy Duck Salad ($14): http://bit.ly/1Rw6WMz\n"], "author": "Cherylynn N.", "review": "Impressing the hard to impress is tough.\n\nBirthday boy wanted to go to Saison for his Dirty 30 Birthday. I laughed over text and said, I'll do even better...\n\n*SURPRISE*\n\nSaap Ver, the newest Thai restaurant in SF...with 8 of your closest friends! \n\nShockingly, he was happy I choose Saap Ver as it came recommended by his trainer. \n\nOpening up last month in the old Grand Pu Bah space, Saap Ver serves authentic Thai food in a very dark, kitschy space. Street parking was plentiful. \n\nI appreciate having lots of choices but the 100+ item menu was daunting because most items can't be found in your cookie cutter Thai restaurant like King of Thai or Osha. The menu lacks organization; i.e. soup was listed in 3 different sections. There's also two other boards of \"chef specials\" with another 20+ items which made things even more overwhelming. A lot of ingredients present in the dishes aren't listed on the menu so if you have food allergies, let your server know. There's a full bar.\n\nWe ordered 15 dishes, some with double orders to share in a group. There were more misses than hits.\n\n: : S  O  L  I  D : : \n*Nam Kao Tod: Crispy Rice Salad ($12): http://bit.ly/1pFesz3  \nLots of crispy rice and flavorful sausage; better than Champa Garden and Maneelap.\n\n*Lard Ped Krod: Crispy Duck Salad ($14): http://bit.ly/1Rw6WMz\nIt was 80% duck so can't complain about that but needed more lime.\n\n*Kang Ped: Red Curry w/ duck ($16): http://bit.ly/1UfuFHO \nCurry sauce was robust with a nice sweetness. Duck was fatty and tender. \n\n*Durian w/ black sticky rice ($7): http://bit.ly/1MxiDBt\nDeliciously stinky and the rice was nicely sticky and nutty. \n \n: : D  E  C  E  N  T  ::\n*Pad Thai Kai Hor: Pad Thai Omelet ($15): http://bit.ly/1ZkjnBc\nFluffy eggs but noodles were soggy and needed more tamarind or lime.\n\n*Yum Koh Moo Yang: Grilled Pork Neck ($12): http://bit.ly/1U1pJG9  \nTender but not as deliciously fatty as Lers Ros; some pieces were tough, and dry around the edges. \n\n*Tom Saap Kra Dook Mo Pork: Spicy Rib Soup ($14): http://bit.ly/22s50jy\nTender ribs but broth lacked depth. \n\n*Tom Khaa: Coconut Soup w/ shrimp ($14): bit.ly/1LBa3XA\nCoconutty, good heat but didn't try any of the seafood. \n\n\n: : S  K  I  P : : \n*Crispy Pork Belly w/ sweet basil ($14): http://bit.ly/1Sd1EZz \nMeat was really dry and hard around the edges. \n\n*Tom Yum Seafood Fried Rice ($15):  http://bit.ly/1Mxjn9N \nOverwhelming lemongrass flavor, clumpy, and oily. \n\n*Duck Fried Rice ($16): http://bit.ly/1Sd1P75 \nLacks what Chinese call \"wok hay\". The rice was clumpy, soggy, and lacked a slight smokiness.  \n\n*Pad See Yew: Stir Fried Rice Noodles w beef ($13): http://bit.ly/1Uy2UcZ \nClumpy and mushy. \n\n*Kao Mun Kai ($14): http://bit.ly/1ZkkTmX\nFlavorful chicken rice but the chicken was sloppily sliced and poorly poached. The chicken (dark meat) was dry. Really disappointing.   \n\n*Nam Prik w/ Thai Sausage ($25): http://bit.ly/1Zkl4P3\nSloppily sliced, mealy sausage. Green chili dip was mushy, bland, and one dimensional. Way overpriced for $25. \n\n*Coconut Ice Cream ($7): Cloying sweet; tasted like piña colada (pineapple chucks).\n\nWhile the staff was cordial, they were very green. Our poor server wasn't familiar with the menu (who would be at 100+ items!) and had to confirm our order three separate times. I don't expect stellar service at Asian restaurants but I expected some follow-up since we were paying auto-gratuity for a large group and prices are higher than the standard Thai restaurant. No one checked on us to see how the food was and we had to constantly flag someone down when we needed something. We asked for hot sauce for the table and they gave us a small communal rack of hot sauces. They later asked to take it away when we were STILL using it. That's like having one set of ketchup and mustard bottles at a diner! \n\nAt the end of dinner, the staff brought the birthday boy coconut ice cream with a candle in it and sang happy birthday for him. What a nice gesture I thought until...I saw they charged us $7 for it. The phuck? \n\nI rarely take pics of receipts but I did so in this case so I can refer to it when writing a review. When I was looking back at the receipt last night to remind me of the dishes we ordered, I noticed that they charged us 11.9% for tax: http://bit.ly/1UfxRmS?! If the \"Healthy SF Tax\" is included, that should be listed as a separate line item charge. \n\nSaap Ver doesn't hold a candle to Lers Ros (original TL location) and Kin Khao. I question the authenticity of many of the glowing 5 star reviews especially when they choose Saap Ver to be their first restaurant to review. Ever.\n\nBut who cares about what I think. \n\nWhat did birthday boy who's a professional chef and trained in Thailand for Muay Thai think about the food at Saap Ver? \n\n\"It was authentic but ehh...it was ok\", he said. \n\nBut he thought the bartender was hawt. Now, if she sang Happy Birthday, Marilyn Monroe style to him, the $7 charge would have been worth it!", "rating": 3, "date": "2016-03-21"}, {"excerpts": ["The crispy duck salad was actually tasty but barely had any duck in it.\n\n"], "author": "Catherine C.", "review": "Other than the amazing Thai retro decor, this place left little to be desired.\n\nThis place just does not compare to the wonderfully delicious street food of Thailand as it proclaims.\n\nThe pad thai omelette sounded fun and unique but didn't taste any better than the standard pad thai you can get at any restaurant.\n\nThe only tasty thing about the Chiang Mai style pork with pork dip were the sauce and the chips. The pork was little pieces of overcooked, dry, and tough pieces of meat. Definitely not worth the $25 price tag. They just spread out the food on a large plate so that it seems like a lot of food but it's really just a little bit of pork.\n\nThe crab green papaya salad had zero crab meat along with a few one inch long miniature crab legs that can't be eaten. It was probably 1.5 cups of papaya salad with some dressing on it. Horrible.\n\nThe crispy duck salad was actually tasty but barely had any duck in it.\n\nServer was friendly but pretty clueless. \n\nBye! Won't be back again!", "rating": 2, "date": "2016-07-11"}], "larb fish": [{"excerpts": ["We also had the Larb Fish which was also very delicious. ", "This is a fried whole but "], "author": "Emi K.", "review": "The best and most authentic Thai food you can get in the city. The decor and ambiance is awesome but the food is even better! There are items here that cannot be found at other thai restaurants.  \n\nSome of my favorites were the Raw crab salad- YES it's RAW and it's delicious and sweet. They load it up with garlic and thai chilis.  \n\nWe also had the Larb Fish which was also very delicious. This is a fried whole but what's nice about this dish is that they dice up the fish meat for you!\n\nWe also had the curry crab which was very flavorful. other dishes we had were the bloody clams, papaya salad, tom yum soup, and scallops. I will definitely be back!", "rating": 5, "date": "2017-05-30"}, {"excerpts": ["I recommend the larb fish salad, grilled pork neck, spare rib soup, any of the noodles, and any dish that comes with pork belly. ", "All of the dishes are really well-presented and look beautiful. "], "author": "Melody Y.", "review": "OUTRAGEOUSLY GOOD.\n\nI've tried several items on the menu and have been blown away every single time. You know how there are some places that are so memorable because they redefined that type of cuisine for you? Saap Ver is that restaurant for me. I think it ranks within my top 5 favorite restaurants *ever*. \n\nI recommend the larb fish salad, grilled pork neck, spare rib soup, any of the noodles, and any dish that comes with pork belly. All of the dishes are really well-presented and look beautiful. Even the sticky rice came in a - for lack of a better description - cool-looking gold bowl. \n\nAs others have said, this place has great decor and a trendy/casual vibe. Their bar was full the last time I went, so perhaps their drinks are good too. Workers are friendly and give great suggestions. I can't wait to introduce friends to this so I can eat here again and again and again....", "rating": 5, "date": "2016-07-24"}, {"excerpts": ["We got the larb fish, the spring rolls, the Thai rice sausages, and a giant pineapple cocktail.  ", "All were really good!  ", "The fish was our favorite.  ", "Service was great.  ", "A ton of interesting items on the menu."], "author": "James A.", "review": "We got the larb fish, the spring rolls, the Thai rice sausages, and a giant pineapple cocktail.  All were really good!  The fish was our favorite.  Service was great.  A ton of interesting items on the menu.", "rating": 5, "date": "2017-02-10"}], "grilled salted whole tilapia fish": [{"excerpts": ["I once had to wait over an hour for the Grilled Salted Whole Tilapia Fish (more like family style entree) and really wish the waiter could have given me a heads up. "], "author": "Chelsea W.", "review": "Saap Ver is my go to restaurant for authentic, inexpensive and delicious Thai cuisine. I've lost count of how many times I've eaten here since it's affordable and in the neighborhood. The place has a lively and festive feel to it, decorated with colorful banners and posters. There's a bar that offers happy hour specials too. Food gets a 4.5 from me, but my experience overall is negatively impacted by the inattentive and sluggish service (or sometimes lack of). \n\nMost entrees on the menu will run you about $12+ depending on what kind of protein you get, such as tofu, vegetables, chicken, pork etc. The larger and more special dishes are around $25. If you're ordering off the chef's special section make sure to ask how long it'll take. I once had to wait over an hour for the Grilled Salted Whole Tilapia Fish (more like family style entree) and really wish the waiter could have given me a heads up. I've noticed recently that the lunch offering is a smaller portion of an entree and side of rice for $12, and $15 if you add an appetizer.\n\nGenerally you can't go wrong with most options on the menu. They have it all, such as soups, rice dishes, meat dishes, noodles, etc. Portions are large. \n\nI remember not liking the blue river prawn chef special, it was unappetizing and pungent. I'm also not a fan of the pad thai, it's definitely not their best dish surprisingly and a bit too sweet in my opinion. I can vouch for some of my favorites though!\n\nService is consistently not great at this restaurant unfortunately. I recall countless times I've had to flag down waiters for pretty much everything, from ordering food to paying the bill and even getting seated. This tends to happen when the restaurant is not even that busy. At least the food comes out quickly to make up for that. It's kind of a shame though, would feel like if the service was more efficient and customer first, the business would operate faster and more effectively.\n\nMixed Vegetables - Delicious black bean sauce and done pretty well.\n\nChicken & Rice - I remember liking this one a lot. Comes with chicken broth!\n\nYellow Curry - Generous amount of protein, and flavorful curry made from scratch. Lately it's more watery and I recall it being thicker which I'm not a fan of. The flavor keeps me ordering it though.\n\nPad Cashew - Can't remember exact details, but liked this one as well.\n\nChicken Noodle Soup - Delicious broth and super filling!\n\nBeef Noodle Soup - Was recommended by a waiter. Broth is very aromatic and yummy.", "rating": 4, "date": "2017-05-10"}], "sea bass clay pot": [{"excerpts": ["We ordered the Sea Bass Clay Pot Dinner for $25. ", "It was delicious. ", "Fish was cooked perfectly. ", "Also ordered the Cripsy Pork Belly Green Bean Dinner for $16. ", "Pork belly had a nice crisp to the edges but super tender elsewhere. "], "author": "Mandi W.", "review": "I only go to two Thai places in the city recommended from my Thai friends and this is one of them. \n\nWe ordered the Sea Bass Clay Pot Dinner for $25. It was delicious. Fish was cooked perfectly. Also ordered the Cripsy Pork Belly Green Bean Dinner for $16. Pork belly had a nice crisp to the edges but super tender elsewhere. Also had good heat to it so was loving that.\n\nExcited to keep coming back and trying everything on the menu. Haven't gone wrong yet!", "rating": 5, "date": "2016-12-18"}, {"excerpts": ["I got a Sea Bass Clay Pot.  ", "online is $20.00, and when I picked up it's $25.00 + fee, ended up $27.00. ", "It's not what I was expecting to have. ", "my order looks like a mess. ", "No more ordering from this Thai restaurant for sure!!!!"], "author": "Tiffany J.", "review": "First of all,  I tried to order online, but their website was down. Therefore, I phone in my order. Anyway, looks like their price went up when I picked up my order. I got a Sea Bass Clay Pot.  online is $20.00, and when I picked up it's $25.00 + fee, ended up $27.00. It's not what I was expecting to have. my order looks like a mess. No more ordering from this Thai restaurant for sure!!!!", "rating": 1, "date": "2016-10-05"}], "spicy sizzling seafood": [{"excerpts": ["My other friend had the spicy sizzling seafood which was ok but kind of underwhelming. ", "She loved it "], "author": "Ashtar B.", "review": "A couple good friends of mine brought me here for dinner one night when I was in town for work. This is one of their favorite Thai spots in the city. \n\nThe vibe and decor at this place was pretty fun. They must have been pretty short staffed the night I came because when I walked in, I had to wait several minutes for someone to come greet and seat me. \n\nMy friends recommended this cocktail they'd had there before that had some kind of lemongrass infused liquor and chili vodka or something, but they said they'd be discontinuing that drink so we were pretty bummed. \n\nWe started with the fresh rolls to start which were fresh and tasty. \n\nFor my main I had the pumpkin and tofu curry with garlic ginger rice. The curry was thick and decadent, but could've had a bit more pumpkin in it. \n\nOne friend ordered the sautéed beef with string beans which was super tasty and well seasoned. I would get that again. \n\nMy other friend had the spicy sizzling seafood which was ok but kind of underwhelming. She loved it but I thought the ingredients were not super well incorporated. \n\nTheir dishes also came out about 10 minutes after mine so timing could've been a bit better. Prices were average for what you can normally find in SF. Overall a fine experience.", "rating": 4, "date": "2018-09-26"}], "pad cha scallop": [{"excerpts": ["Both the pad cha scallop and the pad thai were kinda disappointing, but the tom yum goong and ", "five spice pig leg were both really flavorful and delicious.  ", "Will definitely keep coming back here to try the other interesting items on the menu."], "author": "Simon L.", "review": "Been here a few times now, and it's definitely a nice addition to the neighborhood.  The space is really interesting, while the food is hit or miss.  Both the pad cha scallop and the pad thai were kinda disappointing, but the tom yum goong and five spice pig leg were both really flavorful and delicious.  Will definitely keep coming back here to try the other interesting items on the menu.", "rating": 4, "date": "2016-03-26"}], "crispy pork belly green bean": [{"excerpts": ["My favorite dish is the Crispy Pork Belly Green Bean, which is heavily seasoned with lots of chili paste, ginger, young peppercorns, thai basil, etc. "], "author": "Jon E.", "review": "This is my new favorite Thai restaurant. Previous favorites were Farmhouse Kitchen (which has gotten way too weird, plus their red curry sauce is one-note and used in almost everything) and Kin Khao (which is far away from me, hard to park near, and hard to get a table at), and Lers Ros (I guess I just got bored of it).\n\nMost Thai restaurants in America have just the standard \"American Thai\" menu... you got your 4 different curries with 3 different meat options, your Pad Thai / See Yoo / Kee Mau noodle dishes, and the standard stir fries like beef with green beans... you know.\n\nI'm not Thai, and I'm no expert on Thai cuisine, but while Saap Ver does have the standards, it also has a lot of dishes that I haven't seen before, and when I eat them, they're all very yummy, and a little different -- and more like when I visited Thailand a few years ago. I especially like the street food inspired dishes, which are stylistically different than most of the Thai food you typically see.\n\nMy favorite dish is the Crispy Pork Belly Green Bean, which is heavily seasoned with lots of chili paste, ginger, young peppercorns, thai basil, etc. It's very rich, nicely spicy, and the serving size is generous.\n\nI also really enjoy the look inside this place. It's quite trendy and modern, but in a very Thai way. It reminds me of some of the hip new places we ate at in Koh Samui -- which sure, were touristy, but also really fun.", "rating": 5, "date": "2018-06-27"}], "crispy basil duck": [], "tom saap pork spare rib soup": [{"excerpts": ["Me and my friend ordered the Tom Saap Pork Spare Rib Soup, the Thai Sausage with Crispy Rice Salad, and a side of Sticky Rice. ", "I enjoyed the flavors in all the dishes. ", "The spareribs were tender and the soup was hot and sour. ", "Even though the salad was a little hard to eat, the crispy rice added good texture and was very flavorful. "], "author": "Michael L.", "review": "I came here on a Monday night around 8:30pm and it was pretty busy but we got seated right away. The decor is really unique and a fun environment to get a bite to eat. A really nice space for both big and small groups. \n\nMe and my friend ordered the Tom Saap Pork Spare Rib Soup, the Thai Sausage with Crispy Rice Salad, and a side of Sticky Rice. I enjoyed the flavors in all the dishes. The spareribs were tender and the soup was hot and sour. Even though the salad was a little hard to eat, the crispy rice added good texture and was very flavorful. The servers were also friendly and very attentive. \n\nEven though we didn't order any drinks, they do have a full bar and a bunch of cocktails and drinks. I would definitely come back to try other items from their menu.", "rating": 4, "date": "2018-10-04"}], "pad thai hor kai": [{"excerpts": ["* PAD THAI HOR KAI ($16) - 3/5\n", "[egg wrap pad thai - pan-fried rice noodle, prawn, peanut, bean sprouts]\nDisappointing. ", "I had this in Bangkok and haven't seen it anywhere in SF except Saap Ver, so I was eager to try it. ", "I honestly wasn't expecting it to be anything like the one I had in Bangkok, but their pad thai really fell short. "], "author": "Jessie L.", "review": "TLDR - Solid Thai restaurant, very reasonable prices, some regional dishes, lively vibe\n\nNot your typical Thai restaurant. Saap Ver has more of a lively bar vibe that was reminiscent of the nightlife in Thailand. Retro decor. Casual, energetic ambiance.\n\nThe menu is very extensive here, like most Thai restaurants, and can be a little overwhelming. Unlike other Thai places I've been to, they have some more regional dishes that I don't normally see on menus like khao kha moo (five spices pork leg). The prices are very reasonable here, especially given it's SF, and they don't skimp on portion sizes to compensate. \n\nWe ordered 4 dishes between the 3 of us and it was more than plenty. I found the more \"American\" dishes like pad thai and curry to be disappointing while the less commonly ordered som tom and BBQ chicken tasted more authentic in flavor. I'd come back to try more of their regional dishes!\n\n* SOM TOM GRILLED PRAWNS ($13) - 4.5/5\n[green papaya salad, chili, cherry tomato, green bean, ground peanut, grilled prawn, fish sauce]\nVery well balanced papaya salad! Spicy, acidic, salty and sweet - just like in Thailand. My only disappointment was that there was literally just one grilled prawn, sliced into two halves.\n\n* BBQ CHICKEN ($12) - 4/5\n[thai style bbq chicken with sweet chili sauce]\nSolid. Came with 4 large pieces of chicken - 2 drumsticks and 1 thigh cut into 2 pieces - served with a sweet chili dipping sauce as well as a salty/fish chili dipping sauce. The meat wasn't the best I've had in texture and was a little dry at spots, but the skin was crispy and it was a generous portion for the price.\n\n* PAD THAI HOR KAI ($16) - 3/5\n[egg wrap pad thai - pan-fried rice noodle, prawn, peanut, bean sprouts]\nDisappointing. I had this in Bangkok and haven't seen it anywhere in SF except Saap Ver, so I was eager to try it. I honestly wasn't expecting it to be anything like the one I had in Bangkok, but their pad thai really fell short. The noodles were too chewy and stuck together in clumps, and the flavor was too sweet.\n\n* YELLOW CURRY WITH BEEF ($12) - 3/5\n[curry powder, turmeric, coconut milk, potato, carrot, yellow onion]\nStandard curry flavor. We got ours medium spicy but it tasted very mild to me. The potato, carrots and onion were tender soft, but the texture of the beef was tough and chewy. Felt like cheap cuts, but at least they were pretty generous with the amount of it. Maybe go with a different protein, but nothing special about the curry itself.", "rating": 4, "date": "2017-01-19"}, {"excerpts": ["We ordered the pad thai hor kai, tom yum soup, crispy larb wontons and the fresh rolls. ", "We definitely will go back to try more. ", "It's nice to have another thai option in the area."], "author": "Bethany D.", "review": "My boyfriend and I had heard about this place when it first opened and finally got a chance to try it this past weekend. We were not disappointed. It was probably some of the best thai I've had in the city. The only downside is that the menu is really extensive so it's easy to order too much food :) You'll probably want to try everything.\n\nIt's a casual spot, but fun decor and the staff is super friendly. A good setting for groups and/or happy hour. Maybe a little pricier than your average takeout but so worth it.\n\nWe ordered the pad thai hor kai, tom yum soup, crispy larb wontons and the fresh rolls. We definitely will go back to try more. It's nice to have another thai option in the area.", "rating": 5, "date": "2016-05-23"}], "saap ver fried rice": [{"excerpts": ["I've tried the pad lee mao, saap ver fried rice (pork belly), pad thai, green curry, and tom yum noodle soup. ", "Everything has been delicious. ", "The saap ver fried rice in mild is very spicy though, so be careful if you can't normally handle spicy. \n\n"], "author": "Sophia H.", "review": "I've been here several times now and really enjoy the food. Prices are good too as they give pretty large portions. I've tried the pad lee mao, saap ver fried rice (pork belly), pad thai, green curry, and tom yum noodle soup. Everything has been delicious. The saap ver fried rice in mild is very spicy though, so be careful if you can't normally handle spicy. \n\nThey are usually less busy before 7 pm so I haven't needed to wait for seating but it does get pretty full. They also have a promotion going on where if you post on IG/FB with their hashtag, you get a free thai iced tea.\n\nOverall 5 stars as it's definitely my favorite Thai place in Soma and now a go-to spot for dinner.", "rating": 5, "date": "2017-12-04"}], "wokfried cabbage nam pla": [], "fried tilapia with chili sauce": [], "stirfried squid with salted egg yolk": [], "seafood curry stirfried": [], "thai shrimp paste fried rice": [], "pineapple fried rice chicken": [], "thai sausage fried rice": [{"excerpts": ["2 types of Somtum, Chiang Mai Style Pork Dip w/ Fried Pork, Thai Sausage Fried Rice, Tod Mun Pla, and several other dishes I can't remember anymore. ", "We had a very good meal and left extremely full and happy."], "author": "Alison S.", "review": "We went the day before the grand opening. There were 5 of us. We ordered a lot of variety of dishes so we could try many different things. 2 types of Somtum, Chiang Mai Style Pork Dip w/ Fried Pork, Thai Sausage Fried Rice, Tod Mun Pla, and several other dishes I can't remember anymore. We had a very good meal and left extremely full and happy.", "rating": 4, "date": "2016-08-09"}], "tom yum seafood fried rice": [{"excerpts": ["Dishes I tried were the whole grilled salted fish (twice), Tom yum seafood fried rice, papaya salad (mild), and the Po tak soup. ", "Get the salted fish!! ", "Don't walk. ", "RUN! ", "It's that good. ", "I'd go there just to eat that if I had $29 to drop on a whole fish every meal. ", "Seriously though, get the fish. "], "author": "Jennifer L.", "review": "I must be honest and say that the lower Yelp reviews for Saap Ver has made me hesitant to try this spot for the past year...until a friends persistent reco a few weeks ago. And boy was I wrong to stay away from Saap Ver til now! \n\nThose same friends and I went to Thailand last year, and we've been craving legit Thai street food ever since. And I'm not talking about the watered down curries and pad thais that every other Thai restaurant serves in this city. I'm talking about the spices, the layers of flavor, the genuine uniqueness of this cuisine. And Saap Ver has that down to a tee. \n\nDecor - reminder of all the fun, street style of Thailand (without the dirty street feels)\n\nWait staff - first visit really disappointed me. My friend had to apologize to me several times saying she'd never seen the restaurant that busy before. Our waitress didn't bring us our menus for a while. Or water. And forgot the main dish we order...the salted fish, which takes a bit longer to make. To be fair, they were catering a 20+ bday party, plus everyone else that night. It did seem busier than usual. \nWhich is why I decided to give them a second chance. The second visit was the best! The waitress was attentive, informative, and extremely friendly. The restaurant was also a lot less busy that night. \n\nFood - the star of the show! Dishes I tried were the whole grilled salted fish (twice), Tom yum seafood fried rice, papaya salad (mild), and the Po tak soup. Get the salted fish!! Don't walk. RUN! It's that good. I'd go there just to eat that if I had $29 to drop on a whole fish every meal. Seriously though, get the fish. No regrets. \n\nSince the reco a few weeks ago, I've been here two times. The first visit was unfortunately an overall 3 star experience, but I was willing to give it another try. The second visit was fortunately an overall 5 star experience! Here's 4 stars to hoping that they can staff up or learn to roll with the punches better!", "rating": 4, "date": "2017-03-29"}, {"excerpts": ["Tom Yum Seafood Fried Rice ($15):  ", "http://bit.ly/1Mxjn9N \n"], "author": "Cherylynn N.", "review": "Impressing the hard to impress is tough.\n\nBirthday boy wanted to go to Saison for his Dirty 30 Birthday. I laughed over text and said, I'll do even better...\n\n*SURPRISE*\n\nSaap Ver, the newest Thai restaurant in SF...with 8 of your closest friends! \n\nShockingly, he was happy I choose Saap Ver as it came recommended by his trainer. \n\nOpening up last month in the old Grand Pu Bah space, Saap Ver serves authentic Thai food in a very dark, kitschy space. Street parking was plentiful. \n\nI appreciate having lots of choices but the 100+ item menu was daunting because most items can't be found in your cookie cutter Thai restaurant like King of Thai or Osha. The menu lacks organization; i.e. soup was listed in 3 different sections. There's also two other boards of \"chef specials\" with another 20+ items which made things even more overwhelming. A lot of ingredients present in the dishes aren't listed on the menu so if you have food allergies, let your server know. There's a full bar.\n\nWe ordered 15 dishes, some with double orders to share in a group. There were more misses than hits.\n\n: : S  O  L  I  D : : \n*Nam Kao Tod: Crispy Rice Salad ($12): http://bit.ly/1pFesz3  \nLots of crispy rice and flavorful sausage; better than Champa Garden and Maneelap.\n\n*Lard Ped Krod: Crispy Duck Salad ($14): http://bit.ly/1Rw6WMz\nIt was 80% duck so can't complain about that but needed more lime.\n\n*Kang Ped: Red Curry w/ duck ($16): http://bit.ly/1UfuFHO \nCurry sauce was robust with a nice sweetness. Duck was fatty and tender. \n\n*Durian w/ black sticky rice ($7): http://bit.ly/1MxiDBt\nDeliciously stinky and the rice was nicely sticky and nutty. \n \n: : D  E  C  E  N  T  ::\n*Pad Thai Kai Hor: Pad Thai Omelet ($15): http://bit.ly/1ZkjnBc\nFluffy eggs but noodles were soggy and needed more tamarind or lime.\n\n*Yum Koh Moo Yang: Grilled Pork Neck ($12): http://bit.ly/1U1pJG9  \nTender but not as deliciously fatty as Lers Ros; some pieces were tough, and dry around the edges. \n\n*Tom Saap Kra Dook Mo Pork: Spicy Rib Soup ($14): http://bit.ly/22s50jy\nTender ribs but broth lacked depth. \n\n*Tom Khaa: Coconut Soup w/ shrimp ($14): bit.ly/1LBa3XA\nCoconutty, good heat but didn't try any of the seafood. \n\n\n: : S  K  I  P : : \n*Crispy Pork Belly w/ sweet basil ($14): http://bit.ly/1Sd1EZz \nMeat was really dry and hard around the edges. \n\n*Tom Yum Seafood Fried Rice ($15):  http://bit.ly/1Mxjn9N \nOverwhelming lemongrass flavor, clumpy, and oily. \n\n*Duck Fried Rice ($16): http://bit.ly/1Sd1P75 \nLacks what Chinese call \"wok hay\". The rice was clumpy, soggy, and lacked a slight smokiness.  \n\n*Pad See Yew: Stir Fried Rice Noodles w beef ($13): http://bit.ly/1Uy2UcZ \nClumpy and mushy. \n\n*Kao Mun Kai ($14): http://bit.ly/1ZkkTmX\nFlavorful chicken rice but the chicken was sloppily sliced and poorly poached. The chicken (dark meat) was dry. Really disappointing.   \n\n*Nam Prik w/ Thai Sausage ($25): http://bit.ly/1Zkl4P3\nSloppily sliced, mealy sausage. Green chili dip was mushy, bland, and one dimensional. Way overpriced for $25. \n\n*Coconut Ice Cream ($7): Cloying sweet; tasted like piña colada (pineapple chucks).\n\nWhile the staff was cordial, they were very green. Our poor server wasn't familiar with the menu (who would be at 100+ items!) and had to confirm our order three separate times. I don't expect stellar service at Asian restaurants but I expected some follow-up since we were paying auto-gratuity for a large group and prices are higher than the standard Thai restaurant. No one checked on us to see how the food was and we had to constantly flag someone down when we needed something. We asked for hot sauce for the table and they gave us a small communal rack of hot sauces. They later asked to take it away when we were STILL using it. That's like having one set of ketchup and mustard bottles at a diner! \n\nAt the end of dinner, the staff brought the birthday boy coconut ice cream with a candle in it and sang happy birthday for him. What a nice gesture I thought until...I saw they charged us $7 for it. The phuck? \n\nI rarely take pics of receipts but I did so in this case so I can refer to it when writing a review. When I was looking back at the receipt last night to remind me of the dishes we ordered, I noticed that they charged us 11.9% for tax: http://bit.ly/1UfxRmS?! If the \"Healthy SF Tax\" is included, that should be listed as a separate line item charge. \n\nSaap Ver doesn't hold a candle to Lers Ros (original TL location) and Kin Khao. I question the authenticity of many of the glowing 5 star reviews especially when they choose Saap Ver to be their first restaurant to review. Ever.\n\nBut who cares about what I think. \n\nWhat did birthday boy who's a professional chef and trained in Thailand for Muay Thai think about the food at Saap Ver? \n\n\"It was authentic but ehh...it was ok\", he said. \n\nBut he thought the bartender was hawt. Now, if she sang Happy Birthday, Marilyn Monroe style to him, the $7 charge would have been worth it!", "rating": 3, "date": "2016-03-21"}], "fried rice chicken": [], "pineapple fried rice prawn": [], "chiang mai style thai herb sausage": [], "isaan style thai rice sausage": [], "grilled meatballs": [{"excerpts": ["Grilled Meatballs (Pork or Beef), Sweet Chili Sauce \n\n"], "author": "Eddy M.", "review": "Literally the best Thai Restaurant in San Francisco! The food is authentic as well as amazingly delicious! A few dishes come to mind are :\n\nPECK GAI Salted Chicken Wings \n\nTHAI HERB SAUSAGE    Northern Style Pork Sausage \n\nLUK CHIN PHING       Grilled Meatballs (Pork or Beef), Sweet Chili Sauce \n\nKOH MOO YANG                Grilled Pork Neck \n\nGAI YANG                         BBQ Chicken with Sweet Chili Sauce  \n\nCRYING ThaIGilR         Grilled Rib Eye Steak, Roasted Rice, Chili-Lime Sauce \n\nGRILLED PORK NECK SALAD       Spicy Roasted Rice Powder \n\nGRILLED PRAWNS SALAD      Lemongrass, Fresh Mint  \n\nLARB         Minced Pork or Chicken, Chili Powder, Roasted Rice, Chili-Lime Dressing \n\nRICE FIELD CRAB SOM TUM      Rice Field Salted Crab, fermented fish\n\nTOM SAAP KRA DOOK MOO Spicy Sour Pork Spare Rib Soup, Roasted Rice Powder \n\nPAD THAI Pan-Fried Rice Noodle, Tofu, Chive, Peanut, Bean Sprout \n\nLARB PLA Whole Fish Salad, Thai Herbs, Spicy-Lime Roasted Rice Dressing \n\nCRISPY PORK BELLY BASIL      Stir-fried pork belly, chili, bell pepper, green bean \n\nCRISPY PORK BELLY KA-NA      Stir-fried pork belly, Chinese broccoli, oyster sauce\n\nThe owner and staff are unbelievable! Very friendly. My complements to the chef! An absolute delight!", "rating": 5, "date": "2017-11-05"}], "grilled pork shoulder": [{"excerpts": ["I ordered two things here, some grilled pork shoulder and crab fried rice. ", "The crab fried rice had disappointingly little crab and little crab flavor to it (compared to say Farmhouse Thai). ", "The grilled pork shoulder tasted good, but very little was provided. ", "The pork came with a tasty sauce, however, as I poured it out I noticed a strange lump. ", "When prodding this lump, it popped and revealed itself to be a mass of undissolved/unmixed rice powder (see photos). ", "Pretty unappetizing, and suggestive of corner cutting/not much care being put in."], "author": "Neal B.", "review": "I rarely feel compelled to review a place so soon after eating, but this place made me want to for the wrong reasons\n\nMy main complaints, in summary, are poor value/portion size and problems with the food quality.\n\nI usually walk by this place and it tends to be busy and lively every evening, so I thought I'd check it out. I ordered two things here, some grilled pork shoulder and crab fried rice. The crab fried rice had disappointingly little crab and little crab flavor to it (compared to say Farmhouse Thai). The grilled pork shoulder tasted good, but very little was provided. The pork came with a tasty sauce, however, as I poured it out I noticed a strange lump. When prodding this lump, it popped and revealed itself to be a mass of undissolved/unmixed rice powder (see photos). Pretty unappetizing, and suggestive of corner cutting/not much care being put in.", "rating": 2, "date": "2017-05-17"}, {"excerpts": ["We ordered Chiang Mai style pork dip, fried pork and grilled pork shoulder. ", "Both pork diahes were tendered and juicy. ", "The sauce was great. ", "It was  not sweet at all (thai food shouldn't be sweet). ", "Will definitely coming back again."], "author": "Pim N.", "review": "Second time coming here. This place has never disappointed me. We ordered Chiang Mai style pork dip, fried pork and grilled pork shoulder. Both pork diahes were tendered and juicy. The sauce was great. It was  not sweet at all (thai food shouldn't be sweet). Will definitely coming back again.", "rating": 5, "date": "2017-08-26"}], "crying tiger": [{"excerpts": ["* Crying tiger - was cooked really tender and flavorful, but seemed a bit spendy compared to the other dishes\n", "* Crab fried rice - ok dish, not a ton of crab but enough to impart flavor\n"], "author": "Lee S.", "review": "Retro Thai movie posters adorn the walls and menus achieve an ambience of not taking themselves too seriously.  While the menu is quite extensive, the result is that the handful of \"good\" dishes are hidden among a selection of mediocre entries.\n* Salt-grilled whole fish - fish was cooked well, and the accompaniment of sauces added a lot of flavor.\n* Salted wings - they split the flats to make them easier to eat.  Decent option if you prefer extra crisp wings.\n* Crying tiger - was cooked really tender and flavorful, but seemed a bit spendy compared to the other dishes\n* Crab fried rice - ok dish, not a ton of crab but enough to impart flavor\n* Basil chicken - meh, not very basilly, so it missed on the premise\n\nWhile they were pretty busy on a Saturday night (there were multiple rowdy birthday groups), there were lengthy gaps where we were left looking for staff to no avail.  To echo many of the other reviewers, we found small flies in some of our drinks as well.", "rating": 2, "date": "2016-09-26"}, {"excerpts": ["Crying Tiger was delicious and cooked medium rare with a savory dipping sauce. ", "Gonna have to go back for some of my other childhood favorites like Kao Mun Gai and boat noodle soup."], "author": "Nina L.", "review": "Finally, a legit Thai restaurant with some food country-style dishes you can't get from the other places. The fish larb is crispy, flavorful, and the closest thing (in SF) we've found to a dish we had in Phuket. Crying Tiger was delicious and cooked medium rare with a savory dipping sauce. Gonna have to go back for some of my other childhood favorites like Kao Mun Gai and boat noodle soup.", "rating": 5, "date": "2016-06-19"}], "som tum grilled prawns set": [], "som tum pu set": [], "pad kee mow chicken": [{"excerpts": ["Nice Pad Kee Mow Chicken. ", "Well spiced, service was good. ", "Ambience is pretty cool too. ", "Decent overall."], "author": "Dhruvil B.", "review": "Nice Pad Kee Mow Chicken. Well spiced, service was good. Ambience is pretty cool too. Decent overall.", "rating": 4, "date": "2018-08-30"}], "pad see ew beef": [{"excerpts": ["Ordered pad see ew beef to go for lunch. ", "The flavor is good, medium spice level is actually pretty spicy - go easy if you are not crazy for spicy food. ", "Only complaint really is the portion size - for $14 you would have expected more noodles and beef in it."], "author": "Jessie L.", "review": "Ordered pad see ew beef to go for lunch. The flavor is good, medium spice level is actually pretty spicy - go easy if you are not crazy for spicy food. Only complaint really is the portion size - for $14 you would have expected more noodles and beef in it.", "rating": 4, "date": "2018-10-05"}, {"excerpts": ["Ordered the Pad See Ew Beef the other day with spicy and it was delicious and fresh. ", "The beef was rough and overcooked while the noodles were very fresh and the soy sauce was perfect! "], "author": "Derek S.", "review": "Came by for lunch the last couple of days and it was a decent experience both times! Staff was friendly and water was nice and cold upon arrival.\n\nThai tea is decent, better than most, and not too sweet. Thai tea is also pretty strong.\n\nOrdered the Pad See Ew Beef the other day with spicy and it was delicious and fresh. The beef was rough and overcooked while the noodles were very fresh and the soy sauce was perfect! Portions were so large that I couldn't finish!\n\nOrdered the Pad Thai omelette the following day and it was decent. The omelette, was delicious whereas the noodles were all stuck together...something was wrong. The 4 shrimps were decent sized. Again, the portions were too large...\n\nTheir chicken satay appetizer was smokey, flavorful, and tender. Quite impressive!\n\nThe samosas were decent too. \n\nThe fresh rolls were a miss.", "rating": 4, "date": "2018-06-07"}], "pad thai chicken": [], "rad na moo": [{"excerpts": ["We got the beef noodle soup, pork rad na moo, red curry beef, yellow curry chicken, and fresh rolls. "], "author": "Novelty B.", "review": "Had a nice dinner with friends here. We got the beef noodle soup, pork rad na moo, red curry beef, yellow curry chicken, and fresh rolls. The food was tasty enough and consistent with American Thai flavors. \n\nTheir spice levels are on the high side, my friends said, but I thought my \"medium\" spicy dish was fairly mild.\n\nService was solid, as was the ambiance. The giant Thai movie posters on the walls were interesting, and it was loud, but not deafening, inside.", "rating": 4, "date": "2018-08-18"}], "pad thai prawn": [], "spicy shrimp paste dip with siamese sardine": [], "roasted chili dip with thai sausage": [], "pad kapow chicken": [], "spicy ped red chili beef": [], "spicy green bean tofu": [], "garlic pepper pork": [{"excerpts": ["One of my co-worker ordered Garlic Pepper Pork, and she said the food was extremely salty. ", "Other co-workers ordered fried rice and pat see ew, but they said their food were OK. ", "I guess they do have something that is good, but I definitely do not have courage to give this place another chance. ", "If you are going to give it a try, please avoid the yucky \"propane duck over rice\" and \"salty pepper pork\"."], "author": "Kelly H.", "review": "I went to this place for lunch with 5 co-workers. The restaurant was not very busy when we arrived as 1/3 of the tables were empty. You might think you will get better service as the restaurant is not busy. Think again! The service was very low. We got there by 1:10PM and the food wasn't ready until 1:50PM. Also, the food was very disappointing. I ordered Roast Duck Over Rice and the dish is barely warm. Also, the roast duck has very strong propane taste. One of my co-worker ordered Garlic Pepper Pork, and she said the food was extremely salty. Other co-workers ordered fried rice and pat see ew, but they said their food were OK. I guess they do have something that is good, but I definitely do not have courage to give this place another chance. If you are going to give it a try, please avoid the yucky \"propane duck over rice\" and \"salty pepper pork\".", "rating": 2, "date": "2016-12-13"}], "eggplant basil tofu": [], "garlic ginger rice": [{"excerpts": ["For my main I had the pumpkin and tofu curry with garlic ginger rice. "], "author": "Ashtar B.", "review": "A couple good friends of mine brought me here for dinner one night when I was in town for work. This is one of their favorite Thai spots in the city. \n\nThe vibe and decor at this place was pretty fun. They must have been pretty short staffed the night I came because when I walked in, I had to wait several minutes for someone to come greet and seat me. \n\nMy friends recommended this cocktail they'd had there before that had some kind of lemongrass infused liquor and chili vodka or something, but they said they'd be discontinuing that drink so we were pretty bummed. \n\nWe started with the fresh rolls to start which were fresh and tasty. \n\nFor my main I had the pumpkin and tofu curry with garlic ginger rice. The curry was thick and decadent, but could've had a bit more pumpkin in it. \n\nOne friend ordered the sautéed beef with string beans which was super tasty and well seasoned. I would get that again. \n\nMy other friend had the spicy sizzling seafood which was ok but kind of underwhelming. She loved it but I thought the ingredients were not super well incorporated. \n\nTheir dishes also came out about 10 minutes after mine so timing could've been a bit better. Prices were average for what you can normally find in SF. Overall a fine experience.", "rating": 4, "date": "2018-09-26"}], "steamed mixed vegetable": [], "spicy tom yum noodle soup lunch": [], "chicken noodle soup lunch": [], "beef noodle soup lunch": [], "pork noodle soup lunch": [], "bbq pork wonton noodle soup lunch": [], "duck noodle soup lunch": [], "combination noodle soup lunch": [], "chicken ginger rice plate lunch": [], "fried chicken ginger rice plate lunch": [], "spices pig leg rice plate lunch": [], "pork belly rice plate lunch": [], "chicken fried rice plate lunch": [], "crab fried rice plate lunch": [], "roasted duck rice plate lunch": [], "rad na moo lunch": [], "thai iced tea with fresh squeeze lime luch": [], "thai iced tea with condensed milk lunch": [], "thai iced coffee with condensed milk lunch": [], "regular iced tea lunch": [], "fountain lunch": [], "sparkling water lunch": [], "whole young coconut lunch": [], "spicy basil chicken lunch": [], "cashew nut chicken lunch": [], "pad spicy red chili beef lunch": [], "pad ginger pork lunch": [], "garlic pepper pork lunch": [], "spicy green bean tofu lunch": [], "tofu eggplant basil lunch": [], "tofu mixed vegetables lunch": [], "red curry pork lunch": [], "green curry beef lunch": [], "pumpkin curry tofu lunch": [], "pad red chili lunch": [], "pad fresh ginger lunch": [], "spicy green bean lunch": [], "garlic pepper lunch": [], "eggplant basil lunch": [], "mixed vegetables lunch": [], "pad kana lunch": [], "pad broccoli lunch": [], "yellow curry lunch": [], "green papaya salad lunch": [], "grilled banana": [], "durian black rice": [{"excerpts": ["They even have durian black rice dessert which I thought was tasty (probably not for everyone), and surprisingly did not had a strong scent. ", "We also had a sour soup and fried wings which went well with beer. ", "Wished we had room to order more but would definitely come back."], "author": "Kimmie H.", "review": "We came here for beer (they have a full bar bless their souls) and were impressed with the authenticity of the food selection. They have way  more then pad Thai and pad see ew... There were different larbs, squid salad, crispy salad, papaya salad, tilapia dishes. It all looked sooo good. They even have durian black rice dessert which I thought was tasty (probably not for everyone), and surprisingly did not had a strong scent. We also had a sour soup and fried wings which went well with beer. Wished we had room to order more but would definitely come back.", "rating": 4, "date": "2018-09-10"}]}