{"spicy mushroom and onion salad": [{"excerpts": ["$6.50 - Spicy mushroom and onion salad\n$7.00 "], "author": "トモ T.", "review": "Are you a Yelper who loves to take people to really obscure restaurants, one of those hidden gems that normal people would never venture to go?   Do you then sit proudly in front of good food and tell your guests that they too will be worthy of becoming an 'Elite' some day?\n\nIf so, Sabra is the place to go.\n\nWHY GO HERE?  \nThis is the only place in the city (that I know of) that serves Israeli cuisine.  There are other restaurants serving Persian, Lebanese, Turkish, Iraqi, and Egyptian food, but not Israeli.  Note that most Jewish cuisine/deli differs from Israeli food.      \n\nHOW TO FIND:  This is part of the fun.  No hints.\n\nHOURS:  They have unique hours, so check their website (http://www.sabragrill.com/) or call first.  Closed Saturday.  On Friday, they close two hours before Shabbat.\n\nATMOSPHERE:  Pretty much what you would expect from a restaurant on the second floor of a building in Chinatown.  Probably not a good first date place - unless your tactic is to earn point via tasty falafels.\n\nFOOD:  Excellent falafels and all the great size dishes, including hummus, egg plants, and mushrooms.  While the skewered meat items where good, I could get equally good kabobs at other restaurants.  I was not a big fan of their lamb, which had a very distinct flavor that I've never had before.      \n\nDRINKS: Kosher Beer was good.\n\nSERVICE:  On all my visits here, service was casual but good.  I've learned that at a family owned businesses like this, I need be polite and respectful, where as in the bigger restaurants, I could act like a king.  \n\nSEATS:  Further to good service, they were very accommodating when I increased the reservation number.  He quickly added tables and seated 9 of us.  Very flexible when they are not too busy.  12-15 tables total.  \n   \nPRICE:  For dinner, prices were reasonable, but it may seem expensive for lunch since they don't have lunch prices.  For the next visit, my plan is to keep the price down by ordering bunch of their side dishes and staying away from their skewers, which is what brings the price up.   \n\nPlans for the next visit:\n$7.25 - Hummus and falafel\n$6.50 - Spicy mushroom and onion salad\n$7.00 - Fried spicy eggplant\n$5.00 - White cabbage salad\n$3.00 - Maccabee Beer\n$3.00 - Goldstar Beer\n$8.00 - Tip and taxes\n----------------------------\n$40 - Dinner for two\n(Prices as of June 2007; Dine-in prices)", "rating": 5, "date": "2007-06-11"}], "humus and tahini salad": [], "humus and mushroom salad": [], "humus and falafel": [], "humus and ground beef": [], "humus and boiled egg": [], "baba ganush salad": [], "fried spicy eggplant": [{"excerpts": ["- Fried spicy eggplant\n$5.00 - White cabbage salad\n$3.00 - Maccabee Beer\n$3.00 - Goldstar Beer\n", "$8.00 - Tip and taxes\n----------------------------\n", "$40 - Dinner for two\n", "(Prices as of June 2007; Dine-in prices)"], "author": "トモ T.", "review": "Are you a Yelper who loves to take people to really obscure restaurants, one of those hidden gems that normal people would never venture to go?   Do you then sit proudly in front of good food and tell your guests that they too will be worthy of becoming an 'Elite' some day?\n\nIf so, Sabra is the place to go.\n\nWHY GO HERE?  \nThis is the only place in the city (that I know of) that serves Israeli cuisine.  There are other restaurants serving Persian, Lebanese, Turkish, Iraqi, and Egyptian food, but not Israeli.  Note that most Jewish cuisine/deli differs from Israeli food.      \n\nHOW TO FIND:  This is part of the fun.  No hints.\n\nHOURS:  They have unique hours, so check their website (http://www.sabragrill.com/) or call first.  Closed Saturday.  On Friday, they close two hours before Shabbat.\n\nATMOSPHERE:  Pretty much what you would expect from a restaurant on the second floor of a building in Chinatown.  Probably not a good first date place - unless your tactic is to earn point via tasty falafels.\n\nFOOD:  Excellent falafels and all the great size dishes, including hummus, egg plants, and mushrooms.  While the skewered meat items where good, I could get equally good kabobs at other restaurants.  I was not a big fan of their lamb, which had a very distinct flavor that I've never had before.      \n\nDRINKS: Kosher Beer was good.\n\nSERVICE:  On all my visits here, service was casual but good.  I've learned that at a family owned businesses like this, I need be polite and respectful, where as in the bigger restaurants, I could act like a king.  \n\nSEATS:  Further to good service, they were very accommodating when I increased the reservation number.  He quickly added tables and seated 9 of us.  Very flexible when they are not too busy.  12-15 tables total.  \n   \nPRICE:  For dinner, prices were reasonable, but it may seem expensive for lunch since they don't have lunch prices.  For the next visit, my plan is to keep the price down by ordering bunch of their side dishes and staying away from their skewers, which is what brings the price up.   \n\nPlans for the next visit:\n$7.25 - Hummus and falafel\n$6.50 - Spicy mushroom and onion salad\n$7.00 - Fried spicy eggplant\n$5.00 - White cabbage salad\n$3.00 - Maccabee Beer\n$3.00 - Goldstar Beer\n$8.00 - Tip and taxes\n----------------------------\n$40 - Dinner for two\n(Prices as of June 2007; Dine-in prices)", "rating": 5, "date": "2007-06-11"}], "falafel plate  balls": [], "combo salad with falafel": [{"excerpts": ["We started off with the Combo Salad with Falafel.  ", "Not bad.  ", "The Pitas we had were also tasty.  ", "It was a good appetizer to split between the 3 of us.  ", "Then, we ordered variations of the Shislik.  ", "I ordered the Lamb, the others ordered Chicken and Beef.  ", "The meats could have used some more seasoning, in my opinion.  ", "We added a coke and a Pastrami Sandwich to go.  ", "The bill was north of $120.00 for all of that.  ", "Not worth it, in my opinion.  ", "The service was ok. \n ", "I had to get up and get small plates for the table after the appetizer was served because the waiter had forgotten and then disappeared into the kitchen."], "author": "Thomas O.", "review": "I don't keep Kosher, but the friends I was meeting do.  We didn't have a ton of options in SF so we tried this one.  We started off with the Combo Salad with Falafel.  Not bad.  The Pitas we had were also tasty.  It was a good appetizer to split between the 3 of us.  Then, we ordered variations of the Shislik.  I ordered the Lamb, the others ordered Chicken and Beef.  The meats could have used some more seasoning, in my opinion.  We added a coke and a Pastrami Sandwich to go.  The bill was north of $120.00 for all of that.  Not worth it, in my opinion.  The service was ok. \n I had to get up and get small plates for the table after the appetizer was served because the waiter had forgotten and then disappeared into the kitchen.", "rating": 3, "date": "2018-06-17"}], "israeli green salad": [], "red cabbage salad": [], "white cabbage salad": [{"excerpts": ["- Fried spicy eggplant\n$5.00 - White cabbage salad\n$3.00 - Maccabee Beer\n$3.00 - Goldstar Beer\n", "$8.00 - Tip and taxes\n----------------------------\n", "$40 - Dinner for two\n", "(Prices as of June 2007; Dine-in prices)"], "author": "トモ T.", "review": "Are you a Yelper who loves to take people to really obscure restaurants, one of those hidden gems that normal people would never venture to go?   Do you then sit proudly in front of good food and tell your guests that they too will be worthy of becoming an 'Elite' some day?\n\nIf so, Sabra is the place to go.\n\nWHY GO HERE?  \nThis is the only place in the city (that I know of) that serves Israeli cuisine.  There are other restaurants serving Persian, Lebanese, Turkish, Iraqi, and Egyptian food, but not Israeli.  Note that most Jewish cuisine/deli differs from Israeli food.      \n\nHOW TO FIND:  This is part of the fun.  No hints.\n\nHOURS:  They have unique hours, so check their website (http://www.sabragrill.com/) or call first.  Closed Saturday.  On Friday, they close two hours before Shabbat.\n\nATMOSPHERE:  Pretty much what you would expect from a restaurant on the second floor of a building in Chinatown.  Probably not a good first date place - unless your tactic is to earn point via tasty falafels.\n\nFOOD:  Excellent falafels and all the great size dishes, including hummus, egg plants, and mushrooms.  While the skewered meat items where good, I could get equally good kabobs at other restaurants.  I was not a big fan of their lamb, which had a very distinct flavor that I've never had before.      \n\nDRINKS: Kosher Beer was good.\n\nSERVICE:  On all my visits here, service was casual but good.  I've learned that at a family owned businesses like this, I need be polite and respectful, where as in the bigger restaurants, I could act like a king.  \n\nSEATS:  Further to good service, they were very accommodating when I increased the reservation number.  He quickly added tables and seated 9 of us.  Very flexible when they are not too busy.  12-15 tables total.  \n   \nPRICE:  For dinner, prices were reasonable, but it may seem expensive for lunch since they don't have lunch prices.  For the next visit, my plan is to keep the price down by ordering bunch of their side dishes and staying away from their skewers, which is what brings the price up.   \n\nPlans for the next visit:\n$7.25 - Hummus and falafel\n$6.50 - Spicy mushroom and onion salad\n$7.00 - Fried spicy eggplant\n$5.00 - White cabbage salad\n$3.00 - Maccabee Beer\n$3.00 - Goldstar Beer\n$8.00 - Tip and taxes\n----------------------------\n$40 - Dinner for two\n(Prices as of June 2007; Dine-in prices)", "rating": 5, "date": "2007-06-11"}], "gyros  shawarma": [], "chicken shishlik": [{"excerpts": ["We had chicken Shishlik with Humus, Tehina & Israeli salad.\n", "We have learned that the restaurant is under NEW management, so they really improved since the last time we have been here. ", "The service was great ( Gorgeous waitress) very kind and very helpful. \n", "We have got a complimentary dessert because of the NEW management !!\n", "Wooho !!! ", "a great chocolate cake with layer of parve cream !!"], "author": "Kobi A.", "review": "My wife and I had lunch at Sabra's and it was really great !\nThe service was fast and we had the food in minutes !!!\nThe food was very tasty and exactly as we ordered. We had chicken Shishlik with Humus, Tehina & Israeli salad.\nWe have learned that the restaurant is under NEW management, so they really improved since the last time we have been here. The service was great ( Gorgeous waitress) very kind and very helpful. \nWe have got a complimentary dessert because of the NEW management !!\nWooho !!! a great chocolate cake with layer of parve cream !!", "rating": 5, "date": "2014-07-06"}], "beef shishlik": [], "lamb shishlik": [{"excerpts": ["Great lamb shishlik! ", "Enjoy!"], "author": "Aliza S.", "review": "It's not often that you walk into a restaurant and you're welcomed as though you've come home.\nBut at Sabra Grill that warm and welcoming feeling invites you every time.\nThe service is impeccable and the food is delicious. It's in a prime location with the friendliest smiles from staff. The menu has a  variety of middle eastern dishes. Great lamb shishlik! Enjoy!", "rating": 5, "date": "2015-11-17"}, {"excerpts": ["A real treat here is the Lamb Shishlik.  ", "Again, each skewer is grilled to order.  ", "Without a doubt some of the very best tasting Lamb Shishlik I have ever had.  "], "author": "Roy C.", "review": "I'm not Jewish; but, this place serves some of the best Falafel in San Francisco.  And, after trying several places nearby, without a doubt the best Falafel in a several block radius.\n\nWhat I really like about them, is that the Falafel are always fried fresh, and are nice and hot and crispy when you bite into them.  Another unique thing they have is their pita bread.  It's thicker than any other pita bread I have ever been served (probably at least twice as thick, and it has air bubbles inside like you'd find in an English Muffin, only it's much thinner than that).  As a result, the pita is always very pliable, tasty, and chewy.  Best yet, it's always served warm.  The Falafel Pita is $9.95, and totally worth it; especially when compared to the Falafel served at the other restaurants nearby.\n\nMost places in San Francisco use a much thinner pita, almost all serve it cold, and when it's served dry it just crumbles into a mess, and the ingredients fall out on to your plate.\n\nA real treat here is the Lamb Shishlik.  Again, each skewer is grilled to order.  Without a doubt some of the very best tasting Lamb Shishlik I have ever had.  It's delicious.\n\nThe only major miss so far that I have eaten here is the Chicken & Onion Shawarma.  To me, it just tasted awful.  I think it might have something to do with being cooked on the same grill as the Lamb.\n\nOther than that, everything I have tried has been real good, and worth eating again.  The humus and the rice are also good.\n\nA lot of people complain about the prices here.  Yes, it's more expensive because everything has to be certified as being Kosher.  However, if you stick to the lunch specials that they have posted next to the entrance on the street (which run from 12pm to 4pm), the prices are pretty fair for the flavor of the food they serve (around $10-$16 for lunch without drinks).\n\nSince they are Jewish, it's closed on Saturday; but, open on Sundays. If you weren't specifically looking for it, you would easily miss the entrance on the street level.  If you start at the Chinatown Gate at Grant and Bush, it's about 50 feet up Grant Street on the left hand side (West Side of Grant St).  The restaurant is up on the 2nd floor with a long flight of stairs and no elevator.", "rating": 4, "date": "2015-03-22"}, {"excerpts": ["Me and my family ordered lamb shishlik. ", "The meat was juicy, tender and flavorful."], "author": "Michael L.", "review": "The food was great. There was speedy service even though they place was packed and the waiters were kind and helpful. Me and my family ordered lamb shishlik. The meat was juicy, tender and flavorful.", "rating": 5, "date": "2014-08-10"}, {"excerpts": ["i've had the shnitzel (fried chicken), and came back a few days later for the lamb shishlik (lamb skewer), both were hella good. ", "Big plates, which surprised me when i got my food. ", "The waiter was chill too. ", "The only thing that would make the place better if the prices weren't so expensive."], "author": "David S.", "review": "Nice little place in downtown SF area. You walk up the stairs to a small dining area, full of Jewish artwork and decoration...it was pretty cool. Food was a little pricey, but worth it. i've had the shnitzel (fried chicken), and came back a few days later for the lamb shishlik (lamb skewer), both were hella good. Big plates, which surprised me when i got my food. The waiter was chill too. The only thing that would make the place better if the prices weren't so expensive.", "rating": 4, "date": "2012-04-19"}], "beef sabra kabab": [], "sabra rib steak": [], "sabra chicken breast": [], "sabra chicken salad": [], "hot dogs": [{"excerpts": ["If you don't care for the kosher aspect, I trust you won't want to pay $17 for a hamburger patty and some fries or $14 for three hot dogs (without buns) and some fries.  \n\n"], "author": "Lily T.", "review": "Food:  OVERPRICED.  If I could increase the font size to emphasize OVERPRICED, I would.  If you don't care for the kosher aspect, I trust you won't want to pay $17 for a hamburger patty and some fries or $14 for three hot dogs (without buns) and some fries.  \n\nService:  I imagine most gentiles don't get much love.  I certainly didn't.  I don't understand it; if you don't like serving people, take a vacation to Hawaii or something and hire someone who is capable of uttering the word \"hi.\"  Some may say, \"Geez, you're Chinese and Chinese restaurants aren't exactly known for good service.\"  My response: The day you pay $17 (not including tax and tip) for some lousy broccoli beef (without rice) is the day I get down on my knees and beg for your forgiveness.\n\nBest bargain of the place: falafel plate.", "rating": 2, "date": "2008-05-19"}], "salmon steak": [{"excerpts": ["I ordered one with a grilled chicken breast, and one with a salmon steak.  ", "The chicken breast was cooked well, but lacked flavor.  ", "The salmon steak was overcooked and had a lot of bones that made it difficult to eat.  "], "author": "Jeremy S.", "review": "I was visiting San Francisco recently, and got two of the combo to go meals.  I ordered one with a grilled chicken breast, and one with a salmon steak.  The chicken breast was cooked well, but lacked flavor.  The salmon steak was overcooked and had a lot of bones that made it difficult to eat.  Both came with rice, salad, humus, and pita.  For some reason, there were beans on the rice.  The price for the meals was outrageous.  $25 for a grilled chicken breast or salmon and some rice?  This isn't an upscale restaurant.  It's a run-down hole in the wall in Chinatown.  \nI don't think I'll be back.", "rating": 2, "date": "2013-08-06"}], "combo cold cuts plate": [], "felafel": [], "humus": [{"excerpts": ["I didn't take that time humus v-kadurei falafel b-tzalachat, I took it a while ago ", "tho ", "and I still have great memories. ", "The atmosphere is modest (aka Israeli typical), restroom were clean. ", "It's a bit expensive, however we cannot find glat kasher food everywhere, and it's also located in a touristic area (Bush street gate of Chinatown). ", "The meltzarim don't speak Hebrew, but that's ok", ", nobody is perfect. ", "Maybe having in the background Israeli radio could be great, and some inprints of the atikvah would be me'uleh!! ", "Todah rabah."], "author": "Bertrand B.", "review": "Great freshly cooked Israeli food, natural and healthy. The pitot are served warmed and not mushy, very hard to find good pitot in the area. I picture this pitah very well for a good sabich (Israeli street foot burger from Iraq). The tchinah was tasty. I didn't take that time humus v-kadurei falafel b-tzalachat, I took it a while ago tho and I still have great memories. The atmosphere is modest (aka Israeli typical), restroom were clean. It's a bit expensive, however we cannot find glat kasher food everywhere, and it's also located in a touristic area (Bush street gate of Chinatown). The meltzarim don't speak Hebrew, but that's ok, nobody is perfect. Maybe having in the background Israeli radio could be great, and some inprints of the atikvah would be me'uleh!! Todah rabah.", "rating": 4, "date": "2017-05-29"}, {"excerpts": ["The humus and the rice are also good.\n\n"], "author": "Roy C.", "review": "I'm not Jewish; but, this place serves some of the best Falafel in San Francisco.  And, after trying several places nearby, without a doubt the best Falafel in a several block radius.\n\nWhat I really like about them, is that the Falafel are always fried fresh, and are nice and hot and crispy when you bite into them.  Another unique thing they have is their pita bread.  It's thicker than any other pita bread I have ever been served (probably at least twice as thick, and it has air bubbles inside like you'd find in an English Muffin, only it's much thinner than that).  As a result, the pita is always very pliable, tasty, and chewy.  Best yet, it's always served warm.  The Falafel Pita is $9.95, and totally worth it; especially when compared to the Falafel served at the other restaurants nearby.\n\nMost places in San Francisco use a much thinner pita, almost all serve it cold, and when it's served dry it just crumbles into a mess, and the ingredients fall out on to your plate.\n\nA real treat here is the Lamb Shishlik.  Again, each skewer is grilled to order.  Without a doubt some of the very best tasting Lamb Shishlik I have ever had.  It's delicious.\n\nThe only major miss so far that I have eaten here is the Chicken & Onion Shawarma.  To me, it just tasted awful.  I think it might have something to do with being cooked on the same grill as the Lamb.\n\nOther than that, everything I have tried has been real good, and worth eating again.  The humus and the rice are also good.\n\nA lot of people complain about the prices here.  Yes, it's more expensive because everything has to be certified as being Kosher.  However, if you stick to the lunch specials that they have posted next to the entrance on the street (which run from 12pm to 4pm), the prices are pretty fair for the flavor of the food they serve (around $10-$16 for lunch without drinks).\n\nSince they are Jewish, it's closed on Saturday; but, open on Sundays. If you weren't specifically looking for it, you would easily miss the entrance on the street level.  If you start at the Chinatown Gate at Grant and Bush, it's about 50 feet up Grant Street on the left hand side (West Side of Grant St).  The restaurant is up on the 2nd floor with a long flight of stairs and no elevator.", "rating": 4, "date": "2015-03-22"}, {"excerpts": ["Pros: \nTasty food\nGood humus \n"], "author": "Marcy Z.", "review": "Classy Middle Eastern service :)\nI read the other reviews and I understand what they mean when they say how bad the service was.\nHaving traveled through the middle east, you get used to this attitude and service.\nIt's that type of service that they are actually doing you a favor for serving you.\n\nThat being said, \nThe food is good. The dinner plates are really good and the appetizers are even better.\n\nPros: \nTasty food\nGood humus \nWonderful chicken \nWonderful salads.\n\nCons:\nPricing....can get quite expensive for a dinner night out.\nService...middle eastern service.", "rating": 4, "date": "2012-09-15"}, {"excerpts": ["We had chicken Shishlik with Humus, Tehina & Israeli salad.\n", "We have learned that the restaurant is under NEW management, so they really improved since the last time we have been here. ", "The service was great ( Gorgeous waitress) very kind and very helpful. \n", "We have got a complimentary dessert because of the NEW management !!\n", "Wooho !!! ", "a great chocolate cake with layer of parve cream !!"], "author": "Kobi A.", "review": "My wife and I had lunch at Sabra's and it was really great !\nThe service was fast and we had the food in minutes !!!\nThe food was very tasty and exactly as we ordered. We had chicken Shishlik with Humus, Tehina & Israeli salad.\nWe have learned that the restaurant is under NEW management, so they really improved since the last time we have been here. The service was great ( Gorgeous waitress) very kind and very helpful. \nWe have got a complimentary dessert because of the NEW management !!\nWooho !!! a great chocolate cake with layer of parve cream !!", "rating": 5, "date": "2014-07-06"}, {"excerpts": ["Delicious falafel, humus, tehini, shwarma and other grilled delights are the tastiest features.  ", "And you can get a great hamburger, steak, grilled chicken or salad if you want a leaner fare.  ", "Lastly, it has the kosher seal of approval, so you know the quality is there, too."], "author": "Isaac W.", "review": "If you like real Israeli food, this is the place to go.  Delicious falafel, humus, tehini, shwarma and other grilled delights are the tastiest features.  And you can get a great hamburger, steak, grilled chicken or salad if you want a leaner fare.  Lastly, it has the kosher seal of approval, so you know the quality is there, too.", "rating": 4, "date": "2015-09-02"}, {"excerpts": ["Both came with rice, salad, humus, and pita.  ", "For some reason, there were beans on the rice.  ", "The price for the meals was outrageous.  ", "$25 for a grilled chicken breast or salmon and some rice?  ", "This isn't an upscale restaurant.  ", "It's a run-down hole in the wall in Chinatown.  \n", "I don't think I'll be back."], "author": "Jeremy S.", "review": "I was visiting San Francisco recently, and got two of the combo to go meals.  I ordered one with a grilled chicken breast, and one with a salmon steak.  The chicken breast was cooked well, but lacked flavor.  The salmon steak was overcooked and had a lot of bones that made it difficult to eat.  Both came with rice, salad, humus, and pita.  For some reason, there were beans on the rice.  The price for the meals was outrageous.  $25 for a grilled chicken breast or salmon and some rice?  This isn't an upscale restaurant.  It's a run-down hole in the wall in Chinatown.  \nI don't think I'll be back.", "rating": 2, "date": "2013-08-06"}, {"excerpts": ["They used fresh veggies, humus was excellent inside, the hot sauce was good and the chicken was cooked well. ", "I'd def want to go back and try some of their other items.....not sure why everyone on here is hating on them so much. ", "And the service, wasn't the greatest but wasn't bad either. ", "The dude was just a little soft spoken and the service was top notch considering its a small tiny spot upstairs in Chinatown."], "author": "pankaj l.", "review": "So my gf and I stopped in for a quick bite as we were shopping in the area. We had a chicken shwarma and okay, yes it's a little pricey but cmon it's downtown. And yes, they have a $10 minimum if you want to use a credit card but most items are around that much anyway. But the shwarma was excellent and let me tell you, I'm a very picky shwarma eater. They used fresh veggies, humus was excellent inside, the hot sauce was good and the chicken was cooked well. I'd def want to go back and try some of their other items.....not sure why everyone on here is hating on them so much. And the service, wasn't the greatest but wasn't bad either. The dude was just a little soft spoken and the service was top notch considering its a small tiny spot upstairs in Chinatown.", "rating": 4, "date": "2008-09-15"}, {"excerpts": ["good shishlik and very good falafel and humus!!! ", "i still havnt tried all the dishes but i will surtenly will"], "author": "dor w.", "review": "thats the only kosher restaurant i know in san francisco and its great!! good shishlik and very good falafel and humus!!! i still havnt tried all the dishes but i will surtenly will", "rating": 5, "date": "2009-01-11"}], "shawarma": [{"excerpts": ["$15 AT MOST for a STUFFED pita of whatever you like, shawarma kebob chicken schnitzel. ", "But I wanted to keep it light with no meat, I went for the $10 ( yea $10 in SF KOSHER ) and it was LIT FAM ", "it was STUFFED. ", "We got 2 orders of each, fries, 2 Malt Star Beers (A non alcoholic Israeli Malt Beer) and ", "I was excuse me, FREAKING HAPPY. ", "Was it like my dad's? ", "Nope. ", "But for a moment in my head it felt like it, I really got happy eating here. "], "author": "Matan A.", "review": "You don't need to keep Kosher or even be a Jew to eat here this food is bomb!!\n\nToday is National Sandwich Day!!!! \n\nI recommend the lunch special come before 3 PM!! I wish there were similar options for dinner I wouldn't mind paying a few more bucks!! $10 Falafel Sandwich in a pita pocket stuffed with salad pickes tahina and hummus!!!! Vegetarian and Kosher! I hear the meat is bomb too!!! Maybe the side portions can be bigger but I am fully happy here! The rest I'm writing to you with a big heart and love for small businesses (:\n\nTruly felt like home to me...\n\nWow... I need to come here more often just to bring someone inside with me too, how did I not come here when I lived in the TL! I'm not Jewish...I'm a Jew!! AUTHENTIC Middle Eastern OG KOSHER food is hard to come by not just in SF but the Bay TOTAL. There was once this one place, but now THIS is that one place. NO QUESTIONS ASKED. I came here cuz my dad & I were hungry and needed Kosher food!\n\nI'll drive from South San Jose where I live, to Chinatown and back again, and probably everytime. I'll catch an uber too, I'll walk if I'm downtown! \n\nYou see my dad is an observant Jew who keeps a Kosher diet! most the time we cook at home, because, well there's nowhere to eat in the South Bay. Now he also works weekdays in The Bay staying with me, and then LA on the weekend! Who needs to go eat out!! Well for those who do, and for those times when you're so fortunate like we were to be in downtown Frisco, you wanna eat something nice, don't you!! \n\nNot to mention we were working that day all day....it was a late lunch if you will, and then I looked down at the menu prices, checked at the time, bingo I had 40 minutes left for the lunch special....fire. $15 AT MOST for a STUFFED pita of whatever you like, shawarma kebob chicken schnitzel. But I wanted to keep it light with no meat, I went for the $10 ( yea $10 in SF KOSHER ) and it was LIT FAM it was STUFFED. We got 2 orders of each, fries, 2 Malt Star Beers (A non alcoholic Israeli Malt Beer) and I was excuse me, FREAKING HAPPY. Was it like my dad's? Nope. But for a moment in my head it felt like it, I really got happy eating here. I would eat dinner here and sit down next time.\n\nI'm gonna go there, you know that Adam Sandler movie, \"Eight Nights of Hanukkah\" ? Well Jews really do link with the Chinese, this shop is a GEM in what some may call an historical part of town in San Francisco. Heard of Chinatown? Idk me either. Just got these cool looking Oriental buildings in the heart of SF, Bush and Grant, says it on your Yelp! I just learned it now too, right by the Dragon Gates. \n\nIt's enough just to be here, in SF, but the aesthetic in & around the restaurant very proper & fitting. PLEASE PLEASE PLEASE give this place a shot despite the walk up the stairs, have you seen the hills in SF!?? Or is Uber taking over your life!!!  Yeah I know SF is all San Tech now but...\n\nThere is an Old World sense & taste in and around Sabra Grill. Consider getting there by foot, going down the Silk Road from East to West.\n\nWalk through Union Square due East, & after you pass under the towering skyscrapers of Downtown down Bush or Grant, go under the Dragon Gates and step no further than 13 steps. There you'll find the Middle Eastern Sabra Grill, right there at the head of Chinatown. You go from West to East in seconds, but Sabra Grill is that blend of both.\n\nMake a (slight) Ascent up the stairs to the Middle East , into a tight space of what looks like MOST Middle Eastern food stops I've seen myself. Nothing cute and that's the style I'm used to in the OG places, it felt like I was tucked in a corner of Jerusalem or my dad's town of Akko. The Walls have pictures of Israel, Scripture on the walls in Hebrew, maps of Israel, & if seeing the guy in a Kippah/Yamukkah wasn't enough to know I was gonna eat Kosher food, I was at peace with the man's clear appreciation for his culture and history. The place had no shame in who it was.\n\nI felt at home inside, I didn't expect anything more or less than what I saw. Do you know how hard it is JUST TO RUN A RESTAURANT!! Kosher Certification is a a big merit and meticulous task of maintaining food standards for the Jewish community! Anybody who takes that task is faced with daily scrutiny of his practices, because for the people who need it, it matters that much. It's just as important as gluten free and Halal and vegetarian! BIG props to the big guy behind the counter who works very hard & looks like my dad!!! I never seen a huger smile on my face when I asked to take a picture of them together. In fact it's the only picture I took and not even the food because we scarfed it down!! \n\nI wish I got his name because I would tell you tell him, Matan sent you, the kid who took his picture with the big Jew bear looking guy! Just show him my picture I post!! SF you gotta go give this guy more reviews and I promise you won't be let down!!!\n\nThank you for letting me feel at home sir! Great spot!", "rating": 5, "date": "2016-11-03"}, {"excerpts": ["I only went for a pita (after finding out their shawarma is not the lamb/beef kind, but chicken, Jewish style). ", "I chose beef for the filling. ", "It had a lot of slaw-style lettuce/cabbage and a few chunks of tomato. ", "Pita bread was good. ", "However, the meal was only so-so, certainly NOT worth $14 flippin' dollars. ", "Skip it."], "author": "Eve B.", "review": "I only went for a pita (after finding out their shawarma is not the lamb/beef kind, but chicken, Jewish style). I chose beef for the filling. It had a lot of slaw-style lettuce/cabbage and a few chunks of tomato. Pita bread was good. However, the meal was only so-so, certainly NOT worth $14 flippin' dollars. Skip it.", "rating": 3, "date": "2017-11-20"}, {"excerpts": ["The only major miss so far that I have eaten here is the Chicken & Onion Shawarma.  ", "To me, it just tasted awful.  "], "author": "Roy C.", "review": "I'm not Jewish; but, this place serves some of the best Falafel in San Francisco.  And, after trying several places nearby, without a doubt the best Falafel in a several block radius.\n\nWhat I really like about them, is that the Falafel are always fried fresh, and are nice and hot and crispy when you bite into them.  Another unique thing they have is their pita bread.  It's thicker than any other pita bread I have ever been served (probably at least twice as thick, and it has air bubbles inside like you'd find in an English Muffin, only it's much thinner than that).  As a result, the pita is always very pliable, tasty, and chewy.  Best yet, it's always served warm.  The Falafel Pita is $9.95, and totally worth it; especially when compared to the Falafel served at the other restaurants nearby.\n\nMost places in San Francisco use a much thinner pita, almost all serve it cold, and when it's served dry it just crumbles into a mess, and the ingredients fall out on to your plate.\n\nA real treat here is the Lamb Shishlik.  Again, each skewer is grilled to order.  Without a doubt some of the very best tasting Lamb Shishlik I have ever had.  It's delicious.\n\nThe only major miss so far that I have eaten here is the Chicken & Onion Shawarma.  To me, it just tasted awful.  I think it might have something to do with being cooked on the same grill as the Lamb.\n\nOther than that, everything I have tried has been real good, and worth eating again.  The humus and the rice are also good.\n\nA lot of people complain about the prices here.  Yes, it's more expensive because everything has to be certified as being Kosher.  However, if you stick to the lunch specials that they have posted next to the entrance on the street (which run from 12pm to 4pm), the prices are pretty fair for the flavor of the food they serve (around $10-$16 for lunch without drinks).\n\nSince they are Jewish, it's closed on Saturday; but, open on Sundays. If you weren't specifically looking for it, you would easily miss the entrance on the street level.  If you start at the Chinatown Gate at Grant and Bush, it's about 50 feet up Grant Street on the left hand side (West Side of Grant St).  The restaurant is up on the 2nd floor with a long flight of stairs and no elevator.", "rating": 4, "date": "2015-03-22"}, {"excerpts": ["I got the chicken shawarma and my wife got the hummus with ground beef they were both amazing, especially with the warm pita and pickles on the side. \n", "Definitely recommend this place, but you should go in knowing the prices are on the higher side which is necessary due to it being San Francisco and the kashrut certification. ", "The restaurant was packed with tons of people, which wasn't surprising because the food was great. ", "You definitely won't leave hungry."], "author": "Jordan G.", "review": "Delicious Mediterranean food! Also great service and authentic taste. Great if your looking for a change in cuisine to the usual sushi, burgers...,or if you keep kosher. I got the chicken shawarma and my wife got the hummus with ground beef they were both amazing, especially with the warm pita and pickles on the side. \nDefinitely recommend this place, but you should go in knowing the prices are on the higher side which is necessary due to it being San Francisco and the kashrut certification. The restaurant was packed with tons of people, which wasn't surprising because the food was great. You definitely won't leave hungry.", "rating": 5, "date": "2015-12-29"}, {"excerpts": ["Shawarma Wrap: This is a complete lie.  ", "It's not shawarma, but rather raw chunks of chicken pan fried with onions and spices.  ", "Where's the slow roasted meat on a long spit?   ", "The meat ends up being firmer and less crispy than a real shawarma.  ", "That being said, toasting the pita on an open flame was a nice touch and the it had a good spicy kick.  ", "The pickles were a little boring, they can do better than just pickled cucumbers.  "], "author": "Adam B.", "review": "I was excited to try this joint because kosher places seem in short supply in San Francisco.  I eat everything without discriminating and have a special place in my heart for bacon, but having lived in NYC for many years I can appreciate good kosher food.  This is definitely not like NYC kosher food!  It was alright.  The lunch was reasonably priced, but the dinner seemed a tad expensive for the hole-in-the-wall setting.\n\nShawarma Wrap: This is a complete lie.  It's not shawarma, but rather raw chunks of chicken pan fried with onions and spices.  Where's the slow roasted meat on a long spit?   The meat ends up being firmer and less crispy than a real shawarma.  That being said, toasting the pita on an open flame was a nice touch and the it had a good spicy kick.  The pickles were a little boring, they can do better than just pickled cucumbers.  The raw carrot slice didn't go well, would have been better if pickled.\n\nFalafel: A bit on the small side, but I liked the extremely crispy and jagged exterior paired against the creamy inside.  Not sure if it's traditional, but a nice alternative to the uniform and grainier falafels around town.", "rating": 3, "date": "2010-03-23"}, {"excerpts": ["I opt for the Shawarma, even though I think it's a ripoff.  ", "But wait - waiter says - they don't actually cook this the way you do shawarma - on a rotating grill like a gyro.  ", "No, this is just sauteed chicken.  ", "WTF?!?!  ", "Then don't call it shawarma.  ", "Heck ", "no, I ain't getting sauteed chicken - what is that even?  "], "author": "Tamar F.", "review": "I hate to hate on my fellow tribe members, but man is this place a big letdown.  In my summer in the Bay Area, I never once visited the \"only kosher restaurant in San Francisco.\"  Nope, it was kosher meat from Trader Joe's for me.  And yes, I passed this many a time, but just never had the urge to step foot in the restaurant.  \n\nHowever, when I had to go up to San Fran for work this week, I was meeting a friend with food allergies who suggested this place (since it would be guaranteed to not have any dairy products).  Okay, Israeli kosher food, I can deal.\n\nSabra is located at the edge of Chinatown and you have to walk up a flight of stairs to get there.  The ambiance is non-existent.  I've been to my fair share of zero-ambiance kosher restaurants, a result of having family in many Orthodox neighborhoods where \"kidproofing\" a restaurant is a much better investment than decor, but this seemed even worse.  It felt like I was in seminary at one of those Beit Midrashes (i.e. study hall at Yeshiva).  The tablecloths seemed jaded, and were covered in outdated Israel postcards with a layer of glass on top.  The artwork on the walls was a mish-mosh of Judaica.  And there were laminated numbers denoting the tables, which had metal-backed chairs that I only regularly see when I go to a shtiebel for High Holidays.  (Finally, a Yelp review where I can put my yiddish lingo to good use.)\n\nOkay, so we go up the stairs and sit down at one of the tables.  We get our menus.  Sandwiches are only for lunch or to-go, which was a bummer since this would have been a great option.  Oh well.  But a kebab?  Over $20!  Are you friggin' kidding me?  I go to my kosher meat market in West LA all the time, and a grilled-to-order kebab is $6 or less.  And even that has more ambiance than this place, so I can't say that I'm paying for atmosphere, as I may at an upscale locale.  \n\nSo we go through the menu.  Our third dining companion has a strong allergy to wheat, and couldn't have anything touching flour.  I know what you're thinking - one kosher gal, another allergic to dairy, and another flour.  It's like a joke waiting to happen, but given the menu, this place should have been quite accommodating - especially since they weren't serving sandwiches.\n\nThe waiter (dressed in a dirty tee and jeans) came to take our order.  I opted for the Shakshukah, which is an Israeli egg dish.  Oh wait, they're out of that.  Darnit.  Okay, I have to look back at the menu, since I refuse to spend $20 on a dish here.  The girl with the flour allergy orders an omelet, but asked not to be served the accompanying fries because she's hella allergic.  And stated and restated this at least five times to the dude.  No pita, no fries - kapiche?  The third one got schnitzel.\n\nSo then it's back on me to order.  I opt for the Shawarma, even though I think it's a ripoff.  But wait - waiter says - they don't actually cook this the way you do shawarma - on a rotating grill like a gyro.  No, this is just sauteed chicken.  WTF?!?!  Then don't call it shawarma.  Heck no, I ain't getting sauteed chicken - what is that even?  So I cave and order Melawach, which is a flaky Yemenite pastry I usually cook at home for under 50 cents a pop.  \n\nAs we order he asks if we'd like to start with an order of hummus and although it's also overpriced ($8) we say okay.  \n\nThe hummus never came.  The omelet came covered in the fries, despite that the diner belabored the point.  When she pointed this out to the waiter (who was the only guy covering the dining area), he just looked at her and was like \"is this really such a big deal?\" and returned with a plate to put the fries on... even though she explained that now she'd have to cut away all of the parts touching the fries.  The melawach was okay - it came with unseasoned minced tomatoes, though it traditionally also includes an egg of sorts which was missing.  So not worth the money.\n\nAnd then we get the check, a good 20 minutes after we asked.  Oh wait, they charged us for our nonexistent hummus.  Of course, we wouldn't known that had I not been able to read Hebrew, since that's what our order was written in with no English line-items.  I pointed this out and the waiter reluctantly removed the item.\n\nSo $45 for an omelet, a pastry topped in tomato, and a chicken cutlet.  In a place less comfortable than eating at a cubicle and with a rude waiter.  I've dealt with expensive restaurants (that are usually worth it), rude waitstaff, and unwelcoming restaurants.  But with that trifecta and mediocre (at best) food, the only reason I can see why this place is in business is because it's the. only. kosher. restaurant. in. San. Francisco.", "rating": 1, "date": "2010-03-16"}, {"excerpts": ["The shawarma isn't really shawarma ", "but it was tasty. ", "It's a bit on the pricy side but was craving kosher meat."], "author": "Nurit Z.", "review": "It may be the only kosher reaturant in SF. Very friendly staff and good service. The hummus was demi decent. The shawarma isn't really shawarma but it was tasty. It's a bit on the pricy side but was craving kosher meat.", "rating": 5, "date": "2015-04-26"}, {"excerpts": ["The shawarma was just chicken with onions, since when is that Shawarma? "], "author": "Heshy F.", "review": "For the first time in a decade, I got a shawrma sandwich in a pita that came with lettuce, but this was dole salad mix with the little shredded cabbage, it wasn't even good lettuce. The shawarma was just chicken with onions, since when is that Shawarma? The pita fell apart on me. \n\nEvery time I have walked into Sabra I felt as if they didn't want me their, the owner is extremely mean looking and the only redeeming quality is the guy working as a waiter is a nice dude, but the place is a shithole. You walk up creaky stairs and enter this restaurant that looks like a crack house and has the nerve to charge $27 for a steak and some rice. \n\nDon't give me that crap about SF not having kosher meat, save your money and go to the Kitchen Table in Mountain View if you want world class kosher food that is inexpensive. \n\nOh and you can only get a sandwich during lunch hours, get there too late and be forced to make all sandwiches into an overpriced platter.", "rating": 1, "date": "2010-02-08"}, {"excerpts": ["Perhaps the worst shawarma, customer service I have ever had. ", "The owner is very unprofessional and very mean."], "author": "Tufan A.", "review": "Perhaps the worst shawarma, customer service I have ever had. The owner is very unprofessional and very mean.", "rating": 1, "date": "2010-12-30"}], "one kabab": [], "one shishlik": [], "two hot dogs": [], "one shishlik lamb": [], "chicken breast grilled": [], "shnitzel": [{"excerpts": ["i've had the shnitzel (fried chicken), and came back a few days later for the lamb shishlik (lamb skewer), both were hella good. ", "Big plates, which surprised me when i got my food. ", "The waiter was chill too. ", "The only thing that would make the place better if the prices weren't so expensive."], "author": "David S.", "review": "Nice little place in downtown SF area. You walk up the stairs to a small dining area, full of Jewish artwork and decoration...it was pretty cool. Food was a little pricey, but worth it. i've had the shnitzel (fried chicken), and came back a few days later for the lamb shishlik (lamb skewer), both were hella good. Big plates, which surprised me when i got my food. The waiter was chill too. The only thing that would make the place better if the prices weren't so expensive.", "rating": 4, "date": "2012-04-19"}], "tuna": [], "fries  bag": [], "apple strudel": [{"excerpts": ["We washed it down with two slices of apple strudel shared among the three of us.  "], "author": "Joanna S.", "review": "I went here last night for the first time with two of my favorite men: an absolutely beautiful orthodox Danish man, and an impeccable man from Pasadena with a penchant for Boston beauties.  We were here to celebrate the completion of the writing of the Danish man's dissertation (this is the only restaurant in SF where you can get kosher meat for dinner).\n\nSo, we walk in and just seat ourselves.  Danish man speaks to the waiter in Hebrew and I ordered some vegetarian items on the menu.  Pickles came out first, which where sliced up sideways.  Ok, thanks for the nosh.  Then I had the potato salad.  The whole time I was eating it, I was thinking that it seemed more like egg salad?  There was a ton of mayo and I had to hunt to find the potatoes.  Not sure what the rest of it was, but I was definitely sorry that I had eaten so much of it toward the end of the meal. \n\nAfter that, I had the falafel.  There were eight falafel balls on a tray, and I had to ask for pita and hummus separately (for additional price) to complete my meal.  You would think they would have the sandwich on the menu?!   \n\nWe washed it down with two slices of apple strudel shared among the three of us.  Ever since that moment, I have been nursing a stomach ache.\n\nI feel bad giving only two stars to this establishment.  The owner seemed very nice.  But, sorry, the food just isn't good, and it is really expensive.  For the three of us, the bill came to $80.  No good.\n\nEdit - absolutely beautiful Danish man wants me to amend my review to state that his ribeye steak was $28, which is why the bill was so high.", "rating": 2, "date": "2008-02-01"}], "chocolate cake carrot cake": [], "fruit cocktail in season": [], "chilled watermelon in season": []}