{"bi cuon": [], "bo cuon": [], "ga cuon": [], "chien ca vien": [], "nep chien": [{"excerpts": ["I also do the Nep Chien (Vietnamese potstickers!) ", "or the Goi (salads-w/MEAT!).  ", "Occasionally I'm down there on weekends & have the time to go through the rest of the menu.  ", "That's a nice treat, but typically followed by a necessary nap.  "], "author": "Dino N.", "review": "Yes.  YES!\n\nI could seriously overeat here....& I typically come close to it when I am there.  For lunch, combos.  Pick one, you'll be all good.  \n\nWhat else?  I pretty much stick to the combos for lunch, has always been a winning choice.  I also do the Nep Chien (Vietnamese potstickers!) or the Goi (salads-w/MEAT!).  Occasionally I'm down there on weekends & have the time to go through the rest of the menu.  That's a nice treat, but typically followed by a necessary nap.  ^.o\n\nFishballs.  Yeah, I know.  Not a remarkable food, but I L-O-V-E the @#$ things!  Dammit.  They've got'em there.\n\nIt's a nice family place.  They'll feed you good & treat you well there.", "rating": 5, "date": "2010-10-15"}], "tom chien don": [], "banh xeo": [{"excerpts": ["Anyway, we did get the Banh Xeo, \"Henry's noodles,\" spring and imperial noodles, catfish and eggplant claypot, aka, the good stuff. ", "Henry's noodles are not on the menu, they made it especially for our group. ", "Everything was delicious! "], "author": "Em T.", "review": "Love the food, hate the wait! Good thing I know people who know people. Came here for lunch with my coworkers. Coming with a group of people is great because we can try out a variety of dishes. Coming with a bunch of pick eaters (non-chinese loving co-workers) is not so great because they'll order anything but authentic Vietnamese stuff (i.e. asparagus beef, fried shrimp...really?)\n\nAnyway, we did get the Banh Xeo, \"Henry's noodles,\" spring and imperial noodles, catfish and eggplant claypot, aka, the good stuff. Henry's noodles are not on the menu, they made it especially for our group. Everything was delicious! Solid food.  \n\nThis place is super busy, a bit crammed and probably not the cleanest restaurant in the city. Who cares, the food is amazing! P.S. even though there's a line, but service is quick, so it moves pretty quickly.", "rating": 4, "date": "2016-04-12"}, {"excerpts": ["I also really like the Banh Xeo (the crispy crepe).  "], "author": "Charissa N.", "review": "Whenever its a busy day at work, my co-workers and I are always eating from Sai's - it's our favorite restaurant! We are so happy that Sai's is only 1 block away - we can order from Sai's everyday if we like (and sometimes we have).  Over the years, I have tried many of their dishes - all are excellent - and my current favorite is the 80 with chicken - which is the vermicelli bowl with chicken and imperial rolls.  Sooo good.  I also really like the Banh Xeo (the crispy crepe).  Also, on a cold day, my all-time favorite is the Bun Cary Ga (curry chicken noodle soup) - which is totally delicious and it warms me up quickly. \n\nThere is usually a long line, especially on cold days, but it is well worth the wait.  The food comes fast and it is really good.  The service is friendly - and they all smile a lot.  Enjoy!!!", "rating": 5, "date": "2014-01-07"}, {"excerpts": ["They have a wide selection of Vietnamese dishes (not just pho) like banh xeo and clay pot rice. ", "Their pho was around $10 for a good portion in the FiDi area. "], "author": "Cheri S.", "review": "Good place for lunch if you're craving Vietnamese and you're in the Financial District. They have a wide selection of Vietnamese dishes (not just pho) like banh xeo and clay pot rice. Their pho was around $10 for a good portion in the FiDi area. The soup was hot and flavorful and there were generous amounts of steak meat--just how I like it.\n\nThe service wasn't all that great since I had to ask twice for tea and the seating was cramped. but that's understandable since it was rush hour and it's one of those eat-and-go lunch places.", "rating": 3, "date": "2013-02-25"}, {"excerpts": ["banh xeo (Vietnamese crepe, although a bit messy), imperial rolls, pho ga (that's chicken pho to you)."], "author": "Quyen T.", "review": "Sai's is not the best Vietnamese restaurant I've ever been, but it's decent, fast and cheap (dishes are $10 or less).  The owners are Chinese/Vietnamese and are friends of friends.  On that account, I have to support.  Best of all, it's about 2 blocks from work.\n\nAnyway, the secret is to show up at 11:30 - otherwise you're going to be sh*t out of luck!  The line will be too much to handle.  Service is not great (servers are too busy to pay attention to you), but you just have to get their attention and you'll get what you need.\n\nRecommended dishes:  banh xeo (Vietnamese crepe, although a bit messy), imperial rolls, pho ga (that's chicken pho to you).", "rating": 4, "date": "2007-03-28"}], "goi muc": [], "goi sua tom": [], "goi bo nuong": [], "goi heo nuong": [], "hu tieu tom cua": [], "pho bo": [{"excerpts": ["I was contemplating between ordering either the rice claypot with chicken and shrimp OR the pho bo. "], "author": "Erica K.", "review": "Sai's is conveniently located nearby my workplace, and I was currently craving Vietnamese food. I was contemplating between ordering either the rice claypot with chicken and shrimp OR the pho bo. I went with the latter and ordered it from my office.\n\n-They told me my order would be done within 10-15 minutes, the typical wait time for a takeout order of pho. Although I gave it time and walked slowly from my office, I still had to wait in the restaurant, which was fine. They accept cash and card as payment, which is perfect considering that some Asian restaurants are cash only.\n\nI didn't know what to expect since I've never ordered takeout pho. I didn't want to pay tips, and I've read previous reviews of sanitary issues. Upon eating the pho from its plastic container, I noticed that the noodles were clumped together, and the ingredients were mainly on the top, inconvenient with the soup ratio. It was delicious, probably because I was craving pho. I would go back in person to eat at Sai's, and probably try the rice claypot with chicken and shrimp.", "rating": 5, "date": "2018-01-28"}, {"excerpts": ["There aren't many options as far as pho goes, but I got a Pho Bo (beef pho), which had beef balls and brisket (I think). ", "You don't get a choice of what cuts of meat or size of pho you want. ", "Nonetheless, it was filling and warming on a cold rainy San Francisco day. ", "My friend got the Imperial Rolls which were perfectly fried and tasty. ", "Even during a holiday work week, it was busy. ", "During a regular work week, I imagine there's a line out the door."], "author": "Annie L.", "review": "For the financial district, this is a decently-priced Vietnamese restaurant. There aren't many options as far as pho goes, but I got a Pho Bo (beef pho), which had beef balls and brisket (I think). You don't get a choice of what cuts of meat or size of pho you want. Nonetheless, it was filling and warming on a cold rainy San Francisco day. My friend got the Imperial Rolls which were perfectly fried and tasty. Even during a holiday work week, it was busy. During a regular work week, I imagine there's a line out the door.", "rating": 4, "date": "2015-12-30"}, {"excerpts": ["I ordered the pho bo (beef pho), Boyfriend ordered the bo kho (beef stew with noodles) and Boyfriend's mom got a curry fish dish (can't remember/find the name). ", "Our food took forever to come out, which sucks. ", "Granted, they were pretty busy, but nothing that warranted for the curry fish dish to come out first ", "about 15 minutes after we order and THEN the pho and the beef stew didn't come out for another 15 minutes after that. "], "author": "Anna W.", "review": "I came here for lunch with the Boyfriend and his mom last week and I was honestly skeptical as they were walking me through the door. I'm kind of picky when it comes to my Asian food venues. It also didn't help that Boyfriend mentioned that this place had previously had a rodent problem? I mean, nothing necessarily looked out of place and nothing was overtly dirty -- at least, no more than you would typically expect at such an establishment (I know you know what I'm talking about).\n\nI ordered the pho bo (beef pho), Boyfriend ordered the bo kho (beef stew with noodles) and Boyfriend's mom got a curry fish dish (can't remember/find the name). Our food took forever to come out, which sucks. Granted, they were pretty busy, but nothing that warranted for the curry fish dish to come out first about 15 minutes after we order and THEN the pho and the beef stew didn't come out for another 15 minutes after that. I honestly think the waiter forgot our food hadn't arrived.\n\nTaste-wise, the food is what you expect it to be. I liked my pho fine, but it's no better or worse than the pho I've had in the East Bay. Granted, I think it's fairly difficult to screw up pho, but I could be wrong. The curry fish was really good, too, and I may order that next time instead since it was more flavorful than what I ate.\n\nOverall, it's a solid Vietnamese place near the FiDi. I don't think it's worth the down-the-street line, but if you want to score a table then get here early (I'd recommend 11:30am).", "rating": 4, "date": "2013-11-20"}, {"excerpts": ["I used to think it odd, but now I miss the pages upon pages of the various beef part combination options for Pho Bo at other restaurants.  "], "author": "Adam B.", "review": "Possibly the only pho place in the FiDi open past dusk.  It's obviously not going to be better than places in Little Saigon so don't even try to form such expectations.  An extensive menu of Vietnamese dishes are decently prepared.  Perfect for FiDi residents looking for a close and inexpensive dinner option.  This place is truly \"A-OK\"!\n\nImperial Rolls: Funny how the name sounds so regal whereas the reality is simply something deep fried... a style of cooking consumed by folks far from regal in this country!  This is a standard dish at most Vietnamese restaurants, but their preparation pleasantly surprised me.  The rolls were thinner than usual for a higher crunch-to-pork ratio.  Also, some parts were lightly fried and some heavily fried for a nice texture variation.\n\nPan Fried Crispy Crepe w/ Shrimp & Chicken: Not on all Vietnamese menus, Bánh Xèo is always a welcomed appetizer.  The coconut/turmeric crepe was light and crispy.  The shrimp had been pan fried for good browned edges.  The chicken was ok and they went a tad crazy with the bean sprouts.  So much going on and so yummy.  \n\nBeef Pho: No tripe, no tendon: fine by me!  No flank and no brisket: huh?  A very minimalist soup of thin eye round (mostly cooked and barely any rare sections) and meat balls.  I used to think it odd, but now I miss the pages upon pages of the various beef part combination options for Pho Bo at other restaurants.  Once you get over the one-pho-for-all communism, you can appreciate the tasty broth and ample portions of beef.\n\nLemonade: Why do Vietnamese restaurants always give me limeade when they advertise lemonade?  However, it is quite refreshing and tastier than lemonade (except for meyer lemonade).  Thankfully they don't make the same substitution mistakes serving tofu instead beef, else I'd be saddened by the loss in translation.", "rating": 3, "date": "2009-10-06"}], "pho ca and bo vien": [], "bun cary ga": [{"excerpts": ["My choice was Pho Bun Cary Ga, chicken curry soup with thin vermicelli.  \n\n"], "author": "Amigo K.", "review": "Sai's is Great! NOT \"Bare Bones\"!  They have been hustling at this leased location for 32 years.  Mom & Dad retired now.\n\nI came to S.F. to visit a gov't building. On my mind was getting some good chow, at some point.  Some point ended up down the road.  The office had moved twice in one year, not updating Google Maps.  I asked S.F. bus drivers where Stevenson St was, but it turned out to be a side street.\n\nI had walked past SAI'S at lunchtime, it was packed. Much later now, 7:00 PM, it was raining.  I passed by Sai's on my way back to my car.  A Vietnamese lady was exiting Sai's with a to-go dinner.  I had eaten a sandwich earlier, but a steamy bowl of pho soup would be perfect with this rain.\n\nI asked her opinion of Sai's.  She said Sai's was awesome, her favorite!  My stomach went SURVEY SAYS: *ding!* PHO!!  My choice was Pho Bun Cary Ga, chicken curry soup with thin vermicelli.  \n\nYams, squash, & taro in a mild yellow curry broth, with Huge chunks of chicken & thin vermicelli.  Mmmmm!  Thai basil, jalapeno slices, & lemon wedge on the side. You can request free fresh bean sprouts.\n\nI felt comfortable, like at a friend's home.  Sai's is sensible, not \"bare bones\".  Look at the photos mounted on the wall, Hmong people smiling. \n\nNow, lunchtime.... is Not so \"homey.\"  Monday through Friday the Financial District locals crash the gates like an army .  The Sai kitchen gets stressed as they try to accommodate all the Fi-Di peeps on their lunch hour.  Juggle your schedule to avoid this Rush Hour, and enjoy some home cooking from Sai's.", "rating": 5, "date": "2018-04-06"}, {"excerpts": ["Also, on a cold day, my all-time favorite is the Bun Cary Ga (curry chicken noodle soup) - which is totally delicious "], "author": "Charissa N.", "review": "Whenever its a busy day at work, my co-workers and I are always eating from Sai's - it's our favorite restaurant! We are so happy that Sai's is only 1 block away - we can order from Sai's everyday if we like (and sometimes we have).  Over the years, I have tried many of their dishes - all are excellent - and my current favorite is the 80 with chicken - which is the vermicelli bowl with chicken and imperial rolls.  Sooo good.  I also really like the Banh Xeo (the crispy crepe).  Also, on a cold day, my all-time favorite is the Bun Cary Ga (curry chicken noodle soup) - which is totally delicious and it warms me up quickly. \n\nThere is usually a long line, especially on cold days, but it is well worth the wait.  The food comes fast and it is really good.  The service is friendly - and they all smile a lot.  Enjoy!!!", "rating": 5, "date": "2014-01-07"}], "sup mien ga": [], "bun cary de": [], "bun ko kho": [], "canh chua ga": [], "f canh chua ca": [], "s canh chua tom": [], "ga ngu vi huong": [], "cary com": [], "ga nuong xa ot": [], "ga xao nam": [], "ga xao rau cai": [], "ga xao cary": [], "ga xao hot dieu": [], "ga xao mang tay": [], "ga xao dau que": [], "ga xao ca tim": [], "ga chua ngot": [], "bo nuong xa": [], "bo xao sa te": [], "bo xao gung": [], "bo xau rau cai": [], "bo kho": [{"excerpts": ["I ordered the pho bo (beef pho), Boyfriend ordered the bo kho (beef stew with noodles) and Boyfriend's mom got a curry fish dish (can't remember/find the name). ", "Our food took forever to come out, which sucks. ", "Granted, they were pretty busy, but nothing that warranted for the curry fish dish to come out first ", "about 15 minutes after we order and THEN the pho and the beef stew didn't come out for another 15 minutes after that. "], "author": "Anna W.", "review": "I came here for lunch with the Boyfriend and his mom last week and I was honestly skeptical as they were walking me through the door. I'm kind of picky when it comes to my Asian food venues. It also didn't help that Boyfriend mentioned that this place had previously had a rodent problem? I mean, nothing necessarily looked out of place and nothing was overtly dirty -- at least, no more than you would typically expect at such an establishment (I know you know what I'm talking about).\n\nI ordered the pho bo (beef pho), Boyfriend ordered the bo kho (beef stew with noodles) and Boyfriend's mom got a curry fish dish (can't remember/find the name). Our food took forever to come out, which sucks. Granted, they were pretty busy, but nothing that warranted for the curry fish dish to come out first about 15 minutes after we order and THEN the pho and the beef stew didn't come out for another 15 minutes after that. I honestly think the waiter forgot our food hadn't arrived.\n\nTaste-wise, the food is what you expect it to be. I liked my pho fine, but it's no better or worse than the pho I've had in the East Bay. Granted, I think it's fairly difficult to screw up pho, but I could be wrong. The curry fish was really good, too, and I may order that next time instead since it was more flavorful than what I ate.\n\nOverall, it's a solid Vietnamese place near the FiDi. I don't think it's worth the down-the-street line, but if you want to score a table then get here early (I'd recommend 11:30am).", "rating": 4, "date": "2013-11-20"}], "bo xau ca tim": [], "bo xau dau hu ca chua": [], "bo loc lac": [], "bo xau dau que": [], "bo xau mang tay": [], "bo xau cai trang": [], "bo xau bong cai": [], "ccf ca xao cary": [], "ssf chua ngot": [], "chien muoi tieu": [], "tom chua ngot": [], "tom muc xao lang": [], "tom xao dau que": [], "tom xao mang tay": [], "tom xao rau cai": [], "tom xau nam": [], "tom xau ca tim": [], "tom xau bong cai": [], "tom xau xa ot": [], "tom xao hot dieu": [], "muc xau rau thom": [], "muc xau xa ot": [], "bcs tom xau cai trang": [], "com heo nuong": [], "com suon nuong": [], "heo xao rau": [], "heo xao ca tim": [], "heo xau lang": [], "heo xau nam dong co": [], "cary de": [], "n imperial rolls": [], "imperial rolls and pork": [{"excerpts": ["Other good choices include the imperial rolls, fresh spring rolls withshrimp (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=67T22k-DXpOvVJEbRSE6fQ), Vietnamese \"potstickers\", sauteed mixed vegetables (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=8q-EaHfZBYDCh2dfbKH4Wg), bun with imperial rolls and pork (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=RYnkkR04S0gpz9mjhxUkYw), beef stew noodle soup (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=teMiyofONhsHWRdt0xSHMg), and beef pho (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=Is3NxRcak9L95jPWhZwlIg). ", "They're all pretty decent which says alot about the place. ", "There aren't too many dessert options and the eat-and-go lunch crowd rarely orders it "], "author": "Jon L.", "review": "It wasn't love at first sight, or taste in this case, but Sai's has quickly evolved into a default spot for lunchtime Asian comfort food to combat cold and damp SF afternoons. \n\nI avoided Sai's for a while after my first experience becuase they didn't seperate the noodles from the broth when I order it to go which meant soggy noodles. Meh. But through the persistence of, and devotion to the place by my colleagues, I've come to enjoy some key dishes here. \n\nFirst, every cold day requires the curry chicken/beef-stew noodle soup. (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=Mpm8m5_SikWJxUealEaa9w) Alternatively you can switch out noodles for rice. Like all good South East Asian curries, it's a rich coconut milk based curry, not too spicy, just a soul warming meal. While the chicken is more typical, I really like the beef stew - the slow braised meat just falls apart in your mouth. \n\nThe next go-to choice is the chicken and shrimp claypot rice. (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=PoY8g3eW4rl_8P9gnc0VUg) It's a nostalgic taste perhaps but the combination of shrimp, chicken, bok choy, and crispy rice covered in hoisin sauce just hits the right spot. The secret we believe has to be salted fish. We know it's in there somewhere for a little more savory oomph. \n\nOther good choices include the imperial rolls, fresh spring rolls withshrimp (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=67T22k-DXpOvVJEbRSE6fQ), Vietnamese \"potstickers\", sauteed mixed vegetables (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=8q-EaHfZBYDCh2dfbKH4Wg), bun with imperial rolls and pork (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=RYnkkR04S0gpz9mjhxUkYw), beef stew noodle soup (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=teMiyofONhsHWRdt0xSHMg), and beef pho (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=Is3NxRcak9L95jPWhZwlIg). They're all pretty decent which says alot about the place. There aren't too many dessert options and the eat-and-go lunch crowd rarely orders it but if you must have a sweet treat, the fried bananas and ice cream (http://www.yelp.com/biz_photos/IaDXv2ZNo2HUeTatlsjMsw?select=cFbF-sCEpvEMO3hvjOp68Q) are decent. \n\nI've slowly grown to like Sai's as a satisfying lunch spot. It gets line-out-the-door crowded during the peak times of noon-1.30pm but here's a tip if you're in a larger group, you can actually call ahead to get a table; just make sure your whole party shows up at said time.", "rating": 4, "date": "2012-01-22"}, {"excerpts": ["I went with the imperial rolls and pork.  ", "I really enjoyed it and give it a decided edge over the same dish at Golden Star.  ", "The pork bits weren't as questionable as those I find in GS's version.\n  \n", "Service was fast and frenzied during this lunch hour, but my cup of tea was never unattended.  ", "I vow multiple return trips here."], "author": "Daryl E.", "review": "I got a seat right next to the cash register.  Actual quote from a newbie ordering takeout:  \"Oh, cool, I SO didn't know this was even a Vietnamese place.  I'm SO fu$&ing going to eat here all the time.\"  You go, dude.\n\nAnyway, my bowl of bun was a big bowl of fun!  I went with the imperial rolls and pork.  I really enjoyed it and give it a decided edge over the same dish at Golden Star.  The pork bits weren't as questionable as those I find in GS's version.\n  \nService was fast and frenzied during this lunch hour, but my cup of tea was never unattended.  I vow multiple return trips here.", "rating": 4, "date": "2008-03-28"}], "c imperial rolls and chicken": [], "b imperial rolls with beef": [], "grill prawns": [], "n bbq pork": [], "n bbq beef": [], "n grilled chicken": [], "n  spices roast chicken": [], "v vegetarian mixed vegetables": [], "cn   mi don": [], "jc joels classic with chicken": [], "vcn vegetarian mi don": [], "js joels classic with prawns": [], "ga kho to xa ot": [], "spc tom heo kho to": [], "ca kho to": [], "com chien hai san": [], "com chien ga": [], "com chien bo": [], "com chien heo": [], "mi xao thap cam": [], "mi xao tom": [], "v canh chua chay": [], "v goi cuon chay": [], "v goi chay": [], "v dau hu xao lang": [], "v dau ve xao tau xi": [], "v mang tay xao tau xi": [], "v dau hu xao ba nam": [], "v ca tim xao dau toi": [], "v dau hu xao chua ngot": [], "v dau hu xao xa ot": [], "v dau hu xao gia": [], "v rau xao thap cam": [], "v rau thap cam cary": [], "v mien xao chay": [], "v com chen chay": [], "v mi xao chay": [], "v bun xao chay": [], "v bong cai xao nam": [], "sp curry fish noodle soup": [], "sp curry beef stew": [], "sp rice in claypot with shrimp and chicken": [], "spc fresh mango chicken": [], "spb fresh mango beef": [], "sp bun rieu": [], "gbc garlic basil chicken": [], "gbb garlic basil beef": [], "gbp garlic basil pork": [], "spr grilled pork chop and shrimp over rice bowl": [], "spn grilled pork chop and vermicelli bowl": [], "spc sesame chicken": [], "sps sesame prawns": [], "sp lemon grass beef vermicelli bowl": [], "vn vietnamese ice coffee": [], "tt thai ice tea": [], "ln lemonade": [], "s water sparkling water glass bottle": [], "soy soybean milk": [], "coca cola classic": [], "coco coconut soda": [], "lagunitas denogginizer double ipa": [], "tsingtao": [], "ballast point sculpin ipa": [], "blue moon belgium white": [], "c combination": []}