{"agedashi": [], "wakame": [{"excerpts": ["Two stars for hot tea and wakame salad."], "author": "Jay H.", "review": "_    ~~   ~~    _  _     __   __    _    /\\\n \\ \\_(__)(__)_/ /..\\ \\_(__)(__)_/ /.. /  /   ...\n  \\_________/     \\_________/    \\_\\ (_)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nI felt like going Titanic on their lame sushi boats.  Boring sushi, boring taste, boring all over the place.  \n\nTwo stars for hot tea and wakame salad.", "rating": 2, "date": "2007-11-30"}, {"excerpts": ["There are some items on the boats which are good, such as the special rolls with wakame. ", "But more often than not, the salmon and hamachi are not very fresh."], "author": "J K.", "review": "This place is almost always packed, with long waiting lists on Fri and Sat nights. I've been here several times, and found that the quality of the sushi on the floating boats is getting worse every time. There are some items on the boats which are good, such as the special rolls with wakame. But more often than not, the salmon and hamachi are not very fresh.", "rating": 2, "date": "2007-07-27"}], "caiamari rings": [], "jelly fish": [], "soft shell crad": [], "chicken katsu breaded chicken": [], "unagi kabavaki": [], "amaaebi": [], "broccoli": [], "itago baby octopus": [], "ebi salad": [], "tai": [], "fresh salmon": [{"excerpts": ["I love the Fresh Salmon and some baked fish stew thing that they make. ", "Sake and beer is cheap and the waitresses are cool, in there white shirt and tie. ", "All they need is a pleated skirt and they would have that school girl look. ", "Sorry, didn't mean to be a man, but you guys know what I mean. ", "I'll be back."], "author": "Moby L.", "review": "This is the best Sushi boat place I have ever been to. The dishes are cheap and with better quality most regular Sushi bars. That is rare. I love the Fresh Salmon and some baked fish stew thing that they make. Sake and beer is cheap and the waitresses are cool, in there white shirt and tie. All they need is a pleated skirt and they would have that school girl look. Sorry, didn't mean to be a man, but you guys know what I mean. I'll be back.", "rating": 4, "date": "2010-04-22"}]}