{"vegetarian spring rolls": [], "steamed pot  stickers": [], "pot  stickers": [], "water dumpling": [], "fried beef": [{"excerpts": ["Other favorites are the fried shrimp, fried beef (tangsooyuk), green beans, clams in black bean sauce, and sizzling rice soup. "], "author": "Greg J.", "review": "I am amazed at the poor reviews this restaurant gets.\n\nThis has been my family's favorite restaurant for Sunday dinners for years. There are many specialty dishes here that I believe are sub par if ordered anywhere else. And just to clarify, this place is not a traditional Chinese or a traditional Korean restaurant. It's a unique and delicious blend of both, and is pretty much it's own genre of Asian cuisine.\n\nA personal favorite is the chicken wings. This is really one of my favorite dishes ever and I enjoy these so much more than San Tung. They are smothered in sauce/green beans that is just to die for, yum. Other favorites are the fried shrimp, fried beef (tangsooyuk), green beans, clams in black bean sauce, and sizzling rice soup. It's best to eat here family style and order all of the above! \n\nA paragraph needs to be devoted to the jajangmyeon at this place. In all honesty, it is my favorite place to get jajangmyeon. There is so much flavor and the sauce is loaded with so many goodies like shrimp, onion, etc. When you finish all the noodles, you could mix this sauce with rice. Honestly, you could do this with ANY sauce at this restaurant.\n\nMy family enjoys everything at this restaurant down to the kimchi they serve beforehand (not typical Korean style, but so good!). The service is good, especially now that my family and I are regulars.\n\nSeriously, this is a place that never disappoints me and my family. Perfect flavor, huge quantities, at a reasonable price. You should definitely give this place a visit if you're a fan of (overhyped) San Tung and their chicken wings.", "rating": 5, "date": "2015-02-17"}, {"excerpts": ["The Szechuan beef tasted like deep fried beef in some kind of honey sweet sauce. ", "The beef is coated in flour and deep fried. ", "What you think is beef, is actually bundles of just flour, deep fried. ", "Yup. ", "Can't tell how much beef there was in that dish. ", "I'd say only about 10% beef and the rest is flour batter deep fried. ", "And even those were tasteless. ", "Epic fail."], "author": "L T.", "review": "Size of portion: 10 out of 10\nEverything else: 1 out of 10 and that's being generous.\n\nWe ordered the twice cooked pork which was too sweet. The pork made up about 15-20% and the rest is vegetables. The Szechuan beef tasted like deep fried beef in some kind of honey sweet sauce. The beef is coated in flour and deep fried. What you think is beef, is actually bundles of just flour, deep fried. Yup. Can't tell how much beef there was in that dish. I'd say only about 10% beef and the rest is flour batter deep fried. And even those were tasteless. Epic fail.", "rating": 1, "date": "2016-05-09"}, {"excerpts": ["Fried Beef - I really like this dish. ", "This too has a lot of garlic, but its also stir fried with onions and chives and it has a really good flavor to it\n", "- Black bean sauce noodles - ", "I'm just not a fan of these noodles, but this was OK.\n", "-Jap", "-Chae-  ", "I really liked this too, this had great flavor and isn't as dry as regular korean jap-chae's.\n", "-Spicy ", "Seafood noodle soup ", "- This is too spicy for me..", "so I did not enjoy it as much. ", "But my bf really likes it...but he can handle spicy.\n", "-Hot ", "Braised Tofu - This was pretty good. ", "A little on the saucy side..but good with rice.\n", "-Pot "], "author": "Betty S.", "review": "Came here a few times now...when I first came here I wasn't a fan of this place. But overtime I've really grown to like it. Seating here is easier than San Tung..I've never had to wait! there's always a table whenever I get here. This is like a korean/chinese fusion place. They automatically serve you kim-chee and onions with this black bean sauce when you sit down.\nDishes I've tried:\n\n-Dry Fried Chicken wings- this was OK. Not the same as San Tung's at all. This had much more Garlic and did not have the sweetness to it. \n-Dry Fried Beef - I really like this dish. This too has a lot of garlic, but its also stir fried with onions and chives and it has a really good flavor to it\n- Black bean sauce noodles - I'm just not a fan of these noodles, but this was OK.\n-Jap-Chae-  I really liked this too, this had great flavor and isn't as dry as regular korean jap-chae's.\n-Spicy Seafood noodle soup - This is too spicy for me..so I did not enjoy it as much. But my bf really likes it...but he can handle spicy.\n-Hot Braised Tofu - This was pretty good. A little on the saucy side..but good with rice.\n-Pot Stickers - I didn't like the pot stickers here at all. \n\nOverall, service is okay...food comes out quickly and the portions are really big! Parking can be a little difficult because its around japantown, but nothing too bad.", "rating": 3, "date": "2010-12-29"}, {"excerpts": ["Dry fried beef is the best. "], "author": "W. T.", "review": "Very good Korean-influenced Chinese food. Milder and more flavorful than the food at the cursed Cantonese restaurants that plague the city. There is absolutely nothing wrong with good Cantonese food; unfortunately, the kind that prevails in the city is the wrong kind: oily, deep fried, poor ingredient quality, uncreative. The same can be said of most American food, I suppose - and maybe these Cantonese restaurants are simply cooking for that audience. But I digress.\n\nSan Wang is known for its dry-fried series of dishes (beef, shrimp, chicken, etc.) Dry fried beef is the best. They also have great soups - try the San Wang soup noodles or Ta Lo noodles. You can taste the clams in the broth, the ingredients are fresh, quantity is plentiful, and you don't feel thirsty or sleepy after eating. That's because they go easy on the MSG (or they don't use MSG at all - I did not detect any).\n\nService is decent as well, and so is the price. We have been going here for years and will keep coming back.", "rating": 4, "date": "2011-11-19"}], "hot and sour soup": [{"excerpts": ["As a lunch special for 9.95 it came with a big bowl of rice, a big bowl of Kimchi, tea and hot and sour soup."], "author": "Tim P.", "review": "Been here twice and really pleased with the food each time. Some out of the ordinary items on the menu such as jellyfish but also interesting combinations of things. \n\nToday I went vegetarian with a dish combining bamboo shoots, pea sprouts, broccoli and shiitake mushrooms in a light brown sauce. It's delicious. \n\nAs a lunch special for 9.95 it came with a big bowl of rice, a big bowl of Kimchi, tea and hot and sour soup.", "rating": 4, "date": "2017-08-02"}, {"excerpts": ["Not wanting to be stuffed at work, I order the Dry fried chicken wings (https://www.yelp.com/user_local_photos?select=Tu2Fn5Rg3dU0WnPAYVsinw&userid=saJuyv784apZzH--psHZ3Q) and the hot and sour soup (https://www.yelp.com/user_local_photos?select=HlutbfCeg_GaD_eb7zlGDA&userid=saJuyv784apZzH--psHZ3Q).\n\n", "Starting with the hot and sour soup, my first impression was that the flavors were subtle, not an in-your-face vinegar sour or pepper hot spicy.  ", "Mainly I enjoyed that there was a variety of ingredients though one old time favorite was missing (Kum choy in Cantonese).  "], "author": "Mike C.", "review": "What do you eat when in Japantown?\n\nWell, you'd think the normal response is, duh, Japanese food?!  \nIn my pre-20's, besides having countless bowls of udon in the mall, we actually dined at the original Korean House, up the stairs on Post near Laguna.  We also sometimes came here, a Chinese restaurant with a Korean influence... gee, sounds like a popular place on Irving Street.\nThey used to have a second restaurant on Clement near 25th Avenue.  \n\nBack to this place, I've been shopping in the neighborhood a bit more often and, after parking, pass this restaurant seeing a decent amount of diners enjoying their meals. On a recent planned shopping trip, I called the restaurant and ordered my lunch.  When I tried to order it in Mandarin (knew that their cuisine was northern style), I was surprised to learn the lady who answered spoke took my order in English (I believe she is Korean).   Their two staple dishes are their fried chicken wings and Ja jiang mein (noodles in plum sauce).  Not wanting to be stuffed at work, I order the Dry fried chicken wings (https://www.yelp.com/user_local_photos?select=Tu2Fn5Rg3dU0WnPAYVsinw&userid=saJuyv784apZzH--psHZ3Q) and the hot and sour soup (https://www.yelp.com/user_local_photos?select=HlutbfCeg_GaD_eb7zlGDA&userid=saJuyv784apZzH--psHZ3Q).\n\nStarting with the hot and sour soup, my first impression was that the flavors were subtle, not an in-your-face vinegar sour or pepper hot spicy.  Mainly I enjoyed that there was a variety of ingredients though one old time favorite was missing (Kum choy in Cantonese).  If you do not have a high tolerance to heavy flavors or spiciness, you'll enjoy this.\n\nNow, the chicken wings are another story.  I noticed several reviewers compared this version to that Irving Street place and the best description is that they are different.  Where San Tung (and So, for that matter), it's all about the flavors in the batter, the star of San Wang's wings are the trimmings or condiments that accompany the chicken. The ingredients are garlic slices, Szechuan peppers (which I removed), scallions, and ginger in a tangy yet sweet sauce.  The wings are not heavily battered so they are lighter on the palate, yet still just as addictively good.  Let's just say that, after finishing the chicken, I spooned some rice to top with those ingredients.\n\nOld time place that still works.  Be warned that prices have increased and, in studying the takeout menu, dining in for lunch is probably the best deal in enjoying their variety of dishes.  Yes, I will be back and you can bet the wings will be one of my dishes.", "rating": 4, "date": "2017-03-30"}, {"excerpts": ["Amazing Chinese/Korean food - chajang myun, hot and sour soup, sweet and sour pork, and dry fried shrimp! ", "That's all I've gotten here for 20 years "], "author": "Brandon F.", "review": "I've been coming here since I was a kid in the 90s. Amazing Chinese/Korean food - chajang myun, hot and sour soup, sweet and sour pork, and dry fried shrimp! That's all I've gotten here for 20 years and it's always awesome. \n\nThat being said, it's a hole in the wall that's ran by the family. Don't let that scare you away from this hidden gem in the heart of Japan Town!", "rating": 5, "date": "2018-05-13"}, {"excerpts": ["Always get Hot and Sour soup"], "author": "John O.", "review": "My favorite Chinese in Bay Area \nEat here about once a month even tho I live down on the Peninsula \nClean but stark surroundings \nTV always has the game on\nLove beef and green beans\nAlways get Hot and Sour soup", "rating": 5, "date": "2018-05-16"}, {"excerpts": ["So far we've loved everything we've tried: the hot and sour soup (nicely peppery), Mongolian Beef (not the nice sauce I get at my other fave spot but pretty and tasty), Noodles in Plum Sauce (something that sounds so plain yet is packed with delicious bits of shrimp etc.), Dry Fried Chicken (nice and crispy flavorful wings), Lemon Chicken (since they didn't have Orange Chicken), Eggplant with garlic sauce...shall I go on? ", "Walkable distance from my place ", "so it's also where I've gotten my takeout the last 2 Christmases. ", "Good portions, reasonable prices, beautiful presentation and yummy flavors! ", "I'd bump it up to 4.5 stars if I could ", "but since I save 5 stars for UNBELIEVABLE, 4 it is."], "author": "Bob S.", "review": "Stumbled upon this place by accident with a friend who lives nearby. We were headed elsewhere in Japantown for dinner but when passing the window there was a large party at the front table which was packed with some gorgeous looking dishes. Chinese food in Japantown? COUNT ME IN!\nSo far we've loved everything we've tried: the hot and sour soup (nicely peppery), Mongolian Beef (not the nice sauce I get at my other fave spot but pretty and tasty), Noodles in Plum Sauce (something that sounds so plain yet is packed with delicious bits of shrimp etc.), Dry Fried Chicken (nice and crispy flavorful wings), Lemon Chicken (since they didn't have Orange Chicken), Eggplant with garlic sauce...shall I go on? Walkable distance from my place so it's also where I've gotten my takeout the last 2 Christmases. Good portions, reasonable prices, beautiful presentation and yummy flavors! I'd bump it up to 4.5 stars if I could but since I save 5 stars for UNBELIEVABLE, 4 it is.", "rating": 4, "date": "2017-07-17"}, {"excerpts": ["I got the lunch special which came with hot and sour soup. ", "Unfortunately this soup was not hot nor sour. ", "Just kind of ... ", "MSG-y. ", "Next up was the beef and beans. ", "It wasn't terrible, but it was definitely meh. "], "author": "Philip W.", "review": "The definition of two stars is \"Meh. I've experienced better.\" And that's exactly what defined my lunch at San Wang. I'd always wanted to check it out because it looked like a nice place but I always passed it up for other restaurants around it. I think I will continue to do that. \n\nI got the lunch special which came with hot and sour soup. Unfortunately this soup was not hot nor sour. Just kind of ... MSG-y. Next up was the beef and beans. It wasn't terrible, but it was definitely meh. I've experienced better (see what I did there?).\n\nWhen it came time to pay, I was told there was a $20 minimum for credit card. That's a little bit high, especially when lunch special items are about $8 each. So you're telling me that if two people come in and order a lunch special, they still don't have enough to pay with credit card? \n\nAs far as I know, this is the only Chinese restaurant in JapanTown. Kind of unfortunate that they squander such potential.", "rating": 2, "date": "2014-01-02"}, {"excerpts": ["you would think this would be a can't go wrong dish, but naw.. they messed this up to with whatever sauce they added to the dish\n*hot and sour soup.. tasted like packaged soup ", "and they just added water\n", "*"], "author": "Emmett B.", "review": "The worst Chinese/Korean restaurant in the city.... yes, its pretty bad.\n\n* the free kim chee appetizer was underwhelming.  I've had better kim chee from a jar... seriously!\n* the chowmein, packaged noodles and with a bunch of random ingredients tossed together.. horrible\n* Mongolian beef - the WORST Mongolian Beef I've ever had.  No seasoning on the beef and way too much green onions.\n* Sauteed string beans- you would think this would be a can't go wrong dish, but naw.. they messed this up to with whatever sauce they added to the dish\n*hot and sour soup.. tasted like packaged soup and they just added water\n*Walnut shrimp.. the shrimp was good with good glaze and crunch, but the candied walnuts were separated on the side and ruined the dish.\n\nLastly service... nonexistent!", "rating": 1, "date": "2014-10-23"}, {"excerpts": ["The soups are good especially the Hot and Sour Soup. \n\n"], "author": "Alice S.", "review": "San Wang sits in a strange juxtaposition as a Chinese restaurant in Japantown owned by a Korean family. It is the strangest, but most delicious combination of food ever. San Wang is known for their dry-fried style of cooking. Their secret dry-fried recipe comes in various forms such as dry-fried chicken, shrimp, beef, scallops, squid, green beans, and eggplant. The chicken is especially popular as they are essentially large delicious fried chicken wings of magic. I recommend trying the dry-fried chicken and shrimp or the beans if you are a vegetarian. \n\nSan Wang also offers family-style meals that serve up to 10 people. The fanciest being the Peking Dinner for $159.99 that has an assortment of dishes as well as the much desired Peking Duck dish. \n\nThe appetizers aren't anything to write home about. The potstickers take an average of 15 minutes, which is well after all your entrees arrive at this quick turn-over establishment. Plus they taste as if they are previously frozen (the potstickers at Trader Joe's are better). The soups are good especially the Hot and Sour Soup. \n\nCome hungry and leave in a food-coma as San Wang serves up some of the best Chinese food outside of Chinatown. An average meal for two is $30-40.", "rating": 4, "date": "2012-05-07"}, {"excerpts": ["The hot and sour soup was neither.\n", "Service was friendly."], "author": "Sean W.", "review": "Since I think Chinese food in San Diego is mostly crap, one of the first things I like to do in other cities is try their Chinese.\nThis place was pretty bad; my General's Chicken tasted like it had been cooked 3 days earlier and reheated. My girlfriend's shrimp with tomato sauce was definitely made with ketchup. The hot and sour soup was neither.\nService was friendly.", "rating": 1, "date": "2011-02-21"}, {"excerpts": ["Hot and Sour Soup ($8.95)\n- Vegtables: "], "author": "Jane A.", "review": "CHINESE RESTAURANT IN THE HEART OF JAPANTOWN\n\nIt was late in the evening and my friend introduced me to a Chinese spot away from Chinatown and in Japantown. I really didnt know what to think but to just think of it as some affordable Chinese restaurant. We entered the restaurant and I was suprised to the place half-way packed with other random people eating. We were quickly seated and as I browsed the menu my first thoughts exactly were right \"affordable Chinese food\". \n\nMy friend has been here before so I went along with what she ordered for us: \n- Soup: Hot and Sour Soup ($8.95)\n- Vegtables: Mushroom, Bamboo shoots with Pea pods, and fresh broccoli ($5.95)\n- Beef with Bak choy ($7.50)\n- rice\n\nThe food was pretty good. Usually I'm picky with my Chinese food but I was very pleased and would return to this spot for another \"affordable Chinese food\" fix. The portions are well enough to pack up and take home for leftovers too!", "rating": 4, "date": "2008-08-01"}, {"excerpts": ["Along with sharing the jajangmyun, we ordered a small hot and sour soup, and potstickers, all for approximately $22 + tip.  ", "4.5 stars - jajangmyun\n\n3.5 stars - The hot and sour soup"], "author": "W. L.", "review": "I visited here about 9 years ago and remembered that their plum sauce noodles (jajangmyun - or some places call it black bean sauce noodles) was pretty good.  I wasn't a huge fan of this kind of noodles before, but my husband loves it and noodle texture is extremely important to him.  We would frequent Chef Wang in South San Francisco for their  jajangmyun which my husband thought was the best in the city, so I thought I'd take him here to compare as San Wang makes their own noodles from scratch.  \n\nHe was truly a happy camper and thought these noodles were the best in SF so far (haven't tried that many yet, hah).\n\nAlong with sharing the jajangmyun, we ordered a small hot and sour soup, and potstickers, all for approximately $22 + tip.  They give you a free bowl of kimchee to start with.\n\n4.5 stars - jajangmyun\n\n3.5 stars - The hot and sour soup, it was decently good.  It had a good spice to it and right amount of vinegar, but had too much of the shrimp, black mushrooms, and bamboo shoots in it.  Some people would love the value of having the extra amount of ingredients in it, but I like the soup and had to keep picking off the items and putting them aside because I had too much of it already.\n\n2 stars - The potstickers - We were hoping to get the best tasting pot stickers ever, but as we were picking them off the plate, they would fall apart because there were small cracks in the dough.  Small detail, but aside from that too, the dough texture was a little pasty.  It tasted okay, but I would most likely skip on ordering the pot stickers there next time around. \n\nThank you san wang for having the noodles taste the same as it did 9 years ago.  I can still hold my head up high without another \"I told you things you've had years ago won't taste good anymore\" and can trust at least some of my recommendations from the past.", "rating": 4, "date": "2009-05-24"}, {"excerpts": ["Hot and sour soup.  ", "Saw a couple of flies in the soup ", "so we had to return it.  ", "I don't mind bugs in the food.  ", "I am not that picky.  ", "If your food is good..........", "I can overlook it.  ", "Things like this happens in all restaurants. ", "We changed it and got the seafood soup.  "], "author": "jason g.", "review": "I remember when they had a restaurant on Clement St 17 years ago.  This restaurant has been opened for close to 30 years and I remembered it to be very good.  Please do not even compare this restaurant to San Tung or mentioned this restaurant in the same sentence.  If I had to choose between the 5.99 dim sum place in Chinatown or this place, I would really have to choose the 5.99 dim sum place.\n\nIno sushi was closed today so we ended up going here.  This is by far one of the worst Chinese restaurant that I have ever been to.  Dom, my friend sitting to my left on my profile pic chose this restaurant.  I should have known better.  I don't think he can pick a good restaurant if it hit him on the head.  What a mistake that was.  Brian P. said this is one of his favorite restaurants in the city.  Maybe in the city of Tulsa, Oklahoma.  I swear I am going to start doing random drug tests in my office.   I am about to fire him for even recommending this restaurant.  Brian P.  I am going to test you for drugs and then fire you.  hahhaahhah\n\nTERRIBLE...........here's why.\n\nHot and sour soup.  Saw a couple of flies in the soup so we had to return it.  I don't mind bugs in the food.  I am not that picky.  If your food is good..........I can overlook it.  Things like this happens in all restaurants. We changed it and got the seafood soup.  It was tasteless.\n\nPotstickers........tasted like frozen potstickers\n\nMushu Pork........Should have been called mushy pork.  The pork, egg, cabbage was very mushy and slimy.  The skin was hard.  It needed to be steamed.\n\nDry fried chicken..................exactly as it sounds.  Dry, Fried, Chicken.  It was tasteless.\n\nDry fried shrimp..................tasted ok but it wasn't something I would ever crave again in this life time.\n\nBraised string beans.........it was fresh but the mushrooms were extremely salty but the beans weren't?  \n\nTotal price was 59.00\n\nMy friend Dom treated.  I don't know whether to thank him or kill him.", "rating": 1, "date": "2008-10-29"}, {"excerpts": ["Even the hot and sour soup is bland. "], "author": "Midori S.", "review": "Everything that's tasty at San Tung is bland and one-dimensional here -- the dry fried chicken, the noodles in plum sauce, everything. Even the hot and sour soup is bland. We have tons of leftovers right now, and we're kind of dreading eating them. \n\nI only wish the service were bland instead of wretchedly horrible.", "rating": 1, "date": "2009-10-18"}, {"excerpts": ["Absolutley love their spicy fried shrimp, the fried scallops, hot and sour soup and how can you not go wrong with beef broccoli. ", "It is some good stuff. ", "I think they changed the way they prepare their KimChee. ", "This time it had a heavy sauce and really drowned out the cabbage. ", "It was still good but had alot of sauce on it. ", "Overall a good time and good food. ", "Excellent."], "author": "Timothy M.", "review": "When my old High School and SFSU college buddy comes to town. We always go to San Wang's. He introduced me to this place back in 1983. Absolutley love their spicy fried shrimp, the fried scallops, hot and sour soup and how can you not go wrong with beef broccoli. It is some good stuff. I think they changed the way they prepare their KimChee. This time it had a heavy sauce and really drowned out the cabbage. It was still good but had alot of sauce on it. Overall a good time and good food. Excellent.", "rating": 5, "date": "2009-04-25"}, {"excerpts": ["The food quality is sometimes questionable, also the Hot and Sour soup is sometimes excellent and other times has no taste..", "I guess it depends on who's cooking.  ", "The prices are high compared to other Chinese restaurants in the city but average for Japantown.  ", "Don't go here for the service, as it is horrible!  ", "I eat here about once a month, due to working in the area and needing a break from Japanese food."], "author": "Ed D.", "review": "This used to be my favorite Chinese food in the city, but that was many years ago...... loved the clams with black bean sauce, and dried fried squid.  The food quality is sometimes questionable, also the Hot and Sour soup is sometimes excellent and other times has no taste..I guess it depends on who's cooking.  The prices are high compared to other Chinese restaurants in the city but average for Japantown.  Don't go here for the service, as it is horrible!  I eat here about once a month, due to working in the area and needing a break from Japanese food.", "rating": 3, "date": "2009-05-16"}, {"excerpts": ["Oh yeah, hot and sour soup is off the hook!"], "author": "Steve K.", "review": "Went back to this place last week after a few years. We ordered the dry fried chicken, dry fried scallops, mongolian beef and curry chicken. Service was quick , food was really good, prices very decent and place looks great...only gripe is that the table for 4 is small, we had to stack plates' edges!--or we were all pigs for ordering so damn much! Oh yeah, hot and sour soup is off the hook!", "rating": 4, "date": "2008-11-01"}], "rice sizzling soup": [], "abalone soup": [], "filet chicken": [], "sharks fin soup": [], "won lu soup noodles": [], "san wang soup noodles": [{"excerpts": ["My favorite place in SF so far for both korean-style jjajangmyun (here they're called noodles with plum sauce) and jjampong (and these are called san wang soup noodles). ", "I have tried other places that had good one or the other, but so far San Wang is the only place I've been where I've liked both AND never has a wait! ", "I've never had to wait in line unlike other places that are also good, but have a 40 minute minimum wait *cough cough"], "author": "Terra C.", "review": "My favorite place in SF so far for both korean-style jjajangmyun (here they're called noodles with plum sauce) and jjampong (and these are called san wang soup noodles). I have tried other places that had good one or the other, but so far San Wang is the only place I've been where I've liked both AND never has a wait! I've never had to wait in line unlike other places that are also good, but have a 40 minute minimum wait *cough cough* San Tung lol\n\nEverything else I've had here has also been good - like  various meat dishes I can't remember specifically with rice or noodles or something. but if you want to get a soup appetizer I highly recommend the won ton soup! the small is actually pretty large and there's a lot in the actual soup. \n\nThey do take card but there is a $20 card minimum which is helpful to know if you're ordering delivery or picking up an order.", "rating": 5, "date": "2017-02-02"}, {"excerpts": ["San Wang soup noodles: ", "Loads of seafood and meat! "], "author": "Elena N.", "review": "Roommate wanted black bean sauce noodles so we stopped by San Wang on the way home. I had never heard of the place, but he used to come here with his family when he was little. Since all his parents eat when they go out is Korean Chinese food I thought this place must be good!\n\nDry fried chicken: Crispy, garlicky and spicy. It was missing a little of the sweet sauciness that San Tung's wings have, but I enjoyed these. Sooo much that I just kept eating them even though I was getting full!\n\nSan Wang soup noodles: Loads of seafood and meat! And the soup was nice and spicy.\n\nNoodles with black bean sauce: I had a bite of this. I don't love black bean sauce, but the noodles had a nice chew to them. Roommate seemed to enjoy them!\n\nSo the roommate's parents are right again! When I'm too lazy to go to San Tung, this is a great place to get my Chicken wing and Soup noodle fix!", "rating": 4, "date": "2014-04-18"}, {"excerpts": ["We ordered the San Wang Soup Noodles for each of us, and what a big portion it was for the price.  ", "I couldn't finish my bowl.  ", "It had basically everything you wanted if you didn't know what you wanted to eat.  ", "Noodles, seafood, meat, and vegetables.  ", "And topping it off was 3 pieces of chili since I wanted mild spice.  ", "Noodles were soft, soup was tasty, and the rest was so filling.  "], "author": "Karen L.", "review": "Wasn't too keen to eat at this place cause I thought it was Chinese food, but my dining partners wanted to eat here for lunch.  Opening the menu was a surprise, since there were Korean dishes.\n\nWe ordered the San Wang Soup Noodles for each of us, and what a big portion it was for the price.  I couldn't finish my bowl.  It had basically everything you wanted if you didn't know what you wanted to eat.  Noodles, seafood, meat, and vegetables.  And topping it off was 3 pieces of chili since I wanted mild spice.  Noodles were soft, soup was tasty, and the rest was so filling.  But the meat is nothing to rave about.\n\nService was quick and helpful, although there was one waitress in the beginning that wasn't too friendly since we wanted her to wipe down the table.", "rating": 3, "date": "2015-06-08"}, {"excerpts": ["(San Wang Soup Noodles) ", "no flavor no spicy very disappointing. ", "Won't be going back."], "author": "Sarah O.", "review": "Very Bland jjampong noodle soup (San Wang Soup Noodles) no flavor no spicy very disappointing. Won't be going back.", "rating": 1, "date": "2016-12-17"}, {"excerpts": ["What we had:\nhot braised chicken \npot stickers \nsan wang soup noodles"], "author": "Gloria H.", "review": "Such a bummer.  We used to love this place - this was our go to restaurant for clams, soup noodles...etc.  So excited to return and with very high expectation, only to be disappointed.  Nothing was up to par.\n\nWhat we had:\nhot braised chicken \npot stickers \nsan wang soup noodles", "rating": 3, "date": "2012-03-16"}, {"excerpts": ["Dry fried chicken, San Wang soup noodles, Chow mein, are some of the staples that I always order from this place.  ", "The secret sauce that they use for the chicken is also used in their fish, scallops,and squid.  ", "The sauce is made with Honey, garlic, peppers, sometimes frozen carrots and peas,  ", "In either case, it is a very good base for eating copious amounts of rice or noodles.  "], "author": "Curtis L.", "review": "Dry fried chicken, San Wang soup noodles, Chow mein, are some of the staples that I always order from this place.  The secret sauce that they use for the chicken is also used in their fish, scallops,and squid.  The sauce is made with Honey, garlic, peppers, sometimes frozen carrots and peas,  In either case, it is a very good base for eating copious amounts of rice or noodles.  Some people may not appreciate this Korean/Chinese fusion as much as San Tung in the sunset district but I do have cravings for their saucy chicken wings and flavorful noodles.  \n\nPros:  Huge portions!, Big Screen T.V., upstairs has room for large groups.\nCons:  Parking is almost as bad as Chinatown!", "rating": 3, "date": "2010-04-27"}, {"excerpts": ["They also have great soups - try the San Wang soup noodles or Ta Lo noodles. ", "You can taste the clams in the broth, the ingredients are fresh, quantity is plentiful, and you don't feel thirsty or sleepy after eating. ", "That's because they go easy on the MSG "], "author": "W. T.", "review": "Very good Korean-influenced Chinese food. Milder and more flavorful than the food at the cursed Cantonese restaurants that plague the city. There is absolutely nothing wrong with good Cantonese food; unfortunately, the kind that prevails in the city is the wrong kind: oily, deep fried, poor ingredient quality, uncreative. The same can be said of most American food, I suppose - and maybe these Cantonese restaurants are simply cooking for that audience. But I digress.\n\nSan Wang is known for its dry-fried series of dishes (beef, shrimp, chicken, etc.) Dry fried beef is the best. They also have great soups - try the San Wang soup noodles or Ta Lo noodles. You can taste the clams in the broth, the ingredients are fresh, quantity is plentiful, and you don't feel thirsty or sleepy after eating. That's because they go easy on the MSG (or they don't use MSG at all - I did not detect any).\n\nService is decent as well, and so is the price. We have been going here for years and will keep coming back.", "rating": 4, "date": "2011-11-19"}, {"excerpts": ["and I both ordered a bowl of the san wang soup noodles - spicy style. ", "it was like a treasure trove of yumminess teeming with veggies, squid, clams, slices of pork (deeeelectable!), mushrooms and eternal happiness. ", "yes, i vow to return to san wang to try all the other noodles i spied gracing the tables of other patrons."], "author": "ray e.", "review": "first, san wang is also san wong. so if you look at the sign on the outside, it will say san wAng but then at the door, maybe just to confuse you, you'll see something that says san wOng. well, what you won't be confused about is the fact that they serve delicious handmade noodles in their dishes. my pal and I both ordered a bowl of the san wang soup noodles - spicy style. it was like a treasure trove of yumminess teeming with veggies, squid, clams, slices of pork (deeeelectable!), mushrooms and eternal happiness. yes, i vow to return to san wang to try all the other noodles i spied gracing the tables of other patrons.", "rating": 4, "date": "2008-02-18"}], "san wang chow mein": [{"excerpts": ["We got the san wang chow mein, garlic eggplant, Mongolian beef, and dry fried chicken wings. ", "One of my favorites was the Mongolian beef which was stir fried with mushrooms and leeks! ", "The best dish though was the dry fried chicken wings!!! ", "Definitely order this chicken! ", "It is so flavorful and good! ", "Since it is Korean Chinese, kimchi is also served and it was yummy as well, and not too spicy. ", "It was a great first dinner in SF after our long road trip! ", ":)"], "author": "Joy Y.", "review": "The food comes so fast after you order it! Everything we ordered was very good. We got the san wang chow mein, garlic eggplant, Mongolian beef, and dry fried chicken wings. One of my favorites was the Mongolian beef which was stir fried with mushrooms and leeks! The best dish though was the dry fried chicken wings!!! Definitely order this chicken! It is so flavorful and good! Since it is Korean Chinese, kimchi is also served and it was yummy as well, and not too spicy. It was a great first dinner in SF after our long road trip! :)", "rating": 4, "date": "2015-04-07"}, {"excerpts": ["Three things I like at this restaurant are the pot stickers, water dumplings (shrimp), and San Wang chow mein.\n\n"], "author": "joe w.", "review": "Three things I like at this restaurant are the pot stickers, water dumplings (shrimp), and San Wang chow mein.\n\nTwo things I think can be further enhanced at this restaurant are better service to keep our tea filled when we ran out and fresher fortune cookies.\n\nOverall, I think this restaurant is a good value considering how affordable it is to eat here.", "rating": 3, "date": "2014-04-08"}, {"excerpts": ["the chow mein (san wang chow mein), substituting the hand pulled noodles tho, i have to admit, was good, because the noodles were very chewy. ", "i haven't had it a long time. ", "but there was a LOT of like.. juice/sauce... not typical for a chow mein. "], "author": "Rick L.", "review": "Ok I remember that there used to be a San Wang in cupertino.. anyone remember this? but my dad told me the owner had brain cancer and passed away, God rest her soul. its sad because it closed down. i used to go there quite frequently (corner of prospect and sunnyale-saratoga)\n\never since then, ive always had the nostalgic taste for their cashew nut chicken. i dunno, no one else ever makes it the same. theres something about that tenderness of the chicken. maybe its the korean influence? i dunno.\n\nso heres the breakdown. the food is pretty good. the cashew nut brought back some good memories. portions of lunch specials was ok. i remember it used to be 6 bucks, but i guess w/ the crappy economy and me being gone for 4 years i guess prices go up. but the happy family... well it wasn't very happy at all. that rubbery, old squid... not much seafood.. and didn't clean out the shrimp. u can still see the nasty black intestine. ugh.\n\nthe chow mein (san wang chow mein), substituting the hand pulled noodles tho, i have to admit, was good, because the noodles were very chewy. i haven't had it a long time. but there was a LOT of like.. juice/sauce... not typical for a chow mein. that was my gripe for that.\n\nand the spicy noodle soup... too much spicy kim chee taste.\n\nthe kimchee? dood it was regular cabbage.. very gross, very nasty. \n\nso anyway the food was good. the service was horrible. the waiter was korean and didnt' even speak chinese. the other guy was very rude. owner was pretty rude. but i guess its in san francisco what can i say.\n\nwell i should really give this place two and a half stars, but as always, i round up. minus 50 for crappy service though.", "rating": 3, "date": "2008-12-23"}, {"excerpts": ["- San Wang Chow Mein: "], "author": "Diane L.", "review": "This place offers extremely large portions of Korean-Chinese food for super cheap prices.  I never thought that I'd ever come to Japantown for Chinese food, but my parents and I stumbled upon this place one Sunday, and I have been a fan ever since.\n\nMy favorites:\n\n- Dried fried chicken: These are so bad for you, but so sinfully good, especially with all the minced garlic and scallions found in the dish.\n- Dumplings: These are filled with pork and tons of chives (beware of those after-meal burps!).  But the best thing about them is the handmade dumpling skins.  \n- San Wang spicy noodle soup (popularly known in Korean as \"jjampong\"): It is so very comforting on a cold day.  Their spicy soup is filled with perfectly al dente hand-pulled noodles and tons of goodies like clams, shrimp, squid, sea cucumber (the only not-so-goody), pork, mushrooms, wood ear fungus, napa cabbage, and zucchini.  \n- Noodles with plum sauce (popularly known in Chinese as \"zhajiang mian\" and in Korean as \"jajangmyeon\"): I'm not sure why they call it plum sauce because it's really a black soybean sauce.  They use their awesome hand-pulled noodles in this dish, and the sauce is not too overpowering.\n- San Wang Chow Mein: This is exactly like the jjampong (ingredients-wise), except without the spicy soup, and the flavor is full of the heat of the wok. \n\nThis place can be packed at the oddest hours when you would not think it would be (e.g. 3pm on a Sunday afternoon and 9:30pm on a Friday night).  I know this because I've been here at those exact hours!", "rating": 4, "date": "2008-03-30"}, {"excerpts": ["Had the black bean sauce noodles and San Wang chow mein.... ", "The kimchee, tea, main courses, the large tv, and the fortune cookies were perfect! ", "YUM!"], "author": "Alex H.", "review": "Excellent!!! Simply excellent!!! Had the black bean sauce noodles and San Wang chow mein.... The kimchee, tea, main courses, the large tv, and the fortune cookies were perfect! YUM!", "rating": 4, "date": "2009-06-27"}], "ta lo soup noodles": [], "fried noodles": [{"excerpts": ["The 3 of us ordered these items (which turned out to be a tad bit too much for us, so we had some leftover chicken):\n\n# Fried Noodles with plum sauce = "], "author": "Jeanne L.", "review": "This is a Northern Chinese restaurant with Korean leanings, meaning that it's kind of a fusion, and the menu does have Chinese and Korean writing on it.  It reminds me of San Tung Restaurant on Irving.\n\nThe 3 of us ordered these items (which turned out to be a tad bit too much for us, so we had some leftover chicken):\n\n# Fried Noodles with plum sauce = \"zha jiang mian\" = \"za zang myun\"\n- These seem to be standard.  Not the best I've had.  (The honor for that goes to Shan Dong in Oakland which sets a very high standard: http://www.yelp.com/biz/shan-dong-restaurant-oakland#hrid:7USD0JPUUshsTpjCJdxh3A/ ).  But also not bad by any means.  Nicely chewy, and the sauce is good.  I'd definitely come back for these noodles.\n\n# Dry Fried Chicken - I think this is what San Wang is known for.  These are no where near as good as the ones at San Tung.  Our pile was mostly drummettes, with just one flapper.  (Most people seem to prefer the drummettes, but I really enjoy the flappers, since the meat is more tender.)  The flavoring was good, mild garlic and soy sauce flavor, but not as sweet as the ones at San Tung.  The part I didn't like was the breading.  It was a bit too thick and dry.\n\n# Bean Curd Family Style - This was some fried tofu pouches (which were kinda mushy) with an assortment of Chinese vegetables, and a very lightly flavored sauce.\n\nService was good.  The interior and customers inside felt authentic.  It's pretty roomy inside, and they've got large tables .... great for groups.  Also, it's possibly the only place to get Chinese food in Japantown.  I'll come back for the zha jiang mian, but I'm going to try other dishes.", "rating": 3, "date": "2014-02-12"}], "chicken with black mushrooms": [{"excerpts": ["I was in the mood for something basic, so I ordered the $12.50 Chicken with Black Mushrooms, which was pretty basic with shiitake caps and pea pods mixed to a shiny finish with the poultry (photo: http://bit.ly/2k3HdVa). "], "author": "Ed U.", "review": "So I have to admit in all my visits to J-Town over the years, I managed to avoid this restaurant even though I've tried almost every other place in the immediate vicinity. Was it an odd sense of culinary xenophobia that prevented me from entering? Yeah, probably because I was one of the old-school types who felt when in J-Town, you eat Japanese no matter how good or bad it may be. But I've broadened my horizons and tried both Korean and Thai food in the neighborhood, so why not try Chinese, in particular, Mandarin?\n\nOther reviews mentioned Korean dishes as part of the cooking offering here, although I guess I didn't get that far in the menu to notice. I did take notice of the complimentary cup of kimchee that landed in front of me before I ordered. It was crunchy though a tad too sweetly mild for my taste (photo: http://bit.ly/2IsWTfc). I was in the mood for something basic, so I ordered the $12.50 Chicken with Black Mushrooms, which was pretty basic with shiitake caps and pea pods mixed to a shiny finish with the poultry (photo: http://bit.ly/2k3HdVa). The $1.45 Steamed Rice was necessary to sop up the requisite brown sauce (photo: http://bit.ly/2IoWsCh).\n\nI was feeling indulgent and went for the $8.95 Steamed Potstickers, a half-dozen hefty ones that tasted even doughier than they looked in the metal steamer (photo: http://bit.ly/2IICkyH). The piping hot minced pork stuffing was hearty stuff though you need to let them cook a bit before ingesting. I actually came back a couple of weeks later to try the $10.95 Eggplant with Garlic Sauce and was pleasantly surprised to find it not submerged in brown sauce and actually festooned with shaved mushrooms. So maybe I have gotten over my xenophobia. OK, maybe not.\n\nFOOD - 3 stars...pretty standard dishes, huge portions.\nAMBIANCE - 3 stars...popular spot but nothing special \nSERVICE - 3 stars...'been there, done that' attitude\nTOTAL - 3 stars... if a hankering for Chinese hits you in J-Town", "rating": 3, "date": "2018-05-16"}, {"excerpts": ["a tad oversauced (HUGE portions, most Chinese restaurants would give you 2/3 or less of that for one order), the scallops (surprisingly, they were fried but still very good), the garlic eggplant (yum) and the chicken with black mushrooms (forgettable). "], "author": "Jenny W.", "review": "HUGE PORTIONS!!!! I really don't understand why there is a Chinese restaurant right in Japantown, but then again...why was I eating at a Chinese restaurant when I was in Japantown?! And why did they serve kimchi with the foood...(answer: the owners are Korean). \n\nI came in and they were SUPER busy and a tad understaffed. However, whenever we had to ask for more napkins or more rice, they were quick and prompt and apologized profusely for not noticing it first. I ordered the San Wang clams, which were super fresh but a tad oversauced (HUGE portions, most Chinese restaurants would give you 2/3 or less of that for one order), the scallops (surprisingly, they were fried but still very good), the garlic eggplant (yum) and the chicken with black mushrooms (forgettable). Even though the lunch rush was barely ending, our waitress was gracious and boxed our leftovers for us instead of throwing us a few take-out boxes and making us do it ourselves. \n\nWould come back again.", "rating": 4, "date": "2011-04-01"}], "hot braised chicken": [{"excerpts": ["What we had:\nhot braised chicken \npot stickers \nsan wang soup noodles"], "author": "Gloria H.", "review": "Such a bummer.  We used to love this place - this was our go to restaurant for clams, soup noodles...etc.  So excited to return and with very high expectation, only to be disappointed.  Nothing was up to par.\n\nWhat we had:\nhot braised chicken \npot stickers \nsan wang soup noodles", "rating": 3, "date": "2012-03-16"}], "chicken with green onions": [], "sauteed garlic chicken": [], "chicken with snow peas": [], "generals chicken": [], "dry  fried chicken": [], "braised green bean": [], "sauteed chinese greens": [{"excerpts": ["We ordered Garlic Scallops, which turned out to be deep fried but YUMMY, and sauteed chinese greens, which were beautifully cooked On Choy (Chinese brocolli).  "], "author": "Jessica R.", "review": "Best Chinese food I've had in many years.  I'm definitely looking forward to my next visit!  \n\nWe were at the Kabuki for an SFFF show and asked a friend who works there if there's a good Chinese restaurant in walking distance.  She sent us here, b/c it's just 2 blocks up Post from the theater.  It was uncrowded & everyone else there was Chinese families.  \n\nWe ordered Garlic Scallops, which turned out to be deep fried but YUMMY, and sauteed chinese greens, which were beautifully cooked On Choy (Chinese brocolli).  Both dishes were different than your run-of-the-mill Chinese: the ingredients were super-fresh & high quality, they were perfectly cooked, and the seasonings were both more interesting & more subtle than usual.  \n\nI would recommend both of the dishes we had, and look forward to trying new ones.", "rating": 4, "date": "2013-05-09"}], "vegetable deluxe": [], "dry  fried eggplant": [], "hot spiced bean curd": [{"excerpts": ["Deep fried chicken: it had a garlic kick to it =) \nHot Spiced Bean Curd: Really good but not spicy enough for me. \n"], "author": "Jenny M.", "review": "Been to this place a couple times before and keep forgetting to Yelp it! It looks like a hole in the wall place and has a 2nd floor for more seating. We got seated upstairs and I think the waitress forgot about us because it took them forever to come and take our order (but the food made up for it). \n\nWe ordered: \n\nSteamed pot-stickers: these were okay but I would have preferred them fried! \nMongolian Beef: very flavorful and I think they even added some mushrooms to it. \nSweet and sour Shrimp: I like!!!! The shrimp was still crispy even with the sweet and sour sauce all over it. \nDeep fried chicken: it had a garlic kick to it =) \nHot Spiced Bean Curd: Really good but not spicy enough for me. \nBlack noodles (not the correct name for it): really fresh  \n\nWould come back to try other stuff ... oh yeah the parking is hard to find but then again it's San Francisco!", "rating": 4, "date": "2009-08-03"}], "bean curd family style": [{"excerpts": ["# Bean Curd Family Style - This was some fried tofu pouches (which were kinda mushy) with an assortment of Chinese vegetables, and a very lightly flavored sauce.\n\n"], "author": "Jeanne L.", "review": "This is a Northern Chinese restaurant with Korean leanings, meaning that it's kind of a fusion, and the menu does have Chinese and Korean writing on it.  It reminds me of San Tung Restaurant on Irving.\n\nThe 3 of us ordered these items (which turned out to be a tad bit too much for us, so we had some leftover chicken):\n\n# Fried Noodles with plum sauce = \"zha jiang mian\" = \"za zang myun\"\n- These seem to be standard.  Not the best I've had.  (The honor for that goes to Shan Dong in Oakland which sets a very high standard: http://www.yelp.com/biz/shan-dong-restaurant-oakland#hrid:7USD0JPUUshsTpjCJdxh3A/ ).  But also not bad by any means.  Nicely chewy, and the sauce is good.  I'd definitely come back for these noodles.\n\n# Dry Fried Chicken - I think this is what San Wang is known for.  These are no where near as good as the ones at San Tung.  Our pile was mostly drummettes, with just one flapper.  (Most people seem to prefer the drummettes, but I really enjoy the flappers, since the meat is more tender.)  The flavoring was good, mild garlic and soy sauce flavor, but not as sweet as the ones at San Tung.  The part I didn't like was the breading.  It was a bit too thick and dry.\n\n# Bean Curd Family Style - This was some fried tofu pouches (which were kinda mushy) with an assortment of Chinese vegetables, and a very lightly flavored sauce.\n\nService was good.  The interior and customers inside felt authentic.  It's pretty roomy inside, and they've got large tables .... great for groups.  Also, it's possibly the only place to get Chinese food in Japantown.  I'll come back for the zha jiang mian, but I'm going to try other dishes.", "rating": 3, "date": "2014-02-12"}], "bean curd": [{"excerpts": ["# Bean Curd Family Style - This was some fried tofu pouches (which were kinda mushy) with an assortment of Chinese vegetables, and a very lightly flavored sauce.\n\n"], "author": "Jeanne L.", "review": "This is a Northern Chinese restaurant with Korean leanings, meaning that it's kind of a fusion, and the menu does have Chinese and Korean writing on it.  It reminds me of San Tung Restaurant on Irving.\n\nThe 3 of us ordered these items (which turned out to be a tad bit too much for us, so we had some leftover chicken):\n\n# Fried Noodles with plum sauce = \"zha jiang mian\" = \"za zang myun\"\n- These seem to be standard.  Not the best I've had.  (The honor for that goes to Shan Dong in Oakland which sets a very high standard: http://www.yelp.com/biz/shan-dong-restaurant-oakland#hrid:7USD0JPUUshsTpjCJdxh3A/ ).  But also not bad by any means.  Nicely chewy, and the sauce is good.  I'd definitely come back for these noodles.\n\n# Dry Fried Chicken - I think this is what San Wang is known for.  These are no where near as good as the ones at San Tung.  Our pile was mostly drummettes, with just one flapper.  (Most people seem to prefer the drummettes, but I really enjoy the flappers, since the meat is more tender.)  The flavoring was good, mild garlic and soy sauce flavor, but not as sweet as the ones at San Tung.  The part I didn't like was the breading.  It was a bit too thick and dry.\n\n# Bean Curd Family Style - This was some fried tofu pouches (which were kinda mushy) with an assortment of Chinese vegetables, and a very lightly flavored sauce.\n\nService was good.  The interior and customers inside felt authentic.  It's pretty roomy inside, and they've got large tables .... great for groups.  Also, it's possibly the only place to get Chinese food in Japantown.  I'll come back for the zha jiang mian, but I'm going to try other dishes.", "rating": 3, "date": "2014-02-12"}, {"excerpts": ["Deep fried chicken: it had a garlic kick to it =) \nHot Spiced Bean Curd: Really good but not spicy enough for me. \n"], "author": "Jenny M.", "review": "Been to this place a couple times before and keep forgetting to Yelp it! It looks like a hole in the wall place and has a 2nd floor for more seating. We got seated upstairs and I think the waitress forgot about us because it took them forever to come and take our order (but the food made up for it). \n\nWe ordered: \n\nSteamed pot-stickers: these were okay but I would have preferred them fried! \nMongolian Beef: very flavorful and I think they even added some mushrooms to it. \nSweet and sour Shrimp: I like!!!! The shrimp was still crispy even with the sweet and sour sauce all over it. \nDeep fried chicken: it had a garlic kick to it =) \nHot Spiced Bean Curd: Really good but not spicy enough for me. \nBlack noodles (not the correct name for it): really fresh  \n\nWould come back to try other stuff ... oh yeah the parking is hard to find but then again it's San Francisco!", "rating": 4, "date": "2009-08-03"}], "vegetarian mu shu": [], "dry  fried green bean": [], "mushroom bamboo shoots broccoli pea pods": [], "eggplant with garlic sauce": [{"excerpts": ["I actually came back a couple of weeks later to try the $10.95 Eggplant with Garlic Sauce and was pleasantly surprised to find it not submerged in brown sauce and actually festooned with shaved mushrooms. ", "So maybe I have gotten over my xenophobia. "], "author": "Ed U.", "review": "So I have to admit in all my visits to J-Town over the years, I managed to avoid this restaurant even though I've tried almost every other place in the immediate vicinity. Was it an odd sense of culinary xenophobia that prevented me from entering? Yeah, probably because I was one of the old-school types who felt when in J-Town, you eat Japanese no matter how good or bad it may be. But I've broadened my horizons and tried both Korean and Thai food in the neighborhood, so why not try Chinese, in particular, Mandarin?\n\nOther reviews mentioned Korean dishes as part of the cooking offering here, although I guess I didn't get that far in the menu to notice. I did take notice of the complimentary cup of kimchee that landed in front of me before I ordered. It was crunchy though a tad too sweetly mild for my taste (photo: http://bit.ly/2IsWTfc). I was in the mood for something basic, so I ordered the $12.50 Chicken with Black Mushrooms, which was pretty basic with shiitake caps and pea pods mixed to a shiny finish with the poultry (photo: http://bit.ly/2k3HdVa). The $1.45 Steamed Rice was necessary to sop up the requisite brown sauce (photo: http://bit.ly/2IoWsCh).\n\nI was feeling indulgent and went for the $8.95 Steamed Potstickers, a half-dozen hefty ones that tasted even doughier than they looked in the metal steamer (photo: http://bit.ly/2IICkyH). The piping hot minced pork stuffing was hearty stuff though you need to let them cook a bit before ingesting. I actually came back a couple of weeks later to try the $10.95 Eggplant with Garlic Sauce and was pleasantly surprised to find it not submerged in brown sauce and actually festooned with shaved mushrooms. So maybe I have gotten over my xenophobia. OK, maybe not.\n\nFOOD - 3 stars...pretty standard dishes, huge portions.\nAMBIANCE - 3 stars...popular spot but nothing special \nSERVICE - 3 stars...'been there, done that' attitude\nTOTAL - 3 stars... if a hankering for Chinese hits you in J-Town", "rating": 3, "date": "2018-05-16"}, {"excerpts": ["So far we've loved everything we've tried: the hot and sour soup (nicely peppery), Mongolian Beef (not the nice sauce I get at my other fave spot but pretty and tasty), Noodles in Plum Sauce (something that sounds so plain yet is packed with delicious bits of shrimp etc.), Dry Fried Chicken (nice and crispy flavorful wings), Lemon Chicken (since they didn't have Orange Chicken), Eggplant with garlic sauce...shall I go on? ", "Walkable distance from my place ", "so it's also where I've gotten my takeout the last 2 Christmases. ", "Good portions, reasonable prices, beautiful presentation and yummy flavors! ", "I'd bump it up to 4.5 stars if I could ", "but since I save 5 stars for UNBELIEVABLE, 4 it is."], "author": "Bob S.", "review": "Stumbled upon this place by accident with a friend who lives nearby. We were headed elsewhere in Japantown for dinner but when passing the window there was a large party at the front table which was packed with some gorgeous looking dishes. Chinese food in Japantown? COUNT ME IN!\nSo far we've loved everything we've tried: the hot and sour soup (nicely peppery), Mongolian Beef (not the nice sauce I get at my other fave spot but pretty and tasty), Noodles in Plum Sauce (something that sounds so plain yet is packed with delicious bits of shrimp etc.), Dry Fried Chicken (nice and crispy flavorful wings), Lemon Chicken (since they didn't have Orange Chicken), Eggplant with garlic sauce...shall I go on? Walkable distance from my place so it's also where I've gotten my takeout the last 2 Christmases. Good portions, reasonable prices, beautiful presentation and yummy flavors! I'd bump it up to 4.5 stars if I could but since I save 5 stars for UNBELIEVABLE, 4 it is.", "rating": 4, "date": "2017-07-17"}, {"excerpts": ["Had 2 reviewer favorites- the jjajangmyeon AKA Noodles with Plum Sauce, and the dry-fried chicken, as well as eggplant with garlic sauce.  ", "The jjajangmyeon and dry-fried chicken both lived up to their high expectations.  ", "The eggplant with garlic sauce was ok- ", "had a nice sauce but nothing in the dish inspired a feeling of \"wow!\" to me like the other 2 dishes did.  ", "Prices:\nNoodles with Plum Sauce: $6.50\nEggplant with Garlic Sauce: $6.50\nDry Fried Chicken wings: $8.50"], "author": "Karen W.", "review": "Placed an order to go.  Had 2 reviewer favorites- the jjajangmyeon AKA Noodles with Plum Sauce, and the dry-fried chicken, as well as eggplant with garlic sauce.  The jjajangmyeon and dry-fried chicken both lived up to their high expectations.  The eggplant with garlic sauce was ok- had a nice sauce but nothing in the dish inspired a feeling of \"wow!\" to me like the other 2 dishes did.  I'd definitely like to go here again next time I'm in the mood for Chinese food.\n\nPrices:\nNoodles with Plum Sauce: $6.50\nEggplant with Garlic Sauce: $6.50\nDry Fried Chicken wings: $8.50", "rating": 4, "date": "2008-04-02"}, {"excerpts": ["Looking around, most parties order the same dishes- clams, dry fried chicken, and eggplant with garlic sauce...  ", "The other dishes are ok, but the clams are the yummy and cheap!"], "author": "Sheryl L.", "review": "You should come here just to get the San Wong clams.  For around $10, you get a huge portion of huge, tasty clams!   Looking around, most parties order the same dishes- clams, dry fried chicken, and eggplant with garlic sauce...  The other dishes are ok, but the clams are the yummy and cheap!", "rating": 3, "date": "2009-09-28"}], "sauteed bean sprouts": [], "sauteed pea sprouts": [{"excerpts": ["I also love their sauteed pea sprouts.\n\n"], "author": "Raymund S.", "review": "I have been eating at San Wang for as long as I can remember.  This was my favorite restaurant growing up, and even as an adult, I compare all the chicken wings I eat to their dry fried chicken.  I have been told San-Tung has good/better chicken wings, but I have never tried it.  From my understanding, it is cooked differently.\n\nThe dry-fried chicken is just perfection.  Crispy outside, moist inside.  They then smother it with a garlic, green onion and soy based sauce that is a match made in heaven.  The wings are not greasy, surprisingly.  I can eat a whoel order all to myself!\n\nThey pretty much dry fry everything, but IMO the chicken is the best.  I also really love the sweet and sour whole rock cod.  Its so crispy outside, again moist and juicy inside.  It si pricey though, so I save that for special occassions. \n\nI have also tried their noodle dishes, and they are yummy.  They make their noodles in house.  The jajangmyun is pretty good, and so is the San Wang Noodle soup.  Has a nice spicy kick to it.  I also love their sauteed pea sprouts.\n\nWhen I get a craving of dry-fried chicken, I make the trek from newark to Japantown.\n\nIt's amazingly funny when I take people to my favorite chinese/korean restaurant, we end up in Japantown.\n\nThe only thing holdng me back from 5 stars is the decor and ambience.  Seems like it has been the same way all these years.  Time to freshen up!  They have upgraded their restroom the last couple of years, so they are trying!", "rating": 4, "date": "2012-09-25"}, {"excerpts": ["Ma Po tofu dish, sauteed pea sprouts (dau mu), dry fried green beans with chicken,  "], "author": "Michael C.", "review": "Cannot really say that I had ever tried Chinese Korean food before, so I was looking forward to this meal. MAN ALIVE - be absolutely sure you come with an appetite!\n\nWalking in, San Wang resembles a usual Chinese restaurant. Florescent lighting, white walls, cooks clanging pots in the back, and waiters bustling all over the place. I was the first of my party for 9 that had arrived and luckily we called ahead for reservations, because the restaurant was quite crowded. Another group of 10 dropped into the restaurant without reservations at the same time I showed up. The waiter gave my table away because my other dinner mates had not showed up yet. Understandably, my group was placed a very cramped table. I think I sat at a 45 degree angle from the table to be exact. But seriously, I was ready to eat standing up if I had too!\n\nOnce everyone arrived we took some time and ordered 7 dishes. We were not told how big these dishes were, but just by looking around, I could tell these were massive portions. Someone at first thought that it would not be enough, but we were spot on with the order size. We started out with a large bowl of Hong Kong style Sizzling chicken broth soup. Then the food started coming out immediately. Ma Po tofu dish, sauteed pea sprouts (dau mu), dry fried green beans with chicken,  Jai Jiang Mein (a korean noodle dish), walnut shrimp, their deep fried chicken, AND a whole Hot Braised Fish (rock cod). The two highlight dishes here for me were the fried chicken and the dau mu. I have not had fried chicken that good since my days of living in Beacon Hill in Boston, Primo's restaurant. Not sure that these were actually Pea Pod stems per se, but they were really well done.\n\nThe service here is awesome. There was one younger waiter who was just buzzing around so quickly and on top of everything. For a group of 9, we were all completely full and each of us ended up paying only $15 dollars. Incredibly good value for the amount of food we ordered.", "rating": 4, "date": "2012-03-09"}], "combo fried rice": [{"excerpts": ["We ordered 4 dishes (jjajjangmyeon, jjampong, sweet & sour pork, combo fried rice) and shared it family style. \n\n", "(Something I'm not used to, so it was rather strange)\n\nCombo fried rice: It was okay. "], "author": "Sarah C.", "review": "This was a suggestion my mom made because she was craving Korean-Chinese fushion food. We ordered 4 dishes (jjajjangmyeon, jjampong, sweet & sour pork, combo fried rice) and shared it family style. \n\nJjajjangmyeon: It was decent, but it did leave a salty after taste that didn't go away...&& the two pieces of shrimp was confusing. I never had shrimp in my jjajjangmyeon before lol. (Either they mistakenly put it there... or they're just being stingy with how many pieces they put on their dishes)\n\nJjampong: my dad enjoyed this & I agree. It wasn't too salty & had the perfect amount of spice.\n\nSweet & sour pork: They definitely got the sweet part, but left out the sour. The batter wasn't like a tempura like texture like I'm used to, more like fried chicken texture. (Something I'm not used to, so it was rather strange)\n\nCombo fried rice: It was okay. Pretty bland..if only they added some seasoning or salt it would've been better\n\nThe most confusing part of this dining experience is when I ask for iced water. The waitress brought a jug of water, but no cups. When she brought the fried rice, we had no spoons. It was just kinda annoying asking for basic utensils that should've been there once we were seated. :/", "rating": 3, "date": "2017-09-02"}], "lychee fruit": [], "jelly fish": [], "three delicacy platter": [], "assorted delicacy cold platter": [], "aromatic beef": [], "two delicacy cold platter": [{"excerpts": ["I order the two delicacy cold platter; walnut shrimp and noodles with plum sauce... ", "Those were very good!!!!"], "author": "Wenhao J.", "review": "First time have Korean food, feeling good and having a lot fun here.........!\nI order the two delicacy cold platter; walnut shrimp and noodles with plum sauce... Those were very good!!!!", "rating": 4, "date": "2014-09-13"}], "four delicacy platter": [], "beef with green onions": [{"excerpts": ["We ordered dry chicken and beef with green onions with rice.  ", "The entrees were tasty and we enjoyed them.  ", "However the rice tasted old definitely not good.  ", "When you dine here do not expect any service.  ", "While we were dining, no one has came up to checked on us nor refill our water.  ", "The Service really sucks here."], "author": "donald c.", "review": "I took my friend there today since he never been here before.  The place was empty with only a few tables occupied.  We ordered dry chicken and beef with green onions with rice.  The entrees were tasty and we enjoyed them.  However the rice tasted old definitely not good.  When you dine here do not expect any service.  While we were dining, no one has came up to checked on us nor refill our water.  The Service really sucks here.", "rating": 3, "date": "2013-05-05"}], "beef snow peas": [], "beef with bok choy": [], "green bean beef": [], "sweet  sour beef": [], "beef with ginger": [], "beef with black mushrooms": [], "beef with tofu": [], "beef with jalapeno pepper": [], "dry fried beef": [{"excerpts": ["Dry fried beef is the best. "], "author": "W. T.", "review": "Very good Korean-influenced Chinese food. Milder and more flavorful than the food at the cursed Cantonese restaurants that plague the city. There is absolutely nothing wrong with good Cantonese food; unfortunately, the kind that prevails in the city is the wrong kind: oily, deep fried, poor ingredient quality, uncreative. The same can be said of most American food, I suppose - and maybe these Cantonese restaurants are simply cooking for that audience. But I digress.\n\nSan Wang is known for its dry-fried series of dishes (beef, shrimp, chicken, etc.) Dry fried beef is the best. They also have great soups - try the San Wang soup noodles or Ta Lo noodles. You can taste the clams in the broth, the ingredients are fresh, quantity is plentiful, and you don't feel thirsty or sleepy after eating. That's because they go easy on the MSG (or they don't use MSG at all - I did not detect any).\n\nService is decent as well, and so is the price. We have been going here for years and will keep coming back.", "rating": 4, "date": "2011-11-19"}], "steam flounder": [], "hot braised fish": [{"excerpts": ["Jai Jiang Mein (a korean noodle dish), walnut shrimp, their deep fried chicken, AND a whole Hot Braised Fish (rock cod). ", "The two highlight dishes here for me were the fried chicken and the dau mu. ", "I have not had fried chicken that good since my days of living in Beacon Hill in Boston, Primo's restaurant. ", "Not sure that these were actually "], "author": "Michael C.", "review": "Cannot really say that I had ever tried Chinese Korean food before, so I was looking forward to this meal. MAN ALIVE - be absolutely sure you come with an appetite!\n\nWalking in, San Wang resembles a usual Chinese restaurant. Florescent lighting, white walls, cooks clanging pots in the back, and waiters bustling all over the place. I was the first of my party for 9 that had arrived and luckily we called ahead for reservations, because the restaurant was quite crowded. Another group of 10 dropped into the restaurant without reservations at the same time I showed up. The waiter gave my table away because my other dinner mates had not showed up yet. Understandably, my group was placed a very cramped table. I think I sat at a 45 degree angle from the table to be exact. But seriously, I was ready to eat standing up if I had too!\n\nOnce everyone arrived we took some time and ordered 7 dishes. We were not told how big these dishes were, but just by looking around, I could tell these were massive portions. Someone at first thought that it would not be enough, but we were spot on with the order size. We started out with a large bowl of Hong Kong style Sizzling chicken broth soup. Then the food started coming out immediately. Ma Po tofu dish, sauteed pea sprouts (dau mu), dry fried green beans with chicken,  Jai Jiang Mein (a korean noodle dish), walnut shrimp, their deep fried chicken, AND a whole Hot Braised Fish (rock cod). The two highlight dishes here for me were the fried chicken and the dau mu. I have not had fried chicken that good since my days of living in Beacon Hill in Boston, Primo's restaurant. Not sure that these were actually Pea Pod stems per se, but they were really well done.\n\nThe service here is awesome. There was one younger waiter who was just buzzing around so quickly and on top of everything. For a group of 9, we were all completely full and each of us ended up paying only $15 dollars. Incredibly good value for the amount of food we ordered.", "rating": 4, "date": "2012-03-09"}, {"excerpts": ["Get the hot braised fish and you'll want some extra rice just for all the awesome flavored sauce that it's swimming in. ", "There are misses too here, far in between all the hits. ", "Come, eat."], "author": "Tristan C.", "review": "I've been coming for dine-in and takeout for years and this has been some if the best in the City. Anything dry fried on the menu is a signature piece for this restaurant, but the dry fried squid is the one to get if none of the others. Was just in the other day and there's something new with color plates and new bowls . . . not a good idea. I know of very few places that try to plate a dish on a color other than white and there's a reason why: Let the food do the talking. Let the colors and the food's own appearance speak for itself. You eat first with your eyes and it's a total distraction to see a sauce turn greenish black against the mauve color of a Pottery Barn close out plate - not serving platter. It's funny I rag on presentation, but this place does food so well that it doesn't need to try to take it up a notch with something that's a waste of money for the restaurant - unless the good everyday stuff is in the washer. I rate this place high for the food, so lemme get back to that. Get the hot braised fish and you'll want some extra rice just for all the awesome flavored sauce that it's swimming in. There are misses too here, far in between all the hits. Come, eat.", "rating": 5, "date": "2012-06-01"}], "steamed rock cod": [], "san wang clam": [{"excerpts": ["Our favorite dishes: San Wang noodles, sweet and sour beef, Mongolian beef, black noodles, San Wang clam to name a few.\n\n"], "author": "Maki M.", "review": "This us my favorite Chinese restaurant in the city so far.\n\nI love the Korean waitress who anyways takes care of our table.  People who work here are really nice.  This place is always busy so their food is FRESH!!!\n\nOur favorite dishes: San Wang noodles, sweet and sour beef, Mongolian beef, black noodles, San Wang clam to name a few.\n\n***Very hard to find a parking space unless you park near by garage.***", "rating": 4, "date": "2011-05-15"}, {"excerpts": ["average san wang clam $eleven.ninety-five...little pricey beer ", "$seven.fifty (each)..."], "author": "Hen A.", "review": "chinese with korean fusion, but doing wrong...mediocre at best....black sauce noodles acceptable...dry fried chicken near tasteless...the rest?...typical monotonous edible chinese fare with ongoing blunders...incompetence?...san wang noodles recommended....the rest...not...\n\nsub-par pot stickers $six.fifty....equally sub-par steamed pot stickers $six.fifty....horrible dry-fried chicken $eight.ninety-five...mediocre dry-fried green beans $six-ninety-five...average beef soup noodle $seven-thirty-five....average san wang clam $eleven.ninety-five...little pricey beer $seven.fifty (each)...", "rating": 1, "date": "2009-09-10"}], "sauteed happy family": [], "dry fried crab": [], "abalone": [], "fried flounder": [{"excerpts": ["I recommend their dry friend chicken (wings) and the deep fried flounder! ", "Both are juicy, tender, and extremely flavorful. ", "Pair the sauce with rice and you'll be scarfing your rice down as if you were drinking water! "], "author": "Kristi T.", "review": "Been coming here since I was a little girl, and that comforting taste still exists! This is a Korean-Chinese fusion-esque restaurant, but dishes lean towards Chinese. \n\nI recommend their dry friend chicken (wings) and the deep fried flounder! Both are juicy, tender, and extremely flavorful. Pair the sauce with rice and you'll be scarfing your rice down as if you were drinking water! I do recommend ordering family style to share as portions are quite large. \n\nStreet parking will be tough during peak dining hours. You're better off saving time and parking in the parking garage. Service is decently friendly; pretty standard Chinese restaurant quality. Come for the food but not necessarily for the service and you'll feel great!", "rating": 4, "date": "2016-06-13"}, {"excerpts": ["Order the baby shrimp in hot pepper sauce, dry fried squid and the  fried flounder!  ", "Their Szchewan beef is good too!  ", "Food comes out fast too!!  ", "Been coming here for over 30+ years!"], "author": "deborah y.", "review": "Excellent food!! Order the baby shrimp in hot pepper sauce, dry fried squid and the  fried flounder!  Their Szchewan beef is good too!  Food comes out fast too!!  Been coming here for over 30+ years!", "rating": 5, "date": "2018-06-03"}, {"excerpts": ["We had the hot & sour soup, salt & pepper fried calamari, a huge fried flounder, and some chicken + veggies. ", "Everything except for the last one (and the kimchi appetizer) was gone by the end of the meal, which is always a good sign. ", "I wouldn't call the food refined or revolutionary, but I'd go again. "], "author": "Ralph L.", "review": "What an interesting place. A Chinese place that serves kimchi, OB beer, and black bean noodles. I've lived in California--south and north--for 15+ years and haven't come upon this combination. And I'm Chinese and had a Korean girlfriend for a really long time..\n\nAnyways, the food here is pretty competent with a taste that might surprise you. We had the hot & sour soup, salt & pepper fried calamari, a huge fried flounder, and some chicken + veggies. Everything except for the last one (and the kimchi appetizer) was gone by the end of the meal, which is always a good sign. I wouldn't call the food refined or revolutionary, but I'd go again. Plus it's so close to Japan plaza that it's a cool neighborhood...\n\nservice is okay.", "rating": 4, "date": "2010-09-19"}, {"excerpts": ["recommendations: fried beans (!), eggplant, general's chicken, fried chicken wings, hand-made noodles, fried flounder...despite the parking/decor problems", ", i seriously forgot how good this place is."], "author": "Mike C.", "review": "i'm in Japantown, and what do i go to as my default place? a Chinese restaurant! over the past few years, it's getting more and more crowded, so be prepared. of course, parking is pretty bad, but i know i'm just stating the obvious. the decor is definitely a lot more attractive since they remodeled, but the bathrooms still work; just somehow wish they were able to expand just on the bathrooms alone. food-wise, by far the best Chinese restaurant in the area...at least within a half-mile. recommendations: fried beans (!), eggplant, general's chicken, fried chicken wings, hand-made noodles, fried flounder...despite the parking/decor problems, i seriously forgot how good this place is.", "rating": 5, "date": "2011-07-18"}], "sweet  sour rock cod": [], "dry fried squid": [{"excerpts": ["Order the baby shrimp in hot pepper sauce, dry fried squid and the  fried flounder!  ", "Their Szchewan beef is good too!  ", "Food comes out fast too!!  ", "Been coming here for over 30+ years!"], "author": "deborah y.", "review": "Excellent food!! Order the baby shrimp in hot pepper sauce, dry fried squid and the  fried flounder!  Their Szchewan beef is good too!  Food comes out fast too!!  Been coming here for over 30+ years!", "rating": 5, "date": "2018-06-03"}, {"excerpts": ["We order our usual: dry fried squid with its juicy garlicky coat, shrimp in tomato sauce deceptively pedestrian but its tangy ketchup like sauce with bright peas thrown in is always scrumptious then there is also San Wang clams in black beans sauce.  "], "author": "Emily L.", "review": "San Wang and my family go way back.  Growing up, it was a near biweekly ritual for us.  Not because it was where my dad would talk politics in Korean with one of the \"ajussi\" owners or  the only place at that time serving the Korean-Chinese love child of a dish, jajangmyun and jambong but because celebration of life in our new home in the US was that much sweeter over a plate of sea cucumber or jellyfish, taste of the old country.  No birthday, graduation, promotion, pregnancy, birth, etc. would be complete without a visit to San Wang.\n\nSo here I am at the familiar round table with my brothers and mom.  No spouses, no kids, just mom and us.  We order our usual: dry fried squid with its juicy garlicky coat, shrimp in tomato sauce deceptively pedestrian but its tangy ketchup like sauce with bright peas thrown in is always scrumptious then there is also San Wang clams in black beans sauce.  And of course double order of jajangmyun polished off with house kimchi doused in vinegar.\n\nWe eat in silence then it hits me, this is the first time we have eaten together like this just the four of us since my dad's funeral nearly ten years ago.", "rating": 5, "date": "2011-11-25"}, {"excerpts": ["*Dry Fried Squid (2x): HOLY MOLY! ", "I've never had chinese calamari done this way. ", "On the bottom of the platter was a sauce made with soy sauce, vinegar, ginger, garlic, and jalapeno. ", "Then, they topple it with calamari ", "that's light, crisp, and tender. ", "This way the sauce doesn't make the calamari soggy....so simple, but genius. \n", "*Clams in Black Bean Sauce (2x): The clams were a good decent size and were super tender. ", "Normally, black bean sauce can be very salty, but in this dish it wasn't; you can actually \"taste\" the clams. \n", "*Noodles in Black Bean Sauce: The home-made noodles were done al-dente. ", "Not a huge fan of black bean sauce in general, so this dish was just ok for me. \n", "*", "Seafood Noodle Soup: ", "Didn't try this dish, but there was huge amounts of seafood (shrimp, scallop, calamari, etc). \n", "*Peashoots w/ Garlic (2x)", ": Peashoots were super fresh and wasn't overcooked, so it was still crisp. ", "There was just enough garlic to add the garlic flavor w/o it being to overpowering. \n", "*Dry Fried Green Beans (2x): MmMmM...another good dish. ", "But, then again all anything fried is good though right? "], "author": "Cherylynn N.", "review": "I've passed by SW restaurant a gazillion times and never even thought to give it a try b/c who eats at a Chinese restaurant in J-town? So, apparently I've been missing out in all the 27 years of my life. \n\nCame here on a Friday at around 9:30PM after HH at Izakaya Lounge. \n\nFOOD: \n*Starter: Kimchee (Free) - Not like the typical Korean kimchee. SW's version is less acidic and less spicy, probably because it isn't fermented as long. It was good though. \n*Dry Chicken Wings (2x): MmMmMm. Hot, crunchy, moist, spicy, sweet, garlicky = Enough said. Just as good as San Tung's! \n*Dry Fried Squid (2x): HOLY MOLY! I've never had chinese calamari done this way. On the bottom of the platter was a sauce made with soy sauce, vinegar, ginger, garlic, and jalapeno. Then, they topple it with calamari that's light, crisp, and tender. This way the sauce doesn't make the calamari soggy....so simple, but genius. \n*Clams in Black Bean Sauce (2x): The clams were a good decent size and were super tender. Normally, black bean sauce can be very salty, but in this dish it wasn't; you can actually \"taste\" the clams. \n*Noodles in Black Bean Sauce: The home-made noodles were done al-dente. Not a huge fan of black bean sauce in general, so this dish was just ok for me. \n*Seafood Noodle Soup: Didn't try this dish, but there was huge amounts of seafood (shrimp, scallop, calamari, etc). \n*Peashoots w/ Garlic (2x): Peashoots were super fresh and wasn't overcooked, so it was still crisp. There was just enough garlic to add the garlic flavor w/o it being to overpowering. \n*Dry Fried Green Beans (2x): MmMmM...another good dish. But, then again all anything fried is good though right? The green beans were lightly fried and then tossed with sauce soy sauce vinegar concoction which balanced out the oiliness of the beans. \n\nSERVICE (-1 Star): Sub par. We arrived at 9:30 and the restaurant closes at 10 PM. When we were ordering the waitress was very impatient, kept rolling her eyes, and pointed to her watch several times. No surprises here, I'm use to having rude service in chinese restaurant unless you're in PF Chang's which of course is NOT considered a chinese restaurant. So, you go there for the good food and not the service. \n\nAs you know, San Tung can get very crowded, so SW is a great alternative to go to. \n\nBTW, the food here is dirt CHEAP. We had 2 orders of everything except for the soup and it came out to $11/person including tip for 10 people. WOOT! \n\nI'll be back... :)", "rating": 4, "date": "2009-05-04"}, {"excerpts": ["Anything dry fried on the menu is a signature piece for this restaurant, but the dry fried squid is the one to get if none of the others. ", "Was just in the other day and there's something new with color plates and new bowls . ", ". . ", "not a good idea. ", "I know of very few places that try to plate a dish on a color other than white and there's a reason why", ": Let the food do the talking. ", "Let the colors and the food's own appearance speak for itself. ", "You eat first with your eyes and it's a total distraction to see a sauce turn greenish black against the mauve color of a Pottery Barn ", "close out plate - not serving platter. ", "It's funny ", "I rag on presentation, but this place does food so well that it doesn't need to try to take it up a notch with something that's a waste of money for the restaurant - unless the good everyday stuff is in the washer. ", "I rate this place high for the food, so lemme get back to that. "], "author": "Tristan C.", "review": "I've been coming for dine-in and takeout for years and this has been some if the best in the City. Anything dry fried on the menu is a signature piece for this restaurant, but the dry fried squid is the one to get if none of the others. Was just in the other day and there's something new with color plates and new bowls . . . not a good idea. I know of very few places that try to plate a dish on a color other than white and there's a reason why: Let the food do the talking. Let the colors and the food's own appearance speak for itself. You eat first with your eyes and it's a total distraction to see a sauce turn greenish black against the mauve color of a Pottery Barn close out plate - not serving platter. It's funny I rag on presentation, but this place does food so well that it doesn't need to try to take it up a notch with something that's a waste of money for the restaurant - unless the good everyday stuff is in the washer. I rate this place high for the food, so lemme get back to that. Get the hot braised fish and you'll want some extra rice just for all the awesome flavored sauce that it's swimming in. There are misses too here, far in between all the hits. Come, eat.", "rating": 5, "date": "2012-06-01"}, {"excerpts": ["dry fried shrimp, dry fried chicken, dry fried squid...", "yum.  ", "all deep fried with garlic chili sauce.\n", "lunch specials will fill you up.  ", "almost enough for two.  ", "we had 3 lunch specials for 4 people and still had leftovers.  ", "couple of favorites are the cashew chicken and sizzling rice soup.\nwho cares if it is \"korean chinese\" and not just \"chinese\"?  ", "Good eats is good eats!!!"], "author": "Dustin S.", "review": "everything deep fried is good here...dry fried shrimp, dry fried chicken, dry fried squid...yum.  all deep fried with garlic chili sauce.\nlunch specials will fill you up.  almost enough for two.  we had 3 lunch specials for 4 people and still had leftovers.  couple of favorites are the cashew chicken and sizzling rice soup.\nwho cares if it is \"korean chinese\" and not just \"chinese\"?  Good eats is good eats!!!", "rating": 4, "date": "2008-10-02"}, {"excerpts": ["The mongolian beef and dry fried squid.  ", "both are great dishes and I leave here with garlicky breath."], "author": "kenny l.", "review": "I don't come here for the noodles like everyone else does .  I come here specifically for 2 dishes.  The mongolian beef and dry fried squid.  both are great dishes and I leave here with garlicky breath.", "rating": 3, "date": "2007-07-26"}], "dry fried scallops": [{"excerpts": ["Pros\n\nSzechuan beef\nGarlic chicken\nDry fried scallops\nDry fry green beans\n\nCons\n\nNot as good as before\nRaised prices.  "], "author": "John L.", "review": "Pros\n\nSzechuan beef\nGarlic chicken\nDry fried scallops\nDry fry green beans\n\nCons\n\nNot as good as before\nRaised prices.  Some dishes almost doubled\nLack of service\n\nThis place was better with old owners. Place is cleaner now with new furniture and carpets \nStill good place for Chinese Korean food.  Rare type fusion", "rating": 3, "date": "2015-11-21"}, {"excerpts": ["I love the dry fried chicken (crisp skin, juicy meat, lots of garlic and spice off set by a sour/sweet/saly sauce), dry fried scallops, good kim chee, black been sauce noodles, clams with san wang sauce and mongolian beef.\n\n"], "author": "Kat T.", "review": "My Family and I have been coming here for more than 15 years.\nThe owners have changed throughout the years and so the food has sometimes become inconsistent, but when they're on point, the food is delicious and very good portions.\n\nI love the dry fried chicken (crisp skin, juicy meat, lots of garlic and spice off set by a sour/sweet/saly sauce), dry fried scallops, good kim chee, black been sauce noodles, clams with san wang sauce and mongolian beef.\n\nYes, it's a little dingy looking, mainly because of the carpet, but the place itself is fine.  Try it out!", "rating": 3, "date": "2008-08-01"}, {"excerpts": ["We ordered the dry fried chicken, dry fried scallops, mongolian beef and curry chicken. ", "Service was quick , food was really good, prices very decent and place looks great...", "only gripe is that the table for 4 is small, we had to stack plates' edges!--or we were all pigs for ordering so damn much! "], "author": "Steve K.", "review": "Went back to this place last week after a few years. We ordered the dry fried chicken, dry fried scallops, mongolian beef and curry chicken. Service was quick , food was really good, prices very decent and place looks great...only gripe is that the table for 4 is small, we had to stack plates' edges!--or we were all pigs for ordering so damn much! Oh yeah, hot and sour soup is off the hook!", "rating": 4, "date": "2008-11-01"}], "fresh mussel": [], "lo sam sang": [], "sauteed sea cucumbers": [], "salt and pepper crab": [], "sea cucumber": [{"excerpts": ["Was only able to try the sea cucumber and clams tonight and pair it with ginseng wine. ", "Fresh ingredients. ", "I usually don't like sea cucumber because of the slippery texture. ", "The chef mentioned he soaked the sea cucumbers for approximately one week and changing out the water everyday. ", "It turned out soft but yet slightly crunchy. ", "Not bad! ", "I might have a new found interest for sea cucumbers now. ", "It's a must try."], "author": "Jen L.", "review": "This family owned restaurant has been in business for 40+ years! Was only able to try the sea cucumber and clams tonight and pair it with ginseng wine. Fresh ingredients. I usually don't like sea cucumber because of the slippery texture. The chef mentioned he soaked the sea cucumbers for approximately one week and changing out the water everyday. It turned out soft but yet slightly crunchy. Not bad! I might have a new found interest for sea cucumbers now. It's a must try.", "rating": 5, "date": "2017-07-15"}, {"excerpts": ["I heard there's sea cucumber, but I must've overlooked it on the menu. ", "I'll have to get it and any other sea beasts on a future visit."], "author": "Dan B.", "review": "Surprriiiiiiiise! This Chinese restaurant's menu has Korean subtitles. It also has some Korean dishes. It also had two tables of Koreans among whom I sat when I went. I don't know what Korean stew the person across from me got, but a person beside me got jjajangmyeon, and it was good. It had a few shrimp sitting in it too, as a bonus.\n\nI myself got jellyfish because it sounded cool and because someone at my table endorsed it. When they said something about it being served with mustard, I didn't realize they meant the Chinese hot mustard. Those bites of mesoglea went straight to the back of my nose like wasabi. The texture and underlying flavor, if you'd call it flavor, were pretty mellow - simply something to try then say you've tried it.\n\nWhat I didn't get around to trying from our table's Lazy Susan were chicken wings, some other preparation of chicken, dumplings, and maybe one other dish. Everyone at the table(s) seemed to like their meals. But after the stinging, breath destroying appetizer of coarsely chopped onions with black bean(?) sauce, all the entrees seemed demagnified in a way.\n\nI heard there's sea cucumber, but I must've overlooked it on the menu. I'll have to get it and any other sea beasts on a future visit.", "rating": 3, "date": "2011-12-24"}, {"excerpts": ["Not because it was where my dad would talk politics in Korean with one of the \"ajussi\" owners or  the only place at that time serving the Korean-Chinese love child of a dish, jajangmyun and jambong but because celebration of life in our new home in the US was that much sweeter over a plate of sea cucumber or jellyfish, taste of the old country.  ", "No birthday, graduation, promotion, pregnancy, birth, etc. "], "author": "Emily L.", "review": "San Wang and my family go way back.  Growing up, it was a near biweekly ritual for us.  Not because it was where my dad would talk politics in Korean with one of the \"ajussi\" owners or  the only place at that time serving the Korean-Chinese love child of a dish, jajangmyun and jambong but because celebration of life in our new home in the US was that much sweeter over a plate of sea cucumber or jellyfish, taste of the old country.  No birthday, graduation, promotion, pregnancy, birth, etc. would be complete without a visit to San Wang.\n\nSo here I am at the familiar round table with my brothers and mom.  No spouses, no kids, just mom and us.  We order our usual: dry fried squid with its juicy garlicky coat, shrimp in tomato sauce deceptively pedestrian but its tangy ketchup like sauce with bright peas thrown in is always scrumptious then there is also San Wang clams in black beans sauce.  And of course double order of jajangmyun polished off with house kimchi doused in vinegar.\n\nWe eat in silence then it hits me, this is the first time we have eaten together like this just the four of us since my dad's funeral nearly ten years ago.", "rating": 5, "date": "2011-11-25"}, {"excerpts": ["The spicy seafood noodle soup with hand-pulled noodles had lots of seafood, including clams, sea cucumber, etc.  ", "The broth is decent but not amazing.  ", "I could do without ordering it.   ", "I think we had hot pepper shrimp - it was deep fried and goopy, definitely a disappointment.  ", "The mabo tofu is okay but not special.  "], "author": "Lolia S.", "review": "We've been coming here forever and we visited their other locations as well (now closed).  The menu still seems the same after the recent remodeling (they were closed for a couple of months) and they still give you some complimentary yummy kim chee to start (the owner is Chinese but lived in Korea, I believe).  Some of the dishes were better before the remodel, some were better afterwards.  It seems even more popular now than it did before the remodel (consider making reservations).  Post-remodel, more items seem to be battered and fried than pre-remodel.  The place still looks rather plain despite the remodel.  The dishes have plenty of sauce, probably too much sauce, but the sauces are good and plenty flavorful.  There have been fights over who would take home the leftover sauce.\n\nIt's really a three star restaurant but two five star dishes, reasonable prices, generous portions, and the status as an old family favorite earn San Wang an extra star.  Get the clams in their special sauce with jalapenos and dry fried chicken (my father's favorite, it's loaded with ample garlic and chili peppers, crispy outside, tender inside, explosive flavor).  It seems like you get far less chicken than you used to though.  \n\nThe dry fried string beans were a family favorite too, but they're coated in some type of batter now and they weren't before.  Some of the green beans were stuck together and they didn't use the Chinese long beans.  They do have a great, garlicky flavor though.  The spicy seafood noodle soup with hand-pulled noodles had lots of seafood, including clams, sea cucumber, etc.  The broth is decent but not amazing.  I could do without ordering it.   I think we had hot pepper shrimp - it was deep fried and goopy, definitely a disappointment.  The mabo tofu is okay but not special.  I used to like this dish better before the remodel.\n\nPortions are generous, the food comes out in a blink of an eye even when they're busy, and the prices are reasonable enough to even please my father.  It's better to come here with a large group (make reservations).\n\nThey don't give you oranges or fortune cookies at the end of the meal.  Too bad.  Much as I like authentic Chinese food, I still enjoy fortune cookies.", "rating": 4, "date": "2008-07-25"}, {"excerpts": ["Their spicy soup is filled with perfectly al dente hand-pulled noodles and tons of goodies like clams, shrimp, squid, sea cucumber (the only not-so-goody), pork, mushrooms, wood ear fungus, napa cabbage, and zucchini.  \n", "- Noodles with plum sauce (popularly known in Chinese as \"zhajiang mian\" and in Korean as \"jajangmyeon\"): I'm not sure why they call it plum sauce because it's really a black soybean sauce.  ", "They use their awesome hand-pulled noodles in this dish, and the sauce is not too overpowering.\n"], "author": "Diane L.", "review": "This place offers extremely large portions of Korean-Chinese food for super cheap prices.  I never thought that I'd ever come to Japantown for Chinese food, but my parents and I stumbled upon this place one Sunday, and I have been a fan ever since.\n\nMy favorites:\n\n- Dried fried chicken: These are so bad for you, but so sinfully good, especially with all the minced garlic and scallions found in the dish.\n- Dumplings: These are filled with pork and tons of chives (beware of those after-meal burps!).  But the best thing about them is the handmade dumpling skins.  \n- San Wang spicy noodle soup (popularly known in Korean as \"jjampong\"): It is so very comforting on a cold day.  Their spicy soup is filled with perfectly al dente hand-pulled noodles and tons of goodies like clams, shrimp, squid, sea cucumber (the only not-so-goody), pork, mushrooms, wood ear fungus, napa cabbage, and zucchini.  \n- Noodles with plum sauce (popularly known in Chinese as \"zhajiang mian\" and in Korean as \"jajangmyeon\"): I'm not sure why they call it plum sauce because it's really a black soybean sauce.  They use their awesome hand-pulled noodles in this dish, and the sauce is not too overpowering.\n- San Wang Chow Mein: This is exactly like the jjampong (ingredients-wise), except without the spicy soup, and the flavor is full of the heat of the wok. \n\nThis place can be packed at the oddest hours when you would not think it would be (e.g. 3pm on a Sunday afternoon and 9:30pm on a Friday night).  I know this because I've been here at those exact hours!", "rating": 4, "date": "2008-03-30"}], "shrimp with tomato sauce": [{"excerpts": ["My girlfriend's shrimp with tomato sauce was definitely made with ketchup. "], "author": "Sean W.", "review": "Since I think Chinese food in San Diego is mostly crap, one of the first things I like to do in other cities is try their Chinese.\nThis place was pretty bad; my General's Chicken tasted like it had been cooked 3 days earlier and reheated. My girlfriend's shrimp with tomato sauce was definitely made with ketchup. The hot and sour soup was neither.\nService was friendly.", "rating": 1, "date": "2011-02-21"}], "sweet and sour shrimp": [{"excerpts": ["My brother loves their sweet and sour shrimp (yum). ", "My dad loves their salt and pepper spare ribs (yum). ", "I loved their chicken in peking sauce. ", "It had tender chicken in a tangy peking sauce with a nice kick of red pepper. ", "They took it off their menu and broke my heart. "], "author": "Tab C.", "review": "I've been going to San Wang for years. Used to be my favorite chinese place in the city. While they still have some gems, some of it has been lost to me. Maybe i'm biased because they got rid of my favorite menu item. Yeah, maybe i'm just hurt. \n\nSo they have amazing hand-pulled noodles. We always order chow mein when we are here. They also have some bomb shrimp fried rice. One of my faves in the city. My mom loves their dry fried green beans (yum). My brother loves their sweet and sour shrimp (yum). My dad loves their salt and pepper spare ribs (yum). I loved their chicken in peking sauce. It had tender chicken in a tangy peking sauce with a nice kick of red pepper. They took it off their menu and broke my heart. *sniff sniff*\n\nIt's great for large groups and they even have an upstairs for private parties. Their food is good and decently priced. There's never too long of a wait and their wait staff is attentive and quick. \n\nI would give it 3.5 stars because they took away my fave dish but i bumped them up to 4 since i've been going there so long and have always had good dining experiences with them.", "rating": 4, "date": "2012-04-02"}, {"excerpts": ["Sweet and sour Shrimp: I like!!!! ", "The shrimp was still crispy even with the sweet and sour sauce all over it. \n"], "author": "Jenny M.", "review": "Been to this place a couple times before and keep forgetting to Yelp it! It looks like a hole in the wall place and has a 2nd floor for more seating. We got seated upstairs and I think the waitress forgot about us because it took them forever to come and take our order (but the food made up for it). \n\nWe ordered: \n\nSteamed pot-stickers: these were okay but I would have preferred them fried! \nMongolian Beef: very flavorful and I think they even added some mushrooms to it. \nSweet and sour Shrimp: I like!!!! The shrimp was still crispy even with the sweet and sour sauce all over it. \nDeep fried chicken: it had a garlic kick to it =) \nHot Spiced Bean Curd: Really good but not spicy enough for me. \nBlack noodles (not the correct name for it): really fresh  \n\nWould come back to try other stuff ... oh yeah the parking is hard to find but then again it's San Francisco!", "rating": 4, "date": "2009-08-03"}], "shrimp with green peas": [], "shrimp with black bean sauce": [{"excerpts": ["The shrimp with black bean sauce are succulent with one of the most flavorful black bean sauces ever and fresh green onions and bell peppers.  ", "The steamed rice is firm not soggy.  ", "The plum sauce noodles are to die for; hand pulled fresh goodness of just the right amount of gossamerness and chewiness you would expect in northern style noodles.  ", "The complimentary kim chi is an excellent spicy, salty, crunchy number.  ", "So, for excellent Shandong cuisine at reasonable prices with friendly service in a clean yet ", "no frills atmosphere, Sam Wang's cannot be beat.  keep up the good work guys.!"], "author": "Brian S.", "review": "Having heard so much about their dry fried chicken, dumplings, and hand pulled noodles being the stars of the show, especially for a Shandong restaurant like there is, I was itching like crazy to try it.  Finally, a few nights ago, I did just that.  Our eyes were bigger than our stomachs with another night's worth of food; the service is very friendly, prices very reasonable, and atmosphere clean though no frills.  The water dumplings (boiled dumplings filled with shrimp and chives) topped with a little soy sauce are excellent; just the right amount of gossamerness with succulent shrimp and subtle chives.  The dry fried chicken is excellent with a light glaze of a sauce of black pepper, chili, and garlic.  The shrimp with black bean sauce are succulent with one of the most flavorful black bean sauces ever and fresh green onions and bell peppers.  The steamed rice is firm not soggy.  The plum sauce noodles are to die for; hand pulled fresh goodness of just the right amount of gossamerness and chewiness you would expect in northern style noodles.  The complimentary kim chi is an excellent spicy, salty, crunchy number.  So, for excellent Shandong cuisine at reasonable prices with friendly service in a clean yet no frills atmosphere, Sam Wang's cannot be beat.  keep up the good work guys.!", "rating": 5, "date": "2011-08-28"}], "szechuan shrimp": [{"excerpts": ["Dried fried chicken wings, clams, chicken with string beans, beef with string beans, egg plant, cashew chicken, szechuan shrimp, and soup.\n\n"], "author": "Kylie L.", "review": "Dried fried chicken wings, clams, chicken with string beans, beef with string beans, egg plant, cashew chicken, szechuan shrimp, and soup.\n\nWent here with my coworkers today, it was a lot better than I had expected. My favorites were the wings and clams even though the clams were a bit too saucy for me and I love sauce. The soup was something that seemed like they threw in everything but the kitchen sink, not impressed. I am a bit sad that I didn't get jiajiangmyun, I saw a lot of people with that.", "rating": 4, "date": "2012-12-04"}], "broccoli with shrimp": [], "shrimp with bean curd": [], "jumbo prawns": [], "shrimp with hot pepper sauce": [{"excerpts": ["Not many Korean Chinese restaurants in the area, so this would be a good choice if you crave jajangmyeon (black bean sauce noodles) or shrimp with hot pepper sauce. ", "My friends and I thought both of these dishes were really good, better than San Tung. ", "However, the water dumplings we got tasted average. "], "author": "Diana C.", "review": "Not many Korean Chinese restaurants in the area, so this would be a good choice if you crave jajangmyeon (black bean sauce noodles) or shrimp with hot pepper sauce. My friends and I thought both of these dishes were really good, better than San Tung. However, the water dumplings we got tasted average. Don't order the walnut shrimp; I've definitely had better at several other restaurants. They give you a bit of kimchi when you first sit down, but you'll need to flag a waiter down if you need to add water to the teapot - typical Chinese restaurant service, which doesn't bother me as I care way more about the food.", "rating": 3, "date": "2016-12-07"}, {"excerpts": ["Yet, my expectation for  'baby Shrimp with Hot Pepper Sauce ' was unfulfilled. ", "First, the shrimp isn't baby shrimp! ", "Second, the shrimp is fried!  ", "it should say so if you gonna fry!!\n", "Then coming from Japan, I imagined \nred chili pepper sauce covering the shrimps. ", "However, here fried shrimp was mingled with sliced jalapeno..", "Third, it is with frozen carrots and peas...."], "author": "Chacha M.", "review": "My co-worker had a thing with the Chan-pong noodle here, and I enjoyed lunch items most of the time when visited with him.\nI liked something like seafood over rice or beef dish.\n\nNever had fried dish until today... yet most people here recommended this place as a grease shop, so I ordered the dried fried chicken for the good reviews\n\nYes, the chicken is all right. \nCrispy and tasty with veg toppings.\n\nYet, my expectation for  'baby Shrimp with Hot Pepper Sauce ' was unfulfilled. First, the shrimp isn't baby shrimp! Second, the shrimp is fried!  it should say so if you gonna fry!!\nThen coming from Japan, I imagined \nred chili pepper sauce covering the shrimps. However, here fried shrimp was mingled with sliced jalapeno..Third, it is with frozen carrots and peas....Fourth, it's not even spicy regardless the number of jalapeno slices.\n\n\nWell, I will stick to something non-fried next time like I used to. I still haven't tried the chan-pong or jyajya-meng.\n\nLooking forward to them!", "rating": 3, "date": "2008-01-25"}], "dry fried shrimp": [{"excerpts": ["Dry fried shrimp unbeatable. ", "Szechuan beef unbeatable. ", "Whole fish unbeatable. ", "Try the fresh made noodles but in soup not chow fun style. ", "One my all time favorites anywhere in the world."], "author": "Tyrion L.", "review": "Been going to this place for about 25 years+. Amazing consistency with really great tasting food. Dry fried shrimp unbeatable. Szechuan beef unbeatable. Whole fish unbeatable. Try the fresh made noodles but in soup not chow fun style. One my all time favorites anywhere in the world.", "rating": 5, "date": "2018-07-28"}, {"excerpts": ["Amazing Chinese/Korean food - chajang myun, hot and sour soup, sweet and sour pork, and dry fried shrimp! ", "That's all I've gotten here for 20 years "], "author": "Brandon F.", "review": "I've been coming here since I was a kid in the 90s. Amazing Chinese/Korean food - chajang myun, hot and sour soup, sweet and sour pork, and dry fried shrimp! That's all I've gotten here for 20 years and it's always awesome. \n\nThat being said, it's a hole in the wall that's ran by the family. Don't let that scare you away from this hidden gem in the heart of Japan Town!", "rating": 5, "date": "2018-05-13"}, {"excerpts": ["Get the Jjajangmyun, dry fried shrimp, Tangsooyook (sweet and sour beef or pork), and the clams. ", "So bomb. ", "One time the owners daughter found out it was my mom's birthday ", "and she secretly ran out down the street to buy her a cake. ", "So sweet!"], "author": "Chris F.", "review": "I've been coming to this restaurant since I was fresh out the oven. Love the food, love the owners, love the restaurant. Get the Jjajangmyun, dry fried shrimp, Tangsooyook (sweet and sour beef or pork), and the clams. So bomb. One time the owners daughter found out it was my mom's birthday and she secretly ran out down the street to buy her a cake. So sweet!", "rating": 5, "date": "2018-05-13"}, {"excerpts": ["We ordered the dry fried shrimp, twice cooked beef, a noodle dish, fried rice, and dried fried chicken wings. ", "Our total was close to $80 ", "but like I said, the portion was well worth it. "], "author": "Dixie x.", "review": "Food portion was awesome! We ordered a little too much. We ordered the dry fried shrimp, twice cooked beef, a noodle dish, fried rice, and dried fried chicken wings. Our total was close to $80 but like I said, the portion was well worth it. It came with Kim chi and hot tea also!\n\nThe reason why I'm only giving 3 stars is for customer service. I felt like we were rushed to order. We didn't get a \"welcome/how are you\", all we got was \"have a seat here because there's a big party coming in\", and there wasn't. Never once did our server come see if we're doing OK, or even offered us water or any other drinks. The only time we saw her was when she noticed we were done eating, to bring us our check and packed our left overs for us. One of the other server had her eyes stuck on the tv also.", "rating": 3, "date": "2016-05-27"}, {"excerpts": ["Dry fried green beans, dry fried calamari, dry fried chicken, dry fried shrimp. ", "San wang clams!!! ", "Been coming here for 20+ years literally and they never disappoint!"], "author": "Briana H.", "review": "Dry fried everything!!! Dry fried green beans, dry fried calamari, dry fried chicken, dry fried shrimp. San wang clams!!! Been coming here for 20+ years literally and they never disappoint!", "rating": 4, "date": "2015-01-14"}, {"excerpts": ["I had The Dry Fried Shrimp ", "and it was a excellent choice for lunch my description is savory, crunchy, and delicious."], "author": "Sharon L.", "review": "I I had The Dry Fried Shrimp and it was a excellent choice for lunch my description is savory, crunchy, and delicious.", "rating": 4, "date": "2014-09-08"}, {"excerpts": ["Dry fried shrimp..................tasted ", "ok "], "author": "jason g.", "review": "I remember when they had a restaurant on Clement St 17 years ago.  This restaurant has been opened for close to 30 years and I remembered it to be very good.  Please do not even compare this restaurant to San Tung or mentioned this restaurant in the same sentence.  If I had to choose between the 5.99 dim sum place in Chinatown or this place, I would really have to choose the 5.99 dim sum place.\n\nIno sushi was closed today so we ended up going here.  This is by far one of the worst Chinese restaurant that I have ever been to.  Dom, my friend sitting to my left on my profile pic chose this restaurant.  I should have known better.  I don't think he can pick a good restaurant if it hit him on the head.  What a mistake that was.  Brian P. said this is one of his favorite restaurants in the city.  Maybe in the city of Tulsa, Oklahoma.  I swear I am going to start doing random drug tests in my office.   I am about to fire him for even recommending this restaurant.  Brian P.  I am going to test you for drugs and then fire you.  hahhaahhah\n\nTERRIBLE...........here's why.\n\nHot and sour soup.  Saw a couple of flies in the soup so we had to return it.  I don't mind bugs in the food.  I am not that picky.  If your food is good..........I can overlook it.  Things like this happens in all restaurants. We changed it and got the seafood soup.  It was tasteless.\n\nPotstickers........tasted like frozen potstickers\n\nMushu Pork........Should have been called mushy pork.  The pork, egg, cabbage was very mushy and slimy.  The skin was hard.  It needed to be steamed.\n\nDry fried chicken..................exactly as it sounds.  Dry, Fried, Chicken.  It was tasteless.\n\nDry fried shrimp..................tasted ok but it wasn't something I would ever crave again in this life time.\n\nBraised string beans.........it was fresh but the mushrooms were extremely salty but the beans weren't?  \n\nTotal price was 59.00\n\nMy friend Dom treated.  I don't know whether to thank him or kill him.", "rating": 1, "date": "2008-10-29"}, {"excerpts": ["dry fried shrimp, dry fried chicken, dry fried squid...", "yum.  ", "all deep fried with garlic chili sauce.\n", "lunch specials will fill you up.  ", "almost enough for two.  ", "we had 3 lunch specials for 4 people and still had leftovers.  ", "couple of favorites are the cashew chicken and sizzling rice soup.\nwho cares if it is \"korean chinese\" and not just \"chinese\"?  ", "Good eats is good eats!!!"], "author": "Dustin S.", "review": "everything deep fried is good here...dry fried shrimp, dry fried chicken, dry fried squid...yum.  all deep fried with garlic chili sauce.\nlunch specials will fill you up.  almost enough for two.  we had 3 lunch specials for 4 people and still had leftovers.  couple of favorites are the cashew chicken and sizzling rice soup.\nwho cares if it is \"korean chinese\" and not just \"chinese\"?  Good eats is good eats!!!", "rating": 4, "date": "2008-10-02"}], "shrimp with garlic sauce": [], "shrimp with snow peas": [], "vegetable shrimp": [], "salt and pepper shrimp": [], "walnut shrimp": [{"excerpts": ["All the other foods like honey walnut shrimp, fried rice, sizzling soup, salt n pepper spareribs etc... is all good as well!!!\n\n"], "author": "Ryan M.", "review": "I have been going to this spot since I was in middle. I'm. thinking 1999. We always had big family parties upstairs. I would also go here with my primary family to have dinner.\n\nThe # 1 thing we ordered is the deep fried squid Super smacking extra crispy if possible. Its an all time favorite and cravings Yadadaimean!!! All the other foods like honey walnut shrimp, fried rice, sizzling soup, salt n pepper spareribs etc... is all good as well!!!\n\nEnjoy a Lunch or Dinner here!!!", "rating": 5, "date": "2018-07-28"}, {"excerpts": ["This is where everything went very, very awry: the bus boy began bringing our dishes, first the walnut shrimp and bowl of steamed rice (I picked off a small bit of soy-stained rice off the edge of the bowl and put it aside.)\n\n"], "author": "Jennifer O.", "review": "#33/2016\n\nThey did the right thing, I want to start with that.\n\nWe wandered past a nearly full restaurant at 2pm and said, \"Let's have lunch.\" \n\nA laminated review in their window indicated they're known for their hand-pulled noodles.\n\nYet, I shouldn't have ignored the 4 foot tall cart piled high with dirty dishes wheeled past us to a full stop. The bus boy pushed the cart past us a moment later but it was a sign of things to come.\n\nWon ton soup was good, the dumplings were excellent with thin wrappers and delicious pork filling. \n\nThis is where everything went very, very awry: the bus boy began bringing our dishes, first the walnut shrimp and bowl of steamed rice (I picked off a small bit of soy-stained rice off the edge of the bowl and put it aside.)\n\nI chose to ignore it, my mistake -again. \n\nI had two or three shrimp; they were very good but the thought of the bus boy clearing tables in between becoming our server, I began to stop eating.\n\nThe water dumplings came, again delivered by the bus boy. I was ok until I remembered he'd gone from clearing tables to the dumplings set on our table.\n\nI stopped eating. I pushed away the Tsing Tao he'd also set down. I patiently waited to ask for the check.\n\nAnd in those two minutes, I thought about cross-contamination, Hep A, Zika and I complained to the harried but sweet manager who apologized and said two people had called in sick and..\n\nI stage whispered- though there was now only one table occupied,\n\n\"That's not my problem! This is unsanitary. Think of the contamination. I was going to take this home but I don't even want to eat it!\"\n\nShe tried to explain he'd washed his hands and pointed to a sink a few feet away and I insisted,\n\n\"But he didn't! Not the first- or second or third time he brought our food in between clearing tables.\"\n\nShe sincerely apologized and said she'd talk to the owner in the kitchen. \n\nShe came out quickly and said they wouldn't charge us.\n\nBetween our barely touching anything besides the soup, the decision was straightforward still, I appreciated they did the right thing. \n\nThe restaurant was full at 2pm for a reason: The food would be very good under other circumstances. And I felt bad that a small family business would be crippled by two no-show employees. \n\nI thanked them, put a $10 tip on the table (likewise the right thing to do) and left.", "rating": 3, "date": "2016-03-12"}, {"excerpts": ["Don't order the walnut shrimp; I've definitely had better at several other restaurants. ", "They give you a bit of kimchi when you first sit down, but you'll need to flag a waiter down if you need to add water to the teapot - typical Chinese restaurant service, which doesn't bother me as I care way more about the food."], "author": "Diana C.", "review": "Not many Korean Chinese restaurants in the area, so this would be a good choice if you crave jajangmyeon (black bean sauce noodles) or shrimp with hot pepper sauce. My friends and I thought both of these dishes were really good, better than San Tung. However, the water dumplings we got tasted average. Don't order the walnut shrimp; I've definitely had better at several other restaurants. They give you a bit of kimchi when you first sit down, but you'll need to flag a waiter down if you need to add water to the teapot - typical Chinese restaurant service, which doesn't bother me as I care way more about the food.", "rating": 3, "date": "2016-12-07"}, {"excerpts": ["Walnut shrimp.. "], "author": "Emmett B.", "review": "The worst Chinese/Korean restaurant in the city.... yes, its pretty bad.\n\n* the free kim chee appetizer was underwhelming.  I've had better kim chee from a jar... seriously!\n* the chowmein, packaged noodles and with a bunch of random ingredients tossed together.. horrible\n* Mongolian beef - the WORST Mongolian Beef I've ever had.  No seasoning on the beef and way too much green onions.\n* Sauteed string beans- you would think this would be a can't go wrong dish, but naw.. they messed this up to with whatever sauce they added to the dish\n*hot and sour soup.. tasted like packaged soup and they just added water\n*Walnut shrimp.. the shrimp was good with good glaze and crunch, but the candied walnuts were separated on the side and ruined the dish.\n\nLastly service... nonexistent!", "rating": 1, "date": "2014-10-23"}, {"excerpts": ["I order the two delicacy cold platter; walnut shrimp and noodles with plum sauce... ", "Those were very good!!!!"], "author": "Wenhao J.", "review": "First time have Korean food, feeling good and having a lot fun here.........!\nI order the two delicacy cold platter; walnut shrimp and noodles with plum sauce... Those were very good!!!!", "rating": 4, "date": "2014-09-13"}, {"excerpts": ["Jai Jiang Mein (a korean noodle dish), walnut shrimp, their deep fried chicken, AND a whole Hot Braised Fish (rock cod). ", "The two highlight dishes here for me were the fried chicken and the dau mu. ", "I have not had fried chicken that good since my days of living in Beacon Hill in Boston, Primo's restaurant. ", "Not sure that these were actually "], "author": "Michael C.", "review": "Cannot really say that I had ever tried Chinese Korean food before, so I was looking forward to this meal. MAN ALIVE - be absolutely sure you come with an appetite!\n\nWalking in, San Wang resembles a usual Chinese restaurant. Florescent lighting, white walls, cooks clanging pots in the back, and waiters bustling all over the place. I was the first of my party for 9 that had arrived and luckily we called ahead for reservations, because the restaurant was quite crowded. Another group of 10 dropped into the restaurant without reservations at the same time I showed up. The waiter gave my table away because my other dinner mates had not showed up yet. Understandably, my group was placed a very cramped table. I think I sat at a 45 degree angle from the table to be exact. But seriously, I was ready to eat standing up if I had too!\n\nOnce everyone arrived we took some time and ordered 7 dishes. We were not told how big these dishes were, but just by looking around, I could tell these were massive portions. Someone at first thought that it would not be enough, but we were spot on with the order size. We started out with a large bowl of Hong Kong style Sizzling chicken broth soup. Then the food started coming out immediately. Ma Po tofu dish, sauteed pea sprouts (dau mu), dry fried green beans with chicken,  Jai Jiang Mein (a korean noodle dish), walnut shrimp, their deep fried chicken, AND a whole Hot Braised Fish (rock cod). The two highlight dishes here for me were the fried chicken and the dau mu. I have not had fried chicken that good since my days of living in Beacon Hill in Boston, Primo's restaurant. Not sure that these were actually Pea Pod stems per se, but they were really well done.\n\nThe service here is awesome. There was one younger waiter who was just buzzing around so quickly and on top of everything. For a group of 9, we were all completely full and each of us ended up paying only $15 dollars. Incredibly good value for the amount of food we ordered.", "rating": 4, "date": "2012-03-09"}], "pork with garlic sauce": [{"excerpts": ["I ordered pork with garlic sauce. ", "It was really bland. ", "This plates were a bit dirty. ", "$20 minimum for credit card, which they didn't mention anywhere. ", "I don't think I'd come here again unless other restaurants in Japan town are closed."], "author": "H M.", "review": "Okay Chinese food. I ordered pork with garlic sauce. It was really bland. This plates were a bit dirty. $20 minimum for credit card, which they didn't mention anywhere. I don't think I'd come here again unless other restaurants in Japan town are closed.", "rating": 2, "date": "2017-02-17"}], "pork with black mushrooms": [], "pork with green onion": [], "green bean": [{"excerpts": ["The green bean tasted exactly like the chicken. ", "Our potstickers fell apart. ", "The salt and pepper pork was a little tough. "], "author": "Karen B.", "review": "It was ok. I always rave about San Tung to my mother. My mother always says \"San Tung is good, but San Wang is better.\" We set out to settle the question. \n\nI was pretty excited when we sat in the Chinese restaurant and it was filled with Korean people. I thought this may be some pretty good Cam-pong-gi (dry fried chicken :) Everything was just ok. The chicken lacked the flavor I am used to. It just did not have any \"kick.\" The green bean tasted exactly like the chicken. Our potstickers fell apart. The salt and pepper pork was a little tough. Overall, I was not impressed. \n\nThe only exception was the Ja-Ja mein. I've been eating noodles for over 30 years and this place tastes pretty close to grandma's. \n\nI would eat here if I happen to be in the area, but I wouldn't make a special trip....unless I was feining for some hella good Ja-Ja Mein. \n\nPS: I brought the left overs home to mom. Her reaction: \"hey, this food tastes no good. what happen? tastes bad. maybe they change the cook\"", "rating": 3, "date": "2008-08-29"}], "salt and pepper ribs": [{"excerpts": ["Salt and pepper ribs. ", "Vegetable fried rice and the lemon chicken. . ", "I enjoyed everything.  ", "The waitress was horrible. ", "But the food was worth the wait. ", "It not the best I have ever had. ", "But it's pretty good."], "author": "Hershey R.", "review": "Came in  today trying something new in the area, we ordered chicken chowmein. Salt and pepper ribs. Vegetable fried rice and the lemon chicken. . I enjoyed everything.  The waitress was horrible. But the food was worth the wait. It not the best I have ever had. But it's pretty good.", "rating": 3, "date": "2014-11-08"}, {"excerpts": ["But I also ordered the salt and pepper ribs its off the hook, its so good and so crunchy."], "author": "Corey W.", "review": "I came here yesterday for a semi-good meal I always order the won-ton soup, its one of the best in the city, they give you lots of won tons and veggies in the soup.\nAnd of course I ordered the dry fried chicken wings they are good but not as good as san tung .\nBut I also ordered the salt and pepper ribs its off the hook, its so good and so crunchy.", "rating": 3, "date": "2014-03-31"}], "sweet and sour pork": [{"excerpts": ["Amazing Chinese/Korean food - chajang myun, hot and sour soup, sweet and sour pork, and dry fried shrimp! ", "That's all I've gotten here for 20 years "], "author": "Brandon F.", "review": "I've been coming here since I was a kid in the 90s. Amazing Chinese/Korean food - chajang myun, hot and sour soup, sweet and sour pork, and dry fried shrimp! That's all I've gotten here for 20 years and it's always awesome. \n\nThat being said, it's a hole in the wall that's ran by the family. Don't let that scare you away from this hidden gem in the heart of Japan Town!", "rating": 5, "date": "2018-05-13"}, {"excerpts": ["Do NOT order the sweet and sour pork. ", "It's really disgusting... water down, chewy, greasy... all in one. ", "Honestly... ", "Don't think I've had any worse Chinese food before"], "author": "min t.", "review": "Do NOT order the sweet and sour pork. It's really disgusting... water down, chewy, greasy... all in one. Honestly... Don't think I've had any worse Chinese food before", "rating": 1, "date": "2018-03-27"}, {"excerpts": ["The sweet and sour pork needs some improvement. ", "Jjajangmyun is probably the best choice here."], "author": "Charles K.", "review": "Family from Korea was in town. Ended up eating here as they really wanted some Korean/Chinese food. Surprisingly better than expected. Still just okay Chinese/Korean. The sweet and sour pork needs some improvement. Jjajangmyun is probably the best choice here.", "rating": 3, "date": "2018-04-26"}, {"excerpts": ["Great tangsuyuk (sweet and sour pork or beef ", "that's deep fried)! "], "author": "Esther L.", "review": "Great tangsuyuk (sweet and sour pork or beef that's deep fried)! Ja jang (noodles with black bean sauce) is also good. \n\nUsed to drive here from Davis to get Koreanized Chinese food. \n\nRestroom is a spacious one room deal. Very accessible. \n\nSeating area is mostly wheelchair accessible, depending on how crowded it is. Second floor seating is not. \n\nIn Japantown. Across from Daiso.", "rating": 5, "date": "2016-03-24"}, {"excerpts": ["I get the korean sweet and sour pork. ", "JaJangmyun noodle, black bean clams. ", "The chinese kimchi is good, I eat a ton of it.  ", "I honestly like this place better than the famous one on sunset only because I grew up eating this type of chinese korean a lot ", "and I enjoy it better. ", "The chicken wings are alright. ", "I wouldnt get it there."], "author": "Barry W.", "review": "Whenever im craving chinese korea. I get the korean sweet and sour pork. JaJangmyun noodle, black bean clams. The chinese kimchi is good, I eat a ton of it.  I honestly like this place better than the famous one on sunset only because I grew up eating this type of chinese korean a lot and I enjoy it better. The chicken wings are alright. I wouldnt get it there.", "rating": 3, "date": "2016-10-26"}, {"excerpts": ["Need to try the sweet and sour pork next."], "author": "L Y.", "review": "Great jjampong!  Great jajamyung!  Brings back memories of eating lunch with the family after church in LA.  Need to try the sweet and sour pork next.", "rating": 5, "date": "2016-10-24"}, {"excerpts": ["What I Had: \nJajangmyun\nSweet and sour pork \nJambong \nDumplings \nFried rice \n\nFood Review: ", "Sweet and sour pork was mostly breading and very little meat, but their Jajangmyun was fine. "], "author": "Rachael K.", "review": "Occasion: Dinner with family \n\nWhat I Had: \nJajangmyun\nSweet and sour pork \nJambong \nDumplings \nFried rice \n\nFood Review: Their Jambong was alright, nothing special. Sweet and sour pork was mostly breading and very little meat, but their Jajangmyun was fine. I really enjoyed all the food because it was freezing cold outside and we were all pretty hungry, but it wasn't anything better than other places I've been. \n\nService Review: Food came out quickly, and they didn't disturb us while eating (typical at many Asian restaurants, so not a surprise). \n\nVenue Review: Lots of indoor seating that could fit even larger families or groups. Parking can be found down the street in an underground parking lot, or if you're lucky there is also some street parking. \n\nOverall Impression: Perfect place to go for some solid Asian comfort food or for large groups. Nothing really special, but good Chinese food on cold days.", "rating": 3, "date": "2011-11-12"}, {"excerpts": ["Hand-made noodle is great~ Jjajangmyun (Korean Style chow-mein), Tangsooyook (Korean style sweet and sour pork), Sizzling rice soup, Yangjangpee, ", "Shrimp Kkanpoongi are my favorite dishes... ", "More people you go with, better here~ ", "Their dishes are huge and staff are nice. ", "If you ask for Kimchee~ you will get that as well!!"], "author": "Sunny K.", "review": "In this restaurant, yougotta order \"Korean\" style chinese dishes! I have been coming to this restaurant for many church occasions and I actually was not a fan of this restaurant until last year when they changed owner or cook or something... Taste of dishes definitely changed. \n\nHand-made noodle is great~ Jjajangmyun (Korean Style chow-mein), Tangsooyook (Korean style sweet and sour pork), Sizzling rice soup, Yangjangpee, Shrimp Kkanpoongi are my favorite dishes... More people you go with, better here~ Their dishes are huge and staff are nice. If you ask for Kimchee~ you will get that as well!!", "rating": 4, "date": "2009-01-28"}, {"excerpts": ["But the sweet and sour pork was also pretty subpar. "], "author": "Jeff L.", "review": "I wanted to like this place. I wanted to have another decent food option near the Japantown garage where parking is so easy. Instead it was very meh. If it was only bad because they put mushrooms in almost everything we ordered without me expecting it I would have given it a higher rating. But the sweet and sour pork was also pretty subpar. Then at the end it took about 5 minutes to get the waiter's attention in order to get the check.\n\nThey are pretty nice and the portions are relatively large... but it didn't have much else going for it.", "rating": 2, "date": "2011-05-11"}, {"excerpts": ["(Korean type sweet and sour pork etc. ", "all well done, just like back home, so the full Korean tables. ", "Our go to place whenever we have a hankering for the Korean type of Chinese food that I was used to eating in Korea. ", "Bittersweet memories, but that's a story for when we eat together, until then, just know that the food here is authentic, delicious and reasonable and reminds me of Sunday Chinese lunch with the fam in Han Gook (the big K", ", Ko-rea. ", "Hee hee."], "author": "George F.", "review": "Really really good northeast Asia type Chinese food. As the majority of the patrons are usually Korean at any given time, you can immediately know that they also have really good Korean type of Chinese food. You can know these dishes by the Korean writing on the menu next to the Chinese and English. Famous traditional staples like: TzaTza myon (black bean noodles) champong (spicy seafood noodle soup,)  bolum bap (Korean type fried rice) yang nyom chicken (spicy hot sauce fried chicken) tang su yuk (Korean type sweet and sour pork etc. all well done, just like back home, so the full Korean tables. Our go to place whenever we have a hankering for the Korean type of Chinese food that I was used to eating in Korea. Bittersweet memories, but that's a story for when we eat together, until then, just know that the food here is authentic, delicious and reasonable and reminds me of Sunday Chinese lunch with the fam in Han Gook (the big K, Ko-rea. Hee hee.", "rating": 5, "date": "2014-10-04"}, {"excerpts": ["Later came Cashew Chicken then Sweet and Sour Pork.  ", "I don't know what kind, but the rice was very good too.  ", "This was enough food for 3 and maybe 4.  ", "Will enjoy the left overs at lunch.  ", "Recommended!!!  ", "PS, it was very busy on a Saturday night and the staff was very attentive and sat us right away."], "author": "Don J.", "review": "You won't be disappointed.  I've gone here about 5 times so far and every time it has been a hit.  Tonight we ordered the dinner for two and it was so good and only $30.  They give you tea and Kim Chee while you wait.  First came the Won Ton Soup which was very fresh and was not loaded with salt, even the broccoli was crisp.  Later came Cashew Chicken then Sweet and Sour Pork.  I don't know what kind, but the rice was very good too.  This was enough food for 3 and maybe 4.  Will enjoy the left overs at lunch.  Recommended!!!  PS, it was very busy on a Saturday night and the staff was very attentive and sat us right away.", "rating": 4, "date": "2010-08-21"}, {"excerpts": [", Noodles in Black Bean sauce, the Sweet and Sour Pork, Clams in Black Bean Sauce and the Sweet/Spicy Shrimp and ALL WERE TO DIE FOR. \n\n"], "author": "Brian H.", "review": "San Wang is so awesome - we had the Jam Bong (sp?), Noodles in Black Bean sauce, the Sweet and Sour Pork, Clams in Black Bean Sauce and the Sweet/Spicy Shrimp and ALL WERE TO DIE FOR. \n\nThe owner is such a nice guy too - had a nice chat with him about his family. All in all, great place and definitely coming back.\n\nMake sure to get the Sweet/Spicy Shrimp!", "rating": 5, "date": "2011-01-22"}], "pork with snow peas": [], "hunan pork": [], "sweet and sour ribs": [], "pork with chives": [], "sauteed bean threads": [], "sauteed meatballs": [{"excerpts": ["My fave (aka always order) dishes:\n\nHot & Sour Soup - hot, sour, loaded with meat, tofu, and veggies\nDry Fried Chicken - greasier, more spicy and more garlicky version of San Tung's Chicken\nSauteed Meatballs - Crispy fried on outside, tender on inside. "], "author": "Mike C.", "review": "This is a place I come with with my family to EAT with a capital E.\n\nThis is a bad place for a diet.\n\nThis is a bad place to avoid fried, dry fried, deep fried...etc.\n\nThis is a great place for loads of meat dishes cooked in the aforementioned methods accompanied by as much steamed rice as you can take.\n\nBeen coming here or to the one on Clement in the 20's (now closed) for close to twenty years. I remember not my first time. \n\nI won't bother discussing the decor, etc. It's a Chinese restaurant. It's not a fancy one. It's not pristine, but I've never gotten sick there.\n\nA side story if you will (since I just remembered it):\n\nI once saw a waiter get tripped up and drop a bowl of soup all over a woman's fur coat. The woman freaked out and the manager had to come out and assure her they would pay for the cleaning. My thoughts...uh, furs are not PC and what the heck were you thinking bringing an expensive garment here? Stupid. The air alone is not unlike a Korean restaurant. Upon return home, clothes should go directly to the laundry. \n\nAnyways, they could spill soup on me and I'd still come back.\n\nMy fave (aka always order) dishes:\n\nHot & Sour Soup - hot, sour, loaded with meat, tofu, and veggies\nDry Fried Chicken - greasier, more spicy and more garlicky version of San Tung's Chicken\nSauteed Meatballs - Crispy fried on outside, tender on inside. Served with gravy and veggies.\nSan Wang clams - spicy sauce...so good...esp on rice...memories of fighting my dad for the biggest clams and trying to eat more clams (bigger stack of shells on plate) than him...I usually did not win...\n\nSan Wang has a dry fried version of almost every ingredient they serve. I've probably tried all of them at one point or another.\n\nIt's a wierd concept to go to Japantown for Chinese food but hey, whatever works.", "rating": 4, "date": "2008-01-15"}], "steamed rice tea": [], "vegetables deluxe": [], "chicken peking sauce": [], "desserts": [], "sweet  sour whole fish": []}