{"breakfast burritos": [{"excerpts": ["menu: lobster bisque, sammies, po boys, breakfast burritos, fish & chip, fish tacos, raw clams/oysters.\n\n"], "author": "Victor G.", "review": "San Francisco Fish Companies offers fresh caught seafood and edible fish/seafood entress.\n\nmenu: lobster bisque, sammies, po boys, breakfast burritos, fish & chip, fish tacos, raw clams/oysters.\n\neats: raw clam/oyster 2@\n-cherrystone clam- chewy, small, not a lot of taste\n-blue point-fat, chubby, slightly cold \n--fatty boy? succulent, also slight refrigerated coldness\ngood value, choice of cocktail sauce, atomic horseradish, tabasco sauce....\n\ntake outs:\n-fish & chip 3 pieces of fish stick looking quality, didn't ask.\n-lobster bisque (6) passed also, chinese ladies seem to be enjoying it.", "rating": 4, "date": "2016-08-27"}, {"excerpts": ["They have a nice little menu here, ranging from sandwiches to breakfast burritos to some tasty entrees.  ", "All is ordered at a counter, and it's essentially to go.  ", "They've got some tables.  "], "author": "Adam S.", "review": "Having worked Downtown for a while, I used to spend a lot of lunch breaks at the Ferry Building.  If you've been there, you've seen the $2 oysters as you walked by.  Perhaps you've had one.  Have you been in?\n\nSo, yes, they're a market.  I can't speak to that.  I can speak to lunch.  They have a nice little menu here, ranging from sandwiches to breakfast burritos to some tasty entrees.  All is ordered at a counter, and it's essentially to go.  They've got some tables.  You can also pick up a beer, and they have a few nice bottle of good craft beers.\n\nI really like the Crab Quesadilla.  It's tasty, and reasonably filling - perfect for lunch.  Served with a side of guacamole.  Yum.  They've good some nice Po' Boys.  I really enjoy the place.  Prices are on the high(er) side, but it's the Ferry Building.  Service is not super-quick, but fine if you're not in a rush.  I'm intrigued to try the Crab Breakfast Burrito.  Just, so many good options, getting down on a Farmer's Market Saturday.", "rating": 4, "date": "2014-01-01"}, {"excerpts": ["So on Saturday morning, when looking for the perfect fuel for my hiking and yoga adventure departing from the Ferry Building, the sign for SFFC's breakfast burritos drew me in right away.  ", "A breakfast burrito made with fresh shrimp or crab?  "], "author": "Gabi M.", "review": "Fresh seafood is challenging to find living in Arizona.  As a result, one of the things I love about my frequent visits to San Francisco is going for sushi, fish, oysters and more... \n\nSo on Saturday morning, when looking for the perfect fuel for my hiking and yoga adventure departing from the Ferry Building, the sign for SFFC's breakfast burritos drew me in right away.  A breakfast burrito made with fresh shrimp or crab?  Yes, please!\n\nLuckily, Andrea R, my partner in crime for the day, was agreeable and willing to go for a breakfast burrito also.\n\nWe both ordered the Crab Burrito and had no regrets... even with the $14 price tag.  It was so worth it! Made fresh to order, this filling breakfast has it all: egg, cheese, guac, and of course, fresh crab... Served steaming hot within about 8 minutes of ordering, we were in burrito heaven as we sat and ate our burritos, pretty much in silence, so we could relish every bite.  Add a little hot sauce if you're so inclined and thank me later for the rec.  \n\nTo note: the burritos are large portions, but not crazy huge; sharing is definitely an option if you're not super hungry.  \n\nI will definitely be back to SFFC... hope to go for some oysters next visit!", "rating": 5, "date": "2014-08-06"}, {"excerpts": ["I was walking around the Ferry Building on a Sunday morning when I saw their sign for breakfast burritos. ", "The burritos come with 3 eggs, green onions, cheese, and guacamole with your choice of protein. ", "I chose the smoked salmon. ", "I was pretty much sold when I saw the word burrito & was excited to try this place when they listed out the fillings. "], "author": "Donna N.", "review": "I was walking around the Ferry Building on a Sunday morning when I saw their sign for breakfast burritos. The burritos come with 3 eggs, green onions, cheese, and guacamole with your choice of protein. I chose the smoked salmon. I was pretty much sold when I saw the word burrito & was excited to try this place when they listed out the fillings. What could go wrong?!\n\nI'll tell you! It was tiny! TINY! The burrito came out to $11 dollars and was served piping hot wrapped in foil. I couldn't believe it costed so much for such a tiny serving. \n\nAll of the ingredients were fresh and blended well together. Also the salmon had a strong smokey flavor if that is your thing. It was a really fresh seafood burrito but I wish you got a bigger bang for your buck.", "rating": 3, "date": "2013-10-29"}, {"excerpts": ["The breakfast burritos are hit and miss too.  ", "The sandwiches in my experience have all been fantastic along with the fresh seafood to enjoy at home."], "author": "Joco F.", "review": "I am in a quandary. A quandary I face from time to time when I come across a dish so good I don't want the potential of it becoming popular. Mind you these are simply my taste buds and palette talking so for anyone else it may be simply average.  I can comfortably say in my heart of hearts San Francisco Fish Company makes the best Fish in a Fish & Chips I've ever had in the Bay Area. On it's own the fish is perfectly made with just the right amount of seasoning in the breading to pair with the perfectly flaky cod. When showered with the proper amount of vinegar it takes on an entirely different personality. An amazing one at that. Sadly the Chips don't hang with the fish at all.  It would be cool if they would ramp up the latter end of the dish to really make the Fish and Chips experience that much better. \n\nThere are other positive to the Fish Co. like the rotating fresh oysters and clams served as you walk by.  I've shopped here before as well and have always been helped by a consistently friendly and informative staff.  As great as it is they do have some misses like Shrimp Creole and like I mentioned the fries. The breakfast burritos are hit and miss too.  The sandwiches in my experience have all been fantastic along with the fresh seafood to enjoy at home.", "rating": 4, "date": "2015-02-03"}, {"excerpts": ["I was given a recommendation to come here for their breakfast burritos. ", "I was so excited. "], "author": "Jeanne C.", "review": "I was given a recommendation to come here for their breakfast burritos. I was so excited. At $13-15 a burrito, it's definitely pricey, but my company was sponsoring so I didn't care.\n\nI pre-ordered the day before to have the burritos made first thing the next morning and I would pick it up at opening. The burritos came out pretty quickly though I had to wait 15-20 minutes for them.\n\nI brought them back to the office to eat. While eating and tasting my first bite, I just couldn't help not loving it. It had dungenness crab inside with cheese and egg and it just had no flavor. All the hot sauce in the world didn't make it better. They should have added more seasoning and salt to the burrito itself.\n\nIt was also extremely greasy. I needed so many napkins to catch the grease, and I'm not even sure why it was greasy??\n\nSurely disappointed and I will not try it again.", "rating": 3, "date": "2015-01-10"}, {"excerpts": ["I decided on SF Fish Company because they had breakfast burritos and other dishes that typically have meat but seafood instead!\n\n"], "author": "Anya R.", "review": "There is so much different stuff to try when you're in the Ferry Building so walking around I decided on SF Fish Company because they had breakfast burritos and other dishes that typically have meat but seafood instead!\n\nDuring lunch it gets really packed so when I ordered food I had to go sit right outside the Ferry Building as their are tables by the Sur La Table. \n\nI ordered the crab quesadills which game with guacamole and I finished every piece!  I'll totally try the breakfast burrito next time!", "rating": 4, "date": "2011-03-06"}, {"excerpts": ["I can't speak to the clams or the oysters, but the sandwiches and breakfast burritos are worth the trip. ", "The breakfast burritos don't look that big, but they are dense and filled with plenty of seafood. ", "They do the job at lunch. ", "The crab cake sandwiches are similarly filling and tasty. ", "On my last visit, the sandwich had not come out after ten minutes, so one of the employees gave me a complimentary bowl of chowder and explained that they had just run short of bread. ", "I appreciate touches like that. ", "I'll be back"], "author": "Taylor C.", "review": "One of the more solid lunch spots along the Embarcadero. I can't speak to the clams or the oysters, but the sandwiches and breakfast burritos are worth the trip. The breakfast burritos don't look that big, but they are dense and filled with plenty of seafood. They do the job at lunch. The crab cake sandwiches are similarly filling and tasty. On my last visit, the sandwich had not come out after ten minutes, so one of the employees gave me a complimentary bowl of chowder and explained that they had just run short of bread. I appreciate touches like that. I'll be back", "rating": 4, "date": "2012-10-08"}, {"excerpts": ["Their sign advertising breakfast burritos has always caught my attention on crowded Saturday mornings at the farmer's market.  ", "Finally broke down and spent $10 on the soft shell crab one.  ", "OH MAN, am I glad I did.  ", "It was delicious!  ", "The perfect amount of crab and cheese and egg all wrapped up in a really light tortilla.  ", "SO YUMMY!  ", "Washed it down with a quad americano from Blue Bottle.  ", "I have to be sure not to make this a habit!"], "author": "Melissa M.", "review": "Their sign advertising breakfast burritos has always caught my attention on crowded Saturday mornings at the farmer's market.  Finally broke down and spent $10 on the soft shell crab one.  OH MAN, am I glad I did.  It was delicious!  The perfect amount of crab and cheese and egg all wrapped up in a really light tortilla.  SO YUMMY!  Washed it down with a quad americano from Blue Bottle.  I have to be sure not to make this a habit!", "rating": 4, "date": "2007-10-29"}], "new england white or manhattan red clam chowder": [], "chilled gazpacho": [], "award winning seafood gumbo": [{"excerpts": ["Their award winning Seafood gumbo as their sign said was not even close to award winning. ", "Sorry don't know who the judges were but I've had much much better. ", "Next time I go back "], "author": "Ms. T.", "review": "$2 raw oysters. Yum!! Oyster po'boy was tasty . Great coleslaw! Their award winning Seafood gumbo as their sign said was not even close to award winning. Sorry don't know who the judges were but I've had much much better. Next time I go back I will try their lobster roll to see how it compares to my little other place in Half Moon Bay.\n\nOnly down side is minimal seating but that's the norm in all the eateries located here inside the ferry building.", "rating": 3, "date": "2013-02-17"}], "seared tuna burger": [{"excerpts": ["We ordered the seared tuna burger, crab cake sandwich, steamed shellfish, both clam chowders, and raw oysters (as it was a Tuesday). ", "It might have taken a hit on our wallet a bit, but overall it was definitely worth it. ", "The shellfish (clams, mussels, shrimp, etc) were all fresh and delicious, and the sauce was also unique. ", "I liked both clam chowders, although my dad preferred the New England one. ", "My dad loved the crab cake sandwich, and all of us enjoyed the raw oysters, although the sizes varied quite a bit...probably the only minor disappointment was the seared tuna burger, where it seemed somewhat tasteless.\n\n"], "author": "Calvin S.", "review": "Nothing I love more than seafood, especially Pacific seafood. For my first trip in the west coast since 1994 (when I was 3) I put seafood, seafood, and seafood as my top 3 priorities in my food adventures. After looking around the ferry building, I came across this place which looked very busy. The menu also seemed very interesting so we decided to eat here.\n\nWe ordered the seared tuna burger, crab cake sandwich, steamed shellfish, both clam chowders, and raw oysters (as it was a Tuesday). It might have taken a hit on our wallet a bit, but overall it was definitely worth it. The shellfish (clams, mussels, shrimp, etc) were all fresh and delicious, and the sauce was also unique. I liked both clam chowders, although my dad preferred the New England one. My dad loved the crab cake sandwich, and all of us enjoyed the raw oysters, although the sizes varied quite a bit...probably the only minor disappointment was the seared tuna burger, where it seemed somewhat tasteless.\n\nI'll definitely come back next time I'm in SF! I wish we had seafood this fresh over here.", "rating": 4, "date": "2014-07-03"}, {"excerpts": ["Seared tuna burger. ", "\"", "Seared\" is the operative word here but my tuna was not seared but overcooked. ", "And for an $11 price tag, you'd think the portions would be larger with something more than shredded iceberg lettuce strewn amidst the non-seared tuna. "], "author": "Rajiv S.", "review": "Seared tuna burger. \"Seared\" is the operative word here but my tuna was not seared but overcooked. And for an $11 price tag, you'd think the portions would be larger with something more than shredded iceberg lettuce strewn amidst the non-seared tuna. I was not happy to douse my poor tuna in Tabasco just to get some flavor in my meal. \n\nTwo stars since it's in the cool Ferry building and they were friendly.", "rating": 2, "date": "2011-06-02"}], "oyster po boy": [{"excerpts": ["We also ordered the oyster po boy sandwich and fish 'n chips. ", "Both delicious, and so fresh. ", "A bit pricey, though, at $14 each, considering the quantity."], "author": "Bernardette O.", "review": "The fresh oysters and clams here are always delicious. It'd be nice if they ask customers who take 10 minutes to order while there's a long line behind them to step aside.\n\nWe also ordered the oyster po boy sandwich and fish 'n chips. Both delicious, and so fresh. A bit pricey, though, at $14 each, considering the quantity.", "rating": 4, "date": "2018-09-03"}, {"excerpts": ["I ordered the Oyster Po Boy and it was mostly bread. ", "I could hardly taste the oysters so that was extremely disappointing considering the price point. ", "My favorite thing about the meal was the fries. ", "It was fried to golden perfection! "], "author": "Crystal D.", "review": "My best friend took me here because she absolutely swore by the food and said it was the best PO' boys she ever had. Sure, why not?! \n\nFor her birthday, we went here because I know she enjoyed it. I liked the food for the most part. We ordered the crab cake sandwich, but the patty was pretty dry to me. I ordered the Oyster Po Boy and it was mostly bread. I could hardly taste the oysters so that was extremely disappointing considering the price point. My favorite thing about the meal was the fries. It was fried to golden perfection! It was delicious.\n\nDon't think I'll be back anytime soon. If I'm in the area, I may give it another shot, but I won't go out of my way to have their food. It's San Francisco! I'm sure there are many other amazing locations that serve the same thing. Gotta step it up!", "rating": 3, "date": "2016-04-27"}, {"excerpts": ["Just enjoyed a delicious oyster po boy.  ", "I am pregnant so limited on oyster options. ", "But this is a great way to taste oysters.  ", "My hubby enjoyed the raw oysters and liked them.  ", "Po boy was one of the best I have ever had... ", "Almost wish I didn't share with the hubs... ", "Wish I had my own.  ", "The side of coleslaw was also yummy."], "author": "Lauren W.", "review": "Just enjoyed a delicious oyster po boy.  I am pregnant so limited on oyster options. But this is a great way to taste oysters.  My hubby enjoyed the raw oysters and liked them.  Po boy was one of the best I have ever had... Almost wish I didn't share with the hubs... Wish I had my own.  The side of coleslaw was also yummy.", "rating": 5, "date": "2015-08-16"}, {"excerpts": ["I ordered the oyster po boy. ", "BOY WAS IT POOR!  ", "A tiny dinner roll with a few not very well fried oysters for over $10.  ", "I don't plan on trying it again."], "author": "Lalo R.", "review": "I should have know better.  I ordered the oyster po boy. BOY WAS IT POOR!  A tiny dinner roll with a few not very well fried oysters for over $10.  I don't plan on trying it again.", "rating": 1, "date": "2010-02-04"}, {"excerpts": ["Total toss up between the oyster po boy and crabcake po boy.  ", "Went along with the oyster po boy ", "and I was not dissapointed.  ", "Fresh fried oysters nuzzled comfy cozy in a simply dressed roll.  ", "It was a bit more then I expected to pay, but it was a change from the usual common sandwich in the FiDi. ", "I would definitely go back, especially after gawking at their fresh seafood.  ", "I was plotting dinner ideas as I was scanning their inventory."], "author": "Stephanie D.", "review": "Stumbled upon this place during lunch while roaming the Ferry Bldg.  Glad I gave it a try.  It was hard to choose which sandwich I'd go for.  Total toss up between the oyster po boy and crabcake po boy.  Went along with the oyster po boy and I was not dissapointed.  Fresh fried oysters nuzzled comfy cozy in a simply dressed roll.  It was a bit more then I expected to pay, but it was a change from the usual common sandwich in the FiDi. I would definitely go back, especially after gawking at their fresh seafood.  I was plotting dinner ideas as I was scanning their inventory.", "rating": 4, "date": "2009-09-09"}], "deepfried catfish": [], "softshell crab po boy": [{"excerpts": ["and I tried the raw oysters & softshell crab po boy sandwich. ", "Enjoyed both highly."], "author": "SJ F.", "review": "Walk by sampling and I tried the raw oysters & softshell crab po boy sandwich. Enjoyed both highly.", "rating": 5, "date": "2015-12-27"}], "shrimp po boy": [{"excerpts": ["Crab Cake Sandwich, Shrimp Po Boy, Scallop Fish and Chips etc. \n", "We settled for the traditional fish and chips. ", "For the price of $15 you get 6 nice size pieces of moist and the tastiest fried fish and chips I've ever had. ", "Not knowing before hand what kind of fish we had eaten my son asked what kind of fish it was, our server said it was catfish. ", "If I new that before hand I would have never order it because I had catfish once before and hated it. ", "Thought it was gamely and very oily. ", "So this was shocking to me. ", "Even the chips (fries) were crisp, tasty and plentiful. \n", "I know there there are a lot of choices like I've said earlier ", "but San Francisco Fish Co. would be the place I would \" RUN\" to the next time I'm in town."], "author": "Alan L.", "review": "Being a tourist in San Fran there are many choices for you to see and eat down by the water front . My son and I were walking along the front and stumbled into the Ferry building and came across to the San Francisco Fish Co. The menu for me was like a sea food candy store . So many choices to choose from. Crab Cake Sandwich, Shrimp Po Boy, Scallop Fish and Chips etc. \nWe settled for the traditional fish and chips. For the price of $15 you get 6 nice size pieces of moist and the tastiest fried fish and chips I've ever had. Not knowing before hand what kind of fish we had eaten my son asked what kind of fish it was, our server said it was catfish. If I new that before hand I would have never order it because I had catfish once before and hated it. Thought it was gamely and very oily. So this was shocking to me. Even the chips (fries) were crisp, tasty and plentiful. \nI know there there are a lot of choices like I've said earlier but San Francisco Fish Co. would be the place I would \" RUN\" to the next time I'm in town.", "rating": 5, "date": "2018-07-08"}, {"excerpts": ["The other person in my party had the shrimp po boy ", "and I tasted that too. "], "author": "Chardonnai S.", "review": "Delicious fresh seafood is what comes to mind when I think of the San Francisco Fish Company. On Tuesdays they have a small raw oyster bar available in the front of the store. I enjoyed the couple of oysters I ate. They were fresh, mild and tender. \n\nThe fresh fish counter is well stocked with a variety of seafood.\n\nThere is a limited menu of cooked seafood options but what they do they do well. A few of the items includes blue crab, shrimp,oyster or dungeness crab cake po boy sandwiches. Today there was an option of clam chowder, but I didn't try it. The weather was too warm to eat soup. There are other options but I had the blue crab po boy. It was soooo good. I appreciate the fact that when I asked the guy that was ringing my order up what was his recommendation for something good, he was honest and explained why he recommended the blue crab sandwich. He was right. I loved it. The other person in my party had the shrimp po boy and I tasted that too. That was tasty as well.\n\nI must admit eating in San Francisco can be quite pricey. This place falls into that category. For what my party ordered it was kind of expensive.\n\nThere is not a lot of room to eat here but if you can't get a seat you can always go outside and eat as you look out at the beautiful bay.", "rating": 3, "date": "2014-04-29"}, {"excerpts": ["Ordered steamed mussles and shrimp po boy. \n", "Mussles were perfectly cooked, juicy and tasty. ", "Just added lemon and hot sauce for my preference. \n", "Shrimp po' boy had a nice crunch and a tasty sauce to accompany it. \n", "Would definitely recommend people to try their mussles(\",) ", "They do have fresh oysters and seating.\n", "Hopefully one of these days I'll buy something from their fish market as they do have a wide selection."], "author": "Anna P.", "review": "This review is based on the ready made food, not the fish market.\nOrdered steamed mussles and shrimp po boy. \nMussles were perfectly cooked, juicy and tasty. Just added lemon and hot sauce for my preference. \nShrimp po' boy had a nice crunch and a tasty sauce to accompany it. \nWould definitely recommend people to try their mussles(\",) They do have fresh oysters and seating.\nHopefully one of these days I'll buy something from their fish market as they do have a wide selection.", "rating": 4, "date": "2011-02-14"}], "fish n chips": [{"excerpts": ["The fish n chips here is one of the best. ", "It just melts in your mouth. "], "author": "Stephanie C.", "review": "I'm not sure why this place doesn't have a high rating. The fish n chips here is one of the best. It just melts in your mouth. Usually restaurants would use cod or haddock but the cashier told us they use some kind of a vietnamese fish.\n\nThe gumbo was also good, a bit on the spicy side. The fish katsu was nothing special but I like how hot and nice the rice was cooked.", "rating": 5, "date": "2018-02-01"}, {"excerpts": ["so I brought him to the SF Fish Company and satisfied his clam chowder bread bowl craving... along with garlicy saucy steamed mussels, crispy light fish n chips, juicy tasty oysters, and an ice cold beer. "], "author": "Monica H.", "review": "My boyfriend from SoCal came to NorCal craving a clam chowder bread bowl so I brought him to the SF Fish Company and satisfied his clam chowder bread bowl craving... along with garlicy saucy steamed mussels, crispy light fish n chips, juicy tasty oysters, and an ice cold beer. Now THAT is how you eat in SF.\n\nThis place is fantastic. A little bit expensive - our bill definitely added up - but totally worth it if you're looking for good fresh seafood.\n\nThere's very limited seating, but nice areas to sit outside of the ferry building, near the water. That's the best way to enjoy seafood anyways :)", "rating": 4, "date": "2017-04-22"}, {"excerpts": ["Get their Fish n chips, wait until they cool down a lil bit (", "unless you wanna risk burning your mouth) dunk the fish in tartar sauce and you'll see heaven. "], "author": "Sujeesha V.", "review": "One of our favorite places to grab lunch at the Ferry Building when we are pressed with time. \nEvery time we all go in different directions to grab something and end up converging at San Francisco Fish Company.\n\nThis is a small grab-n-go place which is always filled with the buzzing lunch-time crowd of the ferry building.\n\nIts reasonably priced, their sushi is consistently good. Get their Fish n chips, wait until they cool down a lil bit (unless you wanna risk burning your mouth) dunk the fish in tartar sauce and you'll see heaven. I haven't tried their oysters yet, but sure will on my next trip to SF.\n\nMust try!", "rating": 4, "date": "2017-03-20"}, {"excerpts": ["Kids had fish n chips, that was pretty good. ", "That would've been better than the sandwich I ordered. ", "Oh well, I will know for next time."], "author": "Mamma C.", "review": "I was excited to come here because the Marketplace is pretty popular, and I had never been there. How can you go wrong with a seafood place in S.F? Well, you can. I made the mistake of ordering a crab cake sandwich. The crab cake hardly had any flavor, and did not taste like it had crab in it. Highly disappointed. I let my husband have a bite, and he said it wasn't good. My husband used to eat canned spinach, so for him to say it's not good, believe it. The 3 stars is because the lobster roll HE ordered was delish! I wish I ordered that instead. Kids had fish n chips, that was pretty good. That would've been better than the sandwich I ordered. Oh well, I will know for next time.", "rating": 3, "date": "2016-12-26"}, {"excerpts": [") fish in your \"fish n chips", "\" you should be ashamed having the ocean in your back yard. ", "I also had the lobster and chowder, the scallops and chips and everything was mediocre at best. ", "I did enjoy the Clams and oysters being served on the half shell but that thank god ", "you guys had no hand in the preparation of them. ", "lucky for the tourist in the area or else you would not survive."], "author": "Victor G.", "review": "How are you serving Basa (The basa fish, Pangasius bocourti, is a species of catfish in the family Pangasiidae. Basa are native to the Mekong and Chao Phraya basins in Indochina.) fish in your \"fish n chips\" you should be ashamed having the ocean in your back yard. I also had the lobster and chowder, the scallops and chips and everything was mediocre at best. I did enjoy the Clams and oysters being served on the half shell but that thank god you guys had no hand in the preparation of them. lucky for the tourist in the area or else you would not survive.", "rating": 2, "date": "2015-03-07"}, {"excerpts": ["Back at my desk at work my fish n chips were really nothing to write home about. ", "The kitchen committed a french fry crime in that they were soggy and not crispy at all. ", "They needed 1 more minute in the fryer  to crisp them up to a golden brown, these were pale and soggy. ", "That really bothers me 'cause it's so hard to mess up fries, especially for this reason. ", "The batter on the fish was very greasy and the portion of fish small. ", "Deep frying isn't that hard "], "author": "Jordan N.", "review": "This is one of my favorite places to buy fish and seafood (the other being Sun Fat in the mission, but for different reasons). The food however is another story. This will be a hard review to write because the two aspects of SF Fish Co earn different stars in my book. First the fish: \n\nThe thing I love about the fish and seafood here besides it's obvious freshness is the great variety and availability of certain items in their natural state. Here you can buy sea scallops in their shell with their scrumdidlyuptious roe intact. Never seen that at any where else: not Monterrey fish in Berkeley, not whole foods, no retail store of note. You could brave Chinatown but that's so much WORK. You can get whole fish like Dorade, Mullet, Sardines, Salmon and Snapper here. Giant razor clams, live and moving slow mo in their shell make an appearance. There's fresh crab, lobster, king crab and sometimes spider crabs in the tank. This is where I come when I need high quality seafood when I'm cooking! Five Stars. \n\nThe food: recently I came in to the shop to pick up some seafood to prepare risotto with later that night. I was on my lunch from work so I decided get there to go. I ordered the fish and chips. I waited a long time (I'm not good at that!) even though the place had only me and two other customers. When my food arrived I thought the portions looked small. Back at my desk at work my fish n chips were really nothing to write home about. The kitchen committed a french fry crime in that they were soggy and not crispy at all. They needed 1 more minute in the fryer  to crisp them up to a golden brown, these were pale and soggy. That really bothers me 'cause it's so hard to mess up fries, especially for this reason. The batter on the fish was very greasy and the portion of fish small. Deep frying isn't that hard and I felt they didn't do it well. \n\nSo...I give the retail part of the place Five Stars and the Food Two Stars. I am going to split the difference and give San Francisco Fish Co 3 Stars but emphasize that it rises to Five if you don't eat here.\n\nUpdate 8/15/07: I accidently gave this 1 star, so now I've bumped it up to 3 like I meant to do.", "rating": 3, "date": "2007-07-14"}], "crab quesadilla": [{"excerpts": ["I got a crab quesadilla $14. ", "It's pretty bland. ", "The guac that came with the order made the difference in taste. ", "There was plenty of crab in the quesadilla, which I liked, but I would also prefer some sort of flavoring. ", "Even the cheese was kind of meh. ", "I also tried their fish and chips. ", "I have to say, the fish was really good. "], "author": "Benita M.", "review": "I want to say I'm a fan of how fresh the seafood is here. I got a crab quesadilla $14. It's pretty bland. The guac that came with the order made the difference in taste. There was plenty of crab in the quesadilla, which I liked, but I would also prefer some sort of flavoring. Even the cheese was kind of meh. I also tried their fish and chips. I have to say, the fish was really good. It was cooked to perfection and it was soft.\n\nStaff here is friendly. There are about 6-8 seats available by the store. I'm interested in coming back to try their sushi. Seems decently priced, $11 for a specialty roll.", "rating": 4, "date": "2017-02-19"}, {"excerpts": ["Anything with crab is sublime: breakfast burrito with crab, crab cake sandwich, crab quesadilla. ", "The only reason it's not 5 stars is because of the pricing. ", "Most sandwiches are around $15 for what is basically an appetizer portion. ", "But in exchange for the big price tag you get some of the best seafood sandwiches anywhere."], "author": "Carl W.", "review": "They serve sandwiches that make your mouth water. Anything with crab is sublime: breakfast burrito with crab, crab cake sandwich, crab quesadilla. The only reason it's not 5 stars is because of the pricing. Most sandwiches are around $15 for what is basically an appetizer portion. But in exchange for the big price tag you get some of the best seafood sandwiches anywhere.", "rating": 4, "date": "2018-02-13"}, {"excerpts": ["I really like the Crab Quesadilla.  ", "It's tasty, and reasonably filling - perfect for lunch.  ", "Served with a side of guacamole.  ", "Yum.  ", "They've good some nice Po' Boys.  ", "I really enjoy the place.  ", "Prices are on the high(er) side, but it's the Ferry Building.  ", "Service is not super-quick, but fine if you're not in a rush.  ", "I'm intrigued to try the Crab Breakfast Burrito.  ", "Just, so many good options, getting down on a Farmer's Market Saturday."], "author": "Adam S.", "review": "Having worked Downtown for a while, I used to spend a lot of lunch breaks at the Ferry Building.  If you've been there, you've seen the $2 oysters as you walked by.  Perhaps you've had one.  Have you been in?\n\nSo, yes, they're a market.  I can't speak to that.  I can speak to lunch.  They have a nice little menu here, ranging from sandwiches to breakfast burritos to some tasty entrees.  All is ordered at a counter, and it's essentially to go.  They've got some tables.  You can also pick up a beer, and they have a few nice bottle of good craft beers.\n\nI really like the Crab Quesadilla.  It's tasty, and reasonably filling - perfect for lunch.  Served with a side of guacamole.  Yum.  They've good some nice Po' Boys.  I really enjoy the place.  Prices are on the high(er) side, but it's the Ferry Building.  Service is not super-quick, but fine if you're not in a rush.  I'm intrigued to try the Crab Breakfast Burrito.  Just, so many good options, getting down on a Farmer's Market Saturday.", "rating": 4, "date": "2014-01-01"}, {"excerpts": ["(+) Crab Quesadilla.  ", "The crab is so fresh! ", "Yum. ", "This is also pretty pricey ", "but I def thing it's worth trying. ", "I love how the fresh the crab was and you can definitely taste it. "], "author": "Tram N.", "review": "(+) Soft Shell Crab Poboy! I did my research beforehand and since this is such a popular item, I had to try it out. Loved it. I thought it would be pretty heavy for lunch since it's fried but it's actually really light. I love soft shell crab so this was pretty much spot on. The only negative thing I would have to say is that THE SANDWICH IS TINY. From all of the pictures online, I thought it would be pretty decent size since it's pretty expensive ($10.95). Didn't expected it to be that small.... sigh. It is the Ferry Building after all...\n\n(+) Crab Quesadilla.  The crab is so fresh! Yum. This is also pretty pricey but I def thing it's worth trying. I love how the fresh the crab was and you can definitely taste it. it comes in 4 slices so perfect to share with a buddy for lunch. \n\n(+) Tuna Poke! Yum. I'm so skeptical about eat raw raw fish sometimes but this poke was fresh. For half a pound, we got a good portion in a to-go container that filled us up.\n\nI went around 12:30 (peak lunch hour) and the place as fairly empty (which is great). I love this place but it's definitely on the pricier side. I wish the portions were bigger since I'm paying so much for it but it's a place worth splurging at once in a while if you do your research and know what to get.", "rating": 4, "date": "2015-02-09"}, {"excerpts": ["I ordered the crab cake sandwich and my other companions ordered the crab quesadilla and the fried catfish. ", "My crab cake sandwich was good - but not super amazing. "], "author": "Nina Y.", "review": "Came here with some friends when we couldnt decide what to get in the Ferry Building. It really shouldn't be that hard right? Well I think we all wanted to try something we hadn't had before. Kind of disappointed. It wasn't bad, but we could have had a much better experience eating other foods. \n\nI ordered the crab cake sandwich and my other companions ordered the crab quesadilla and the fried catfish. My crab cake sandwich was good - but not super amazing. The coleslaw was probably the best part of the dishes. \n\nI'll have to try the po boys I guess to really get a full experience of the place.", "rating": 3, "date": "2014-11-26"}, {"excerpts": ["I also tried the Crab Quesadilla which was excellent. ", "I love Quesadillas and this one was by far superior in content. ", "Fresh crab meat with roasted peppers and carmelized onions with the right amount of cheese. ", "If you are ever in the marketplace give them a shot. ", "The customer service is great and the food is pretty good too."], "author": "K V.", "review": "I tried the New England Clam Chowder and it was ok. Nothing to brag about. I also tried the Crab Quesadilla which was excellent. I love Quesadillas and this one was by far superior in content. Fresh crab meat with roasted peppers and carmelized onions with the right amount of cheese. If you are ever in the marketplace give them a shot. The customer service is great and the food is pretty good too.", "rating": 4, "date": "2015-07-23"}, {"excerpts": ["We asked the woman taking orders about a few of their offerings and were assured that two of our picks: the crab quesadilla and the crab cake sandwich were her favorites and delicious! \n\n"], "author": "Maria G.", "review": "My friend and I decided to venture to the Ferry Building to get lunch today and after browsing all the little shops, we settled on the San Francisco Fish Company. We asked the woman taking orders about a few of their offerings and were assured that two of our picks: the crab quesadilla and the crab cake sandwich were her favorites and delicious! \n\nWhen I opened by crab cake sandwich though, I was horrified by the pool of oil that had formed at the bottom of the wrapping. The sandwich may or may not have tasted good, as I was so overwhelmed by the oil that it was all I could taste! My friend noted that while her quesadilla had plenty of crab meat, the oil and cheese were also overwhelming. \n\nThe side of fries that we ordered was quite sizeable, but it also lacked any flavor, though, thankfully, it was the least greasy item that we ate!\n\nOverpriced, overgreased and overhyped! I shall not be returning here.", "rating": 1, "date": "2011-03-19"}, {"excerpts": ["We stopped by for lunch because of my hearty affection for seafood, and the crab quesadilla lived right up to my dreams. ", "I wanted to order half the menu and can't wait to go back for some of their poke, or--once I figure out what a po'boy is--the softshell crab po'boy. ", "The seafood was clearly fresh and full of flavor. ", "The \"servers\" (people working behind the counters?) were cheerful. ", "The prices are superbly low. ", "If you're looking for cheap and delicious seafood, avoid the dreadful stands past Fisherman's Wharf, which serve up too-fried or mayo-drenched chunks of flavorless fish. ", "SFFC is the way to go."], "author": "Koyel B.", "review": "Okay, if you've passed by the SF Fish Co in the Ferry Building without having eaten there, I'm sure you're confused at the five stars. It looks distinctly unappealing, with oysters laid out over ice in front of the entrance, and beady-eyed fish glaring at you from the depths. We stopped by for lunch because of my hearty affection for seafood, and the crab quesadilla lived right up to my dreams. I wanted to order half the menu and can't wait to go back for some of their poke, or--once I figure out what a po'boy is--the softshell crab po'boy. The seafood was clearly fresh and full of flavor. The \"servers\" (people working behind the counters?) were cheerful. The prices are superbly low. If you're looking for cheap and delicious seafood, avoid the dreadful stands past Fisherman's Wharf, which serve up too-fried or mayo-drenched chunks of flavorless fish. SFFC is the way to go.", "rating": 5, "date": "2011-06-02"}, {"excerpts": ["I most recently tried the crab quesadilla\n and it was one of the best ways I've ever had crab.\n", "I also go here to pick up fresh fish for when I'm feeling sassy and want to do it myself. ", "The quality is always fresh and the folks behind the counter are so helpful and pleasant. ", "I've yet to have a bad experience there and would highly recommend them for your lunch break, or your own culinary adventures."], "author": "Jessica R.", "review": "SF Fish Co always treats me right. I go in here at least once a week for lunch. I've sampled all sorts of things. The swordfish sandwich, so good. Crab cakes, great. The salads are simple and convenient. Lobster chowder? Yes please. I most recently tried the crab quesadilla\n and it was one of the best ways I've ever had crab.\nI also go here to pick up fresh fish for when I'm feeling sassy and want to do it myself. The quality is always fresh and the folks behind the counter are so helpful and pleasant. I've yet to have a bad experience there and would highly recommend them for your lunch break, or your own culinary adventures.", "rating": 5, "date": "2008-04-16"}, {"excerpts": ["Maybe I got the wrong thing but the crab quesadilla was really good but not super duper (which I am reserving my 5 stars for).  ", "By far the best aspect of the joint is that there are prime people watching seats that face outwards.  ", "Side note - ", "the guy that works there will give you an extra cup of chowder if you order it in the bread bowl, and proceed to call it juice because the bread soaks it up faster than you can consume it.  ", "Fish juice!  ", "Love it. ", "LOL."], "author": "Yve T.", "review": "For being super hungry, I thought this place was going to be out of this world, but it fell a tad short.  Maybe I got the wrong thing but the crab quesadilla was really good but not super duper (which I am reserving my 5 stars for).  By far the best aspect of the joint is that there are prime people watching seats that face outwards.  Side note - the guy that works there will give you an extra cup of chowder if you order it in the bread bowl, and proceed to call it juice because the bread soaks it up faster than you can consume it.  Fish juice!  Love it. LOL.", "rating": 4, "date": "2008-04-22"}], "side of fries": [{"excerpts": ["I totally didn't mind sharing my fries, but felt that for the $11, his sandwich should have included a side of fries, or perhaps a small portion of coleslaw or something.  \n\n"], "author": "Cat C.", "review": "I've always walked by San Francisco Fish Company while inside the Ferry Building, but never really noticed them except for the huge shucked oysters they have out.  Last week my cousin and I met for lunch at the Ferry Building and he suggested this place.  So glad he did, because so many of their menu items sounded so good: scallop and chips, crab cake sandwich, prawn quesadilla, etc.  I ended up getting the scallops and chips, because it was so unusual.  Now, I do love scallops, when they're cooked right, but this is why I don't order them out so much, because half the time they end up coming out rubbery.    \n\nWe met up at 11:30, and the Ferry Building was already bustling, most likely due to the Farmer's Market.  There was only one seat available after we placed our order, however, luckily, when we got our food about 5 minutes later, a group of 4 was leaving.  I got 7 decent size breaded scallops with a heaping amount of fries served with the tartar sauce and cocktail sauce ketchup, and both were golden brown (love it).  The scallops were very hot as I bit into them some oil oozed out.  They were very fresh and cooked just right; I loved the breading as well.  I thought the scallops were going to be bigger, but glad they gave me 7 as I was expecting less.  Fries had some crunch to them, though more potatoey.   His soft shell crab sandwich looked great as well.  I totally didn't mind sharing my fries, but felt that for the $11, his sandwich should have included a side of fries, or perhaps a small portion of coleslaw or something.  \n\nI didn't have a reason to eat seafood at the Ferry Building because I don't do oysters (Hog Island Oyster Co.) and am slowly getting into fishes, but now that I know about San Francisco Fish Company's menu, I will definitely be back to try out that crab cake sandwich..or perhaps more scallops and chips!  If they offer those breaded scallops a la carte that would be amazing!  Come visit their storefront to get some fresh delicious seafood.", "rating": 4, "date": "2014-06-03"}, {"excerpts": ["Ordered a side of fries with it, an extra $5, came out overly salted. "], "author": "Krystle L.", "review": "I went here last weekend to try the soft shell crab po'boy and I was really impressed. Everything from the flavor of the crab & bread, the texture & even the portion was better than I expected. Reading other reviews about the portion led me to expect a baby-sized sandwich, but it came out a well enough size with a generous amount of crab. Currently priced at $12.95 for just the sandwich, I wasn't too surprised just because you're in a tourist area - everything's gonna be a little pricey. Ordered a side of fries with it, an extra $5, came out overly salted. I would recommend to order it with no salt & salt it yourself. \n\nThis company also sells fresh seafood to take home & other lunch items like fish & chips, different versions of po'boys & oysters that they prepare for you to eat with all the condiments. It all looked so yummy. \n\nI specifically went here just for the crab po'boy sandwich & did not leave disappointed. Do yourself a favor if you're visiting the Ferry Building, try their Soft Shell Crab Po'boy. Also, grab a table as soon as you can, people are scavenger's for seating!", "rating": 4, "date": "2015-04-11"}, {"excerpts": ["The side of fries that we ordered was quite sizeable, but it also lacked any flavor, though, thankfully, it was the least greasy item that we ate!\n\n"], "author": "Maria G.", "review": "My friend and I decided to venture to the Ferry Building to get lunch today and after browsing all the little shops, we settled on the San Francisco Fish Company. We asked the woman taking orders about a few of their offerings and were assured that two of our picks: the crab quesadilla and the crab cake sandwich were her favorites and delicious! \n\nWhen I opened by crab cake sandwich though, I was horrified by the pool of oil that had formed at the bottom of the wrapping. The sandwich may or may not have tasted good, as I was so overwhelmed by the oil that it was all I could taste! My friend noted that while her quesadilla had plenty of crab meat, the oil and cheese were also overwhelming. \n\nThe side of fries that we ordered was quite sizeable, but it also lacked any flavor, though, thankfully, it was the least greasy item that we ate!\n\nOverpriced, overgreased and overhyped! I shall not be returning here.", "rating": 1, "date": "2011-03-19"}], "seafood jambalaya": [{"excerpts": ["So, we did we ordered Seafood Jambalaya,Seafood Gumbo ", "and I personally had clam chowder.  ", "I would have to say that these items I would not come back for.  ", "They were not anything special.  "], "author": "Kathy C.", "review": "I have been in search for a place that has above average Fish & Chips and I decided to check this place out.  Along with me I decided to drag along my co-workers/friends.  We ended up ordering 1 order Fish & Chips and 1 order Scallops and Chips.  The Fish & Chips are definitely a hit here.  The scallops were ok, and I would probably go back just to try it one more time to be sure I didn't come on a super busy time and that's why it was mediocre.  I want to give it a second shot.  However, my friend decided since the first two things we ordered were successful they wanted to go back and try other items.  So, we did we ordered Seafood Jambalaya,Seafood Gumbo and I personally had clam chowder.  I would have to say that these items I would not come back for.  They were not anything special.  Just to be fair, they have a good variety of fresh fish to purchase and take home to cook yourself.  \n\nNext time, I will try their oyster and po-boy sammy.\n\nHope this helps.", "rating": 3, "date": "2014-10-14"}, {"excerpts": ["The seafood jambalaya was without a doubt the strangest jambalaya I've ever had. ", "It was very, very dry and underseasoned. ", "And there wasn't anything resembling tomato in the dish. ", "I think seafood fried rice would have been more descriptive. ", "I should have picked up one of the containers of sushi sitting in front of the register. ", "They looked far more appealing."], "author": "Paul K.", "review": "I think next time I should probably ask for a sample. Either I don't know what Jambalaya is supposed to taste like or they don't know how to make it. The seafood jambalaya was without a doubt the strangest jambalaya I've ever had. It was very, very dry and underseasoned. And there wasn't anything resembling tomato in the dish. I think seafood fried rice would have been more descriptive. I should have picked up one of the containers of sushi sitting in front of the register. They looked far more appealing.", "rating": 2, "date": "2015-03-10"}], "shrimp creole": [{"excerpts": ["As great as it is they do have some misses like Shrimp Creole and like I mentioned the fries. "], "author": "Joco F.", "review": "I am in a quandary. A quandary I face from time to time when I come across a dish so good I don't want the potential of it becoming popular. Mind you these are simply my taste buds and palette talking so for anyone else it may be simply average.  I can comfortably say in my heart of hearts San Francisco Fish Company makes the best Fish in a Fish & Chips I've ever had in the Bay Area. On it's own the fish is perfectly made with just the right amount of seasoning in the breading to pair with the perfectly flaky cod. When showered with the proper amount of vinegar it takes on an entirely different personality. An amazing one at that. Sadly the Chips don't hang with the fish at all.  It would be cool if they would ramp up the latter end of the dish to really make the Fish and Chips experience that much better. \n\nThere are other positive to the Fish Co. like the rotating fresh oysters and clams served as you walk by.  I've shopped here before as well and have always been helped by a consistently friendly and informative staff.  As great as it is they do have some misses like Shrimp Creole and like I mentioned the fries. The breakfast burritos are hit and miss too.  The sandwiches in my experience have all been fantastic along with the fresh seafood to enjoy at home.", "rating": 4, "date": "2015-02-03"}], "red beans and rice with fried basa": [], "crawfish etouffee": [], "blackened catfish po boy": [], "soft shell crab po boy": [{"excerpts": ["I had the soft shell crab po boy ($10.95) and she had the quart of clam chowder ($16). ", "She said she wanted to save some for later. ", "The place was out of bread so she only received oyster crackers. ", "The pic of the Bay Bridge was the best part of the meal. ", "The soft shell crab was more like a 1/2 a crab and it did not have much flavor. ", "The bread was nothing like New Orleans or SF for that matter. ", "The clam chowder was so-so also. "], "author": "Joe P.", "review": "I wanted to go to Market Bar - beautiful day, off hours, small plates but the beezie (lol) I was with said it was too expensive. I have never been to Market Bar and I have been wanting to try it forever. I guess I am too nice. I should have reminded her I was buying and she should stop tripping.\n\nI had the soft shell crab po boy ($10.95) and she had the quart of clam chowder ($16). She said she wanted to save some for later. The place was out of bread so she only received oyster crackers. The pic of the Bay Bridge was the best part of the meal. The soft shell crab was more like a 1/2 a crab and it did not have much flavor. The bread was nothing like New Orleans or SF for that matter. The clam chowder was so-so also. The only saving grace for the place was the fresh oysters @ $2 each and the people were pretty nice.\n\nI don't know why I hang around my wing gal who lives up here. She rarely goes to SF and when she does she is so indecisive. I guess it is because we have been frends forever. Any Yelpers want to meet me in SF the next time I am in the area? - LOL", "rating": 2, "date": "2012-04-14"}, {"excerpts": ["I was rather sadly disappointed with my soft shell crab po boy sandwich from the San Francisco Fish company.  \n\n"], "author": "Sooj O.", "review": "I was rather sadly disappointed with my soft shell crab po boy sandwich from the San Francisco Fish company.  \n\nFirst off, I will note that it's reasonably priced for soft shell crab sandwich at about $9.30 with tax. \n\nHowever, they smear some kind of McDonald's sorta thousand island pinky dressing on the sandwich that does not go with the soft shell crab whatsoever.  Moreover, the bread they use for the sandwich is too thick...so each bite is more bread than what one might desire for a soft shell crab sandwich.  Soft shell crabs are rather delicate tasting things...it's very easy to overwhelm the taste, and that's what they have done at the San Francisco Fish Company.  They should consider using a regular sandwich bread, fry the crab so it's crispier, and use a traditional tartar sauce.  \n\nI am doubly sad as I was so looking forward to this sandwich...soft shell crabs are not easy to come by on the West Coast since they are native to the New England area.  I guess that's what I get for being rather shellfish selfish in my disregard of the environment and eating gas guzzling food that's been shipped across the continent.\n\nOn an equally disappointing note, their tuna nicoise looks nothing like a tuna nicoise.  Everything looks glopped in some sauce.  And their other items are overpriced.", "rating": 2, "date": "2007-07-22"}, {"excerpts": ["I had the soft shell crab po boy.  ", "It was super yummy--a bit oceany, but that's no complaint when eating fresh seafood. "], "author": "Sarah L.", "review": "I just came here for the first time today after my boyfriend had told me about the awesome fish sandwiches he'd been grubbing on the past few weeks.  I had the soft shell crab po boy.  It was super yummy--a bit oceany, but that's no complaint when eating fresh seafood. I did feel weird about eating an entire animal (carry over from my vegetarian days?), so I stopped a few bites short of finishing.\n\nI ordered the fries, too, which were super yummy, skins on, with parsley sprinkled on top.  Malt vinegar tossed in made them unbearably good.\n\nMy dining partners got the Sante Fe crab cake sandwich and the halibut sandwich.  No complaints from anyone.  A ten dollar lunch, but well worth it for a Friday splurge after a week of brown bagging it.", "rating": 4, "date": "2006-05-26"}], "ahi nori wrap": [], "fried fish katsu": [], "coconut shrimp": [{"excerpts": ["- coconut shrimp - It was good, but nothing too special. ", "I thought it was overfried and was a bit hard to eat. ", "They pair it with fries "], "author": "Keizzel C.", "review": "Location: Conveniently located in the ferry building it's very easy to find. It's a small shop so you definitely need to get there early to beat the lunch rush since it can get pretty long. If you're not willing to get a hot dish they have plenty of things that are premade in the fridge or things you can buy for later. \n\nWhat to get: \n- Soft shell crab po' boy - big fan of this one! Freshly fried crab on good bread is definitely a combo you can't beat. Well worth a try if you haven't done so yet. \n\n- coconut shrimp - It was good, but nothing too special. I thought it was overfried and was a bit hard to eat. They pair it with fries so overall it's a filling meal during the lunch rush. \n\nOverall, if you're in the mood for decently priced seafood in SF, this is a good option.", "rating": 4, "date": "2016-11-27"}, {"excerpts": ["I tried their Coconut Shrimp Friday Special for $11.95.  ", "Most places buy these already breaded and frozen, and just fry them up.  ", "Normally, pre-made frozen coconut shrimp are pretty good, as the quality is maintained by the freezing process.\n\n"], "author": "Roy C.", "review": "I have been wanting to try this place for awhile.  Today, Friday, was the big day.\n\nI guess my first clue should have been how few people were there just before lunch on a Friday while many other restaurants were more crowded.\n\nI tried their Coconut Shrimp Friday Special for $11.95.  Most places buy these already breaded and frozen, and just fry them up.  To me, these looked and tasted pre-made as well.\n\nNormally, pre-made frozen coconut shrimp are pretty good, as the quality is maintained by the freezing process.\n\nUnfortunately, 2 of my shrimp had a slight iodine smell indicating that they had been thawed too long.  On top of that, all my shrimp were overfried, and basically dried out.  Hence the 2 star review.\n\nIn the future, the restaurant should monitor how long the shrimp stored, and fry them less time.\n\nOn the fresh fish side, I was shocked to see that they carry Escolar which is banned in Japan.  While it as a nice flavor, many people's systems can't tolerate it due to the wax ester.\n\nhttps://en.wikipedia.org/wiki/Escolar\nhttp://blog.medellitin.com/2008/12/escolar-world-most-dangerous-fish.html", "rating": 2, "date": "2016-12-02"}, {"excerpts": ["The Coconut shrimp was over cooked, but the Oysters were so good! ", "Crab cake sandwich is also super good and this is a place I always go when I'm in SF."], "author": "Tim C.", "review": "Their Prawns and Chips is the best shrimp I've ever had. Unfortunately it's only a special so it's hit or miss if they have it. The Coconut shrimp was over cooked, but the Oysters were so good! Crab cake sandwich is also super good and this is a place I always go when I'm in SF.", "rating": 4, "date": "2015-08-07"}], "ahi poke tacos": []}