{"lomo saltado wrap": [{"excerpts": ["The Lomo Saltado wrap is my favorite! ", "It's main ingredient is diced NY Strip steak which is always perfectly cooked, tender, and lean (I can't do fatty steaks, nerve endings, sinews, etc.). ", "Other ingredients include grilled tomatoes, onions, and french fries. ", "The Lomo Saltado wrap is easier to handle than the sandwich, which is also awesome but it can get messy. ", "The wrap is something you can take back to your desk and enjoy with little to no mess."], "author": "Jr G.", "review": "The Lomo Saltado wrap is my favorite! It's main ingredient is diced NY Strip steak which is always perfectly cooked, tender, and lean (I can't do fatty steaks, nerve endings, sinews, etc.). Other ingredients include grilled tomatoes, onions, and french fries. Pure bliss!\n\nI go for the combo deal which includes Sweet Potato fries and a drink for a few bucks over the $10 mark (I get the Inka Cola! Imagine a light bubble yum-flavored soft drink).\n\nI haven't tried the other sandwiches because I'm a creature of habit. The Lomo Saltado was the first sandwich I tried here, and I haven't been able to pry myself away and get something else.\n\nTIP:\nThe Lomo Saltado wrap is easier to handle than the sandwich, which is also awesome but it can get messy. The wrap is something you can take back to your desk and enjoy with little to no mess.", "rating": 5, "date": "2016-02-23"}], "barbacoa sandwich": [{"excerpts": ["I had the opportunity to try out Sanguchon Peruvian Food Truck last Friday and was quite happy with their barbacoa sandwich though it was quite pricey at ~$11. ", "I wasn't sure what to expect especially since one of the listed ingredients within the sandwich is potato chips. ", "I was surprised to find that the potato chips really paired with the other items in the sandwich very well! ", "The meat is very juicy and tender ", "and I loved the barbecue sauce that it is mixed in. ", "Overall, I found the sandwich to be very delicious and fulfilling though I do think it is a bit expensive for what it is."], "author": "Joshua M.", "review": "I had the opportunity to try out Sanguchon Peruvian Food Truck last Friday and was quite happy with their barbacoa sandwich though it was quite pricey at ~$11. I wasn't sure what to expect especially since one of the listed ingredients within the sandwich is potato chips. I was surprised to find that the potato chips really paired with the other items in the sandwich very well! The meat is very juicy and tender and I loved the barbecue sauce that it is mixed in. Overall, I found the sandwich to be very delicious and fulfilling though I do think it is a bit expensive for what it is.", "rating": 4, "date": "2017-05-22"}, {"excerpts": ["I tried the Barbacoa sandwich which consisted of BBQ pulled pork, coleslaw, and potato chips on a ciabatta bread.  ", "Not sure about the potato chips in the sandwich.  "], "author": "Erica S.", "review": "This food truck came to my work today and the fact that it was Peruvian food got me excited, but overall, it was just okay.  I got to the truck towards the end of the shift that they pretty much had the sandwiches already made and ready-to-go.  I tried the Barbacoa sandwich which consisted of BBQ pulled pork, coleslaw, and potato chips on a ciabatta bread.  Not sure about the potato chips in the sandwich.  I ended up taking it out.  \n\nThe sandwich was still warm, but not hot.  It came with a side of sweet potato fries, but because it was sitting there, it was pretty soggy especially with the sauce on it.  The sandwich was really messy that it required a lot of napkins and although it had generous portions of pork, the sauce just tasted like American BBQ sauce so I was a little disappointed.  Hope to try some of their other menu items next time.", "rating": 3, "date": "2014-03-05"}, {"excerpts": ["I got the barbacoa sandwich and it was delicious.  ", "Definitely will visit again in the near future."], "author": "Josh B.", "review": "No complaints here.  A couple of weeks after I first tried it, and it has to be in my top 3 or 5 food trucks out here.  I got the barbacoa sandwich and it was delicious.  Definitely will visit again in the near future.", "rating": 5, "date": "2016-12-14"}, {"excerpts": ["My friend had the barbacoa sandwich, which was humongous and sort of like your typical pulled-pork, BBQ sandwich.  "], "author": "Samantha L.", "review": "At my last visit to OTG, I wanted to try out something new, so I headed on over to Sanguchon.  I never really have Peruvian food, so I thought it was worth a shot.\n\nThey serve up a variety of sandwiches and wraps ($7-$8).  I tried the \"aji de gallina,\" or chicken wrap.  The wrap (just like a burrito, made in a La Palma tortilla), was pretty decent sized, and contained chicken, some cheese, white beans, rice, and a yellow-ish sauce.  It somewhat reminded me of Thai yellow curry.  The whole thing was a bit carb-y tasting.  The white beans were pretty interesting, at first I thought that they were potatoes.  The flavor was a bit mild and the burrito wasn't as hot as I would have hoped it to be, but it was decent.\n\nMy friend had the barbacoa sandwich, which was humongous and sort of like your typical pulled-pork, BBQ sandwich.  She seemed to enjoy it quite a bit. \n\nOverall, I thought that the food was good, but I don't know if I'd order the same thing again.  I am one to try out different things, so I'm not sure when I\"ll have it again.  If I do come back, I'll make sure to order the alfajores cookies that everyone seems to be raving about.", "rating": 3, "date": "2012-10-17"}, {"excerpts": ["The barbacoa sandwich was absolutely terrific. ", "Sanguchon heaps on piles of juicy tender barbacoa with coleslaw and, most interestingly, a layer potato chips. "], "author": "Kevin S.", "review": "I'd never had Peruvian food before but Sanguchon enlightened me to the wonderful world of Peruvian sandwiches.\nThe barbacoa sandwich was absolutely terrific. Sanguchon heaps on piles of juicy tender barbacoa with coleslaw and, most interestingly, a layer potato chips. The chips added a nice crunch to the sandwich that I thought complemented the slaw very well. \n\nThe house made bread is also very good, sort of spongy and is much richer than it looks. I thought the sandwich looked a little small but it truned out to be very filling. \n\nI want to try the Pan con Chicharron next time Moveable Feast comes around.", "rating": 5, "date": "2012-06-02"}, {"excerpts": ["Tried the Barbacoa sandwich and it was tasty.  ", "The meat was moist and the slaw was good.  ", "It had potato chips inside for an added crunch.  ", "Teh bun was a good size.  ", "Not sure this would be my first choice if multiple trucks are around, but it's definitely a good eat."], "author": "Josh L.", "review": "Tried the Barbacoa sandwich and it was tasty.  The meat was moist and the slaw was good.  It had potato chips inside for an added crunch.  Teh bun was a good size.  Not sure this would be my first choice if multiple trucks are around, but it's definitely a good eat.", "rating": 3, "date": "2011-10-19"}, {"excerpts": ["Finally... a food truck that lives up to the hype!!  \nLomo saltado sandwich, Criollo sandwich, Aji de gallina wrap, Barbacoa sandwich, Yuca fries... ", "all very yummy!  \n", "Prices were good by food truck standards... ", "I'm so over paying more than restaurant lunch prices at food trucks, for smaller portions."], "author": "Vandana N.", "review": "Finally... a food truck that lives up to the hype!!  \nLomo saltado sandwich, Criollo sandwich, Aji de gallina wrap, Barbacoa sandwich, Yuca fries... all very yummy!  \nPrices were good by food truck standards... I'm so over paying more than restaurant lunch prices at food trucks, for smaller portions.", "rating": 5, "date": "2012-02-03"}, {"excerpts": ["The barbacoa sandwich is bomb and the service is fast and friendly."], "author": "Bryan P.", "review": "I rarely write yelp reviews, but I can't resist for these guys. The sandwiches are great, really hit the spot. The barbacoa sandwich is bomb and the service is fast and friendly.", "rating": 5, "date": "2015-03-19"}, {"excerpts": ["The Barbacoa Sandwich had a generous portion on meat, though it was way too sweet. ", "They could have dialed back the BBQ sauce and it would have been better. ", "The alfajores come in packs of two and are supposedly home made - nothing special here. ", "They had empanadas as the special appetizer that day. ", "They came out mushy and limp - total disappointment. ", "Stick to El Porteno for your empanadas. ", "Lastly, the chicha morada drink tasted like they had added artificial sweetener; totally gross. ", "2.5 stars rounded up to 3."], "author": "Andrew C.", "review": "We got this at Off the Grid McCoppin Hub. The Barbacoa Sandwich had a generous portion on meat, though it was way too sweet. They could have dialed back the BBQ sauce and it would have been better. The alfajores come in packs of two and are supposedly home made - nothing special here. They had empanadas as the special appetizer that day. They came out mushy and limp - total disappointment. Stick to El Porteno for your empanadas. Lastly, the chicha morada drink tasted like they had added artificial sweetener; totally gross. 2.5 stars rounded up to 3.", "rating": 3, "date": "2012-12-10"}, {"excerpts": ["The Barbacoa sandwich was good, but a little small for $8.  ", "My main complaint was the service.  ", "There was a 20 minute line for this truck today at Civic Center.  ", "I was OK with waiting b/c ", "the menu looked great and it was a new addition to this OTG location.  ", "But the person taking orders was very slow, and when I finally reached the window, she let me order and then informed me they were out of EVERYTHING except the Barbacoa sandwich and beef empanadas, despite the fact that it was only 1pm.  ", "If I had known, I would not have waited for 20 minutes.  ", "I asked if she could put up a \"sold out\" sign in the future.  "], "author": "V W.", "review": "The Barbacoa sandwich was good, but a little small for $8.  My main complaint was the service.  There was a 20 minute line for this truck today at Civic Center.  I was OK with waiting b/c the menu looked great and it was a new addition to this OTG location.  But the person taking orders was very slow, and when I finally reached the window, she let me order and then informed me they were out of EVERYTHING except the Barbacoa sandwich and beef empanadas, despite the fact that it was only 1pm.  If I had known, I would not have waited for 20 minutes.  I asked if she could put up a \"sold out\" sign in the future.  She then started informing other people in the long, long line behind me that they were out of almost everything on the menu, and most of the customers left.\n\nShort story--the food is good, but when you finally get a chance to order, you might find that they are sold out and didn't bother to tell anyone.", "rating": 2, "date": "2011-09-23"}]}