{"gommae": [], "chicken karaage": [], "sunomono": [], "agedashi tofu": [{"excerpts": ["The agedashi tofu was the only thing redeeming about the 60.00 bill for two people.  ", "The sign should have been the lack of people there ", "but I like to give people an chance, ", "so, I still ordered food against my better judgment.  ", "Needless, to say, it is not anywhere I will be coming back for... ", "Ever."], "author": "Erika S.", "review": "The worst over priced sushi I've ever had. It tasted like it was thawed and not fresh at all.  The agedashi tofu was the only thing redeeming about the 60.00 bill for two people.  The sign should have been the lack of people there but I like to give people an chance, so, I still ordered food against my better judgment.  Needless, to say, it is not anywhere I will be coming back for... Ever.", "rating": 1, "date": "2013-03-03"}], "sashimi pcs": [], "bento special": [{"excerpts": ["I thought the prices were a bit high for the quantity and quality of the food they served; most dishes they served for dinner was at or above 10 dollars, even the bento special (two dishes with miso soup, salad, and rice) at $9.95. ", "I ordered the bento special, pork Gyoza and the grilled salmon roll, and the first thought that came to mind when my order came was how small the portions were. ", "There were maybe 5 rolls of the grilled salmon that just seemed like mashed up fish from a can and only four bitesize pieces of Gyoza, which me and my boyfriend finished in less than a minute. "], "author": "Kristi L.", "review": "I was a little wary to try this place after seeing the reviews on yelp, but after a day of shopping, we were hungry and tired. It was located right across the street from the Japantown mall, so we settled to test it out against the odds and hope for the best. \n\nAnd it was false hope. Best word to describe the food was....meh. It didn't really impress, but it didn't stand out in a bad way either. I thought the prices were a bit high for the quantity and quality of the food they served; most dishes they served for dinner was at or above 10 dollars, even the bento special (two dishes with miso soup, salad, and rice) at $9.95. I ordered the bento special, pork Gyoza and the grilled salmon roll, and the first thought that came to mind when my order came was how small the portions were. There were maybe 5 rolls of the grilled salmon that just seemed like mashed up fish from a can and only four bitesize pieces of Gyoza, which me and my boyfriend finished in less than a minute. By the end of the meal, I was still hungry and resorted to drinking the free water to fill me up. \n\nI would have to say that the service was pretty good though; the servers were prompt with anything we told them to do, and since I came with group of 13, they split checks for each of us. We left the place mildly satisfied, but next time I'm in Japantown, I'll make sure to hit up Yelp and be wiser about making restaurant choices!", "rating": 3, "date": "2012-07-08"}, {"excerpts": ["Ordered a lunch bento special. "], "author": "Alan W.", "review": "Ordered a lunch bento special. Got some choices that go with the standards and chose beef teriyaki and a salmon maki roll.\n\nThe beef was tough and not very tasty anyway. The salmon roll was better, but the salad and rice were just blah. Didn't help that the miso soup was very salty too and came out way earlier than the rest of our food... I'm sure there's much better options in Japantown.", "rating": 2, "date": "2011-02-06"}], "combo bento": [{"excerpts": ["Food\n\nOrdered the 3 Item Combo Bento Box with Grilled Salmon Roll, Teriyaki Saba, and the Teriyaki Salmon. "], "author": "Nicholas B.", "review": "Food was cool.. Service wasn't\n\nCame in at around 3pm for a late lunch. \n\nFood\n\nOrdered the 3 Item Combo Bento Box with Grilled Salmon Roll, Teriyaki Saba, and the Teriyaki Salmon. It came with a Miso Soup and Side Salad for $13.50\n\n   Miso Soup\nThis dish arrived hot and the broth tasted yummy.  The downside was our server never came by to give me a spoon. \n\n Beer\n\nSmall Sapporro 3.50. \n Standard issue bottled Sapporro. Seemed to pair well with my bento box. \n\nAtmosphere and Service\n\nUnfortunately the moment my guest and I sat down we immediately noticed how sticky the table was. For me whenever I encounter a table like this it's very off putting and somewhat detracts from my appetite \n\nOur server wasn't very friendly or customer service oriented. She only came back to check on us when our meal was finished and halfway through my meal I had to remind her that she had yet to bring me the beer I ordered earlier. \n\nOverall I had a medicore time here. I recommend looking elsewhere for your next dining experience.", "rating": 3, "date": "2017-10-19"}], "sashimi roll": [], "beef ginger yaki": [], "prime shoyu steak": [], "prime ribeye teriyaki": [], "saba sioyaki": [{"excerpts": ["We ordered the rainbow roll and the K-pop roll, saba sioyaki and soba with chicken; complimentary tea, miso shiru, and salad were served before. ", "Unfortunately, we were disappointed with most everything we got. ", "The tea, soup, and salad were not bad, but they weren't good, either. ", "The crab salad in the rainbow ", "maki was okay, but none of the fish in either roll seemed very fresh or flavorful; the soba was lackluster as well. "], "author": "Kelly P.", "review": "Our server was helpful enough and the food came out fast. We ordered the rainbow roll and the K-pop roll, saba sioyaki and soba with chicken; complimentary tea, miso shiru, and salad were served before. Unfortunately, we were disappointed with most everything we got. The tea, soup, and salad were not bad, but they weren't good, either. The crab salad in the rainbow maki was okay, but none of the fish in either roll seemed very fresh or flavorful; the soba was lackluster as well. The one reasonably tasty item was the saba; it was grilled nicely, with a crisp skin but not overdone.\n\nWe were hungry and ate what we were served, but regretted spending money ($50 plus tip) on a meal that I enjoyed about as much as I would have a Subway sandwich; it was that mediocre. Maybe some of their other menu items are good, but we won't be going back to find out. Two stars for the saba and the service, Sanppo.", "rating": 2, "date": "2015-12-21"}], "salmon sioyaki": [], "oyster teriyaki": [], "seafood tempura": [{"excerpts": ["I ordered the seafood tempura lover dish, a dragon roll, and a 49er roll. ", "The tempura had fake crab meat form into what appeared to be a shrimp and the vegetables tasted old. ", "The fish in the 49er roll looked gross....pale pink...but was edible. ", "One bite of the Dragon roll ", "and I nearly threw up. ", "The smell....ewwwww....smelled like a wet dirty dog. ", "And finally the check... ", "a self added 18%! ", "What a freaking rip off. ", "I hardly finished the disgusting food that I was given and in addition to a horrible meal....go ahead and add 18% without ever disclosing that beforehand. ", "Do not come here!"], "author": "Jacqueline A.", "review": "This place was the worst Japanese restuarant that I have been to. I ordered the seafood tempura lover dish, a dragon roll, and a 49er roll. The tempura had fake crab meat form into what appeared to be a shrimp and the vegetables tasted old. The fish in the 49er roll looked gross....pale pink...but was edible. One bite of the Dragon roll and I nearly threw up. The smell....ewwwww....smelled like a wet dirty dog. And finally the check... a self added 18%! What a freaking rip off. I hardly finished the disgusting food that I was given and in addition to a horrible meal....go ahead and add 18% without ever disclosing that beforehand. Do not come here!", "rating": 1, "date": "2016-10-19"}], "age tofu tempura": [], "tamago don": [], "teriyaki don": [], "sukiyaki don": [{"excerpts": ["I got the sukiyaki don which I don't recommend. ", "It lacks flavor. ", "The Giants roll (I think that's what it's called) is pretty good. ", "It had spicy tuna and crab on top. ", "This was crunchy and delicious! ", "The service was okay and quick. ", "The restaurant wasn't too full. ", "The other dishes looked good ", "but I was a little disappointed w my beef and tofu dish. ", "I don't know if the sauce was omitted ", "but it tasted like boiled meat with cooked veggies and a splash of soy sauce. ", "The meat was a bit off. ", "I did have some teriyaki chicken and that was good. ", "I would probably get chicken next time!"], "author": "Natalie M.", "review": "My dish was okay at this place! I got the sukiyaki don which I don't recommend. It lacks flavor. The Giants roll (I think that's what it's called) is pretty good. It had spicy tuna and crab on top. This was crunchy and delicious! The service was okay and quick. The restaurant wasn't too full. The other dishes looked good but I was a little disappointed w my beef and tofu dish. I don't know if the sauce was omitted but it tasted like boiled meat with cooked veggies and a splash of soy sauce. The meat was a bit off. I did have some teriyaki chicken and that was good. I would probably get chicken next time!", "rating": 3, "date": "2018-08-19"}], "veggie sukiyaki don": [], "unajyu": [], "gomoku ramen": [], "roast pork ramen": [], "yakisoba": [{"excerpts": ["Would recommend the Dragon Roll, Yakisoba, and Beef Curry.\n", "Salad dressing's pretty good.\n", "REALLY surprised this restaurant's rated lower than 4 stars. \n", "And 3 stars for stupid reasons? ", "Come on."], "author": "Isaac N.", "review": "Service was amazing and food was great.\nWould recommend the Dragon Roll, Yakisoba, and Beef Curry.\nSalad dressing's pretty good.\nREALLY surprised this restaurant's rated lower than 4 stars. \nAnd 3 stars for stupid reasons? Come on.", "rating": 5, "date": "2012-05-17"}, {"excerpts": ["we ordered the yakisoba, pan fried noodles. ", "the presentation looked like it was just thrown on a plate, i could do it myself. ", "the whole plate looked and tasted like something i could do in my own kitchen. ", "it was priced as 9.50$ ", "i think? "], "author": "Mark M.", "review": "decided to go get sushi in japan town with a friend. saw this restaurant on post street and thought it would be good so we checked it out. there were quite a few restaurants around and hoped that this would be good. we checked yelp before we went in and it had 3 stars compared to this other japanese restaurant next to it that had 2 1/2 stars, so we ended up going in.\n\nthe sushi was not bad, it was decent. i think that would be the only reason why i have a one star on this or else i wouldn't even give this restaurant any stars.\n\nterrible service, they probably checked on us once and that was it, and whats sad is that it is not even a big restaurant.. the front side of the restaurant was closed and the back part only had like maybe 5 or 6 tables. \n\nwe ordered the yakisoba, pan fried noodles. the presentation looked like it was just thrown on a plate, i could do it myself. the whole plate looked and tasted like something i could do in my own kitchen. it was priced as 9.50$ i think? and we got charged an extra dollar, we didn't complain, since we're not going back anymore.\n\nbento box was small, but i assumed i was going to be like that knowing the price wasn't expensive. only thing that sucked is that the gyoza tasted so bad, it would probably be the worst gyoza i have ever had, i might even like the ones they serve in food courts. the beef teriyaki was black since they burned it, also terrible.\n\noverall, never going back.", "rating": 1, "date": "2010-12-26"}], "veggie yakisoba": [], "tempura zaru soba": [], "zaru chuka": [{"excerpts": ["The dressing on my hiyashi chuka (they call it zaru chuka :", "\\) was tasteless. ", "The dish has two kinds of that fake fish cake, no pork, and no bamboo shoots! ", ":*"], "author": "Jacquee P.", "review": "There's salt and pepper on the table! What kind of Japanese restaurant puts salt and pepper shakers on the table? \n\nI should have known better. But I was SO hungry! \n\nThe dressing on my hiyashi chuka (they call it zaru chuka :\\) was tasteless. The dish has two kinds of that fake fish cake, no pork, and no bamboo shoots! :*( Canned bamboo shoots are so cheap and easy. \n\nAnyhoo, mediocre food and the waitress' friend came in for a visit and they had a shoe sharing/trying-on session right next to our table. (Kinda gross and I tried not to pay attention.) We got to check out her friend's GUESS shoes that are too small for her but fit our waitress perfectly! Uh...", "rating": 1, "date": "2010-07-24"}], "ca maki roll": [], "ca maki with tobiko": [], "shitake roll": [], "veggie tempura roll": [], "tekka maki": [{"excerpts": ["My brother ordered futomaki, but tekka maki arrived.  ", "As I was about to wave down the waitress about the mistake the couple we shared the table with asked if it was theirs... ", "It was.  ", "I passed to them assuring them that we had not touched it.  ", "My bento lunch was tonkatasu and saba shioyaki.  ", "Miso soup, iceberg salad, pickled bean sprouts and seaweed salad rounded out the meal. "], "author": "Christine L.", "review": "Disappointed...It has been at least five years since I had a meal here.  I think owners changed.  I was only aware when the language the owner spoke was not Japanese.\n\nMy brother ordered futomaki, but tekka maki arrived.  As I was about to wave down the waitress about the mistake the couple we shared the table with asked if it was theirs... It was.  I passed to them assuring them that we had not touched it.  My bento lunch was tonkatasu and saba shioyaki.  Miso soup, iceberg salad, pickled bean sprouts and seaweed salad rounded out the meal. Very small portions but only $6.95.  \n\nThe pictures of the bentos are misleading.  I suspect the cut in portions was to reduce prices.\n\nI won't be returning.", "rating": 1, "date": "2013-07-31"}], "hamachi negi maki": [], "yellow tail roll": [], "crazy roll": [], "coit tower": [{"excerpts": ["Delicious gyoza, fast service, awesome deep fried sushi (coit tower roll). ", "Hit the spot. ", "If I wasn't a tourist ", "id be here every week. ", "And affordable!!!"], "author": "Neal L.", "review": "Delicious gyoza, fast service, awesome deep fried sushi (coit tower roll). Hit the spot. If I wasn't a tourist id be here every week. And affordable!!!", "rating": 5, "date": "2015-10-25"}], "ichiban": [{"excerpts": ["We also ordered an Ichiban roll which was good.\n\n"], "author": "Luisa T.", "review": "We were skeptical that this restaurant on the main road (Post St.) would be any good.  It looked like a tourist trap from the outside with the sign board on the sidewalk advertising some of the types of food on offer.  It was great that they posted their full menu in a showcase so we knew exactly what they served.  We just wanted bento box lunch combination meals, and if that were so then one of the items we look for is the saba shioyaki.  Thus, Sanppo Restaurant fulfilled our wishes.\n\nNow looking through the entrance door we spotted a few tables that were full.  So we decided to take a chance and try a different Japantown restaurant.  We were given menus when seated, however, it was not until we ordered our food that we were asked what we would like to drink.  Tea and water need to be requested; they are not given upon being seated.  Note:  We were never offered refills.  I assume one needs to request them...\n\nThe food was fairly priced, and there were three types of bento box lunches to choose from.  I was disappointed in the tempura as they only give one prawn; every other Japanese restaurant offers two prawns.  The rest of the tempura was just eggplant (tiny piece), carrot, and yam.  The teriyaki beef that came with it was all right albeit on the rare side.  My dining partner had the saba, salmon, and sashimi combination which were all reportedly very good.  We also ordered an Ichiban roll which was good.\n\nService was efficient, and our server was polite.  However, as mentioned already she did not freely give any refills of water and tea. One probably needs to request it.\n\nAnother point to note is that they have clean enough toilets and even better no sharing with another restaurant.  This was welcome after having to deal with the situation when dining at Kushi Tsuru.", "rating": 4, "date": "2015-09-21"}], "jtown": [{"excerpts": ["My favorite sushi spot in Jtown.\n", "It is very clean inside and service is always good.\n"], "author": "C P.", "review": "My favorite sushi spot in Jtown.\nIt is very clean inside and service is always good.\nI love their special rolls but my fave would have to be the Korean Chirashi aka Hwe Dup Bab.\nThey are also probably one of the few sushi restaurants in the area that stay open late.", "rating": 5, "date": "2018-01-31"}, {"excerpts": ["..in jtown, not surprising. ", "Was def not the biz but walked past Sannppo sushi and had a sign out (very helpful) that had lunch specials for bento boxes for only $7!! ", "It was decent priced for someone as broke as me.. walked in was greeted and had great service.  ", "Bathroom was decently clean with no odor", "..rate it a B-. ", "They also had the radio on i couldnt figure out what channel ", "but it was either 9.49, 99.7, or 106.1...", "I walked into the jtown mall and passed by other restaurants serving the same \"special\" for $8+. ", "PLEASE, it was DEF no \"Special\"."], "author": "Em C.", "review": "I ate here by myself...which i never thought i'd do, but when youre on break for work and is in the area..hey why not.  You get to be on your phone updating yourself on all social networking sites, text, and talk on the phone without being so rude. (well thats if you dont talk to loud)\n\nWas craving some chinese food but the one chinese restaurant i found was OVER-P-R-I-C-E-D..in jtown, not surprising. Was def not the biz but walked past Sannppo sushi and had a sign out (very helpful) that had lunch specials for bento boxes for only $7!! It was decent priced for someone as broke as me.. walked in was greeted and had great service.  Bathroom was decently clean with no odor..rate it a B-. They also had the radio on i couldnt figure out what channel but it was either 9.49, 99.7, or 106.1...so i was singing and giggn in a secret manner where no one could notice me. \n\nThe food was worth the $7 precious dollars. Got the beef, cali rolls, and something salmon sushi roll-like. usual taste, the salad was a bit on the watery side but still good..but they were a bit stingy on the beef too, but its no biggie.  \n\nOverall, i'd probably come back here again because it was decently priced with good service. I walked into the jtown mall and passed by other restaurants serving the same \"special\" for $8+. PLEASE, it was DEF no \"Special\".", "rating": 4, "date": "2010-12-14"}, {"excerpts": ["Sometimes nothing else is open around jtown and when you need fuel right now in that area, it's the best choice because it's open, fast, friendly, and rarely too crowded."], "author": "Miguel L.", "review": "The food is good, that's what you need to know. The sushi and nigiri items are fresh every time I go there. It's not extravagant but good stuff when you are hungry and want a relatively fast served meal with a good price and the best part is it's open way late. Sometimes nothing else is open around jtown and when you need fuel right now in that area, it's the best choice because it's open, fast, friendly, and rarely too crowded.", "rating": 3, "date": "2011-12-09"}], "kpop": [], "kamikaze": [], "red dragon": [], "sakura": [{"excerpts": ["My favourites are Sakura, Rainbow, and 49ers rolls. ", "I have no complain quality-wise. ", "I would like to pay a little less but what can you do! ", "If the wasabi was more spicy, it'd be all perfect. ", "All-in-all, although not the best sushi ", "I had but good enough for me to be a regular."], "author": "Milad A.", "review": "I get sushi from here weekly. My favourites are Sakura, Rainbow, and 49ers rolls. I have no complain quality-wise. I would like to pay a little less but what can you do! If the wasabi was more spicy, it'd be all perfect. All-in-all, although not the best sushi I had but good enough for me to be a regular.", "rating": 4, "date": "2015-12-30"}, {"excerpts": ["The tempera was fresh and delicious and the fish on the Sakura roll was tasty and fresh as well. ", "Would definitely come back."], "author": "Ashley C.", "review": "This place is great ! Can't complain. Good rolls, prices are as expected for SF. Prompt service and good sushi. The tempera was fresh and delicious and the fish on the Sakura roll was tasty and fresh as well. Would definitely come back.", "rating": 5, "date": "2015-09-28"}, {"excerpts": ["I went to this place on Sakura festival day. ", "I ordered California something salad. ", "I'm sorry ", "I forget the name. ", "But, as the name tellls, this salad was like \" California\" cause it used a lot of Avocado. ", "Also, there is no lettece ", "instead I can say this is Tofu salad. ", "That was Yummy! ", "It is totally different from common salad in US. ", "It was typical Salad in Japanese Bar restaurant!! ", "Yummy:-) ", "Moreover, Sushi my friends ordered was also tasting nice and looking nice!!"], "author": "Kozy T.", "review": "I went to this place on Sakura festival day. I ordered California something salad. I'm sorry I forget the name. But, as the name tellls, this salad was like \" California\" cause it used a lot of Avocado. Also, there is no lettece instead I can say this is Tofu salad. That was Yummy! It is totally different from common salad in US. It was typical Salad in Japanese Bar restaurant!! Yummy:-) Moreover, Sushi my friends ordered was also tasting nice and looking nice!!", "rating": 4, "date": "2009-04-23"}], "ninja": [], "swamp": [{"excerpts": ["The food was very good, especially my swamp roll (spicy tuna with seaweed salad and tobiko), and our friend is now a fan. ", "But the five stars are really for the service: we were with my teen autistic son who was having a hard day. ", "The staff was consistently courteous and friendly to him. ", "When a baby at a table started crying, which is very hard for my son to tolerate and which makes him upset because he feels others' emotions very strongly, and we had to leave quickly, the staff was efficient and kind and non-judgmental in helping us get out the door ", "*", "fast*. ", "It is not always easy for us to eat in restaurants, especially if we have a crisis, so I appreciate the staff supporting or family."], "author": "Shannon R.", "review": "We chose this place for an out of town teen friend who had never had sushi before. The food was very good, especially my swamp roll (spicy tuna with seaweed salad and tobiko), and our friend is now a fan. But the five stars are really for the service: we were with my teen autistic son who was having a hard day. The staff was consistently courteous and friendly to him. When a baby at a table started crying, which is very hard for my son to tolerate and which makes him upset because he feels others' emotions very strongly, and we had to leave quickly, the staff was efficient and kind and non-judgmental in helping us get out the door *fast*. It is not always easy for us to eat in restaurants, especially if we have a crisis, so I appreciate the staff supporting or family.", "rating": 5, "date": "2017-07-04"}, {"excerpts": ["We also ordered the swamp roll with was also delicious! ", "Nice service staff as well."], "author": "Rommy K.", "review": "Hard to choose from all these restaurants in Japan  town. Decided on this one (without checking on yelp) and really liked it. We had a seafood and veggie nabe (soup) was very very very good! We also ordered the swamp roll with was also delicious! Nice service staff as well.", "rating": 5, "date": "2015-07-20"}], "er": [], "island": [{"excerpts": ["I had the island roll & it had lovely bits of thinly lemon sliced without skin (thank god) ", "over the top of the salmon along with prawns, crab meat, cucumber, avocado, & tobiko ", "(if I'm not mistaken). ", "I had the appetizer tempura which had 2 large prawns & a good variety of colourful veg which was very welcomed. ", "It was fresh & the sauce was flavoursome. ", "My food was served with a nice hot miso soup to start & the service was very polite & welcoming. ", "I'd definitely come back hungry."], "author": "Julian I.", "review": "Was pleasantly surprised by the delicious sushi & super fresh piping hot tempura. I enjoyed this restaurant very much. I had the island roll & it had lovely bits of thinly lemon sliced without skin (thank god) over the top of the salmon along with prawns, crab meat, cucumber, avocado, & tobiko (if I'm not mistaken). I had the appetizer tempura which had 2 large prawns & a good variety of colourful veg which was very welcomed. It was fresh & the sauce was flavoursome. My food was served with a nice hot miso soup to start & the service was very polite & welcoming. I'd definitely come back hungry.", "rating": 4, "date": "2018-05-27"}, {"excerpts": ["My Island Roll was great, but they never brought it until I asked again. ", "Some sort of mistake. "], "author": "Alexandra W.", "review": "Very yummy miso soup. I thought the pork gyoza were okay but my boyfriend loved them. My Island Roll was great, but they never brought it until I asked again. Some sort of mistake. They brought 2 more miso soups and a seaweed salad to make up for it, which was nice.\n\nThey sat us in a semi-secluded part of the restaurant, so service was infrequent. Overall, the food was good and I would return.", "rating": 4, "date": "2015-06-08"}], "red and white": [{"excerpts": ["Red and White Roll:\nShiro and regular Maguro on top a spicy tuna roll", ", \nThis should have been a dynamic  flavor explosion, instead I wound up picking the very small pieces of Maguro off the top and leaving the spicy tuna roll to be tossed.away.. ", "....\n", "this is one of the worst sushi experiences I have ever had , next to some bad Uni that I almost regurgitated 15 years ago. \n", "Oh ", "Yeah, when the roll arrived, the pieces were haphazardly arranged in random, not linear, order, scattered half falling down  on the plate. ", "I do not recall ever seeing sushi plated like this. ", "This to me indicates a total attitude of apathy. ", "I wish I had a camera to take a picture. "], "author": "laurie g.", "review": "Ironic as it may seem, I am always hesitant to eat Sushi in Japantown, \nToday I went there  because it was the closest, and I was starving. Bad Idea, again. \nI looked  to find the Sushi spot with the most people in it, since I didnt have Yelp reviews to help me, (No smart phone)- Sanppo , was the most populated on a rainy grey Friday afternoon,\nso by the measure of peeps, I entered.....\nService is very good, two helpful Japanese (or Korean) waitresses.\nNo sushi Bar, Sushi prepared in a back kitchen area out of sight.....  bad feeling already, Uh, Oh......\n\nOrder:\n1) Rainbow Roll : Fish is very unfresh, old, small cuts, tasteless. \nrice falling apart- lackluster appearance\n\n2) Red and White Roll:\nShiro and regular Maguro on top a spicy tuna roll, \nThis should have been a dynamic  flavor explosion, instead I wound up picking the very small pieces of Maguro off the top and leaving the spicy tuna roll to be tossed.away.. ....\nthis is one of the worst sushi experiences I have ever had , next to some bad Uni that I almost regurgitated 15 years ago. \nOh Yeah, when the roll arrived, the pieces were haphazardly arranged in random, not linear, order, scattered half falling down  on the plate. I do not recall ever seeing sushi plated like this. This to me indicates a total attitude of apathy. I wish I had a camera to take a picture. unbelievable\n\n3) Shiro Maguro and Hirame Nigiri\nVery small cuts, The Shiro was completely bland and flavorless, not worth even eating, The \"Hirame\" had a  indescribable flavor and was very tough.\nI do not actually think it was Hirame, it did not taste or look anything like it.\n\n4) California Temaki- was weird shape, smallest amount of  crab, (and I mean, miniscule),  I have ever seen , mostly RICE, Uh, Oh....\nBad sign when rolls just don't look like they are supposed to, or have the minimum standard amounts of ingredients that they are supposed to have.\nnori is fresh, however...\n\nI do not have bad Sushi experiences very often, maybe once every 2 years.\nBut this last time has taught me to buy one or two small items first, before plunking down $50.00 at unknown quality restaurants and nightmare level food...\nI do not recommend this restaurant for Sushi.\nI agree with past reviews about Sanppo being a Denny's or Mcdonalds level Sushi\nplace.", "rating": 1, "date": "2011-11-18"}, {"excerpts": ["The Red and White roll is a tuna lover's dream as well.  ", "True sushi aficionados will probably look down their noses at Sanppo, but I like it."], "author": "Chris I.", "review": "Several months ago, my girlfriend and I embarked on a campaign to not repeat at any restaurant.  Why?  With so many great restaurants in the city, we would never be able to visit them all if we fell into a rut at any one restaurant.  We first went to Sanppo months ago as part of that campaign.  I loved it.  Really loved it.  Ever since that first visit, whenever we decided to go for sushi, I would simply say...\"Sanppo?\"  \n\nOn Sunday night, we got back from a four day trip to Austin, TX and decided that after all that BBQ, sushi was in order.  I responded with my one word request, \"Sanppo?\".  My girlfriend relented.  I thanked her.\n\nThey have an abundance of special rolls.  Probably more special rolls than normal nigiri or maki rolls.  The Lion King is superlative.  It is smothered in a warm sauce that really makes it.  The Red and White roll is a tuna lover's dream as well.  True sushi aficionados will probably look down their noses at Sanppo, but I like it.", "rating": 4, "date": "2008-01-16"}], "gogo roll": [], "mixed maki": [], "hamchi sashimi": [], "hamchi don": [], "korean chirashi": [{"excerpts": ["I love their special rolls but my fave would have to be the Korean Chirashi aka Hwe Dup Bab.\n", "They are also probably one of the few sushi restaurants in the area that stay open late."], "author": "C P.", "review": "My favorite sushi spot in Jtown.\nIt is very clean inside and service is always good.\nI love their special rolls but my fave would have to be the Korean Chirashi aka Hwe Dup Bab.\nThey are also probably one of the few sushi restaurants in the area that stay open late.", "rating": 5, "date": "2018-01-31"}], "deluxe sashimi": [], "deluxe sushi": [], "green salad small": [], "green salad large": [], "tsukemono": [{"excerpts": ["Choice of three items served alongside miso soup, salad, rice, tsukemono.  ", "My husband ordered California roll sushi, teriyaki beef, & tonkatsu.  ", "With the exception of the tonkatsu, he really enjoyed his meal.  \n \n", "I ordered tempura udon.  ", "$7  ", "The noodles, wakame, & broth were soothing.  ", "The tempura .......", "just okay.  ", "Not as light & feathery as I like.   ", "Bit too oily also.  "], "author": "Lynette T.", "review": "My husband was jonesing for good ol' Japanese rice.\nThis guy's gotta have his rice no matter what.  \nSo off to Japan Center we went.\n\nWe were looking for something close to downhome typical Japanese food.  Something like Taihei, Usui, or Naomi's back here at home.\n\nHe thought the restaurants in the Japan Center were \"too cutesy\", so we asked around & someone recommended going across Post St. to check out the eateries there.  Sanppo looked like it would fit the bill.  \n\nLunch bentos ran around $7.  Choice of three items served alongside miso soup, salad, rice, tsukemono.  My husband ordered California roll sushi, teriyaki beef, & tonkatsu.  With the exception of the tonkatsu, he really enjoyed his meal.  \n \nI ordered tempura udon.  $7  The noodles, wakame, & broth were soothing.  The tempura .......just okay.  Not as light & feathery as I like.   Bit too oily also.  I ended up eating just a few of the veggie pieces & giving the rest to my husband.  \n\nYou would think that the described food would have been enough to satisfy my hubby's appetite, but nooooo.  He ended up buying eight more pieces of roll sushi to munch on while we further explored the city.\n\nService was good, inside decor was nice.  It was good enough to satisfy hubby's rice addiction until we got back home.", "rating": 3, "date": "2009-04-07"}], "miso soup with tofu": [], "miso soup with seaweed and tofu": [], "miso soup with clam": [], "steamed rice  white side": [], "steamed rice  brown side": [], "cater roll platter": [], "cater roll  sushi combo platter": []}