{"americana pizza": [{"excerpts": ["I like to get a large Americana pizza with extra pepperoni and a side of ranch. ", "Why am I not losing weight? ", "Damn you Serrano's!"], "author": "Krismet C.", "review": "After sweating it out in a fake striptease aerobics class and lifting weights I get real hungry. I like to get a large Americana pizza with extra pepperoni and a side of ranch. Why am I not losing weight? Damn you Serrano's!", "rating": 5, "date": "2007-07-24"}], "art and tom terrific pizza": [], "clam bake pizza": [], "valencias special pizza": [], "zoey special pizza": [], "mission special pizza": [], "fresh choice pizza": [], "dolores pizza": [{"excerpts": ["I bragged about how delicious Serrano's was to my boyfrirend and ordered us the Dolores Pizza. \n\n"], "author": "Leelee K.", "review": "This review isn't about the timing.. because it wasn't that bad.. within the hour. \n\nHowever, the food was pretty disappointing. Friends of mine have passionately talked about their pizza. I actually did try them once before when I was forced to by the homies to order some and yes, yummy! Unfortunately, the pizza we got tonight doesn't look like the Serrano's I tried a few months back. I bragged about how delicious Serrano's was to my boyfrirend and ordered us the Dolores Pizza. \n\nSadness.. Where do I begin? The crust  was doughy and thick, cheese was rubbery, the zucchini was undercooked, garlic undercooked and the spinach looked like prepackaged chopped frozen spinach that was carelessly laid over in chunks. I think the most unattractive part was the chicken.. which looked very processed. You know chicken is processed when it's texture is in comparison of McDonald's chicken nuggets.The good old spongey blended and molded chicken. Yum! The pizza had no golden tint or color --everything was pretty raw.\n\n Very disappointed, Serrano. Way to take cool points off in being a girlfriend who knows her pizza... Grrr.", "rating": 1, "date": "2013-06-23"}, {"excerpts": ["Some of the sauces are tangy especially the hawaiian and dolores pizza. "], "author": "Glu C.", "review": "Serrano's has become a Friday night tradition (well not really every 58 Fridays in a year because then I'd have to rely on a forklift as my own public transportation.) Yeah I'm having it tonight...the art and tom terrific, but I wanted the Greek! The Greek pizza is the best tasting, pesto, canadian bacon, caramelized onions(yumm), and feta cheese! Once I had the greek pizza 3 nights in a week, see it really is as good!  I've also had the greek pizza deep dish, wasn't as good as I expected since the mozarella took over the feta cheese and the feta is the star of this pizza.  It also depends on who makes the greek pizza (order it at night.)   Some of the sauces are tangy especially the hawaiian and dolores pizza. I have yet to try the calzones..maybe next Friday?\n\n03/29/2007: The four cheese pizza was delicious, the dough was perfect!", "rating": 4, "date": "2006-10-20"}, {"excerpts": ["I needed a pizza fast and cheap, got the Dolores Pizza, and it was great!!  ", "If your not a fan of garlic tell them to hold off, but I love it and it really made it special.  ", "It was one of the best pizzas I have had under $20.  ", "I'm going back for sure."], "author": "Dane H.", "review": "WOW!  Cheap and good.  I needed a pizza fast and cheap, got the Dolores Pizza, and it was great!!  If your not a fan of garlic tell them to hold off, but I love it and it really made it special.  It was one of the best pizzas I have had under $20.  I'm going back for sure.", "rating": 5, "date": "2008-07-21"}], "san franciscan pizza": [{"excerpts": ["I ordered a slice of the San Franciscan pizza, which contains pepperoni, sausage, bell peppers and mushroom.  "], "author": "Barnali D.", "review": "Popped in on a Thursday night for a quick, inexpensive dinner and was pleased!\n\nI ordered a slice of the San Franciscan pizza, which contains pepperoni, sausage, bell peppers and mushroom.  The slice was generously sized and the sausage was tasty.\n\nAll slices are fresh and made to order, and take about 10 minutes.\n\nThe service was friendly and fast, and it is a pleasant environment to eat in!", "rating": 4, "date": "2016-06-23"}], "greek special pizza": [], "prima special pizza": [], "crazy pollo pizza": [], "californian pizza": [], "pesto delight pizza": [], "chef pizza": [], "portuguese special pizza": [], "all meat pizza": [{"excerpts": ["We ordered delivery for an XL all meat pizza, and it fed 4 hungry people easily. "], "author": "Andrew E.", "review": "I actually drunk dialed Serrano's (through the yelp app) instead of another place, but let me say I was glad to have made this mistake!\n\nSerrano's serves a thin crusted pizza, and hits the spot in terms of quality. We ordered delivery for an XL all meat pizza, and it fed 4 hungry people easily. The pizza arrived in less than a hour, which during fleet week on a Saturday evening was plenty fast for us.\n\nI'll definitely order again from them, and actually prefer their pizza over other spots such as bernal pizza or seniore's.", "rating": 4, "date": "2015-10-19"}], "fiesta pizza": [], "serranos pizza": [{"excerpts": ["Serranos Pizza is really delicious and made to order.  ", "The employees recognize my boyfriend ", "and I as 'regulars' and are always very kind in greeting us.  ", "Always looking forward to coming back for another slice."], "author": "Haley G.", "review": "Serranos Pizza is really delicious and made to order.  The employees recognize my boyfriend and I as 'regulars' and are always very kind in greeting us.  Always looking forward to coming back for another slice.", "rating": 4, "date": "2014-01-16"}, {"excerpts": ["I love Serranos pizza. ", "I am Glad that they are back in the neighborhood after their fire. ", "Beside the same concede Brazilian Pizza Maker  always giving you the angry look. ", "This small place is good."], "author": "Juan T.", "review": "I love Serranos pizza. I am Glad that they are back in the neighborhood after their fire. Beside the same concede Brazilian Pizza Maker  always giving you the angry look. This small place is good.", "rating": 4, "date": "2008-02-20"}], "margarita pizza": [{"excerpts": ["Recommend ordering ahead, I got the lunch special with a slice of margarita pizza. ", "It's the best margarita pizza I've found in the city! ", "They layer the basil awesomely, under the cheese, there's a whole layer of basil, then they put a few crispy pieces of basil on top! ", "Lots of tomatoes, too. ", "One slice is huge, two can share it easily. ", "Since everything is homemade, not just left under lights for speediness, I do recommend calling ahead for pick up. ", "It's worth it. ", "Salad was tasty too, nice big pepper comes with it, really dresses it up. ", "Thanks Serrano's!"], "author": "Jessica S.", "review": "This place is great for takeout or delivery, considering they don't have a lot of space inside. Recommend ordering ahead, I got the lunch special with a slice of margarita pizza. It's the best margarita pizza I've found in the city! They layer the basil awesomely, under the cheese, there's a whole layer of basil, then they put a few crispy pieces of basil on top! Lots of tomatoes, too. One slice is huge, two can share it easily. Since everything is homemade, not just left under lights for speediness, I do recommend calling ahead for pick up. It's worth it. Salad was tasty too, nice big pepper comes with it, really dresses it up. Thanks Serrano's!", "rating": 5, "date": "2018-02-25"}, {"excerpts": ["- The margarita pizza is where it's at! \n\n"], "author": "Lorissa A.", "review": "I LOVE THIS PIZZA. And I'm not the biggest pizza fan - The margarita pizza is where it's at! \n\nI have delivery from them all the time.\n\nBUT - I have to say I was a bit disappointed when one of the employees (possibly owner) was so rude to this girl who had been waiting patiently for her slice of pizza.  She was upset and he was a total jerk to her.  \n\nI get it, Serranos, you have awesome pizza and you're busy - but really?! You're going to be mean to this girl who works across the street and probably gets pizza from you guys all the time??\n\nCustomer service was a bit out of wack that night. It made me sad! I LOVE your pizza - don't be mean!", "rating": 3, "date": "2009-02-03"}, {"excerpts": ["i had a margarita pizza and the basil and tomato were fresh and it really made a big difference. ", "i would definitely go back if i was in the neighborhood. \n", "bottom line: ", "Havent had pizza this good for a long time, not greasy, fresh, gets 5 stars from me!"], "author": "Margit H.", "review": "this place simply just has GOOD pizza. i paid about $4 for a slice (and they definitely get a little more expensive than that). the person i was with who also ordered a slice was told she would have to wait 15 mins. i was wondering why it would take so long, but it turns out each slice is made individually with fresh ingredients, not just reheated. so our slices came in less than 10 mins, they're HUGE and they are so tasty! i had a margarita pizza and the basil and tomato were fresh and it really made a big difference. i would definitely go back if i was in the neighborhood. \nbottom line: Havent had pizza this good for a long time, not greasy, fresh, gets 5 stars from me!", "rating": 5, "date": "2008-09-06"}], "garden pizza": [], "cheeseburger pizza with bacon": [], "alamo pizza": [], "bella pizza": [], "garlic bread with mozzarella cheese": [], "meatballs and garlic bread": [{"excerpts": ["my friend got cheese ravioli with meatballs and garlic bread on the side. ", "i personally didn't care for the ravioli, but she seemed to like it. ", "her portion was huge as well, and she easily got 1/4 of a large loaf of garlic bread."], "author": "Heather F.", "review": "i got what i thought was a slice of the clambake pizza. kind of expensive for ~$5, considering the fact that i thought it was one slice (it said so on the menu!). and then two huge slices came out. no complaints here, it was delicious. and i was starving. the crust was crunchy and chewy and yeasty, the sauce tomatoey and straddling sweet/acidic very well, with tons of garlic to satisify the crazy in me. not to mention the fact that there was a generous amount of clams on top. \n\nmy friend got cheese ravioli with meatballs and garlic bread on the side. i personally didn't care for the ravioli, but she seemed to like it. her portion was huge as well, and she easily got 1/4 of a large loaf of garlic bread.", "rating": 3, "date": "2015-07-27"}], "cream style cheese cake": [], "house spaghetti": [], "cheese ravioli": [{"excerpts": ["my friend got cheese ravioli with meatballs and garlic bread on the side. ", "i personally didn't care for the ravioli, but she seemed to like it. ", "her portion was huge as well, and she easily got 1/4 of a large loaf of garlic bread."], "author": "Heather F.", "review": "i got what i thought was a slice of the clambake pizza. kind of expensive for ~$5, considering the fact that i thought it was one slice (it said so on the menu!). and then two huge slices came out. no complaints here, it was delicious. and i was starving. the crust was crunchy and chewy and yeasty, the sauce tomatoey and straddling sweet/acidic very well, with tons of garlic to satisify the crazy in me. not to mention the fact that there was a generous amount of clams on top. \n\nmy friend got cheese ravioli with meatballs and garlic bread on the side. i personally didn't care for the ravioli, but she seemed to like it. her portion was huge as well, and she easily got 1/4 of a large loaf of garlic bread.", "rating": 3, "date": "2015-07-27"}], "meat ravioli": [], "green ravioli": [{"excerpts": ["The Green Ravioli is my usual - Raviolis filled with ricotta, mozzarella, spinach and herbs - with the pesto sauce. "], "author": "Chris G.", "review": "First off, this is based solely on the delivery. I've eaten here once but I've ordered dozens of times. It's one of the most consistent pizza delivery joints in the area, and I can always count on Serrano's delivery late at night.  The $8 minimum is pretty huge, too.\n\nDecent pizza. Not great in my opinion, but It's good for a cheap pie in San Francisco. Traditional slightly sweet thin crust, fresh pizza sauce, good cheese and generous toppings. It has always been cooked perfectly for me, never too doughy or cold, and never overcooked and burnt. The \"Deep Dish\" is what I've always known as Stuffed Crust, usually when I think deep-dish I think chicago-style, but apparently around here It's thin crust with cheese-filled thick outer crust. \n\nThe pasta is pretty good as well, but some are very oily. The Green Ravioli is my usual - Raviolis filled with ricotta, mozzarella, spinach and herbs - with the pesto sauce. Usually the pesto is good and not too heavy, but rarely it can be very oily and a bit much.\n\nMy order has always gotten to me on time, they usually say 45-60 minutes, which is repeatedly accurate. Free, on-time delivery and excellent prices in addition to satisfying food and a convenient location make Serrano's an all-around excellent spot for a quick slice or late-night delivery.", "rating": 4, "date": "2011-06-27"}, {"excerpts": ["The green ravioli has the spinach on the outside of the ravioli, it looks gross. ", "I wouldn't be so annoyed with that if it weren't for the fact that it was horribly dry and almost inedible. ", "I could very easily boil something from a frozen bag and it would be better. "], "author": "Amber F.", "review": "Well it took an hour and a half.. it's Saturday so I wasn't too upset over that. The estimate was 30 minutes to an hour though.\n\nSpaghetti was edible. I've had better sauce from a can at Safeway though. Not exaggerating on this either.. I don't even like Safeway so that's saying alot.\n\nThe green ravioli has the spinach on the outside of the ravioli, it looks gross. I wouldn't be so annoyed with that if it weren't for the fact that it was horribly dry and almost inedible. I could very easily boil something from a frozen bag and it would be better. ;/\n\nCalzone.. was decent. Not good, but not disgusting. \n\nSide salad was my favorite thing here and it was literally lettuce, cheese, tomatoes, a few olives and a side of dressing. \n\nThey forgot the cheesecake I ordered. Support at eat247 said they would have it taken off my bill. Still annoying though.\n\nI would not order from them again.\n\nThis place makes me think of some college students heating up frozen crap in bulk and delivering it.. posing as a real restaurant. \n\nYuckers I hope I don't get sick.", "rating": 1, "date": "2009-10-03"}], "vegetable lasagna": [], "healthy chicken": [{"excerpts": ["I placed an order for their \"healthy chicken\", which sounded yummy after a long day at work. ", "Grubhub said they were a mile away from my house and my order would be delivered in about an hour. ", "After getting in to comfortable clothes, I sat on my couch and waited for my food. ", "I got a call not long after from this place telling me they won't deliver to my house because its \"too far away\". ", "I explained that online it said it was only a mile away from my house ", "and they just said \"well you can pick it up or we can cancel the order\". ", "I expressed my frustrations with the fact that they couldn't deliver my food ", "A MILE from their place, and they asshole of a guy on the phone asked me \"if it's only a mile a way ", "what's the big deal in picking it up?", "\" ", "First of all, I was already in comfortable clothes and did not want to leave me house. ", "Second, if I wanted to pick it up I wouldn't have ordered it for delivery. ", "Third, it is none of his business why I didn't want to pick it up. "], "author": "Alyson V.", "review": "They have the ABSOLUTE WORST customer service ever. \n\nI placed an order for their \"healthy chicken\", which sounded yummy after a long day at work. Grubhub said they were a mile away from my house and my order would be delivered in about an hour. After getting in to comfortable clothes, I sat on my couch and waited for my food. I got a call not long after from this place telling me they won't deliver to my house because its \"too far away\". I explained that online it said it was only a mile away from my house and they just said \"well you can pick it up or we can cancel the order\". I expressed my frustrations with the fact that they couldn't deliver my food A MILE from their place, and they asshole of a guy on the phone asked me \"if it's only a mile a way what's the big deal in picking it up?\" First of all, I was already in comfortable clothes and did not want to leave me house. Second, if I wanted to pick it up I wouldn't have ordered it for delivery. Third, it is none of his business why I didn't want to pick it up. For all he knew, I could have been paralyzed and unable to drive a car and therefore ordered delivery. \n\nBottom line: They are rude, inconsiderate, nosy, lazy people and I wouldn't even recommend this place to my worst enemy. If I could have this place less than 1 star, I would.", "rating": 1, "date": "2012-12-23"}], "house clams": [], "tossed salad": [], "antipasto salad": [], "bacon salad": [{"excerpts": ["That alone is worth the 5-stars, but the pizza was super tasty and the bacon salad was yummy too. "], "author": "Stephy S.", "review": "Late night pizza to the rescue!\n\nThe other night after being convicted of attempted murder of my liver, we thought it best to order a pizza to soak of some of the evidence. I looked all over Yelp for late night deliveries in the area and this place popped up. At first I attempted to order through the automated system, but with only about 3 minutes to go before they closed, my friend suggested I just call them. He's smert.\n\nAnd so I dialed and received the following sad news, \"Oh sorry, we aren't delivering any more tonight. We are closed.\" \n\nTo which I pleaded, \"But there's still 2 minutes....\"\n\nPause. \"Okay, I'll deliver it to you on my way home :)\"\n\nYaaaay! That alone is worth the 5-stars, but the pizza was super tasty and the bacon salad was yummy too. Even noshing on the sweet remains of the cold pizza as I type this today, it's still deelish!\n\nGood job, Serrano's! You made a definite fan out of me!", "rating": 5, "date": "2009-10-09"}], "kerns juice": [], "slice of cheese pizza": [{"excerpts": ["I always order a slice of cheese pizza and a salad. ", "But today I ordered a vegetarian lasagne with a small salad and garlic bread. ", "My goodness the lasagne was one of the worst things I ever ate. ", "I took like 3 bites and I threw the rest of it away. ", "It was absolutely disgusting. ", "It tasted premade frozen and reheated. ", "2 stars for the garlic bread and salad being decent. ", "I would warn anybody to not order their lasagne from serranos"], "author": "Mohammad A.", "review": "I always order a slice of cheese pizza and a salad. But today I ordered a vegetarian lasagne with a small salad and garlic bread. My goodness the lasagne was one of the worst things I ever ate. I took like 3 bites and I threw the rest of it away. It was absolutely disgusting. It tasted premade frozen and reheated. 2 stars for the garlic bread and salad being decent. I would warn anybody to not order their lasagne from serranos", "rating": 2, "date": "2017-05-09"}, {"excerpts": ["The family split a great tasting slice of cheese pizza.  ", "It was fresh and it was a nice Sunday afternoon place to grab a bite to eat.  ", "I liked that the canned sodas were only a buck.  ", "I'd definitely come back to try a whole pizza."], "author": "Augustine W.", "review": "Great slice of pizza. The family split a great tasting slice of cheese pizza.  It was fresh and it was a nice Sunday afternoon place to grab a bite to eat.  I liked that the canned sodas were only a buck.  I'd definitely come back to try a whole pizza.", "rating": 4, "date": "2013-04-16"}, {"excerpts": ["so I don't know if they changed their prices, but I enjoy their $2 for a slice of cheese pizza. ", "It's actually more like two pieces. ", "I even ordered several pizzas for delivery in the past and they all taste great. ", "Grease, but great. ", "They also have other selections on their menus such as calzones."], "author": "Gerard Y.", "review": "I used to hangout here when I was in grade school to play the Street Figher arcade game they had there. This restaurant has gone through a couple of management changes. It's original name used to be called \"Pizza Pop\". There's a very small amount of seating in side and they have tables outside where you can eat your pizza in peace. It's especially nice during the summer. Anyway, haven't gone in a while so I don't know if they changed their prices, but I enjoy their $2 for a slice of cheese pizza. It's actually more like two pieces. I even ordered several pizzas for delivery in the past and they all taste great. Grease, but great. They also have other selections on their menus such as calzones.", "rating": 4, "date": "2007-03-05"}, {"excerpts": ["You can get a HUGE slice of cheese pizza for under $4 or my favorite Clam Bake, with tons of clams, onions and garlic--"], "author": "Lisa K.", "review": "My favorite place for pizza in the Mission. You can get a HUGE slice of cheese pizza for under $4 or my favorite Clam Bake, with tons of clams, onions and garlic--", "rating": 5, "date": "2010-06-07"}, {"excerpts": ["my friend and i both got a slice of cheese pizza each (we found out later, we could have just split one).  ", "it  was huge!  ", "we both ended up eating only half of our slices and taking the rest to go (yes, we did eat in.  ", "it wasn't bad.. ", "but definitely not somewhere you go to wine and dine.).  ", "i think the worst part about it is that we forgot our leftovers at the party.  "], "author": "Lily B.", "review": "i'm only giving this 3 stars because i feel like 4 would be misleading as i only tried a basic slice.\n\ni stopped in here randomly on a way to a party after work.  my friend and i both got a slice of cheese pizza each (we found out later, we could have just split one).  it  was huge!  we both ended up eating only half of our slices and taking the rest to go (yes, we did eat in.  it wasn't bad.. but definitely not somewhere you go to wine and dine.).  i think the worst part about it is that we forgot our leftovers at the party.  i was really looking forward to the next-day pizza slice.\n\nthe pizza itself was pretty good.   a little on the greasy side but i was starving and i pretty much inhaled it.\ndelicious!\n\nwe had to wait a while (even for just plain cheese) which made me antsy.. but i like that they made it fresh and it wasn't sitting there under a heat lamp for hours.\n\ni haven't tried anything other than the cheese slice so i'd hesitate to rely too much on my review.. but if you're into tasty greasy cheese pizza that is a lot of food for a decent price, i'd say stop in!", "rating": 3, "date": "2007-10-25"}], "tomato sauce": [{"excerpts": ["When I asked if my pizza was ready, Hector a person that prepares the pizzas pointed to a pizza that he was adding the tomato sauce to and said that was mine.  ", "In a very very rude way, he asked \"do you want the pizza or no?", "\"        I would have been fine waiting an extra 10-15 minutes if it wasn't for this persons extremely rude attitude.      ", "I ended up with a refund and going across the street to Jays cheesesteaks.    ", "Good pizza.   ", "Terrible service."], "author": "Hugo G.", "review": "The flavor of this place is good, however service is lacking. I ordered a Pizza and was told that there was a 30 minute wait.    I got there at the exact 30 minute mark.   When I asked if my pizza was ready, Hector a person that prepares the pizzas pointed to a pizza that he was adding the tomato sauce to and said that was mine.  In a very very rude way, he asked \"do you want the pizza or no?\"        I would have been fine waiting an extra 10-15 minutes if it wasn't for this persons extremely rude attitude.      I ended up with a refund and going across the street to Jays cheesesteaks.    Good pizza.   Terrible service.", "rating": 2, "date": "2016-05-17"}, {"excerpts": ["The pepperoni calzone is flawless, stuffed with 2 types of cheese and a dank amount of tomato sauce. ", "The Cesar salad was basic, but I only get that to even out all the cheese and bread. ", "Never change"], "author": "Jay C.", "review": "Heaven is a place on earth, and it's taken form in Serrano's. The pepperoni calzone is flawless, stuffed with 2 types of cheese and a dank amount of tomato sauce. The Cesar salad was basic, but I only get that to even out all the cheese and bread. Never change", "rating": 5, "date": "2015-08-24"}, {"excerpts": ["But tomato sauce has overpowering oregano flavor and not much else. "], "author": "Barbara N.", "review": "Slices were huge and had generous toppings, but were just rather salty and tasteless. Calzone was hot and crispy with flavorful crust. But tomato sauce has overpowering oregano flavor and not much else. It could, however, be easily improved. \n\nThey used Virginia ham in a ham calzone and the ricotta filling had overall sweetish flavor, so it definitely didn't taste like the classic Italian calzone. Plus the sauce was on the inside. I asked for some sauce on the side, and it was cold. \n\nDining surfaces were grimy. No one was wiping down the counters and tables in between customers, and the communal water pitcher was sketch-eek.", "rating": 2, "date": "2012-08-22"}, {"excerpts": ["The crust has just the right \"chew\" to it and the tomato sauce is really flavorful.\n\n"], "author": "Paul L.", "review": "This place does made-to-order slices. Sure, you have to wait several minutes to get your slice, but it's fresh and hasn't been sitting around for a while.\n\nAs a former New-Yorker, this place has got great New-York-style pizza. The crust has just the right \"chew\" to it and the tomato sauce is really flavorful.\n\nNote that this place is a clone (in a good way) of Deja Vu Pizza on 16th @ Guerrero. Perhaps they have the same owner.", "rating": 5, "date": "2011-07-03"}, {"excerpts": ["When you have pizza, do you think, \"You know, instead of plain old tomato sauce, I'd really like something that looks the same but actually tastes like liquefied kalamata olives?\"\n\n"], "author": "Daniel S.", "review": "DO YOU CRAVE SALT?\n\nDo you get Margaritas just to lick the edge?\n\nWhen you have coffee, do you forgo the sugar and creamer, and just reach for a canister of Morton's Salt instead?\n\nWhen you go to the beach, does it occur to your to dip a glass in the ocean and chug it down -- and not just for the nutritive value of yummy plankton?\n\nWhen you have pizza, do you think, \"You know, instead of plain old tomato sauce, I'd really like something that looks the same but actually tastes like liquefied kalamata olives?\"\n\nThen Serrano's is the place for you.  \n\nYes, the individual slices are cheap and massive -- and for some reason, longitudinally pre-perforated.  But they are greasy, floppy, and completely saline -- sauce, cheese, and crust included.\n\nSo if you're overhydrated or just ran a marathon, come on over.  Otherwise save it for when you need to sop up some alcohol after a late night bender.", "rating": 2, "date": "2008-12-04"}, {"excerpts": ["The Pizza itself has a good spice to it, not like many bland tomato sauce pizza's I find everywhere.  "], "author": "Andrew R.", "review": "Ok, so I should have reviewed the first time I checked this place out, but I'm a lazy yelper (I think I have 2 reviews).  Today was my second time ordering for delivery, and right on schedule it arrived at my door.  So both times I ordered the Art and Tom Terrific because I love artichoke hearts and garlic.  As a vegetarian I need something that packs a punch to the mouth, and this definitely does it.  The Pizza itself has a good spice to it, not like many bland tomato sauce pizza's I find everywhere.  Something about it really speaks to me!\n\nI ordered the Calzone this time, which is a good sized Calzone and priced under $7.00.  That and a 2 litter of Coca Cola and I meet the delivery requirement, which is only $8.00.  I work a noon to 8 shift on Market St @ Tan Bella and don't get the opportunity to go get lunch.  Having a place that delivers and doesn't require a $20.00 minimum for said delivery makes me and my wallet super happy!\n\nI'm going to try a different combination next time, not because I am over the Art and Tom Terrific but because I want to indulge in other goodies as well.  The only thing I wish this place had was better appetizers.  Mozzarella sticks, Jalepeno poppers, that's all I ask!\n\nThanks Serrano's for being there for me on my lunch break!", "rating": 4, "date": "2009-04-21"}], "ranch dressing": [], "bleu cheese dressing": [{"excerpts": ["okay, the linguine *far* from al dente, and the side salad inedible (complete with packet of Ken's bleu cheese dressing. ", "/sigh). "], "author": "Will H.", "review": "T+0: place my order for a chicken pasta, small salad with bleu cheese, garlic bread, Orangina. Having read the reviews on here, I know others have encountered issues, but I'm really craving pasta, so what the hell. Delivery estimate 45-60 minutes.\nT+10 minutes-ish: Serrano's confirms the order.\nT+68 m: I call Serrano's. They're unable to get in touch with the driver or tell me more info, but they say my order's on the way.\nT+82 m: I chat with Eat24 support to figure out what's going on. Sarah is busy but super nice.\nT+95 m: Serrano's driver rings my doorbell. He's apologetic, understandably.\n\nThe garlic bread was decent, the chicken completely overdone, the pesto okay, the linguine *far* from al dente, and the side salad inedible (complete with packet of Ken's bleu cheese dressing. /sigh). The Orangina was just fine.\n\nNot again, sorry.", "rating": 1, "date": "2015-12-20"}], "caesar dressing": [], "island dressing": [], "italian dressing": [{"excerpts": ["Even the mixed green salad is crisp and tasty with actual romaine and yummy Italian dressing; no wimpy iceberg lettuce here! \r\n\r\n", "One word of caution: make sure to note their closing times. ", "I've been turned away twice for showing up 5 minutes too late... ", "They stop taking orders for their slices about 20-30 mins before they close since they take the baking time into account. ", "Nothing sucks like showing up with a buzz, craving a delicious slice of crispy, greasy pizza and being denied. ", "Ahhh... ", "the horror!\r\n\r\n", "All in all, though, a great choice. ", "Take that, pre-baked slimy, soggy reheated slices!"], "author": "Jill M.", "review": "Totally, absurdly delicious. My fingers are somewhat slippery at the moment because I'm currently devouring a slice.\r\n\r\nSerrano's is unique because each 'slice' is actually baked from scratch. You tell them exactly what you want and they throw on all the toppings on a slice-shaped piece of dough, and bake it right then and there. It takes a little time -- about 7-10 mins -- but is amazingly fresh and yummy. Even the mixed green salad is crisp and tasty with actual romaine and yummy Italian dressing; no wimpy iceberg lettuce here! \r\n\r\nOne word of caution: make sure to note their closing times. I've been turned away twice for showing up 5 minutes too late... They stop taking orders for their slices about 20-30 mins before they close since they take the baking time into account. Nothing sucks like showing up with a buzz, craving a delicious slice of crispy, greasy pizza and being denied. Ahhh... the horror!\r\n\r\nAll in all, though, a great choice. Take that, pre-baked slimy, soggy reheated slices!", "rating": 4, "date": "2006-09-04"}], "haw pizza": [], "art and tom pizza": [], "valencia pizza": [], "zoey pizza": [], "mission pizza": [{"excerpts": ["A couple days ago I got a delivery of the Mission Pizza which has onions, pineapple and jalapenos.  ", "It was incredibly delicious.  ", "I'll get this pizza again ", "and I will order from here again.  ", "5 stars, no question.  ", "I am glad I found another good pizza place because I am pretty picky."], "author": "Cynthia B.", "review": "A couple days ago I got a delivery of the Mission Pizza which has onions, pineapple and jalapenos.  It was incredibly delicious.  I'll get this pizza again and I will order from here again.  5 stars, no question.  I am glad I found another good pizza place because I am pretty picky.", "rating": 5, "date": "2009-11-07"}, {"excerpts": ["If not, there are several other Mission pizza outlets.  ", "As for me, I value freshness and simplicity, and so when I go to Serrano's, I am always happy."], "author": "Gabriel G.", "review": "There's really only one thing to say about Serrano's:  they make their slices to order.  Let me make that more clear:  if you order a single slice, they will stretch out the uncooked dough, spread sauce, cheese and your topping(s) of choice on the slice, and then cook it in their pizza oven.  \n\nThis makes their slices fresh and a step up from any other pizza by the slice in SF.  The thin(ish) crust is crispy, the cheese is melty, it's a fresh slice of pizza (mmm good).  That's it.  Not re-cooked (ehhh bad).\n\nIt should be elaborated that the aforementioned (fresh) slice is also quite large.  Approaching the size of two slices anywhere else.  And they cut it in half, so it really is a lot like having two slices.  So at 3.35 for a one-topping, you're getting a lot for your money.  Because they are making it fresh, it takes a little while.  Expect to wait 15 minutes for a slice.  \n\nBeyond that, this is an unspectacular pizza.  But it doesn't try to be something it's not.  It's just a good, fresh slice of pizza.  Nothing fancy.  If this turns you on, go get it.  If not, there are several other Mission pizza outlets.  As for me, I value freshness and simplicity, and so when I go to Serrano's, I am always happy.", "rating": 4, "date": "2009-01-13"}], "greek pizza": [{"excerpts": ["The Greek pizza is the best tasting, pesto, canadian bacon, caramelized onions(yumm), and feta cheese! ", "Once I had the greek pizza 3 nights in a week, see it really is as good!  ", "I've also had the greek pizza deep dish, wasn't as good as I expected since the mozarella took over the feta cheese and the feta is the star of this pizza.  ", "It also depends on who makes the greek pizza (order it at night.)   "], "author": "Glu C.", "review": "Serrano's has become a Friday night tradition (well not really every 58 Fridays in a year because then I'd have to rely on a forklift as my own public transportation.) Yeah I'm having it tonight...the art and tom terrific, but I wanted the Greek! The Greek pizza is the best tasting, pesto, canadian bacon, caramelized onions(yumm), and feta cheese! Once I had the greek pizza 3 nights in a week, see it really is as good!  I've also had the greek pizza deep dish, wasn't as good as I expected since the mozarella took over the feta cheese and the feta is the star of this pizza.  It also depends on who makes the greek pizza (order it at night.)   Some of the sauces are tangy especially the hawaiian and dolores pizza. I have yet to try the calzones..maybe next Friday?\n\n03/29/2007: The four cheese pizza was delicious, the dough was perfect!", "rating": 4, "date": "2006-10-20"}], "prima pizza": [], "california pizza": [{"excerpts": ["YUM.I'll even go as far as to say they're way better than California Pizza Kitchen,way better.\n\n"], "author": "Isabella A.", "review": "I've been somewhat of a regular here since 2005.This was my go-to pizza  place in SF during the 00's. Always loved their BBQ chicken pizza!!\n\nFast forward to 2017... I haven't ordered from them in several years so thought to tame my growling stomach on a late night tonight. Ordered my past favorite,the BBQ chicken pizza...So far so good lol. Tastes just how they've always made it through the years. Very consistent. The sauce and the crust is absolutely still delish!!! YUM.I'll even go as far as to say they're way better than California Pizza Kitchen,way better.\n\nI don't get that low health score though...They always seem to present their food very very clean. I wasn't gonna let that deter my judgment though. Never got sick from eating at this place after all these years. Their pizza is still awesome(might even be one of the best in town to this day)...I'm glad I ordered from them tonight. Serrano's rules. Past faves also include their lasagna. Really good stuff.", "rating": 4, "date": "2017-12-01"}, {"excerpts": ["They don't even do California pizza.  ", "They make thick crust pizza with lavish amounts of cheese and topping.  ", "Their own thing.  "], "author": "Raman S.", "review": "Serrano's doesn't dabble in lean, thin sliced NY style pizza or the dense saucy Chicago style pizza.  They don't even do California pizza.  They make thick crust pizza with lavish amounts of cheese and topping.  Their own thing.  Which is actually a great change of pace from other places, and good on its own accord.  \n\nWholesome, Filling and Satisfying.\n\nThese prove to be much better than your average thin sliced pizza place.  And still cheap enough for you to be a regular at.", "rating": 4, "date": "2013-11-11"}], "pdelight pizza": [], "burger pizza": [], "portuguese pizza": [{"excerpts": ["Their Portuguese pizza has linguisa, my all time favorite topping, I work downtown, and I often order a pizza while getting on my train ", "and it'll be ready for me when I get home! "], "author": "Christina S.", "review": "Serrano's is my next door neighbor, and I really couldn't ask for a better neighbor. Their Portuguese pizza has linguisa, my all time favorite topping, I work downtown, and I often order a pizza while getting on my train and it'll be ready for me when I get home! It's a pretty delightful set up.\n\nThe pizza is quick and pretty tasty. They also make single slices of any pizza on the menu. What more can you ask for?", "rating": 4, "date": "2016-07-20"}]}