{"side of salad": [], "soup of the day  vegetarian": [], "soup and salad": [{"excerpts": ["I came here for a quick lunch to bring to work, there were two issues: it took 20 minutes to get my food (all I ordered was a soup and salad) and they charged me $8.95 for something on a menu that was $7.45, that's a 20% premium, did they give themselves a tip while they were at it?"], "author": "Angela S.", "review": "I came here for a quick lunch to bring to work, there were two issues: it took 20 minutes to get my food (all I ordered was a soup and salad) and they charged me $8.95 for something on a menu that was $7.45, that's a 20% premium, did they give themselves a tip while they were at it?", "rating": 3, "date": "2017-04-20"}], "gyro salad": [], "gyro wrap": [{"excerpts": ["The hubby ordered a standard lamb gyro wrap, this was also delicious. ", "Only issue was we had to wait a small bit to get the wraps, but they were worth the wait."], "author": "A K.", "review": "We stumbled along this place because most other places in the area were closed or too busy due to Bastille day. I ordered the chicken gyro with the add on of avocado. The chicken was a delicious mixture of white and dark meat and the rest was packed with fresh veggies. I would order again. The hubby ordered a standard lamb gyro wrap, this was also delicious. Only issue was we had to wait a small bit to get the wraps, but they were worth the wait.", "rating": 4, "date": "2018-07-19"}, {"excerpts": ["Ordered the gyro wrap with spicy option. ", "Did not disappoint. ", "The wrap was larger than I expected and filled me up. ", "They are super focused on cleanliness. ", "I went to shake their hand to say thank you ", "and he said he touched money and didn't want to contaminate my hand. ", "Elbow bump sufficed."], "author": "Michael C.", "review": "Ordered the gyro wrap with spicy option. Did not disappoint. The wrap was larger than I expected and filled me up. They are super focused on cleanliness. I went to shake their hand to say thank you and he said he touched money and didn't want to contaminate my hand. Elbow bump sufficed.", "rating": 5, "date": "2018-09-01"}, {"excerpts": ["Reza stated to me that many people order the Gyro Wrap.\n\n"], "author": "Porsche C.", "review": "I thank my lovely ladies, Yelp app and the great bars that got me tipsy in order to be able to find this place. The lovely ladies and I were bar hopping near the financial district/ Broadway area and after leaving the bar we decided to stop and get something to eat so we can bring our drinking high down. We noticed SF Wraps, not because of its looks but because it smelled SO DAMN GOOD from a mile away and plus it's open really late! LITERALLY! We followed our nose and decided to give it a try after we seem tons of people walking out of here with BIG ol wraps in there hand!\n\nI walked in and was greeted my Reza who is the owner very nice pleasant man. I stated to him that it was my first time and after looking at the menu I was kind of overwhelmed by all the different food options. All I knew was that I wanted whatever the other people had that smelled so delicious! Reza stated to me that many people order the Gyro Wrap.\n\nThe food is LEGIT here! The cooks name is Pablo and let me just say, \"He knows how to get down in the kitchen\". The food is tasty, flavorful and the portions are nice and you will leave you full. I still can't believe I was able to take down a whole wrap but I guess that's what happens when you are tipsy and hungry! Not only are the wraps a huge portion but the salads...OMG!! They looked so dang good and there huge! You have to order one to see for yourself. The have many good options of food but I really recommend the Wraps!  \n\nSeating area is small inside with a couple of tables and chairs so don't be alarmed but the food will make it all worth it!\n\nI never even knew this place existed and I am so thankful I found this! I can now eat healthy late at night when in the SF area and I don't have to feel guilty! I know where to come to now and with the great customer service from Reza there is NO WAY I am second guessing myself when in the area!\n\nI will be back Reza and SF Wraps!", "rating": 5, "date": "2015-06-22"}, {"excerpts": ["My spice-loving boyfriend commented that his Gyro Wrap was spicy - translation: he could've breathed flames - so, beware!\n\n"], "author": "Amanda W.", "review": "We searched for an hour for dinner in the financial district. Almost everything was closed because of Chinese New Year or the fact that it was post-5pm.\n\nSF Wraps saved the day, though they really should go for more of a Greek name. I really enjoyed my gyro platter and the baklava hit the spot! My spice-loving boyfriend commented that his Gyro Wrap was spicy - translation: he could've breathed flames - so, beware!\n\nThank you, come again? Too much to try nearby if we were ever back that way", "rating": 4, "date": "2016-03-14"}, {"excerpts": ["My bf got the gyro wrap, which I thought was much more flavorful. ", "We really liked the gyro meat, and the food tasted really fresh. "], "author": "Abby S.", "review": "Food (4/5): I got the avocado wrap, which was decent - it would have been amazing with salt and pepper though! It came with lettuce, tomatoes, cucumbers, red onions, and tahini. The tahini was a tiny bit watery. My bf got the gyro wrap, which I thought was much more flavorful. We really liked the gyro meat, and the food tasted really fresh. I wish the lavash was more toasted, though, but overall the food was pretty good.\n\nService (5/5): The owner is super nice, and even checked up on us and filled our water cups, something I totally didn't expect at such a casual place. \n\nValue (4/5): I think we paid about $10.60 each for a sizable wrap, and I was definitely full after the meal.", "rating": 4, "date": "2016-01-22"}, {"excerpts": ["My gyro wrap was more gigantic than the Pixies' song. ", "It was surprisingly light and healthy-full of leafy greens and evenly distributed gyro meat. ", "I had one half for lunch and the other half for dinner. "], "author": "Sunny S.", "review": "I don't really want to write a review of SF Wraps because I've noticed the owner comments on everyone's reviews. Ugh for comments. Lately I've been getting a lot of unsolicited comments full of spitfire and vitriol in my Yelp mailbox. My sister, Johnna S., said that nothing good ever comes in the Yelp inbox. She ain't never lied. My reviews are a play-by-play of my experience. That seems fair. You'll note, for the record, that the vast majority of my reviews are 4-5 stars. \n\nOne Friday afternoon I was craving the food of my people (half of my people, anyway), and decided to give SF Wraps a try. I was pretty busy, however, and needed to make quick work of lunch. I hoofed it to SFW and noticed that there were only a few people in line. Sweet. \n\nIt took a long time for me to place my order. I became confused, and I wondered if I was actually in the line. I asked the guy in front of me if he had ordered yet, because it seemed like an uncommonly long wait to place an order. He looked at me with annoyance and replied with a curt \"no.\" Okay, I admit that was annoying. Whoops. \n\nWhen it was my turn, I ordered a gyro lavash. There were only two people working at SFW that day. One was taking the orders and delivering them, and one was cooking. \n\nSFW is teensy, just like every other restaurant in the area. I parked myself at a table to wait, since everyone appeared to be ordering take out. \n\nA man came in and ordered after me. He sat at the table next to mine. And I'm fairly certain he was wearing purple contacts. Purple. Contacts (c. 1993). \n\nBecause I checked in on Yelp immediately upon my arrival, I was able to keep track of how long everything was taking. Of course, while I was waiting, my boss sent me 100 emails--I could just see his head spinning all the way around as he wondered if I had died during my lunch hour. I became antsy.\n\nIt took 20+ minutes to get a single wrap to go. Yikes--that's too long for takeout at lunch. SFW is a new business, so they may just need a little time to work out the kinks. Let's focus on the positive. \n\n+1 star for price. Another spot located in the FiDi where you can get a great lunch for under $10! My lavash was $7-$8--hurrah! \n\n+1 star for healthy fare and portion size. My gyro wrap was more gigantic than the Pixies' song. It was surprisingly light and healthy-full of leafy greens and evenly distributed gyro meat. I had one half for lunch and the other half for dinner. It was pretty tasty, to be sure. \n\nSFW is a solid spot, overall. The only problem is the wait. Just my opinion. Please don't send me a message stating that this review sucks and that as a result of this review you hate both me and my mama. Thanks.", "rating": 4, "date": "2014-04-18"}, {"excerpts": ["Btw, my wife had a gyro wrap which was enough for 2 people to share.\n\n"], "author": "Haroon S.", "review": "We are visiting from Dallas and fortunately SF Wraps was open Thanksgiving Day for dinner. I had a gyro plate that came with gyro meat, small salad, hummus, tzatziki, and bread. Portion size was good but wish I had gotten some more bread. Good flavors and thankful they were open.\n\nBtw, my wife had a gyro wrap which was enough for 2 people to share.\n\nI also had the Turkish Delight which was only okay but expensive at $5.", "rating": 4, "date": "2015-11-27"}, {"excerpts": ["I got the gyro wrap and it was absolutely delicious. ", "It was big and filled with fresh, healthy ingredients. ", "My lady got the rice plate and the portion was big and she loved it! ", "Furthermore, their service was TOP NOTCH. ", "We were treated really well and their staff was extremely friendly. ", "I'll definitely be coming back! ", "Highly recommend to anybody who's in SF & needs a late night bite (also great for lunch/dinner during the day!)"], "author": "Arrad R.", "review": "While staying in the bay for the week, I was hungry late at night and couldn't find many places open.\n\nFortunately, I found this place on Yelp and it's a GEM. I got the gyro wrap and it was absolutely delicious. It was big and filled with fresh, healthy ingredients. My lady got the rice plate and the portion was big and she loved it! Furthermore, their service was TOP NOTCH. We were treated really well and their staff was extremely friendly. I'll definitely be coming back! Highly recommend to anybody who's in SF & needs a late night bite (also great for lunch/dinner during the day!)", "rating": 5, "date": "2016-03-24"}, {"excerpts": ["ordered a gyro wrap the first night and a combo wrap the second night along with a side of just the gyro. ", "the gyro is cubed instead of shaved, allowing you to get all the flavor from the meat. ", "not from the area, but it is definitely going to be a tradition to get it everytime ", "I come here."], "author": "Kellen M.", "review": "Amazing gyro. came here two nights in a row. ordered a gyro wrap the first night and a combo wrap the second night along with a side of just the gyro. the gyro is cubed instead of shaved, allowing you to get all the flavor from the meat. not from the area, but it is definitely going to be a tradition to get it everytime I come here.", "rating": 5, "date": "2016-08-08"}, {"excerpts": ["The size of the falafal (gyro wrap) is gigantic and this is coming from 6'2 280 pound man. ", "The flavor of the spicy sauce was great. ", "If I wasn't in San Francisco surrounded by food spots I'd get two! ", "thanks for the service. ", "A+"], "author": "Christian C.", "review": "walking around there are so many options to stop by and eat. The other reviews left before me are very positive and it seems like the owner is very active on yelp, This made me want to try this spot out. Glad I did! The size of the falafal (gyro wrap) is gigantic and this is coming from 6'2 280 pound man. The flavor of the spicy sauce was great. If I wasn't in San Francisco surrounded by food spots I'd get two! thanks for the service. A+", "rating": 5, "date": "2015-04-11"}, {"excerpts": ["The gyro wrap was pretty good. ", "Fresh vegetables. ", "It's different. ", "We liked it. ", "Good portions. ", "They don't skimp on the meat. ", "I got some chocolate chip cookies. ", "Things were ridiculous. ", "So good. ", "The owner came over and spoke with us for a bit. ", "Seems like a nice guy. ", "Overall it was a good experience. ", "I would definitely recommend."], "author": "Jeremy T.", "review": "I went here with my co worker. The gyro wrap was pretty good. Fresh vegetables. It's different. We liked it. Good portions. They don't skimp on the meat. I got some chocolate chip cookies. Things were ridiculous. So good. The owner came over and spoke with us for a bit. Seems like a nice guy. Overall it was a good experience. I would definitely recommend.", "rating": 5, "date": "2016-05-11"}, {"excerpts": ["Had a spicy gyro wrap, easily the best I've ever had - and I enjoy lamb."], "author": "Kay T.", "review": "Ducked in here after failing to find the sushi place I was looking for. Had a spicy gyro wrap, easily the best I've ever had - and I enjoy lamb.", "rating": 5, "date": "2016-09-24"}, {"excerpts": ["My only complaint is that the shwarma wrap is really the same thing as the gyro wrap, with the addition of hummus. ", "If you're looking for traditional beef shwarma, this isn't it."], "author": "Fannie B.", "review": "Went here for the first time for a quick bite to eat. The reviews here are correct. SF Wraps is wonderful! The portions are generous and one wrap can easily be shared by two people. The place is clean and inviting.  My only complaint is that the shwarma wrap is really the same thing as the gyro wrap, with the addition of hummus. If you're looking for traditional beef shwarma, this isn't it.", "rating": 4, "date": "2016-11-27"}, {"excerpts": ["I had the gyro wrap and it was so big and amazing. ", "Go here if your thinking about it!!!"], "author": "Paul V.", "review": "Amazing service! Great food! Love it  the man served us water when we were eating. I had the gyro wrap and it was so big and amazing. Go here if your thinking about it!!!", "rating": 5, "date": "2016-08-28"}, {"excerpts": ["I got the gyro wrap an it was really big and only $6.50! ", "Really tasty. ", "He asked if I wanted it spicy ", "and I said \"how spicy?"], "author": "Alexandra W.", "review": "I got the gyro wrap an it was really big and only $6.50! Really tasty. He asked if I wanted it spicy and I said \"how spicy?\" and he offered to give it to me medium which was perfect.\n\nThe meat is really good quality. Would definitely come here again, I'd like to try the Avocado Wrap.", "rating": 4, "date": "2014-03-26"}, {"excerpts": ["I ordered the gyro wrap, and it was pretty good. "], "author": "Erin H.", "review": "Given the fact that I came here after going to Local Edition, SF Wraps was a nice little find. We were trying to get some Mexican food, but gyros wasn't a bad shout. It's pretty small, nothing fancy, but the food comes out really quickly. I ordered the gyro wrap, and it was pretty good. I remember it being pretty juicy, so I got some stains in my dress.. but in my drunken state, I just kept chowing down.\n\nNice little spot but didn't think it was anything out of the ordinary.", "rating": 3, "date": "2014-02-21"}, {"excerpts": ["I got the spicy gyro wrap for 6.95 and that thing was huge. ", "Packed with gyro, sauce and fresh veggies, this was for sure the right place to have my first gyro. ", "I think everyone who works in or visits sf should definitely give this place a try."], "author": "Jeffrey C.", "review": "I happened to come across this place just two days into my start of working in the city. My first day in the city I had a disappointing pulled bbq pork sandwich (from a shop which I shall not name), however my 2nd day here I happened to find this place on yelp and after hearing all my friends rave about how good shawarma and gyro is, I decided to give this place a try.\n\nAfter today all I can say is that I'm definitely coming back in the future. The guy that took my order (I think he might be the owner) greeted me with a big smile and made me feel extremely welcome. Even if the food wasn't good id still want to give this man my money just for his superb customer service. I got the spicy gyro wrap for 6.95 and that thing was huge. Packed with gyro, sauce and fresh veggies, this was for sure the right place to have my first gyro. I think everyone who works in or visits sf should definitely give this place a try.", "rating": 5, "date": "2014-07-15"}], "chicken gyro wrap": [], "shawarma wrap": [{"excerpts": ["I ordered the shawarma wrap, and it was surprisingly really good! ", "I came in after a night of drinking for some grub ", "and I thought I ordered a shawarma ", "but I got a wrap (duh lol), but the tortilla wrap was fresh and flaky. ", "I can tell they make the tortilla in house. ", "They also specialize in fresh baked cookies! "], "author": "Navila H.", "review": "I ordered the shawarma wrap, and it was surprisingly really good! I came in after a night of drinking for some grub and I thought I ordered a shawarma but I got a wrap (duh lol), but the tortilla wrap was fresh and flaky. I can tell they make the tortilla in house. They also specialize in fresh baked cookies! They had samples on the display case...and after one small bite I was sold on a whole cookie (I'm not one for sweets). \n\nIt's definitely a late night spot, or lunch spot. They have a couple 2-tops and one 4, and about 4 bar seating. I'd come here with a group no bigger than 6, or literally alone because it's good. Their service is also really friendly and accommodating. It's in the fidi so parking is poop, and public transit is good.\n\nI'd definitely come here again to try one of their other wraps, and get another chocolate chip cookie!", "rating": 4, "date": "2018-10-30"}, {"excerpts": ["I had the gyro and hummus and my friend got a shawarma wrap. ", "Everything was really tasty and the ingredients were fresh. ", "I would strongly recommend this place and I will definitely be coming back!"], "author": "Nisreen A.", "review": "The owners are extremely kind and welcoming. They have AMAZING fresh-baked cookies!!!! the hummus was really good and they gave a generous portion. The service was stellar and I can't recommend this place enough. I had the gyro and hummus and my friend got a shawarma wrap. Everything was really tasty and the ingredients were fresh. I would strongly recommend this place and I will definitely be coming back!", "rating": 5, "date": "2018-09-18"}, {"excerpts": ["The shawarma wrap was so good! ", "Thank you"], "author": "Justin C.", "review": "Tried this place for the first time and they had the best customer service. The shawarma wrap was so good! Thank you", "rating": 5, "date": "2018-09-18"}, {"excerpts": ["It wasn't the best chicken shawarma wrap. ", "nor was it a the worst. "], "author": "Brian N.", "review": "Food 2/5. Service 4/5. Ambiance 2/5.\n\nWe stopped by here for a quick lunch and it was just that. It wasn't the best chicken shawarma wrap. nor was it a the worst. There was only one person working the counter and cook, but the food didn't take that long. \n\nIt's a little shop, a wall in the hole, with a few tables. I got the chicken shawarma with chicken breast, cucumber, spring mix, red onion, hummus and tahini. The person working the counter also asks if you want it spicy or not but it wasn't that spicy. The chicken in the wrap is somewhat dry and even the hummus and tahini doesn't hide that fact. The wrap they use seems like the premade ones that you buy in bulk. The combination of ingredients made it just an alright wrap. \n\nOverall, it's an okay place to stop for a quick lunch but it isn't great. \n\nTips - Don't order anything with chicken breast it's kinda dry. \n\nPros - quick and fast. \n\nCons - precooked chicken just didn't make it a great experience.", "rating": 2, "date": "2017-06-25"}, {"excerpts": ["The chicken shawarma wrap here is SO good! ", "The staff is also really friendly here. ", "I would definitely come here again."], "author": "Amanda A.", "review": "The chicken shawarma wrap here is SO good! The staff is also really friendly here. I would definitely come here again.", "rating": 5, "date": "2018-07-29"}, {"excerpts": ["I ordered the supposedly fool-proof $8.45 Shawarma Wrap, which was a somewhat crusty piece of lavash slathered with hummus and tahini sauce and rolled around shards of beef and lamb gyros, cucumber, tomatoes, lettuce and chopped red onions ", "(photo: http://bit.ly/1Sw4fLK). ", "It just tasted off, really off, with the meat having that unmistakable consistency of post-freezer burn. ", "I ate a third of it ", "but no more. ", "Now I know how Iron Man feels. ", "The cookies still looked good, and truth be told, that's what most of the incoming customers appeared to be seeking. "], "author": "Ed U.", "review": "Remember the post-credits ending of \"The Avengers\"? Yeah, as the superheroes were all sitting around a table as they all tried the shawarmas. You couldn't quite tell whether they were exhausted from the battle against the Chitauri to save the planet or they just weren't into the shawarmas. After trying SF Wraps, I tend to think the latter since there are few things more disappointing than a marginal shawarma at lunch. At least that's what happened to me when I came in here in a hurry before heading back into the office. Now this used to be California Golden Cookies, but even though the cookies are still for sale, the purveyors finally switched the name to something more accurate about their menu.\n\nThey offer the standard Greek options like spanakopita, hummus, falafels, gyros and ah yes, wraps. The name change hasn't done anything to improve the quality of the food here though. I ordered the supposedly fool-proof $8.45 Shawarma Wrap, which was a somewhat crusty piece of lavash slathered with hummus and tahini sauce and rolled around shards of beef and lamb gyros, cucumber, tomatoes, lettuce and chopped red onions (photo: http://bit.ly/1Sw4fLK). It just tasted off, really off, with the meat having that unmistakable consistency of post-freezer burn. I ate a third of it but no more. Now I know how Iron Man feels. The cookies still looked good, and truth be told, that's what most of the incoming customers appeared to be seeking. Maybe they should have just kept the name.\n\nFOOD - 2 stars...a disappointing shawarma is like a motherless child\nAMBIANCE - 2.5 stars...same tight spot as before, nothing's changed so grab a table if you must\nSERVICE - 2.5 stars...order at the counter, that's it\nTOTAL - 2 stars...I think you'll have better luck at Ayola", "rating": 2, "date": "2016-04-03"}, {"excerpts": ["My husband and I shared a standard Shawarma wrap - they're a good size, and we had just come from an event with drinks and appetizers, so half a wrap was just right!  "], "author": "Barnali D.", "review": "Good food, polite service, and a clean, bright, simple setting.\n\nMy husband and I shared a standard Shawarma wrap - they're a good size, and we had just come from an event with drinks and appetizers, so half a wrap was just right!  It was flavorful.\n\nThe service was polite, and they offered to cut the wrap in half for us, which we really appreciated. And then it showed up in two plates - fantastic! \n\nThere's limited seating, but the place is clean, bright, and inviting.\n\nOverall, a good spot for a quick bite!", "rating": 4, "date": "2016-07-20"}, {"excerpts": ["I forget what my friend ordered but I got a Beef Shawarma Wrap ($8-$9) and an order of Falafel.  ", "The Falafel was decent but at about $6 I'm not sure I'd really feel the need to order it again ", "but it seemed like a good idea at the time.  ", "The wrap on the other hand was massive, filling and simply delicious. ", "It was exactly what I needed after a long day of starvation.  "], "author": "Jeff S.", "review": "Thank the whiskey & beer gods for SF Wraps because they are ideally located across the street from Rickhouse and they are open just as late.  Not only that but their prices are fair, the portions huge and food delicious.  It is truly a saving grace when you and your friends are on a long night of walking, brewery and bar crawling on a Saturday night.\n\nKnowing very well that I was going to be starving after a night of miles of walking, beer & whiskey drinking, it was comforting to know that there was a place nearby that was open late that served up some solid food options.\n\nA friend and I came here after leaving Rickhouse.  I forget what my friend ordered but I got a Beef Shawarma Wrap ($8-$9) and an order of Falafel.  The Falafel was decent but at about $6 I'm not sure I'd really feel the need to order it again but it seemed like a good idea at the time.  The wrap on the other hand was massive, filling and simply delicious. It was exactly what I needed after a long day of starvation.  I won't lie to you, I almost felt like ordering a second one. \n\nSeriously, this is exactly what is needed in this area. In a city of bustling night life and excellent bars, you're going to need a place with some solid, affordable and quality food options for some post-drinking indulgence.  SF Wraps meets that requirement quite well and surpasses it. If you're drinking at Rickhouse or something else nearby and you're hungry afterwards, you'd be foolish to pass this place up.  \n\nIf I ever end up visiting and doing the same crawl again, you'll know where to find me getting my grub on at the end of the night.", "rating": 5, "date": "2015-06-21"}, {"excerpts": ["Chicken shawarma wrap is amazing! ", "It's the only thing I get because it's so good "], "author": "Lauren G.", "review": "Chicken shawarma wrap is amazing! It's the only thing I get because it's so good I can't bring myself to order anything else.\n\nAdd feta for extra deliciousness.\n\nAnd you can get it as spicy as you want!\n\nYum!", "rating": 5, "date": "2017-02-11"}, {"excerpts": ["I got the chicken shawarma wrap and it's about 12 inches long. ", "I highly recommend SF Wraps!"], "author": "Kevin D.", "review": "Great people and great service! Feels like a true local business that you want to support. I got the chicken shawarma wrap and it's about 12 inches long. I highly recommend SF Wraps!", "rating": 5, "date": "2016-11-23"}, {"excerpts": ["Grabbed the shawarma wrap for lunch on a weekday, super delicious! "], "author": "Cole S.", "review": "Grabbed the shawarma wrap for lunch on a weekday, super delicious! The meat was flavorful and it's a good amount of food for ~$10\n\nThe owner was incredibly nice and their service was quick.\n\nDo not eat this prior to a meeting at work, it gets messy. The flatbread ripped after the 2nd bite even though I was using the tinfoil to keep it together (burrito style).", "rating": 3, "date": "2016-11-28"}, {"excerpts": ["I got a Chicken shawarma wrap last week while coming back from work in the evening. ", "Service was quick and wrap tasted good. ", "Would definitely stop by again in future for a quick grab and go"], "author": "Sireesha G.", "review": "I got a Chicken shawarma wrap last week while coming back from work in the evening. Service was quick and wrap tasted good. Would definitely stop by again in future for a quick grab and go", "rating": 4, "date": "2017-02-12"}, {"excerpts": ["The shawarma wrap was great. ", "The service was friendly. ", "I highly recommend them if you're in the neighborhood."], "author": "Mark S.", "review": "The shawarma wrap was great. The service was friendly. I highly recommend them if you're in the neighborhood.", "rating": 4, "date": "2015-10-23"}], "chicken shawarma wrap": [{"excerpts": ["It wasn't the best chicken shawarma wrap. ", "nor was it a the worst. "], "author": "Brian N.", "review": "Food 2/5. Service 4/5. Ambiance 2/5.\n\nWe stopped by here for a quick lunch and it was just that. It wasn't the best chicken shawarma wrap. nor was it a the worst. There was only one person working the counter and cook, but the food didn't take that long. \n\nIt's a little shop, a wall in the hole, with a few tables. I got the chicken shawarma with chicken breast, cucumber, spring mix, red onion, hummus and tahini. The person working the counter also asks if you want it spicy or not but it wasn't that spicy. The chicken in the wrap is somewhat dry and even the hummus and tahini doesn't hide that fact. The wrap they use seems like the premade ones that you buy in bulk. The combination of ingredients made it just an alright wrap. \n\nOverall, it's an okay place to stop for a quick lunch but it isn't great. \n\nTips - Don't order anything with chicken breast it's kinda dry. \n\nPros - quick and fast. \n\nCons - precooked chicken just didn't make it a great experience.", "rating": 2, "date": "2017-06-25"}, {"excerpts": ["The chicken shawarma wrap here is SO good! ", "The staff is also really friendly here. ", "I would definitely come here again."], "author": "Amanda A.", "review": "The chicken shawarma wrap here is SO good! The staff is also really friendly here. I would definitely come here again.", "rating": 5, "date": "2018-07-29"}, {"excerpts": ["Chicken shawarma wrap is amazing! ", "It's the only thing I get because it's so good "], "author": "Lauren G.", "review": "Chicken shawarma wrap is amazing! It's the only thing I get because it's so good I can't bring myself to order anything else.\n\nAdd feta for extra deliciousness.\n\nAnd you can get it as spicy as you want!\n\nYum!", "rating": 5, "date": "2017-02-11"}, {"excerpts": ["I got the chicken shawarma wrap and it's about 12 inches long. ", "I highly recommend SF Wraps!"], "author": "Kevin D.", "review": "Great people and great service! Feels like a true local business that you want to support. I got the chicken shawarma wrap and it's about 12 inches long. I highly recommend SF Wraps!", "rating": 5, "date": "2016-11-23"}, {"excerpts": ["I got a Chicken shawarma wrap last week while coming back from work in the evening. ", "Service was quick and wrap tasted good. ", "Would definitely stop by again in future for a quick grab and go"], "author": "Sireesha G.", "review": "I got a Chicken shawarma wrap last week while coming back from work in the evening. Service was quick and wrap tasted good. Would definitely stop by again in future for a quick grab and go", "rating": 4, "date": "2017-02-12"}], "meat lover wrap": [{"excerpts": ["Love the meat lover wrap and plates!!"], "author": "Aaron W.", "review": "Great people and love the food. I'm not a hummus person but love there hummus!!  Love the meat lover wrap and plates!!", "rating": 5, "date": "2018-02-14"}], "chicken meat lover wrap": [], "combo wrap": [{"excerpts": ["My boyfriend and I shared the Combo Wrap and ", "it was HUGE for the price of only $9?  ", "However, there was something off about the meat; it just didn't taste right/had an off after-taste.  ", "A few of my friends said the same thing while the other few enjoyed their meal.  ", "What I did like was the spring mix, good amount of veggies and the sauce they used for the wraps."], "author": "Regina O.", "review": "My friends and I came here for drunchies only because it was the only place open late nearby.  I dont know about you but I don't usually eat gyros as drunchies but being that it was so cold, we didn't want to keep walking around so we settled with SF Wraps.\n\nHonestly food is supposed to taste 10x better when you're drunk but this place was still just OK for me.  I thought the food was a little disappointing in my opinion as I saw the solid 4 star rating, I had higher expectations.  My boyfriend and I shared the Combo Wrap and it was HUGE for the price of only $9?  However, there was something off about the meat; it just didn't taste right/had an off after-taste.  A few of my friends said the same thing while the other few enjoyed their meal.  What I did like was the spring mix, good amount of veggies and the sauce they used for the wraps.", "rating": 3, "date": "2016-12-20"}, {"excerpts": ["Combo wrap for me--a little gyro meat and a little chicken. ", "It could have used a tad more sauce, but I hardly noticed as it was stuffed in my mouth hole and down my gullet. ", "Good grief", ", it was just what I wanted. ", "And the priced wasn't terrible. ", "And the quantity was more than one could want. ", "Slap it sloppily into your mouth, chomp down, and repeat."], "author": "Jeffrey S.", "review": "C'mon people. You know what this place is all about: it's about stuffing your pie hole with a delicious wrap thing. Get a delicious wrap thing for lunch and put it in your mouth hole. There are probably fancier or more intricate options around at that time. But it's zippy and it's simple.\n\nOr, like the rest of us, rejoice that this place is open until around last call, and get in there in the middle of the late night and stuff your drunk mouth hole with delicious food. It's not JUST a place to get your drunk self something in the belly (or drunk friends or coworkers in the case of us non-drinkers), but it's ESPECIALLY good for that.\n\nCombo wrap for me--a little gyro meat and a little chicken. It could have used a tad more sauce, but I hardly noticed as it was stuffed in my mouth hole and down my gullet. Good grief, it was just what I wanted. And the priced wasn't terrible. And the quantity was more than one could want. Slap it sloppily into your mouth, chomp down, and repeat.", "rating": 5, "date": "2015-12-11"}, {"excerpts": ["The gyro combo wrap is also a great deal. ", "Definitely a great go to for a late night gyro fix!"], "author": "Alpha E.", "review": "The owner, Reza, was very kind and helped me fill a late night hunger run! \n\nGyro was very authentic, clean facilities, and definitely great tasting food.\n\nThe gyro combo wrap is also a great deal. Definitely a great go to for a late night gyro fix!", "rating": 5, "date": "2016-08-24"}, {"excerpts": ["Came here around 11 pm on a Thursday night and ordered the Combo Wrap and the Jerusalem Wrap. ", "The Combo Wrap - on lavash\nChicken, Gyro meat (lamb and beef), tomatoes, onions, FREAKING SPRING MIX LETTUCE, cucumbers, and tzatziki sauce\n", "This one was definitely my favorite. ", "The chicken was juicy and flavorful. "], "author": "Lane B.", "review": "Just a note: California Golden Cookies and SF wraps are the same thing, for anyone confused about the double Yelp listing.\n\nCame here around 11 pm on a Thursday night and ordered the Combo Wrap and the Jerusalem Wrap. Both were huge and fresh and jam-packed with protein.\n\nThe Combo Wrap - on lavash\nChicken, Gyro meat (lamb and beef), tomatoes, onions, FREAKING SPRING MIX LETTUCE, cucumbers, and tzatziki sauce\nThis one was definitely my favorite. The chicken was juicy and flavorful. Be sure to ask for it spicy!\n\nThe Jerusalem Wrap - also on lavash\nFalafel, hummus, eggplant spread, feta, tahini, cucumber, tomatoes, onions, spring mix lettuce\nThis one was also delicious, but the falafel was quite different than what I'm used to- it had a somewhat displeasing herbal smell and didn't taste very much like chickpeas.\n\nThat said, you get a ton of food for your money, and the service is friendly and quick. Can't beat those late hours either!", "rating": 4, "date": "2014-07-25"}, {"excerpts": ["ordered a gyro wrap the first night and a combo wrap the second night along with a side of just the gyro. ", "the gyro is cubed instead of shaved, allowing you to get all the flavor from the meat. ", "not from the area, but it is definitely going to be a tradition to get it everytime ", "I come here."], "author": "Kellen M.", "review": "Amazing gyro. came here two nights in a row. ordered a gyro wrap the first night and a combo wrap the second night along with a side of just the gyro. the gyro is cubed instead of shaved, allowing you to get all the flavor from the meat. not from the area, but it is definitely going to be a tradition to get it everytime I come here.", "rating": 5, "date": "2016-08-08"}, {"excerpts": ["I need lentil soup... a combo wrap... ", "some sort of juice... and that chocolate thing. ", "Please... so weak...' ", "Seeing my feeble and broken form, the gentleman behind the bar got to my order with terrific speed. ", "In no time, I had my food and was off to the hotel. ", "The soup was made with yellow lentils and was nicely seasoned. ", "I was afraid that the consistency was going to be too runny and while on the thinner side, I found the soup to have a nice depth to go along with its flavor. ", "It was so good, in fact, I drizzled the lentils over my combo wrap. ", "Speaking of that wrap, get it. ", "A combo of meats. ", "A chorus of veggies. ", "A cubic liter of sauceS. I devoured that thing and it wasn't because I was so hungry. ", "It really was that good. ", "About to slip in to a food coma, I spied the 'chocolate' thing. ", "I have no idea of the name ", "but it was chocolate, almonds, a bit flaky, and ", "I ate it like a candy bar. ", "So.good. ", "Thanks to SF Wraps, I drifted in to pleasant sleep and wasn't forced to extend bodily harm to any bystanders. ", "SF Wraps saves lives!"], "author": "Johnny T.", "review": "After reading how many other people stumbled in to SF Wraps after being hungry and tired late at night, you would think competing businesses in the area would stay open and take advantage of the market. They're sleeping (heh) and SF Wraps is reaping the benefits. I'm glad SF Wraps exists. But for them, *someone* would have had a very bad night.\n\nLike others have mentioned, I discovered SF Wraps whilst wandering the neighborhood late at night. I'd just gotten off a cross-country flight and i was hAngry. Shocked that so few restaurant options were open to me, I pulled out my Yelp app with the last remaining strength I had (I'd been walking the streets like a street walker for an hour and prior to arriving at my destination, had made the mistake of using a shuttle service; I was done) and up popped SF Wraps. Done. \n\nI walked in and was forced to listen to drunk girl™ prattle on and on about nothing anyone cared about. Just as I was about to lay hands on her, her more sober friend sensed her imminent danger and pulled her out of the resto. 'Soup. I need lentil soup... a combo wrap... some sort of juice... and that chocolate thing. Please... so weak...' Seeing my feeble and broken form, the gentleman behind the bar got to my order with terrific speed. In no time, I had my food and was off to the hotel. The soup was made with yellow lentils and was nicely seasoned. I was afraid that the consistency was going to be too runny and while on the thinner side, I found the soup to have a nice depth to go along with its flavor. It was so good, in fact, I drizzled the lentils over my combo wrap. Speaking of that wrap, get it. A combo of meats. A chorus of veggies. A cubic liter of sauceS. I devoured that thing and it wasn't because I was so hungry. It really was that good. About to slip in to a food coma, I spied the 'chocolate' thing. I have no idea of the name but it was chocolate, almonds, a bit flaky, and I ate it like a candy bar. So.good. Thanks to SF Wraps, I drifted in to pleasant sleep and wasn't forced to extend bodily harm to any bystanders. SF Wraps saves lives!", "rating": 4, "date": "2014-06-30"}], "falafel wrap": [{"excerpts": ["I Was not satisfied especially since I paid 13$ for just a falafel wrap. ", "I try to eat as plant based as possible so falafels are my go to. ", "The texture of the falafel is not how it should be   ", "They were almost like doughy and dry. ", "The wrap itself was cold. ", "I asked for spicy ", "And it didn't have their spicy sauce. ", "I know they have that red sauce. ", "I'm not sure what was going on in there ", "but when I arrived it wasn't busy at all. ", "(Btw this was around midnight.) ", "so i don't understand how hard it is to put that sauce. ", "Who knows. ", "But if you want tasty falafels. ", "Try oasis grill ", "but they close earlier. ", "That is all :/"], "author": "Christian E.", "review": "I placed a phone order to pick up. The guy had alright service, didn't mention the price but asked how far I was so he could make sure it was warm. I Was not satisfied especially since I paid 13$ for just a falafel wrap. I try to eat as plant based as possible so falafels are my go to. The texture of the falafel is not how it should be   They were almost like doughy and dry. The wrap itself was cold. I asked for spicy And it didn't have their spicy sauce. I know they have that red sauce. I'm not sure what was going on in there but when I arrived it wasn't busy at all. (Btw this was around midnight.) so i don't understand how hard it is to put that sauce. Who knows. But if you want tasty falafels. Try oasis grill but they close earlier. That is all :/", "rating": 1, "date": "2018-07-19"}, {"excerpts": ["I had a falafel wrap and it was filled with perfectly fried balls of chickpea heaven.  ", "It was stuffed full of fresh veggies and slathered with their delicious hummus.  ", "What a treat.  ", "My husband had the gyro and it too was filled with delicious goodness of flavorful chunks of lamb.  ", "The owner recommended the spicy sauce on the side and we are glad we tried it.  ", "Thig gyro is different than the usual.  ", "It is wrapped in lavosh bread and the meat is not cut from the big rack of rotating meat but so good nevertheless and not greasy.  ", "Dont forget to have a homemade cookie hot and fresh from their ovens!!"], "author": "Pepper H.", "review": "Passed this place on our way down to the Beat museum.  Its a small storefront however the food is fresh and delicious.  I had a falafel wrap and it was filled with perfectly fried balls of chickpea heaven.  It was stuffed full of fresh veggies and slathered with their delicious hummus.  What a treat.  My husband had the gyro and it too was filled with delicious goodness of flavorful chunks of lamb.  The owner recommended the spicy sauce on the side and we are glad we tried it.  Thig gyro is different than the usual.  It is wrapped in lavosh bread and the meat is not cut from the big rack of rotating meat but so good nevertheless and not greasy.  Dont forget to have a homemade cookie hot and fresh from their ovens!!", "rating": 5, "date": "2018-08-03"}, {"excerpts": ["so I decided to try to get the falafel wrap! ", "Unfortunately, they were sold out! ", "A place that advertises falafel proudly, sold out at lunch time?", "?? ", "How? "], "author": "Jei C.", "review": "\"Oh no!\" This cheetah cries as he arrives to his restaurant of choice nearby. \"Closed!\" \n\nI found myself unsure of where to go for a quick lunch item as the place I had originally wanted to go to nearby was closed for some reason. \n\nWandering back and forth the streets, I happened across SF wraps and decided to give it a go! \n\nI am a sucker for falafel so I decided to try to get the falafel wrap! Unfortunately, they were sold out! A place that advertises falafel proudly, sold out at lunch time??? How? :(\n\nOh well, decided to get the avacado wrap instead. \nThe wrap was done quickly and served nice and warm in foil. The wrap itself was very flavorful and light, but it seemed like the fillings of veggies and sauce was lacking in flavor. Would have liked maybe some sort of more flavorful spread or maybe dressing. Even salt and pepper would have done a world of good for it. \n\nOverall, the wrap was nice and light, and had this cat decently satisfied. I may come back and try one of the other wraps, hopefully next time they have falafel! \n\n*chirp!*", "rating": 3, "date": "2016-02-16"}, {"excerpts": ["The Falafel wrap ($7) is also really great."], "author": "Mariko F.", "review": "I love this new addition to the FiDi. It's a little shop that's easy to miss but has some amazing food to offer, for great prices! \n\nI got a Gyro for $7 and it was huge. Of course it was amazingly delicious and so I ate the entire thing. It's so hard to go anywhere else when you know that this is an option in the neighborhood. \n\nI have a coworker who's a vegetarian and this place is great for them. The Falafel wrap ($7) is also really great.", "rating": 5, "date": "2013-09-10"}, {"excerpts": ["Jerusalem Falafel Wrap was delicious! ", "Be sure to get it spicy. ", "Owner was lovely and attentive to the patrons and the price was spot on. ", "I wish they were in my neighborhood!"], "author": "Courtney J.", "review": "Jerusalem Falafel Wrap was delicious! Be sure to get it spicy. Owner was lovely and attentive to the patrons and the price was spot on. I wish they were in my neighborhood!", "rating": 5, "date": "2016-02-06"}, {"excerpts": ["We tried Falafel wrap and avacado wrap. ", "Both were really good.  \n", "Falafel was remarkably better than many other Mediterranean places I have tried before. ", "I am sure they have their secret recipe. \n", "This is a family owned restaurant, small sized and reasonably priced menu, good customer service plus ", "it was open late night. ", "I would certainly stop by if happened to be around."], "author": "Rasesh P.", "review": "Fresh and tasty wraps.Being vegetarian its always challenging to find tasty meal. We tried Falafel wrap and avacado wrap. Both were really good.  \nFalafel was remarkably better than many other Mediterranean places I have tried before. I am sure they have their secret recipe. \nThis is a family owned restaurant, small sized and reasonably priced menu, good customer service plus it was open late night. I would certainly stop by if happened to be around.", "rating": 4, "date": "2014-06-03"}, {"excerpts": ["We had ordered Falafel wrap and it was big enough to fill our tummy. ", "It was saucy and spicy ", "just like we wanted ", ":) ", "It was just delicious ! ", "The lady at the counter was ", "extremely warm The Excellent taste and the wonderful customer service will force you to visit this place again ", ":) I would definitely recommend this place :)"], "author": "Psd S.", "review": "We were searching for a place to grab a quick lunch in downtown area and we came across this place. It looked OK but still we wanted to give it a try because of the good reviews. I'm so glad we did ! We had ordered Falafel wrap and it was big enough to fill our tummy. It was saucy and spicy just like we wanted :) It was just delicious ! The lady at the counter was extremely warm The Excellent taste and the wonderful customer service will force you to visit this place again :) I would definitely recommend this place :)", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["I ordered the spicy falafel wrap. ", "I'm not sure what their definition of \"spicy\" is, but the wrap was fairly mild. ", "Flavors were alright, though, so I can't complain too much. ", "Coupled with a fairly dry flathead wrap, the experience was nothing memorable."], "author": "Tyler A.", "review": "Met a friend here for a quick dinner. The place was clean and simple, with a fair variety of menu choices. I ordered the spicy falafel wrap. I'm not sure what their definition of \"spicy\" is, but the wrap was fairly mild. Flavors were alright, though, so I can't complain too much. Coupled with a fairly dry flathead wrap, the experience was nothing memorable.", "rating": 3, "date": "2016-04-14"}, {"excerpts": ["and I got the falafel wrap. ", "It was amazing! ", "I devoured it.  ", "It was big..", "maybe 12inches and could have probably served two ", "^@^ ", "It was flavorful, stuffed with crunchy, cubed cucumbers, tomatoes, baby greens, falafels, yogurt and hot sauce. ", "Mmmm! ", "The man who usually here is very friendly! ", "I've been back four times since! ", "You can't beat the price either! ", "(The falafels would be tastier if they were fresh and crispy, but guess you can't have it all)"], "author": "Chanel H.", "review": "I could probably eat here everyday!! When I visited New York, everyone told me i HAD to try the falafels. I did. It didn't live up to the hype so from that experience, falafel wraps were never my first choice when deciding on what to eat. Luckily my bf brought me here and I got the falafel wrap. It was amazing! I devoured it.  It was big..maybe 12inches and could have probably served two ^@^ It was flavorful, stuffed with crunchy, cubed cucumbers, tomatoes, baby greens, falafels, yogurt and hot sauce. Mmmm! The man who usually here is very friendly! I've been back four times since! You can't beat the price either! (The falafels would be tastier if they were fresh and crispy, but guess you can't have it all)", "rating": 4, "date": "2014-05-14"}, {"excerpts": ["Falafel wrap is solid and the best part is that they are open late. ", "Awesome"], "author": "Petey F.", "review": "This place is clutch. I have been coming here for years and the owner is cool and the food is top notch.  Falafel wrap is solid and the best part is that they are open late. Awesome", "rating": 5, "date": "2015-05-16"}, {"excerpts": ["I had the falafel wrap and enjoyed it; my one complaint is that the falafel wrap has a bit too much wrap compared to the delicious goodness inside."], "author": "Miguel C.", "review": "3 stars means A-OK: I would go here again. This place is open on the weekends in the otherwise shuttered Financial District. I had the falafel wrap and enjoyed it; my one complaint is that the falafel wrap has a bit too much wrap compared to the delicious goodness inside.", "rating": 3, "date": "2016-04-10"}, {"excerpts": ["I ordered a falafel wrap and had to order the baklava... both were amazing! ", "The restaurant was clean, well kept, and the owner was super friendly."], "author": "M M.", "review": "I ordered a falafel wrap and had to order the baklava... both were amazing! The restaurant was clean, well kept, and the owner was super friendly.", "rating": 5, "date": "2016-05-21"}, {"excerpts": ["I ordered the falafel wrap. "], "author": "Saumya B.", "review": "I ordered the falafel wrap. The wrap itself was average, nothing wrong with it and the ingredients.\n\nBut the falafel balls in the wrap were disgusting. And I am a falafel lover. But this was no good. I had to throw half my wrap away. \n\nThe customer service is good though.", "rating": 1, "date": "2014-09-03"}, {"excerpts": ["I always take a falafel wrap to go. ", "It is good and fills you up. ", "I'm not asking for anything more. ", "It does the job!"], "author": "Antonin A.", "review": "I always take a falafel wrap to go. It is good and fills you up. I'm not asking for anything more. It does the job!", "rating": 4, "date": "2014-11-23"}], "jerusalem falafel wrap": [{"excerpts": ["Jerusalem Falafel Wrap was delicious! ", "Be sure to get it spicy. ", "Owner was lovely and attentive to the patrons and the price was spot on. ", "I wish they were in my neighborhood!"], "author": "Courtney J.", "review": "Jerusalem Falafel Wrap was delicious! Be sure to get it spicy. Owner was lovely and attentive to the patrons and the price was spot on. I wish they were in my neighborhood!", "rating": 5, "date": "2016-02-06"}], "avocado wrap": [{"excerpts": ["I ate a avocado wrap with baba garnish eggplant dressing vegan fresh superb quality i love it !"], "author": "Lisa K.", "review": "I ate a avocado wrap with baba garnish eggplant dressing vegan fresh superb quality i love it !", "rating": 5, "date": "2017-02-19"}, {"excerpts": ["I ordered a falafel plate and an avocado wrap, both of them were so delicious. ", "I haven't had that good a falafel in any other place in the city. ", "I love their pita. ", "So light and soft. ", "They also have varied cookie and sweets collection. ", "Will definitely come back."], "author": "Sailaja B.", "review": "I always passed by this place but never gave it a try until today. I ordered a falafel plate and an avocado wrap, both of them were so delicious. I haven't had that good a falafel in any other place in the city. I love their pita. So light and soft. They also have varied cookie and sweets collection. Will definitely come back.", "rating": 5, "date": "2017-08-01"}, {"excerpts": ["I got the avocado wrap, which was decent - it would have been amazing with salt and pepper though! ", "It came with lettuce, tomatoes, cucumbers, red onions, and tahini. ", "The tahini was a tiny bit watery. "], "author": "Abby S.", "review": "Food (4/5): I got the avocado wrap, which was decent - it would have been amazing with salt and pepper though! It came with lettuce, tomatoes, cucumbers, red onions, and tahini. The tahini was a tiny bit watery. My bf got the gyro wrap, which I thought was much more flavorful. We really liked the gyro meat, and the food tasted really fresh. I wish the lavash was more toasted, though, but overall the food was pretty good.\n\nService (5/5): The owner is super nice, and even checked up on us and filled our water cups, something I totally didn't expect at such a casual place. \n\nValue (4/5): I think we paid about $10.60 each for a sizable wrap, and I was definitely full after the meal.", "rating": 4, "date": "2016-01-22"}, {"excerpts": ["Would definitely come here again, I'd like to try the Avocado Wrap."], "author": "Alexandra W.", "review": "I got the gyro wrap an it was really big and only $6.50! Really tasty. He asked if I wanted it spicy and I said \"how spicy?\" and he offered to give it to me medium which was perfect.\n\nThe meat is really good quality. Would definitely come here again, I'd like to try the Avocado Wrap.", "rating": 4, "date": "2014-03-26"}], "gyro plate": [{"excerpts": ["I ordered the gyro plate and was really impressed with the freshness and quality of ingredients ", ".The ", "girl at the counter was efficient and professional. ", "The place is very clean and looks recently remodeled. ", "I will be back for sure.."], "author": "George B.", "review": "I happened to be in the area on Saturday evening and decided to give this place a try. I ordered the gyro plate and was really impressed with the freshness and quality of ingredients .The girl at the counter was efficient and professional. The place is very clean and looks recently remodeled. I will be back for sure..", "rating": 5, "date": "2017-11-11"}, {"excerpts": ["I got the Gyro Plate, which was lamb and beef, but the Chicken Plate looked really tasty as well!  ", "Each plate comes with a side of pita squares, which is different from the pita pockets or little wedges that I normally see.  ", "I actually like these more -- they're like a deck of cards ", "and you can make little sandwiches out of them.  ", "Got the chicken plate. "], "author": "Alex L.", "review": "Complete shot-in-the-dark pick for lunch on a Monday afternoon.  We were pressed for time, and my friend wanted to go to a sandwich shop nearby, but it was packed and had no seating.  This was definitely a worthy substitute.\n\nFor just under $12, you can get a plate, which consists of a huge portion of meat, Greek salad, hummus, and tzatziki.  They also have wraps for $8-10 (don't remember the exact amount).  It's very typical of other fast casual Greek restaurants I've been to -- you order at the front, sit down with a number, and they bring it to you in a basket in a flash.  I got the Gyro Plate, which was lamb and beef, but the Chicken Plate looked really tasty as well!  Each plate comes with a side of pita squares, which is different from the pita pockets or little wedges that I normally see.  I actually like these more -- they're like a deck of cards and you can make little sandwiches out of them.  Other fast-casual Greek places, take note.\n\nVery good, fairly quick lunch option, and a lot of food for a fair price.  It's worth checking out.", "rating": 4, "date": "2017-03-16"}, {"excerpts": ["I got the chicken gyro plate which comes with a salad. "], "author": "Rick G.", "review": "This was an accidental find as I was walking around looking for some grub. The small shop was inviting with someone ordering and 4 patrons sitting down at the 8 spaces available for seating. \n\nThe owner (I'm guessing) took my order with a smile and friendly conversation. While I was waiting on my food, one of the female patrons had leftovers and the owner asked if she needed a bag. He bagged it for her. Amazing service!\n\nThe menu is simply appetizers, soups and salads, wraps, and plates. They also have some cookies and baklava. \n\nI got the chicken gyro plate which comes with a salad. It was good, not great, but lots of meat with plenty of sauce.\n\nTry them out!", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["I got the gyro plate. \n\n"], "author": "Jim C.", "review": "I wanted to like this place more. I came in around 9PM, so not like a late night drunken \"FEEDME!\" moment.\n\nThe service was great. Very prompt and attentive.\n\nBut the food wasn't what it should have been. I got the gyro plate. \n\nThe portion was large, no question. A lot of meat, a lot of hummus, and more tzatziki than one person could eat. But unfortunately, it was a situation where more ended up being less.\n\nThe meat: When you have a rotisserie gyro stand going, I sort of expect my gyro to come from that. Not pulled out of a rice cooker/crock pot in the back. And certainly not just chunks (not slices) of meat. To me, what makes a gyro (or shwarma, or döner kebab) REAL is that mix of crisp and tender... cutting the meat off as it is ready. What I got was salty beef cubes, warmed in a heater. No texture. And, I'm assuming homemade, because it lacked seasoning other than the salty flavor. \n\nThe sides: the hummus had a nice flavor, but was watery. And the tzatziki tasted like what I could buy at a Cash & Carry. If it was homemade, it needs a major garlic and dill injection.\n\nI really wanted to like this more. The owner seems honestly caring and responsive to feedback here, so I'm hoping this comes across as constructive feedback rather than bitching. \n\nAll this place needs to be awesome is a bit less quantity and a bit more quality.", "rating": 2, "date": "2015-12-01"}, {"excerpts": ["I had a gyro plate that came with gyro meat, small salad, hummus, tzatziki, and bread. ", "Portion size was good but wish I had gotten some more bread. ", "Good flavors and thankful "], "author": "Haroon S.", "review": "We are visiting from Dallas and fortunately SF Wraps was open Thanksgiving Day for dinner. I had a gyro plate that came with gyro meat, small salad, hummus, tzatziki, and bread. Portion size was good but wish I had gotten some more bread. Good flavors and thankful they were open.\n\nBtw, my wife had a gyro wrap which was enough for 2 people to share.\n\nI also had the Turkish Delight which was only okay but expensive at $5.", "rating": 4, "date": "2015-11-27"}, {"excerpts": ["The gyro plate was abysmal - the meat tasted like fried spam (no texture, extremely mushy, zero flavor, oily). ", "The hummus was very thin and watery. ", "The lavash was really thin and tasteless, and the vegetables/yogurt were foul and slightly sweet. "], "author": "Crystal J.", "review": "You know how when you take an exam, you get 1 point for simply writing your name on the paper? That's how I feel about SF Wraps. The establishment exists, so it gets one attendance point. \n\nThe gyro plate was abysmal - the meat tasted like fried spam (no texture, extremely mushy, zero flavor, oily). The hummus was very thin and watery. The lavash was really thin and tasteless, and the vegetables/yogurt were foul and slightly sweet. The chicken plate wasn't much better. While it didn't taste like spam, the babaghanoush was awful. I was also surprised that neither of the plates came with rice - that's a first for any Mediterranean joint I've been. After a few bites of each, we had to throw out both dishes.\n\nI hate giving this a terrible review, because service was really friendly and accommodating. But given the average standard of Bay Area restaurants, this was incredibly disappointing and a loss of $25.", "rating": 1, "date": "2015-09-05"}, {"excerpts": ["I always get the gyro plate with avocado and feta cheese.  ", "Fresh food, great presentation, open late, and the best customer service!  ", "Love love love!"], "author": "Eunice K.", "review": "Amazing service, amazing gyros!  The owner is the sweetest guy ever!  You will leave smiling and satisfied.  I always get the gyro plate with avocado and feta cheese.  Fresh food, great presentation, open late, and the best customer service!  Love love love!", "rating": 5, "date": "2016-04-12"}], "chicken plate": [{"excerpts": ["I got the Gyro Plate, which was lamb and beef, but the Chicken Plate looked really tasty as well!  ", "Each plate comes with a side of pita squares, which is different from the pita pockets or little wedges that I normally see.  ", "I actually like these more -- they're like a deck of cards ", "and you can make little sandwiches out of them.  ", "Got the chicken plate. "], "author": "Alex L.", "review": "Walked in here near midnight expecting nothing great. Got the chicken plate. I was sharing with my GF and the owner suggested extra meat.\n\nI gotta say. This place hit the spot! The food was good, and very fresh considering the time. I'm very happy with this meal, and with the friendly excellent service.", "rating": 5, "date": "2017-10-14"}, {"excerpts": ["Was starving, this place caught my eye so dropped by for a chicken plate to go. ", "Opened it up when I got home, looked good but the chicken tasted like 2 year old expired oil, had a really fishy, stale taste that almost made me puke. ", "Complete waste of money"], "author": "Faizan A.", "review": "Was starving, this place caught my eye so dropped by for a chicken plate to go. Opened it up when I got home, looked good but the chicken tasted like 2 year old expired oil, had a really fishy, stale taste that almost made me puke. Complete waste of money", "rating": 1, "date": "2017-11-30"}, {"excerpts": ["I ordered the baba ganoush and the chicken plate. ", "The quantity was really good. ", "The food was quite tasty, especially the baba ganoush and the tzatski. ", "However, I wish I had gotten an itemized list on my receipt."], "author": "Akansha G.", "review": "I went here because it was one of the few places open really late night on Sunday. I ordered the baba ganoush and the chicken plate. The quantity was really good. The food was quite tasty, especially the baba ganoush and the tzatski. However, I wish I had gotten an itemized list on my receipt.", "rating": 4, "date": "2018-04-17"}, {"excerpts": ["Got a chicken plate and the chicken tasted like it just came from the freezer, then the microwave."], "author": "Alessandro B.", "review": "Just really bad food. Got a chicken plate and the chicken tasted like it just came from the freezer, then the microwave.", "rating": 2, "date": "2016-11-25"}, {"excerpts": ["I had the chicken plate, which was served with a side of thin pita bread slices.  ", "I usually like to wrap my chicken in the pita with some hummus, but that was a bit difficult. ", "I prefer thicker, larger slices of pita.  ", "The chicken itself was good, nothing spectacular about the flavor and it definitely needed the hummus and tzatziki that came on the side to add flavor to it.  "], "author": "Flora H.", "review": "SF wraps was the only place open late on Friday night in the Financial District (we had a BART fail and lost an hour, and thus, apparently, the option to eat in the Financial District).\n\nI had the chicken plate, which was served with a side of thin pita bread slices.  I usually like to wrap my chicken in the pita with some hummus, but that was a bit difficult. I prefer thicker, larger slices of pita.  The chicken itself was good, nothing spectacular about the flavor and it definitely needed the hummus and tzatziki that came on the side to add flavor to it.  On the plus side, it wasn't greasy at all and tasted pretty healthy.\n\nAn okay spot for Greek food, and being the only option at the time definitely served our needs, but there's definitely better Greek food out there.  I will say that the service was great and they were very nice!", "rating": 3, "date": "2014-06-25"}, {"excerpts": ["The chicken plate wasn't much better. ", "While it didn't taste like spam, the babaghanoush was awful. ", "I was also surprised that neither of the plates came with rice ", "- that's a first for any Mediterranean joint I've been. "], "author": "Crystal J.", "review": "You know how when you take an exam, you get 1 point for simply writing your name on the paper? That's how I feel about SF Wraps. The establishment exists, so it gets one attendance point. \n\nThe gyro plate was abysmal - the meat tasted like fried spam (no texture, extremely mushy, zero flavor, oily). The hummus was very thin and watery. The lavash was really thin and tasteless, and the vegetables/yogurt were foul and slightly sweet. The chicken plate wasn't much better. While it didn't taste like spam, the babaghanoush was awful. I was also surprised that neither of the plates came with rice - that's a first for any Mediterranean joint I've been. After a few bites of each, we had to throw out both dishes.\n\nI hate giving this a terrible review, because service was really friendly and accommodating. But given the average standard of Bay Area restaurants, this was incredibly disappointing and a loss of $25.", "rating": 1, "date": "2015-09-05"}, {"excerpts": ["I had the chicken plate, and the chicken was so flavorful and delicious. ", "The hummus was great, as was the tzatziki. ", "It was very creamy and thick. ", "It was served with lavosh instead of pita, which was a little too thin for me. ", "I like the thick pita more. ", "But overall, a really wonderful meal."], "author": "Ashley P.", "review": "Mmmm this is legit. Authentic Mediterranean food made by the guy who took my order. I had the chicken plate, and the chicken was so flavorful and delicious. The hummus was great, as was the tzatziki. It was very creamy and thick. It was served with lavosh instead of pita, which was a little too thin for me. I like the thick pita more. But overall, a really wonderful meal.", "rating": 4, "date": "2014-08-06"}], "gyro rice plate": [], "chicken rice plate": [], "combo plate": [{"excerpts": ["Got the combo plate. ", "It was sub par food and way overpriced - but it did satisfy."], "author": "AK _.", "review": "Came here late at night because it was the only place open around me. Got the combo plate. It was sub par food and way overpriced - but it did satisfy.", "rating": 4, "date": "2018-08-17"}], "side of hummus": [{"excerpts": ["Definitely a house made soup\n-Falafel Plate $9: 4 pieces of falafel, comes with a side of hummus, pot bread and small salad. ", "A bit chewy, I assume they microwaved to heat\n-Gyro ", "$8: lamb, cucumber, red onion, lettuce and tzatziki sauce. "], "author": "Celina Q.", "review": "Late night Greek eats near Chinatown. Open til 2am daily, their menu features all the basic Greek foods plus some others. Walked in around 11pm on a Thursday and was delighted that the whole menu was still available. \n\nFood Review:\n-Hummus $5: served chilled with a side of thin pita bread slices, tasted great\n-Lentil Soup $5: oh so delish! Smooth blended with carrots, garlic and onion. Definitely a house made soup\n-Falafel Plate $9: 4 pieces of falafel, comes with a side of hummus, pot bread and small salad. A bit chewy, I assume they microwaved to heat\n-Gyro $8: lamb, cucumber, red onion, lettuce and tzatziki sauce. They do not skimp of the ingredients, so yum!\n\nThe owner is so nice! He makes the little shop feel very welcoming. TV was playing SNL so that added a splash of pizazz to our eat-in experience.", "rating": 5, "date": "2014-05-04"}], "side of dolma": [], "side of babaghanoush": [], "side of gyro meat": [], "side of chicken meat": [], "side of rice": [{"excerpts": ["I ended up getting the chicken salad and a side of rice to go.  ", "The chicken on the chicken salad was good, but came in 4 giant pieces and they didn't have plastic knives.  ", "But luckily they gave me two forks ", "so I could rip the chicken up myself.  ", "Would it take them too long to cut it for you?  ", "Anyway, overall I didn't like the salad.  ", "It came with the smallest side of congealed dressing and there was a weirdly large amount of cabbage in the mixed greens.  ", "Didn't realize I was ordering a raw cabbage salad.  ", "The side of rice was extremely bland.  ", "There's a previous review about the rice not coming with \"carrots, onions, and spices\" and the owner responded saying they didn't update the menu.  "], "author": "Jessica F.", "review": "Not impressed.  What kind of Mediterranean restaurant runs out of feta?? That totally messed with what I wanted to order.  I ended up getting the chicken salad and a side of rice to go.  The chicken on the chicken salad was good, but came in 4 giant pieces and they didn't have plastic knives.  But luckily they gave me two forks so I could rip the chicken up myself.  Would it take them too long to cut it for you?  Anyway, overall I didn't like the salad.  It came with the smallest side of congealed dressing and there was a weirdly large amount of cabbage in the mixed greens.  Didn't realize I was ordering a raw cabbage salad.  The side of rice was extremely bland.  There's a previous review about the rice not coming with \"carrots, onions, and spices\" and the owner responded saying they didn't update the menu.  Well, the menu still says \"carrots, onions, and spices\" and I just got rice and some carrots.  \n\nAlso, a to go salad place should ask customers if they want their dressing mixed in or on the side.  I'm just going to keep going to Working Girls next door.", "rating": 2, "date": "2018-05-16"}], "chocolate chip cookie": [{"excerpts": ["I'd definitely come here again to try one of their other wraps, and get another chocolate chip cookie!"], "author": "Navila H.", "review": "I ordered the shawarma wrap, and it was surprisingly really good! I came in after a night of drinking for some grub and I thought I ordered a shawarma but I got a wrap (duh lol), but the tortilla wrap was fresh and flaky. I can tell they make the tortilla in house. They also specialize in fresh baked cookies! They had samples on the display case...and after one small bite I was sold on a whole cookie (I'm not one for sweets). \n\nIt's definitely a late night spot, or lunch spot. They have a couple 2-tops and one 4, and about 4 bar seating. I'd come here with a group no bigger than 6, or literally alone because it's good. Their service is also really friendly and accommodating. It's in the fidi so parking is poop, and public transit is good.\n\nI'd definitely come here again to try one of their other wraps, and get another chocolate chip cookie!", "rating": 4, "date": "2018-10-30"}], "double fudge brownie": [], "dutch chocolate brownie": [], "white chocolate chip cookie": [], "walnut fudge brownie": [], "coconut crisp cookie": [], "peanut butter cookie": [], "peanut butter choco chip cookie": [], "triple chocolate cookie": [], "assorted golden cookies bundle  pcs": [], "double fudge brownie gourmet box  pcs": [], "aight cookie box  cookies": [], "dutch caramel brownie box pcs": [], "chocolate chip cookie box  pcs": [], "can of coke": [], "can of diet coke": [], "can of sprite": [], "bottle of water": [{"excerpts": ["I opted for the chicken meat love with extra rice and a bottle of water. ", "Chicken was warm and fresh, and wrap HUGE! ", "I could only eat half and had to take the rest home! "], "author": "Bethany W.", "review": "Doesn't look much from the outside but sometimes you have to give these places a try and for my first meal in SF, it was exactly what I needed! Meat, sauce and wrap - quick, large and good quality. NOM. \n\nI opted for the chicken meat love with extra rice and a bottle of water. Chicken was warm and fresh, and wrap HUGE! I could only eat half and had to take the rest home! It cost $14.95 - which for the size I thought was pretty good (although still getting used to the exchange rates!) \n\nThumbs up from me!", "rating": 4, "date": "2016-08-22"}], "perrier  ml sparkling water": []}