{"rice cake and egg in beef broth": [], "tasty dumpling and egg in beef broth": [], "tasty dumpling rice cake and egg in beef broth": [], "korean sausage soup": [{"excerpts": ["The Korean sausage soup. "], "author": "aL Z.", "review": "Anyong haseyo...that's the Korean way of saying hi, hello, good morning, good afternoon, good evening...a general welcome. Shin Toe Bul Yi serves home made Korean cuisine that many Koreans and Korean Americans enjoy...a key indicator of authentic Korean food.\n\nThe moment you sit down, they serve you tea along with a pan-fried sticky rice scallion pancake, accompanied with a vinegar based chili green onion dipping sauce. The place offers the commonly found entrees like kalbee, beef and pork bulgogi, chap-che, tofu stew, meat or vegetable in sizzling stoneware pot, etc. \n\nHighlights of the place, however, are the unusual dishes. The crispy moist tasty deep fried chicken. Ne-jang-tang...a stew of pollack roe and cod intestines. Minuh-jigae...sea bass and vegetable in spicy stew. The pork and potato spicy stew. The Korean sausage soup. Tofu with shepherds purse in soy bean paste. \"Hayake\" is the term for ordering the soup or stew without the spiciness. It means white or plain non-spicy soup/stew.\n\nOther entrees worth trying are the sea bass jjim (steamed sea bass in house special sauce), sauted chicken gizzard and vegetables, and steamed skate wings or monk fish.\n\nAll entrees comes with six to eight panchan or small side dishes of pickled vegetables, along with a section of pan-fried mackerel. The entrees are substantial. Prices are very reasonable. Korean meals are best consumed with several cold bottles of soju (Chamisul or Sansoju brands).  Wee-ha-yo!", "rating": 4, "date": "2006-11-13"}, {"excerpts": ["We ordered jap chae, green onion pancake, fried chicken bits, dol sot bam and a spicy korean sausage soup. ", "They added a piece of fried fish on the hosue. ", "Everything was quite good. ", "The soup had liver and something that resembled blood sausage in it, and was in a spicy broth. ", "I personally didnt care for it, but my husband and friends loved it. ", "All portion sizes were quite big, and everythig was good. ", "Good service as well."], "author": "Priya K.", "review": "Very good korean food. Only problem is they close at 9.30 (most korean places are open till late).\nWe ordered jap chae, green onion pancake, fried chicken bits, dol sot bam and a spicy korean sausage soup. They added a piece of fried fish on the hosue. Everything was quite good. The soup had liver and something that resembled blood sausage in it, and was in a spicy broth. I personally didnt care for it, but my husband and friends loved it. All portion sizes were quite big, and everythig was good. Good service as well.", "rating": 4, "date": "2008-06-15"}], "thin sliced beef vegetables and egg in spicy beef broth": [], "crab and vegetables in spicy stew": [], "sea bass and vegetables in spicy stew": [], "silver cod and vegetables in spicy stew": [], "chicken and potato in hot sauce": [], "pork and potato in spicy stew": [], "kimchee chigae": [], "pollack roe vegetables and tofu stew": [], "pollack roe and cod intensive stew": [], "soft tofu stew": [{"excerpts": ["The soft tofu stew had plentiful nice, soft, silky tofu, but was bland. ", "However, it came on the house and was a nice gesture and well appreciated and enjoyed. ", "I thought the banchan was tasty and seemed fresh and juicy - they had a total of seven which included bean sprouts, cucumber, fishcake, Japanese pickled daikon with some chili powder, some type of shriveled black beans, kimchi, and the white Korean pickled radish. ", "The haemul pajeon came with a yummy red-hued dipping sauce, with a lot more scallions and chili powder in it than I'm used to being served - although it wasn't spicy. ", "The seafood pancake itself was very thick and large while still maintaining a good cooked consistency, as sometimes it gets too doughy, and had decent seafood amount. ", "It also had a lot more egginess to it than usual which I thought was a good thing, and it just tasted really good with the sauce. ", "The dolsot bibimbap was colorful and had a lot of veggies; my only complaints would be for the carrots that were cut too long and thick, and for the bowl that was not hot enough to make the rice as crispy as it could have been. "], "author": "Amy Y.", "review": "This is a very small and homely restaurant, something I'd expect to eat if I ever went to my imaginary Korean aunt's house. The portions are large and the flavors are not trying to knock my tastebuds out of the park - I normally drink multiple glasses of water when dining out, but I didn't even need a sip until the end of my meal, so it seems like it's a lot less sodium-laden than restaurants these days!\n\nUnfortunately a couple of the items did need a little more flavor. This place seems to be known for their yangnyem tongdak, the \"deep fried chicken with house special sauce\", which excessively confuses me unless \"house special sauce\" meant \"no sauce\". The chicken tasted like robust fried chicken (only crunchy in a few spots, and tougher skin) with no seasoning, and although it was a bit tender and okay to eat, just seems confusing or lackluster with no taste. On the bright side, there was a buttload of chicken - pretty much a full silver platter full of it - and it was very filling, so yay leftovers!\n\nThe soft tofu stew had plentiful nice, soft, silky tofu, but was bland. However, it came on the house and was a nice gesture and well appreciated and enjoyed. I thought the banchan was tasty and seemed fresh and juicy - they had a total of seven which included bean sprouts, cucumber, fishcake, Japanese pickled daikon with some chili powder, some type of shriveled black beans, kimchi, and the white Korean pickled radish. The haemul pajeon came with a yummy red-hued dipping sauce, with a lot more scallions and chili powder in it than I'm used to being served - although it wasn't spicy. The seafood pancake itself was very thick and large while still maintaining a good cooked consistency, as sometimes it gets too doughy, and had decent seafood amount. It also had a lot more egginess to it than usual which I thought was a good thing, and it just tasted really good with the sauce. The dolsot bibimbap was colorful and had a lot of veggies; my only complaints would be for the carrots that were cut too long and thick, and for the bowl that was not hot enough to make the rice as crispy as it could have been. Finally, we had the japchae which uses skinnier noodles but had good flavor, was not too sticky and not too wet, and had delicious chewy warm texture.\n\nThis place would get a solid three and a half stars from me, mostly rounded down due to the blandness of some items. This would be a good place for lunch as their lunch menu is very well priced and is observed even on Saturdays, however it is only for takeout. I really enjoyed dining here and would revisit for the quantity and wholesomeness of the food!", "rating": 3, "date": "2017-05-31"}, {"excerpts": ["I love the soft tofu stew and seafood pancake.\n", "It is really delicious.\n", "I have eaten many times.^^"], "author": "Kelly C.", "review": "I love the soft tofu stew and seafood pancake.\nIt is really delicious.\nI have eaten many times.^^", "rating": 5, "date": "2013-04-28"}, {"excerpts": ["They give you free soft tofu stew which was really good.  ", "I don't eat super spicy food, and the stew had just the right amount of spice ", "so I wasn't breathing fire.  ", "I would highly recommend the sea bass.  ", "Doesn't look like much when you see it.(Me:  ", "\"", "What's that pile of bean sprouts??\")  ", "It was cooked perfectly....nice and tender.... and not too spicy.   "], "author": "Patra I.", "review": "I had just flown back from LA, and I was huuuuungry.  My friend suggested we go to this Korean restaurant on Taraval.  Me:  \"There's a Korean restaurant on Taraval????\"  I guess I've never noticed it.\n\nWe got there just in time to get one of the last two tables.  There's not much room to wait inside, so if you really want to eat there, be prepared to wait out in the freezing cold.\n\nWe ordered the Kal Bi and the Sea Bass Jjim( http://static.px.yelp.com/bphoto/94lDGx10qotEjBM2acJXmg/l ).  My eyes were bigger than my stomach, so I had to throw in an order of their pan fried pot stickers.  I was warned that it would be too much food, but of course, I didn't listen.   \n\nThey give you free soft tofu stew which was really good.  I don't eat super spicy food, and the stew had just the right amount of spice so I wasn't breathing fire.  I would highly recommend the sea bass.  Doesn't look like much when you see it.(Me:  \"What's that pile of bean sprouts??\")  It was cooked perfectly....nice and tender.... and not too spicy.   The kal bi was just ok.  My friend said it was better the last time he came, but still good.  We almost forgot about the pot stickers because they came out last.  We were already getting full, but after trying one, we ended up devouring the whole plate!  They were fried to perfection....nice and juicy on the inside, and crispy on the outside!\n\nYou will come out smelling like Korean BBQ, so make sure you bring Febreeze if you're headed out to a club afterwards.  =)", "rating": 4, "date": "2008-12-21"}, {"excerpts": ["We ordered the Jap Chae, Kal Bi (short ribs), Soft Tofu Stew, and the Chicken Teriyaki. ", "They were all amazing! ", "2 of my friends never had jap chae before and they couldn't stop raving about it! ", "I've ordered jap chae before at other places ", "but i don't remember it tasting that great. ", "The kal bi and chicken teriyaki were superb! ", "I'm usually not huge fan of meat but this was delicious. ", "The place is nice and clean. ", "They also give a lot of side dishes that accompany the meals, and we took some home because it was too much. ", "We also received a free fish because my friends knew of the owners! "], "author": "Vicki L.", "review": "This is the 2nd Korean restaurant I've been to in SF and it's the best, so far! We ordered the Jap Chae, Kal Bi (short ribs), Soft Tofu Stew, and the Chicken Teriyaki. They were all amazing! 2 of my friends never had jap chae before and they couldn't stop raving about it! I've ordered jap chae before at other places but i don't remember it tasting that great. The kal bi and chicken teriyaki were superb! I'm usually not huge fan of meat but this was delicious. The place is nice and clean. They also give a lot of side dishes that accompany the meals, and we took some home because it was too much. We also received a free fish because my friends knew of the owners! Price is $10+. \n\nMy rice tea spilled on the table twice.. i think the tables are crooked o.O", "rating": 5, "date": "2009-02-14"}, {"excerpts": ["We also enjoyed the soft tofu stew, which was spicy but more mild than its bright red color promised. "], "author": "Tara M.", "review": "I love this place. I've only been once, but I'll be back. Shin Toe Bul Yi offers delicious Korean food at excellent prices with no frills. You'd never notice this restaurant if you were driving by on Taraval, seeking a promising-looking place to eat. And the decor inside is equally basic. Hip it ain't.\n\nWe enjoyed the green onion pancake to start, which was accompanied by a less-spicy-than-you'd-think red dipping sauce. Next up were the small dishes of banchan. The fried chicken was great -- fresh out of the fryer, moist, full of flavor. We also enjoyed the soft tofu stew, which was spicy but more mild than its bright red color promised. Finally, we had a plate of the bulgogi, along with servings of rice. We waaay over-ordered and had plenty of food to take home. Excellent!", "rating": 4, "date": "2007-05-19"}, {"excerpts": ["Soft tofu stew - ", "the tofu was great, and definitely soft.  "], "author": "Jenny L.", "review": "Fried Chicken - tender, juicy, great texture, but where's the flavor?  I don't understand all the rave about it.  Maybe I was spoiled from San Tung.\n\nJap chae - definitely full of MSG, but at least it wasn't as salty as the last time I had it there.  We could actually finish the whole dish this time.\n\nBulgogi - once again, where's the flavor?  The color also looks quite dull, like the meat's been sitting out for hours unattended like a sad little child.\n\nSoft tofu stew - the tofu was great, and definitely soft.  The soup was okay, too.\n\n+ for front door parking.\n+ for excellent service.\n+ for all the extra side dishes that we asked for.", "rating": 3, "date": "2008-12-11"}, {"excerpts": ["I went there with my family today and tried the soft tofu stew with seafood. ", "It has soft tofu, clams, octopus, and a red soup stock that looks really spicy, but it isn't. ", "You can taste a hint of spiciness, but overall, it is really tasty. ", "If you don't like seafood, you can always get the plain soft tofu stew. ", "It's good as well. "], "author": "Kay T.", "review": "If you want great tasting Korean food, go here! I recommend getting here before 6pm. Any time after that, the place tends to get crowded and you'll find yourself waiting around. Don't forget to sign in on the waiting list if the place is crowded. The list is hanging on the far end, near the cash register. I go here every now and then. Every time I go, the food is always excellent. \n\nNo matter what you decide to order, you get a free green onion pancake as your appetizer. It is really tasty with the red sauce. Also, you get free mini appetizers as well (some kim chee, tofu, pickled cucumber, takuan, etc). \n\nI went there with my family today and tried the soft tofu stew with seafood. It has soft tofu, clams, octopus, and a red soup stock that looks really spicy, but it isn't. You can taste a hint of spiciness, but overall, it is really tasty. If you don't like seafood, you can always get the plain soft tofu stew. It's good as well. Also, if you order soup, you get a free fillet of broiled mackerel. \n\nThe mackerel comes with a slice of lemon and is broiled to perfection. Crispy on the outside, warm and flaky on the inside. It practically melts in your mouth. \n\nWe also got a seafood rice bowl. It comes in a stone pot that's still sizzling when it gets to your table. There are bits of squid, clams, kamaboko (fish cake), a raw egg in the center, etc, all over rice. just stir it up (adding the sauce is optional) and eat it up! Also, we tried a new dish that has calamari, vegetables, and noodles in a spicy sauce. Again, it looks spicy like the red tofu soup, but when I tried the calamari, it had a slightly sweet, yet savory taste. Very delicious. \n\nOverall, you can tell that the food here is fresh and of good quality.\n\nThe fact that so many people show up at this restaurant everyday is a sure sign that they're doing something right over there! If you haven't gone already, I highly recommend going here at least once! five stars!", "rating": 5, "date": "2007-12-29"}, {"excerpts": ["Staples that we always order are the soft tofu stew, bul go gi", ", pork bul go gi, chicken teriyaki, and jap chae. ", "I have to admit though", ", the jap chae has gotten a bit less tasty and more oily over the past year. ", "But, seriously, best soft tofu stew."], "author": "Tiff L.", "review": "I love this place. I really do. The service isn't the best. But theirs is the only food that satisfies my Korean cravings. If I go anywhere else, I just wish that I came here. Staples that we always order are the soft tofu stew, bul go gi, pork bul go gi, chicken teriyaki, and jap chae. I have to admit though, the jap chae has gotten a bit less tasty and more oily over the past year. But, seriously, best soft tofu stew.", "rating": 5, "date": "2008-01-07"}], "soft tofu with assorted seafood stew": [], "soft tofu with beef stew": [{"excerpts": ["My favorites were the Sogogi Sundobu ( Soft tofu with beef stew) and the fried chicken. ", "Don't be scared by the color of the stew. ", "It looks spicy but it really isn't. ", "It has fantastic flavor."], "author": "Jena L.", "review": "My favorites were the Sogogi Sundobu ( Soft tofu with beef stew) and the fried chicken. Don't be scared by the color of the stew. It looks spicy but it really isn't. It has fantastic flavor.", "rating": 5, "date": "2017-08-01"}, {"excerpts": ["Korean Green Onion Pancake ($8.99), \nKalbi=beef short rib ($18.99), \ncalamari bok-um=sauteed calamari/veggies/noodles ($11.99), \nsoft tofu with beef stew ($9.99), \ncomplimentary fried mackerel, \nstandard small plates of side dishes, \nalong with a bottle of so ju ($10.00). \n", "Almost finished everything because all the items were so good - even their tea. ", "As for the fried chicken, it was pretty good the last time we had it. "], "author": "Peter L.", "review": "Update: confirmed, Fridays are still busy, long wait-list even with reservations. So, try to go on another weekday, ey?\nJap-Chae=sauteed noodles (thin, clear) w/veggies/beef ($9.99)\nBul-go-gi=beef rib eye marinated ($18.99)\nsoft tofu w/assorted seafood ($9.99)\nchicken \"small\" pieces - \"little spicy\" (deep fried) ($10.99)\n\nOut of the way to get there, but worth the trip:\nKorean Green Onion Pancake ($8.99), \nKalbi=beef short rib ($18.99), \ncalamari bok-um=sauteed calamari/veggies/noodles ($11.99), \nsoft tofu with beef stew ($9.99), \ncomplimentary fried mackerel, \nstandard small plates of side dishes, \nalong with a bottle of so ju ($10.00). \nAlmost finished everything because all the items were so good - even their tea. As for the fried chicken, it was pretty good the last time we had it. There were probably four, or more, tables that ordered it while we were there.\n\nA repeater-place = good. Got there and there was no line at all - based on previous visits, a star just for that. Plus, another star for the easy to find parking. What's going on? Is it TTET* and people cannot go out as often? Will move this place ahead of Brother's for the fact you don't leave smelling all-KBBQed.", "rating": 4, "date": "2009-04-24"}], "tofu in soy bean paste": [], "tofu with shepherds purse in soy bean paste": [{"excerpts": ["Tofu with shepherds purse in soy bean paste. ", "\"", "Hayake\" is the term for ordering the soup or stew without the spiciness. "], "author": "aL Z.", "review": "Anyong haseyo...that's the Korean way of saying hi, hello, good morning, good afternoon, good evening...a general welcome. Shin Toe Bul Yi serves home made Korean cuisine that many Koreans and Korean Americans enjoy...a key indicator of authentic Korean food.\n\nThe moment you sit down, they serve you tea along with a pan-fried sticky rice scallion pancake, accompanied with a vinegar based chili green onion dipping sauce. The place offers the commonly found entrees like kalbee, beef and pork bulgogi, chap-che, tofu stew, meat or vegetable in sizzling stoneware pot, etc. \n\nHighlights of the place, however, are the unusual dishes. The crispy moist tasty deep fried chicken. Ne-jang-tang...a stew of pollack roe and cod intestines. Minuh-jigae...sea bass and vegetable in spicy stew. The pork and potato spicy stew. The Korean sausage soup. Tofu with shepherds purse in soy bean paste. \"Hayake\" is the term for ordering the soup or stew without the spiciness. It means white or plain non-spicy soup/stew.\n\nOther entrees worth trying are the sea bass jjim (steamed sea bass in house special sauce), sauted chicken gizzard and vegetables, and steamed skate wings or monk fish.\n\nAll entrees comes with six to eight panchan or small side dishes of pickled vegetables, along with a section of pan-fried mackerel. The entrees are substantial. Prices are very reasonable. Korean meals are best consumed with several cold bottles of soju (Chamisul or Sansoju brands).  Wee-ha-yo!", "rating": 4, "date": "2006-11-13"}], "assorted seafood and tofu in soy bean paste": [], "beef intestine noodles and vegetables in casserole": [], "seafood noodles and vegetables in casserole": [], "korean sausage with vegetable in beef broth": [], "vegetables bowl in sizzling stoneware pot": [], "soy bean sprout bowl in sizzling stoneware pot": [], "kimchee bowl in sizzling stoneware pot": [], "seafood bowl in sizzling stoneware pot": [], "sauteed vegetables beef and egg over rice": [], "broiled fresh water eel over rice": [], "japchae": [{"excerpts": ["We got an order of the famous fried chicken, an order of pork belly / sliced brisket, and an order of japchae. ", "The japchae was steaming hot and enjoyable as well.  "], "author": "Tiffany Y.", "review": "I came here last week for dinner on a Saturday.  We came around 6pm and were super lucky to be seated right away,  the restaurant is small and doesn't seat many people. \n\nThe menu has plenty of options but since my friends came frequently they ordered for us.  We got an order of the famous fried chicken, an order of pork belly / sliced brisket, and an order of japchae. They serve complimentary soondubu!!!!! \n\nThe fried chicken here, has a nice crispy non flaky breading.  It is super tender inside and the portion was very large.  The japchae was steaming hot and enjoyable as well.  I wish they provided more banchan such as the rice paper. \n\nSuper friendly and the waitresses dont speak much english.  Soondubu tasted similar to the one i had in korea.  Total was $100 including a bottle of soju and large bottle of beer!! Not bad for 4 ppl.", "rating": 4, "date": "2018-01-19"}, {"excerpts": ["Had the seafood pancake, japchae, fried chicken, and tofu soup. ", "Everything was flavorful and had just enough spice to keep you eating. ", "This is a very popular local Korean restaurant and for good reason.  ", "Most of their dishes are fairly priced and tasty."], "author": "Moore G.", "review": "Great tasting authentic Korean food. So far my go to place for Korean food in the Sunset District. Had the seafood pancake, japchae, fried chicken, and tofu soup. Everything was flavorful and had just enough spice to keep you eating. This is a very popular local Korean restaurant and for good reason.  Most of their dishes are fairly priced and tasty.", "rating": 4, "date": "2017-10-24"}, {"excerpts": ["Had the seafood pancake, japchae, fried chicken, and tofu soup. ", "Everything was flavorful and had just enough spice to keep you eating. ", "Staff was friendly and checked up on us."], "author": "Allen L.", "review": "So far my go to place for Korean food in the Sunset District. Had the seafood pancake, japchae, fried chicken, and tofu soup. Everything was flavorful and had just enough spice to keep you eating. Staff was friendly and checked up on us.", "rating": 4, "date": "2017-07-13"}, {"excerpts": ["Ordered Bulgogi and japchae. ", "The $22.50 bulgogi was dry, bland and tasted burnt. ", "The japchae was also bland, the vegetables undercooked, and had poorly chosen cuts of meat. ", "Had high hopes since it has a 4 star rating, but was thoroughly disappointed."], "author": "Nikko V.", "review": "Overpriced and for no reason. Ordered Bulgogi and japchae. The $22.50 bulgogi was dry, bland and tasted burnt. The japchae was also bland, the vegetables undercooked, and had poorly chosen cuts of meat. Had high hopes since it has a 4 star rating, but was thoroughly disappointed.", "rating": 1, "date": "2018-05-26"}, {"excerpts": ["Finally, we had the japchae which uses skinnier noodles but had good flavor, was not too sticky and not too wet, and had delicious chewy warm texture.\n\n"], "author": "Amy Y.", "review": "This is a very small and homely restaurant, something I'd expect to eat if I ever went to my imaginary Korean aunt's house. The portions are large and the flavors are not trying to knock my tastebuds out of the park - I normally drink multiple glasses of water when dining out, but I didn't even need a sip until the end of my meal, so it seems like it's a lot less sodium-laden than restaurants these days!\n\nUnfortunately a couple of the items did need a little more flavor. This place seems to be known for their yangnyem tongdak, the \"deep fried chicken with house special sauce\", which excessively confuses me unless \"house special sauce\" meant \"no sauce\". The chicken tasted like robust fried chicken (only crunchy in a few spots, and tougher skin) with no seasoning, and although it was a bit tender and okay to eat, just seems confusing or lackluster with no taste. On the bright side, there was a buttload of chicken - pretty much a full silver platter full of it - and it was very filling, so yay leftovers!\n\nThe soft tofu stew had plentiful nice, soft, silky tofu, but was bland. However, it came on the house and was a nice gesture and well appreciated and enjoyed. I thought the banchan was tasty and seemed fresh and juicy - they had a total of seven which included bean sprouts, cucumber, fishcake, Japanese pickled daikon with some chili powder, some type of shriveled black beans, kimchi, and the white Korean pickled radish. The haemul pajeon came with a yummy red-hued dipping sauce, with a lot more scallions and chili powder in it than I'm used to being served - although it wasn't spicy. The seafood pancake itself was very thick and large while still maintaining a good cooked consistency, as sometimes it gets too doughy, and had decent seafood amount. It also had a lot more egginess to it than usual which I thought was a good thing, and it just tasted really good with the sauce. The dolsot bibimbap was colorful and had a lot of veggies; my only complaints would be for the carrots that were cut too long and thick, and for the bowl that was not hot enough to make the rice as crispy as it could have been. Finally, we had the japchae which uses skinnier noodles but had good flavor, was not too sticky and not too wet, and had delicious chewy warm texture.\n\nThis place would get a solid three and a half stars from me, mostly rounded down due to the blandness of some items. This would be a good place for lunch as their lunch menu is very well priced and is observed even on Saturdays, however it is only for takeout. I really enjoyed dining here and would revisit for the quantity and wholesomeness of the food!", "rating": 3, "date": "2017-05-31"}, {"excerpts": ["I am less enthused by the japchae, Korean-style glass noodles, which are a bit too oily for my liking.  "], "author": "Kevin W.", "review": "I consider this Parkside restaurant a gem.  There is nearly always a line, which i believe speaks more to the quality of the food than the speed of service which, admittedly, could be slow at times.  In any case, the food is well worth the wait.  My wife and I have introduced family and friends to the place, and they have quickly become regulars.\n\nAs other reviewers have mentioned, the Korean-style fried chicken is a must order.  The crust is perfectly crisp with just the right amount of salt and spice, and the meat tender and juicy without being greasy.  The mackerel is outstanding - grilled to a slight crisp on the outside, but tender, moist and flavorful inside.  Best of all, it comes with a free side of mild-to-spicy tofu soup, which our kids love.  I am less enthused by the japchae, Korean-style glass noodles, which are a bit too oily for my liking.  An added plus is they will give you a pitcher of water so you can refill your own cup whenever you'd like.\n\nSo, go expecting a line and go expecting great food.  But just go.", "rating": 5, "date": "2015-01-01"}, {"excerpts": ["My favorite dish to order is the Japchae - sauteed noodles with vegetables and beef and the Haemul Pageon - Korean style pancake with scallions and mixed seafood. ", "The Japchae has this sweet and salty taste to it that I love! ", "One of the reasons why I love kettle corn. ", "There wasn't a lot of beef in it. ", "I don't remember even eating any. ", "The silver noodles were really good. "], "author": "Janny S.", "review": "My favorite dish to order is the Japchae - sauteed noodles with vegetables and beef and the Haemul Pageon - Korean style pancake with scallions and mixed seafood. The Japchae has this sweet and salty taste to it that I love! One of the reasons why I love kettle corn. There wasn't a lot of beef in it. I don't remember even eating any. The silver noodles were really good. Korean seafood pancake was hot, crispy and filled with calamari and shrimp! Its served with their special spicy sauce, I wish they gave us more of it because it was enough for only half the pancake. Other things we ordered was he fried chicken and soft tofu soup with seafood. The fried chicken was not so good because it tasted dry and bland. The tofu soup was not piping hot like what I'm used to. My family and I came on a Thursday night for dinner and there was only 1 waitress taking orders, serving, and busing the tables. Though the place is small, it can get really busy! I think this place serves more traditional Korean food and has a lot to offer on their menu. I think maybe lack of staffing can cause the quality to go down. Also, the ventilation is poor so you will smell like Korean BBQ when you leave! So keep the nice clothes at home!", "rating": 3, "date": "2014-08-22"}, {"excerpts": ["Food : 5 stars in my opinion (our favorite battered fried chicken, japchae( Korean clear noodle), Bulgogi (spicy pork), Plain Korean Pancake "], "author": "Agustino B.", "review": "Year of 1999, I was fresh off the boat from South East Asian, lived with my sister on 32nd Taraval Avenue. She took me for dinner @ Shin Toe Bul Yi. It was the 1st time I tried Korean food and fell in love with it. (The best korean food in my own opinion in the Bay Areas)\n\nMoving Forward, year 2015 have my own family. Going to Shin Toe Bul Yi always a treat for us. We love and enjoy the food so much, my older one (3 Years old) Love the fried chicken.\n\nFood : 5 stars in my opinion (our favorite battered fried chicken, japchae( Korean clear noodle), Bulgogi (spicy pork), Plain Korean Pancake (Damn it, I am drooling now), Spicy tofu soup (Its on the house WOOHOO), Korean spicy ricestick with octopus, and the Mackerel fish.\n\nParking : Little bit hard (Street Parking)\n\nService : The waiter is friendly and she will notify you that most of the foods are extremely hot. (she would remind people with the kids be cautious with the hot foods), She's fast worker and really responsive) 5 stars with the service.\n\nThis place is always pack, expect waiting for at least 20 minutes during weekend especially dinner time. (But trust me it's worth the wait). \n\n My Tips : Beat the crowd by come during early lunch or early dinner.", "rating": 5, "date": "2015-11-04"}, {"excerpts": ["Japchae had a lot of vegetables. ", "But I wished it had more noodles too. \n"], "author": "Kathryn H.", "review": "Sides are awesome!\nJapchae had a lot of vegetables. But I wished it had more noodles too. \nBulgogi was very render and the flavors are mild but very satisfying.\nMore expensive that the Korean food we normally order but I don't mind because the food is really top notch!", "rating": 5, "date": "2014-07-03"}, {"excerpts": ["We had the bulgolgi, seafood pancake, fried chicken, and the japchae. ", "Probably way too much food for 3 adults and a toddler, but everything looked so good", ", we couldn't decide. ", "We had plenty of food to take home. ", "They even comped us a free soup. ", "I'd recommended getting here early as the place is small and fills up. ", "Friendly wait staff."], "author": "T T.", "review": "We parked about a block away and could smell the delicious food. We had the bulgolgi, seafood pancake, fried chicken, and the japchae. Probably way too much food for 3 adults and a toddler, but everything looked so good, we couldn't decide. We had plenty of food to take home. They even comped us a free soup. I'd recommended getting here early as the place is small and fills up. Friendly wait staff.", "rating": 4, "date": "2016-02-13"}, {"excerpts": ["Likes: japchae noodles, complimentary fish yum, six side dishes and rice with beef tofu soup.\n\n", "japchae was good but on the oily side because it was oily on the bottom of the plate."], "author": "Karen M.", "review": "Likes: japchae noodles, complimentary fish yum, six side dishes and rice with beef tofu soup.\n\nDislikes:  japchae was good but on the oily side because it was oily on the bottom of the plate.", "rating": 3, "date": "2011-07-24"}, {"excerpts": ["I tried the Japchae, Tteokbokki, Kalbi, and their Fried Chicken. ", "I think the Japchae was pretty good, has enough flavor ", "but I wish it had a bit more meat in it. ", "The Tteokbokki is really good too, although not as spicy as I expected, at least they gave us a lot of peices of tteokbokki unlike this other korean restaurant ", "i went to (not saying the name, but u can find it if u read my other reviews.) ", "The Kalbi had good flavor and was cooked very well, but pricey for the amount they gave us... either that or the guys ate it so fast that I didn't realize it... ", "I really like the fried chicken. ", "The outside was crispy and easy to bite into (unlike some fried chicken where the outside is like a shell) and the chicken was cooked perfectly and juicy too. ", "Soooo yummy! ", "loved the flavor of it too, although I would prefer a little bit more flavor."], "author": "Alicia W.", "review": "One of the better Korean restaurants in San Francisco. They have a pretty wide selection of food to choose from and you can always ask them to help you change something and they would gladly do it. The service here is descent. The waitress is nice, but when it gets busy, it takes awhile to get her attention.\n\nI tried the Japchae, Tteokbokki, Kalbi, and their Fried Chicken. I think the Japchae was pretty good, has enough flavor but I wish it had a bit more meat in it. The Tteokbokki is really good too, although not as spicy as I expected, at least they gave us a lot of peices of tteokbokki unlike this other korean restaurant i went to (not saying the name, but u can find it if u read my other reviews.) The Kalbi had good flavor and was cooked very well, but pricey for the amount they gave us... either that or the guys ate it so fast that I didn't realize it... I really like the fried chicken. The outside was crispy and easy to bite into (unlike some fried chicken where the outside is like a shell) and the chicken was cooked perfectly and juicy too. Soooo yummy! loved the flavor of it too, although I would prefer a little bit more flavor.", "rating": 4, "date": "2010-08-11"}, {"excerpts": ["We ordered the spicy rice cake (dduk bokki?), fried chicken, soondoonboo, and japchae.  ", "this place has one of the best spicy rice cake (dduk bokki?) ", "I've had so far.  ", "The japchae was normal, tasty as always, not too oily.  ", "The soondoonboo was somewhat too salty for me and not spicy enough.  ", "But i'm a huge fan of the soup so unless it's horrendous to eat"], "author": "Christina D.", "review": "This place has its pros and cons, although I am no Korean food connoisseur, so this is just my personal taste.  and apart from my most recent visit about a week ago, I haven't gone in over 2 years before that, so it might not be exactly the same anymore.  \n\nIts appetizers are great.  along with the little plates that they give, they also serve grilled mackerel to every table, and they used to have free pancake but I didn't get it last time, so perhaps they've stopped. We ordered the spicy rice cake (dduk bokki?), fried chicken, soondoonboo, and japchae.  this place has one of the best spicy rice cake (dduk bokki?) I've had so far.  It's not too spicy (in fact it can be much spicier), but it has a good blend of sweetness to it that's to my liking.  \n\nI know everyone RAVES about the fried chicken, but really, it's very typical to me, nothing to write home about.  I think they might use a bit of corn starch or whatever because the fried texture is a little different.  but it's relatively bland with no special flavor.  I actually enjoy it quite a bit, but it's just not as special as other people said it is.\n\nThe japchae was normal, tasty as always, not too oily.  The soondoonboo was somewhat too salty for me and not spicy enough.  But i'm a huge fan of the soup so unless it's horrendous to eat, I'll love it no matter what.\n\nOther things I've tried in years past, bbq chicken, kalbi, bbq beef, bbq pork, bibimbop.  From what I remember, the taste was slightly off from other places I've tried before (I guess depending on your preference..this might be better or not).  The kalbi is cut differently from most places, it has one large bone with some meat around instead of cutting deep into the bone if that makes sense.  And nothing's too spicy.\n\nWhile the prices are pretty competitive with the other Korean places, the meat is somewhat on the pricier side ($14-19).   And the wait can be long, and it's small, so you'll definitely come out smelling like your food.  \n\nRegardless, I still think it's one of the better Korean restaurants in SF, and I always have Korean cravings every now and then, so I'll definitely go back again.", "rating": 4, "date": "2008-05-01"}, {"excerpts": ["The #10 japchae, #66 haemul pageon (Korean style pancake and mixed seafood) and #67 yangnyeom tongdak (deep fried chicken served with house special sauce) ", "arrived at our table in large portions, and the #4 dolsot bibimbap (mixed vegetables, beef & egg over rice served in sizzling stoneware) and #6 kimchee bibimbap (sautéed kimchee, beef & egg over rice served in sizzling stoneware) in decent sizes bowls. ", "The seafood pancake was thick and I was only aware of it containing squid. ", "I added some chili sauce to the pancake to kick up the flavor. ", "The yangnyeom tongdak was an actual whole chicken that wasn't split along the natural joints, but it was still delicious! ", "Though the chicken was moist and supple and neither salty nor greasy, I did find meat near the bone to be very slightly pinkish, as if the heat barely penetrated the chicken."], "author": "Cliff W.", "review": "Celebrating my birthday at Shin Toe Bul Yi has expanded my joy for trying other ethnic cuisines. The friendly lady who served my family brought six banchan--kimchee, tofu, fish (perhaps sardines), pickled cucumber or zucchini, pickled radish, bean sprout--and tofu soup, which is similar to a mild hot-and-sour soup. The #10 japchae, #66 haemul pageon (Korean style pancake and mixed seafood) and #67 yangnyeom tongdak (deep fried chicken served with house special sauce) arrived at our table in large portions, and the #4 dolsot bibimbap (mixed vegetables, beef & egg over rice served in sizzling stoneware) and #6 kimchee bibimbap (sautéed kimchee, beef & egg over rice served in sizzling stoneware) in decent sizes bowls. The seafood pancake was thick and I was only aware of it containing squid. I added some chili sauce to the pancake to kick up the flavor. The yangnyeom tongdak was an actual whole chicken that wasn't split along the natural joints, but it was still delicious! Though the chicken was moist and supple and neither salty nor greasy, I did find meat near the bone to be very slightly pinkish, as if the heat barely penetrated the chicken.", "rating": 4, "date": "2012-03-10"}], "hand made noodles and vegetables in anchovy soup base": [], "spicy chewy noodles": [{"excerpts": ["We ordered the spicy pork and the spicy chewy noodles. ", "The spicy pork was good, but it still doesn't compare to Steve's BBQ in Berkeley though. ", "Avoid the spicy chewy noodles unless you like cold noodles drowned in hot sauce. "], "author": "crystal e.", "review": "My friend and I checked out this place a few days  ago. We ordered the spicy pork and the spicy chewy noodles. The spicy pork was good, but it still doesn't compare to Steve's BBQ in Berkeley though. Avoid the spicy chewy noodles unless you like cold noodles drowned in hot sauce. The side dishes and the tofu soup on the house  were yummy!\n\nIf anyone knows of any other Korean spots that serves great spicy pork, I'm always up for recommendations=)", "rating": 3, "date": "2008-10-03"}, {"excerpts": ["I also like their spicy chewy noodles - noodles with good texture and great octopus/calamari pieces, yumm!!\n", "One setback is that they are too popular, so on Fridays or Saturdays, they cut their waiting list at 8:50 or 9:00pm, even though they close at 9:30.  ", "Got turned away a couple times because I worked late on Fridays :(."], "author": "Vicky F.", "review": "Absolutely our fave Korean place - very homey, dishes are tasty.  My friend and I always crave for the Seabass soup - flavorful with good chucks of seabass in it.  Hubby likes the Korean-fried chicken - they are fried well and not too greasy, plus flavorful.  I also like the meats - good Kal bi and chicken teriyaki.  I also like their spicy chewy noodles - noodles with good texture and great octopus/calamari pieces, yumm!!\nOne setback is that they are too popular, so on Fridays or Saturdays, they cut their waiting list at 8:50 or 9:00pm, even though they close at 9:30.  Got turned away a couple times because I worked late on Fridays :(.", "rating": 4, "date": "2008-02-03"}], "seafood udon": [{"excerpts": ["We ordered:\n tofu stew shepherd's purse/miso soup\ndol sot bibimbap\nseafood udon noodle soup\nBulgogi (beef)\nbroiled mackerel was on the house\n\n", "Sizzling iron plate that held the bulgogi also did not get hot enough (either that, or the meat was too wet). "], "author": "Jana C.", "review": "I so wanted to give this Korean rest. in Parkside a 4 or higher rating for their dinner service; I just can't do it. \n\nLast night there was a party of 4 who frequented this place for the first time, having made the decision based from the former yelp reviews. Honestly, nothing worked well with this dinner; strong nod from the Korean friend from Pusan who said that she would not come back for a repeat visit. Sadly, I must agree with her. \n\nPanchan was perfunctory; nothing exceptionally tasty, crunchy, pickled, or peppered. My heart was already sinking once those little appetizer plates were brought out. \n\nWe ordered:\n tofu stew shepherd's purse/miso soup\ndol sot bibimbap\nseafood udon noodle soup\nBulgogi (beef)\nbroiled mackerel was on the house\n\nThe tofu soup was just ok. the tofu wasn't the silken variety, which was fine. but the soup was altogether more like 'add miso paste, then add water'. My heart sank\n\nThe bibimbap: the black stoneware pot was not heated up hot enough to brown and 'crunchify' the rice beneath. In fact, the egg that sat in the middle didn't 'cook' properly when mixed together, because nothing inside was hot enough to cook it to keep from getting wet and gummy. Another dud!\n\nSizzling iron plate that held the bulgogi also did not get hot enough (either that, or the meat was too wet). That grilled flavor was just in absentio and we all looked at one another, silently, kind of like \"How can every dish be so 'meh' after the yelp reviews?\"\n\nThe lady server was so polite and kind. She was generous in gifting us with the fish (no matter how many times i eat mackerel, I deem it too fishy of a fish)... I honestly did want to rate them higher than I can actually do...\n\nFrankly, I wouldn't recommend anyone driving specifically to Parkside (Taraval) for Korean here.... if you did, you'd get a much more satisfying experience at Kingdom Dumpling just east, up the street, or perhaps Korean on Noriega?", "rating": 3, "date": "2010-02-17"}], "yellow croaker gui": [], "mackerel gui": [], "fresh water eel gui": [], "mussel gui": [], "calamari bokum": [{"excerpts": ["the bulgogi and calamari bokum was alright.  ", "the calamari tasted a little fishy for me (one of my favoritest dishes in the world is ojineh bokum ", "and it's never been fishy anywhere else!).  ", "also, it wasn't as spicy as how I've had it at other places such as To Hyang on 2nd and Geary.  ", "I didn't try to jap chae but it seem a bit dry.  ", "The rice itself was mushy too. ", ":/  ", "The highlight was, they did give us a free bowl of tofu soup.  ", "Nothing to write home to mom about.  "], "author": "Sally T.", "review": "My boyfriend and I met his mom here for dinner recently and before the day arrived, all my boyfriend could talk about was their fried chicken.  I thought  this must be some good chicken and expected it to be spectacular.\n\nWe ordered the chicken, jap chae, bulgogi and calamari bukum.  The chicken was pieces of chicken cut up, battered, and deep fried.  the menu mentioned it was a little spicy and i tasted nothing.  the chicken was pretty bland all together.  the bulgogi and calamari bokum was alright.  the calamari tasted a little fishy for me (one of my favoritest dishes in the world is ojineh bokum and it's never been fishy anywhere else!).  also, it wasn't as spicy as how I've had it at other places such as To Hyang on 2nd and Geary.  I didn't try to jap chae but it seem a bit dry.  The rice itself was mushy too. :/  The highlight was, they did give us a free bowl of tofu soup.  Nothing to write home to mom about.  it was pretty much broth with chilli peppers and a block of tofu in it.\n\nWould I ever go back?  Maybe if i was in the area.  I live too close to To Hyang to cheat on it ever again!", "rating": 3, "date": "2010-02-08"}], "baby octopus bokum": [], "seafood bokum": [], "gopchang yang bokum": [], "rice cake bokyi": [], "bulgogi with calamari": [{"excerpts": ["We had the pork bulgogi and sauteed bulgogi with calamari.  ", "They were both sooooo good.  ", "The only bad thing is the side dishes were a little bland.  ", "The kimchee obviously need a little more time sitting in it's marinade.  ", "So minus one star for the side dishes.  ", "Also, scallion pancake and tofu stew were given to each table for free.  ", "Definitely will go back for another visit."], "author": "Heidi F.", "review": "The prices here is way cheaper than most other korean restaurant in SF.  Service is quick and friendly.  I went Friday night at 7:45 and waited about 10 minutes for a table.  There was a clipboard that you sign your name on to get a seat.  Only one party in front of us so the wait wasn't too bad.  By the time we finish, there was a crowd of people jamming the door waiting for  a table.  So my recommendation is to go early.  \n\nFood quality overall was above average.  We had the pork bulgogi and sauteed bulgogi with calamari.  They were both sooooo good.  The only bad thing is the side dishes were a little bland.  The kimchee obviously need a little more time sitting in it's marinade.  So minus one star for the side dishes.  Also, scallion pancake and tofu stew were given to each table for free.  Definitely will go back for another visit.", "rating": 4, "date": "2006-09-07"}], "chicken gizzard bokum": [], "sea bass jjim": [{"excerpts": ["We ordered the Kal Bi and the Sea Bass Jjim( http://static.px.yelp.com/bphoto/94lDGx10qotEjBM2acJXmg/l ).  ", "My eyes were bigger than my stomach, so I had to throw in an order of their pan fried pot stickers.  ", "I was warned that it would be too much food, ", "The kal bi was just ok.  ", "My friend said it was better the last time he came, but still good.  ", "We almost forgot about the pot stickers because they came out last.  ", "We were already getting full, but after trying one, we ended up devouring the whole plate!  "], "author": "Patra I.", "review": "I had just flown back from LA, and I was huuuuungry.  My friend suggested we go to this Korean restaurant on Taraval.  Me:  \"There's a Korean restaurant on Taraval????\"  I guess I've never noticed it.\n\nWe got there just in time to get one of the last two tables.  There's not much room to wait inside, so if you really want to eat there, be prepared to wait out in the freezing cold.\n\nWe ordered the Kal Bi and the Sea Bass Jjim( http://static.px.yelp.com/bphoto/94lDGx10qotEjBM2acJXmg/l ).  My eyes were bigger than my stomach, so I had to throw in an order of their pan fried pot stickers.  I was warned that it would be too much food, but of course, I didn't listen.   \n\nThey give you free soft tofu stew which was really good.  I don't eat super spicy food, and the stew had just the right amount of spice so I wasn't breathing fire.  I would highly recommend the sea bass.  Doesn't look like much when you see it.(Me:  \"What's that pile of bean sprouts??\")  It was cooked perfectly....nice and tender.... and not too spicy.   The kal bi was just ok.  My friend said it was better the last time he came, but still good.  We almost forgot about the pot stickers because they came out last.  We were already getting full, but after trying one, we ended up devouring the whole plate!  They were fried to perfection....nice and juicy on the inside, and crispy on the outside!\n\nYou will come out smelling like Korean BBQ, so make sure you bring Febreeze if you're headed out to a club afterwards.  =)", "rating": 4, "date": "2008-12-21"}, {"excerpts": ["are the sea bass jjim (steamed sea bass in house special sauce), sauted chicken gizzard and vegetables, and steamed skate wings or monk fish.\n\n"], "author": "aL Z.", "review": "Anyong haseyo...that's the Korean way of saying hi, hello, good morning, good afternoon, good evening...a general welcome. Shin Toe Bul Yi serves home made Korean cuisine that many Koreans and Korean Americans enjoy...a key indicator of authentic Korean food.\n\nThe moment you sit down, they serve you tea along with a pan-fried sticky rice scallion pancake, accompanied with a vinegar based chili green onion dipping sauce. The place offers the commonly found entrees like kalbee, beef and pork bulgogi, chap-che, tofu stew, meat or vegetable in sizzling stoneware pot, etc. \n\nHighlights of the place, however, are the unusual dishes. The crispy moist tasty deep fried chicken. Ne-jang-tang...a stew of pollack roe and cod intestines. Minuh-jigae...sea bass and vegetable in spicy stew. The pork and potato spicy stew. The Korean sausage soup. Tofu with shepherds purse in soy bean paste. \"Hayake\" is the term for ordering the soup or stew without the spiciness. It means white or plain non-spicy soup/stew.\n\nOther entrees worth trying are the sea bass jjim (steamed sea bass in house special sauce), sauted chicken gizzard and vegetables, and steamed skate wings or monk fish.\n\nAll entrees comes with six to eight panchan or small side dishes of pickled vegetables, along with a section of pan-fried mackerel. The entrees are substantial. Prices are very reasonable. Korean meals are best consumed with several cold bottles of soju (Chamisul or Sansoju brands).  Wee-ha-yo!", "rating": 4, "date": "2006-11-13"}], "silver cod jjim": [], "skate wing jjim": [], "monk fish jjim": [], "soft drinks  coke up": [], "beer  imported": [], "sake  japanese rice wine": [], "cold sake  korean rice wine": [], "so ju": [{"excerpts": ["Korean Green Onion Pancake ($8.99), \nKalbi=beef short rib ($18.99), \ncalamari bok-um=sauteed calamari/veggies/noodles ($11.99), \nsoft tofu with beef stew ($9.99), \ncomplimentary fried mackerel, \nstandard small plates of side dishes, \nalong with a bottle of so ju ($10.00). \n", "Almost finished everything because all the items were so good - even their tea. ", "As for the fried chicken, it was pretty good the last time we had it. "], "author": "Peter L.", "review": "Update: confirmed, Fridays are still busy, long wait-list even with reservations. So, try to go on another weekday, ey?\nJap-Chae=sauteed noodles (thin, clear) w/veggies/beef ($9.99)\nBul-go-gi=beef rib eye marinated ($18.99)\nsoft tofu w/assorted seafood ($9.99)\nchicken \"small\" pieces - \"little spicy\" (deep fried) ($10.99)\n\nOut of the way to get there, but worth the trip:\nKorean Green Onion Pancake ($8.99), \nKalbi=beef short rib ($18.99), \ncalamari bok-um=sauteed calamari/veggies/noodles ($11.99), \nsoft tofu with beef stew ($9.99), \ncomplimentary fried mackerel, \nstandard small plates of side dishes, \nalong with a bottle of so ju ($10.00). \nAlmost finished everything because all the items were so good - even their tea. As for the fried chicken, it was pretty good the last time we had it. There were probably four, or more, tables that ordered it while we were there.\n\nA repeater-place = good. Got there and there was no line at all - based on previous visits, a star just for that. Plus, another star for the easy to find parking. What's going on? Is it TTET* and people cannot go out as often? Will move this place ahead of Brother's for the fact you don't leave smelling all-KBBQed.", "rating": 4, "date": "2009-04-24"}], "kal bi": [{"excerpts": ["I suggest the, kal bi, fried chicken, jap chae, and bul go gi!\n\n"], "author": "James K.", "review": "Great food! I suggest the, kal bi, fried chicken, jap chae, and bul go gi!\n\nGreat service and fast. Would recommend anyone else to come try this place!", "rating": 5, "date": "2017-10-24"}, {"excerpts": ["We ordered the fried chickens, kal bi and calamari bok-um. ", "The kal bi was perfectly cooked, they were juicy and tender. ", "The fried chickens looked dry but they were actually very moist. ", "The calamari bok um, which was Sauteed calamari and vegetables in spicy sauce served with udon. ", "First bite, on the udon all I tasted was sweetness but as continued eating it got spicy. ", "But the dish was oily and the calamaris were chewy.  ", "The tofu soup was nice and the soup base was different compared to the other restaurants."], "author": "Stacy L.", "review": "This place either super pack or they are closed. Last weekend, finally got to try it.  My bf and I got there around 7pm. It was a perfect timing, no wait got seated right away. We ordered the fried chickens, kal bi and calamari bok-um. Also, we had a complimentary soft tofu soup. \n\nWe really enjoyed our meal. The kal bi was perfectly cooked, they were juicy and tender. The fried chickens looked dry but they were actually very moist. The calamari bok um, which was Sauteed calamari and vegetables in spicy sauce served with udon. First bite, on the udon all I tasted was sweetness but as continued eating it got spicy. But the dish was oily and the calamaris were chewy.  The tofu soup was nice and the soup base was different compared to the other restaurants.", "rating": 4, "date": "2013-08-05"}, {"excerpts": ["Kal bi (beef short ribs) - ", "Kim chee bibimbap - Served in a large stoneware pot and went well with the kal bi.  ", "It had a very mild flavor of kim chee.  "], "author": "Suzi K.", "review": "A solid 3 stars.  It's good eats but I needed a Korean food wow factor to add a star.\n\nThe exterior is kinda run-down and the interior is dated which causes a bit of skepticism in terms of food.  From personal experience, crappy looking places tend to have delicious food.  This joint is a prime example.\n\nI've been here for dinner a few times and it's usually packed.  If you need to wait, it'll most likely be for 15-30 minutes.  The waitresses are friendly and are on top of things, even with a packed house.  \n\nThe food...\nKal bi (beef short ribs) - Nicely grilled big pieces of meat that were juicy and tender.\n\nKim chee bibimbap - Served in a large stoneware pot and went well with the kal bi.  It had a very mild flavor of kim chee.  I liked how the hot pot made some of the rice a bit crunchy, which provided a contrast in texture of the rice.\n\nFried chicken - I know a lot of people like this dish but I've had it a few times and it doesn't impress me.  There's too much batter and the chicken is on the dry side.  I'd pass on this next time around.  \n\nSoups/stews - I tried a couple but can't remember the names.  All I remember is that it was served in a big pot, had lots of spicy flavors, and it was good on a cold day.\n\nEating at a restaurant like this is hard because you want to try a lot of things but the portions are big and you don't want to order too much.  If anything, you can take home leftovers (which is always the case) and you'll have lunch for the next day (or two).", "rating": 3, "date": "2012-12-26"}, {"excerpts": ["We ordered the Kal Bi and the Sea Bass Jjim( http://static.px.yelp.com/bphoto/94lDGx10qotEjBM2acJXmg/l ).  ", "My eyes were bigger than my stomach, so I had to throw in an order of their pan fried pot stickers.  ", "I was warned that it would be too much food, ", "The kal bi was just ok.  ", "My friend said it was better the last time he came, but still good.  ", "We almost forgot about the pot stickers because they came out last.  ", "We were already getting full, but after trying one, we ended up devouring the whole plate!  "], "author": "Patra I.", "review": "I had just flown back from LA, and I was huuuuungry.  My friend suggested we go to this Korean restaurant on Taraval.  Me:  \"There's a Korean restaurant on Taraval????\"  I guess I've never noticed it.\n\nWe got there just in time to get one of the last two tables.  There's not much room to wait inside, so if you really want to eat there, be prepared to wait out in the freezing cold.\n\nWe ordered the Kal Bi and the Sea Bass Jjim( http://static.px.yelp.com/bphoto/94lDGx10qotEjBM2acJXmg/l ).  My eyes were bigger than my stomach, so I had to throw in an order of their pan fried pot stickers.  I was warned that it would be too much food, but of course, I didn't listen.   \n\nThey give you free soft tofu stew which was really good.  I don't eat super spicy food, and the stew had just the right amount of spice so I wasn't breathing fire.  I would highly recommend the sea bass.  Doesn't look like much when you see it.(Me:  \"What's that pile of bean sprouts??\")  It was cooked perfectly....nice and tender.... and not too spicy.   The kal bi was just ok.  My friend said it was better the last time he came, but still good.  We almost forgot about the pot stickers because they came out last.  We were already getting full, but after trying one, we ended up devouring the whole plate!  They were fried to perfection....nice and juicy on the inside, and crispy on the outside!\n\nYou will come out smelling like Korean BBQ, so make sure you bring Febreeze if you're headed out to a club afterwards.  =)", "rating": 4, "date": "2008-12-21"}, {"excerpts": ["We ordered the Jap Chae, Kal Bi (short ribs), Soft Tofu Stew, and the Chicken Teriyaki. ", "They were all amazing! ", "2 of my friends never had jap chae before and they couldn't stop raving about it! ", "I've ordered jap chae before at other places ", "but i don't remember it tasting that great. ", "The kal bi and chicken teriyaki were superb! ", "I'm usually not huge fan of meat but this was delicious. ", "The place is nice and clean. ", "They also give a lot of side dishes that accompany the meals, and we took some home because it was too much. ", "We also received a free fish because my friends knew of the owners! "], "author": "Vicki L.", "review": "This is the 2nd Korean restaurant I've been to in SF and it's the best, so far! We ordered the Jap Chae, Kal Bi (short ribs), Soft Tofu Stew, and the Chicken Teriyaki. They were all amazing! 2 of my friends never had jap chae before and they couldn't stop raving about it! I've ordered jap chae before at other places but i don't remember it tasting that great. The kal bi and chicken teriyaki were superb! I'm usually not huge fan of meat but this was delicious. The place is nice and clean. They also give a lot of side dishes that accompany the meals, and we took some home because it was too much. We also received a free fish because my friends knew of the owners! Price is $10+. \n\nMy rice tea spilled on the table twice.. i think the tables are crooked o.O", "rating": 5, "date": "2009-02-14"}, {"excerpts": ["and the fried chicken\ntasty tofu soup, kal bi...\nplus seafood pancake!\n\n"], "author": "stevie b.", "review": "shin toe bul yi, yes:\na personal favorite\nmuch unlike the rest\n\na korean feast\nis what my friends and I say,\none order - jap chae!\n\nand the fried chicken\ntasty tofu soup, kal bi...\nplus seafood pancake!\n\ncan be extremely \nbusy, be prepared to wait\n'tis worth it, damn straight.", "rating": 4, "date": "2012-09-22"}, {"excerpts": ["Kal Bi (beef short rib marinated in house special sauce) ", "- Koreans make some dang good short ribs. ", "I just love their marinade. ", "It's sweet, salty and spicy. ", "This Kal Bi was much meatier than other Korean short ribs. "], "author": "Sam L.", "review": "K lives just one block away from this place and every time we go in and out of his house, we smell their delicious Korean BBQ. I'm always conflicted when we're about to leave for another restaurant because I catch the smell of their juicy Kalbi ribs.\n\nThe scene:\n\nThe place gets super packed, but oddly enough, we got a table for 6 right away last time we came. Make sure you wear old clothes because you'll smell like Korean food when you leave.\n\nService is lacking, however. They turned me away once since I came at 9 and they closed at 9:30. They also forget to give you some of the free items such as the soup or the fried fish.\n\nThe food:\n\nWhat's great at Korean restaurants is the plethora of appetizers. You have the kimchi, pickled turnips, cucumbers, anchovies, fish cake, bean sprouts as well as kimchi tofu soup or a fried fish. I think the rule of thumb at this (and most) Korean restaurants is if you order soup, you get a fried fish; if you don't order soup, you get the house tofu soup.     Shin Toe Bul Yi does give seconds on the mini trays of appetizers - major plus in my book since I can't get enough of that fish cake.\n\nCalamari Bok (sautéed rice cake, calamari and vegetables in spicy sauce) - This is my faaaavorite dish at this restaurant. It's made with 4-5\" pieces of the chewy rice cake sautéed in a sweet and spicy sauce. I'm not big on calamari though, so I ate around it.\n\nPork Bul-Go-Gi (broiled lean pork marinated in spicy sauce) - This is K's favorite dish. The thin slices of pork are marinated in the same sweet and spicy sauce. The meat is very tender and has great flavor. The only thing that worries me about this dish is the bright red color; it doesn't seem natural.\n\nKal Bi (beef short rib marinated in house special sauce) - Koreans make some dang good short ribs. I just love their marinade. It's sweet, salty and spicy. This Kal Bi was much meatier than other Korean short ribs. Usually, a majority of the pieces are just fat and bones.\n\nChicken Small Pieces (deep fried) - Last but not least is the fried chicken - hands down, the most popular dish at the restaurant. It's not your typical fried chicken that you get at KFC or Popeyes. The chicken is very crispy. I'm pretty sure they use cornstarch rather than flour for their batter. The cornstarch brings the crunchiness to a whole other level. After the chicken has been deep fried, it's sprinkled with a spicy powder. One time I came here, we had a ton of chicken left over and I accidentally dropped 3 pieces on the floor when boxing it up. I was SO devastated!", "rating": 4, "date": "2010-04-19"}, {"excerpts": ["My favorite is the Kal Bi; for the lunch special it is a pretty good deal. ", "Kal Bi, Jap Chae, Kim Chee Bowl are all excellent. ", "My family goes crazy for the sea bass."], "author": "Audrey H.", "review": "This place is near my office so I can pick things up for lunch sometimes. It is out of the way and small and unimpressive looking but the food is great!\n\nThe decor/ambiance are utilitarian - not a great place for a first date unless you are both big time foodies. It often gets smokey from the grill and they try to keep the door open to vent the smoke, so it can be cold and smokey.\n\nMy favorite is the Kal Bi; for the lunch special it is a pretty good deal. They serve nice Kim Chee too (actually, all the little side dishes [ban chan?] are pretty darn good)\n\nFor dinner it can get a little bit spendy, but the portions are good sized and the food really is excellent.  It is usually crowded at dinner time. They seem to get a lot of families. \n\nAbout the Fried Chicken - honestly, I tried it a while back and didn't see what was so special. Maybe I went on an off night ; while it wasn't bad, it just was not special. No special flavoring or anything. However,it was cooked well.\n\nKal Bi, Jap Chae, Kim Chee Bowl are all excellent. My family goes crazy for the sea bass.", "rating": 5, "date": "2011-01-10"}, {"excerpts": ["I love their Kal Bi and their fried chicken is pretty decent.\n\n"], "author": "Shana W.", "review": "If you're willing to wait at least 30 minutes for a table, then this a place to check out for Korean food.   One of my favorite restaurants!!!  I love their Kal Bi and their fried chicken is pretty decent.\n\nDefintely will be back when I crave for Korean food.", "rating": 4, "date": "2009-09-14"}, {"excerpts": ["Kal bi is consistent, can't really go wrong with kal bi. \n\n"], "author": "Derrick L.", "review": "This place is one of my favorite neighborhood restaurants. But something seems different about the place now. \n\nThey've remodeled the place so no more sticky tiles, being replaced by hardwood floors and their sticky tables have been replaced with newer, albeit less sticky ones. \n\nWe ordered the Korean Fried Chicken which is still the same awesome dish. Big chunks of chicken, seasoned, battered, and deep fried GB&D (Golden brown and delicious-thanks Alton Brown). Its still tasty and juicy and the best bang for your buck for fried chicken @ $9.99 an order. \n\nThe seafood pancake was ehh.....nothing but mung bean batter, some green onion here and there and the only seafood in it was squid. What happened to the shrimp? There wasn't even one! I prefer the one at My Tofu House more. \n\nKal bi is consistent, can't really go wrong with kal bi. \n\nThey didn't give us the complimentary vegetable pancake appetizer like they did before. Maybe it was because we had already ordered the seafood pancake, but I didn't see any other table receive it either. \n\nThe complimentary spicy tofu soup was lacking. It was riddled with MSG, nearly spice-less and watered down. A huge disappointment.\n\nAnd when we got the check, we literally just got the check, No 30 second gum, nothing. The place was packed on a Tuesday night but maybe with the economy in shambles they decided to save some change by not giving you the gum.", "rating": 3, "date": "2009-03-03"}, {"excerpts": ["The soups are usually bland and watery, their meat dishes like the kal bi is usually burnt to the grilling plate, and their fishes have this nasty after taste, which typically means its not FRESH! ", "The only upside to this place is their green onion pancake, but that alone is not enough to save this place. ", "And after the last TWO times I've been here, I've had the WORST service ever. "], "author": "Johnson S.", "review": "So I've come here numerous times throughout the years and I must say the food isn't as good as everyone raves it to be, and it isn't the worse Korean food I've ever had either. Basically the food is mediocre at best. So as I was saying, the food here isn't the best, or bad, but because I live so close to this place, I usually just settle for it because I don't want to drive too far to into the richmond district just for some food. The soups are usually bland and watery, their meat dishes like the kal bi is usually burnt to the grilling plate, and their fishes have this nasty after taste, which typically means its not FRESH! The only upside to this place is their green onion pancake, but that alone is not enough to save this place. And after the last TWO times I've been here, I've had the WORST service ever. If I could give it 0 stars, I WOULD.\n\nThe first experience was with the old lady (probably the owner), who was a total B**** about an order of soup that my party and I DID NOT ORDER. She not only forced the soup that we did not order upon us, but had the audacity to charge us for it. Apparently she has a hearing problem, so the next time you go there and she's your server, be sure to SPEAK UP. \n\nThe second experience was tonight, and it was with the short/stubby  waitress. I was waiting in line with my sister, and we preferred to sit in the inside since the seat they offered us was in the front near the doors, plus my sister has kids. So we offered to wait for the table away from the door since they were practically paying the bill and ready to leave. After they finish cleaning, the stupid girl comes with her broken english and tells us that shes giving that table away when we clearly told her that we'll wait for THAT table. We asked her why, and she was like well... they're customers. I looked at her as if she was stupid or something because... HELLO, we're customers too!  Not only did it not make sense since she was giving a table that could have seated 6 (which was the size of my party) to a party of 2 instead. So my sister asked the dumb waitress politely if we could get the bigger table since we had a larger party and if the other party could get the table next to ours instead (which seated 4, which would have been perfect for the couple). Instead of even acknowledging our existence she just rolls her eyes and walks off, oblivious to everything. So we finally had it with this place, and we left, FOR GOOD.\n\nGoodbye Shin Toe Bul Yi, we've had enough of your BS service and your mediocre food. I would much rather drive my ass to the richmond district and be treated with respect at a better establishment than here. For those of you who don't mind being treated like garbage, and eating garbage, then feel free to come here, otherwise I would suggest My Tofu House, Han Il Kwan, Muguboka, or any other place than here because they either serve better or the same quality food as Shin Toe Bul Yi... but the only difference is at least you would be treated with respect. It's a different story if they served GREAT FOOD, then I guess it would be okay to treat your customers like garbage, but if you don't serve great food and your service sucks, then you have no right to treat anyone that way. \n\nP.S. I don't know why everyone thinks the chicken wings here are great. Honestly, it tastes like chicken! It's dry like cardboard, there's no taste, and oh did I mention its DRY?!?!?!", "rating": 1, "date": "2009-10-03"}, {"excerpts": ["I also like the meats - good Kal bi and chicken teriyaki.  "], "author": "Vicky F.", "review": "Absolutely our fave Korean place - very homey, dishes are tasty.  My friend and I always crave for the Seabass soup - flavorful with good chucks of seabass in it.  Hubby likes the Korean-fried chicken - they are fried well and not too greasy, plus flavorful.  I also like the meats - good Kal bi and chicken teriyaki.  I also like their spicy chewy noodles - noodles with good texture and great octopus/calamari pieces, yumm!!\nOne setback is that they are too popular, so on Fridays or Saturdays, they cut their waiting list at 8:50 or 9:00pm, even though they close at 9:30.  Got turned away a couple times because I worked late on Fridays :(.", "rating": 4, "date": "2008-02-03"}, {"excerpts": ["I'd love to eat their kal bi more, but its a bit pricier compared to the bulgogi."], "author": "Nand D.", "review": "My favorite Korean restaurant.  They always give nice freebies such as korean pancakes or fish.  My wife and I normally order Bulgogi, kim chee chi gae, and the fried chicken.  We absolutely love the pickled radishes.  Delicious!  I'd love to eat their kal bi more, but its a bit pricier compared to the bulgogi.", "rating": 5, "date": "2011-01-07"}, {"excerpts": ["We ordered the Kal Bi (short ribs to die for!), Seafood Pancake, and the fried chicken. ", "The seafood pancake was a lot bigger than we expected. ", "This was WAY more than enough food because we got tofu soup with our meal too! ", "We didn't know that it came with it. ", "So that was a nice little treat because it was very GOOOD! ", "Overall, we really liked the food here and we will definitely go back for more! ", "The only thing that bothered me was that the menus were really sticky. ", "Probably because they leave them close by the tables near everyone's food and dirty fingers."], "author": "Steph C.", "review": "After hearing about this place from friends, I finally tried this place this past weekend. Surprisingly, there was no line. Usually when we drove by, there would be a group of people waiting outside. But this time there were actually tables available and this was a Saturday around 7pm! We got lucky. We had no idea how big proportions would be. It was just my friend, boyfriend, and myself eating. We ordered the Kal Bi (short ribs to die for!), Seafood Pancake, and the fried chicken. The seafood pancake was a lot bigger than we expected. This was WAY more than enough food because we got tofu soup with our meal too! We didn't know that it came with it. So that was a nice little treat because it was very GOOOD! Overall, we really liked the food here and we will definitely go back for more! The only thing that bothered me was that the menus were really sticky. Probably because they leave them close by the tables near everyone's food and dirty fingers.", "rating": 4, "date": "2009-02-04"}], "bulgogi": [{"excerpts": ["Can't go wrong with the usual Korean foods - bibimbap, tofu soup, bulgogi."], "author": "Mabel Y.", "review": "Get the fried chicken!\n\nRestaurant is small and slightly cramped but the fried chicken is delicious.  Can't go wrong with the usual Korean foods - bibimbap, tofu soup, bulgogi.", "rating": 4, "date": "2018-09-13"}, {"excerpts": ["Our party of five ordered the kalbi, beef tofu soup, bulgogi, and the seafood tteokbokki. ", "But first we were served a platter of appetizers (banchans) that was only enough to serve at most two people. ", "Banchans are complimentary but I always appreciate it when servers give you a large enough portion so you don't have to keep calling them back to refill your empty dishes. ", "We were a bit puzzled when our meat dishes came because they looked generic, pale, and unappetizing. ", "We had mistaken the bulgogi (beef) for pork because of its light color and feeble texture. ", "The garnish was lacking and quite sad on the eyes. ", "The kalbi, although generous in portion, was tough and unflavorful. ", "I highly DO NOT recommend ordering the protein here. ", "If you happen to stumble across this restaurant and want to give it a shot, order the beef tofu soup. ", "It was delightful and flavorful. ", "It will for sure keep you warm on a chilly day in the city."], "author": "Amy T.", "review": "Definitely not one of my favorite Korean spots in SF. It didn't even come close. The quality of the food was subpar compared to their competitors. Our party of five ordered the kalbi, beef tofu soup, bulgogi, and the seafood tteokbokki. But first we were served a platter of appetizers (banchans) that was only enough to serve at most two people. Banchans are complimentary but I always appreciate it when servers give you a large enough portion so you don't have to keep calling them back to refill your empty dishes. We were a bit puzzled when our meat dishes came because they looked generic, pale, and unappetizing. We had mistaken the bulgogi (beef) for pork because of its light color and feeble texture. The garnish was lacking and quite sad on the eyes. The kalbi, although generous in portion, was tough and unflavorful. I highly DO NOT recommend ordering the protein here. If you happen to stumble across this restaurant and want to give it a shot, order the beef tofu soup. It was delightful and flavorful. It will for sure keep you warm on a chilly day in the city.", "rating": 2, "date": "2018-06-17"}, {"excerpts": ["Bulgogi, beef ribeye was ok.  "], "author": "Ivory B.", "review": "Shin Toe Bul Yi is no longer as good as I remembered, 15 years ago.   It used to be my favorite Korean place.  The parking situation is almost impossible so I stopped coming here.  We had to circle several times tonight to finally get a parking spot a block and a half away from the restaurant.  \n\nThe seafood pancake is still solid delicious although I would like it to be a bit more crispy.  The quality of the fried chicken did not seem to be fresh as I could smell the chicken.  The beef bibimbap rice cooked in the stoneware was ok. Bulgogi, beef ribeye was ok.  The sof tofu soup was nothing special.  \n\nThe place was jammed packed at 630pm.  The service was a bit slow as only two waiters work super hard to serve everyone.  The best thing tonight was having a decent  meal on the table served by a pleasant waiter.  \n\nProbably won't return again anytime soon.", "rating": 3, "date": "2018-01-06"}, {"excerpts": ["I ordered number 12, the chewy noodle and my friend ordered the bulgogi and tofu.\n", "Uh. ", "my noodle was not good, and the bulgogi was too sweet.\n", "After we almost done with our dinner, we couldn't finish it because the taste of the food was just too... ", "uh. ", "IDK. ", "Maybe I'm just weird, but I felt like throwing up afterwards."], "author": "Candice L.", "review": "Well..\nI've heard this place is good and I decided to give it a try.\nWell, from its cleanliness, the table is sticky.\nI ordered number 12, the chewy noodle and my friend ordered the bulgogi and tofu.\nUh. my noodle was not good, and the bulgogi was too sweet.\nAfter we almost done with our dinner, we couldn't finish it because the taste of the food was just too... uh. IDK. Maybe I'm just weird, but I felt like throwing up afterwards.", "rating": 2, "date": "2017-01-18"}, {"excerpts": ["Ordered Bulgogi and japchae. ", "The $22.50 bulgogi was dry, bland and tasted burnt. ", "The japchae was also bland, the vegetables undercooked, and had poorly chosen cuts of meat. ", "Had high hopes since it has a 4 star rating, but was thoroughly disappointed."], "author": "Nikko V.", "review": "Overpriced and for no reason. Ordered Bulgogi and japchae. The $22.50 bulgogi was dry, bland and tasted burnt. The japchae was also bland, the vegetables undercooked, and had poorly chosen cuts of meat. Had high hopes since it has a 4 star rating, but was thoroughly disappointed.", "rating": 1, "date": "2018-05-26"}, {"excerpts": ["I ordered 3 dishes: seafood pancake, squid tteokbokki and beef bulgogi.  ", "They gave us a tofu soup on the house, which was very nice, however, I can't even bring myself to like that.  ", "The beef bulgogi and tofu soup was fine and decent in comparison to the other two dishes we ordered. \n\n"], "author": "Colleen L.", "review": "I really like SPICY food, which is why I like Korean food.  However, I suppose this is a very rare Korean restaurant where nothing is spicy.\n\nI wanted to really like this place because of it's proximity to where we live.  Instead of driving to Richmond to go to my favorite Korean restaurant, Jang Soo BBQ.  Unfortunately, I'm not even sure this passes as Korean food?  I ordered 3 dishes: seafood pancake, squid tteokbokki and beef bulgogi.  They gave us a tofu soup on the house, which was very nice, however, I can't even bring myself to like that.  For two people, we spent $60, which I felt like we were robbed especially since the quality of food was not even close to what I would expect from a decent Korean restaurant.  \n\nLet's start with the banchan.  There was kimchi, mung bean sprout, pickled radish, cucumber, fish cake and braised black soy beans.  The kimchi was not even remotely spicy.  It's red like it is suppose to, but I'm not sure where the heat has gone? The pickled radish was tough to chew, which leads me to think it was expired or perhaps left out for too long? I've never had pickled radish like this before.  The fish cake and cucumber were decent, so I gobbled these up since I was famished before I arrived.  \n\nThe seafood pancake came out and it was huge!  I took one bite and the texture was bizarre.  It was gummy and felt like I was eating a paste, so I thought it was undercooked.  In order to test my theory, I was taking bites out of the corners of the pancake, where it *should* be the most cooked, however, I think this is just the texture their pancake is suppose to be.  The only thing that was good was the vinegar dipping sauce that was paired. \n\nThe squid tteokbokki (rice cake) was a mess.  It wasn't even cooked with gochujang (chili paste), which is the fundamental ingredient in most Korean dishes.  Instead, it was drenched with chili oil and chili pepper flakes and it wasn't spicy.  I had to literally wipe off the chili oil with each rice cake. \n\nThe beef bulgogi and tofu soup was fine and decent in comparison to the other two dishes we ordered. \n\nPerhaps this place is a haven for those who cannot eat spicy?", "rating": 2, "date": "2016-04-09"}, {"excerpts": ["Beef bulgogi, pork bulgogi, chicken teriyaki, and the green onion pancake. ", "Sometimes we'll add the fried chicken or the jap chae."], "author": "Heidi L.", "review": "I love this place. My favorite Korean restaurant EVER. And I live in LA where there's a plethora of Korean eats! I always have to come here whenever I'm back in town visiting my folks. My friends and I pretty much order the same thing every time. Beef bulgogi, pork bulgogi, chicken teriyaki, and the green onion pancake. Sometimes we'll add the fried chicken or the jap chae.", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["I got the bulgogi lunch take out which is $10, comes with rice and a bunch of Korean side dishes. ", "The bulgogi meat was top notch and cooked properly. ", "The only negative thing was that the bulgogi sauce was a bit tasteless which is probably healthier. ", "I wish they had the side dishes I liked though!"], "author": "Alfonso C.", "review": "I got the bulgogi lunch take out which is $10, comes with rice and a bunch of Korean side dishes. The bulgogi meat was top notch and cooked properly. The sides were typical.\n\nThe only negative thing was that the bulgogi sauce was a bit tasteless which is probably healthier. I wish they had the side dishes I liked though!", "rating": 4, "date": "2015-11-10"}, {"excerpts": ["I love their spicy squid, fried chicken and bulgogi. ", "I usually get their lunch specials, and the lady working during lunch time is really nice. "], "author": "Rebecca L.", "review": "One of my favorite Korean restaurants in the city! I love their spicy squid, fried chicken and bulgogi. I usually get their lunch specials, and the lady working during lunch time is really nice. I would say the price is reasonable compared to other Korean restaurants in the city. \n\nThe service is a hit and miss. One time I went, there was a really nice server. Another time, the server misheard us and gave us the wrong food and didn't refill our tea and banchan. :( \n\nBut overall, I love this place!", "rating": 4, "date": "2017-04-09"}, {"excerpts": ["I love the tofu soups, bulgogi beef plates, and bimimbap.\n\n"], "author": "Adam J.", "review": "This place is definitely a authentic Korean joint. \n\nI love the tofu soups, bulgogi beef plates, and bimimbap.\n\nThe quality of this place is good, fresh, and tasty. The prices range from $10-20 and comes with many of your favorite sides. \n\nI highly recommend getting the lunch combos. Everything is less than $10 for a box of meat, veggies, and rice and it's PACKED with goodies. Long lines too during lunch.", "rating": 4, "date": "2013-11-19"}, {"excerpts": ["Kalbi and bulgogi were good though. ", "We also ordered the Korean fried chicken since everyone else got it and our server recommended it as well.  ", "It was fried well, but super plain. ", "It said it came with a special spicy sauce, but that wasn't accurate.  ", "It was just salty, plain, fried chicken.  ", "Quite disappointing "], "author": "Kenitha Y.", "review": "Came here on a Wednesday night and the line wasn't too bad.  We arrived around 7 and there were 4 parties ahead of us.  Now... about the food.  It was good BUT not the best thing ever.  I'd skip the spicy pork next time because it was soooo fatty and thin.  You could literally see the grease dripping off. Meep.  Also, it wasn't that spicy, pretty sweet.  Kalbi and bulgogi were good though. We also ordered the Korean fried chicken since everyone else got it and our server recommended it as well.  It was fried well, but super plain. It said it came with a special spicy sauce, but that wasn't accurate.  It was just salty, plain, fried chicken.  Quite disappointing so I'd definitely skip that.\n\nPortions are pretty good, but it's pricey.", "rating": 3, "date": "2013-10-10"}, {"excerpts": ["Will i be back? especially for the bulgogi AND fried chicken\n\nUntil the next review......"], "author": "Jane A.", "review": "REKINDLED MY FEELINGS WITH AUTHENTIC KOREAN (Food)\n(4.5)\n\nIts been awhile since i've dashed my way to the sunset for the best korean food i've had. I've introduced this spot to more people and its been the hit. \n\nPlease do not be discouraged when the owners confuse you when they say \"to go box for lunchie\". What they really mean \"we will not server you real plates during lunch on weekends, you can still eat at the restaurant your food will just be served in to go boxes\". I see people in and out confused they they can only order to go and not sit at the restaurant.\n\nORDER (family Style)\n- Soup (i forgot which one) - delicious. not spicy. had pot stickers, noodles, and green onion. \n- Plate of fried chicken - YES definately a plate to order. \n- Plate of bolgogi - everyone loved it and was amazed how it was prepared. aint nothing like it, ANYWHERE\n- Broiled Mackrel - delicious. and they served a side of pickled-radish. goes well with the mackrel.\n- Free Korean sides - i think i can eat the side dishes forever in a day.\n\nI found some dislikes...\nThe to-go boxes were just a turn-off. not sure if the owners want to wash dishes or what. we had to rip parts of the to-go boxes and make plates out of them (and eating in the restaurant). kind of pathetic but it is what it is.\n\nYou have to pay when you order. she doesnt come to you, you go to the resgister and order AND PAY. we get confused where and when to leave the tip? why tip out early, we dont know if the service is good. just saying.\n\nWill i be back? especially for the bulgogi AND fried chicken\n\nUntil the next review......", "rating": 4, "date": "2010-09-27"}, {"excerpts": ["The tofu soup and bulgogi was only okay...", "the seafood pancake though was pretty good"], "author": "Long C.", "review": "Slow service during lunch hour. DO NOT come here if you are hungry or in a rush \n\nPrice leans toward the pricey side for Korean food...a seafood pancake plus a tofu bowl plus a rice place neared 40 bucks.\n\nThe tofu soup and bulgogi was only okay...the seafood pancake though was pretty good", "rating": 3, "date": "2012-12-21"}, {"excerpts": ["For 2 of us, we ordered:\n- $8 bulgogi lunch special http://www.yelp.com/biz_photos/Dy4FqsShb-I6uSiLEOibBw?select=EXDrhVXx83qhynImRGQoBg\n- $10.99 seafood pancake http://www.yelp.com/biz_photos/Dy4FqsShb-I6uSiLEOibBw?select=-d42x9QTwoj33TZf6zlpqA\n\n", "The bulgogi was good, can't complain.\n", "Seafood pancake came with sauce that tasted like hot cheetos, weird but good. ", "The pancake was also much larger than I expected.\n"], "author": "Kylie L.", "review": "I like it.\n\nI've been wanting to come here for a while. I've passed by it many times, but never had the chance. I finally had the chance today.\n\nIt was rather confusing when I saw the sign...it said something like lunch orders in boxes, so I didn't know if I could eat in or not. It actually meant they give you plastic lunch containers and you can eat inside if you like. The inside looks much smaller than I imagined. Real Korean workers & real Korean customers, which is pretty authentic in my book.\n\nFor 2 of us, we ordered:\n- $8 bulgogi lunch special http://www.yelp.com/biz_photos/Dy4FqsShb-I6uSiLEOibBw?select=EXDrhVXx83qhynImRGQoBg\n- $10.99 seafood pancake http://www.yelp.com/biz_photos/Dy4FqsShb-I6uSiLEOibBw?select=-d42x9QTwoj33TZf6zlpqA\n\nThe bulgogi was good, can't complain.\nSeafood pancake came with sauce that tasted like hot cheetos, weird but good. The pancake was also much larger than I expected.\nAll of the food wasn't too spicy, I liked it. \n\nThe portions are a lot larger than I expected, good thing I didn't order more. I was starving when I came in, but still managed to not eat all of it....strange. Lots of leftovers, so we brought it home and ate for dinner. Seafood pancake isn't that good as a leftover, much better when it's fresh.", "rating": 5, "date": "2010-06-09"}, {"excerpts": ["update: korean pancake and bulgogi is very delicious\n\n\n"], "author": "Dimi N.", "review": "I've been there many times (dinner only, curious about their lunches though..) and the food is pretty decent. Last time I had kimchee bibimbap (wish it had more beef though but it had lots of kimchee) and fried Korean fish was delicious too. always good and fast service!\n\nupdate: korean pancake and bulgogi is very delicious\n\n\n2016 Update: this place is so far the best Korean food and most authentic.", "rating": 5, "date": "2014-10-25"}, {"excerpts": ["Their broiled fish dishes are good, and the bulgogi is my favorite of their meats, but it's served as slices rather than chunks (it still tastes good though).  "], "author": "Mike L.", "review": "It's kind of strange...in a few different ways, Shin Toe Bul Yi probably isn't the most amazing Korean restaurant in the city.  The outside sign is a bit tattered, the ambiance is just okay, and a few of the dishes won't appear to be mind blowing.  And yet, despite whatever shortcomings they may seem to have, the place is still so good!\n\nI'm not sure what exactly it is that makes them so lovable, but their fried chicken dish might have something to do with it.  Whenever I'm there, I see it show up on people's tables more often than not.   It's not something unique to their menu, but they do theirs a little differently.  Instead of just the usual wings and drumsticks, they also include chopped up pieces from the breast and thigh.  Though it makes for some awkward looking pieces, the taste is spot on!  The batter can be a little thick, but it's got some flavor, the portion is generous, and the meat is moist (for the most part).\n\nBeyond the fried chicken, the rest of their food is not too shabby, though nothing stands out as a star.  If anything, the haemul pajun (seafood pancake) would be the closest - loaded with a good amount of seafood, it wasn't too doughy and had a nice bit of crispiness.  Their broiled fish dishes are good, and the bulgogi is my favorite of their meats, but it's served as slices rather than chunks (it still tastes good though).  Sadly, I was disappointed with their kimchi jiggae (kimchi and pork stew) as it was too thin for my liking.\n\nIn addition to the usual array of banchan, I love that they hook you up with a free dish as well.  Depending on what you've already ordered, they'll usually give you a small pot of basic soon doobu, or a few pieces of mackarel(?).  Free food definitely goes a long way!  The fact that their food is consistent, the service is friendly, and the prices are pretty fair certainly don't hurt either.", "rating": 4, "date": "2011-06-28"}, {"excerpts": ["Galbi is yummy, much better than the bulgogi here. ", "I normally like bulgogi but meh. "], "author": "Bianca W.", "review": "Noms! Second favorite Korean place in sf. \n\nI love this place. Its soooo good. Get the fried chick, of course. Galbi is yummy, much better than the bulgogi here. I normally like bulgogi but meh. The pancake is good, but it's a little too thick in my opinion, I still like it though!\n\nPlace gets packed since it's small so prepare for that!", "rating": 4, "date": "2011-09-27"}, {"excerpts": ["The daeji bulgogi (spicy marinated pork) was simmered in sauce and then steamed as opposed to being grilled..."], "author": "Christopher N.", "review": "Hmmm...\n\nWe ordered quite a lot of food, and only about half of it was good.\n\nEven the banchan was okay.\n\nThe daeji bulgogi (spicy marinated pork) was simmered in sauce and then steamed as opposed to being grilled...no grill marks, no grilled taste, and very strange steamed-meat texture.\n\nThe kimchee was lacking a lot of flavor, as if it was made then and there and given to us right away without waiting at least a few hours of fermentation.  My family makes 10 pounds of kimchi'd cabbage a week, believe me I know what delicious kimchi tastes like and the day we ate here, there was some bland ass kimchi.  It also lacked spice\n\nThe jok bal (simmered pork shanks) was very good.  The bean dip they gave, the funky sauce, the garlic cloves, the lettuce, everything was just delicious for this dish and was the saving grace for our dinner besides the friendly service and generous portions they gave (our leftovers last several more meals)\n\nI will try this place again just to make sure it wasn't a fluke.... if it doesn't beat Toyose, My Tofu House or the Spot in terms of taste, can't say I'd come back", "rating": 3, "date": "2011-08-23"}, {"excerpts": ["Food : 5 stars in my opinion (our favorite battered fried chicken, japchae( Korean clear noodle), Bulgogi (spicy pork), Plain Korean Pancake "], "author": "Agustino B.", "review": "Year of 1999, I was fresh off the boat from South East Asian, lived with my sister on 32nd Taraval Avenue. She took me for dinner @ Shin Toe Bul Yi. It was the 1st time I tried Korean food and fell in love with it. (The best korean food in my own opinion in the Bay Areas)\n\nMoving Forward, year 2015 have my own family. Going to Shin Toe Bul Yi always a treat for us. We love and enjoy the food so much, my older one (3 Years old) Love the fried chicken.\n\nFood : 5 stars in my opinion (our favorite battered fried chicken, japchae( Korean clear noodle), Bulgogi (spicy pork), Plain Korean Pancake (Damn it, I am drooling now), Spicy tofu soup (Its on the house WOOHOO), Korean spicy ricestick with octopus, and the Mackerel fish.\n\nParking : Little bit hard (Street Parking)\n\nService : The waiter is friendly and she will notify you that most of the foods are extremely hot. (she would remind people with the kids be cautious with the hot foods), She's fast worker and really responsive) 5 stars with the service.\n\nThis place is always pack, expect waiting for at least 20 minutes during weekend especially dinner time. (But trust me it's worth the wait). \n\n My Tips : Beat the crowd by come during early lunch or early dinner.", "rating": 5, "date": "2015-11-04"}, {"excerpts": ["Awesome soft tofu soup and bulgogi, mackerel and fried chicken are also tasty. ", "Some of the more esoteric Korean entrees weren't to my palate ", "but since I love the other stuff I stick with them. "], "author": "T J.", "review": "Nice family atmosphere and the service is friendly and usually efficient. Awesome soft tofu soup and bulgogi, mackerel and fried chicken are also tasty. Some of the more esoteric Korean entrees weren't to my palate but since I love the other stuff I stick with them. Side dishes are ample and tasty, as is the tea.\n\nWith few straightforward Korean restaurants around here easily accessible I rate this one among the best we have. Fair prices, tasty with good portions, and really nice servers that make you feel welcome and tended to.", "rating": 4, "date": "2014-08-11"}, {"excerpts": ["Bulgogi was very render and the flavors are mild but very satisfying.\n", "More expensive that the Korean food we normally order ", "but I don't mind because the food is really top notch!"], "author": "Kathryn H.", "review": "Sides are awesome!\nJapchae had a lot of vegetables. But I wished it had more noodles too. \nBulgogi was very render and the flavors are mild but very satisfying.\nMore expensive that the Korean food we normally order but I don't mind because the food is really top notch!", "rating": 5, "date": "2014-07-03"}, {"excerpts": ["After looking at the menu, we decided on the fried chicken, tofu soup with beef and bulgogi. ", "We were served some side dishes, and fried mackerel that was on the house. ", "The food was definitely not bad, but nothing special either. ", "The bill came down to $55 with tips for two. ", "Overall, typical Korean food that was good by all means, and decent portions, but don't think I'm in any rush to come back to the place."], "author": "Helen Y.", "review": "If you're not a local or if you've never visited, Shin Toe Bul Yi is pretty easy to miss. Even when I was pointed towards the direction of the shop across the street, it took me some time to notice the four Korean words of the shop's sign.\n\nThe place was full of customers when we walked in. We signed our names and were seated after a short wait. During our wait, I quickly scanned the tables to see what people had ordered. Almost every table had a huge order of fried chicken, so I decided that it was a safe bet to order that too.\n\nAfter looking at the menu, we decided on the fried chicken, tofu soup with beef and bulgogi. We were served some side dishes, and fried mackerel that was on the house. The food was definitely not bad, but nothing special either. The bill came down to $55 with tips for two. Overall, typical Korean food that was good by all means, and decent portions, but don't think I'm in any rush to come back to the place.", "rating": 3, "date": "2010-12-07"}, {"excerpts": ["bulgogi: ", "By far the best dish.  ", "It was perfectly marinated, tender and juicy.  ", "The portions were generous where all 5 of us had our way with the dish.  ", "I preferred the bulgogi but there are no complaints about their kalbi.\n\n", "It is a rice bowl with kimchee, bulgogi, various vegetables and egg.  ", "I am not a big fan of kimchee thus, wasn't as fond of this dish as she was.  "], "author": "Brian V.", "review": "If you were a native son of Korea, you would find my resume of korean dining truly credible.  They include:\n1.  oz \n2.  sarang bang\n3.  john snack and deli (which is a hybrid of korean and mexican)\n\nGleaning on my experience,it is easy to see how I am a connoisseur of the masters of marinated meats.  Doing KDer an xmas service and knocking down a restaurant off her endless bookmarks, we arrived at Shin To Bul Yi's door.  It was a monday night yet it was packed.  It is a very small restaurant and seems like it was converted from a residential house.  I advise going in groups to eat Korean food as it allows you to order more and sample each others plates.  We put our name on the list and huddled inside for warmth, staring at patron eating their food with doe eyes until we were shoo'd outside to wait in the cold.  Once seated, we ordered:\n\n1.  bulgogi: By far the best dish.  It was perfectly marinated, tender and juicy.  The portions were generous where all 5 of us had our way with the dish.  If i had it my way, i would have taken this dish all for myself.\n\n2.  kalbi: The kalbi was very flavorful.  There was a mention of how authentic this place was in terms of not being too Americanized.  The kalbi i love from john's snack and deli which comes in form of a kalbi burrito is very sweet.  Shin Toe Bul Yi's kalbi was subdued in sweetness and was also very good.  I preferred the bulgogi but there are no complaints about their kalbi.\n\n3.  tofu soup: The tofu soup was given to us on the house.  It was good for a cold night and not spicy at all.  There were generous portions of tofu and a good complement to pour over the rice.\n\n4.  fried chicken: The fried chicken was a house specialty and many yelpers have raved about it.  It is certainly good, but in controlled portions.  It is very fatty and rich and taste similar to KFC.  I could eat one or two pieces but after that, it was a little too much.\n\n5.  seafood pancake: I didn't touch this as I don't really eat seafood outside of fish.  This dish came at the tail end of our dinner so everyone else was much too stuffed to really put a dent in it.  \n\n6.  bimbimbap: My gf got the bimbimbap bowl for herself.  It is a rice bowl with kimchee, bulgogi, various vegetables and egg.  I am not a big fan of kimchee thus, wasn't as fond of this dish as she was.  However, she enjoyed it immensely.  \n\nBecause of my lack of experience in Korean cuisine, I relied more on my tastebuds.  The food was certainly very good but not the \"zomg\" level that all tastebuds recognize.  The service is okay here; there was one waitress for the whole place so it is only natural that things might take longer.  The restaurant itself was definition of mom and pops.  It certainly wasn't aesthetically pleasing, but exuded an aura of comfort, much like a Korean mother's kitchen.  The price is very reasonable if you go in a group...ours was tabulated to $20 per person.", "rating": 4, "date": "2010-12-22"}, {"excerpts": ["The fried chicken, galbi, and bulgogi is always on point. ", "The owners usually give something like tofu soup on the house when you dine in and when I've asked for extra kimchi during take out, I am never charged extra.  ", "Get the lunch plates, they are amazing for the price point."], "author": "Sarah Y.", "review": "This is a great little resturant in the neighborhood.  The fried chicken, galbi, and bulgogi is always on point. The owners usually give something like tofu soup on the house when you dine in and when I've asked for extra kimchi during take out, I am never charged extra.  Get the lunch plates, they are amazing for the price point.", "rating": 4, "date": "2016-06-08"}, {"excerpts": ["Don't care for their noodles but the beef bulgogi is awesome. ", "Seems like a family business, ladies are usually very friendly and efficient, side dishes very good. ", "For the area it is 5 stars, taking away a star for the fact that takeout ends up being another few dollars over sitting down and eating there!"], "author": "Bob M.", "review": "Soft tofu soup is to die for. Consistently good, spicy with tofu that just holds up long enough for you to get it on your spoon then awaits consumption. \n\nFried chicken is good and plenty, like it when in the mood but try sticking to healthier stuff. Don't care for their noodles but the beef bulgogi is awesome. Seems like a family business, ladies are usually very friendly and efficient, side dishes very good. For the area it is 5 stars, taking away a star for the fact that takeout ends up being another few dollars over sitting down and eating there!", "rating": 4, "date": "2013-10-29"}, {"excerpts": ["Among the most popular: Fried Chicken, Tofu soup, and Bulgogi.  ", "I was not impressed with the Bibimbap.  ", "It was rather bland -- "], "author": "Jannie Q.", "review": "This Korean restaurant out in the Avenues is one of the hidden treasures.  It's really out there but good food always travel far.   There is usually a wait during dinner, no matter what day it is.  Make sure you sign up on the wait list because the waitress goes purely by the list and nothing else.  \n\nThey give you free garlic pancake and fried mackerel with each meal in addition to the little Banchan dishes that other Korean restaurants give you.   Prices are decent.   Among the most popular: Fried Chicken, Tofu soup, and Bulgogi.  I was not impressed with the Bibimbap.  It was rather bland -- I've tasted better.    \n\nAir ventilation is bad here, so your clothes will probably end up smelling like the food.  Hence, don't wear your fancy clothes there.", "rating": 4, "date": "2007-02-25"}, {"excerpts": ["The Bulgogi was deceiving. ", "It didn't look appetizing compared to what I have had in the past ", "but it was good. ", "The meat was tender and it had the right amount of fatty pieces. "], "author": "BYRON D.", "review": "What we ordered:\n-Kimchi Rice in stone pot\n-Bulgogi\n-Fried Chicken\n*complimentary tofu soup (extra star for taste/qualtiy!)\n\nAfter reading the reviews on this place about the hype on the fried chicken (and me being the FRIED CHICKEN MONSTER), we had to try this place out... \n\nAtmosphere: \nTypical hole-in-the-wall SF restaurant where you would see families eating a dinner on a weekday.\n\nThe Food: \nMaybe I was expecting more from the chicken... I mean, how can you go wrong with fried chicken? Especially, with me. When it arrived to the table, I quickly grabbed the flapper portion of the wing. Upon first bite, I was disappointed. Disappointed with the flavor, the 'crunch' or lack there of.. It was bland to me. The special sauce wasn't very enticing... It seemed like some kind of Sriracha/Cocktail sauce concoction that couldn't even rescue my craving for fried chicken. I have had other KFC's (Korean Fried Chicken) before and this made it to the bottom of my list. \n\nThe Kimchi rice arrived to the table and my eyes glazed over as I saw the mounds of vegetables on top that was covering the egg. The Kimchi in it was not cut up too small and neither was the beef. After a quick mix of the pot, I took a bite and the taste was just right.  This was actually good. \n\nThe Bulgogi was deceiving. It didn't look appetizing compared to what I have had in the past but it was good. The meat was tender and it had the right amount of fatty pieces. The marinade was flavorful and it had the right amount of sweet and savory on my palette. \n\nNow on to the tofu soup. It arrived at the table and I didn't want to touch it first because I didn't order it. So I had to confirm with the waitress that the soup was actually for our table. The taste was incredible. I can say that this was the best tofu soup I have ever had. The broth had the right amount of spice. It had a generous portion of tofu. I wish it had more veggies though.\n\nAlthough the tofu soup was amazing, I don't think the KFC nor the Kimchi rice would have me back here anytime soon for dinner.", "rating": 2, "date": "2010-09-23"}, {"excerpts": ["We got Soondubo (spicy tofu soup), Tteokboki (rice cakes with spicy sauce), Bulgogi (grilled marinated beef), Pajeon (green onion pancake), and House Fried Chicken with sauce. ", "All of the food was to die for, and all worth trying! ", "My favorites were definitely the Bulgogi and Tteokboki. \n\n"], "author": "Sharon L.", "review": "Went here a little while back and it was one of the first times I had an authentic Korean feast, and I fell in love! This place gives me the feeling of a little family owned restaurant. I felt like i was eating at a friends house for their mom's delicious cooking! \n\nThe workers are very nice and the service is quick after you order. But my tip would be to get there kinda early if you're going for dinner, because it gets crowded.\n\nNow on to the good stuff, the food! \nIt's all delicious! I love how you get all the side orders (Banchan) with your meal. All sorts of pickled veggies, kimchi, and fish are so yummy! \n\nI went with a couple friends and we ordered a bunch of dishes to try. We got Soondubo (spicy tofu soup), Tteokboki (rice cakes with spicy sauce), Bulgogi (grilled marinated beef), Pajeon (green onion pancake), and House Fried Chicken with sauce. All of the food was to die for, and all worth trying! My favorites were definitely the Bulgogi and Tteokboki. \n\nI'm definitely coming back!", "rating": 5, "date": "2011-03-07"}, {"excerpts": ["We ordered:\n tofu stew shepherd's purse/miso soup\ndol sot bibimbap\nseafood udon noodle soup\nBulgogi (beef)\nbroiled mackerel was on the house\n\n", "Sizzling iron plate that held the bulgogi also did not get hot enough (either that, or the meat was too wet). "], "author": "Jana C.", "review": "I so wanted to give this Korean rest. in Parkside a 4 or higher rating for their dinner service; I just can't do it. \n\nLast night there was a party of 4 who frequented this place for the first time, having made the decision based from the former yelp reviews. Honestly, nothing worked well with this dinner; strong nod from the Korean friend from Pusan who said that she would not come back for a repeat visit. Sadly, I must agree with her. \n\nPanchan was perfunctory; nothing exceptionally tasty, crunchy, pickled, or peppered. My heart was already sinking once those little appetizer plates were brought out. \n\nWe ordered:\n tofu stew shepherd's purse/miso soup\ndol sot bibimbap\nseafood udon noodle soup\nBulgogi (beef)\nbroiled mackerel was on the house\n\nThe tofu soup was just ok. the tofu wasn't the silken variety, which was fine. but the soup was altogether more like 'add miso paste, then add water'. My heart sank\n\nThe bibimbap: the black stoneware pot was not heated up hot enough to brown and 'crunchify' the rice beneath. In fact, the egg that sat in the middle didn't 'cook' properly when mixed together, because nothing inside was hot enough to cook it to keep from getting wet and gummy. Another dud!\n\nSizzling iron plate that held the bulgogi also did not get hot enough (either that, or the meat was too wet). That grilled flavor was just in absentio and we all looked at one another, silently, kind of like \"How can every dish be so 'meh' after the yelp reviews?\"\n\nThe lady server was so polite and kind. She was generous in gifting us with the fish (no matter how many times i eat mackerel, I deem it too fishy of a fish)... I honestly did want to rate them higher than I can actually do...\n\nFrankly, I wouldn't recommend anyone driving specifically to Parkside (Taraval) for Korean here.... if you did, you'd get a much more satisfying experience at Kingdom Dumpling just east, up the street, or perhaps Korean on Noriega?", "rating": 3, "date": "2010-02-17"}, {"excerpts": ["The bulgogi came first. ", "It was awesome. ", "I got to say its a bit pricey ", "but it was worth. ", "The best bulgogi I've ever tasted. ", "The second dish, OMG. ", "That will be your first reaction. ", "It gives you a huge amount of chicken for a decent price. ", "My boss was so happy after she saw the dish of fried chicken that is made to perfection, golden, crispy. ", "Its just amazing. ", "We also got their seafood tofu soup, it was decent. ", "I've tried better. ", "The owners are really generous and decided to give us a few dishes of grilled mackerel. ", "Try it, this restaurant wont disappoint you."], "author": "Kris C.", "review": "It is a small restaurant that doesn't take reservations. I understand that because they don't have much space in the restaurant. We came in as a group of 22 people. The waitress has excellent service. My boss and I ordered 3 dishes and it sure didn't disappoint us. The bulgogi came first. It was awesome. I got to say its a bit pricey but it was worth. The best bulgogi I've ever tasted. The second dish, OMG. That will be your first reaction. It gives you a huge amount of chicken for a decent price. My boss was so happy after she saw the dish of fried chicken that is made to perfection, golden, crispy. Its just amazing. We also got their seafood tofu soup, it was decent. I've tried better. The owners are really generous and decided to give us a few dishes of grilled mackerel. Try it, this restaurant wont disappoint you.", "rating": 5, "date": "2014-11-25"}, {"excerpts": ["I remembered this place as Chicken Deli when they served bomb ass bulgogi sandwiches..."], "author": "Patrick C.", "review": "I remembered this place as Chicken Deli when they served bomb ass bulgogi sandwiches...that was over a decade ago...or was it two decades??\n\nAnyways, came here to try them out as I needed a quick Korean fix that was on Taraval.  There was no line like everyone on Yelp says there is maybe because we came at 6pm on a weekday.  \n\nSeafood tofu soup - Pretty good...but I had better\n\nKalbi - a bit overcooked, very dry and meat quality was bad (chewy beef)..  How can you have bad kalbi at a Korean restaurant...??\n\nSpicy Octopus - Marinated very good...the sauce they used was phenomenal, however, the squid quality was bad...again...very chewy.\n\nI won't be returning back to this place any time soon.  Though I think I will come back to get a to-go order of their fried chicken wings that everyone raves about on Yelp.  I saw a few tables ordering this and it looks like a \"better-than-KFC\" kind of wings.", "rating": 2, "date": "2011-08-30"}, {"excerpts": ["Tteokbokki with calamari was yummy and the bulgogi was tender and flavorful. ", "They even served a tofu soup on the house. ", "Between 3 people this was plenty! ", "Just a note that one night we tried to eat here at 9pm and we were turned away. ", "Closing time is 9:30pm, and the tables were all full, so it made sense. ", "So a tip not to come near closing time! ", "I'll be back."], "author": "Lisa H.", "review": "This is right in my neighborhood and I always see people waiting outside. For Korean food in the city, this place isn't bad. Prices weren't outrageous and wait staff was courteous. For starters, the banchan was tasty and fresh. I had high hopes for the fried chicken and while it looked delicious, there were a lot of white meat pieces that I'm just not a fan of. However, as I looked around, every single table ordered the fried chicken, so seemed like this is a general favorite. Tteokbokki with calamari was yummy and the bulgogi was tender and flavorful. They even served a tofu soup on the house. Between 3 people this was plenty! Just a note that one night we tried to eat here at 9pm and we were turned away. Closing time is 9:30pm, and the tables were all full, so it made sense. So a tip not to come near closing time! I'll be back.", "rating": 3, "date": "2013-08-14"}, {"excerpts": ["We ordered the fried chicken that everyone talked about on Yelp, the bulgogi, duk bok yi (chewy rice cake rolls/dumplings), and sun dubu ji-ge (tofu in a spicy soup).  ", "My husband tried the pan-chan/side dishes you get and he was impressed!  ", "My man is very picky about his Korean food as he always compares it to what his mom used to make.  ", "My eldest princess loved the meat and I had second helpings of everything.\n", "Luckily we have leftovers tonight!  ", "Shin ", "Toe Bul Yi will be our go to place for K food from now on."], "author": "Kekumukula N.", "review": "I've been craving Korean food for THE longest time.  I didn't remember the name of this place but once my husband found it on Yelp and it's one that has some of the highest ratings, I remembered it as the place that's owned by my cousin's in-laws' friends.\nWe ordered the fried chicken that everyone talked about on Yelp, the bulgogi, duk bok yi (chewy rice cake rolls/dumplings), and sun dubu ji-ge (tofu in a spicy soup).  My husband tried the pan-chan/side dishes you get and he was impressed!  My man is very picky about his Korean food as he always compares it to what his mom used to make.  My eldest princess loved the meat and I had second helpings of everything.\nLuckily we have leftovers tonight!  Shin Toe Bul Yi will be our go to place for K food from now on.", "rating": 5, "date": "2011-03-13"}, {"excerpts": ["The spicy pork bulgogi is the best we've ever had and the fried chicken is delicious.  ", "My wife loves everyting on the menu and it is one of her favorite restaurants.  ", "The green onion pancake is great as well.  ", "The portions are large and they provide alot of complimentary (Korean) appetizers.  ", "It is not the most beautiful place, but dont let that keep you away."], "author": "Steven B.", "review": "We first tried this place 10 years ago when we lived across the street and loved it.  The spicy pork bulgogi is the best we've ever had and the fried chicken is delicious.  My wife loves everyting on the menu and it is one of her favorite restaurants.  The green onion pancake is great as well.  The portions are large and they provide alot of complimentary (Korean) appetizers.  It is not the most beautiful place, but dont let that keep you away.", "rating": 4, "date": "2012-01-07"}, {"excerpts": ["However, the standalone bulgogi and pork dishes were overcooked, leading to episodes of bubble gum chewiness, and the kimchi had subpar flavor.\n\n"], "author": "Andrew M.", "review": "A bustling, family-like atmosphere, enjoyable fare, and fair prices firmly plant Shin Toe Bul Yi high on the list of Korean options this side of San Francisco.\n\nThe Korean Fried Chicken Wings with maximally crispy batter guarding its juicy, piping-hot innards and accompanying flavorful hot sauce is a must-order every visit; the Seafood Pancake is basically a bountiful Korean quesadilla with no shortage of fillings; and the Noodle Soup featured in a huge tin bowl is packed full of delicious, mysterious goodies.\n\nHowever, the standalone bulgogi and pork dishes were overcooked, leading to episodes of bubble gum chewiness, and the kimchi had subpar flavor.\n\nThe restaurant is not huge, so a group of 8 hits maximum, but the service is friendly and food arrives quickly.  Would definitely come back, now knowing what to order!", "rating": 4, "date": "2012-04-03"}, {"excerpts": ["For two, we always order the deep fried chicken, bulgogi w/ calamari, 1 to 2 bottles of soju and a large hite to chase. "], "author": "Jimmy H.", "review": "I love this place. I eat here almost every time I'm around the Avenues. It's something about their fried chicken that always makes me come back. \n\nFor two, we always order the deep fried chicken, bulgogi w/ calamari, 1 to 2 bottles of soju and a large hite to chase. They always hook it up with free tofu soup too, not to mention there's also all the side dishes that we get to munch on while we wait for the entrees. \n\nThe wait for a table can be a bit long on busy nights. The place is small. The staff is very friendly. The only downside for me is that sometimes you can get seated really close to another party and it can feel kind of awkward. \n\nEat fried chicken with your hands people!", "rating": 4, "date": "2011-04-05"}, {"excerpts": ["Their bulgogi (spicy pork) has too much of this thick sauce on it on my opinion. ", "Their fried chicken is goood. "], "author": "Christine L.", "review": "I really like this Korean place. There is a really comfortable, homey feel to the place.\n\nYou sit down and they give you my favorite side dish, the green onion pancake. They always have different side dishes whenever we come. Their kalbi is good. Their bulgogi (spicy pork) has too much of this thick sauce on it on my opinion. Their fried chicken is goood. They even give you complimentary grilled mackerel which is also goood.\n\nSo it's story time. The first time I came, 8 out of the 10 tables in the place had fried chicken on the table. The only two tables without fried chicken was the only non Asian table and my table. So I decided the next time I would get the fried chicken. So the next time I come in, we ordered the fried chicken AND THEY DIDNT HAVE ANY LEFT. How depressed was I. When I saw the couple that came in before us get a plate of fried chicken, my sadness showed on my face. The waitress asked me what was wrong and I told her that I really wanted fried chicken. She said she was sorry, but they had just a few pieces left so they give it to that couple on the house. :( So sad was I. Then the waitress comes back with a plate of four pieces of chicken and told us that it was HER chicken that she was going to have for dinner! Needless to say, that chicken...was....so....good. \n\nIn conclusion, they really take care of you here; their food is good; its a small place and they sometimes will stop taking people if its nearing closing time. I think its family run so it has a very mom and pop feel to it.", "rating": 4, "date": "2008-03-23"}, {"excerpts": ["I usually order either bulgogi or kalbi , its sweet and very good! ", "and i also order their fried chicken that they are really known for , the taste of the batter is different from a lot of places which gives it a unique taste that i really like , also love the small entrees that they give here! ", "especially the spicy fried fish paste , its so good! ", "They also always give a complimentary spicy tofu soup with every meal and its by far my favorite here! ", "I really come here sometimes just for the tofu soup! ", "I love it ! ", "Only thing about this is place it is on the expensive side , but the food here is great!"], "author": "Jeffrey T.", "review": "I come here maybe 1-2 times a month , I really love this place ! Their food is really authentic and really delicious. I usually order either bulgogi or kalbi , its sweet and very good! and i also order their fried chicken that they are really known for , the taste of the batter is different from a lot of places which gives it a unique taste that i really like , also love the small entrees that they give here! especially the spicy fried fish paste , its so good! They also always give a complimentary spicy tofu soup with every meal and its by far my favorite here! I really come here sometimes just for the tofu soup! I love it ! Only thing about this is place it is on the expensive side , but the food here is great!", "rating": 5, "date": "2012-11-29"}, {"excerpts": ["The bulgogi I ordered was ok, but just didn't have much flavor. ", "In fact all the banchan seemed to be 'watered down' versions. ", "The kimchee wasn't very spicy and the mung sprouts and cucumbers just didn't have enough flavor. ", "IMO the food has made to fit the clientele for this area.  "], "author": "Dom L.", "review": "So even though I live in the neighborhood, I've never been because I always see the long lines and I hate, hate, hate waiting for a table anywhere. But after learning that their lunch menu is now to go only, decided to pop in today.\n\nFirst to dispel one erroneous yelper, you can get the fried chicken for lunch. It's just not a lunch special. The chicken had good seasoning and texture, although some pieces were a little dry. Better than KFC tho.\n\nThis place actually is quite the oxymoron. On the outside and even when you go inside the place looks and feels very, very traditional, \nlike how you imagine a mom and pop korean restaurant to be like.\n\nBut actually the food to me is a little bit like 'americanized' korean food. The bulgogi I ordered was ok, but just didn't have much flavor. In fact all the banchan seemed to be 'watered down' versions. The kimchee wasn't very spicy and the mung sprouts and cucumbers just didn't have enough flavor. IMO the food has made to fit the clientele for this area.  Not too spicy, not too strong flavors. \n\nI guess if you don't mind the wait and really want the chicken, then this is the place. This just isn't the first place that'll pop in my head the next time I want korean.", "rating": 3, "date": "2009-08-13"}, {"excerpts": ["Bulgogi was about $18. ", "Pretty pricey. \n", "The famous fried chicken that every table gets, is ok. ", "Crunchy but taste wise not extremely special. ", "They give you maybe even 12 pieces. ", "it's a lot! \n", "Complimentary tofu soup. ", "It's red ", "but it's not spicy. "], "author": "Veranna N.", "review": "Homey , warm restaurant with bright white lights. The place feels very asian to me. It's incredibly loud as the guests all try to speak over each other. \nExpect a wait , maybe 20 minutes long. Go in and look for the little notepad-- that's the wait list. The pen they provided wasnt even working so I tried real hard to desperately scratch my name onto the list. The waitress ended up crossing off my name for some reason, probably assuming it was too messy. Maybe bring your own pen if you plan to go. \n\nI feel terrible for the 2 ladies [the wait staff]. Too much to do , too many tables for the 2 of 'em! \n\nBulgogi was about $18. Pretty pricey. \nThe famous fried chicken that every table gets, is ok. Crunchy but taste wise not extremely special. They give you maybe even 12 pieces. it's a lot! \nComplimentary tofu soup. It's red but it's not spicy. Good.\n\nFor two people, our bill amounted to almost $50. O that's too much for me..", "rating": 3, "date": "2011-10-24"}, {"excerpts": ["Bulgogi - it was ok, tasted kind of fake but good.\n\n"], "author": "David W.", "review": "MY OH MY HAVE I MISSED KOREAN FOOD SINCE MOVING BACK UP FROM LA! \n\nI wish I could give it 4 stars but it doesn't compare to K-town in LA. But it is probably the best, hidden gem in Sunset (I've lived here for 10+ years and haven't tried it till now). \n\nWe ordered...\n\n1. Bibimbap - it was but it lacked much flavor. I'm not the biggest fan of bibimbap so I may be biased\n\n2. Rice cake - this was my favorite dish of the night. It is awesomeness in your tongue all the way down to your tummy.\n\n3. Seafood Pancake - MHMMMMMMMMM GET IT!\n\n4. FREE TOFU SOUP - Did I mention FREE?! Well, it goes pretty good if you mix the rice but other than that, it's pretty plain BUT FREE!\n\n5. Bulgogi - it was ok, tasted kind of fake but good.\n\nOverall, I can't believe I haven't tried this place until now. It's kind of hard to find as it's not over the top flashy, but it's right in front of the L Taraval stop.\n\nJust go and you'll know what I'm talking about.", "rating": 4, "date": "2011-01-29"}, {"excerpts": ["My friend and I had a kim chi pancake, bulgogi, and last but not least--the fried chicken.  ", "All three dishes were extremely good.  ", "They even gave us a really good soup, on the house, so that was pretty cool.  ", "The serving sizes were large, and we had lots of leftovers.  ", "It's OK...  ", "I wouldn't mind just coming up for the fried chicken."], "author": "Thuan N.", "review": "The fried chicken is so good.\n\nMy favorite Korean place in the city, so far.  There is typically a line around dinner time because the place is so small.  But to me, the food is totally worth it.\n\nMy friend and I had a kim chi pancake, bulgogi, and last but not least--the fried chicken.  All three dishes were extremely good.  They even gave us a really good soup, on the house, so that was pretty cool.  The serving sizes were large, and we had lots of leftovers.  It's OK...  I wouldn't mind just coming up for the fried chicken.", "rating": 4, "date": "2011-05-01"}, {"excerpts": ["Ordered the fail-safe fried chicken and seafood pancake, also ordered the kimchi bimbimbap and spicy bulgogi, all to be shared among the four of us.\n\n", "spicy bulgogi was okay ", "- i'm not the biggest fan of bulgogi to begin with, but the homies seem to enjoy this with rice.\n\n"], "author": "Eliza D.", "review": "came here with nomming teammates last weekend; Missy A. decided to treat us all to dinner (we are pretty sure she did something she shouldn't have done at the halloween party the night prior...hmmm) and Shin Toe it was, for nommy Korean fare!\n\nRolled in at around 8.30pm on a Saturday night, waited for about 15 minutes outside. Ordered the fail-safe fried chicken and seafood pancake, also ordered the kimchi bimbimbap and spicy bulgogi, all to be shared among the four of us.\n\nFried chicken satisfied our cravings for sure - fingers were licked and crispy, juicy battered chicken pieces reduced to bones in double time.\nseafood pancake was addictive - crispy around the edges and the batter was not cloyingly thick. not too generous in terms of seafoodiness though, but it wasn't complaint-level skimping.\nkimchi bimbimbap was just meh - it could have been spicier, kimchier, better, it was really quite bland. however! we were starving - at least i was - and so, found this to be quite enjoyable. the crispy bits of rice at the bottom, i scraped. shamelessly.\nspicy bulgogi was okay - i'm not the biggest fan of bulgogi to begin with, but the homies seem to enjoy this with rice.\n\ngot the free bowl of tofu soup; flat tasting, but we dumped in the fiery-looking (not so fiery-tasting) dipping sauce that came with the banchan, and it made the soup taste better.\n\nShin Toe was literally, my first ever food experience in San Francisco when I got my fobby self here so and so many years ago. Got off the plane at SFO just as the sun was setting, took a cab to my homie's place on Taraval, slipped into a 40-minute nap, fought blustery winds as we trekked five blocks to the restaurant.........where my tummeh was filled with love. i believe i will always have a soft spot for this place.", "rating": 4, "date": "2011-11-02"}, {"excerpts": ["The tofu soups are pretty good and the bulgogi has a nice marinate.  ", "They close on sunday though."], "author": "Z G.", "review": "The bibimbap is very good.  I like that some dishes come with complementary soup or fish.  The tofu soups are pretty good and the bulgogi has a nice marinate.  They close on sunday though.", "rating": 3, "date": "2014-01-04"}, {"excerpts": ["Highlights include: spicy tofu soup, seafood pancake and pork bulgogi\n\n"], "author": "dr S.", "review": "I was taken here in a half hearted attempt at corporate espionage and since I wasn't paying, I ordered a shit ton of food. \n\nHighlights include: spicy tofu soup, seafood pancake and pork bulgogi\n\nI also drank an entire bottle of OB beer to myself after shots across the street so it was a very surreal experience to say the least. Luckily we were sitting with some VERY rambunctious korean businessmen who ordered a bottle of sake each and were red by the end of the meal.", "rating": 4, "date": "2010-06-03"}, {"excerpts": ["the bulgogi was dry.\n\n"], "author": "Erica L.", "review": "grilled meat lacks flavor. the bulgogi was dry.\n\ncomplementary tofu soup, but then again, their prices are a bit higher than other places. \n\njust an average korean restaurant. very very old decor....", "rating": 3, "date": "2012-11-05"}, {"excerpts": ["I usually go with a group of friends and we order the beef tofu stew, jap chae, pork bulgogi, and pending on who I am with - the octopus. "], "author": "Susy C.", "review": "I'm confused, I thought this place was Shin Toe Bul Yi? Oh well whatever, I still call it the Chicken Deli place, haha. I'm not Korean but I do enjoy Korean food!\n\nI hate hate hate hate hate the long wait for this place sometimes. It gets super crowded around dinner time so I reccomend going either a little later or a little earlier. When there's a wait, you sign your name on a clipboard and if you're lucky, you can grab one of the like, 3 or 4 chairs they have for waiting or you can brave it outside in the damn San Francisco fog. I do not do well with cold. Anyways. \n\nI usually go with a group of friends and we order the beef tofu stew, jap chae, pork bulgogi, and pending on who I am with - the octopus. The watiresses are generally friendly, although sometimes they might forget your water on busy nights. \n\nAfter you're seated, they start you off with a green onion pancake (on the house!) that comes with its own little dipping sauce. I usually find myself fighting my friends to the death for the last piece. If you order a certain amount, they give you grilled mackeral (also on the house).\n\nIt's not the best Korean food there is out there, but they're not shiesty with their panchan (yes they give you seconds if you ask) and it is DIRT CHEAP for Korean. \n\nDefinitely one of my favorites. =)", "rating": 4, "date": "2006-11-30"}, {"excerpts": ["The kalbi and bulgogi were very flavorful + yummy...and the banchan is alot better than freaking Teo.. ... ", ":)  ", "I'd like to come back soon!  "], "author": "Kat C.", "review": "MAN, haven't been back here in a while...their hours are so weird...  :(\n\nBUT we loved the food and the service was EXCELLENT!  They are super friendly and very humble.  I remember I was telling the lady the food was really yummy and she was so thankful :)  We went for lunch and the place was not too busy.  Parking is pretty easy; better than Geary foshow.  The kalbi and bulgogi were very flavorful + yummy...and the banchan is alot better than freaking Teo.. ... :)  I'd like to come back soon!  It's been a while.\n\nAgain, we had excellent service when we went for lunch around 12ish~~", "rating": 4, "date": "2008-12-04"}, {"excerpts": ["the bulgogi was really good\n", "didn't get to try any of the side dishes\n", "the soup with the chewy dumplings and glass noodles was alright\ncomplementary fish was yummy ", "even cold "], "author": "Vicki T.", "review": "disclaimer: i came 30 minutes after food was served (i was late)\n\npancake was okay but sauce was awesome\nsquid dish was okay\nthe bulgogi was really good\ndidn't get to try any of the side dishes\nthe soup with the chewy dumplings and glass noodles was alright\ncomplementary fish was yummy even cold (i was late, remember?)\n\nservice was super nice. they weren't mean about me coming in late (i had gotten lost, okay? i'm new to to the city.) and my party having finished eating already.\n\ni have had better, don't know if i'd travel over just for dinner. appears slightly desolate area but the restaurant itself is cozy and pretty full for a tuesday.", "rating": 3, "date": "2013-07-13"}, {"excerpts": ["We ordered the bulgogi and the \"spicy\" fried chicken. ", "I've always gotten grilled bulgogi that came in a sizzling plate, however it seemed like they only panned fried the ones here. ", "It was just ok. "], "author": "Shirley T.", "review": "I would've never realized that this place was here if I never yelped it out. It's honestly not very memorable based on how it looks from the outside. It's a hole in the wall.\n\nI don't have a spectacular opinion with this place. It's one if those that I would say \"ehhh, it's alright.\" The food is expensive. But what Korean places around here isn't? I always love the complimentary dishes. You can't really screw up on those. What actually surprised me was that they also gave out free spicy tofu soup. That was a good plus most  places would charge about $8 - $10 for that. \n\nWe ordered the bulgogi and the \"spicy\" fried chicken. I've always gotten grilled bulgogi that came in a sizzling plate, however it seemed like they only panned fried the ones here. It was just ok. I personally like the grilled ones a lot more.\n\nMy \"spicy\" fried chicken was a bit disappointing. First of all it was not a bit spicy. Where did my spice go? Secondly I thought they were all kind of dry. Dang...and I had so much high hopes for it. I was so sad after. :(\n\nOh and the service kind of sucked. There was only one lady working and we had to ask her twice before we got what we wanted. \n\nTotal for our bill was about $45 for bugolgi, fried chicken and a bottle of beer.  I don't know. I felt like it wasn't worth that much for just \"ok\" food.", "rating": 3, "date": "2011-02-06"}, {"excerpts": ["Beef Bulgogi - Not as flavorful as other Korean restaurants. "], "author": "Jonathan L.", "review": "Fried Chicken - The thing everyone raves about. It's nothing terribly impressive. The meat is juicy and the portions are huge. It's deep-fried so it can't be too awful in terms of flavor. Good luck arteries.\n\nBeef Bulgogi - Not as flavorful as other Korean restaurants. I think if they used fresher meats, it might be better off.\n\nJap Chae - Not bad. Not bad at all. I liked their noodles and it's a nice change from a meaty meal.\n\nTofu soup - Yummy for the tummy. It's a little spicy but gives the flavors that much more character. Glad this comes with most meals.\n\nOther sides - I like their kimchee, bean sprouts, and the small fishes. The other sides are alright. \n\nThe wait here can be long. Maybe, 1/2 to 1 hour during peak hours (usually 6-7pm until 8pm, not sure about lunch time). The portions are huge and you're practically assured to not go hungry. It's not the best Korean food in the world but it's a pretty good deal for food. Go with a group to get the most out of your money. Otherwise, the bill is somewhat steep.\n\n3.5 stars", "rating": 3, "date": "2010-11-07"}, {"excerpts": ["We ordered the kalbi  and the daeji bulgogi (spicy pork). ", "They were good, but not great. ", "The daeji bulgogi was pretty good too. ", "It wasn't greasy or too spicy. ", "It was just right. ", "The banchan the mains came with were also great. "], "author": "Nicole D.", "review": "Just checked out this place earlier this week with my boyfriend. We didn't know during lunch time they only have to-go boxes, so we were a little disappointed we couldn't order from the whole menu. We ordered the kalbi  and the daeji bulgogi (spicy pork). They were good, but not great. However I compare korean restaurants to my mom's cooking, which almost never wins. \n\nI was expecting a little more seasoning on the kalbi. But they did give you a great amount! And they gave you the bone also which I LOVE. The daeji bulgogi was pretty good too. It wasn't greasy or too spicy. It was just right. The banchan the mains came with were also great. Their kim-chee is great and I loved the bean sprouts.\n\nI've already made plans to go back this week for dinner 'cause I need to try that fried chicken I see everyone raving about! Oh. And to order those LITER beers :D", "rating": 4, "date": "2011-03-08"}, {"excerpts": ["I always order the same thing, Beef bulgogi, Silver noodle, and I tried the pancake once", ", it was pretty good. ", "Overall, it was okay. ", "We come here ", "coz ", "it's closest to our house."], "author": "Lovetoeat A.", "review": "Hubby loves the fried chicken but not so much for me. I always order the same thing, Beef bulgogi, Silver noodle, and I tried the pancake once, it was pretty good. Overall, it was okay. We come here coz it's closest to our house.", "rating": 3, "date": "2012-02-02"}, {"excerpts": ["The bulgogi, calamari, fried chicken (good mother of god), seafood pancake were all really enjoyable. "], "author": "Kenneth L.", "review": "Good. Jolly good.\n\nFood: Everything we got was good, well except the jap-chae - I wasn't all too thrilled about it. The bulgogi, calamari, fried chicken (good mother of god), seafood pancake were all really enjoyable. Their complimentary dishes were really good as well.\n\nService: This is probably what I noticed most of the night. It's one single lady taking orders, cleaning, bringing out the dishes, refilling your water, etc etc...She does it all on her own without showing any frustration, +1 for her. \n\nPrice: A bit on the expensive side, but quality of food is exceptional. \n\nBeen here for years now and will be back.", "rating": 5, "date": "2013-01-04"}, {"excerpts": ["I didn't care for the bbq - kalbi, bulgogi, and chicken were either too tough or too salty.  "], "author": "Josie M.", "review": "5 stars for the chicken only - my friends thought it was okay, but I loved it!  The skin was light and super crispy.  I think they fry it in super hot oil, so hot it practically disintegrates the bones.  The result is fried chicken that tastes almost like gourmet pork rinds.  if you like pork rinds, this is the place to go.\n\nService was okay.  I didn't care for the bbq - kalbi, bulgogi, and chicken were either too tough or too salty.  Actually, alot of items were too salty, now that I think about it!\n\nWill be back for the chicken!", "rating": 5, "date": "2009-04-02"}, {"excerpts": ["They had average side dishes, some what dry beef bulgogi, and tea. ", "We also had to wait about 15 minutes since they dont have that much seating. ", "The portions were not that big as I was still hungry after. ", "There are better korean places out there but this is one of the few in outer sunset that I know of. ", "I would come here if I was craving korean and didnt want to drive that far to get it. ", "Parking as always is a hassle in san francisco."], "author": "Robert Y.", "review": "2.5 \nI got the lunch special here (i think it was about 8 after tax and tip). They had average side dishes, some what dry beef bulgogi, and tea. We also had to wait about 15 minutes since they dont have that much seating. The portions were not that big as I was still hungry after. There are better korean places out there but this is one of the few in outer sunset that I know of. I would come here if I was craving korean and didnt want to drive that far to get it. Parking as always is a hassle in san francisco.", "rating": 2, "date": "2010-08-01"}, {"excerpts": ["I ordered the seafood pan cake, Bibimbap and a bulgogi lunch special. ", "When I ordered the seafood pan cake it thought it was expensive but boyyyyyy was the portion huge. ", "Its good, pretty averageoo, i wouldnt come here just for it. ", "The bulgogi lunch special was just a small lunch special. ", "It wasn't worth it at all. ", "I rather make it myself. ", "The Bibimbap is good and i think this is the reason I come here. ", "I am going to try out the fry chicken next time."], "author": "Benjamin C.", "review": "This is a pretty small hole in the wall. I ordered the seafood pan cake, Bibimbap and a bulgogi lunch special. When I ordered the seafood pan cake it thought it was expensive but boyyyyyy was the portion huge. Its good, pretty averageoo, i wouldnt come here just for it. The bulgogi lunch special was just a small lunch special. It wasn't worth it at all. I rather make it myself. The Bibimbap is good and i think this is the reason I come here. I am going to try out the fry chicken next time.", "rating": 4, "date": "2011-11-20"}, {"excerpts": ["Bulgogi taste original but not worth it. \n\n"], "author": "Joshua M.", "review": "Bulgogi taste original but not worth it. \n\nShredded beef, eggs, and veggies soup taste like water.\n\nFried Chicken was good\n\nIf it wasn't for the chicken and the free fish on the house this place would've got 1 star.", "rating": 2, "date": "2010-11-06"}, {"excerpts": ["Ate the Bulgogi lunch for to go.\n\n"], "author": "Cliff T.", "review": "Ate the Bulgogi lunch for to go.\n\nVery cheap, huge portion. For the price that I paid, I cannot complain much about the taste. Read: cheap taste food", "rating": 2, "date": "2010-05-03"}, {"excerpts": ["We ordered the chicken, jap chae, bulgogi and calamari bukum.  ", "The chicken was pieces of chicken cut up, battered, and deep fried.  ", "the menu mentioned it was a little spicy ", "and i tasted nothing.  ", "the chicken was pretty bland all together.  ", "the bulgogi and calamari bokum was alright.  ", "the calamari tasted a little fishy for me (one of my favoritest dishes in the world is ojineh bokum ", "and it's never been fishy anywhere else!).  ", "also, it wasn't as spicy as how I've had it at other places such as To Hyang on 2nd and Geary.  ", "I didn't try to jap chae but it seem a bit dry.  ", "The rice itself was mushy too. ", ":/  ", "The highlight was, they did give us a free bowl of tofu soup.  ", "Nothing to write home to mom about.  "], "author": "Sally T.", "review": "My boyfriend and I met his mom here for dinner recently and before the day arrived, all my boyfriend could talk about was their fried chicken.  I thought  this must be some good chicken and expected it to be spectacular.\n\nWe ordered the chicken, jap chae, bulgogi and calamari bukum.  The chicken was pieces of chicken cut up, battered, and deep fried.  the menu mentioned it was a little spicy and i tasted nothing.  the chicken was pretty bland all together.  the bulgogi and calamari bokum was alright.  the calamari tasted a little fishy for me (one of my favoritest dishes in the world is ojineh bokum and it's never been fishy anywhere else!).  also, it wasn't as spicy as how I've had it at other places such as To Hyang on 2nd and Geary.  I didn't try to jap chae but it seem a bit dry.  The rice itself was mushy too. :/  The highlight was, they did give us a free bowl of tofu soup.  Nothing to write home to mom about.  it was pretty much broth with chilli peppers and a block of tofu in it.\n\nWould I ever go back?  Maybe if i was in the area.  I live too close to To Hyang to cheat on it ever again!", "rating": 3, "date": "2010-02-08"}, {"excerpts": ["Notable favorites include the pork bulgogi and the spicy sea bass soup. ", "We ran about 18 deep. "], "author": "Perci N.", "review": "\"Yelp invades Korea restaurant, leaves only bones, empty bottles.\"\n\nWe came, we saw, we ate with extreme prejudice. We killed our food dead. Octopus, mackerel, sea bass, beef, pork, chicken, shrimp -- all good, all dead. Notable favorites include the pork bulgogi and the spicy sea bass soup. We ran about 18 deep. With drinks and bloated bellies, the bill ran just under $30 a head.\n\nAs for the restaurant itself, the place is no frills, no atmosphere, all food. We took up half the place, leaving a line of people kind of staring, either in annoyance or in envy. The joint was surprisingly crowded for an early Tuesday night. The waitstaff itself was very attentive and helpful.\n\nAs for the KFC... Korean fried chicken = huge chunks of chicken karaage, fried bone-in. Good, but not up to the hype. I must try elsewhere for comparison. Of course, that means another Yelp invasion...", "rating": 4, "date": "2007-02-14"}, {"excerpts": ["Finally, we had a plate of the bulgogi, along with servings of rice. ", "We waaay over-ordered and had plenty of food to take home. ", "Excellent!"], "author": "Tara M.", "review": "I love this place. I've only been once, but I'll be back. Shin Toe Bul Yi offers delicious Korean food at excellent prices with no frills. You'd never notice this restaurant if you were driving by on Taraval, seeking a promising-looking place to eat. And the decor inside is equally basic. Hip it ain't.\n\nWe enjoyed the green onion pancake to start, which was accompanied by a less-spicy-than-you'd-think red dipping sauce. Next up were the small dishes of banchan. The fried chicken was great -- fresh out of the fryer, moist, full of flavor. We also enjoyed the soft tofu stew, which was spicy but more mild than its bright red color promised. Finally, we had a plate of the bulgogi, along with servings of rice. We waaay over-ordered and had plenty of food to take home. Excellent!", "rating": 4, "date": "2007-05-19"}, {"excerpts": ["Bulgogi - once again, where's the flavor?  "], "author": "Jenny L.", "review": "Fried Chicken - tender, juicy, great texture, but where's the flavor?  I don't understand all the rave about it.  Maybe I was spoiled from San Tung.\n\nJap chae - definitely full of MSG, but at least it wasn't as salty as the last time I had it there.  We could actually finish the whole dish this time.\n\nBulgogi - once again, where's the flavor?  The color also looks quite dull, like the meat's been sitting out for hours unattended like a sad little child.\n\nSoft tofu stew - the tofu was great, and definitely soft.  The soup was okay, too.\n\n+ for front door parking.\n+ for excellent service.\n+ for all the extra side dishes that we asked for.", "rating": 3, "date": "2008-12-11"}, {"excerpts": ["I believe we ordered the fried chicken, some type of tofu soup, and bulgogi. ", "All tasty, all hot and fresh, and she also brought us rice. ", "The food here tastes authentic (well, as authentic as I know - I don't have any Korean friends that live nearby, so I have not tasted \"mom's cooking\"), and has just the right amount of flavor. "], "author": "Jessica S.", "review": "I actually was taken to this place on a group outing several years back, and re-visited it with The Boy last week (now a month, since I've been majorly slacking) on our weekly City Date. He picked Korean, and it was between here at Toyose. I think that Shin Toe Bul Yi has better food than Toyose, but that it's a draw between the two due to the flavored soju (and quirky atmosphere) at Toyose. Shin Toe Bul Yi is not fancy-schmancy on the inside - this is a date place to go to once you have already settled in with the other person, and don't need to impress them anymore. \n\nAnyways, we get in, and they don't give us that \"darn foreigners\" look, and happily and quickly seat us. Water and tea is brought to the table, along with the pan chan dishes. I haven't had a lot of experience with pan chan, but the ones here are tasty. \n\nI believe we ordered the fried chicken, some type of tofu soup, and bulgogi. All tasty, all hot and fresh, and she also brought us rice. The food here tastes authentic (well, as authentic as I know - I don't have any Korean friends that live nearby, so I have not tasted \"mom's cooking\"), and has just the right amount of flavor. Also, one of the nice things about this place is that they give you a free piece of fish when you come here. \n\nKorean food always seems to be a bit more expensive than the other genres of asian food, but Shin Toe Bul Yi won't make you wince when you see the bill.", "rating": 4, "date": "2009-08-19"}, {"excerpts": ["Korean food is pricey anyway, but we still ordered a bulgogi to share and a soon tofu for each of us. ", "I guess I'm used to them adding hella flavor at other K restaurants, so I deem this one the \"natural\" tasting one. ", "Soon tofu wasn't too spicy or kimchi tasting. ", "The bulgogi wasnt too sweet or oily. ", "The service was also very friendly compared to other K restaurants I've been to. ", "Only thing is it takes a big bite outta pocket for lunch- ", "we each threw in 22 bucks w/ tip."], "author": "Thomas L.", "review": "A \"lighter\" tasting Korean restaurant. My friend and I were going to buy fabric for our Halloween costumes, so in order to fuel up for all the thinking and buying, we came here. Immediately, the nice lady brought us some pancakes to munch while we looked through the menu. Korean food is pricey anyway, but we still ordered a bulgogi to share and a soon tofu for each of us. I guess I'm used to them adding hella flavor at other K restaurants, so I deem this one the \"natural\" tasting one. Soon tofu wasn't too spicy or kimchi tasting. The bulgogi wasnt too sweet or oily. The service was also very friendly compared to other K restaurants I've been to. Only thing is it takes a big bite outta pocket for lunch- we each threw in 22 bucks w/ tip.", "rating": 4, "date": "2007-10-30"}, {"excerpts": ["the bulgogi - seasoned decently. ", "seem soggy and i've had better. "], "author": "Kenny L.", "review": "first time in here, this place felt very home-made, and of course it actually is home-made. the kitchen is NOT very far from the dining area which is small too. \n\non a Friday night, the wait was at least 30 mins for a table for two, considering how small their restaurant is and how bad parking is, thats not TOO bad. The garage was an hour wait so we came here. \n\nIt took a little longer, so i opted for to go. \n\nOrdered:\n\n----bulgogi, squid and rice noodles, and the fried chicken.\n the bulgogi - seasoned decently. seem soggy and i've had better. no onions tho? \n\n----the squid and rice noodles was OK. very greasy / oily\n\n----The friend chicken - i like how they weren't oily but it was very dry, the outer part was good and very crunch, needs more seasoning though.\n\nvery disappointed that they ran out of spicy pork and the KOREAN PANCAKE that i specfically came here for. what a bummer. \n\nmaybe i'll come here again and possibly update my review next time.", "rating": 3, "date": "2011-10-25"}, {"excerpts": ["That bulgogi was really effing good.\n\n"], "author": "Le V.", "review": "I brought my roommate here for her first-ever experience with Korean food, and we enjoyed it immensely. That bulgogi was really effing good.\n\nFunny thing was, she went nuts over the house tofu soup that comes with the meal and ended up eating more of that than the Korean bbq. Which, I guess, can be read as a testament to the quality of their cooking.\n\nYou can bet that the next time we're wanting some really effing good Korean, we'll be taking our broke asses back to Shin Toe Bul Yi!", "rating": 4, "date": "2007-05-12"}, {"excerpts": ["The place offers the commonly found entrees like kalbee, beef and pork bulgogi, chap-che, tofu stew, meat or vegetable in sizzling stoneware pot, etc. \n\n"], "author": "aL Z.", "review": "Anyong haseyo...that's the Korean way of saying hi, hello, good morning, good afternoon, good evening...a general welcome. Shin Toe Bul Yi serves home made Korean cuisine that many Koreans and Korean Americans enjoy...a key indicator of authentic Korean food.\n\nThe moment you sit down, they serve you tea along with a pan-fried sticky rice scallion pancake, accompanied with a vinegar based chili green onion dipping sauce. The place offers the commonly found entrees like kalbee, beef and pork bulgogi, chap-che, tofu stew, meat or vegetable in sizzling stoneware pot, etc. \n\nHighlights of the place, however, are the unusual dishes. The crispy moist tasty deep fried chicken. Ne-jang-tang...a stew of pollack roe and cod intestines. Minuh-jigae...sea bass and vegetable in spicy stew. The pork and potato spicy stew. The Korean sausage soup. Tofu with shepherds purse in soy bean paste. \"Hayake\" is the term for ordering the soup or stew without the spiciness. It means white or plain non-spicy soup/stew.\n\nOther entrees worth trying are the sea bass jjim (steamed sea bass in house special sauce), sauted chicken gizzard and vegetables, and steamed skate wings or monk fish.\n\nAll entrees comes with six to eight panchan or small side dishes of pickled vegetables, along with a section of pan-fried mackerel. The entrees are substantial. Prices are very reasonable. Korean meals are best consumed with several cold bottles of soju (Chamisul or Sansoju brands).  Wee-ha-yo!", "rating": 4, "date": "2006-11-13"}, {"excerpts": ["I wanted to order bulgogi ", "but apparently they did not have bulgogi that day. ", "I think they raised their prices because the bulgogi was $18.99!! ", "We ended up ordering a spicy pork dish and the Rice Cake Bok-yi which my friend wanted. ", "Our meal came with a complimentary bowl of rice each, the spicy tofu soup along with the tiny sides. ", "I liked the spicy pork, soup was good, and the rice cake bok-yi was ok. ", "Like last time there was only one waitress ", "so service was slow. ", "I wonder why they just dont hire an extra waitress? ", "I may want to try coming here during lunch between 12pm & 2pm for their $8 special as a cheaper alternative."], "author": "Helen L.", "review": "We got here at around 7pm for dinner and there was a waiting list with four other parties. I think it was only because we were just a party of two that we got seated pretty quickly. I wanted to order bulgogi but apparently they did not have bulgogi that day. I think they raised their prices because the bulgogi was $18.99!! We ended up ordering a spicy pork dish and the Rice Cake Bok-yi which my friend wanted. Our meal came with a complimentary bowl of rice each, the spicy tofu soup along with the tiny sides. I liked the spicy pork, soup was good, and the rice cake bok-yi was ok. Like last time there was only one waitress so service was slow. I wonder why they just dont hire an extra waitress? I may want to try coming here during lunch between 12pm & 2pm for their $8 special as a cheaper alternative.", "rating": 3, "date": "2011-01-01"}, {"excerpts": ["Bulgogi - My favorite dish out of the four, perfectly cooked beef and GOOD CUTS (rare for a korean place) and drowned in korean bbq sauce and tasted great.\n", "3. ", "Spicy Pork - Not my favorite because of the texture - kinda mushy - \n4. ", "Korean Chicken - Tastes like normal Japanese chicken terriyaki to me and wasn't anything special.  "], "author": "Patrick C.", "review": "Really good grilled Korean food.  We had four people and since I didn't know what to order, I let my friend do it.  We had four items and they were quite expensive, but came in quite some large portions, so the value was alright.  We had the following:\n\n1. Fried Chicken - Yum, deep friend and definitely not healthy, but FUN to eat and was definitely tasty.\n2. Bulgogi - My favorite dish out of the four, perfectly cooked beef and GOOD CUTS (rare for a korean place) and drowned in korean bbq sauce and tasted great.\n3. Spicy Pork - Not my favorite because of the texture - kinda mushy - \n4. Korean Chicken - Tastes like normal Japanese chicken terriyaki to me and wasn't anything special.  Well cooked and moist and juciy though.\n\nWe also had a variety of side dishes which were delicious and a complimentary spicy tofu soup that added to our food.  Add this to the rice we were given and this was way too much food.  2-3 plates for 4 people is more than enough.\n\nWe spent about 70 bucks here, quite pricey, but we did order way more than we could eat.  It was good traditional korean bbq beef and yum crispy chicken.", "rating": 4, "date": "2009-04-08"}, {"excerpts": ["We had their Bulgogi Beef and Bulgogi Pork.  ", "Liked their Pork much better.  ", "The beef didn't have too much flavor but there are so many other things to try, we will be sure to order some other things next time.  "], "author": "Mark W.", "review": "Came here a long while back in their infancy and didn't come back for the longest time but always wanted to return so I recently.....\n\nCame here for their Lunch Specials and really enjoyed my meal.  I think they are one of the most fair priced Korean places in the city.  We had their Bulgogi Beef and Bulgogi Pork.  Liked their Pork much better.  The beef didn't have too much flavor but there are so many other things to try, we will be sure to order some other things next time.  Have to try their Fried Chicken and probably the Korean Pancake.  \n\nLunch wise, in addition to the small plates, they even gave some soup, which was cool.", "rating": 4, "date": "2008-05-06"}, {"excerpts": ["We had the pork bulgogi and sauteed bulgogi with calamari.  ", "They were both sooooo good.  ", "The only bad thing is the side dishes were a little bland.  ", "The kimchee obviously need a little more time sitting in it's marinade.  ", "So minus one star for the side dishes.  ", "Also, scallion pancake and tofu stew were given to each table for free.  ", "Definitely will go back for another visit."], "author": "Heidi F.", "review": "The prices here is way cheaper than most other korean restaurant in SF.  Service is quick and friendly.  I went Friday night at 7:45 and waited about 10 minutes for a table.  There was a clipboard that you sign your name on to get a seat.  Only one party in front of us so the wait wasn't too bad.  By the time we finish, there was a crowd of people jamming the door waiting for  a table.  So my recommendation is to go early.  \n\nFood quality overall was above average.  We had the pork bulgogi and sauteed bulgogi with calamari.  They were both sooooo good.  The only bad thing is the side dishes were a little bland.  The kimchee obviously need a little more time sitting in it's marinade.  So minus one star for the side dishes.  Also, scallion pancake and tofu stew were given to each table for free.  Definitely will go back for another visit.", "rating": 4, "date": "2006-09-07"}, {"excerpts": ["their food (i ordered the bulgogi like i do at every new Korean place i go to; it helps me compare it every other Korean place i've been to). ", "it was good, but not as overwhelmingly fantastic as some of these reviews say, nor were the chicken wings and bip-in-bop. ", "good, but Mom's Tofu House in SSF has it beat."], "author": "Mike C.", "review": "a couple of friends have told me a lot about this place...i.e. thee place to go in the Sunset for Korean. seeing how i've never been to a Korean place in the Sunset, i really had nothing to compare it to. from what they said compared to my experience itself, the place was a little disappointing, so to my surprise of how well-rated the place is on here. it's definitely has that classic mom-and-pop feel to the restaurant and isn't the biggest place. combined with bad parking (of course, it's SF!), apparently it gets pretty crowded too, so the wait once you actually find parking can be stomach-grumbling bad. but once you're seated, the service is relatively good for the most part and pretty friendly (our waitress was kind of hot). their food (i ordered the bulgogi like i do at every new Korean place i go to; it helps me compare it every other Korean place i've been to). it was good, but not as overwhelmingly fantastic as some of these reviews say, nor were the chicken wings and bip-in-bop. good, but Mom's Tofu House in SSF has it beat.", "rating": 3, "date": "2011-11-11"}, {"excerpts": ["My wife and I normally order Bulgogi, kim chee chi gae, and the fried chicken.  ", "We absolutely love the pickled radishes.  ", "Delicious!  ", "I'd love to eat their kal bi more, but its a bit pricier compared to the bulgogi."], "author": "Nand D.", "review": "My favorite Korean restaurant.  They always give nice freebies such as korean pancakes or fish.  My wife and I normally order Bulgogi, kim chee chi gae, and the fried chicken.  We absolutely love the pickled radishes.  Delicious!  I'd love to eat their kal bi more, but its a bit pricier compared to the bulgogi.", "rating": 5, "date": "2011-01-07"}, {"excerpts": ["Bulgogi\n3. ", "Tofu soup\n4. ", "Bulgogi & tofu soup was good, but I think you can find it better in My Tofu House at Geary or Pine Restaurant at Noriega.\n\n"], "author": "Natalie S.", "review": "I was there yesterday with my hubby & cousin. We're waiting for 30 minutes & then the waiter made a mistake for giving our seat to other people. She had apologized many times, but still we had to wait another 15 minutes.\n\nWe ordered:\n1. Fried chicken (everybody there ordered it)\n2. Bulgogi\n3. Tofu soup\n4. Jap chae (Korean noodle with beef & vegetables)\n\nI was very disappointed that the Fried chicken was SO plain (KFC's spicy crispy chicken at Geary & 5th-6th street is much better!!!)\n\nBulgogi & tofu soup was good, but I think you can find it better in My Tofu House at Geary or Pine Restaurant at Noriega.\n\nJap chae was also good, nothing special.\n\nSorry, I won't eat there anymore, it's better to me to eat at other Korean Restaurants.", "rating": 2, "date": "2009-01-20"}, {"excerpts": ["kimchi jigae was too sour and the bulgogi was dry and flavorless. "], "author": "elsie k.", "review": "a friend of mine swore that this was one of the best korean restaurants he's ever been to. i should have known better than to listen to a non-korean regarding korean food.\n\nkimchi jigae was too sour and the bulgogi was dry and flavorless. i enjoyed the the fried chicken and the variety of pan chan but that's about it.\n\nif you know your korean food, this isn't the place for you. but if you're not picky and don't know the difference, this is a decent korean spot to grub at.", "rating": 2, "date": "2009-06-05"}, {"excerpts": ["Due to the size of the restaurant, it's not really ideal for parties of more than 6, unless you arrive early or perhaps make reservations\n4) Free ban chan (size dishes) + rice + soon doobu (spicy tofu soup) \n5) Love the bulgogi and spicy calamari bok um \n6) ", "Love the tea (not sure exactly what it is) \n7) ", "Not a fan of the fried chicken like what the other yelpers are raving about \n8) For $30, It was enough to fill two person + two boxes of To Gos! \n9) ", "Some of the stuff really aren't that spicy, so if in fact you do want it spicy, feel free to request it spicy!! \n", "10) ", "I'll definitely come back!"], "author": "Emily L.", "review": "1) Parking can be a pain in the butt\n2) The wait can be long, especially if you arrive after 630pm on weekends\n3) Due to the size of the restaurant, it's not really ideal for parties of more than 6, unless you arrive early or perhaps make reservations\n4) Free ban chan (size dishes) + rice + soon doobu (spicy tofu soup) \n5) Love the bulgogi and spicy calamari bok um \n6) Love the tea (not sure exactly what it is) \n7) Not a fan of the fried chicken like what the other yelpers are raving about \n8) For $30, It was enough to fill two person + two boxes of To Gos! \n9) Some of the stuff really aren't that spicy, so if in fact you do want it spicy, feel free to request it spicy!! \n10) I'll definitely come back!", "rating": 4, "date": "2009-10-24"}, {"excerpts": ["You can't go wrong with either the beef bulgogi or spicy pork bulgogi.  ", "The seafood pancake actually has a lot of seafood!  ", "The place gets super busy after 7:30 pm.  ", "(Learned that on my first visit.)  ", "My girlfriend and I waited for an hour to sit down ", "and I'm glad that we weren't turned off by the wait because I would of never known how good the food was.   ", "They open a couple of hours for lunch and only in \"to go\" containers.  ", "But you're ok to eat in.  ", "It's because they do not have servers during the day."], "author": "Eileen B.", "review": "My friend Katie took me to this place 3 years ago and I've been going here ever since.  I love the food here so much I took my different groups of friends here for dinner & all continue to come here.  It's a hole-in-the-wall place but the food that comes out of the little tiny kitchen is tasty and satisfying.  I'm not Korean but I brought one of my BFF's who is Korean and she said it tasted like home cooking.  It's super affordable!  They throw in a free dish all the time...usually the tofu soup or the grilled mackerel.   I love the fried chicken.  It has a crunchy batter but moist in the inside.  You can't go wrong with either the beef bulgogi or spicy pork bulgogi.  The seafood pancake actually has a lot of seafood!  The place gets super busy after 7:30 pm.  (Learned that on my first visit.)  My girlfriend and I waited for an hour to sit down and I'm glad that we weren't turned off by the wait because I would of never known how good the food was.   They open a couple of hours for lunch and only in \"to go\" containers.  But you're ok to eat in.  It's because they do not have servers during the day.", "rating": 5, "date": "2010-07-26"}, {"excerpts": ["If you like bulgogi , I would look at the places out in the Richmond area. ", "Order the fried chicken, sea bass & the tofu soup!! ", "Also, all the dishes must be about $1-2 less here in comparison to the Richmond places. ", "Great neighboorhood place"], "author": "Jenny W.", "review": "This place used to have a sign Chick n Deli on it. They must have kept the deep fryers. I love the fried chicken here. There aren't too many good Korean places in SF but each place has their signature dishes. If you like bulgogi , I would look at the places out in the Richmond area. Order the fried chicken, sea bass & the tofu soup!! Also, all the dishes must be about $1-2 less here in comparison to the Richmond places. Great neighboorhood place", "rating": 4, "date": "2006-09-29"}, {"excerpts": ["The pancake is pretty big and I love the spicy bulgogi. ", "Definitely give it a try!"], "author": "Lily K.", "review": "Man how many times have I been here.. whenever I'm here with friends we order way too much food. The soup is awesome, but then again I just love soup in general. lol. The pancake is pretty big and I love the spicy bulgogi. Definitely give it a try!", "rating": 4, "date": "2009-01-29"}, {"excerpts": ["I always order \"Bulgogi.", "\" ", "really tasty!!  ", "We also love \"Kimchi.", "\" ", "This Kimchi is No.1 in SF!!!"], "author": "James N.", "review": "I often go to have lunch with my girlfriend here. The food price in lunch time is around $8~9. The food is really delicious!!! I always order \"Bulgogi.\" really tasty!!  We also love \"Kimchi.\" This Kimchi is No.1 in SF!!!", "rating": 5, "date": "2011-01-28"}], "pork bulgogi": [{"excerpts": ["Beef bulgogi, pork bulgogi, chicken teriyaki, and the green onion pancake. ", "Sometimes we'll add the fried chicken or the jap chae."], "author": "Heidi L.", "review": "I love this place. My favorite Korean restaurant EVER. And I live in LA where there's a plethora of Korean eats! I always have to come here whenever I'm back in town visiting my folks. My friends and I pretty much order the same thing every time. Beef bulgogi, pork bulgogi, chicken teriyaki, and the green onion pancake. Sometimes we'll add the fried chicken or the jap chae.", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["The spicy pork bulgogi is the best we've ever had and the fried chicken is delicious.  ", "My wife loves everyting on the menu and it is one of her favorite restaurants.  ", "The green onion pancake is great as well.  ", "The portions are large and they provide alot of complimentary (Korean) appetizers.  ", "It is not the most beautiful place, but dont let that keep you away."], "author": "Steven B.", "review": "We first tried this place 10 years ago when we lived across the street and loved it.  The spicy pork bulgogi is the best we've ever had and the fried chicken is delicious.  My wife loves everyting on the menu and it is one of her favorite restaurants.  The green onion pancake is great as well.  The portions are large and they provide alot of complimentary (Korean) appetizers.  It is not the most beautiful place, but dont let that keep you away.", "rating": 4, "date": "2012-01-07"}, {"excerpts": ["Highlights include: spicy tofu soup, seafood pancake and pork bulgogi\n\n"], "author": "dr S.", "review": "I was taken here in a half hearted attempt at corporate espionage and since I wasn't paying, I ordered a shit ton of food. \n\nHighlights include: spicy tofu soup, seafood pancake and pork bulgogi\n\nI also drank an entire bottle of OB beer to myself after shots across the street so it was a very surreal experience to say the least. Luckily we were sitting with some VERY rambunctious korean businessmen who ordered a bottle of sake each and were red by the end of the meal.", "rating": 4, "date": "2010-06-03"}, {"excerpts": ["I usually go with a group of friends and we order the beef tofu stew, jap chae, pork bulgogi, and pending on who I am with - the octopus. "], "author": "Susy C.", "review": "I'm confused, I thought this place was Shin Toe Bul Yi? Oh well whatever, I still call it the Chicken Deli place, haha. I'm not Korean but I do enjoy Korean food!\n\nI hate hate hate hate hate the long wait for this place sometimes. It gets super crowded around dinner time so I reccomend going either a little later or a little earlier. When there's a wait, you sign your name on a clipboard and if you're lucky, you can grab one of the like, 3 or 4 chairs they have for waiting or you can brave it outside in the damn San Francisco fog. I do not do well with cold. Anyways. \n\nI usually go with a group of friends and we order the beef tofu stew, jap chae, pork bulgogi, and pending on who I am with - the octopus. The watiresses are generally friendly, although sometimes they might forget your water on busy nights. \n\nAfter you're seated, they start you off with a green onion pancake (on the house!) that comes with its own little dipping sauce. I usually find myself fighting my friends to the death for the last piece. If you order a certain amount, they give you grilled mackeral (also on the house).\n\nIt's not the best Korean food there is out there, but they're not shiesty with their panchan (yes they give you seconds if you ask) and it is DIRT CHEAP for Korean. \n\nDefinitely one of my favorites. =)", "rating": 4, "date": "2006-11-30"}, {"excerpts": ["Notable favorites include the pork bulgogi and the spicy sea bass soup. ", "We ran about 18 deep. "], "author": "Perci N.", "review": "\"Yelp invades Korea restaurant, leaves only bones, empty bottles.\"\n\nWe came, we saw, we ate with extreme prejudice. We killed our food dead. Octopus, mackerel, sea bass, beef, pork, chicken, shrimp -- all good, all dead. Notable favorites include the pork bulgogi and the spicy sea bass soup. We ran about 18 deep. With drinks and bloated bellies, the bill ran just under $30 a head.\n\nAs for the restaurant itself, the place is no frills, no atmosphere, all food. We took up half the place, leaving a line of people kind of staring, either in annoyance or in envy. The joint was surprisingly crowded for an early Tuesday night. The waitstaff itself was very attentive and helpful.\n\nAs for the KFC... Korean fried chicken = huge chunks of chicken karaage, fried bone-in. Good, but not up to the hype. I must try elsewhere for comparison. Of course, that means another Yelp invasion...", "rating": 4, "date": "2007-02-14"}, {"excerpts": ["The place offers the commonly found entrees like kalbee, beef and pork bulgogi, chap-che, tofu stew, meat or vegetable in sizzling stoneware pot, etc. \n\n"], "author": "aL Z.", "review": "Anyong haseyo...that's the Korean way of saying hi, hello, good morning, good afternoon, good evening...a general welcome. Shin Toe Bul Yi serves home made Korean cuisine that many Koreans and Korean Americans enjoy...a key indicator of authentic Korean food.\n\nThe moment you sit down, they serve you tea along with a pan-fried sticky rice scallion pancake, accompanied with a vinegar based chili green onion dipping sauce. The place offers the commonly found entrees like kalbee, beef and pork bulgogi, chap-che, tofu stew, meat or vegetable in sizzling stoneware pot, etc. \n\nHighlights of the place, however, are the unusual dishes. The crispy moist tasty deep fried chicken. Ne-jang-tang...a stew of pollack roe and cod intestines. Minuh-jigae...sea bass and vegetable in spicy stew. The pork and potato spicy stew. The Korean sausage soup. Tofu with shepherds purse in soy bean paste. \"Hayake\" is the term for ordering the soup or stew without the spiciness. It means white or plain non-spicy soup/stew.\n\nOther entrees worth trying are the sea bass jjim (steamed sea bass in house special sauce), sauted chicken gizzard and vegetables, and steamed skate wings or monk fish.\n\nAll entrees comes with six to eight panchan or small side dishes of pickled vegetables, along with a section of pan-fried mackerel. The entrees are substantial. Prices are very reasonable. Korean meals are best consumed with several cold bottles of soju (Chamisul or Sansoju brands).  Wee-ha-yo!", "rating": 4, "date": "2006-11-13"}, {"excerpts": ["We had the pork bulgogi and sauteed bulgogi with calamari.  ", "They were both sooooo good.  ", "The only bad thing is the side dishes were a little bland.  ", "The kimchee obviously need a little more time sitting in it's marinade.  ", "So minus one star for the side dishes.  ", "Also, scallion pancake and tofu stew were given to each table for free.  ", "Definitely will go back for another visit."], "author": "Heidi F.", "review": "The prices here is way cheaper than most other korean restaurant in SF.  Service is quick and friendly.  I went Friday night at 7:45 and waited about 10 minutes for a table.  There was a clipboard that you sign your name on to get a seat.  Only one party in front of us so the wait wasn't too bad.  By the time we finish, there was a crowd of people jamming the door waiting for  a table.  So my recommendation is to go early.  \n\nFood quality overall was above average.  We had the pork bulgogi and sauteed bulgogi with calamari.  They were both sooooo good.  The only bad thing is the side dishes were a little bland.  The kimchee obviously need a little more time sitting in it's marinade.  So minus one star for the side dishes.  Also, scallion pancake and tofu stew were given to each table for free.  Definitely will go back for another visit.", "rating": 4, "date": "2006-09-07"}, {"excerpts": ["You can't go wrong with either the beef bulgogi or spicy pork bulgogi.  ", "The seafood pancake actually has a lot of seafood!  ", "The place gets super busy after 7:30 pm.  ", "(Learned that on my first visit.)  ", "My girlfriend and I waited for an hour to sit down ", "and I'm glad that we weren't turned off by the wait because I would of never known how good the food was.   ", "They open a couple of hours for lunch and only in \"to go\" containers.  ", "But you're ok to eat in.  ", "It's because they do not have servers during the day."], "author": "Eileen B.", "review": "My friend Katie took me to this place 3 years ago and I've been going here ever since.  I love the food here so much I took my different groups of friends here for dinner & all continue to come here.  It's a hole-in-the-wall place but the food that comes out of the little tiny kitchen is tasty and satisfying.  I'm not Korean but I brought one of my BFF's who is Korean and she said it tasted like home cooking.  It's super affordable!  They throw in a free dish all the time...usually the tofu soup or the grilled mackerel.   I love the fried chicken.  It has a crunchy batter but moist in the inside.  You can't go wrong with either the beef bulgogi or spicy pork bulgogi.  The seafood pancake actually has a lot of seafood!  The place gets super busy after 7:30 pm.  (Learned that on my first visit.)  My girlfriend and I waited for an hour to sit down and I'm glad that we weren't turned off by the wait because I would of never known how good the food was.   They open a couple of hours for lunch and only in \"to go\" containers.  But you're ok to eat in.  It's because they do not have servers during the day.", "rating": 5, "date": "2010-07-26"}], "pork shanks simmer in house special sauce": [], "tofu kimchee": [{"excerpts": ["The tofu kimchee is really good. ", "The owners are also quite friendly."], "author": "Will C.", "review": "My wife is a huge Korean food fan. Since she moved here from LA she has always been on the look out for really good Korean food. A salesperson at Cowgirl Creamery in the Ferry Building of all places recommended this place and its been great. The tofu kimchee is really good. The owners are also quite friendly.", "rating": 4, "date": "2012-03-25"}], "roll shell mu chim": [], "skate wing mu chim": [], "korean green onion pancake": [{"excerpts": ["Korean Green Onion Pancake ($8.99), \nKalbi=beef short rib ($18.99), \ncalamari bok-um=sauteed calamari/veggies/noodles ($11.99), \nsoft tofu with beef stew ($9.99), \ncomplimentary fried mackerel, \nstandard small plates of side dishes, \nalong with a bottle of so ju ($10.00). \n", "Almost finished everything because all the items were so good - even their tea. ", "As for the fried chicken, it was pretty good the last time we had it. "], "author": "Peter L.", "review": "Update: confirmed, Fridays are still busy, long wait-list even with reservations. So, try to go on another weekday, ey?\nJap-Chae=sauteed noodles (thin, clear) w/veggies/beef ($9.99)\nBul-go-gi=beef rib eye marinated ($18.99)\nsoft tofu w/assorted seafood ($9.99)\nchicken \"small\" pieces - \"little spicy\" (deep fried) ($10.99)\n\nOut of the way to get there, but worth the trip:\nKorean Green Onion Pancake ($8.99), \nKalbi=beef short rib ($18.99), \ncalamari bok-um=sauteed calamari/veggies/noodles ($11.99), \nsoft tofu with beef stew ($9.99), \ncomplimentary fried mackerel, \nstandard small plates of side dishes, \nalong with a bottle of so ju ($10.00). \nAlmost finished everything because all the items were so good - even their tea. As for the fried chicken, it was pretty good the last time we had it. There were probably four, or more, tables that ordered it while we were there.\n\nA repeater-place = good. Got there and there was no line at all - based on previous visits, a star just for that. Plus, another star for the easy to find parking. What's going on? Is it TTET* and people cannot go out as often? Will move this place ahead of Brother's for the fact you don't leave smelling all-KBBQed.", "rating": 4, "date": "2009-04-24"}], "korean seafood pancake": [{"excerpts": ["Korean seafood pancake was hot, crispy and filled with calamari and shrimp! ", "Its served with their special spicy sauce, I wish they gave us more of it because it was enough for only half the pancake. ", "Other things we ordered was he fried chicken and soft tofu soup with seafood. ", "The fried chicken was not so good because it tasted dry and bland. ", "The tofu soup was not piping hot like what I'm used to. ", "My family and I came on a Thursday night for dinner and there was only 1 waitress taking orders, serving, and busing the tables. ", "Though the place is small, it can get really busy! ", "I think this place serves more traditional Korean food and has a lot to offer on their menu. ", "I think maybe lack of staffing can cause the quality to go down. ", "Also, the ventilation is poor so you will smell like Korean BBQ when you leave! ", "So keep the nice clothes at home!"], "author": "Janny S.", "review": "My favorite dish to order is the Japchae - sauteed noodles with vegetables and beef and the Haemul Pageon - Korean style pancake with scallions and mixed seafood. The Japchae has this sweet and salty taste to it that I love! One of the reasons why I love kettle corn. There wasn't a lot of beef in it. I don't remember even eating any. The silver noodles were really good. Korean seafood pancake was hot, crispy and filled with calamari and shrimp! Its served with their special spicy sauce, I wish they gave us more of it because it was enough for only half the pancake. Other things we ordered was he fried chicken and soft tofu soup with seafood. The fried chicken was not so good because it tasted dry and bland. The tofu soup was not piping hot like what I'm used to. My family and I came on a Thursday night for dinner and there was only 1 waitress taking orders, serving, and busing the tables. Though the place is small, it can get really busy! I think this place serves more traditional Korean food and has a lot to offer on their menu. I think maybe lack of staffing can cause the quality to go down. Also, the ventilation is poor so you will smell like Korean BBQ when you leave! So keep the nice clothes at home!", "rating": 3, "date": "2014-08-22"}, {"excerpts": ["Korean seafood pancake  was great!  ", "Server came out with complimentary  delicious grilled mackerel and many more side dishes.  ", "Lots of food on our small table.  ", "The check was little expensive for such a casual crowded place."], "author": "Frank C.", "review": "This place is small and cozy, but always crowded. Had good tofu and seafood soup but a bit on the salty side.  Saw the korean fried chicken on also every table, so we ordered it.  Quite tasty and not greasy.  Korean seafood pancake  was great!  Server came out with complimentary  delicious grilled mackerel and many more side dishes.  Lots of food on our small table.  The check was little expensive for such a casual crowded place.", "rating": 3, "date": "2014-05-20"}], "chicken smallpieces  little spicy": [], "steamed pot sticker": [], "pan fried pot sticker": []}