{"szechuan tea smoked duck": [{"excerpts": ["The szechuan tea smoked duck has great flavor, but is bony (and is meant to be).  "], "author": "Karen W.", "review": "I've been here many times, but took my parents here last night and just had to gush over my love for Sichuan Home.  One of the last remaining legitimate Chinese food places in SF.  The menu is extensive and I do suggest doing your research on what to order, but you can't deny that when it is good, it is excellent.  Food is served hot and service is \"Welcome to my kitchen\" friendly.\n\nALWAYS order: Chef's special fish stew, chef's special vegetable, wonton in spicy sauce\n\nCuttlefish is great, but can get mixed reviews at the table.  The dan dan noodles where too soupy for the connoisseurs, but the noodles themselves were fresh.  Lamb with cumin was delicious, the duck roll was also fantastic.\n\nThe szechuan tea smoked duck has great flavor, but is bony (and is meant to be).  Don't get this if you are confusing it with Peking duck.  \n\nOverall, any misses are made up by the other fantastic dishes.  It gets 5 stars because it's true to what it is and can remind you of how good Chinese food was (pre-Panda Express and PF Chang's Americanization).  You know when all of the neighborhood Chinese people are eating there and ordering jellyfish, you found a good spot.", "rating": 5, "date": "2016-04-14"}, {"excerpts": ["Szechuan Tea Smoked Duck = unique flavor. "], "author": "Fannie S.", "review": "Food = delicious.  There should be a warning about peanuts, EVERYWHERE wherein applicable.  I ended up eating around the peanuts in various spicy dishes.  I usually avoid doing that.  :-(   \n\nBean jelly dish = delicious.  You have to like jelly, otherwise, this dish is worthless to you, as it was to the rest of my table. lol More for me!  (This was one dish that had peanuts in it, and nothing about peanuts on the menu!)\n\nSichuan chicken = perfect. Crispy outside but tender inside. Good flavor.\n\nPumpkin & Salted Egg Yolk = delicious, and slightly different from what I've had in the past.  Pumpkin was cut into strips, resembling fries.  It was a bit sweet, but definitely savory with the salted egg yolk. \n\nSzechuan Tea Smoked Duck = unique flavor. Get ready to gnaw on some bone, too. \n\nFried pork intestines in spicy sauce = awesome.  Crispy but still full of flavor! \n\nService = friendly.  Helpful, too. \n\nPrices = moderate.", "rating": 4, "date": "2014-12-29"}], "chicken and cold noodle in garlic sauce": [], "chicken in chili sauce": [], "shredded pig tripe in chili sauce": [], "cucumber in garlic sauce": [], "pig ear in chili sauce": [], "sliced kidney in chili oil": [], "szechuan style beef": [], "tofu and preserved eggs": [], "bean jelly in chili sauce": [{"excerpts": ["Ordered the spicy fish and Chinese herb, snow pea leaves with garlic, and bean jelly in chili sauce (I think - boyfriend ordered this one in Mandarin lol). ", "The portions here are huge!!  "], "author": "Stella A.", "review": "Ordered the spicy fish and Chinese herb, snow pea leaves with garlic, and bean jelly in chili sauce (I think - boyfriend ordered this one in Mandarin lol). The portions here are huge!!  Between two people, we had about half of the fish dish and bean jelly to take home. \n\nThe difference between that fish and the chef's special fish is that it has the ma la sichuan flavor (so we were told), which is really why you should be here anyway, so we ordered it over the chef's special. I wasn't too blown away by the flavor, but that could also be because we ordered it a little less spicy. It comes on a gas burner to keep it warm, with tons of fish chunks, bean sprouts, and even glass noodle. The snow pea leaves were also pretty standard, but what I really liked was the bean jelly. Again, huge portion with bits of ground meat and hard bean curd, it was sooo good.\n\nBathrooms are in the back, through the kitchen, so you can walk by and have a glimpse/smell of what they're wok-ing. Also, the service was super fast - all our dishes came out within 10 minutes.\n\nMy biggest complaint for this place would be the price. Even with the larger portions, I don't expect to pay $25 for fish. Chinese food is usually a lot cheaper!", "rating": 4, "date": "2015-07-19"}], "jelly fish in garlic sauce": [], "bean curd and special spicy sauce": [], "shredded chicken in pepper sauce": [], "shredded pork in garlic sauce": [{"excerpts": ["Dan Dan noodles, spicy fish (cooked in a pool of chili oil soup at the table), pan fried buns, shredded pork in garlic sauce and onion pancake all made it to the table ", "and then our stomachs, and those are just the dishes whose names I can recall. ", "Definitely looking forward to coming here again!"], "author": "Allie Y.", "review": "Seriously delicious and hot food! Came here for a friend's birthday dinner with a party of 8 and we ate up a storm that formed many beads of sweat on at least a few foreheads. I didn't order so I cannot say what all the dishes are properly called, but pretty much everything we got here was good. Dan Dan noodles, spicy fish (cooked in a pool of chili oil soup at the table), pan fried buns, shredded pork in garlic sauce and onion pancake all made it to the table and then our stomachs, and those are just the dishes whose names I can recall. Definitely looking forward to coming here again!", "rating": 4, "date": "2014-08-18"}], "szechuan style pepper": [], "sliced pork and garlic sauce": [], "nutritional mutton soup": [{"excerpts": ["Nutritional Mutton soup was also a big hit.  ", "I am a big fan of Chinese medicinal soups.  ", "They are pretty hard to find in SF.   ", "Big chunks of lamb/mutton (some more chewy than others), but ", "I was really in it for the broth anyway.\n", "Complimentary seaweed and cabbage was good too, and until the bottom where the chili oil pooled, it wasn't too hot. \n", "I've noticed other reviews mention taming down some of their dishes ", "so it looks like this is a good compromise for those of us who like everything about Sichuan food but the overly spiciness."], "author": "howard t.", "review": "For a Sichuan restaurant, they were very accommodating with requests to tone things down.    Just because I can't handle spice doesn't mean I don't like the other flavors and styles of Sichuan food. \nThe house veggie platter was bizarre and great.  Crispy taro strips, strips of lotus root, green chives and some pine nuts.  Great textures... mild unique flavor.   Can't eat it too fast, as the crispy taro could poke your mouth if you're not careful.  \nGot Cumin lamb and asked for it to be made mildly.  Pretty great. I could have done with even more cumin flavor, but it wasn't overly oily, and no peppers at all.  \nNutritional Mutton soup was also a big hit.  I am a big fan of Chinese medicinal soups.  They are pretty hard to find in SF.   Big chunks of lamb/mutton (some more chewy than others), but I was really in it for the broth anyway.\nComplimentary seaweed and cabbage was good too, and until the bottom where the chili oil pooled, it wasn't too hot. \nI've noticed other reviews mention taming down some of their dishes so it looks like this is a good compromise for those of us who like everything about Sichuan food but the overly spiciness.", "rating": 4, "date": "2013-01-08"}], "house special chicken soup": [], "minced chicken and corn soup": [], "crab meat and fish maw soup": [{"excerpts": ["#Crab Meat and Fish Maw Soup 蟹肉魚肚羹: B+. \n", "Wasn't planning to get this here since I don't think it's one of the Sichuan specialty food ", "but my friends were so eager to get this. "], "author": "Simon C.", "review": "I'm not a big fan of spicy food, and I am giving this place a 5-star?? You can tell how much I like this place.\n\nCame on a Saturday night with 4 other friends. Not a big restaurant but not very crowded. Our server (lady boss?) was very friendly and didn't hesitate to spend time with us explaining items on menu in details.\n\n#Crab Meat and Fish Maw Soup 蟹肉魚肚羹: B+. \nWasn't planning to get this here since I don't think it's one of the Sichuan specialty food but my friends were so eager to get this. Taste was above average; I like the fact that they put a lot of those main ingredients inside, instead of a diluting soup like a lot of Chinese restaurant does.\n\n#Chicken and Red Chili Oil 口水雞: B+.\nThis is a cold appetizer, have never tried this combination before (cold+spicy+chicken). It turned out okay. Chicken meat was pretty tender. The taste was actually slightly bland even from a person can't take spicy like me so if it can be a bit more chili oil it would have been even better.\n\n#Garlic Pea Sprouts: A-.\nNeeded to order some non-spicy food as a balance. Fresh vege, perfect timing of stir fry.\n\n#Chef's Specical Fish Stew: A.\nCan't believe I am giving an A on this super spicy dish! The spic level was quite high, and to achieve that the chef put A LOT of chili and other ingredients inside. By looking at how much ingredients they put to get the taste right you know this place is legit. The fish deeply absorbed the chili sauce and it was super spicy, but I don't know why I could keep eating it (and keep sweating of course) there must be some special formula the chef used to make that chili soup, but yea it was super good.\n\n#Mapo Tofu: A-.\nThis dish could be hit or miss - easy to make but if you don't pay attention to the details it will fail big time. And I loved how they made it there - heavy smell and taste, lots of red pepper and chili, and soft tofu. \n\nOne of the very few spicy food restaurants that I actually don't mind coming back again and again. Need to try more of their dishes next time but the fish stew is a definitely must-get!", "rating": 5, "date": "2015-05-14"}], "seafood and crispy rice soup": [], "pan fried egg soup": [], "chefs special fish stew": [], "spicy fish and chinese herb spice": [{"excerpts": ["I got three dishes- spicy fish and chinese herb spice, dan dan noodles, and chef's special spicy pettitoes.\n\n", "Overall, I would definitely recommend this restaurant to everybody I know, just for the spicy fish and chinese herb spice and the amazing service. ", "The service couldn't be better, and if you come here, the spicy fish and chinese herb spice is a must."], "author": "Derek N.", "review": "This restaurant is amazing. If you are in this area, eating here is a must. The service here was amazing. The people here really made you feel at home right away, and, for me at least, the wait was only 5-10 minutes long. I got three dishes- spicy fish and chinese herb spice, dan dan noodles, and chef's special spicy pettitoes.\n\nSpicy fish and chinese herb spice- 5/5\nTHIS DISH CHANGED THE GAME. Normally I an not a fan of spicy food, and of fish, but this dish made me experience what could only be described as a culinary orgasm. I should mention that I am very sensitive to spicy foods, but this dish still rocked my world. Even though it made the insides of my mouth burn hotter than the flames of hell (not really though, it was just a tiny bit spicier than hot cheetos), my tears were not of pain, but of joy. This is the best chinese fish I have had in my life (no joke). As an added bonus, the fish had NO BONES. This is a must.\n\nDan dan noodle- 4/5\nThis dish is good, but there's nothing really special about it.\n\nChef's special spicy pettitoes- 3.5/5\nWhile I didn't enjoy this dish too much, it wasn't bad either. This kind of dish isn't my style, but if you like these kinds of dishes you should definitely get it. My parents loved it!\n\nOverall, I would definitely recommend this restaurant to everybody I know, just for the spicy fish and chinese herb spice and the amazing service. The service couldn't be better, and if you come here, the spicy fish and chinese herb spice is a must.", "rating": 5, "date": "2016-07-02"}], "grilled fish and mix vegetable in spicy sauce": [], "whole fish and spicy bean sauce": [{"excerpts": ["I was in that neighborhood and saw that Sichuan House had \"29 Whole Fish and Spicy Bean Sauce\" on their menu. ", "The picture looked good and they have a lot of good reviews. ", "That was enough research for me and it was 5 minutes away. ", "We were going to get the fish and some chow mein. ", "When I ordered I asked what type of fish they used. ", "I just wanted to know for reference what I was eating. ", "She immediately said that it's frozen and that some people like frozen and some prefer fresh, but if we wanted fresh fish, the price went to $38 from about $17. "], "author": "Leo S.", "review": "I was in the mood to have a szechuan style whole fish. I was in that neighborhood and saw that Sichuan House had \"29 Whole Fish and Spicy Bean Sauce\" on their menu. The picture looked good and they have a lot of good reviews. That was enough research for me and it was 5 minutes away. We were going to get the fish and some chow mein. When I ordered I asked what type of fish they used. I just wanted to know for reference what I was eating. She immediately said that it's frozen and that some people like frozen and some prefer fresh, but if we wanted fresh fish, the price went to $38 from about $17. She said it's \"just a little bit more\", but that it cost them more for fresh fish. \n\n$38 might be the going rate for that dish in SF. That's ok if it is. But, I chose Sichuan House because they had the dish that I was looking for at a decent price and their reputation. If the menu listed frozen @ $17 and fresh @ $38, that would have been fine, but I didn't appreciate the up-charge.\n\nI didn't want to spend that much and was annoyed about the situation. We got two other dishes that I would describe as mediocre. I'm guessing that maybe when people don't ask any questions about the fish, that they don't offer the \"advice\" that we got. The up-side is that she gave us honest advice.\n\nIf it wasn't for the up-charge, it would have been a 3-star for me.", "rating": 2, "date": "2018-04-06"}], "fish fillet and chinese cabbage in hot chili sauce": [], "chefs special fish and pickled cabbage": [], "grilled fish and chefs special sauce": [], "sichuan spicy sesame fish": [], "pan fried frog and vegetable combo": [], "whole fish and sweet sour sauce": [], "ham beef tripe and pig blood intestine in spicy sauc": [], "frog in spicy sauce": [], "dry fried shrimp lamp and vegetable combo": [], "szechuan style spicy chicken": [{"excerpts": ["I asked for recommendations of the spicy, Sichuan specialties of the chef, and the server ticked off some of my classic favorites, such as Szechuan Style Spicy Chicken ", "(La Zi Ji, but boneless), Sliced Beef in Hot Chili Oil ", "(Shui Zhu Niu Rou), and Fish Fillets in Hot Chili Oil "], "author": "Chris Z.", "review": "This is a preview review, as I've only visited once. I could imagine this restaurant earning 5 stars in the future after I've sampled more of the menu. \n\nI arrived at 10:06 PM after Outside Lands, and I expected them to be closed already, since 10 PM is the posted closing time. However, they seated me, and then another couple groups after me up until about 10:30, so I suppose the real closing time depends on demand and how the staff is feeling on an individual night. This earns them points in my book, because some Chinese restaurants stop seating a half hour BEFORE the posted closing time, which I find infuriating. \n\nThey brought out a couple \"banchan\" like items to the table when I was seated. I believe they were seaweed and a mildly pickled cabbage. This isn't typical at Chinese restaurants, so it was a welcome gift. There is also complimentary tea, as you'd expect. \n\nI asked for recommendations of the spicy, Sichuan specialties of the chef, and the server ticked off some of my classic favorites, such as Szechuan Style Spicy Chicken (La Zi Ji, but boneless), Sliced Beef in Hot Chili Oil (Shui Zhu Niu Rou), and Fish Fillets in Hot Chili Oil (Shui Zhu Yu). \n\nWhen she mentioned the Spicy Tea Smoked Duck, and I knew I had to try it. The duck is smoky, almost ham-like, and it is bone-in, so there is a lot of picking around involved in the eating. If you enjoy La Zi Ji, then this is up your alley. In this case, the duck isn't breaded, but it is stir-fried in the wok with fresh green and dried red chilies, a well as ginger and garlic. It's wonderfully spicy and savory. My only complaint is that the duck was tougher than expected--I don't know whether it is always this way, or if my dish suffered because I ordered it at the end of the night. Only ordering it again, earlier in the day, will tell. \n\nI had expected to also order Sichuan wontons in chili oil (Hong You Chao Shou, literally Red Oil Folded Hands, here called Wonton Soup in Hot and Spicy Sauce), but then I saw Xiao Long Bao (here called Shanghai Style Steam Bun) on the menu. If you know me at all, you know I'm obsessed with XLB, so I had to try them here, even though this is a Sichuanese restaurant, not Shanghainese. The XLB were average, but not outstanding. Most critically they were short on the rich, unctuous, umami flavor that life-changing XLB possess. Next time, I'll try the Hong You Chao Shou instead, which I also love. \n\nService was attentive, even though the staff were eating their customary end-of-the-night meal. \n\nPrices are great, a little less than other Sichuan spots like Z&Y in Chinatown and Sichuan Fusion in Richmond. \n\nNext, I need to visit Sichuan Fortune House in Pleasant Hill, and then I can finally determine which \"Sichuan [living establishment]\" restaurant reigns supreme in my spice-lusting heart (and tummy).", "rating": 4, "date": "2012-08-11"}], "pan fried duck and beer sauce": [], "chicken and taro in spicy sauce": [], "pan fried chicken": [{"excerpts": ["Last night we had our favorite, Chef Special Vegetables, boneless pan fried chicken, pea sprouts and garlic.  ", "That combination is awesome.  ", "We have tried many other dishes over the years, still our favorite Szechuan restaurant.  ", "Service is always good, portions are large, food is always super fresh, the woks are always going.  ", "Fun spot in the hood.   ", "Perfect spicy, creative dishes."], "author": "Carole W.", "review": "Can't believe my last review is so old.  This is a great restaurant if you like Szechuan food.  Every dish is done well.  Last night we had our favorite, Chef Special Vegetables, boneless pan fried chicken, pea sprouts and garlic.  That combination is awesome.  We have tried many other dishes over the years, still our favorite Szechuan restaurant.  Service is always good, portions are large, food is always super fresh, the woks are always going.  Fun spot in the hood.   Perfect spicy, creative dishes.", "rating": 5, "date": "2018-04-05"}, {"excerpts": ["Pan fried chicken with potato and lotus is my all time favorite. ", "Their spicy fish &chinese herb spice tastes authentic and yum. ", "Last but not least, you need to try the pork shoulder with black bean sauce, pork shoulder is tendon and juicy, match with black bean sauce perfectly, highly recommended!!"], "author": "L T.", "review": "My favorite Sichuan restaurant in Bay Area. Excellent food with friendly services. Pan fried chicken with potato and lotus is my all time favorite. Their spicy fish &chinese herb spice tastes authentic and yum. Last but not least, you need to try the pork shoulder with black bean sauce, pork shoulder is tendon and juicy, match with black bean sauce perfectly, highly recommended!!", "rating": 5, "date": "2018-06-26"}, {"excerpts": ["We shared the dan dan and pan fried chicken -- you can choose between boneless and bone in. ", "We also ordered a plate of the garlic cucumber and a plate of the pan fried pork buns. ", "Everything was literally 5/5. ", "Pan Fried Chicken 5/5- Simply amazing. ", "We made sure to order this again on our second trip one week later. ", "We tried a couple new dishes --\n\nBeef Short Ribs - 5/5 similar to the pan fried chicken, but the tender beef pieces still makes it unique and not redundant in flavor. \n\n"], "author": "Priti K.", "review": "When I'm not eating at Sichuan Home, I'm dreaming of eating here. My partner and I came two weekends in a row. It was really that serious. \n\nFirst time was a Sunday afternoon around 3pm. Luckily there was a table ready though the place was packed with big groups enjoying their lunchtime as well. Super authentic! Chinese families were gettin' down with wine and beer and the beloved lazy Susan. \n\nI have not had dan dan noodles in ages. A bowl by itself is large enough to be a huge solo meal. We shared the dan dan and pan fried chicken -- you can choose between boneless and bone in. We also ordered a plate of the garlic cucumber and a plate of the pan fried pork buns. Everything was literally 5/5. The food comes out quickly and so hot.\n\nDan Dan - 5/5 lovely chewy loooong noodles in the chili oil. It was more soupy instead of oily and perfectly done. \n\nPan Fried Pork Buns 5/5- the freshest and softest buns I've ever had. Meat is good, but the bun ins the star here. \n\nPan Fried Chicken 5/5- Simply amazing. We made sure to order this again on our second trip one week later. The dish includes these little bites of fried tofu that has a sour flavor and it's SO GOOD.\n\nGarlic cucumber 4/5- a little pricey for what it is, and I wish they'd add some spices but yummy nonetheless. \n\nSecond time around we had to wait about an hour on a Friday night. The place was packed. Definitely make reservations! We tried a couple new dishes --\n\nBeef Short Ribs - 5/5 similar to the pan fried chicken, but the tender beef pieces still makes it unique and not redundant in flavor. \n\nWontons in chili oil - 5/5 Some of the best I've had. Chili oil flavor is to die for and much different than the dan dan. \n\nThis is our new Chinese go to in the city. Service is great and I'm ready to try out basically everything else on the menu!", "rating": 5, "date": "2015-11-28"}, {"excerpts": ["I got the pan fried chicken with the bone in (bones are optional) and the pea shoot greens with garlic. ", "The food was excellent. ", "I'm not generally a fan of that spice that makes your mouth go numb ", "(I don't know what this stuff is called). ", "I don't like how it tastes. ", "Well in the chicken dish it was used but with moderation. "], "author": "ellen c.", "review": "I'd never been here before today. Right away after I arrived the server brought me a complimentary salad of some sort with picked cabbage. It was tasty\n\nI got the pan fried chicken with the bone in (bones are optional) and the pea shoot greens with garlic. The food was excellent. I'm not generally a fan of that spice that makes your mouth go numb (I don't know what this stuff is called). I don't like how it tastes. Well in the chicken dish it was used but with moderation. Most places I've been that use the numbing spice put way too much in and it overpowers the other flavors. \n\nEven though there was a lot of oil used in both dishes they still tasted light. \n\nThe server was very sweet, friendly and accomodating.\n\nAt the end they gave me a complimentary cold sweet bean soup. I'd never had anything like it before and enjoyed it for its novelty.\n\nAll the other patron's dishes look fresh and very tasty. \n\nI'd come here again.", "rating": 5, "date": "2016-01-30"}, {"excerpts": ["We ordered the Shanghai dumplings, the fish soup, the pan fried chicken, and the spicy cabbage. ", "The food was spicy, but it really wasn't overpowering. ", "Everything is seasoned well and is just high quality in general. ", "The prices are pretty reasonable too, considering how good the food is. ", "I will definitely be back here, and I look forward to ordering new dishes next time (maybe the duck with a side of green beans!)"], "author": "Andrew L.", "review": "This is probably the best Chinese restaurant I have been to in San Francisco. We ordered the Shanghai dumplings, the fish soup, the pan fried chicken, and the spicy cabbage. The food was spicy, but it really wasn't overpowering. Everything is seasoned well and is just high quality in general. The prices are pretty reasonable too, considering how good the food is. I will definitely be back here, and I look forward to ordering new dishes next time (maybe the duck with a side of green beans!)", "rating": 5, "date": "2015-03-15"}, {"excerpts": ["The food is fantastic (except for the pan fried chicken which was so full of bones that each bite was a chore). ", "I will be back, for sure. ", "One more cautionary note - one which the restaurant owners will hopefully read - the bathroom, accessible via the kitchen, was super dirty."], "author": "Morris R.", "review": "Hopefully we caught them on a really busy night; the servers were overwhelmed, so we felt a bit neglected. That said, the people who work here are exceptionally nice. The food is fantastic (except for the pan fried chicken which was so full of bones that each bite was a chore). I will be back, for sure. One more cautionary note - one which the restaurant owners will hopefully read - the bathroom, accessible via the kitchen, was super dirty.", "rating": 4, "date": "2013-05-18"}, {"excerpts": ["Also got the pan fried chicken (or something that had a very similar name) ... ", "my new favorite dish. ", "It's definitely going to be a must order for me every time I go there ", "(it was an improvement over my previous favorite chinese dish which I've been looking for everywhere after getting to San Francisco)"], "author": "Karthik K.", "review": "Went there again tonight - I think we did a better job of ordering because I was even happier than before. Got the Chef's special fish stew (extra spicy), which was excellent. Might be a good idea to ask for a bowl with this to make it easier to eat.\n\nAlso got the pan fried chicken (or something that had a very similar name) ... my new favorite dish. It's definitely going to be a must order for me every time I go there (it was an improvement over my previous favorite chinese dish which I've been looking for everywhere after getting to San Francisco)", "rating": 5, "date": "2013-07-05"}], "chicken wings and garlic sauce": [], "pan fried duck head": [], "chongqing style spicy chicken": [{"excerpts": ["Chongqing Style Spicy Chicken (Medium)\n2. ", "Beef Chow Fun\n3. "], "author": "Lynne T.", "review": "We ordered from here last night for the first time and I definitely think we will be back soon! \n\nThe Food:\nWe ordered 4 dishes:\n1. Chongqing Style Spicy Chicken (Medium)\n2. Beef Chow Fun\n3. Black Mushroom and Tender Green\n4. Lamb in Cumin Sauce (Mild)\n\nThe spicy chicken was very tasty although there were a lot of bones, so probably not suitable for young children.  The beef chow fun was pretty tasty--not the best flavor I've ever had, but was decent.  I really enjoyed both the black mushroom and tender greens and the lamb in cumin sauce.  Both had very good flavors! \n \nWe ordered through the Yelp website and the food took about 25 min.  Upon arrival, the staff was very helpful and friendly!", "rating": 4, "date": "2018-07-02"}], "chicken and mixed vegetables": [], "tofu and mixed vegetables": [], "general chows tofu": [], "spicy tea smoked duck": [{"excerpts": ["Spicy Tea Smoked Duck: very smokey but the duck was very tasty. ", "Served with red chili peppers but not that spicy in my opinion. \n", "- Sauteed Lily Bulbs & Celery & Gingko Nuts, Cashew Nuts, & Macadamia Nuts: tasty veggie dish to accompany all the spice. ", "Ample amount of nuts and greens. ", "Very good.\n- Chicken Wing & Special Sauce: very good! ", "Crispy on the outside, juicy on the inside. ", "Couldn't stop eating these.\n", "- Pork Stuffs & Eggplant ", "In Garlic Sauce: another veggie dish that offered relief from the spices. "], "author": "Jing D.", "review": "I've been here a couple of times and am definitely a fan! Great Sichuan flavors permeate through the restaurant. The menu is massive and decorated with many pictures of food that make you salivate. \n\nI've had some of these dishes-\n- Chef Special Fish Stew: added tofu per hostess recommendation and loved it. Spicy! Lots of fish fillets and great taste.\n- Spicy Tea Smoked Duck: very smokey but the duck was very tasty. Served with red chili peppers but not that spicy in my opinion. \n- Sauteed Lily Bulbs & Celery & Gingko Nuts, Cashew Nuts, & Macadamia Nuts: tasty veggie dish to accompany all the spice. Ample amount of nuts and greens. Very good.\n- Chicken Wing & Special Sauce: very good! Crispy on the outside, juicy on the inside. Couldn't stop eating these.\n- Pork Stuffs & Eggplant In Garlic Sauce: another veggie dish that offered relief from the spices. eggplant is cooked in long slices, which is something I'd never seen before.\n\nThe only thing I've tried that I recommend to skip is their Xiao Long Bao (Shanghai soup dumplings). XLB's is not part of Sichuan cuisine so it's understandable that they didn't taste authentic. \n\nAlso wanted to add, the main hostess / server lady is absolutely hilarious! She is loud and always tries to upsell daily special dishes to you. She's very good and got us to add tofu to our fish stew dish, which we ended up liking very much. She's got a great personality though. I'd go back just to see her walk around and do her thing!", "rating": 4, "date": "2015-10-04"}, {"excerpts": ["The spicy tea smoked duck....omg what great flavors, yes a bit chewy different than traditional peking...", "but I like alot, ma po tofu ", "(every sichuan restaurant should be judged on this) and their's is really good....spicy, hot, flavorful and full of layers...very good. ", "I also ordered Fish Filets In Hot Chili Oil...very oily but still good.....fried fillets in a very spicy sauce. ", "Finally I went out on a limb and tried the  Sauteed Lily Bulbs & Celery & Gingko Nuts, Cashew Nuts, & Macadamia Nuts ....", "yes only a vegan would love this. "], "author": "David G.", "review": "I love really hot food and I love sichuan food especially with tons of peppers and flavors. Plus I am really lazy and somewhat skeptical of Mission Chinese....it is in the mission (the parking is pretty wretched and the reviews have created a hipster haven....someplace I will avoid like the plague)\n\nSo it looks like it is just you and me Sichuan Home. Location....great...close....I can walk ....I like that.\n\nFirst of all the restaurant decor is nice..no it is not tommy toys (thank god) and it looks pretty clean.\n\nSecond the service was pretty nice to me...I have read where some people say they are rude or slow...well yeah if they are busy and you are screaming at them.\n\nThird and most importantly da food. I really like sichuan home food. I ordered for my friends and myself: The spicy tea smoked duck....omg what great flavors, yes a bit chewy different than traditional peking...but I like alot, ma po tofu (every sichuan restaurant should be judged on this) and their's is really good....spicy, hot, flavorful and full of layers...very good. I also ordered Fish Filets In Hot Chili Oil...very oily but still good.....fried fillets in a very spicy sauce. Finally I went out on a limb and tried the  Sauteed Lily Bulbs & Celery & Gingko Nuts, Cashew Nuts, & Macadamia Nuts ....yes only a vegan would love this. I will pass next time.\n\nI like that this restaurant offers unique items: frogs legs, kidneys, trype, Chinese Yam Deep Fired Rolls  anyone???\n\nIf you are a vegetarian....I see you out there....they have an awesome assortment of vegetarian selections.\n\nPrices are very good. \n\nI recommend you come when they are not crazy busy because service will get slow and parking is hell fri sat night.\n\nIf you have delicate stomachs...ask for the pepcid or pepto shot before hand...word up!!!", "rating": 4, "date": "2012-10-29"}, {"excerpts": ["When she mentioned the Spicy Tea Smoked Duck, and I knew I had to try it. ", "The duck is smoky, almost ham-like, and it is bone-in, so there is a lot of picking around involved in the eating. ", "If you enjoy La Zi Ji, then this is up your alley. ", "In this case, the duck isn't breaded, but it is stir-fried in the wok with fresh green and dried red chilies, a well as ginger and garlic. ", "It's wonderfully spicy and savory. ", "My only complaint is that the duck was tougher than expected--I don't know whether it is always this way, or if my dish suffered because I ordered it at the end of the night. "], "author": "Chris Z.", "review": "This is a preview review, as I've only visited once. I could imagine this restaurant earning 5 stars in the future after I've sampled more of the menu. \n\nI arrived at 10:06 PM after Outside Lands, and I expected them to be closed already, since 10 PM is the posted closing time. However, they seated me, and then another couple groups after me up until about 10:30, so I suppose the real closing time depends on demand and how the staff is feeling on an individual night. This earns them points in my book, because some Chinese restaurants stop seating a half hour BEFORE the posted closing time, which I find infuriating. \n\nThey brought out a couple \"banchan\" like items to the table when I was seated. I believe they were seaweed and a mildly pickled cabbage. This isn't typical at Chinese restaurants, so it was a welcome gift. There is also complimentary tea, as you'd expect. \n\nI asked for recommendations of the spicy, Sichuan specialties of the chef, and the server ticked off some of my classic favorites, such as Szechuan Style Spicy Chicken (La Zi Ji, but boneless), Sliced Beef in Hot Chili Oil (Shui Zhu Niu Rou), and Fish Fillets in Hot Chili Oil (Shui Zhu Yu). \n\nWhen she mentioned the Spicy Tea Smoked Duck, and I knew I had to try it. The duck is smoky, almost ham-like, and it is bone-in, so there is a lot of picking around involved in the eating. If you enjoy La Zi Ji, then this is up your alley. In this case, the duck isn't breaded, but it is stir-fried in the wok with fresh green and dried red chilies, a well as ginger and garlic. It's wonderfully spicy and savory. My only complaint is that the duck was tougher than expected--I don't know whether it is always this way, or if my dish suffered because I ordered it at the end of the night. Only ordering it again, earlier in the day, will tell. \n\nI had expected to also order Sichuan wontons in chili oil (Hong You Chao Shou, literally Red Oil Folded Hands, here called Wonton Soup in Hot and Spicy Sauce), but then I saw Xiao Long Bao (here called Shanghai Style Steam Bun) on the menu. If you know me at all, you know I'm obsessed with XLB, so I had to try them here, even though this is a Sichuanese restaurant, not Shanghainese. The XLB were average, but not outstanding. Most critically they were short on the rich, unctuous, umami flavor that life-changing XLB possess. Next time, I'll try the Hong You Chao Shou instead, which I also love. \n\nService was attentive, even though the staff were eating their customary end-of-the-night meal. \n\nPrices are great, a little less than other Sichuan spots like Z&Y in Chinatown and Sichuan Fusion in Richmond. \n\nNext, I need to visit Sichuan Fortune House in Pleasant Hill, and then I can finally determine which \"Sichuan [living establishment]\" restaurant reigns supreme in my spice-lusting heart (and tummy).", "rating": 4, "date": "2012-08-11"}], "chefs special fried chicken": [], "orange peel chicken": [], "orange peel beef": [], "roast duck in the lotus leaf": [], "beef in red chili sauce": [], "salt and pepper beef short ribs": [], "spicy garlic beef short ribs": [], "beef short ribs in black pepper sauce": [], "lamb in cumin sauce": [{"excerpts": ["Lamb in Cumin Sauce (Mild)\n\n", "I really enjoyed both the black mushroom and tender greens and the lamb in cumin sauce.  ", "Both had very good flavors! \n \n", "We ordered through the Yelp website and the food took about 25 min.  ", "Upon arrival, the staff was very helpful and friendly!"], "author": "Lynne T.", "review": "We ordered from here last night for the first time and I definitely think we will be back soon! \n\nThe Food:\nWe ordered 4 dishes:\n1. Chongqing Style Spicy Chicken (Medium)\n2. Beef Chow Fun\n3. Black Mushroom and Tender Green\n4. Lamb in Cumin Sauce (Mild)\n\nThe spicy chicken was very tasty although there were a lot of bones, so probably not suitable for young children.  The beef chow fun was pretty tasty--not the best flavor I've ever had, but was decent.  I really enjoyed both the black mushroom and tender greens and the lamb in cumin sauce.  Both had very good flavors! \n \nWe ordered through the Yelp website and the food took about 25 min.  Upon arrival, the staff was very helpful and friendly!", "rating": 4, "date": "2018-07-02"}, {"excerpts": ["And the other dishes: Lamb in cumin sauce, House special chicken, sweet and sour pork ribs are so yummy with a reasonable price. ", "You won't regret to be dining here!"], "author": "W J.", "review": "I ordered the Garlic Chicken Wings is so delicious, juicy inside with the crispy skin! We ate it all immediately then I realized I forgot to take photo! :p And the other dishes: Lamb in cumin sauce, House special chicken, sweet and sour pork ribs are so yummy with a reasonable price. You won't regret to be dining here!", "rating": 5, "date": "2018-06-22"}], "beef brisket and chinese herb spice": [], "beef and mushroom in spicy sauce": [], "steam intestine and pig blood in spicy sauce": [], "frog in chili sauce": [], "spicy beef short ribs": [{"excerpts": ["5/5\n\nSpicy Beef Short Ribs are good too! "], "author": "Kristie M.", "review": "Every time my parents would come visit me, I would bring them here!  WElove Sichuan food and this place really hits the spot! \n\nI love that they give you complimentary pickled vegetables at the beginning\n\nI definitely recommend the Chef's special fish stew! It's so good, and the portion is massive, so you'll probably have some leftover! 5/5\n\nI also usually order this chicken dish that comes in a bamboo steamer pot (can't remember what it's called exactly) ! It's so good (and not spicy) but I love the sauce it comes with it. 5/5\n\nSpicy Beef Short Ribs are good too! They give you alot of peppers, but don't worry the spice is pretty manageable. \n\nThe only thing I don't recommend is the Lobster Lo Mein... my dad fell once for the waitress pitching it to us as a special. It was a rip off, there was not a lot of lobster and the noodles weren't very flavorful or memorable. \n\nStick with classic Sichuan dishes (dan dan noodles are also solid here!) and you'll be good to go! Also, most dishes are usually a little on the oily-er side!", "rating": 4, "date": "2017-06-15"}, {"excerpts": ["Hot and sour rice noodles, fried calamari, spicy beef short ribs, special vegetable combo, cabbage with pepper oil - my only regret was not bringing enough people along to try more dishes."], "author": "Will R.", "review": "A friend asked David Chang for a Chinese restaurant recommendation in San Francisco and Chang said \"Mission Chinese.\" Another friend asked the chef at Mission Chinese what HIS favorite Chinese restaurant in San Francisco is and he said \"Sichuan Home.\" \n\nThere you have it, folks: the restaurant David Chang would recommend if he knew better.\n\nIt's small and the staff was efficient and patient with our not-speaking-Chinese ways. Hot and sour rice noodles, fried calamari, spicy beef short ribs, special vegetable combo, cabbage with pepper oil - my only regret was not bringing enough people along to try more dishes.", "rating": 4, "date": "2012-07-31"}], "beef and pickled cabbage": [], "beef in special chili sauce": [{"excerpts": ["We ordered the spicy fish & chinese herb spice, chong qing style spicy chicken, sweet and sour fish with pinenuts, pork shoulder in black bean sauce, and beef in special chili sauce. \n", "The spicy fish and Chong Qing spicy chicken are my favorite dishes here. ", "I must to have them every time I come here. \n", "They use fresh fish for the sweet and sour fish with pinenuts while most of the other Sichuan restaurants use frozen fishes. \n", "The beef in special chili sauce is their new item and it is my new favorite now ! ", "The beef is so tasty, I was told that the process of cooking this dish is very complicate. \n", "Overall, I always have great experience at Sichuan Home with their authentic Sichuan food and great service! ", "Servers are very friendly and offer the best services."], "author": "Fei F.", "review": "I love Sichuan food, I usually have dinner here with my family at least twice a month. After I tried lots of Sichuan restaurants in Bay Area, I found out that Sichuan home is the best! I learned from the waitress, their chef is from Sichuan. He has been cooking for more than 20 years. Their Sichuan food is authentic! I had dinner here last week with my family to try out their new dish, I decided to write a review about it to let more people know this great place. \nWe ordered the spicy fish & chinese herb spice, chong qing style spicy chicken, sweet and sour fish with pinenuts, pork shoulder in black bean sauce, and beef in special chili sauce. \nThe spicy fish and Chong Qing spicy chicken are my favorite dishes here. I must to have them every time I come here. \nThey use fresh fish for the sweet and sour fish with pinenuts while most of the other Sichuan restaurants use frozen fishes. \nThe beef in special chili sauce is their new item and it is my new favorite now ! The beef is so tasty, I was told that the process of cooking this dish is very complicate. \nOverall, I always have great experience at Sichuan Home with their authentic Sichuan food and great service! Servers are very friendly and offer the best services.", "rating": 5, "date": "2018-06-25"}], "beef and pickled pepper": [], "roast cumin lamb chop": [], "sour beans and minced pork": [], "pork ribs and pumpkin in black bean sauce": [], "pan fried pig intestine": [], "chefs special pettitoes in pepper sauce": [], "pork kidney in chili sauce": [], "sweet and sour pork ribs": [{"excerpts": ["And the other dishes: Lamb in cumin sauce, House special chicken, sweet and sour pork ribs are so yummy with a reasonable price. ", "You won't regret to be dining here!"], "author": "W J.", "review": "I ordered the Garlic Chicken Wings is so delicious, juicy inside with the crispy skin! We ate it all immediately then I realized I forgot to take photo! :p And the other dishes: Lamb in cumin sauce, House special chicken, sweet and sour pork ribs are so yummy with a reasonable price. You won't regret to be dining here!", "rating": 5, "date": "2018-06-22"}], "pork ribs and breadstick": [], "salt and pepper pork ribs": [], "chefs special bacon in black bean sauce": [], "shredded pork bean curd and celery": [], "szechuan style spicy rice cake and pork": [], "chefs special spicy pettitoes": [], "hunan spicy pork": [{"excerpts": ["Choy, House fried rice and Hunan spicy pork - everything was fresh and tasty. ", "We had enough leftover for another meal. ", "The service is great - our hostess was energetic and enthusiastic.  ", "We will definitely recommend and come back again."], "author": "Josie S.", "review": "First time coming here for a quick lunch - the value alone (price vs portion) is excellent. We (2) ordered combo won ton soup, sauté garlic bok Choy, House fried rice and Hunan spicy pork - everything was fresh and tasty. We had enough leftover for another meal. The service is great - our hostess was energetic and enthusiastic.  We will definitely recommend and come back again.", "rating": 5, "date": "2018-05-01"}], "sichuan spicy pig brian": [], "twice cooked pork and potato": [], "chefs special pork in brown sauce": [], "pork tripe in black bean sauce": [], "black mushroom and tender green": [{"excerpts": ["Black Mushroom and Tender Green\n4. "], "author": "Lynne T.", "review": "We ordered from here last night for the first time and I definitely think we will be back soon! \n\nThe Food:\nWe ordered 4 dishes:\n1. Chongqing Style Spicy Chicken (Medium)\n2. Beef Chow Fun\n3. Black Mushroom and Tender Green\n4. Lamb in Cumin Sauce (Mild)\n\nThe spicy chicken was very tasty although there were a lot of bones, so probably not suitable for young children.  The beef chow fun was pretty tasty--not the best flavor I've ever had, but was decent.  I really enjoyed both the black mushroom and tender greens and the lamb in cumin sauce.  Both had very good flavors! \n \nWe ordered through the Yelp website and the food took about 25 min.  Upon arrival, the staff was very helpful and friendly!", "rating": 4, "date": "2018-07-02"}], "pan fried mushrooms": [], "pan fried potato": [], "pan fried cauliflower": [], "pan fried lotus": [{"excerpts": ["- pan fried lotus: they slice the lotus very thin and after it's fried, it almost taste like a lotus chip; would get this again\n- chef's special fried chicken: ", "it's good but has a lot of bones and skin\n"], "author": "Yuchen L.", "review": "This place has been a consistently good Sichuan restaurant in San Francisco. There aren't too many spicy Chinese restaurants in the city overall, so we're glad to have a delicious option when we're craving spicy Chinese food. \n\nTheir boiling fish hot pot is really popular, and for good reason. For people who aren't familiar with Chinese food, they bring it out on a small, personalized burner that keeps the dish hot while you're eating it. This makes the dish more interesting and delicious because the longer the broth is simmering, the more flavorful the dish becomes. Note: they are not joking around with the peppers. It's going to burn going in and coming out. Highly recommend. \n\nWe've also tried the following: \n- hot wonton spicy soup: pretty good, but we've had better (pretty average, wouldn't get it again)\n- pan fried lotus: they slice the lotus very thin and after it's fried, it almost taste like a lotus chip; would get this again\n- chef's special fried chicken: it's good but has a lot of bones and skin\n- pan fried frog & vegetable combo: pretty good, but we've had better\n\nOverall, we're happy to have this restaurant close by! However, it's not quite a five because there hasn't been any outstanding dishes. \n\nLastly, the service has been really great every time we go. They even gave us free pumpkin sesame rice cakes the last time we visited! This dish is delicious but very calorically dense...probably not worth ordering because there's better items to spend your calories on :)", "rating": 4, "date": "2018-09-01"}], "pea sprout in garlic sauce": [{"excerpts": ["2/5\n\nPea Sprout in Garlic Sauce "], "author": "Austin M.", "review": "We recently tried Sichuan Home because we got our hearts set on sichuan cuisine only to discover that Chili Hose is closed on Tuesdays. Not sure how we never noticed before.\n\nI'm sure that Sichuan Home has some dishes they do very well. The servers were very nice, the restaurant was clean and smelled good, and most of the stuff coming out on plates looked good. But, unfortunately, I can only review what I tried. What I ordered was basically just our sichuan go-tos, and I'll address them individually.\n\n\nChongqing Style Chicken (explosive chili chicken, la zi ji) - Texture was unusual. Most places don't use this kind of breading, and I think it's better without. These were kind of halfway between the usual texture and a western-style chicken strip. The flavor was fine, and they give a lot of chicken. 3.5/5\n\nDan Dan Noodles (tan tan) - The dan dan at Sichuan Home were definitely the weakest link for me. There was a lot of ma and not a lot of la going on. In other words, very numbing/tingly but not much else going on. Also, the ultimate noodle sin - mushy noodles. 2/5\n\nPea Sprout in Garlic Sauce (dau miu w/ garlic) - This was exactly as expected. Hard to mess up too bad, but hey, credit where credit is due. 5/5\n\n\nAll in all, I want to try some different dishes. I think that my standard order is not their strength. That place smells sooo good.", "rating": 4, "date": "2018-08-19"}], "a choy in garlic sauce": [], "a choy in black bean sauce": [], "braised green soybean bamboo shoot and winter melon": [], "black fungus and chinese yam": [], "dry shrimp and winter melon": [], "dry shrimp and bai choy": [], "eggplant in garlic sauce": [], "shredded potato in sour and hot sauce": [], "fried tofu vegetable and pork": [], "pumpkin corn taro and salted egg yolk": [], "dry fried string bean and minced pork": [], "sauteed spicy sliced cabbage": [], "sauteed lily bulbs celery gingko nuts cashew nuts and macadamia nuts": [], "dried scallops and tender green": [], "sweet banana taro in hot toffee": [], "dry fried potato and garlic": [], "tofu and broccoli in brown sauce": [], "eggplant and pork in garlic sauce": [], "sauteed lily bulbs celery gingko nuts cashew nuts and peanuts": [], "sweet banana and taro in hot toffee": [], "chefs special vegetable combo": [], "mashed taro with eggplant": [], "pumpkin salted egg yolk": [], "corn and salted egg yolk": [], "taro and salted egg yolk": [], "prawn in lobster sauce": [], "sauteed shrimp and ginko nuts": [], "spicy shrimp in garlic sauce": [], "crispy seafood and mix vegetable roll": [], "sauteed small cuttlefish in x o sauce": [], "pan fried oysters": [], "szechuan style belt fish": [], "pan fired prawn": [], "sour beans and minced pork fried rice": [], "shrimp and scrambled egg chow fun": [{"excerpts": ["I order a shrimp and scrambled egg chow fun and a spicy wonton. ", "The chow fun was pretty bland, and for some reason my noodles were hard in places. ", "The wontons were covered in oil and weren't spicy at all (I can't eat very spicy food so that's saying something). ", "Both dishes also came out warm-- not hot. ", "The waitress also kept on talking to her friends from another table, and did not notice my friend and I until we walked up to the counter. ", "She also gave us the wrong amount of change. ", "Overall, I would not go back."], "author": "Gloria C.", "review": "I was pretty disappointed when I went there today. I order a shrimp and scrambled egg chow fun and a spicy wonton. The chow fun was pretty bland, and for some reason my noodles were hard in places. The wontons were covered in oil and weren't spicy at all (I can't eat very spicy food so that's saying something). Both dishes also came out warm-- not hot. The waitress also kept on talking to her friends from another table, and did not notice my friend and I until we walked up to the counter. She also gave us the wrong amount of change. Overall, I would not go back.", "rating": 2, "date": "2015-12-28"}], "onion pan cake": [], "pieces egg roll": [], "pieces thai style shrimp roll": [], "pieces pumpkin sesame rice cake": [], "sticky rice ballin fermented rice wme": [], "sliced noodle and beef": [{"excerpts": ["Thai style Shrimp rolls - (http://www.yelp.com/user_local_photos?select=fBZKgbU6N4GRWP5SNYkqaA&userid=saJuyv784apZzH--psHZ3Q) \n\n7) Sliced noodle and Beef - (http://www.yelp.com/user_local_photos?select=Ezn9sKmoQlflanGPwOwG3g&userid=saJuyv784apZzH--psHZ3Q) "], "author": "Mike C.", "review": "My recent dining experiences confirm stark contrasts of the culinary diversity of San Francisco.  Whether you enjoy fine dining, casual comfort food, or regional cooking, there is always something for your palate in the City.  \nMy uncle recommended this small neighborhood restaurant that specializes in Sichuan fare and invited other family members to a recent Sunday night dinner.  Getting off work a bit late on Sunday, I arrived to a table already filled with my relatives and food.  I munched from the various plates that were already served.  Here is a summary:\n\nGood\n1) Fish soup (requested not spicy) - Very flavorful and sweet, soft textured fish fillet meat in a clear broth.  \n\n2) Xiao Lung Bao - (http://www.yelp.com/user_local_photos?select=1kqiFhK_YPAI_biQ5SAzEw&userid=saJuyv784apZzH--psHZ3Q) Not sure whether this was delicious because I was famished or the dumplings being served piping hot in the steamer.  There was a decent broth amount in each dumpling (ate two).\n\nOkay\n3) Twice Cooked Pork - Popular Hunan dish that had decent flavor, but not much character as everything was brownish.  Could have used some veggies to give more texture.\n\n4) Szechuan Rice Cakes - (http://www.yelp.com/user_local_photos?select=l1MzUcloh9PTf5PG9rxQTA&userid=saJuyv784apZzH--psHZ3Q) Made spicy, the rice cakes reminded me a bit of elongated gnocchi.  Must eat while hot (temperature) as the rice cakes harden when cold.\n\n5) Crispy Tea Smoked Duck - (http://www.yelp.com/user_local_photos?select=ot7pGsqQUVy6kjoUd-z3mQ&userid=saJuyv784apZzH--psHZ3Q)\n\n6) Thai style Shrimp rolls - (http://www.yelp.com/user_local_photos?select=fBZKgbU6N4GRWP5SNYkqaA&userid=saJuyv784apZzH--psHZ3Q) \n\n7) Sliced noodle and Beef - (http://www.yelp.com/user_local_photos?select=Ezn9sKmoQlflanGPwOwG3g&userid=saJuyv784apZzH--psHZ3Q) Everything about this was very plain... meat, noodles, and broth.\n\n8) Shrimp kebab in hot sauce - (http://www.yelp.com/user_local_photos?select=9-Uk5UzpWkP5FStzsjI-fA&userid=saJuyv784apZzH--psHZ3Q)  Again, nothing memorable... flavor, texture.  Be careful when eating as the fluids in the heads will spurt upon biting.\n\nMy cousin who coincidentally is a fellow Yelper asked me about my star rating during the meal.  Being diplomatic, I told her that I wasn't sure yet.  The service was prompt and efficient as the dishes were quickly carted out in rather speedy intervals.  I added the rice cakes late in the meal and it arrived within five minutes.  The chef probably noticed the number of dishes that we ordered and generously prepared us a complimentary dessert of red bean paste pumpkin rolls.  One table ordered their hot pot and it looked interesting, but, like our meal, didn't look like anything particularly special.\nThanks, Uncle, for a decent meal... and sorry that you learned that they are Cash Only.  Be prepared people.", "rating": 3, "date": "2013-05-01"}], "dan dan noodle": [{"excerpts": ["Dan Dan noodle was a big disappointment and they still\nCharged me even tho ", "I didn't eat it. ", "Only had one bite. \n", "The fish soup was good. ", "The tofu with duck egg and the spicy beef were good. ", "My sister liked the pumpkin rice cake I thought It was to oily and blah.\n", "I prob will never return here bcuz it's out of the way and way better places to get dandan noodles and similar food"], "author": "Lika G.", "review": "Dan Dan noodle was a big disappointment and they still\nCharged me even tho I didn't eat it. Only had one bite. \nThe fish soup was good. The tofu with duck egg and the spicy beef were good. My sister liked the pumpkin rice cake I thought It was to oily and blah.\nI prob will never return here bcuz it's out of the way and way better places to get dandan noodles and similar food", "rating": 3, "date": "2018-10-15"}, {"excerpts": ["But of course I'm a dan dan noodle junkie, or simply a noodle of all form junkie especially for lunch. ", "There must be 10 variation of dan dan noodle. ", "This one comes in a brown chili sauce in the texture of a  gravy w/ a dap of chili oil covered w/ minced beef or pork.  ", "Other variations are either in a clear chicken/pork broth, peanut sauce w/ coconut milk, or no sauce at all ", "just w/ ", "a meat veggie topping. ", "Never been here for dinner & usually packed in the evenings when I past by."], "author": "Stevie C.", "review": "My personal favorite lunch dish is their dan dan noodles spicy HOT. But of course I'm a dan dan noodle junkie, or simply a noodle of all form junkie especially for lunch. There must be 10 variation of dan dan noodle. This one comes in a brown chili sauce in the texture of a  gravy w/ a dap of chili oil covered w/ minced beef or pork.  Other variations are either in a clear chicken/pork broth, peanut sauce w/ coconut milk, or no sauce at all just w/ a meat veggie topping. Never been here for dinner & usually packed in the evenings when I past by.", "rating": 3, "date": "2016-09-25"}, {"excerpts": ["I went there last night ordered pan fried shrimp&lamb and Dan Dan noodle. ", "They were pretty plain, tasteless ", "and I was pretty upset coz ", "I came for their good review on yelp. ", "Surprisingly, their customer services worth 4stars as they brought the dish back to the kitchen again to make it spicy and served us complimentary green bean soup. ", "I would go there one more time to give them another chance try something different just for their services."], "author": "Jeannie Y.", "review": "I went there last night ordered pan fried shrimp&lamb and Dan Dan noodle. They were pretty plain, tasteless and I was pretty upset coz I came for their good review on yelp. Surprisingly, their customer services worth 4stars as they brought the dish back to the kitchen again to make it spicy and served us complimentary green bean soup. I would go there one more time to give them another chance try something different just for their services.", "rating": 4, "date": "2014-09-02"}], "dry scallops and egg white fried rice": [], "pieces shrimp and chinese yam rolls": [], "pieces pot sticker": [], "wonton in spicy": [{"excerpts": ["Chef's special fish stew, chef's special vegetable, wonton in spicy sauce\n\nCuttlefish is great, but can get mixed reviews at the table.  "], "author": "Karen W.", "review": "I've been here many times, but took my parents here last night and just had to gush over my love for Sichuan Home.  One of the last remaining legitimate Chinese food places in SF.  The menu is extensive and I do suggest doing your research on what to order, but you can't deny that when it is good, it is excellent.  Food is served hot and service is \"Welcome to my kitchen\" friendly.\n\nALWAYS order: Chef's special fish stew, chef's special vegetable, wonton in spicy sauce\n\nCuttlefish is great, but can get mixed reviews at the table.  The dan dan noodles where too soupy for the connoisseurs, but the noodles themselves were fresh.  Lamb with cumin was delicious, the duck roll was also fantastic.\n\nThe szechuan tea smoked duck has great flavor, but is bony (and is meant to be).  Don't get this if you are confusing it with Peking duck.  \n\nOverall, any misses are made up by the other fantastic dishes.  It gets 5 stars because it's true to what it is and can remind you of how good Chinese food was (pre-Panda Express and PF Chang's Americanization).  You know when all of the neighborhood Chinese people are eating there and ordering jellyfish, you found a good spot.", "rating": 5, "date": "2016-04-14"}, {"excerpts": ["we had vegetable dumplings, wonton in spicy sauce and onion pancakes. ", "the wontons were SO GOOD. ", "must order. ", "vegetable dumplings were really good, too. ", "you could tell they had just been made. ", "yum."], "author": "Dana D.", "review": "terrific food, hella friendly server. we had vegetable dumplings, wonton in spicy sauce and onion pancakes. the wontons were SO GOOD. must order. vegetable dumplings were really good, too. you could tell they had just been made. yum.", "rating": 5, "date": "2015-11-18"}], "pieces panfried pork bun": [], "pieces shanghai style steamed bun": [], "pieces pork dumpling": [], "pieces vegetable dumpling": [], "chicken soup noodle": [], "hot and sour rice noodle": [], "hot and sour pig intestine": [], "four pieces egg roll": [], "four pieces pumpkin sesame rice cake": [], "sticky rice ball in fermented rice wine": [], "sichuan style rice cake and brown sugar": [], "white rice": [{"excerpts": ["I have my bowl of white rice ready to eat. ", "Sad to say, this wasn't even THAT spicy nor numbing. ", "The more authentic ones usually have that numbing aroma flavor, but this had none of that. ", "They also put beansprouts and some glass noodles on the bottom ", "(That's a first I ever had it like that). ", "The portion was HUGE though. ", "But yeah, sorry, taste wise "], "author": "Fiona L.", "review": "Sorry to upset you guys, but I was pretty disappointed with the food. I heard so much promising things about this restaurant, but was left to come here sparingly. \n\nThe restaurant is tiny and I had to share a table with another family. My brother and I came here just for one particular item: Chef's specialty Boiled Fish (supposedly extra spicy). Presentation wise looks exactly like how it should be; lots of pepper, spices and pretty darn red. I have my bowl of white rice ready to eat. Sad to say, this wasn't even THAT spicy nor numbing. The more authentic ones usually have that numbing aroma flavor, but this had none of that. They also put beansprouts and some glass noodles on the bottom (That's a first I ever had it like that). The portion was HUGE though. But yeah, sorry, taste wise I've definitely had way better.\n\nI also ordered string beans with minced beef as string beans is one of my favorite veggie dishes. The beans came out to be another disappoint, too. It wasn't crunchy as it should be. Instead it was soggy and tasteless (supposed to be garlic flavored). \n\nBesides their \"ok\" food, I would like to give props to the staff for being very friendly and attentive though. They even offered my shared table a free order of \"xaio long bao\" (steamed soup dumplings). \n\nI suppose I will give this place another try to justify the 5 stars that many people gave this place. But for now, this one isn't on my yummy list.", "rating": 3, "date": "2014-06-01"}, {"excerpts": ["They only had white rice. "], "author": "Foodlover B.", "review": "The place was empty the entire time we were here for lunch on a rainy Wednesday afternoon.  No lunch specials on menu :(\n\nThe daughter loved their spicy fish. I was shocked how pricey it was compared to other restaurants in the city with similar item.\n\nThey only had white rice. We wanted brown.\n\nThe onion pancakes were awful.\n\nThe service was super sweet and fun and nice.", "rating": 3, "date": "2014-11-19"}]}