{"owls howl espresso": [{"excerpts": ["Also ended up taking a 3/4 pound of owls howl espresso blend, it smells so damn good ", "I wish I could eat it."], "author": "Paul A.", "review": "These guys know their coffee and beans. Extremely knowledgeable and helpful. As of right now there's still construction so it's just a makeshift coffee cart near the entrance. \n\nHad a delicious espresso that was mild creamy and full of flavor, deep honey with some citrus. \n\nAlso ended up taking a 3/4 pound of owls howl espresso blend, it smells so damn good I wish I could eat it.", "rating": 5, "date": "2011-01-10"}, {"excerpts": ["Bought a pound of Owls Howl Espresso."], "author": "ruby l.", "review": "Superb coffee. Discovered this amazing roastery when I was at the Marin Bikes factory store  across street.   Spartan and lovely inside. I imagine Julia Morgan might of designed this roastery.  My latte was fantastic. We all watched another batch of coffee being roasted.  Bought a pound of Owls Howl Espresso.", "rating": 5, "date": "2012-12-26"}], "burundi kiryama kayanza single origin espresso": [], "decaf ea colombia  la serrania huilatolima": [], "blueboon blend": [{"excerpts": ["We snagged a Blueboon Blend (household favorite of ours) and the Yetatebe, Shakisso (excited to try this for the first time). \n\n"], "author": "John A.", "review": "Very hard to beat! Have been an avid Sightglass consumer for some time now. \n\nThe atmosphere of this new locale is beautiful. Very modern and relaxing. The service is cordial and very quick. \n\nCoffee is oh so smooth - always bags of newly minted beans as well. \n\nWe snagged a Blueboon Blend (household favorite of ours) and the Yetatebe, Shakisso (excited to try this for the first time). \n\nTheir cappuccinos and almond milk lattes are delicious as well.", "rating": 5, "date": "2017-08-12"}, {"excerpts": ["I'm excited to try their other blends, but you can't really go wrong with the basic Blueboon Blend!"], "author": "Hurjane V.", "review": "If I lived in the area, I would totally just come here and chillax! I came here on a Sunday afternoon around 3 pm to rest my feet since I walked around the city for a bit already. The location isn't super ideal since the area isn't exactly bustling. However, it's a nice place for a piece of mind amidst the quick footsteps! \n\n+1 Beautiful architecture! I really love how they utilize the natural California sunshine to brighten up the place. \n+1 Two stories high! The top is packed with lots of tables for group study sessions. There is also a \"bar\" up here, if you wanted to order affogatos. \n+1 cheap prices! Oh hey! Not overpriced coffee and great quality too. \n+1 The \"WC\" are gender neutral! Though there isn't a clear line of where it starts....but everyone is courteous and somehow formulates a line.\n+1 How exciting is it to watch the unexcited man do his job of roasting gallons and gallons of coffee beans...but seriously though, turn that frown upside down! \n+1 Their \"for here\" mugs are the most soothing things ever. I could just holding it forever...(you'll know what I mean when you order something from here.) \n\n-1 Only downside is that they don't have WIFI....WUT. So I could only stare into space and converse with the people around me.\n\nOverall, love the place. I'm excited to try their other blends, but you can't really go wrong with the basic Blueboon Blend!", "rating": 4, "date": "2016-10-24"}, {"excerpts": ["I bought a bag of Owl's Howl, another of the Blueboon Blend, and ordered a latte. ", "Enjoyed the Blueboon Blend about as much once I got home, especially given the limitations of not having my own setup. ", "With some help from a wonderful barista friend, pulled some shots of the Owl's Howl and got pretty buzzed after going through the entire bag in less than an hour. ", "I probably didn't do it justice, but seriously, nothing but praise for this place."], "author": "Eddy P.", "review": "I left a law school final exam early so I could catch a train from Berkeley to SF in time to grab a cup of coffee from Sightglass before leaving the Bay for the holidays. I'm so glad I did.\n\nI was excited to try it but didn't know what to expect (other than good coffee), and I came upon upon a spare little setup, a lone barista manning the storefront in near-darkness, with an iPad for transactions, a partially obscured view of construction work in progress. I bought a bag of Owl's Howl, another of the Blueboon Blend, and ordered a latte. The latte he served me is without a doubt one of the most glorious substances to have ever touched my lips.\n\nEnjoyed the Blueboon Blend about as much once I got home, especially given the limitations of not having my own setup. With some help from a wonderful barista friend, pulled some shots of the Owl's Howl and got pretty buzzed after going through the entire bag in less than an hour. I probably didn't do it justice, but seriously, nothing but praise for this place.", "rating": 5, "date": "2011-01-31"}, {"excerpts": ["blueboon blend ordered...individual care and drip-to-order...taking longer, but a meticulous procedure....small wait and called...", "blueboon cup having darker taste...slightly stronger acidic notes...hint of citrus/fruit flavor...enjoying coffee and mention the pastries fantastic rich...foam artwork lattes...interesting artisan blends and roasts..."], "author": "Hen A.", "review": "modern industrial wearhouse vibe...open sliding glass walls...interiors quite airy...goliath roaster the main display...clean glass, sparkling steel, modern finished wood and smooth concrete interiors...the center stage being the counter, hipsterish baristas and coffee creations...requesting a coffee...what kind?...regular coffee?...a sightglass coffee novice...coffee by the cup menu...taking a simple blend...blueboon blend ordered...individual care and drip-to-order...taking longer, but a meticulous procedure....small wait and called...blueboon cup having darker taste...slightly stronger acidic notes...hint of citrus/fruit flavor...enjoying coffee and mention the pastries fantastic rich...foam artwork lattes...interesting artisan blends and roasts...", "rating": 4, "date": "2012-06-12"}, {"excerpts": ["This place offers excellent espresso drinks, hand-drip coffees and single-origin beans by the pound (I recommend their Blueboon Blend). ", "If you're not yet a coffee addict, I suggest you learn more about the coffee process by attending their coffee cuppings (tastings) available daily. ", "What exactly is the difference you ask in sight/smell/taste between various coffee origins and roastings? ", "What do you mean ", "by bright vs smooth for liveliness, or full-bodied vs medium for body? ", "Well come here to find out and appreciate that cup of coffee even more! ", "I've also had their Blueboon blend; true to its description, I found this blend indeed contained notes of chocolate and citrus, but it was a bit too much on the bright (acidic) end for me. ", "I would still get it every time though if I didn't feel like getting the usual latte/cappuccino. ", "Yes the prices are on the high end, but it's not any different than your standard Blue Bottle/Four Barrel/Philz/Ritual premium prices. ", "Otherwise just go to Starbucks for their cheaper yet burnt coffee. ", "The minimalist atmosphere here is perfect for catching up with friends in the afternoon (and not so much for studying without Wi-Fi or power outlets...", "oh and watching the coffee roaster work its magic is pretty mesmerizing). ", "As a bonus, they're dog friendly and take credit cards. ", "I will be back at least once every week or two."], "author": "Andy C.", "review": "I love this coffee shop right on 7th St in SOMA. This \"coffee shop\" is actually inside a spacious warehouse with great natural lighting and two floors of seating. There is a coffee roaster near the entrance and you can see it in action every day (AFAIK usually in the afternoons). This place offers excellent espresso drinks, hand-drip coffees and single-origin beans by the pound (I recommend their Blueboon Blend). If you're not yet a coffee addict, I suggest you learn more about the coffee process by attending their coffee cuppings (tastings) available daily. What exactly is the difference you ask in sight/smell/taste between various coffee origins and roastings? What do you mean by bright vs smooth for liveliness, or full-bodied vs medium for body? Well come here to find out and appreciate that cup of coffee even more! I guarantee you will never want to drink instant coffee again.\n\nI've had Sightglass' lattes and cappuccinos. The drinks were very creamy and perfectly made. I was definitely wired for several hours after enjoying this piece of espresso heaven. I've also had their Blueboon blend; true to its description, I found this blend indeed contained notes of chocolate and citrus, but it was a bit too much on the bright (acidic) end for me. I would still get it every time though if I didn't feel like getting the usual latte/cappuccino. Yes the prices are on the high end, but it's not any different than your standard Blue Bottle/Four Barrel/Philz/Ritual premium prices. Otherwise just go to Starbucks for their cheaper yet burnt coffee. The minimalist atmosphere here is perfect for catching up with friends in the afternoon (and not so much for studying without Wi-Fi or power outlets...oh and watching the coffee roaster work its magic is pretty mesmerizing). As a bonus, they're dog friendly and take credit cards. I will be back at least once every week or two.", "rating": 5, "date": "2012-02-20"}, {"excerpts": ["Two bucks for a cup of the house Blueboon blend. \n\n"], "author": "Jason B.", "review": "Two buck cup.\n\nInfamous wine: http://en.wikipedia.org/wiki/Charles_Shaw_wine\n\nSoon to be famous coffee: Two bucks for a cup of the house Blueboon blend. \n\nMenu description says something about tasting notes of sweet orange, cocoa and apricot. Perhaps. Found it smooth and the perfect complement to the Sunday paper.\n\nSpace has been finished since my first visit. Upstairs features a birds eye view of the caffeine brilliance happening below. Still modern. Still rustic.\n\nStill just how I like it. All of it.", "rating": 4, "date": "2012-08-28"}, {"excerpts": ["(Blueboon Blend is sometimes out)."], "author": "John K.", "review": "Nice minimalistic interior with the roaster up front.  They roast almost every day, so you can purchase the freshest beans (all bags are dated).  Quality is outstanding, so you pay for it.  There is upstairs table seating as well.  Similar to Four Barrel but less crowded.  I've been able to find parking easily.\n\nTheir beans are medium-roasted, which I have begun to prefer as well.  If you want the freshest, high-quality coffees, this is the place.  Rainbow sells their beans in bulk as well (Blueboon Blend is sometimes out).", "rating": 5, "date": "2012-01-05"}], "decaf ea colombia la serrania huilatolima": [], "ecuador la loja  espindola canton": [], "colombia los rosales jose melito mazabuel": [], "colombia dos productores  huila": [], "colombia finca alcatraz wilfredo ule": [], "rwanda kibuye  gitesi cooperative": [], "rwanda small producers  karenge": []}