{"chinese herbal tea": [], "beijing style yogurt": [], "black plum juice": [{"excerpts": ["I also had their black plum juice. ", "YUM! ", "would definitely order the pitcher next time. ", "It pairs very well with the spice. ", "Service was also very good! ", "Very kind and attentive. "], "author": "Maggie L.", "review": "This place opened up recently near me, and I finally came to try it out this past Sunday night. My boyfriend and his colleagues use to go to Celestial Flame a lot before it closed down, and he was pretty upset because that was his favorite dry hot pot place.\n\nWe ordered the medium sized mala beef tongue pot in medium spicy. HOLY SH*T IT WAS SPICY! Have to say though, We both enjoyed it very much! I've been having this crazy craving for spicy food lately, and this was right up my alley. The beef tongue slices were decently thick, and there were tons of it in our pot! Very soft and tender as well. We also added the wide clear noodles and lotus root to our pot. Fantastic decision. Now if only I was this smart on my final exams...\n\nANYWAYS, I would highly recommend the beef tongue pot! It was more than enough food for two people. I also had their black plum juice. YUM! would definitely order the pitcher next time. It pairs very well with the spice. Service was also very good! Very kind and attentive. I gotta say for being located in DTSF, this place is super clean inside as well. \n\nOur bill came out to be around $40, which is a mad steal considering we had two additional add on items, two drinks, and leftovers. I would totally come back because it's reasonably priced for bomb foodz.", "rating": 5, "date": "2018-04-10"}], "sweet mung bean soup": [], "greet tea": [], "pork ear": [{"excerpts": ["I think only the pork ear I feel a little bit weird of the taste. ", "Last but not least, I love the fried bread. ", "It is a must try one, not so many Chinese restaurants have it and make it so crispy. ", "Of coz there is always a line, but we only wait for like 20 mins. ", "Will come back soon."], "author": "Rainy G.", "review": "Definitely approved it is a really authentic spicy dry pot! Me and my friend love the food here!!! Duck neck is the most favorable, it is spicy enough for me! I should to go some next time! We ordered the combo dry pot with beef tongue and bullfrog. The bullfrog is fresh, and I love it! I think only the pork ear I feel a little bit weird of the taste. Last but not least, I love the fried bread. It is a must try one, not so many Chinese restaurants have it and make it so crispy. Of coz there is always a line, but we only wait for like 20 mins. Will come back soon.", "rating": 4, "date": "2018-03-22"}, {"excerpts": ["The girl sit next table complained to the waitress that the pork ear was not fresh, smell stink. ", "My mom was upset, this place ruined my Mother's Day! ", "The only good thing is if pay cash get 10% off."], "author": "Alice D.", "review": "I celebrate Mother's Day with family in sizzling pot king, it is very disappointed! The frog is not fresh, it is frozen! The fish is tasteless! The girl sit next table complained to the waitress that the pork ear was not fresh, smell stink. My mom was upset, this place ruined my Mother's Day! The only good thing is if pay cash get 10% off.", "rating": 1, "date": "2018-05-15"}], "pork feet": [], "duck head": [], "duck neck": [{"excerpts": ["Duck neck is the most favorable, it is spicy enough for me! ", "I should to go some next time! ", "We ordered the combo dry pot with beef tongue and bullfrog. ", "The bullfrog is fresh, and I love it! "], "author": "Rainy G.", "review": "Definitely approved it is a really authentic spicy dry pot! Me and my friend love the food here!!! Duck neck is the most favorable, it is spicy enough for me! I should to go some next time! We ordered the combo dry pot with beef tongue and bullfrog. The bullfrog is fresh, and I love it! I think only the pork ear I feel a little bit weird of the taste. Last but not least, I love the fried bread. It is a must try one, not so many Chinese restaurants have it and make it so crispy. Of coz there is always a line, but we only wait for like 20 mins. Will come back soon.", "rating": 4, "date": "2018-03-22"}], "duck gizzard": [{"excerpts": ["We had Griddle Cooked Beef pot and Cooked Duck Gizzard.\n", "We got food poisoning... "], "author": "Iguanatte S.", "review": "The waiter said \" we close soon, but take your time and enjoy your food \"\n\nAfter that, one skinny girl came and said \" we close, go home '\n\nomg.... what a rude......\n\nWe had Griddle Cooked Beef pot and Cooked Duck Gizzard.\nWe got food poisoning... even thought all food were cooked....\n\nnever come back.....", "rating": 1, "date": "2018-05-29"}, {"excerpts": ["I ate duck gizzard with mala sauce ", "and it's nice though my mouth and tongue became tingling as it's spicy."], "author": "Keisuke W.", "review": "Excellent restaurant that serves Chinese hot pot. I ate duck gizzard with mala sauce and it's nice though my mouth and tongue became tingling as it's spicy.", "rating": 5, "date": "2018-09-12"}], "wuhan hot dry noodle": [], "house special bean curd stick": [], "house special cucumber": [], "house special kelp": [], "steamed creamy custard buns": [], "steamed and fried chinese bread": [{"excerpts": ["If you have space for desserts and appetizer, make sure to try out their duck necks, pumpkin pancakes, and Steamed and Fried Chinese Bread.\n\n"], "author": "Angel C.", "review": "I love their Sunnyvale location and was delighted when they opened up one in the city. I don't understand why it's not more packed all the time, their sizzling pots are delicious.\n\nMy usual combo is medium size (good for 4) with hot and spicy (medium spicy level). I have tried almost all of the meat options and I enjoy all of them. For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. If you have space for desserts and appetizer, make sure to try out their duck necks, pumpkin pancakes, and Steamed and Fried Chinese Bread.\n\nPrice-wise this place is very reasonable, especially if you have a big group. I usually spend around $25 here after tax+tip.", "rating": 5, "date": "2018-08-24"}, {"excerpts": ["Other dishes there that we love: fried potstickers, pumpkin cake, and the steamed and fried chinese bread with condensed milk. \n\n"], "author": "Harris L.", "review": "I've already been here twice in the last few weeks. We always get the garlic sauce, which is delicious. \n\nAfter you choose a base (we like chicken), you can add as many toppings as your want. We always select fried tofu and instant noodles, which really soak up the sauce. I might even get double orders of the fried tofu next time, because it is so tasty!\n\nNOTE that the size of the pot only affects how much of the base you get. The amount of topping appears to be to same. So if you get a lot of toppings like we usually do, you will not see a noticeable difference between the medium and large sizes. \n\nOther dishes there that we love: fried potstickers, pumpkin cake, and the steamed and fried chinese bread with condensed milk. \n\nExpect a wait on Friday and Saturday nights, unless you get there at opening or after the first round of diners leave around 8-8:30. The restaurant seems to be packed with customers from mainland China, which is a testament to the quality of the food.  \n\nNo complaints about the service. They have plenty of servers, who are always busy, but will come over pretty quickly if you waive them down.", "rating": 4, "date": "2018-04-16"}], "pot sticker": [], "grilled whole tilapia": [], "szechuan style spicy crawfish": [], "hunan style spiced crawfish": [], "fresh spicy crab": [], "small griddle": [], "griddle": [{"excerpts": ["We had Griddle Cooked Beef pot and Cooked Duck Gizzard.\n", "We got food poisoning... "], "author": "Iguanatte S.", "review": "The waiter said \" we close soon, but take your time and enjoy your food \"\n\nAfter that, one skinny girl came and said \" we close, go home '\n\nomg.... what a rude......\n\nWe had Griddle Cooked Beef pot and Cooked Duck Gizzard.\nWe got food poisoning... even thought all food were cooked....\n\nnever come back.....", "rating": 1, "date": "2018-05-29"}], "griddle combo": [], "lb griddle cooked crawfish": [], "napa cabbage": [], "soybean sprouts": [], "daikon": [{"excerpts": ["Between the two of us, we ordered the large hot pot with extra pork belly, mushrooms, and daikon with a bowl of rice. ", "Let's just say that we took about half of it home ", "haha the portions are pretty generous and the flavors were spot on. ", "I loved the spiciness and tingling sensations I got after eating to my fullest. ", "The ingredients were tasty and fresh! ", "Can't wait to come back for more!"], "author": "Ada C.", "review": "I've been craving dry hot pot since my friend first took me in NYC, so he took me to this SF dry hot pot and wow it was pretty amazing! The restaurant is not located in the best area so I would definitely Uber here. It's a somewhat small restaurant too so you might have to wait for dinner time. It's got a foreign vibe to it, which always means it's quite authentic. \n\nBetween the two of us, we ordered the large hot pot with extra pork belly, mushrooms, and daikon with a bowl of rice. Let's just say that we took about half of it home haha the portions are pretty generous and the flavors were spot on. I loved the spiciness and tingling sensations I got after eating to my fullest. The ingredients were tasty and fresh! Can't wait to come back for more!", "rating": 5, "date": "2018-05-10"}], "cabbage": [{"excerpts": ["Tips:\n- get the medium pot, it's pretty much the same size as the large pot\n- avoid watery ingredients like cabbage or tofu as that defeats the purpose of dry pot. ", "stick to the hard, firm ingredients \n", "- wash down the oily spice with a can of cold herbal tea"], "author": "Michelle R.", "review": "Good place to get dry pot. It's not the best dry pot but it hits the spot, especially if you order the right ingredients. The flavors are pretty good!\n\nSome of my faves are cauliflower, quail egg, and celtuce. I do wish their potato was cut into thin slices instead of fry-like batons.\n\nTips:\n- get the medium pot, it's pretty much the same size as the large pot\n- avoid watery ingredients like cabbage or tofu as that defeats the purpose of dry pot. stick to the hard, firm ingredients \n- wash down the oily spice with a can of cold herbal tea", "rating": 4, "date": "2018-08-05"}, {"excerpts": ["Me and my friend shared a medium spicy sparerib bowl with ramen noodle (a must), cabbage, and lotus root. ", "It was large enough that we had leftover. ", "It could probably be shared between 3 people perfectly. ", "Everything was super flavorful and definitely SPICY. "], "author": "Anna H.", "review": "This place opened up recently near my house and I've been wanting to try it for a long time. When it first opened the lines were crazy long and out the door but not anymore. \n\nMe and my friend shared a medium spicy sparerib bowl with ramen noodle (a must), cabbage, and lotus root. It was large enough that we had leftover. It could probably be shared between 3 people perfectly. Everything was super flavorful and definitely SPICY. Can imagine myself being a regular here.\n\nWasn't the biggest fan of the sparerib as a protein will try another meat next time.", "rating": 5, "date": "2018-03-28"}], "potato sticks": [], "silk noodle": [], "instant noodles": [{"excerpts": ["I added some instant noodles for my carbs (instead of paying extra for a side of rice) and that was a delicious choice.  ", "Loved how the chili oil really clung to each noodle.  ", "Only downside was that the noodles were placed on the bottom and some were scorched then stuck to the pot partway through the meal.  ", "I had mixed feelings about the beef short ribs.  ", "They were delicious, but super awkward to eat.  ", "It's look like someone took a Korean short rib and cut each rib into like 6 pieces, sure to cut through every big bone piece to make smaller bone pieces.  ", "Took a lot of concentration so not to chip your tooth on a bone or accidentally swallow a shard!"], "author": "Adam B.", "review": "Such a fun and memorable meal.  A huge vat of cooked-to-order spicy food, with a burner placed underneath so the oily sauce bubbles while you eat.  Perfect for sharing, though gorging by yourself is definitely a possibility too.  Lunchtime seems a lot less crowded than dinnertime.\n\nSpicy & Hot Beef Short Rib w/ Instant Noodle (Very Spicy option): I ordered the spiciest option and was not disappointed.  Reminds me of the spicier dishes at some really good Sichuan restaurants in Chinatown.  Except something magical happens with the bubbling/sizzling; the liquid vaporizes a little so you might be inhaling spices if you don't wait for your food to cool down.  This could be good or bad, depending on how much you like aromatic spices.  Of the default veggies, I really liked the fried potato chunks.  They did an awesome job of absorbing the chili oil.  The celery created a cooling contrast to the spicy sauce.  The sprouts and cauliflower were boring though.  I added some instant noodles for my carbs (instead of paying extra for a side of rice) and that was a delicious choice.  Loved how the chili oil really clung to each noodle.  Only downside was that the noodles were placed on the bottom and some were scorched then stuck to the pot partway through the meal.  I had mixed feelings about the beef short ribs.  They were delicious, but super awkward to eat.  It's look like someone took a Korean short rib and cut each rib into like 6 pieces, sure to cut through every big bone piece to make smaller bone pieces.  Took a lot of concentration so not to chip your tooth on a bone or accidentally swallow a shard!", "rating": 4, "date": "2018-07-30"}, {"excerpts": ["We always select fried tofu and instant noodles, which really soak up the sauce. ", "I might even get double orders of the fried tofu next time, because it is so tasty!\n\n"], "author": "Harris L.", "review": "I've already been here twice in the last few weeks. We always get the garlic sauce, which is delicious. \n\nAfter you choose a base (we like chicken), you can add as many toppings as your want. We always select fried tofu and instant noodles, which really soak up the sauce. I might even get double orders of the fried tofu next time, because it is so tasty!\n\nNOTE that the size of the pot only affects how much of the base you get. The amount of topping appears to be to same. So if you get a lot of toppings like we usually do, you will not see a noticeable difference between the medium and large sizes. \n\nOther dishes there that we love: fried potstickers, pumpkin cake, and the steamed and fried chinese bread with condensed milk. \n\nExpect a wait on Friday and Saturday nights, unless you get there at opening or after the first round of diners leave around 8-8:30. The restaurant seems to be packed with customers from mainland China, which is a testament to the quality of the food.  \n\nNo complaints about the service. They have plenty of servers, who are always busy, but will come over pretty quickly if you waive them down.", "rating": 4, "date": "2018-04-16"}, {"excerpts": ["+Pork Belly and get double instant noodles."], "author": "Mari C.", "review": "This meal was SO GOOD! Everything was delicious and the service was on point. Loved every second of this meal. I will definitely be coming back. +Pork Belly and get double instant noodles.", "rating": 5, "date": "2018-07-12"}], "celery": [{"excerpts": ["The celery created a cooling contrast to the spicy sauce.  "], "author": "Adam B.", "review": "Such a fun and memorable meal.  A huge vat of cooked-to-order spicy food, with a burner placed underneath so the oily sauce bubbles while you eat.  Perfect for sharing, though gorging by yourself is definitely a possibility too.  Lunchtime seems a lot less crowded than dinnertime.\n\nSpicy & Hot Beef Short Rib w/ Instant Noodle (Very Spicy option): I ordered the spiciest option and was not disappointed.  Reminds me of the spicier dishes at some really good Sichuan restaurants in Chinatown.  Except something magical happens with the bubbling/sizzling; the liquid vaporizes a little so you might be inhaling spices if you don't wait for your food to cool down.  This could be good or bad, depending on how much you like aromatic spices.  Of the default veggies, I really liked the fried potato chunks.  They did an awesome job of absorbing the chili oil.  The celery created a cooling contrast to the spicy sauce.  The sprouts and cauliflower were boring though.  I added some instant noodles for my carbs (instead of paying extra for a side of rice) and that was a delicious choice.  Loved how the chili oil really clung to each noodle.  Only downside was that the noodles were placed on the bottom and some were scorched then stuck to the pot partway through the meal.  I had mixed feelings about the beef short ribs.  They were delicious, but super awkward to eat.  It's look like someone took a Korean short rib and cut each rib into like 6 pieces, sure to cut through every big bone piece to make smaller bone pieces.  Took a lot of concentration so not to chip your tooth on a bone or accidentally swallow a shard!", "rating": 4, "date": "2018-07-30"}, {"excerpts": ["All dry hot pots come with fried potato, cauliflower, celery, and bean sprouts.\n\n"], "author": "Cherylynn N.", "review": "Cold weather calls for shabu and hot pot. It's all about that steam getting all over ya face like a good facial. Not that kind of \"facial\", you pervs! \n\nThere's not really a shortage of shabu and hot pot places in SF but dry hot pot places? Since Celestial Flame closed, I don't know any restaurant in SF that solely serves this fiery Sichuan specialty. \n\nSo, say hello to Sizzling Pot King that took over the short-loved Thai fusion restaurant: Thoughts Style Cuisine) (https://www.yelp.com/biz/thoughts-style-cuisine-showroom-san-francisco!\n\nSizzling Pot King is a small chain (Sunnyvale, San Diego, Seattle) that serves dry hot pot consisting of meat and veggies with a myriad of chilies and spices that will light your toilet paper on fiyah! Don't worry, there's a non-spicy option. The good thing about dry hot pot is there's no steam so if you have cake face like me, you'll leave with your eyebrows intact and not melted off! \n\nMy coworker and I thought we were beating the lunch rush by arriving at Sizzling King Pot before 11:30 am but we didn't - it was popping! It was packed with Mandarin speaking customers which was a great sign. \n\nSince Sizzling Pot King is in soft opening mode, there's a limited menu. The only apps available are potstickers and mantou (steamed buns).\n\nFor Dry Hot Pot:\n*Choose your proteins (tons of choices): Lamb, pork, beef, rabbit, snails, frog, intestines, tripe, gizzards, tongue, or seafood (lobster, crab, crawfish) are just to name a few.\n\n*Choose your 3 size: Small ($11.99), Medium ($22.99), or Large ($32.99). The small is only available Monday - Thursday. For the large, you can choose two meats. \n\n*Choose your flavor: Hot & Sour, Garlic, Sweet & Sour, or Seafood. \n\n*Choose your spice level: Non-spicy, mild-spicy, medium-spicy, or very-spicy.\n\nAll dry hot pots come with fried potato, cauliflower, celery, and bean sprouts.\n\nYou can customize your dry hot pot with extra veggies, carbs (noodles)and other proteins like spam, sausages, and pig's blood for an extra $.99 to $3.99. \n\nI highly recommend ordering rice ($1.50/bowl) to help balance all the spicy goodness. \n\nNO MSG is used. \n\nMy coworker and I ordered the Large Dry Hot Pot w/ half beef tongue and half beef short ribs ($32.99):  http://bit.ly/2onZ0Ie. Flavor: garlic. Spice: medium-spicy. We added silk noodles ($1.99) which is yam noodles like Korean japchae.\n\nThe meat, noodle, and veggie medley was so good! The beef tongue was sliced thin and tender with a nice bite. Luckily, there was a good amount of beef tongue because the short ribs were all bones (boo!). The noodles and veggies were all cooked well with the proper texture. I loved the fried potatoes for a crunchy texture element. \n\nThe medium-spicy garlic flavor was on-point, aromatic with a good mala numbing spice. The large pot can feed 3-4 people but we couldn't stop digging in for more because of that addictive spice.\n\nFood service took a long time because a group of 20 rolled in before us which delayed the kitchen by 45 minutes. The staff was super apologetic and gave us several updates on when our order was coming. \n\nThey do have a note outside to let customers know orders may take longer than expected because they're in soft opening mode. Not going to dock them for service since they're managing customer expectations which I appreciate. \n\nIt's a small space so it's best for groups of 2-4 people.\n\nParking, well it's SF but it's not as tough in this area since there's not that many commercial businesses on the block. \n\nThere's nothing like Sizzling Pot King in the area so I think they're going to do really well in the hood. I can't wait to return!", "rating": 4, "date": "2018-02-23"}, {"excerpts": ["Each pot comes with a 'vegetable base' like bean sprouts, cauliflower, broccoli, potato, and celery.\n\n"], "author": "Alicia L.", "review": "Most of the hot pot places I know in SF aren't dry hot pot places so I'm really glad we finally have a place nearby for this. Sizzling Pot King is chain, and I believe the closest one to here is in Sunnyvale.\n\nYou basically build your own stir fry by picking the spice level, the protein, and add-ons. I added a lot of add-ons like fish/shrimp/lobster ball, pig blood, enoki mushroom, vermicelli, tofu, etc.\n\nThe spicy pot is served over a live fire so the food is consistently kept hot. Each pot comes with a 'vegetable base' like bean sprouts, cauliflower, broccoli, potato, and celery.\n\nI think overall the flavor is pretty singular. It's the standard sichuan ma la flavor but I prefer it to be more numbing and spicy. Even the spiciest spice level is not very spicy which I guess is a good thing if you don't typically eat spice.\n\nThe quality of the meat is not very good. I'm so glad I picked pork belly (五花肉) because it was the only one I really enjoyed out of the lamb/beef choices. Also most of the meats come with bone which is not fun for lazy people like me.\n\nThere are so many different options for meats though which is a plus. Options include but not limited to: catfish, frog, beef tongue, lamb.", "rating": 3, "date": "2018-03-06"}, {"excerpts": ["The included sides were potatoes, celery, cauliflower and beansprouts. \n\n", "Only complaint was too much celery and bean sprouts, they felt like filler.  ", "With the large pot portions, I'd definitely recommend coming here if you're with a group and looking for something different to share."], "author": "Jon L.", "review": "First time getting dry pot! Wasn't sure what to expect but the menu is pretty straight forward. Pick your flavor, spiciness level, size, meat and sides (veggies).\n\nThere were a ton of meat choices, ranging from standard options you'd see like beef and chicken to more exotic choices like snail and bullfrog. My friend and I weren't feeling too adventurous so we picked a large pot with short ribs and chicken to share. The included sides were potatoes, celery, cauliflower and beansprouts. \n\nThe pot came out pretty quickly and everything was tasty! Only complaint was too much celery and bean sprouts, they felt like filler.  With the large pot portions, I'd definitely recommend coming here if you're with a group and looking for something different to share.", "rating": 4, "date": "2018-08-09"}, {"excerpts": ["You pick the meat options and it comes with potato and celery by default as sides; you can also order more sides for small fees. ", "I got the medium size both times ", "and it's enough to feed two with leftovers, or three just fine. ", "At around $20, that's a pretty good deal in SF! "], "author": "Electra C.", "review": "I came here twice in one week! I noticed this spot (more like a hole in the wall) on my commute home from work. Usually the door is usually open and you can see there's a wait inside for dinnertime. Plus all the patrons are Chinese-speaking so it seemed like an authentic spot to me.\n\nIt's sizzling hot pot (but dry, so with a sauce instead of soup broth) so the food comes in a pot with a flame that they light underneath. You pick the meat options and it comes with potato and celery by default as sides; you can also order more sides for small fees. I got the medium size both times and it's enough to feed two with leftovers, or three just fine. At around $20, that's a pretty good deal in SF! The food is pretty tasty.\n\nI like spicy food and tried the spiciest level the first time, and it was a little bit painful, so opted for medium spicy the next time. There's the fancy options here like beef tongue, snails, pig intestine, etc. which is up my alley. Came here with a non-adventurous person the first time so had to get regular beef. The second time I got snail, which felt a little underwhelming since they're little pieces and lacked much flavor. But you never know until you try...\n\nI want to come back and try the different meat options! Next time I'd probably try the beef tongue and squid or cuttlefish. If you come right at 5 or 6 on a weekday there shouldn't be much of a wait. I went back on a holiday (July 4th) around 7pm and we had to wait about half an hour. Also, you supposedly get 10% off if you pay all in cash.\n\nIt's crowded, probably not the best service and not the classiest ambience, but the food is what I'm about and Sizzling Pot King gets a good rating in my book.", "rating": 5, "date": "2018-07-25"}, {"excerpts": ["We had the medium frog pot + pork belly + lobster ball, there were a lot of veggies come with the pot(potato, califlower, bean sprouts, celery) absolutely enough for two people. \n", "Staffs are friendly, dishes taste good(authentic) ", "but the frogs are all parts, none of them is a whole frog, it looks like they were leftovers from that day, and the pork belly is literally just fats. ", "Anyways, I'll give it another try."], "author": "Xinya Z.", "review": "Went there on a Wednesday night around 8 with my husband, no line in front of us, but still kinda busy.  We had the medium frog pot + pork belly + lobster ball, there were a lot of veggies come with the pot(potato, califlower, bean sprouts, celery) absolutely enough for two people. \nStaffs are friendly, dishes taste good(authentic) but the frogs are all parts, none of them is a whole frog, it looks like they were leftovers from that day, and the pork belly is literally just fats. Anyways, I'll give it another try.", "rating": 4, "date": "2018-06-21"}], "kelp": [], "black fungus": [{"excerpts": ["Even with all that food in front of my face, I needed some kind of side dish and went for the $1.99 Black Fungus, which presumptively came stir-fried in the hot pot itself and not as a separate item (photo: http://bit.ly/2FsEPna). ", "The result was that the fungus was not providing the taste of freshness I was looking for to contrast the hot pot ingredients. ", "Meanwhile, the gas-fueled flickering flame was starting to make me nervous. ", "Lesson learned: Next time I'll bring my posse with me, but first, I have to hire a posse. "], "author": "Ed U.", "review": "I wasn't surprised that the previous occupant, the pretentiously named Thoughts Style Cuisine Showroom, had shuttered as it was a strange hybrid of Asian and Italian food served in what looked like dog bowls labeled with head-scratching words. I am surprised, however, at its unlikely replacement, a bustling Chinese dry pot restaurant that acknowledges the huge Asian youth populace living in the immediate area. I didn't see the regular Orpheum theater-going crowd or the wandering tourist traffic I usually see around the 'hood. It was packed with gaggles of giggling Asian girls in the booths and tables of bickering Asian couples, so I fit in just fine albeit longer in the tooth than everybody else.\n\nPots were indeed sizzling at most of the tables. I was seated in the middle of all the activity and tried to figure out what I could order on my own. In the evening, the only sizes they offer are the $22.99 Medium and the $32.99 Large Combo. The $11.99 Small is apparently offered just at lunch from Monday through Thursday.  Oh I see. When I asked the server if they had a vegetarian selection, she shook her head and told me to get the chicken. All by myself. (Don't wanna be) All by myself. So I ordered a Medium Grilled Cooked Snails in Garlic, medium spicy - that's the second hottest level on their heat meter (photo: http://bit.ly/2FY29af) and hoped for the best. It arrived post haste, and my goodness, it was a mass of sizzling food in a hot pot.\n\nThe snails were cooked tender and mixed with broccoli, bean sprouts, peppers, mushrooms, cauliflower, and cilantro in a heavy garlic sauce, and frankly the spice was not nearly as amped up as I was expecting. Even with all that food in front of my face, I needed some kind of side dish and went for the $1.99 Black Fungus, which presumptively came stir-fried in the hot pot itself and not as a separate item (photo: http://bit.ly/2FsEPna). The result was that the fungus was not providing the taste of freshness I was looking for to contrast the hot pot ingredients. Meanwhile, the gas-fueled flickering flame was starting to make me nervous. Lesson learned: Next time I'll bring my posse with me, but first, I have to hire a posse. Now where can I rent one?\n\nFOOD - 3 stars...bring an appetite, bring several appetites, and oh yes, be Asian\nAMBIANCE - 3 stars...still has the all-white finishes from the Thought Style days but it felt as busy as any Chinatown eatery\nSERVICE - 2.5 stars...not that helpful\nTOTAL - 3 stars...it sizzles, it's hot, and there's enough for an army", "rating": 3, "date": "2018-03-04"}], "shiitake mushrooms": [{"excerpts": ["We added some additional veggies like bok choy and shiitake mushrooms. ", "Sadly, the meat was poor quality and super chewy. ", "Very few shiitake mushrooms were added even though we paid extra!\n\n"], "author": "Nitar L.", "review": "This place always has a long line and since it's always packed on my walk home, I had to check it out.\n\nI realized that the clientele is mostly Chinese speaking and there are multiple locations. They must be popular across all locations to have a line on the sidewalk like this.\n\nMy roommates and I, the three of us ordered a large pot with beef and pork ribs. We added some additional veggies like bok choy and shiitake mushrooms. Sadly, the meat was poor quality and super chewy. Very few shiitake mushrooms were added even though we paid extra!\n\nAlso, we ordered pot stickers that never showed up at our table. Like many typical Chinese restaurants, service is quite poor. You'll have to wave aggressively to get any attention. With few wait staff, the wait is long even after we were seated.\n\nThe only highlight was the fried bread with condensed milk, but that's not enough to get me to come back.", "rating": 2, "date": "2018-03-09"}], "wide vermicelli": [{"excerpts": ["You must also add wide vermicelli to complete the dish though! ", "I was disappointed that they didn't have the garlic flavor when I went. ", "I normally get garlic numbing and spicy flavor. "], "author": "Shw L.", "review": "I was so happy when I found out that this restaurant also existed in San Francisco! If you love szcheuan food, this is the place to go. \n\nMy boyfriend and I got take out large with beef and lamb as the meat- and it was so big that we had left over for a couple days! It was even better as leftover because all the sauces and juices finally set in! You must also add wide vermicelli to complete the dish though! I was disappointed that they didn't have the garlic flavor when I went. I normally get garlic numbing and spicy flavor. But the regular numbing and spicy was just as good! \n\nPlace: the restaurant is a bit hard to fine. It's at a corner and on the left hand side of the one way! The sign was pretty small so you can definitely miss it! \n\nI would definitely go back!!", "rating": 4, "date": "2018-09-24"}, {"excerpts": ["For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. "], "author": "Angel C.", "review": "I love their Sunnyvale location and was delighted when they opened up one in the city. I don't understand why it's not more packed all the time, their sizzling pots are delicious.\n\nMy usual combo is medium size (good for 4) with hot and spicy (medium spicy level). I have tried almost all of the meat options and I enjoy all of them. For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. If you have space for desserts and appetizer, make sure to try out their duck necks, pumpkin pancakes, and Steamed and Fried Chinese Bread.\n\nPrice-wise this place is very reasonable, especially if you have a big group. I usually spend around $25 here after tax+tip.", "rating": 5, "date": "2018-08-24"}, {"excerpts": ["I enjoyed the over-the-top spicy frog pot with wide vermicelli, Chef is from Hunan province in China where is famous for spicy cuisine. ", "Definitely will come back."], "author": "Aloha M.", "review": "Friendly staff and great spicy pot with huge portion,  definitely enough for 2-3 people if you order the medium size pot. I enjoyed the over-the-top spicy frog pot with wide vermicelli, Chef is from Hunan province in China where is famous for spicy cuisine. Definitely will come back.", "rating": 5, "date": "2018-07-05"}], "king oyster mushroom": [], "beef tripe": [], "bok choy": [{"excerpts": ["We added some additional veggies like bok choy and shiitake mushrooms. ", "Sadly, the meat was poor quality and super chewy. ", "Very few shiitake mushrooms were added even though we paid extra!\n\n"], "author": "Nitar L.", "review": "This place always has a long line and since it's always packed on my walk home, I had to check it out.\n\nI realized that the clientele is mostly Chinese speaking and there are multiple locations. They must be popular across all locations to have a line on the sidewalk like this.\n\nMy roommates and I, the three of us ordered a large pot with beef and pork ribs. We added some additional veggies like bok choy and shiitake mushrooms. Sadly, the meat was poor quality and super chewy. Very few shiitake mushrooms were added even though we paid extra!\n\nAlso, we ordered pot stickers that never showed up at our table. Like many typical Chinese restaurants, service is quite poor. You'll have to wave aggressively to get any attention. With few wait staff, the wait is long even after we were seated.\n\nThe only highlight was the fried bread with condensed milk, but that's not enough to get me to come back.", "rating": 2, "date": "2018-03-09"}], "eggplant": [], "cauliflower": [{"excerpts": ["Some of my faves are cauliflower, quail egg, and celtuce. "], "author": "Michelle R.", "review": "Good place to get dry pot. It's not the best dry pot but it hits the spot, especially if you order the right ingredients. The flavors are pretty good!\n\nSome of my faves are cauliflower, quail egg, and celtuce. I do wish their potato was cut into thin slices instead of fry-like batons.\n\nTips:\n- get the medium pot, it's pretty much the same size as the large pot\n- avoid watery ingredients like cabbage or tofu as that defeats the purpose of dry pot. stick to the hard, firm ingredients \n- wash down the oily spice with a can of cold herbal tea", "rating": 4, "date": "2018-08-05"}, {"excerpts": ["The sprouts and cauliflower were boring though.  "], "author": "Adam B.", "review": "Such a fun and memorable meal.  A huge vat of cooked-to-order spicy food, with a burner placed underneath so the oily sauce bubbles while you eat.  Perfect for sharing, though gorging by yourself is definitely a possibility too.  Lunchtime seems a lot less crowded than dinnertime.\n\nSpicy & Hot Beef Short Rib w/ Instant Noodle (Very Spicy option): I ordered the spiciest option and was not disappointed.  Reminds me of the spicier dishes at some really good Sichuan restaurants in Chinatown.  Except something magical happens with the bubbling/sizzling; the liquid vaporizes a little so you might be inhaling spices if you don't wait for your food to cool down.  This could be good or bad, depending on how much you like aromatic spices.  Of the default veggies, I really liked the fried potato chunks.  They did an awesome job of absorbing the chili oil.  The celery created a cooling contrast to the spicy sauce.  The sprouts and cauliflower were boring though.  I added some instant noodles for my carbs (instead of paying extra for a side of rice) and that was a delicious choice.  Loved how the chili oil really clung to each noodle.  Only downside was that the noodles were placed on the bottom and some were scorched then stuck to the pot partway through the meal.  I had mixed feelings about the beef short ribs.  They were delicious, but super awkward to eat.  It's look like someone took a Korean short rib and cut each rib into like 6 pieces, sure to cut through every big bone piece to make smaller bone pieces.  Took a lot of concentration so not to chip your tooth on a bone or accidentally swallow a shard!", "rating": 4, "date": "2018-07-30"}, {"excerpts": ["The snails were cooked tender and mixed with broccoli, bean sprouts, peppers, mushrooms, cauliflower, and cilantro in a heavy garlic sauce, and frankly the spice was not nearly as amped up as I was expecting. "], "author": "Ed U.", "review": "I wasn't surprised that the previous occupant, the pretentiously named Thoughts Style Cuisine Showroom, had shuttered as it was a strange hybrid of Asian and Italian food served in what looked like dog bowls labeled with head-scratching words. I am surprised, however, at its unlikely replacement, a bustling Chinese dry pot restaurant that acknowledges the huge Asian youth populace living in the immediate area. I didn't see the regular Orpheum theater-going crowd or the wandering tourist traffic I usually see around the 'hood. It was packed with gaggles of giggling Asian girls in the booths and tables of bickering Asian couples, so I fit in just fine albeit longer in the tooth than everybody else.\n\nPots were indeed sizzling at most of the tables. I was seated in the middle of all the activity and tried to figure out what I could order on my own. In the evening, the only sizes they offer are the $22.99 Medium and the $32.99 Large Combo. The $11.99 Small is apparently offered just at lunch from Monday through Thursday.  Oh I see. When I asked the server if they had a vegetarian selection, she shook her head and told me to get the chicken. All by myself. (Don't wanna be) All by myself. So I ordered a Medium Grilled Cooked Snails in Garlic, medium spicy - that's the second hottest level on their heat meter (photo: http://bit.ly/2FY29af) and hoped for the best. It arrived post haste, and my goodness, it was a mass of sizzling food in a hot pot.\n\nThe snails were cooked tender and mixed with broccoli, bean sprouts, peppers, mushrooms, cauliflower, and cilantro in a heavy garlic sauce, and frankly the spice was not nearly as amped up as I was expecting. Even with all that food in front of my face, I needed some kind of side dish and went for the $1.99 Black Fungus, which presumptively came stir-fried in the hot pot itself and not as a separate item (photo: http://bit.ly/2FsEPna). The result was that the fungus was not providing the taste of freshness I was looking for to contrast the hot pot ingredients. Meanwhile, the gas-fueled flickering flame was starting to make me nervous. Lesson learned: Next time I'll bring my posse with me, but first, I have to hire a posse. Now where can I rent one?\n\nFOOD - 3 stars...bring an appetite, bring several appetites, and oh yes, be Asian\nAMBIANCE - 3 stars...still has the all-white finishes from the Thought Style days but it felt as busy as any Chinatown eatery\nSERVICE - 2.5 stars...not that helpful\nTOTAL - 3 stars...it sizzles, it's hot, and there's enough for an army", "rating": 3, "date": "2018-03-04"}, {"excerpts": ["All dry hot pots come with fried potato, cauliflower, celery, and bean sprouts.\n\n"], "author": "Cherylynn N.", "review": "Cold weather calls for shabu and hot pot. It's all about that steam getting all over ya face like a good facial. Not that kind of \"facial\", you pervs! \n\nThere's not really a shortage of shabu and hot pot places in SF but dry hot pot places? Since Celestial Flame closed, I don't know any restaurant in SF that solely serves this fiery Sichuan specialty. \n\nSo, say hello to Sizzling Pot King that took over the short-loved Thai fusion restaurant: Thoughts Style Cuisine) (https://www.yelp.com/biz/thoughts-style-cuisine-showroom-san-francisco!\n\nSizzling Pot King is a small chain (Sunnyvale, San Diego, Seattle) that serves dry hot pot consisting of meat and veggies with a myriad of chilies and spices that will light your toilet paper on fiyah! Don't worry, there's a non-spicy option. The good thing about dry hot pot is there's no steam so if you have cake face like me, you'll leave with your eyebrows intact and not melted off! \n\nMy coworker and I thought we were beating the lunch rush by arriving at Sizzling King Pot before 11:30 am but we didn't - it was popping! It was packed with Mandarin speaking customers which was a great sign. \n\nSince Sizzling Pot King is in soft opening mode, there's a limited menu. The only apps available are potstickers and mantou (steamed buns).\n\nFor Dry Hot Pot:\n*Choose your proteins (tons of choices): Lamb, pork, beef, rabbit, snails, frog, intestines, tripe, gizzards, tongue, or seafood (lobster, crab, crawfish) are just to name a few.\n\n*Choose your 3 size: Small ($11.99), Medium ($22.99), or Large ($32.99). The small is only available Monday - Thursday. For the large, you can choose two meats. \n\n*Choose your flavor: Hot & Sour, Garlic, Sweet & Sour, or Seafood. \n\n*Choose your spice level: Non-spicy, mild-spicy, medium-spicy, or very-spicy.\n\nAll dry hot pots come with fried potato, cauliflower, celery, and bean sprouts.\n\nYou can customize your dry hot pot with extra veggies, carbs (noodles)and other proteins like spam, sausages, and pig's blood for an extra $.99 to $3.99. \n\nI highly recommend ordering rice ($1.50/bowl) to help balance all the spicy goodness. \n\nNO MSG is used. \n\nMy coworker and I ordered the Large Dry Hot Pot w/ half beef tongue and half beef short ribs ($32.99):  http://bit.ly/2onZ0Ie. Flavor: garlic. Spice: medium-spicy. We added silk noodles ($1.99) which is yam noodles like Korean japchae.\n\nThe meat, noodle, and veggie medley was so good! The beef tongue was sliced thin and tender with a nice bite. Luckily, there was a good amount of beef tongue because the short ribs were all bones (boo!). The noodles and veggies were all cooked well with the proper texture. I loved the fried potatoes for a crunchy texture element. \n\nThe medium-spicy garlic flavor was on-point, aromatic with a good mala numbing spice. The large pot can feed 3-4 people but we couldn't stop digging in for more because of that addictive spice.\n\nFood service took a long time because a group of 20 rolled in before us which delayed the kitchen by 45 minutes. The staff was super apologetic and gave us several updates on when our order was coming. \n\nThey do have a note outside to let customers know orders may take longer than expected because they're in soft opening mode. Not going to dock them for service since they're managing customer expectations which I appreciate. \n\nIt's a small space so it's best for groups of 2-4 people.\n\nParking, well it's SF but it's not as tough in this area since there's not that many commercial businesses on the block. \n\nThere's nothing like Sizzling Pot King in the area so I think they're going to do really well in the hood. I can't wait to return!", "rating": 4, "date": "2018-02-23"}, {"excerpts": ["Each pot comes with a 'vegetable base' like bean sprouts, cauliflower, broccoli, potato, and celery.\n\n"], "author": "Alicia L.", "review": "Most of the hot pot places I know in SF aren't dry hot pot places so I'm really glad we finally have a place nearby for this. Sizzling Pot King is chain, and I believe the closest one to here is in Sunnyvale.\n\nYou basically build your own stir fry by picking the spice level, the protein, and add-ons. I added a lot of add-ons like fish/shrimp/lobster ball, pig blood, enoki mushroom, vermicelli, tofu, etc.\n\nThe spicy pot is served over a live fire so the food is consistently kept hot. Each pot comes with a 'vegetable base' like bean sprouts, cauliflower, broccoli, potato, and celery.\n\nI think overall the flavor is pretty singular. It's the standard sichuan ma la flavor but I prefer it to be more numbing and spicy. Even the spiciest spice level is not very spicy which I guess is a good thing if you don't typically eat spice.\n\nThe quality of the meat is not very good. I'm so glad I picked pork belly (五花肉) because it was the only one I really enjoyed out of the lamb/beef choices. Also most of the meats come with bone which is not fun for lazy people like me.\n\nThere are so many different options for meats though which is a plus. Options include but not limited to: catfish, frog, beef tongue, lamb.", "rating": 3, "date": "2018-03-06"}, {"excerpts": ["The included sides were potatoes, celery, cauliflower and beansprouts. \n\n", "Only complaint was too much celery and bean sprouts, they felt like filler.  ", "With the large pot portions, I'd definitely recommend coming here if you're with a group and looking for something different to share."], "author": "Jon L.", "review": "First time getting dry pot! Wasn't sure what to expect but the menu is pretty straight forward. Pick your flavor, spiciness level, size, meat and sides (veggies).\n\nThere were a ton of meat choices, ranging from standard options you'd see like beef and chicken to more exotic choices like snail and bullfrog. My friend and I weren't feeling too adventurous so we picked a large pot with short ribs and chicken to share. The included sides were potatoes, celery, cauliflower and beansprouts. \n\nThe pot came out pretty quickly and everything was tasty! Only complaint was too much celery and bean sprouts, they felt like filler.  With the large pot portions, I'd definitely recommend coming here if you're with a group and looking for something different to share.", "rating": 4, "date": "2018-08-09"}, {"excerpts": ["You start with a protein base that also includes a few vegetables already (potatoes, bean sprouts, cauliflower). ", "You can pick the flavor, level of spiciness, and size. ", "For dinner there are only two sizes, medium and large. "], "author": "Julie Z.", "review": "I used to eat dry pot all the time as a quick lunch or dinner when I was working in China, and was sad that no such specialty place existed here. As the only dry pot restaurant I've ever found in the US, it definitely satisfied my craving! \n\nYou start with a protein base that also includes a few vegetables already (potatoes, bean sprouts, cauliflower). You can pick the flavor, level of spiciness, and size. For dinner there are only two sizes, medium and large. We tried both, and realized that the large doesn't have that much more food, so instead of getting a large combo, we thought it was a better deal to pay $10 more and get two medium pots instead.\n\nNext you can do some add ons, which includes a pretty wide selection of protein, vegetables, and noodles. We added a couple of veggies to every pot and everyone loved the extra flavor. It didn't take too long for the food to come out. Since we had a big group, we got to try a few different things. The beef was a little dry, but generally all the other meats were good. \n\nAll together we tried 4 pots and the fish for 4 people. The fish was so so, definitely not the giant portion you get in China and less flavorful, but we liked all the pots. Total came out to ~$25 per person and we were absolutely stuffed. I think between 2 people one medium pot with lots of add ones would be perfect.", "rating": 4, "date": "2018-02-24"}], "sweet corn": [], "taro": [], "frozen tofu": [], "konjak": [], "gluten": [], "sliced lotus roots": [], "enoki mushroom": [{"excerpts": ["I added a lot of add-ons like fish/shrimp/lobster ball, pig blood, enoki mushroom, vermicelli, tofu, etc.\n\n"], "author": "Alicia L.", "review": "Most of the hot pot places I know in SF aren't dry hot pot places so I'm really glad we finally have a place nearby for this. Sizzling Pot King is chain, and I believe the closest one to here is in Sunnyvale.\n\nYou basically build your own stir fry by picking the spice level, the protein, and add-ons. I added a lot of add-ons like fish/shrimp/lobster ball, pig blood, enoki mushroom, vermicelli, tofu, etc.\n\nThe spicy pot is served over a live fire so the food is consistently kept hot. Each pot comes with a 'vegetable base' like bean sprouts, cauliflower, broccoli, potato, and celery.\n\nI think overall the flavor is pretty singular. It's the standard sichuan ma la flavor but I prefer it to be more numbing and spicy. Even the spiciest spice level is not very spicy which I guess is a good thing if you don't typically eat spice.\n\nThe quality of the meat is not very good. I'm so glad I picked pork belly (五花肉) because it was the only one I really enjoyed out of the lamb/beef choices. Also most of the meats come with bone which is not fun for lazy people like me.\n\nThere are so many different options for meats though which is a plus. Options include but not limited to: catfish, frog, beef tongue, lamb.", "rating": 3, "date": "2018-03-06"}], "fried tofu": [{"excerpts": ["We always select fried tofu and instant noodles, which really soak up the sauce. ", "I might even get double orders of the fried tofu next time, because it is so tasty!\n\n"], "author": "Harris L.", "review": "I've already been here twice in the last few weeks. We always get the garlic sauce, which is delicious. \n\nAfter you choose a base (we like chicken), you can add as many toppings as your want. We always select fried tofu and instant noodles, which really soak up the sauce. I might even get double orders of the fried tofu next time, because it is so tasty!\n\nNOTE that the size of the pot only affects how much of the base you get. The amount of topping appears to be to same. So if you get a lot of toppings like we usually do, you will not see a noticeable difference between the medium and large sizes. \n\nOther dishes there that we love: fried potstickers, pumpkin cake, and the steamed and fried chinese bread with condensed milk. \n\nExpect a wait on Friday and Saturday nights, unless you get there at opening or after the first round of diners leave around 8-8:30. The restaurant seems to be packed with customers from mainland China, which is a testament to the quality of the food.  \n\nNo complaints about the service. They have plenty of servers, who are always busy, but will come over pretty quickly if you waive them down.", "rating": 4, "date": "2018-04-16"}], "dried bean curd sticks": [], "lobster balls": [{"excerpts": ["For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. "], "author": "Angel C.", "review": "I love their Sunnyvale location and was delighted when they opened up one in the city. I don't understand why it's not more packed all the time, their sizzling pots are delicious.\n\nMy usual combo is medium size (good for 4) with hot and spicy (medium spicy level). I have tried almost all of the meat options and I enjoy all of them. For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. If you have space for desserts and appetizer, make sure to try out their duck necks, pumpkin pancakes, and Steamed and Fried Chinese Bread.\n\nPrice-wise this place is very reasonable, especially if you have a big group. I usually spend around $25 here after tax+tip.", "rating": 5, "date": "2018-08-24"}, {"excerpts": ["The main items we chose were the baby cuttlefish, tripe, lobster balls and the beef tongue. ", "The beef tongue was especially good, well cooked and tender. ", "We were the second to last customers for lunch that day and the staff wanted everyone to finish up and get out even though they were polite about it. ", "The Sizzling Gan Guo's is ok once a year for me. ", "Minus stars for not having almost all of side dishes on the menu."], "author": "George F.", "review": "Met my daughter K for a late brunch on Sunday. She picked Sizzling Pot King in Soma. Apparently they have multiple locations and serve Gan Guo which is a one dry pot dish. When we arrived there was parking on the side street right next to the restaurant. As far as the decor is minimal, white washed walls and basic table and chairs. The menu is colorful and the prices are very reasonable. The one thing about Gan Guo's is that no matter how many items you add to the pot towards everything is stir fried in one sauce and one pot. Therefore we tried to order some side dishes to change up the flavors. Out of the 7 side dishes we wanted they only had one, the gizzards which was awful. We had leftover gizzards and we did not want to take it home. The pot itself was pretty good. The main items we chose were the baby cuttlefish, tripe, lobster balls and the beef tongue. The beef tongue was especially good, well cooked and tender. We were the second to last customers for lunch that day and the staff wanted everyone to finish up and get out even though they were polite about it. The Sizzling Gan Guo's is ok once a year for me. Minus stars for not having almost all of side dishes on the menu.", "rating": 3, "date": "2018-08-24"}], "squid ball": [], "pig blood": [{"excerpts": ["I added a lot of add-ons like fish/shrimp/lobster ball, pig blood, enoki mushroom, vermicelli, tofu, etc.\n\n"], "author": "Alicia L.", "review": "Most of the hot pot places I know in SF aren't dry hot pot places so I'm really glad we finally have a place nearby for this. Sizzling Pot King is chain, and I believe the closest one to here is in Sunnyvale.\n\nYou basically build your own stir fry by picking the spice level, the protein, and add-ons. I added a lot of add-ons like fish/shrimp/lobster ball, pig blood, enoki mushroom, vermicelli, tofu, etc.\n\nThe spicy pot is served over a live fire so the food is consistently kept hot. Each pot comes with a 'vegetable base' like bean sprouts, cauliflower, broccoli, potato, and celery.\n\nI think overall the flavor is pretty singular. It's the standard sichuan ma la flavor but I prefer it to be more numbing and spicy. Even the spiciest spice level is not very spicy which I guess is a good thing if you don't typically eat spice.\n\nThe quality of the meat is not very good. I'm so glad I picked pork belly (五花肉) because it was the only one I really enjoyed out of the lamb/beef choices. Also most of the meats come with bone which is not fun for lazy people like me.\n\nThere are so many different options for meats though which is a plus. Options include but not limited to: catfish, frog, beef tongue, lamb.", "rating": 3, "date": "2018-03-06"}], "beef tendon meatballs": [], "korean rice cake": [], "wild mushroom": [], "crab sticks": [{"excerpts": ["For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. "], "author": "Angel C.", "review": "I love their Sunnyvale location and was delighted when they opened up one in the city. I don't understand why it's not more packed all the time, their sizzling pots are delicious.\n\nMy usual combo is medium size (good for 4) with hot and spicy (medium spicy level). I have tried almost all of the meat options and I enjoy all of them. For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. If you have space for desserts and appetizer, make sure to try out their duck necks, pumpkin pancakes, and Steamed and Fried Chinese Bread.\n\nPrice-wise this place is very reasonable, especially if you have a big group. I usually spend around $25 here after tax+tip.", "rating": 5, "date": "2018-08-24"}], "chinese yam": [], "quail egg": [{"excerpts": ["Some of my faves are cauliflower, quail egg, and celtuce. "], "author": "Michelle R.", "review": "Good place to get dry pot. It's not the best dry pot but it hits the spot, especially if you order the right ingredients. The flavors are pretty good!\n\nSome of my faves are cauliflower, quail egg, and celtuce. I do wish their potato was cut into thin slices instead of fry-like batons.\n\nTips:\n- get the medium pot, it's pretty much the same size as the large pot\n- avoid watery ingredients like cabbage or tofu as that defeats the purpose of dry pot. stick to the hard, firm ingredients \n- wash down the oily spice with a can of cold herbal tea", "rating": 4, "date": "2018-08-05"}, {"excerpts": ["Got the hunan duck pot, spice hot flavor med spicy, with quail egg, noodles, chinese sausage and a few other additions. ", "Came out to $37 pre tip (which factors in a random $6 discount). ", "Overall tasty food  though the med spicy came out to be more numbing than hot-spicy. ", "Wait on a Friday night was about 30-40 mins (came at 7:50) for 2 people."], "author": "Lol C.", "review": "Got the hunan duck pot, spice hot flavor med spicy, with quail egg, noodles, chinese sausage and a few other additions. Came out to $37 pre tip (which factors in a random $6 discount). Overall tasty food  though the med spicy came out to be more numbing than hot-spicy. Wait on a Friday night was about 30-40 mins (came at 7:50) for 2 people.", "rating": 5, "date": "2018-02-09"}], "green bean": [], "celtuce": [{"excerpts": ["Some of my faves are cauliflower, quail egg, and celtuce. "], "author": "Michelle R.", "review": "Good place to get dry pot. It's not the best dry pot but it hits the spot, especially if you order the right ingredients. The flavors are pretty good!\n\nSome of my faves are cauliflower, quail egg, and celtuce. I do wish their potato was cut into thin slices instead of fry-like batons.\n\nTips:\n- get the medium pot, it's pretty much the same size as the large pot\n- avoid watery ingredients like cabbage or tofu as that defeats the purpose of dry pot. stick to the hard, firm ingredients \n- wash down the oily spice with a can of cold herbal tea", "rating": 4, "date": "2018-08-05"}], "fish cake": [], "luncheon meat": [{"excerpts": ["For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. "], "author": "Angel C.", "review": "I love their Sunnyvale location and was delighted when they opened up one in the city. I don't understand why it's not more packed all the time, their sizzling pots are delicious.\n\nMy usual combo is medium size (good for 4) with hot and spicy (medium spicy level). I have tried almost all of the meat options and I enjoy all of them. For additional things I would recommend lobster balls, lotus roots, enoki mushrooms, wide vermicelli, crab sticks, and luncheon meat. If you have space for desserts and appetizer, make sure to try out their duck necks, pumpkin pancakes, and Steamed and Fried Chinese Bread.\n\nPrice-wise this place is very reasonable, especially if you have a big group. I usually spend around $25 here after tax+tip.", "rating": 5, "date": "2018-08-24"}]}