{"soft drink": [], "bottled mexican coke": [], "boyland soda": [], "cock and bull ginger beer": [], "cafe roma and trieste espresso": [], "doppio espresso": [], "macchiato": [], "latte": [], "americano": [{"excerpts": ["Returned for a potent if slightly bland Americano ($3 included sugar free vanilla syrup). ", "Discovered the sweet, spongy cinnamon bread pudding brilliance. "], "author": "Jason B.", "review": "Carb load.\n\nBay To Breakers tradition: Friday before the race we meet for carbs. \n\nLast year: http://www.yelp.com/biz/cotogna-san-francisco?hrid=eT2RgOM2LuhEWZq2l86RkQ\n\nThis year: Pizza slice topped with tomatoes and basil, homemade foccaccia with grilled chicken and avocado and pasta with tomato sauce.\n\nRich flavor and fresh ingredients were consistent across them all. Prices varied from a too expensive $13 sandwich, just right $5 pizza slice and a $9 steal pasta.\n\nReturned for a potent if slightly bland Americano ($3 included sugar free vanilla syrup). Discovered the sweet, spongy cinnamon bread pudding brilliance. $7 and so worth it.\n\nSpace continues the rustic and inviting feel of the old Ironside: http://insidescoopsf.sfgate.com/blog/2015/03/23/ironside-to-close-tony-gemignanis-slice-house-moving-in/\n\nStaff has an earnest, friendly vibe that makes you feel welcome and valued.\n\nBay To Breakers result: One second from a personal best (55:29).\n\nSlice House result: Four stars.", "rating": 4, "date": "2015-05-23"}], "africano": [], "st germain wings": [], "home made calabrese sausage": [], "ancient grain khorasan pasta salad": [], "mixed greens salad": [{"excerpts": ["And the mixed greens salad is something I can happily have for lunch sans anything else. ", "Lovely combination of sweet, sour, and savory with the olives, gorgonzola, walnuts, red onion and balsamic redaction. "], "author": "Jon L.", "review": "Everything you love about Tony's - most importantly the delicious pizza pies, but without the crowds and nary a wait. A total score for SoMa!\n\nYou need to check out the daily specials. Once it was a sausage and kale pie and the other was a chorizo, cauliflower, and kale - both standout slices. Of course you have everyday dependables like a slice of cheese or Grandma pan pizza slice. Happy hour Monday-Friday from 3-5:30pm where full slices are an amazing $4 deal and half slices just $2. An amazing time to try everything including meatballs and chicken wings. Another lesser know fact is that you can get a combo deal at lunch where a slice, which I forgot to mention are really huge, is paired with a salad for under $10. Such a steal! And the mixed greens salad is something I can happily have for lunch sans anything else. Lovely combination of sweet, sour, and savory with the olives, gorgonzola, walnuts, red onion and balsamic redaction. It's an entree sized salad too. \n\nThe best part is you can easily score a seat here compared to other locations. Folks are friendly and deliver your heated slices to you once you order at the counter. I'll happily grab a couple of slices here before heading to AT&T Park.", "rating": 5, "date": "2016-06-02"}, {"excerpts": ["i don't recommend their mixed greens salad. ", "it was all mixed greens and had very little of anything else"], "author": "Jackie W.", "review": "one of my best pizza places in SF. love how chewy the dough is. i recommend the followinng pizzas:\n-cal italia\n-crazy 8\n-wiseguy\n\ni don't recommend their mixed greens salad. it was all mixed greens and had very little of anything else", "rating": 4, "date": "2017-04-30"}, {"excerpts": ["The mixed greens salad is also very satisfying with lots of olives, cheese, and glazed walnuts."], "author": "Nina L.", "review": "My favorite is a slice of tomato pie.  Their sauce is tangy and sweet at the same time and they pile on the mozzarella.  I also like the Grandma Sicilian style pizza.  Their crust is chewy and so satisfying.  Love that they sell by the slice and it's an easy place to pick up dinner on the way home from work.  Husband likes the meatball sandwich.  The mixed greens salad is also very satisfying with lots of olives, cheese, and glazed walnuts.", "rating": 5, "date": "2015-07-11"}], "artichoke pasta salad": [{"excerpts": ["The wings and the artichoke pasta salad were very average, so I would skip that. \n\n"], "author": "Melody Y.", "review": "Great spot to pick up dinner to-go in SOMA. The pizza cost about $6 a slice but the slices are HUGE - one slice is close to an entire quarter of a large pizza at chains. The garlic bread with cheese is quite nommy, so much that the discomfort you experience from consuming all that butter and oil is worth it. The wings and the artichoke pasta salad were very average, so I would skip that. \n\nThe restaurant is clean and not too crowded during dinner hours. Their ranch is apparently housemade. And, they also have pasta!", "rating": 4, "date": "2016-05-12"}, {"excerpts": ["and the artichoke pasta salad - both were good sized and excellent taste. ", "The place itself is of nice ambience - wood interior and cozy feeling, with TVs and a second floor seating area as well. ", "Very busy at lunch, mainly take-out service and it was easy to get a table. ", "No table service (except food delivery) so be sure to order at counter before claiming a seat. ", "Overall a nice lunch - but ", "next time a salad and ONE slice would be fine - took two slices of the pizza with us because we just ate too much !!"], "author": "Mark K.", "review": "Our first visit here based on a recommendation - very nice pizza place ! They offer slices, small \"2 person\" pies and larger as well, as well as salads and meatball sandwiches. Slices include pepperoni, cheese, Margherita, and specialty choices. Large slices for about $6. Was going to try the pasta but - strangely - the pasta is only available after 3:30 pm !  We think it would be a good lunch option, not sure why the time limit on it. The 13 inch is $24 and offers nine styles. We opted for the Genoa - pesto, mozzarella, sun dried tomatoes, castelvetrano olives, feta and roasted garlic cloves. It was delicious and just the right portions of all toppings, especially the pesto which we loved.  Also had a classic Caesar salad (with anchovies!) and the artichoke pasta salad - both were good sized and excellent taste. The place itself is of nice ambience - wood interior and cozy feeling, with TVs and a second floor seating area as well. Very busy at lunch, mainly take-out service and it was easy to get a table. No table service (except food delivery) so be sure to order at counter before claiming a seat. Overall a nice lunch - but next time a salad and ONE slice would be fine - took two slices of the pizza with us because we just ate too much !!", "rating": 4, "date": "2016-07-07"}], "quinoa": [{"excerpts": ["Most frustrating was ordering the quinoa salad, from the salad section, only to find it was quinoa PASTA - not a salad. ", "Especially annoying since they have a separate menu for pasta ", "and this wasn't there ", "- it was in the section for salads. ", "Add insult to injury that the quinoa (pasta) salad was somehow void of flavor all together. ", "It tasted like raw boiled pasta. ", "And with goat cheese being more mild, it needed something else - maybe some tomato, olives, dressing? ", "Overall it was AOK pizza, lying quinoa pasta salad and amazing honey sausage."], "author": "Sarah A.", "review": "We grabbed takeout for a business lunch after we lost our reservation at a dine in spot nearby when our meeting ran long. \n\nThis is clearly a happening spot around lunch time and with a line out the door, it shouldn't have surprised us how long it took for our order to come together but it was still disappointing to wait 20+ minutes for the food - they were doing their best for sure, so just a warning that it's slow at lunch time. \n\nThe pizza was good! I wish the crust was something worthwhile, all of us left our crust in the box. Most frustrating was ordering the quinoa salad, from the salad section, only to find it was quinoa PASTA - not a salad. Especially annoying since they have a separate menu for pasta and this wasn't there - it was in the section for salads. Add insult to injury that the quinoa (pasta) salad was somehow void of flavor all together. It tasted like raw boiled pasta. And with goat cheese being more mild, it needed something else - maybe some tomato, olives, dressing? I'm not sure what but no one in our group had anything good to say about it. . \n\nThe shining moment was the sausage. Mmmm that honey sausage!!! We were told it was made with local honey from the roof of the owner's other restaurant so we got two orders - so glad we did! It was really fantastic. Something to go out of your way for. \n\nOverall it was AOK pizza, lying quinoa pasta salad and amazing honey sausage.", "rating": 3, "date": "2015-05-17"}, {"excerpts": ["Quinoa Salad is terrific and (tastes) worthy of a fine dining restaurant -- an unusual choice for a pizza place near the ball park.  ", "Quinoa, citrus slices, goat cheese, currents, frisee, onions artfully displayed in a light citrus vinaigrette.  \n", "Caesar is tasty but not as exceptional.  \n", "Both standard veggie pizzas are good, but the Pesto is better.\n", "Garlic bread covered with whole cloves of roasted garlic.  ", "Miss:\nAncient Grains salad made with quinoa pasta is lacking in flavor versus the other choices.\n\n"], "author": "Greg K.", "review": "Now been here twice, both times for dinner.  I think whole pies are the way to go, either the individual 12\" (which you can easily share if you have a salad) or the enormous regular pizzas.  The slices, I think, don't fare well when reheated.  Portions of everything are huge -- from the salads to the pizzas\n\nHits:\nQuinoa Salad is terrific and (tastes) worthy of a fine dining restaurant -- an unusual choice for a pizza place near the ball park.  Quinoa, citrus slices, goat cheese, currents, frisee, onions artfully displayed in a light citrus vinaigrette.  \nCaesar is tasty but not as exceptional.  \nBoth standard veggie pizzas are good, but the Pesto is better.\nGarlic bread covered with whole cloves of roasted garlic.  Huge portion.  \n\nMiss:\nAncient Grains salad made with quinoa pasta is lacking in flavor versus the other choices.\n\nThe pasta and other items looks good -- will have to try them another time.  .", "rating": 4, "date": "2015-08-02"}], " cal italia pizza": [], " free st george pizza": [], " crazy  pizza": [], " popeye pizza": [], " the wise guy pizza": [], " the genoa pizza": [], " sweetie pie": [], " cheese pizza": [], " pigman pizza": [], "bucatini": [{"excerpts": ["Bucatini pasta was also great! ", "I've never tried/seen this pasta anywhere else; it's like a mix between spaghetti and udon noodles -- much thicker and more elastic than your average old spaghetti. ", "Sauce was also hearty and had just the right amount of spice. ", "We also tried the grandma and a regular pepperoni/mushroom pizza. ", "Everything was yum! ", "Can't wait to come back!"], "author": "Sabrina L.", "review": "Came here for dinner last night in a group of 12 so we got to try almost everything! Meatballs and wings were great. Mixed green and Caesar salads also great (I personally prefer the crispness of the Caesar, anchovies added great flavor). Bucatini pasta was also great! I've never tried/seen this pasta anywhere else; it's like a mix between spaghetti and udon noodles -- much thicker and more elastic than your average old spaghetti. Sauce was also hearty and had just the right amount of spice. We also tried the grandma and a regular pepperoni/mushroom pizza. Everything was yum! Can't wait to come back!", "rating": 5, "date": "2015-11-05"}, {"excerpts": ["The surprise standout was the bucatini. ", "I would definitely recommend trying the pasta dishes. ", "Very fresh and surprisingly reasonably priced."], "author": "Samantha S.", "review": "Great spot for a casual meal. We kept it simple on the pizza side and just had a tomato pie with mozzarella and basil. The sauce was just sweet enough and the grains in the dough made for an interesting and delicious crust. The surprise standout was the bucatini. I would definitely recommend trying the pasta dishes. Very fresh and surprisingly reasonably priced.", "rating": 5, "date": "2015-08-08"}], "gemelli": [], "mostaccioli ala vodka cream": [{"excerpts": ["Instead, we went with The Wiseguy pizza and Mostaccioli ala Vodka Cream for dinner.  ", "Two very hungry adults took down The Wiseguy pizza, and an overly hungry one person took down the mostaccioli.  ", "All in all, it was gluttony at its finest that night, and I have zero regrets when it comes down to chomped down on half a pizza.  ", "The Wiseguy comes with some spicy sausage, hot pepper oil, and it's topped with little bursts of mozzarella.  ", "About midway through, that mozzarella came in handy when the spicy sausage got to being a little too much for me.  ", "I will definitely be back here, especially since picking up an order was almost a little too easy!"], "author": "Lisa I.", "review": "We called in our order to pick up from Slice House this past weekend, and I couldn't believe a) how empty the restaurant itself was for a Saturday and b) how delicious their pizzas are despite it not being the original Tony's.  I'm a sucker for their margherita pizza, but that always comes with the wait.  Instead, we went with The Wiseguy pizza and Mostaccioli ala Vodka Cream for dinner.  Two very hungry adults took down The Wiseguy pizza, and an overly hungry one person took down the mostaccioli.  All in all, it was gluttony at its finest that night, and I have zero regrets when it comes down to chomped down on half a pizza.  The Wiseguy comes with some spicy sausage, hot pepper oil, and it's topped with little bursts of mozzarella.  About midway through, that mozzarella came in handy when the spicy sausage got to being a little too much for me.  I will definitely be back here, especially since picking up an order was almost a little too easy!", "rating": 4, "date": "2015-08-04"}], "caprese focaccina": [], "pollo focaccina": [], "meatball sub": [{"excerpts": ["Amazing meatball sub. ", "Love that they use garlic bread for the roll. ", "Everyone that I've taken there has raved about the pizza, but I've only gotten the meatball sub, so can only comment on that."], "author": "Brian B.", "review": "Amazing meatball sub. Love that they use garlic bread for the roll. Comes out quick and hot. \n\nPretty bust for lunch and during game days, but really easy to get a table for dinner on a weeknight, as much as I've seen. \n\nEveryone that I've taken there has raved about the pizza, but I've only gotten the meatball sub, so can only comment on that.", "rating": 5, "date": "2017-04-07"}, {"excerpts": ["Even with the focus on pizza, there were plenty of other items on the menu - salads, a couple of pasta specialties, paninis and apparently a meatball sub to die for according to the server who was pushing it hard. ", "I have no doubt that Tony will bring 'em in again although I hope he doesn't go into a franchise zone with his award-winning pizzas. ", "Not worried yet, but I'll be back to monitor it. "], "author": "Ed U.", "review": "Is pizza wunderkind Tony Gemignani in danger of overexposure? Yeah probably but it's not like he's sold out and become a Food Network whore like Guy Fieri whose most current culinary connection is the excessive amount of carbs he can stuff in his ample mouth. Like many in our fair city, I became a fan when he opened his first San Francisco place, Tony's Pizza Napoletana, back in 2009. That's when my friend Maggie organized a birthday fête for me, and we tried a number of different pies including my eventual favorite, the Cal Italia with four Italian cheeses, prosciutto, a Croatian sweet fig preserve and a liberal drizzle of a balsamic reduction. Fantastico and then Jamie W. and I recently tried Tony's other North Beach Capo's for the first time.\n\nFantastico seconda parte. And then we found out Tony was taking over the former Ironside space on 2nd which thrilled us since he's now in our 'hood. This may be his third San Francisco operation, but he has since expanded his pizza empire from here to Vegas. Fantastico terza parte? Jamie and I decided to give it a try this past Friday and were surprised to find it nearly empty at about 6PM since there's plenty of beer on tap (photo: http://bit.ly/1byJErQ). I got here a bit earlier than Jamie, so you'll probably never guess what pizza I ordered for the two of us. The Cal Italia, of course (photo: http://bit.ly/1PQiKek). The ingredients were the same, but the crust was different. He bills it as \"Ancient Grain Pizza\" which represents a blend of Tony's double-zero flour, spelt, semolina, sprouted grain & whole wheat.\n\nThe result was probably healthier than the original but not quite as satisfying because of the chewier texture. You would think that would be enough for two mean with healthy appetites, but we were mindful of the name of the place, Slice House. With that in mind, I ordered a $6 square of the Sweet Grandma's Pizza, a Sicilian-style creation of which they make a limited number daily. It's really more a thick foccacia-like loaf with a sauce made of sweet, vine-ripened tomatoes ladled on top with mozzarella, garlic, oregano and pecorino (photo: http://bit.ly/1JwYGNf). While I appreciated the freshness of the ingredients, the breadiness overwhelmed me somewhat, so much so that for the first time, I could not finish a slice of Tony's pizza.\n\nJamie liked his $5.25 slice of the Pepperoni, and the slice was frankly enough for two with an abundance of meat (photo: http://bit.ly/1GCBVXt). My one complaint was the amount of grease that accumulated on the cheese probably because it spent some time saturating in the display case. Even with the focus on pizza, there were plenty of other items on the menu - salads, a couple of pasta specialties, paninis and apparently a meatball sub to die for according to the server who was pushing it hard. I have no doubt that Tony will bring 'em in again although I hope he doesn't go into a franchise zone with his award-winning pizzas. Not worried yet, but I'll be back to monitor it. After all, someone has to make sure of the quality on a regular basis, right?\n\nFOOD - 4 stars...Tony is a pizza artist but some of the North Beach pizzazz seems missing here\nAMBIANCE - 4 stars...good use of the loft-like setting Ironside struggled with\nSERVICE - 3.5 stars...cordial enough\nTOTAL - 4 stars...a slice of Tony's is worth a pound of cure...or somethin' like that, goombah", "rating": 4, "date": "2015-04-27"}, {"excerpts": ["I wanted a meatball sub, but alas.... they were out. ", "Had a slice (cheese pizza) instead. ", "Crispy crust. ", "Nice tomato sauce and perfect amount of cheese. ", "So looking forward to trying the other variety of pizza slices.... and getting that meatball sub!"], "author": "Darrin D.", "review": "I wanted a meatball sub, but alas.... they were out. Had a slice (cheese pizza) instead. Crispy crust. Nice tomato sauce and perfect amount of cheese. So looking forward to trying the other variety of pizza slices.... and getting that meatball sub!", "rating": 5, "date": "2016-11-06"}, {"excerpts": ["Best meatballs / meatball sub ever - one of my favorite foods which I've tried in many different variations across the world. ", "Amazing flavor, texture, sauce, cheese. ", "The bread is garlic bread which makes it awesome. ", "Service was friendly. ", "BTW pizza is awesome too, especially the chewy cheese they use."], "author": "Sergei B.", "review": "Best meatballs / meatball sub ever - one of my favorite foods which I've tried in many different variations across the world. Amazing flavor, texture, sauce, cheese. The bread is garlic bread which makes it awesome. Service was friendly. BTW pizza is awesome too, especially the chewy cheese they use.", "rating": 5, "date": "2016-08-15"}, {"excerpts": ["The meatballs on the meatball sub are the size of baseballs. ", "The wait time is a bit long, but we think it's worth it. ", "We also really enjoyed the decor: rebuilt wooden tables and wooden walls - a nice look. ", "We loved the upstairs - got to see the kitchen make the pizzas below. ", "Definitely coming back here to try different things on the menu!"], "author": "Convict T.", "review": "Tried this place out with a Groupon, and glad we did! The food was phenomenal. The portions are gigantic. The meatballs on the meatball sub are the size of baseballs. The wait time is a bit long, but we think it's worth it. We also really enjoyed the decor: rebuilt wooden tables and wooden walls - a nice look. We loved the upstairs - got to see the kitchen make the pizzas below. Definitely coming back here to try different things on the menu!", "rating": 4, "date": "2015-10-28"}], "tomato pie with cheese and basil pizza": [], "grandma pizza": [], "sicilian": [{"excerpts": ["The definite winner compared to the Sicilian at least.\n\n"], "author": "Rod M.", "review": "Located near AT&T park is Slice House. \n\nTried the :\nSicilian-  I'd pass on this next time. Just not very tasty all members of our group agreed.\n\nWiseguy- Housemade Italian Sausage & Calabrese Link Sausage, Tomato Sauce, Ricotta, Hot Pepper Oil, Pepperoni, Mozzarella, Green Onion. The definite winner compared to the Sicilian at least.\n\nService was friendly, they have a flat screen on the first floor would be nice if they also had flat screens on the second floor of the venue for sports fans. \n\nAll in all a nice venue for a pizza near the ballpark.\n\n\nIf you like my reviews, consider \"following\" my profile for reviews all across the SF Bay Area . Why \"follow\" someone?  It causes the person you follow's reviews to tier to top when you pull up a business. I find this very handy when researching venues. \n\nRod's Review grading scale explained. Essentially I personally base it on the likelihood of a return visit and I try to be stingy with 5 star reviews since they should be \"special\" in my eyes. Price/Value also play a role obviously but there are $ and $$$$ littered across my grading scale. \n\n5 stars - \"I'll go out of my way\" (approx 6 % of my reviews)  4 stars- \"If I was in the area I'd go here and would recommend\", (approx 38% of my reviews)  3 stars \"Maybe if was nearby\", (approx 37% of my reviews) 2 stars -\"Would likely not return, Only if you want to go\", (approx 16% of my reviews)  1 star -\"No thanks, even if I was hungry\", (approx. 3 % of my reviews)", "rating": 3, "date": "2018-10-10"}, {"excerpts": ["I had the Sicilian and it was good."], "author": "Juan V.", "review": "It was a pleasant surprise to run into the Slice House a block away from AT&T Park. The slices are so delicious because it's done by the King of Bay Area Pizza Tony. \nInside the slice house was spacious and very comfortable. I had the Sicilian and it was good.", "rating": 5, "date": "2018-07-26"}, {"excerpts": ["I ordered a slice of the Sicilian ($6). ", "My friends and I stood around waiting for our orders, and everyone got their order fairly quickly....except me. ", "I looked at the time stamps of my pictures ", "and I waited around 15 minutes for my to-go order. ", "It was honestly a bit ridiculous, especially since the slice was already pre-made in the stand. "], "author": "Dianna H.", "review": "Came here for a quick bite with my friends prior to the Lady Gaga concert right across the street at AT&T park. We were in a rush since we saw the long lines to get in across the street, so instead of eating in we opted for takeout. \n\nTo make things faster, we all ordered by the slice from their display case as the pizza was already pre-made. I ordered a slice of the Sicilian ($6). My friends and I stood around waiting for our orders, and everyone got their order fairly quickly....except me. I looked at the time stamps of my pictures and I waited around 15 minutes for my to-go order. It was honestly a bit ridiculous, especially since the slice was already pre-made in the stand. My friends all ordered one right after another, so we were all really confused why my slice alone was taking so long.\n\nAfter a while we went up to one of the servers and asked him about my order, and when he checked in with the rest of the folks behind the counter, it seemed like they had forgotten my order. What a bummer!\n\nBecause we waited so long for my pizza, we ended up stuffing our faces outside on a bench and didn't really have time to slowly savor the food =/ I remember it being all right but nothing particularly memorable.", "rating": 3, "date": "2017-09-08"}, {"excerpts": ["My kid and I ordered the Sicilian, the Tomato Basil  and the Monster Meat slices with a side of Meatballs.  ", "SOOOO Good!  ", "Man, I am not kidding.  ", "The sauce on the meatballs and the pizza was terrific and the cheese was top quality as it melted so generously.  ", "Yes, there was a line.  ", "Yes there were only stools in the upstairs loft.  ", "But when I was eating, I forgot about all these little setbacks.  ", "The food totally overcame any small negatives!  ", "Great job slices!"], "author": "Javier L.", "review": "Got tickets to go see a Giants game, so pizza was going to be in my plans.  Saw this fine eatery on yelp and the pictures did it Justice! My kid and I ordered the Sicilian, the Tomato Basil  and the Monster Meat slices with a side of Meatballs.  SOOOO Good!  Man, I am not kidding.  The sauce on the meatballs and the pizza was terrific and the cheese was top quality as it melted so generously.  Yes, there was a line.  Yes there were only stools in the upstairs loft.  But when I was eating, I forgot about all these little setbacks.  The food totally overcame any small negatives!  Great job slices!", "rating": 5, "date": "2018-06-19"}, {"excerpts": ["I have a weakness for Sicilian pizza, and ", "not many places in the city have it, let alone make it well! ", "My favorite slice to date is the Sicilian. ", "If you don't like the thickness of the Sicilian crust, you can opt for one of their regular triangle slices, which are just as good! "], "author": "Eva C.", "review": "Mama mia! Delizioso! One of my fave pizza places in the city, it's solid! I have a weakness for Sicilian pizza, and not many places in the city have it, let alone make it well! My favorite slice to date is the Sicilian. For a slice, it's about $6, but it's a hefty piece!\n\nIf you don't like the thickness of the Sicilian crust, you can opt for one of their regular triangle slices, which are just as good! The best regular pizza I had from them had pepperoni, sausage, ricotta (YUM), and green onion, it was the slice of the day!\n\nAs for other options, I've tried the meatballs, which are okay. And I love their beer they have on tap!\n\nThey have pretty good happy hour specials on slices and beer, but they don't count during Giants games, which is usually the only reason I'm in that area.", "rating": 4, "date": "2017-11-07"}, {"excerpts": ["I usually get the Sicilian and a slice of the day (whatever it is).  "], "author": "Eric P.", "review": "My wife and I live next door and we seem to stop by Slice House about 1x per week.  Amazing pizza.  I usually get the Sicilian and a slice of the day (whatever it is).  plus they sometimes do this pizza with a chicken parm thing on top that is amazing.  \n\nthey also serve beers, which is nice.", "rating": 5, "date": "2018-02-16"}, {"excerpts": ["Regular slices, Sicilian slices, gluten free options and other Italian food options. ", "Location is right by the ballpark so a nice option for reasonable priced eats during game day . ", "It is convenient that you can stop by here to just order slices or an entire pizza. ", "As far as the pizza, it's average for me. ", "I preferred their regular slice/thin crust style over the Sicilian style. ", "The regular slice was large but for like $5 it better be. ", "The Sicilian was also a large slice but a little too doughy for my preference. ", "Didn't get to try the other menu items but ", "the meatballs and some of the pasta dishes looked good. ", "Would I go out of my way to get pizza here? ", "No, but if you want a reasonably priced slice with fast service near the ballpark this is the place"], "author": "Peter P.", "review": "The pizza here is ok. Like that they have options. Regular slices, Sicilian slices, gluten free options and other Italian food options. Location is right by the ballpark so a nice option for reasonable priced eats during game day . It is convenient that you can stop by here to just order slices or an entire pizza. As far as the pizza, it's average for me. I preferred their regular slice/thin crust style over the Sicilian style. The regular slice was large but for like $5 it better be. The Sicilian was also a large slice but a little too doughy for my preference. Didn't get to try the other menu items but the meatballs and some of the pasta dishes looked good. Would I go out of my way to get pizza here? No, but if you want a reasonably priced slice with fast service near the ballpark this is the place", "rating": 3, "date": "2017-07-28"}, {"excerpts": ["There are always 4-6 different pies available for slices, from regular cheese & pepperoni to thick squares of Sicilian and their ever-changing slice of the day.  ", "And if you feel you need to have some \"healthy\" food with your pizza, add a salad with the slices.  ", "Our normal order before a game are 2 slices (one each for my wife & myself) and a salad to share.  "], "author": "Jeffrey S.", "review": "My new favorite place to eat right by AT&T Park, Slice House offers large pizza slices for a reasonable price.  There are always 4-6 different pies available for slices, from regular cheese & pepperoni to thick squares of Sicilian and their ever-changing slice of the day.  And if you feel you need to have some \"healthy\" food with your pizza, add a salad with the slices.  Our normal order before a game are 2 slices (one each for my wife & myself) and a salad to share.  Each slice is good enough for one person.\n\nI recommend coming here an hour before game time, so you can sit and relax.  There are 2 TVs that are always tuned in to sports stations.  But if you are in a hurry, get your slices to go and walk them into the game.  The Giants have a very fan-friendly policy that allows guests to take in food from the outside (just no alcohol or drinks in metal or glass containers).  Food here will be a lot cheaper (and tastier) than what you can get inside the stadium.\n\nThe staff is also very friendly and helpful.  The food runners move fast to get plates to tables quickly.", "rating": 5, "date": "2016-10-06"}, {"excerpts": ["Had the Sicilian slice and it really filled me up. ", "Super delicious, and on the greasy side. ", "I went in for lunch the next day and tried to order a pasta, but they said they don't do pasta during lunch. ", "So I got another Sicilian. ", "Lol."], "author": "Alex K.", "review": "Had the Sicilian slice and it really filled me up. Super delicious, and on the greasy side. I went in for lunch the next day and tried to order a pasta, but they said they don't do pasta during lunch. :(\n\nSo I got another Sicilian. Lol.", "rating": 4, "date": "2017-01-19"}, {"excerpts": ["Every pizza I've tried was good, but my favorites are: the Sicilian since it's pan-style and with pepperoni and sausage; "], "author": "Peter L.", "review": "Every pizza I've tried was good, but my favorites are: the Sicilian since it's pan-style and with pepperoni and sausage; the Wiseguy since it has green onion and hot pepper oil; the Popeye since spinach and Ricotta worked well together.\n\nThe interior remained basically the same since it changed from Ironside. Still cozy with bench seatings or tables for two and more. They have a good selection of beers on tap too!\n\nLocated near AT&T Park, easy to find, decent parking with meters or try some of the nearby alleys for one hour parking. One of the best places for lunch, and likely dinner.", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["You can get a slice or the whole pie or pan as they describe it ranging from Classic American, Italian, Sicilian and Neapolitan. ", "They also have meatballs, chicken wings, garlic bread, salad, paninis and pasta to choose from. "], "author": "John G.", "review": "New kid on the block.\n\nSlice House is the brainchild of Tony Gemignani, a well-known champion pizza maker and pizza thrower. He is also the first and only American to date to win the World Champion Pizza Maker at the World Pizza Cup in Naples, Italy, where he was the first non-Neapolitan to achieve such glory. Since then, he's opened up a lot of popular and successful pizza joints in North Beach and all over San Francisco, Sacramento and Las Vegas. He's also got one joint inside AT&T Park for all you Giants fans. I'm sure Timmy would love that joint after hitting the peace pipe. \n\nAfter attending a meeting at the ballpark, we were walking back to work and we were all getting hungry. We were undecided on where to go at first until we stumbled in front of this place. You can't go wrong with pizza so that three of us all walked in and started perusing the menu. You can get a slice or the whole pie or pan as they describe it ranging from Classic American, Italian, Sicilian and Neapolitan. They also have meatballs, chicken wings, garlic bread, salad, paninis and pasta to choose from. We also each chose a slice (or two) of our own and a plate of meatballs to share with the group. \n\nSeating is self-service so you can choose your own table and make sure to grab the utensils and some water at the station. Our pizzas arrived in a jiff and thank goodness since we were starving. I ordered the Grandma and it was a perfect name as it was like comfort food. These are not thin-sliced pizzas as the dough is fairly thick, but it's very light and fluffy. You can tell the sauce is made from fresh tomatoes and not from a can based on the texture and wonderful flavor. And the ingredients are portioned evenly giving it a good balance from dough to sauce to fillings. The meatballs were delicious and seasoned well. It was moist, meaty and manly. \n\nIt's another good addition to the neighborhood (no surprises here) as it's reasonably priced and they even have a Sunday Brunch special. Take note that their hours of operation tends to change depending on the Giants schedule. \n\nGood quality pizza at a good value. Also good for dine in and take-out.", "rating": 4, "date": "2015-10-07"}, {"excerpts": ["Golden Boy is a tad better for Sicilian-style square slices.  ", "But this was tasty.  ", "Loved the fresh mozzarella and ample portion of sauce.  ", "Tasty,  but probably better to save your limited stomach space for more NY-style slices.\n \n", "Meatballs: ", "These are pretty awesome.  ", "Order a Cheese Slice and a side of 3 Meatballs and you have a hearty meal for $10 ", "(...a rarity in SF).  ", "There is so much nice red sauce in the bowl that your pizza crust can become a bread stick with tons of sauce leftover for your meatballs.  ", "The meatballs themselves taste meaty (i.e. not much filler) and firm, but not too firm."], "author": "Adam B.", "review": "There should be a San Francisco law introduced that requires amazingly tasty pizza slice joints to stay open an hour past bar closing on Thursday-Saturday.  The pizza here is a great, about the closest to a NY slice I've had.  But it's just not the same popping in sober during lunch or before a baseball game.  This food would taste even better as the last stop between a night out and my bed.\n\nCheese Slice: Having lived in Manhattan for 6.5 years, I really miss those casual and quick slices.  No toppings, no folding, just a firm bottom crust (that doesn't flop down) and parmesan cheese, red pepper fakes, oregano and garlic salt on top.  Most pizza by the slice is pretty bad in San Francisco.  Besides Tony's, Arinell is the only tolerable one out there.  At Slice House, it's almost like being back in NYC.  The crust is a little fluffier and they're a little more generous with cheese, but the sauce is spot on and the bottom of the crust is nice and firm from the oven reheating.  No garlic salt in sight unfortunately.  They pre-sprinkle on the parmesan cheese and oregano, which could be an issue for some, but is fine by me.\n\nGrandma Slice: Golden Boy is a tad better for Sicilian-style square slices.  But this was tasty.  Loved the fresh mozzarella and ample portion of sauce.  Tasty,  but probably better to save your limited stomach space for more NY-style slices.\n \nMeatballs: These are pretty awesome.  Order a Cheese Slice and a side of 3 Meatballs and you have a hearty meal for $10 (...a rarity in SF).  There is so much nice red sauce in the bowl that your pizza crust can become a bread stick with tons of sauce leftover for your meatballs.  The meatballs themselves taste meaty (i.e. not much filler) and firm, but not too firm.", "rating": 4, "date": "2015-09-21"}, {"excerpts": ["With that in mind, I ordered a $6 square of the Sweet Grandma's Pizza, a Sicilian-style creation of which they make a limited number daily. ", "It's really more a thick foccacia-like loaf with a sauce made of sweet, vine-ripened tomatoes ladled on top with mozzarella, garlic, oregano and pecorino (photo: http://bit.ly/1JwYGNf). "], "author": "Ed U.", "review": "Is pizza wunderkind Tony Gemignani in danger of overexposure? Yeah probably but it's not like he's sold out and become a Food Network whore like Guy Fieri whose most current culinary connection is the excessive amount of carbs he can stuff in his ample mouth. Like many in our fair city, I became a fan when he opened his first San Francisco place, Tony's Pizza Napoletana, back in 2009. That's when my friend Maggie organized a birthday fête for me, and we tried a number of different pies including my eventual favorite, the Cal Italia with four Italian cheeses, prosciutto, a Croatian sweet fig preserve and a liberal drizzle of a balsamic reduction. Fantastico and then Jamie W. and I recently tried Tony's other North Beach Capo's for the first time.\n\nFantastico seconda parte. And then we found out Tony was taking over the former Ironside space on 2nd which thrilled us since he's now in our 'hood. This may be his third San Francisco operation, but he has since expanded his pizza empire from here to Vegas. Fantastico terza parte? Jamie and I decided to give it a try this past Friday and were surprised to find it nearly empty at about 6PM since there's plenty of beer on tap (photo: http://bit.ly/1byJErQ). I got here a bit earlier than Jamie, so you'll probably never guess what pizza I ordered for the two of us. The Cal Italia, of course (photo: http://bit.ly/1PQiKek). The ingredients were the same, but the crust was different. He bills it as \"Ancient Grain Pizza\" which represents a blend of Tony's double-zero flour, spelt, semolina, sprouted grain & whole wheat.\n\nThe result was probably healthier than the original but not quite as satisfying because of the chewier texture. You would think that would be enough for two mean with healthy appetites, but we were mindful of the name of the place, Slice House. With that in mind, I ordered a $6 square of the Sweet Grandma's Pizza, a Sicilian-style creation of which they make a limited number daily. It's really more a thick foccacia-like loaf with a sauce made of sweet, vine-ripened tomatoes ladled on top with mozzarella, garlic, oregano and pecorino (photo: http://bit.ly/1JwYGNf). While I appreciated the freshness of the ingredients, the breadiness overwhelmed me somewhat, so much so that for the first time, I could not finish a slice of Tony's pizza.\n\nJamie liked his $5.25 slice of the Pepperoni, and the slice was frankly enough for two with an abundance of meat (photo: http://bit.ly/1GCBVXt). My one complaint was the amount of grease that accumulated on the cheese probably because it spent some time saturating in the display case. Even with the focus on pizza, there were plenty of other items on the menu - salads, a couple of pasta specialties, paninis and apparently a meatball sub to die for according to the server who was pushing it hard. I have no doubt that Tony will bring 'em in again although I hope he doesn't go into a franchise zone with his award-winning pizzas. Not worried yet, but I'll be back to monitor it. After all, someone has to make sure of the quality on a regular basis, right?\n\nFOOD - 4 stars...Tony is a pizza artist but some of the North Beach pizzazz seems missing here\nAMBIANCE - 4 stars...good use of the loft-like setting Ironside struggled with\nSERVICE - 3.5 stars...cordial enough\nTOTAL - 4 stars...a slice of Tony's is worth a pound of cure...or somethin' like that, goombah", "rating": 4, "date": "2015-04-27"}, {"excerpts": ["(Sicilian)\n\n"], "author": "Ken G.", "review": "I really enjoyed my experience here...over the course of a week I had a few different pizzas: Tomato & Basil Pie, Ancient Grains Pizza (Genoa), Square Pan Pizza (Sicilian)\n\nAll these pizzas were fantastic in their own way.  Rather than the toppings being fantastic, which were still great, the dough is what really made these outstanding.  Each one was unique in their own way...flavor and texture were so interesting and something that you really focus on with each bite.  The freshness of the ingredients really comes through.\n\nThis is a great casual spot to visit...you can order for dining in or take-away, but if possible, experience the pizzas as they were meant to be experienced by dining in...you really get the authentic flavor that does seem to disappear a bit when a pre-made pizza is reheated.", "rating": 5, "date": "2015-12-15"}, {"excerpts": ["I had a slice of the Pepperoni and a slice of the Sicilian. ", "The pepperoni was very good. ", "I liked it because their pepperoni is exceptionally spicy! ", "The pepperoni slice is NY style - big, thin and crispy. ", "The Sicilian was a thicker square slice with meats and fresh mozzarella. ", "I liked the pepperoni better, but the wife liked the Sicilian better. "], "author": "Joel V.", "review": "SLICE HOUSE is definitely a great place to grab some grub near AT&T Park. However, it is sort of overrated because of Tony owns it. I went after The Giants Run and enjoyed a couple slices and some beer. \n\nI had a slice of the Pepperoni and a slice of the Sicilian. The pepperoni was very good. I liked it because their pepperoni is exceptionally spicy! The pepperoni slice is NY style - big, thin and crispy. The Sicilian was a thicker square slice with meats and fresh mozzarella. I liked the pepperoni better, but the wife liked the Sicilian better. Both were solid. \n\nOnly downfall - really weird and crappy beer selection. Pabst, Hamms, Olympia? Come on...\n\n4.25 stars!", "rating": 4, "date": "2015-10-06"}, {"excerpts": ["i got the grandma sicilian style, and boi the tomato basil slice. ", "he was really happy with the crust on his slice because it held up really well.. ", "my crust i thought was too dough-y and a bit undercooked, but i havent had much sicilian style pizza to really judge. ", "the wings (6 for $10) were not delicious, so probably will not be having those anytime soon.  ", "overall - good spot in soma for pizza (its a 10 minute walk for me) but...not comparable to NB locale!"], "author": "Christina L.", "review": "hmmmm, in my mind, overrated and underwhelming to tony's in north beach. BY FAR. to be fair though, we only got slices, so would be happy to come back to try the actual pizzas. i got the grandma sicilian style, and boi the tomato basil slice. he was really happy with the crust on his slice because it held up really well.. my crust i thought was too dough-y and a bit undercooked, but i havent had much sicilian style pizza to really judge. the wings (6 for $10) were not delicious, so probably will not be having those anytime soon.  overall - good spot in soma for pizza (its a 10 minute walk for me) but...not comparable to NB locale!", "rating": 3, "date": "2015-07-07"}, {"excerpts": ["Simple choices for lunch -- cheese, pepperoni, Sicilian, or grandma pies, by the slice or whole (20\"), or meatball subs, or salads.  ", "SOMA pricing ($5-6/slice), so not cheap, but not out of line with anything else in the area.  ", "So far I've tried several kinds of pizza and the meatballs; ", "all perfect -- the best I've had anywhere.  "], "author": "Ryan L.", "review": "My new favorite pizza place in San Francisco.  Having an office a block away is going to be dangerous.\n\nSimple choices for lunch -- cheese, pepperoni, Sicilian, or grandma pies, by the slice or whole (20\"), or meatball subs, or salads.  SOMA pricing ($5-6/slice), so not cheap, but not out of line with anything else in the area.  So far I've tried several kinds of pizza and the meatballs; all perfect -- the best I've had anywhere.  Absolutely will return.\n\nThe only criticism I have is the line of people out the door waiting for pizza.  Three weeks after it opened, and there's still a line out the door at lunch.  They're not particularly fast for single slice orders, but not slow either, and probably bottlenecked by rate of production.  This is a high class problem to have, though.", "rating": 5, "date": "2015-05-15"}, {"excerpts": ["Offering classic New York, Sicilian, and grandma pies whole or by the slice, Slice House knocks it out of the park.\n\n", "The thicker Sicilian will have you drueling for more. ", "The \"grandma\" style is really just like your nona used to make. "], "author": "CJ G.", "review": "Pizza maestro Tony Gemignani continues to build his delicious pizza empire. \n\nNow open on Second Street about a block from AT&T Park where he has two slice counters is Slice House. Offering classic New York, Sicilian, and grandma pies whole or by the slice, Slice House knocks it out of the park.\n\nAs expected all styles of pizza are excellent. The crust is just the right mix of crispy and chewy and, of course, has the perfect char. The New York style is better than Grimaldi's in Brooklyn.  The thicker Sicilian will have you drueling for more. The \"grandma\" style is really just like your nona used to make. Also as tasty are the grinders, pastas, and even gluten-free pizza.\n\nThe restaurant is counter service: you wait in line to order and pay, then take a seat, although finding one at lunch can be a challenge, and your order is brought to you. Be aware: lines can be long at lunch and on game days.\n\nSlice House offers a few wines, but more importantly to accompany the pizza, it offers a good selection of local craft beers. \n\nService is quick and efficient. Soft drinks were refilled even during the lunch hour rush. \n\nSlice House will do more than fulfill your pizza craving. Welcome to the neighborhood, Tony.", "rating": 5, "date": "2015-05-07"}, {"excerpts": ["From Sicilian (Square cut, think Golden Boy...) to a thin crust NY slice you won't be disappointed! ", "Came here on day two and was impressed... ", "Had a Sicilian slice (Pepperoni & Sausage) and it's a pillow like focaccia crust with a mild but robust red sauce covered in toppings and was piping hot when I was called to snag it... ", "Also took an order of Meatballs (3 for $5) are well seasoned and I can't wait to get them again next time. ", "Get in here before the lines out the door! ", "DON'T ", "SAY ", "I DIDN'T WARN YOU!"], "author": "Josh H.", "review": "Need a quick slice to warm the soul? The house will handle your cravings. From Sicilian (Square cut, think Golden Boy...) to a thin crust NY slice you won't be disappointed! Came here on day two and was impressed... New SOMA spot for a slice or a meatball fix, previous home to Iron Side. \n\nMy co-worker that is a true N.Y. East coaster says it's easily one of the best slices he's had in city. Had a Sicilian slice (Pepperoni & Sausage) and it's a pillow like focaccia crust with a mild but robust red sauce covered in toppings and was piping hot when I was called to snag it... Also took an order of Meatballs (3 for $5) are well seasoned and I can't wait to get them again next time. Get in here before the lines out the door! DON'T SAY I DIDN'T WARN YOU!", "rating": 5, "date": "2015-06-27"}, {"excerpts": ["And the sicilian slice was totally delicious."], "author": "Andrew K.", "review": "Cute space, unbelievably kind and thoughtful woman working there today. She made my birthday very special with her generosity. And the sicilian slice was totally delicious.", "rating": 5, "date": "2016-02-16"}, {"excerpts": ["They got big foldable triangular slices, proper grandma slices, big thick Sicilian slices - what's not to love? ", "Plus a nice set of beers on draft, and it's not even expensive, and it's open until 10. ", "Seriously an awesome addition to the neighborhood."], "author": "Marco C.", "review": "Oh man I'm going to be as regular here as Norm was at Cheers. Fortunately it's just far enough from where I live that it's an incentive to go for a run, so at least I won't end up looking like Norm.\n\nSolid NY-style pizzeria. They got big foldable triangular slices, proper grandma slices, big thick Sicilian slices - what's not to love? Plus a nice set of beers on draft, and it's not even expensive, and it's open until 10. Seriously an awesome addition to the neighborhood.", "rating": 5, "date": "2015-04-21"}, {"excerpts": ["easy 3-3.5 stars\n\nDrive by this place several times and decided to stop in for lunch - going to try 2 slices : pepperoni and Sicilian. \n", "Sicilian : square slice, focaccia bread style pizza, thicker crust.  ", "a little too much bread for me "], "author": "Ben C.", "review": "easy 3-3.5 stars\n\nDrive by this place several times and decided to stop in for lunch - going to try 2 slices : pepperoni and Sicilian. \nLine to order - Long. 15-20 people and it is moving REALLY slow. Order at a counter then you go sit down. \nCommitted myself to try this spot otherwise I would have already left. 20+ min wait to order seems ridiculous. \nSeating - sparkly populated. Tons of open seating. \nOrdered. 5 min wait is what I am told.  Took less than 2. \n\nSicilian : square slice, focaccia bread style pizza, thicker crust.  a little too much bread for me but was still a solid slice.\n\nPepperoni : large traditional slice, prob 6\".  tons of peperoni but a bit heavy on the grease.  Good, but not great. was a bit underwhelmed.\n\n8 beers on tap - ok selection. About half are local. \nDozen beer options in bottles/can. Mostly crap.", "rating": 3, "date": "2015-07-09"}, {"excerpts": ["I came here and grabbed a slice of Sicilian and some German Wings on the side. ", "The pizza slice was pretty big and almost filling, but the wings topped my dinner off nicely. ", "Since I ordered one of the slices off the windowed display, a food runner came and delivered it at my table after they reheated it in an oven. "], "author": "Trent L.", "review": "This pizza shop has a nice pub ambience to it. Located just a few blocks from where the Giants play, this place can get rather busy during game days.\n\nI came here and grabbed a slice of Sicilian and some German Wings on the side. The pizza slice was pretty big and almost filling, but the wings topped my dinner off nicely. Since I ordered one of the slices off the windowed display, a food runner came and delivered it at my table after they reheated it in an oven. It's not as good as a fresh baked pizza, but for around 5 bucks, it was pretty satisfying.\n\nThe wings were pretty good in terms of flavor and how easily it came off the bone, but it certainly wasn't freshly made. I could tell they reheated them because the thicker pieces were a little colder on the inside. It wasn't ice cold or anything. It just wasn't fresh.\n\nOverall it's a pretty nice place to grab some grub before a game. They have a good variety of beers on tap.", "rating": 4, "date": "2015-09-24"}, {"excerpts": ["i had the tomato and basil pie, and my brother had the sicilian.  "], "author": "Helen T.", "review": "good pizza by the slice.  i had the tomato and basil pie, and my brother had the sicilian.  both of us liked our pizzas, and they were quite filling.  \n\nthe slices here are cheaper and better tasting than the ones in the ballpark, so if you are going to the giants game, come here for pizza!", "rating": 4, "date": "2015-09-12"}, {"excerpts": ["The fact that they have Sicilian pizza is also rockstar!"], "author": "Michael S.", "review": "Best pizza I've seen so far in SF.  If you want the fancy pizzas order early.  Also remember you've got to eat pizza hot!  The fact that they have Sicilian pizza is also rockstar!", "rating": 4, "date": "2015-07-26"}, {"excerpts": ["I also like the Grandma Sicilian style pizza.  ", "Their crust is chewy and so satisfying.  ", "Love that they sell by the slice ", "and it's an easy place to pick up dinner on the way home from work.  ", "Husband likes the meatball sandwich.  "], "author": "Nina L.", "review": "My favorite is a slice of tomato pie.  Their sauce is tangy and sweet at the same time and they pile on the mozzarella.  I also like the Grandma Sicilian style pizza.  Their crust is chewy and so satisfying.  Love that they sell by the slice and it's an easy place to pick up dinner on the way home from work.  Husband likes the meatball sandwich.  The mixed greens salad is also very satisfying with lots of olives, cheese, and glazed walnuts.", "rating": 5, "date": "2015-07-11"}, {"excerpts": ["I went here on a Friday game night and got a slice of tomato basil, plain, Sicilian and grandma and a side of meatballs to go. ", "The order was served up quickly.  ", "The plain and Sicilian were my favorite, especially when dipped in the marinara sauce that accompanied the meatballs. ", "The crust at this place is truly delicious. ", "I'm so excited to have a regular pizza spot now ", "and I will be back often."], "author": "Amy S.", "review": "Great addition to the neighborhood! I went here on a Friday game night and got a slice of tomato basil, plain, Sicilian and grandma and a side of meatballs to go. The order was served up quickly.  The plain and Sicilian were my favorite, especially when dipped in the marinara sauce that accompanied the meatballs. The crust at this place is truly delicious. I'm so excited to have a regular pizza spot now and I will be back often.", "rating": 5, "date": "2015-05-01"}, {"excerpts": ["And the Sicilian slice is as if it was sent from heaven.  ", "I can't say enough great things about this place and ", "how it has stepped up the game in the neighborhood.  ", "Well done Tony...", "I hope you thrive in this location for years and years."], "author": "Mike Z.", "review": "This pizza is on a whole 'nother level than anything else in the neighborhood.  A simple slice of cheese is a perfect study on the art of making a perfect pizza:  glorious cheese with fine seasoning atop, rich flavorful tomato sauce underneath, held together with a perfect pizza crust, foldable and flaky (eat your crust Jimmy).  Their meatball sandwich is also off the charts....3 delicious meatballs covered in sauce tucked inside ridiculously tasty and flaky bread.  And the Sicilian slice is as if it was sent from heaven.  I can't say enough great things about this place and how it has stepped up the game in the neighborhood.  Well done Tony...I hope you thrive in this location for years and years.", "rating": 5, "date": "2015-11-26"}, {"excerpts": ["I was only able to choose whole pies from what slices they were serving (pepperoni, cheese, grandma, and Sicilian). ", "So if you want more of a selection  check to see if the Giants are in town.  ", "Even though it was limited the guys made a fresh whole Grandma and Pepperoni pizzas for my take out.  ", "For two whole pizzas expect to shell out over $75.00"], "author": "Robert J.", "review": "This is awesome that we do not have to go to Washington Square to get Tony's pizza.  The only drawback, according to the dinner menu, is that you cannot get all the specialty pizza's that I  love at Tony's Neopolitina. The reason why I did not give this location Five Stars as I do the original location, is attributed to that on Giants game day their menu becomes very limited.  So  this little fact was not known to me or well publicized.  Not knowing this fact, I walked to Slices for two  whole pizzas as take out. I was only able to choose whole pies from what slices they were serving (pepperoni, cheese, grandma, and Sicilian). So if you want more of a selection  check to see if the Giants are in town.  Even though it was limited the guys made a fresh whole Grandma and Pepperoni pizzas for my take out.  For two whole pizzas expect to shell out over $75.00", "rating": 4, "date": "2015-05-02"}], "spumoni": [{"excerpts": ["Their menu is quite extensive with Italian fare -- they have pasta, antipasti, salads, focaccina (panini sandwiches), garlic bread, meatballs, Italian desserts (i.e. tiramisu, spumoni, etc) and more.\n", "* ", "Furthermore, in addition to traditional pizzas (i.e. cheese and pepperoni), they make pan pies, speciality pizzas with a number of fancy ingredients and artisan pizzas too.\n", "* "], "author": "Michael F.", "review": "I decided to stop here for some lunch during my break from work.  I paid $5 for a slice of cheese pizza to-go.  Before I delve into how the pizza itself was, let me break down some facts about this place:\n\n* You can either wait in line and get your orders to-go or you can eat-in by sitting at one of their tables.  (They have seating both upstairs and downstairs.).  Regardless, you need to first get in line, place your order and pay.\n* Don't think that it's just a place that serves only pizza, based upon its name.  Their menu is quite extensive with Italian fare -- they have pasta, antipasti, salads, focaccina (panini sandwiches), garlic bread, meatballs, Italian desserts (i.e. tiramisu, spumoni, etc) and more.\n* Furthermore, in addition to traditional pizzas (i.e. cheese and pepperoni), they make pan pies, speciality pizzas with a number of fancy ingredients and artisan pizzas too.\n* Drink wise, they have coffee, soda and water.\n\nPros:\n\n+ Despite the line, transactions were quick and I was in and out in ten minutes.\n+ Aside from ordering a slice of cheese, I also wanted garlic bread.  However, the cashier informed me that due to the power outage from the previous day, they had been unable to bake any in time for the lunch rush.  She was very apologetic about it and I understood as my office building nearby experienced the same power outage.\n+ Despite the price, you definitely get your money's worth.  The slices here are HUGE.  And they've been very tasty too.\n\nCons:\n\n- The only negative was that the slice I ordered was swimming in grease.  Yes, I know that pizza is known for being greasy.  But I had to pretty much blot the pizza with several paper towels to remove the excess grease.  I don't have a problem with greasy food, but I tend to get an upset stomach whenever I eat something that's overly greasy.\n\nOverall, I'm impressed.  I'm sure I'll be back soon.\n\n4 stars", "rating": 4, "date": "2015-12-13"}]}