{"cookie dough with pretzels and chocolate chips": [{"excerpts": ["When we visited, ice cream flavors included vanilla, peaches and bourbon, Mountanos Family organic coffee, cookie dough with pretzels and chocolate chips, TCHO 60.5% chocolate (TCHO is a fancy chocolate brand from Berkeley), and mint chip. ", "These were sold at $5 for 2 scoops, $6 for 3 scoops, $7 for a half pint, and $11 for a full pint. ", "(The peaches and bourbon flavor was $1 extra.) ", "Daily scratch-made waffle bowls and cones were $1.50 each and toppings and sauces were $1 each. ", "Examples included all-natural rainbow sprinkles, organic whipped cream, spiced oat crumble (new), and TCHO crispies and chocolate sauce. ", "They also sold a root beer float for $6.50 and vegan pops for $4 each. ", "I tried a couple of these and a half-pint of cookie dough with pretzels and chocolate chips. ", "* Cookie Dough with pretzels and chocolate chips (half pint, $7)\n\n"], "author": "Daniel B.", "review": "The ice cream we had from Smitten Ice Cream in the Marina District was delicious. This is a California ice cream chain that differentiates itself from other ice cream shops by churning each order to order. The result is some of the freshest-tasting ice cream you'll probably ever eat. If you've ever had Thai-style stir-fried ice cream (or \"rolled\" ice cream) which is flash-frozen on anti-griddles, the idea here is similar; however, the mixing and churning process at Smitten is a lot less labor-intensive thanks to the company's patented machinery and equipment.\n\nThis location of Smitten opened on July 2, 2016 in the old Judy's Cafe space on Chestnut. In the 1930s and 1940s, this space was home to another ice cream shop, Eastman's Ice Cream. I'm sure Eastman's never foresaw a huge liquid nitrogen tank installed on the second level, overlooking the shop and connected to a network of touchscreen tablets and ice cream churners below. When you place your order at the register, it's automatically sent into Smitten's system and the creation process begins. At each station, ingredients are mixed and frozen in only about 90 seconds. It's fun to watch and sort of a mini spectacle. You'll see bowls and mixers spinning in different directions among billowy clouds of thick white smoke. It looks like some sort of crazy science experiment.\n\nWhile the whole contraption looks really cool and technologically advanced, some might also perceive it as gimmicky. Fortunately, the ice cream is actually tasty.\n\nWhen we visited, ice cream flavors included vanilla, peaches and bourbon, Mountanos Family organic coffee, cookie dough with pretzels and chocolate chips, TCHO 60.5% chocolate (TCHO is a fancy chocolate brand from Berkeley), and mint chip. These were sold at $5 for 2 scoops, $6 for 3 scoops, $7 for a half pint, and $11 for a full pint. (The peaches and bourbon flavor was $1 extra.) Daily scratch-made waffle bowls and cones were $1.50 each and toppings and sauces were $1 each. Examples included all-natural rainbow sprinkles, organic whipped cream, spiced oat crumble (new), and TCHO crispies and chocolate sauce. They also sold a root beer float for $6.50 and vegan pops for $4 each. The menu states they use organic milk and cream and fruits and vegetables from west coast farms.\n\nThe menu also featured a few sundaes which were ice cream, topping, and sauce combinations that Smitten put together. I tried a couple of these and a half-pint of cookie dough with pretzels and chocolate chips. They were:\n\n* Choc Full O' Mint (two scoops, $10.50) - fresh mint chip ice cream, TCHO crispies, TCHO chocolate sauce, organic whipped cream, waffle bowl\n* Dough My Goodness (two scoops, $9) - cookie dough ice cream, cookie dough, TCHO chocolate sauce, organic whipped cream\n* Cookie Dough with pretzels and chocolate chips (half pint, $7)\n\nIn general, the ice cream was great. Of the items I tried, my favorite was the Choc Full O' Mint sundae. It had the best combination of flavor and consistency, from the smooth and refreshing mint ice cream to the light and crunchy TCHO crispies and house-made waffle bowl. The cookie dough ice cream was excellent as well. Personally, I could have done without the pretzels, but they were fine. All of the ice cream flavors were sweet, rich, and delightfully creamy. To me, taste and quality-wise, this ice cream was on par with other specialty and gourmet ice cream shops. So, to be honest, Smitten's elaborate setup doesn't really produce an ice cream that is head and shoulders above the competition, but it is still very good and quite satisfying. It's definitely worth a visit.\n\nAfter tip and tax, I did think $13 was pushing it a bit for a two-scoop sundae, but then again, this is the Marina in San Francisco.\n\nService was quick.\n\nAt the time of writing this review, Smitten has six locations in the Bay Area (four in San Francisco) and three in Southern California. This location was the third San Francisco store. This is a fairly small shop with limited indoor and outdoor seating. The outdoor seats are neat; they're custom-made out of milk crates. The inside of the shop has a modern and trendy vibe.", "rating": 4, "date": "2018-07-17"}, {"excerpts": ["cookie dough with pretzels and chocolate chips. ", "Y'all. ", "This is where it is at! ", "But... five bucks for a scoop?! ", "Outrageous. ", "Trust me, I'm all for the bougie hype of San Fran. ", "Even the free has a price. ", "But this is the single best scoop of ice cream (excluding gelato and boozy ice cream!) ", "ive ever had. ", "Doubting me? ", "Go try it for yourself. ", "You will not be disappointed. ", "It is a scoop of creamy, perfectly balanced sweetness. ", "this flavor though. ", "It's almost like it was churned by angels."], "author": "Amanda P.", "review": "cookie dough with pretzels and chocolate chips. Y'all. This is where it is at! But... five bucks for a scoop?! Outrageous. Trust me, I'm all for the bougie hype of San Fran. Even the free has a price. But this is the single best scoop of ice cream (excluding gelato and boozy ice cream!) ive ever had. Doubting me? Go try it for yourself. You will not be disappointed. It is a scoop of creamy, perfectly balanced sweetness. this flavor though. It's almost like it was churned by angels.", "rating": 5, "date": "2017-08-24"}, {"excerpts": ["Ordered the cookie dough with pretzels and chocolate chips. ", "The girl only added cookie dough. ", "No pretzels or chocolate chips. ", "Too much trouble to ask so we left. ", "Super sweet and tasteless \n", "I probably will not visit this location again. \n", "Sorry but an honest appraisal of this business."], "author": "Lynette J.", "review": "Sorry to give this place only a 2! Star rating but there are several reasons \nStaff super slow - like in slow motion. Not sure how they would ever handle a crowd? \nLimited options for flavors\nExpensive for what you get\nNo samples \nCan only get one flavor \nAnd the combo we ordered was only partially delivered.  Ordered the cookie dough with pretzels and chocolate chips. The girl only added cookie dough. No pretzels or chocolate chips. Too much trouble to ask so we left. Super sweet and tasteless \nI probably will not visit this location again. \nSorry but an honest appraisal of this business.", "rating": 2, "date": "2017-05-26"}, {"excerpts": ["And the cookie dough with pretzels and chocolate chips with the brown sugar and caramel was bomb. ", "Def gonna revisit this place again my next SF visit!"], "author": "Monika O.", "review": "Super delicious! The waffle cones are super sweet! And the cookie dough with pretzels and chocolate chips with the brown sugar and caramel was bomb. Def gonna revisit this place again my next SF visit!", "rating": 5, "date": "2017-08-21"}], "classic vanilla": [{"excerpts": ["I came here with my coworker and he got the classic vanilla ice cream. ", "And he said it was delicious. ", "So if a classic flavor is delicious, that means it's a great ice cream place because you can't go wrong with a vanilla flavor. ", "Haha. ", "I ordered a earl grey with chocolate chip and it's probably best earl grey ice cream I ever had. ", "Although I haven't had too much earl grey ice cream in my life. ", "Haha. "], "author": "Christine H.", "review": "I came here on a weekday during my lunch hour and there was no one waiting, which is a plus. I'm assuming it's because they just opened. \n\nI came here with my coworker and he got the classic vanilla ice cream. And he said it was delicious. So if a classic flavor is delicious, that means it's a great ice cream place because you can't go wrong with a vanilla flavor. Haha. I ordered a earl grey with chocolate chip and it's probably best earl grey ice cream I ever had. Although I haven't had too much earl grey ice cream in my life. Haha. The flavor of it was very strong, which is great then just tasting like plain ice cream. \n\nAlso, the way they make the ice cream was very neat because they use liquid nitrogen which is different than other ice cream stores. So it gives you a show while you're waiting to get your ice cream. I would say it does take a little bit longer for your ice cream to come out. I believe we probably waited for 5mins to get our ice cream. \n\nMinus one star of the price. The ice cream does cost some $$$. But overall, I would probably want to come here if I want a nice treat to myself and experience the epicness of them making it. Haha", "rating": 4, "date": "2016-11-13"}, {"excerpts": ["I went for the small scoop of classic vanilla in a waffle bowl with toasted almonds which totaled out to be $7. ", "Smitten is great because they make your ice cream right in front of you in the ice cream machines with nitrogen ", "so you know it's fresh! ", "The ice cream definitely tasted better than regular ice cream where it didn't melt as quick and the toasted almonds gave it a nice crunch. ", "The waffle bowl cone was really crunchy too, tasted amazing with the ice cream. ", "Everything about this place is cute & nice, only complaint is that they don't have many options to choose from."], "author": "Lisa W.", "review": "This ice cream place is one of those shops where everything is aesthetic in there so it convinces you to buy something so you can get a nice picture. Well this is the way I think so I knew I had to try this place at least once to get my picture. The interior is simple with a big smitten sign lit up high on the wall. The menu is simple with five flavors to choose from(I think it's different flavor everyday) and the toppings/sauces. I went for the small scoop of classic vanilla in a waffle bowl with toasted almonds which totaled out to be $7. Smitten is great because they make your ice cream right in front of you in the ice cream machines with nitrogen so you know it's fresh! The ice cream definitely tasted better than regular ice cream where it didn't melt as quick and the toasted almonds gave it a nice crunch. The waffle bowl cone was really crunchy too, tasted amazing with the ice cream. Everything about this place is cute & nice, only complaint is that they don't have many options to choose from.", "rating": 4, "date": "2017-01-14"}], "chocolate ganache with  guittard cacao": [], "brown sugar butter pecan": [], "huckleberry cream": [], "pumpkin chai": []}