{"fried wonton": [], "fried baby squid": [], "mushroom  egg flower soup": [], "seaweed  tofu soup": [], "mustard green": [], "chili green  bean curd soup": [], "mashed chicken  sweet corn soup": [], "sweet and sour prawns": [{"excerpts": ["Once the food finally arrived, the sweet and sour prawns were delicous, but that's hard to do wrong. ", "On the other hand, the mapo tofu was nothing like what mapo tofu should be."], "author": "Tian X.", "review": "I just moved to San Francisco from New York City and in the spirit of Chinese New Year, I decided to get lunch in Chinatown. This one was rated very well so I went ahead and four myself very disappointed.\n\nPerhaps it was because we were getting a 3:00 lunch or perhaps it was because it was Chinese new year, but this place needed more help. There was only one serve and only one guy working inthe litchan whichade the wait for our food painfully long. Once the food finally arrived, the sweet and sour prawns were delicous, but that's hard to do wrong. On the other hand, the mapo tofu was nothing like what mapo tofu should be.", "rating": 2, "date": "2010-02-16"}, {"excerpts": ["We ordered two dishes to share-the spicy tofu (without pork) and sweet and sour prawns. ", "We also got two bowls of rice. ", "Once the food arrived...it was really delicious. ", "The rice was soft and warm. ", "The prawns had some crunch and the sweet and sour sauce hit the spot. ", "The tofu wasn't very spicy though. ", "So it just tasted like tofu with some sauce...", "I'm used to more chunky tofu and more pepper. ", "The bill came out to $24 which is really a great price for a meal that left us quite full."], "author": "Esther E.", "review": "My friend and I chose this place through Yelp! We wanted Chinese food and this place was close and received 4 stars. The outside and the inside look very hole-in-the-wall ish but it has been my experience that some holes-in-the-walls serve amazingly authentic food. The inside is small--about 10 or so tables. On the day, we went it was very understaffed--one waiter, one cleaning lady and one chef so service was sloooooooooww. We ordered two dishes to share-the spicy tofu (without pork) and sweet and sour prawns. We also got two bowls of rice. Once the food arrived...it was really delicious. The rice was soft and warm. The prawns had some crunch and the sweet and sour sauce hit the spot. The tofu wasn't very spicy though. So it just tasted like tofu with some sauce...I'm used to more chunky tofu and more pepper. The bill came out to $24 which is really a great price for a meal that left us quite full.", "rating": 3, "date": "2010-02-15"}], "sweet and sour rock cod": [], "peking style spareribs": [], "short ribs": [], "satay beef": [], "chicken and salted fish fried rice": [{"excerpts": ["The chicken and salted fish fried rice was undercooked and by salted they mean fermented.  ", "The ingredients in their beef noodle soup did not seem fresh. ", "It's a little pricey for the quality of food you get. "], "author": "Andrew C.", "review": "My fiancé and I did not enjoy the food at all. The chicken and salted fish fried rice was undercooked and by salted they mean fermented.  The ingredients in their beef noodle soup did not seem fresh. It's a little pricey for the quality of food you get. The only bright side was the friendly waiter, he was quick and attentive. \n\nIf you are looking for a meal in Chinatown, don't go here. The prices, ingredient quality, and tea are all wrong. \n\nThey earned a two instead of a one because of their service, whom were very attentive, not their food, which I thought was poor.", "rating": 2, "date": "2015-09-09"}]}