{"bruschetta": [{"excerpts": ["The food was the highlight; I ordered the bruschetta and tricolore pizza and everything was delicious. ", "My only small complaint is the reusable napkins that they have at the tables are full of dust and ", "when I opened my napkin to place it on my lap, a flurry of dust went all over my food and drink.. ", "I will still come back and give Spiazzo another shot."], "author": "Brandon M.", "review": "I was impressed with Spiazzo. The staff were nice and the ambiance was very Italian like. The food was the highlight; I ordered the bruschetta and tricolore pizza and everything was delicious. My only small complaint is the reusable napkins that they have at the tables are full of dust and when I opened my napkin to place it on my lap, a flurry of dust went all over my food and drink.. I will still come back and give Spiazzo another shot.", "rating": 4, "date": "2018-11-08"}, {"excerpts": ["The Bruschetta seemed a tad pricey at $9.50, but we understood why the moment it arrived. ", "The toasted and buttered garlic bread slices were as big as rice paddles and topped with Kalamata olives. ", "Two were piled high with fresh tomatoes and basil in the traditional way, and the other two were spread with pesto and piled high with sliced mushrooms marinated in olive oil ", "(photo: http://bit.ly/2gtSJcx). ", "Really delicious, especially the unexpected mushroom bruschetta, and their abundance "], "author": "Ed U.", "review": "Ever since the Manor Coffee Shop fancied itself up into The Manor, Jamie W. and I have been hard pressed to find an alternative, just a place for good, old-school eats, but sure enough, there is a place just down the street that fits our requirements and with an Italian accent. We've passed by this ristorante in the past without giving it a thought, but the thought of a plate of pasta sounded just right for Sunday supper. Fortunately it wasn't very crowded at about 7:30PM, and we got a table right away surrounded by bottles of wine on their dining room divider (photo: http://bit.ly/2gA2x5s). The menu was chock full of items that sounded like comfort food for paisans like us. OK, we're not real paisans, but you know what I mean.\n\nWe were first handed quite a bread plate with huge slices of rustic goodness accompanied by a creamy tomato sauce (photo: http://bit.ly/2gc49z7). We tried to control ourselves for the carbs to come but to little avail. The Bruschetta seemed a tad pricey at $9.50, but we understood why the moment it arrived. The toasted and buttered garlic bread slices were as big as rice paddles and topped with Kalamata olives. Two were piled high with fresh tomatoes and basil in the traditional way, and the other two were spread with pesto and piled high with sliced mushrooms marinated in olive oil (photo: http://bit.ly/2gtSJcx). Really delicious, especially the unexpected mushroom bruschetta, and their abundance made us second-guess our soon-to-arrive entrees.\n\nJamie went for a pizza as is his natural want, and it was the $16.95 Pizza Capriciossa topped with prosciutto, artichoke, mushrooms, mozzarella, and just a smidgen of tomato sauce (photo: http://bit.ly/2fiBSYd). All the ingredients were tasty, and the crust was not too bready. However, a bigger ladle of tomato sauce would have been welcome to lubricate the gullet as it went down. I was in a seafood mood, so I ordered the $16.95 Spaghetti Alla Vongole, a heaping plate of thick spaghetti pasta with fresh clams, garlic, white wine, chili pepper flakes, all of it in a light tomato sauce (photo: http://bit.ly/2fJsXzW). It was frankly just what I wanted even if it wasn't a culinary masterpiece. Neither of us could finish our entrees, so we had enough for our respective lunches at work the following day. These paisans will return soon. Yeah, I'm talking about me and Jamie.\n\nFOOD - 4 stars...old-school Italian, well executed and certainly plenty of it...just more sauce on the pizza, please\nAMBIANCE - 3 stars...nothing remarkable and a tad squeezed when it crowds up like on Saturdays\nSERVICE - 3.5 stars...pretty reasonable though not overly friendly here\nTOTAL - 4 stars...now we gotta place to eat like paisans...mangia!", "rating": 4, "date": "2016-11-20"}, {"excerpts": ["Great bruschetta!\n", "The location is terrible for parking ", "and it's usually a pretty tight cramped experience I highly recommend if you do decide to eat from this restaurant you do it with takeout. \n", "Or you could choose a time to go that they're not so busy and maybe take an Uber to get there"], "author": "Kitty G.", "review": "Great bruschetta!\nThe location is terrible for parking and it's usually a pretty tight cramped experience I highly recommend if you do decide to eat from this restaurant you do it with takeout. \nOr you could choose a time to go that they're not so busy and maybe take an Uber to get there", "rating": 3, "date": "2018-02-24"}, {"excerpts": ["Had the bruschetta (pictured) and spaghetti bolognese, very delicious and full of flavor. ", "Will be coming back with a larger group to feast and try different options and the extensive wine list. ", "Can't wait to come back!"], "author": "Edward A.", "review": "This was an amazing find out in West Portal. The service was amazing, I'm pretty sure the owner was the one taking our orders and serving us. We didn't wait too long for a table, even on a Saturday night as the amazing staff works with such efficiency and diligence. Had the bruschetta (pictured) and spaghetti bolognese, very delicious and full of flavor. Will be coming back with a larger group to feast and try different options and the extensive wine list. Can't wait to come back!", "rating": 5, "date": "2018-04-14"}, {"excerpts": ["We also had bruschetta as an appetizer.\n", "Everything was wonderful and we finished everything.\n", "This ristorante is worth visiting again"], "author": "Philip C.", "review": "We had dinner here and were pleasantly surprised.\nMy partner had the angel hair pasta with shrimp and scallop while I had the fettuccine with pesto sauce. We also had bruschetta as an appetizer.\nEverything was wonderful and we finished everything.\nThis ristorante is worth visiting again", "rating": 4, "date": "2017-06-11"}, {"excerpts": ["I have tried their Bruschetta, Calamari, Ravioli Pesto e Pollo, Pollo Imperatore, and their Eggplant Parmigiana and none have ever disappointed. ", "The desserts are also a must every time. "], "author": "Anna P.", "review": "We have been here so many times. It is our favorite place to eat in the city. I have tried their Bruschetta, Calamari, Ravioli Pesto e Pollo, Pollo Imperatore, and their Eggplant Parmigiana and none have ever disappointed. The desserts are also a must every time. The creme brulee is among the best I've ever had. \n\nThe wait can be long and the dining room can be crowded, but it is well worth it. All authentic, all delicious.", "rating": 5, "date": "2016-07-17"}, {"excerpts": ["Husband fell in love with the mushroom bruschetta. "], "author": "Ang L.", "review": "We found our go-to Italian spot! Why? Because of Michelle - our amazing super server! I seriously have never experienced such superior service as hers. We were celebrating my mother-in-law's birthday last Saturday and had 2 kids and 1 toddler. She completely catered to them. She saw our every need before we even thought of them. She must be a mom, but boy did she make what could have been a stressful dinner a relaxing one! Michelle was wonderful the entire time - from start to finish, and constantly checked up on us to see how we were doing. Half of the family decided to do family style with the kids, and to make things easier, she brought over larger flatware to eliminate too many dishes taking over the table. Told you she's a super server!\n\nOh and of course, let's not forget about the food. Everything was delicious! Husband fell in love with the mushroom bruschetta. We can't wait to go back for more! \n\nThanks for a wonderful dining experience, Spiazzo!", "rating": 5, "date": "2015-11-16"}, {"excerpts": ["It's well dressed with a mustard, garlicky based sauce and pairs well with the bruschetta. \n\n"], "author": "Rosalyn W.", "review": "Upon returning to this fine establishment it reminds me why I hold Spiazzo to a higher standard than most restaurants. And every time I visit they live up to their elevated level of quality, decadence and service. \n\nRecently they have added house made breadsticks to their welcoming bread sampler accompanied by their unique tapenade. The breadsticks aren't Olive Garden-esque doughy, nasty breadsticks but also aren't a traditional hard as a rock, pretzel-like breadstick. They're a slightly crispy well seasoned addition to their happy welcome. \n\nCannot say enough tremendous things about their specials menu. It's quite large without being overwhelming with too many options. And it changes seasonally which is the mark of a restaurant on top of utilizing the best ingredients available per time of year. \n\nOne of my favorite dishes is the cold seafood salad. The seafood is precisely cooked to maximize the fresh seafood flavor without being too robust or fishy. It's well dressed with a mustard, garlicky based sauce and pairs well with the bruschetta. \n\nThe Eggplant Parmesan is stacked with such grace and elegance that one would think the chef graduated from MIT. Not overloaded with marinara sauce and cheese, it allows the eggplant to breath and sing into the mouths of its diners. \n\nThe aspect I appreciate the most of Spiazzo is the ideology that the customer should be pleased with everything they order. If you request extra sauce, additional meats, no meat, extra cheese, pink sauce - even if it's not on the menu, they make it happen. The servers treat you like royalty and don't give you a nasty look if you ask for something outside of the normal realm of spaghetti and meatballs.", "rating": 5, "date": "2014-11-09"}, {"excerpts": ["but I get with spaghetti noodles), penne al salmone, lasagna, bruschetta (mushrooms and tomatoes), insalata con pere (pear and gorgonzola salad), creme brulee, grilled salmon, calamari appetizer with arabiatta sauce, shrimp scampi, as well as goat cheese with eggplant appetizer.\n\n"], "author": "Vicki G.", "review": "I have been going to spiazzo for 19 years now. It has never failed to impress me for almost two decades. I have celebrated various milestones in my life and family's life and will continue to do so for a very, very long time.\n\nTheir tiramisu is to die for. Other favorite dishes I have at Spiazzo are: risotto luccana, puttanesca (vegetarian pasta with mildly spicy sauce/comes with fettuccini but I get with spaghetti noodles), penne al salmone, lasagna, bruschetta (mushrooms and tomatoes), insalata con pere (pear and gorgonzola salad), creme brulee, grilled salmon, calamari appetizer with arabiatta sauce, shrimp scampi, as well as goat cheese with eggplant appetizer.\n\nCheck it out. I guarantee you that you will not be disappointed. I can personally testify as to Spiazzo's consistency in providing excellent service and delicious and mouth-watering food. \n\nIn terms of excellent service, I would like to give a special shoutout to Oscar and Edwin, who have been so welcoming, highly efficient, and always delightful through the years. Spiazzo would not be Spiazzo without these two individuals. They are outstanding and deserve to be commended. Guiseppe, one of the owners, is an excellent hands-on manager and is always making sure Spiazzo's customers are satisfied.\n\nIn terms of food, I have travelled extensively throughout Italy, and Spiazzo still remains at the top of my list of favorite Italian restaurants of all time. I do not say this lightly.\n\nSpiazzo, you are simply amazing!!", "rating": 5, "date": "2015-12-27"}, {"excerpts": ["The bruschetta and caprese salad are so amazing and fresh. "], "author": "michelle w.", "review": "Hands down, one hundred percent, best Italian restaurant I've been to..\nAMAZING service: the waitors and waitresses are always smiling, friendly, AND willing to help me pronounce things on the menu. :)\n\nAppropriate pricing for such a great experience with the family.\n\nThe bread and vinegar and that special sauce they serve you upon seating is SO GOOD!!! I'm pretty sure it's not just me that gorges on those... lol. Ok maybe just me\n\nMOVING ON... \n\nAppetizers: The bruschetta and caprese salad are so amazing and fresh. Get those! \n\nMain course: I always get the Dinner Special stuffed red pepper risotto. It's around $26, but it's all worth it. The salmon pasta is not that good, I'd skip that next time. The clam linguini is also not the best. \n\nOverall, very great service, ambience, and food. Coming again soon!", "rating": 5, "date": "2014-07-10"}, {"excerpts": ["The pesto was fresh and maintained a dark green color, the place wasn't packed but the bruschetta was standard, no fresh cheese tho, the wild mushroom bruschetta was an interesting cold mushroom, marinated. ", "All around I would say it was a good visit."], "author": "Nathan B.", "review": "Small place, manager was friendly greeting customers with a smile. The pesto was fresh and maintained a dark green color, the place wasn't packed but the bruschetta was standard, no fresh cheese tho, the wild mushroom bruschetta was an interesting cold mushroom, marinated. All around I would say it was a good visit.", "rating": 4, "date": "2016-03-01"}, {"excerpts": ["The party I was with also ordered bruschetta which was well executed and flavorful. ", "The only downside, and the only reason they did not earn a four star, is because we came with a large party and we had reservations and we showed up on time, yet the restaurant was unable to sit our entire party for over a half hour past our reservation time.\n", "I understand the situation there were a couple of tables lingering well past finishing and paying their check . ", "But I just felt something should've been done. ", "It really threw off our meal. \n", "But I have to say for a neighborhood restaurant, the food and overall dining experiences is positive, besides the seating problem, the service was excellent. ", "I would recommend this place, just not for large parties."], "author": "Gary B.", "review": "I've been here couple times now, and I have to say that the food is actually very good. Most recently I had the Penne Al Salmone which had a nice rich flavor and was honestly a huge serving.  The party I was with also ordered bruschetta which was well executed and flavorful. The only downside, and the only reason they did not earn a four star, is because we came with a large party and we had reservations and we showed up on time, yet the restaurant was unable to sit our entire party for over a half hour past our reservation time.\nI understand the situation there were a couple of tables lingering well past finishing and paying their check . But I just felt something should've been done. It really threw off our meal. \nBut I have to say for a neighborhood restaurant, the food and overall dining experiences is positive, besides the seating problem, the service was excellent. I would recommend this place, just not for large parties.", "rating": 3, "date": "2014-01-25"}, {"excerpts": ["Bruschetta & beef carpaccio were ok/decent.\n", "My fettucine with shrimp was bland and \"fishy\" - shrimp & noodles were overcooked.\n", "Green beans were completely soggy! ", "It had the texture of canned green beans - no crunch at all.\n", "Potatoes side dish was mushy and no texture. ", "It was breaking apart when you scoop it.\n", "My gf's penne with chicken dish was very bland! ", "She barely touched it.\n", "The pizza seemed like it's been sitting out. ", "The bottom crust was pretty soft/mushy.\n"], "author": "Freckles H.", "review": "Extremely disappointed on many dishes!\n\nBruschetta & beef carpaccio were ok/decent.\nMy fettucine with shrimp was bland and \"fishy\" - shrimp & noodles were overcooked.\nGreen beans were completely soggy! It had the texture of canned green beans - no crunch at all.\nPotatoes side dish was mushy and no texture. It was breaking apart when you scoop it.\nMy gf's penne with chicken dish was very bland! She barely touched it.\nThe pizza seemed like it's been sitting out. The bottom crust was pretty soft/mushy.\nHubby's chicken parm was lacking, according to him.\n\nService was fine and the waiter checked in on us from time to time. We had an early dinner so parking wasn't an issue.", "rating": 2, "date": "2013-06-24"}, {"excerpts": ["Trying to spend the money we had, we ordered the Bruschetta to start. ", "Unlike other places there were three different kinds; he told us about each. ", "One was the traditional tomato & garlic, one was mushrooms with a pesto base, and the last was an eggplant medley with garlic and spices. ", "All three were superb. ", "I ordered the gnocchi, which were heavenly. ", "Great flavor in the tomato based sauce and plenty of it (I hate dry pasta!) ", "At first the portion looked a little small for the $14 price tag, but then I remembered that this was italian food and a little goes a long way. "], "author": "Connor D.", "review": "I had seen a LivingSocial coupon for Spiazzo a couple of weeks ago and so decided I'd buy in advance and stop by upon my arrival in San Francisco. In town for a short four days, I've been running around like mad trying to eat as much new food as I possibly could. \n\nWith my coupon in hand we rushed back from Berkeley late in the evening to make our 9:15 reservation. I usually don't like to arrive at restaurants a short time before they close so I was a little uneasy when we were a few minutes late. The place was almost empty; only a few tables finishing up their meals.\n\nDespite the late hour we were greeted with smiles and brought to a table. Our waiter was a wonderful Italian guy with a beautiful accent and all the attributes you could look for in an Italian waiter. Super friendly and extra willing to talk to us about the menu, give recommendations, and describe each dish as it came out (I'm in to food so I love this!).\n\nWe showed him the coupon as we ordered and he scanned it without any issue (sometimes staff are really confused with a coupon on an iPhone). He was no less nice or present knowing that we had 40 free dollars to spend. He encouraged us to order as soon as we could since the place was closing. Not pushy at all and he still talked to us about dishes for a while. \n\nTrying to spend the money we had, we ordered the Bruschetta to start. Unlike other places there were three different kinds; he told us about each. One was the traditional tomato & garlic, one was mushrooms with a pesto base, and the last was an eggplant medley with garlic and spices. All three were superb. I ordered the gnocchi, which were heavenly. Great flavor in the tomato based sauce and plenty of it (I hate dry pasta!) At first the portion looked a little small for the $14 price tag, but then I remembered that this was italian food and a little goes a long way. I ended up taking at least a third home.\n\nMy friend got the salmon pasta which I did not try as I don't eat salmon. She said it was wonderful. Some of the best she had had. The salmon was well mixed into the sauce so there were no major chunks. We finished off with Spumoni ice cream cake which was delightful.\n\nBy the time we were done it was at least 30 min after they closed. Our original waiter apologized and said that he had to leave but the cook would take care of us.  After he left the service was still wonderful. We wrapped things up and gave them an extra big tip.\n\n4 stars for the food/atmosphere/price.\n\nOutstanding service bumps it up to 5. I highly recommend this place.", "rating": 5, "date": "2011-06-28"}, {"excerpts": ["The bruschetta is wonderful: two large pieces of tomato bruschetta and two large pieces of mushroom bruschetta. ", "Very fresh and tasty and filling. ", "Do not order unless more than two to share.", "Asked for Parmesan on the pasta and he put it all over my seafood. ", "Again - not attentive at all. ", "The only thing that made this 3 stars was the food. ", "I had excellent  scallop and shrimp scampi and it was a very generous portion; had to take half home. ", "My husband had the stuffed pepper and reported it delicious and another large portion. ", "So. ", "Eat here just don't expect attentive service."], "author": "Carol P.", "review": "Food was great... Server could not slow down to bother with us. We made a reservation and still had to wait a half hour for table. Server never once looked at us... He kept rushing away and I had to signal to call him back. The bruschetta is wonderful: two large pieces of tomato bruschetta and two large pieces of mushroom bruschetta. Very fresh and tasty and filling. Do not order unless more than two to share.Asked for Parmesan on the pasta and he put it all over my seafood. Again - not attentive at all. The only thing that made this 3 stars was the food. I had excellent  scallop and shrimp scampi and it was a very generous portion; had to take half home. My husband had the stuffed pepper and reported it delicious and another large portion. So. Eat here just don't expect attentive service.", "rating": 3, "date": "2016-04-16"}, {"excerpts": ["It has BRUSCHETTA with tomato and mushroom on top, BRODETTO Di VONGOLE, sauteed clams with garlic, white wine and a touch of red pepper flakes served with garlic crostin and I love the white beans. ", "It taste good.\n"], "author": "Isabelle L.", "review": "enjoy my dinner on a Monday night. We were lucky to find a parking spot in front of the restaurant. \nwe order the INSALATA Di SPINACI, Baby spinach and sliced red onions with a warm pancetta (italian bacon) and pine nut dressing . I like the light dressing and the red onions are delicious. \nFor appetizer ,we order ANTIPASTO MISTO, mixed hors d oeuvres. It has BRUSCHETTA with tomato and mushroom on top, BRODETTO Di VONGOLE, sauteed clams with garlic, white wine and a touch of red pepper flakes served with garlic crostin and I love the white beans. It taste good.\nFor pasta, i have the PENNE AL SALMONE. I really like the salmon cooked with the tomato sauce. it was really filling and the sauce tastes so good.\n\n I have the house wine of the night and it tastes good and yummy", "rating": 4, "date": "2012-11-13"}, {"excerpts": ["Appetizers: bruschetta, grilled  portabella mushroom, Caprese, and appetizer of layered goat cheese, zucchini and eggplant. ", "Entrees: mushroom risotto and shank of lamb were superb.  ", "Lamb was very tender. ", "Pasta was creamy and saucy. ", "Overall the food was great.  ", "Next time we will definitely share an entree. ", "Without drinks our bill was around $134.  ", "Not bad at all. ", "Place ", "it's not pretentious, any time we need a filling hearty dinner, it's there, and no need to travel far."], "author": "Dmitry G.", "review": "It is a true gem in the neighborhood, being frequented by older folks who have lived in the area for a while.  We saw lots of families: kids being in their late teens or early 20-s with their parents and older couples without kids. Portions are huge, food is excellent, service is fast and pleasant. On a Saturday night it was very crowded.  I am glad I made reservation for 6pm, and when we came, there wasn't a single table available, with a few people yet waiting  to be seated.  Appetizers: bruschetta, grilled  portabella mushroom, Caprese, and appetizer of layered goat cheese, zucchini and eggplant. Entrees: mushroom risotto and shank of lamb were superb.  Lamb was very tender. Pasta was creamy and saucy. Overall the food was great.  Next time we will definitely share an entree. Without drinks our bill was around $134.  Not bad at all. Place it's not pretentious, any time we need a filling hearty dinner, it's there, and no need to travel far.", "rating": 5, "date": "2016-01-31"}, {"excerpts": ["The appetizer (i forgot the name, it was $14) had a lot of variety and the bruschetta was delicious \n\nCons:\n-the service was too attentive? "], "author": "Glo Y.", "review": "Came here to try the living social deal. Totally worth it.\n\nPros:\n-very nice waiter, very attentive. The servers refilled our water glasses before they were even half empty! \n\n-nice environment, has a fine dining hint to it, but still casual\n\n-food was flavorful. I ordered the spaghetti portofino. Four pretty plump shrimps. The veal and half roasted chicken were also good portion sizes and came with good sides. The appetizer (i forgot the name, it was $14) had a lot of variety and the bruschetta was delicious \n\nCons:\n-the service was too attentive? But that's too picky of me.\n-Tiramisu was okay.\n\n\nGood italian food for what you're paying. I would come back.", "rating": 4, "date": "2011-07-17"}, {"excerpts": ["You MUST get the bruschetta. ", "Wine list can be a bit pricey but delicious. ", "Love the old feel of this place, the food and the service."], "author": "Lauren J.", "review": "I've been here a few times with different people and I always have a great experience with good food. Great for a date or just a good dinner with friends. \nYou MUST get the bruschetta. Wine list can be a bit pricey but delicious. Love the old feel of this place, the food and the service.", "rating": 5, "date": "2012-08-22"}, {"excerpts": ["The bruschetta was the BEST ", "I've EVER had. "], "author": "Barbara W.", "review": "I haven't enjoyed eating at an Italian restaurant in a long time and was really craving some pasta.\n\nThis restaurant was fantastic and did not disappoint! I loved the small, homey yet elegant atmosphere. \n\nI really liked the bread and accompanying sauce. I was expecting the usual olive oil/vinegar dressing, but instead the bread came with a zesty, creamy, sweet sauce. Really nice.\n\nThe bruschetta was the BEST I've EVER had. YOU MUST TRY THIS DISH! \n\nThe portion sizes were good and the price reasonable for what you get. I had the linguine with clams which was fantastic and the clams were really fresh. Paired it with a lovely Merlot on the suggestion of our waiter.\n\nJust thinking about this place makes me want to go back and try the other dishes!", "rating": 5, "date": "2012-09-17"}, {"excerpts": ["We all shared 2 orders of the Bruschetta.  ", "And I have to say that I had never had this before, ", "BUT I WILL EVERYTIME ", "I COME HERE FROM NOW ON!!  ", "The order comes with 2 traditional bruschetta pieces with tomatos and evoo and baslcamic, but it also comes with 2 mushrooms bruschetta pieces.  ", "THIS WAS WHAT ", "GOT ME!  ", "Absolutely to die for.  ", "I could have ate 2 or 3 more of those, no problem at all.  ", "As my main course I had my staple favorite.  ", "Fettucini con Gamberoni ... ", "Great at usual!!  "], "author": "Chelsea C.", "review": "Came here with my boyfriend and his family the other night.  The family wanted to go somewhere inexpensive and cozy, not some big chain, something \"San Francisco\" (since Mom and Dad were going to be driving up from Mountain View and wanted to go somewhere that would be easy for them to get it and drive through the whole city.  Brother and his girlfriend live up in laurel Heights but had never been here before) and somewhere where the majority of of party had not been to yet.  So our choice was easy, SPIAZZO'S!!!\n\ni called the night before and made reservations for 7 @ 7:30 on a Friday night.  Not a problem I was told, God I love it when things go my way.  i spent most of the day at work on Friday thinking about what i would get at Spiazzo's that night.  And all that we ordered was delicious and keeping within my high expectations for Spiazzo's.\n\nI had a Ceasar salad to start.  Fresh, crisp lettuce and a tangy flavorful dressing.  Very pleased.  We all shared 2 orders of the Bruschetta.  And I have to say that I had never had this before, BUT I WILL EVERYTIME I COME HERE FROM NOW ON!!  The order comes with 2 traditional bruschetta pieces with tomatos and evoo and baslcamic, but it also comes with 2 mushrooms bruschetta pieces.  THIS WAS WHAT GOT ME!  Absolutely to die for.  I could have ate 2 or 3 more of those, no problem at all.  As my main course I had my staple favorite.  Fettucini con Gamberoni ... Great at usual!!  Plump perfectly cooked prawns and spicy sauce.\n\nMy main man got the dinner special chicken imperratore.  This is usually one of his favorites, but this time it came out just a little too cooked.  But he still loved it and licked his plate clean.  Mom had the Chicken Piccatta, which is devoured and raved about.  Dad had some sort of pasta Portofino dish (shirmp and scallops in a light wine sauce) which he also loved.  Littlest brother had one of the pizzas (Ham and artichoke and olives) and I couldn't have gotten a piece if I tried! He loved it!\n\nFinished off with a Creme Bruelle, beautiful!", "rating": 5, "date": "2010-01-10"}, {"excerpts": ["Dinner consisted of two antipasto servings - The Chef's special seafood salad and an assortment of mozzarella, prosciutto, bruschetta, red and green bell peppers, and artichokes. ", "Big portions, enough for four people to share. "], "author": "Teresa Y.", "review": "I grew up in the West Portal neighborhood and have never been disappointed by the restaurants along this street. Of all the years I lived here, I have never visited Spiazzo until tonight. My parents were feeling something European tonight, so we decided to dine somewhere close to home. \n\nUpon arriving, we were warmly welcomed and immediately seated. Mind you, it's a Saturday evening during prime dinner hours. The restaurant was packed, but the servers were quickly to make adjustments so that we wouldn't have to wait outside in the cold. \n\nDinner consisted of two antipasto servings - The Chef's special seafood salad and an assortment of mozzarella, prosciutto, bruschetta, red and green bell peppers, and artichokes. Big portions, enough for four people to share. Nicely seasoned and very filling to start with.\n\nMerlot. Best way to go. My dad also really enjoyed his Pinot. \n\nMy entree tonight was the Chef's special risotto consisting of Italian sausage, mushrooms and pears. Yes, pears. I never would have thought of including sliced pears in risotto, but once I tasted the dish, it made sense. Delicious. I boxed half of my meal to bring home for lunch.\n\nDessert was tiramisu and a plate of biscotti. The tiramisu was an extremely HUGE portion, especially for the price you're paying. Typically I'd expect a serving of 2'' by 2''. This was more of 4.5'' by 4.5''. Enough for four people to share. Biscotti was good, but very difficult to chew if you didn't have a hot beverage to dip it in. Be sure to order a cappuccino if you decide to order this. \n\nOverall great service, great food, great prices. Will definitely be coming back again.", "rating": 4, "date": "2009-12-05"}, {"excerpts": ["The bruschetta appetizer comes with 3 different toppings. ", "I also had the gnochhi which was amazing. ", "Highly recommend!"], "author": "Shelly W.", "review": "Excellent food. The bruschetta appetizer comes with 3 different toppings. I also had the gnochhi which was amazing. Highly recommend!", "rating": 5, "date": "2011-12-18"}, {"excerpts": ["the gnocchi, bruschetta and caprese were awesome too..."], "author": "David W.", "review": "the wine and wine recommendations were fantastic, not sure you can get a better server than we had. A tall slender italian gentleman that was just candid, patient and knowledgeable and helped our evening of choices.\n\nthe gnocchi, bruschetta and caprese were awesome too...", "rating": 5, "date": "2010-01-28"}, {"excerpts": ["We ordered the bruschetta which was a little charred but very tasty, and the the mushroom appetizer, also lots of rich flavor. ", "I had the capellini pomodoro. ", "Considering this is just angel hair, tomato, olive oil and basil, I didn't expect much. ", "So imagine my surprise when the party started in my mouth! ", "mm mm mm!\n", "We'll be back!"], "author": "JaM W.", "review": "I really like this place. The staff is very attentive, especially the older waiter who looks more like an owner in an apron.\nThe bread does in fact come quickly and warm. We ordered the bruschetta which was a little charred but very tasty, and the the mushroom appetizer, also lots of rich flavor. I had the capellini pomodoro. Considering this is just angel hair, tomato, olive oil and basil, I didn't expect much. So imagine my surprise when the party started in my mouth! mm mm mm!\nWe'll be back!", "rating": 5, "date": "2007-05-21"}, {"excerpts": ["Best dishes include the bruschetta, margherita pizza, and the chicken with mushrooms.  ", "The food won't blow you away, but you will leave satisfied.  ", "While hearty, the dishes are never heavy "], "author": "Liz S.", "review": "Neighborhood staple for a dependable Italian meal, in a casual atmosphere.\n\nService is usually good, and fast - making it a prime contender for dinner before seeing a movie at the Empire theater.\n\nBest dishes include the bruschetta, margherita pizza, and the chicken with mushrooms.  The food won't blow you away, but you will leave satisfied.  While hearty, the dishes are never heavy so you won't feel bloated afterwards.\n\nLess crowded for lunch and specials are priced very well.", "rating": 3, "date": "2007-06-09"}, {"excerpts": ["The polenta and bruschetta are also very good as appetizers. ", "I find the portions here rather large and always have left overs. \n", "Great place."], "author": "Wes P.", "review": "This is a great Italian restaurant. I feel as though West Portal has many great restaurants. This is one of them. \nWhenever I make the trek out to this area I am always glad i did. This place in particular has a lot of great options. I usually get the pasta bolognese or the penne with salmon. The polenta and bruschetta are also very good as appetizers. I find the portions here rather large and always have left overs. \nGreat place.", "rating": 4, "date": "2009-01-21"}, {"excerpts": ["I had great food, a nice wine and the Bruschetta with a twist...the Mushroom Bruschetta was very nice, and to me very unique. \n", "The Tiramisu was a little heavy on the liqueur ", "but I didn't complain..."], "author": "James R.", "review": "I had great food, a nice wine and the Bruschetta with a twist...the Mushroom Bruschetta was very nice, and to me very unique. \nThe Tiramisu was a little heavy on the liqueur but I didn't complain...hehe \n\nI'll return again if I'm in the area.", "rating": 4, "date": "2008-12-08"}, {"excerpts": ["Best bruschetta we have ever had.  ", "I had a pasta and seafood dish, Ellitott had a veggie pizza.  ", "Dinner was good.  "], "author": "Teresa G.", "review": "We had dinner there tonight.  We were looking to try something new in SF after our visit to CA Academy of Sciences.  So we google mapped a random area and picked a place.  The neighborhood is cute with a little theatre and cute shops.\n\nBest bruschetta we have ever had.  I had a pasta and seafood dish, Ellitott had a veggie pizza.  Dinner was good.  We didn't have any wine which may have made it even better.\n\nGiven all the over eating lately we didn't indulge in dessert.\n\nService was great.  Place is cute.  I'd give it a 3.5 if I could.", "rating": 3, "date": "2009-01-02"}, {"excerpts": ["Favorites:\nBruschetta\n", "Tuna Carpaccio\nPear Salad\nChicken Picattino\nGnocchi\nForest Hill Cabernet Sauvignon"], "author": "N S.", "review": "This is my favorite Italian restaurant which says a lot since i spend a lot of time in North Beach. It is not at all pricey, the portions are big, the food is flavorful, customer service is wonderful, and its a cute family location.  I have had the majority of appetizers, have absolutely no complaints.  \n\nEvery pasta or pizza dish has been huge and full of so much flavor.  Great selection of wines. Desserts are so tasty.\n\nFavorites:\nBruschetta\nTuna Carpaccio\nPear Salad\nChicken Picattino\nGnocchi\nForest Hill Cabernet Sauvignon", "rating": 5, "date": "2008-07-11"}, {"excerpts": ["We ordered the antipasto which had roasted peppers, large white beans bruschetta with tomato and a bruschetta with mushroom and pesto.  ", "All of it was awesome!  ", "My pasta bolognese was not only a giant portion but it was good too.  ", "I would definitely come back as their prices and service are refreshing during these hard economic times.  ", "Ooh also major points for being insanely fast!"], "author": "Kirsten M.", "review": "I really liked this place!  Went with my mom and 91 year old grandma and everyone loved it.  The service was great and they were awesome with my grandma.  We ordered the antipasto which had roasted peppers, large white beans bruschetta with tomato and a bruschetta with mushroom and pesto.  All of it was awesome!  My pasta bolognese was not only a giant portion but it was good too.  I would definitely come back as their prices and service are refreshing during these hard economic times.  Ooh also major points for being insanely fast!", "rating": 4, "date": "2009-04-15"}, {"excerpts": ["The bruschetta rocks.  ", "The bread is pretty yummy.  ", "I like the stuffed pasta thingies, cannolini.  ", "I always get them confused with cannoli.  ", "Please don't hate me for getting cannollini and cannoli ", "mixed up.  ", "I love them both, heheh.  ", "The sausage pasta is yummy, and we love their spaghetti and meatballs.  ", "We usually go at lunch, but it does get quite crowded.  ", "Not cheap, but, you don't feel cheated."], "author": "brenda b.", "review": "The waiters are sooo sweet.  My creatures are pretty rambunctious, and they weren't mean about it.  The bruschetta rocks.  The bread is pretty yummy.  I like the stuffed pasta thingies, cannolini.  I always get them confused with cannoli.  Please don't hate me for getting cannollini and cannoli mixed up.  I love them both, heheh.  The sausage pasta is yummy, and we love their spaghetti and meatballs.  We usually go at lunch, but it does get quite crowded.  Not cheap, but, you don't feel cheated.", "rating": 5, "date": "2007-09-10"}, {"excerpts": ["The bruschetta is also really, really tasty and includes olives.  ", "I've never had room for dessert, but the selections look really authentic ", "and I'm sure they are amazing as well."], "author": "Danielle H.", "review": "Being Italian, I'm very critical of Italian food, but this place is delightful!  I first when there with a group of my girls for a nice dinner when we were in college and then years later I took my Italian mother there and she was amazed by the delicious and fresh the pesto sauce she had on her pasta.  I recently took my always hungry boyfriend there and he loved this place too.  I usually order a special there, but there are so many wonderful choices, it's really hard to choose!  The bruschetta is also really, really tasty and includes olives.  I've never had room for dessert, but the selections look really authentic and I'm sure they are amazing as well.", "rating": 5, "date": "2009-04-17"}, {"excerpts": ["Try the Bruschetta garlic bread, you won't be disappointed!"], "author": "Dan D.", "review": "Good Eats  The service is friendly and prompt.  The only complaint i have is that the parking is tough!  But hay, it's not as bad as most other SF neighborhoods.  Try the Bruschetta garlic bread, you won't be disappointed!", "rating": 4, "date": "2009-10-21"}, {"excerpts": ["the bruschetta is the best!!!!!!!!!! "], "author": "Raye T.", "review": "the bruschetta is the best!!!!!!!!!! i could go into detail, but this sums it up and probably answers your questions about the place:\n\ngreat food, consistently delicious.\n\nalways great service, wait for food isnt long either no matter how busy they are.\n\nmain courses run at $12-15 so id say a bit expensive for pasta.\n\nparking is always hard to find at west portal no matter what time it is.\n\nive been coming here for years and will be for years to come!", "rating": 5, "date": "2009-04-07"}], "misto di verdura alla griglia": [], "carpaccio di manzo": [{"excerpts": ["- Carpaccio di Manzo (Beef Carpaccio) (http://www.yelp.com/biz_photos/NWu1cDtYArkjWw2F8PzU9Q?select=67HuoK9sKfUvtMiuNbUmYw) - the beef was okay, but I liked the shaved parmesan and the argula.\n"], "author": "Mike L.", "review": "Back in the day, my friends and I used to pass by Spiazzo on our way to the MUNI station or to watch a movie at Empire.  I had always been curious about the place, but never enough to make it inside.  It wasn't until a couple of my friends put some serious limits on where to go for dinner one night that Spiazzo even came to mind.  Italian in this area of the city that's not Olive Garden?  Who knew Spiazzo was just one of a couple of places that could fit the bill?\n\nWalking in, I liked the feel of the restaurant - a little nicer than other casual, Italian joints but with a relaxed, neighborhood type of vibe.  We were able to snag the last free table, and I was moderately impressed with the assortment of dishes the menu had to offer.  I ordered the Minestrone and Spaghetti Portofino, and I was able to try the Beef Carpaccio my friend ordered for the table.\n\n- Minestrone (http://www.yelp.com/biz_photos/NWu1cDtYArkjWw2F8PzU9Q?select=obS63fHpNd1fFiUVVaeRZg) - the portion was larger than I expected, but that's about it.  Pretty average considering you can find the same at a lot of other places in SF.  \n- Carpaccio di Manzo (Beef Carpaccio) (http://www.yelp.com/biz_photos/NWu1cDtYArkjWw2F8PzU9Q?select=67HuoK9sKfUvtMiuNbUmYw) - the beef was okay, but I liked the shaved parmesan and the argula.\n- Spaghetti Portofino (Spaghetti with Prawns and Scallops in a White Wine and Garlic Sauce) (http://www.yelp.com/biz_photos/NWu1cDtYArkjWw2F8PzU9Q?select=iEQuYUx3tf2fzcnkYxK9gA) - not too shabby.  I didn't like the prawns, but the scallops were okay and I liked the sauce.\n\nEven though I don't usually care about the bread a restaurant serves, Spiazzo's seemed a little weird.  Typically, fresh bread has a soft and fluffy core, but this one was dense and \"chunky\" (no other way to describe it).  Also, the service left me a little mixed - \"cold but efficient\" as my friend described.  Our waiter wasn't that friendly and didn't say more than he needed to, but he didn't mess up and was pretty quick.  Hard to complain when he didn't make a mistake.\n\nEven though it didn't really bowl me over, I can see why people might like Spiazzo.  For me, it's kind of like how Il Borgo was for me - fine if you're in or live by the area, but not somewhere I would go out to specifically.", "rating": 3, "date": "2012-01-31"}], "polenta di casa": [{"excerpts": ["We had the POLENTA di CASA and the FETTUCCINE CON GAMBERONI, also a side of spinach and a bowl of minestrone.  ", "No room for dessert because we ate it all up. ", "Thanks, Spiazzo, for always being there."], "author": "Na m.", "review": "This longtime, West Portal restaurant has gone through it's ups and it's not-so ups, but right now it's flying high. Very good fresh pasta, amiable staff, and cozy, neighborhood feel. Go before the movie that's playing up the block at the Empire or after an author's chat at West Portal Bookstore. We had the POLENTA di CASA and the FETTUCCINE CON GAMBERONI, also a side of spinach and a bowl of minestrone.  No room for dessert because we ate it all up. Thanks, Spiazzo, for always being there.", "rating": 4, "date": "2016-01-25"}], "brodetto di vongole": [{"excerpts": ["Brodetto Di Vongole, sauteed clams with garlic, white wine and a touch of red pepper flakes served with garlic crostini $11.95   \nThe broth was not good.  ", "It completely filled the bowl and was tasteless--sorry to write this.\n", "2. ", "Eggplant Parmigiana ", "(Special that night) $11.95  \n", "This was ok.  ", "The eggplant was thinly sliced and covered in a nice tomato sauce.  ", "I was expecting it to be breaded and fried first ", "but, - it wasn't.  "], "author": "Thomas D.", "review": "This is a charming, clean and welcoming restaurant in West Portal.  Service was genuine and very, very good. We were immediately brought the most delicious breads (two kinds) and a tomato/red pepper sauce for dipping.\n I so wanted to love the food because I pictured myself coming back regularly as soon as we were seated. \n\nStarters:\n1. Brodetto Di Vongole, sauteed clams with garlic, white wine and a touch of red pepper flakes served with garlic crostini $11.95   \nThe broth was not good.  It completely filled the bowl and was tasteless--sorry to write this.\n2. Eggplant Parmigiana (Special that night) $11.95  \nThis was ok.  The eggplant was thinly sliced and covered in a nice tomato sauce.  I was expecting it to be breaded and fried first but, - it wasn't.  I prefer the fried version.\n\nMains:\n1. Pollo Imperatore, Free range/no antibiotic chicken breast stuffed with mozzarella, prosciutto and spinach in a marsala sauce with mushrooms $20.95  \nNot good at all.  The chicken was so dry that it fell apart with just a fork.  It was confusingly tasteless too.  How could this be with prosciutto, mozzarella, spinach, mushrooms etc??  \n2. Peperoni Ripieno (Stuffed Pepper-Special that night)$ 22.95\nThis large red pepper was densely stuffed with ground sausage and chicken and covered in a spicy sauce.  I asked for Angel Hair pasta instead of the risotto that it usually comes with.  It presented well but, again the flavors were off--you could only really taste the spiciness.  \n\nWe didn't finish any of the dishes.  I am hoping that we just ordered the wrong things.  Their menu is extensive and there are also quite a few wood-fired pizza options.\nI will definitely give this restaurant another try.", "rating": 2, "date": "2016-05-29"}, {"excerpts": ["It has BRUSCHETTA with tomato and mushroom on top, BRODETTO Di VONGOLE, sauteed clams with garlic, white wine and a touch of red pepper flakes served with garlic crostin and I love the white beans. ", "It taste good.\n"], "author": "Isabelle L.", "review": "enjoy my dinner on a Monday night. We were lucky to find a parking spot in front of the restaurant. \nwe order the INSALATA Di SPINACI, Baby spinach and sliced red onions with a warm pancetta (italian bacon) and pine nut dressing . I like the light dressing and the red onions are delicious. \nFor appetizer ,we order ANTIPASTO MISTO, mixed hors d oeuvres. It has BRUSCHETTA with tomato and mushroom on top, BRODETTO Di VONGOLE, sauteed clams with garlic, white wine and a touch of red pepper flakes served with garlic crostin and I love the white beans. It taste good.\nFor pasta, i have the PENNE AL SALMONE. I really like the salmon cooked with the tomato sauce. it was really filling and the sauce tastes so good.\n\n I have the house wine of the night and it tastes good and yummy", "rating": 4, "date": "2012-11-13"}], "melanzane alla parmigiana": [], "insalata mista con barbabietola": [], "insalata alla cesare": [{"excerpts": ["*Insalata Alla Cesare: caesar salad ($8), add Anchovies (+$3.50)\n", "*"], "author": "Elena N.", "review": "A group of us got together at Spiazzo to celebrate a friend's birthday. He made a reservation for dinner on Saturday, February 25th at 7pm for a party of 8. This restaurant is tiny and it was super busy, so we had to wait a bit for our table. We were seated around 7:20pm.\n\n*Burrata E Prosciutto: fresh mozzarella shell and stracciatella, with 12 months aged prosciutto and kalamata olives + EVOO ($16.95) x2\n*Fried Calamari: calamari, baby shrimps, zucchini deep fried with arrabiata sauce, spicy ($18.95) x2\n*Insalata Alla Cesare: caesar salad ($8), add Anchovies (+$3.50)\n*Pizza Tricolore: 1/3 Margherita with fresh tomato and basil, 1/3 Four cheeses, and 1/3 Pesto and Mozzarella ($16.95)\n*Sangiovese Pasqua ($34)\n*Barbera d'Asti ($36)\n\nWe all shared appetizers and wine. I enjoyed the burrata and prosciutto. The burrata was creamy while the prosciutto added a nice meaty saltiness. I adore anchovies so I ordered the caesar. It satisfied my veggie craving, but it was over dressed. I also could have used more anchovies! The pizza was a nice way to try a couple different pies, but it seemed like it was only a half and half versus a sampling of three pizzas. I thought the calamari was average. It was a pretty big portion though. The wines were moderately priced. I liked that we could get decent reds for under $40 a bottle.\n\n*Gnocchi Romoletto: italian potato dumplings with fresh tomato, basil, mushrooms and secret spices of the chef ($16.95)\n*Spaghetti Alla Vongole: spaghetti with fresh clams, garlic, white wine, a touch of chili peppers in a tomato sauce ($17.95) x2\n*Spaghetti Portofino: spaghetti, prawns, scallions, white wine + garlic sauce ($19.95)\n*Fettuccine Con Gamberoni: egg fettuccine, fresh tomato, garlic, a touch of chili pepper, white wine, basil, prawns and green onions ($17.95)\n*Ravioli Con Pesto E Pollo: large ravioli, pesto and chicken filled, in a light cream sauce, sundried tomatoes, mushrooms and spinach ($19.95)\n*Filetto Alla Dolce Vita: grilled grass fed filet mignon with mushrooms, prosciutto in a marsala wine sauce ($27.95)\n*Garretto Romanesco: braised lamb shank with mushrooms and green peas in a tomato wine sauce served with risotto ($26.95)\n\nI ordered the filet since I'm a big meat eater. It was cooked rare and I adored the mushrooms, but it was a little too sweet for me. And the prosciutto didn't seem to go with the wine sauce. I'm not a big pasta eater, but hands down, my favorite dish was the ravioli. So creamy and comforting. Mushrooms and spinach are two of my favorite vegetables, so I adored them in this dish!\n\n*Tiramisu ($7.50)\n*Creme Brulee ($7.50)\n*Chocolate Mousse Cake ($7.50)\n*Zanze's Cheese Cake ($7.50)\n*Graham's Tawny Port n/v ($7.95) x2\n*Graham's 20 Years ($12)\n*Harveys Bristol Cream n/v ($7.95)\n*Vin Santo di Toscana ($12.95)\n*Coffee ×3\n\nBirthday celebrations always ended with dessert and drinks. Now, I'm not a huge dessert person, so I only sampled most of the desserts. My favs were the tiramisu and cheesecake. Both were light, creamy, and not too sweet.\n\nFun place for a birthday celebration. Although the restaurant isn't really equipped for bigger parties, they made it work. Overall, I think the food was pretty average. I would really only come back for that ravioli. And of course, their wine prices.", "rating": 3, "date": "2017-03-04"}], "insalata etrusca": [{"excerpts": ["Even better is the more generously-sized Insalata Etrusca, with marinated white beans, shaved parmesan and fennel on a bed of mixed greens with a tart balsamic vinaigrette.\n\n"], "author": "Midge A.", "review": "My husband and I have been loyal Spiazzo customers for over 20 years. If you want gourmet Italian food in an unrushed, romantic atmosphere, go somewhere else. If you want unpretentious food in generous proportions at reasonable prices served promptly, Spiazzo will fill the bill. \n\nThis restaurant is very popular with moviegoers (Cinearts at Empire is just down the street), and is always packed and noisy on weekends. You'll have a better experience if you can come on a weekday, when the pace is more leisurely and you might have a chance at getting one of their comfortable upholstered booths. Service here has always been very good. The servers are friendly and efficient.\n \nI recommend the following dishes, which have been consistently good over the years: Minestrone (vegetarian), Spaghetti Bolognese (the best I've ever had), Salmon Fantasia, Spaghetti Calabrese (vegetarian), Pollo Piccatina, Chicken Marsala, the grilled Pork Loin and the Pizza Vegetale (If you are a vegan, they'll gladly omit the cheese).  All the pizzas are baked in a wood-fired oven. Occasionally on the specials menu they offer Pappardelle with Lamb Sauce. Don't miss this dish; it's heaven on a plate!\n\nUnless you like tart flavors, I would avoid the fish dishes that are prepared with lemon sauce and capers or artichokes. The kitchen tends to go a little too heavy on the lemon for my taste. I also don't care for the fish dishes that are prepared with spicy tomato sauce; the strong flavor of the sauce overwhelms the delicate taste of fish, and it's tough to find a good wine pairing. \n\nSome have complained about the Caesar Salad, but I happen to like it. It's a bit small and unpretentious, but has a pleasantly tangy dressing (and no anchovies). Even better is the more generously-sized Insalata Etrusca, with marinated white beans, shaved parmesan and fennel on a bed of mixed greens with a tart balsamic vinaigrette.\n\nFor dessert, I highly recommend the sinfully delicious house-made tiramisu or the chocolate pot de creme. I also like the chocolate brownie cake, the spumoni cake and chocolate-dipped biscotti. The cannoli is OK, but it's imported frozen from Italy so it doesn't taste as fresh as a locally-made product.\n\nIn 20 years, I've only had to send one dish back -- a fish dish that had an oily \"off\" taste. The waiter said it was fresh, and I believe him, but it just didn't taste right. No problem, no attitude, they were happy to prepare a different entree for me.\n\nFor those who say they've had a bad experience at Spiazzo, all I can say is that either you are awfully hard to please or you must have been there on a rare off night. Spiazzo may not be the trendiest restaurant on the block, but it has a loyal following, and for good reason.", "rating": 4, "date": "2007-11-07"}, {"excerpts": ["We had dinner last week and split the insalata Etrusca that was very good and was split for us in the kitchen rather that dealing with it at the table.  ", "My husband had the spaghetti with clams which was great ", "and I had a pizza Margherita which was not -- ", "anemic looking with not enough tomato and undercooked.  ", "My main gripe with this restaurant is the bread which is focaccia bread.  ", "I much prefer regular bread.  ", "However, I am sure many diners have no issue with that.  ", "Overall, I enjoy this restaurant and would have given 4 stars but for the pizza.  ", "Would definitely go back."], "author": "Vicki B.", "review": "My husband and I often drop by for dinner as we live near the neighborhood.  This is a friendly bright welcoming place and the service is attentive.  We had dinner last week and split the insalata Etrusca that was very good and was split for us in the kitchen rather that dealing with it at the table.  My husband had the spaghetti with clams which was great and I had a pizza Margherita which was not -- anemic looking with not enough tomato and undercooked.  My main gripe with this restaurant is the bread which is focaccia bread.  I much prefer regular bread.  However, I am sure many diners have no issue with that.  Overall, I enjoy this restaurant and would have given 4 stars but for the pizza.  Would definitely go back.", "rating": 3, "date": "2011-02-21"}, {"excerpts": ["I've now grown to love the white bean salad (the Insalata Etrusca) and skipping around the menu now to try everything.  ", "My husband loves lasagne (which they now have on the menu), but he's growing to learn to try the other things on Spiazzo's menu because they are wonderful as well.  ", "The pizza that I've had from the authentic pizza oven has been fresh and inspired.  ", "When you go, expect a different experience: you won't be rushed.  ", "Our experiences have always been amazing whether it's just the two of us or when we've gone with groups.  ", "My only disappointment over the years was when they dropped mussels from the menu.  ", "This is a place we go back to over and over again!"], "author": "Jeff S.", "review": "Spiazzo is all about Italy; there's a feel of \"old-world\" ambiance in this restaurant just steps from West Portal's MUNI station. It couldn't be better in North Beach. The menu: interesting and always available changing special; selection of wines: broad; waitstaff: friendly, knowledgeable and authentic; food: remarkably well prepared and presented. A co-worker, with family in Italy, said it was as close to home as he's experienced. My favorite used to be: steamed mussels and clams followed by Penne al Salmone.   I've now grown to love the white bean salad (the Insalata Etrusca) and skipping around the menu now to try everything.  My husband loves lasagne (which they now have on the menu), but he's growing to learn to try the other things on Spiazzo's menu because they are wonderful as well.  The pizza that I've had from the authentic pizza oven has been fresh and inspired.  When you go, expect a different experience: you won't be rushed.  Our experiences have always been amazing whether it's just the two of us or when we've gone with groups.  My only disappointment over the years was when they dropped mussels from the menu.  This is a place we go back to over and over again!", "rating": 5, "date": "2011-06-05"}, {"excerpts": ["I ordered the Insalata Etrusca which would have been good had it not been oversaturated with balsamic vinegar, unfortunately.  ", "As for the main course, I tried the Tortolloni in Salsa Rosa and though the tortolloni were cooked properly--al dente--the sauce tasted a little bit too much like Campbell's Tomato Soup mixed with cream which was disappointing and the pieces of Italian parsley sprinkled on top were not chopped in small enough pieces.  ", "As for the atmosphere, the tables are well-placed, the lighting is perfect and the decor is very nice.  ", "I may revisit this restaurant at some point in time and try another selection (including one of their desserts which looked wonderful) but with all the great restaurants in the San Francisco Bay Area, I usually don't find myself going back unless I had a fantastic initial experience.  ", "This just wasn't one of them."], "author": "Rabbit B.", "review": "I'm giving this restaurant three stars based strictly on the service alone.  We had a wonderful waitress and our service was fabulous.  As for the food, I have had better Italian food and I make better Italian food at home.  The bread was a touch dry and would have tasted much better if we had been given a little olive oil to dip it in.  I ordered the Insalata Etrusca which would have been good had it not been oversaturated with balsamic vinegar, unfortunately.  As for the main course, I tried the Tortolloni in Salsa Rosa and though the tortolloni were cooked properly--al dente--the sauce tasted a little bit too much like Campbell's Tomato Soup mixed with cream which was disappointing and the pieces of Italian parsley sprinkled on top were not chopped in small enough pieces.  As for the atmosphere, the tables are well-placed, the lighting is perfect and the decor is very nice.  I may revisit this restaurant at some point in time and try another selection (including one of their desserts which looked wonderful) but with all the great restaurants in the San Francisco Bay Area, I usually don't find myself going back unless I had a fantastic initial experience.  This just wasn't one of them.", "rating": 3, "date": "2008-12-05"}], "insalata con le pere": [], "pizza con salsicce o pepperoni": [{"excerpts": ["Pizza Con Salsicce O Pepperoni, Mozzarella, Italian sausage or pepperoni and tomato sauce 13.95 + 3.50 since we decided to do half pepperoni and half italian sausage.\n\n"], "author": "Kylie L.", "review": "4 girls, 2 pastas and 1 pizza http://www.yelp.com/biz_photos/spiazzo-ristorante-san-francisco?select=6SOVV7QT603pRWdLiWPMvA#6SOVV7QT603pRWdLiWPMvA. Lots of food or maybe I wasn't that hungry.\n\nPizza Con Salsicce O Pepperoni, Mozzarella, Italian sausage or pepperoni and tomato sauce 13.95 + 3.50 since we decided to do half pepperoni and half italian sausage.\n\n10.50 Fusili Fantasia (lunch): this was cork screw pasta with meat? not really sure but nonetheless delishh.\n\n13.95 Fettuccine Alla Genovese, Fettuccine with pesto sauce, wild mushrooms and cherry tomatoes: this was THE best thing we got. we didn't have any leftovers.\n\nThis place was not busy at all on a Sunday around noon. I'm glad we were seated right away. I'm not sure what dinner is like, maybe a bit more crowded. \n\nAll the food was delish, I will definitely come back.", "rating": 4, "date": "2014-05-09"}], "pizza tricolore": [{"excerpts": ["Pizza Tricolore: 1/3 Margherita with fresh tomato and basil, 1/3 Four cheeses, and 1/3 Pesto and Mozzarella ($16.95)\n", "*Sangiovese Pasqua ($34)\n"], "author": "Elena N.", "review": "A group of us got together at Spiazzo to celebrate a friend's birthday. He made a reservation for dinner on Saturday, February 25th at 7pm for a party of 8. This restaurant is tiny and it was super busy, so we had to wait a bit for our table. We were seated around 7:20pm.\n\n*Burrata E Prosciutto: fresh mozzarella shell and stracciatella, with 12 months aged prosciutto and kalamata olives + EVOO ($16.95) x2\n*Fried Calamari: calamari, baby shrimps, zucchini deep fried with arrabiata sauce, spicy ($18.95) x2\n*Insalata Alla Cesare: caesar salad ($8), add Anchovies (+$3.50)\n*Pizza Tricolore: 1/3 Margherita with fresh tomato and basil, 1/3 Four cheeses, and 1/3 Pesto and Mozzarella ($16.95)\n*Sangiovese Pasqua ($34)\n*Barbera d'Asti ($36)\n\nWe all shared appetizers and wine. I enjoyed the burrata and prosciutto. The burrata was creamy while the prosciutto added a nice meaty saltiness. I adore anchovies so I ordered the caesar. It satisfied my veggie craving, but it was over dressed. I also could have used more anchovies! The pizza was a nice way to try a couple different pies, but it seemed like it was only a half and half versus a sampling of three pizzas. I thought the calamari was average. It was a pretty big portion though. The wines were moderately priced. I liked that we could get decent reds for under $40 a bottle.\n\n*Gnocchi Romoletto: italian potato dumplings with fresh tomato, basil, mushrooms and secret spices of the chef ($16.95)\n*Spaghetti Alla Vongole: spaghetti with fresh clams, garlic, white wine, a touch of chili peppers in a tomato sauce ($17.95) x2\n*Spaghetti Portofino: spaghetti, prawns, scallions, white wine + garlic sauce ($19.95)\n*Fettuccine Con Gamberoni: egg fettuccine, fresh tomato, garlic, a touch of chili pepper, white wine, basil, prawns and green onions ($17.95)\n*Ravioli Con Pesto E Pollo: large ravioli, pesto and chicken filled, in a light cream sauce, sundried tomatoes, mushrooms and spinach ($19.95)\n*Filetto Alla Dolce Vita: grilled grass fed filet mignon with mushrooms, prosciutto in a marsala wine sauce ($27.95)\n*Garretto Romanesco: braised lamb shank with mushrooms and green peas in a tomato wine sauce served with risotto ($26.95)\n\nI ordered the filet since I'm a big meat eater. It was cooked rare and I adored the mushrooms, but it was a little too sweet for me. And the prosciutto didn't seem to go with the wine sauce. I'm not a big pasta eater, but hands down, my favorite dish was the ravioli. So creamy and comforting. Mushrooms and spinach are two of my favorite vegetables, so I adored them in this dish!\n\n*Tiramisu ($7.50)\n*Creme Brulee ($7.50)\n*Chocolate Mousse Cake ($7.50)\n*Zanze's Cheese Cake ($7.50)\n*Graham's Tawny Port n/v ($7.95) x2\n*Graham's 20 Years ($12)\n*Harveys Bristol Cream n/v ($7.95)\n*Vin Santo di Toscana ($12.95)\n*Coffee ×3\n\nBirthday celebrations always ended with dessert and drinks. Now, I'm not a huge dessert person, so I only sampled most of the desserts. My favs were the tiramisu and cheesecake. Both were light, creamy, and not too sweet.\n\nFun place for a birthday celebration. Although the restaurant isn't really equipped for bigger parties, they made it work. Overall, I think the food was pretty average. I would really only come back for that ravioli. And of course, their wine prices.", "rating": 3, "date": "2017-03-04"}, {"excerpts": ["We ordered the Penne Al Salmone, Fussilli Allas Genovese, Spaghetti Portofino, Pizza Tricolore, and Pizza Spiazzo. ", "Each dish was extremely hearty and tasty. ", "There was a good amount of salmon in the Penne Al Salmone ", "but it was strange to see the salmon flaked and mixed with the pasta, instead of being served as a whole salmon fillet or even chunks. ", "My friend said the pesto was good, but was rather heavy. ", "She ended up eating barely half the dish. ", "The Spaghetti Portofino came with a few plump, juicy shrimp and fresh, lightly seared scallops. ", "The sauce however seemed really thick and creamy and should have been lighter to allow the fresh seafood to shine. ", "The pizzas were good but not mind-blowing. ", "It had a thin crust and came piping-hot. "], "author": "Gary L.", "review": "We came here on a weekday for a friend's birthday. Being the geniuses that we are, no one thought about making reservations for a party of 5 at 7pm on a weekday. Thankfully, the restaurant was not full (usually a bad sign...) and we were seated immediately by a lovely waitress that was very accommodating. Not only did we not make reservations, we had the nerve to bring in a birthday cake and requested them to store it for us while we surprised our friend who worked across the street. I must give them high praises for their friendliness and high-quality customer service.\n\nAfter a terrible attempt at ambushing our friend, we brought him over to Spiazzo and were again warmly greeted. A charming, older Italian gentleman handed menus to us and made suggestions. From the vibe that I got, he is either the manager or the owner.\n\nWe ordered the Penne Al Salmone, Fussilli Allas Genovese, Spaghetti Portofino, Pizza Tricolore, and Pizza Spiazzo. Each dish was extremely hearty and tasty. There was a good amount of salmon in the Penne Al Salmone but it was strange to see the salmon flaked and mixed with the pasta, instead of being served as a whole salmon fillet or even chunks. My friend said the pesto was good, but was rather heavy. She ended up eating barely half the dish. The Spaghetti Portofino came with a few plump, juicy shrimp and fresh, lightly seared scallops. The sauce however seemed really thick and creamy and should have been lighter to allow the fresh seafood to shine. The pizzas were good but not mind-blowing. It had a thin crust and came piping-hot. There was the perfect amount of cheese and the various toppings added the perfect amount of texture and savoriness to the lovely sauce and melty mozzarella.\n\nAfter we finished the dishes (or rather, the ladies at the table packed their half-finished meals in take-home boxes), we asked the nice Italian gentleman to bring out the cake. As sweet as can be, he brought out the cake and some plates and silverware. Then, he led us in a rousing rendition of Happy Birthday. However he threw us a curveball and began to sing in Italian. It was extremely charming and endearing. I wish he was my uncle, but I will avoid my uncle issues in this post... To make things even better, when the bill came, we were surprisingly not charged a cake-cutting fee, as is standard at most other institutions. We felt obliged to tip generously and thank him profusely. \n\nBottom line, the food was good and the service was amazing. If the dishes were lighter and the pizza was more spectacular, it would be receiving five stars from me.\n\nThank you, old nameless Italian gentleman. We need more of you in this world.", "rating": 4, "date": "2010-01-03"}], "pizza caprese": [], "pizza capricciosa": [], "pizza vegetariana": [], "pizza con prosciutto e rucola": [], "pizza al salmone": [], "pizza napoletana ai frutti di mare": [], "calzone farcito": [], "stracciatella alla romana soup": [], "tortellini in brodo soup": [], "capellini al pomodoro fresco": [{"excerpts": ["CAPELLINI AL POMODORO FRESCO, Angel hair pasta with fresh tomato, garlic, olive oil and basil 10.95  but ", "have them add shrimp, the price comes out to about $15 after adding the shrimp, but these aren't just any ol baby shrimp, these are HUGE.  ", "i usually cut them into 3 pieces per shrimp! "], "author": "Lulu C.", "review": "Came here a few times with friends and it's a great neighborhood italian place, especially if you're craving pasta, but it is a bit pricey.  The portions are well balanced and the bread they give you is usually warm & buttery :) \n\nThey have a great selection of wines and even half bottles to choose from, so that's always a great option. \n\nI usually get: CAPELLINI AL POMODORO FRESCO, Angel hair pasta with fresh tomato, garlic, olive oil and basil 10.95  but have them add shrimp, the price comes out to about $15 after adding the shrimp, but these aren't just any ol baby shrimp, these are HUGE.  i usually cut them into 3 pieces per shrimp! so the price is worth it. \n\nThe lasagna i've seen is very generous in portion size and also looks super tasty, very cheesy and lots of meat. so that's a good option if you're a major meat person. \n\nService is usually pretty quick and attentive, except one time i went and we had to ask for everything at least 2 or 3 times before we got it. Weird. Im sure it was just an off night, although it wasn't very busy. Oh well. \n\nIf you're in the neighborhood, have time to sit and chat during dinner, feeling italian..head over to Spazzo :D", "rating": 3, "date": "2010-01-13"}], "spaghetti bolognese": [{"excerpts": ["Had the bruschetta (pictured) and spaghetti bolognese, very delicious and full of flavor. ", "Will be coming back with a larger group to feast and try different options and the extensive wine list. ", "Can't wait to come back!"], "author": "Edward A.", "review": "This was an amazing find out in West Portal. The service was amazing, I'm pretty sure the owner was the one taking our orders and serving us. We didn't wait too long for a table, even on a Saturday night as the amazing staff works with such efficiency and diligence. Had the bruschetta (pictured) and spaghetti bolognese, very delicious and full of flavor. Will be coming back with a larger group to feast and try different options and the extensive wine list. Can't wait to come back!", "rating": 5, "date": "2018-04-14"}, {"excerpts": ["But spaghetti Bolognese was just average."], "author": "Jenny B.", "review": "3.5 stars.\n\nBread was great. Got meatball and spinach sides, and both were good.\n\nBut spaghetti Bolognese was just average.", "rating": 3, "date": "2017-07-09"}, {"excerpts": ["I ordered the simple Spaghetti Bolognese which was just so perfectly cooked and delicious. ", "My brother had the Pizza Con Salsicce with added mushrooms. ", "It was so good, he finished the whole thing by himself! "], "author": "Phillip B.", "review": "The first time I went was with my girlfriend on a Wednesday afternoon. We were just looking for something to eat and this place looked nice so we decided to try it. The waiters were some of the nicest people there and the food was great! \n\nThe second time we went, we invited my family and we all loved it! I ordered the simple Spaghetti Bolognese which was just so perfectly cooked and delicious. My brother had the Pizza Con Salsicce with added mushrooms. It was so good, he finished the whole thing by himself! My girlfriend ordered the Fettuccine Alla Genovese which I practically ate half of it for her because it was just too good. She had to share with my mother's food (I can't remember what she ordered but she loved it!).\n\nPlus, we let the waiter know that it was my mother's birthday and he was really nice! He thanked us for coming there and then surprised her with a slice of cake at the end (I wish I could remember the name of the cake too because we all fought to eat it even when we were full). \n\nIf you're looking for restaurant with great service, a pleasant atmosphere and filling delicious italian food, this is the BEST place in S.F.! We're already planning another visit and hopefully I can get the rest of my family to go!", "rating": 5, "date": "2014-03-19"}, {"excerpts": ["I had the stracciatella alla romana and spaghetti bolognese. ", "The soup had really good flavor, but I did bite into a tiny bit of egg shell, which was disconcerting. ", "The spaghetti was al dente and had just the right amount of sauce. ", "Service was really good, too!"], "author": "Rachel H.", "review": "I checked out the menu outside, and there were so many great tasting things that I was convinced to eat here. The food did not disappoint! I had the stracciatella alla romana and spaghetti bolognese. The soup had really good flavor, but I did bite into a tiny bit of egg shell, which was disconcerting. The spaghetti was al dente and had just the right amount of sauce. Service was really good, too!", "rating": 4, "date": "2012-08-27"}, {"excerpts": ["I LOVE the spaghetti bolognese.  "], "author": "Marcus L.", "review": "We love this restaurant!  The food is great and we come here at least once a month.  I LOVE the spaghetti bolognese.  The staff is friendly and recognize us everytime we come.\n\nHighly recommended!", "rating": 5, "date": "2011-08-28"}, {"excerpts": ["as is the spaghetti bolognese. ", "service is above average. ", "it's close to home, with no wait. ", "i will come back here again."], "author": "Jamie L.", "review": "spinach salad with pancetta is amazing. as is the spaghetti bolognese. service is above average. it's close to home, with no wait. i will come back here again.", "rating": 4, "date": "2014-06-23"}, {"excerpts": ["I recommend the following dishes, which have been consistently good over the years: Minestrone (vegetarian), Spaghetti Bolognese (the best I've ever had), Salmon Fantasia, Spaghetti Calabrese (vegetarian), Pollo Piccatina, Chicken Marsala, the grilled Pork Loin and the Pizza Vegetale ", "(If you are a vegan, they'll gladly omit the cheese).  ", "All the pizzas are baked in a wood-fired oven. ", "Occasionally on the specials menu they offer Pappardelle with Lamb Sauce. "], "author": "Midge A.", "review": "My husband and I have been loyal Spiazzo customers for over 20 years. If you want gourmet Italian food in an unrushed, romantic atmosphere, go somewhere else. If you want unpretentious food in generous proportions at reasonable prices served promptly, Spiazzo will fill the bill. \n\nThis restaurant is very popular with moviegoers (Cinearts at Empire is just down the street), and is always packed and noisy on weekends. You'll have a better experience if you can come on a weekday, when the pace is more leisurely and you might have a chance at getting one of their comfortable upholstered booths. Service here has always been very good. The servers are friendly and efficient.\n \nI recommend the following dishes, which have been consistently good over the years: Minestrone (vegetarian), Spaghetti Bolognese (the best I've ever had), Salmon Fantasia, Spaghetti Calabrese (vegetarian), Pollo Piccatina, Chicken Marsala, the grilled Pork Loin and the Pizza Vegetale (If you are a vegan, they'll gladly omit the cheese).  All the pizzas are baked in a wood-fired oven. Occasionally on the specials menu they offer Pappardelle with Lamb Sauce. Don't miss this dish; it's heaven on a plate!\n\nUnless you like tart flavors, I would avoid the fish dishes that are prepared with lemon sauce and capers or artichokes. The kitchen tends to go a little too heavy on the lemon for my taste. I also don't care for the fish dishes that are prepared with spicy tomato sauce; the strong flavor of the sauce overwhelms the delicate taste of fish, and it's tough to find a good wine pairing. \n\nSome have complained about the Caesar Salad, but I happen to like it. It's a bit small and unpretentious, but has a pleasantly tangy dressing (and no anchovies). Even better is the more generously-sized Insalata Etrusca, with marinated white beans, shaved parmesan and fennel on a bed of mixed greens with a tart balsamic vinaigrette.\n\nFor dessert, I highly recommend the sinfully delicious house-made tiramisu or the chocolate pot de creme. I also like the chocolate brownie cake, the spumoni cake and chocolate-dipped biscotti. The cannoli is OK, but it's imported frozen from Italy so it doesn't taste as fresh as a locally-made product.\n\nIn 20 years, I've only had to send one dish back -- a fish dish that had an oily \"off\" taste. The waiter said it was fresh, and I believe him, but it just didn't taste right. No problem, no attitude, they were happy to prepare a different entree for me.\n\nFor those who say they've had a bad experience at Spiazzo, all I can say is that either you are awfully hard to please or you must have been there on a rare off night. Spiazzo may not be the trendiest restaurant on the block, but it has a loyal following, and for good reason.", "rating": 4, "date": "2007-11-07"}, {"excerpts": ["I had the Etrusca Salad, the Spaghetti Bolognese, and Tiramisu.  ", "The food was just as good as I remembered it from the last time.  ", "One step above Pasta Pomodoro.  "], "author": "Eating Sleeping T.", "review": "3.5 stars rounded up.\n\nI had dinner here on a recent Sunday evening for the first time in two years.  I had the Etrusca Salad, the Spaghetti Bolognese, and Tiramisu.  The food was just as good as I remembered it from the last time.  One step above Pasta Pomodoro.  The prices are higher than Pasta P, but the quality and portions are commensurate.\n\nOverall, no complaints.  I would definitely come back here for dinner again.", "rating": 4, "date": "2008-10-13"}, {"excerpts": ["If you have small children, steer them towards the spaghetti bolognese and they'll be happy campers. \n\n"], "author": "Alexis W.", "review": "Another one of my parent's neighborhood favorites. We've been coming here for years and the food consistency hasn't gone down, nor have the prices expanded ridiculously. \n\nAntipasto sampler: bruschette (one tomato, one marinated mushroom), prosciutto, fresh mozz, canellini beans, marinated artichoke hearts, basil-all good, fresh tasting. Decently priced. \n\nI usually order the penne al salmone: which is a pretty good sized serving of penne with a salmon tomato cream sauce. Not too rich or oversized. Last time there, I got the last order of osso bucco and savored that winey, tomatoey, meaty sucker to the end. The veal was tender and easily fork cut. I've never had a real clunker meal here; everything is fresh, cooked to order and toothy. That being said, I have to mention that the pizza could be better. It's never to the point where I don't want to eat it-but don't come to Spiazzo for the pizza. The crust doesn't quite get that blistered crispiness of a real 500-600 degree oven. If you have small children, steer them towards the spaghetti bolognese and they'll be happy campers. \n\nMy bias also comes from the waiter that used to be employed here who gave me a Hello Kitty notepad when I was 12 or 13, when I admired the one he was using to take orders on. They are also Italian owned and run. That my friends, is a NEIGHBORHOOD restaurant.", "rating": 4, "date": "2008-03-23"}], "fettuccine alla genovese": [{"excerpts": ["13.95 Fettuccine Alla Genovese, Fettuccine with pesto sauce, wild mushrooms and cherry tomatoes: this was THE best thing we got. "], "author": "Kylie L.", "review": "4 girls, 2 pastas and 1 pizza http://www.yelp.com/biz_photos/spiazzo-ristorante-san-francisco?select=6SOVV7QT603pRWdLiWPMvA#6SOVV7QT603pRWdLiWPMvA. Lots of food or maybe I wasn't that hungry.\n\nPizza Con Salsicce O Pepperoni, Mozzarella, Italian sausage or pepperoni and tomato sauce 13.95 + 3.50 since we decided to do half pepperoni and half italian sausage.\n\n10.50 Fusili Fantasia (lunch): this was cork screw pasta with meat? not really sure but nonetheless delishh.\n\n13.95 Fettuccine Alla Genovese, Fettuccine with pesto sauce, wild mushrooms and cherry tomatoes: this was THE best thing we got. we didn't have any leftovers.\n\nThis place was not busy at all on a Sunday around noon. I'm glad we were seated right away. I'm not sure what dinner is like, maybe a bit more crowded. \n\nAll the food was delish, I will definitely come back.", "rating": 4, "date": "2014-05-09"}, {"excerpts": ["My girlfriend ordered the Fettuccine Alla Genovese which I practically ate half of it for her because it was just too good. ", "She had to share with my mother's food "], "author": "Phillip B.", "review": "The first time I went was with my girlfriend on a Wednesday afternoon. We were just looking for something to eat and this place looked nice so we decided to try it. The waiters were some of the nicest people there and the food was great! \n\nThe second time we went, we invited my family and we all loved it! I ordered the simple Spaghetti Bolognese which was just so perfectly cooked and delicious. My brother had the Pizza Con Salsicce with added mushrooms. It was so good, he finished the whole thing by himself! My girlfriend ordered the Fettuccine Alla Genovese which I practically ate half of it for her because it was just too good. She had to share with my mother's food (I can't remember what she ordered but she loved it!).\n\nPlus, we let the waiter know that it was my mother's birthday and he was really nice! He thanked us for coming there and then surprised her with a slice of cake at the end (I wish I could remember the name of the cake too because we all fought to eat it even when we were full). \n\nIf you're looking for restaurant with great service, a pleasant atmosphere and filling delicious italian food, this is the BEST place in S.F.! We're already planning another visit and hopefully I can get the rest of my family to go!", "rating": 5, "date": "2014-03-19"}, {"excerpts": ["He had the FETTUCCINE ALLA GENOVESE, Fettuccine with pesto sauce, wild mushrooms and cherry tomatoes.  ", "It must have been awesome bc ", "the whole dish was gobbled up.  "], "author": "Kim S.", "review": "3.5 stars.  The location isn't central but luckily ez parking.  Great, attentive service.  The foccocia bread was delish - always a plus when the bread is heated.  \n\nHe had the FETTUCCINE ALLA GENOVESE, Fettuccine with pesto sauce, wild mushrooms and cherry tomatoes.  It must have been awesome bc the whole dish was gobbled up.  lol!\n\nI enjoyed the RAVIOLI NATURALE, Large ravioli stuffed with ricotta cheese and spinach in a fresh tomato sauce.  Traditional style bc there were more than 2-3 large raviolis on my plate.  Loved the chunks of tomato in the sauce!  Enough garlic for flavor but not overwhelming.", "rating": 3, "date": "2011-11-22"}], "penne alla campagnola": [{"excerpts": ["I got the fettucine alla genovese, and my friends got the fettucine con gamberoni and penne alla campagnola. ", "My dish, the genovese was good! ", "It had pesto and cherry tomatoes. ", "It should've came with some mushrooms, but I personally can't eat them ", "so I asked for them to be excluded. ", "I enjoyed my dish because who on earth doesn't enjoy pesto&pasta? ", "I feel like the mushrooms would have definitely elevated the dish, but I still enjoyed mine. ", "The penne alla campagnola was solid. ", "Our busser told us that was his favorite when we finished, but I thought it wasn't very special. ", "I will commend the chicken in the dish, though, because it was super juicy and tender which was surprising. ", "Last was my friend's fettucine con gamberoni, which I dipped into QUITE a few times. "], "author": "Holly P.", "review": "Awesome Italian! My two friends and I came here because I wanted to eat around the West Portal area and everywhere looked good but we were trying to stay around $15/person so this was our pick. We sat down and were immediately given our waters and bread very shortly after. Before I even talk about what we ordered, I'd like to give praise to their bread because it was DELICIOUS. It was obviously homemade because you don't get bread that soft and warm store bought. There was also this, I believe, sun dried tomato dip/sauce for the bread, and it complemented it so well. We all expected and wanted butter, but we killed our first serving of bread and sauce and they brought us another serving willingly (: \n\nSo we ordered and I got the fettucine alla genovese, and my friends got the fettucine con gamberoni and penne alla campagnola. My dish, the genovese was good! It had pesto and cherry tomatoes. It should've came with some mushrooms, but I personally can't eat them so I asked for them to be excluded. I enjoyed my dish because who on earth doesn't enjoy pesto&pasta? I feel like the mushrooms would have definitely elevated the dish, but I still enjoyed mine. The penne alla campagnola was solid. Our busser told us that was his favorite when we finished, but I thought it wasn't very special. I will commend the chicken in the dish, though, because it was super juicy and tender which was surprising. Last was my friend's fettucine con gamberoni, which I dipped into QUITE a few times. I think it's tied with my genovese, but it was in a different category since it was seafood-ey. \n\nLooking back on the dishes, they were all really good, but no more deserving than a really solid 4 stars. Spiazzo is authentic; they make their own bread & pasta, and actually grates you cheese from a block. They have more than kind and friendly service with above average food, but not deviating far from it. I would have definitely overhyped and gave it way better accolades if I didn't reflect on it just now because we went to eat here on beyond empty stomaches, which made everything taste better. I will still stand by the bread, however, because I kept eating that after our plates were taken away. Solid 4 stars!", "rating": 4, "date": "2015-03-20"}, {"excerpts": ["I ordered the spaghetti calabrese with pesto and teammate had the penne alla campagnola for dinner the first time we were there.\n\n"], "author": "Mabel Y.", "review": "Came here twice once for dinner and once for lunch.\n\nService and food is so-so. I ordered the spaghetti calabrese with pesto and teammate had the penne alla campagnola for dinner the first time we were there.\n\nFor lunch, I had the chicken ceaser salad and teammate had one of the pastas.\n\nEverything was alright, nothing really surprised me. Probably won't be back. Service was also slow.", "rating": 2, "date": "2012-04-16"}, {"excerpts": ["This is my go to item:\n\nPENNE ALLA CAMPAGNOLA, Penne with sundried tomatoes, broccoli and breast of chicken in a white wine sauce 12.95\n\n"], "author": "Sandy L.", "review": "This is a solid Italian restaurant in West Portal.  My family is a frequent visitor and we're never disappointed.  They have great service, quality food and a very home-like quality that makes me always crave the return.  \n\nThis is my go to item:\n\nPENNE ALLA CAMPAGNOLA, Penne with sundried tomatoes, broccoli and breast of chicken in a white wine sauce 12.95\n\nThe noodles are always a little aldente, the sun dried tomatoes are delicious and slightly tart (just typing it right now makes my mouth water), well cooked through broccoli and large pieces of white chicken.  But, what makes the paste is THE SAUCE right?  Well their sauce is creamy and rich with flavor.  I feel like they could have cooked that for hours to make sure that the sauce is nice and creamy (no wetness) and that every taste is through with the butter, salt, spices and white cream sauce.  \n\nThe staff is definitely hustling at their peak hour but they always come with a smile and a full heart to make sure that you enjoy your meal.  Sometimes they will stop just to converse and make small talk with the familiar faces.  I love the family-like feel to this restaurant.\n\nI always leave happy and it's a great restaurant STAPLE to the West Portal area.  I cannot imagine this street without Spiazzo.", "rating": 4, "date": "2012-01-13"}, {"excerpts": ["My pasta dish Penne Alla Campagnola, was actually really good- and was suggested by our waiter. ", "My friend's gnocchi was really bland and overwhelmingly dense. ", "She said it was edible, but who wants a large portion of chewy bland dumplings? ", "Anyway if we were in a pinch again, we would go back and both order what I got. ", "Again, super nice staff and the other patrons seemed happy. ", "Maybe it was an off night for the bread and gnocchi?"], "author": "Kassaundra G.", "review": "Really nice staff, and there were not many options at 9 pm on a Tuesday night in West Portal. Seriously, there was nothing open it seemed like besides the irish pub. They welcomed us in, assured us they were open till 10:30, although it felt like they were closed at 10. The bread was stale, sadly all three kinds offered to us. My pasta dish Penne Alla Campagnola, was actually really good- and was suggested by our waiter. My friend's gnocchi was really bland and overwhelmingly dense. She said it was edible, but who wants a large portion of chewy bland dumplings? Anyway if we were in a pinch again, we would go back and both order what I got. Again, super nice staff and the other patrons seemed happy. Maybe it was an off night for the bread and gnocchi?", "rating": 3, "date": "2013-10-09"}], "tortellini in salsa rosa": [], "spaghetti calabrese": [{"excerpts": ["I ordered the spaghetti calabrese with pesto and teammate had the penne alla campagnola for dinner the first time we were there.\n\n"], "author": "Mabel Y.", "review": "Came here twice once for dinner and once for lunch.\n\nService and food is so-so. I ordered the spaghetti calabrese with pesto and teammate had the penne alla campagnola for dinner the first time we were there.\n\nFor lunch, I had the chicken ceaser salad and teammate had one of the pastas.\n\nEverything was alright, nothing really surprised me. Probably won't be back. Service was also slow.", "rating": 2, "date": "2012-04-16"}, {"excerpts": ["The spaghetti calabrese was pretty bland. ", "I have to agree with previous reviewers that the polenta was saltier than I would have liked. ", "The only good about the meal would have had to be the bread and dipping sauce."], "author": "Denise L.", "review": "The spaghetti calabrese was pretty bland. I have to agree with previous reviewers that the polenta was saltier than I would have liked. The only good about the meal would have had to be the bread and dipping sauce.", "rating": 2, "date": "2014-06-21"}, {"excerpts": ["SPAGHETTI CALABRESE was good. ", "TORTELLONI IN SALSA ROSA was okay. ", "No room for desert."], "author": "Mihir M.", "review": "Great service - really outstanding.\n\nFood: overall okay. The spinach salad was good, not out of this world or anything. SPAGHETTI CALABRESE was good. TORTELLONI IN SALSA ROSA was okay. No room for desert.", "rating": 3, "date": "2011-04-01"}, {"excerpts": ["The Spaghetti Calabrese was fantastic - a whole combo of goodie bits.  ", "We decided that the next time we wanted to \"get out of the city\", we'd head back to Spiazzo."], "author": "Mac M.", "review": "Ended up in West Portal and thought we would grab a bite out there to try something new.  We popped into Spiazzo Caffe - the menu in the window had something that we each liked.  We were not disappointed.  Attentive, friendly and quick service.  Fresh, tasty options and variety.  The Spaghetti Calabrese was fantastic - a whole combo of goodie bits.  We decided that the next time we wanted to \"get out of the city\", we'd head back to Spiazzo.", "rating": 4, "date": "2006-07-10"}, {"excerpts": ["I recommend the following dishes, which have been consistently good over the years: Minestrone (vegetarian), Spaghetti Bolognese (the best I've ever had), Salmon Fantasia, Spaghetti Calabrese (vegetarian), Pollo Piccatina, Chicken Marsala, the grilled Pork Loin and the Pizza Vegetale ", "(If you are a vegan, they'll gladly omit the cheese).  ", "All the pizzas are baked in a wood-fired oven. ", "Occasionally on the specials menu they offer Pappardelle with Lamb Sauce. "], "author": "Midge A.", "review": "My husband and I have been loyal Spiazzo customers for over 20 years. If you want gourmet Italian food in an unrushed, romantic atmosphere, go somewhere else. If you want unpretentious food in generous proportions at reasonable prices served promptly, Spiazzo will fill the bill. \n\nThis restaurant is very popular with moviegoers (Cinearts at Empire is just down the street), and is always packed and noisy on weekends. You'll have a better experience if you can come on a weekday, when the pace is more leisurely and you might have a chance at getting one of their comfortable upholstered booths. Service here has always been very good. The servers are friendly and efficient.\n \nI recommend the following dishes, which have been consistently good over the years: Minestrone (vegetarian), Spaghetti Bolognese (the best I've ever had), Salmon Fantasia, Spaghetti Calabrese (vegetarian), Pollo Piccatina, Chicken Marsala, the grilled Pork Loin and the Pizza Vegetale (If you are a vegan, they'll gladly omit the cheese).  All the pizzas are baked in a wood-fired oven. Occasionally on the specials menu they offer Pappardelle with Lamb Sauce. Don't miss this dish; it's heaven on a plate!\n\nUnless you like tart flavors, I would avoid the fish dishes that are prepared with lemon sauce and capers or artichokes. The kitchen tends to go a little too heavy on the lemon for my taste. I also don't care for the fish dishes that are prepared with spicy tomato sauce; the strong flavor of the sauce overwhelms the delicate taste of fish, and it's tough to find a good wine pairing. \n\nSome have complained about the Caesar Salad, but I happen to like it. It's a bit small and unpretentious, but has a pleasantly tangy dressing (and no anchovies). Even better is the more generously-sized Insalata Etrusca, with marinated white beans, shaved parmesan and fennel on a bed of mixed greens with a tart balsamic vinaigrette.\n\nFor dessert, I highly recommend the sinfully delicious house-made tiramisu or the chocolate pot de creme. I also like the chocolate brownie cake, the spumoni cake and chocolate-dipped biscotti. The cannoli is OK, but it's imported frozen from Italy so it doesn't taste as fresh as a locally-made product.\n\nIn 20 years, I've only had to send one dish back -- a fish dish that had an oily \"off\" taste. The waiter said it was fresh, and I believe him, but it just didn't taste right. No problem, no attitude, they were happy to prepare a different entree for me.\n\nFor those who say they've had a bad experience at Spiazzo, all I can say is that either you are awfully hard to please or you must have been there on a rare off night. Spiazzo may not be the trendiest restaurant on the block, but it has a loyal following, and for good reason.", "rating": 4, "date": "2007-11-07"}, {"excerpts": ["I tried the spaghetti calabrese ", "and I thought it was ok.  ", "The risotto was a bit too oily and soggy.  ", "The salmon pizza was way too salty.  "], "author": "AhLin C.", "review": "I thought this place was just ok.  I tried the spaghetti calabrese and I thought it was ok.  The risotto was a bit too oily and soggy.  The salmon pizza was way too salty.  It's probably b/c of the capers.  \n\nService was not bad.  The server was attentive and we kept getting our waters refilled, which was nice.\n\nI tried the apple tartlet for dessert and they must've used super green apple b/c it was super sour.  The crust was ok.\n\nThis place gave me mixed feelings.  It's almost perfect, yet they do something to mess it up.  Like the pizza.  It had good cheese and crust, but everything was just too salty.  Same for dessert.  \n\nPricing is fair.", "rating": 3, "date": "2008-04-01"}], "gnocchi romoletto": [{"excerpts": ["*Gnocchi Romoletto: italian potato dumplings with fresh tomato, basil, mushrooms and secret spices of the chef ($16.95)\n"], "author": "Elena N.", "review": "A group of us got together at Spiazzo to celebrate a friend's birthday. He made a reservation for dinner on Saturday, February 25th at 7pm for a party of 8. This restaurant is tiny and it was super busy, so we had to wait a bit for our table. We were seated around 7:20pm.\n\n*Burrata E Prosciutto: fresh mozzarella shell and stracciatella, with 12 months aged prosciutto and kalamata olives + EVOO ($16.95) x2\n*Fried Calamari: calamari, baby shrimps, zucchini deep fried with arrabiata sauce, spicy ($18.95) x2\n*Insalata Alla Cesare: caesar salad ($8), add Anchovies (+$3.50)\n*Pizza Tricolore: 1/3 Margherita with fresh tomato and basil, 1/3 Four cheeses, and 1/3 Pesto and Mozzarella ($16.95)\n*Sangiovese Pasqua ($34)\n*Barbera d'Asti ($36)\n\nWe all shared appetizers and wine. I enjoyed the burrata and prosciutto. The burrata was creamy while the prosciutto added a nice meaty saltiness. I adore anchovies so I ordered the caesar. It satisfied my veggie craving, but it was over dressed. I also could have used more anchovies! The pizza was a nice way to try a couple different pies, but it seemed like it was only a half and half versus a sampling of three pizzas. I thought the calamari was average. It was a pretty big portion though. The wines were moderately priced. I liked that we could get decent reds for under $40 a bottle.\n\n*Gnocchi Romoletto: italian potato dumplings with fresh tomato, basil, mushrooms and secret spices of the chef ($16.95)\n*Spaghetti Alla Vongole: spaghetti with fresh clams, garlic, white wine, a touch of chili peppers in a tomato sauce ($17.95) x2\n*Spaghetti Portofino: spaghetti, prawns, scallions, white wine + garlic sauce ($19.95)\n*Fettuccine Con Gamberoni: egg fettuccine, fresh tomato, garlic, a touch of chili pepper, white wine, basil, prawns and green onions ($17.95)\n*Ravioli Con Pesto E Pollo: large ravioli, pesto and chicken filled, in a light cream sauce, sundried tomatoes, mushrooms and spinach ($19.95)\n*Filetto Alla Dolce Vita: grilled grass fed filet mignon with mushrooms, prosciutto in a marsala wine sauce ($27.95)\n*Garretto Romanesco: braised lamb shank with mushrooms and green peas in a tomato wine sauce served with risotto ($26.95)\n\nI ordered the filet since I'm a big meat eater. It was cooked rare and I adored the mushrooms, but it was a little too sweet for me. And the prosciutto didn't seem to go with the wine sauce. I'm not a big pasta eater, but hands down, my favorite dish was the ravioli. So creamy and comforting. Mushrooms and spinach are two of my favorite vegetables, so I adored them in this dish!\n\n*Tiramisu ($7.50)\n*Creme Brulee ($7.50)\n*Chocolate Mousse Cake ($7.50)\n*Zanze's Cheese Cake ($7.50)\n*Graham's Tawny Port n/v ($7.95) x2\n*Graham's 20 Years ($12)\n*Harveys Bristol Cream n/v ($7.95)\n*Vin Santo di Toscana ($12.95)\n*Coffee ×3\n\nBirthday celebrations always ended with dessert and drinks. Now, I'm not a huge dessert person, so I only sampled most of the desserts. My favs were the tiramisu and cheesecake. Both were light, creamy, and not too sweet.\n\nFun place for a birthday celebration. Although the restaurant isn't really equipped for bigger parties, they made it work. Overall, I think the food was pretty average. I would really only come back for that ravioli. And of course, their wine prices.", "rating": 3, "date": "2017-03-04"}, {"excerpts": ["We ordered: pumpkin ravioli, gnocchi romoletto, and the spaghetti portofino, in order of my fav to least fav. \n\n", "My rating was ultimately determined by the texture of the spaghetti portofino. "], "author": "Sheewon B.", "review": "We ordered: pumpkin ravioli, gnocchi romoletto, and the spaghetti portofino, in order of my fav to least fav. \n\nThe ravioli was homemade and the chewiness was perfect, and the gnocchi was smooth and pillow-y. \n\nMy rating was ultimately determined by the texture of the spaghetti portofino. Since they used boxed/dried pasta, it becomes so important to make sure to cook to al dente, but the spaghetti was a little too overdone, which brought the rating down to 3 stars for me. \n\nThe flavors were generally up to snuff for classic Italian cooking. The seafood had a slight fishiness to it, like it had been sitting around for a day or two too long. Other than that, it was an enjoyable dinner.", "rating": 3, "date": "2017-08-19"}], "spaghetti alla vongole": [{"excerpts": ["I had the Spaghetti Alla Vongole, and it was delicious. ", "Pasta was cooked al dente. ", "The sauce was rich, not too salty, and not overwhelmed with garlic.  ", "Overall, very well and balanced flavors.  "], "author": "Erica M.", "review": "I came on a Sunday for dinner with my friend. I had the Spaghetti Alla Vongole, and it was delicious. Pasta was cooked al dente. The sauce was rich, not too salty, and not overwhelmed with garlic.  Overall, very well and balanced flavors.  I even had some leftover for the next day.\n\nI look forward to bringing my boyfriend here for date night in the future :)", "rating": 4, "date": "2018-01-23"}, {"excerpts": ["*Spaghetti Alla Vongole: spaghetti with fresh clams, garlic, white wine, a touch of chili peppers in a tomato sauce ($17.95) x2\n"], "author": "Elena N.", "review": "A group of us got together at Spiazzo to celebrate a friend's birthday. He made a reservation for dinner on Saturday, February 25th at 7pm for a party of 8. This restaurant is tiny and it was super busy, so we had to wait a bit for our table. We were seated around 7:20pm.\n\n*Burrata E Prosciutto: fresh mozzarella shell and stracciatella, with 12 months aged prosciutto and kalamata olives + EVOO ($16.95) x2\n*Fried Calamari: calamari, baby shrimps, zucchini deep fried with arrabiata sauce, spicy ($18.95) x2\n*Insalata Alla Cesare: caesar salad ($8), add Anchovies (+$3.50)\n*Pizza Tricolore: 1/3 Margherita with fresh tomato and basil, 1/3 Four cheeses, and 1/3 Pesto and Mozzarella ($16.95)\n*Sangiovese Pasqua ($34)\n*Barbera d'Asti ($36)\n\nWe all shared appetizers and wine. I enjoyed the burrata and prosciutto. The burrata was creamy while the prosciutto added a nice meaty saltiness. I adore anchovies so I ordered the caesar. It satisfied my veggie craving, but it was over dressed. I also could have used more anchovies! The pizza was a nice way to try a couple different pies, but it seemed like it was only a half and half versus a sampling of three pizzas. I thought the calamari was average. It was a pretty big portion though. The wines were moderately priced. I liked that we could get decent reds for under $40 a bottle.\n\n*Gnocchi Romoletto: italian potato dumplings with fresh tomato, basil, mushrooms and secret spices of the chef ($16.95)\n*Spaghetti Alla Vongole: spaghetti with fresh clams, garlic, white wine, a touch of chili peppers in a tomato sauce ($17.95) x2\n*Spaghetti Portofino: spaghetti, prawns, scallions, white wine + garlic sauce ($19.95)\n*Fettuccine Con Gamberoni: egg fettuccine, fresh tomato, garlic, a touch of chili pepper, white wine, basil, prawns and green onions ($17.95)\n*Ravioli Con Pesto E Pollo: large ravioli, pesto and chicken filled, in a light cream sauce, sundried tomatoes, mushrooms and spinach ($19.95)\n*Filetto Alla Dolce Vita: grilled grass fed filet mignon with mushrooms, prosciutto in a marsala wine sauce ($27.95)\n*Garretto Romanesco: braised lamb shank with mushrooms and green peas in a tomato wine sauce served with risotto ($26.95)\n\nI ordered the filet since I'm a big meat eater. It was cooked rare and I adored the mushrooms, but it was a little too sweet for me. And the prosciutto didn't seem to go with the wine sauce. I'm not a big pasta eater, but hands down, my favorite dish was the ravioli. So creamy and comforting. Mushrooms and spinach are two of my favorite vegetables, so I adored them in this dish!\n\n*Tiramisu ($7.50)\n*Creme Brulee ($7.50)\n*Chocolate Mousse Cake ($7.50)\n*Zanze's Cheese Cake ($7.50)\n*Graham's Tawny Port n/v ($7.95) x2\n*Graham's 20 Years ($12)\n*Harveys Bristol Cream n/v ($7.95)\n*Vin Santo di Toscana ($12.95)\n*Coffee ×3\n\nBirthday celebrations always ended with dessert and drinks. Now, I'm not a huge dessert person, so I only sampled most of the desserts. My favs were the tiramisu and cheesecake. Both were light, creamy, and not too sweet.\n\nFun place for a birthday celebration. Although the restaurant isn't really equipped for bigger parties, they made it work. Overall, I think the food was pretty average. I would really only come back for that ravioli. And of course, their wine prices.", "rating": 3, "date": "2017-03-04"}, {"excerpts": ["My friends had the Penne Al Salmone, Spaghetti Alla Vongole, and Fettuccine Con Gamborini - all seafood pasta dishes. ", "They all had a generous amount of seafood in their pasta and enjoyed their dishes. "], "author": "Anna L.", "review": "Came here for the first time on a Monday night with a few friends and we will definitely be back!\n\nTheir menu has a great selection of dishes.\nI had the Ravioli Con Pesto E Pollo that was delicious! Ravioli was perfectly al dente and sauce was creamy, but not too heavy. My friends had the Penne Al Salmone, Spaghetti Alla Vongole, and Fettuccine Con Gamborini - all seafood pasta dishes. They all had a generous amount of seafood in their pasta and enjoyed their dishes. The bread they served before the meal was also really good, fresh and soft!\n\nGood thing I had made reservations on Yelp beforehand. They were busy even on a Monday night. Service was wonderful! Our server was attentive and funny. She helped my friends surprise me with tiramisu for my birthday. *See picture, she said the red dot was a kiss for me. :P", "rating": 5, "date": "2017-06-27"}, {"excerpts": ["I was in a seafood mood, so I ordered the $16.95 Spaghetti Alla Vongole, a heaping plate of thick spaghetti pasta with fresh clams, garlic, white wine, chili pepper flakes, all of it in a light tomato sauce (photo: http://bit.ly/2fJsXzW). ", "It was frankly just what I wanted even if it wasn't a culinary masterpiece. ", "Neither of us could finish our entrees, so we had enough for our respective lunches at work the following day. ", "These paisans will return soon. "], "author": "Ed U.", "review": "Ever since the Manor Coffee Shop fancied itself up into The Manor, Jamie W. and I have been hard pressed to find an alternative, just a place for good, old-school eats, but sure enough, there is a place just down the street that fits our requirements and with an Italian accent. We've passed by this ristorante in the past without giving it a thought, but the thought of a plate of pasta sounded just right for Sunday supper. Fortunately it wasn't very crowded at about 7:30PM, and we got a table right away surrounded by bottles of wine on their dining room divider (photo: http://bit.ly/2gA2x5s). The menu was chock full of items that sounded like comfort food for paisans like us. OK, we're not real paisans, but you know what I mean.\n\nWe were first handed quite a bread plate with huge slices of rustic goodness accompanied by a creamy tomato sauce (photo: http://bit.ly/2gc49z7). We tried to control ourselves for the carbs to come but to little avail. The Bruschetta seemed a tad pricey at $9.50, but we understood why the moment it arrived. The toasted and buttered garlic bread slices were as big as rice paddles and topped with Kalamata olives. Two were piled high with fresh tomatoes and basil in the traditional way, and the other two were spread with pesto and piled high with sliced mushrooms marinated in olive oil (photo: http://bit.ly/2gtSJcx). Really delicious, especially the unexpected mushroom bruschetta, and their abundance made us second-guess our soon-to-arrive entrees.\n\nJamie went for a pizza as is his natural want, and it was the $16.95 Pizza Capriciossa topped with prosciutto, artichoke, mushrooms, mozzarella, and just a smidgen of tomato sauce (photo: http://bit.ly/2fiBSYd). All the ingredients were tasty, and the crust was not too bready. However, a bigger ladle of tomato sauce would have been welcome to lubricate the gullet as it went down. I was in a seafood mood, so I ordered the $16.95 Spaghetti Alla Vongole, a heaping plate of thick spaghetti pasta with fresh clams, garlic, white wine, chili pepper flakes, all of it in a light tomato sauce (photo: http://bit.ly/2fJsXzW). It was frankly just what I wanted even if it wasn't a culinary masterpiece. Neither of us could finish our entrees, so we had enough for our respective lunches at work the following day. These paisans will return soon. Yeah, I'm talking about me and Jamie.\n\nFOOD - 4 stars...old-school Italian, well executed and certainly plenty of it...just more sauce on the pizza, please\nAMBIANCE - 3 stars...nothing remarkable and a tad squeezed when it crowds up like on Saturdays\nSERVICE - 3.5 stars...pretty reasonable though not overly friendly here\nTOTAL - 4 stars...now we gotta place to eat like paisans...mangia!", "rating": 4, "date": "2016-11-20"}, {"excerpts": ["For our mains, we split an order of Spaghetti Alla Vongole (spaghetti with fresh clams & garlic, wine sauce in a tomato base) ", "Absolutely the stand out of the evening.  \n", "I had ordered the Scampi Lido (jumbo prawns w/garlic, lemon in a white wine sauce). ", "I really liked my dish, however the prawns seemed just a bit tough. ", "My friend had the chicken breast w/mushrooms in a marinara sauce. ", "She loved it.  ", "We both ordered sides of sauteed vegetables.\n", "We were served by a friendly waiter in a charming and welcoming space.\n", "Great Italian food, comfortable prices. \n", "Easy parking.\n", "We were stuffed. ", "And very contented.\n", "If your in the area, stop by. ", "You wont be sorry."], "author": "Janet T.", "review": "Went with my neighbor/friend here tonight for an early dinner. It was her birthday a week ago.\nSPIAZZO is a nice little Italian restaurant on West Portal. It has a warm atmosphere and seems cozy. \nUpon sitting at our table, we were welcomed with friendly smiles and bread & butter. \nWe started with a Salad a spring mix with beets & tomatos in a balsamic vinaigrette.\nThen we had a cup of Minestrone soup, which was positively delicious.\nFor our mains, we split an order of Spaghetti Alla Vongole (spaghetti with fresh clams & garlic, wine sauce in a tomato base) Absolutely the stand out of the evening.  \nI had ordered the Scampi Lido (jumbo prawns w/garlic, lemon in a white wine sauce). I really liked my dish, however the prawns seemed just a bit tough. My friend had the chicken breast w/mushrooms in a marinara sauce. She loved it.  We both ordered sides of sauteed vegetables.\nWe were served by a friendly waiter in a charming and welcoming space.\nGreat Italian food, comfortable prices. \nEasy parking.\nWe were stuffed. And very contented.\nIf your in the area, stop by. You wont be sorry.", "rating": 4, "date": "2015-02-28"}, {"excerpts": ["SPAGHETTI ALLA VONGOLE - Perfect with the spice and a great portion size. \n\n"], "author": "Ashley s.", "review": "Spazzio's is great. I came here with a large party of 8 and the wait staff was very attentive and professional. \n\nThe food is delicious and reasonably priced. Some of the things we ordered were the: \n\nPIZZA CON SALSICCE - Personal pizza with about 6 good size slices (could share between 2 people) and each slice had a sausage on it. \n\nSPAGHETTI PORTOFINO - Great portion size and the sauce was so delicious! Also good portion of scallops. \n\nSPAGHETTI ALLA VONGOLE - Perfect with the spice and a great portion size. \n\nThe portion size is really good and the service is great. Would definitely recommend this place to Italiano food lovers :)", "rating": 5, "date": "2010-10-21"}, {"excerpts": ["If we order this again, we would ask for the sauce they use for the spaghetti alla vongole dish!\n\n"], "author": "Kurt P.", "review": "A friend and I made our first visit today.  We went for dinner, arriving at about 630PM, on a Tuesday night.  It was good to see the place doing decent business for a Tuesday.\n\nWe were immediately greeted by a genuinely welcoming host.  The restaurant felt warm and inviting, with good lighting and an open kitchen.\n\nOur waitress was a tall, young lady who said it was her first day on the job.  We wouldn't have guessed it because she was great - attentive and friendly.  A plate of warm focaccia and wheat bread soon arrived at our table, along with glasses of water.\n\nWe ordered the Italian sausage and pepperoni pizza as a starter to share.  The pizza gets a solid \"A\"!  The crust was perfectly thin and crispy/chewy, with a an outside ring/crust that seemed buttery.  The tomato sauce on the pizza could have had more flavor or zest; perhaps it was a simple tomato sauce rather than sauce that was spiked with herbs/spices such as oregano, basil.  There was just the right amount of cheese and topings on it so you get a perfect mouthful with every bite. We definitely would order pizza again here, quite a few other on the menu to try.  It was a good size pizza, a bit too much for two, but perfect for 3 people as an appetizer.\n\nFor an entree, we ordered spaghetti and clams in tomato sauce.  Usually you see linguine & clams on menus, done with a white wine and garlic sauce. The spaghetti and clams dish here had outstanding flavor - that really pops in your mouth; we were glad to have a chance to try something different. The deep rich flavor might be from the slices of lightly browned (roasted?) garlic.  We would rate this a solid \"A\" dish if the spaghetti were more al dente.\n\nThe other entree was the fettucini and shrimp in tomato sauce.  This dish was pretty good, with lots of chunky tomatoes in the sauce. However, having tasted the sauce in the clams spaghetti dish, the sauce in this dish seemed muted in comparison :(  The fettucini, however, was near perfectly al dente.  If we order this again, we would ask for the sauce they use for the spaghetti alla vongole dish!\n\nPrices are moderate here, and well worth it given the generous portion size.  We would visit again, it's now one of our favorite top 3 Italian spots in SF!\n\nParking is pretty easy to find, and free on West Portal if you park after 6PM.", "rating": 4, "date": "2011-09-06"}, {"excerpts": ["The Spaghetti alla Vongole ranks among the best renditions I've had. ", "The sauce is well-seasoned, brimming with flavor, and with the perfect consistency. ", "I adore the generous use of roasted garlic in the rosso sauce. ", "The clams are also sizable, in contrast to the puny ones I have had on many occasions at other establishments. ", "The service is exceptional. ", "Even during a busy service, the staff are attentive, friendly, and never try to rush you. ", "When you dine here, it's easy to forget that you're a restaurant where the food costs the same as (sometimes even less than) Olive Garden, which I assure you will not taste half as good."], "author": "Jenny C.", "review": "Spiazzo is my go-to Italian restaurant in San Francisco. I've been fortunate enough to have traveled to Italy before and every time I bite into Spiazzo's Penne al Salmone, I'm instantly whisked away to the picturesque restaurant along the coast where I first tried this dish. I've never had the made-in-Italy counterparts of other dishes on the menu and therefore can't speak to their authenticity. I can, however, tell you that they are delicious as well. The Spaghetti alla Vongole ranks among the best renditions I've had. The sauce is well-seasoned, brimming with flavor, and with the perfect consistency. I adore the generous use of roasted garlic in the rosso sauce. The clams are also sizable, in contrast to the puny ones I have had on many occasions at other establishments. The service is exceptional. Even during a busy service, the staff are attentive, friendly, and never try to rush you. When you dine here, it's easy to forget that you're a restaurant where the food costs the same as (sometimes even less than) Olive Garden, which I assure you will not taste half as good.", "rating": 5, "date": "2011-10-24"}], "penne al salmone": [{"excerpts": ["My friends had the Penne Al Salmone, Spaghetti Alla Vongole, and Fettuccine Con Gamborini - all seafood pasta dishes. ", "They all had a generous amount of seafood in their pasta and enjoyed their dishes. "], "author": "Anna L.", "review": "Came here for the first time on a Monday night with a few friends and we will definitely be back!\n\nTheir menu has a great selection of dishes.\nI had the Ravioli Con Pesto E Pollo that was delicious! Ravioli was perfectly al dente and sauce was creamy, but not too heavy. My friends had the Penne Al Salmone, Spaghetti Alla Vongole, and Fettuccine Con Gamborini - all seafood pasta dishes. They all had a generous amount of seafood in their pasta and enjoyed their dishes. The bread they served before the meal was also really good, fresh and soft!\n\nGood thing I had made reservations on Yelp beforehand. They were busy even on a Monday night. Service was wonderful! Our server was attentive and funny. She helped my friends surprise me with tiramisu for my birthday. *See picture, she said the red dot was a kiss for me. :P", "rating": 5, "date": "2017-06-27"}, {"excerpts": ["From past experience, their four best seafood pastas are: \n\n+Penne al Salmone - the salmon is just so flavorful this is a must get. \n"], "author": "Eric Joseph D.", "review": "SPIAZZZOOOOO. OH OH OH YOU ARE SO GOOD. Affordable dishes, casual atmosphere, great and fast service, Spiazzo is a perfect dinner spot. \n\nIf you like seafood, their seafood pastas are one of the best and do not skimp on the seafood. From past experience, their four best seafood pastas are: \n\n+Penne al Salmone - the salmon is just so flavorful this is a must get. \n+Spaghetti Al Vongole - not as flavorful as the other pastas but lots of clams.\n+Spaghetti Portofino - buttery texture with a tasty white wine sauce. The scallops are a great touch. \n+Fettucini Gamborini - MY FAVORITE DISH. Very underrated but the noodles packed so much tomato and garlic flavor! Highly suggest getting this. \n\nEnd your meal with their Tiramisu. Probably one of the moist and soaked tiramisus I have had. You must not leave without trying this! Overall, the servers were very nice and fast about service. Definitely a great spot for a casual dinner!", "rating": 5, "date": "2016-09-01"}, {"excerpts": ["but I get with spaghetti noodles), penne al salmone, lasagna, bruschetta (mushrooms and tomatoes), insalata con pere (pear and gorgonzola salad), creme brulee, grilled salmon, calamari appetizer with arabiatta sauce, shrimp scampi, as well as goat cheese with eggplant appetizer.\n\n"], "author": "Vicki G.", "review": "I have been going to spiazzo for 19 years now. It has never failed to impress me for almost two decades. I have celebrated various milestones in my life and family's life and will continue to do so for a very, very long time.\n\nTheir tiramisu is to die for. Other favorite dishes I have at Spiazzo are: risotto luccana, puttanesca (vegetarian pasta with mildly spicy sauce/comes with fettuccini but I get with spaghetti noodles), penne al salmone, lasagna, bruschetta (mushrooms and tomatoes), insalata con pere (pear and gorgonzola salad), creme brulee, grilled salmon, calamari appetizer with arabiatta sauce, shrimp scampi, as well as goat cheese with eggplant appetizer.\n\nCheck it out. I guarantee you that you will not be disappointed. I can personally testify as to Spiazzo's consistency in providing excellent service and delicious and mouth-watering food. \n\nIn terms of excellent service, I would like to give a special shoutout to Oscar and Edwin, who have been so welcoming, highly efficient, and always delightful through the years. Spiazzo would not be Spiazzo without these two individuals. They are outstanding and deserve to be commended. Guiseppe, one of the owners, is an excellent hands-on manager and is always making sure Spiazzo's customers are satisfied.\n\nIn terms of food, I have travelled extensively throughout Italy, and Spiazzo still remains at the top of my list of favorite Italian restaurants of all time. I do not say this lightly.\n\nSpiazzo, you are simply amazing!!", "rating": 5, "date": "2015-12-27"}, {"excerpts": ["I love the stuffed eggplant appetizer, and my absolute favorite item is the penne al salmone.  ", "I almost died it was so good.  ", "I'm always impressed with the service, but I've been served by Esme several times and she is my favorite.  ", "She's so accommodating and always remembers me, and helps me select the best dishes when I feel like straying from my usual penne al salmone.  ", "It's a great place to take a date.  ", "It's nice and feels upscale but doesn't break the bank.  ", "I love you Spiazzo."], "author": "Nicholas P.", "review": "All right, I've been meaning to write this review for awhile.  I absolutely love this restaurant.  The atmosphere is warm and cozy, the staff are incredibly friendly and the food is amazing!  I've never been disappointed.  I love the stuffed eggplant appetizer, and my absolute favorite item is the penne al salmone.  I almost died it was so good.  I'm always impressed with the service, but I've been served by Esme several times and she is my favorite.  She's so accommodating and always remembers me, and helps me select the best dishes when I feel like straying from my usual penne al salmone.  It's a great place to take a date.  It's nice and feels upscale but doesn't break the bank.  I love you Spiazzo.", "rating": 5, "date": "2016-09-24"}, {"excerpts": ["Most recently I had the Penne Al Salmone which had a nice rich flavor and was honestly a huge serving.  "], "author": "Gary B.", "review": "I've been here couple times now, and I have to say that the food is actually very good. Most recently I had the Penne Al Salmone which had a nice rich flavor and was honestly a huge serving.  The party I was with also ordered bruschetta which was well executed and flavorful. The only downside, and the only reason they did not earn a four star, is because we came with a large party and we had reservations and we showed up on time, yet the restaurant was unable to sit our entire party for over a half hour past our reservation time.\nI understand the situation there were a couple of tables lingering well past finishing and paying their check . But I just felt something should've been done. It really threw off our meal. \nBut I have to say for a neighborhood restaurant, the food and overall dining experiences is positive, besides the seating problem, the service was excellent. I would recommend this place, just not for large parties.", "rating": 3, "date": "2014-01-25"}, {"excerpts": ["Penne Al Salmone - "], "author": "Jonina A.", "review": "EXTRAORDINARY service, great food, food didn't take long to come out = 5 stars.\n\nService: They go up and beyond what you ask for. The workers are extremely friendly and polite. They make me feel very at home here. The owner is very hands on and visits almost every table to make sure everything is ok. \n\nFood:\nBrodetto Di Vongole- \nThe broth is TO.DIE.FOR. We finished the clams and the bread that came with it and we asked the waiter not to take it away so we could dip the rest of our bread in it. The waiter even offered to heat it up if it got cold later on during our meal. Perfect on a cold day. \nPenne Al Salmone - The saucy was very flavorful and creamy and the salmon was moist and fresh.\n\nLuckily we came past 6pm and didn't have to pay for the meters. \n\nI will be back Spiazzo!", "rating": 5, "date": "2013-05-27"}, {"excerpts": ["The penne al salmone was absolutely mouthwatering upon first sight, and the first bite was absolute heaven. \n", "The sauce on the penne al salmone had a perfect texture and delightful color. ", "The quantity of salmon was perfect to me, not overkill but not so little the name wouldn't make sense. ", "Definitely try this dish upon going to this excellent establishment.\n", "Speaking of the establishment the ambiance at dinner was magical, especially for a date but also for a nice outing with the family. ", "Good job Spiazzos from a fellow Italian ;)"], "author": "Jessica C.", "review": "The customer service is here is on point! Everyone is friendly, smiling, and checking on you consistently. I was being checked on by everyone my waiter, other waiters, and it was nice to see the manager at the front of the house, to me it showed commitment to the business. Anyways onto the food! The penne al salmone was absolutely mouthwatering upon first sight, and the first bite was absolute heaven. \nThe sauce on the penne al salmone had a perfect texture and delightful color. The quantity of salmon was perfect to me, not overkill but not so little the name wouldn't make sense. Definitely try this dish upon going to this excellent establishment.\nSpeaking of the establishment the ambiance at dinner was magical, especially for a date but also for a nice outing with the family. Good job Spiazzos from a fellow Italian ;)", "rating": 5, "date": "2014-10-10"}, {"excerpts": ["For pasta, i have the PENNE AL SALMONE. ", "I really like the salmon cooked with the tomato sauce. "], "author": "Isabelle L.", "review": "enjoy my dinner on a Monday night. We were lucky to find a parking spot in front of the restaurant. \nwe order the INSALATA Di SPINACI, Baby spinach and sliced red onions with a warm pancetta (italian bacon) and pine nut dressing . I like the light dressing and the red onions are delicious. \nFor appetizer ,we order ANTIPASTO MISTO, mixed hors d oeuvres. It has BRUSCHETTA with tomato and mushroom on top, BRODETTO Di VONGOLE, sauteed clams with garlic, white wine and a touch of red pepper flakes served with garlic crostin and I love the white beans. It taste good.\nFor pasta, i have the PENNE AL SALMONE. I really like the salmon cooked with the tomato sauce. it was really filling and the sauce tastes so good.\n\n I have the house wine of the night and it tastes good and yummy", "rating": 4, "date": "2012-11-13"}, {"excerpts": ["I ordered the penne al salmone and raspberry italian soda.  ", "The italian soda was not too sweet, but had enough syrup.  ", "But check this out! ", "I eat a lot, and my penne order was so big, that I could only eat half.  ", "I'm saving the rest for lunch tomorrow.  ", "I just had to get dessert, so I ordered the creme brulee.  "], "author": "Lisa X.", "review": "I didn't think I would be wowed by Spiazzo.  I just wanted to try something new for my birthday.  Considering the neighborhood, I thought i would be paying through the nose.  However, their menu is probably one of the least expensive I've seen for an Italian restaurant.  \n\nWe were seated promptly with water and bread.  The lighting was fantastic.  It was romantic, but not too dark.  Actually, it was dark and bright in the right places.  The tabletops were well lit, but all the surrounding areas were dim.  It looked like the plates were glowing!  The staff and owner were extremely nice.  I seriously have never felt so welcome at a fancy restaurant.  \n\nI ordered the penne al salmone and raspberry italian soda.  The italian soda was not too sweet, but had enough syrup.  But check this out! I eat a lot, and my penne order was so big, that I could only eat half.  I'm saving the rest for lunch tomorrow.  I just had to get dessert, so I ordered the creme brulee.  What I liked a lot about this dessert was that it was not too sweet so you can appreciated the custard flavor.  \n\nI definitely will come back.  Great service, awesome ambiance, and delicious food.  Don't hesitate.  Run", "rating": 5, "date": "2011-04-25"}, {"excerpts": ["Had the Penne al Salmone. ", "It was good for being simple; traditional; NOT exceptional. "], "author": "tim y.", "review": "Had the Penne al Salmone. It was good for being simple; traditional; NOT exceptional. It was good for the area, and definitely better than P. Pomodoro. \n\nMy companion said the spaghetti & meat sauce was pretty good. Personally,. I thought it looked watery, but she enjoyed it.\n\nFriday night was not a bad wait, and I had my seafood fix. Got in, got out. Nothing notable. It seems like a reliable and reasonably priced pasta place in that area.", "rating": 2, "date": "2007-11-04"}, {"excerpts": ["We ordered the Penne Al Salmone, Fussilli Allas Genovese, Spaghetti Portofino, Pizza Tricolore, and Pizza Spiazzo. ", "Each dish was extremely hearty and tasty. ", "There was a good amount of salmon in the Penne Al Salmone ", "but it was strange to see the salmon flaked and mixed with the pasta, instead of being served as a whole salmon fillet or even chunks. ", "My friend said the pesto was good, but was rather heavy. ", "She ended up eating barely half the dish. ", "The Spaghetti Portofino came with a few plump, juicy shrimp and fresh, lightly seared scallops. ", "The sauce however seemed really thick and creamy and should have been lighter to allow the fresh seafood to shine. ", "The pizzas were good but not mind-blowing. ", "It had a thin crust and came piping-hot. "], "author": "Gary L.", "review": "We came here on a weekday for a friend's birthday. Being the geniuses that we are, no one thought about making reservations for a party of 5 at 7pm on a weekday. Thankfully, the restaurant was not full (usually a bad sign...) and we were seated immediately by a lovely waitress that was very accommodating. Not only did we not make reservations, we had the nerve to bring in a birthday cake and requested them to store it for us while we surprised our friend who worked across the street. I must give them high praises for their friendliness and high-quality customer service.\n\nAfter a terrible attempt at ambushing our friend, we brought him over to Spiazzo and were again warmly greeted. A charming, older Italian gentleman handed menus to us and made suggestions. From the vibe that I got, he is either the manager or the owner.\n\nWe ordered the Penne Al Salmone, Fussilli Allas Genovese, Spaghetti Portofino, Pizza Tricolore, and Pizza Spiazzo. Each dish was extremely hearty and tasty. There was a good amount of salmon in the Penne Al Salmone but it was strange to see the salmon flaked and mixed with the pasta, instead of being served as a whole salmon fillet or even chunks. My friend said the pesto was good, but was rather heavy. She ended up eating barely half the dish. The Spaghetti Portofino came with a few plump, juicy shrimp and fresh, lightly seared scallops. The sauce however seemed really thick and creamy and should have been lighter to allow the fresh seafood to shine. The pizzas were good but not mind-blowing. It had a thin crust and came piping-hot. There was the perfect amount of cheese and the various toppings added the perfect amount of texture and savoriness to the lovely sauce and melty mozzarella.\n\nAfter we finished the dishes (or rather, the ladies at the table packed their half-finished meals in take-home boxes), we asked the nice Italian gentleman to bring out the cake. As sweet as can be, he brought out the cake and some plates and silverware. Then, he led us in a rousing rendition of Happy Birthday. However he threw us a curveball and began to sing in Italian. It was extremely charming and endearing. I wish he was my uncle, but I will avoid my uncle issues in this post... To make things even better, when the bill came, we were surprisingly not charged a cake-cutting fee, as is standard at most other institutions. We felt obliged to tip generously and thank him profusely. \n\nBottom line, the food was good and the service was amazing. If the dishes were lighter and the pizza was more spectacular, it would be receiving five stars from me.\n\nThank you, old nameless Italian gentleman. We need more of you in this world.", "rating": 4, "date": "2010-01-03"}, {"excerpts": ["I've been fortunate enough to have traveled to Italy before and every time I bite into Spiazzo's Penne al Salmone, I'm instantly whisked away to the picturesque restaurant along the coast where I first tried this dish. ", "I've never had the made-in-Italy counterparts of other dishes on the menu and therefore can't speak to their authenticity. ", "I can, however, tell you that they are delicious as well. "], "author": "Jenny C.", "review": "Spiazzo is my go-to Italian restaurant in San Francisco. I've been fortunate enough to have traveled to Italy before and every time I bite into Spiazzo's Penne al Salmone, I'm instantly whisked away to the picturesque restaurant along the coast where I first tried this dish. I've never had the made-in-Italy counterparts of other dishes on the menu and therefore can't speak to their authenticity. I can, however, tell you that they are delicious as well. The Spaghetti alla Vongole ranks among the best renditions I've had. The sauce is well-seasoned, brimming with flavor, and with the perfect consistency. I adore the generous use of roasted garlic in the rosso sauce. The clams are also sizable, in contrast to the puny ones I have had on many occasions at other establishments. The service is exceptional. Even during a busy service, the staff are attentive, friendly, and never try to rush you. When you dine here, it's easy to forget that you're a restaurant where the food costs the same as (sometimes even less than) Olive Garden, which I assure you will not taste half as good.", "rating": 5, "date": "2011-10-24"}, {"excerpts": ["I usually order the penne al salmone: which is a pretty good sized serving of penne with a salmon tomato cream sauce. ", "Not too rich or oversized. ", "Last time there, I got the last order of osso bucco and savored that winey, tomatoey, meaty sucker to the end. ", "The veal was tender and easily fork cut. ", "I've never had a real clunker meal here; everything is fresh, cooked to order and toothy. ", "That being said, I have to mention that the pizza could be better. ", "It's never to the point where I don't want to eat it-but don't come to Spiazzo for the pizza. ", "The crust doesn't quite get that blistered crispiness of a real 500-600 degree oven. "], "author": "Alexis W.", "review": "Another one of my parent's neighborhood favorites. We've been coming here for years and the food consistency hasn't gone down, nor have the prices expanded ridiculously. \n\nAntipasto sampler: bruschette (one tomato, one marinated mushroom), prosciutto, fresh mozz, canellini beans, marinated artichoke hearts, basil-all good, fresh tasting. Decently priced. \n\nI usually order the penne al salmone: which is a pretty good sized serving of penne with a salmon tomato cream sauce. Not too rich or oversized. Last time there, I got the last order of osso bucco and savored that winey, tomatoey, meaty sucker to the end. The veal was tender and easily fork cut. I've never had a real clunker meal here; everything is fresh, cooked to order and toothy. That being said, I have to mention that the pizza could be better. It's never to the point where I don't want to eat it-but don't come to Spiazzo for the pizza. The crust doesn't quite get that blistered crispiness of a real 500-600 degree oven. If you have small children, steer them towards the spaghetti bolognese and they'll be happy campers. \n\nMy bias also comes from the waiter that used to be employed here who gave me a Hello Kitty notepad when I was 12 or 13, when I admired the one he was using to take orders on. They are also Italian owned and run. That my friends, is a NEIGHBORHOOD restaurant.", "rating": 4, "date": "2008-03-23"}, {"excerpts": ["My favorite used to be: steamed mussels and clams followed by Penne al Salmone.   "], "author": "Jeff S.", "review": "Spiazzo is all about Italy; there's a feel of \"old-world\" ambiance in this restaurant just steps from West Portal's MUNI station. It couldn't be better in North Beach. The menu: interesting and always available changing special; selection of wines: broad; waitstaff: friendly, knowledgeable and authentic; food: remarkably well prepared and presented. A co-worker, with family in Italy, said it was as close to home as he's experienced. My favorite used to be: steamed mussels and clams followed by Penne al Salmone.   I've now grown to love the white bean salad (the Insalata Etrusca) and skipping around the menu now to try everything.  My husband loves lasagne (which they now have on the menu), but he's growing to learn to try the other things on Spiazzo's menu because they are wonderful as well.  The pizza that I've had from the authentic pizza oven has been fresh and inspired.  When you go, expect a different experience: you won't be rushed.  Our experiences have always been amazing whether it's just the two of us or when we've gone with groups.  My only disappointment over the years was when they dropped mussels from the menu.  This is a place we go back to over and over again!", "rating": 5, "date": "2011-06-05"}, {"excerpts": ["the penne al salmone is delicious too! ", "nice and small in setting too which is nice. ", "i just really like this place."], "author": "Meegs P.", "review": "love this place! come here all the time. inexpensive for italian, like 13 bucks a plate. i love the penne alla campognola (tastes hella good reheated in a microwave too for some reason). the penne al salmone is delicious too! nice and small in setting too which is nice. i just really like this place.", "rating": 4, "date": "2006-09-27"}], "spaghetti portofino": [{"excerpts": ["I ordered the Spaghetti Portofino and found it to be excellent. ", "Upon arriving home, I lifted the lid and found my dish still steaming and warm. ", "There were generous portions of medium prawns and bay scallops, which were cooked nicely and each hugged with that delicious white wine garlic cream sauce. "], "author": "Elaine Y.", "review": "After a rough week at work, there's nothing quite like the comfort of a good pasta dish. Despite not having the best experience at Spiazzo last time, I gave it another chance...opting for to go because I actually just wanted to put my feet up at home, be lazy, and start my weekend.\n\nI ordered the Spaghetti Portofino and found it to be excellent. Upon arriving home, I lifted the lid and found my dish still steaming and warm. There were generous portions of medium prawns and bay scallops, which were cooked nicely and each hugged with that delicious white wine garlic cream sauce. It was also a plus that the seafood had a bit of that briny flavor, but not so much so that it was overbearing (as in the case from my last experience here).\n\nI easily cleared the plate and still wished I had more.", "rating": 4, "date": "2017-03-25"}, {"excerpts": ["*Spaghetti Portofino: spaghetti, prawns, scallions, white wine + garlic sauce ($19.95)\n", "*", "Fettuccine Con Gamberoni: egg fettuccine, fresh tomato, garlic, a touch of chili pepper, white wine, basil, prawns and green onions ($17.95)\n", "*", "Ravioli Con Pesto E Pollo: large ravioli, pesto and chicken filled, in a light cream sauce, sundried tomatoes, mushrooms and spinach ($19.95)\n", "*Filetto Alla Dolce Vita: grilled grass fed filet mignon with mushrooms, prosciutto in a marsala wine sauce ($27.95)\n", "*"], "author": "Elena N.", "review": "A group of us got together at Spiazzo to celebrate a friend's birthday. He made a reservation for dinner on Saturday, February 25th at 7pm for a party of 8. This restaurant is tiny and it was super busy, so we had to wait a bit for our table. We were seated around 7:20pm.\n\n*Burrata E Prosciutto: fresh mozzarella shell and stracciatella, with 12 months aged prosciutto and kalamata olives + EVOO ($16.95) x2\n*Fried Calamari: calamari, baby shrimps, zucchini deep fried with arrabiata sauce, spicy ($18.95) x2\n*Insalata Alla Cesare: caesar salad ($8), add Anchovies (+$3.50)\n*Pizza Tricolore: 1/3 Margherita with fresh tomato and basil, 1/3 Four cheeses, and 1/3 Pesto and Mozzarella ($16.95)\n*Sangiovese Pasqua ($34)\n*Barbera d'Asti ($36)\n\nWe all shared appetizers and wine. I enjoyed the burrata and prosciutto. The burrata was creamy while the prosciutto added a nice meaty saltiness. I adore anchovies so I ordered the caesar. It satisfied my veggie craving, but it was over dressed. I also could have used more anchovies! The pizza was a nice way to try a couple different pies, but it seemed like it was only a half and half versus a sampling of three pizzas. I thought the calamari was average. It was a pretty big portion though. The wines were moderately priced. I liked that we could get decent reds for under $40 a bottle.\n\n*Gnocchi Romoletto: italian potato dumplings with fresh tomato, basil, mushrooms and secret spices of the chef ($16.95)\n*Spaghetti Alla Vongole: spaghetti with fresh clams, garlic, white wine, a touch of chili peppers in a tomato sauce ($17.95) x2\n*Spaghetti Portofino: spaghetti, prawns, scallions, white wine + garlic sauce ($19.95)\n*Fettuccine Con Gamberoni: egg fettuccine, fresh tomato, garlic, a touch of chili pepper, white wine, basil, prawns and green onions ($17.95)\n*Ravioli Con Pesto E Pollo: large ravioli, pesto and chicken filled, in a light cream sauce, sundried tomatoes, mushrooms and spinach ($19.95)\n*Filetto Alla Dolce Vita: grilled grass fed filet mignon with mushrooms, prosciutto in a marsala wine sauce ($27.95)\n*Garretto Romanesco: braised lamb shank with mushrooms and green peas in a tomato wine sauce served with risotto ($26.95)\n\nI ordered the filet since I'm a big meat eater. It was cooked rare and I adored the mushrooms, but it was a little too sweet for me. And the prosciutto didn't seem to go with the wine sauce. I'm not a big pasta eater, but hands down, my favorite dish was the ravioli. So creamy and comforting. Mushrooms and spinach are two of my favorite vegetables, so I adored them in this dish!\n\n*Tiramisu ($7.50)\n*Creme Brulee ($7.50)\n*Chocolate Mousse Cake ($7.50)\n*Zanze's Cheese Cake ($7.50)\n*Graham's Tawny Port n/v ($7.95) x2\n*Graham's 20 Years ($12)\n*Harveys Bristol Cream n/v ($7.95)\n*Vin Santo di Toscana ($12.95)\n*Coffee ×3\n\nBirthday celebrations always ended with dessert and drinks. Now, I'm not a huge dessert person, so I only sampled most of the desserts. My favs were the tiramisu and cheesecake. Both were light, creamy, and not too sweet.\n\nFun place for a birthday celebration. Although the restaurant isn't really equipped for bigger parties, they made it work. Overall, I think the food was pretty average. I would really only come back for that ravioli. And of course, their wine prices.", "rating": 3, "date": "2017-03-04"}, {"excerpts": ["We ordered: pumpkin ravioli, gnocchi romoletto, and the spaghetti portofino, in order of my fav to least fav. \n\n", "My rating was ultimately determined by the texture of the spaghetti portofino. "], "author": "Sheewon B.", "review": "We ordered: pumpkin ravioli, gnocchi romoletto, and the spaghetti portofino, in order of my fav to least fav. \n\nThe ravioli was homemade and the chewiness was perfect, and the gnocchi was smooth and pillow-y. \n\nMy rating was ultimately determined by the texture of the spaghetti portofino. Since they used boxed/dried pasta, it becomes so important to make sure to cook to al dente, but the spaghetti was a little too overdone, which brought the rating down to 3 stars for me. \n\nThe flavors were generally up to snuff for classic Italian cooking. The seafood had a slight fishiness to it, like it had been sitting around for a day or two too long. Other than that, it was an enjoyable dinner.", "rating": 3, "date": "2017-08-19"}, {"excerpts": ["I ordered the spaghetti portofino, which had spaghetti with scallops, prawns, and a white wine sauce. ", "The waitress (Michelle) was also very nice and the experience was splendid!"], "author": "Kelly I.", "review": "Me and my girls went out to dinner this Friday night and the food here was incredible. I ordered the spaghetti portofino, which had spaghetti with scallops, prawns, and a white wine sauce. The waitress (Michelle) was also very nice and the experience was splendid!", "rating": 5, "date": "2018-09-21"}, {"excerpts": ["+Spaghetti Portofino - buttery texture with a tasty white wine sauce. ", "The scallops are a great touch. \n", "+Fettucini Gamborini - MY FAVORITE DISH. ", "Very underrated but the noodles packed so much tomato and garlic flavor! "], "author": "Eric Joseph D.", "review": "SPIAZZZOOOOO. OH OH OH YOU ARE SO GOOD. Affordable dishes, casual atmosphere, great and fast service, Spiazzo is a perfect dinner spot. \n\nIf you like seafood, their seafood pastas are one of the best and do not skimp on the seafood. From past experience, their four best seafood pastas are: \n\n+Penne al Salmone - the salmon is just so flavorful this is a must get. \n+Spaghetti Al Vongole - not as flavorful as the other pastas but lots of clams.\n+Spaghetti Portofino - buttery texture with a tasty white wine sauce. The scallops are a great touch. \n+Fettucini Gamborini - MY FAVORITE DISH. Very underrated but the noodles packed so much tomato and garlic flavor! Highly suggest getting this. \n\nEnd your meal with their Tiramisu. Probably one of the moist and soaked tiramisus I have had. You must not leave without trying this! Overall, the servers were very nice and fast about service. Definitely a great spot for a casual dinner!", "rating": 5, "date": "2016-09-01"}, {"excerpts": ["I ordered the spaghetti portofino, but substituted spaghetti with capellini ($17.95). ", "There was a dinner special with jumbo prawns and scallop, but the price jumps up to $24.95.  ", "Got my dish piping hot, and the Angel hair was cooked perfectly al dente. ", "Nice firm bite. ", "Generous amount of shrimps and scallops too. ", "The ambiance is nice, a little dark, but cozy. ", "A good date place. ", "I'd definitely come back.  ", "Oh, make reservations!"], "author": "Barnaby W.", "review": "What a cool little restaurant in West Portal. You'd think the location alone would be enough to draw regular customers, but then they make great food with excellent service...you've got a packed restaurant with people standing around in the small lobby waiting for a table. Our server was really nice and attentive. I ordered the spaghetti portofino, but substituted spaghetti with capellini ($17.95). There was a dinner special with jumbo prawns and scallop, but the price jumps up to $24.95.  Got my dish piping hot, and the Angel hair was cooked perfectly al dente. Nice firm bite. Generous amount of shrimps and scallops too. The ambiance is nice, a little dark, but cozy. A good date place. I'd definitely come back.  Oh, make reservations!", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["I love their spaghetti portofino (spelling?). ", "The portion is great and they're not stingy with the shrimp/clams. ", "The service is always great. ", "Oh and their tiramisu is delicious. ", "This Italian restaurant always hits the spot when I'm craving Italian :) parking can be a hit or miss"], "author": "Vickiiieee V.", "review": "Neighborhood joint. I love this place. It's one of my go to Italian restaurant. I love their spaghetti portofino (spelling?). The portion is great and they're not stingy with the shrimp/clams. The service is always great. Oh and their tiramisu is delicious. This Italian restaurant always hits the spot when I'm craving Italian :) parking can be a hit or miss", "rating": 4, "date": "2017-06-11"}, {"excerpts": ["My sister had the Spaghetti Portofino which was perfectly-cooked al dente pasta with huge prawns in a light cream sauce. ", "Mmmmm. ", "I had to take a bite of hers before taking a bite of my own Spiazzo Salad. ", "The salad was also pretty good. ", "Thin slices of chicken breast, sautéed mushrooms, and halved hard boiled eggs over a Caesar salad. ", "The salad was huge and very fresh. ", "The dressing was amazing. ", "Creamy and lots of it. ", "The salad would have been better with anchovies. ", "Also, when the chicken was still warm, it was tasty. ", "I only ate two slices because once the chicken cooled off, the dryness factor set in and became inedible. ", "I left them on the plate. ", "I ate all my greens because their romaine was fresh and crisp which was a perfect bite with the dressing and crunchy croutons. ", "We will definitely be back and I plan to get the Spaghetti Portofino....and a plain Caesar salad ."], "author": "Carrie W.", "review": "Came here after years of looking from afar. My friends and family just never interested. Came for lunch with my sister. We were pleasantly surprised. A young woman was both greeter and server and was very welcoming and very professional. While we reviewed the extensive menu and lunch specials sheet, she brought bread, both white and wheat ...I think homemade, but dry. My sister loved the puréed red pepper spread and told me it would make the bread less dry. I loved the spread, but the bread was still dry. My sister had the Spaghetti Portofino which was perfectly-cooked al dente pasta with huge prawns in a light cream sauce. Mmmmm. I had to take a bite of hers before taking a bite of my own Spiazzo Salad. The salad was also pretty good. Thin slices of chicken breast, sautéed mushrooms, and halved hard boiled eggs over a Caesar salad. The salad was huge and very fresh. The dressing was amazing. Creamy and lots of it. The salad would have been better with anchovies. Also, when the chicken was still warm, it was tasty. I only ate two slices because once the chicken cooled off, the dryness factor set in and became inedible. I left them on the plate. I ate all my greens because their romaine was fresh and crisp which was a perfect bite with the dressing and crunchy croutons. We will definitely be back and I plan to get the Spaghetti Portofino....and a plain Caesar salad .", "rating": 4, "date": "2017-11-06"}, {"excerpts": ["Portions are huge which is a plus and the spaghetti portofino was delicious. ", "Only downside is the duck, since it's cooked in one piece, is rather dry but that did not put a damper on the night!"], "author": "Jessica W.", "review": "Great for date night! The atmosphere is pleasant and the food is just right for the price. Portions are huge which is a plus and the spaghetti portofino was delicious. Only downside is the duck, since it's cooked in one piece, is rather dry but that did not put a damper on the night!", "rating": 4, "date": "2017-04-09"}, {"excerpts": ["She recommended  the Spaghetti Portofino, which was very fantastic and satisfied my appetite. ", "We also were recommended wine, we bought a couple of bottles, and let's just say we left there very happily. ", "So, case and point, if we are every back in the West Portal neighborhood Spiazzo will have to be a must."], "author": "Thomas B.", "review": "Superb dining. I recently stopped by West Portal after going hiking with a couple of friends and boy was I hungry! I was craving some Italian food, one of my friends recommended this place, so I decided to stop by. I felt very welcomed, the hostess greeted us with a warm smile and we were shown to a table promptly. Our server was a young blonde waitress, I believe her name is Ally if I am correct and she was very well informed about the menu. She recommended  the Spaghetti Portofino, which was very fantastic and satisfied my appetite. We also were recommended wine, we bought a couple of bottles, and let's just say we left there very happily. So, case and point, if we are every back in the West Portal neighborhood Spiazzo will have to be a must.", "rating": 5, "date": "2017-04-13"}, {"excerpts": ["I ordered the Minestrone and Spaghetti Portofino, and I was able to try the Beef Carpaccio my friend ordered for the table.\n\n", "- Spaghetti Portofino (Spaghetti with Prawns and Scallops in a White Wine and Garlic Sauce) (http://www.yelp.com/biz_photos/NWu1cDtYArkjWw2F8PzU9Q?select=iEQuYUx3tf2fzcnkYxK9gA) - not too shabby.  ", "I didn't like the prawns, but the scallops were okay "], "author": "Mike L.", "review": "Back in the day, my friends and I used to pass by Spiazzo on our way to the MUNI station or to watch a movie at Empire.  I had always been curious about the place, but never enough to make it inside.  It wasn't until a couple of my friends put some serious limits on where to go for dinner one night that Spiazzo even came to mind.  Italian in this area of the city that's not Olive Garden?  Who knew Spiazzo was just one of a couple of places that could fit the bill?\n\nWalking in, I liked the feel of the restaurant - a little nicer than other casual, Italian joints but with a relaxed, neighborhood type of vibe.  We were able to snag the last free table, and I was moderately impressed with the assortment of dishes the menu had to offer.  I ordered the Minestrone and Spaghetti Portofino, and I was able to try the Beef Carpaccio my friend ordered for the table.\n\n- Minestrone (http://www.yelp.com/biz_photos/NWu1cDtYArkjWw2F8PzU9Q?select=obS63fHpNd1fFiUVVaeRZg) - the portion was larger than I expected, but that's about it.  Pretty average considering you can find the same at a lot of other places in SF.  \n- Carpaccio di Manzo (Beef Carpaccio) (http://www.yelp.com/biz_photos/NWu1cDtYArkjWw2F8PzU9Q?select=67HuoK9sKfUvtMiuNbUmYw) - the beef was okay, but I liked the shaved parmesan and the argula.\n- Spaghetti Portofino (Spaghetti with Prawns and Scallops in a White Wine and Garlic Sauce) (http://www.yelp.com/biz_photos/NWu1cDtYArkjWw2F8PzU9Q?select=iEQuYUx3tf2fzcnkYxK9gA) - not too shabby.  I didn't like the prawns, but the scallops were okay and I liked the sauce.\n\nEven though I don't usually care about the bread a restaurant serves, Spiazzo's seemed a little weird.  Typically, fresh bread has a soft and fluffy core, but this one was dense and \"chunky\" (no other way to describe it).  Also, the service left me a little mixed - \"cold but efficient\" as my friend described.  Our waiter wasn't that friendly and didn't say more than he needed to, but he didn't mess up and was pretty quick.  Hard to complain when he didn't make a mistake.\n\nEven though it didn't really bowl me over, I can see why people might like Spiazzo.  For me, it's kind of like how Il Borgo was for me - fine if you're in or live by the area, but not somewhere I would go out to specifically.", "rating": 3, "date": "2012-01-31"}, {"excerpts": ["I recently tried the Spaghetti Portofino and it was awesome! ", "The sauce was delicious, the scallops were cooked perfectly, and the prawns and scallops were in generous proportions. "], "author": "Matthew R.", "review": "I first found this place when I lived in SF about 10 years ago. I don't remember what originally brought me there, but I was surprised at how good it was the first time I went. The food and the prices have always been great. A few years back I visited SF with my parents and my sister and I suggested we go there for dinner. Everybody loved it. My parents recently visited SF. I met up with them and my dad wanted to go back. \n\nThe food is great, the servers are friendly, and the prices are still very reasonable. Every time I've eaten there, even on weeknights, it's been busy. I've never had trouble with having to wait for a table, but I can see how that could happen (especially if you have a large party) because it's not a very big restaurant.\n\nI recently tried the Spaghetti Portofino and it was awesome! The sauce was delicious, the scallops were cooked perfectly, and the prawns and scallops were in generous proportions. Usually when you order a pasta dish with prawns you have to hunt for them and pace yourself to avoid eating all three of them at once, but not at this place.\n\nIt's not a fancy restaurant, it's just a small place with excellent food, prices, and service.", "rating": 5, "date": "2015-05-03"}, {"excerpts": ["I had the spaghetti portofino which is prawns and scallops in a garlic wine sauce. "], "author": "Craig I.", "review": "The rating is more for the service. I had the spaghetti portofino which is prawns and scallops in a garlic wine sauce. It had great flavor, cooked just right and was just the right amount of food. \n\nOur server and the hostess were really friendly, attentive and helpful. Overall we had a great experience here and will be back.\n\nParking isnt very plentiful in the area.", "rating": 4, "date": "2013-04-09"}, {"excerpts": ["Spaghetti Portofino - Relatively simple white wine based pasta done right.  ", "Perfectly cooked scallops. "], "author": "Alan W.", "review": "I hadn't gone out for Italian in a while so I was hoping for Spiazzo to satisfy a craving.  But sometimes you want something so bad, you're almost bound for an inevitable letdown.\n\nNot so at Spiazzo for me.  Hit it out of the park.\n\nPizza con Prosciutto e Rocula - Long strips of prosciutto, copious amounts of arugula, with a fresh hint of basil on a thin crust pizza.  This pizza was amazeballs good.  The crust was deliciously dense, but still crunchy, almost like firmer shortbread (versus other thin crusts that sometimes feel like eating a cracker).  Topped off with a splash of EVOO.  Hella good.\nSpaghetti Portofino - Relatively simple white wine based pasta done right.  Perfectly cooked scallops. Shrimp was alright, but not messing up scallops goes a long way in my book.\n\nThe starter foccaccia bread was maybe a little tougher than usual, but the accompanying roasted pepper sauce made up for that.  Service was very friendly and drink refills were done with regularity.\n\nCool spot, not too crowded, excellent food.  If the owners had a South Bay expansion, I'd be there all the time.  But unless that happens, West Portal has got itself a nice little gem that I definitely want to go back to.", "rating": 5, "date": "2012-05-04"}, {"excerpts": ["I ordered the spaghetti portofino. ", "Four pretty plump shrimps. ", "The veal and half roasted chicken were also good portion sizes and came with good sides. "], "author": "Glo Y.", "review": "Came here to try the living social deal. Totally worth it.\n\nPros:\n-very nice waiter, very attentive. The servers refilled our water glasses before they were even half empty! \n\n-nice environment, has a fine dining hint to it, but still casual\n\n-food was flavorful. I ordered the spaghetti portofino. Four pretty plump shrimps. The veal and half roasted chicken were also good portion sizes and came with good sides. The appetizer (i forgot the name, it was $14) had a lot of variety and the bruschetta was delicious \n\nCons:\n-the service was too attentive? But that's too picky of me.\n-Tiramisu was okay.\n\n\nGood italian food for what you're paying. I would come back.", "rating": 4, "date": "2011-07-17"}, {"excerpts": ["We also got the Spaghetti Portofino ($15), which consisted of 4 shrimp and 9 scallops, cooked in a white wine and garlic sauce.  ", "This too was delicious, as the sauce worked very well with the pasta and the seafood.  "], "author": "Tyler C.", "review": "A very good Italian restaurant in the West Portal Area.  Came here last night due to a Living Social deal.  Service was prompt and friendly, and they provided us with complimentary bread, served with a tomato/basil spread.  We ordered the 3 Mushroom appetizer($10), which was really delicious.  It's sautéed portabello, white, and wild mushrooms served with garlic crostini in a garlicky wine sauce.  Mmm, so good. \n\nWe also got the Spaghetti Portofino ($15), which consisted of 4 shrimp and 9 scallops, cooked in a white wine and garlic sauce.  This too was delicious, as the sauce worked very well with the pasta and the seafood.  Furthermore, I thought they were very generous with the amount of seafood and pasta that they give you.  \n\nFinally, we got the New Zealand Lamb Chops, Chicken Paillard, and Italian Sausage dish ($21), which came with sautéed vegetables. This too, was a large portion, but I thought that the lamb was a tad dry and the chicken was very dry.  The flavor of all 3 meats were ok, as they were seasoned well, but none of them particularly stood out.  \n\nI would go back for the pasta and to try some other dishes.  It helped that we were able to get $20 off due to the Living Social coupon, but the prices here are already decent for good Italian food that's relatively close to the Sunset.", "rating": 4, "date": "2011-07-22"}, {"excerpts": ["SPAGHETTI PORTOFINO - Great portion size and the sauce was so delicious! "], "author": "Ashley s.", "review": "Spazzio's is great. I came here with a large party of 8 and the wait staff was very attentive and professional. \n\nThe food is delicious and reasonably priced. Some of the things we ordered were the: \n\nPIZZA CON SALSICCE - Personal pizza with about 6 good size slices (could share between 2 people) and each slice had a sausage on it. \n\nSPAGHETTI PORTOFINO - Great portion size and the sauce was so delicious! Also good portion of scallops. \n\nSPAGHETTI ALLA VONGOLE - Perfect with the spice and a great portion size. \n\nThe portion size is really good and the service is great. Would definitely recommend this place to Italiano food lovers :)", "rating": 5, "date": "2010-10-21"}, {"excerpts": ["For my main dish, I ordered the spaghetti portofino. ", "YUM!!!! ", "The spaghetti was cook perfectly. ", "They did not skimp on the shrimp and scallop. ", "The sauce wasn't heavy and didn't overpower the dish. ", "My bf ordered a scallop dish (I don't remember the name of the it) that came with veggies and angel hair pasta. ", "His scallops were wonderfully cooked! ", "It had a nice color and sear to it. ", "And the sauce......"], "author": "-Kelb H.", "review": "Had dinner here last night with my sweetheart for Valentine's Day. I was afraid of how the food would turn out based on the previous reviews, but I'm starting to realize more and more that the places I visit with great reviews usually always turn out bad, and the places with poor ratings always turn out great. Of course, this happened that way again.\n\nThe restaurant is small and cozy. The waitress was attentive. The food was much better than I had anticipated and came out very quickly. \n\nThey serve a warm foccacia bread at the beginning of your meal. It comes with some kind of red sauce that I thought was tomato puree, but didn't taste at all like tomato. It was VERY good though! I ate practically the entire plate by myself. \n\nNext we had the pear and walnut salad. I wasn't too fond of it. The dressing tasted too mayo-ey for me. The pears were good though. :-)\n\nWe then had a clam appetizer. I don't recall the name of it, but it was served in a clear broth with 2 bread sticks. Oh man that dish was delish!!! My mouth is watering right now just thinking about it. I hightly recommend anyone visiting Spiazzo to try it!\n\nFor my main dish, I ordered the spaghetti portofino. YUM!!!! The spaghetti was cook perfectly. They did not skimp on the shrimp and scallop. The sauce wasn't heavy and didn't overpower the dish. My bf ordered a scallop dish (I don't remember the name of the it) that came with veggies and angel hair pasta. His scallops were wonderfully cooked! It had a nice color and sear to it. And the sauce......YUMMY!! \n\nI highly recommend this place to anyone. I will definitely be going back there.", "rating": 5, "date": "2011-02-14"}, {"excerpts": ["We ordered the Penne Al Salmone, Fussilli Allas Genovese, Spaghetti Portofino, Pizza Tricolore, and Pizza Spiazzo. ", "Each dish was extremely hearty and tasty. ", "There was a good amount of salmon in the Penne Al Salmone ", "but it was strange to see the salmon flaked and mixed with the pasta, instead of being served as a whole salmon fillet or even chunks. ", "My friend said the pesto was good, but was rather heavy. ", "She ended up eating barely half the dish. ", "The Spaghetti Portofino came with a few plump, juicy shrimp and fresh, lightly seared scallops. ", "The sauce however seemed really thick and creamy and should have been lighter to allow the fresh seafood to shine. ", "The pizzas were good but not mind-blowing. ", "It had a thin crust and came piping-hot. "], "author": "Gary L.", "review": "We came here on a weekday for a friend's birthday. Being the geniuses that we are, no one thought about making reservations for a party of 5 at 7pm on a weekday. Thankfully, the restaurant was not full (usually a bad sign...) and we were seated immediately by a lovely waitress that was very accommodating. Not only did we not make reservations, we had the nerve to bring in a birthday cake and requested them to store it for us while we surprised our friend who worked across the street. I must give them high praises for their friendliness and high-quality customer service.\n\nAfter a terrible attempt at ambushing our friend, we brought him over to Spiazzo and were again warmly greeted. A charming, older Italian gentleman handed menus to us and made suggestions. From the vibe that I got, he is either the manager or the owner.\n\nWe ordered the Penne Al Salmone, Fussilli Allas Genovese, Spaghetti Portofino, Pizza Tricolore, and Pizza Spiazzo. Each dish was extremely hearty and tasty. There was a good amount of salmon in the Penne Al Salmone but it was strange to see the salmon flaked and mixed with the pasta, instead of being served as a whole salmon fillet or even chunks. My friend said the pesto was good, but was rather heavy. She ended up eating barely half the dish. The Spaghetti Portofino came with a few plump, juicy shrimp and fresh, lightly seared scallops. The sauce however seemed really thick and creamy and should have been lighter to allow the fresh seafood to shine. The pizzas were good but not mind-blowing. It had a thin crust and came piping-hot. There was the perfect amount of cheese and the various toppings added the perfect amount of texture and savoriness to the lovely sauce and melty mozzarella.\n\nAfter we finished the dishes (or rather, the ladies at the table packed their half-finished meals in take-home boxes), we asked the nice Italian gentleman to bring out the cake. As sweet as can be, he brought out the cake and some plates and silverware. Then, he led us in a rousing rendition of Happy Birthday. However he threw us a curveball and began to sing in Italian. It was extremely charming and endearing. I wish he was my uncle, but I will avoid my uncle issues in this post... To make things even better, when the bill came, we were surprisingly not charged a cake-cutting fee, as is standard at most other institutions. We felt obliged to tip generously and thank him profusely. \n\nBottom line, the food was good and the service was amazing. If the dishes were lighter and the pizza was more spectacular, it would be receiving five stars from me.\n\nThank you, old nameless Italian gentleman. We need more of you in this world.", "rating": 4, "date": "2010-01-03"}, {"excerpts": ["I recommend the Spaghetti Portofino.  "], "author": "SAS Z.", "review": "I haven't been to many Italian restaurants, but this one is one of the best I've been to.  They have pretty decent food.  And they are very friendly!\n\nI feel like this restaurant is one of those restaurants where they make you feel like a baller even though you really aren't one and they know you aren't one.  It has a feel of a really expensive, luxurious, wear-a-suit, place, but you can go there in shorts and a tank top and they wouldn't blink an eye.  It really is just a mid-scale restaurant made to look fancy.\n\nI recommend the Spaghetti Portofino.  It's one of those dishes on the menu that seems to be more expensive than it really is.  \n\nSo if you're a poser and you want to impress a date and take her to a fancy restaurant, but you're poor like me, take her here!", "rating": 4, "date": "2010-07-14"}], "fettuccine con gamberi": [], "lasagna bolognese": [{"excerpts": ["I then started eating my lasagna bolognese and it was extremely soft. ", "And by extremely soft, I mean I literally did not and did not need to chew.. ", "I drank it like soup... ", "Undesirable experience. ", "The only good part about this visit was the waiter whom had a pleasing and welcoming attitude."], "author": "michael l.", "review": "I sit down at the table and am served with water that has hair and other funky stuff floating in it. They then put the tableware on the table and the fork had some baked on food stuff on it. I then started eating my lasagna bolognese and it was extremely soft. And by extremely soft, I mean I literally did not and did not need to chew.. I drank it like soup... Undesirable experience. The only good part about this visit was the waiter whom had a pleasing and welcoming attitude.", "rating": 2, "date": "2016-01-18"}], "cannelloni spiazzo": [], "petto di pollo al funghetto": [{"excerpts": ["Then I had the Petto Di Pollo al Funghetto with a side of Risotto. ", "Both were fabulous!! ", "The staff was very knowledgeable & informative of every item on the menu. ", "The wine list had excellent choices.  ", "Our waiter gave us a few suggestions & he did a great job! ", "We finished with desserts that were delicious. ", "We will definitely go back."], "author": "Sue N.", "review": "We started with the Antipasto Misto. Then I had the Petto Di Pollo al Funghetto with a side of Risotto. Both were fabulous!! The staff was very knowledgeable & informative of every item on the menu. The wine list had excellent choices.  Our waiter gave us a few suggestions & he did a great job! We finished with desserts that were delicious. We will definitely go back.", "rating": 5, "date": "2016-04-10"}, {"excerpts": ["My favorite dish  is the Petto Di Pollo Al Funghetto. ", "I have also tried the clams and the gnocchi, and although very tasty,  they pale in comparison."], "author": "Harpreet H.", "review": "My work brought us here for a Christmas lunch in 2005. I fell in love and have been coming back ever since. If you're looking for an authentic Italian experience this is the place to go. It is also in a very desirable location. Compared to the rest of city (namely North Beach and downtown) parking is not as terrible in West Portal. My favorite dish  is the Petto Di Pollo Al Funghetto. I have also tried the clams and the gnocchi, and although very tasty,  they pale in comparison.", "rating": 4, "date": "2012-04-16"}, {"excerpts": ["Yum\n\nPetto Di Pollo Al Funghetto - chicken breast with mushrooms in a delicate cream sauce. \n\n"], "author": "Dennis L.", "review": "A nice Italian restaurant that brings something different to the neighborhood. Too often I hear people talking about Italian food to only hear about Olive Garden and Pasta Pomodoro. Blah. And too often do I hear about the pizza joints that serve pasta and and other stuff as well. Well, spiazzos is an Italian restaurant that serves pizza as well.\n\nFavs\n\nBrushetta - four slice of sourdough toast topped with two toppings. The original - tomatoes in a vinagrette. Mushrooms in a pesto dressing. Yum\n\nPetto Di Pollo Al Funghetto - chicken breast with mushrooms in a delicate cream sauce. \n\nFusilli Alla Genovese  - corkscrew pasta with pesto sauce, wild mushrooms and a touch of fresh tomato. Fusilli holds the sauce really well\n\nZuppa Di Pesce  - sauteed mussels, clams small shrimp calamari, scallops and generous pieces of seasonal fish in a light tomato broth served with spaghetti and garlic crostini. A little bit of every kind of seafood.\n\nNothing is quite overwhelmingly overpriced and there's definitely a warm family vibe.", "rating": 4, "date": "2009-01-09"}], "petto di pollo marsala": [{"excerpts": ["I had the petto di pollo marsala which the server informed me would include a side of potatoes and vegetables. ", "I was expecting sliced roasted potatoes and was surprised when the potatoes turned out to be mashed and heavily \"seasoned\" with huge pieces of garlic. ", "I've always associated mashed potatoes as being very American "], "author": "Elena F.", "review": "If you enjoy lots of garlic in your food then this is the place for you!\n\nI had the petto di pollo marsala which the server informed me would include a side of potatoes and vegetables. I was expecting sliced roasted potatoes and was surprised when the potatoes turned out to be mashed and heavily \"seasoned\" with huge pieces of garlic. I've always associated mashed potatoes as being very American so I found it odd that they were being served in an \"Italian\" restaurant. \n\nThe chicken wasn't anything special and I wasn't surprised when I found pieces of garlic in the marsala sauce too! I mean who wants to accidentally chow down on slivers of garlic?  \n\nThe vegetables were decently cooked and I enjoyed them, minus the garlic of course!\n\nWhat I did like about this restaurant was that at no point did my dinner party feel rushed by our server. We had a dinner reservation for 6 pm and happily chatted away until 8:30 pm when we decided to leave. Our server never gave us the impression that she wanted us to hurry up and leave, even though she had a line of waiting patrons to seat. Thanks for not rushing us out the door!", "rating": 3, "date": "2014-01-16"}], "pollo arrosto": [{"excerpts": ["Then I ordered the house special Pollo Arrosto the half rotisserie chicken ", "and it was cooked to perfection. ", "I loved the half baked-half fried potatoes and steamed veggies accompanied by huge portion. ", "For $15.95, my portion was enormous and it got me full. ", "My friends $11.95 angel hair pasta with fresh garden tomato sauce was to die for. ", "He couldnt finish his portion cause it was gigantic. ", "The wine by the glass was real bargain and they were fat splashes. ", "The staff was extremely friendly and they were on top of their game with cleaning and serving on a timely manner. ", "I will go back to this soon. ", ":)"], "author": "Emre T.", "review": "I had a fantastic dinner at Spiazzo last night. I was kinda skeptical while I was skipping through the restaurants on west portal strip however the whole dining experience turned out to be out of this world. It looks pretty dark and not very welcoming outside but the table tops are nicely lit and napkins are precisely ironed. My friend and I ordered the spring mix salad to share and by the time they arrived we were amazed that our split portions were very generously filled with crispy greens. The dressing was light and satisfactory. Then I ordered the house special Pollo Arrosto the half rotisserie chicken and it was cooked to perfection. I loved the half baked-half fried potatoes and steamed veggies accompanied by huge portion. For $15.95, my portion was enormous and it got me full. My friends $11.95 angel hair pasta with fresh garden tomato sauce was to die for. He couldnt finish his portion cause it was gigantic. The wine by the glass was real bargain and they were fat splashes. The staff was extremely friendly and they were on top of their game with cleaning and serving on a timely manner. I will go back to this soon. :)", "rating": 5, "date": "2011-05-11"}, {"excerpts": ["The chocolate pot de creme amazing and the pollo arrosto tasty. ", "I miss the medaglione de maile all griglia. ", "Maybe it will be on the specials menu in the future. ", "Oh and the special of flank steak with gorgonzola- orgasmic but really really rich."], "author": "Kat F.", "review": "I love this place. The food is good. The service is good. The staff is friendly and attentive. The price is very reasonable. They try to accomodate everyone who comes to the door with or without a reservation. My favorite dish isn't on the menu anymore. BUt the portabello alla griglia salad is delicious. The chocolate pot de creme amazing and the pollo arrosto tasty. I miss the medaglione de maile all griglia. Maybe it will be on the specials menu in the future. Oh and the special of flank steak with gorgonzola- orgasmic but really really rich.", "rating": 4, "date": "2009-08-21"}], "zuppa di pesce": [{"excerpts": ["To swirl the spaghetti in the excellent Zuppa Di Pesce (clams, shrimp, calamari, scallops and seasonal fish all in a tomato broth).\n\n"], "author": "Jason B.", "review": "You'll need a fork, knife, spoon and bib.\n\nThe fork: To swirl the spaghetti in the excellent Zuppa Di Pesce (clams, shrimp, calamari, scallops and seasonal fish all in a tomato broth).\n\nThe knife: To put the delicious tomato spread on the thick wheat bread that comes on the side.\n\nThe spoon: To have the remaining tomato broth after you finish the seafood and spaghetti.\n\nThe bib: To wear to make sure you don't get any of the above on your shirt.\n\nServed by a friendly waiter in a charming and welcoming space.\n\nLeft very satisfied and happy. And with a clean shirt. Barely.", "rating": 4, "date": "2011-10-12"}, {"excerpts": ["We ordered a Pizza Margherita, the Risotto, Zuppa Di Pesce and two items off of their specials-- an entree and an appetizer, none of which I can remember the names of, at the moment.  ", "Everything came out together shortly after finishing our appetizer.  ", "Everything was absolutely spot on!   ", "Flavorful and fresh.  ", "Unfortunately, we were all too full to have dessert.  "], "author": "Amani Z.", "review": "We were in SF for a night to visit my daughter who is a student at SFSU and for a show at The Fillmore.  It was a Saturday night around 7:30 p.m. and we ended up at Spiazzo on a fluke, after choosing not to wait 30-40 minutes for Latin American food across the street.  \n\nSERVICE:  We walked in and they seemed pretty busy, but we were seated right away for a table of four,  right in the front near the window.   Perfect.  We were met with friendly, warm and VERY attentive service from the get go and this was consistent throughout our meal.  Their timing was great from refreshing our waters, to taking our order and clearing plates-- the service was neither over-bearing nor did we for a moment feel we'd been forgotten about, which can so often be the case at restaurants, especially on a Saturday night.  \n\nFOOD:  The bread they brought out was so fresh and we LOVED the olive dip that came out with it.  We ordered a Pizza Margherita, the Risotto, Zuppa Di Pesce and two items off of their specials-- an entree and an appetizer, none of which I can remember the names of, at the moment.  Everything came out together shortly after finishing our appetizer.  Everything was absolutely spot on!   Flavorful and fresh.  Unfortunately, we were all too full to have dessert.  Had we not had a show to get to, we would have ordered some desserts to go.  \n\nWhen I looked at the check, which came to $89.51, I whispered out loud to my family, \"That's it?\"  I was easily expecting it to come to much more for all that we got and left a nice tip.    \n\nWe will definitely return again when we are back in town and craving Italian. We would love to further explore their menu.  We will be sure to give ourselves plenty of time so we can relax into the experience a little more.  We didn't have to tell them we had a show to get to-- their service was so great, but we all agreed it was a place to come back to when we aren't feeling bound to a deadline to get somewhere else.  \n\nI have been lucky in my travels to have eaten in some fabulous restaurants in some great cities-  NYC, Seattle, Portland, L.A. and Minneapolis and have had a yelp account for years, but just never got around to actually posting a review-- mostly just using the site to find restaurants.    This place inspired me to post my first review.  On the food or the service alone I would have easily given 4 stars, but the combination of excellent service and amazing food,  5 stars are very well deserved! \n\n Thank you Spiazzo for making our night so enjoyable!", "rating": 5, "date": "2013-10-01"}, {"excerpts": ["I ordered the Zuppa di Pesce. ", "I know it says Zuppa in it ", "and it was more of a soup-like item", ", I just wish it had more pasta and less soup. ", "I guess that would be more of a Tutto di Mare. ", "But either way it was delicious and lots of fresh yummy seafood and the soup broth was so good! ", "My husband's aunt ordered the clams and pasta dish, and the clams are SOO huge! ", "Not your typical linguine and clams item. ", "And it had a lot of pasta with some sort of sauce. ", "My husband ordered the lamb meatballs with risotto, which did not look like risotto. ", "It was rice i swear. ", "But the lamb meatballs were very good, not gamey at all, fluffy with breadcrumbs and also crispy on the outside from searing it. ", "My mother-in-law got the salmon pasta and she raved about how good it was also. ", "So much pasta and salmon mixed into it. ", "My husband's cousin got the ravioli with spinach and chicken ", "I believe and the ravioli were also a large portion size! "], "author": "Grace L.", "review": "Came here last night for dinner with family, made reservations via OpenTable for 7pm for a table of 7. First off, this place is small. There are no big tables, each table is a 4 person booth/table. But they put us in the back in a booth and they tacked on a table so it could accommodate 7 people. Definitely not a good place to come for big parties larger than 8. \n\nAlso, this place is busy on a Monday night! It was pretty packed when we first got there and more and more people kept coming in as the tables were turned over. That must be a good sign that it's this busy on a weeknight. The patrons are more of an older, sophisticated, wine-drinking type of crowd, not your family-type of joint. \n\nEach table gets a plate of foccaccia-like bread with marinara-like sauce and butter. The bread was delicious, light and fluffy, but not exactly like foccacia-texture. Though I do think it was suppose to be foccaccia. The marinara was cool that they give you a sauce instead of the usual butter, but it didn't taste exactly like just marinara and it was orange... I went with the butter instead. Others in my party liked it, I didn't care for it too much. \n\nOn to the food... every dish that came out looked so yummy and delicious and I don't think anyone had a complaint about the food. They have good size portions especially! And the price is totally reasonable! I ordered the Zuppa di Pesce. I know it says Zuppa in it and it was more of a soup-like item, I just wish it had more pasta and less soup. I guess that would be more of a Tutto di Mare. But either way it was delicious and lots of fresh yummy seafood and the soup broth was so good! My husband's aunt ordered the clams and pasta dish, and the clams are SOO huge! Not your typical linguine and clams item. And it had a lot of pasta with some sort of sauce. My husband ordered the lamb meatballs with risotto, which did not look like risotto. It was rice i swear. But the lamb meatballs were very good, not gamey at all, fluffy with breadcrumbs and also crispy on the outside from searing it. My mother-in-law got the salmon pasta and she raved about how good it was also. So much pasta and salmon mixed into it. My husband's cousin got the ravioli with spinach and chicken I believe and the ravioli were also a large portion size! So you're eating more filling than just the pasta. \n\nOne downside to the place, the service of our waiter. He was definitely italian, but he was ALL over the place. He took the order of my mother-in-law then he walked away to take another table's order. Then he never returned to us until we beckoned another waiter. Then in the middle of taking our large party order, he refilled our bread and sauce! He definitely tried and worked hard, he just seemed very scattered-brain. \n\nParking was easy with street parking in front, or maybe we got lucky. But it didn't seem too bad on a weeknight. e", "rating": 4, "date": "2012-04-03"}, {"excerpts": ["Fusilli holds the sauce really well\n\nZuppa Di Pesce  - sauteed mussels, clams small shrimp calamari, scallops and generous pieces of seasonal fish in a light tomato broth served with spaghetti and garlic crostini. "], "author": "Dennis L.", "review": "A nice Italian restaurant that brings something different to the neighborhood. Too often I hear people talking about Italian food to only hear about Olive Garden and Pasta Pomodoro. Blah. And too often do I hear about the pizza joints that serve pasta and and other stuff as well. Well, spiazzos is an Italian restaurant that serves pizza as well.\n\nFavs\n\nBrushetta - four slice of sourdough toast topped with two toppings. The original - tomatoes in a vinagrette. Mushrooms in a pesto dressing. Yum\n\nPetto Di Pollo Al Funghetto - chicken breast with mushrooms in a delicate cream sauce. \n\nFusilli Alla Genovese  - corkscrew pasta with pesto sauce, wild mushrooms and a touch of fresh tomato. Fusilli holds the sauce really well\n\nZuppa Di Pesce  - sauteed mussels, clams small shrimp calamari, scallops and generous pieces of seasonal fish in a light tomato broth served with spaghetti and garlic crostini. A little bit of every kind of seafood.\n\nNothing is quite overwhelmingly overpriced and there's definitely a warm family vibe.", "rating": 4, "date": "2009-01-09"}, {"excerpts": ["then, for my main, i ordered the zuppa di pesce, something akin to a cioppino, but with a few strands of spaghetti and a pureed tomato base. ", "again, i felt like the dish lacked complexity and flavor. "], "author": "May T.", "review": "3 stars for seating us at a moment's notice for a party of 10. the staff were awesome if moving a little slow, but that's forgive-able on a saturday night in west portal with a party our size.\n\nafter our non-profit event, we were starving (some of us ate less than half of a 6-inch subway sandwich all day because of our hectic schedules) and wanted something hot and yummy with lots of good vino. \n\nthe food was all right. i have problems going to italian restaurants these days because i think i make italian dishes better; fresh, from scratch, at home with good olive oil and better ingredients.\n\ni ordered a baked eggplant stuffed with meat and cheese to start. the eggplant was good if a little tough around the skin (they should have fire roasted it first to make it more palatable), but the tomato sauce surrounding it tasted straight out of a tin with no spices. then, for my main, i ordered the zuppa di pesce, something akin to a cioppino, but with a few strands of spaghetti and a pureed tomato base. again, i felt like the dish lacked complexity and flavor. not enough oregano and bay, too much basil. \n\ni don't think much of the scooby gang minded since we were really happy to just have a table with hot, comfort-style food placed in front of us after a grueling day. and on nights like these, it's not about the food, but about the warmth of the company and from the satisfaction of knowing that months of hard work paid off.", "rating": 3, "date": "2008-03-16"}, {"excerpts": ["my favorite dish here is the zuppa di pesce -- tomato broth with tons of baby shrimp and scallops.   ", "the roast pork loin is scrum-de-li-ishus too, not dry at all.  ", "i really have to start ordering something other than the usual zuppa, especially since the menu is so extensive."], "author": "iGab C.", "review": "my favorite dish here is the zuppa di pesce -- tomato broth with tons of baby shrimp and scallops.   the roast pork loin is scrum-de-li-ishus too, not dry at all.  i really have to start ordering something other than the usual zuppa, especially since the menu is so extensive.", "rating": 4, "date": "2007-02-02"}], "tagliata al balsamico": [{"excerpts": ["I've had the TAGLIATA Al BALSAMICO ", "and we like their good wine selection."], "author": "Ryan D.", "review": "I've been here twice with my wife, it's in our favorite little area near our house, West Portal. \n\nWe come here to celebrate special occasions and are never disappointed. \n\nI've had the TAGLIATA Al BALSAMICO and we like their good wine selection.", "rating": 4, "date": "2011-04-22"}], "scaloppine piccatina": [], "scaloppine marsala": [], "saltimbocca alla romana": [{"excerpts": ["Saltimbocca alla Romana. ", "Again tasty but not the best ever. ", "My daughter had the lasagne and she was very satisfied. ", "For dessert she had chocolate gelato ", "and i had Chocolate Pot de Creme....", "OMG!!! ", "Now that was just awesome! ", "My tongue was pleasantly surprised  by the smoothness and taste extravaganza. ", "Not too sweet just good chocolate yumminess. ", "Needless to say, it was my fav part of the whole meal"], "author": "Roxy L.", "review": "Read good reviews about this then decided i had to try it out...We started with brushetta and it was tasty, not the best but good. No soup for me today because i wasnT too hungry today but wanted roomfor dessert so onto the main course....Saltimbocca alla Romana. Again tasty but not the best ever. My daughter had the lasagne and she was very satisfied. For dessert she had chocolate gelato and i had Chocolate Pot de Creme....OMG!!! Now that was just awesome! My tongue was pleasantly surprised  by the smoothness and taste extravaganza. Not too sweet just good chocolate yumminess. Needless to say, it was my fav part of the whole meal", "rating": 3, "date": "2012-01-08"}, {"excerpts": ["The Saltimbocca alla romana, veal covered in proscuitto and fontina cheese in a marsala sauce was excellent as well. \n\n"], "author": "Jan Michael K.", "review": "Very good traditional food.  For kicks, I tried the mushroom appetizer with a variety of them pan fried. Tasty! \n\nThe Saltimbocca alla romana, veal covered in proscuitto and fontina cheese in a marsala sauce was excellent as well. \n\nRelaxing place with good food, sometimes that is all you need.", "rating": 4, "date": "2008-11-22"}, {"excerpts": ["My wife ordered the Minnestroni while I tried the Saltimbocca Alla Romana, which is veal with Prosciutto and cheese in a wonderful sauce served with vegetable and garlic mashed potatoes.  ", "Our food came incredible fast and the waiters were very attentive.  ", "I loved the food.  ", "It wasn't the best veal I've ever had, but it more than did the trick for $16.  ", "My wife also enjoed the soup, and claimed it was the yummiest she's had.\n", "Overall I recommend Spiazzo Cafee to anyone interested in a good meal in a neat location for very little money.    ", "I know that I'll be back!"], "author": "Jason d.", "review": "So I live in the Inner Richmond, and as such don't really have much cause to go out to eat in West Portal, but I'm now glad that I have.  Spiazzo Caffe is a very good place to enjoy a great, inexpensive meal out with friends.  The staff was very pleasent, and even though our waiter had a VERY thick Italian accent (none of the four people in our party could quite understand everything that he said) he was able to take our orders and give recommendations with very little difficulty.  My wife ordered the Minnestroni while I tried the Saltimbocca Alla Romana, which is veal with Prosciutto and cheese in a wonderful sauce served with vegetable and garlic mashed potatoes.  Our food came incredible fast and the waiters were very attentive.  I loved the food.  It wasn't the best veal I've ever had, but it more than did the trick for $16.  My wife also enjoed the soup, and claimed it was the yummiest she's had.\nOverall I recommend Spiazzo Cafee to anyone interested in a good meal in a neat location for very little money.    I know that I'll be back!", "rating": 4, "date": "2008-02-02"}], "misto di carne alla griglia": [], "scottadito": [], "side of spinach": [{"excerpts": ["We had the POLENTA di CASA and the FETTUCCINE CON GAMBERONI, also a side of spinach and a bowl of minestrone.  ", "No room for dessert because we ate it all up. ", "Thanks, Spiazzo, for always being there."], "author": "Na m.", "review": "This longtime, West Portal restaurant has gone through it's ups and it's not-so ups, but right now it's flying high. Very good fresh pasta, amiable staff, and cozy, neighborhood feel. Go before the movie that's playing up the block at the Empire or after an author's chat at West Portal Bookstore. We had the POLENTA di CASA and the FETTUCCINE CON GAMBERONI, also a side of spinach and a bowl of minestrone.  No room for dessert because we ate it all up. Thanks, Spiazzo, for always being there.", "rating": 4, "date": "2016-01-25"}, {"excerpts": ["Others had a seafood soup with a side of spinach (my vegetarian sister-in-law), my brother-in-law had pasta Calabrese  ", "and he's of Italian decent from Rhode Island and knows his food, he said it was great, my wife had lamb meatballs and risotto, she was pleased (Phew) the little guy had pepperoni pizza ", "(I won't compare pizza on the left coast to the NY pizza I'm used to) ", "The only one to have desert was the little guy (Gelato) ", "I tasted it and my only critique is it was more like ice-cream that gelato.  ", "As an after note, as busy as this place was when I began to taste my meal the entire restaurant came to a hushed silence awaiting a smile or a frown, as I looked up finishing my first bite of ravioli and smiled broadly a sigh of relief could be heard, amid the quiet voices could be heard, WOW! ", "Why isn't Bill a Yelp Elite 15....", "my question exactly. ", "It must be my shirt.\n", "On the way out I spoke briefly with Giuseppe the proprietor and complimented him on a job well done! ", "I'd like t give 4+ stars."], "author": "Bill F.", "review": "As I'm visiting family in SF I don't know many places, my brother-in-law suggested we visit Spiazzo after a day at two wineries in Santa Cruz. My family knows how picky I am around food and they all were telling me this is just a local place please don't hold the bar too high. It was packed on Father's day, however, we were seated exactly on time at 6:30 sharp, albeit the table was cramped and right opposite the kitchen. I was so close to the kitchen I could have cooked my own meal. We were at the table long enough to get water and bread, when the hostess came over and offered to move us to a booth that was much better situated. (this was unsolicited and IMHO a class move) Considering how busy it was and I do me crazy busy, our server (an older Italian gentleman) was totally on top of his game. Drink orders were taken, and brought to the table in record time, as if we were the only table in the place.\nOur order was taken and the food for five (5) came out in a reasonable time and all together and steaming hot! I had the ravioli with pesto, chicken, sun dried tomatoes and spinach. The plate was well composed and had a huge portion of ravioli and was well seasoned and yummy! Others had a seafood soup with a side of spinach (my vegetarian sister-in-law), my brother-in-law had pasta Calabrese  and he's of Italian decent from Rhode Island and knows his food, he said it was great, my wife had lamb meatballs and risotto, she was pleased (Phew) the little guy had pepperoni pizza (I won't compare pizza on the left coast to the NY pizza I'm used to) The only one to have desert was the little guy (Gelato) I tasted it and my only critique is it was more like ice-cream that gelato.  As an after note, as busy as this place was when I began to taste my meal the entire restaurant came to a hushed silence awaiting a smile or a frown, as I looked up finishing my first bite of ravioli and smiled broadly a sigh of relief could be heard, amid the quiet voices could be heard, WOW! Why isn't Bill a Yelp Elite 15....my question exactly. It must be my shirt.\nOn the way out I spoke briefly with Giuseppe the proprietor and complimented him on a job well done! I'd like t give 4+ stars.", "rating": 4, "date": "2015-06-22"}], "side of potatoes": [{"excerpts": ["I had the petto di pollo marsala which the server informed me would include a side of potatoes and vegetables. ", "I was expecting sliced roasted potatoes and was surprised when the potatoes turned out to be mashed and heavily \"seasoned\" with huge pieces of garlic. ", "I've always associated mashed potatoes as being very American "], "author": "Elena F.", "review": "If you enjoy lots of garlic in your food then this is the place for you!\n\nI had the petto di pollo marsala which the server informed me would include a side of potatoes and vegetables. I was expecting sliced roasted potatoes and was surprised when the potatoes turned out to be mashed and heavily \"seasoned\" with huge pieces of garlic. I've always associated mashed potatoes as being very American so I found it odd that they were being served in an \"Italian\" restaurant. \n\nThe chicken wasn't anything special and I wasn't surprised when I found pieces of garlic in the marsala sauce too! I mean who wants to accidentally chow down on slivers of garlic?  \n\nThe vegetables were decently cooked and I enjoyed them, minus the garlic of course!\n\nWhat I did like about this restaurant was that at no point did my dinner party feel rushed by our server. We had a dinner reservation for 6 pm and happily chatted away until 8:30 pm when we decided to leave. Our server never gave us the impression that she wanted us to hurry up and leave, even though she had a line of waiting patrons to seat. Thanks for not rushing us out the door!", "rating": 3, "date": "2014-01-16"}], "side of mash potatoes": [], "side of green beans": [{"excerpts": ["Ended up ordering the gnocchi and a side of green beans. ", "So delicious!!! ", "Gnocchi was so fresh and soft, not rubbery at all. ", "Good amount as well, but definitely super full once I was nearing the finish line! "], "author": "Sophie C.", "review": "Some really nice food. I had gone on 5/18/2012 around 7:30pm, around graduation occuring at SFSU. I knew it was going to be packed, but thankfully my group got seated in no more than 15 min (after being told it would be about 5). \n\nFresh bread brought to the table, a little hard on the bottom, and waters. Waiter asked twice if we had any questions and was giving us appropriate time to think it over. Good variety on the menu, but typical for an Italian restaurant. As a vegetarian, I thought I had a good amount to choose from. \n\nEnded up ordering the gnocchi and a side of green beans. So delicious!!! Gnocchi was so fresh and soft, not rubbery at all. Good amount as well, but definitely super full once I was nearing the finish line! Wine selection was nice too.\n\nWe had waited a little longer than usual, but we knew it would be busy. \n\nNow, the good part! Deserts were SO GOOD! Between the three of us, we split Zanze's cheesecake, the Spumoni, and the tiramisu. The cheesecake was a must; a local SF bakery and can only be ordered in cakes, so soft and not overpowering. Spumoni was DELICIOUS, pistachio ice cream was on par. Tiramisu was a gracious serving, soft soft soft.\n\nOverall a generous experience. Pricing was decent, not over-priced. Just the right amount for a \"nice dinner\". The restaurant is fairly small, but the wait usually doesn't take too long. \n\n$$ w/o wine, $$$ w/ wine", "rating": 4, "date": "2012-05-21"}], "side of vegetables": [], "side of risotto": [{"excerpts": ["Then I had the Petto Di Pollo al Funghetto with a side of Risotto. ", "Both were fabulous!! ", "The staff was very knowledgeable & informative of every item on the menu. ", "The wine list had excellent choices.  ", "Our waiter gave us a few suggestions & he did a great job! ", "We finished with desserts that were delicious. ", "We will definitely go back."], "author": "Sue N.", "review": "We started with the Antipasto Misto. Then I had the Petto Di Pollo al Funghetto with a side of Risotto. Both were fabulous!! The staff was very knowledgeable & informative of every item on the menu. The wine list had excellent choices.  Our waiter gave us a few suggestions & he did a great job! We finished with desserts that were delicious. We will definitely go back.", "rating": 5, "date": "2016-04-10"}], "side of meatballs": [], "grill chicken breast": []}