{"spring roll with pork": [], "fresh roll vegetarian": [], "prawn roll": [], "vegetarian spring roll": [], "fried calamari": [{"excerpts": ["The fried calamari is delish, I have also enjoyed the satay and prawn rolls.\n", "Pad Thai is lovely, green curry tasty, and to finish with the sticky sweet rice and mango is a treat.\n", "Oh, and they will make the curry to order mild, medium or hot.\n", "So happy this place is in my neighbourhood :)"], "author": "Kat C.", "review": "This is honestly the best Thai Pumpkin Curry I have ever had.\nI keep trying to order something different but I can't help but get the pumpkin every time.\nI have not eaten in yet, mostly opt for delivery (always faster than the predicted time). I picked up in the restaurant once and it appeared inviting and the staff at very nice.\nThe fried calamari is delish, I have also enjoyed the satay and prawn rolls.\nPad Thai is lovely, green curry tasty, and to finish with the sticky sweet rice and mango is a treat.\nOh, and they will make the curry to order mild, medium or hot.\nSo happy this place is in my neighbourhood :)", "rating": 5, "date": "2013-09-07"}, {"excerpts": ["Try the Fried Calamari, Pad Thai, and Pad Gra Prow with Chicken. ", "Those are my favorites."], "author": "Darcy V.", "review": "Sri Thai is a fantastic, tiny little restaurant in the outer sunset. It serves some of the best Thai food in the city at reasonable prices. And they deliver! I can't even find another one that does. \n\nTry the Fried Calamari, Pad Thai, and Pad Gra Prow with Chicken. Those are my favorites.", "rating": 5, "date": "2008-06-08"}, {"excerpts": ["Had corn cake, fried calamari, tom yum gun soup, pad thai, and thai ice tea."], "author": "Jer W.", "review": "Went to dinner with my friends.  Appears everything tasted better than the previous visit.  Had corn cake, fried calamari, tom yum gun soup, pad thai, and thai ice tea.", "rating": 5, "date": "2009-03-25"}, {"excerpts": ["Other dishes were the pineapple fried rice, fried calamari, pumpkin curry, and garlic pork (forgot the Thai name) dish. ", "They were all very delicious. ", "The Thai Iced Tea was too sweet though. ", "The prices are very decent with the majority of the menu priced under $10 per dish. ", "All in all, a great place to dine."], "author": "Amelia G.", "review": "Sri Thai has great food. One of the dishes I got was the Spicy Mango Shrimp. If you like spicy, get this, but you can also ask them to ease up on the spicy if it's burning up your mouth like it did mine! Other dishes were the pineapple fried rice, fried calamari, pumpkin curry, and garlic pork (forgot the Thai name) dish. They were all very delicious. The Thai Iced Tea was too sweet though. The prices are very decent with the majority of the menu priced under $10 per dish. All in all, a great place to dine.", "rating": 4, "date": "2009-04-22"}], "corn cake vegetarian": [], "spicy tofu": [{"excerpts": ["We got the spicy tofu appetizer that usually comes with chicken wings but we subbed it out for fried tofu, and so glad we got it because it was delicious! ", "Our entrees were delicious good too but the noodles seemed to be a little bit too wet. ", "Definitely going to come back soon!"], "author": "Kayla F.", "review": "I haven't been here since I was in elementary school but I'm glad to see that it's still very delicious! We got the spicy tofu appetizer that usually comes with chicken wings but we subbed it out for fried tofu, and so glad we got it because it was delicious! Our entrees were delicious good too but the noodles seemed to be a little bit too wet. Definitely going to come back soon!", "rating": 5, "date": "2018-07-04"}], "thai samosa vegetarian": [], "spicy wing": [], "pesto pot sticker": [], "combo appetizers": [], "cup of tomkha soup": [], "bowl of tomkha soup": [], "cup of tomyum soup": [], "bowl of tomyum soup": [], "cup of woon sen soup": [], "bowl of woon sen soup": [], "larb gai chicken salad": [], "green bean salad": [{"excerpts": ["and I love an odd mix of things like the pesto potstickers, prawn salad, green bean salad, veggie fried rice, pad broccoli and the pad pak. "], "author": "Karen N.", "review": "This is my husband and I's go to Thai take out place. We have been going to this place for 6 years. \n\nWe both love the chicken tom kha, he loves the green chicken curry and I love an odd mix of things like the pesto potstickers, prawn salad, green bean salad, veggie fried rice, pad broccoli and the pad pak. I don't think I have ever ordered something I did not like.\n\nWe have never had a bad meal here, and IMO that says a lot.", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["Had the...vegetarian thai samosas http://www.yelp.com/biz_photos/lOSf40Yd3s29fY5bj72IOw?select=mArTsdB8ZFGosPZuqKL2uA , green bean salad, pad thai with beef http://www.yelp.com/biz_photos/lOSf40Yd3s29fY5bj72IOw?select=cE7R8rVh4aqvJfBJuUf69Q and green curry with beef http://www.yelp.com/biz_photos/lOSf40Yd3s29fY5bj72IOw?select=FqytitfHkmLAsbIq5DAA_Q . ", "The best items were the green curry and samosas. ", "I don't know if I'd get the green bean salad, well...", "I'm not really a salad person. "], "author": "Kylie L.", "review": "I'm not surprised that this place doesn't have any 1 star reviews.\n\nCame in around 5:20PM today, there were only a few others there. I've walked by it around 8 or 9PM and it was a lot more crowded.\n\nHad the...vegetarian thai samosas http://www.yelp.com/biz_photos/lOSf40Yd3s29fY5bj72IOw?select=mArTsdB8ZFGosPZuqKL2uA , green bean salad, pad thai with beef http://www.yelp.com/biz_photos/lOSf40Yd3s29fY5bj72IOw?select=cE7R8rVh4aqvJfBJuUf69Q and green curry with beef http://www.yelp.com/biz_photos/lOSf40Yd3s29fY5bj72IOw?select=FqytitfHkmLAsbIq5DAA_Q . The best items were the green curry and samosas. I don't know if I'd get the green bean salad, well...I'm not really a salad person. The pad thai was very vinegar-y.\n\nI would come again. The reviews on yelp for the place made it sound extraordinary, it was just a normal okay restaurant.", "rating": 4, "date": "2009-08-07"}, {"excerpts": ["We ordered the vegetarian fresh rolls, green bean salad, and pad gra prow and all were great. ", "Wish I lived closer."], "author": "Janelle F.", "review": "Great food and service. Only downside (for me) is the location. We ordered the vegetarian fresh rolls, green bean salad, and pad gra prow and all were great. Wish I lived closer.", "rating": 4, "date": "2015-02-16"}], "silver noodle salad": [], "grilled pork": [{"excerpts": ["Pad Thai is amazing at any level of spicy, the grilled pork and chicken are fabulous. ", "Can't miss with this spot."], "author": "Val T.", "review": "This is now our go to Thai delivery restaurant in the Sunset. Been ordering from here for several months and have never been disappointed with food or delivery time. Pad Thai is amazing at any level of spicy, the grilled pork and chicken are fabulous. Can't miss with this spot.", "rating": 5, "date": "2017-01-08"}, {"excerpts": ["Add corn cakes, grilled pork, veggie spring rolls, pad thai, it's a fat kid's paradise."], "author": "Livia K.", "review": "Very warm and inviting service. They even make little roses out of the paper the straw came from and attach it back on the straw. The yellow curry chicken and vegetables is creamy with subtle coconut milk, it's divine. Add corn cakes, grilled pork, veggie spring rolls, pad thai, it's a fat kid's paradise.", "rating": 4, "date": "2015-11-30"}, {"excerpts": ["We had the spring rolls, chicken satay, grilled pork and yellow curry with chicken. ", "Everything was very flavorful. ", "We topped off with fried banana and coconut ice cream for dessert (so refreshing). ", "I can't believe I haven't been here since only a block away from this place. ", "Definitely coming back soon!"], "author": "Michelle D.", "review": "Super delicious! Came here for dinner tonight with my family. We had the spring rolls, chicken satay, grilled pork and yellow curry with chicken. Everything was very flavorful. We topped off with fried banana and coconut ice cream for dessert (so refreshing). I can't believe I haven't been here since only a block away from this place. Definitely coming back soon!", "rating": 5, "date": "2016-07-12"}, {"excerpts": ["We went this weekend and had Tom Yum soup with chicken, Pad Thai with beef, and grilled pork (we love meat).  ", "The soup was AMAZING.  ", "The pieces of chicken were kinda bland, but the broth was very flavorful - sour/sweet and spicy, some of the best tom yum I've ever had.  ", "Lastly the grilled pork!  ", "Sweet and tender, comes with a nice chili sauce, definitely worth a try if you go.  ", "All for less than $30 for two!  ", "Pretty great, will be back and would definitely recommend."], "author": "Leslie G.", "review": "Been here a couple times, both were times it's been fantastic.  The location is a bit out of the way, but after walking through the park and along the beach, it's the best find ever.\n\nThe restaurant is small, but colorful inside and cozy.  The staff is very nice and attentive.  Fast service with a smile, can't go wrong.\n\nWe went this weekend and had Tom Yum soup with chicken, Pad Thai with beef, and grilled pork (we love meat).  The soup was AMAZING.  The pieces of chicken were kinda bland, but the broth was very flavorful - sour/sweet and spicy, some of the best tom yum I've ever had.  And plenty of meat and mushrooms.\n\nThe pad thai was a little less colorful than other places I've been to, but it was just as good.  Noodles cooked well and flavored just the right amount, served with plenty of egg, sprouts and flavor-soaked tofu.  Lastly the grilled pork!  Sweet and tender, comes with a nice chili sauce, definitely worth a try if you go.  All for less than $30 for two!  Pretty great, will be back and would definitely recommend.", "rating": 5, "date": "2009-03-10"}], "grilled jumbo prawns": [], "roasted duck half duck": [], "grilled salmon": [{"excerpts": ["Every thing is good, the grilled salmon is generous with a delicious spicy butter on the side. ", "Try the chicken wings just for the  sauce.\n", "Salads are great, as are the spring rolls.\n", "Prices are SO reasonable, even for a beer.\n", "Dinner for four with appetizers came to less than $70."], "author": "Mike N.", "review": "San Francisco, CA.\n\nIf you are new to this place and it is busy there is kind of a procedure. I have done it a few times so I get it. Arrive and note your place in line the best you can. No one will be there to write your name down on the waiting list so browse the menu or something . Eventually a waitress will come and write everybody's name down. The wait is not horrible, they move with efficiency, the longest I've waited was 30 minutes.\nEvery thing is good, the grilled salmon is generous with a delicious spicy butter on the side. Try the chicken wings just for the  sauce.\nSalads are great, as are the spring rolls.\nPrices are SO reasonable, even for a beer.\nDinner for four with appetizers came to less than $70.", "rating": 5, "date": "2016-10-02"}, {"excerpts": ["Main course I would recommend trying the grilled chicken or duck, which is served on a bed of veggies and rice or the grilled salmon.  ", "If you'd prefer a curry, you can't go wrong with any of the curry selections as they have yellow, green, or red curry.  "], "author": "Gordon A.", "review": "Excellent Outer Sunset neighborhood Thai Restaurant.  I must confess I haven't eaten in here but have mostly ordered out.  The delivery is fast and friendly.  The first year I discovered this place I was ordering very often.  I was rewarded come Christmas time with a tin of cookies and a Christmas card delivered with my order.\n\nI would highly recommend the following:  Appetizers:  Corn cake (delicious pancake made of corn kernels mixed in batter and then fried); and the deep fried boneless chicken wings stuffed with ground  shrimp, chicken breast, corn, carrot, mushroom, bamboo shoots and silver noodles.  (One word:  Addictive)\n\nFor your salad course I would recommend the papaya salad or the beef salad.  If you'd prefer soup instead, then I would go for the tom kha  with your choice of shrimp, chicken, or tofu.\n\nMain course I would recommend trying the grilled chicken or duck, which is served on a bed of veggies and rice or the grilled salmon.  If you'd prefer a curry, you can't go wrong with any of the curry selections as they have yellow, green, or red curry.  When ordering a curry I usually order the yellow curry chicken or the delicious pumpkin curry.\n\nIf you're in the neighborhood then I would highly recommend you stop by the place for some really good Thai food.  You won't be disappointed.", "rating": 4, "date": "2007-04-11"}, {"excerpts": ["from the papaya salad, pumpkin curry, or the grilled salmon...sri thai has got it goin on!!!\n", "living on the edge of the sunset, our options are somewhat limited, so having great thai spot a phone call away is sooooo convenient!!\n", "yummmmy"], "author": "K K.", "review": "this place has never let me down.  from the papaya salad, pumpkin curry, or the grilled salmon...sri thai has got it goin on!!!\nliving on the edge of the sunset, our options are somewhat limited, so having great thai spot a phone call away is sooooo convenient!!\nyummmmy", "rating": 4, "date": "2009-02-03"}, {"excerpts": ["i had the grilled salmon and it was awesome and the veggies were steamed to perfection.  ", "i ordered delivery and had forgotten my apt number ", "and they took it with a smile.  ", "can't wait to order from there again, delish!"], "author": "Elizabeth H.", "review": "totally tasty.  i had the grilled salmon and it was awesome and the veggies were steamed to perfection.  i ordered delivery and had forgotten my apt number and they took it with a smile.  can't wait to order from there again, delish!", "rating": 5, "date": "2009-03-21"}], "mas samun curry": [{"excerpts": ["MAS SAMUN CURRY\nin coconut milk w/ tamarind sauce roasted peanut, potato, carrot.\n\n"], "author": "Oliver D.", "review": "This place is situated alongside Golden Gate Park in the Sunset Neighborhood and is built around a duplex and apartment complex. Please don't judge a book by its cover because this place is as AUTHENTIC as Thai food can get in the area! \n\nThe staff is dressed in traditional attire and their hospitality is tremendously genuine! All the waitresses are patient, so please return the favor! It might be hard for you to understand them because English is their second language, so be nice!\n\nTheir Chicken Pad Thai is YUM! and their Curry is to die for! So much FLAVOR! especially the next day for take out.  \n\nMy Favorite dishes at Sri Thai:\n\nYELLOW CURRY\nin coconut milk w/ potato, carrot and onion.\n\nMAS SAMUN CURRY\nin coconut milk w/ tamarind sauce roasted peanut, potato, carrot.\n\nSPICY FRIED SNAPPER\nDeep-fried snapper fillet; topped w/ spicy red curry sauce, green bean, onions, bell pepper, and sweet basil.\n\nPINEAPPLE FRIED RICE\negg, raisin, cashew nut, onion.\n\nTHAI ICED TEA!", "rating": 3, "date": "2009-11-05"}, {"excerpts": ["had the Mas Samun Curry over rice which was excellent.  "], "author": "Ricky A.", "review": "Food was great & atmosphere was nice (haha, very clean large mirrors gave the impression the place was bigger than it was).  had the Mas Samun Curry over rice which was excellent.  Chicken fried rice was and Pad Se Ew were good too...   Thai Ice Tea could have benefited from less ice.", "rating": 4, "date": "2011-12-05"}], "pa naeng curry": [{"excerpts": ["I was hooked on the pa naeng curry for a while.  ", "Also, really enjoy the spring roll!  ", "The tom kha soup is flavorful, but the chicken can be a bit dry.  ", "I have never had anything bad here!  ", "Thanks for the great food and super fast delivery!!!"], "author": "Katie N.", "review": "I love this place!  My husband does not eat thai food, so every time he goes out for the night I get delivery!!  I can't get enough of the Pad Himapan with crispy prawns!  Also, the fresh rolls are great...but I do not care for the dipping sauce.  I was hooked on the pa naeng curry for a while.  Also, really enjoy the spring roll!  The tom kha soup is flavorful, but the chicken can be a bit dry.  I have never had anything bad here!  Thanks for the great food and super fast delivery!!!", "rating": 4, "date": "2009-07-24"}], "roasted duck curry": [{"excerpts": ["Roasted Duck Curry: ", "Spot on with the duck. ", "Somewhat crunch on the outer skin and not too fatty.  "], "author": "Juila L.", "review": "This place is NASTY!!  Their attitude that is!  \n\nCame here on father's day for the first time since most places were packed or closing.  We called to RSVP & got hung up before we finish leaving our name.\n\nHowever, I got here thinking that ima let that go and just chill!  Ambience seemed decent, spacious table for our family of 5 + an 8 mos old infant.  The food was fair with some good & bad dishes.  \n\nFOOD TIP:\n\nRoasted Duck Curry: Spot on with the duck. Somewhat crunch on the outer skin and not too fatty.  The curry was not spicy and good. \n\nGreen Curry w/ Beef: Beef what somewhat tough but it's ok because the curry was very good.  Kinda spicy (just right for me) \n\nTom Kah Soup: Dirty shrimp with poop still all in there (not cleaned), but the soup was good.  You just have to pick out your own SHRIMP POO \n\nPad Thai: OK; mediocre\nPad See Ew: OK; mediocre, on the sweet side, not my go to dish here\n\nBrown Rice: Good but there are grainy parts so if you don't like that type of texture don't order this.  It's $2 each bowl to go with the a la crate dishes and curries.\n\nWAITRESS RECOMMENDATION: Salmon & Eggplant:  Salmon did not taste fresh.  No flavoring besides fishy fishy ocean yuck with some bone bits in it. Eggplant was good.  They don't compliment each other; living in their own world in that dish.  FAIL recommendation.\n\nTotal: 3-4 star for food, but this is why they deserve 1 star\n\nNASTY WAITRESS!!  \n\nWe had an 8 mos old at our table, my infant baby niece.  All she does (like all babies) is eat, sleep, play, cry, scream, and baby talks with high and low vocals.  With this said she's also a girl so yes sometimes her pitch can be high.  I looked around & notice the guy behind our table laughing & giggling hard with us b/c he knows how random babies are.  (8yr old at his table) I'd laugh if I heard someone else's baby do that too.  \nThe next thing I notice was the same waitress (PAT or PACK) who gave me poor food recommendations glaring with burning angry eyes right at my niece (the baby).  I thought it was a fluke.  maybe she just have an RBF (resting bitch face) which is natural for some people LOL... since she had that pissed look from the beginning, I just thought it was normal for her & ignored it.  \n\nHowever, she suddenly became confrontational with us & told us in front of the entire restaurant to SHUSHHHH quiet & keep it down in a very disrespectful way.  It was not discrete or quiet, she looked like she want to strangle the infant!  WE WERE pretty quiet, besides baby random vocals of self blabbering & random screams..she's an 8 mos infant, just wow...!  Thought I was on the show WWYD (What Would You Do)! HAAAAaa & John Quinones was gonna come out & say we got yoU!!  WRONG!!\n\nwe are suppose to somehow silent the infant.  Or should we feel guilty for taking baby out for a family day for father's day???  \n\nDespite what we thought inside you know we told the waitress sure yes, we'll keep it down.  My sister in law (SIL) tried to hush the baby, gave her pacifier, swing her around, (can't eat while she's doing this obviously), all sorts of baby comforting things... I mean what else can we do besides leave??? I wish they would have told us from the gecko like hey this is not an infant baby friendly place, but no... just straight up embarrass & humiliate us after they rob our money.  In the middle of eating, shut up or gtfo kind of attitude... OokKayyyy there.... \n\nSo my SIL was going to write a review saying this place is not baby friendly to warn others, so asked another server for the RBF server's name (PAT/PACK) -I'll call her \"P\" for short. Suddenly P freaks out & does her weird DEATH STARE straight at my SIL with piercing eyes & said \"WHAT IS YOUR PROBLEM\", so my SIL explained that it is practically impossible to control an infant baby's random sounds; how can we silence a baby?  P again freaks out & points at my SIL right in front of the whole restaurant & yells, \"YOU ARE THE MOM, you STOP your baby! OTHER MOMS STOP THEIR BABIES!\" Like OMG my jaw drops! How rude is that to say to your customer??  So we find out she's not a mom but she's judging someone else's parenting abilities & embarrasses us in front of the whole restaurant... I THOUGHT WWYD. JOhn Quinones can come out now because that is just something out of a TV!  Such NASTY NASTY attitude from P the waitress!  \n\nSo fellow foodies, please beware of this place.  They are NOT infant/kids/children friendly unless you have a mute.\n\nWith this poor dramatic experience, I really felt bad for my Dad who had to sit there & watch this like a show for Father's day.  I really regret taking him here.  I wish it was different.  I wish P would just learn how to be a proper respectful human being so that she don't ruin people's happy day with her negative vibe, poor energy, and doom and gloom demeanor.  With that said, I wouldn't recommend this place for anyone with families or friends who have smaller ones to bring.  \n\nDon't think I'll be back!", "rating": 1, "date": "2018-06-18"}], "panang curry with grilled salmon": [], "pad gra prow": [{"excerpts": ["The food was good (I ordered Panang Curry and Pad Gra Prow) and they were both tasty!! ", "They don't give you a spice option when selecting food so make sure you make a comment on the order for spicy (I did and the food was spicy enough for me - I used to live in Thailand "], "author": "Jorgen A.", "review": "I really enjoyed my food from Sri Thai! I noticed a lot of criticism for slow delivery but I didn't experience that at all... I ordered online for delivery at 9PM on a Wednesday (Yelp says they close at 10PM) so I was a little nervous it wouldn't show up or arrive super later but they delivered to my place in 30 minutes!\n\nThe food was good (I ordered Panang Curry and Pad Gra Prow) and they were both tasty!! They don't give you a spice option when selecting food so make sure you make a comment on the order for spicy (I did and the food was spicy enough for me - I used to live in Thailand so I know/like Thai spicy).\n\nThe price was pretty good too so I will definitely be ordering from here again :)", "rating": 4, "date": "2018-06-22"}, {"excerpts": ["We ordered the vegetarian fresh rolls, green bean salad, and pad gra prow and all were great. ", "Wish I lived closer."], "author": "Janelle F.", "review": "Great food and service. Only downside (for me) is the location. We ordered the vegetarian fresh rolls, green bean salad, and pad gra prow and all were great. Wish I lived closer.", "rating": 4, "date": "2015-02-16"}, {"excerpts": ["Pad Gra Prow with chicken breast:  ", "Very large portion. "], "author": "Carrie S.", "review": "Portions are plentiful and prices are extremely reasonable. The food is fresh and yummy. \n\nWe ordered:\nShrimp Salad:  plenty of shrimp ... would have liked more cabbage and other veggies\n\nYellow Curry with Prawns:  Huge portion that included a green bell pepper or two (though that's not on the menu and I am not a fan of bell peppers); the curry is sweet, just the way I like it. \n\nPad Gra Prow with chicken breast:  Very large portion. I did not eat, but my dining partner liked the light garlic taste, plentiful portion, and combination of the dish in general\n\nThai Iced Tea:  Always a fan, but would have liked more tea and less cream.", "rating": 4, "date": "2009-08-08"}, {"excerpts": ["Try the Fried Calamari, Pad Thai, and Pad Gra Prow with Chicken. ", "Those are my favorites."], "author": "Darcy V.", "review": "Sri Thai is a fantastic, tiny little restaurant in the outer sunset. It serves some of the best Thai food in the city at reasonable prices. And they deliver! I can't even find another one that does. \n\nTry the Fried Calamari, Pad Thai, and Pad Gra Prow with Chicken. Those are my favorites.", "rating": 5, "date": "2008-06-08"}, {"excerpts": ["I always get the pad gra prow with tofu and thai samosas when I'm getting dinner, and grab veggie spring rolls and mango sticky rice as a snack on my way to the beach.  ", "Delivery and eat in service are always timely, and the people are friendly to boot."], "author": "sara b.", "review": "Delicious!  This is my default delivery place.  I would eat here every day if I could afford it.  It is a little on the pricey side, but worth every penny.  I always get the pad gra prow with tofu and thai samosas when I'm getting dinner, and grab veggie spring rolls and mango sticky rice as a snack on my way to the beach.  Delivery and eat in service are always timely, and the people are friendly to boot.", "rating": 5, "date": "2011-03-31"}], "pad prik king": [{"excerpts": ["Try the Pad Prik King (this is everyones favorite dish her place) or any of their lovely curries. ", "You can't go wrong. ", "A hidden gem!"], "author": "Eric H.", "review": "I found Sri Thai by chance, just browsing GrubHub for a Thai restaurant within delivery range of my girlfriend's house. The food there is SO DELICIOUS that it is now a regular choice. It was a big hit with all her friends, too. I have been called on THREE SEPARATE OCCASIONS (by THREE SEPARATE FRIENDS of hers), asking where I usually order my Thai food from, as they like it so much. If that's not a good sign, I don't know what is! Try the Pad Prik King (this is everyones favorite dish her place) or any of their lovely curries. You can't go wrong. A hidden gem!", "rating": 4, "date": "2013-12-23"}, {"excerpts": ["I found the pad prik king ", "ok ", "but there were way too many green beans and not enough chicken or bell peppers. "], "author": "Chili B.", "review": "The rainbow salad was great. The samosas were really small and just ok. I wouldn't order them again.\n\nI found the pad prik king ok but there were way too many green beans and not enough chicken or bell peppers. I wouldn't order this again. \n\nThe pad himapan was excellent - very flavorful with the crispy chicken. Yummy. Ordering it togo isn't nearly as good though.\n\nThe pla jien was cooked perfectly - it was good, not excellent.\n\nThe spicy fried noodles weren't spicy enough!!!! The flavor was good but where's the spice?\n\nThe pad se ew was good but pretty average.\n\nThe grilled chicken was good, it was very tender and had nice flavor.\n\nThis place is tiny inside. Overall pretty good. Friendly service and consistent quality.", "rating": 4, "date": "2009-10-31"}, {"excerpts": ["The pad Prik King with tofu was still yummy ", "but it got overlooked in the end by the novelty of the crispy duck.\n", "Service as always was warm and efficient. ", "And i would recommend you try their jasmine tea - aromatic, flavorful and extremely soothing."], "author": "Frances G.", "review": "This is our default dinner place when at the end of the day we just want good comfort food without the hassle of driving around looking for a good place to eat. We're asians, so any cuisine with rice qualifies as comfort food lol\nSeriously, this place has low key elegance and a simply quality that's very soothing. The food is well made with no unnecessary frills. \nThey have different specials every now and then and this time we tried the spicy crispy duck with basil and it turned out to be the bomb! fried to a crisp with out  losing the duck flavor and all covered in basil and spices. Like duck chicharon! Needless to say we finished the whole dish and ate more rice than we needed to but i told myself that it was worth it. The pad Prik King with tofu was still yummy but it got overlooked in the end by the novelty of the crispy duck.\nService as always was warm and efficient. And i would recommend you try their jasmine tea - aromatic, flavorful and extremely soothing.", "rating": 4, "date": "2011-06-10"}, {"excerpts": ["The pumpkin is amazing as is the pad prik king and himapan and the pad se-ew and the spicy fried noodle ", "and... ", "Plus they deliver and the prices are fairly cheap.  ", "Sure the pad thai may not be the best ever but then again", ", where is it ever the best ever.  ", "Pad thai is often eaten, rarely perfected.  ", "So Sri gets five stars"], "author": "David V.", "review": "I have to say that I've eaten a lot of thai in my life.  I may not have been to a million Thai restaurants, but of the twenty or so I've patroned I've gone a lot and eaten the shit out of the menu.  In my honest opinion, Sri thai is the second best thai place I've ever eaten at (1 is Thai Tom's in Seattle).  The food here is so damn good I can't stop eating it.  The pumpkin is amazing as is the pad prik king and himapan and the pad se-ew and the spicy fried noodle and... Plus they deliver and the prices are fairly cheap.  Sure the pad thai may not be the best ever but then again, where is it ever the best ever.  Pad thai is often eaten, rarely perfected.  So Sri gets five stars", "rating": 5, "date": "2008-07-15"}], "pad himapan": [{"excerpts": ["Pad Himapan chicken is one of my favorite meals. ", "I've ordered & devoured it for 15+ years.  ", "It was there when I first moved into the neighborhood.  ", "It was THE dish. ", "It was the stay at home, order takeout, and rent a movie dish.  ", "It was what I craved when I was pregnant.  ", "It was the, \"take my son out to eat lunch on a Saturday afternoon dish.", "\" "], "author": "Pisces G.", "review": "Dont you hate it when one of your favorite entrees isn't being cooked liked how it use to be?  Pad Himapan chicken is one of my favorite meals. I've ordered & devoured it for 15+ years.  It was there when I first moved into the neighborhood.  It was THE dish. It was the stay at home, order takeout, and rent a movie dish.  It was what I craved when I was pregnant.  It was the, \"take my son out to eat lunch on a Saturday afternoon dish.\" It has been a consistent in my life.  \n\nUnfortunately, as the years have gone by the dish has changed.  I know I must sound like a crazy person.   The potions have gotten smaller and smaller.  The bell peppers cut into huge slices and huge green onions thrown on top serving no real purpose. (Make the portion look bigger?) Sigh.  The chicken & sauce are still awesome, but alas the veggie portion needs some help.  My family rarely orders from Sri Thai anymore because we know how it use to be.  The grilled chicken entree was once big enough for 2 adults and a kid. We use to order once a week and even received Christmas cards from them.  I LOVE supporting my local restaurants and will probably still order from them certain dishes.  The Wo Sen soup is excellent when you are sick , and my son lives their sticky rice with mango.  \n\nI guess just like everything else in this city, change is inevitable.  Here I am waxing nostalgic about a dish.", "rating": 3, "date": "2016-07-10"}, {"excerpts": ["Our standard favorites are the Pad Himapan Chicken or shrimp.  ", "Tried this dish at other thai places and nobody makes it like them.  ", "Everyone else just does a quick stir fry with cashews but this place batters the chicken/shrimp ", "so they have a slightly crunchy texture.  ", "Love it!   "], "author": "Regina V.", "review": "My family orders at least once a week from Sri Thai.  In fact we get Christmas cards from them...  Been eating here for at least seven years.  Our standard favorites are the Pad Himapan Chicken or shrimp.  Tried this dish at other thai places and nobody makes it like them.  Everyone else just does a quick stir fry with cashews but this place batters the chicken/shrimp so they have a slightly crunchy texture.  Love it!   Sadly, over the years the portion sizes have gone down, but alas, nobody makes it like them!\n\nCan't go wrong with their pad thai, and the YUMMY samosas made with sweet potatos.  If I could only get their recipe!  My four year old loves the samosas.  When I'm sick I usually order their Wo Sen soup (its a clear broth with noodles, tofu, veggies)   \n\nMy husband has been addicted to their satay for years, but we stopped ordering it when we realized the grilled chicken entree was basically the same thing (not on a stick of course) but you get a larger portion for a little bit more money.  You just need to have some peanut sauce to go with it.\n\nExcellent fast service!", "rating": 4, "date": "2011-09-02"}, {"excerpts": ["The pad himapan was excellent - very flavorful with the crispy chicken. ", "Yummy. "], "author": "Chili B.", "review": "The rainbow salad was great. The samosas were really small and just ok. I wouldn't order them again.\n\nI found the pad prik king ok but there were way too many green beans and not enough chicken or bell peppers. I wouldn't order this again. \n\nThe pad himapan was excellent - very flavorful with the crispy chicken. Yummy. Ordering it togo isn't nearly as good though.\n\nThe pla jien was cooked perfectly - it was good, not excellent.\n\nThe spicy fried noodles weren't spicy enough!!!! The flavor was good but where's the spice?\n\nThe pad se ew was good but pretty average.\n\nThe grilled chicken was good, it was very tender and had nice flavor.\n\nThis place is tiny inside. Overall pretty good. Friendly service and consistent quality.", "rating": 4, "date": "2009-10-31"}, {"excerpts": ["Don't rate this place until you try the Pad Himapan with Crispy Chicken.  ", "It's fantastic.  ", "The service is always great, this is an outer sunset gem."], "author": "Dan S.", "review": "Don't rate this place until you try the Pad Himapan with Crispy Chicken.  It's fantastic.  The service is always great, this is an outer sunset gem.", "rating": 5, "date": "2008-11-20"}, {"excerpts": ["The Pad Himapan with chicken is to die for. ", "Nicest servers, ever. ", "A best kept secret for those of us proud to be westsiiiiiiiiiiiiiiiiiiiiiiiiiiiide."], "author": "Cake M.", "review": "My absolute favorite Thai place in the City. When I left SF after 18 years this was at the top of my list of things I knew I'd miss, and I do - whenever I'm in town or blowing through it, I stop here. The Pad Himapan with chicken is to die for. Nicest servers, ever. A best kept secret for those of us proud to be westsiiiiiiiiiiiiiiiiiiiiiiiiiiiide.", "rating": 5, "date": "2009-06-16"}, {"excerpts": ["My  usuals are red curry w/ shrimp or chicken, tom kha w/ chicken, and pad himapan."], "author": "Jeanne L.", "review": "My hands down favorite thai restaurant in the city.  Just finished my dinner from there and knew I had to spread the word about this hidden gem.  My  usuals are red curry w/ shrimp or chicken, tom kha w/ chicken, and pad himapan.", "rating": 4, "date": "2008-09-21"}, {"excerpts": ["I can't get enough of the Pad Himapan with crispy prawns!  ", "Also, the fresh rolls are great...", "but I do not care for the dipping sauce.  "], "author": "Katie N.", "review": "I love this place!  My husband does not eat thai food, so every time he goes out for the night I get delivery!!  I can't get enough of the Pad Himapan with crispy prawns!  Also, the fresh rolls are great...but I do not care for the dipping sauce.  I was hooked on the pa naeng curry for a while.  Also, really enjoy the spring roll!  The tom kha soup is flavorful, but the chicken can be a bit dry.  I have never had anything bad here!  Thanks for the great food and super fast delivery!!!", "rating": 4, "date": "2009-07-24"}], "pad king sod": [], "pad eggplant": [{"excerpts": ["My go to Pad Eggplant was perfect.  ", "Portions are a bit small, but prices are cheap.  ", "I might just start ordering takeout here from now on."], "author": "Karen L.", "review": "Good thai food.  This is a small place located on Lincoln Way.  \n\nEverything we ordered was tasty.  My go to Pad Eggplant was perfect.  Portions are a bit small, but prices are cheap.  I might just start ordering takeout here from now on.", "rating": 5, "date": "2016-10-25"}, {"excerpts": ["Anyway, I ordered the Pad Eggplant with Tofu and the Fresh Roll with no egg. ", "Food came in about 50 minutes (a little long, but I'm also pretty impatient). ", "Pad Eggplant was delicious! ", "I often get this at Thai places ", "and it's super oily, so I made sure to request light oil. ", "This one was not too oily, the tofu was lightly fried but not greasy, and the peppers and onions were nice and crisp. ", "The Fresh Roll was good, but I would've liked more veggies in it. ", "I got it without egg, so there was lettuce, tofu, cucumber, cilantro, and bean sprouts. ", "It comes with a very good dipping sauce though. ", "All in all, good experience. ", "Good food, good prices...would recommend and will be ordering from here again!"], "author": "Daniele D.", "review": "So I ordered some food for delivery from Soi Gow on 9th and Judah. When it arrived, I looked at the receipt and it said \"Sri Thai Cuisine\". I was a little confused, but I'm assuming they're under the same management and Sri Thai is closer to my house for delivery. \n\nAnyway, I ordered the Pad Eggplant with Tofu and the Fresh Roll with no egg. Food came in about 50 minutes (a little long, but I'm also pretty impatient). Pad Eggplant was delicious! I often get this at Thai places and it's super oily, so I made sure to request light oil. This one was not too oily, the tofu was lightly fried but not greasy, and the peppers and onions were nice and crisp. The Fresh Roll was good, but I would've liked more veggies in it. I got it without egg, so there was lettuce, tofu, cucumber, cilantro, and bean sprouts. It comes with a very good dipping sauce though. All in all, good experience. Good food, good prices...would recommend and will be ordering from here again!", "rating": 4, "date": "2010-05-02"}, {"excerpts": ["We ordered right away, green curry, pad eggplant, and thai iced tea. ", "The food came out in a reasonable amount of time, but they brought out the wrong thing. ", "I asked the waiter if this was pad eggplant and he looked at me and said something else (couldn't understand). ", "And then he took it away. ", "I felt bad that I guess he didn't understand me the first time, but I didn't want what was brought out. \n", "The curry tasted alright, my friend noted the colorlessness of the curry, stating \"it's not very green\". ", "The pad eggplant was cooked well but was  bit bland and could have used some more seasoning. \n", "Me and my friend's water didn't get refilled except at the end of the dinner when they brought the check and only after my friend pushed the glass to the edge of the table. \n", "Not super attentive, food was mediocre. ", "I probably won't come back here again, even though it's close to home."], "author": "Christine Y.", "review": "I live pretty close to this place and pass by it often. It looks kinda of sketchy from the outside, but I wanted to give it a shot since I was craving green curry. \nMy friend and I went in for an early dinner around 5pm on saturday. The place was completely empty so I thought it would be pretty fast and attentive service. We ordered right away, green curry, pad eggplant, and thai iced tea. The food came out in a reasonable amount of time, but they brought out the wrong thing. I asked the waiter if this was pad eggplant and he looked at me and said something else (couldn't understand). And then he took it away. I felt bad that I guess he didn't understand me the first time, but I didn't want what was brought out. \nThe curry tasted alright, my friend noted the colorlessness of the curry, stating \"it's not very green\". The pad eggplant was cooked well but was  bit bland and could have used some more seasoning. \nMe and my friend's water didn't get refilled except at the end of the dinner when they brought the check and only after my friend pushed the glass to the edge of the table. \nNot super attentive, food was mediocre. I probably won't come back here again, even though it's close to home.", "rating": 3, "date": "2009-05-17"}], "garlic pepper": [{"excerpts": ["its a regular staple in our house- tom kha soup and the garlic pepper tofu! ", "the service is great when you dine in and the delivery is super fast when you order!"], "author": "Nicole N.", "review": "we love sri thai! its a regular staple in our house- tom kha soup and the garlic pepper tofu! the service is great when you dine in and the delivery is super fast when you order!", "rating": 5, "date": "2015-12-19"}], "pad broccoli": [{"excerpts": ["and I love an odd mix of things like the pesto potstickers, prawn salad, green bean salad, veggie fried rice, pad broccoli and the pad pak. "], "author": "Karen N.", "review": "This is my husband and I's go to Thai take out place. We have been going to this place for 6 years. \n\nWe both love the chicken tom kha, he loves the green chicken curry and I love an odd mix of things like the pesto potstickers, prawn salad, green bean salad, veggie fried rice, pad broccoli and the pad pak. I don't think I have ever ordered something I did not like.\n\nWe have never had a bad meal here, and IMO that says a lot.", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["I think we had the Pad Broccoli, Spicy Fried Snapper, and Pad Thai.  ", "The broccoli was pretty average for a broccoli dish.  ", "The snapper wasn't spicy at all, so it was actually pretty tasty.  ", "And the Pad Thai was okay.  ", "I was a little hesitant because it was very monocolor when it arrived.  ", "Just very brown and bland looking.  ", "I think the way a dish looks definitely has something to do with how it tastes."], "author": "Kris L.", "review": "I was actually surprised that I liked this place.  I was in the mood for some Thai food after A mentioned (probably not seriously, but he totally put the thought in my head for the rest of the day) that he wanted to snack on some Pad Thai.  So I was really craving some Pad Thai.  We stopped by Marnee Thai on 9th & Irving, but there was a wait and we were hungry so we hopped in the car and came here.  I've seen this place sooo many times, but it doesn't look very attractive from the outside.  It looks a lot better on the inside.  It was actually quite full too.  Just a couple of empty tables - one of which we soon occupied.\n\nEverything was really quick.  I think we had the Pad Broccoli, Spicy Fried Snapper, and Pad Thai.  The broccoli was pretty average for a broccoli dish.  The snapper wasn't spicy at all, so it was actually pretty tasty.  And the Pad Thai was okay.  I was a little hesitant because it was very monocolor when it arrived.  Just very brown and bland looking.  I think the way a dish looks definitely has something to do with how it tastes.", "rating": 3, "date": "2009-09-29"}], "pad woon sen": [], "pad pak": [{"excerpts": ["and I love an odd mix of things like the pesto potstickers, prawn salad, green bean salad, veggie fried rice, pad broccoli and the pad pak. "], "author": "Karen N.", "review": "This is my husband and I's go to Thai take out place. We have been going to this place for 6 years. \n\nWe both love the chicken tom kha, he loves the green chicken curry and I love an odd mix of things like the pesto potstickers, prawn salad, green bean salad, veggie fried rice, pad broccoli and the pad pak. I don't think I have ever ordered something I did not like.\n\nWe have never had a bad meal here, and IMO that says a lot.", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["Our favorites are their Fresh Vegetarian Rolls, Pra-Ram Pork, Pad Thai w/prawns, Pad Pak w/chicken or pork, Papaya salad, Sa-tay Chicken Appetizer, Pineapple Fried Rice w/pork.  "], "author": "Nina D.", "review": "We've dined here regularly last 6 - 7 years (only for dinner) and also order take out from time to time.  We can walk to this Outer Sunset location, which is a nice bonus.\n\nTheir dining room is cozy, tastefully decorated with muted colors. Thai music plays softly in the background, complimenting the warm lighting.  We've received consistently good and attentive service every time.  Take out has been timely (usually sooner than time quoted) and order always accurate.\n\nOur favorites are their Fresh Vegetarian Rolls, Pra-Ram Pork, Pad Thai w/prawns, Pad Pak w/chicken or pork, Papaya salad, Sa-tay Chicken Appetizer, Pineapple Fried Rice w/pork.  And, while not extensive, they offer a decent wine selection at reasonable prices.\n\nI hesitate giving 5 stars, as while I'm no Thai food expert, I do believe there are other Thai restaurants in the city that offer a bit more interesting and varied Thai cuisine.  However, Sri Thai is a neighborhood gem and nice dining venue, with reasonable prices for food and beverage.", "rating": 4, "date": "2016-07-30"}, {"excerpts": ["My favorites are the pineapple friend rice, pad pak, cashew nut chicken, and crispy chicken fried rice."], "author": "Alice F.", "review": "Great spot for yummy Thai food! I suggest eating there because it's really charming and staff is great. My favorites are the pineapple friend rice, pad pak, cashew nut chicken, and crispy chicken fried rice.", "rating": 4, "date": "2014-07-24"}], "salmon eggplant": [{"excerpts": ["We also ordered the salmon eggplant which we found to also be tasteless. "], "author": "K A.", "review": "This place is the worst and i eat Thai food in San Francisco, the Peninsula, and I've eaten it in Thailand and this place wins absolutely hands down as the worst Thai restaurant I've every been to. We came here hungry and ready to chow down. \n\nTo start off  with the waitress was unfriendly and smiled only once when we were leaving. She also didn't check with us during our meal to see if the food was okay. Basically she sat us down, took our order, brought us what we ordered, and then the check all without making eye contact or a smile. \n\nSo we started off with the veggie spring rolls which were cold as if they were cooked ahead of time,  We also ordered the green curry with tofu. We thought the green curry was really watered down. We also ordered the pad se-ew flavorless. We also ordered the salmon eggplant which we found to also be tasteless. We also ordered sticky rice which tasted like it was overly microwaved which dried out the rice. \n\nOverall, I found the service unfriendly, and the food lacking flavor and taste. If you want good Thai food DON'T stop here.", "rating": 1, "date": "2015-05-25"}], "tamarind duck": [{"excerpts": ["Then we order Pow Gra Prow with chicken and tamarind Duck. ", "The Tom Yum was quite sour, there wasn't no spice to it. ", "Suppose to be spicy and sour ", "but we both tasted the sourness. ", "The Pow Gra Prow chicken was quite bland, once again not spicy. ", "The Tamarind Duck was the only one that tasted decent. "], "author": "Thanh T.", "review": "Me and my friend stop by here since she love Thai food and we were in th City. Read a lot of good reviews so we decided to give this place a try. Place is not hard to find, just off of Lincoln near Ocean Beach. It's an average size with decor to make it feel quite cozy. \n\nWe saw a lot of people recommended the Tom Yum with chicken, so we order that soup for starter. Then we order Pow Gra Prow with chicken and tamarind Duck. The Tom Yum was quite sour, there wasn't no spice to it. Suppose to be spicy and sour but we both tasted the sourness. The Pow Gra Prow chicken was quite bland, once again not spicy. The Tamarind Duck was the only one that tasted decent. You can't go wrong with roasted duck, but the sauce make the roasted duck easy to eat without getting sick of it. \n\nThe service was pretty good, they came by to refill our water and ask for what we need. They even scoop the rice into little bowl for us in the beginning. We came to a conclusion that this Thai restaurant cater to American people. There was no chop sticks on the utensil set, the food was plain and not spicy. You seriously can't eat Thai food without it being spicy or else it wouldn't taste good. There's too many other places out there and I wouldn't come back here again.", "rating": 2, "date": "2009-07-06"}, {"excerpts": ["My favorites are the pumpkin curry, pa neang curry, tamarind duck, fresh rolls (with crab meat and veggies) and of course fried bananas. \n", "\"The Best Curry Dishes\""], "author": "Jorge B.", "review": "This is my favorite Thai restaurant. You can't go wrong with anything you order from Sri Thai. In my opinion, they have the best curry dishes. The staff is very friendly and prices are reasonable. Plus, you have to like a restaurant that post it's mission statement (by the door). My favorites are the pumpkin curry, pa neang curry, tamarind duck, fresh rolls (with crab meat and veggies) and of course fried bananas. \n\"The Best Curry Dishes\"", "rating": 5, "date": "2009-03-07"}, {"excerpts": ["We loved the pumpkin curry and tamarind duck, and their peanut sauce is just scrumptious. ", "Servers were pleasant, and the prices were reasonable (about $8-9/dish). ", "They even offer free deliveries on orders $15+, and you get free fried bananas with honey, too. ", "On orders $25+, you get free spring rolls. ", "This place is perfect for a lazy night in."], "author": "Lillian L.", "review": "Cute little place with a relaxed ambiance and great food. We loved the pumpkin curry and tamarind duck, and their peanut sauce is just scrumptious. Servers were pleasant, and the prices were reasonable (about $8-9/dish). They even offer free deliveries on orders $15+, and you get free fried bananas with honey, too. On orders $25+, you get free spring rolls. This place is perfect for a lazy night in.", "rating": 4, "date": "2007-08-16"}, {"excerpts": ["the Tamarind duck was pleasantly savory and not too spicy or tart. ", "Pad se-ew is also a good dish here with sweet soy and egg. ", "and for the vegan, curry pumpkin! ", "it's listed in the menu as red curry, but for the mild curry fans you can special order the pumpkin with yellow (mellow) curry. ", "I'm glad I finally checked out this spot after driving by it so many times."], "author": "Jeff W.", "review": "yummy Thai selections in a outer Sunset hidden location. a pleasant appetizer special today was the shrimp lettuce cups with roasted peanuts, minced ginger, lime juice, basil, garlic, with plum sauce. the Tamarind duck was pleasantly savory and not too spicy or tart. Pad se-ew is also a good dish here with sweet soy and egg. and for the vegan, curry pumpkin! it's listed in the menu as red curry, but for the mild curry fans you can special order the pumpkin with yellow (mellow) curry. I'm glad I finally checked out this spot after driving by it so many times.", "rating": 4, "date": "2007-02-11"}], "spicy crispy duck": [{"excerpts": ["My boyfriend and my personal favorites are the Pad Kee Mao which has the perfect about of spice, and the Duck Curry and the Spicy Crispy Duck. ", "It may be way out here in the outerlands of the city, but you won't be disappointed!"], "author": "Caitlin C.", "review": "I love this place! Right around the corner and never a disappointment. They always give the best service, everyone that works here is so sweet and their food is amazing. My boyfriend and my personal favorites are the Pad Kee Mao which has the perfect about of spice, and the Duck Curry and the Spicy Crispy Duck. It may be way out here in the outerlands of the city, but you won't be disappointed!", "rating": 5, "date": "2016-11-12"}, {"excerpts": ["I've tried a few different entrees, and have settled on the Spicy Crispy Duck as the best - it's delicious! ", "Also, there's rarely a wait to be seated and the staff are extremely friendly and warm. ", "I would highly recommend this spot and my favorite entree to others. ", "Spicy Crispy Duck!"], "author": "adam m.", "review": "Sri Thai is consistently great - awesome. I've tried a few different entrees, and have settled on the Spicy Crispy Duck as the best - it's delicious! Also, there's rarely a wait to be seated and the staff are extremely friendly and warm. I would highly recommend this spot and my favorite entree to others. Spicy Crispy Duck!", "rating": 5, "date": "2016-01-13"}, {"excerpts": ["They have different specials every now and then and this time we tried the spicy crispy duck with basil and it turned out to be the bomb! ", "fried to a crisp with out  losing the duck flavor and all covered in basil and spices. ", "Like duck chicharon! ", "Needless to say we finished the whole dish and ate more rice than we needed to ", "but i told myself that it was worth it. "], "author": "Frances G.", "review": "This is our default dinner place when at the end of the day we just want good comfort food without the hassle of driving around looking for a good place to eat. We're asians, so any cuisine with rice qualifies as comfort food lol\nSeriously, this place has low key elegance and a simply quality that's very soothing. The food is well made with no unnecessary frills. \nThey have different specials every now and then and this time we tried the spicy crispy duck with basil and it turned out to be the bomb! fried to a crisp with out  losing the duck flavor and all covered in basil and spices. Like duck chicharon! Needless to say we finished the whole dish and ate more rice than we needed to but i told myself that it was worth it. The pad Prik King with tofu was still yummy but it got overlooked in the end by the novelty of the crispy duck.\nService as always was warm and efficient. And i would recommend you try their jasmine tea - aromatic, flavorful and extremely soothing.", "rating": 4, "date": "2011-06-10"}], "pla jien": [{"excerpts": ["The pla jien was cooked perfectly - "], "author": "Chili B.", "review": "The rainbow salad was great. The samosas were really small and just ok. I wouldn't order them again.\n\nI found the pad prik king ok but there were way too many green beans and not enough chicken or bell peppers. I wouldn't order this again. \n\nThe pad himapan was excellent - very flavorful with the crispy chicken. Yummy. Ordering it togo isn't nearly as good though.\n\nThe pla jien was cooked perfectly - it was good, not excellent.\n\nThe spicy fried noodles weren't spicy enough!!!! The flavor was good but where's the spice?\n\nThe pad se ew was good but pretty average.\n\nThe grilled chicken was good, it was very tender and had nice flavor.\n\nThis place is tiny inside. Overall pretty good. Friendly service and consistent quality.", "rating": 4, "date": "2009-10-31"}], "pla rad prik": [], "pad cha talay": [], "flavor fish": [], "fried rice": [{"excerpts": ["The food is alright, there is flavor, but most of the noodles and fried rice were a bit mushy. ", "Spicy dishes are not really that spicy, so if you want spice you need to ask for more."], "author": "Spencer H.", "review": "This is an okay Thai place. The service is fair. The menu is pretty extensive. The portions are a little on the smaller side, but the price reflects this. \n\nThe thing that is sneaky here is that they charge for a side of rice, when at other Thai places it is already included in the price of the entree....and there is no mention of this inclusion in the menu nor was it stated at ordering.\n\nThe food is alright, there is flavor, but most of the noodles and fried rice were a bit mushy. Spicy dishes are not really that spicy, so if you want spice you need to ask for more.", "rating": 3, "date": "2017-10-24"}, {"excerpts": ["Tasty fried rice with a big portion of crispy chickens. ", "The young female waitress is very attractive"], "author": "Sergio R.", "review": "Tasty fried rice with a big portion of crispy chickens. The young female waitress is very attractive", "rating": 5, "date": "2018-01-09"}, {"excerpts": ["Their fried rice with crispy chicken is really good too!"], "author": "Tiffany R.", "review": "This is my go-to place to get pad thai in the city! Their fried rice with crispy chicken is really good too!", "rating": 5, "date": "2018-02-24"}, {"excerpts": ["Highly Recommend the Pumpkin Curry and Pineapple Fried Rice With ", "Chicken Breast is Always a Favorite \n Only Downfall With This Restaurant is Limited Seating Capacity and Street Side Parking ", "Can Be A Challenge."], "author": "Gerry L.", "review": "Great Neighborhood Family Owned Restaurant \n Excellent Service and Food . Servers are Extremely Helpfull for those Unfamiliar with Thai Cuisine.  Highly Recommend the Pumpkin Curry and Pineapple Fried Rice With Chicken Breast is Always a Favorite \n Only Downfall With This Restaurant is Limited Seating Capacity and Street Side Parking Can Be A Challenge.", "rating": 5, "date": "2017-05-13"}, {"excerpts": ["and I love an odd mix of things like the pesto potstickers, prawn salad, green bean salad, veggie fried rice, pad broccoli and the pad pak. "], "author": "Karen N.", "review": "This is my husband and I's go to Thai take out place. We have been going to this place for 6 years. \n\nWe both love the chicken tom kha, he loves the green chicken curry and I love an odd mix of things like the pesto potstickers, prawn salad, green bean salad, veggie fried rice, pad broccoli and the pad pak. I don't think I have ever ordered something I did not like.\n\nWe have never had a bad meal here, and IMO that says a lot.", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["Our favorites are yellow curry chicken, the potstickers with green curry, fried rice and excellent thai iced coffee."], "author": "Kathleen D.", "review": "We order from Sri Thai once every couple weeks for delivery. The food is good and delivery is fast! Our favorites are yellow curry chicken, the potstickers with green curry, fried rice and excellent thai iced coffee.", "rating": 4, "date": "2017-07-24"}, {"excerpts": ["Chicken fried rice \n\nChoose Sri Thai the next time you have a hankering for Thai food, you won't regret it!"], "author": "Alexis O.", "review": "This is one of my favorite Thai places of all time. I live in the neighborhood and eat here at least once a week. Their service is AMAZING - I have never had a bad experience there. \n\nSome of my favorite dishes are: \n-Corn cake appetizer (deep fried and served with sweet sauce, YUM!) \n-Pad se ew \n-Pad Thai \n-Crispy Chicken fried rice \n\nChoose Sri Thai the next time you have a hankering for Thai food, you won't regret it!", "rating": 5, "date": "2017-10-01"}, {"excerpts": ["We ordered duck fried rice, chicken wings, papaya salad, Tom yum noodle soup and Thai ice tea. ", "Let's break it down:\n1. ", "According to the bf, the chicken wings was delicious. ", "It is saucier than normal places I've tried but the bf likes it like that. ", "I do not. ", "So it depends on people preferences.\n", "2. ", "Papaya salad and ", "Tom yum noodle soup was not sour or flavorable enough for my standard.\n", "3. ", "Duck fried rice was mediocre. ", "The duck was crispy at least.\n", "4. ", "Thai ice tea was satisfactory. "], "author": "Tu N.", "review": "Went here for the first time for a Saturday lunch cause it was close by house. Be aware that parking might be difficult as it is a tourist spot near the beach. We lucked out and found a spot.\n\nWe ordered duck fried rice, chicken wings, papaya salad, Tom yum noodle soup and Thai ice tea. Let's break it down:\n1. According to the bf, the chicken wings was delicious. It is saucier than normal places I've tried but the bf likes it like that. I do not. So it depends on people preferences.\n2. Papaya salad and Tom yum noodle soup was not sour or flavorable enough for my standard.\n3. Duck fried rice was mediocre. The duck was crispy at least.\n4. Thai ice tea was satisfactory. Bonus on the flower shaped straw.\n\nThe price was not too shabby so can't complain too much about the tasting of the food. Friendly service.", "rating": 3, "date": "2016-02-16"}, {"excerpts": ["Our favorites are their Fresh Vegetarian Rolls, Pra-Ram Pork, Pad Thai w/prawns, Pad Pak w/chicken or pork, Papaya salad, Sa-tay Chicken Appetizer, Pineapple Fried Rice w/pork.  "], "author": "Nina D.", "review": "We've dined here regularly last 6 - 7 years (only for dinner) and also order take out from time to time.  We can walk to this Outer Sunset location, which is a nice bonus.\n\nTheir dining room is cozy, tastefully decorated with muted colors. Thai music plays softly in the background, complimenting the warm lighting.  We've received consistently good and attentive service every time.  Take out has been timely (usually sooner than time quoted) and order always accurate.\n\nOur favorites are their Fresh Vegetarian Rolls, Pra-Ram Pork, Pad Thai w/prawns, Pad Pak w/chicken or pork, Papaya salad, Sa-tay Chicken Appetizer, Pineapple Fried Rice w/pork.  And, while not extensive, they offer a decent wine selection at reasonable prices.\n\nI hesitate giving 5 stars, as while I'm no Thai food expert, I do believe there are other Thai restaurants in the city that offer a bit more interesting and varied Thai cuisine.  However, Sri Thai is a neighborhood gem and nice dining venue, with reasonable prices for food and beverage.", "rating": 4, "date": "2016-07-30"}, {"excerpts": ["The only dishes I tried were the Tom Yum soup, fried rice, and the Thai tea, but if those are any indication of the quality of the rest of the menu then I'd recommend this joint to anyone in the area. \n\n"], "author": "Bob Q.", "review": "Lucked out and had Sri literally just around the corner from where I was staying for Outside Lands and I was really glad to have an alternative from festival food during the weekend.\n\nThe only dishes I tried were the Tom Yum soup, fried rice, and the Thai tea, but if those are any indication of the quality of the rest of the menu then I'd recommend this joint to anyone in the area. \n\nNicely done, Sri.", "rating": 4, "date": "2015-08-13"}, {"excerpts": ["The pad thai & fried chicken over fried rice were phenomenal! ", "New favorite Thai restaurant in NorCal (:"], "author": "Ehi I.", "review": "The pad thai & fried chicken over fried rice were phenomenal! New favorite Thai restaurant in NorCal (:", "rating": 5, "date": "2016-08-19"}, {"excerpts": ["Then came the pad see ew and the pineapple fried rice.  ", "Both were embarrassingly small portions.  ", "On top of that the pineapple fried rice was burnt.  ", "BURNT!  "], "author": "Eddie C.", "review": "I went to Sri Thai last night for dinner with my family and was extremely disappointed by their food.  None of the food that we had was very good or authentic. THE ONLY REASON I EVEN CONSIDERED THIS PLACE WAS BECAUSE IT HAD A 4 STAR RATING.  THANKS YELP!\n\nWe had two bowls of the the Tom Yum soup.  One with shrimp and one with chicken.  This is a very staple soup for a Thai place and should be an indicator of whether or not the food will be any good.  Well, this is when I first doubted the 4 star rating that this place has.\n\nThe soup was watery, bland, and overly sour.  I believe there were only a few pieces of chicken or shrimp in each bowl.  I was already put off that there were no family options for the soup, but the flavor and quality were sub par.\n\nMy Thai iced tea came after that.  This was more of a syrup than a drink.  It was extremely sweet, and when I asked if they could water it down with some tea, they only offered me hot tea.  This means that the Thai tea base was pre-mixed.  It just gets worse and worse doesn't it?\n\nNext up was the papaya salad.  This salad was just sad.  It came on a tiny plate, and if that wasn't enough, there was a bed of iceberg lettuce underneath it.  This was obviously a cost saving tactic.  The taste was also off as it wasn't spicy and definitely didn't have enough peanuts.\n\nThen came the pad see ew and the pineapple fried rice.  Both were embarrassingly small portions.  On top of that the pineapple fried rice was burnt.  BURNT!  There were specs of black in it.\n\nLast to come were the pumpkin curry and the green Thai curry.  Not much to say about either of these, except that I think they may have mixed up the sugar and the salt.  I know Thai curries are sweet, but these were practically deserts!  Also the pumpkin curry just tasted like a red curry with pumpkins in it.  If that were the case, it should of been listed as red curry, you can choose if you want pumpkin thrown in.\n\nI hope this makes you as disappointed as my stomach was last night.  Go to King of Thai instead.  You get the food quicker and it tastes better.", "rating": 1, "date": "2014-10-17"}, {"excerpts": ["Sri Thai has some of the best pad thai, pad see ew, and by far the best fried rice I've had in the city. ", "Oh, and the crispy chicken fried rice here is beyond godly."], "author": "Scott S.", "review": "I've been coming to Sri Thai on random occasions for the last three years due to the convenient fact that my friends live in the residential complex right next door (and by right next door I mean the next number down the street.)\n\nSri Thai has some of the best pad thai, pad see ew, and by far the best fried rice I've had in the city. My friend also testifies that the thai tea here (despite the fact that it's poured out of a pitcher into a Fabri-Kai plastic cup filled with ice) is laced with some sort of addictive crack.\n\nSri Thai also caters, making it the perfect metropolitan yet douché choice for birthday parties for your toddlers at Golden Gate Park.\n\nOh, and the crispy chicken fried rice here is beyond godly.", "rating": 4, "date": "2012-09-10"}, {"excerpts": ["Fried Rice with prawns (extra spicy) - ", "Ate some of this with the curry and some of this with sambal.  "], "author": "Elena N.", "review": "Ordered delivery from here earlier this month.  Delivery came in about an hour and was packed well.  Came with napkins and silverware.  Always a plus.  On to the food...\n\nSpring Roll (w/ Pork) - Wanted something fried so spring rolls seemed like the thing to order.  They were nice and crispy and very tasty!\n\nPapaya Salad (extra spicy) - I always order everything extra spicy so I'm glad this was actually spicy!\n\nPad Thai with chicken (extra spicy) - A little on the bland side.  Wasn't as spicy as the papaya salad which was a little disappointing.  I like a little heat in my thai food is you can't tell. Hehe!\n\nGreen Curry with beef (extra spicy) - Again a little bland.  But it was a good size and had a good amount of meat and veggies.\n\nFried Rice with prawns (extra spicy) - Ate some of this with the curry and some of this with sambal.  By itself it was nothing to write home about, but I did enjoy eating this with the curry.\n\nAll in all an okay experience.  I liked that they made most of the dishes extra spicy cuz I like my thai food spicy, but other than that most of the food was just average.", "rating": 3, "date": "2011-12-31"}, {"excerpts": ["My friend order fried chicken over thai fried rice and I was a bit envious of his choice. ", "Usually the fried rice that comes with the fried chicken is pretty basic, but damn it was good. ", "Enough to make me want to order it on its own without the chicken. ", "I myself ordered the pepper and garlic pork and it was gone shortly after it touched the table. ", "I might have left 2-3 grains of rice which I usually would clean up but was too lazy from a stomach full of food, portions are appropriate for a hungry man. ", "And it was cheap. ", "Most dishes under 9. ", "Decor was lovely, dark and warm, like most thai places I'm akin to. ", "They dress up their place a little more than usual with the waitresses in very traditional looking dresses. ", "Close to the beach so there's plenty of parking. ", "How nice to walk on the beach to your car after dinner? ", "I bike ", "but, how nice anyways. ", "Will def go back."], "author": "Elton F.", "review": "Surprisingly good thai food. I hate going to a thai restaurant that serves subtle flavor, I think we can all agree that subtle thai food is an oxymoron. My friend order fried chicken over thai fried rice and I was a bit envious of his choice. Usually the fried rice that comes with the fried chicken is pretty basic, but damn it was good. Enough to make me want to order it on its own without the chicken. I myself ordered the pepper and garlic pork and it was gone shortly after it touched the table. I might have left 2-3 grains of rice which I usually would clean up but was too lazy from a stomach full of food, portions are appropriate for a hungry man. And it was cheap. Most dishes under 9. Decor was lovely, dark and warm, like most thai places I'm akin to. They dress up their place a little more than usual with the waitresses in very traditional looking dresses. Close to the beach so there's plenty of parking. How nice to walk on the beach to your car after dinner? I bike but, how nice anyways. Will def go back.", "rating": 4, "date": "2015-07-23"}, {"excerpts": ["Fairly decent Thai Food, the Pineapple Fried Rice, Pad Thai and Chicken Satay were awesome!\n", "I usually do take out, except on weekends it is much better to order and pick it up...."], "author": "Mo D.", "review": "Fairly decent Thai Food, the Pineapple Fried Rice, Pad Thai and Chicken Satay were awesome!\nI usually do take out, except on weekends it is much better to order and pick it up....", "rating": 4, "date": "2013-06-21"}, {"excerpts": ["Some of the best dishes are: the crispy chicken fried rice, the spicy fried noodles, the lemongrass soup, and the woon sen soup. \n\n"], "author": "Alex F.", "review": "INCREDIBLE Thai food. SRI Thai is better than Marni Thai for sure.\n\nI lived in San Francisco for four years and did not find a better Thai place. The service is fantastic (I was a regular, every time I came in with my roommates/boyfriend/parents they knew our order including drinks. Nothing is too much trouble for them, and they really make you feel appreciated as a guest in their restaurant.\n\nSome of the best dishes are: the crispy chicken fried rice, the spicy fried noodles, the lemongrass soup, and the woon sen soup. \n\nI ate here for family visits, birthdays, graduation dinner, etc,...\n\nArguably the best Thai food in San Francisco.", "rating": 5, "date": "2014-03-19"}, {"excerpts": ["We got the chicken fried rice, curry chicken and spring rolls. ", "Everything tasted awesome. ", "I highly recommend this place."], "author": "Richard J.", "review": "Amazing Thai food. My family went here tonight and had some of the best Thai. We got the chicken fried rice, curry chicken and spring rolls. Everything tasted awesome. I highly recommend this place.", "rating": 5, "date": "2015-06-23"}, {"excerpts": ["PINEAPPLE FRIED RICE\negg, raisin, cashew nut, onion.\n\n"], "author": "Oliver D.", "review": "This place is situated alongside Golden Gate Park in the Sunset Neighborhood and is built around a duplex and apartment complex. Please don't judge a book by its cover because this place is as AUTHENTIC as Thai food can get in the area! \n\nThe staff is dressed in traditional attire and their hospitality is tremendously genuine! All the waitresses are patient, so please return the favor! It might be hard for you to understand them because English is their second language, so be nice!\n\nTheir Chicken Pad Thai is YUM! and their Curry is to die for! So much FLAVOR! especially the next day for take out.  \n\nMy Favorite dishes at Sri Thai:\n\nYELLOW CURRY\nin coconut milk w/ potato, carrot and onion.\n\nMAS SAMUN CURRY\nin coconut milk w/ tamarind sauce roasted peanut, potato, carrot.\n\nSPICY FRIED SNAPPER\nDeep-fried snapper fillet; topped w/ spicy red curry sauce, green bean, onions, bell pepper, and sweet basil.\n\nPINEAPPLE FRIED RICE\negg, raisin, cashew nut, onion.\n\nTHAI ICED TEA!", "rating": 3, "date": "2009-11-05"}, {"excerpts": ["We had grilled chicken, pineapple fried rice, and  a chicken curry dish with brown rice.  ", "Everything was simple and delicious. ", "Not overly seasoned or overly decorated.  ", "The coconut ice cream was\ndelicious too!  ", "Now we have a nice local spot to hit for Thai. ", "They also have free delivery!"], "author": "Cyrex G.", "review": "Been passing by here for awhile now and finally went in to check it out. Had dinner with my gf and we were both pleasantly surprised. Very friendly staff and a comfy setting. We had grilled chicken, pineapple fried rice, and  a chicken curry dish with brown rice.  Everything was simple and delicious. Not overly seasoned or overly decorated.  The coconut ice cream was\ndelicious too!  Now we have a nice local spot to hit for Thai. They also have free delivery!", "rating": 4, "date": "2012-08-08"}, {"excerpts": ["The pineapple fried rice was burned and tasted cheap. "], "author": "Dave N.", "review": "Perhaps they were having an off night, but Sri Thai is unworthy of a 4 star yelp review. The service was quick and friendly, and the restaurant was cozy and clean. But all the ambiance cant make up for bad food. Fresh rolls were bland and flavorless. The pineapple fried rice was burned and tasted cheap. The shrimp pad thai was DOUSED in a vinegar sauce that was hardly edible.\n\nCheap eats, but much better to be had just a short drive up Lincoln or Irving.\n\nI'd pass on Sri Thai.", "rating": 2, "date": "2011-10-06"}, {"excerpts": ["Do not walk out of this restaurant without trying the pineapple fried rice, AND ........ you MUST order the fried mango with sweet sticky rice for dessert. ", "I cannot emphasize this enough. ", "Don't question me. "], "author": "Rory O.", "review": "Excellent Thai food at reasonable prices, but listen to me.......come here.......get closer......closer.......no, closer.......ok, that's close enough.\n\nDo not walk out of this restaurant without trying the pineapple fried rice, AND ........ you MUST order the fried mango with sweet sticky rice for dessert. I cannot emphasize this enough. Don't question me. Just do it.\n\nLoved the decor inside and service was outstanding.", "rating": 4, "date": "2010-08-26"}, {"excerpts": ["The pineapple fried rice was excellent as well.  "], "author": "Jenny L.", "review": "05.18.10\n\nI have to admit it's kind of weird when you're one of the only patrons of a restaurant.  Especially when I didn't expect it.\n\nYou would think servers would be more attentive, but I felt like an ugly stepchild casted aside to the corner.\n\nThe tom-kha soup was really, really good.  Creamy, full of flavor, lots of mushrooms and shrimp.\n\nThe pineapple fried rice was excellent as well.  I almost wished I had been the one who suggested that dish.\n\nInstead, I wanted the spicy fried noodles.  Except it was spicy.  And didn't look fried.  I think they gave me pad thai instead.  Fun times...\n\nWill give it another try if I'm ever by the beach, but definitely not worth the drive out for...", "rating": 3, "date": "2010-05-21"}, {"excerpts": ["Pad See Ew with beef and Pineapple Fried Rice. ", "The delivery was super fast, very happy about that! ", "My ", "Pad See ", "Ew was soggy and the portion size was really small", ", what was that about? ", "The beef tasted kinda weird, I wasn't sure if it was spoiled or just bad quality meat. ", "There were pieces I literally chewed 30 times because it was so tough! ", "And some pieces just tasted funny, hmm...", "I'll find out later tonight if I get sick. ", "The Chicken Pineapple Fried Rice was average. ", "Kinda bummed, haven't been there in a while ", "I wonder if they changed cooks or owner."], "author": "Karen T.", "review": "Ok I need to minus a star. I was starving and called them exactly at 5pm to order for delivery. Pad See Ew with beef and Pineapple Fried Rice. The delivery was super fast, very happy about that! My Pad See Ew was soggy and the portion size was really small, what was that about? The beef tasted kinda weird, I wasn't sure if it was spoiled or just bad quality meat. There were pieces I literally chewed 30 times because it was so tough! And some pieces just tasted funny, hmm...I'll find out later tonight if I get sick. The Chicken Pineapple Fried Rice was average. Kinda bummed, haven't been there in a while I wonder if they changed cooks or owner.", "rating": 3, "date": "2011-04-26"}, {"excerpts": ["Also got the fried rice, and theres too much stuff in it for me (i like my fried rice with a lot of rice and less other stuff, I wanna taste the rice and get that chewy texture).  ", "I kinda knew that going in with thai fried rices, but ordered it anyway.  ", "The flavor is good, but again, just way too much veggies and stuff for me."], "author": "Sage S.", "review": "Green curry is amazing.  Yes.  I think theyve found the perfect blend of sweetnness, creaminess, spicyness, and savory flavor.  It could be a little more spicy, but thats ok.  The taste is really really good.  And they give a lot, there was a ton of chicken in it, you could split it with someone, and its only like $7 or something.  \n\nThe thai samosas are bomb.  Also got the fried rice, and theres too much stuff in it for me (i like my fried rice with a lot of rice and less other stuff, I wanna taste the rice and get that chewy texture).  I kinda knew that going in with thai fried rices, but ordered it anyway.  The flavor is good, but again, just way too much veggies and stuff for me.", "rating": 4, "date": "2011-02-07"}, {"excerpts": ["We ordered a Fried Rice, Green Curry, and the Ribs.  ", "The ribs were quite good, although oily and fatty.   ", "They gave us 5 huge pieces, which for $10 is a great price.  ", "The green curry and the fried rice were both good.  ", "I love Mango Sticky Rice for dessert, but they sold out and did not have for the evening, which was quite a bummer.  "], "author": "Jannie Q.", "review": "This is really the oddest place to have a Thai restaurant.  We have driven by there gazillion of times but have never tried it. Finally, we went there for dinner.  \n\nWe got there a bit before 7p and got seated right away.  Then within 20 minutes, the entire place filled up.  I was curious whether these people lived around the neighborhood or were they visitors living in the nearby Great Highway Inn (?)  They seem to appear out of nowhere, and into this place that is really in the middle of nowhere.\n\nWe ordered a Fried Rice, Green Curry, and the Ribs.  The ribs were quite good, although oily and fatty.   They gave us 5 huge pieces, which for $10 is a great price.  The green curry and the fried rice were both good.  I love Mango Sticky Rice for dessert, but they sold out and did not have for the evening, which was quite a bummer.  We ended up with the fried banana ice cream instead.\n\nOverall, not bad.  Service was good.  Decor was decent.  Food was OK.  Nothing spectacular, but nothing bad either.  It's close to our house and is another Thai restauarnt alternative to King of Thai on Taraval.", "rating": 3, "date": "2008-10-04"}, {"excerpts": ["Great dishes:  the spicy noodles, the spicy chicken fried rice(!!!), and the kra pow gai.  \n\n"], "author": "Kevin G.", "review": "It's 2 blocks from Ocean Beach.  The food is delicious, and doesn't cost a mint.  The straw wrappers are twisted into teeny little roses!\n\nGreat dishes:  the spicy noodles, the spicy chicken fried rice(!!!), and the kra pow gai.  \n\nGood dish:  the paenang.  Service was good, too.  Overall, for the price (approx. $15/person) and the location, a great experience, one I look forward to repeating some time.", "rating": 4, "date": "2010-10-03"}, {"excerpts": ["I also had their crispy chicken fried rice, although it wasn't the best. ", "i still prefer it over the main chain restaurant flavoring. ", "I've gone back to order delivery several times already and each time it doesn't get old, IT GETS better!! ", "one of the better thai places in SF definitely!"], "author": "Amy T.", "review": "I don't know about the service, but the food here is definitely good! I love their green curry, and now I'm HOOKED! It's definitely good and the theres always a good amount of veg with a balance of whatever protein you choose. Not only is the green curry is good, the pad thai is just as great! I had pad thai before but their pad thai is doesn't stick together like King of Thai. I also had their crispy chicken fried rice, although it wasn't the best. i still prefer it over the main chain restaurant flavoring. I've gone back to order delivery several times already and each time it doesn't get old, IT GETS better!! one of the better thai places in SF definitely!", "rating": 5, "date": "2012-10-19"}, {"excerpts": ["Crispy chicken fried rice is unbelievable. ", "Thai iced tea is perfect. ", "Love all of their different types of curry as well. ", "Try the corn cakes too, served with a delicious slaw."], "author": "Christine H.", "review": "Lovvvve this place....I'm addicted. Crispy chicken fried rice is unbelievable. Thai iced tea is perfect. Love all of their different types of curry as well. Try the corn cakes too, served with a delicious slaw.", "rating": 5, "date": "2013-01-03"}, {"excerpts": ["Had the spicy fried snapper and veggie fried rice.  ", "Both were really good and the fried rice was pretty healthful, chock full of broccoli etc.  ", "Recommended!"], "author": "Daniel L.", "review": "Had the spicy fried snapper and veggie fried rice.  Both were really good and the fried rice was pretty healthful, chock full of broccoli etc.  Recommended!", "rating": 5, "date": "2015-02-05"}, {"excerpts": ["Fried Chicken Fried Rice...awesome.  ", "Don't be deceived, it comes with little katsu-type chicken on top.  \n", "2) ", "Grilled Chicken...", "great without the sauce, awesome with the sauce.\n", "3) ", "Pad Thai "], "author": "Joey H.", "review": "What a combination of dishes this place not only presents, but the variation of tastes and texture is awesome.  As the saying may go, places like these are a hit or miss.  From the number of stars, which is hardly the case in my sense, this is a hit...you sank my battleship hit.  The ambiance which really doesn't catch my fancy nowadays was good.  My back was faced the entirety of the place, but what I saw was cool.  Right across from Golden Gate Park, plenty of parking (got there around 8pm on a weekday), and the place was more than half packed.  Then you think, do Yelp reviews help restaurants...HECK YAH, it got me there, I hope you read this and say, I gotta try too!  \n\nAs for the food, we ordered three dishes.  \n1) Fried Chicken Fried Rice...awesome.  Don't be deceived, it comes with little katsu-type chicken on top.  \n2) Grilled Chicken...great without the sauce, awesome with the sauce.\n3) Pad Thai (Pork)...tasty, cooked well, and lots of it.  \n\nThis is one of the places that you drive by and know you want to try, but you just never go.  Well, there you go.", "rating": 5, "date": "2009-10-29"}, {"excerpts": ["**\nFried Chicken over fried rice with sweet and sour sauce on the side (too many carbs though...would eat this everyday if I didnt care about getting fat).\n\n"], "author": "Sheila S.", "review": "Great Thai restaurant in the sunset.  I used their online ordering system which is very convenient and my food arrived 20 minutes.  \n\nI ordered chicken pad thai for the first time here last time and it was delicious.  My favorite is the chicken pra ram (chicken with steamed vegetables and peanut sauce).\n\nOther great menu items:\nAppetizer -- Angel Wings\nSalmon and eggplant **\nFried Chicken over fried rice with sweet and sour sauce on the side (too many carbs though...would eat this everyday if I didnt care about getting fat).\n\nThey are very friendly and the delivery guy is always really nice to my husband (always remembers his name).  \n\nThey sent us a Christmas card one year too!", "rating": 5, "date": "2009-12-05"}, {"excerpts": ["My favorites are the pineapple friend rice, pad pak, cashew nut chicken, and crispy chicken fried rice."], "author": "Alice F.", "review": "Great spot for yummy Thai food! I suggest eating there because it's really charming and staff is great. My favorites are the pineapple friend rice, pad pak, cashew nut chicken, and crispy chicken fried rice.", "rating": 4, "date": "2014-07-24"}, {"excerpts": ["I had the fried rice with fried chicken. ", "Both lacked the greasiness that I usually associate with fried rice or fried chicken, but didn't lack in taste. ", "Nicely breaded, generous portions of chicken breast. ", "I wasn't disappointed at all and was satisfied after the meal. ", "This is the first time I was satisfied with Thai food."], "author": "Gerard Y.", "review": "Usually when I think of Thai food, I think of the restaurants found downtown that's usually greasy and gives you a food coma after finishing off the meal. No so at Sri. I had the fried rice with fried chicken. Both lacked the greasiness that I usually associate with fried rice or fried chicken, but didn't lack in taste. Nicely breaded, generous portions of chicken breast. I wasn't disappointed at all and was satisfied after the meal. This is the first time I was satisfied with Thai food.", "rating": 4, "date": "2009-08-08"}, {"excerpts": ["Pineapple Fried Rice ", "w/chicken - Good!: ", "Rice was a bit mushy/soft but not in a gross way. ", "Just not what I'm used to with fried rice. ", "Big chunks of pineapple. ", "Flavorful. "], "author": "Lisa D.", "review": "Came here on a Tuesday night with reservation that we didn't need. Only a few tables were occupied. Been here once before awhile back but can't remember what we had. This time we ordered:\n\nFresh Spring rolls- OK/good:  Light on the palate with a tamarind sauce that wasn't too sweet. Fresh veggies but all a bit bland. The sauce made it good.\n\nChicken Wings - Good! : These were slightly sweet with a kick from the chilli sauce. Not too spicy but I had a recovering sore throat and ate a few anyway because they were so good. Skin was still crisp, chicken was moist and fully cooked through and fried basil for garnish was yum.\n\nPineapple Fried Rice w/chicken - Good!: Rice was a bit mushy/soft but not in a gross way. Just not what I'm used to with fried rice. Big chunks of pineapple. Flavorful. My favorite dish of the night.\n\nPad Thai w/shrimp - OK: Noodles were a little lacking in flavor. Not enough spices and although it was great for my now damaged from chicken wings throat, it could have had a bit more of the sauce since it seemed a little dry.\n\nPad Se Ew w/beef - OK: I liked this better than the pad thai but again the noodles seemed to lack any flavor. The veggies were cooked perfectly, not overdone or too hard.\n\nI came with a friend who normally doesn't like Thai food because of all the spices so needless to say she loved everything I didn't. \n\nOverall: 3.5* if I could give them that. They tend to skimp on the meat with all dishes but service was good. They didn't come over too often to pester us but not so often that we'd stare at our water glasses hoping they'd magically refill. My fault for chugging it after the first chicken wing though. Portions are smaller than  what you'd get at most restaurants but at the same price. \n\nI'll come back again only because it's the only Thai place good enough within walking distance from my house and I dont each much anyway so the small portions might be less wasteful for me as I dont like taking leftovers home.", "rating": 3, "date": "2013-03-05"}, {"excerpts": ["For dinner we had the Spicy Basil Eggplant, Red Curry with Chicken, Pineapple Fried Rice and Thai Satay....", "everything was very well cooked with flavor. "], "author": "Daddy F.", "review": "Found this place on Yelp...didn't even know it existed until I searched for a Thai place in the neighborhood.  It's about a 7 min drive from our house...not too bad.\n\nWe went for dinner during the week...they are closed for lunch during the weekdays.\n\nOrdered the Thai Samosa...not worth it.  At this point I was kinda of discouraged.\n\nFor dinner we had the Spicy Basil Eggplant, Red Curry with Chicken, Pineapple Fried Rice and Thai Satay....everything was very well cooked with flavor. The did redeem themselves with dinner.\n\nService is good, nothing to spectacular.\n\nPrices are fair...I like that they are near by...but another 10 min to get to Thai Time and I'm a happy camper!", "rating": 4, "date": "2010-02-23"}, {"excerpts": ["Classic Thai tea, Crispy Chicken Fried Rice and the stick rice with mango. ", "It is worth every penny spend in this \nrestaurant."], "author": "Alex M.", "review": "Sri Thai it is a very good restaurant. In fact in my opinion it\nis the best Thai Restaurant in the Sunset. They always open till\n10 pm. Highlights for me are: Classic Thai tea, Crispy Chicken Fried Rice and the stick rice with mango. It is worth every penny spend in this \nrestaurant.", "rating": 5, "date": "2009-01-26"}, {"excerpts": ["Tom Kha Soup!!!, or Veggie Fried rice!  ", "The rice is heaven!  ", "(Oh, the salmon, yes, is a little dry)\n", "I've had friends drive down from Tahoe heading to Santa Cruz, and specifically stop off here for dinner!  ", "It doesn't get anybetter than this!  ", "It's hard to get to, but totally worth it!"], "author": "Leslie D.", "review": "I back packed in Northern Thailand and lived with some of the Mountain Tribes who cooked their food fresh every meal, including harvesting the rice that day, and oh my... This place def reminded me of being in Thailand and traditional northern taste!!\nTheir veggies are always fresh, and meat even more so!  It's hard to find an Thai resturaunt with such tender and lean meat!  Yes lean!!! \nMust order the Beef Panang Curry,  Tom Kha Soup!!!, or Veggie Fried rice!  The rice is heaven!  (Oh, the salmon, yes, is a little dry)\nI've had friends drive down from Tahoe heading to Santa Cruz, and specifically stop off here for dinner!  It doesn't get anybetter than this!  It's hard to get to, but totally worth it!", "rating": 5, "date": "2007-05-01"}, {"excerpts": ["Chicken fried rice was and Pad Se ", "Ew were good too...   ", "Thai Ice Tea could have benefited from less ice."], "author": "Ricky A.", "review": "Food was great & atmosphere was nice (haha, very clean large mirrors gave the impression the place was bigger than it was).  had the Mas Samun Curry over rice which was excellent.  Chicken fried rice was and Pad Se Ew were good too...   Thai Ice Tea could have benefited from less ice.", "rating": 4, "date": "2011-12-05"}, {"excerpts": ["crispy chicken fried rice and grilled chicken, chicken with basil are all my favs!! ", "I live so far away, else I would be here 24x7!!"], "author": "Rashmi K.", "review": "Love the food here.. perfectly satisfies my taste buds! crispy chicken fried rice and grilled chicken, chicken with basil are all my favs!! I live so far away, else I would be here 24x7!!", "rating": 5, "date": "2011-11-07"}, {"excerpts": ["and I ordered the Spicy Fried Rice Noodles with Chicken and the Green Curry with Beef to go.  ", "We thought both dishes were sour...not sure if they intentionally made it that way ", "or if we had a bad batch ", "=/   ", "The noodles weren't very tasty and the chicken in it was dry.  ", "However, it was a lot better than the curry.  ", "Even the veggies in the curry didn't seem very fresh (very dull green).  ", "Yea...", "I don't think I'll be going back.  ", "Thai Time is still my go-to Thai restaurant in the city..."], "author": "Katelynn L.", "review": "I wanted to Thai food last night and found Sri Thai on Yelp...what a disappointment.  My boyfriend and I ordered the Spicy Fried Rice Noodles with Chicken and the Green Curry with Beef to go.  We thought both dishes were sour...not sure if they intentionally made it that way or if we had a bad batch =/   The noodles weren't very tasty and the chicken in it was dry.  However, it was a lot better than the curry.  Even the veggies in the curry didn't seem very fresh (very dull green).  Yea...I don't think I'll be going back.  Thai Time is still my go-to Thai restaurant in the city...", "rating": 1, "date": "2010-06-19"}, {"excerpts": ["your pumpkin curry rocks, and thanks for having brown rice fried rice. "], "author": "Sprout S.", "review": "dear sri thai,\n\nwe order from you several times a week (i know, i know).\n\nyour pumpkin curry rocks, and thanks for having brown rice fried rice. not many places have that.\n\nxoxo\nsprout\n\nps) if you order online expect to wait a while, call it in!", "rating": 4, "date": "2010-03-18"}, {"excerpts": ["I ordered the Pineapple fried rice to play it safe, but it was more than I expected. ", "Decent amount of prawns (not just 2 or 3) and the rice was evenly flavored. ", "I tried a friend's pad thai which was good and the spring rolls were delicious as well."], "author": "Maricel B.", "review": "We discovered this little gem after the first flickr mixr I attended. At first glance, I thought, \"geez, check out this hole in a wall\" but boy was I wrong when we entered the restaurant. The employees were highly respectful and the food...oh the food! I was impressed.  I ordered the Pineapple fried rice to play it safe, but it was more than I expected. Decent amount of prawns (not just 2 or 3) and the rice was evenly flavored. I tried a friend's pad thai which was good and the spring rolls were delicious as well.", "rating": 4, "date": "2007-04-04"}, {"excerpts": ["I love their beef salad, eggplant salad, tom yum soup, woon sen soup, pumpkin curry, fried rice, and their weekly specials. ", "Some dishes are very authentic Thai but most are somewhat Americanized. ", "If you want your dish to be \"authentic\" then just ask. ", "But be careful when you ask for \"spicier\"... ", "The prices are very reasonable for the quality food and service."], "author": "Quynh I.", "review": "Wonderful restaurant with tasty food and some of the happiest people on earth. The staffs are always smiley and courteous. I love their beef salad, eggplant salad, tom yum soup, woon sen soup, pumpkin curry, fried rice, and their weekly specials. Some dishes are very authentic Thai but most are somewhat Americanized. If you want your dish to be \"authentic\" then just ask. But be careful when you ask for \"spicier\"... The prices are very reasonable for the quality food and service.", "rating": 5, "date": "2009-03-20"}, {"excerpts": ["We ordered the sweet and sour chicken fried rice, fried duck and a spicy chicken disk with flat noodles. ", "This is by far the best Thai food I have ever had. ", "Nothing was too sweet or too spicy. ", "My only complant would be the portion sizes could have been slightly larger. ", "We went in around 4 pm and waited 10 minuties for the chef to arrive, it was worth the wait. ", "I have been to San Francisco more times than I can count and that was one of the best meals i've had."], "author": "Aaron J.", "review": "I drove past this restaurant and I told my friend that that restaurant looked bad. It had a rusty weathered looking sign. The person working at the motel I was staying at highly recommend this restaurant. I am a college student and I went with two other students. We ordered the sweet and sour chicken fried rice, fried duck and a spicy chicken disk with flat noodles. This is by far the best Thai food I have ever had. Nothing was too sweet or too spicy. My only complant would be the portion sizes could have been slightly larger. We went in around 4 pm and waited 10 minuties for the chef to arrive, it was worth the wait. I have been to San Francisco more times than I can count and that was one of the best meals i've had.", "rating": 5, "date": "2010-06-16"}, {"excerpts": ["Other dishes were the pineapple fried rice, fried calamari, pumpkin curry, and garlic pork (forgot the Thai name) dish. ", "They were all very delicious. ", "The Thai Iced Tea was too sweet though. ", "The prices are very decent with the majority of the menu priced under $10 per dish. ", "All in all, a great place to dine."], "author": "Amelia G.", "review": "Sri Thai has great food. One of the dishes I got was the Spicy Mango Shrimp. If you like spicy, get this, but you can also ask them to ease up on the spicy if it's burning up your mouth like it did mine! Other dishes were the pineapple fried rice, fried calamari, pumpkin curry, and garlic pork (forgot the Thai name) dish. They were all very delicious. The Thai Iced Tea was too sweet though. The prices are very decent with the majority of the menu priced under $10 per dish. All in all, a great place to dine.", "rating": 4, "date": "2009-04-22"}], "fresh mango with sweet sticky rice": []}