{"fresh roll": [], "prawn roll": [], "spicy wing": [], "fried calamari": [{"excerpts": ["Among 4 of us we shared:\n\n- fresh shrimp spring rolls\n- fried calamari\n- shrimp pad thai\n- veg egg fried rice\n- grilled pork (garlic marination)\n- red chicken curry\n\n"], "author": "Heliana M.", "review": "Just came here last week again after many months and it didn't disappoint.\n\nFirst try of Thai food for my parents and they loved it. \n\nAmong 4 of us we shared:\n\n- fresh shrimp spring rolls\n- fried calamari\n- shrimp pad thai\n- veg egg fried rice\n- grilled pork (garlic marination)\n- red chicken curry\n\nEverything was delicious and light. Clean place and friendly service. It always brings me back to Thailand.", "rating": 5, "date": "2017-10-12"}], "corn cake": [], "steamed mussels": [{"excerpts": ["We ordered the Steamed Mussels (Appetizer), Grilled Chicken (Grilled), Pad Cha Talay (Sauteed), and Pad Geang Keaw Wan Pla Gry ", "Steamed Mussels: ", "Actually very good! ", "There was no salty, seafood taste whatsoever! ", "The dish included about 8 mussels and a simple dipping sauce. ", "Grilled Chicken: Very tender chicken! ", "Loved it! "], "author": "Celena C.", "review": "Really liked the food, but portions were on the smaller side. We ordered the Steamed Mussels (Appetizer), Grilled Chicken (Grilled), Pad Cha Talay (Sauteed), and Pad Geang Keaw Wan Pla Gry (Chef Special).\n\nSteamed Mussels: Actually very good! There was no salty, seafood taste whatsoever! The dish included about 8 mussels and a simple dipping sauce. Very clean and light.\n\nGrilled Chicken: Very tender chicken! Loved it! It came with a sweet and sour sauce and also a side salad (lettuce, tomatoes, and some ranch sauce)\n\nPad Cha Talay: Delicious, but the portion was rather small. There was a lot of red curry sauce though, which was sweet and not very spicy.\n\nPad Geang Keaw Wan Pla Gry: Contrary to the Pad Cha Talay, the portion was a lot bigger (maybe because it is a Chef's Special). The green curry sauce was a lot spicier than the red curry sauce, but it was tolerable.", "rating": 4, "date": "2017-08-15"}], "combo appetizers": [], "pesto pot sticker": [{"excerpts": ["They have a pesto pot sticker dish that i really like. ", "Las week, i was doing some home repair and a bit frumpy. ", "Ordered my usual.dishes .  ", "From the time the food arrived the server was trying to rush me. ", "Like i said, been there many times, but this time.they just relentlessly tried to rush me out. ", "There was maybe 4 other customers.  ", "That will be my last visit"], "author": "Lamb C.", "review": "Eaten here a number of times. They have a pesto pot sticker dish that i really like. Las week, i was doing some home repair and a bit frumpy. Ordered my usual.dishes .  From the time the food arrived the server was trying to rush me. Like i said, been there many times, but this time.they just relentlessly tried to rush me out. There was maybe 4 other customers.  That will be my last visit", "rating": 2, "date": "2018-05-02"}], "spicy tofu": [], "larb gai salad": [], "beef salad": [{"excerpts": ["The beef salad beef was very hard and dry, and the cucumber did not tasted fresh\nThe combo appetizer plate chicken was very hard and dry, spring roll ingredients tasted old and weird, samosa was mushy and not much taste\n", "The pumpkin curry was ok but the chicken was dry"], "author": "Kang C.", "review": "The Tom yum soup tastes like tomato soup and the carrots had a perfume taste \nThe beef salad beef was very hard and dry, and the cucumber did not tasted fresh\nThe combo appetizer plate chicken was very hard and dry, spring roll ingredients tasted old and weird, samosa was mushy and not much taste\nThe pumpkin curry was ok but the chicken was dry", "rating": 1, "date": "2016-10-08"}, {"excerpts": ["My favorites are roasted duck noodles, seafood noodles, garlic basil pork and beef salad etc. give it a try, their food is so much better than lots of Thai restaurants in U.S."], "author": "Abby Y.", "review": "My mom is Thai so I pretty much grew up with Thai food. This restaurant is one of the best Thai restaurant in San Francisco at least it's the best one in inner sunset area. I usually come here for lunch, prices are reasonable and a lot of varieties as well! My favorites are roasted duck noodles, seafood noodles, garlic basil pork and beef salad etc. give it a try, their food is so much better than lots of Thai restaurants in U.S.", "rating": 5, "date": "2015-11-09"}], "green bean salad": [], "grilled chicken": [{"excerpts": ["Grilled chicken with Thai herbs, with sweet and sauce and fresh green salad.  ", "My order, which my sister has not tried. ", "It was grilled chicken breast that was a little on the dry side.  ", "Probably my least favorite of our dishes.\n \n", "Fried banana with coconut ice cream. ", "Two egg rolls filled with bananas and a scoop of coconut ice cream.  ", "Creamy ice cream, but ", "I have had better deep-fried bananas.\n \n", "Fresh mango with sweet sticky rice - first time trying this dessert. ", "It consisted of slices of fresh mango with a large scoop of sweet rice.\n \n", "Overall, very good Thai cuisine in good size portions with efficient friendly service. ", "Nice option for Thai in the Inner Sunset."], "author": "Al L.", "review": "After my nephew's graduation, we headed for his favorite Japanese restaurant. Since they don't take reservations, it was a 45 minute wait at around 8:00 pm. So, we opted for Sriracha his favorite Thai restaurant in the Inner Sunset area and were seated immediately as it was only half full.\n \nMy sister, who frequents Sirarcha, suggested some of her favorite dishes.  Needing another item, I was tasked with selecting an entrée.  Our dishes:\n \nPad Se-Ew Shrimp - stirred fried rice noodle with shrimp and sweet soy sauce., Chinese broccoli, broccoli, carrot and egg.  Tasty with a slightly sweet flavor.\n \nPineapple fried rice with prawns, pineapple, egg, raisin, pea-carrot, onion and cashews. Rice had a good texture and dish had four good size prawns. \n \nSriracha fried rice with egg, chili, hot basil, onion, topped with grilled prawns and fried egg.  This dish was flavorful, but it does have a kick to it, especially to those that have a light tolerance to spice.\n \nKanah moo krob - stir fried roasted pork belly with Chinese broccoli, spicy chili garlic and black bean\nSauce - More of a Chinese stir fried dish with Chinese roast pork. Good, but didn't seem like a Thai dish.  Also, black bean sauce was light in black beans.\n \nGrilled chicken with Thai herbs, with sweet and sauce and fresh green salad.  My order, which my sister has not tried. It was grilled chicken breast that was a little on the dry side.  Probably my least favorite of our dishes.\n \nFried banana with coconut ice cream. Two egg rolls filled with bananas and a scoop of coconut ice cream.  Creamy ice cream, but I have had better deep-fried bananas.\n \nFresh mango with sweet sticky rice - first time trying this dessert. It consisted of slices of fresh mango with a large scoop of sweet rice.\n \nOverall, very good Thai cuisine in good size portions with efficient friendly service. Nice option for Thai in the Inner Sunset.", "rating": 4, "date": "2018-06-07"}, {"excerpts": ["We ordered the Steamed Mussels (Appetizer), Grilled Chicken (Grilled), Pad Cha Talay (Sauteed), and Pad Geang Keaw Wan Pla Gry ", "Steamed Mussels: ", "Actually very good! ", "There was no salty, seafood taste whatsoever! ", "The dish included about 8 mussels and a simple dipping sauce. ", "Grilled Chicken: Very tender chicken! ", "Loved it! "], "author": "Celena C.", "review": "Really liked the food, but portions were on the smaller side. We ordered the Steamed Mussels (Appetizer), Grilled Chicken (Grilled), Pad Cha Talay (Sauteed), and Pad Geang Keaw Wan Pla Gry (Chef Special).\n\nSteamed Mussels: Actually very good! There was no salty, seafood taste whatsoever! The dish included about 8 mussels and a simple dipping sauce. Very clean and light.\n\nGrilled Chicken: Very tender chicken! Loved it! It came with a sweet and sour sauce and also a side salad (lettuce, tomatoes, and some ranch sauce)\n\nPad Cha Talay: Delicious, but the portion was rather small. There was a lot of red curry sauce though, which was sweet and not very spicy.\n\nPad Geang Keaw Wan Pla Gry: Contrary to the Pad Cha Talay, the portion was a lot bigger (maybe because it is a Chef's Special). The green curry sauce was a lot spicier than the red curry sauce, but it was tolerable.", "rating": 4, "date": "2017-08-15"}, {"excerpts": ["Grilled chicken is a bit burned although i asked them to remade already \nPad thai was dry and not soft, hard to chew. ", "3/5 for the pad- thai noodle"], "author": "Hien N.", "review": "Grilled chicken is a bit burned although i asked them to remade already \nPad thai was dry and not soft, hard to chew. 3/5 for the pad- thai noodle", "rating": 4, "date": "2015-11-04"}], "grilled pork": [{"excerpts": ["Among 4 of us we shared:\n\n- fresh shrimp spring rolls\n- fried calamari\n- shrimp pad thai\n- veg egg fried rice\n- grilled pork (garlic marination)\n- red chicken curry\n\n"], "author": "Heliana M.", "review": "Just came here last week again after many months and it didn't disappoint.\n\nFirst try of Thai food for my parents and they loved it. \n\nAmong 4 of us we shared:\n\n- fresh shrimp spring rolls\n- fried calamari\n- shrimp pad thai\n- veg egg fried rice\n- grilled pork (garlic marination)\n- red chicken curry\n\nEverything was delicious and light. Clean place and friendly service. It always brings me back to Thailand.", "rating": 5, "date": "2017-10-12"}, {"excerpts": ["I got grilled salmon, my kids got grilled pork ", "and I also got a caramari and ", "it was soooo good. ", "The kids loved the food they say it's delicious ! ", "And today I ordered some for my boyfriend coz he likes Thai food too ", "so I hope he likes the food as I do!"], "author": "Jeramie F.", "review": "It's my first time to eat dine-in in this place with my kids yesterday, and the food was good. I got grilled salmon, my kids got grilled pork and I also got a caramari and it was soooo good. The kids loved the food they say it's delicious ! And today I ordered some for my boyfriend coz he likes Thai food too so I hope he likes the food as I do!", "rating": 5, "date": "2018-06-14"}], "roasted duck": [{"excerpts": ["I want to give it 5 based purely on the Roasted Duck Noodle Soup. ", "This broth has healing powers. ", "There are many other places that serve this soup,  but no other broth compares in my eyes.  ", "I lived near this place for a long time, and they stayed true during the name change. ", "When I visit home again, this is on the top of my list of ", "must gets!!! ", "Other items are well done and I am never disappointed."], "author": "Beth M.", "review": "I want to give it 5 based purely on the Roasted Duck Noodle Soup. This broth has healing powers. There are many other places that serve this soup,  but no other broth compares in my eyes.  I lived near this place for a long time, and they stayed true during the name change. When I visit home again, this is on the top of my list of must gets!!! Other items are well done and I am never disappointed.", "rating": 4, "date": "2018-11-04"}, {"excerpts": ["Also ordered roasted duck five spiced noodle soup. ", "It's the best one i had in the city!"], "author": "Yuan Z.", "review": "Good food and good service. I like the deep fried spring rolls. Also ordered roasted duck five spiced noodle soup. It's the best one i had in the city!", "rating": 5, "date": "2017-06-02"}, {"excerpts": ["The roasted duck in red coconut curry was delicious. ", "I didn't have much, since I found it a bit spicy, but my friend loved it. ", "I have to disagree with Andrea V., though; we found that we needed an extra order of rice. ", "As for the pad kee mao, the meat ratio was a little low, and I've had better rice noodles. "], "author": "Yves L.", "review": "I came here with a friend on a Sunday evening when every other place nearby had lines out the door. I was rather surprised to find a 4.5 star place with room to spare, so we headed in to try it out.\n\nI have to say, after eating here, I'm absolutely baffled. Everything about the meal was right, and yet we were one of only five tables!\n\nWe had the chicken pad sew, the beef pad kee mao, and the duck curry.\n\nThe pad sew was fantastic. Great balance of flavours. I had it with the chicken, but I think beef would have been better. The chicken was by no means dry, but it was definitely less moist.\n\nThe roasted duck in red coconut curry was delicious. I didn't have much, since I found it a bit spicy, but my friend loved it. I have to disagree with Andrea V., though; we found that we needed an extra order of rice. As for the pad kee mao, the meat ratio was a little low, and I've had better rice noodles. But it was still quite tasty.\n\nThe Thai iced tea was good, if a bit sweet. I had never had it before, but I think I would get it again.\n\nThe decorations weren't anything to write home about, and the instrumental music playing was light and inoffensive. All in all, Sriracha Thai really deserves its 4.5 star rating, and you'd be amiss not to give it a try.", "rating": 4, "date": "2016-09-10"}, {"excerpts": ["My favorites are roasted duck noodles, seafood noodles, garlic basil pork and beef salad etc. give it a try, their food is so much better than lots of Thai restaurants in U.S."], "author": "Abby Y.", "review": "My mom is Thai so I pretty much grew up with Thai food. This restaurant is one of the best Thai restaurant in San Francisco at least it's the best one in inner sunset area. I usually come here for lunch, prices are reasonable and a lot of varieties as well! My favorites are roasted duck noodles, seafood noodles, garlic basil pork and beef salad etc. give it a try, their food is so much better than lots of Thai restaurants in U.S.", "rating": 5, "date": "2015-11-09"}], "pa naeng curry": [], "pad prik king": [], "pad eggplant": [{"excerpts": ["Ordered Tom yum, green curry and pad eggplant with chicken! ", "Everything was served hot and had delicious flavors. ", "Will come back again soon! \n", "Oh yes and parking right across the street!"], "author": "A K.", "review": "Good food... Happened to be walking past it... Good thing I decided to come in... Was pleasantly surprised. Ordered Tom yum, green curry and pad eggplant with chicken! Everything was served hot and had delicious flavors. Will come back again soon! \nOh yes and parking right across the street!", "rating": 5, "date": "2017-07-29"}], "garlic pepper": [], "praram": [], "pad woon sen": [{"excerpts": ["though I order different dishes, I often come back to and can recommend the Pad Woon Sen and fried rice with crispy chicken, and papaya salad."], "author": "Susan S.", "review": "I'm leaving this review because I live in the area, love this place, and don't know how a restaurant this solid doesn't get more business. I like it more than other, more popular Thai restaurants in the area. I have a mostly take out relationship with Sriracha Thai, as in I order 2 or 3 entrees at once and then eat them for the next several meals when I don't have time to cook. The Pad Se-Ew is delicious and though I order different dishes, I often come back to and can recommend the Pad Woon Sen and fried rice with crispy chicken, and papaya salad.", "rating": 5, "date": "2017-11-07"}], "salmon eggplant": [], "tamarind duck": [], "three flavor fish": [], "pla jien": [{"excerpts": ["Starving hungry, we ended up ordering the fresh spring rolls, pla jien, red curry, pineapple fried rice, and pad thai. ", "Our food came out extremely quickly and boy was it delicious! ", "The pineapple fried rice seems like a popular dish as the person next to us ordered it too, and it has a very distinct sweet and savory taste, which i highly recommend. ", "Also highly suggest the spring rolls as an appetizer. ", "The pla jien, red curry, and pad thai were pretty good, standard for a Thai restaurant, but hands down wins over a majority of Thai places i've had in the greater NorCal area. "], "author": "Jessie W.", "review": "The service here is absolutely fantastic. But granted, my friend and I came in on a Sunday night when it was pouring rain. \n\nWe were seated extremely promptly as the restaurant was pretty empty. Starving hungry, we ended up ordering the fresh spring rolls, pla jien, red curry, pineapple fried rice, and pad thai. Our food came out extremely quickly and boy was it delicious! The pineapple fried rice seems like a popular dish as the person next to us ordered it too, and it has a very distinct sweet and savory taste, which i highly recommend. Also highly suggest the spring rolls as an appetizer. The pla jien, red curry, and pad thai were pretty good, standard for a Thai restaurant, but hands down wins over a majority of Thai places i've had in the greater NorCal area. Their mango and sticky rice is served with fresh mango and is definitely a palette cleanser. \n\nPS- If you check in on Yelp, you get a free thai iced tea (which was also very delicious!)", "rating": 5, "date": "2015-12-21"}], "combination beef noodle soup": [], "stewed beef noodle soup": [], "pork and fish ball noodle soup": [], "yen ta fo noodle soup": [], "roasted duck noodle soup": [{"excerpts": ["I want to give it 5 based purely on the Roasted Duck Noodle Soup. ", "This broth has healing powers. ", "There are many other places that serve this soup,  but no other broth compares in my eyes.  ", "I lived near this place for a long time, and they stayed true during the name change. ", "When I visit home again, this is on the top of my list of ", "must gets!!! ", "Other items are well done and I am never disappointed."], "author": "Beth M.", "review": "I want to give it 5 based purely on the Roasted Duck Noodle Soup. This broth has healing powers. There are many other places that serve this soup,  but no other broth compares in my eyes.  I lived near this place for a long time, and they stayed true during the name change. When I visit home again, this is on the top of my list of must gets!!! Other items are well done and I am never disappointed.", "rating": 4, "date": "2018-11-04"}], "stewed chicken leg noodle soup": [], "tom yum noodle": [{"excerpts": ["With more noodles \n- tom yum noodle soup. ", "4.5/5. ", "Great flavor!\n-  stir fried eggplant and chicken. ", "5/5 "], "author": "Doreen F.", "review": "The food was tasty, delicious and well balanced - just enough flavor. \n- chicken satay 4/5\n-  par Thai 3.5/ 5 too much sauce SN drier!!! With more noodles \n- tom yum noodle soup. 4.5/5. Great flavor!\n-  stir fried eggplant and chicken. 5/5 The egg plant was perfectly cooked\n\nCan't wait to return and try more dishes\n\nI've had their pad  see ewe before - could've been drier with less oil. 3.5/ 5.  I like it still. \n\nSo nice to dine in a quiet,  clean and pleasant environment where you can have a decent conversation. Good service and reasonable prices.", "rating": 4, "date": "2017-05-23"}], "vegetarian noodle soup": [], "khao soi": [{"excerpts": ["The cousin that recommended Sriracha Thai said that this restaurant had the most authentic tasting khao soi (coconut curry noodle dish) that she's had since she was in Thailand a couple years ago!! ", "After trying it, even though we had nothing to compare it to because neither of us have been to Thailand, we agreed it was one of the best noodle dishes we've had. ", "Along with the khao soi, we ordered red curry with chicken, the spicy chicken wings, and a bowl of rice. ", "The red curry with chicken was verrry similar to the khao soi, but we weren't mad at it! ", "It had more veggies and was more liquidy than the khao soi. ", "It was really yummy over rice! ", "The spicy chicken wings are far from spicy, but still good. ", "I'll for sure be back to get some khao soi!"], "author": "Tara A.", "review": "I came to Sriracha Thai for a dinner date with my cousin, on the recommendation of my other cousin. The cousin that recommended Sriracha Thai said that this restaurant had the most authentic tasting khao soi (coconut curry noodle dish) that she's had since she was in Thailand a couple years ago!! After trying it, even though we had nothing to compare it to because neither of us have been to Thailand, we agreed it was one of the best noodle dishes we've had. It had a creamy coconut curry sauce and lots of crunchies! \n\nAlong with the khao soi, we ordered red curry with chicken, the spicy chicken wings, and a bowl of rice. The red curry with chicken was verrry similar to the khao soi, but we weren't mad at it! It had more veggies and was more liquidy than the khao soi. It was really yummy over rice! The spicy chicken wings are far from spicy, but still good. The sauce is reminiscent of sweet chili sauce, and I loved that it was topped with fried basil. \n\nService was very friendly and the price point was pretty reasonable. I'll for sure be back to get some khao soi!", "rating": 4, "date": "2018-05-12"}, {"excerpts": ["The khao soi is off the hook, just as good as the kind I ate in Chaing Mai. ", "I dont think its on the menu but its incrediable. ", "Every other dish was also perfection."], "author": "Monica D.", "review": "The khao soi is off the hook, just as good as the kind I ate in Chaing Mai. I dont think its on the menu but its incrediable. Every other dish was also perfection.", "rating": 5, "date": "2018-09-16"}, {"excerpts": ["I got the khao soi with chicken, the pad kee mao with tofu and mango sticky rice. ", "Everything tasted really fresh and exceeded my expectations. ", "The only thing that could be improved is the spice level. "], "author": "Liza B.", "review": "This place is awesome. I ordered delivery from Sriracha last night and have nothing but good things to say. The ordering process was simple, the man who delivered my food was very nice and the food itself was still warm and so so good! \n\nI got the khao soi with chicken, the pad kee mao with tofu and mango sticky rice. Everything tasted really fresh and exceeded my expectations. The only thing that could be improved is the spice level. I ordered medium and found everything a bit mild for my liking.\n\nI've found it surprisingly hard to find good, inexpensive Thai food in the city, so I'm thrilled that I tried this place. \n\nHighly recommend!", "rating": 5, "date": "2016-02-05"}], "garlic and ginger rice": [], "guay tiew kai kua": [{"excerpts": ["My fave dishes are the pineapple fried rice, shrimp pad thai, guay tiew kai kua (get this spicy with shrimp and no bean sprouts. ", "The best noodle dish everrrrr), veggie and tofu green curry (medium spice) and the pad himapan (spicy with fried shrimp). ", "The delivery staff here are always really nice and sweet."], "author": "Stacey M.", "review": "This place is my go to for thai food delivery. Everything always arrives hot and delivery is very fast. My fave dishes are the pineapple fried rice, shrimp pad thai, guay tiew kai kua (get this spicy with shrimp and no bean sprouts. The best noodle dish everrrrr), veggie and tofu green curry (medium spice) and the pad himapan (spicy with fried shrimp). The delivery staff here are always really nice and sweet.", "rating": 5, "date": "2017-06-06"}], "fried rice with crispy chicken": [{"excerpts": ["We ended up eating a duck noodle soup, fried rice with crispy chicken and a satay chicken. ", "I loved the fried rice. ", "It reminded me of my childhood fried rice. ", "The cripsy chicken was delish although I wish there were more meat. ", "The sweet and sour sauce was divine. ", "Portion size was small but it's enough to fill a medium eater like me. ", "My experience here was quite pleasant although it was by chance. ", "I would recommend and take people her in the future!"], "author": "Bernice L.", "review": "Couldn't find any other place that was Asian which was open today on CNY but then we saw this place. I always remember walking past this place going to school back then and I thought the name of it was so weirdly attracting. Sriracha. I'm personally not a fan of Sriracha myself but this place was pretty good. Although I'm not sure how sriracha comes into play in the food, still worthwhile to come here. The waitress was super friendly. We ended up eating a duck noodle soup, fried rice with crispy chicken and a satay chicken. I loved the fried rice. It reminded me of my childhood fried rice. The cripsy chicken was delish although I wish there were more meat. The sweet and sour sauce was divine. Portion size was small but it's enough to fill a medium eater like me. My experience here was quite pleasant although it was by chance. I would recommend and take people her in the future!", "rating": 4, "date": "2018-02-16"}, {"excerpts": ["though I order different dishes, I often come back to and can recommend the Pad Woon Sen and fried rice with crispy chicken, and papaya salad."], "author": "Susan S.", "review": "I'm leaving this review because I live in the area, love this place, and don't know how a restaurant this solid doesn't get more business. I like it more than other, more popular Thai restaurants in the area. I have a mostly take out relationship with Sriracha Thai, as in I order 2 or 3 entrees at once and then eat them for the next several meals when I don't have time to cook. The Pad Se-Ew is delicious and though I order different dishes, I often come back to and can recommend the Pad Woon Sen and fried rice with crispy chicken, and papaya salad.", "rating": 5, "date": "2017-11-07"}], "fried rice with grilled chicken": [], "fried rice with pork": [], "fried rice with roasted duck": [], "pad gaprow lunch special": [], "pad prik pao lunch special": [], "garlic and pepper lunch special": [], "pad makuer lunch special": [], "pad prik khing lunch special": [], "pad khing sod lunch special": [], "cashew nut chicken lunch special": [], "pra ram lunch special": [], "yellow curry lunch special": [{"excerpts": ["I visited first a year ago for their lunch and looooved their yellow curry lunch special, which came with soup, rice and a dessert. ", "Recently though, I ordered Pad See Ew and although the flavor was delicious and the noodles were tender, the tofu in my dish tasted just like cardboard. ", "Overcooked, dry. ", "No seasoning. "], "author": "Anna P.", "review": "I have been here for both dine-in and takeout. Although their lunch specials are a great value, and the service is always friendly, their food always leaves me less than satisfied. I visited first a year ago for their lunch and looooved their yellow curry lunch special, which came with soup, rice and a dessert. Recently though, I ordered Pad See Ew and although the flavor was delicious and the noodles were tender, the tofu in my dish tasted just like cardboard. Overcooked, dry. No seasoning. It was terribly disappointing.\n\nMaybe this just isn't the place to get pad see ew when my cravings are strong. Overall though, a decent place to grab a bite.", "rating": 3, "date": "2017-07-16"}], "red curry lunch special": [], "tomkha soup": [], "tomyum soup": [], "woon sen soup": [], "sriracha fried rice": [{"excerpts": ["Sriracha fried rice with egg, chili, hot basil, onion, topped with grilled prawns and fried egg.  ", "This dish was flavorful, but it does have a kick to it, especially to those that have a light tolerance to spice.\n \n"], "author": "Al L.", "review": "After my nephew's graduation, we headed for his favorite Japanese restaurant. Since they don't take reservations, it was a 45 minute wait at around 8:00 pm. So, we opted for Sriracha his favorite Thai restaurant in the Inner Sunset area and were seated immediately as it was only half full.\n \nMy sister, who frequents Sirarcha, suggested some of her favorite dishes.  Needing another item, I was tasked with selecting an entrée.  Our dishes:\n \nPad Se-Ew Shrimp - stirred fried rice noodle with shrimp and sweet soy sauce., Chinese broccoli, broccoli, carrot and egg.  Tasty with a slightly sweet flavor.\n \nPineapple fried rice with prawns, pineapple, egg, raisin, pea-carrot, onion and cashews. Rice had a good texture and dish had four good size prawns. \n \nSriracha fried rice with egg, chili, hot basil, onion, topped with grilled prawns and fried egg.  This dish was flavorful, but it does have a kick to it, especially to those that have a light tolerance to spice.\n \nKanah moo krob - stir fried roasted pork belly with Chinese broccoli, spicy chili garlic and black bean\nSauce - More of a Chinese stir fried dish with Chinese roast pork. Good, but didn't seem like a Thai dish.  Also, black bean sauce was light in black beans.\n \nGrilled chicken with Thai herbs, with sweet and sauce and fresh green salad.  My order, which my sister has not tried. It was grilled chicken breast that was a little on the dry side.  Probably my least favorite of our dishes.\n \nFried banana with coconut ice cream. Two egg rolls filled with bananas and a scoop of coconut ice cream.  Creamy ice cream, but I have had better deep-fried bananas.\n \nFresh mango with sweet sticky rice - first time trying this dessert. It consisted of slices of fresh mango with a large scoop of sweet rice.\n \nOverall, very good Thai cuisine in good size portions with efficient friendly service. Nice option for Thai in the Inner Sunset.", "rating": 4, "date": "2018-06-07"}, {"excerpts": ["My friends ordered a Pad Thai w/ Chicken and the Sriracha fried rice.\n\n"], "author": "Xin W.", "review": "*nose wrinkle*\n\nehhh ... I don't even know where to start. I think I must've came on a bad day or something, because I was quite disappointed with my food. Kinda confused and surprised that this restaurant has that high of a rating.\n\nI was meeting up with some of my friends after work (6:30pm on a lovely Tuesday evening). We decided to give this place a try. Located near 9th and Irving and not too far from the muni N stop. On the outside it actually look pretty nice. There was no wait because it was literally empty. I think besides us, there was one or two other groups there (at 6:30pm on a Tuesday night!)\n\nI ordered a Thai Iced Tea and Pad Thai with Beef. My friends ordered a Pad Thai w/ Chicken and the Sriracha fried rice.\n\nI don't know how to say this, but the Pad Thai in general was awful awful. The beef was soggy, chewy, and tasteless. I had to pick the beef out from my dish because I was having a hard time swallowing it. I mean come on, you're making all the cows in the world look bad. You're not doing justice to their delicious meats. Undercooked and bland, it's literally the worst beef I've had in my life. \n\nOk, maybe I just had a bad dish. I turned to my right and my friend who ordered the Pad Thai with Chicken - she didn't even touch her dish. She prbly had like one or two bites of it and that was it. The noodles were undercooked, the chicken was dry. It was $9 for a dish so I guess while it's not super expensive, but I definitely expected more for my money's worth. Worst Thai dining experience ever.\n\nfinal thoughts: nope never coming back here, and I can not in my good conscience recommend this place to anyone. if you're insistent on coming here, then avoid the pad thai like the plague", "rating": 2, "date": "2016-10-19"}, {"excerpts": ["We ordered spicy chicken wing as an appetizer, sriracha fried rice, green chicken curry and a side of steamed rice.  ", "The wings came out first which I always appreciate.  ", "The were really temperature hot, another bonus.  ", "The skin was crispy with a perfect amount of sauce, the sauce was sweet though not really spicy.  ", "The rest of the food came perfectly timed and was delicious.  ", "The fried rice was full of flavor as was the curry, we both would have preferred it hotter in spice ", "but I forgot to ask for it.  ", "While eating there was a fair amount of people coming in for to go orders which explained the empty dining room. ", "We will definitely be back when in SF"], "author": "Samantha H.", "review": "Came here on a lazy Sunday looking for some dinner. The place was empty which always makes me nervous.  We were sat right away offered drinks and menus quickly.  We ordered spicy chicken wing as an appetizer, sriracha fried rice, green chicken curry and a side of steamed rice.  The wings came out first which I always appreciate.  The were really temperature hot, another bonus.  The skin was crispy with a perfect amount of sauce, the sauce was sweet though not really spicy.  The rest of the food came perfectly timed and was delicious.  The fried rice was full of flavor as was the curry, we both would have preferred it hotter in spice but I forgot to ask for it.  While eating there was a fair amount of people coming in for to go orders which explained the empty dining room. We will definitely be back when in SF", "rating": 5, "date": "2016-06-20"}, {"excerpts": ["Sriracha fried rice was bland, dry, and didn't taste like it had any Sriracha sauce in it. ", "The fried egg on top was also dry. ", "The mango sticky rice was the worst I have ever tasted. ", "The mango itself was good but the rice was not done correctly, they just drizzled some coconut cream on top. ", "Worst ever. ", "Service was awful. ", "I ordered the rice to eat there. ", "After the food came, they never checked back in with me, and I had to wave them down twice to get their attention to bring me my check. ", "Will not be going back to this place especially with better Thai restaurants in the area/city."], "author": "Dara A.", "review": "Food and Service was bad. Sriracha fried rice was bland, dry, and didn't taste like it had any Sriracha sauce in it. The fried egg on top was also dry. The mango sticky rice was the worst I have ever tasted. The mango itself was good but the rice was not done correctly, they just drizzled some coconut cream on top. Worst ever. Service was awful. I ordered the rice to eat there. After the food came, they never checked back in with me, and I had to wave them down twice to get their attention to bring me my check. Will not be going back to this place especially with better Thai restaurants in the area/city.", "rating": 1, "date": "2016-05-25"}], "kanah moo krob": [{"excerpts": ["Kanah moo krob - stir fried roasted pork belly with Chinese broccoli, spicy chili garlic and black bean\nSauce - More of a Chinese stir fried dish with Chinese roast pork. ", "Good, but didn't seem like a Thai dish.  ", "Also, black bean sauce was light in black beans.\n \n"], "author": "Al L.", "review": "After my nephew's graduation, we headed for his favorite Japanese restaurant. Since they don't take reservations, it was a 45 minute wait at around 8:00 pm. So, we opted for Sriracha his favorite Thai restaurant in the Inner Sunset area and were seated immediately as it was only half full.\n \nMy sister, who frequents Sirarcha, suggested some of her favorite dishes.  Needing another item, I was tasked with selecting an entrée.  Our dishes:\n \nPad Se-Ew Shrimp - stirred fried rice noodle with shrimp and sweet soy sauce., Chinese broccoli, broccoli, carrot and egg.  Tasty with a slightly sweet flavor.\n \nPineapple fried rice with prawns, pineapple, egg, raisin, pea-carrot, onion and cashews. Rice had a good texture and dish had four good size prawns. \n \nSriracha fried rice with egg, chili, hot basil, onion, topped with grilled prawns and fried egg.  This dish was flavorful, but it does have a kick to it, especially to those that have a light tolerance to spice.\n \nKanah moo krob - stir fried roasted pork belly with Chinese broccoli, spicy chili garlic and black bean\nSauce - More of a Chinese stir fried dish with Chinese roast pork. Good, but didn't seem like a Thai dish.  Also, black bean sauce was light in black beans.\n \nGrilled chicken with Thai herbs, with sweet and sauce and fresh green salad.  My order, which my sister has not tried. It was grilled chicken breast that was a little on the dry side.  Probably my least favorite of our dishes.\n \nFried banana with coconut ice cream. Two egg rolls filled with bananas and a scoop of coconut ice cream.  Creamy ice cream, but I have had better deep-fried bananas.\n \nFresh mango with sweet sticky rice - first time trying this dessert. It consisted of slices of fresh mango with a large scoop of sweet rice.\n \nOverall, very good Thai cuisine in good size portions with efficient friendly service. Nice option for Thai in the Inner Sunset.", "rating": 4, "date": "2018-06-07"}], "pla dook pad ped": [], "pad geang keaw wan pla gry": [{"excerpts": ["We ordered the Steamed Mussels (Appetizer), Grilled Chicken (Grilled), Pad Cha Talay (Sauteed), and Pad Geang Keaw Wan Pla Gry ", "Steamed Mussels: ", "Actually very good! ", "There was no salty, seafood taste whatsoever! ", "The dish included about 8 mussels and a simple dipping sauce. ", "Grilled Chicken: Very tender chicken! ", "Loved it! "], "author": "Celena C.", "review": "Really liked the food, but portions were on the smaller side. We ordered the Steamed Mussels (Appetizer), Grilled Chicken (Grilled), Pad Cha Talay (Sauteed), and Pad Geang Keaw Wan Pla Gry (Chef Special).\n\nSteamed Mussels: Actually very good! There was no salty, seafood taste whatsoever! The dish included about 8 mussels and a simple dipping sauce. Very clean and light.\n\nGrilled Chicken: Very tender chicken! Loved it! It came with a sweet and sour sauce and also a side salad (lettuce, tomatoes, and some ranch sauce)\n\nPad Cha Talay: Delicious, but the portion was rather small. There was a lot of red curry sauce though, which was sweet and not very spicy.\n\nPad Geang Keaw Wan Pla Gry: Contrary to the Pad Cha Talay, the portion was a lot bigger (maybe because it is a Chef's Special). The green curry sauce was a lot spicier than the red curry sauce, but it was tolerable.", "rating": 4, "date": "2017-08-15"}], "geang keaw wan basa": [], "kao mun gai": [], "geang keaw wan salmon": []}