{"pomba": [{"excerpts": ["We got the Stable Eggs and Pomba. ", "I really like the idea of local, farm-fresh ingredients, but the Pomba was just too heavy for me (the brie gelled up in the cold weather rather quickly), and the Stable Eggs was something I could've easily assembled at home, not seasoned particularly well.\n\n"], "author": "Kelley L.", "review": "Came to this cute cafe for a last-minute brunch right before I had to leave for the airport.\n\nFood: good, but nothing spectacular. We got the Stable Eggs and Pomba. I really like the idea of local, farm-fresh ingredients, but the Pomba was just too heavy for me (the brie gelled up in the cold weather rather quickly), and the Stable Eggs was something I could've easily assembled at home, not seasoned particularly well.\n\nService: Nothing to complain about, it's a quick line up to the register where you order and pay, and then you seat yourself with your number and the server brings the food to your table. My encounter with the cashier was pleasant, and he entertained me and my friends' fight to grab the check (obviously it's my turn to pay, Brian).\n\nAmbiance: I actually loved the ambiance, and this totally made the brunch so much more fun. We explored the back (they were having some sort of cheese-centric cooking class?) and found a variety of plants and cookbooks for sale. Such a cute and wild piece of jungle in the middle of the city.\n\nOverall, I think I'd come back here if I needed to stop by for a quick bite and didn't want to wait in 3-hour SF brunch lines. The prices are super reasonable and the ambiance is cute. I'll try to come back in warmer weather!", "rating": 3, "date": "2018-02-21"}, {"excerpts": ["I got the Pomba, which turned out about the same as the Egg-In-A-Hole I made in 7th grade Home Economics class.  "], "author": "Sarah R.", "review": "The patio is beautiful - a unique oasis in the Mission.  While I had a lackluster experience food and service-wise, if you're looking for a green getaway, the setting makes a visit worth it.  \n\nI got the Pomba, which turned out about the same as the Egg-In-A-Hole I made in 7th grade Home Economics class.  Toast was too thick and underdone.  Eggs were overdone and chewy.  Bacon was perfectly done so that was nice.  Blackberries were a nice touch.  It'd be great if they carried a hot sauce other than Tapatillo.  \n\nThe staff are typical trendier-than-thou servers who seemingly were never taught basic manners.  I worked in the retail and service industries for more than fifteen years and I know how much it can suck, but it's your job to be decent to people.", "rating": 2, "date": "2017-11-13"}, {"excerpts": ["For $7, I got the Pomba (toast, bacon, brie, and egg in the hole). ", "The toast is Texas toast, lightly buttered and perfectly toasted. ", "The bacon is nicely cooked with crisp edges, but still slightly chewy. ", "The brie was laid over the hot toast and egg, making it melt and ooze into all the crevices. ", "The egg was cooked to perfection and nicely scrambled in the hole. ", "Two blackberries for garnish and this dish was just everything I could want in a sinfully delicious breakfast. ", "So filling, it kept me going '"], "author": "Leana L.", "review": "My bf likes to show me all his new finds in the Mission and one Thursday morning before heading up to Yosemite to hike Half Dome that weekend, he took me to Stable Cafe.\n\nLocation: Definitely out of the way. There's basically nothing else around this area.\n\nFood: The menu is small, but the choices are mouthwatering. For $7, I got the Pomba (toast, bacon, brie, and egg in the hole). The toast is Texas toast, lightly buttered and perfectly toasted. The bacon is nicely cooked with crisp edges, but still slightly chewy. The brie was laid over the hot toast and egg, making it melt and ooze into all the crevices. The egg was cooked to perfection and nicely scrambled in the hole. Two blackberries for garnish and this dish was just everything I could want in a sinfully delicious breakfast. So filling, it kept me going 'til we had an early dinner later that day!\n\nCoffee: I got a latte with almond milk. Delicious. And cute coffee art on the top. Also bonus points for serving coffee in glass -- I'm a fan of this trend.\n\nService: You order at the counter and they bring the food to your number wherever you decide to sit. However, you need to grab your coffee yourself. I wanted a latte with 2% milk, but they only had whole milk and nonfat. The employee suggested a mixture of the two, but I said nonfat was fine. Then she suggested almond milk. It was like she read my mind! Always a fan of almond milk. Friendly service for sure :)\n\nAmbiance: Cute place where you can have a leisurely breakfast, or grab something quick if you have 15 minutes to spare. They have a small seating area inside and a larger patio area outside adorned with a lot of cute drought-resistant plants. Apparently you can also rent out the back space which is good for small gatherings/parties.\n\nWould I return? YES. Delicious food, great coffee, friendly service, and cute cafe.", "rating": 5, "date": "2014-09-08"}, {"excerpts": ["Id suggest trying their pomba"], "author": "Rati M.", "review": "Definitely at the top of my breakfast places list. Great food and friendly staff. Id suggest trying their pomba", "rating": 5, "date": "2017-08-26"}, {"excerpts": ["I ordered the Pomba -- scrambled eggs dropped into a hole cut from unbelievable thick cut wheat bread, with strips of bacon and brie draped on top - and YES - it is as spectacular as it sounds. ", "The husband had the Nono, an open-faced baguette sandwich with tomato, sunny side up eggs, and melted provolone. ", "I would have tasted his, but before I could ask for a bite he had inhaled it. ", "Parking not a real problem, at least on weekends - we found a spot directly across the street! ", "We will definitely be back -- can't wait to try some of the other menu choices. ", "Lovely place to spend a sunny...or foggy morning."], "author": "Lisa W.", "review": "I wonder if they would notice if I moved in to their beautiful garden/patio and just...stayed? Stopped in here for Sunday breakfast/brunch and only had to wait a few minutes to order. By the time we had walked around outside admiring their gorgeous succulent plantings a table opened up and our food arrived - perfect timing! The De La Paz coffee is delicious with plenty of kick to get your morning jump started. I ordered the Pomba -- scrambled eggs dropped into a hole cut from unbelievable thick cut wheat bread, with strips of bacon and brie draped on top - and YES - it is as spectacular as it sounds. The husband had the Nono, an open-faced baguette sandwich with tomato, sunny side up eggs, and melted provolone. I would have tasted his, but before I could ask for a bite he had inhaled it. Parking not a real problem, at least on weekends - we found a spot directly across the street! We will definitely be back -- can't wait to try some of the other menu choices. Lovely place to spend a sunny...or foggy morning.", "rating": 5, "date": "2016-04-18"}, {"excerpts": ["I tried the Pomba (toast, bacon, brie, egg in the hole, $7) and Nono (eggs, tomato, cheese, toast, $7). ", "Both was good but the portion size not too large. "], "author": "Sebastian F.", "review": "Stable Cafe is a good place for breakfast, brunch, and lunch. It's located near Folsom and 17th so a bit off the craziness on Mission. Maybe that explains why this place isn't too overly busy at times where you have to wait 30mins plus elsewhere to get a table.\n\nThe menu offers a variety of healthy breakfast choices - from yogurt, oatmeal, to bagels and sandwiches that are mostly combinations of either panini or dark bread with egg, and cheese/bacon/veggies on the side. I tried the Pomba (toast, bacon, brie, egg in the hole, $7) and Nono (eggs, tomato, cheese, toast, $7). Both was good but the portion size not too large. I was actually still hungry afterwards.\n\nThe coffee however was great - you can get French Press ($2.75) or regular coffee that was nicely bold and flavorful.\n\nApart from the food, nice job on the interior (fellow Yelper Janice C. mentioned it used to be a police horse stall before?) - Stable Cafe is not too big but they made the most of the rather small interior. \n\nI'll be back here when I'm in the area!", "rating": 3, "date": "2014-05-31"}, {"excerpts": ["POMBA ($6.50) - ", "the menu online is false, i was charged $6.50. "], "author": "Jane A.", "review": "THE MISTERY OF THE BLACK BUILDING\n(3.8 stars)\n\nThe day i went they had some great music playing. Not sure what genre it was but it was better then all other cafe music i've heard. Great face, away from busy but close to busy. Parking was cake. The place is not in a busy area but of walking distance to busy-ness. No line and plenty of seating. Three Babes Bakeshop and Stable Cafe share the outdoor seating area. I'm such an idiot for ordering at Stable Cafe and not ordering anything from Three Bades Bakeshop (they server mini pies). \n\n- Food, good (fresh and organic)\n- Price, decent\n- Service, good\n- Ambiance, cute cozy cafe\n\nPassed this place everytime I do my grocery shopping at Rainbow Groceries. It was definately one of those Sundays where \"it's too damn nice to be inside doing nothing\". I've dedicated Sundays as cafe days when I have no plans and nowhere to be; hiding from the world \"LEAVE ME ALONE\" kind of mood because I need to catch up on a book.\n\nHEFFER-STYLE STATUS.\n\n**See picture**\n\nPOMBA ($6.50) - the menu online is false, i was charged $6.50. It was toast, bacon (cant eat meat at this time), gouda, and a whole egg. Presentation of the place was clean; didnt understand why the bacon and the slice of gouda made an \"X\" over my toast. When they say \"A WHOLE EGG\" they literally cut a perfect circle in my thick slice of toast and put the egg inside (pretty cool!). It was a simple breakfast, nothing filling. I did not feel heavy after eating. \n\nHOT COCOA (~$2+) - off the caffine and had to go with a different hot beverage. cocoa was creamy and smooth. they did not and nor did i, add any sugar. servered in a glass cup with a cool crooked spoon.\n\nPELLIGRINO (~$2) - ordered me some snotty water to quench my thirst.\n\nIt was lunchtime and other people around me have ordered lunch items. I am a fool, i totally should have ordered a lunch item. They looked healthy and filling and the sandwiches look great. I suggest coming here to get lunch over breakfast.\n\nWill I be back? Yes (for lunch). Its not like all those other cafe's in the city where it's overly packed. I can enjoy a cafe environment on my laptop, with my book, or with my journal.\n\nUntil the next review..", "rating": 4, "date": "2011-06-13"}, {"excerpts": ["Got the pomba, I think--the one with toast, brie, egg and bacon. "], "author": "Angela H.", "review": "At this point, I've been here twice. Both times the coffee was excellent (cappuccino).\n\nThe second time we went, we got some breakfast. Got the pomba, I think--the one with toast, brie, egg and bacon. The bread was very very good (and perfectly buttery), very generous on the brie, egg was delicious (but we kinda wished it was just an over easy egg, not scrambled), and bacon was average.\n\nAll in all, I'll be coming back here a few more times before I move away from the city. Love the front of the cafe and the design inside is excellent as well. Staff are friendly and quick with service.", "rating": 4, "date": "2011-06-14"}, {"excerpts": ["I used to love going to stable and grabbing their Pomba in the morning. ", "I'd randomly wander in some days for lunch, its a nice place to sit and people watch. ", "I like how it really does feel kind of like a stable. ", "And the cute guys working the cash wrap make it that much more fun."], "author": "Analisa S.", "review": "I used to love going to stable and grabbing their Pomba in the morning. I'd randomly wander in some days for lunch, its a nice place to sit and people watch. I like how it really does feel kind of like a stable. And the cute guys working the cash wrap make it that much more fun.", "rating": 5, "date": "2011-06-08"}], "piaf": [{"excerpts": ["I had every intention of choosing between the yogurt with granola or the hot oats, but what appealed to me in the moment was the $6 Piaf, which was a roasted tomato topped with scrambled eggs and slices of brie ", "(photo: http://bit.ly/2wrVssH). ", "With a good dousing of hot sauce, it was a light, delicious treat since it had been a while since I had eaten eggs. ", "I added a satisfying $3.50 Four Barrel Cafe au Lait to complete the meal ", "(photo: http://bit.ly/2Bz0glH). ", "I liked the vibe so much I came back a few weeks later to have the same Cafe ", "au Lait out on their enclosed terrace which serves as a community space (photo: http://bit.ly/2wjJFfI). ", "This space must have been where the horses ate their oats. "], "author": "Ed U.", "review": "What a nice find in the Mission, and I don't think if has anything to do with horses. There were no photos of Seabiscuit or Mr. Ed on the walls. The name could refer to the mental state of the customers who linger here as it's a becalming spot that doesn't induce fits of hysteria unless we all start talking about the current political landscape. Actually I found out later that the building was once a carriage house so now I get it. I came in here thinking I could get a light breakfast after my gym workout, and I was right as they have quite a menu of creative-sounding global dishes made with fresh, organic ingredients.\n\nI had every intention of choosing between the yogurt with granola or the hot oats, but what appealed to me in the moment was the $6 Piaf, which was a roasted tomato topped with scrambled eggs and slices of brie (photo: http://bit.ly/2wrVssH). With a good dousing of hot sauce, it was a light, delicious treat since it had been a while since I had eaten eggs. I added a satisfying $3.50 Four Barrel Cafe au Lait to complete the meal (photo: http://bit.ly/2Bz0glH). I liked the vibe so much I came back a few weeks later to have the same Cafe au Lait out on their enclosed terrace which serves as a community space (photo: http://bit.ly/2wjJFfI). This space must have been where the horses ate their oats. Tap your hoof once for yes and twice for no.\n\nFOOD - 4 stars...light and fluffy eggs with Four Barrel provided a pleasing morning blend\nAMBIANCE - 4 stars...very chill, especially in the terrace on a nice day\nSERVICE - 4 stars...even-keeled with none of that Tartine 'tude\nTOTAL - 4 stars...are you stable enough for the Stable?\n\nRELATED - Looking for some breakfast? Here's a list of places I've tried and reviewed: http://bit.ly/2At2LFz", "rating": 4, "date": "2018-08-22"}, {"excerpts": ["I got the Piaf with avocado and toast, and drip coffee. ", "So delicious. ", "Everything was fresh and the people working were very friendly."], "author": "Amy G.", "review": "Great atmosphere and clean. You can sit outside in a succulent wonderland. I got the Piaf with avocado and toast, and drip coffee. So delicious. Everything was fresh and the people working were very friendly.", "rating": 5, "date": "2017-07-01"}, {"excerpts": ["I ordered the Piaf and a cup of coffee. ", "Both were excellent! ", "Loved the atmosphere. ", "We sat upstairs which was pleasantly warm on this chilly San Francisco morning. ", "I can't wait to return!"], "author": "Stacey A.", "review": "Enjoyed my time at the Stable Cafe this morning. The woman at the counter was helpful and knowledgeable about gluten free options. I ordered the Piaf and a cup of coffee. Both were excellent! Loved the atmosphere. We sat upstairs which was pleasantly warm on this chilly San Francisco morning. I can't wait to return!", "rating": 4, "date": "2016-07-07"}, {"excerpts": ["I had the piaf -- which was a lovely fresh tomato baked, then brie melted on that and then topped with an egg.  ", "It was the perfect size and a good price at $4.50.  "], "author": "Johanna w.", "review": "yum yum gimme sum!\n\nI had the piaf -- which was a lovely fresh tomato baked, then brie melted on that and then topped with an egg.  It was the perfect size and a good price at $4.50.  I'm super psyched to find a yum breakfast item with no bread and just my size.\n\nThey also had egg in a hole with bacon on the menu.  I LOVE egg in a hole!\n\nFriendly service, great space, around the corner from work.", "rating": 4, "date": "2008-10-29"}, {"excerpts": ["i very much enjoyed the 'piaf', which is egg on top of brie and tomato - baked. ", "it's really yummy. "], "author": "Rosalee C.", "review": "came here too early because they had a limited menu displayed. \n\ni very much enjoyed the 'piaf', which is egg on top of brie and tomato - baked. it's really yummy. [i want one right now.]\n\nkim recommended to have lunch here during the week; they have great specials, but they close early. i guess i'll never try it because the only time i work is only on weekdays, business hours. boo.", "rating": 4, "date": "2008-11-22"}], "hot cereal": [{"excerpts": ["I recommend the hot cereal. ", "It comes with massive raspberries. ", "This is a five star cafe, if there ever was one. ", "Nicely done."], "author": "Regina S.", "review": "I've ridden by this place almost every day for the past two months and hadn't noticed it. That is a tragedy, because I've been missing out on a quality cafe experience. As you can see, I've given five stars to a cafe. This is not my style, but I feel it is warranted. \n\nFirst off, the baristas are really, really nice and they make a great pressed yerba mate. Second, the design is fabulous. I love the floors and massive i-beams (wish they would post a write-up in the history of the building). Third, the breakfast items and lunch specials are delicious. I recommend the hot cereal. It comes with massive raspberries. This is a five star cafe, if there ever was one. Nicely done.", "rating": 5, "date": "2009-03-23"}], "yogurt": [{"excerpts": ["Heads up, the large yogurt bowl is pretty big with tons of fruit and good for like 2 people. \n", "Lox bagel is filled with a lot of smoked salmon and the breakfast burrito is stuffed with eggs - satisfying breafast.  ", "I wouldn't say the food stood out to me that much. ", "Dont get me wrong though. ", "It was solid, good food with great presentation, and I really enjoyed it, but there wasn't anything especially unique. ", "The service was pretty good too. ", "I'd definitely come back here because overall it was a good experience."], "author": "Rachelle C.", "review": "I really liked the vibe here. You order before finding a seat and you should be able to find one by the time you order. The layout is pretty cool with some tables inside (small section upstairs and a couple on the ground floor) that seem pretty nice to chill and do work at. There's also a bunch of seating outside to enjoy with your four legged friend. \n The eggs were pretty fluffy and if you ask for a bagel with just eggs and cream cheese in it, then they give you A LOT of eggs - overflows and drapes over the bagel like a dress.  \nHeads up, the large yogurt bowl is pretty big with tons of fruit and good for like 2 people. \nLox bagel is filled with a lot of smoked salmon and the breakfast burrito is stuffed with eggs - satisfying breafast.  I wouldn't say the food stood out to me that much. Dont get me wrong though. It was solid, good food with great presentation, and I really enjoyed it, but there wasn't anything especially unique. The service was pretty good too. I'd definitely come back here because overall it was a good experience.", "rating": 4, "date": "2018-10-15"}, {"excerpts": ["I had every intention of choosing between the yogurt with granola or the hot oats, but what appealed to me in the moment was the $6 Piaf, which was a roasted tomato topped with scrambled eggs and slices of brie ", "(photo: http://bit.ly/2wrVssH). ", "With a good dousing of hot sauce, it was a light, delicious treat since it had been a while since I had eaten eggs. ", "I added a satisfying $3.50 Four Barrel Cafe au Lait to complete the meal ", "(photo: http://bit.ly/2Bz0glH). ", "I liked the vibe so much I came back a few weeks later to have the same Cafe ", "au Lait out on their enclosed terrace which serves as a community space (photo: http://bit.ly/2wjJFfI). ", "This space must have been where the horses ate their oats. "], "author": "Ed U.", "review": "What a nice find in the Mission, and I don't think if has anything to do with horses. There were no photos of Seabiscuit or Mr. Ed on the walls. The name could refer to the mental state of the customers who linger here as it's a becalming spot that doesn't induce fits of hysteria unless we all start talking about the current political landscape. Actually I found out later that the building was once a carriage house so now I get it. I came in here thinking I could get a light breakfast after my gym workout, and I was right as they have quite a menu of creative-sounding global dishes made with fresh, organic ingredients.\n\nI had every intention of choosing between the yogurt with granola or the hot oats, but what appealed to me in the moment was the $6 Piaf, which was a roasted tomato topped with scrambled eggs and slices of brie (photo: http://bit.ly/2wrVssH). With a good dousing of hot sauce, it was a light, delicious treat since it had been a while since I had eaten eggs. I added a satisfying $3.50 Four Barrel Cafe au Lait to complete the meal (photo: http://bit.ly/2Bz0glH). I liked the vibe so much I came back a few weeks later to have the same Cafe au Lait out on their enclosed terrace which serves as a community space (photo: http://bit.ly/2wjJFfI). This space must have been where the horses ate their oats. Tap your hoof once for yes and twice for no.\n\nFOOD - 4 stars...light and fluffy eggs with Four Barrel provided a pleasing morning blend\nAMBIANCE - 4 stars...very chill, especially in the terrace on a nice day\nSERVICE - 4 stars...even-keeled with none of that Tartine 'tude\nTOTAL - 4 stars...are you stable enough for the Stable?\n\nRELATED - Looking for some breakfast? Here's a list of places I've tried and reviewed: http://bit.ly/2At2LFz", "rating": 4, "date": "2018-08-22"}, {"excerpts": ["The menu offers a variety of healthy breakfast choices - from yogurt, oatmeal, to bagels and sandwiches that are mostly combinations of either panini or dark bread with egg, and cheese/bacon/veggies on the side. "], "author": "Sebastian F.", "review": "Stable Cafe is a good place for breakfast, brunch, and lunch. It's located near Folsom and 17th so a bit off the craziness on Mission. Maybe that explains why this place isn't too overly busy at times where you have to wait 30mins plus elsewhere to get a table.\n\nThe menu offers a variety of healthy breakfast choices - from yogurt, oatmeal, to bagels and sandwiches that are mostly combinations of either panini or dark bread with egg, and cheese/bacon/veggies on the side. I tried the Pomba (toast, bacon, brie, egg in the hole, $7) and Nono (eggs, tomato, cheese, toast, $7). Both was good but the portion size not too large. I was actually still hungry afterwards.\n\nThe coffee however was great - you can get French Press ($2.75) or regular coffee that was nicely bold and flavorful.\n\nApart from the food, nice job on the interior (fellow Yelper Janice C. mentioned it used to be a police horse stall before?) - Stable Cafe is not too big but they made the most of the rather small interior. \n\nI'll be back here when I'm in the area!", "rating": 3, "date": "2014-05-31"}, {"excerpts": ["First time: hot chocolate and yogurt parfait. ", "Hot chocolate looked beautiful but was TERRIBLE. ", "Worst hot chocolate I've ever had. ", "Super bitter, no chocolate taste to it at all (not even dark chocolate... it just tasted like bitter water). ", "I threw it away after 2 sips. "], "author": "Marcella D.", "review": "The pros: beautiful space, plenty of seating (both indoor and outdoor), allow dogs, good vegetarian options\nThe cons: SO expensive. They have increased their prices and their online menu (http://www.stablecafe.com/Assets/LUNCH-MENU.jpg) quotes their prices about $2-2.50 cheaper than what they charge in person\n\nI've been here twice.\n\nFirst time: hot chocolate and yogurt parfait. Hot chocolate looked beautiful but was TERRIBLE. Worst hot chocolate I've ever had. Super bitter, no chocolate taste to it at all (not even dark chocolate... it just tasted like bitter water). I threw it away after 2 sips. Parfait was decent, but the granola had a weird bitter taste to it, too.\n\nSecond time: Got the quinoa salad (good, but so not worth $11. The to-go version is tiny and way over-priced) and the croissant (good). Altogether, it was just shy of $15.\n\nI WANTED to like this place. The space is beautiful. I could see myself taking a long lunch break in their beautiful outdoor space. But so far my experience has been subpar and expensive.", "rating": 2, "date": "2015-04-23"}, {"excerpts": ["I was going to get some yogurt when i was rudely reminded ", "\"actually I can't do that for you. ", "We actually stop serving breakfast at 11"], "author": "Eilene G.", "review": "This place is good and has an awesome outdoor patio, but good lord what is with the attitude from employees? \n\nCame here early this afternoon and was waiting for a friend, so I decided to go ahead and place an order. I was going to get some yogurt when i was rudely reminded \"actually I can't do that for you. We actually stop serving breakfast at 11\" *smirk*. Ordered some coffee and literally 3 people had to help with the transaction and at one point the same employee tried to hand me back my money when someone else finally took over and gave me my change. \n\nThe customer ahead of me had her latte made right away and here is where I guess someone decided to go on break and no one was making anymore coffee. I waited a few minutes and my friend arrived, we greeted each other and she waited in line to place her order. She asked me what I wanted and I told her I already ordered and was still waiting for my latte.\n\nAfter 10 minutes all it took was the woman with long braided hair overhearing my conversation about waiting for coffee that she decides to finally make it. But not without talking about me to her coworker while I was just 2 feet away \"yeah the one with the lips\" (I was wearing dark lipstick) \"she couldn't wait for her coffee\". \n\nI've heard this place has an attitude problem from so many people and now that I've finally been here I can see what they mean. I only wish I could have taken back my tip from such rude service.", "rating": 2, "date": "2014-10-29"}, {"excerpts": ["Also there is a strange portion discrepancy in their $5 regular yogurt & granola which came in what seemed like a 1/3 cup container when ordered to go and the $7 large which was a giant mass of food for a family. \n", "- Service is very slow. ", "Even ordering a bottled water takes ages. ", "The staff is this mix of \"I'm too sexy for this cafe\" baristas who will swing back and forth from super nice to completely disinterested and slightly apathetic.\n", "- Coffee. ", "So-so.  ", "Kind of watery on certain visits."], "author": "Joyce K.", "review": "I really wanted to like this place - beautifully designed space, good menu, coffee, outdoor seating.  But, after my 4 or 5 visits there, I have been disappointed. \n\n- Food is hit or miss.  Some dishes are great, some fall flat.  Also there is a strange portion discrepancy in their $5 regular yogurt & granola which came in what seemed like a 1/3 cup container when ordered to go and the $7 large which was a giant mass of food for a family. \n- Service is very slow. Even ordering a bottled water takes ages. The staff is this mix of \"I'm too sexy for this cafe\" baristas who will swing back and forth from super nice to completely disinterested and slightly apathetic.\n- Coffee. So-so.  Kind of watery on certain visits.", "rating": 2, "date": "2009-11-11"}, {"excerpts": ["The coffee is amazing and the yogurt and granola is the best that I have ever had!"], "author": "Laura P.", "review": "I love everything about this place.  The coffee is amazing and the yogurt and granola is the best that I have ever had!", "rating": 5, "date": "2009-03-13"}, {"excerpts": ["Except the yogurt. ", "The yogurt I had there yesterday turned my smile upside down. ", "Granola & fruit on top were tasty. ", "Bad yogurt is a minor flaw. ", "So I'm just going to cross my fingers and hope they jump on the Straus yogurt train in the near future. "], "author": "Becah D.", "review": "After several evening walk-bys, I finally got to check this place out when it was open during Open Studios this past weekend. I've now been 3 times in as many days. Despite the fact that my daily commute takes me past several coffee/pastry gems in the Mission, Stable is my new favorite.\n\nWhoever designed and decorated this space is a genius. From the moment I walked in the door and saw three Blair Bradshaw paintings hanging up in the loft, I was in love. Great coffee, yummy pastries, tasty fresh fruit, wonderful ingredients. Every little detail puts a smile on my grumpy morning face. There's nothing not to love about this place. \n\nExcept the yogurt. The yogurt I had there yesterday turned my smile upside down. Granola & fruit on top were tasty. Bad yogurt is a minor flaw. So I'm just going to cross my fingers and hope they jump on the Straus yogurt train in the near future. Because I'd like Stable to be a regular stop on my commute. \n\nI'm also going to hope that the hours really will be expanding soon.\n\nCan't wait to try the rest of the food, it looks/sounds delicious!", "rating": 4, "date": "2008-10-21"}, {"excerpts": ["My friend and I split a piece of quiche and the yogurt with fruit and granola.  ", "The piece of quiche was quite small and not as good as the one I make, but the yogurt was really great.  ", "It came with homemade granola, raspberries, bananas, and blueberries.  ", "Stable was pretty quiet, being that it's off the beaten path on Folsom.  ", "There were some students working on homework and ", "a couple people reading the paper. \n", "I'm docking them a star because they close at 4.  ", "I will never be able to come here on a regular basis."], "author": "Sarah M.", "review": "My friend and I went into 4 Barrel the other day, only to be told they only accept cash.  We walked out the door pretending to go to the ATM, but really got back in the car and headed to Stable.  They'd both been bookmarked forever, so I didn't really care which one we went to, I wanted to try them both.\nStable does French press coffee and a great selection of food items, not just bagels and muffins.  My friend and I split a piece of quiche and the yogurt with fruit and granola.  The piece of quiche was quite small and not as good as the one I make, but the yogurt was really great.  It came with homemade granola, raspberries, bananas, and blueberries.  Stable was pretty quiet, being that it's off the beaten path on Folsom.  There were some students working on homework and a couple people reading the paper. \nI'm docking them a star because they close at 4.  I will never be able to come here on a regular basis.", "rating": 4, "date": "2009-02-12"}, {"excerpts": ["it was served cold to boot, and when i mentioned this i was offered a free coffee on my next visit; OK response, but a little weak.\n\non the other hand, the granola with yogurt and fruit was so good that i am still craving it. "], "author": "Alex H.", "review": "3 stars is the average of 5 stars and 1 star. \n\nwhen they're good, they're great; they've made cappuccinos that are the best i've had in the city. they've also made ones with no foam, too bitter, and with a weird metallic flavor. there are more of the latter than the former.\n\nthe food is inconsistent. i've gotten the oatmeal with fruit, and it was cold and the berries were moldy. i've also gotten incredibly mediocre sandwiches, and the empanada i was served today was among the worst i've ever had (lord knows i've had a lot of empanadas in my day). it was served cold to boot, and when i mentioned this i was offered a free coffee on my next visit; OK response, but a little weak.\n\non the other hand, the granola with yogurt and fruit was so good that i am still craving it. ditto on the breakfast burrito. the quinoa salad is also very very good.\n\nthe service is identically hit and miss. some days extremely friendly, some days incredibly aloof. they all have the habit of not making any eye contact until they are ready to take your order - even if you are standing alone at the counter for five minutes while they make coffees and they are a foot away from you.  its unusual and unnerving. there is a strong clubby feel to the place; they are chummy with the regular \"cool kids\" and seemingly cold and aloof to everyone else (me, for example! i guess no one thinks social science grad students are cool).\n\nthey're also getting a bit too big for their britches. the lunch rush is a disaster. the atmosphere is very nice around mid morning.\n\ni don't know. i keep going back after swearing its the last time. if i were more clever i'd make a hysterical and witty analogy to ex-girlfriends. why must you be so maddening, stable cafe?", "rating": 3, "date": "2009-10-08"}, {"excerpts": ["but what's with the crappy brand of yogurt?  ", "Total miss on that one.  ", "Fix that ", "and it's 5 stars. ", "Stick with that ", "and it shows local, organic and sustainable values aren't universal."], "author": "Chris A.", "review": "Great place but what's with the crappy brand of yogurt?  Total miss on that one.  Fix that and it's 5 stars. Stick with that and it shows local, organic and sustainable values aren't universal.", "rating": 3, "date": "2008-11-26"}], "toast": [{"excerpts": ["We ordered the nono (tomato slices, two eggs and melted cheese on crispy baguette slices) and the avocado toast. ", "They were good, not too filling but satisfying. ", "Coffee was a bit acidic for me but tasted great with a splash of oat milk which the cashier/barista mentioned was all the rage right now. ", "Other notes... ", "Bus your own tables. ", "$1 coffee refills. ", "Glasses & water cooler outside for self service"], "author": "Sarah M.", "review": "Good place for simple breakfast and coffee. Both indoor and outdoor seating available. Decor outside is cute with lots of greenery. It feels like a little oasis stepping in.\nWe ordered the nono (tomato slices, two eggs and melted cheese on crispy baguette slices) and the avocado toast. They were good, not too filling but satisfying. Coffee was a bit acidic for me but tasted great with a splash of oat milk which the cashier/barista mentioned was all the rage right now. Other notes... Bus your own tables. $1 coffee refills. Glasses & water cooler outside for self service", "rating": 5, "date": "2018-05-06"}, {"excerpts": ["For my meal, I ordered stable eggs, which came with two sunny side up eggs, baguette toast, salami, and asparagus. ", "The food was okay, but there wasn't anything exceptional about it. ", "The toast was probably the best part of it. \n\n"], "author": "Jackie C.", "review": "My brother and sis-in-law were in town, so we went out for breakfast before they had to head out of SF. We landed at Stable Cafe. The interior is a bit cozy, but the outdoor seating is what makes this place. It's a huge space, and has tons of plants to make it feel like a secret garden. It would be perfect to eat outside on a nice day. Ordering is casual as you go up to the counter tops and place your order.\n\nFor their coffee, they use four barrel beans. I was excited for my drink and ordered a cappuccino. Honestly, wasn't very impressed with it. The coffee portion seemed a bit weak, and it wasn't as foamy as I would have liked my drink to be. For my meal, I ordered stable eggs, which came with two sunny side up eggs, baguette toast, salami, and asparagus. The food was okay, but there wasn't anything exceptional about it. The toast was probably the best part of it. \n\nThe order comes out pretty quickly though, and the servers are helpful. Pricing is also great for SF living. I would plan breakfast better next time and try a different place. Although if you're looking for a good outdoor ambiance, then this is your place.", "rating": 3, "date": "2017-11-19"}, {"excerpts": ["This spot is right up my alley--I honestly could've sat there all day, ordering multiple rounds of coffee and toast and testing out different corners of the coffee shop and patio. \n\n", "I ordered a cup of coffee and an avocado toast. ", "Now, there are lots of ways you can ", "avo toast", "--you can smash it or mash it, slice it. ", "top it with lemon...", "don't even get me started on salts. ", "Stable slices their avocado and tops that with a hard boiled egg--while I'd personally prefer a soft boiled egg and mashed avocado, this was pretty bomb. ", "We ate out on the patio, which was a total dream. "], "author": "Megan R.", "review": "SF, you are #patiogoals. So many pretty spots to sit outside and watch the fog burn off. So many plants. So many vibes. Knowing my love for the aforementioned patios, plants, and vibes, a friend took me to Stable to grab some breakfast and get some work done. This spot is right up my alley--I honestly could've sat there all day, ordering multiple rounds of coffee and toast and testing out different corners of the coffee shop and patio. \n\nThis cafe has some nice breakfast-y options--mostly things on good, crusty bread. I ordered a cup of coffee and an avocado toast. Now, there are lots of ways you can avo toast--you can smash it or mash it, slice it. top it with lemon...don't even get me started on salts. Stable slices their avocado and tops that with a hard boiled egg--while I'd personally prefer a soft boiled egg and mashed avocado, this was pretty bomb. We ate out on the patio, which was a total dream. There was even a little wood burning stove in the back surrounded by the prettiest plants--not sure what they use it for, but it was gorgeous.\n\nThe servers here are a hoot and were so kind. They have a few beer and wine options if you want to sit and stay awhile, plus a dessert or two to satisfy your sweet tooth. I'd most definitely come back here--actually, can I just move in?", "rating": 5, "date": "2017-08-09"}, {"excerpts": ["Superrrr cute restaurant with the nicest (shaded) outdoor patio and stellar coffee and avocado toast. ", "However, do not make the mistake of order eggs here. ", "I ordered the Pliaf (scrambled eggs on Brie and tomato) and they straight up served me an omelette and said it was their version of scrambled eggs - kind of disappointing but cute atmosphere and only $6. ", "They also don't have ANY wall outlets to charge your computer ", "so if you plan to work here - make sure you're all juiced up."], "author": "Sam M.", "review": "Superrrr cute restaurant with the nicest (shaded) outdoor patio and stellar coffee and avocado toast. However, do not make the mistake of order eggs here. I ordered the Pliaf (scrambled eggs on Brie and tomato) and they straight up served me an omelette and said it was their version of scrambled eggs - kind of disappointing but cute atmosphere and only $6. They also don't have ANY wall outlets to charge your computer so if you plan to work here - make sure you're all juiced up.", "rating": 4, "date": "2018-06-15"}, {"excerpts": ["Excellent coffee drinks (with some interesting yet non-foufy offerings, like a Cordero), and where else can you get avocado toast for a mere five dollars? ", "And with a hard-boiled egg, no less?!?"], "author": "Kim S.", "review": "Lovely little well-lit cafe and lunch spot in a converted, turn-of-the-century stable, just around the corner from my SF office, that came highly-recommended by a runner friend. Excellent coffee drinks (with some interesting yet non-foufy offerings, like a Cordero), and where else can you get avocado toast for a mere five dollars? And with a hard-boiled egg, no less?!?", "rating": 4, "date": "2018-05-20"}, {"excerpts": ["I go for their Avocado Toast, nutella toast, or any of their paninis which come with salad ", "(asparagus/goat cheese is the best). \n.\n", "It's just a cool place to go with a hip, tech professional vibe that's not  pretentious."], "author": "Joan W.", "review": "It's all about the patio here which is a beautiful oasis of tranquility and style in this random location in the industrial part of the Mission.  Whoever designed this place put a lot of thought into the details of the patio and cafe which is located in an old carriage house. \n\nI go for their Avocado Toast, nutella toast, or any of their paninis which come with salad (asparagus/goat cheese is the best). \n.\nIt's just a cool place to go with a hip, tech professional vibe that's not  pretentious.", "rating": 5, "date": "2017-10-06"}, {"excerpts": ["Not a lot of seating available but the Brie toast was delish. ", "Vanilla latte didn't taste much of a vanilla latte. ", "Customer service was really nice! ", "Busy on a Sunday morning brunch. ", "Outside seating available with lots of space."], "author": "Yana P.", "review": "Not a lot of seating available but the Brie toast was delish. Vanilla latte didn't taste much of a vanilla latte. Customer service was really nice! Busy on a Sunday morning brunch. Outside seating available with lots of space.", "rating": 4, "date": "2018-03-05"}, {"excerpts": ["I got the vanilla latte and avocado toast. ", "Honestly wasn't the best... ", "The setting was better than the food and coffee..."], "author": "Alison L.", "review": "I got the vanilla latte and avocado toast. Honestly wasn't the best... The setting was better than the food and coffee...", "rating": 2, "date": "2018-06-20"}, {"excerpts": ["Ordered panini and avocado toast ", "- it's fresh and tasty. ", "Best cappuccino I tried in San Francisco"], "author": "Konstantin R.", "review": "Nice and cozy place. Ordered panini and avocado toast - it's fresh and tasty. Best cappuccino I tried in San Francisco", "rating": 5, "date": "2018-03-15"}, {"excerpts": ["The toast was difficult to cut thru, even adding bacon couldn't save the meal for me. ", "My gf said the chilaquiles were okay but also felt nothing special to them. ", "I'll stay away from the food or maybe go with something simple/cheap like the avocado toast."], "author": "D B.", "review": "(04/23/17) Really cool place with awesome outdoor seating. Inside seating is pretty limited. As for the food, meh. The NONO open face sandwich was a no-no for me. Nothing special and the flavor was lacking. It wasn't appealing to the eyes especially with the provolone melted on top of the eggs making them look more pale and sad. The toast was difficult to cut thru, even adding bacon couldn't save the meal for me. My gf said the chilaquiles were okay but also felt nothing special to them. Almost $30 for both dishes and an OJ was definitely not worth it! \n\n3 stars for the atmosphere and good service we received when placing our order. I would come back only to get coffee and sit outside on a nice sunny day. I'll stay away from the food or maybe go with something simple/cheap like the avocado toast.", "rating": 3, "date": "2017-04-24"}, {"excerpts": ["it was unchewable even without the thick encrustment of white flour -- and you couldn't even toast it for 9 bucks? \n\n"], "author": "Zach B.", "review": "C'mon you guys, that egg sandwich is a joke. Bread so thick and dry it was unchewable even without the thick encrustment of white flour -- and you couldn't even toast it for 9 bucks? \n\n2 stars for the sandwich and 1 star for the dark, depressing trap music which is totally discordant in the business meeting atmosphere.", "rating": 1, "date": "2018-05-15"}, {"excerpts": ["Toast was too thick and underdone.  ", "Eggs were overdone and chewy.  ", "Bacon was perfectly done so that was nice.  ", "Blackberries were a nice touch.  "], "author": "Sarah R.", "review": "The patio is beautiful - a unique oasis in the Mission.  While I had a lackluster experience food and service-wise, if you're looking for a green getaway, the setting makes a visit worth it.  \n\nI got the Pomba, which turned out about the same as the Egg-In-A-Hole I made in 7th grade Home Economics class.  Toast was too thick and underdone.  Eggs were overdone and chewy.  Bacon was perfectly done so that was nice.  Blackberries were a nice touch.  It'd be great if they carried a hot sauce other than Tapatillo.  \n\nThe staff are typical trendier-than-thou servers who seemingly were never taught basic manners.  I worked in the retail and service industries for more than fifteen years and I know how much it can suck, but it's your job to be decent to people.", "rating": 2, "date": "2017-11-13"}, {"excerpts": ["Oats were on point and so was ago toast. ", "Wish I had room to try more. ", "See pics!"], "author": "Maria O.", "review": "Such a great place! Quality food and totally reasonable prices. Oats were on point and so was ago toast. Wish I had room to try more. See pics!", "rating": 5, "date": "2017-10-14"}, {"excerpts": ["Avocado toast was an affordable $5 but you get what you pay for. ", "Basically just wheat toast, sliced avocado with salt and peppers and a hardboiled egg. ", "I had a sample of their pastry and ", "I think next time I'll go for the pastries instead - very flavorful and sweet!"], "author": "Taryn Q.", "review": "Ambiance: super cute cafe with plenty of outdoor seating and wifi! NOTE: no outlets available anywhere! Good music as well which is always a plus :)\nFood: Avocado toast was an affordable $5 but you get what you pay for. Basically just wheat toast, sliced avocado with salt and peppers and a hardboiled egg. I had a sample of their pastry and I think next time I'll go for the pastries instead - very flavorful and sweet!", "rating": 4, "date": "2017-04-30"}, {"excerpts": ["For $7, I got the Pomba (toast, bacon, brie, and egg in the hole). ", "The toast is Texas toast, lightly buttered and perfectly toasted. ", "The bacon is nicely cooked with crisp edges, but still slightly chewy. ", "The brie was laid over the hot toast and egg, making it melt and ooze into all the crevices. ", "The egg was cooked to perfection and nicely scrambled in the hole. ", "Two blackberries for garnish and this dish was just everything I could want in a sinfully delicious breakfast. ", "So filling, it kept me going '"], "author": "Leana L.", "review": "My bf likes to show me all his new finds in the Mission and one Thursday morning before heading up to Yosemite to hike Half Dome that weekend, he took me to Stable Cafe.\n\nLocation: Definitely out of the way. There's basically nothing else around this area.\n\nFood: The menu is small, but the choices are mouthwatering. For $7, I got the Pomba (toast, bacon, brie, and egg in the hole). The toast is Texas toast, lightly buttered and perfectly toasted. The bacon is nicely cooked with crisp edges, but still slightly chewy. The brie was laid over the hot toast and egg, making it melt and ooze into all the crevices. The egg was cooked to perfection and nicely scrambled in the hole. Two blackberries for garnish and this dish was just everything I could want in a sinfully delicious breakfast. So filling, it kept me going 'til we had an early dinner later that day!\n\nCoffee: I got a latte with almond milk. Delicious. And cute coffee art on the top. Also bonus points for serving coffee in glass -- I'm a fan of this trend.\n\nService: You order at the counter and they bring the food to your number wherever you decide to sit. However, you need to grab your coffee yourself. I wanted a latte with 2% milk, but they only had whole milk and nonfat. The employee suggested a mixture of the two, but I said nonfat was fine. Then she suggested almond milk. It was like she read my mind! Always a fan of almond milk. Friendly service for sure :)\n\nAmbiance: Cute place where you can have a leisurely breakfast, or grab something quick if you have 15 minutes to spare. They have a small seating area inside and a larger patio area outside adorned with a lot of cute drought-resistant plants. Apparently you can also rent out the back space which is good for small gatherings/parties.\n\nWould I return? YES. Delicious food, great coffee, friendly service, and cute cafe.", "rating": 5, "date": "2014-09-08"}, {"excerpts": ["My only problem was that the avocado toast was not nearly enough food for a full breakfast and it wasn't as good as other places. \n\n"], "author": "Kelsey O.", "review": "Loved the look and feel of this place. The outside patio felt like hanging out in a friend's well decorated backyard. Very comfortable and welcoming. The employees were friendly and upbeat. \n\nMy only problem was that the avocado toast was not nearly enough food for a full breakfast and it wasn't as good as other places. \n\nOverall, I like this place and will be back because the patio is awesome.", "rating": 4, "date": "2017-01-24"}, {"excerpts": ["I got the Piaf with avocado and toast, and drip coffee. ", "So delicious. ", "Everything was fresh and the people working were very friendly."], "author": "Amy G.", "review": "Great atmosphere and clean. You can sit outside in a succulent wonderland. I got the Piaf with avocado and toast, and drip coffee. So delicious. Everything was fresh and the people working were very friendly.", "rating": 5, "date": "2017-07-01"}, {"excerpts": ["I got the scrambled eggs with toast and jam. ", "The jam was really pleasant and the eggs were cooked perfectly. ", "I got a Mimosa or two, which is served in a regular drinking glass as opposed to a stemmed champagne glass. ", "So you certainly feel like you're drinking more! ", "I also ordered the fresh fruit, which was certainly fresh. ", "The cafe is set up where you order food inside and are given a number. ", "They then bring your food out, so I can't really comment on service. ", "It seemed like all of the employees were friendly, though."], "author": "Mandy R.", "review": "This cafe was recommended to me and I'm so glad it was. The outdoor space is really unique and inviting; we could have sat there for hours. There are tons of succulents for purchase and a beautiful canope for shade.\n\nI got the scrambled eggs with toast and jam. The jam was really pleasant and the eggs were cooked perfectly. I got a Mimosa or two, which is served in a regular drinking glass as opposed to a stemmed champagne glass. So you certainly feel like you're drinking more! I also ordered the fresh fruit, which was certainly fresh. The cafe is set up where you order food inside and are given a number. They then bring your food out, so I can't really comment on service. It seemed like all of the employees were friendly, though.", "rating": 5, "date": "2016-06-13"}, {"excerpts": ["I ordered avocado toast and a side salad. ", "Just finding parking was difficult."], "author": "Alina M.", "review": "Loved the patio! It was really quiet. I ordered avocado toast and a side salad. Just finding parking was difficult.", "rating": 5, "date": "2017-03-28"}, {"excerpts": ["I ordered the avocado toast and asked to add a poached egg. ", "They ran out of avocado and declared they don't poach eggs (only fry them) because they don't boil water to poach eggs. "], "author": "Tom P.", "review": "I ordered the avocado toast and asked to add a poached egg. They ran out of avocado and declared they don't poach eggs (only fry them) because they don't boil water to poach eggs. I ordered a tea (boiled water in a glass with a tea bag added) without issue.\n\nI had the stable eggs instead which was fine. \n\n2 stars for the nonsense of being against poached eggs and running out of stuff during a Saturday morning brunch service.", "rating": 2, "date": "2016-10-23"}, {"excerpts": ["Enjoyed the avocado toast and a vanilla latte, highly recommend the spicy and sweet combo. ", "Definitely will be coming back!"], "author": "Jenni M.", "review": "A+ for ambiance! This spot is such a hidden gem with the most beautiful succulent garden in the back. Enjoyed the avocado toast and a vanilla latte, highly recommend the spicy and sweet combo. Definitely will be coming back!", "rating": 5, "date": "2016-03-20"}, {"excerpts": ["I got something simple, eggs and toast with jam, while my friend got a breakfast wrap. ", "The real winning apsect of this cafe is the large outdoor space, filled with succulents and wooden accents. ", "It was a bit chilly ", "but otherwise, we would've stayed longer. ", "Would love to come back on a sunnier day!"], "author": "Morgen B.", "review": "We were searching for a chill breakfast place in the mission after waiting in line for the Balmain x H&M for all of 10 minutes before deciding that we were very much over that shit and very hungry. We slid in right before breakfast was over and listen, amen for this sensible breakfast menu! I got something simple, eggs and toast with jam, while my friend got a breakfast wrap. The real winning apsect of this cafe is the large outdoor space, filled with succulents and wooden accents. It was a bit chilly but otherwise, we would've stayed longer. Would love to come back on a sunnier day!", "rating": 4, "date": "2015-11-05"}, {"excerpts": ["I tried the Pomba (toast, bacon, brie, egg in the hole, $7) and Nono (eggs, tomato, cheese, toast, $7). ", "Both was good but the portion size not too large. "], "author": "Sebastian F.", "review": "Stable Cafe is a good place for breakfast, brunch, and lunch. It's located near Folsom and 17th so a bit off the craziness on Mission. Maybe that explains why this place isn't too overly busy at times where you have to wait 30mins plus elsewhere to get a table.\n\nThe menu offers a variety of healthy breakfast choices - from yogurt, oatmeal, to bagels and sandwiches that are mostly combinations of either panini or dark bread with egg, and cheese/bacon/veggies on the side. I tried the Pomba (toast, bacon, brie, egg in the hole, $7) and Nono (eggs, tomato, cheese, toast, $7). Both was good but the portion size not too large. I was actually still hungry afterwards.\n\nThe coffee however was great - you can get French Press ($2.75) or regular coffee that was nicely bold and flavorful.\n\nApart from the food, nice job on the interior (fellow Yelper Janice C. mentioned it used to be a police horse stall before?) - Stable Cafe is not too big but they made the most of the rather small interior. \n\nI'll be back here when I'm in the area!", "rating": 3, "date": "2014-05-31"}, {"excerpts": ["I recommend the Nana - toast with ham, eggs, and cheese. "], "author": "Anthony N.", "review": "At first you have this amazing hip space with one of the best courtyards I've seen in SF that doesn't require an entry fee. You also have a crowd that would otherwise illustrate the perfected mix of SF urbanite you read in those travel magazines.\n\nHowever, the coffee plain sucks and the service isn't too off. Food is not bad, though highly overpriced. I recommend the Nana - toast with ham, eggs, and cheese. You can't go wrong with that.\n\nI really wish they'd get the coffee right, but for now they are alright in my book... Since there's only so many places you can find such a serene outdoor area (that also doubles as a trendy succulent storefront).", "rating": 4, "date": "2013-10-14"}, {"excerpts": ["* Breakfast sandwich $5 - eggs weren't nuked but cooked nicely with gooey cheese, folded over, with scallions, served on thin wheat toast with seeds and nuts and stuff. ", "The bread tasted really healthy and dry. \n"], "author": "Lolia S.", "review": "Laptop camper here. The former stable for police horses turned into a coffeehouse features 2 floors, an industrial vibe, and wood everywhere including the exposed building beams. Small tables and outdoor seating are inviting and the wi-fi is free, but there isn't a power outlet to be found in the seating areas.\n\nThe pastries look better than average and the eggs are \"farm fresh\" courtesy of a farm in Petaluma. The menu includes frittatas, granola, oatmeal, sandwiches, salads, etc. The menu is seasonal.\n\n* Breakfast sandwich $5 - eggs weren't nuked but cooked nicely with gooey cheese, folded over, with scallions, served on thin wheat toast with seeds and nuts and stuff. The bread tasted really healthy and dry. \n* Latte $3: one size, not bad but bitter on bottom, organic beans from De la Paz\n\nThe café clearly doesn't encourage lingering. Even the chairs are uncomfortable.\n\nYou know you love me. X0 X0, laptop camper.", "rating": 4, "date": "2011-11-13"}, {"excerpts": ["It was toast, bacon (cant eat meat at this time), gouda, and a whole egg. ", "Presentation of the place was clean; didnt understand why the bacon and the slice of gouda made an \"X\" over my toast. ", "When they say \"A WHOLE EGG\" they literally cut a perfect circle in my thick slice of toast and put the egg inside (pretty cool!). ", "It was a simple breakfast, nothing filling. "], "author": "Jane A.", "review": "THE MISTERY OF THE BLACK BUILDING\n(3.8 stars)\n\nThe day i went they had some great music playing. Not sure what genre it was but it was better then all other cafe music i've heard. Great face, away from busy but close to busy. Parking was cake. The place is not in a busy area but of walking distance to busy-ness. No line and plenty of seating. Three Babes Bakeshop and Stable Cafe share the outdoor seating area. I'm such an idiot for ordering at Stable Cafe and not ordering anything from Three Bades Bakeshop (they server mini pies). \n\n- Food, good (fresh and organic)\n- Price, decent\n- Service, good\n- Ambiance, cute cozy cafe\n\nPassed this place everytime I do my grocery shopping at Rainbow Groceries. It was definately one of those Sundays where \"it's too damn nice to be inside doing nothing\". I've dedicated Sundays as cafe days when I have no plans and nowhere to be; hiding from the world \"LEAVE ME ALONE\" kind of mood because I need to catch up on a book.\n\nHEFFER-STYLE STATUS.\n\n**See picture**\n\nPOMBA ($6.50) - the menu online is false, i was charged $6.50. It was toast, bacon (cant eat meat at this time), gouda, and a whole egg. Presentation of the place was clean; didnt understand why the bacon and the slice of gouda made an \"X\" over my toast. When they say \"A WHOLE EGG\" they literally cut a perfect circle in my thick slice of toast and put the egg inside (pretty cool!). It was a simple breakfast, nothing filling. I did not feel heavy after eating. \n\nHOT COCOA (~$2+) - off the caffine and had to go with a different hot beverage. cocoa was creamy and smooth. they did not and nor did i, add any sugar. servered in a glass cup with a cool crooked spoon.\n\nPELLIGRINO (~$2) - ordered me some snotty water to quench my thirst.\n\nIt was lunchtime and other people around me have ordered lunch items. I am a fool, i totally should have ordered a lunch item. They looked healthy and filling and the sandwiches look great. I suggest coming here to get lunch over breakfast.\n\nWill I be back? Yes (for lunch). Its not like all those other cafe's in the city where it's overly packed. I can enjoy a cafe environment on my laptop, with my book, or with my journal.\n\nUntil the next review..", "rating": 4, "date": "2011-06-13"}, {"excerpts": ["The Nono is pretty simple, provolone on an egg, on a slice of tomato, on toast...but the inadequate silverware makes even that a bit of a challenge to cut through without grinding into the flatware."], "author": "Colin M.", "review": "I love Stable. Great coffee, and reasonably priced food. The outdoor seating in the succulent garden is awesome and every time I go there are tables available. The Nono is a great simple breakfast, and I've yet to get my eggs anything but perfectly cooked. \n\nMy one and only hope is that they someday replace their silverware. The Nono is pretty simple, provolone on an egg, on a slice of tomato, on toast...but the inadequate silverware makes even that a bit of a challenge to cut through without grinding into the flatware.", "rating": 4, "date": "2015-09-23"}, {"excerpts": ["They were charging $5.50 for PB&J toast ... \n\n"], "author": "Raquel L.", "review": "This place is really amazing in some ways and just blows in other, specifically price & service, but it is so cute I really don't want to go lower than 3 stars.\n\nAtmosphere -  5 stars: I've never been to a cooler looking coffee shop. They have great art on the walls and an amazing patio full of plants. \n\nCoffee & Food - 2 stars: I got an iced americano tasted OK, but they seriously gave me about 6oz of coffee for $3. I also got a plain bagel, again tasted OK, but it seemed like one of those bagels that's actually just a piece of bread shaped like a bagel. \n\nPrice - 1 star: Really not satisfied with how much I paid for what I got. I have no problem blowing money on coffee as long as it's worth it. They were charging $5.50 for PB&J toast ... \n\nService - 1 star: I went in and there was only one other person in there. I still waited 20 minutes for coffee and a bagel. Get your act together.", "rating": 3, "date": "2013-09-16"}, {"excerpts": ["so I decided to visit in search of the excellent egg-on-toast I had here a few weeks back. ", "Unfortunately for me, that dreamy EOT was not on the menu, so I ordered the Chilaquiles with egg. ", "I'm OK with waiting, but I'm not OK with cold food, in particular cold eggs sunny side up. "], "author": "Gary C.", "review": "I really wanted to love her. She was pretty yet approachable, had character and was a bit sassy. As lovable as she was, I just couldn't do it - she was cold. That pretty much sums up the Chilaquiles I was served at Stable Cafe.\n\nEveryone knows the service at Stable Cafe is super slow, so don't visit if you're feeling impatient. Today I was feeling mellow so I decided to visit in search of the excellent egg-on-toast I had here a few weeks back. Unfortunately for me, that dreamy EOT was not on the menu, so I ordered the Chilaquiles with egg. I'm OK with waiting, but I'm not OK with cold food, in particular cold eggs sunny side up. Yuck. \n\nThe sad fact is that I ate it anyway. Why? I just could not brave the slow service twice on one visit. \n\nI want to love Stable Cafe, but I don't know that I can rally for another date. \n\n*tips - during a rush grab a table before ordering or you'll be standing around for long time as the place is tiny.", "rating": 2, "date": "2012-01-21"}, {"excerpts": ["I went there for breakfast one day and had just simple scrambled eggs and toast - awfully disappointing... not tasty at all, cheap bread and jam... eggs were ordinary... ", "I still go there for lunch - there's this mushroom/goat cheese sandwich that's delish - but breakfast no more!"], "author": "Deborah K.", "review": "I went there for breakfast one day and had just simple scrambled eggs and toast - awfully disappointing... not tasty at all, cheap bread and jam... eggs were ordinary... I still go there for lunch - there's this mushroom/goat cheese sandwich that's delish - but breakfast no more!", "rating": 3, "date": "2014-06-02"}, {"excerpts": ["Not only was the Toast, Egg, Bacon, and Brie ", "was the bomb but the businesses made me smile especially since I'm a Entrepreneur at heart.  ", "The Container stole my heart!  ", "I'm going back for all of it!"], "author": "Nenna F.", "review": "I was out in the city for a casting at Nancy Hayes Casting and couldn't find a park near my location.  A drove around the block several times as this is a busy busy area.  Came across Stable Cafe and had to see what it was.  I saw something unique.  Not only a beautiful and welcoming store front but the business collectives that were situated in the back.  Not only was the Toast, Egg, Bacon, and Brie was the bomb but the businesses made me smile especially since I'm a Entrepreneur at heart.  The Container stole my heart!  I'm going back for all of it!", "rating": 5, "date": "2013-07-24"}, {"excerpts": ["Got the pomba, I think--the one with toast, brie, egg and bacon. "], "author": "Angela H.", "review": "At this point, I've been here twice. Both times the coffee was excellent (cappuccino).\n\nThe second time we went, we got some breakfast. Got the pomba, I think--the one with toast, brie, egg and bacon. The bread was very very good (and perfectly buttery), very generous on the brie, egg was delicious (but we kinda wished it was just an over easy egg, not scrambled), and bacon was average.\n\nAll in all, I'll be coming back here a few more times before I move away from the city. Love the front of the cafe and the design inside is excellent as well. Staff are friendly and quick with service.", "rating": 4, "date": "2011-06-14"}, {"excerpts": ["Being that I was hungry and needed something for breakfast I went with the $4.50 toast which sadly came with a small side of unsalted butter and a huge serving of four large pieces of bread and a few blueberries for garnish (", "okay, ", "okay "], "author": "Sera M.", "review": "I went here with my husband based on curiosity, the good reviews and the close proximity to my work. I won't go back. There are other cafes nearby that are much better and for less money.\n\nThe latte I got was bitter and sour. The only thing that would cause your latte to taste like this is an unclean machine. I also asked for a cup of fruit and they told me that they could not sell me fruit as it was only for garnishment. I couldn't help but feel disgruntled in lieu of this. We live in an amazing city that prides itself on its access to fresh local produce and this hip cafe couldn't sell me with a cup of fresh fruit. Being that I was hungry and needed something for breakfast I went with the $4.50 toast which sadly came with a small side of unsalted butter and a huge serving of four large pieces of bread and a few blueberries for garnish (okay, okay I guess I got a little fruit after all).  \n\nThe other thing that peeved was the fact that the counter person/barista was talking to the guy behind us in line, telling him how he was working on his order as he spoke, and as we stood there at the counter first in line, money in hand. I think this constitutes as rude.  \n\nI thought about giving it one star but I must admit that I liked that look of the place so I felt it was only fair to give it another star for decor.\n\nHowever, I won't be going back.", "rating": 2, "date": "2009-11-09"}, {"excerpts": ["The bean soup/chili looked great though and it was served with thinly sliced walnut toast.\n\n"], "author": "Crissy G.", "review": "Went to Stable Cafe for lunch and though I loved the atmosphere, I just wasn't wild about the food. Everything sounded so good, but most of the pre-made sandwiches and salads in the case looked tired. \n\nI thought I'd do better ordering from the daily menu so I got a cold sandwich with ham, swiss, whole grain mustard and fig jam. The cheese looked and tasted like it was sliced from a block quite a few days prior. It was dry and cracked on the edges and didn't taste the freshest. Though the vinaigrette was homemade and tasty, the lettuce was wilted. One friend ordered the quiche (more like a frittata since there was no crust) and said it was just ok. The bean soup/chili looked great though and it was served with thinly sliced walnut toast.\n\nService was friendly, if slow and confused. I want to go back and have a better experience because I love the space. But this time I left feeling like it was just OK.", "rating": 3, "date": "2009-11-12"}, {"excerpts": ["just feeling that I wasn't cool enough and was uncomfortable or if it actually did take an eternity for the four guys behind the counter to figure out how to toast a pastry and put it on a plate along with a cup of coffee. ", "Well after what seemed like 15 minutes I looked at the timer clock on my I phone (see I'm hip ", "I'm cool ", "I have the I phone, ", "yes its only an Iphone 4)  and behold ", "we were rolling up on 12 minutes. ", "Considering this information I figured out that I was actually cool", ", it wasn't me feeling uncomfortable, it actually was taking an eternity to get a cup of coffee. ", "DONT MESS ", "WITH MY COFFEE", ", GIVE ME COFFEE, just pour that black magic into a cup and hand it over to me. ", "All the boys behind the counter sure are pretty, its like Zoolander opened a cafe with a bunch of condescending coffee jockeys. ", "I also was concerened about the extremely thin v necks that the majority of the staff seems to sport and the inevitability of a short and curly man fluff topping off my coffee. ", "The staff here needs a serious hipster-ectomy and some god damned courtesy.  ", "I take heart that I do not have to visit this establishment since there are 2 wonderfully staffed shops within 2 blocks of this place. ", "Stable does have a pleasant courtyard and decent entrees, but all in all I felt like I stepped in horse crap when I left 20 minutes later with coffee made by someone who found a way to infuse contempt, and general apathy into a cup.\n    ", "Get on your horse and stable it somewhere else."], "author": "Atom H.", "review": "So the coffee was decent until the slowest hipster barrista took 14 minutes to bring it to me from the enormous distance of 3' from where the machine is. I timed my last visit there, just to be especially dickish, i timed the whole transaction. I wondered if it was me just feeling that I wasn't cool enough and was uncomfortable or if it actually did take an eternity for the four guys behind the counter to figure out how to toast a pastry and put it on a plate along with a cup of coffee. Well after what seemed like 15 minutes I looked at the timer clock on my I phone (see I'm hip I'm cool I have the I phone, yes its only an Iphone 4)  and behold we were rolling up on 12 minutes. Considering this information I figured out that I was actually cool, it wasn't me feeling uncomfortable, it actually was taking an eternity to get a cup of coffee. DONT MESS WITH MY COFFEE, GIVE ME COFFEE, just pour that black magic into a cup and hand it over to me. All the boys behind the counter sure are pretty, its like Zoolander opened a cafe with a bunch of condescending coffee jockeys. I also was concerened about the extremely thin v necks that the majority of the staff seems to sport and the inevitability of a short and curly man fluff topping off my coffee. The staff here needs a serious hipster-ectomy and some god damned courtesy.  I take heart that I do not have to visit this establishment since there are 2 wonderfully staffed shops within 2 blocks of this place. Stable does have a pleasant courtyard and decent entrees, but all in all I felt like I stepped in horse crap when I left 20 minutes later with coffee made by someone who found a way to infuse contempt, and general apathy into a cup.\n    Get on your horse and stable it somewhere else.", "rating": 2, "date": "2011-03-13"}, {"excerpts": ["They use super thick and hearty wheat bread toast, and scrambled eggs with herbs, and white cheddar. "], "author": "Kate R.", "review": "Just started going to the place yesterday. it's on my way to work, and a friend works in the building in the offices above the cafe. So I stopped in to visit him, and got a iced coffee and a breakfast sandwich (not scribbled on the butcher paper menu), which is a personal favorite of mine. They use super thick and hearty wheat bread toast, and scrambled eggs with herbs, and white cheddar. The bacon smelled super good too, but I abstained that day. \n\nYet, I selfishly don't want to write too good a review for fear that this little gem will blow up into a full blown diamond and I'll have to wait in 20 minute lines for a latte. \n\nStaff is super friendly as well. But, not in an uncomfortable insincere way, as another yelper already pointed out.\n\nCh-ch-check it out y'all!", "rating": 4, "date": "2008-10-16"}], "panini": [{"excerpts": ["Ordered panini and avocado toast ", "- it's fresh and tasty. ", "Best cappuccino I tried in San Francisco"], "author": "Konstantin R.", "review": "Nice and cozy place. Ordered panini and avocado toast - it's fresh and tasty. Best cappuccino I tried in San Francisco", "rating": 5, "date": "2018-03-15"}, {"excerpts": ["Grilled asparagus panini with goat cheese? ", "Oh yeah. ", "Quinoa salad is fab. ", "Outdoor setting is so lovely that the fact that their coffee is a bit bitter for my taste doesn't stop me from making this a go to fave."], "author": "S Blair P.", "review": "Everything here tastes good. Some days all I crave is their tomato soup. Which usually is sold out by the time o get there. Not their fault. Grilled asparagus panini with goat cheese? Oh yeah. Quinoa salad is fab. Outdoor setting is so lovely that the fact that their coffee is a bit bitter for my taste doesn't stop me from making this a go to fave.", "rating": 5, "date": "2018-07-30"}, {"excerpts": ["mostly sandwiches, including panini pressed.  ", "best for ambiance outside."], "author": "Rob C.", "review": "right next to Watsi and amazing space, even a great venue for weddings.  food average.  mostly sandwiches, including panini pressed.  best for ambiance outside.", "rating": 3, "date": "2017-07-27"}, {"excerpts": ["The menu offers a variety of healthy breakfast choices - from yogurt, oatmeal, to bagels and sandwiches that are mostly combinations of either panini or dark bread with egg, and cheese/bacon/veggies on the side. "], "author": "Sebastian F.", "review": "Stable Cafe is a good place for breakfast, brunch, and lunch. It's located near Folsom and 17th so a bit off the craziness on Mission. Maybe that explains why this place isn't too overly busy at times where you have to wait 30mins plus elsewhere to get a table.\n\nThe menu offers a variety of healthy breakfast choices - from yogurt, oatmeal, to bagels and sandwiches that are mostly combinations of either panini or dark bread with egg, and cheese/bacon/veggies on the side. I tried the Pomba (toast, bacon, brie, egg in the hole, $7) and Nono (eggs, tomato, cheese, toast, $7). Both was good but the portion size not too large. I was actually still hungry afterwards.\n\nThe coffee however was great - you can get French Press ($2.75) or regular coffee that was nicely bold and flavorful.\n\nApart from the food, nice job on the interior (fellow Yelper Janice C. mentioned it used to be a police horse stall before?) - Stable Cafe is not too big but they made the most of the rather small interior. \n\nI'll be back here when I'm in the area!", "rating": 3, "date": "2014-05-31"}, {"excerpts": ["My all time fav is the panini is the mozzarella pesto, tomato.  "], "author": "Princess P.", "review": "I work near here and usually don't have a chance to leave the office to grab a bite.  That has all changed since finding this fabulous dining experience.  \n\nMy all time fav is the panini is the mozzarella pesto, tomato.  I have expanded to the daily specials which are pretty damn good.  \n\nThe staff is pretty upbeat and give good service.  \n\n\nFinally-- I love the whimsical plants and planters... Yay I found some playful jelly fish type air ferns and sea urchin-- soon to christmas gifts!", "rating": 5, "date": "2014-11-17"}, {"excerpts": ["A great lunch spot with daily different special soup, sandwiches and panini sandwiches. "], "author": "T L.", "review": "(See pics) Review #1206. A great lunch spot with daily different special soup, sandwiches and panini sandwiches. The special usually is pretty creative too.\n\nLove the rustic wooden feel of the place, laid back to grab a good cup of De La Paz while you enjoy the sun either inside the cafe, or outside in the patio.\n\nThe upstairs seating is a bit odd as patrons facing the door on a level where there is no front cover. So don't wear any shorts or skirts if you decide to sit on that side.", "rating": 4, "date": "2012-07-27"}, {"excerpts": ["The breakfast and panini menu are off to your right, the lunch menu is to your left semi-hidden by the flight of stairs, and there are additional options written on the glass with a display of the food.\n\n", "I also had my sister's chicken panini. ", "I'm always a fan of panini because of the way the cheese melts and melds with the bread. "], "author": "Brandy A.", "review": "I went to Stable Cafe for brunch - it had been on my to-try list for a while. You order at the counter. The menus are not in one consolidated space. The breakfast and panini menu are off to your right, the lunch menu is to your left semi-hidden by the flight of stairs, and there are additional options written on the glass with a display of the food.\n\nI had the Mate Latte (I admit I ordered this partly because it's fun to say, but also because I am a fan of Yerba Mate). Intriguing - you can definitely taste the Yerba Mate and the drink is a comforting, pastel-green color. Overall it was pretty mild.\nI had the chicken sandwich, which was ok. The patty was a bit overcooked and big, but I enjoyed the roasted peppers and provolone. I also had my sister's chicken panini. I'm always a fan of panini because of the way the cheese melts and melds with the bread. In this case the chicken was cut too thickly and the cheese took a backseat.\n\nI also know Stable Cafe has their Winter Warmer Wednesdays, collaborating with the Cheese School for happy hours (cheese galore for $15) so that might be worth checking out. I haven't been to it myself so can't vouch for it. Also it's supposed to run until the end of January so I'm not sure if it will be around much longer. \n\nOverall, would I come back? It's a cute cafe. It shares a space with a succulents nursery and the SF Cheese School, so on nice days take your food out to the courtyard and enjoy the sunshine. But I ate there once, and now I'm over it, can remove my bookmark and move onto the next great brunch place in San Francisco.", "rating": 3, "date": "2014-01-26"}, {"excerpts": ["Lemon Agua Fresca\nDevour:  Ham & Cheese Panini\nSkip:  ", "Roast Beef Sandwich\n", "Total:  $22.17"], "author": "Genevieve Y.", "review": "Date & Time:  Friday September 11, 2009 @ Noon\nStars:  3.5\nCompany:  Michael & Jack\nCrowd:  Cool Mix of 20-Something Hipsters & 40-Something Business Crowd\nVibe:  Quaint\nDecor:  Paradox of Charming & Rustic in a Loft Space.     \nService: Cute Efficient Male Hipster\nImbibe:  French-Press & Latte.  Lemon Agua Fresca\nDevour:  Ham & Cheese Panini\nSkip:  Roast Beef Sandwich\nTotal:  $22.17", "rating": 3, "date": "2009-09-11"}, {"excerpts": ["We had a pear/brie panini, and a fig/goat panini. ", "I wasn't into the fig nor did I like the choice of bread, but did enjoy the pear/brie. "], "author": "Sylvie C.", "review": "What's going on with the 3.5 stars?? I'm totally shocked. My first experience at stable was awesome, just the perfect place to enjoy a perfect SF summer day. \n\nI had SUCH a different experience with the service! Our service was spot on. The servers were energetic and friendly, made my hibiscus mimosa the second I ordered it, and with a smile. They brought our food out promptly, again with smiles and jokes. \n\nLets talk about the most delightful thing about stable...the SPACE. It is just so beautiful. It caught my eye while I was driving by, and I knew we had to check it out ASAP. Turns out that SF gave us a gorgeous week, and stable was the perfect place to enjoy the weather. The modern rustic vibe, the gorgeous garden with succulents adorning the walls, the garden in the back, the open spacious interior...we sat there for hours, re-ordering plate after plate because we just wanted a reason to stay longer. \n\nSure, the food isn't michelin rated, but it's a cafe, relax! We had a pear/brie panini, and a fig/goat panini. I wasn't into the fig nor did I like the choice of bread, but did enjoy the pear/brie. The quinoa salad was excellent though, refreshing and great for a warm day. \n\nPlease go enjoy the space. You owe it to yourself.", "rating": 4, "date": "2013-07-06"}, {"excerpts": ["BEST PANINI", "'S ", "I HAVE HAD ", "I've been here several times and just love their tomato, mozzarella, and pesto panini. ", "I have sampled other panini's from friends, which are still pretty good ", "but I always stick with my tomato, mozzarella, and pesto. ", "Their ingredients are so fresh yet so simple. ", "I have even ordered this same panini combo at several other places, but theirs taste like sh*t compared to Stable's. "], "author": "Liana D.", "review": "BEST PANINI'S I HAVE HAD BY FAR!!\n\nI've been here several times and just love their tomato, mozzarella, and pesto panini. I have sampled other panini's from friends, which are still pretty good but I always stick with my tomato, mozzarella, and pesto. Their ingredients are so fresh yet so simple. I have even ordered this same panini combo at several other places, but theirs taste like sh*t compared to Stable's. Seriously, you will be amazed how much simple quality ingredients make a big difference.\n\nThey have a large outdoor seating area which I really enjoy and Stable is located in a great area of SF that is usually sunny. It's a great spot to have lunch with friends and enjoy just the comforting ambiance that Stable brings.", "rating": 5, "date": "2013-08-20"}, {"excerpts": ["My friend had the chicken provolone panini - delish.   \n\n"], "author": "Jim D.", "review": "What a gem.  I found Stable Cafe by chance - just driving by.  It has an awesome patio - super large with a mix of 'shade' and 'sun' seating.  Inside the cafe is equally as cool, with a loft-style hipster vibe.  I liked it. \n\nThe food was great - super awesome salad - very large, enough for two to split (if you're having something else).  I enjoyed the frittata (could have been spiced-up a bit more, but still great).  My friend had the chicken provolone panini - delish.   \n\nIt's a great place to go for sunday brunch when you want something simple, to be outside, and not have crazy lines/waits.", "rating": 5, "date": "2014-04-14"}, {"excerpts": ["Good vegetarian foods : Veggie Sandwich and pesto-tomato-mozza panini. "], "author": "Dassine B.", "review": "Nice place to work on your computer or just chill and listen good music. Nice backyard to enjoy the sun. \n\nGood vegetarian foods : Veggie Sandwich and pesto-tomato-mozza panini. The Chai soy latte is also sweet and spicy.\n\nNice service, the waiters are super sweet.  \n\nThe only problems are : Close too early 4.30-5pm,  no plugs to charge your computer and no vegan options.", "rating": 4, "date": "2014-09-10"}, {"excerpts": ["I'm crazy because I expect my overpriced panini to be a panini and ", "not some weird mushroom grilled cheese? ", "Well the correct sandwich was not great anyway, boring chicken and cheese on a baguette. ", "Later I realized I had been charged too much as well. "], "author": "Sierra M.", "review": "Well the space is beautiful... Food was really bland, boring menu, tired options! \n\nService was very rude (no smile, not helpful, curt and a bad attitude about everything) and then the wrong item was brought out. I almost didn't want to bring the food back for fear I would be scolded! When I took it back the woman at the counter approached the chef, they argued playfully, then she made the universal \"she's crazy!\" symbol while sort of trying to duck out of my view... Sigh. I'm crazy because I expect my overpriced panini to be a panini and not some weird mushroom grilled cheese? Well the correct sandwich was not great anyway, boring chicken and cheese on a baguette. Later I realized I had been charged too much as well. Just, ALL BAD! \n\nDon't go here! But if you must, I hope you don't get the short haired girl with a French accent. I see other yelpers had similar experience with the same girl, is she a close friend of the owner or something?! Shame because I really wanted this place to be great since the setting is gorgeous! Maybe they will rethink the employees and menu so this place can shine!\n\nYikes! Won't be going back!", "rating": 1, "date": "2012-09-13"}, {"excerpts": ["Let me first say--- the only reason why I am not giving 5 stars is due to the odd rules placed upon orders... if you get a Panini or sandwich to go, you don't get a side salad.. ", "but if you eat it \"for here\", you do... "], "author": "Milagro J.", "review": "Let me first say--- the only reason why I am not giving 5 stars is due to the odd rules placed upon orders... if you get a Panini or sandwich to go, you don't get a side salad.. but if you eat it \"for here\", you do... hmm.\n\nBesides that, I have had great experiences at Stable.. The outdoor area is faaaantastic! Perfect set up and gorgeous!  Outside brunch is always nice-- especially because it's hard to find a lot of out door seating in this city! \n\nI've been to Stable many times and from reading the other reviews, I can see how I differ a bit.  I'm from the east coast so I am used to a bit more 'direct' customer service but I never got the rude vibe.  Maybe other people like the overly cheesy service that, in my opinion, is way more obnoxious than the \"hey, how's it going... what can I get you.. anything else?... okay, here's your change, thanks\" interaction I've had with the baristas at Stable.\n\nOverall, I recommend this place- just make sure to ask for that side salad :)", "rating": 4, "date": "2012-11-16"}, {"excerpts": ["Recently had an asparagus + goat cheese panini. ", "Yum. ", "In addition to the great food, the design and layout is beautiful. ", "The back patio they share with Lila B's is one of the loveliest places in the city."], "author": "Eliza D.", "review": "Stable is currently my favorite place in the city. Their coffee is great, and their soups and sandwiches are always delicious. Recently had an asparagus + goat cheese panini. Yum. In addition to the great food, the design and layout is beautiful. The back patio they share with Lila B's is one of the loveliest places in the city.", "rating": 5, "date": "2014-09-12"}, {"excerpts": ["I have never had such an amazing panini! ", "But, I've also never had such Terrible service! ", "My boyfriend recommended we come here for a quick bite to eat ", "but he told me \"you have to order, I can not Stand the woman behind the counter.", "\" ", "I of course rolled my eyes, thinking he was a bit dramatic but after meeting him post-order I cried in agreement! ", "Now let me get something straight, the food, coffee and interior (as well as exterior) was phenomenal!! ", "And would give five stars ", "had I not ordered..\n", "The woman who helped me had a long braided pony tail, which you know, kudos on the hair, but she is the reason I will never return. ", "She had an extremely rude tone and seemed very upset that I was ordering (or breathing for that matter) ", "I asked about a breakfast item and she very Loudly responded \"BREAKFAST IS OVER AT TEN\"... ", "Okay homegirl sorry I've never been here ", "calm down", ", I proceed to ask if the quiche is available \"the quiche?!? ", "Yes!", "\" ", "Okay... ", "Can I get that and a panini..? ", "\"", "YOU WANT THE QUICHE AND A PANINI?! ", "THE PANINI I SUGGESTED?!", "\" ", "Yea sure.. \n", "AND THEN, after handing her my card she hands it back, with receipt and pen, but almost drops it as my hands were ", "full and funny thing is there is more than enough counter space to set it on especially since I have to sign which requires a hard surface. ", "Overall I felt very attacked, I felt very attacked for wanting some lunch. "], "author": "Bryan H.", "review": "I have never had such an amazing panini! But, I've also never had such Terrible service! My boyfriend recommended we come here for a quick bite to eat but he told me \"you have to order, I can not Stand the woman behind the counter.\" I of course rolled my eyes, thinking he was a bit dramatic but after meeting him post-order I cried in agreement! Now let me get something straight, the food, coffee and interior (as well as exterior) was phenomenal!! And would give five stars had I not ordered..\nThe woman who helped me had a long braided pony tail, which you know, kudos on the hair, but she is the reason I will never return. She had an extremely rude tone and seemed very upset that I was ordering (or breathing for that matter) I asked about a breakfast item and she very Loudly responded \"BREAKFAST IS OVER AT TEN\"... Okay homegirl sorry I've never been here calm down, I proceed to ask if the quiche is available \"the quiche?!? Yes!\" Okay... Can I get that and a panini..? \"YOU WANT THE QUICHE AND A PANINI?! THE PANINI I SUGGESTED?!\" Yea sure.. \nAND THEN, after handing her my card she hands it back, with receipt and pen, but almost drops it as my hands were full and funny thing is there is more than enough counter space to set it on especially since I have to sign which requires a hard surface. Overall I felt very attacked, I felt very attacked for wanting some lunch. Girl needs to calm down, fo real doe.\n\nSo thank you for the amazing food and the terrifying service. Luckily there is no shortage of coffee or overpriced food in San Francisco.", "rating": 2, "date": "2014-08-01"}, {"excerpts": ["Brie Bacon panini with a side salad is a near perfect lunch.  ", "Outdoor garden is great."], "author": "Steve S.", "review": "Brie Bacon panini with a side salad is a near perfect lunch.  Outdoor garden is great.", "rating": 4, "date": "2014-09-10"}, {"excerpts": ["I usually ordered a scrumptious panini (many vegetarian options here) and a michelada or a coffee drink and the oatmeal, but everything looks good that is coming out of the kitchen. "], "author": "Daniella B.", "review": "I wish I had not moved away from this Stable Cafe of my dreams.  The outdoor patio is so quaint with scattered tables and little stick trees. It was a place so comfortable and relaxing as I munched on my delicious food and sipped my tasty beverage. I could be perched on my laptop or kindle or chatting idly with friends, you always welcomed me. \n\nI usually ordered a scrumptious panini (many vegetarian options here) and a michelada or a coffee drink and the oatmeal, but everything looks good that is coming out of the kitchen. I would find myself looking at the items other people ordered and making mental notes to try it next time - like the quinoa salad. \n\nI was blown away by the people who were work here who are so busy, yet so nice and efficient. And I loved the pie lady outdoors with her little of shop of homemade, original treats.\n\nHow I wish oh wish that another cafe could be worth the five lovely yelp stars as yours is, Stable Cafe. I will be making a special trip to you on weekends just because you are such a wonderful cafe dream of mine.", "rating": 5, "date": "2012-02-26"}, {"excerpts": ["Both my friend and I had panini sandwiches which were supposed to be accompanied by a side salad - all for $10.  ", "Food arrived and consisted of approximately 5 pieces of lettuce and a drizzling of olive oil along with a costco food-court quality panini.   ", "Ciabatta roll, slice of provolone and a slab of deli chicken.   ", "Very unsatisfying and unappetizing.   ", "The leash less, unattended dog that was allowed to run free in the outdoor patio seating area taking a crap right in front of our table didn't quite help to improve the quality of the experience.   ", "Needs a lot of work and won't plan on returning."], "author": "Todd K.", "review": "Great space and location, but the quality of food leaves something to be desired.  It's mediocre at best.  Both my friend and I had panini sandwiches which were supposed to be accompanied by a side salad - all for $10.  Food arrived and consisted of approximately 5 pieces of lettuce and a drizzling of olive oil along with a costco food-court quality panini.   Ciabatta roll, slice of provolone and a slab of deli chicken.   Very unsatisfying and unappetizing.   The leash less, unattended dog that was allowed to run free in the outdoor patio seating area taking a crap right in front of our table didn't quite help to improve the quality of the experience.   Needs a lot of work and won't plan on returning.", "rating": 2, "date": "2014-04-27"}, {"excerpts": ["I recommend the tomato, mozzarella, and pesto panini. ", "There is a beautiful outdoor seating area. ", "They share the space with the Cheese School, so sometimes it is hard to get a seat. ", "Looking forward to trying this place for breakfast too!"], "author": "Harmony P.", "review": "This place is a go-to for Friday lunches on nice days. I recommend the tomato, mozzarella, and pesto panini. There is a beautiful outdoor seating area. They share the space with the Cheese School, so sometimes it is hard to get a seat. Looking forward to trying this place for breakfast too!", "rating": 4, "date": "2015-08-28"}, {"excerpts": ["Also, I had a salami panini which was very good. ", "My friends and I sat there for a long time, even after they closed, but no one rushed us out. ", "Very nice people. ", "I even got to borrow on of the staff's charger to charge my phone."], "author": "Sigrid E.", "review": "Went there for lunch and had such a good time. The atmosphere is very cool, and I love the outside area. The staff was so nice and I ordered a new latte that I have not tried before. The lady said that I if I did not like it, she would make me a regular latte. And I did not like it, so she just made me a new coffee. Good service!! Also, I had a salami panini which was very good. My friends and I sat there for a long time, even after they closed, but no one rushed us out. Very nice people. I even got to borrow on of the staff's charger to charge my phone.", "rating": 4, "date": "2015-04-18"}, {"excerpts": ["We had one veggie panini (zucchini) and one roast beef with brie, home-made mustard, and portobello mushroom. "], "author": "Sam Z.", "review": "The \"french press\" coffee was terrible. Came out of a pot that had obviously been sitting around all day, and it tasted weak while still being full of grounds. Yuck. \n\nThe sandwiches took a while to come out, but they were very yummy, and came with salad on the side. We had one veggie panini (zucchini) and one roast beef with brie, home-made mustard, and portobello mushroom. I'm not sure why it should have taken so long.\n\nThe tables outside have the right combination of sun, shade, and lack of wind, but they were wobbly and the one of the chairs at our table was missing a rung (complete with dangerous metal nubs sticking out). We enjoyed overhearing an animated conversation at the table next to us. On a second visit we might try sitting upstairs instead.", "rating": 3, "date": "2010-07-06"}, {"excerpts": ["They also have a large and varied selection of panini's. "], "author": "Abraham W.", "review": "This hip Mission Cafe is located less than a block from my office so I typically make at least one trip here each week. With high quality food and a relaxed atmosphere it's a great place for a long lunch with a good book. \n\nThe quinoa vegetable salad is a healthy and delicious choice. They also have a large and varied selection of panini's. All of which are good and made to order - just note when ordering one to go you'll find the small salad that usually accompanies the order is missing - what gives?\n\n*Update: My go to order has become the excellent grilled veggie sandwich. A good mix of vegetables and goat cheese on rye bread. Super so good. Bumping my overall rating up to 4 stars.", "rating": 4, "date": "2011-07-15"}, {"excerpts": ["I ordered a Ham & Swiss Panini which comes with a side of mixed salad with vinaigarette dressing.  ", "The paninis come on french bread which is an interesting twist.  ", "It was good but on the small side.  ", "3.5-4 stars for coffee, 4 for the panini I had, 4 for atmosphere.\n\n"], "author": "Paul K.", "review": "I read about Stable on Yelp and thought I check it out today.  What an awesome space for a coffee shop!  I can easily see myself coming back here with my laptop and hanging out for a couple of hours.  \n\nThe ceiling is about 20ft high with huge ~15ft windows on the street side of the building.  The interior is loft like, modern industrial with a lot of rustic timber and steel with seatings on 2 levels.  Interior seating is limited but there are 5-6 tables outside as well.  The Wifi is free which is a huge plus.    \n\nI ordered a Ham & Swiss Panini which comes with a side of mixed salad with vinaigarette dressing.  The paninis come on french bread which is an interesting twist.  It was good but on the small side.  At 6.75 though, it's pretty reasonable.  \n\nThe small French Press coffee at 1.75 was reasonable.  The coffee was good, but not great.  I'll try their Espresso next time. \n\nParking was not difficult, at least on an early Friday afternoon.  3.5 stars for the coffee, 4 stars for the sandwich and salad, and 5 stars for the space!\n\nI'll be back with my laptop to write more Yelp reviews here!\n\n3.5-4 stars for coffee, 4 for the panini I had, 4 for atmosphere.\n\nP.S. - I was told by other Yelpers that there are not AC outlets for laptops in the dining room.  So, bring extra batteries if you have them!", "rating": 4, "date": "2009-08-07"}, {"excerpts": ["I would highly recommend the chicken pesto provolone panini, with a ginger molasses cookie. ", "The seating is superb. ", "Such a cute and calming atmosphere."], "author": "Eleonor W.", "review": "DELICIOUS!! I would highly recommend the chicken pesto provolone panini, with a ginger molasses cookie. The seating is superb. Such a cute and calming atmosphere.", "rating": 5, "date": "2014-12-26"}, {"excerpts": ["is we ordered CHICKEN PANINI's and it was the lamest panini i have ever had... ", "i expected something a little more interesting..\n\nplease make your panini more interesting !!!."], "author": "Floza S.", "review": "great set up inside and out - the only thing is we ordered CHICKEN PANINI's and it was the lamest panini i have ever had... it was only the baguette roll with a dry piece of chicken and some melted cheese\n\nVERY DISAPPOINTED....i expected something a little more interesting..\n\nplease make your panini more interesting !!!.", "rating": 1, "date": "2011-09-08"}, {"excerpts": ["I got the salami/pickle panini and a macchiato. ", "yum!"], "author": "Claire b.", "review": "Nice atmosphere, good coffee, and really good brunch type food for a casual place. I got the salami/pickle panini and a macchiato. yum!", "rating": 5, "date": "2011-10-20"}, {"excerpts": ["My friend ordered a bowl of gazpacho - I tasted it and liked it - and a nice-looking veggie panini.\n\n"], "author": "Kevin C.", "review": "Working as I do at Mariposa and Bryant, I have found the neighborhood sorely lacking in good lunch spots that are do-able in an hour, so I was glad to read about Stable opening up.\n\nI think this was their opening day, as the order-taker didn't know what meats they had on the sandwiches, but I lucked out and ordered a salami and avocado sandwich on focaccia that was very good - the salami could have come from some fancy-shmancy salumi plate.\n\nThe cafe itself is small but feels expansive, as it has very high ceilings and a small second level.\n\nMy friend ordered a bowl of gazpacho - I tasted it and liked it - and a nice-looking veggie panini.\n\nI'm going back soon!", "rating": 4, "date": "2008-09-03"}, {"excerpts": ["Went there today with some friends and had the chicken panini with a small side ", "salad it was delicious and very filling- ", "but that did not stop me from trying my friends vegetable puree soup- again amazing tasty yet not too heavy.  ", "Had he seven layer bar for dessert and all I can say is I will be back for more.\n", "The staff is friendly and very outgoing. \n", "I will be back again to The Stable Cafe."], "author": "Ron L.", "review": "WOW ...where to start!\nA real find for the area, the building has been redone and opened up to a bright airy cafe with amazing food, coffee and desserts that are to die for.  The large windows in the front and the second floor area make the space seem twice as large.\nWent there today with some friends and had the chicken panini with a small side salad it was delicious and very filling- but that did not stop me from trying my friends vegetable puree soup- again amazing tasty yet not too heavy.  Had he seven layer bar for dessert and all I can say is I will be back for more.\nThe staff is friendly and very outgoing. \nI will be back again to The Stable Cafe.", "rating": 5, "date": "2008-09-12"}, {"excerpts": ["I got the Mushroom with goat cheese panini. ", "The bread even had walnuts in it! ", "They used organic honey in their lattes and it was tasty!"], "author": "Mai N.", "review": "DELICIOUS GOODNESS!!! Chatted with the owner and found out he has his own chicken farm. He was super nice and the food was so fresh and good. I got the Mushroom with goat cheese panini. The bread even had walnuts in it! They used organic honey in their lattes and it was tasty!", "rating": 4, "date": "2011-10-04"}, {"excerpts": ["chip cookie, sea salt lavender shortbread cookie, blueberry muffin, chicken panini with salad. ", "No choice has gone wrong; all have been fantastic. ", "From what I've seen and read this is a popular coffee spot, but I don't drink coffee "], "author": "Heath P.", "review": "Fantastic space in the Mission with quality food and great baked goods. Historic character to the building renovated as a charming space. \n\nVisited: weekday mornings \nWhat I've tried:  Coffee cake, sand angel cookie, brownie, peanut butter choc. chip cookie, sea salt lavender shortbread cookie, blueberry muffin, chicken panini with salad. No choice has gone wrong; all have been fantastic. From what I've seen and read this is a popular coffee spot, but I don't drink coffee so I can't comment on their drink offerings. \n\nNegative: small indoor space, the line can get backed up with only 1 or 2 employees at a time.\n\nPositive: outdoor seating on the front sidewalk and the quaint enclosed private patio, free wi-fi, co-op kitchen shared by local chefs supports local business and creativity as well as provides fresh goods from Batter Bakery. really, the patio space is a rare and great perk to this experience.\n\nOther: Batter Bakery is based out of the back and sells baked goods at the storefront. The art room in the back is used for Sunday night dinners. Evening offerings are rumored to be coming soon.", "rating": 5, "date": "2009-08-05"}, {"excerpts": ["I chose the chicken panini and waited for 30 minutes for my take-out to be done. ", "Once I returned to my office, I opened up my little package to find a dry baguette, a slab of dry chicken breast and a slice of provolone...and that's it. ", "No condiments and no veggies, not ever the roasted peppers that are supposed to be included...and that for over $8. ", "I know the prices have gotten a bit crazy in the Mission over the last couple of years, but at least you usually get a bit of quality to justify the increase. ", "Here, you just get an expensive sandwich that leaves you wanting for taste. ", "I guess I'll nibble on my snickers bar."], "author": "Heather S.", "review": "Since I thought I'd gotten a pretty tasty sandwich here in the past, I opted to give it another try. I chose the chicken panini and waited for 30 minutes for my take-out to be done. Once I returned to my office, I opened up my little package to find a dry baguette, a slab of dry chicken breast and a slice of provolone...and that's it. No condiments and no veggies, not ever the roasted peppers that are supposed to be included...and that for over $8. I know the prices have gotten a bit crazy in the Mission over the last couple of years, but at least you usually get a bit of quality to justify the increase. Here, you just get an expensive sandwich that leaves you wanting for taste. I guess I'll nibble on my snickers bar.", "rating": 2, "date": "2014-03-10"}, {"excerpts": ["There is a daily special panini  ($6) and soup ($3.50).  ", "(Today's was Fig and Goat cheese panini and Vegetable puree soup.)  ", "I had a roasted bell pepper and mozzarella sandwich on foccacia.  ", "It was delicious and there were several balls of mozzarella.  ", "I counted 9!  ", "To drink I had a hot green tea and also fresh squeezed watermelon juice.  ", "I will definitely be back often.  "], "author": "Trace W.", "review": "All I can say as WOW.  I went to this small cafe for the first time today.  I think it opened just last week.  It was amazing.  The space is really open and cool with great music.  A great place for lunch.  There is a daily special panini  ($6) and soup ($3.50).  (Today's was Fig and Goat cheese panini and Vegetable puree soup.)  I had a roasted bell pepper and mozzarella sandwich on foccacia.  It was delicious and there were several balls of mozzarella.  I counted 9!  To drink I had a hot green tea and also fresh squeezed watermelon juice.  I will definitely be back often.  Go early because the specials sell out fast.\n\nThe desserts are made onsite and look incredible.  I had a german chocolate cupcake that was so moist it could have been pudding.  Easily the best cupcake I have ever eaten.  And, I took one of the house special cookies to go.  It is called a \"sand angel\" and it also was delicious.  It is hard to describe, kinda like a thick sugar cookie with cinnamon and maybe maple.  These cookies are worth the trip alone.  \n\nI havent been for breakfast but it looks like there are homemade scones and breakfast breads  every morning also.", "rating": 5, "date": "2008-09-12"}, {"excerpts": ["I ordered bacon Brie panini and got a chicken sandwich....", "mind you this is the SAME girl who smile at me whole I ordered it from her...", ",I've been coming here for a while & yesterday I was just almost over it! ", "The staff can be GOOD (Steph, Jean and the one w/ the glasses)or just overall BAD ( tall chick & tattoo kid) depending on whose working. ", "You know it's bad when you can tell that other staff members doing extra work to balance the new workers....", "I see that they're going for the pretty & exotic look, but can't they hire people with a brain...", "The place is pretty sweet and is a nice escape from Valencia st. ", "I just don't want to stop going there. ", "I'll might have to go elsewhere if that dumb Brazilian chick is there."], "author": "Elena T.", "review": "Why can't staff know what's on the menu...I ordered bacon Brie panini and got a chicken sandwich....mind you this is the SAME girl who smile at me whole I ordered it from her...,I've been coming here for a while & yesterday I was just almost over it! The staff can be GOOD (Steph, Jean and the one w/ the glasses)or just overall BAD ( tall chick & tattoo kid) depending on whose working. You know it's bad when you can tell that other staff members doing extra work to balance the new workers....I see that they're going for the pretty & exotic look, but can't they hire people with a brain...The place is pretty sweet and is a nice escape from Valencia st. I just don't want to stop going there. I'll might have to go elsewhere if that dumb Brazilian chick is there.", "rating": 2, "date": "2014-02-18"}, {"excerpts": ["Solid lunch (chicken panini) and a very tasty latte.  ", "Cool place. ", "Nice little quiet spot in the city"], "author": "Ryan T.", "review": "Solid lunch (chicken panini) and a very tasty latte.  Cool place. Nice little quiet spot in the city", "rating": 5, "date": "2011-07-03"}, {"excerpts": ["Simply the best Veggie Panini in the City!    ", "Fresh asparagus, goat's cheese, pesto....grilled.......orgasmic...SERIOUSLY.  ", "(and I'm a meat eater...", "so take it for what it's worth)"], "author": "Blake J.", "review": "Simply the best Veggie Panini in the City!    Fresh asparagus, goat's cheese, pesto....grilled.......orgasmic...SERIOUSLY.  (and I'm a meat eater...so take it for what it's worth)", "rating": 4, "date": "2011-03-14"}, {"excerpts": ["I got the turkey and Swiss panini which came with a small side salad. ", "The bread was warm and crunchy and the cheese was melted over the turkey and was a bit crispy on the outside (just the way I like it). "], "author": "Danielle W.", "review": "This place is definitely worth checking out! I love their huge glass door and how spacious and bright it is once you walk inside. The counter is directly in front of you and there's seating on both levels and outside. The person behind the counter was really friendly and my food was brought to me pretty quickly. I got the turkey and Swiss panini which came with a small side salad. The bread was warm and crunchy and the cheese was melted over the turkey and was a bit crispy on the outside (just the way I like it). My friend got the Quinoa Salad and soup of the day. The presentation was nice, but the salad was a little bland for my taste. Next time I'll come back to try their Wild Arugula salad. Another thing, they display art from various artists on their walls so you get some visual stimulation during your meal.", "rating": 4, "date": "2011-01-07"}, {"excerpts": ["Food was good, I had the soup of the day (potato leek) and panini.  ", "Soup was great, the panini was a little dry for my taste, but it was competent.   ", "A nice space to hang out in", "; I say check it out."], "author": "Timothy W.", "review": "After driving by this place more times than I can remember, I decided to try it out.  It's a fantastic little space in a funky area.  I wish this place was here 10 years ago when I lived in the area.  Food was good, I had the soup of the day (potato leek) and panini.  Soup was great, the panini was a little dry for my taste, but it was competent.   A nice space to hang out in; I say check it out.", "rating": 4, "date": "2009-03-11"}], "sandwiches": [{"excerpts": ["There were salads and sandwiches galore on the menu, but the special said TACOS. ", "How could I resist? "], "author": "Stefanie C.", "review": "Whenever I go to a place like Stable Cafe, it reminds me that I should get out more often. There are so many hidden gems in San Francisco like this one... I'm a sucker for gorgeous and serene outdoor patios. I ordered coffee and food at the front cash register. There were salads and sandwiches galore on the menu, but the special said TACOS. How could I resist? They sounded amazing.\n\nI took my number and entered the not-so-secret garden. I found two seats since I was meeting my friend and broke out my laptop to get some work done. It was hard to concentrate, being around so many people and beautiful succulents. I typically work from home, so this was a special treat. I also realized that I totally could have brought my dog here. There was even a water bowl, the universal signal for pet-friendliness. \n\nThe shredded beef tacos were amazing. I don't remember what other ingredients there were, but the flavors were unique, and the amount of food was plentiful for lunch. I was in a happy place. My friend met up with me, and we had a good conversation... which worked out since WiFi was down that day. Oh well, I guess it was a sign that I needed to get out and relax for once.", "rating": 4, "date": "2017-12-28"}, {"excerpts": ["The menu is a pleasant mix of sandwiches and savory items, with plenty of options to satisfy folks looking for healthy and/or keto options, or just darn good dishes. ", "I especially love that you can sides of meat or avocado or veggies to anything. ", "The food is simple, but very high quality, and full of flavor. ", "Not to mention that the menu is insanely priced in the wallet friendly direction. ", "I don't understand how the food can be this good at this price in San Francisco. ", "The portions were perfect. ", "Not overwhelming large like most breakfast joints. "], "author": "Mandie H.", "review": "Absolutely delightful cafe. The cafe itself is lovely, with a loft overlooking the small indoor space, and a large outdoor patio that is beautifully landscaped. So serene. \n\nThe menu is a pleasant mix of sandwiches and savory items, with plenty of options to satisfy folks looking for healthy and/or keto options, or just darn good dishes. I especially love that you can sides of meat or avocado or veggies to anything. The food is simple, but very high quality, and full of flavor. Not to mention that the menu is insanely priced in the wallet friendly direction. I don't understand how the food can be this good at this price in San Francisco. The portions were perfect. Not overwhelming large like most breakfast joints. We were satisfied but not stuffed when we left. \n\nThe drinks menu features a full coffee bar, plus beer and wine. The staff when we were there were all exceptionally nice. All a little quirky, but it was such a welcome change to visit a SF restaurant where the staff weren't exuding hate / pretentiousness. \n\nThis place is a true gem. I wished I lived in the city so that I could come here to work or read on the patio. I will definitely be back. Everything about this place was a delight.", "rating": 5, "date": "2018-07-29"}, {"excerpts": ["Delicious sandwiches."], "author": "Sameet M.", "review": "Great place for brunch or coffee. Beautiful outside sitting area under the trees. Good coffee. Delicious sandwiches.", "rating": 4, "date": "2018-08-31"}, {"excerpts": ["Great lunch menu choices, paninis, sandwiches and salads. ", "Unfortunately, they ran out of the quinoa salad ", "so we shared a chicken sandwich. "], "author": "Yin H.", "review": "3.5 stars\nVery cute cafe. We had just finished trying on some clothes at Everlane down the street and stumbled upon this place. \n\nGreat lunch menu choices, paninis, sandwiches and salads. Unfortunately, they ran out of the quinoa salad so we shared a chicken sandwich. Also picked up a decent sauv blanc here.\n\nThe atmosphere is a 5! Great little private patio out back. Nice, quiet seating inside. Clean bathrooms, lots of nice succulents to set the mood. Service was very friendly and quick. Food was very average. Would love to come back one morning and try some of their coffee. Saw lots of people eating/hanging out/reading by themselves here. Definitely feels like a little oasis from the rest of the Mission.", "rating": 3, "date": "2016-04-30"}, {"excerpts": ["mostly sandwiches, including panini pressed.  ", "best for ambiance outside."], "author": "Rob C.", "review": "right next to Watsi and amazing space, even a great venue for weddings.  food average.  mostly sandwiches, including panini pressed.  best for ambiance outside.", "rating": 3, "date": "2017-07-27"}, {"excerpts": ["The menu offers a variety of healthy breakfast choices - from yogurt, oatmeal, to bagels and sandwiches that are mostly combinations of either panini or dark bread with egg, and cheese/bacon/veggies on the side. "], "author": "Sebastian F.", "review": "Stable Cafe is a good place for breakfast, brunch, and lunch. It's located near Folsom and 17th so a bit off the craziness on Mission. Maybe that explains why this place isn't too overly busy at times where you have to wait 30mins plus elsewhere to get a table.\n\nThe menu offers a variety of healthy breakfast choices - from yogurt, oatmeal, to bagels and sandwiches that are mostly combinations of either panini or dark bread with egg, and cheese/bacon/veggies on the side. I tried the Pomba (toast, bacon, brie, egg in the hole, $7) and Nono (eggs, tomato, cheese, toast, $7). Both was good but the portion size not too large. I was actually still hungry afterwards.\n\nThe coffee however was great - you can get French Press ($2.75) or regular coffee that was nicely bold and flavorful.\n\nApart from the food, nice job on the interior (fellow Yelper Janice C. mentioned it used to be a police horse stall before?) - Stable Cafe is not too big but they made the most of the rather small interior. \n\nI'll be back here when I'm in the area!", "rating": 3, "date": "2014-05-31"}, {"excerpts": ["If you do need an even heartier lunch, can I recommend their sandwiches? ", "Stable has amazing bread, so all of their sandwiches taste just a little better. ", "Also, Stephanie behind the counter is hilarious. ", "Tell her ", "I said 'hi.'"], "author": "Dan S.", "review": "This place serves what is easily the healthiest lunch in the Mission. Don't get me wrong, I love a carne asada burrito as much as the next guy, but when you need something a little lighter, you can't go wrong with an amazing Stable salad - maybe one with some avocado and chicken if you still need something hearty. \n\nIf you do need an even heartier lunch, can I recommend their sandwiches? Stable has amazing bread, so all of their sandwiches taste just a little better. Also, Stephanie behind the counter is hilarious. Tell her I said 'hi.'", "rating": 5, "date": "2015-11-17"}, {"excerpts": ["A great lunch spot with daily different special soup, sandwiches and panini sandwiches. "], "author": "T L.", "review": "(See pics) Review #1206. A great lunch spot with daily different special soup, sandwiches and panini sandwiches. The special usually is pretty creative too.\n\nLove the rustic wooden feel of the place, laid back to grab a good cup of De La Paz while you enjoy the sun either inside the cafe, or outside in the patio.\n\nThe upstairs seating is a bit odd as patrons facing the door on a level where there is no front cover. So don't wear any shorts or skirts if you decide to sit on that side.", "rating": 4, "date": "2012-07-27"}, {"excerpts": ["The menu includes frittatas, granola, oatmeal, sandwiches, salads, etc. "], "author": "Lolia S.", "review": "Laptop camper here. The former stable for police horses turned into a coffeehouse features 2 floors, an industrial vibe, and wood everywhere including the exposed building beams. Small tables and outdoor seating are inviting and the wi-fi is free, but there isn't a power outlet to be found in the seating areas.\n\nThe pastries look better than average and the eggs are \"farm fresh\" courtesy of a farm in Petaluma. The menu includes frittatas, granola, oatmeal, sandwiches, salads, etc. The menu is seasonal.\n\n* Breakfast sandwich $5 - eggs weren't nuked but cooked nicely with gooey cheese, folded over, with scallions, served on thin wheat toast with seeds and nuts and stuff. The bread tasted really healthy and dry. \n* Latte $3: one size, not bad but bitter on bottom, organic beans from De la Paz\n\nThe café clearly doesn't encourage lingering. Even the chairs are uncomfortable.\n\nYou know you love me. X0 X0, laptop camper.", "rating": 4, "date": "2011-11-13"}, {"excerpts": ["They looked healthy and filling and the sandwiches look great. "], "author": "Jane A.", "review": "THE MISTERY OF THE BLACK BUILDING\n(3.8 stars)\n\nThe day i went they had some great music playing. Not sure what genre it was but it was better then all other cafe music i've heard. Great face, away from busy but close to busy. Parking was cake. The place is not in a busy area but of walking distance to busy-ness. No line and plenty of seating. Three Babes Bakeshop and Stable Cafe share the outdoor seating area. I'm such an idiot for ordering at Stable Cafe and not ordering anything from Three Bades Bakeshop (they server mini pies). \n\n- Food, good (fresh and organic)\n- Price, decent\n- Service, good\n- Ambiance, cute cozy cafe\n\nPassed this place everytime I do my grocery shopping at Rainbow Groceries. It was definately one of those Sundays where \"it's too damn nice to be inside doing nothing\". I've dedicated Sundays as cafe days when I have no plans and nowhere to be; hiding from the world \"LEAVE ME ALONE\" kind of mood because I need to catch up on a book.\n\nHEFFER-STYLE STATUS.\n\n**See picture**\n\nPOMBA ($6.50) - the menu online is false, i was charged $6.50. It was toast, bacon (cant eat meat at this time), gouda, and a whole egg. Presentation of the place was clean; didnt understand why the bacon and the slice of gouda made an \"X\" over my toast. When they say \"A WHOLE EGG\" they literally cut a perfect circle in my thick slice of toast and put the egg inside (pretty cool!). It was a simple breakfast, nothing filling. I did not feel heavy after eating. \n\nHOT COCOA (~$2+) - off the caffine and had to go with a different hot beverage. cocoa was creamy and smooth. they did not and nor did i, add any sugar. servered in a glass cup with a cool crooked spoon.\n\nPELLIGRINO (~$2) - ordered me some snotty water to quench my thirst.\n\nIt was lunchtime and other people around me have ordered lunch items. I am a fool, i totally should have ordered a lunch item. They looked healthy and filling and the sandwiches look great. I suggest coming here to get lunch over breakfast.\n\nWill I be back? Yes (for lunch). Its not like all those other cafe's in the city where it's overly packed. I can enjoy a cafe environment on my laptop, with my book, or with my journal.\n\nUntil the next review..", "rating": 4, "date": "2011-06-13"}, {"excerpts": ["We ordered 2 sandwiches, and they delivered one (!) but were quick to remedy the situation."], "author": "Bonnie B.", "review": "Bingo! Hunger for lunch and a good vibe led us to The Stable Cafe. \nThe charming Spaniard who took our order at the counter, greeted us like long lost compadres. Menu is simple, inexpensive,  and fresh, and delivered to your table (lots of outdoor seating at picnic tables, in the lovely urban garden patio). We ordered 2 sandwiches, and they delivered one (!) but were quick to remedy the situation.", "rating": 4, "date": "2013-03-20"}, {"excerpts": ["I've also gotten basic sandwiches that should come with ham, without any ham (and lots of eye-rolling if asked for a side of ham to add to the sandwich).  ", "Or  wraps that are missing bacon. ", "Or sandwiches on a bagel that should be on a croissant.\n\n"], "author": "Anne D.", "review": "Stable Cafe is my favorite plan for bunch. \n\nWhy only 3 stars? It's horribly inconsistent.  I'm a regular (I go to Stable about every other week, and have been doing so for the past year or so), and am always surprised at my final bill, the size of my food/drinks, and how quickly (or not) my food arrives.  I don't get the sense that new employees are trained very thoroughly.  One example of this: the Mate Latte.  Usually it comes in a large cup, and is perfect - just sweet enough, the mate is perfectly steeped, etc. Sometimes though, it's in a small cup (for the same price!), no honey, and too bitter to drink.  The only pattern seems to be that new employees in particular really struggle with making the drink, which makes me think that more training before they get behind the counter would be helpful. \n\nOr the french press coffee. There are two prices: $2 for a small, and $2.75 for a large.  However, there was a period of time when suddenly all \"for here\" prices for coffee changed to $2.75 for a small coffee, no refills. I asked why, and was told by a new employee, \"It's just how we do it here.\"   So now I just order my coffee in a to-go cup to avoid the confusion, even if I plan to drink it at Stable (saves me .$75 too, if I order a small). \n\nI've also gotten basic sandwiches that should come with ham, without any ham (and lots of eye-rolling if asked for a side of ham to add to the sandwich).  Or  wraps that are missing bacon. Or sandwiches on a bagel that should be on a croissant.\n\nSometimes I'm overcharged, sometimes undercharged. I'll point this out if I notice while I'm there, but, with a menu that's relatively straightforward (at least for brunch), I'm not sure why there's so much variance in the bill.  \n\nThe people behind the counter can be friendly and nice, or completely rude. \n\nI keep coming to Stable though because the food is just SO GOOD. Best eggs in the city. As long as you're prepared to deal with inconsistency (I try to think of it as an adventure!), you'll enjoy your meal here.", "rating": 3, "date": "2012-07-15"}, {"excerpts": ["However, on several occasions they just pulled one of the hours-old display sandwiches out of the case, heat it up and charge you as if it'd been fresh (part of the price is for freshness and not getting sick from food poisoning, no?)\n\n"], "author": "Paul E.", "review": "Short: They violate food safety regulations, and they're sloooooow.\n\nLong: It's a good thing so many people have given up on this place, I can't imagine how slow they'd be if everyone who likes the food/coffee actually went there and you had to wait even longer to order. I can't tell you how many people say the same thing to me about this place... \"good food/coffee but it takes *forever*!\"\n\nThere's rarely much of a line there, which gives you a false sense of how long it will take. \n\nI like the food, generally. However, on several occasions they just pulled one of the hours-old display sandwiches out of the case, heat it up and charge you as if it'd been fresh (part of the price is for freshness and not getting sick from food poisoning, no?)\n\nI'd easily change my rating to a 5 if they hired cooks who knew how to hustle and didn't try to get away with serving me old, contaminated, soggy food from the display case!! It's not just gross and insulting, it's dangerous. The staff have obviously never been trained in food safety. Even BK and McD's throw their food out if it sits around for a fraction of the time Stable thinks is acceptable. I've taken culinary arts classes and know how little time it takes bacteria to grow at room temp... \n\nI think they're trying to solve their speed problem by cutting food safety corners though. If they try to pull the display model after you order, stop them! Tell them they're nasty, lazy and unsafe for trying to get away with that. It's not just rude, they are risking your health and they need to stop!\n\nIf you don't, you'll end up with indigestion - at the very least.\n\nIf they can get their stuff together, it'd be nice to see them stay around. Do they not realize how many more people per day they'd serve (and more money they'd make) if the speed of service were improved?? People who like them would stop avoiding them. If I walk in and see more than one person waiting to order, I know I'm in for at least 15 mins and I walk out.", "rating": 2, "date": "2012-07-26"}, {"excerpts": ["Their coffee is great, and their soups and sandwiches are always delicious. "], "author": "Eliza D.", "review": "Stable is currently my favorite place in the city. Their coffee is great, and their soups and sandwiches are always delicious. Recently had an asparagus + goat cheese panini. Yum. In addition to the great food, the design and layout is beautiful. The back patio they share with Lila B's is one of the loveliest places in the city.", "rating": 5, "date": "2014-09-12"}, {"excerpts": ["Their sandwiches, salads, and egg dishes are always amazing.\n\n"], "author": "Jana T.", "review": "Let's call it a law of averages.  \n\nFive stars for food - not it's not the most amazing gourmet food on earth, but what they do, they do right.  Their sandwiches, salads, and egg dishes are always amazing.\n\nTwo and a half stars for coffee - it isn't amazing gourmet, but it isn't Folgers.  It's coffee.\n\nUsually one star or less for service.  Every time I go in there, the person behind the counter seems confused by what I order, messes up the order of the person in front of me or some other stupid mishap ensues.  If there were a place across the street with the same menu and coffee but better service, this place would be out of business.", "rating": 3, "date": "2012-06-15"}, {"excerpts": ["My husband jokes that their breakfast sandwiches are what egg mcmuffins would taste like if McDonalds cared :)\n\n"], "author": "Tina F.", "review": "I love it here. My husband jokes that their breakfast sandwiches are what egg mcmuffins would taste like if McDonalds cared :)\n\nThe food is fresh and they have those tasty farm eggs. Everything tastes very fresh and healthy. When this place first opened we went EVERY weekend. The only reason why we don't anymore is because it gets very busy. We always bring our friends from out of town here for breakfast.", "rating": 5, "date": "2012-04-17"}, {"excerpts": ["I thought it tasted better with the side of smoky chipotle sauce that had a nice kick, but otherwise I wished I had ordered their sandwiches or simply go elsewhere for a better meal.\n\n"], "author": "Daniel L.", "review": "Although reviews that take account for variables such as the structural layout, ambiance, food and service, and price are significant, whether a place had served to my purpose for the visit is often what translates into how I make sense of my experience. After getting tips from Yelp about their free wifi, cheap pannini, and generally friendly ambiance, I decided to make a visit and put in a few hours of work. The structural layout came as advertised; it had a cute outdoor seating area next to the café and large windows with a second floor to host laptop users. \n\nThe place is cute and tiny with a long line of people waiting to order that tend to cluster from the entrance to the register. The menu was posted behind the staircase that was invisible until you get to the register. I was attracted to several menu items that included their sandwich items ($8) and their good looking empanadas behind the case. Instantly excited about the prospect of a productive afternoon, I ordered a mushroom and a spinach empanadas ($4.50 each) and pressed coffee ($2.25). It wasn't until I received the food and went upstairs I realized that the café did not have any plugs on the walls and the other laptop users could only stay as long as their battery life would let them. What a bummer. They also ran out of soy--until Monday--so my coffee tasted horrible even with brown sugar added. My empanadas were decent but quite expensive. It was not warm all the way through to the middle, but the fillings were still pretty tasty. I thought it tasted better with the side of smoky chipotle sauce that had a nice kick, but otherwise I wished I had ordered their sandwiches or simply go elsewhere for a better meal.\n\nService was rushed and I felt compelled to bus my own dishes even when I had already left a tip. My visit was brief as I didn't even bother to break open my laptop. It was a wasted effort as I had to trek across town to find another café to get my work going. I thought their food was decent but not worthwhile when nearby options are better and more affordable.  In the end, the café was not laptop friendly and did not fulfill the purpose of my visit. 2 stars for the experience.", "rating": 2, "date": "2009-08-22"}, {"excerpts": ["Outdoor patio, free wifi, great coffee, good breakfast selection (egg sandwiches, frittata, oatmeal), very chill vibe... this is a great neighborhood spot. "], "author": "V W.", "review": "Outdoor patio, free wifi, great coffee, good breakfast selection (egg sandwiches, frittata, oatmeal), very chill vibe... this is a great neighborhood spot. I would come here with a laptop or a friend.... preferably both :)\n\nI only wish that they are open longer on Sundays. But hey Coffee Bar is only a few blocks away for the all-day laptop warriors.", "rating": 4, "date": "2010-08-29"}, {"excerpts": ["Both my friend and I had panini sandwiches which were supposed to be accompanied by a side salad - all for $10.  ", "Food arrived and consisted of approximately 5 pieces of lettuce and a drizzling of olive oil along with a costco food-court quality panini.   ", "Ciabatta roll, slice of provolone and a slab of deli chicken.   ", "Very unsatisfying and unappetizing.   ", "The leash less, unattended dog that was allowed to run free in the outdoor patio seating area taking a crap right in front of our table didn't quite help to improve the quality of the experience.   ", "Needs a lot of work and won't plan on returning."], "author": "Todd K.", "review": "Great space and location, but the quality of food leaves something to be desired.  It's mediocre at best.  Both my friend and I had panini sandwiches which were supposed to be accompanied by a side salad - all for $10.  Food arrived and consisted of approximately 5 pieces of lettuce and a drizzling of olive oil along with a costco food-court quality panini.   Ciabatta roll, slice of provolone and a slab of deli chicken.   Very unsatisfying and unappetizing.   The leash less, unattended dog that was allowed to run free in the outdoor patio seating area taking a crap right in front of our table didn't quite help to improve the quality of the experience.   Needs a lot of work and won't plan on returning.", "rating": 2, "date": "2014-04-27"}, {"excerpts": ["After we got our sandwiches we went upstairs to dine. ", "Being my first time here we had no idea ", "it was self cleaning. ", "We left the plates upstairs. "], "author": "K L.", "review": "!!!!   DESPICABLE   !!!!\n\n**** I'M SO FURY, I JUST WANT TO DIE ****\n\nThe service was horrible.  After we got our sandwiches we went upstairs to dine. Being my first time here we had no idea it was self cleaning. We left the plates upstairs. Just when we were about to leave, the server opens the door from outside and roared..\n\n\"MA'AM MA'AM (rudely) HELLO UH.. YOU NEED TO BRING YOUR PLATES DOWNSTAIRS (while he was smoking a cigarette). IT'S SELF CLEANING (cocky mf  like he is too good for the job). NEXT TIME REMEMBER TO BRING YOUR PLATES DOWNSTAIRS AND CLEAN UP AFTER (looked away and kept smoking)\"\n\nAre you out of your flipped out mind, there will be NO NEXT TIME. I am never returning and even if I do I am going to leave an APPALLING MESS for you. \n \nMy recommendation is HIRE MINIONS\n\nthis happened about 1 year ago...", "rating": 1, "date": "2010-08-03"}, {"excerpts": ["The sandwiches took a while to come out, but they were very yummy, and came with salad on the side. "], "author": "Sam Z.", "review": "The \"french press\" coffee was terrible. Came out of a pot that had obviously been sitting around all day, and it tasted weak while still being full of grounds. Yuck. \n\nThe sandwiches took a while to come out, but they were very yummy, and came with salad on the side. We had one veggie panini (zucchini) and one roast beef with brie, home-made mustard, and portobello mushroom. I'm not sure why it should have taken so long.\n\nThe tables outside have the right combination of sun, shade, and lack of wind, but they were wobbly and the one of the chairs at our table was missing a rung (complete with dangerous metal nubs sticking out). We enjoyed overhearing an animated conversation at the table next to us. On a second visit we might try sitting upstairs instead.", "rating": 3, "date": "2010-07-06"}, {"excerpts": ["Amazing breakfast sandwiches and yummy fresh salads. ", "They a few tables inside but have an open outdoor patio where you can relax in the sun. ", "Pretty chill environment, I don't live in the neighborhood but am definitely making the trek back here for brunch."], "author": "Kristi E.", "review": "I was pleasantly surprised by this place! They have a great brunch menu that is healthy and light. Amazing breakfast sandwiches and yummy fresh salads. They a few tables inside but have an open outdoor patio where you can relax in the sun. Pretty chill environment, I don't live in the neighborhood but am definitely making the trek back here for brunch.", "rating": 5, "date": "2012-06-05"}, {"excerpts": ["Nice mix of beverages, breakfast, a few salads and sandwiches. ", "Very clean. ", "Great outdoor patio. ", "Service is friendly and fast. ", "Salad portions seem much bigger if you eat in instead of to-go. ", "I will definitely go back but eat in next time."], "author": "Lauren S.", "review": "Pretty solid place with healthier choices than most of the spots in this neighborhood.  Nice mix of beverages, breakfast, a few salads and sandwiches. Very clean. Great outdoor patio. Service is friendly and fast. Salad portions seem much bigger if you eat in instead of to-go. I will definitely go back but eat in next time.", "rating": 3, "date": "2012-05-16"}, {"excerpts": ["The sandwiches are simple and delicious, carried by high quality ingredients and tasteful combinations of ingredients (meats, brie, and flavorful roasted peppers are typical).\n\n"], "author": "Charlie Bolognese Z.", "review": "Great woodsy interior (did it used to be a stable?) and sunny outdoor seating area. The sandwiches are simple and delicious, carried by high quality ingredients and tasteful combinations of ingredients (meats, brie, and flavorful roasted peppers are typical).\n\nAccommodates work (best upstairs) and socializing (best outside). On weekends, Three Babes sells their pies by the slice right on Stable's grounds.\n\nSpotty wifi, no outlets.", "rating": 4, "date": "2012-01-10"}, {"excerpts": ["I think this was their opening day, as the order-taker didn't know what meats they had on the sandwiches, but I lucked out and ordered a salami and avocado sandwich on focaccia that was very good - the salami could have come from some fancy-shmancy salumi plate.\n\n"], "author": "Kevin C.", "review": "Working as I do at Mariposa and Bryant, I have found the neighborhood sorely lacking in good lunch spots that are do-able in an hour, so I was glad to read about Stable opening up.\n\nI think this was their opening day, as the order-taker didn't know what meats they had on the sandwiches, but I lucked out and ordered a salami and avocado sandwich on focaccia that was very good - the salami could have come from some fancy-shmancy salumi plate.\n\nThe cafe itself is small but feels expansive, as it has very high ceilings and a small second level.\n\nMy friend ordered a bowl of gazpacho - I tasted it and liked it - and a nice-looking veggie panini.\n\nI'm going back soon!", "rating": 4, "date": "2008-09-03"}, {"excerpts": ["I asked the cashier for a rec from the list of sandwiches.  ", "It sounded like a pretty ringing endorsement of the roast beef and brie, so I went for it.   ", "And the sandwich was mighty tasty...but a little confusing with all the flavors that were going on with the mustard seeds and red onions, the brie was overshadowed.  "], "author": "Evelyn K.", "review": "It was a gloriously beautiful day in the city and for some reason, I got it in my head that I was going to walk from downtown (425 Market) to the Stable Cafe.  Really just a little more than 2 miles!\n\nSo, by the time arrived at cafe, I was both a little sweaty and plenty hungry!  The menu looked really tantalizing and couldn't decide what to order to I asked the cashier for a rec from the list of sandwiches.  It sounded like a pretty ringing endorsement of the roast beef and brie, so I went for it.   And the sandwich was mighty tasty...but a little confusing with all the flavors that were going on with the mustard seeds and red onions, the brie was overshadowed.  Altogether all of the ingredients seemed super fresh. \n\nI loved the ambiance. It's a place that I would consider sitting for a couple of hours with my beloved laptop.", "rating": 4, "date": "2008-11-10"}, {"excerpts": ["Everything sounded so good, but most of the pre-made sandwiches and salads in the case looked tired. \n\n"], "author": "Crissy G.", "review": "Went to Stable Cafe for lunch and though I loved the atmosphere, I just wasn't wild about the food. Everything sounded so good, but most of the pre-made sandwiches and salads in the case looked tired. \n\nI thought I'd do better ordering from the daily menu so I got a cold sandwich with ham, swiss, whole grain mustard and fig jam. The cheese looked and tasted like it was sliced from a block quite a few days prior. It was dry and cracked on the edges and didn't taste the freshest. Though the vinaigrette was homemade and tasty, the lettuce was wilted. One friend ordered the quiche (more like a frittata since there was no crust) and said it was just ok. The bean soup/chili looked great though and it was served with thinly sliced walnut toast.\n\nService was friendly, if slow and confused. I want to go back and have a better experience because I love the space. But this time I left feeling like it was just OK.", "rating": 3, "date": "2009-11-12"}, {"excerpts": ["- There's coffee bar a few blocks away that does equally amazing sandwiches if not better.\n\n"], "author": "Rooibos T.", "review": "40 min wait for a cold sandwich ??\n\nI understand lunch can be a busy time, but really ?  - There's coffee bar a few blocks away that does equally amazing sandwiches if not better.\n\nIn my mind, here's how the s/w was prepared\n\n1. Take 2 slices of bread\n2. Apply mustard on one side\n3. Place already cooked pork along with some greens\n4. Slice into half.\n\nSorry, this doesn't take 40 min and it wasn't even super crowded. One word - Mismanagement.\n\nGood coffee though !", "rating": 2, "date": "2010-11-12"}, {"excerpts": ["Admittedly, I haven't tried the sandwiches but the coffee is first rate and they have these delicious gourmet empanadas which blow my mind.  \n\n"], "author": "David K.", "review": "I always feel like an obsequious bell-end when I snack at Stable because I rave about everything I try.  \nReally loudly.  \nIt's like my filter shuts off when I walk through the large glass door.  \nInside voice becomes outside voice - obnoxious running commentary about the quality of what I'm consuming as it's being consumed.\n\nAdmittedly, I haven't tried the sandwiches but the coffee is first rate and they have these delicious gourmet empanadas which blow my mind.  \n\nNow, the most important bit: baked goods.  9 times out of 10, when you walk into a bakery, pastry shop, cookie store - whatever - and shit looks amazing...it usually falls short of expectations.  You imagine how good something's going to taste and then it doesn't.  This is not the case with this joint.  From cookies to blondies to caramel nut squares, they nail it every time.\n\nGorgeous space.  Lots of light.  Lovely place to kill some time with a paper and coffee.\n\nBonus points for great service too.  The guy behind the counter is really friendly and helpful.", "rating": 5, "date": "2009-03-16"}, {"excerpts": ["The food selection is limited, as in maybe 3 kinds of paninis, 2 sandwiches and 2 salads....", "my arugula salad was $8.50, arugula, sliced apples and two pieces of walnut bread.....little steep. ", "It was a yummy salad, but I don't think people are coming here for the food alone, the atmosphere is very hip/chic. \n", "The staff is super friendly, but not having someone to bus the tables....", "eh....I had to clear someone elses plates so we could have a clean table...", "minus points there. \n", "The lavender sea salt shortbread was delish! ", "Combined with my cappuccino, I was a happy camper. \n", "Service was on the slow side, and if you are trying to eat and get back to the office in an hour, this is not the place to go. \n", "The space is beautiful and open, and if I wanted to work on my computer or read a good book for a couple of hours, I'd probly come here and enjoy another cappuccino and shortbread."], "author": "Bianca L.", "review": "I wandered in here for lunch, and well....I feel guilty not giving it 5 stars....but..... \nThe food selection is limited, as in maybe 3 kinds of paninis, 2 sandwiches and 2 salads....my arugula salad was $8.50, arugula, sliced apples and two pieces of walnut bread.....little steep. It was a yummy salad, but I don't think people are coming here for the food alone, the atmosphere is very hip/chic. \nThe staff is super friendly, but not having someone to bus the tables....eh....I had to clear someone elses plates so we could have a clean table...minus points there. \nThe lavender sea salt shortbread was delish! Combined with my cappuccino, I was a happy camper. \nService was on the slow side, and if you are trying to eat and get back to the office in an hour, this is not the place to go. \nThe space is beautiful and open, and if I wanted to work on my computer or read a good book for a couple of hours, I'd probly come here and enjoy another cappuccino and shortbread.", "rating": 3, "date": "2009-02-19"}, {"excerpts": ["i've also gotten incredibly mediocre sandwiches, and the empanada i was served today was among the worst i've ever had (lord knows i've had a lot of empanadas in my day). "], "author": "Alex H.", "review": "3 stars is the average of 5 stars and 1 star. \n\nwhen they're good, they're great; they've made cappuccinos that are the best i've had in the city. they've also made ones with no foam, too bitter, and with a weird metallic flavor. there are more of the latter than the former.\n\nthe food is inconsistent. i've gotten the oatmeal with fruit, and it was cold and the berries were moldy. i've also gotten incredibly mediocre sandwiches, and the empanada i was served today was among the worst i've ever had (lord knows i've had a lot of empanadas in my day). it was served cold to boot, and when i mentioned this i was offered a free coffee on my next visit; OK response, but a little weak.\n\non the other hand, the granola with yogurt and fruit was so good that i am still craving it. ditto on the breakfast burrito. the quinoa salad is also very very good.\n\nthe service is identically hit and miss. some days extremely friendly, some days incredibly aloof. they all have the habit of not making any eye contact until they are ready to take your order - even if you are standing alone at the counter for five minutes while they make coffees and they are a foot away from you.  its unusual and unnerving. there is a strong clubby feel to the place; they are chummy with the regular \"cool kids\" and seemingly cold and aloof to everyone else (me, for example! i guess no one thinks social science grad students are cool).\n\nthey're also getting a bit too big for their britches. the lunch rush is a disaster. the atmosphere is very nice around mid morning.\n\ni don't know. i keep going back after swearing its the last time. if i were more clever i'd make a hysterical and witty analogy to ex-girlfriends. why must you be so maddening, stable cafe?", "rating": 3, "date": "2009-10-08"}, {"excerpts": ["this place literally has the BEST sandwiches around...", "i mean, seriously.  "], "author": "Melody H.", "review": "this place literally has the BEST sandwiches around...i mean, seriously.  all the ingredients are EXTREMELY fresh, the seasonings and meat/veggie/cheese combos are unbeatable, and the bread...mmmm!\n\nyes, this place is absolutely fantastic.  i can't say i've had a more satisfying lunch than i have from here.  not to mention, the ambiance is wonderful also; and the staff is so kind.  they really make an effort to know your name and make conversation.  you can tell they enjoy their job.", "rating": 5, "date": "2008-11-07"}], "wild arugula salad": [{"excerpts": ["Next time I'll come back to try their Wild Arugula salad. ", "Another thing, they display art from various artists on their walls so you get some visual stimulation during your meal."], "author": "Danielle W.", "review": "This place is definitely worth checking out! I love their huge glass door and how spacious and bright it is once you walk inside. The counter is directly in front of you and there's seating on both levels and outside. The person behind the counter was really friendly and my food was brought to me pretty quickly. I got the turkey and Swiss panini which came with a small side salad. The bread was warm and crunchy and the cheese was melted over the turkey and was a bit crispy on the outside (just the way I like it). My friend got the Quinoa Salad and soup of the day. The presentation was nice, but the salad was a little bland for my taste. Next time I'll come back to try their Wild Arugula salad. Another thing, they display art from various artists on their walls so you get some visual stimulation during your meal.", "rating": 4, "date": "2011-01-07"}], "soup of the day": [{"excerpts": ["Ordered the soup and salad combo (soup of the day was tomato and salad was a mixed green salad in a vinaigrette with red onion rings, cherry tomatoes and cucumber chunks, also came with 3 pieces of a toasted baguette for the soup) for $7. \n", "Went outside to the courtyard because the few tables inside were taken and it was adorable outside. ", "Plants everywhere, ample seating and a lot in the shade (thankfully cause it was really hot outside). ", "Got my food in about 6 minutes- everything was really good. ", "The tomato soup was yummy, I only wish they used fresh chives to garnish instead of dried because it would've added a nice flavor. ", "The crostini was great to break up and throw in the soup like croutons. ", "Salad was light and fresh and perfectly dressed. ", "The meal was filling for a lunch dish. \n", "Water is self serve but the glasses are tiny ", "so it's annoying (especially when hot out) to have to keep getting up and going inside to refill- especially when you're by yourself and have to haul your purse and other belongings with you."], "author": "Kajal G.", "review": "Stopped in for lunch cause I was working a gig at the ODC Theater down the street and didn't have long to eat. Short line when I got there which was around 12:30 PM on Wednesday. Ordered the soup and salad combo (soup of the day was tomato and salad was a mixed green salad in a vinaigrette with red onion rings, cherry tomatoes and cucumber chunks, also came with 3 pieces of a toasted baguette for the soup) for $7. \nWent outside to the courtyard because the few tables inside were taken and it was adorable outside. Plants everywhere, ample seating and a lot in the shade (thankfully cause it was really hot outside). Got my food in about 6 minutes- everything was really good. The tomato soup was yummy, I only wish they used fresh chives to garnish instead of dried because it would've added a nice flavor. The crostini was great to break up and throw in the soup like croutons. Salad was light and fresh and perfectly dressed. The meal was filling for a lunch dish. \nWater is self serve but the glasses are tiny so it's annoying (especially when hot out) to have to keep getting up and going inside to refill- especially when you're by yourself and have to haul your purse and other belongings with you.", "rating": 4, "date": "2013-07-03"}, {"excerpts": ["My friend got the Quinoa Salad and soup of the day. ", "The presentation was nice, but the salad was a little bland for my taste. "], "author": "Danielle W.", "review": "This place is definitely worth checking out! I love their huge glass door and how spacious and bright it is once you walk inside. The counter is directly in front of you and there's seating on both levels and outside. The person behind the counter was really friendly and my food was brought to me pretty quickly. I got the turkey and Swiss panini which came with a small side salad. The bread was warm and crunchy and the cheese was melted over the turkey and was a bit crispy on the outside (just the way I like it). My friend got the Quinoa Salad and soup of the day. The presentation was nice, but the salad was a little bland for my taste. Next time I'll come back to try their Wild Arugula salad. Another thing, they display art from various artists on their walls so you get some visual stimulation during your meal.", "rating": 4, "date": "2011-01-07"}, {"excerpts": ["Food was good, I had the soup of the day (potato leek) and panini.  ", "Soup was great, the panini was a little dry for my taste, but it was competent.   ", "A nice space to hang out in", "; I say check it out."], "author": "Timothy W.", "review": "After driving by this place more times than I can remember, I decided to try it out.  It's a fantastic little space in a funky area.  I wish this place was here 10 years ago when I lived in the area.  Food was good, I had the soup of the day (potato leek) and panini.  Soup was great, the panini was a little dry for my taste, but it was competent.   A nice space to hang out in; I say check it out.", "rating": 4, "date": "2009-03-11"}]}