{"batch brew": [{"excerpts": ["The staff was nice enough, and on weekday mornings, I stuck with the batch brew because everything took impossibly too long. "], "author": "Jessi R.", "review": "I don't know what happened to this place, and it disappoints me greatly.\n\nI used to love coming here for the back porch with a croissant and a latte and stay for a couple of hours reading on a Sunday. The staff was nice enough, and on weekday mornings, I stuck with the batch brew because everything took impossibly too long. But it was fine because I liked the management. \n\nI stepped in here a couple of weeks ago and it felt very off. The cups have gotten smaller, the usual hip baristas are no where to be found, and they play elevator music. The pastries are subpar than the ones from before.\n\nStanza must have changed ownership - its the only explanation and boy, it is palpable. Its missing the heart that it once had, so I guess I'll be finding a new local coffehouse to patronize.", "rating": 2, "date": "2017-06-13"}, {"excerpts": ["To my delight, they now have a simple batch brew. ", "Great idea! "], "author": "Ben V.", "review": "When Stanza opened, they only offered french press for a non-espresso drink. I am mixed on french press. Sometimes it is great, sometimes it is burned, sometimes grinds are floating around in my coffee.\n\nAfter a few months, I have returned. To my delight, they now have a simple batch brew. Great idea! The pastries are the normal selection. The vibe is mellow. The creamer container is weird. (I know this seems cool and kitschy, but it is small, meaning it will run out and require refilling way more ofter - which involves a customer butting into another order to request a refill)\n\nThe tables and seats are already kind of junky. It isn't really bad yet. But I suspect the place will be on the level of Philz (best coffee, junky interior) or Muddy Waters in no time.  I don't need luxury. But run down is unpleasant.\n\n!!!And the big complaint!!!  WHY KEEP IT FREEZING? You are trying to make it a cozy coffee shop. But you prop the door open so it is ~60 degrees. I am watching the steam from someone's freshly poured coffee being pushed by the wind (BY THE WIND) coming in the door. That drink, like mine, will be cold in 3 minutes and my toes numb in 12.\n\nThe cold is a plague of coffee shops and bars in this town. Maybe pouring coffee (or mixing drinks) makes you warm. But sitting at your tables makes me freezing.", "rating": 3, "date": "2015-05-06"}], "pour over": [{"excerpts": ["so I opted for the pour over, which I enjoyed. ", "Also loved the chill-hop music they were playing~*~. Great option if you're looking for a place to work or have a quiet conversation in the Mission area!"], "author": "Michelle C.", "review": "Nice big space with high ceilings and beautiful cultural decorations. Good wifi and super friendly staff. Almond milk doesn't foam well so I opted for the pour over, which I enjoyed. Also loved the chill-hop music they were playing~*~. Great option if you're looking for a place to work or have a quiet conversation in the Mission area!", "rating": 5, "date": "2018-04-02"}, {"excerpts": ["Pour over coffee sounds like way to fruity for me, I asked a barista if I can get Americano.\n", "He said \"I have a cup, hot water, and shot. ", "I guess I can make it!", "\"\n", "I was impressed he let me have what is not on the menu.\n", "I personally will keep coming back to this place again."], "author": "Davis Y.", "review": "It was second time to visit this place.\nI wanted to get a cup of Americano, but it was not in the menu.\nPour over coffee sounds like way to fruity for me, I asked a barista if I can get Americano.\nHe said \"I have a cup, hot water, and shot. I guess I can make it!\"\nI was impressed he let me have what is not on the menu.\nI personally will keep coming back to this place again.", "rating": 5, "date": "2017-04-23"}, {"excerpts": ["so I opted for their pour over instead. "], "author": "Roger M.", "review": "Stanza just oozes hipsterness from the moment you walk in. Plenty of vintage decor and huge cold drip towers that make it \"IG worthy,\" haha. \n\nI was planning on getting their cold brew but they had ran out by the time we arrived so I opted for their pour over instead. It's a little more on the pricey side at $4 for a small cup but the flavors were quite bold and roasted the way I like it. \n\nFrom what I noticed, there was a good selection of other drinks as well such as cappuccinos and a French press in case you're looking for something a little stronger and flavorful.\n\nPlenty of outlets here so you can ensure that your MacBook will have ample battery life. I didn't get a chance to hang out for long as we were a bit hungry and took a stroll to grab some pupusas around the corner!", "rating": 4, "date": "2014-08-05"}, {"excerpts": ["Your options are pour over ($4) or French Press. \n\n"], "author": "Jess C.", "review": "3.5 STARS.\n\nI prefer the ice coffee here over Blue Bottle's, because it's less acidic and tart. My favorite is still the Philz Iced Mint Mojito ofcourse. They serve Mr. Holmes baked goods (like Linea Cafe), but I was kinda grossed out by all the fruit flies circling the food. \n\nFRENCH PRESS ($2.50) - 3 STARS:\nToo sour for me. Your options are pour over ($4) or French Press. \n\nLATTE ($4.00) - 3.5 STARS:\nThey use a variety of different Ethiopian and other beans. The latte is rich and foam...super creamy. Didn't taste too much of espresso in fact. Cappucino - $3.50. I prefer Four Barrel, grand and rituals interpretation. \n\nMR. HOLMES BANANA DONUT ($3.50) - 3.5 STARS:\nI can usually judge a pastry from its cover and I was certain I would like it. Right after ordering it I remembered I ordered the same exact thing at Linea and I had the same impression as the first time - it sounded and looked amazing, tasted pretty good (very soft and fresh), but was different than I expected and overall nothing mind blowing . The banana filling was pure mashed banana (not creamy like I expected) - it tasted fresh, not overly ripe. \n\nI would return to try their famous chocolate chip cookie!\n\nThe decor reminds me of Haus (on 24th) but dimmer, or Ma'velous but more ghetto. Free wifi and plenty of tables, including a few outdoors, but a bit dark.", "rating": 3, "date": "2014-02-04"}, {"excerpts": ["I was set on having a pour over, and after talking with my newfound friend, I went with his favorite: beans from Topeca Coffee from Tulsa, OK. ", "I also threw in a bran muffin for good measure.  ", "For anyone that hates on the fact that this place doesn't roast their own beans, save it. ", "Similar to my experience at Mazarine, I love the idea of bringing in new roasters and exposing people like myself to new blends and varieties from other parts of the country (other parts of the US know how to roast beans too, you know!). ", "After sitting with my warm cup of coffee, my delicious bran muffin (which was absolutely delish that day and the day after), I concluded that Stanza is a place that I'd like to keep for myself.  ", "It was incredibly relaxing just sitting and enjoying some coffee on a fine SF morning and an amazing way to start off my day.  ", "I shall return Stanza, thank you for making my Wednesday so awesome."], "author": "Lisa I.", "review": "Hold the phones. This might be my favorite hole in the wall coffee shop in SF.  Since I've turned into a seriously early riser, I've taken it upon myself to explore SF's coffee shops that are open early and getting in my coffee fix before the world wakes up.  Stanza is right off the 16th Street BART station, which made this horribly convenient for me coming from the Embarcadero.  In walking in at around 7:30AM, there was myself and one other person, and I was warmly greeted by one of the most friendliest human beings behind the counter.  I was set on having a pour over, and after talking with my newfound friend, I went with his favorite: beans from Topeca Coffee from Tulsa, OK. I also threw in a bran muffin for good measure.  For anyone that hates on the fact that this place doesn't roast their own beans, save it. Similar to my experience at Mazarine, I love the idea of bringing in new roasters and exposing people like myself to new blends and varieties from other parts of the country (other parts of the US know how to roast beans too, you know!). After sitting with my warm cup of coffee, my delicious bran muffin (which was absolutely delish that day and the day after), I concluded that Stanza is a place that I'd like to keep for myself.  It was incredibly relaxing just sitting and enjoying some coffee on a fine SF morning and an amazing way to start off my day.  I shall return Stanza, thank you for making my Wednesday so awesome.", "rating": 5, "date": "2015-05-14"}, {"excerpts": ["I had a coffee that was the pour over type.  ", "The service was quick and friendly.  ", "I tasted a cookie which was also quite tasty.  ", "The decor has that coffee shop vibe.  ", "The coffee hit the morning spot."], "author": "Andy S.", "review": "I had a coffee that was the pour over type.  The service was quick and friendly.  I tasted a cookie which was also quite tasty.  The decor has that coffee shop vibe.  The coffee hit the morning spot.", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["Good service \nBeginner-level technique with making a pour over. ", "Can't stress enough they need to train their staff how to do this properly."], "author": "David P.", "review": "Good service \nBeginner-level technique with making a pour over. Can't stress enough they need to train their staff how to do this properly.", "rating": 2, "date": "2015-02-05"}, {"excerpts": ["Pour over coffee and press coffee selections.  ", "$4 for pour over.  "], "author": "Nathan T.", "review": "Great find.  Pour over coffee and press coffee selections.  Pastries and snacks, including one of the best chocolate chip cookies I have had in a long time.\n\nPrices were reasonable. $4 for pour over.  Excellent cup of coffee.\n\nNice chairs and internet. Single restroom provided.", "rating": 4, "date": "2014-04-01"}, {"excerpts": ["A most solid place to kick back with a quality pour over.  ", "The seating both indoors and in the outdoor patio out front is ample and both WiFi and numerous outlets are available.  ", "Can't complain!"], "author": "Eric F.", "review": "A most solid place to kick back with a quality pour over.  The seating both indoors and in the outdoor patio out front is ample and both WiFi and numerous outlets are available.  Can't complain!", "rating": 4, "date": "2013-11-02"}, {"excerpts": ["The pour over is amazing, and I just had a cappucino that tasted like chocolate milk and sweet childhood memories. ", "When I need wifi and can't afford the distraction of seeing everyone I know in the Mission, Stanza is where you'll find me."], "author": "Dan S.", "review": "Friends of Dan know that I'm a Four Barrel partisan. I go there literally every morning, to have a regular date with my sweetie and to enjoy some of the best coffee ever made. That won't chage anytime soon.\n\nHaving said that. Opening more or less across the street from my place is Stanza, a new coffee shop that puts almost everywhere else I've been in SF to shame. I can count on one hand and have fingers left over which coffee joints do better. (I won't name them. But I do think Stanza is better than Ritual. And Sightglass.)\n\nThe pour over is amazing, and I just had a cappucino that tasted like chocolate milk and sweet childhood memories. When I need wifi and can't afford the distraction of seeing everyone I know in the Mission, Stanza is where you'll find me.", "rating": 5, "date": "2012-11-17"}, {"excerpts": ["They lovingly warm the glass, take their time with the pour over, etc.  ", "Like Lou Reed once said, \"First thing you learn is that you always gotta wait!\"  ", "But, so worth it.  "], "author": "FoodDudeS F.", "review": "Incredibly delicious coffee.  This is the first coffee I've tried that had so much flavor on its own that I didn't want to put any cream or sugar in it.  Loaded with subtle tastes and flavors.\n\nAs other Yelpers have noted, they have a rotating cast of beans and roasters, so I guess it's best not to get too attached to any one flavor, and maintain an open mind (kind of like how Trader Joe's runs out of your favorite item every now and then, have you noticed that?)  That being said, their Ethiopian IDIDO is AMAZING!!!\n\nI think, given the high quality of the coffee, this place is actually a bargain compared to other spots.  They charge a very reasonable price for a cup here.  \n\nWhat to expect:  super-slow, super meticulous pours of artisan coffee.  This place makes Philz look like McDonald's in comparison.  They lovingly warm the glass, take their time with the pour over, etc.  Like Lou Reed once said, \"First thing you learn is that you always gotta wait!\"  But, so worth it.  Caffeinated ambrosia in a cup.\n\nBy the way, if you are EATING next door at Pork Store Cafe (incredible breakfasts) you can get Stanza coffee with your meal.  Your waiter/waitress can bring Stanza to your table.  \n\nThese guys are extreme coffee geeks, but not snobs.  They are happy to educate you and share their passion for beans, roasters, etc., so don't be shy or ashamed of your lack of knowledge.  I know very little, but I knows what I likes, and what I likes is some Stanza!  Cheers!", "rating": 5, "date": "2013-01-21"}, {"excerpts": ["It isn't a roaster but a rotating coffee bar, so they offer small lots from roasters around sf and around the country served french press, pour over, and espresso drink options depending on how the type of coffee best tastes. "], "author": "Elizabeth ..", "review": "The newest good coffee place in the mission, Only a month old, they're still small enough to avoid a busy morning line but growing bigger by the day. \nIt isn't a roaster but a rotating coffee bar, so they offer small lots from roasters around sf and around the country served french press, pour over, and espresso drink options depending on how the type of coffee best tastes. Also, they have artisan teas from red blossom. The single origin espressos are dialed in meticulously when they get in a new bean. They pull on the Slayer II espresso machine, and they're the only cafe in the city with it. It's another one-off place with just a few solid employees so you can become a regular fast. And they are mostly easy on the eyes, handshaking kind of boys. Every so often the music can get loud in the afternoon but there's outdoor seating as well and the music is usually pretty good stuff.\n\nYeah, they have cream behind the counter and not out, you should kind of get over it and try the coffee without it. Those types of places are proud of their choices in roasters and coffees, though you can always ask for it and they won't judge. Some places in the city can get a bit impersonal and holier than thou. They'll answer any questions and enjoy discussion. Free wifi, and awesome vegan doughnuts. It looks sort of like a dark french brasserie too, tucked away watching a busy 16th street. If you like or know something about coffee, you'll like this place (and vice versa).", "rating": 5, "date": "2013-01-02"}, {"excerpts": ["Yet, honestly, I like the pour over that I ordered here.  ", "I like my coffee subtle with lingering flavors and finishes on my tongue.  ", "I like that the coffee here is NOT scalding hot or overly roasted so that all that you taste is CHARCOAL.  ", "I like that there is not a long line of people angrily tapping their feet or trying to rush your order.  "], "author": "Hiromi N.", "review": "I know that my reviews generally tend to be GLOWING.  Especially when I go to a place for the first time and the staff is generally nice to me, have good service or the product is pleasing to me in appearance or taste.  I also know that I have lots of people who disagree with me about price point and taste.  \n\nYet, honestly, I like the pour over that I ordered here.  I like my coffee subtle with lingering flavors and finishes on my tongue.  I like that the coffee here is NOT scalding hot or overly roasted so that all that you taste is CHARCOAL.  I like that there is not a long line of people angrily tapping their feet or trying to rush your order.  I like it when people behind the bar answer your questions and provide you with information to make you a little more knowledgeable.\n\nOkay, so the demeanor of the individual baristas can be a little intimidating for an average person.  Yet, oh well, you only live life once.  \n\nSo, customer service would be 3 stars (a-ok) and the coffee for me 4.  The dimly lit booths 3, the outdoor patio in the back and front would be a 4.5.  I like the music, but there is only 1 unisex bathroom for a large space.  The price point can be steep for a girl on a budget, yet, I find that these days the coffee shops of this caliber, which are armed with knowledgeable baristas and serving specialty coffee are charging around the same price point.   \n\nIt does seem like mixed feelings, but I'll definitely be back for the pour-over coffee and the really relaxed vibe.  Some people complain about snobbery or such, but I think it actually is relaxing and not too overly stimulating for the senses.\n\n I say that this is my SPLURGE or DATE coffee.  It isn't a starbuck's or peet's and I don't think that Stanza or its comrades are trying to be.  I think that they are aiming for a lifestyle and educational experience while challenging each other to raise the bar (ista).  I think that they are also catering to the dynamically changing neighborhood clientele.", "rating": 4, "date": "2013-12-04"}, {"excerpts": ["We got the pour over iced coffee. ", "Great taste! ", "The art was cool and so was the atmosphere. ", "I reccomend this place if you're looking for a quick pick me up"], "author": "Ava S.", "review": "We got the pour over iced coffee. Great taste! The art was cool and so was the atmosphere. I reccomend this place if you're looking for a quick pick me up", "rating": 4, "date": "2015-05-09"}, {"excerpts": ["Pour over Coffee too acidic. ", "Spicy front no aftertaste. ", "Also not hot enough. "], "author": "Marcus E.", "review": "Pour over Coffee too acidic. Spicy front no aftertaste. Also not hot enough. Not worth $4. \n\nAlso the strawberry jam looks like its seen better days. I think it's supposed to be red.", "rating": 2, "date": "2013-02-14"}, {"excerpts": ["Darn good cappuccino, and amazing pour over by the mug.  ", "I tried the Ethiopian Sutamo and its was rich and complex.  ", "Menu board described its with \"Cherry notes\" and \"the bomb.\"  ", "Indeed, it was a cherrybomb!  ", "(also my favorite song by the spoons).   ", "So if four barrel is getting too hipster and ritual is just too crowded, then maybe Stanza is your next stop."], "author": "Joseph C.", "review": "i think i just found a new worthwhile caffeine oasis in the mission:  plenty of seating, assorted pastries and even has free wifi.  But actually its all about the coffee.  Darn good cappuccino, and amazing pour over by the mug.  I tried the Ethiopian Sutamo and its was rich and complex.  Menu board described its with \"Cherry notes\" and \"the bomb.\"  Indeed, it was a cherrybomb!  (also my favorite song by the spoons).   So if four barrel is getting too hipster and ritual is just too crowded, then maybe Stanza is your next stop.", "rating": 5, "date": "2013-03-01"}], "decaf": [{"excerpts": ["After walking by the ridiculous line at Four Barrel coffee on a sunny Saturday morning, we walked into Stanza with no line and only ONE option for decaf coffee: hot Americano. ", ":( ", "Since I'm cutting back on my caffeine intake, I still like the taste of coffee and just went with the hot beverage. ", "The shop is small and with little to no air circulation even with the back and front doors open. ", "On the plus side, if you're able to snag an outdoor seat in their back patio, then it's worth another visit."], "author": "Lisa R.", "review": "After walking by the ridiculous line at Four Barrel coffee on a sunny Saturday morning, we walked into Stanza with no line and only ONE option for decaf coffee: hot Americano. :( Since I'm cutting back on my caffeine intake, I still like the taste of coffee and just went with the hot beverage. The shop is small and with little to no air circulation even with the back and front doors open. On the plus side, if you're able to snag an outdoor seat in their back patio, then it's worth another visit.", "rating": 2, "date": "2016-04-19"}, {"excerpts": ["The decaf tastes like regular and is a great get outta work treat. ", "A quiet coffee shop with an outdoor patio, as well."], "author": "Mel G.", "review": "The decaf tastes like regular and is a great get outta work treat. A quiet coffee shop with an outdoor patio, as well.", "rating": 5, "date": "2015-05-29"}, {"excerpts": ["They do not offer decaf espresso and the barista will give you lots of interesting reasons ", "why ", "but they do have decaf drip - unless they run out for the day. ", "Lots of nice tea options too as a backup."], "author": "ari s.", "review": "A nice cafe near bart. My home office is quieter but it's more fun to meet around fresh coffee so I meet clients here sometimes. \n\nStanza gets the balance of food and ambiance just right and I look forward to going back. There are not alot of food options so be aware of that. Wifi is fine. \n\nThey do not offer decaf espresso and the barista will give you lots of interesting reasons why but they do have decaf drip - unless they run out for the day. Lots of nice tea options too as a backup.", "rating": 5, "date": "2014-04-25"}, {"excerpts": ["Often out of decaf, perhaps they wouldn't have such a difficult time keeping things in stock if they bought locally. ", "The outdoor seating in the back is their saving grace."], "author": "Marissa G.", "review": "Very mediocre. Odd that they serve coffee from Intelligentsia in LA when there are so many high quality local wholesale coffee companies they could support. Often out of decaf, perhaps they wouldn't have such a difficult time keeping things in stock if they bought locally. The outdoor seating in the back is their saving grace.", "rating": 3, "date": "2013-11-14"}], "cortado  gibraltar": [], "cold brew": [{"excerpts": ["My boyfriend ordered the cold brew and said it wasn't acidic at all. "], "author": "Karen Y.", "review": "I love the chill vibes that this coffee shop emits. There is relaxing music played in the background (albeit a bit loud and you can clearly hear it even with earphones on unless you have the noise cancelling headphones). The lighting is slightly dim and conveys an intimate setting.  There are outlets on the wall and many people come here to work on their laptops. \n\nThe interior design of this place is also phenomenal. Very detailed and meticulous, ornate designs placed on the walls. Love it!\n\nI ordered the thai iced tea, which was alright. It wasn't very sweet or milky, two things I would have preferred. My boyfriend ordered the cold brew and said it wasn't acidic at all. He thought the drink was particularly good here.\n\n (Sidenote: the bathroom here is really modern, cool, and clean)", "rating": 4, "date": "2018-06-10"}, {"excerpts": ["The ordering was easy enough, we walked in and got a cold brew. ", "They immediately brewed up and we got it quickly. "], "author": "Amy K.", "review": "This place was A-OK, we were looking for coffee and of course, why not go to an amazing stand alone vs a Sbux if you can? The ordering was easy enough, we walked in and got a cold brew. They immediately brewed up and we got it quickly. I wish I had gotten their amazing looking cookies, specifically the half pb and half chocolate but next time. I took one star off because while the coffee was good it was slightly too acidic for my taste. We sat on their patio which was nice and had a beautiful wall mural but was ridden with a ton of flies. \n\nOverall, A-OK.", "rating": 3, "date": "2018-04-24"}, {"excerpts": ["and their cold brew is the best I've ever had. ", "Free wifi and plenty of outlets for working. ", "Amazing little spot in the Mission!"], "author": "Kristen H.", "review": "Best coffee in the Bay. Barista was so badass and kind and their cold brew is the best I've ever had. Free wifi and plenty of outlets for working. Amazing little spot in the Mission!", "rating": 5, "date": "2018-09-27"}, {"excerpts": ["Cold brew was delicious. ", "I loved the atmosphere and vibe. ", "Baristas were nice and friendly. "], "author": "Melanie T.", "review": "Cold brew was delicious. I loved the atmosphere and vibe. Baristas were nice and friendly. Cute outside patio, but I enjoyed sitting at the bar.\n\nFree wifi and chill atmosphere.\n\nWould come again!", "rating": 5, "date": "2016-08-26"}, {"excerpts": ["I was planning on getting their cold brew ", "but they had ran out by the time we arrived "], "author": "Roger M.", "review": "Stanza just oozes hipsterness from the moment you walk in. Plenty of vintage decor and huge cold drip towers that make it \"IG worthy,\" haha. \n\nI was planning on getting their cold brew but they had ran out by the time we arrived so I opted for their pour over instead. It's a little more on the pricey side at $4 for a small cup but the flavors were quite bold and roasted the way I like it. \n\nFrom what I noticed, there was a good selection of other drinks as well such as cappuccinos and a French press in case you're looking for something a little stronger and flavorful.\n\nPlenty of outlets here so you can ensure that your MacBook will have ample battery life. I didn't get a chance to hang out for long as we were a bit hungry and took a stroll to grab some pupusas around the corner!", "rating": 4, "date": "2014-08-05"}, {"excerpts": ["I'll indulge in a cold brew and get some more work done here."], "author": "Chuck N.", "review": "Saturday, 1:00 PM.\n\nQuickie:\n+ Drink/Food quality\n+ Service\n- Hygiene\n+ Strong wi-fi signal\n+ Atmosphere\n+ Turnaround\n+ Menu variety\n* Layout\n\nAnd then...?\nEccentric shop powered by friendly staff. I'll indulge in a cold brew and get some more work done here.", "rating": 4, "date": "2016-11-27"}, {"excerpts": ["I find their cold brew a little bitter ", "but I like that. ", "Their cappuccinos are wonderful-- their location and ambience are unbeatable, every time I go in I want to grab a book and sit down which is a good thing! ", "Excited to return after a couple of times of just grabbing a drink to go ", ":)"], "author": "Rebecca L.", "review": "This is only for coffee to go-- I find their cold brew a little bitter but I like that. Their cappuccinos are wonderful-- their location and ambience are unbeatable, every time I go in I want to grab a book and sit down which is a good thing! Excited to return after a couple of times of just grabbing a drink to go :)", "rating": 5, "date": "2017-05-13"}, {"excerpts": ["My personal favorite is the cold brew coffee. ", "Iced coffee is so 1999 compared to cold brew. ", "FYI - if you haven't had it you can't add any milk or creamer. ", "It's most delicious plain..."], "author": "Juliet S.", "review": "Great little coffee shop in the Mission. Not as popular as four barrel or any of the crazy trendy spots. I'm still not sure exactly why people come from all over the world to drink a cup of $6 coffee, but whatever.\n\nThey have delicious drip coffee. They also have espresso drinks, but the drip coffee is the specialty. My personal favorite is the cold brew coffee. Iced coffee is so 1999 compared to cold brew. FYI - if you haven't had it you can't add any milk or creamer. It's most delicious plain...it's all about the true flavor of the coffee.\n\nAtmosphere - Stanza has a fair amount of seating. A few seats are outdoors in the front and the remainder are inside. Cute decor, simple and hipster-ish. \n\nFood - they have pastries, but no prepared food.\n\nSummary - great neighborhood coffee spot. Perfect place to stop in the morning before hopping on the Bart at 16th and Mission.", "rating": 4, "date": "2016-01-17"}, {"excerpts": ["The cold brew coffee is really sour and has a terrible after taste, the warm coffee isn't much better ", "but it's a bit more bearable. ", "No matter how much sugar I put in the cold brew I can't dull the bitter taste. "], "author": "Maddie F.", "review": "The cold brew coffee is really sour and has a terrible after taste, the warm coffee isn't much better but it's a bit more bearable. No matter how much sugar I put in the cold brew I can't dull the bitter taste. The chai tea is decent.", "rating": 1, "date": "2016-11-26"}, {"excerpts": ["I love the cold brew at stanza, it's really strong. ", "I've also had espresso drinks here and love them. ", "I'm a coffee fanatic, and this is definitely one of my favorite spots in the city. "], "author": "Lauren G.", "review": "Great coffee and shop! I love the cold brew at stanza, it's really strong. I've also had espresso drinks here and love them. I'm a coffee fanatic, and this is definitely one of my favorite spots in the city. Stanza always has a great array of pastries in the morning from local bakeries.\n\nUnfortunately I have to knock down a star for the ambiance - I don't dig the darkness of the location, and I don't enjoy sitting in there.", "rating": 4, "date": "2015-06-01"}, {"excerpts": ["Their cold brew iced coffee is not to be missed! ", "Just the sight of the $2k cold brew drip tower is impressive - the product, even more so. ", "Even though I'm normally a cream and sugar gal, I have to drink the cold brew unadorned to enjoy its mellow, fragrant complexity."], "author": "Cat C.", "review": "Wonderfully unpretentious and yet niche coffee shop. The folks who work here are truly enthusiastic about unique coffees and love to share without being condescending about it. \n\nUsually can easily find room here to sit down and work on the WiFi inside, or hang out in the secluded back patio. \n\nTheir cold brew iced coffee is not to be missed! Just the sight of the $2k cold brew drip tower is impressive - the product, even more so. Even though I'm normally a cream and sugar gal, I have to drink the cold brew unadorned to enjoy its mellow, fragrant complexity.", "rating": 5, "date": "2014-05-21"}, {"excerpts": ["Bonus points for the cold brew mechanism and awesome art around the cafe!"], "author": "Supreet C.", "review": "I love Stanza! Their Turning Point coffee is amazing! Brad is super nice and always makes the perfect cup! Bonus points for the cold brew mechanism and awesome art around the cafe!", "rating": 5, "date": "2015-09-23"}, {"excerpts": ["I liked their cold brew a lot. ", "They use De La Paz beans. ", "Good music and service. ", "Pet friendly."], "author": "Jennifer W.", "review": "The inside is nice and great for doing work if you manage to get one of the tables. There aren't a whole lot. Some spaces have outlets, so seek those out. The high table does not have outlets. The wifi is reliable and free. The back patio is kind of dirty, not sure why there are big cushy pleather sofas because they get dirty easily and could use a wipedown. They serve coffee via individual pourover and french press. I liked their cold brew a lot. They use De La Paz beans. Good music and service. Pet friendly.", "rating": 3, "date": "2014-09-07"}, {"excerpts": ["I tried their cold brew and their french press, both were unpleasantly sour, and even more sour once sweetened.  ", "All the (non-espresso) coffee looked very overpriced.  ", "And like I said, the taste was definitely sub-par.  ", "Just about any place in the city I have tried is better than this.  "], "author": "Sofia O.", "review": "I don't like it.  Stand-offish, unfriendly, snobby vibe, not just from the staff but from the decor as well.  Half n half in an unmarked golden genie bottle?  This seems like the kind of place that values snob appeal above actual honest-to-good quality and service, and that's a huge turnoff for me.  I tried their cold brew and their french press, both were unpleasantly sour, and even more sour once sweetened.  All the (non-espresso) coffee looked very overpriced.  And like I said, the taste was definitely sub-par.  Just about any place in the city I have tried is better than this.  If you want fantastic $4 pour-over coffee find that Blue Bottle stuff!\n\nThe lattes look real pretty though, and the prices on those are standard.", "rating": 1, "date": "2013-10-12"}, {"excerpts": ["My husband had the cold brew and I had green tea. ", "They were both great. ", "It was my first time trying the cold brew ", "but it was very tasty! ", "The baked goods looked so good, but did not try. ", "I will be back to try them out."], "author": "Akiko I.", "review": "My husband had the cold brew and I had green tea. They were both great. It was my first time trying the cold brew but it was very tasty! The baked goods looked so good, but did not try. I will be back to try them out.", "rating": 5, "date": "2013-10-27"}], "hot chocolate": [{"excerpts": ["I really like their hot chocolate. ", "It was very creamy and not too sweet, also didn't burn my mouth when I sipped it. ", "The price was also reasonable ($3.5-5 per drink). ", "I stayed here for 2 hours or so and didn't hear any songs on repeat."], "author": "Wendy F.", "review": "Great vibe and plenty of seating.\n\nI really like their hot chocolate. It was very creamy and not too sweet, also didn't burn my mouth when I sipped it. The price was also reasonable ($3.5-5 per drink). I stayed here for 2 hours or so and didn't hear any songs on repeat.", "rating": 4, "date": "2016-01-24"}, {"excerpts": ["Love hot chocolate here\nNice environment and music\n", "Some time the table is not available"], "author": "Namtan A.", "review": "Love hot chocolate here\nNice environment and music\nSome time the table is not available", "rating": 5, "date": "2015-07-20"}, {"excerpts": ["There hot chocolate was really good. ", "I also had..... ", "I think an espresso.... ", "Either way it was good. ", "When I come back to SF I will definitely be stopping in again."], "author": "Thatguy E.", "review": "I wanted to get away from my town. SF was the place for me. I searched for a great coffee spot in SF and yelp delivered. The customer service was great. Everyone was friendly. They had great recommendations. There hot chocolate was really good. I also had..... I think an espresso.... Either way it was good. When I come back to SF I will definitely be stopping in again.", "rating": 5, "date": "2014-12-02"}], "chai": [{"excerpts": ["The baristas could be a TAD friendlier, but I got my chai latte quickly, sat down and read my book. ", "Wifi is complimentary for you folks who don't like talking to other people."], "author": "Janice C.", "review": "The Mission is blessed with a slew of coffee shops and one would think that it shouldn't be hard to find a peaceful corner to read a book in.\n\nWrong.\n\nI went to at least 2 coffee shops in the area and almost gave up, until Stanza Coffee. \n\nThe back patio is a refuge from the craziness (and crazies!) that is 16th st. The baristas could be a TAD friendlier, but I got my chai latte quickly, sat down and read my book. Wifi is complimentary for you folks who don't like talking to other people.", "rating": 3, "date": "2015-07-11"}, {"excerpts": ["Nice atmosphere, but terrible wifi and my chai latte was not good at all. ", "Came here to work, but the wifi is so bad I won't come back again unless I was reading a book or something. ", "Not good for working."], "author": "Alexis Lynn E.", "review": "Nice atmosphere, but terrible wifi and my chai latte was not good at all. Came here to work, but the wifi is so bad I won't come back again unless I was reading a book or something. Not good for working.", "rating": 3, "date": "2017-01-29"}, {"excerpts": ["I ordered a chai and suddenly had a chocolate craving ", "so I asked if they made s chocolate chai, which my barista replied, \"not usually, ", "but I don't see why not!\" ", "Then happily made me a delicious chocolatey chai that gave me the smiles all the way to my next errand! ", "Will def come back to try other things when I'm in SF."], "author": "Akasha O.", "review": "I stopped in for a quick caffeine reup and was pleasantly greeted and served (and complimented) by the kind barista. I ordered a chai and suddenly had a chocolate craving so I asked if they made s chocolate chai, which my barista replied, \"not usually, but I don't see why not!\" Then happily made me a delicious chocolatey chai that gave me the smiles all the way to my next errand! Will def come back to try other things when I'm in SF.", "rating": 4, "date": "2016-05-21"}, {"excerpts": ["The chai tea is decent."], "author": "Maddie F.", "review": "The cold brew coffee is really sour and has a terrible after taste, the warm coffee isn't much better but it's a bit more bearable. No matter how much sugar I put in the cold brew I can't dull the bitter taste. The chai tea is decent.", "rating": 1, "date": "2016-11-26"}, {"excerpts": ["My chai latte is amazing, and it pretty much makes up for the complete lack of greeting upon entering.  "], "author": "Valerie T.", "review": "This place is more like 3.5 stars...\n\nGreat space....  Grey and a little dim, but cozy.  If San Francisco had rainy days, I'd come straight here, with a book in hand (and a head lamp).\n\nMy chai latte is amazing, and it pretty much makes up for the complete lack of greeting upon entering.  This barista is just too cool for conversation.\n\nThere's free wifi, but it's a little dark for getting things done on paper.  \n\nPrice range as only one $ because your coffee will be under $10, sure...  But $4-5 for a coffee could probably make the $$ rating, considering it's only a beverage.", "rating": 3, "date": "2015-04-19"}, {"excerpts": ["Best chai I've ever had.\n\n\n", "I've worked for major coffee retailers before and smaller shops (where chai was either a concentrate, a powder, or syrup)..", "but they steep REAL quality chai here with not too much milk "], "author": "Savanna W.", "review": "Holy shit. Best chai I've ever had.\n\n\nI've worked for major coffee retailers before and smaller shops (where chai was either a concentrate, a powder, or syrup)..but they steep REAL quality chai here with not too much milk and it was PERFECT. \n\nI happened upon this place while waiting for my bf to get off work and needed to kill time. Everyone in here has long hair, glasses, and a respect for SILENCE and personal space (something I don't see too often in many cafes).\n\nbonus: the baristas are  very informative and the playlist is on point!", "rating": 4, "date": "2014-10-11"}, {"excerpts": ["The chai tea is really good, but it's $4. ", "The hot tea is $4 too. ", "A bit too pricey for me. "], "author": "T N.", "review": "The chai tea is really good, but it's $4. The hot tea is $4 too. A bit too pricey for me. I guess that's what coffee and tea costs at these kinds of coffee shops these days. \n\nFree wifi from next door. Plugs at many of the tables, under the seat. \n--  Network: porkstorecafe\n--  Password: ilovebacon\n\nThe bathroom is a typical Mission coffee shop bathroom. I wish it were cleaner. I wish it was always fully stocked with toilet paper. I wish they offered toilet seat covers.", "rating": 4, "date": "2014-08-09"}, {"excerpts": ["The chai latte was delicious. ", "I will come back and sit outside on a warmer day."], "author": "Susan K.", "review": "Great ambiance and friendly baristas. The space and design feels intimate even though it has tall ceilings. I loved the front door, grey walls and cool art.  The chai latte was delicious. I will come back and sit outside on a warmer day.", "rating": 4, "date": "2014-08-05"}, {"excerpts": ["Love getting my chai here. ", "Also, a great place to do some work since there is free wifi ", "and it's not very crowded."], "author": "Monica W.", "review": "Love getting my chai here. Also, a great place to do some work since there is free wifi and it's not very crowded.", "rating": 5, "date": "2013-11-14"}], "thai iced tea": [{"excerpts": ["I ordered the thai iced tea, which was alright. ", "It wasn't very sweet or milky, two things I would have preferred. "], "author": "Karen Y.", "review": "I love the chill vibes that this coffee shop emits. There is relaxing music played in the background (albeit a bit loud and you can clearly hear it even with earphones on unless you have the noise cancelling headphones). The lighting is slightly dim and conveys an intimate setting.  There are outlets on the wall and many people come here to work on their laptops. \n\nThe interior design of this place is also phenomenal. Very detailed and meticulous, ornate designs placed on the walls. Love it!\n\nI ordered the thai iced tea, which was alright. It wasn't very sweet or milky, two things I would have preferred. My boyfriend ordered the cold brew and said it wasn't acidic at all. He thought the drink was particularly good here.\n\n (Sidenote: the bathroom here is really modern, cool, and clean)", "rating": 4, "date": "2018-06-10"}, {"excerpts": ["so I opted for a thai iced tea instead. ", "Surprisingly, It was hands down the best thai iced tea I've ever had. ", "Ever. ", "The sweetness of the drink was perfect, not overbearing like every other thai iced tea I've ever had. "], "author": "Umeet S.", "review": "Eclectic, hipster coffee shop minutes away from the 16th St BART station. Equipped with a simple, but comprehensive menu and a variety of pastries, there is something for everyone at Stanza. \n\nI really wanted to try their cappuccino, but alas it was late afternoon when I walked in so I opted for a thai iced tea instead. Surprisingly, It was hands down the best thai iced tea I've ever had. Ever. And I've had  my fair share of thai iced teas. Somehow Stanza got the perfect milk to tea ratio. The sweetness of the drink was perfect, not overbearing like every other thai iced tea I've ever had. It also came out in under a minute, presented adorably in a mason jar. \n\nThe coffee shop itself has a lot of seating inside, in the front patio, and in the back patio, each location with its own atmosphere almost. The inside is dimly lit, minimalist, and displays local art - perfect for getting some work done (tip: wifi code is on the blackboard to the left of the counter). The front patio is perfect for people watching, and the back is great for conversation. \n\nAll together a very well rounded cafe! I will definitely be back to try the espresso drinks.", "rating": 5, "date": "2016-11-02"}, {"excerpts": ["I order a Thai iced tea and look into the pastry cabinet. ", "I wish I were making this up, but there were several gnats crawling over the remaining croissants. ", "I asked the barista to throw it away. ", "He says: \"They are harmless."], "author": "Robert B.", "review": "So I walk in looking for a table. Tell me why there are a few free ones in the front stacked with dirty dishes. Fine. I'll use the patio. Can't expect just anyone to buss a table. \n\nI order a Thai iced tea and look into the pastry cabinet. I wish I were making this up, but there were several gnats crawling over the remaining croissants. I asked the barista to throw it away. He says: \"They are harmless.\" \n\nRight, so those gnats don't move from the bacterial contaminated trash to the pastries...? At least that's what the restaurant safety class taught me a few years back. \n\nAnd an easy way to get rid of them? Apple cider vinegar in an open cup with a drop of dish detergent. But of course the barista would rather ignore nastyness and smoke a cigarette out back. \n\n#hipsterratchet", "rating": 2, "date": "2015-04-19"}], "teas": [{"excerpts": ["They have some nice teas and the coffee is probably good. "], "author": "Priti K.", "review": "Great little hipster coffee shop in the Mission. It's quiet, the music isn't too loud and overall, it's a nice space to get some work done. I recently came here with my laptop and sat on the bar stools at the back. Unfortuantely, it does get quite crowded, so if you're coming to get work done be mindful you might not be able to easily snag a seat. \n\nThey have some nice teas and the coffee is probably good. I didn't try it.\n\nTakeaway message: chill coffee shop; good place to get work done. wifi is fast!", "rating": 4, "date": "2017-01-09"}, {"excerpts": ["I wish that wasn't the case because their coffee and teas are exceptional."], "author": "Sarah T.", "review": "Everyone who works here is awesome. The service is never the problem, its the space itself. You can fit about 14 people (uncomfortably) at these benches tables made for toddlers. I wish that wasn't the case because their coffee and teas are exceptional.", "rating": 3, "date": "2018-01-12"}, {"excerpts": ["And I've had  my fair share of thai iced teas. ", "Somehow Stanza got the perfect milk to tea ratio. "], "author": "Umeet S.", "review": "Eclectic, hipster coffee shop minutes away from the 16th St BART station. Equipped with a simple, but comprehensive menu and a variety of pastries, there is something for everyone at Stanza. \n\nI really wanted to try their cappuccino, but alas it was late afternoon when I walked in so I opted for a thai iced tea instead. Surprisingly, It was hands down the best thai iced tea I've ever had. Ever. And I've had  my fair share of thai iced teas. Somehow Stanza got the perfect milk to tea ratio. The sweetness of the drink was perfect, not overbearing like every other thai iced tea I've ever had. It also came out in under a minute, presented adorably in a mason jar. \n\nThe coffee shop itself has a lot of seating inside, in the front patio, and in the back patio, each location with its own atmosphere almost. The inside is dimly lit, minimalist, and displays local art - perfect for getting some work done (tip: wifi code is on the blackboard to the left of the counter). The front patio is perfect for people watching, and the back is great for conversation. \n\nAll together a very well rounded cafe! I will definitely be back to try the espresso drinks.", "rating": 5, "date": "2016-11-02"}, {"excerpts": ["One of the best iced teas I have ever had (Infusion iced tea). ", "And the barrister was super nice too! ", ":)"], "author": "Saziya L.", "review": "One of the best iced teas I have ever had (Infusion iced tea). And the barrister was super nice too! :)", "rating": 5, "date": "2015-08-01"}, {"excerpts": ["When I asked what teas they carried the girl pointed at a sign and seemed bothered to speak, which was actually kind of funny. ", "Anyway the tea was good, can't go wrong with a green tea but not for $4."], "author": "Margo D.", "review": "It started pouring and I needed shelter and something warm so I popped in here for a tea. When I asked what teas they carried the girl pointed at a sign and seemed bothered to speak, which was actually kind of funny. Anyway the tea was good, can't go wrong with a green tea but not for $4.", "rating": 2, "date": "2014-04-01"}, {"excerpts": ["Also, they have artisan teas from red blossom. ", "The single origin espressos are dialed in meticulously when they get in a new bean. ", "They pull on the Slayer II espresso machine, and they're the only cafe in the city with it. ", "It's another one-off place with just a few solid employees so you can become a regular fast. ", "And they are mostly easy on the eyes, handshaking kind of boys. ", "Every so often the music can get loud in the afternoon "], "author": "Elizabeth ..", "review": "The newest good coffee place in the mission, Only a month old, they're still small enough to avoid a busy morning line but growing bigger by the day. \nIt isn't a roaster but a rotating coffee bar, so they offer small lots from roasters around sf and around the country served french press, pour over, and espresso drink options depending on how the type of coffee best tastes. Also, they have artisan teas from red blossom. The single origin espressos are dialed in meticulously when they get in a new bean. They pull on the Slayer II espresso machine, and they're the only cafe in the city with it. It's another one-off place with just a few solid employees so you can become a regular fast. And they are mostly easy on the eyes, handshaking kind of boys. Every so often the music can get loud in the afternoon but there's outdoor seating as well and the music is usually pretty good stuff.\n\nYeah, they have cream behind the counter and not out, you should kind of get over it and try the coffee without it. Those types of places are proud of their choices in roasters and coffees, though you can always ask for it and they won't judge. Some places in the city can get a bit impersonal and holier than thou. They'll answer any questions and enjoy discussion. Free wifi, and awesome vegan doughnuts. It looks sort of like a dark french brasserie too, tucked away watching a busy 16th street. If you like or know something about coffee, you'll like this place (and vice versa).", "rating": 5, "date": "2013-01-02"}, {"excerpts": ["Stanza has great teas, heavenly pastries by Mr. Holmes SF and outstanding customer service. ", "The cardamom scone is perfection...and if ya' get there near closing you might even get a special treat. ", "Great neighborhood spot with down-home folks!"], "author": "Lila R.", "review": "Stanza has great teas, heavenly pastries by Mr. Holmes SF and outstanding customer service. The cardamom scone is perfection...and if ya' get there near closing you might even get a special treat. Great neighborhood spot with down-home folks!", "rating": 4, "date": "2014-01-01"}, {"excerpts": ["i actually feel like a fellow human being there, not just a city zombie\n\nits a beautiful space with nice lights, and a great place for chatting, reading, working, making art, etc\n\n*bonus: yummy sweet treats, special teas, cool black toilets, current hidden gem"], "author": "Angela M.", "review": "this is my favorite place for coffee in the mission!  \n\nthese guys are serious about their coffee and they are super friendly and welcoming\n\ni actually feel like a fellow human being there, not just a city zombie\n\nits a beautiful space with nice lights, and a great place for chatting, reading, working, making art, etc\n\n*bonus: yummy sweet treats, special teas, cool black toilets, current hidden gem", "rating": 4, "date": "2013-02-26"}], "cookies": [{"excerpts": ["I wish I had gotten their amazing looking cookies, specifically the half pb and half chocolate but next time. ", "I took one star off because while the coffee was good it was slightly too acidic for my taste. "], "author": "Amy K.", "review": "This place was A-OK, we were looking for coffee and of course, why not go to an amazing stand alone vs a Sbux if you can? The ordering was easy enough, we walked in and got a cold brew. They immediately brewed up and we got it quickly. I wish I had gotten their amazing looking cookies, specifically the half pb and half chocolate but next time. I took one star off because while the coffee was good it was slightly too acidic for my taste. We sat on their patio which was nice and had a beautiful wall mural but was ridden with a ton of flies. \n\nOverall, A-OK.", "rating": 3, "date": "2018-04-24"}, {"excerpts": ["Try one of the vegan cookies :)"], "author": "Teresa C.", "review": "Love this spot! The staff is so friendly and great. There is also a beautiful outside patio in the back. Great for relaxing on weekends. \n\nAnd of course the coffee is delicious. Try one of the vegan cookies :)", "rating": 5, "date": "2018-05-20"}, {"excerpts": ["Chocolate-chip oatmeal cookies are all right."], "author": "John L.", "review": "Pretty comfortable spot. Chocolate-chip oatmeal cookies are all right.", "rating": 3, "date": "2017-09-30"}, {"excerpts": ["One of the staff even came around with free cookies before I left. "], "author": "Kathy S.", "review": "With 2-3 hours to kill before heading to the airport, I was looking for a coffee shop where I could park it and work for a while. After reading reviews of lots of other places, it didn't seem like I'd ever find a place WITHOUT pretentious baristas, tiny tables, and horribly overpriced drinks...until Yelp led me to Stanza. Yay! Bonus points that it was very easily accessible by BART (16th & Mission) and only a few blocks from the station, so I didn't have to lug around my bags too far.\n\nTwo of my must-haves for a coffee shop to make it on my \"traveling office\" list is that there's reliable wifi and plenty of outlets available: Stanza's got both. I also enjoyed that the tables are a decent size per person -- sometimes tables for 1 or 2 people are miniature, with barely enough room to fit one laptop, let alone two. These were decent sized tables with enough room to spread out a laptop and all of my other stuff. \n\nThe barista was friendly, greeted me as soon as I came up to the counter, and had my cappuccino ready fairly quickly. 5 stars for the cappuccino alone; it's one of my top 3 that I've ever had. One of the staff even came around with free cookies before I left. Woohoo!\n\nI was there on a weekday morning/early afternoon so it wasn't too crowded. In fact, I felt right at home hanging out with about 6-8 other folks who had been working there all morning: Usually, I'm wary of ever leaving my stuff alone at a coffee shop (ie. whenever I need a bathroom break) but I didn't have any problems doing so here. \n\nCan't wait to come back!", "rating": 5, "date": "2016-01-30"}, {"excerpts": ["Pastries and snacks, including one of the best chocolate chip cookies I have had in a long time.\n\n"], "author": "Nathan T.", "review": "Great find.  Pour over coffee and press coffee selections.  Pastries and snacks, including one of the best chocolate chip cookies I have had in a long time.\n\nPrices were reasonable. $4 for pour over.  Excellent cup of coffee.\n\nNice chairs and internet. Single restroom provided.", "rating": 4, "date": "2014-04-01"}], "muffin  scone": [], "pastries": [{"excerpts": ["This is a really nice coffee shop with good coffee and delicious pastries. ", "The guy working there told us that they don't sell very large coffees because otherwise people just go there to work and stay forever with their large drink. ", "So I take that it's not very work friendly, and I'm totally fine with that because I rather come here to hang with friends. "], "author": "Marta F.", "review": "This is a really nice coffee shop with good coffee and delicious pastries. The guy working there told us that they don't sell very large coffees because otherwise people just go there to work and stay forever with their large drink. So I take that it's not very work friendly, and I'm totally fine with that because I rather come here to hang with friends. That said, every time I go there are at least a couple of people coding on their laptops, so it's not like you can't do it. \n\nThey also have a cute back patio.", "rating": 5, "date": "2017-04-16"}, {"excerpts": ["and we also got pastries. \n", "Their restroom is like hidden at the very back where they need to buzz you in bc the restrooms are for customers only."], "author": "Jozza M.", "review": "It was a sunny Saturday Morning! \nThis place was cute! they brew their coffee in these manual brewers where you can see them, it has that hint of an antique layout to it. like their seats and tables and some decor. the floor was wooden and has a bar-like layout for the rest of the seats. Kevin and I just wanted something to drink while we wait for Cha Cha Cha down the street and this place was a great kickin spot! \n\nI got earl grey tea my fave and Kev tried their iced Kyoto coffee and we also got pastries. \nTheir restroom is like hidden at the very back where they need to buzz you in bc the restrooms are for customers only.", "rating": 4, "date": "2016-05-10"}, {"excerpts": ["The pastries are subpar than the ones from before.\n\n"], "author": "Jessi R.", "review": "I don't know what happened to this place, and it disappoints me greatly.\n\nI used to love coming here for the back porch with a croissant and a latte and stay for a couple of hours reading on a Sunday. The staff was nice enough, and on weekday mornings, I stuck with the batch brew because everything took impossibly too long. But it was fine because I liked the management. \n\nI stepped in here a couple of weeks ago and it felt very off. The cups have gotten smaller, the usual hip baristas are no where to be found, and they play elevator music. The pastries are subpar than the ones from before.\n\nStanza must have changed ownership - its the only explanation and boy, it is palpable. Its missing the heart that it once had, so I guess I'll be finding a new local coffehouse to patronize.", "rating": 2, "date": "2017-06-13"}, {"excerpts": ["Free wifi, classic coffee menu, and plenty of oversized and delicious pastries. ", "There are many tables to choose from, inside and outside, but you'll have to pick the right one to be close to an electrical outlet. ", "The Thai tea was good, but I could've passed on the slight attitude when I asked where the straws were..."], "author": "Ashley C.", "review": "Free wifi, classic coffee menu, and plenty of oversized and delicious pastries. There are many tables to choose from, inside and outside, but you'll have to pick the right one to be close to an electrical outlet. The Thai tea was good, but I could've passed on the slight attitude when I asked where the straws were...", "rating": 4, "date": "2016-09-13"}, {"excerpts": ["the drinks and the pastries are okey dokey. ", "One of the better places in the city if you are looking for a hipster coffee shop. "], "author": "Anna H.", "review": "I think this place has a rodent problem. Saw many droppings on the front patio. I'm not surprised though because the place doesn't look very clean. \n\nDon't get me wrong--the drinks and the pastries are okey dokey. One of the better places in the city if you are looking for a hipster coffee shop. Wifi is also really fast!\n\nBUT the outside seating area throws me off. They allow smoking in the back and front patio. It seems like a place that people go to just to smoke (especially the back patio). Hard to enjoy sitting outside when all this is happening around me.", "rating": 2, "date": "2016-08-21"}, {"excerpts": ["pastries look awesome\n6. "], "author": "Vicki T.", "review": "1. shaded outdoor seating\n2. amazing iced mocha\n3. friendly barista \n4. music isn't too loud\n5. pastries look awesome\n6. great location\n\nafter writing all this down... i'm upping their stars...", "rating": 5, "date": "2017-02-16"}, {"excerpts": ["The coffee, hours and prices are still good, but the pastries have switched and the music has gotten a little elevatory. ", "They also have a patio at the back which is nice to sit in on a good weather day."], "author": "Jasiah L.", "review": "The coffee, hours and prices are still good, but the pastries have switched and the music has gotten a little elevatory. They also have a patio at the back which is nice to sit in on a good weather day.", "rating": 4, "date": "2017-08-17"}, {"excerpts": ["But I've still got so many other pastries to try!\n\n", "They sell these ham and cheese pastries that are cold, and do not provide a microwave to heat them up. ", "They say it tastes better without heat. ", "I say, bullshit. "], "author": "June H.", "review": "I love coming here before working in the Mission.\n\nTheir coffee is on par with Blue Bottle and Ritual. But to be fair, I have only really had their lattes and mochas. \n\nI am addicted to their walnut chocolate chip cookie and their morning muffins aren't bad, either. I was a little disappointed at their raspberry tart, though. :'( It wasn't flaky enough for my tastes, and didn't taste as good as the other two. But I've still got so many other pastries to try!\n\n*edit*\n\nGotta knock it down a star. They sell these ham and cheese pastries that are cold, and do not provide a microwave to heat them up. They say it tastes better without heat. I say, bullshit. It did not taste good at all.\n\nI'll stick to the overall excellent coffee they have and the walnut choco cookie/ginger blueberry muffin.", "rating": 3, "date": "2015-08-25"}, {"excerpts": ["Equipped with a simple, but comprehensive menu and a variety of pastries, there is something for everyone at Stanza. \n\n"], "author": "Umeet S.", "review": "Eclectic, hipster coffee shop minutes away from the 16th St BART station. Equipped with a simple, but comprehensive menu and a variety of pastries, there is something for everyone at Stanza. \n\nI really wanted to try their cappuccino, but alas it was late afternoon when I walked in so I opted for a thai iced tea instead. Surprisingly, It was hands down the best thai iced tea I've ever had. Ever. And I've had  my fair share of thai iced teas. Somehow Stanza got the perfect milk to tea ratio. The sweetness of the drink was perfect, not overbearing like every other thai iced tea I've ever had. It also came out in under a minute, presented adorably in a mason jar. \n\nThe coffee shop itself has a lot of seating inside, in the front patio, and in the back patio, each location with its own atmosphere almost. The inside is dimly lit, minimalist, and displays local art - perfect for getting some work done (tip: wifi code is on the blackboard to the left of the counter). The front patio is perfect for people watching, and the back is great for conversation. \n\nAll together a very well rounded cafe! I will definitely be back to try the espresso drinks.", "rating": 5, "date": "2016-11-02"}, {"excerpts": ["selection of pastries by the register. ", "I ordered a cranberry orange scone and a chocolate walnut cookie, and both really hit the spot on a Monday morning. ", "There is also a really cute outdoor area in the back with lots of tables and comfy chairs. "], "author": "Robia L.", "review": "I stopped by here for a quick coffee break with a colleague. It's a bit dark once you step inside, but I thought this added to the relaxed atmosphere. They have a small (but tasty!) selection of pastries by the register. I ordered a cranberry orange scone and a chocolate walnut cookie, and both really hit the spot on a Monday morning. There is also a really cute outdoor area in the back with lots of tables and comfy chairs. I could definitely see myself chilling outside with some friends on a warm day.\n\nOnly thing that I didn't like was that the wait for our drinks was a bit long. There was only one order ahead of us, so I didn't understand why it took them so long.", "rating": 4, "date": "2015-11-24"}, {"excerpts": ["Food - they have pastries, but no prepared food.\n\n"], "author": "Juliet S.", "review": "Great little coffee shop in the Mission. Not as popular as four barrel or any of the crazy trendy spots. I'm still not sure exactly why people come from all over the world to drink a cup of $6 coffee, but whatever.\n\nThey have delicious drip coffee. They also have espresso drinks, but the drip coffee is the specialty. My personal favorite is the cold brew coffee. Iced coffee is so 1999 compared to cold brew. FYI - if you haven't had it you can't add any milk or creamer. It's most delicious plain...it's all about the true flavor of the coffee.\n\nAtmosphere - Stanza has a fair amount of seating. A few seats are outdoors in the front and the remainder are inside. Cute decor, simple and hipster-ish. \n\nFood - they have pastries, but no prepared food.\n\nSummary - great neighborhood coffee spot. Perfect place to stop in the morning before hopping on the Bart at 16th and Mission.", "rating": 4, "date": "2016-01-17"}, {"excerpts": [": Check out their pastries!"], "author": "Mike D.", "review": "I feel such at home here. Stanza is the epitome of what I look for in a hipster coffee joint. Everything from the dimly lit interior to the whole space made of black/grey/wood to the artisan coffee that they serve. The front heated patio makes it very welcoming to just hang for a while. \n\nThe barista that helped us out was awesome. Super nice with recommendations and even opened up the back patio for my bud and I to just hang... and hang we did. \n\nI ordered the cappuccino (as I always do on my first visit to any hipster coffee joints) and my bud ordered herself a macchiato. I didn't have any of hers, but my cappuccino was dead on. Nice bold aroma with a hell of a balance of milk. \n\nWORD OF ADVICE: Check out their pastries!", "rating": 5, "date": "2013-10-29"}, {"excerpts": ["Stanza always has a great array of pastries in the morning from local bakeries.\n\n"], "author": "Lauren G.", "review": "Great coffee and shop! I love the cold brew at stanza, it's really strong. I've also had espresso drinks here and love them. I'm a coffee fanatic, and this is definitely one of my favorite spots in the city. Stanza always has a great array of pastries in the morning from local bakeries.\n\nUnfortunately I have to knock down a star for the ambiance - I don't dig the darkness of the location, and I don't enjoy sitting in there.", "rating": 4, "date": "2015-06-01"}, {"excerpts": ["\" \n\nRight, so those gnats don't move from the bacterial contaminated trash to the pastries...? "], "author": "Robert B.", "review": "So I walk in looking for a table. Tell me why there are a few free ones in the front stacked with dirty dishes. Fine. I'll use the patio. Can't expect just anyone to buss a table. \n\nI order a Thai iced tea and look into the pastry cabinet. I wish I were making this up, but there were several gnats crawling over the remaining croissants. I asked the barista to throw it away. He says: \"They are harmless.\" \n\nRight, so those gnats don't move from the bacterial contaminated trash to the pastries...? At least that's what the restaurant safety class taught me a few years back. \n\nAnd an easy way to get rid of them? Apple cider vinegar in an open cup with a drop of dish detergent. But of course the barista would rather ignore nastyness and smoke a cigarette out back. \n\n#hipsterratchet", "rating": 2, "date": "2015-04-19"}, {"excerpts": ["Their pastries are soooo yummy "], "author": "Mimi T.", "review": "In the mission..gahh.. where I find safety is actually inside Stanza Coffee. \n\nI love that hipster feel, with the staff. Maybe not so friendly, but you everyone has their days right? Their pastries are soooo yummy and they have yummy coffee.\n\nI come in here to use their wifi and work early in the mornings and in late afternoons. They have these cute little booths for one.", "rating": 4, "date": "2013-10-24"}, {"excerpts": ["The pastries are the normal selection. ", "The vibe is mellow. ", "The creamer container is weird. "], "author": "Ben V.", "review": "When Stanza opened, they only offered french press for a non-espresso drink. I am mixed on french press. Sometimes it is great, sometimes it is burned, sometimes grinds are floating around in my coffee.\n\nAfter a few months, I have returned. To my delight, they now have a simple batch brew. Great idea! The pastries are the normal selection. The vibe is mellow. The creamer container is weird. (I know this seems cool and kitschy, but it is small, meaning it will run out and require refilling way more ofter - which involves a customer butting into another order to request a refill)\n\nThe tables and seats are already kind of junky. It isn't really bad yet. But I suspect the place will be on the level of Philz (best coffee, junky interior) or Muddy Waters in no time.  I don't need luxury. But run down is unpleasant.\n\n!!!And the big complaint!!!  WHY KEEP IT FREEZING? You are trying to make it a cozy coffee shop. But you prop the door open so it is ~60 degrees. I am watching the steam from someone's freshly poured coffee being pushed by the wind (BY THE WIND) coming in the door. That drink, like mine, will be cold in 3 minutes and my toes numb in 12.\n\nThe cold is a plague of coffee shops and bars in this town. Maybe pouring coffee (or mixing drinks) makes you warm. But sitting at your tables makes me freezing.", "rating": 3, "date": "2015-05-06"}, {"excerpts": ["Great pastries and atmosphere but today's service was just subpar. ", "I stood at the register for a few minutes while there were no other customers. ", "One employee was chatting it up with someone else and the other was in the back. ", "If you see me and I am standing there the least thing you could've done was greet and acknowledge me. ", "When I finally was served, the employee was a bit rude."], "author": "Sharon Y.", "review": "Great pastries and atmosphere but today's service was just subpar. I stood at the register for a few minutes while there were no other customers. One employee was chatting it up with someone else and the other was in the back. If you see me and I am standing there the least thing you could've done was greet and acknowledge me. When I finally was served, the employee was a bit rude.", "rating": 3, "date": "2016-05-29"}, {"excerpts": ["Carefully curated collection of small pastries. ", "Dark and sultry ambience with backyard patio and front semi outdoor seating. ", "There is an amazing Moroccan door leading into the coffee shop."], "author": "M S.", "review": "Great spot for high end coffee.  Carefully curated collection of small pastries. Dark and sultry ambience with backyard patio and front semi outdoor seating. There is an amazing Moroccan door leading into the coffee shop.", "rating": 5, "date": "2015-12-22"}, {"excerpts": ["Pastries and snacks, including one of the best chocolate chip cookies I have had in a long time.\n\n"], "author": "Nathan T.", "review": "Great find.  Pour over coffee and press coffee selections.  Pastries and snacks, including one of the best chocolate chip cookies I have had in a long time.\n\nPrices were reasonable. $4 for pour over.  Excellent cup of coffee.\n\nNice chairs and internet. Single restroom provided.", "rating": 4, "date": "2014-04-01"}, {"excerpts": ["The pastries are BIG - hubba hubba :)"], "author": "Jama L.", "review": "BACK PATIO - don't be shy! Seriously superb pour - over black coffee. Watch the Kyoto drip if you're spacing out over your work :) The ambiance in here, by the way, is conducive to getting it done  - outside of rush hour of course. Stanza hosts cuppings occasionally - don't miss it! \n\nThe baristas are geekin on caffeine - which, in this case, is a good thing. They're modest about it, but two of them are celebs.  The featured roasts are on rotation and their Ethiopians are always a home run. The pastries are BIG - hubba hubba :)", "rating": 5, "date": "2013-04-30"}, {"excerpts": [":) Also, the pastries are pretty yummy."], "author": "Jessica S.", "review": "I accidentally left something in the bathroom, and an employee held it for me until the next day. :) Also, the pastries are pretty yummy.", "rating": 5, "date": "2015-08-19"}, {"excerpts": ["The only pastries on offer were donuts. ", "Tried a bit of the chocolate. ", "Meh. ", "If you like Pebbles, then fine. ", "Maybe you'd like the rest of mine? "], "author": "iko o.", "review": "Wow, coffee from exotic locals like Kansas or North Carolina. Huh? Locovore, not! Went for the Ethiopian drip. Hard to go wrong with Ethiopian. Or so, I thought. \"Here, smell this\" the barista said, offering the grounds before the pour. I smelled. Smelled - um - green.  As in: the roast didn't make it to the first crack kinda green. \n\nThe only pastries on offer were donuts. Tried a bit of the chocolate. Meh. If you like Pebbles, then fine. Maybe you'd like the rest of mine? (Oh, imaginary yelp companion?)\n\nMaybe no WiFi.  They all had passwords. Didn't ask. The music started pretty chill (which is why I stopped in). And then it wasn't. Table wobbled. Was the only customer. And then I left. Rather Zen like emptiness.\n\none sip and a bite\na still life of unfinished\nupon my leaving", "rating": 2, "date": "2012-12-31"}, {"excerpts": ["Stanza has great teas, heavenly pastries by Mr. Holmes SF and outstanding customer service. ", "The cardamom scone is perfection...and if ya' get there near closing you might even get a special treat. ", "Great neighborhood spot with down-home folks!"], "author": "Lila R.", "review": "Stanza has great teas, heavenly pastries by Mr. Holmes SF and outstanding customer service. The cardamom scone is perfection...and if ya' get there near closing you might even get a special treat. Great neighborhood spot with down-home folks!", "rating": 4, "date": "2014-01-01"}, {"excerpts": ["The pastries are amazing and I highly recommend the chocolate chip sea salt cookie! ", "Coffee is good and prices on par with everyone else. ", "Defiantly a spot to go for a coffee if you find yourself in this area."], "author": "Sandra B.", "review": "I love the design, layout and general ambience of this adorable coffee shop. It is very clean and a marked difference from the street outside. The staff are friendly and efficient. The pastries are amazing and I highly recommend the chocolate chip sea salt cookie! Coffee is good and prices on par with everyone else. Defiantly a spot to go for a coffee if you find yourself in this area.", "rating": 4, "date": "2014-03-29"}, {"excerpts": ["amazing coffee and amazing pastries from mission beach cafe. ", "the only reason for 4 stars and not 5 is that the baristas are literally the slowest ive ever encountered in my entire life. ", "a baby sloth could cross the street before my espresso would be ready."], "author": "Some B.", "review": "amazing coffee and amazing pastries from mission beach cafe. the only reason for 4 stars and not 5 is that the baristas are literally the slowest ive ever encountered in my entire life. a baby sloth could cross the street before my espresso would be ready.", "rating": 4, "date": "2015-07-11"}, {"excerpts": ["Looked at the pastries, saw a bunch of little flies on them.. ", "Gross!! ", "The outside patio needs a lot of cleaning. ", "Would not go again."], "author": "Brenda S.", "review": "Had a mocha, they had no non fat milk. It was good coffee. Looked at the pastries, saw a bunch of little flies on them.. Gross!! The outside patio needs a lot of cleaning. Would not go again.", "rating": 3, "date": "2015-08-21"}, {"excerpts": ["i think i just found a new worthwhile caffeine oasis in the mission:  plenty of seating, assorted pastries and even has free wifi.  ", "But actually its all about the coffee.  "], "author": "Joseph C.", "review": "i think i just found a new worthwhile caffeine oasis in the mission:  plenty of seating, assorted pastries and even has free wifi.  But actually its all about the coffee.  Darn good cappuccino, and amazing pour over by the mug.  I tried the Ethiopian Sutamo and its was rich and complex.  Menu board described its with \"Cherry notes\" and \"the bomb.\"  Indeed, it was a cherrybomb!  (also my favorite song by the spoons).   So if four barrel is getting too hipster and ritual is just too crowded, then maybe Stanza is your next stop.", "rating": 5, "date": "2013-03-01"}, {"excerpts": ["They have a very good coffee and pastries."], "author": "Luca R.", "review": "Nice place. Just around the corner our home. Some time there are too many annoying hipsters but most of the time it is pleasant. They have a very good coffee and pastries.", "rating": 3, "date": "2013-12-29"}], "walnut baklava": [], "pistachio baklava": [], "sparkling water": [], "homemade iced tea": [], "fresh lemonade": [], "arnold pulmer": []}