{"vegi pakora": [{"excerpts": ["gulab jamun is perfect and along with that we  have chiken and vegi pakora with tea,"], "author": "Srikanth T.", "review": "i was been there for couple of times with my friend and the food was really good and i usally want to go with buffet over here and all dishes you know won't leave one item in the buffet everything is great and delicious the thing i like more here is chiken thikka masala and the at the end with gulab jamun is perfect and along with that we  have chiken and vegi pakora with tea,", "rating": 5, "date": "2016-10-25"}, {"excerpts": ["The chicken masala and the Vegi pakora are amazing!! ", "Also, the price is reasonable, and the people are nice (:"], "author": "Inbar V.", "review": "Best Indian food in San Francisco!! Great dishes and the food is delicious! You must eat here (: I'm a student coming here all the time. The chicken masala and the Vegi pakora are amazing!! Also, the price is reasonable, and the people are nice (:", "rating": 5, "date": "2015-06-05"}], "samosa vegetable": [{"excerpts": ["Samosa vegetable ($3.50)\n", "The shell was nicely fried, flaky with a little chew. "], "author": "Elena N.", "review": "I've ordered delivery from here a couple of times over the years. This past Friday, I was craving Indian food and decided to give Star India another shot. Since I was by myself, I knew I would only want a curry, naan, samosa and maybe a side of rice. This was one of the only places that has a $20 minimum versus a $25+ min. I ordered via Eat24 since I had a $2 off weekend promo code.\n\nSamosa vegetable ($3.50)\nThe shell was nicely fried, flaky with a little chew. I enjoyed this with the mint dipping sauce.\n\nGarlic naan: garlic leavened bread ($2.25)\nFor me, this could have used a little more garlic, but the naan had a nice chew.\n\nChicken tikka masala: chicken tandoori with herbs and tomato sauce ($10.95)\nGood flavor. The sauce actually got better the next day since it tasted spicier. The chicken was good. I wish the pieces were smaller since it was a little hard to eat with the huge chunks of chicken. The first day, the chicken was good. Slightly dry, but nothing the curry couldn't mask. The next day with reheating, the chicken was so dry! Really hard to eat. No amount of sauce could cover up the dryness. \n\nPilau rice: basmati rice with peas, tomatoes and spices ($3.50)\nThis has raisins and nuts. I wish they put that in the description since I literally when through the whole container and picked out all the raisins and nuts. The rice itself was good and had a nice flavor.\n\nNot sure if I'll order from them again as everything was just okay. But I do like that they have a $20 min. Makes it easy when I'm dining solo!", "rating": 3, "date": "2014-10-12"}], "onion bhaji": [{"excerpts": ["My order:\nOnion Bhaji\nChicken Korma\n", "Kabuli Naan\n\nI was super excited to find a place that carries onion bhaji, because it seems to be something of a rarity when I get Indian food. ", "I was disappointed though that instead of the crispy, flavorful onion bhaji I love, I got soft, squishy onion rings. ", "I will try and save the korma and adjust the flavor myself as a leftover maybe, but I think the onion bhaji is beyond saving.\n\n"], "author": "Kirsten E.", "review": "I know as someone with a very low spice tolerance, ordering Indian food is always a gamble so I try to be fair in reviewing it. I'll break it down by menu item that I purchased.\n\nMy order:\nOnion Bhaji\nChicken Korma\nKabuli Naan\n\nI was super excited to find a place that carries onion bhaji, because it seems to be something of a rarity when I get Indian food. I was disappointed though that instead of the crispy, flavorful onion bhaji I love, I got soft, squishy onion rings. It was very disappointing!\n\nI almost always order korma, because it's usually the safest pick for someone who doesn't like spicy food. This is easily the spiciest korma I have ever had (and I have eaten A LOT of korma in my day!), and all of the subtle flavors I love in korma were totally lacking. Again, very disappointing!\n\nThe Kabuli Naan was good (something not spicy, yay!), but as the only thing I was able to comfortably eat out of the whole order, it's nothing to write home about. \n\nHowever, what I will say in favor of this place is that the portions are good, they don't skimp at least. Downside for me is that I have a good chunk of food in front of me that I can't eat, because it is too spicy or too mushy. I will try and save the korma and adjust the flavor myself as a leftover maybe, but I think the onion bhaji is beyond saving.\n\nI appreciate that the delivery was prompt though, especially since my place is hard to find. \n\nMaybe if you like your food really spicy you will have a better experience than me, but overall I think the spiciness just covers up the fact that the food is otherwise fairly bland in terms of flavor and complexity.\n\nUnfortunately, I won't be eating here/ordering from here again.", "rating": 2, "date": "2014-05-08"}], "vegetarian combination": [{"excerpts": ["I started with the Vegetarian Combination and the samosa's are crispy potato goodness. ", "I then moved to the main course where I combined the Channa Masala I decided to have it a little spicier and ordered it hot!!! ", "Wow was it good. ", "The Lamb Korma was creamy, savory & tender. "], "author": "Alex T.", "review": "I love Indian food!!! and Star India is great. I checked out grub hub and decided to get a bit of take out. I was hungry and so I order a lot of food. (don't judge me, It all was great!) I started with the Vegetarian Combination and the samosa's are crispy potato goodness. I then moved to the main course where I combined the Channa Masala I decided to have it a little spicier and ordered it hot!!! Wow was it good. The Lamb Korma was creamy, savory & tender. I'm not sure why I ordered lamb, I was just compelled to give it a try and boy was I glad I did. \n\nThere take out menu will be at the top of my short list when I'm in the mood for Indian food.", "rating": 4, "date": "2008-10-20"}], "papadams": [{"excerpts": ["The buffet includes yummy dal soup, pakoras and papadams to start, freshly made naan, rice, and plenty of delicious main dishes to choose from. ", "It even includes chai tea, although I have never tried that. ", "They rotate out bean dishes, too: sometimes chana masala, sometimes rajma, sometimes dal; I've even had black-eyed peas, and as a transplanted Southerner I can tell you I appreciated that. "], "author": "Charity V.", "review": "I absolutely love this place. I work very close and go here at least once a week, often more. The buffet is a great deal. Sure it's not as cheap as Taco Bell but the food is outstanding. I literally just got back from eating there and I seriously want to go back for more. \n\nThe buffet includes yummy dal soup, pakoras and papadams to start, freshly made naan, rice, and plenty of delicious main dishes to choose from. It even includes chai tea, although I have never tried that. Oh, and salad, just in case you come to an Indian buffet for salad (weird-o).\n\nI'm mostly a vegetarian, so I always eat the veggie options and despite the fact that I come in so frequently, I never tire of the food. They always have saag paneer and veggie (sometimes with paneer) korma. They have different veggie dishes, usually one with potatoes and one or more without. They rotate out bean dishes, too: sometimes chana masala, sometimes rajma, sometimes dal; I've even had black-eyed peas, and as a transplanted Southerner I can tell you I appreciated that. Although my mom wouldn't recognize the ones I ate here. :-) \n\nAlso, the people here are amazing. I LOVE them. They are all, without exception, nice and warm and wonderful. They work so hard, even though almost everyone there is usually taking advantage of the delicious buffet. They refill my water faithfully and bring naan quickly (remember, it's prepared fresh for each customer so it doesn't come right away, but it's way better than having to rely on dried out naan from under a heat lamp). They greet everyone who comes in and strive to provide good service and food to each of their customers. \n\nI will be honest, sometimes a main dish might not be as good as it usually is. Sometimes the soup isn't as spicy as I like it. Sometimes they run out of something. But seriously. It's a buffet, you guys. These things happen. Overall the food is always satisfying and the dining experience is always positive and every single time I leave I'm glad I went to eat there.\n\nYou must try it! And please tell them you liked my review. They have been joking that I need to write one for months.\n\n(I originally wrote this review in 2013 but just had to consolidate duplicate yelp accounts)", "rating": 5, "date": "2017-05-19"}, {"excerpts": ["Papadams.   ", "And.   "], "author": "Attipatla A.", "review": "Me and.  My friend Narad went dinner.  Food.    Was.  Superb.    And.  Service is.  Amazing.       Had.   A perfect.   Meal.  At the same time a group of 50\n People r there.  Eventhough.  We got a table we had aptizers veg pakora chicken pakora. Papadams.   And.   Mix salad.  With.  Different.  Dressings.  And cmg main meal.  Like.  Plenty of dishes. Including.  Chicken tandoori.   Dessert gulabjamun.  And Kher", "rating": 5, "date": "2016-05-31"}, {"excerpts": ["My favorites are their naan (comes to your table warm in a basket), papadams, saag paneer, and tandoori chicken."], "author": "Julie P.", "review": "My husband and I come here for the $9.99 dinner buffet, which is a great deal for the quality of the dishes especially recently.  Not sure if they have new management or maybe changed up their menu a little bit, but the food tastes fresher and more flavorful than before.  My favorites are their naan (comes to your table warm in a basket), papadams, saag paneer, and tandoori chicken.", "rating": 4, "date": "2012-01-22"}, {"excerpts": ["As someone else said, they have papadams in the buffet which was fantastic.  ", "They also have samosa, pakora, and this fried fish nugget thing.  ", "When I went they also had a great okra dish, a less exciting navratan korma, and a not very good at all vegetarian gluten cooked in curry.  ", "The naan was a little chewy too, but probably because it had been sitting out for a bit.  ", "For dessert, there was kheer and gulab jamun.  "], "author": "Joann C.", "review": "This place is definitely okay.  Not amazing Indian food, but decent.  It's really 3 stars for the food + 1 more for the price.  The all you can eat dinner buffet is $10, and though the curries are a little runny they still have a decent amount of flavor.  \n\nAs someone else said, they have papadams in the buffet which was fantastic.  They also have samosa, pakora, and this fried fish nugget thing.  When I went they also had a great okra dish, a less exciting navratan korma, and a not very good at all vegetarian gluten cooked in curry.  The naan was a little chewy too, but probably because it had been sitting out for a bit.  For dessert, there was kheer and gulab jamun.  They also include chai with the buffet.\n\nOverall for the price, I was quite impressed.", "rating": 4, "date": "2008-08-05"}, {"excerpts": ["The papadams and samosa are pretty good. ", "The tandoori chicken is delicious. ", "Tender and full of flavor. "], "author": "Bekki J.", "review": "Pretty good Indian food, especially for the price. They have a very cheap $8 buffet! Great naan, curries are pretty standard. Masalas, vindaloos, paneers. The papadams and samosa are pretty good. The tandoori chicken is delicious. Tender and full of flavor. I like the rice pudding dessert, and the fried dough dipped in sweet sauce.\n\nI like to order for delivery too, for when I don't leave the house. They deliver within the hour, and is still reasonably priced, especially if you get one of their two set meals. (Vegetarian and non-vegetarian.)\n\nService is pretty good. They like to refill our water a lot. :P \n\nTheir walls have painted pictures of boobular Indian women! You can't beat that!", "rating": 4, "date": "2007-03-19"}, {"excerpts": ["I tried some papadams, some veggie pakora and samosa, and some others which I dont quite remember. ", "The price was $9.99, plus tax is $10.94. ", "This is a quiet little restuarant and whenever I want to have some indian food, this may be the place for me."], "author": "Jen M.", "review": "I wanted to try some indian food and this one seemed okay, from reviews and from a distance. I came here one day and saw the place half full. I was greeted by a waiter asking me do I want the buffet or will I be ordering. I said the buffet. I went up the steps and saw only a few selections. I liked the chicken curry and the naan bread. I tried some papadams, some veggie pakora and samosa, and some others which I dont quite remember. The price was $9.99, plus tax is $10.94. This is a quiet little restuarant and whenever I want to have some indian food, this may be the place for me.", "rating": 3, "date": "2010-09-03"}], "assorted tandoori hors doeuvres for two": [], "meat samosa": [{"excerpts": ["We tried Indian all over the city, trying to find a meat samosa and keema naan that we liked as much as Star India's.  "], "author": "Lindsay G.", "review": "After my last review, my husband and I went months without ordering from Star India.  We tried Indian all over the city, trying to find a meat samosa and keema naan that we liked as much as Star India's.  Finally, on my husband's birthday, I decided to order it again and pick it up versus having them deliver - just to see if that helped.\n\nMy friends, Star India is BACK!  It was like seeing an old friend.  We devoured our meal and have since ordered (delivery) from them a few times.  (We clearly eat a lot of Indian food)  I am so glad I gave them another shot and it really feels as though they have upgraded their quality and delivery time.  We are psyched!", "rating": 4, "date": "2013-10-23"}], "tandoori chicken wings": [], "dal soup": [{"excerpts": ["The buffet includes yummy dal soup, pakoras and papadams to start, freshly made naan, rice, and plenty of delicious main dishes to choose from. ", "It even includes chai tea, although I have never tried that. ", "They rotate out bean dishes, too: sometimes chana masala, sometimes rajma, sometimes dal; I've even had black-eyed peas, and as a transplanted Southerner I can tell you I appreciated that. "], "author": "Charity V.", "review": "I absolutely love this place. I work very close and go here at least once a week, often more. The buffet is a great deal. Sure it's not as cheap as Taco Bell but the food is outstanding. I literally just got back from eating there and I seriously want to go back for more. \n\nThe buffet includes yummy dal soup, pakoras and papadams to start, freshly made naan, rice, and plenty of delicious main dishes to choose from. It even includes chai tea, although I have never tried that. Oh, and salad, just in case you come to an Indian buffet for salad (weird-o).\n\nI'm mostly a vegetarian, so I always eat the veggie options and despite the fact that I come in so frequently, I never tire of the food. They always have saag paneer and veggie (sometimes with paneer) korma. They have different veggie dishes, usually one with potatoes and one or more without. They rotate out bean dishes, too: sometimes chana masala, sometimes rajma, sometimes dal; I've even had black-eyed peas, and as a transplanted Southerner I can tell you I appreciated that. Although my mom wouldn't recognize the ones I ate here. :-) \n\nAlso, the people here are amazing. I LOVE them. They are all, without exception, nice and warm and wonderful. They work so hard, even though almost everyone there is usually taking advantage of the delicious buffet. They refill my water faithfully and bring naan quickly (remember, it's prepared fresh for each customer so it doesn't come right away, but it's way better than having to rely on dried out naan from under a heat lamp). They greet everyone who comes in and strive to provide good service and food to each of their customers. \n\nI will be honest, sometimes a main dish might not be as good as it usually is. Sometimes the soup isn't as spicy as I like it. Sometimes they run out of something. But seriously. It's a buffet, you guys. These things happen. Overall the food is always satisfying and the dining experience is always positive and every single time I leave I'm glad I went to eat there.\n\nYou must try it! And please tell them you liked my review. They have been joking that I need to write one for months.\n\n(I originally wrote this review in 2013 but just had to consolidate duplicate yelp accounts)", "rating": 5, "date": "2017-05-19"}, {"excerpts": ["She didn't know the difference between dal soup and a dal dish. ", "Maybe she should ask if she doesn't have experience in ordering Indian food. ", "Any of the staff would be delighted to help her. ", "Plus who orders a 3 dollar dish at a sit down restaurant? ", "I even watched them try to amend the situation and offer her another dish and dal soup to go as well.\n \n", "I guess you cannot always please everyone, especially those who are delighted to bitch about everything in life. ", "I even watched them try to amend the situation and offer her another dish and dal soup to go as well.\n \n", "I guess you cannot always please everyone, especially those who are delighted to bitch about everything in life. ", "She even was rude on the way out and left the food that they had wrapped (and gave free dal soup with) to go. \n\n", "She even was rude on the way out and left the food that they had wrapped (and gave free dal soup with) to go. \n\n"], "author": "Zoeboe D.", "review": "First i'd like to say that Judy G below is an old biddy. I was in the restaurant when that whole thing went down. She didn't know the difference between dal soup and a dal dish. Maybe she should ask if she doesn't have experience in ordering Indian food. Any of the staff would be delighted to help her. Plus who orders a 3 dollar dish at a sit down restaurant? This is not a cafe.\n\n I frequent this place quite a bit and feel as if everyone is always extremely polite. I even watched them try to amend the situation and offer her another dish and dal soup to go as well.\n \nI guess you cannot always please everyone, especially those who are delighted to bitch about everything in life. She even was rude on the way out and left the food that they had wrapped (and gave free dal soup with) to go. \n\nPeople like this irritate me. In fact after she left, I even asked what that \"rude bitches\" problem was. They tried so hard to accommodate, but I guess she just didn't want to helped. \n\nSo for you Judy G, I'd like to say, I really hope you don't frequent any other of my favorites restaurants with your cheap ass. I realize some people are on fixed incomes, but even if that is the case, it still gives you no right to act like such an ass.", "rating": 5, "date": "2013-05-17"}, {"excerpts": ["I choose the Dal soup $(3) and lamb vandaloo ($11) w basmati rice ($3) http://www.yelp.com/biz_photos/WKBAkKgeqJ9aCoexvpNUeA?select=394oLPu38b7MMRAsncPG8g. ", "The Dal soup was quite tasty but a little to brothy. ", "The Dal soup was quite tasty but a little to brothy. ", "I prefer Dal soups that are a purée of lentil sans broth. \n\n"], "author": "Quentin J.", "review": "Utilized the Living Social's takeout/delivery promo deal to order in Star India. I choose the Dal soup $(3) and lamb vandaloo ($11) w basmati rice ($3) http://www.yelp.com/biz_photos/WKBAkKgeqJ9aCoexvpNUeA?select=394oLPu38b7MMRAsncPG8g. The vandaloo's sauce was pretty good with healthy portion of potatoes and lamb, but I found lamb a little tough at a $12 price point. \n\nThe Dal soup was quite tasty but a little to brothy. I prefer Dal soups that are a purée of lentil sans broth. \n\nAll in all not bad. Will probably try again if I don't find a better priced competitor.", "rating": 3, "date": "2012-04-20"}, {"excerpts": ["To give credit where due: the dal soup was very tasty, but sadly too spicy for my not-spicy-loving-palate.  ", "But if you can handle a little heat, then the dal soup is yummy.\n\n", "But if you can handle a little heat, then the dal soup is yummy.\n\n"], "author": "Tarah D.", "review": "We had the buffet here, so I can't speak to their a la carte items, but we chose the buffet because it had a number of vegetarian items I normally really love.  I agree with a previous reviewer that some of the food tasted really, really bland.  I was reaching for salt, pepper, anything I could find to add a little flavor-- not good.  The palak paneer was particularly disappointing.  The veggie korma was also bland- though better than the palak paneer.  There was a lentil/read-bean \"chef vegetarian special\" dish that was unidentified, but more promising than the others.  Also what seemed to be simply sauteed broccoli.  Not bad, but not good.  The chai was almost undrinkable, which is too bad, and the gulab jamun tasted really stale.  I mean, still sweat and cake-y, so, you know, I ate it, but still.  Sad monkey.  Naan served to our table was okay- but nothing to write home about.\n\nTo give credit where due: the dal soup was very tasty, but sadly too spicy for my not-spicy-loving-palate.  But if you can handle a little heat, then the dal soup is yummy.\n\nAlso, the main hostess was incredibly nice, and the waiter we had was also very nice.  The prices were not bad, but not cheap enough that you thought: \"oh well, mediocre food... it's not all that bad\"\n\nMaybe we hit a bad night?  Maybe we tempted fate by doing buffet instead of a la carte?  Whatever it was, with all the other Indian options, we'll probably try our luck somewhere else.", "rating": 2, "date": "2011-10-01"}, {"excerpts": ["The Dal Soup was very enjoyable, as were the little fried dessert balls covered in syrup.  ", "And, a little rice pudding always seems to hit the spot.  "], "author": "Kyle J.", "review": "For $9.50 (including tax) Star India let me feast on as much decent Indian food as I could fit in my ever expanding waist line.  I am by no means an expert on Indian food, so I won't pretend here to know the names of all the dishes or where they fall on the culinary spectrum.  \n\nThe Dal Soup was very enjoyable, as were the little fried dessert balls covered in syrup.  And, a little rice pudding always seems to hit the spot.  Most everything I had was enjoyable.\n\nOne of the dishes tasted a bit like dirt to me.  It was a pleasant trip back to my childhood with fond memories of exploring the back yard, but wasn't exactly what I was desiring for dinner.  Given it is a buffet I just skipped that option the second time around (and, I'll admit, third time) and focused on the other, in my opinion very good, dishes.\n\nAll you can eat for under ten bucks with a lot of solid options.  If you're in the mood for some serious eating and crave Indian check this place out.", "rating": 3, "date": "2008-01-13"}], "mulligawtani soup": [], "mix salad": [{"excerpts": ["Mix salad.  ", "With.  ", "Different.  ", "Dressings.  ", "And cmg main meal.  ", "Like.  ", "Plenty of dishes. ", "Including.  "], "author": "Attipatla A.", "review": "Me and.  My friend Narad went dinner.  Food.    Was.  Superb.    And.  Service is.  Amazing.       Had.   A perfect.   Meal.  At the same time a group of 50\n People r there.  Eventhough.  We got a table we had aptizers veg pakora chicken pakora. Papadams.   And.   Mix salad.  With.  Different.  Dressings.  And cmg main meal.  Like.  Plenty of dishes. Including.  Chicken tandoori.   Dessert gulabjamun.  And Kher", "rating": 5, "date": "2016-05-31"}], "desi salad": [], "onion kulcha": [{"excerpts": ["Onion Kulcha: great consistency and flavor.\n\n"], "author": "Gage S.", "review": "\"I'll be back\"\n\nCoconut Chicken Curry: Nice Large, tender chicken chunks, great flavor, sauce made perfect dipping sauce for the Naan. \n\nOnion Kulcha: great consistency and flavor.\n\nRice Pilou: typical Indian rice, but I did notice the sweetness of the raisins much more than I've noticed them in the past, tasted great. \n\nCherry Naan: never thought to try this before but I will be ordering this every time going forward. Loved the subtle flavor of cherry even though I would've assumed the Bright red, thick cherry spread would have been too much cherry, but it was perfectly executed.\n\nSaag Chana: my friend actually really liked it, I thought the flavor was a bit bland. \n\nFast delivery, hot when it arrives. Delivery bag packed perfect, no leaks/spills, which I've had many times in the past from other places.", "rating": 4, "date": "2018-10-14"}, {"excerpts": ["The onion kulcha naan was good, though it was a little doughy for naan ", "(I'll try the garlic naan next time). "], "author": "Nami S.", "review": "Although I live only a few blocks away, I tried Star India for the first time tonight with my boyfriend. It wasn't very crowded though it was busier than I had expected for the Inner Richmond. I think most people get/got the dinner buffet ($10, great deal) but we opted for a la carte. \n\nThe samosas were tasty, the chicken tikka masala was quite flavorful. The spicy vegetable jalfraze was good but not very spicy at all (would forego if you're looking for spice). However, it was a solid vegetarian dish with good flavors. The onion kulcha naan was good, though it was a little doughy for naan (I'll try the garlic naan next time). Next time, I'd also like to try the tandoori chicken with yogurt marinade (yum!).\n\nWe ended the meal with delicious kheer - very mild and soothing rice pudding - and Kulfi ice cream. The ice cream was awesome - like eating cold chewy ice cream that tasted like a million diff subtle flavors. \n\nService was great - really attentive. The waiters were nice and friendly and always kept our glasses full of water.", "rating": 4, "date": "2012-08-28"}], "chappati": [], "chili cheese naan": [{"excerpts": ["Chili cheese naan was amazing and delicious, as always, but kind of a waste without anything else delicious to eat with it.\n\n"], "author": "Colleen M.", "review": "Note to self: NEVER ORDER FROM HERE AGAIN. The chicken tikka masala and malai kofta were basically water with some coloring. Absolutely no flavor and the chicken in the tikka masala was incredibly dry. Samosas were undercooked and a little doughy still, but were edible. Chili cheese naan was amazing and delicious, as always, but kind of a waste without anything else delicious to eat with it.\n\nWe've ordered from here a bunch of times and it's usually really good, but this is just ridiculous. They obviously took too many orders before close and their solution was to water everything down rather than reach out to customers to say they didn't have enough. Completely unacceptable.", "rating": 1, "date": "2017-07-02"}, {"excerpts": ["This is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\n", "On occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\n"], "author": "thrasher b.", "review": "I've had very consistent delivery from Star India, which is why I'm giving it 4 stars!\n\nThis is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\nAll this is about $30, but it's enough for two meals for two people.\n\nOn occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\nIt usually arrives really hot, but that could be because I'm closer to the restaurant than others.\n\nDoubt I'll go to the buffet, because that could change things. For now, the delivery is where it's at!", "rating": 4, "date": "2009-10-08"}, {"excerpts": ["*Chili Cheese Naan \n", "*", "*Coconut Shrimp \n", "*", "*", "*Delivery in less than 25 minutes, every time \n", "*", "***Chicken Tika Masala \n", "*", "****"], "author": "Megan L.", "review": "In no particular order, the stariest stars for Star India go to: \n\n*Chili Cheese Naan \n**Coconut Shrimp \n***Delivery in less than 25 minutes, every time \n****Chicken Tika Masala \n*****Lamb Korma \n\nNot the cheapest in town, but the best Indian food available for delivery. Yummy!", "rating": 5, "date": "2009-04-10"}, {"excerpts": ["I always order the same thing \"Saag Paneer\" and Chili Cheese Naan. ", "Creamy, Spicy ,Goodness....", "ah I can taste it now.  "], "author": "Infodiva B.", "review": "I have been eating at Star India for years. They are listed as one of my last meals. I always order the same thing \"Saag Paneer\" and Chili Cheese Naan. Creamy, Spicy ,Goodness....ah I can taste it now.  Wash it down with a Mango Lassi or a Taj Mahal and you are set.\n\nMy only negatives about this place....  parking can suck. Their hours during the weekdays are limited. I want lunch on a Wednesday Afternoon.\n\nThey do not deliver West of Twin Peaks. I hate schlepping over to Geary for food. It is worth it though.", "rating": 4, "date": "2007-10-23"}], "poori": [{"excerpts": ["The poori still isn't great, but maybe eating that onsite is better. ", "Perhaps their regular naan is better for delivery.\n", "The samosas taste great and the outside of them is not covered in weird extra spices this time. ", "extra star for my second order. ", "much better than I thought yesterday!"], "author": "Alexandra R.", "review": "10/19/12 UPDATE: after my harsh previous review, the manager called me and has offered to resend my order in an attempt to get me to improve my review. This has already improved my review by one star. I love good customer service. Very nice Miss Manager! :)\n\nThe food is much better if you get it after a bad review! I'm actually taking a break from eating it to write this part!. The poori still isn't great, but maybe eating that onsite is better. Perhaps their regular naan is better for delivery.\nThe samosas taste great and the outside of them is not covered in weird extra spices this time. extra star for my second order. much better than I thought yesterday!", "rating": 3, "date": "2012-10-21"}, {"excerpts": ["So we got the buffet and then ordered some cheese naan, poori, and samosas off the menu, all of which were pretty damn good.\n\n"], "author": "Josh U.", "review": "Great overall experience...\n\nWe showed up around 8pm hoping to use the $20 living social deal that I'd purchased a few months back.  They had their dinner buffet going, but unfortunately the voucher specifically stated that it wasn't good for the buffet... though once we saw how tasty the buffet looked & smelled, we decided to go for it anyways, as it was only $10 a person and the voucher was still good for anything ordered off the menu.  So we got the buffet and then ordered some cheese naan, poori, and samosas off the menu, all of which were pretty damn good.\n\nThe buffet items were all really good as well... the tikki masala flavorful, the palak paneer amazing, the tandoori chicken nice & tender...  My only complaint is that they had some fried veggies out that looked like they'd been sitting out under the heat lamp for a while, and biting into one confirmed that that was indeed the case.  But everything else was good.\n\nI got some of the raita for dessert, which was tasty, though I have had better.  The gulab jamun was also somewhat mediocre and a bit lacking in flavor, at least compared to how I've had it at other places.\n\nAll in all though, this place rocks.  It's not the best Indian food you'll ever eat, but for $10 you're getting more than your money's worth.  Taking the food and price into account, it's a solid 4-star.  However, at the end of the meal, we hadn't yet ordered a full $20 from the menu so I asked the waiter if we could order something to-go, despite it saying \"no takeout\" on the voucher...  After running it by the manager, he was more than happy to make an exception!  This definitely earns them an extra star, because I know a lot of restaurants can be real dicks about the stipulations on their groupons & living social deals.  So hats off to Star India for good service!", "rating": 5, "date": "2012-01-17"}], "allu prantha": [], "prantha": [], "cheese naan": [{"excerpts": ["Chili cheese naan was amazing and delicious, as always, but kind of a waste without anything else delicious to eat with it.\n\n"], "author": "Colleen M.", "review": "Note to self: NEVER ORDER FROM HERE AGAIN. The chicken tikka masala and malai kofta were basically water with some coloring. Absolutely no flavor and the chicken in the tikka masala was incredibly dry. Samosas were undercooked and a little doughy still, but were edible. Chili cheese naan was amazing and delicious, as always, but kind of a waste without anything else delicious to eat with it.\n\nWe've ordered from here a bunch of times and it's usually really good, but this is just ridiculous. They obviously took too many orders before close and their solution was to water everything down rather than reach out to customers to say they didn't have enough. Completely unacceptable.", "rating": 1, "date": "2017-07-02"}, {"excerpts": ["I also ordered an amazing chile and cheese naan which is super spicy and savory. ", "SO GOOD.  "], "author": "Kimiko Q.", "review": "Stilll glowing from my meal a couple nights ago. Got home early extremely exhausted. I work in a warehouse where the temp climbs to 110 degrees or more. And when they need help on the floor I am there!  So after an exhausting work day of manual labor (I'm usually in front of a computer) I was absolutely refusing to cook for dinner.\n\nFound Star India on Eat 24 for delivery. Of all the Indian restaurants that deliver to my house, this is the only one that offered a sweet two-person meal deal. We got the cheaper option, vegetarian, and it came with large portions of Chana masala, saag paneer, a HUGE bag of veggie pakora, and a cup of raita, naan, and two types of chutney.  I also asked to upgrade to garlic naan and offered to pay the difference but they did it on the house (I think lol, haven't checked my bank statement yet). I also ordered an amazing chile and cheese naan which is super spicy and savory. SO GOOD.  It was a great deal that, with tip and free delivery, came to around $27.\n\nMy boyfriend and I only managed to eat half the food and this is my third day eating leftovers.  Cant complain, Indian food is my fav.  Is it the best Indian I've ever had?  No.  But is it pretty damn good and satisfying after an exhausting day?  Absolutely!  Driver came on time, food was hot, and I went to bed full and happy.  Next time I'll definitely tip more.. it was so much better than I expected.  Keep it cool, Star India!", "rating": 5, "date": "2017-06-22"}, {"excerpts": ["We usually get the chicken tika masala, palak paneer, and garlic cheese naan. ", "I literally crave it multiple times per week. ", "They are also halal which was wonderful for when my fiancée's parents were in town. ", "You must try!"], "author": "Molly S.", "review": "My fiancé and I live around the corner from this gem! He was born in India and has lived in the city for 14 years and says it's the best Indian food he has had in the city. The staff is so warm and courteous. This place is amazing! We usually get the chicken tika masala, palak paneer, and garlic cheese naan. I literally crave it multiple times per week. They are also halal which was wonderful for when my fiancée's parents were in town. You must try!", "rating": 5, "date": "2016-07-12"}, {"excerpts": ["We ordered chicken tikka masala, saag paneer, garlic naan, cheese naan, and samosas. ", "Food was average and very oily. ", "Definitely not worth the wait or having had my neighbors bothered. ", "Very disappointed with them!"], "author": "Ana C.", "review": "Order food food online. Estimated time was 45-60 min wait. After waiting for 75 min, I decided to call on the status of my order. Was told food was on its way. After waiting for an additional 15 min, we finally received our food. I specifically asked not to have the doorbell rang, but call since I have an in-law apartment and did not want to bother my neighbors (we have multiple doorbells). Delivery guy ends up ringing ALL of the doorbells disturbing my neighbors. Very upsetting. \n\nWe ordered chicken tikka masala, saag paneer, garlic naan, cheese naan, and samosas. Food was average and very oily. Definitely not worth the wait or having had my neighbors bothered. Very disappointed with them!", "rating": 2, "date": "2015-03-14"}, {"excerpts": ["This is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\n", "On occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\n"], "author": "thrasher b.", "review": "I've had very consistent delivery from Star India, which is why I'm giving it 4 stars!\n\nThis is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\nAll this is about $30, but it's enough for two meals for two people.\n\nOn occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\nIt usually arrives really hot, but that could be because I'm closer to the restaurant than others.\n\nDoubt I'll go to the buffet, because that could change things. For now, the delivery is where it's at!", "rating": 4, "date": "2009-10-08"}, {"excerpts": ["*Chili Cheese Naan \n", "*", "*Coconut Shrimp \n", "*", "*", "*Delivery in less than 25 minutes, every time \n", "*", "***Chicken Tika Masala \n", "*", "****"], "author": "Megan L.", "review": "In no particular order, the stariest stars for Star India go to: \n\n*Chili Cheese Naan \n**Coconut Shrimp \n***Delivery in less than 25 minutes, every time \n****Chicken Tika Masala \n*****Lamb Korma \n\nNot the cheapest in town, but the best Indian food available for delivery. Yummy!", "rating": 5, "date": "2009-04-10"}, {"excerpts": ["So we got the buffet and then ordered some cheese naan, poori, and samosas off the menu, all of which were pretty damn good.\n\n"], "author": "Josh U.", "review": "Great overall experience...\n\nWe showed up around 8pm hoping to use the $20 living social deal that I'd purchased a few months back.  They had their dinner buffet going, but unfortunately the voucher specifically stated that it wasn't good for the buffet... though once we saw how tasty the buffet looked & smelled, we decided to go for it anyways, as it was only $10 a person and the voucher was still good for anything ordered off the menu.  So we got the buffet and then ordered some cheese naan, poori, and samosas off the menu, all of which were pretty damn good.\n\nThe buffet items were all really good as well... the tikki masala flavorful, the palak paneer amazing, the tandoori chicken nice & tender...  My only complaint is that they had some fried veggies out that looked like they'd been sitting out under the heat lamp for a while, and biting into one confirmed that that was indeed the case.  But everything else was good.\n\nI got some of the raita for dessert, which was tasty, though I have had better.  The gulab jamun was also somewhat mediocre and a bit lacking in flavor, at least compared to how I've had it at other places.\n\nAll in all though, this place rocks.  It's not the best Indian food you'll ever eat, but for $10 you're getting more than your money's worth.  Taking the food and price into account, it's a solid 4-star.  However, at the end of the meal, we hadn't yet ordered a full $20 from the menu so I asked the waiter if we could order something to-go, despite it saying \"no takeout\" on the voucher...  After running it by the manager, he was more than happy to make an exception!  This definitely earns them an extra star, because I know a lot of restaurants can be real dicks about the stipulations on their groupons & living social deals.  So hats off to Star India for good service!", "rating": 5, "date": "2012-01-17"}, {"excerpts": ["I always order the same thing \"Saag Paneer\" and Chili Cheese Naan. ", "Creamy, Spicy ,Goodness....", "ah I can taste it now.  "], "author": "Infodiva B.", "review": "I have been eating at Star India for years. They are listed as one of my last meals. I always order the same thing \"Saag Paneer\" and Chili Cheese Naan. Creamy, Spicy ,Goodness....ah I can taste it now.  Wash it down with a Mango Lassi or a Taj Mahal and you are set.\n\nMy only negatives about this place....  parking can suck. Their hours during the weekdays are limited. I want lunch on a Wednesday Afternoon.\n\nThey do not deliver West of Twin Peaks. I hate schlepping over to Geary for food. It is worth it though.", "rating": 4, "date": "2007-10-23"}], "a bhutra whole wheat deep fried": [], "channa sag": [], "chili chicken": [{"excerpts": ["3) I've had Chili Chicken, Chicken Madrasi, and Chicken Vindaloo so far. ", "They're all quite tolerable, but I think the problem is that the chicken is a little too dry. ", "And because I'm a sucker for tender meat, this is somewhat disappointing. "], "author": "Jenn L.", "review": "Okay, so I've had delivery from Star India 3 times now and feel like I have a more accurate feel of how this review should go down.\n\n1) This is for delivery only. Why? Because their minimum is only $12, and the food is usually all for me after work when I don't feel like cooking (which is more often than not). Also, if you order through beyondmenu.com, you can get free veggie samosas which are sometimes a little too salty for me, but mostly A-OK.\n\n2) I always order garlic naan, although halfway through I wonder why because it just vaguely tastes like garlic and yet has this crazy yellow coloring on it that sometimes stains my fingers. Also it isn't that soft, but that's probably because it's being delivered. I've never been one to enjoy the tamarind and mint sauce that comes with naan, so I'll skip over that part.\n\n3) I've had Chili Chicken, Chicken Madrasi, and Chicken Vindaloo so far. They're all quite tolerable, but I think the problem is that the chicken is a little too dry. And because I'm a sucker for tender meat, this is somewhat disappointing. I have to say my least favorite dish was the Chicken Vindaloo because the sauce was very pasty.\n\n4) When you ask for spicy, you SERIOUSLY get spicy. I have a VERY high spice tolerance, to the point where waiters warn me when I order my food, so there's my credibility. On all three occasions, I've specified my food to be spicy, and on all three occasions, when I'm halfway through my meal, I find myself not being able to think straight temporarily because the food is so spicy. So you've been warned. I'm still recovering.\n\nSo all in all, A-OK, and convenient for delivery, but nothing that blows me out of the water.", "rating": 3, "date": "2012-07-15"}, {"excerpts": ["The Chili Chicken House Special tasted great and spicy enough but the Tandoori chicken was a disappointment. \n\n"], "author": "arleen r.", "review": "The Chili Chicken House Special tasted great and spicy enough but the Tandoori chicken was a disappointment. \n\nI also wasn't crazy about the fact that it took almost an hour to get my food delivered. Oh well guess next time I won't order during lunch time.\n\nI would try the other Indian place before I would reorder at this place.", "rating": 3, "date": "2009-10-02"}, {"excerpts": ["I dig their Aloo Gobi (the cauliflower is never over-cooked, the potatos are perfect and the spices are just right), and their Chili Chicken is very yummy. ", "I try to love the Naan, but truth be told, through no fault of their own, "], "author": "Suepattra M.", "review": "If I want Indian food and don't want to leave the house, then Star India is the place to call. I dig their Aloo Gobi (the cauliflower is never over-cooked, the potatos are perfect and the spices are just right), and their Chili Chicken is very yummy. I try to love the Naan, but truth be told, through no fault of their own, it's just kind of soggy by the time it gets to my place, so I recommend that you stick with the saffron rice. Other than that, decent Indian delivery for a decent price.", "rating": 3, "date": "2006-09-19"}], "chicken tandoori": [{"excerpts": ["The food is very reasonably priced (example: a hearty portion of all white meat chicken tandoori will only run you about $12.95 and it comes with some peppers and onions as well). ", "Their Aloo Gobi is delicious, as is their naan. ", "They don't deliver all over SF, so you have to venture away from downtown or closer to their shop, but it's worth seeking out. ", "Would happily cater company meals from them if they ever opened that option. ", "The food is great quality and they are very pleasant to interact with on a frequent basis. ", "Try out their Indian pizzas, they have a variety for all dietary restrictions from carnivores to vegetarians and even vegans. ", "Delicious twist on Indian flavor, definitely check those pies out."], "author": "Alison A.", "review": "Star India is hands down one of my favorite Indian and small business in SF. They are really on top of their business, always answer the phone, and deliver on time. The food is very reasonably priced (example: a hearty portion of all white meat chicken tandoori will only run you about $12.95 and it comes with some peppers and onions as well). Their Aloo Gobi is delicious, as is their naan. They don't deliver all over SF, so you have to venture away from downtown or closer to their shop, but it's worth seeking out. Would happily cater company meals from them if they ever opened that option. The food is great quality and they are very pleasant to interact with on a frequent basis. Try out their Indian pizzas, they have a variety for all dietary restrictions from carnivores to vegetarians and even vegans. Delicious twist on Indian flavor, definitely check those pies out.", "rating": 5, "date": "2018-11-09"}, {"excerpts": ["Chicken tandoori is my favorite Indian dish but here one day it was mushy and so old ", "I could not believe they had it out to serve. ", "Almost ruined my favorite dish for me honestly. "], "author": "Beaky L.", "review": "I work in the area and I love Indian food. I usually do the buffet so it's all I can speak on. I agree with other reviews it seems they're pinching pennies by reheating old food at the buffet cause some dishes are just bad.\n\nChicken tandoori is my favorite Indian dish but here one day it was mushy and so old I could not believe they had it out to serve. Almost ruined my favorite dish for me honestly. Their naan is excellent and the spinach saag and chicken tikka are tasty.\n\nAlas, the kicker was the roach I saw under the sugar for the tea earlier this week. My stomach turned and I just can't go back now. Ughh.", "rating": 2, "date": "2018-07-19"}, {"excerpts": ["I always go for the buffet they have lamb curry, chicken tandoori, byryani rice, naan and some vegan options. ", "The customer service is great too. ", "I like to order al la carte as well you can choose your spice level. ", "My favorite is the Began Baratha ", "it's a vegan dish just delicious! ", "Ooh yah the mango lassi is heaven sooo good!"], "author": "Nina M.", "review": "This place is bomb.com. Great prices and the food is delicious. I always go for the buffet they have lamb curry, chicken tandoori, byryani rice, naan and some vegan options. The customer service is great too. I like to order al la carte as well you can choose your spice level. My favorite is the Began Baratha it's a vegan dish just delicious! Ooh yah the mango lassi is heaven sooo good!", "rating": 5, "date": "2018-08-26"}, {"excerpts": ["Chicken tikka masala: chicken tandoori with herbs and tomato sauce ($10.95)\nGood flavor. ", "The sauce actually got better the next day since it tasted spicier. ", "The chicken was good. ", "I wish the pieces were smaller since it was a little hard to eat with the huge chunks of chicken. ", "The first day, the chicken was good. ", "Slightly dry, but nothing the curry couldn't mask. ", "The next day with reheating, the chicken was so dry! ", "Really hard to eat. "], "author": "Elena N.", "review": "I've ordered delivery from here a couple of times over the years. This past Friday, I was craving Indian food and decided to give Star India another shot. Since I was by myself, I knew I would only want a curry, naan, samosa and maybe a side of rice. This was one of the only places that has a $20 minimum versus a $25+ min. I ordered via Eat24 since I had a $2 off weekend promo code.\n\nSamosa vegetable ($3.50)\nThe shell was nicely fried, flaky with a little chew. I enjoyed this with the mint dipping sauce.\n\nGarlic naan: garlic leavened bread ($2.25)\nFor me, this could have used a little more garlic, but the naan had a nice chew.\n\nChicken tikka masala: chicken tandoori with herbs and tomato sauce ($10.95)\nGood flavor. The sauce actually got better the next day since it tasted spicier. The chicken was good. I wish the pieces were smaller since it was a little hard to eat with the huge chunks of chicken. The first day, the chicken was good. Slightly dry, but nothing the curry couldn't mask. The next day with reheating, the chicken was so dry! Really hard to eat. No amount of sauce could cover up the dryness. \n\nPilau rice: basmati rice with peas, tomatoes and spices ($3.50)\nThis has raisins and nuts. I wish they put that in the description since I literally when through the whole container and picked out all the raisins and nuts. The rice itself was good and had a nice flavor.\n\nNot sure if I'll order from them again as everything was just okay. But I do like that they have a $20 min. Makes it easy when I'm dining solo!", "rating": 3, "date": "2014-10-12"}, {"excerpts": ["All dishes are tasty except the chicken tandoori which is a little on the dry side. ", "But hey, that's chicken especially chicken breast. \n", "Servers are always very friendly."], "author": "Tommy K.", "review": "Been here multiple times for buffet. And the buffet bar is always filled with fresh warm food rather than just curry sauce.  All dishes are tasty except the chicken tandoori which is a little on the dry side. But hey, that's chicken especially chicken breast. \nServers are always very friendly.", "rating": 5, "date": "2016-06-15"}, {"excerpts": ["Chicken tandoori.   ", "Dessert gulabjamun.  ", "And Kher"], "author": "Attipatla A.", "review": "Me and.  My friend Narad went dinner.  Food.    Was.  Superb.    And.  Service is.  Amazing.       Had.   A perfect.   Meal.  At the same time a group of 50\n People r there.  Eventhough.  We got a table we had aptizers veg pakora chicken pakora. Papadams.   And.   Mix salad.  With.  Different.  Dressings.  And cmg main meal.  Like.  Plenty of dishes. Including.  Chicken tandoori.   Dessert gulabjamun.  And Kher", "rating": 5, "date": "2016-05-31"}, {"excerpts": ["We started with the Chicken Tandoori which had a great combination of spices and yogurt sauce. ", "Also very good was the Biryani!"], "author": "Noah F.", "review": "Amazing indian buffet! We started with the Chicken Tandoori which had a great combination of spices and yogurt sauce. Also very good was the Biryani!", "rating": 5, "date": "2017-11-15"}, {"excerpts": ["we ordered a yellow dahl, raita, jasmine rice, chicken tandoori, vegetable samosas, saag aloo, naan bread, papadum and a mango lassi. ", "My absolute favorites were the veggie samosa and mango lassi. ", "They hit the spot! ", "I also really enjoyed the chicken tandoori, saag aloo and papadum. ", "The raita was a little bit runny but still good. ", "My mom felt the Dahl was too watery and spicy ", "and she wasn't able to eat it.  ", "Sue was patient, sweet and helpful! ", "She had it remade so we could take it to go. ", "The prices are really affordable and they also have a dinner buffet if you are looking for an all you can eat for a set price. ", "The only downside was we had a tough time finding parking which is common in the city. ", "We almost gave up but finally found a stall. ", "The staff even offered to help us find parking. ", "Can't beat that kind of service. ", "Thank you for a great time and a tasty meal!"], "author": "B B.", "review": "Finally getting around to writing this review! My mom and I have been coming here for years. It's our go to spot when we are in San Francisco. The staff is always friendly and accommodating. we ordered a yellow dahl, raita, jasmine rice, chicken tandoori, vegetable samosas, saag aloo, naan bread, papadum and a mango lassi. My absolute favorites were the veggie samosa and mango lassi. They hit the spot! I also really enjoyed the chicken tandoori, saag aloo and papadum. The raita was a little bit runny but still good. My mom felt the Dahl was too watery and spicy and she wasn't able to eat it.  Sue was patient, sweet and helpful! She had it remade so we could take it to go. The prices are really affordable and they also have a dinner buffet if you are looking for an all you can eat for a set price. The only downside was we had a tough time finding parking which is common in the city. We almost gave up but finally found a stall. The staff even offered to help us find parking. Can't beat that kind of service. Thank you for a great time and a tasty meal!", "rating": 5, "date": "2016-02-19"}, {"excerpts": ["The chicken tandoori wasn't very flavorful and was dry. ", "The chicken marsala was tasty. ", "Some of the food were lukewarm on the buffet table. ", "Naan bread was served at the table hot-- choice of plain or garlic-- delicious. ", "Lunch and dinner buffet for $10.99-- can't complain about the price"], "author": "Pat D.", "review": "Had dinner buffet with family today.  DH wanted to try Indian cuisine before we go to India next month. I enjoyed the tender lamb curry and ground lamb/peas. The chicken tandoori wasn't very flavorful and was dry. The chicken marsala was tasty. Some of the food were lukewarm on the buffet table. Naan bread was served at the table hot-- choice of plain or garlic-- delicious. Lunch and dinner buffet for $10.99-- can't complain about the price", "rating": 3, "date": "2017-02-17"}, {"excerpts": ["ordered chicken tandoori and garlic tikka Kabab that was awesome!! ", "And we had limb vindaloo, saag paneer.\n", "Everything was perfect! ", "Thanks guys you guys are awesome!! ", "Will come back fast... service was on the spot:::)"], "author": "Jyoti W.", "review": "This place is great let me start I went yesterday evening and they were busy still they handle my order on the table we were five people and our order was big .we ordered chicken tandoori and garlic tikka Kabab that was awesome!! And we had limb vindaloo, saag paneer.\nEverything was perfect! Thanks guys you guys are awesome!! Will come back fast... service was on the spot:::)", "rating": 5, "date": "2015-11-29"}, {"excerpts": ["There was also chicken tandoori.  "], "author": "Bodhi D.", "review": "My overall rating for this place is 3.5 stars.\n\nAfter walking by another Indian place in J-town with the initial \"D\" that was charging $15 for a plate of Chana masala chickpea curry (that's a la carte with NO rice), I decided to opt for my plan B which was to hop on the Geary and go to the Avenues where Star India is.\n\nI wouldn't call this place a destination restaurant like Indian joints I've frequented in Berkeley and the T-loin, but it is a reliable mom-and-pop Indian neighborhood restaurant.\n\nAs other YELPers have noted, it appears there's been a management change -- they do seem friendlier.  I didn't have an overcharge problem though because I only went for the 9.99 dinner buffet.\n\nI do like the lentil dahl soup they offer -- the thickness is just right and it is on the slightly spicy side.  I prefer it here to other places which serve a literally watered down version.\n\nThe curries offered at Star India were equally divided along vegetarian and meat choices.  It also seems they vary according to the season which makes sense.  The last nite I went, they had cabbage curry, chef's curry (peas and potato), a 2nd chef's curry (vegetarian kidney beans), spinach saag with indian cheese, vegetarian korma curry, chicken masala curry, lamb curry and lamb keema (ground lamb) curry.  There was also chicken tandoori.  If I'd gone during the summer, I'm sure the veggie curries would have been slightly different.\n\nThey don't use a lot of cream and yogurt in the curries offered in the buffet, which I do appreciate (exceptions being chicken tikka masala and any kind of korma curry which require dairy, but even those aren't too heavy).\n\nI'm not a big fan of pakora fritters in general, but at least they were in chickpea batter so I could still enjoy them (I eat GF). Another gluten-free item I loaded up on was the papadum lentil crackers with cilantro yogurt chutney - YUM!  I couldn't eat the naan b/c of my wheat allergies, but I did notice that everyone who got the buffet meal were treated to freshly baked naan to order. The basmati rice was well-prepared and not mushy like some other places.  I'm trying to keep my carbs down so being able to control the amount of rice via buffet is helpful.\n\nAll in all, a good deal for 9.99 when considering my other options for the evening. I'll definitely be coming back again for another cheap, hole-in-the wall, but home-style buffet meal.", "rating": 4, "date": "2011-11-10"}, {"excerpts": ["Their selection is decent with your typical Chicken Tandoori, samosa, Curry, masala, naan, etc.  "], "author": "Jannie Q.", "review": "My husband LOVES Indian food and this is his favorite place.  I guess you just can't beat a place that offers you all-you-can-eat buffet for $7.97.  It's puzzling how they can make ends meet with charging only $7.97 for dinner... illegal dealings? hmm...\n\nAnyhow, taste of the food is not bad either.  Their selection is decent with your typical Chicken Tandoori, samosa, Curry, masala, naan, etc.  Waiter always fill up your water.  \n\nIf you never had Indian food before and want to try a little bit of everything, and especially don't want to pay an arm and a leg, THIS IS DEFINITELY THE PLACE TO GO.     \n\nI only give this place 3 stars because unlike my husband, I don't like Indian food -- in general.  So I'm biased.", "rating": 3, "date": "2007-04-13"}, {"excerpts": ["This is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\n", "On occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\n"], "author": "thrasher b.", "review": "I've had very consistent delivery from Star India, which is why I'm giving it 4 stars!\n\nThis is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\nAll this is about $30, but it's enough for two meals for two people.\n\nOn occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\nIt usually arrives really hot, but that could be because I'm closer to the restaurant than others.\n\nDoubt I'll go to the buffet, because that could change things. For now, the delivery is where it's at!", "rating": 4, "date": "2009-10-08"}, {"excerpts": ["but after it ran out they slowly put out pieces.. the same with their chicken tandoori and everything else. ", "The food is pretty good though. ", "But replenishing the buffet  was so slow that I actually walked out of a buffet wanting to get more food. "], "author": "Dan T.", "review": "My name is Dfens..and I have a serious naan addiction.  I can't get enough Naan in my system to satisfy my craving. Right now I'm getting the shakes because I haven't had a garlic naan in the last hour.. argh! \n\nSo obviously what better place to get my naan fix than an Indian buffet. Seriously this place is cheap. Damn cheap for what it is. $8 for all you can eat food, well at least in theory. Too bad that this is the smallest buffet you'll ever see. When I say small I mean I could have eaten everything on the buffet table myself.  Yes I had my 4 heaping plates of naan but after it ran out they slowly put out pieces.. the same with their chicken tandoori and everything else. The food is pretty good though. But replenishing the buffet  was so slow that I actually walked out of a buffet wanting to get more food. So then I went to Genki Crepes..but that's a whole other addiction I don't want to stop right now. \n\nI've also been here around 830pm and though the buffet is still open there's not much food left and they will not replenish it. It's a bummer because it's cheap and good but I can't ever seem to get enough in my belly. \n\nI read through the other reviews and no one ever mentioned about the slow buffet service so maybe it is my fat belly and naan addiction that's holding me back. I'm not sure. but it's definitely decent food for a low price so if you need to get some Indian food for cheap stop by. Just don't take my naan.. or else I might freak out and get the shakes aggaaaaiiinnn...", "rating": 3, "date": "2007-02-25"}, {"excerpts": ["I didn't really like the chicken tandoori because there were only 3 pieces to choose from at the buffet table and they were looking dry.  "], "author": "Sam T.", "review": "I was working at the Presidio Branch Library this past summer. \nFor dinner, my coworkers recommended Star India. For $8, you get an all you can eat meal. The restaurant is quite small and the buffet selection is limited. I did enjoy the curry chicken while I was there. I didn't really like the chicken tandoori because there were only 3 pieces to choose from at the buffet table and they were looking dry.  The service there was pretty attentive which was good.\n\nI recommend Star India if you have a few hours to dine. Its a nice place to go for a Saturday or Sunday afternoon food binge. I say take it slow, order a beer and take frequent trips to the buffet table.  And be sure to get the chicken curry over basmati rice.", "rating": 4, "date": "2007-10-17"}, {"excerpts": ["HOWEVER, their Chicken Tandoori pizza rocks - both dine-in and delivery. ", "Best Tandoori pizza around."], "author": "Erica G.", "review": "I have been dining at and getting delivery from Star India for 10 years. They were by far my favorite Indian place in the city, but for some reason the quality of delivery food has gone way down. The buffet is still good, but my last two deliveries were simply awful.  The Chicken Tikka Masala was not spicy at all...it was abnormally sweet like they used a lot of sugar.  I will give delivery one more chance before I find a new place. HOWEVER, their Chicken Tandoori pizza rocks - both dine-in and delivery. Best Tandoori pizza around.", "rating": 3, "date": "2009-03-23"}], "a chicken tikka kabob all breast": [], "lamb boti kabob": [], "ground seekh kabob": [{"excerpts": ["Ground Seekh Kabob. ", "$11.50. ", "Plentiful segmented rolls of ground lamb, with onions, bell pepper slices. ", "As with the Samosa version of the ground lamb, tasty. ", "And plentiful. ", "I'll order this again.\n", "5) ", "Basmati rice, ", "$2@. Fine.\n", "6) ", "Mango Lassi. "], "author": "Andy P.", "review": "1) Meat (ground lamb) Samosa (2) $4. Puff pastries w/bit of cucumber salad, and four sauces. Tasty. I'll do it again.\n2) Kabuli Nan, supposedly w/cherries. $3. Except for some red stains on the interior which didn't noticably affect the taste, not obviously different than plan nan ($2).\n3) Lamb Vindaloo (\"very hot lamb curry...with potatoes in tangy sauce\"). $12. Didn't tang much, for my taste, lots of tomatoey sauce. Didn't seem to be all that much lamb in the tureen, and when I got a piece after a couple big hunks of potato the connective tissue resisted disassembly, so I left it for my partner. Will skip this one in the future.\n4) Ground Seekh Kabob. $11.50. Plentiful segmented rolls of ground lamb, with onions, bell pepper slices. As with the Samosa version of the ground lamb, tasty. And plentiful. I'll order this again.\n5) Basmati rice, $2@. Fine.\n6) Mango Lassi. $2.50@. Fine.\n\n$42.67 with tax, but before tip or discount. The doorhanger menu gives you $5 off the second entree, but I took home plenty of food despite my companion complaining about how much she'd eaten (and I'm not a light eater) so I could have done without a second entree, so that's less useful than the $12/$20 Groupon Now I actually used. Which in turn wouldn't have been as good as the $10(or less)/$25(of $35) (etc - three other options) available on restaurant dot com. And I noticed a BOGO$10 off on BigTip. And another review mentions LivingSocial... None of these (except some specials for takeout on the doorhanger) can be used for buffet or takeout, but it appears you can eat here cheap without limiting yourself to the buffet.", "rating": 3, "date": "2012-09-24"}], "fish tandoori": [], "mixed platter": [{"excerpts": ["Naan is amazing, as is the mixed platter. ", "Super friendly wait staff."], "author": "Lara B.", "review": "Great food, we changed our mind last minute and grabbed our food to go and they were super accommodating... Naan is amazing, as is the mixed platter. Super friendly wait staff.", "rating": 5, "date": "2014-05-03"}], "b rack of lamb": [], "c tandoori lamb chops": [], "allu bengan": [], "mixed vegetable": [{"excerpts": ["I ordered the Mixed Vegetable Jalfrezi and Shrimp Coconut ", "and I did not like either one. ", "I asked for them to make both dishes medium spicy. ", "None were spicy at all and they were very bland. ", "Indeed, they were bland to the point that I was bored out of my mind eating and gave more attention to my glass of wine. ", "I can make better Indian food despite the fact that I do not know how to cook Indian food. ", "The shrimp was overcooked and I think the worst part about the meal was that you have to separately order rice. ", "That's really cheap for a restaurant to do. ", "Positive: people were good and the rice was okay. ", "Overall lots of better options in SF, definitely will not be coming back here."], "author": "Denisse R.", "review": "Worst food ever! I ordered the Mixed Vegetable Jalfrezi and Shrimp Coconut and I did not like either one. I asked for them to make both dishes medium spicy. None were spicy at all and they were very bland. Indeed, they were bland to the point that I was bored out of my mind eating and gave more attention to my glass of wine. I can make better Indian food despite the fact that I do not know how to cook Indian food. The shrimp was overcooked and I think the worst part about the meal was that you have to separately order rice. That's really cheap for a restaurant to do. Positive: people were good and the rice was okay. Overall lots of better options in SF, definitely will not be coming back here.", "rating": 2, "date": "2015-06-19"}], "mushrooms mattar": [], "allu gobi": [{"excerpts": ["I ordered mushroom matter , allu gobi medium spice and garlic naan. ", "I started with mushroom matter. ", "It was so crazy spicy! ", "The allu gobi was red in color, I am used to it being more yellowish, it was also  very spicy . ", "The mushroom matter was so spicy it was inedible, I had to wash both dishes in water just to eat them as vegetables. ", "It was still spicy ", "but I could eat it. ", "The garlic naan was not flavorful nor could I taste any garlic. \n"], "author": "Robin W.", "review": "Just ordered delivery from Star India, my experience was not good. \nI ordered mushroom matter , allu gobi medium spice and garlic naan. I started with mushroom matter. It was so crazy spicy! The allu gobi was red in color, I am used to it being more yellowish, it was also  very spicy . The mushroom matter was so spicy it was inedible, I had to wash both dishes in water just to eat them as vegetables. It was still spicy but I could eat it. The garlic naan was not flavorful nor could I taste any garlic. \nIndian food is one of my favorite cuisines and this was probably the worst Indian food I have ever had. \n\nAlso the delivery driver smirked and grunted like when I handed him his cash plus  with a tip. That was very strange.", "rating": 1, "date": "2013-02-04"}], "bengan bhartha": [{"excerpts": ["The Bengan Bhartha was OK, but each time I ate this food (split over 3 meals), I would be so thirsty afterwards, which makes me think there is lots of MSG in it."], "author": "MT Y.", "review": "I stopped in to order some food to take to my friend's. It's really a hassle to unpack the bag to inspect the food, but I should have because they gave me the wrong food! When I discovered this when we opened the bag at home, it was not worth the trouble to go back even though what they gave me cost less than what I paid for. That aside, what I am guessing was Chicken Tikka Masala was mediocre. The Bengan Bhartha was OK, but each time I ate this food (split over 3 meals), I would be so thirsty afterwards, which makes me think there is lots of MSG in it.", "rating": 2, "date": "2015-08-09"}, {"excerpts": ["I ordered the Dal, the Bengan Bhartha, Chicken Vindaloo, and the Garlic Naan.  ", "The only complaint I had was that when ordering online I was not prompted if I wanted to get rice with my dishes as well, and when they called to tell me that my food would be there in 45 minutes, again was not asked about rice.  ", "I totally forgot about it because usually at other Indian Restaurants it either comes with it or my server will ask if I want rice.  ", "So don't forget to order the rice while ordering online."], "author": "Rose Z.", "review": "I finally found a good Indian restaurant in San Francisco!!  And they have delivery as well, with a minimum purchase of $12.  I was amazed as to how good and how much food I got for $30.  I ordered the Dal, the Bengan Bhartha, Chicken Vindaloo, and the Garlic Naan.  The only complaint I had was that when ordering online I was not prompted if I wanted to get rice with my dishes as well, and when they called to tell me that my food would be there in 45 minutes, again was not asked about rice.  I totally forgot about it because usually at other Indian Restaurants it either comes with it or my server will ask if I want rice.  So don't forget to order the rice while ordering online.", "rating": 5, "date": "2012-02-20"}, {"excerpts": ["Bengan Bhartha: A+++\nChicken Tikka Masala: A++++\n", "Chicken Saagwala: A++++\n", "Chicken Biryani: A++++\n", "Coconut Chicken: ", "A+++++\n", "Naan: A++++\n", "Basmati Rice: "], "author": "Chris M.", "review": "If I could give 3.5 stars, I would.\n\nThe food is the bomb.\n\nBengan Bhartha: A+++\nChicken Tikka Masala: A++++\nChicken Saagwala: A++++\nChicken Biryani: A++++\nCoconut Chicken: A+++++\nNaan: A++++\nBasmati Rice: A++++\n\nBut the best part? The veggie pakora. I get this delivered with every order as they give you a ginormous portion and tons of delicious Raita with it. It's crispy, textured, and delicious. The potato slices are my favorite. I really do dig this place a lot.\n\nThe reason I wouldn't rate it higher is the fact that it IS pricey. Sure, the portions feed about 2 people if you ladle it over rice, but considering the delivery takes 45 minutes to an hour, I would expect naan to be less than $2 for one or the rice to be cheaper or something along those lines.\n\nGreat place, though!", "rating": 4, "date": "2009-07-03"}], "sag paneer": [{"excerpts": ["Their Sag Paneer is my roommate's new favorite guilty pleasure, and my new go-to entree is the Prawn Korma. ", "The Chicken Korma is awesome, too, and the initial reason I got turned on to the Prawn Korma.\n\n"], "author": "Laura C.", "review": "I just want to reiterate how much I love Star India. I order so often here that my friends think I'm crazy. My roommates even tricked me into trying a new Indian spot, and my boyfriend made me venture to another Indian restaurant when his mom came into town because he wanted to try something new. \n\nWhen we ordered elsewhere the portions were smaller and pricier. And they definitely didn't have my beloved Star India taste!\n\nI just... can't leave Star India. Maybe I'm a creature of habit. Maybe I like my comfort zone. But honestly, I think I just like knowing that when I order something I'll be consistently happy with it. Even my friend who graduated from USF years ago says she misses this place and is sad they won't deliver to her neighborhood. I mean, hey, I started yelping because I wanted to share how great this restaurant is! \n\nI still can't speak to their buffet - but I order their take-out consistently. Since my last review, I've stopped being vegetarian and have tried new dishes. Their Sag Paneer is my roommate's new favorite guilty pleasure, and my new go-to entree is the Prawn Korma. The Chicken Korma is awesome, too, and the initial reason I got turned on to the Prawn Korma.\n\nIt's seriously the best comfort food in the Inner Richmond. \n\nThe staff are continually sweet, too! The other day I ordered online, and online the wait was listed as 40-60 minutes. I was hungry and grumbled a bit but knew it was worth it. Ten minutes later there was a knock on my door and the manager was standing there with my food because she recognized my name and order! I was so shocked I forgot to tip her (sorry!!). Please go and please make friends with the staff because they are great people and take care of their customers!\n\nAnyways, conclusion: GREAT SERVICE. Consistent food. Comforting. Addicting. Reasonably priced. After a year I'm still in love with Star India.", "rating": 5, "date": "2015-02-23"}, {"excerpts": ["I got Naan, Chicken Tikka Masala Palak Pakora and Sag Paneer for $30. ", "The Palak Pakora is really good and I would recommend it because the amount they give you can serve as a few meals or many snacks. "], "author": "Sam D.", "review": "I got this delivered and it was very economical. I got Naan, Chicken Tikka Masala Palak Pakora and Sag Paneer for $30. The Palak Pakora is really good and I would recommend it because the amount they give you can serve as a few meals or many snacks. Chicken Tikka Masala could have used a little more spice, but not much.\n\nI was only upset because the delivery took almost an hour and a half, which was 20 minutes over the expected delivery time. I'll forgive them, though, because there was some pretty heavy traffic that day.", "rating": 4, "date": "2013-12-31"}, {"excerpts": ["Sag Paneer was like tastless watery green soup with a few dried cheese chunks. ", "The Chicken Korma was too watery too and the chicken dry and over cooked. ", "The Seekh Kabob was  over cooked until dry and had little taste. ", "The Tandoori Prawns were not prawns but shrimps and were not Tandoori but yellow Curry Shrimps. "], "author": "Steven B.", "review": "Worst Indian food I have ever had!\nSag Paneer was like tastless watery green soup with a few dried cheese chunks. The Chicken Korma was too watery too and the chicken dry and over cooked. The Seekh Kabob was  over cooked until dry and had little taste. The Tandoori Prawns were not prawns but shrimps and were not Tandoori but yellow Curry Shrimps. The Nan was tough, so tough you could hardly tear it apart and chewing it hurt your jaws.\n\nOh and did mention that it is expensive? They don't even give you Rice or Nan with your entree.", "rating": 1, "date": "2010-10-22"}, {"excerpts": ["I ordered the Vegetarian Dinner for 2, which includes Vegetable pakora, nan, sag paneer, channa masala, raita, rice.  ", "Here goes:\nVegetable pakora - Fritters coated in garbanzo: onion, cauliflower, potato, spinach.  ", "What I got was NO cauliflower, NO onion, a couple of spinach and WAY ", "TOO MANY potatoes. ", "It sure wasn't what I was used to getting from Star India.\n", "Sag Paneer was scorched.  ", "It had that horrible taste that it had burned and they served it anyway.\n", "Channa Marsala was not up to par\n"], "author": "Catania G.", "review": "WHAT HAPPENED?  HOW COULD YOUR FOOD GO FROM TOPS TO NEAR BOTTOM?\nI ordered from eat24 yesterday.  I ordered the Vegetarian Dinner for 2, which includes Vegetable pakora, nan, sag paneer, channa masala, raita, rice.  Here goes:\nVegetable pakora - Fritters coated in garbanzo: onion, cauliflower, potato, spinach.  What I got was NO cauliflower, NO onion, a couple of spinach and WAY TOO MANY potatoes. It sure wasn't what I was used to getting from Star India.\nSag Paneer was scorched.  It had that horrible taste that it had burned and they served it anyway.\nChanna Marsala was not up to par\nNan was about the only item that tasted as it should.\n\nWhat a shame that was once a pretty good Indian option has gone downhill.  I have been ordering from this restaurant for years. Remember the Val-Pak coupons?  I won't be ordering again as it just isn't worth it.  And, honestly, their heavy use of salt does nothing but bring out the worse in the taste.  Too Bad.  I would not recommend, no matter how good a deal you feel they are.", "rating": 1, "date": "2013-05-06"}, {"excerpts": ["The lamb (both curried on the bone and ground) and the sag paneer are both standouts on regular offer.\n\n"], "author": "r g.", "review": "Updated and up-rated. The quality of the buffet has been consistently high in recent months, though I'm still confused why they do not offer more (or often, any) bean/lentil dishes. \n\nThe lamb (both curried on the bone and ground) and the sag paneer are both standouts on regular offer.\n\nThe chai still sucks, however.\n\nPrice is also up to 10.99 for the buffet, but it's a solid value at the price.", "rating": 4, "date": "2014-02-20"}, {"excerpts": ["My favorites were the chicken tikka masala and the sag paneer. ", "The lamb curries we pretty spicy for my taste ", "but I did enjoy them. ", "Thumbs up for the naan. ", "I would like to go back."], "author": "LaShea R.", "review": "Not bad for my first experience with Indian food. The price for the buffet is $10.99. My favorites were the chicken tikka masala and the sag paneer. The lamb curries we pretty spicy for my taste but I did enjoy them. Thumbs up for the naan. I would like to go back.", "rating": 4, "date": "2013-03-09"}, {"excerpts": ["The Sag Paneer was horrible, it just tasted gross. ", "I could not even eat it. ", "The only thing that was good was the Naan. ", "It helped make the Chicken Tikka sort of palatable. ", "I'm angry because I spent a lot of money for this food and it tasted awful. ", "Really bad. ", "If you have not been to really good Indian restaurants you may not notice, but if you have a discerning tongue then just don't go here."], "author": "L.A. C.", "review": "I just went to Star India to get some take out for lunch. I was really disappointed with the food. I am very surprised that it has gotten good reviews because everything I tried was mediocre at best. I ordered the Chicken Tikka Masala, hoping it would live up to the boasts that this place had the best. I was very let down, it tasted like it had come out of a can or been made from a powder. The Sag Paneer was horrible, it just tasted gross. I could not even eat it. The only thing that was good was the Naan. It helped make the Chicken Tikka sort of palatable. I'm angry because I spent a lot of money for this food and it tasted awful. Really bad. If you have not been to really good Indian restaurants you may not notice, but if you have a discerning tongue then just don't go here.", "rating": 1, "date": "2012-10-28"}, {"excerpts": ["This is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\n", "On occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\n"], "author": "thrasher b.", "review": "I've had very consistent delivery from Star India, which is why I'm giving it 4 stars!\n\nThis is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\nAll this is about $30, but it's enough for two meals for two people.\n\nOn occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\nIt usually arrives really hot, but that could be because I'm closer to the restaurant than others.\n\nDoubt I'll go to the buffet, because that could change things. For now, the delivery is where it's at!", "rating": 4, "date": "2009-10-08"}, {"excerpts": ["Tonight we ordered chicken tikka masala and sag paneer and both were lacking in flavor.  ", "The nan was fine and the samosa was good ", "but they didn't make up for the entrees.  ", "I guess we're still on the hunt for a good Indian place that delivers to Presidio Heights.  ", "We miss you Mehfil!  ", "(Sorry Star India)"], "author": "Denise G.", "review": "I rarely give two star reviews because, let's face it, I consider myself pretty qualified at picking out eateries.  Unfortunately tonight's experience warrants two stars, not because of the delivery service or the freshness but for the worst reason of all.  It tastes BLAH.  For us, Indian food is a treat.  We love it and are excited when we get the chance to eat it.  Tonight we ordered chicken tikka masala and sag paneer and both were lacking in flavor.  The nan was fine and the samosa was good but they didn't make up for the entrees.  I guess we're still on the hunt for a good Indian place that delivers to Presidio Heights.  We miss you Mehfil!  (Sorry Star India)", "rating": 2, "date": "2011-07-30"}, {"excerpts": ["The sag paneer is juuuuuuust shy of having a decent number of paneer cubes.  \n\n"], "author": "Ann M.", "review": "I have a delivery problem, and Star India is it.  \n\nBut I don't even know why I give them all my delivery love--the menu is juuuuust overpriced enough to leave me feeling cheap and used.  The tikka masala is juuuuuuuust greasy enough that I'm left groping for the pepto.  The sag paneer is juuuuuuust shy of having a decent number of paneer cubes.  \n\nBut when I see their menu rubber-banded to my doornob, I neeeeeeed the nan.  So, three stars for meeting the need, but more than that would be undeserved without a little extra ... something.", "rating": 3, "date": "2006-07-20"}, {"excerpts": ["Try the sag paneer ", "it's delicious."], "author": "Marie B.", "review": "Ok so I love this play a whole bunch and with a $7.95 all you can eat buffet it's well worth the trip all the way from my part of the city. However keep in mind that although it says they will deliver for free anywhere it's not always true. Apparently they've only got one driver at a time serving the whole city and if its busy  ha. Often times when I call and ask for delivery alhough they'll deliver they've attempted to charge me delivery fees or took forever to delive, I've waited up to 2.5 hrs.  Most other times they just plain old told me they woldn't do it.  So the free delivery to anywhere is a bit of a stretch but their food is so good I'm willing to take the trip to dine in or take out.  Try the sag paneer it's delicious.", "rating": 4, "date": "2007-03-26"}], "dal": [{"excerpts": ["The buffet includes yummy dal soup, pakoras and papadams to start, freshly made naan, rice, and plenty of delicious main dishes to choose from. ", "It even includes chai tea, although I have never tried that. ", "They rotate out bean dishes, too: sometimes chana masala, sometimes rajma, sometimes dal; I've even had black-eyed peas, and as a transplanted Southerner I can tell you I appreciated that. "], "author": "Charity V.", "review": "I absolutely love this place. I work very close and go here at least once a week, often more. The buffet is a great deal. Sure it's not as cheap as Taco Bell but the food is outstanding. I literally just got back from eating there and I seriously want to go back for more. \n\nThe buffet includes yummy dal soup, pakoras and papadams to start, freshly made naan, rice, and plenty of delicious main dishes to choose from. It even includes chai tea, although I have never tried that. Oh, and salad, just in case you come to an Indian buffet for salad (weird-o).\n\nI'm mostly a vegetarian, so I always eat the veggie options and despite the fact that I come in so frequently, I never tire of the food. They always have saag paneer and veggie (sometimes with paneer) korma. They have different veggie dishes, usually one with potatoes and one or more without. They rotate out bean dishes, too: sometimes chana masala, sometimes rajma, sometimes dal; I've even had black-eyed peas, and as a transplanted Southerner I can tell you I appreciated that. Although my mom wouldn't recognize the ones I ate here. :-) \n\nAlso, the people here are amazing. I LOVE them. They are all, without exception, nice and warm and wonderful. They work so hard, even though almost everyone there is usually taking advantage of the delicious buffet. They refill my water faithfully and bring naan quickly (remember, it's prepared fresh for each customer so it doesn't come right away, but it's way better than having to rely on dried out naan from under a heat lamp). They greet everyone who comes in and strive to provide good service and food to each of their customers. \n\nI will be honest, sometimes a main dish might not be as good as it usually is. Sometimes the soup isn't as spicy as I like it. Sometimes they run out of something. But seriously. It's a buffet, you guys. These things happen. Overall the food is always satisfying and the dining experience is always positive and every single time I leave I'm glad I went to eat there.\n\nYou must try it! And please tell them you liked my review. They have been joking that I need to write one for months.\n\n(I originally wrote this review in 2013 but just had to consolidate duplicate yelp accounts)", "rating": 5, "date": "2017-05-19"}, {"excerpts": ["She didn't know the difference between dal soup and a dal dish. ", "Maybe she should ask if she doesn't have experience in ordering Indian food. ", "Any of the staff would be delighted to help her. ", "Plus who orders a 3 dollar dish at a sit down restaurant? ", "I even watched them try to amend the situation and offer her another dish and dal soup to go as well.\n \n", "I guess you cannot always please everyone, especially those who are delighted to bitch about everything in life. ", "I even watched them try to amend the situation and offer her another dish and dal soup to go as well.\n \n", "I guess you cannot always please everyone, especially those who are delighted to bitch about everything in life. ", "She even was rude on the way out and left the food that they had wrapped (and gave free dal soup with) to go. \n\n", "She even was rude on the way out and left the food that they had wrapped (and gave free dal soup with) to go. \n\n"], "author": "Zoeboe D.", "review": "First i'd like to say that Judy G below is an old biddy. I was in the restaurant when that whole thing went down. She didn't know the difference between dal soup and a dal dish. Maybe she should ask if she doesn't have experience in ordering Indian food. Any of the staff would be delighted to help her. Plus who orders a 3 dollar dish at a sit down restaurant? This is not a cafe.\n\n I frequent this place quite a bit and feel as if everyone is always extremely polite. I even watched them try to amend the situation and offer her another dish and dal soup to go as well.\n \nI guess you cannot always please everyone, especially those who are delighted to bitch about everything in life. She even was rude on the way out and left the food that they had wrapped (and gave free dal soup with) to go. \n\nPeople like this irritate me. In fact after she left, I even asked what that \"rude bitches\" problem was. They tried so hard to accommodate, but I guess she just didn't want to helped. \n\nSo for you Judy G, I'd like to say, I really hope you don't frequent any other of my favorites restaurants with your cheap ass. I realize some people are on fixed incomes, but even if that is the case, it still gives you no right to act like such an ass.", "rating": 5, "date": "2013-05-17"}, {"excerpts": ["I choose the Dal soup $(3) and lamb vandaloo ($11) w basmati rice ($3) http://www.yelp.com/biz_photos/WKBAkKgeqJ9aCoexvpNUeA?select=394oLPu38b7MMRAsncPG8g. ", "The Dal soup was quite tasty but a little to brothy. ", "The Dal soup was quite tasty but a little to brothy. ", "I prefer Dal soups that are a purée of lentil sans broth. \n\n"], "author": "Quentin J.", "review": "Utilized the Living Social's takeout/delivery promo deal to order in Star India. I choose the Dal soup $(3) and lamb vandaloo ($11) w basmati rice ($3) http://www.yelp.com/biz_photos/WKBAkKgeqJ9aCoexvpNUeA?select=394oLPu38b7MMRAsncPG8g. The vandaloo's sauce was pretty good with healthy portion of potatoes and lamb, but I found lamb a little tough at a $12 price point. \n\nThe Dal soup was quite tasty but a little to brothy. I prefer Dal soups that are a purée of lentil sans broth. \n\nAll in all not bad. Will probably try again if I don't find a better priced competitor.", "rating": 3, "date": "2012-04-20"}, {"excerpts": ["To give credit where due: the dal soup was very tasty, but sadly too spicy for my not-spicy-loving-palate.  ", "But if you can handle a little heat, then the dal soup is yummy.\n\n", "But if you can handle a little heat, then the dal soup is yummy.\n\n"], "author": "Tarah D.", "review": "We had the buffet here, so I can't speak to their a la carte items, but we chose the buffet because it had a number of vegetarian items I normally really love.  I agree with a previous reviewer that some of the food tasted really, really bland.  I was reaching for salt, pepper, anything I could find to add a little flavor-- not good.  The palak paneer was particularly disappointing.  The veggie korma was also bland- though better than the palak paneer.  There was a lentil/read-bean \"chef vegetarian special\" dish that was unidentified, but more promising than the others.  Also what seemed to be simply sauteed broccoli.  Not bad, but not good.  The chai was almost undrinkable, which is too bad, and the gulab jamun tasted really stale.  I mean, still sweat and cake-y, so, you know, I ate it, but still.  Sad monkey.  Naan served to our table was okay- but nothing to write home about.\n\nTo give credit where due: the dal soup was very tasty, but sadly too spicy for my not-spicy-loving-palate.  But if you can handle a little heat, then the dal soup is yummy.\n\nAlso, the main hostess was incredibly nice, and the waiter we had was also very nice.  The prices were not bad, but not cheap enough that you thought: \"oh well, mediocre food... it's not all that bad\"\n\nMaybe we hit a bad night?  Maybe we tempted fate by doing buffet instead of a la carte?  Whatever it was, with all the other Indian options, we'll probably try our luck somewhere else.", "rating": 2, "date": "2011-10-01"}, {"excerpts": ["Make sure to go through salad, dal, main course, and desert.  "], "author": "Joseph M.", "review": "I like this place alot.  Their buffet is great and worth every penny.  Make sure to go through salad, dal, main course, and desert.  It's all there.\n\nI think the only thing they could do is make one different dish every week.  That will keep your creative juices flowing.  I have the impression that the dishes kind of stay the same here.\n\nI come here to experience so titillate me.  I want to try something unusual. You have mastered the classics.  Now, show me something new.  Indian food has so much potential.  It is like painting with 100 colors at hand.\n\nYou are great.  Keep innovating and experimenting.  \n\nJoseph", "rating": 4, "date": "2014-08-14"}, {"excerpts": ["I ordered Dal for $3 and I got Dal or $8 and it was awful and fire hot."], "author": "Judy G.", "review": "I did not havea good experience last nt at Star India. I ordered Dal for $3 and I got Dal or $8 and it was awful and fire hot.", "rating": 1, "date": "2013-05-10"}, {"excerpts": ["We then tried the vegetable jalfrazie and the dal with naans. ", "The vegetable jalfrazie was awful! ", "It was cold, the veggies were under cooked and insipid. ", "My guess is they were frozen and didnt get enough time on the pan. ", "The dal didn't come till half way through the meal ", "so I called our waitress ", "n let her know. ", "The dal arrived 10 minutes later( we were almost done) and had suffered a massive overdose of turmeric. ", "It wasn't palatable at all. ", "The waitress was as apathetic as can be and didn't bother checking how we had liked the food nor did she apologize for her snafu...", "Needless to say we won't be going back."], "author": "Natasha I.", "review": "Epic fail! So we ordered the onion bhajji/pakoda which turned out to be an incarnated onion ring. It's not your typical pakoda but I was pleasantly surprised by their creativity. Taste wise it was alright.. We then tried the vegetable jalfrazie and the dal with naans. The vegetable jalfrazie was awful! It was cold, the veggies were under cooked and insipid. My guess is they were frozen and didnt get enough time on the pan. The dal didn't come till half way through the meal so I called our waitress n let her know. The dal arrived 10 minutes later( we were almost done) and had suffered a massive overdose of turmeric. It wasn't palatable at all. The waitress was as apathetic as can be and didn't bother checking how we had liked the food nor did she apologize for her snafu...Needless to say we won't be going back.", "rating": 1, "date": "2012-02-14"}, {"excerpts": ["I ordered the Dal, the Bengan Bhartha, Chicken Vindaloo, and the Garlic Naan.  ", "The only complaint I had was that when ordering online I was not prompted if I wanted to get rice with my dishes as well, and when they called to tell me that my food would be there in 45 minutes, again was not asked about rice.  ", "I totally forgot about it because usually at other Indian Restaurants it either comes with it or my server will ask if I want rice.  ", "So don't forget to order the rice while ordering online."], "author": "Rose Z.", "review": "I finally found a good Indian restaurant in San Francisco!!  And they have delivery as well, with a minimum purchase of $12.  I was amazed as to how good and how much food I got for $30.  I ordered the Dal, the Bengan Bhartha, Chicken Vindaloo, and the Garlic Naan.  The only complaint I had was that when ordering online I was not prompted if I wanted to get rice with my dishes as well, and when they called to tell me that my food would be there in 45 minutes, again was not asked about rice.  I totally forgot about it because usually at other Indian Restaurants it either comes with it or my server will ask if I want rice.  So don't forget to order the rice while ordering online.", "rating": 5, "date": "2012-02-20"}, {"excerpts": ["the lamb samosas were good (not too many yucky peas) but I am still marveling over how that dal made my head feel better. ", "could there have been vodka in there ? "], "author": "Prima D.", "review": "I feel utterly shitty. goddamned boyfriend coughed and hacked in my face all night and now I have a fugging headcold. it's freakin Friday and I don't even feel like drinking. curses. so I ordered in for some spicy lentil soup and samosas and fried bread. I've been on an indian food kick, don't ask me why. I haven't eaten eggos in a week and the freezer is filled w/ boxes and boxes of varying flavors. anyhoo. I just had half of the soup and my nose is running like a mofu. at least now I can breathe and there's some damn heat in my bones. we keep this house cold enough to sustain an indoor skating rink, don't you know.\n\nthe lamb samosas were good (not too many yucky peas) but I am still marveling over how that dal made my head feel better. could there have been vodka in there ? if you are sicky and whiny and runny nosy, swallow some of this liquid elixir and sweat your illness away.\n\ndelivery took 40 mins which I think is excellent for a Friday eve. the poor guy was shaking, the 10-lb Prima Dachshund was barking at him like a scorned bitch. I tipped him $5 for his fear.", "rating": 4, "date": "2007-01-05"}, {"excerpts": ["The Dal Soup was very enjoyable, as were the little fried dessert balls covered in syrup.  ", "And, a little rice pudding always seems to hit the spot.  "], "author": "Kyle J.", "review": "For $9.50 (including tax) Star India let me feast on as much decent Indian food as I could fit in my ever expanding waist line.  I am by no means an expert on Indian food, so I won't pretend here to know the names of all the dishes or where they fall on the culinary spectrum.  \n\nThe Dal Soup was very enjoyable, as were the little fried dessert balls covered in syrup.  And, a little rice pudding always seems to hit the spot.  Most everything I had was enjoyable.\n\nOne of the dishes tasted a bit like dirt to me.  It was a pleasant trip back to my childhood with fond memories of exploring the back yard, but wasn't exactly what I was desiring for dinner.  Given it is a buffet I just skipped that option the second time around (and, I'll admit, third time) and focused on the other, in my opinion very good, dishes.\n\nAll you can eat for under ten bucks with a lot of solid options.  If you're in the mood for some serious eating and crave Indian check this place out.", "rating": 3, "date": "2008-01-13"}, {"excerpts": ["It is a $9.95 buffet with so many options including samosas, garlic naan, paneer, vindaloo, jaipur veggies, lamb, salad, dal, dessert and some super strong chai tea! ", "Everything is replenished often as most people who come here to eat seem to get the buffet (at least every time I've been in ", "that's how it has been). ", "The quality of the food is really great and everything tastes just so yummy."], "author": "Elly S.", "review": "I love Indian Food buffets and I goto extreme lengths to find good ones. Star India makes the top of my list for sure. It is a $9.95 buffet with so many options including samosas, garlic naan, paneer, vindaloo, jaipur veggies, lamb, salad, dal, dessert and some super strong chai tea! Everything is replenished often as most people who come here to eat seem to get the buffet (at least every time I've been in that's how it has been). The quality of the food is really great and everything tastes just so yummy.", "rating": 5, "date": "2009-02-23"}, {"excerpts": ["i love their Dal!! ", "the other food is good as well. ", "the only reason they get 4 instead of 5 stars is that the food can be a little heavy. ", "i think they use ghee, which is common among Indian restaurants, but isn't to my taste. ", "i like to eat a meal and not feel like a sloth afterwards."], "author": "Daniel N.", "review": "it's Indian so they obviously have plenty of vegetarian options. i tend to order from them late-nite on the weekends and they get to my place very fast. i love their Dal!! the other food is good as well. the only reason they get 4 instead of 5 stars is that the food can be a little heavy. i think they use ghee, which is common among Indian restaurants, but isn't to my taste. i like to eat a meal and not feel like a sloth afterwards.", "rating": 4, "date": "2008-04-29"}], "spicy vegetable jalfraze": [{"excerpts": ["The spicy vegetable jalfraze was good but not very spicy at all (would forego if you're looking for spice). ", "However, it was a solid vegetarian dish with good flavors. "], "author": "Nami S.", "review": "Although I live only a few blocks away, I tried Star India for the first time tonight with my boyfriend. It wasn't very crowded though it was busier than I had expected for the Inner Richmond. I think most people get/got the dinner buffet ($10, great deal) but we opted for a la carte. \n\nThe samosas were tasty, the chicken tikka masala was quite flavorful. The spicy vegetable jalfraze was good but not very spicy at all (would forego if you're looking for spice). However, it was a solid vegetarian dish with good flavors. The onion kulcha naan was good, though it was a little doughy for naan (I'll try the garlic naan next time). Next time, I'd also like to try the tandoori chicken with yogurt marinade (yum!).\n\nWe ended the meal with delicious kheer - very mild and soothing rice pudding - and Kulfi ice cream. The ice cream was awesome - like eating cold chewy ice cream that tasted like a million diff subtle flavors. \n\nService was great - really attentive. The waiters were nice and friendly and always kept our glasses full of water.", "rating": 4, "date": "2012-08-28"}, {"excerpts": ["I made the biggest mistake by going to this restaurant and ordering Spicy Vegetable Jalfraze ", "(It does not look like the image they show in their menu). "], "author": "Neha B.", "review": "Worst dish I have ever hadin my entire life!\n\nI made the biggest mistake by going to this restaurant and ordering Spicy Vegetable Jalfraze (It does not look like the image they show in their menu). My dish was watery, full of red color that I could taste more than anything else and bland. \n\nI will highly recommend not going to this restaurant.", "rating": 1, "date": "2011-10-06"}], "allu mattar": [], "saag allu": [{"excerpts": ["We ordered the chicken tiki masala and the saag allu. ", "My most favorite part was the garlic naan."], "author": "Brian Z.", "review": "The service was fast and friendly. The wait for the food to come out was less than 6 minutes. I've eaten many curries at many different places and I can confidently say that their food is not salty. We ordered the chicken tiki masala and the saag allu. My most favorite part was the garlic naan.", "rating": 4, "date": "2018-03-29"}, {"excerpts": ["I also added chicken tikki masala, and an order of  saag allu (spinach with potatoes).\n\n"], "author": "Vicky M.", "review": "After I got my \"Star India\" flyer, I decided to give their delivery a try.  \n\nI ordered the non-vegetarian dinner for 2 which included vegetable samosas, raita, lamb korma, tandoori chicken, garlic nan, and rice.  I also added chicken tikki masala, and an order of  saag allu (spinach with potatoes).\n\nThe cost wasn't bad (they take off $5 if you order the dinner for 2), and the food was fine, but not great.  I thought the samosa was a bit on the salty side.  The rest of the dishes were rather generic, nothing strikingly spectacular about them.\n\nWhen hungry and looking for a affordable delivery, this could be the way to go.  The delivery was within the time stated, and the delivery person was friendly.\n\nFor really yummy Indian food, check out Great India Restaurant, a little further west on Geary.", "rating": 3, "date": "2008-03-17"}], "vege coconut curry": [], "a yellow dal": [], "lamb curry": [{"excerpts": ["Awesome garlic naan, creamy eggplant, mouth-watering lamb curry. ", "All at a fantastic price."], "author": "William W.", "review": "Awesome garlic naan, creamy eggplant, mouth-watering lamb curry. All at a fantastic price.", "rating": 5, "date": "2018-10-16"}, {"excerpts": ["I always go for the buffet they have lamb curry, chicken tandoori, byryani rice, naan and some vegan options. ", "The customer service is great too. ", "I like to order al la carte as well you can choose your spice level. ", "My favorite is the Began Baratha ", "it's a vegan dish just delicious! ", "Ooh yah the mango lassi is heaven sooo good!"], "author": "Nina M.", "review": "This place is bomb.com. Great prices and the food is delicious. I always go for the buffet they have lamb curry, chicken tandoori, byryani rice, naan and some vegan options. The customer service is great too. I like to order al la carte as well you can choose your spice level. My favorite is the Began Baratha it's a vegan dish just delicious! Ooh yah the mango lassi is heaven sooo good!", "rating": 5, "date": "2018-08-26"}, {"excerpts": ["Nothing but bits of bone in the lamb curry no meat. ", "Can't expect much from a buffet tho. ", "May consider giving their menu a shot in the near future. ", "I wouldn't return for the buffet option."], "author": "amy y.", "review": "Came for the dinner buffet and stayed for about 90 minutes. Would have given 3 stars for average bland Indian food but the Tandoori chicken at the buffet was never replenished and we did not receive a basket of naan. minus 1 star. Breading on vegetable pakora was thick. Nothing but bits of bone in the lamb curry no meat. Can't expect much from a buffet tho. May consider giving their menu a shot in the near future. I wouldn't return for the buffet option.", "rating": 2, "date": "2017-08-11"}, {"excerpts": ["my favorite   one was lamb Curry and sag panner and not to miss there fresh naan on the table.also we had there taj mahal beer ....", "I will be coming back . ", "Great service .."], "author": "Dominic F.", "review": "Me and my wife came on Sunday evening for dinner ...I was amazed that they have great selection of currys in there buffet ..my favorite   one was lamb Curry and sag panner and not to miss there fresh naan on the table.also we had there taj mahal beer ....I will be coming back . Great service ..", "rating": 5, "date": "2017-11-30"}, {"excerpts": ["We tried lamb curry,samosha,tandoori chicken, and chicken tikka masala. ", "Which were very good taste.we all ", "love ", "the food.staff are so nice and polite.i wii ", "be back this restaurant for my next visit to San Francisco......", "yemmy"], "author": "Prem P.", "review": "We went San Francisco last week for our holiday trip.we went star India for lunch. We tried lamb curry,samosha,tandoori chicken, and chicken tikka masala. Which were very good taste.we all love the food.staff are so nice and polite.i wii be back this restaurant for my next visit to San Francisco......yemmy", "rating": 5, "date": "2017-11-04"}, {"excerpts": ["Yesterday I had lamb curry. ", "It was delicious. ", "Friendly staff & atmosphere was amazing."], "author": "Babu S.", "review": "Yesterday I had lamb curry. It was delicious. Friendly staff & atmosphere was amazing.", "rating": 5, "date": "2017-04-21"}, {"excerpts": ["Ground lamb curry with peas- DANK\nHoney donut balls in syrup- needed cinnamon but still AMAZING, \nRice pudding- CREAMY and great end to my meal\n\n"], "author": "Sherry C.", "review": "I got 2 words for this place: TANTRIC FIRE\n\nMy bae and I stumbled in around 3:30 pm on a random Monday because we were in the mood for some Indian buffet destruction. We left in a state of naan nirvana. \n\nFirst of all, is it a coincidence that Star India is located 1 block away from the Indian Consulate? I THINK NOT!\n\nSecond, have you seen their wall decor featuring murals of underboobed Indian babes. Very seksi!!\n\nBuffet lineup: \n\nChicken Pakora- basically like Indian chicken nuggets, FIRE\nVeggie Pakora- WOW fried veggies, YUM!\nChicken Tikka Masala- FIRE x 100000; I had a lot of this\nGoat Curry- not for me but tried a chunk and it was pretty dope\nPalak Paneer- spinachy cheesy goodness\nGround lamb curry with peas- DANK\nHoney donut balls in syrup- needed cinnamon but still AMAZING, \nRice pudding- CREAMY and great end to my meal\n\nThere were also a ton of sauces, lentil soup, a bunch of other curries, tandoori chicken, fresh naan and FREE CHAI!\n\nFor just $10.99, Star India is a star in my eye. 10/10 would return again!!!!", "rating": 4, "date": "2016-01-04"}, {"excerpts": ["We been back several times and was a preferred place when visiting SF however they must have a new cook because the lamb curry was so bad we just didn't eat it. ", "The rice had a terrible smell like it was stale. ", "We didn't enjoy the food as we had in the past visits. ", "Sorry we won't be coming back."], "author": "R B.", "review": "We been back several times and was a preferred place when visiting SF however they must have a new cook because the lamb curry was so bad we just didn't eat it. The rice had a terrible smell like it was stale. We didn't enjoy the food as we had in the past visits. Sorry we won't be coming back.", "rating": 1, "date": "2016-09-08"}, {"excerpts": ["Samosas were tasty, biryani was okay and the meat in the lamb curry was a bit tough. ", "Kabulli naan was okay. ", "Service was very good. ", "Know that if you want to use a Groupon here it is not good for the buffet items or a few of their special items like Thali. ", "Atmosphere was quiet and pleasant."], "author": "Debra M.", "review": "Samosas were tasty, biryani was okay and the meat in the lamb curry was a bit tough. Kabulli naan was okay. Service was very good. Know that if you want to use a Groupon here it is not good for the buffet items or a few of their special items like Thali. Atmosphere was quiet and pleasant.", "rating": 3, "date": "2016-04-08"}, {"excerpts": ["I enjoyed the tender lamb curry and ground lamb/peas. "], "author": "Pat D.", "review": "Had dinner buffet with family today.  DH wanted to try Indian cuisine before we go to India next month. I enjoyed the tender lamb curry and ground lamb/peas. The chicken tandoori wasn't very flavorful and was dry. The chicken marsala was tasty. Some of the food were lukewarm on the buffet table. Naan bread was served at the table hot-- choice of plain or garlic-- delicious. Lunch and dinner buffet for $10.99-- can't complain about the price", "rating": 3, "date": "2017-02-17"}, {"excerpts": ["The lamb curry was rich and delectable. ", "And even if you're not a vegetarian you have to try the vegetarian curry; it is light and slightly sweet. ", "I really appreciate that every entree has a unique flavor. "], "author": "Clarice W.", "review": "At a time when buffets are either scarce, trashy, or low-quality, Star India remains a rock solid reminder that you can have good service, a pleasant atmosphere, and truly delicious food in all-you-can-eat quantities at an affordable price.\n\nI'll just cut to the chase: the food is excellent. The naan is served to order (included in the buffet) which means you get freshly baked naan with your meal...mm! They offer at least 8 different dishes, salad, parathas, kheer, gulab jamun, lentil soup, and chai. When I crave chicken tikka masala I crave the one they serve here - it's creamy, not overly tomato-ey, and spiced well. The lamb curry was rich and delectable. And even if you're not a vegetarian you have to try the vegetarian curry; it is light and slightly sweet. I really appreciate that every entree has a unique flavor. And if you love gulab juman like me...well you're in luck, because you can have all the sweet syrupy balls you want!\n\nThere's a sign on the buffet stand that reminds customers that you are free to eat all you would like but to please not take more than you can, and I think that sentiment is carried through the business. There's a respect here for the food and customers that so often gets ignored at restaurant buffets, so it comforts me to know places like Star India are around!", "rating": 5, "date": "2011-09-29"}, {"excerpts": ["I don't eat lamb, but my friend said the lamb curry was really tender and yummy."], "author": "Michele S.", "review": "$9.99 for the dinner buffet, what a deal!  I like the Chicken Tikka Masala here better than at Curry Village, but the selection was much smaller.  The place was relatively empty so the tandori chicken and pakora seemed like it had been sitting out there for a bit (dry and lukewarm).\n\nAll the curries were really good and a little bit spicier than most Indian   buffets.  I don't eat lamb, but my friend said the lamb curry was really tender and yummy.", "rating": 4, "date": "2011-08-06"}, {"excerpts": ["a 2nd chef's curry (vegetarian kidney beans), spinach saag with indian cheese, vegetarian korma curry, chicken masala curry, lamb curry and lamb keema (ground lamb) curry.  "], "author": "Bodhi D.", "review": "My overall rating for this place is 3.5 stars.\n\nAfter walking by another Indian place in J-town with the initial \"D\" that was charging $15 for a plate of Chana masala chickpea curry (that's a la carte with NO rice), I decided to opt for my plan B which was to hop on the Geary and go to the Avenues where Star India is.\n\nI wouldn't call this place a destination restaurant like Indian joints I've frequented in Berkeley and the T-loin, but it is a reliable mom-and-pop Indian neighborhood restaurant.\n\nAs other YELPers have noted, it appears there's been a management change -- they do seem friendlier.  I didn't have an overcharge problem though because I only went for the 9.99 dinner buffet.\n\nI do like the lentil dahl soup they offer -- the thickness is just right and it is on the slightly spicy side.  I prefer it here to other places which serve a literally watered down version.\n\nThe curries offered at Star India were equally divided along vegetarian and meat choices.  It also seems they vary according to the season which makes sense.  The last nite I went, they had cabbage curry, chef's curry (peas and potato), a 2nd chef's curry (vegetarian kidney beans), spinach saag with indian cheese, vegetarian korma curry, chicken masala curry, lamb curry and lamb keema (ground lamb) curry.  There was also chicken tandoori.  If I'd gone during the summer, I'm sure the veggie curries would have been slightly different.\n\nThey don't use a lot of cream and yogurt in the curries offered in the buffet, which I do appreciate (exceptions being chicken tikka masala and any kind of korma curry which require dairy, but even those aren't too heavy).\n\nI'm not a big fan of pakora fritters in general, but at least they were in chickpea batter so I could still enjoy them (I eat GF). Another gluten-free item I loaded up on was the papadum lentil crackers with cilantro yogurt chutney - YUM!  I couldn't eat the naan b/c of my wheat allergies, but I did notice that everyone who got the buffet meal were treated to freshly baked naan to order. The basmati rice was well-prepared and not mushy like some other places.  I'm trying to keep my carbs down so being able to control the amount of rice via buffet is helpful.\n\nAll in all, a good deal for 9.99 when considering my other options for the evening. I'll definitely be coming back again for another cheap, hole-in-the wall, but home-style buffet meal.", "rating": 4, "date": "2011-11-10"}, {"excerpts": ["It's fine for paying $10 for a dinner buffet, they had soup and lamb curry and chicken tiki masala.\n\n"], "author": "Stephen W.", "review": "This restaurant is not expensive, but their food is only average at best.  I've had lots of Indian food, and I would rate this restaurant in the 20-30th percentile.  It's fine for paying $10 for a dinner buffet, they had soup and lamb curry and chicken tiki masala.\n\nTheir lamb was not good, very bony.  If you're looking for great Indian food, this is not your place.  If you're looking for something that's quick, fast and cheap, come here.  Don't get me wrong - I like all Indian food, so this place was very good.  It's just not good compared to other Indian food.\n\nThe restaurant is located in a great area with lots of other restaurants.  I'll have to try the all-you-can-eat shabu shabu next time ;)", "rating": 2, "date": "2011-12-25"}, {"excerpts": ["Don't limit yourself to just what I gave my 4 stars to cuz their naan is good, and their lamb curry, and their chai tea, and their samosas.. ", "wow, look at me "], "author": "Danielle G.", "review": "4 stars...\n1 for their gulab ball thingies\n1 for rice pudding\n1 for the chicken tikka masala\n1 for the veggie curry (i forget the name, sorry)\n\nReally, though, this place is darn good when you want a buffet of very good food at a pretty decent price. If you like Indian food, I would recommend coming here. Don't limit yourself to just what I gave my 4 stars to cuz their naan is good, and their lamb curry, and their chai tea, and their samosas.. wow, look at me I can really keep going.\n\nBasically, for a pretty small place the variety is not bad. And you still don't feel bad because, again, it's cheap! The only time you might feel bad is when your stomach isn't all too happy with the food :X\n\nOnce a couple of my friends were trying to out-eat each other at Star India. Talk about barely being able to walk, let alone breathe afterward. I believe right after that we stuffed 5 people into a mustang... that was a mighty uncomfortable ride home.\n\nPS - I've only come for the buffet! Never ordered off the menu or for take out", "rating": 4, "date": "2009-07-20"}, {"excerpts": ["I highly recommend the lamb curry; it was really good. ", "A major bummer about the lunch was that the food wasn't that hot temperature wise. ", "Many of the dishes were luke warm. "], "author": "Cris H.", "review": "We've driven by this place numerous times and finally today we ventured in for lunch. Walking in I noted that they weren't crowded and I thought \"uh-oh\" Also there was this silence in there as well. I don't know about you folks but most Indian restaurants usually have some sort of music blaring. The restaurant decor felt like it was something out of the 70's or early 80's era. \n\nAnyhow, I digress. So what you really want to know is how was the food right? It was pretty decent for a $10 all-you- can- eat buffet. They had my curry lamb, tiki marsala chicken, mango chutney and that spinach dish with the cubes of cheese. Can't really complain too much since all my favorites are there. Bonus that they had my little fried dough balls in syrup and chai tea. \n\nI highly recommend the lamb curry; it was really good. A major bummer about the lunch was that the food wasn't that hot temperature wise. Many of the dishes were luke warm. We weren't too happy about that. \n\nAlso for some odd reason I never saw the Tandoori chicken the whole time I was there. Where was the chicken? Only saw a layer of onions and a lemon wedge where the Tandoori chicken should have been. Hmmmmm..... \n\nThe naan was decent. Was thankful that this was at least warm when I bit into it....Overall not too bad, but still thinking that there are other Indian Buffets out there that I might enjoy better.", "rating": 3, "date": "2011-04-16"}, {"excerpts": ["lamb curry was good."], "author": "Tiff C.", "review": "buffet was affordable. naan was good. lamb curry was good.", "rating": 3, "date": "2016-02-23"}, {"excerpts": ["the one good dish they had was good was the lamb curry. ", "i usually don't care for lamb curry but they definitely did it right. "], "author": "Michael G.", "review": "visiting from socal and near where i live there's a city called diamond bar and this city has a significant indian population. due to this there are a number of great indian eateries and i have been spoiled and expect better indian food. aloo gobi is my favorite indian dish and star india ruined it for me it was very bland, i think they may have forgotten to add any spice whatsoever. the chicken masala was somewhat tough although the sauce was standard, the tandori chicken was ok but the onions that accompanied it where not and the naan was gross. the worst item from the all-you-can-eat buffet was the soup, it was completely offensive. soup should not be that watery. the one good dish they had was good was the lamb curry. i usually don't care for lamb curry but they definitely did it right. although i wasn't a big fan of the ground lamb, it was still nice to try something new. \n\nmy last complaint has to be about the staff, not friendly at all, they were even somewhat rude. i told my friends i'm visiting to do themselves a favor and eat there. it's san fran, there has to be better indian restaurants.", "rating": 2, "date": "2010-10-31"}, {"excerpts": ["One is full of hot dishes with a platter of rice, some ground lamb, lamb curry, a potato eggplant platter, a yellow curry platter, chicken masala and a really hard chicken BBQ tasting platter. ", "The other cart had a full tray of salad, two platters of fried food (fried potatoes and some chick pea balls and another with popcorn chicken like stuff) and five little platter things with sauces and pickled things and two cold platters, one with rice pudding and another with cucumber yogurt sauce. ", "I had three plates and was really full. ", "I mostly had salad with rice and curries. ", "The mixtures of curry is dangerous. ", "Ad by dangerous ", "I mean for your stomach. ", "Talk about atomic... ", "The rice and chick pea curry, the chicken masala and the rice pudding were my favorites. ", "The popcorn chicken stuff wasn't too bad either. ", "I honestly felt like blowing up afterwards. ", "This buffet could be better ", "but it's bot ", "exactly the worst I suppose. ", "The restaurant was nice and empty when we got there and when we left. ", "Only a few other tables were occupied."], "author": "Alex T.", "review": "I came here for the $9.99 lunch or dinner buffet with my family. The buffet is just two carts of stuff. One is full of hot dishes with a platter of rice, some ground lamb, lamb curry, a potato eggplant platter, a yellow curry platter, chicken masala and a really hard chicken BBQ tasting platter. The other cart had a full tray of salad, two platters of fried food (fried potatoes and some chick pea balls and another with popcorn chicken like stuff) and five little platter things with sauces and pickled things and two cold platters, one with rice pudding and another with cucumber yogurt sauce. I had three plates and was really full. I mostly had salad with rice and curries. The mixtures of curry is dangerous. Ad by dangerous I mean for your stomach. Talk about atomic... The rice and chick pea curry, the chicken masala and the rice pudding were my favorites. The popcorn chicken stuff wasn't too bad either. I honestly felt like blowing up afterwards. This buffet could be better but it's bot exactly the worst I suppose. The restaurant was nice and empty when we got there and when we left. Only a few other tables were occupied.", "rating": 3, "date": "2012-08-19"}, {"excerpts": ["I was a little disappointed in how weak the lamb curry was. ", "Little bits of lamb and bones", "...  lots of gravy for the rice, but the flavor was lacking. ", "The Masala was OK, BBQ  Chicken, and the eggplants very tasty. "], "author": "Rick V.", "review": "I really love curry. When you walk in this place, the aroma of curry hits you like Moe slapping Larry and Shemp. I was so ready to indulge! \n\nI was a little disappointed in how weak the lamb curry was. Little bits of lamb and bones...  lots of gravy for the rice, but the flavor was lacking. The Masala was OK, BBQ  Chicken, and the eggplants very tasty. The naan bread was awesome.\n\nI've had better Indian/Pakistani food. But this place isn't bad.", "rating": 3, "date": "2010-07-13"}, {"excerpts": ["Lamb Vindaloo (\"very hot lamb curry...with potatoes in tangy sauce\"). ", "$12. ", "Didn't tang much, for my taste, ", "lots of tomatoey sauce. ", "Didn't seem to be all that much lamb in the tureen, and when I got a piece after a couple big hunks of potato the connective tissue resisted disassembly, so I left it for my partner. ", "Will skip this one in the future.\n", "4) "], "author": "Andy P.", "review": "1) Meat (ground lamb) Samosa (2) $4. Puff pastries w/bit of cucumber salad, and four sauces. Tasty. I'll do it again.\n2) Kabuli Nan, supposedly w/cherries. $3. Except for some red stains on the interior which didn't noticably affect the taste, not obviously different than plan nan ($2).\n3) Lamb Vindaloo (\"very hot lamb curry...with potatoes in tangy sauce\"). $12. Didn't tang much, for my taste, lots of tomatoey sauce. Didn't seem to be all that much lamb in the tureen, and when I got a piece after a couple big hunks of potato the connective tissue resisted disassembly, so I left it for my partner. Will skip this one in the future.\n4) Ground Seekh Kabob. $11.50. Plentiful segmented rolls of ground lamb, with onions, bell pepper slices. As with the Samosa version of the ground lamb, tasty. And plentiful. I'll order this again.\n5) Basmati rice, $2@. Fine.\n6) Mango Lassi. $2.50@. Fine.\n\n$42.67 with tax, but before tip or discount. The doorhanger menu gives you $5 off the second entree, but I took home plenty of food despite my companion complaining about how much she'd eaten (and I'm not a light eater) so I could have done without a second entree, so that's less useful than the $12/$20 Groupon Now I actually used. Which in turn wouldn't have been as good as the $10(or less)/$25(of $35) (etc - three other options) available on restaurant dot com. And I noticed a BOGO$10 off on BigTip. And another review mentions LivingSocial... None of these (except some specials for takeout on the doorhanger) can be used for buffet or takeout, but it appears you can eat here cheap without limiting yourself to the buffet.", "rating": 3, "date": "2012-09-24"}, {"excerpts": ["The chicken tikka masala, tandori chicken, spinach paneer, lamb curry, and the lentils were not bad. ", "The rice was pretty good as well. ", "And they have the crispy bread thing as well as 2 different kinds of naan (garlic and plain). ", "They also had a spicy soup which I normally do not see at buffets - that was ok. ", "Of the desserts - they had these sweet ball things (not sure what it is called) - and those were good. "], "author": "Betty S.", "review": "We were in the neighborhood today and I had a craving for indian food. It was $9.99 for the buffet - so I thought why not try it. The selection didn't look too bad, and the resturant was clean.\n\nOverall, for a buffet it's not bad. The chicken tikka masala, tandori chicken, spinach paneer, lamb curry, and the lentils were not bad. The rice was pretty good as well. And they have the crispy bread thing as well as 2 different kinds of naan (garlic and plain). They also had a spicy soup which I normally do not see at buffets - that was ok. Of the desserts - they had these sweet ball things (not sure what it is called) - and those were good. There is also chai tea, which I really enjoyed because it was piping hot. \n\nOverall, not bad but i wished the naan was hot. I like the naan fresh, and not sitting there getting cold. There selection was pretty good, but I just normally stick to the staples..so you can't really go wrong there. The food could have been warmer/hot - but then again, maybe its because I came here when its raining and cold, so all I wanted was super hot food. Whatever the reason, not bad, but I think I'll stick to India Clay Oven if I were to do an indian buffet again.", "rating": 2, "date": "2009-02-22"}, {"excerpts": ["The tandoori chicken can be somewhat chewy, the lamb curry isn't overly flavorful, and I've tasted better samosas (though it's all still damn good). ", "But you know what, that $8 buffet, combined with stellar service from the staff, and the selection of food, counts for a lot. ", "Picture the scene", ": you know you're up for a big night at the bars, it's mid-afternoon, and you just wanna ", "fill your stomach and do it with little hassle. ", "Well then roll in here, enjoy the above-average food (as many times as you'd like), and cut out of there without even spending $10. ", "Not bad."], "author": "Drew S.", "review": "Here's the thing: my brother-in-law is Indian. I've tasted his family's food, and have been a big fan of Indian food since I was lad growing up in England (where they have many fast food curry joints). So I got a feeling I know my Indian food better than the average Joe.\n\nThat being said, Star India is not out-of-this-world great. The tandoori chicken can be somewhat chewy, the lamb curry isn't overly flavorful, and I've tasted better samosas (though it's all still damn good). But you know what, that $8 buffet, combined with stellar service from the staff, and the selection of food, counts for a lot. Picture the scene: you know you're up for a big night at the bars, it's mid-afternoon, and you just wanna fill your stomach and do it with little hassle. Well then roll in here, enjoy the above-average food (as many times as you'd like), and cut out of there without even spending $10. Not bad.", "rating": 4, "date": "2007-02-21"}, {"excerpts": ["Ordered the lamb curry and baigan bharta.  ", "\"", "Hot\" was actually spicy!  ", "Too bad it took and hour and 40 minutes to have it delivered when I ordered it on Eat24.  ", "When I called the restaurant after an hour and asked where it was, he said it was out for delivery already and that \"they were slammed.", "\"  ", "Please, at 8 pm on Sunday in the Inner Richmond?  ", "Delivery guy claimed that the other delivery guy had left it there and skipped over it.  ", "It really should take that long to deliver from a place that I can get to on my bike in 10 minutes."], "author": "Kathy C.", "review": "Food itself was good.  Ordered the lamb curry and baigan bharta.  \"Hot\" was actually spicy!  Too bad it took and hour and 40 minutes to have it delivered when I ordered it on Eat24.  When I called the restaurant after an hour and asked where it was, he said it was out for delivery already and that \"they were slammed.\"  Please, at 8 pm on Sunday in the Inner Richmond?  Delivery guy claimed that the other delivery guy had left it there and skipped over it.  It really should take that long to deliver from a place that I can get to on my bike in 10 minutes.", "rating": 2, "date": "2014-07-13"}, {"excerpts": ["The lamb curry wasn't as successful, with small chunks of lamb clinging to bones and a greasy sauce. ", "The rice and naan didn't impress, although I didn't try the herbed naan they offered. "], "author": "Timothy O.", "review": "Star India has a reasonably-priced lunch and dinner buffet for eight bucks and change. The chicken masala was flavorful and tasty with large chunks of chicken. The lamb curry wasn't as successful, with small chunks of lamb clinging to bones and a greasy sauce. The rice and naan didn't impress, although I didn't try the herbed naan they offered. There were vegetarian dishes and samosas, which were good, but unimpressive.\n\nAll in all, the meal was a good value, so if you're looking for a buffet in the Richmond, here it is.", "rating": 3, "date": "2006-06-02"}, {"excerpts": ["The spread is not the most impressive but it has all the core staples of lamb curry, chicken tikka masala, various pakoras, paneers, tandooris and naan. ", "Unlike many of the other Indian buffets I've been to, they also have spicy papadoms on the buffet table! "], "author": "Stuart Y.", "review": "I was driving east on Geary looking to make a U-turn to get some take out from one of the five hundred Korean barbecues in this part of the Richmond when the sweet aroma of cumin from the Star of India snagged me like a leash tethered between a tree and a dog that had taken off for a squirrel far beyond the reach of the leash.\n\nAborting my u-turn abruptly much to the ire of honking drivers in my way, I found parking and jaunted to Star of India to get a quick curry fix to go.\n\nI love Indian restaraunts. I think I love them much in the way that clinical sexaholics crave dubious, unsafe liasons with complete strangers. I love the first step into dimly lit, dark paisly wall paper establishments as Bollywood pop music enraptures my senses. Coriander, cumin and cardamom in the air invade my veins like crack cocaine and I can't wait for the first bite.\n\nFar in the back is the all you can eat buffet at the very reasonable rate of $8.95 for Lunch AND Dinner too! The spread is not the most impressive but it has all the core staples of lamb curry, chicken tikka masala, various pakoras, paneers, tandooris and naan. Unlike many of the other Indian buffets I've been to, they also have spicy papadoms on the buffet table! I feel sorry for everyone who's ever died before having tried at least one papadom.\n\nSince I was getting to go, a very dry restaraunt manager said that I was allowed two ladles from each dish. With eight to ten different dishes, my to go box wouldn't be able to fit all that food!\n\nMy only critique is that Star India does not quite have the variety that most other buffets offer. The food although quite delicious has a little room for improvement.\n\nBecause Star India provides the buffet for both Lunch and Dinner, this is a recommended restaurant for newcomers to Indian cuisine to give them a chance to try several things at once. Veterans of curry will not find dissapointment either!", "rating": 4, "date": "2008-03-21"}, {"excerpts": ["The chicken tikka masala, tandori chicken, lamb curry, and  were good but left me remembering other Indian places that had more spice and flavor. ", "I loved the garlic flavored naan and didn't even try the offered regular naan or the crispy bread thingies.  ", "Rice was offered ", "but I didn't sample any.  ", "Unlike other Indian buffets I have seen, this one had a spicy soup which was okay.  ", "They also offer chai tea which was wonderful because they kept it quite hot.  ", "My only complaint was my  same complaint for most buffets; I would prefer the food to be warmer and fresher "], "author": "Jonnathan C.", "review": "Went with a friend who raved about this place.  The quick and easy answer is that this place is 'okay' with wait staff that are friendly and good about clearing plates and refilling glasses.\n\nOverall, for a buffet I would agree with most of the reviews that say that it's not bad. The chicken tikka masala, tandori chicken, lamb curry, and  were good but left me remembering other Indian places that had more spice and flavor. I loved the garlic flavored naan and didn't even try the offered regular naan or the crispy bread thingies.  Rice was offered but I didn't sample any.  Unlike other Indian buffets I have seen, this one had a spicy soup which was okay.  They also offer chai tea which was wonderful because they kept it quite hot.  My only complaint was my  same complaint for most buffets; I would prefer the food to be warmer and fresher but this is something that cannot be helped in this type of setting.\n\nAll of this said, I would go back again.  The $10 for all you can eat, really is a steal.", "rating": 3, "date": "2009-03-22"}, {"excerpts": ["The lamb meat itself was cooked well (we had the lamb curry, and the pieces of meat were nice, no bones), and the daal was dark (like a makhani) which is the kind I prefer. "], "author": "Elsa T.", "review": "Not impressed... but they deliver.\n\nI just paid $31 + tip for dinner for two delivered.  I parted from Rotee because last time we ordered from them they gave us pieces of meat that seemed to be destined for the trash: lots of bones (really lots of bones) and almost no meat at all.\n\nThe food  from Star India was OK, could have had more flavor. The lamb meat itself was cooked well (we had the lamb curry, and the pieces of meat were nice, no bones), and the daal was dark (like a makhani) which is the kind I prefer. I won't order the naans again because they are definitely the worst I have ever had.\n\nSo for a night with an Indian craving this will do. I won't crave their food per say. Not like a Lahore Karahi, which unfortunately doesn't deliver.", "rating": 3, "date": "2007-05-19"}, {"excerpts": ["4 stars goes to the hot and fresh tikka masala (my favorite dish on the entire planet) & naan, the lamb curry, and the samosas while 2 stars goes to the depressing and boldly un-inviting atmosphere.  \n\n"], "author": "S M.", "review": "I'll keep this short and sweet.  I give the \"A-OK\" 3 star review which is the average of the food & price and the setting & service.  4 stars goes to the hot and fresh tikka masala (my favorite dish on the entire planet) & naan, the lamb curry, and the samosas while 2 stars goes to the depressing and boldly un-inviting atmosphere.  \n\nOutside of the delicious food, I'm not sure if there's anything else worth mentioning in a positive light, oh yeah - the all you can eat buffet is only $9.99, not bad at all.  I'm pretty sure I'd rather kick it here for the ten bucks rather than get 20 tacos at Jack, but this could change.", "rating": 3, "date": "2009-07-13"}, {"excerpts": ["I did like the fact that they had a few different curries such as the pumpkin curry and lamb curry.  ", "They were both interesting to try and the buffet at $9.99 for dinner was worth the money."], "author": "Cheryl L.", "review": "My cousins and I came here for the buffet.  It was pretty decent and had a \"larger\" spread than some of the other buffets I've tried.  (i.e. GGP).  I usually judge the food quality based on how they cook my favorite dishes:  chicken tikka masala and palak paneer.  Both dishes were ok, pretty average and nothing special.  I did like the fact that they had a few different curries such as the pumpkin curry and lamb curry.  They were both interesting to try and the buffet at $9.99 for dinner was worth the money.", "rating": 3, "date": "2010-08-31"}, {"excerpts": ["concerning my beloved ethnic food selections, so I tend to order the standards (Palak Paneer, Lamb Curry, Saffron Rice/Basmati, Naan, all great)  ... once or twice it could have used more seasoning.  ", "But  ", "**when you order online", "*"], "author": "Herb C.", "review": "Never been inside this place, keep in mind.  But the delivery was great!  Punctual, professional, proper temperature & packaging ... Pppperfect!\n\nI am notoriously risk averse esp. concerning my beloved ethnic food selections, so I tend to order the standards (Palak Paneer, Lamb Curry, Saffron Rice/Basmati, Naan, all great)  ... once or twice it could have used more seasoning.  But  **when you order online** the \"desired spiciness\" is part of the menu option & never had that problem since.\n\nHaving said that, next time you crave Indian, expand your horizons by trying these:\n\n* Indian Pizza (i hAte badly executed fusion, this was stellar)\n\n* Chili Cheese Bread (if naan had a makeover it would be called)\n\n* Mixed Appetizer Plate (+ a beer and dipping sauces, would have been its own meal, all fried to perfection & delivered in same condition, mMmm)\n\ndisclaimer: actually had to take a 15-20 min. bReak after eating the hot crispy assortment of appetizers -- just so i would be able to fully enjoy the main course. it. was. that. fn. good. oh yeah and the food was still hot.\n\nepilogue: do you have aNy idea how good widmer's apricot hefewiezen is with spicy indian food?  ... goes down niiiiice!", "rating": 4, "date": "2008-12-09"}, {"excerpts": ["The channa masala and lamb curry were okay, but the flavors just didn't pop the way they should. ", "I wonder if maybe they tone the spices down for the 30-person platter, but if I didn't want some spice, I wouldn't order Indian food!"], "author": "Bethany T.", "review": "I ordered from Star India via Waiters on Wheels for a work meeting. I ordered their 30-person platter. The portions were generous, but the saag paneer was the worst I've ever tasted. It was watered-down and bland. The channa masala and lamb curry were okay, but the flavors just didn't pop the way they should. I wonder if maybe they tone the spices down for the 30-person platter, but if I didn't want some spice, I wouldn't order Indian food!", "rating": 2, "date": "2012-11-05"}, {"excerpts": ["The chicken and lamb curry is DELICIOUS. ", "Not too spicy but  spiced enough to taste a real Indian Curry=) ", "The veggies are very good too. ", "Start your meal with the Dahl Soup and end it with the hot Chai. ", "Overall, I highly recommend this place!!! ", "Price for the buffet is same for lunch and dinner which is $10.85! ", "=)"], "author": "Ronalyn S.", "review": "This place is amazing!!! I recommend it for those who crave for Indian Food like me! I brought my friends here one time during our class breaks (lunch time) and left very satisfied.  The buffet will not only gives you the variety of food, but it's warm and fast refill:) Service is excellent! It gets packed especially during lunch time but the server is very accommodating and patient. The Naan is always fresh and you may also request for a garlic one.  The chicken and lamb curry is DELICIOUS. Not too spicy but  spiced enough to taste a real Indian Curry=) The veggies are very good too. Start your meal with the Dahl Soup and end it with the hot Chai. Overall, I highly recommend this place!!! Price for the buffet is same for lunch and dinner which is $10.85! =)", "rating": 5, "date": "2012-09-25"}, {"excerpts": ["They had chicken tikka masalla, lamb curry, tandoori chicken, a few veggie dishes, daal soup, basic salad, plain rice, plain and herby looking naan and some kind of potato bread that reminded me of the bread you get at Ethiopian restaurants.  ", "They also had samosas and some deep fried veggies and various sauces and dips.  ", "The lamb curry was also very tasty - the lamb itself was quite fatty but for me that only added to the flavor.  ", "Neither dish was particularly spicy but it certainly had enough going on to keep my mouth occupied.  "], "author": "Adam S.", "review": "Most Saturdays, I go for a bike ride into Marin.  My route home brings along Arguello across Geary and many is the time in my post-ride hunger when my nose hairs have prickled at the tasty scents emanating from Star India.\n\nToday, I finally got around to marrying those scents with tastes on my tongue and the experience was pretty good.\n\nThe buffet is in the back, well lit and well labeled so you know exactly what you're getting.  They had chicken tikka masalla, lamb curry, tandoori chicken, a few veggie dishes, daal soup, basic salad, plain rice, plain and herby looking naan and some kind of potato bread that reminded me of the bread you get at Ethiopian restaurants.  They also had samosas and some deep fried veggies and various sauces and dips.  For dessert, they had rice pudding and sweet doughy balls of goodness.\n\nThe samosa were pretty bland - tasty enough but hard to put your finger on exactly what it was you were getting.  Same goes for the potato bread things.  However, the curry dishes were actually pretty good.  I found the chicken tikka masalla to be mild and creamy, just like it should be, with big chunks of decent looking chicken and no bones.  The lamb curry was also very tasty - the lamb itself was quite fatty but for me that only added to the flavor.  Neither dish was particularly spicy but it certainly had enough going on to keep my mouth occupied.  In both cases, there was a high sauce to chicken ratio, but since you are serving yourself it is easy to use the spoon to cherry pick the best chunks of chicken and cut down on some of the sauce.\n\nThe tandoori chicken was a little boney - but I did get to the restaurant after the main lunch rush so perhaps I'd missed all the drumsticks and thighs.   The rice and naan were OK - rice was cooked decently, the naan a little chewy.\n\nJust when I thought I'd eaten enough, I remembered that I'd seen some sweet stuff so I headed back with a little plate to scope it out.  The rice pudding was very good indeed - very creamy tasting and quite decadent.  The sweet doughy balls were also nice and made a good compliment to the rice.  I ended up going back for a little more.\n\nThe place seemed clean, had enough customers to keep the food moving even at 2pm on a weekday and best of all, the things that were supposed to be hot were actually hot - there are few things in this world that I like less than tepid buffet food (yes, I'm talking to you, Lee's Deli - would it kill you to turn up the temp on your food heaters?) and I can happily say that at Star India the temp was definitely hot enough.\n\nFor $8.65 including tax I'll definitely be inclined to stop off next time I am riding past.", "rating": 4, "date": "2007-06-21"}, {"excerpts": ["The lamb curry was tasty, but other than that and the raisins in the rice, i was less than impressed.\n\n"], "author": "Darrell L.", "review": "$10, all you can eat dinner buffet?\n\nsounds like a winner, but i would rather spend the extra money at Pakwan and get some real good stuff. The lamb curry was tasty, but other than that and the raisins in the rice, i was less than impressed.\n\nif youre on a tight budget, but a heavy eater, then this could help with you dining dilemmas. otherwise, you could find much better. the quality is sub par.", "rating": 2, "date": "2009-02-10"}, {"excerpts": [", the ground lamb curry is good, the \"spicy\" lentil soup fair, though definitely not spicy.  ", "I added chili paste to nearly everything to \"kick it up a notch."], "author": "Richard C.", "review": "The food here is OK.  The chicken tikka masala is fairly bland, the ground lamb curry is good, the \"spicy\" lentil soup fair, though definitely not spicy.  I added chili paste to nearly everything to \"kick it up a notch.\"\n\nWhen the naan first comes out of the kitchen it is good, but as it sits under the lamps, it becomes progressively tougher, until--at last--it resembles a rawhide chew.\n\nI've definitely had better Indian food.  I would probably give it a slightly higher rating for the quality of the food, but it is served (In what seems an Indian buffet tradition.) lukewarm.  I'm surprised these Indian buffets manage to pass health department tests.  Oh, wait, this is San Francisco, the health-department inspector probably only gets out on even years.", "rating": 3, "date": "2009-07-22"}, {"excerpts": ["(My favorite meal is spicy lamb curry and some hot nann -- get home fast and have it with a cold beer)."], "author": "david s.", "review": "Dishes here seem to be hit or miss.  \n\nIn my experience (about 6 orders), the lamb dishes  and lenti/bean dishes dishes are the best.\n\n(Lamb Vindaloo is excellent, Lamb Rogan Josh is very good)\n(dahl and channa masala both pretty good) \n\nI would steer away from the chicken  and vegetarian dishes (and I love vegetables).\n\n(chicken tikka masala & tandori not great - chicken not well seasoned),\n(saag paneer, alou ghobi, lacking flavor, a bit oily, and mushy).\n\nThey have great naan and great rice.  \n\nI have only ordered takeout and it seems to be a bit expensive also -- the buffet may be the way to go but I live a few blocks away so I'd rather eat at home.\n\n(My favorite meal is spicy lamb curry and some hot nann -- get home fast and have it with a cold beer).", "rating": 3, "date": "2009-05-01"}, {"excerpts": ["their BBQ chicken, lamb curry, the one with spinach (can't remember the name) and of course the keer (rice dessert) and sugar balls...", "If you mix these two, aleluiah! "], "author": "JM M.", "review": "Ok- first of all---the picture posted for this restaurant is not correct...I've been there many many many times and it is nothing like that- Seriously--- I don't see the buffet area (place is actually smaller than picture posted). \n\nAnyway, if I am craving for keer (dessert) this where I usually go and also for fast dinner with no wait...Since they always serve the same food all the time, it gets tiring. I do however like their BBQ chicken, lamb curry, the one with spinach (can't remember the name) and of course the keer (rice dessert) and sugar balls...If you mix these two, aleluiah! (but watch out for the calories though but who cares ;) ) \n\nThe guys as usual are always friendly, place is clean and the interior design is ok. If you want fast indian buffet food- go to this place. It's about $8.99 per person for dinner + tax of course...", "rating": 3, "date": "2008-05-20"}, {"excerpts": ["I like the lamb curry, papadums and chai.  ", "I really appreciate the chai being unsweetened so I can sweeten it to my taste.  ", "The staff is very friendly as well."], "author": "Ron A.", "review": "the buffet at Star India is the freshest I've found in the Bay Area.  the Tandoori chicken is moist, not dry.  the saag paneer is thick and rich as is the veggie korma.  I love their vegetable samosa the spicing is incredible, same for their lentils or chickpeas (they vary the selection daily).  I especially like it when they have eggplant or okra as one of the several veggie dishes.  My friend likes the cabbage best and the ground lamb.  I like the lamb curry, papadums and chai.  I really appreciate the chai being unsweetened so I can sweeten it to my taste.  The staff is very friendly as well.", "rating": 5, "date": "2009-05-26"}], "lamb rogan ghosh": [], "lamb krahi": [], "lamb palak": [], "lamb gushane": [], "lamb do piazza": [], "lamb coconut": [{"excerpts": ["There are two things I love about this restaurant: the samosa, which is really good and the lamb coconut curry, which is to die for. ", "I have ordered other items in the past and they were not as tasty. ", "Also, their level of spiciness is all messed up. ", "Sometimes, I order medium spice ", "and it is not spicy at all ", "and sometimes it burns your stomach for days.\n", "Overall it is a decent Indian restaurant. \n", "I just don't think I will ever try other items."], "author": "Ashish N.", "review": "There are two things I love about this restaurant: the samosa, which is really good and the lamb coconut curry, which is to die for. I have ordered other items in the past and they were not as tasty. Also, their level of spiciness is all messed up. Sometimes, I order medium spice and it is not spicy at all and sometimes it burns your stomach for days.\nOverall it is a decent Indian restaurant. \nI just don't think I will ever try other items.", "rating": 3, "date": "2018-11-08"}, {"excerpts": ["Lamb Coconut Curry with zero vegables. ", "Just the way I like it. ", "The Naan is also just right and not burnt as it often is. ", "I always order a Mango Lassi, sortof a mango milkshake, as well."], "author": "Rob H.", "review": "Terrific Indian delivery. Lamb Coconut Curry with zero vegables. Just the way I like it. The Naan is also just right and not burnt as it often is. I always order a Mango Lassi, sortof a mango milkshake, as well.", "rating": 3, "date": "2006-06-19"}, {"excerpts": ["For $12.00, the lamb coconut I had was made from tough, undercooked stew meat that did not taste fresh.  "], "author": "Pam J.", "review": "This is your basic Curry Powder Express. The McD's of Indian hash houses. I've tried it a few times, delivery included, and do not like it. The food is quickly and carelessly cooked, with none of the rich aromas and layered spices associated with good Indian food. For $12.00, the lamb coconut I had was made from tough, undercooked stew meat that did not taste fresh.  The $12.00 prawn coconut was bad as well, with only 5 or 6 small, overcooked prawns that tasted frozen. That $10.00 buffet is pure slop  and the flavorless items don' t seem to change. The worst of them is lamb or goat neck bones floating in a mucky, brown sauce. Service is brusque and impersonal. This restaurant's main interest is obviously money, not good food.", "rating": 1, "date": "2012-04-04"}], "a lamb tikka masala": [], "b lamb bonein": [], "chicken curry": [{"excerpts": ["I'll be back\"\n\nCoconut Chicken Curry: Nice Large, tender chicken chunks, great flavor, sauce made perfect dipping sauce for the Naan. \n\n"], "author": "Gage S.", "review": "\"I'll be back\"\n\nCoconut Chicken Curry: Nice Large, tender chicken chunks, great flavor, sauce made perfect dipping sauce for the Naan. \n\nOnion Kulcha: great consistency and flavor.\n\nRice Pilou: typical Indian rice, but I did notice the sweetness of the raisins much more than I've noticed them in the past, tasted great. \n\nCherry Naan: never thought to try this before but I will be ordering this every time going forward. Loved the subtle flavor of cherry even though I would've assumed the Bright red, thick cherry spread would have been too much cherry, but it was perfectly executed.\n\nSaag Chana: my friend actually really liked it, I thought the flavor was a bit bland. \n\nFast delivery, hot when it arrives. Delivery bag packed perfect, no leaks/spills, which I've had many times in the past from other places.", "rating": 4, "date": "2018-10-14"}, {"excerpts": ["Just had the yellow chicken curry with rice and it was delicious! "], "author": "David W.", "review": "Just had the yellow chicken curry with rice and it was delicious! Also got a complimentary scoop of mango ice cream with Yelp check-in. Thank you Star India!", "rating": 5, "date": "2018-11-07"}, {"excerpts": ["Orange Chicken Curry, White Rice & Gulab. ", "Recommendation to try it Out. ", "Location, Address is 3721 Geary Ave. ", "@2nd Avenue San Francisco, CA."], "author": "Pink R.", "review": "Orange Chicken Curry, White Rice & Gulab. Recommendation to try it Out. Location, Address is 3721 Geary Ave. @2nd Avenue San Francisco, CA.", "rating": 5, "date": "2015-11-03"}, {"excerpts": ["PROS: \ntika masala\nnann\nbalsamic rice \ncoconut chicken curry \n\nCONS: "], "author": "Amanda C.", "review": "I love this place!!! The staff is marvelous, super friendly and super helpful. This place is amazing because it has LUNCH & DINNER  BUFFET for $9.99. This is as good as it gets in SF. \n\nPROS: \ntika masala\nnann\nbalsamic rice \ncoconut chicken curry \n\nCONS: NONE\n\nDon't forget to say hi to the wonderful staff.", "rating": 5, "date": "2012-01-16"}, {"excerpts": ["Anyway, there was a good variety of dishes that included lamp and chicken curry, tandoori chicken.  ", "My favorite dish though was the naan.  "], "author": "Matt S.", "review": "You just can't beat this deal!  All you can eat Indian food for under 10 bucks!\n\nDisclaimer: I'm no Indian food expert, in fact my venture to Star India was probably the first time I had Indian.\n\nAnyway, there was a good variety of dishes that included lamp and chicken curry, tandoori chicken.  My favorite dish though was the naan.  There were so many different dishes to eat it with!\n\nMy biggest complaint was that the food did not look fresh.  It looked as if it were sitting there all day!  The place was empty and appeared drab on the Saturday evening that I went.  Although it WAS raining fairly heavily, so that might have added to the blah atmosphere.", "rating": 3, "date": "2011-01-09"}, {"excerpts": ["Best thing though is the chicken curry, extra spicy! ", "Everything else was pretty average but was actually disappointed in their chicken tikka masala. ", "Chicken curry, lamb masala, and veggie samosas are the way to go. ", "Naan can be too crispy and their tandoori chicken is mediocre. ", "I've definitely had better Indian-Pakistani food but this one was not bad."], "author": "Bayan A.", "review": "I give this place about a three. Wasn't too bad. Had a spend $100 and receive $50 bucks back so it was a pretty good deal. Got a lot of food for 6 ppl n had plenty left over. Best thing though is the chicken curry, extra spicy! Everything else was pretty average but was actually disappointed in their chicken tikka masala. Chicken curry, lamb masala, and veggie samosas are the way to go. Naan can be too crispy and their tandoori chicken is mediocre. I've definitely had better Indian-Pakistani food but this one was not bad.", "rating": 3, "date": "2013-02-28"}, {"excerpts": ["The chicken curry was my favorite ", "and I ate my fill.  ", "For $10 this place is a good deal if you're hungry, on a budget, and want a variety of curries."], "author": "Peter W.", "review": "I went here last night with my roommate.  We got an add in the mail about $10 lunch and dinner buffet.  A $10 buffet is always worth giving a try.\n\nI have to admit that it wasn't the best indian food I've ever had, but they had a good selection of different curry's, nan, tandoori chicken, salad, rice, and more.  The place was also clean and the staff friendly.  \n\nThe chicken curry was my favorite and I ate my fill.  For $10 this place is a good deal if you're hungry, on a budget, and want a variety of curries.", "rating": 3, "date": "2009-11-24"}, {"excerpts": ["And be sure to get the chicken curry over basmati rice."], "author": "Sam T.", "review": "I was working at the Presidio Branch Library this past summer. \nFor dinner, my coworkers recommended Star India. For $8, you get an all you can eat meal. The restaurant is quite small and the buffet selection is limited. I did enjoy the curry chicken while I was there. I didn't really like the chicken tandoori because there were only 3 pieces to choose from at the buffet table and they were looking dry.  The service there was pretty attentive which was good.\n\nI recommend Star India if you have a few hours to dine. Its a nice place to go for a Saturday or Sunday afternoon food binge. I say take it slow, order a beer and take frequent trips to the buffet table.  And be sure to get the chicken curry over basmati rice.", "rating": 4, "date": "2007-10-17"}, {"excerpts": ["and I can cook some delish chicken curry). ", "The service is shabby, there's shady people hanging out outside but the food is great for Indian-American food."], "author": "Naz A.", "review": "Freshman 15? More like 30 thanks to Star of India's amazing all you can eat, cheap ass buffet. Damn sooo good but so fatty. I ate here way too often when I wanted Indian food but was too lazy to cook it myself (I'm Indian and I can cook some delish chicken curry). The service is shabby, there's shady people hanging out outside but the food is great for Indian-American food.", "rating": 4, "date": "2010-09-01"}, {"excerpts": ["I liked the chicken curry and their biryani a lot but everything else wasn't amazing."], "author": "No N.", "review": "I liked the chicken curry and their biryani a lot but everything else wasn't amazing.", "rating": 2, "date": "2013-04-07"}, {"excerpts": ["I liked the chicken curry and the naan bread. "], "author": "Jen M.", "review": "I wanted to try some indian food and this one seemed okay, from reviews and from a distance. I came here one day and saw the place half full. I was greeted by a waiter asking me do I want the buffet or will I be ordering. I said the buffet. I went up the steps and saw only a few selections. I liked the chicken curry and the naan bread. I tried some papadams, some veggie pakora and samosa, and some others which I dont quite remember. The price was $9.99, plus tax is $10.94. This is a quiet little restuarant and whenever I want to have some indian food, this may be the place for me.", "rating": 3, "date": "2010-09-03"}, {"excerpts": ["Veggie samosas are bomb as is the chicken curry and vegetable biryanti. \n\n"], "author": "Ronnie M.", "review": "Great place for take out if you live in the inner richmond. Veggie samosas are bomb as is the chicken curry and vegetable biryanti. \n\nI have yet to try the buffet which seems to be why most people would be interested in eating in the restaurant.\n\nThey give you a ton of food. I usually am able to eat leftovers for three days, The people that work their have always been nice. \n\nI definitely recommend giving Star India a try.", "rating": 4, "date": "2008-09-13"}, {"excerpts": ["The chicken curry had lots of chicken and portion sizes were generous.  ", "The soup also had plenty of vegetables.  ", "The order of samosa came with two large sized samosas."], "author": "M R.", "review": "I liked Star India.  The delivery took about 30 minutes, just as quoted.  The food was good and portion size was large.  The chicken curry had lots of chicken and portion sizes were generous.  The soup also had plenty of vegetables.  The order of samosa came with two large sized samosas.", "rating": 4, "date": "2008-04-21"}], "chicken coconut": [], "makhanwala": [{"excerpts": ["The Chicken Makhanwala is great.  ", "I would return just for this dish...and they also got the spice level right.  ", "The Tandoori Chicken used had great flavor and was very moist."], "author": "Zoran L.", "review": "Overall I thought this was just OK.  I was very surprised given the great reviews.  I ordered carry-out, so maybe next time I'll try the buffet... they're definitely worth trying again (and trying other dishes).\n\nThe Chilli Chicken was very disappointing (can't believe it's listed as a House Special).  I ordered it spicy and it lacked any heat...nothing...almost like they loaded it with bell peppers. It also had a strange fluorescent red sauce...looked like Sweet and Sour sauce...ugh \n\nThe Saag Paneer was decent.  It did lack the usual spices you'd normally taste in this dish.  I have to agree with previous posts about it being bland.\n\nThe Chicken Makhanwala is great.  I would return just for this dish...and they also got the spice level right.  The Tandoori Chicken used had great flavor and was very moist.", "rating": 3, "date": "2011-11-17"}, {"excerpts": ["Instead of the makhanwala, they gave me chicken tikka masala, which was not as complex at all as what I wanted. ", "The keema naan was soggy. ", "The spicy vegetable jalfaze was ok. ", "The delivery guy couldn't be bothered to ring the buzzer, even with my 15% tip."], "author": "Derrick V.", "review": "Ordered delivery. Instead of the makhanwala, they gave me chicken tikka masala, which was not as complex at all as what I wanted. The keema naan was soggy. The spicy vegetable jalfaze was ok. The delivery guy couldn't be bothered to ring the buzzer, even with my 15% tip.", "rating": 2, "date": "2014-04-28"}], "chicken karahi": [{"excerpts": ["The lamb is always good, and I usually go with the chicken Karahi. ", "Being able to dictate the spice level is nice too! "], "author": "Sunny D.", "review": "This is my absolute go-to neighborhood favorite. The buffet is affordable, but I do love the continence of delivery sometimes... which is what I did tonight. The lamb is always good, and I usually go with the chicken Karahi. Being able to dictate the spice level is nice too! I have always found the people working there to be attentive and accommodating without being overbearing. \n\nIf you don't know a lot about Indian food, the buffet is a good place to start to get some ideas. But you can always order off the menu instead. \n\nOverall- love it!!", "rating": 5, "date": "2017-05-26"}, {"excerpts": ["Always the same order: chicken vindaloo, chicken karahi, rice, naan, veggie samosa. ", "Yum. ", "Yum. and YUM. ", "Once in awhile the dishes are a bit on the spicy side for me (I'm a lightweight), but always good. ", "The flavor of the chicken in the karahi dish is my favorite - ", "I don't know what they do to it ", "(I'm guessing some kind of magic marinade), but it's delicious. ", "Whatever you do, don't ask for \"mild\" - that's the only time I've been unimpressed with our order - "], "author": "Laura G.", "review": "Oh Star India, you have rescued me many times from my kitchen. \n\nMy husband and I have been eating here for nearly five years. We originally discovered this place through my coworkers, who were devoted fans (for good reason!). \n\nThough we've only dined in here a handful of times (and always off the menu, never the buffet), we order takeout frequently.\nAlways the same order: chicken vindaloo, chicken karahi, rice, naan, veggie samosa. Yum. Yum. and YUM. Once in awhile the dishes are a bit on the spicy side for me (I'm a lightweight), but always good. The flavor of the chicken in the karahi dish is my favorite - I don't know what they do to it (I'm guessing some kind of magic marinade), but it's delicious. Whatever you do, don't ask for \"mild\" - that's the only time I've been unimpressed with our order - it tasted kind of watery. \n\nThe guys who answer the phone and the guys who deliver are always nice, patient and not once, in three + years of ordering have they ever messed up our order (that's saying something). Additionally (because I can't say this of most of the Chinese food places we've ordered from) - never, not once, have we ever been sick from this food. \n\nThis place is absolutely one of our go-to options for takeout. We love Star India.", "rating": 4, "date": "2010-03-01"}, {"excerpts": ["Their chicken korma is the best and their chicken karahi is a fiery taste sensation. ", "Great veggie pakora and garlic naan, too. ", "The bonus is that when you order delivery, they say they will be there is 45 mintues, but what they really mean is 4 to 5 minutes. ", "They're speedy!"], "author": "A Y.", "review": "This is my favorite Indian take-out, hands down. Their chicken korma is the best and their chicken karahi is a fiery taste sensation. Great veggie pakora and garlic naan, too. The bonus is that when you order delivery, they say they will be there is 45 mintues, but what they really mean is 4 to 5 minutes. They're speedy!", "rating": 5, "date": "2006-10-02"}], "chicken madras": [], "prawns curry": [], "fish curry": [{"excerpts": ["I am very satisfied with the service, the food was delicious, my favorite is the chicken masala and fish curry. ", "Their na-an was awesome too.  ", "For $12.99, it's worth it! ", "Plus check in on yelp and review, you get a free dessert. ", "How awesome is that."], "author": "Michael S.", "review": "Went on lunch with friends with this place. I am very satisfied with the service, the food was delicious, my favorite is the chicken masala and fish curry. Their na-an was awesome too.  For $12.99, it's worth it! Plus check in on yelp and review, you get a free dessert. How awesome is that.", "rating": 5, "date": "2018-08-10"}, {"excerpts": ["The fish curry was incredible, I've never had anything quite like it. ", "Ordered it extra hot, spices were amazing, fish was cooked perfectly. ", "The naan was moist and fluffy, so good."], "author": "Luke R.", "review": "Ordered via eat24hours. The food came quickly and was very fresh. The fish curry was incredible, I've never had anything quite like it. Ordered it extra hot, spices were amazing, fish was cooked perfectly. The naan was moist and fluffy, so good.", "rating": 5, "date": "2015-07-16"}, {"excerpts": ["We had lamb korma, chicken tikka, the fish curry, and an assortment of naan. ", "The order came quickly and was super hot. ", "The Lamb was delicious, I liked that the meat still had a bit of bite to it ", "and it wasn't overly fall-apart. ", "The chicken tikka looked watery but quickly thickened up once it cooled a bit and the chicken was super tender. ", "The fish curry was the star as it was perfectly cooked and the sauce was absolutely delicious! ", "The onion naan was my favorite and the rice was very good--they add cashews and golden raisins(I ", "think) ", "so it was more than your average white basmati. ", "We will be back!"], "author": "Julie M.", "review": "We ordered delivery from them last night based on a recommendation from one of our Indian friends. We had lamb korma, chicken tikka, the fish curry, and an assortment of naan. The order came quickly and was super hot. The Lamb was delicious, I liked that the meat still had a bit of bite to it and it wasn't overly fall-apart. The chicken tikka looked watery but quickly thickened up once it cooled a bit and the chicken was super tender. The fish curry was the star as it was perfectly cooked and the sauce was absolutely delicious! The onion naan was my favorite and the rice was very good--they add cashews and golden raisins(I think) so it was more than your average white basmati. We will be back!", "rating": 5, "date": "2016-06-19"}, {"excerpts": ["Prawn korma, fish curry, chicken tikka masala.  ", "Safe selections with lots of sauce.  ", "Lasted me three meals."], "author": "Mrs F.", "review": "I'm upping it to a four now.  Got delivery.  Very efficient online ordering system.  \n\nStill pricey, though.  \n\nPrawn korma, fish curry, chicken tikka masala.  Safe selections with lots of sauce.  Lasted me three meals.", "rating": 4, "date": "2009-05-21"}, {"excerpts": ["My favorite dishes are the Chicken Tikka Masala, Fish Curry, Chicken Tikka Kabob, Beghan Bharta (sp?) and their saags (though they can sometimes be super spicy).  "], "author": "Suzanne L.", "review": "Okay, so it's not the best Indian in the world but pretty damn good.  I was scared to try the buffet but it's actually really good, very fresh and great variety.  And it's $8.99.  Come on, that's pretty damn good.\n\nFor delivery, try one of their Indian Pizzas.  Oh my...very, very good.\n\nTheir delivery has always been fast and the orders have always been right - then again, we only live a few blocks away, just too lazy to walk over there sometimes.\n\nMy favorite dishes are the Chicken Tikka Masala, Fish Curry, Chicken Tikka Kabob, Beghan Bharta (sp?) and their saags (though they can sometimes be super spicy).  And their naan is awesome.\n\nLastly, they're pretty darn nice!", "rating": 4, "date": "2008-05-15"}], "prawn saag": [], "prawn coconut": [{"excerpts": ["The $12.00 prawn coconut was bad as well, with only 5 or 6 small, overcooked prawns that tasted frozen. ", "That $10.00 buffet is pure slop  and the flavorless items don' t seem to change. ", "The worst of them is lamb or goat neck bones floating in a mucky, brown sauce. ", "Service is brusque and impersonal. ", "This restaurant's main interest is obviously money, not good food."], "author": "Pam J.", "review": "This is your basic Curry Powder Express. The McD's of Indian hash houses. I've tried it a few times, delivery included, and do not like it. The food is quickly and carelessly cooked, with none of the rich aromas and layered spices associated with good Indian food. For $12.00, the lamb coconut I had was made from tough, undercooked stew meat that did not taste fresh.  The $12.00 prawn coconut was bad as well, with only 5 or 6 small, overcooked prawns that tasted frozen. That $10.00 buffet is pure slop  and the flavorless items don' t seem to change. The worst of them is lamb or goat neck bones floating in a mucky, brown sauce. Service is brusque and impersonal. This restaurant's main interest is obviously money, not good food.", "rating": 1, "date": "2012-04-04"}], "fish coconut": [], "fish vindaloo": [{"excerpts": ["This time I tried different on  advice of the delivery guy, 1)Mulligawtani soup, 4 Lamb pcs, Mixed Tandoori, Fish Vindaloo, Rice n 4 nans for three of us. ", "All were ordered spicy. ", "And everything tasted good, the spice was exactly what we were asking for. ", "Fish pieces were tasty and special mention for mixed tandoori(chicken, lamb, prawns) was awesome. ", "It was first time for my friend who came from New York n he was shocked to know that there were indian restaurants with such good taste in SFO. ", "I would recommend this restaurant to any one who just landed in sf n want to have authentic Indian food."], "author": "Abhishek N.", "review": "This is my second review n mesmerizingly review for same restaurant. How does these guys maintain same taste every time. I wait everytime to just see whether they get flactuated but never. As usual ordered for a delivery and bang on time. This time I tried different on  advice of the delivery guy, 1)Mulligawtani soup, 4 Lamb pcs, Mixed Tandoori, Fish Vindaloo, Rice n 4 nans for three of us. All were ordered spicy. And everything tasted good, the spice was exactly what we were asking for. Fish pieces were tasty and special mention for mixed tandoori(chicken, lamb, prawns) was awesome. It was first time for my friend who came from New York n he was shocked to know that there were indian restaurants with such good taste in SFO. I would recommend this restaurant to any one who just landed in sf n want to have authentic Indian food.", "rating": 5, "date": "2015-10-27"}], "prawn vindaloo": [], "prawn korma": [{"excerpts": ["Their Sag Paneer is my roommate's new favorite guilty pleasure, and my new go-to entree is the Prawn Korma. ", "The Chicken Korma is awesome, too, and the initial reason I got turned on to the Prawn Korma.\n\n"], "author": "Laura C.", "review": "I just want to reiterate how much I love Star India. I order so often here that my friends think I'm crazy. My roommates even tricked me into trying a new Indian spot, and my boyfriend made me venture to another Indian restaurant when his mom came into town because he wanted to try something new. \n\nWhen we ordered elsewhere the portions were smaller and pricier. And they definitely didn't have my beloved Star India taste!\n\nI just... can't leave Star India. Maybe I'm a creature of habit. Maybe I like my comfort zone. But honestly, I think I just like knowing that when I order something I'll be consistently happy with it. Even my friend who graduated from USF years ago says she misses this place and is sad they won't deliver to her neighborhood. I mean, hey, I started yelping because I wanted to share how great this restaurant is! \n\nI still can't speak to their buffet - but I order their take-out consistently. Since my last review, I've stopped being vegetarian and have tried new dishes. Their Sag Paneer is my roommate's new favorite guilty pleasure, and my new go-to entree is the Prawn Korma. The Chicken Korma is awesome, too, and the initial reason I got turned on to the Prawn Korma.\n\nIt's seriously the best comfort food in the Inner Richmond. \n\nThe staff are continually sweet, too! The other day I ordered online, and online the wait was listed as 40-60 minutes. I was hungry and grumbled a bit but knew it was worth it. Ten minutes later there was a knock on my door and the manager was standing there with my food because she recognized my name and order! I was so shocked I forgot to tip her (sorry!!). Please go and please make friends with the staff because they are great people and take care of their customers!\n\nAnyways, conclusion: GREAT SERVICE. Consistent food. Comforting. Addicting. Reasonably priced. After a year I'm still in love with Star India.", "rating": 5, "date": "2015-02-23"}, {"excerpts": [", I'm a Prawn Korma kind of girl.  ", "He goes for the garlic naan, the onion is out of the bag and on my plate before he's realized the food's arrived.  ", "(Opposites attract?)  "], "author": "Jasmine L.", "review": "It all started on a warmish evening two summers ago when the bf's mom grabbed some of this delicious grub on her way home.  We had been India Clay Oven fans at the time, but were blown away by the dishes she had picked out (one of which was the Channa Masala--two words: Damn, Gina) and the total she claimed to have paid for it all.  Two years later and it is THE go-to spot for those moments when only pure, unadulterated spice and some yummy yummy naan will suffice.  He's into the Chicken Vindaloo, I'm a Prawn Korma kind of girl.  He goes for the garlic naan, the onion is out of the bag and on my plate before he's realized the food's arrived.  (Opposites attract?)  But we can both agree on the Channa Masala (medium spicy, please--because as much as I love me some sauce--they do NOT mess around) and the Rice Pilaf.  \n\nThe prices are not as impressive as they were in the beginning--when we had been consistently offering up our first (un)born at Clay Oven but I feel that I can overlook this little fact because at Star India,  you can totally order online!  LOVE that.  While they do call to verify your order, there's something oddly satisfying about an entire restaurant experience that involves little to no human contact.  I mean, for me, generally, I'm ordering out because I'm not in the mood/too lazy to cook and therefore ALSO not in the mood to put on my happy voice to place a polite yet well-enunciated order--hoping beyond hope that they were able to distinguish between \"Fulton\" and \"Folsom\" and that my food's not now on it's way to some SOMA loft...What can I say, I'm a total freak when I'm hungry.  I think about these things.  Don't judge me...", "rating": 4, "date": "2010-07-02"}, {"excerpts": ["Prawn korma, fish curry, chicken tikka masala.  ", "Safe selections with lots of sauce.  ", "Lasted me three meals."], "author": "Mrs F.", "review": "I'm upping it to a four now.  Got delivery.  Very efficient online ordering system.  \n\nStill pricey, though.  \n\nPrawn korma, fish curry, chicken tikka masala.  Safe selections with lots of sauce.  Lasted me three meals.", "rating": 4, "date": "2009-05-21"}], "prawn gushane": [], "fish gushane": [], "saffron rice": [{"excerpts": ["Great mix of saffron rice with cashews and raisins.  \n  \n", "Overall, portions and value are great.  ", "Our total tab was $35.  ", "Cooking execution needs some work.  ", "Service is tentative.  ", "Ambiance is casual and laid back.  ", "I might or might not go again to give them another chance.  ", "Rating would be 2.5 stars ", "but I'm rounding up."], "author": "Liv A.", "review": "The gangsta rap was bumpin' up in Star India right as the other half and I walked through the door for dinner.  That made me laugh as I wouldn't have expected such the colorful soundtrack inside an Indian restaurant.  Throughout the evening, there was an interesting mix of music.  That stuck in my mind the most about our dining experience. \n\nStar India seems to be a popular take-out/delivery type of eatery.  There weren't that many patrons that evening.  However, we constantly the delivery guy carry huge bags of take out packages out of the kitchen.  It took about 20 minutes for us to get our food bc there were so many takeout orders. \n\nAlthough there was an AYCE dinner buffet for $10.99 pp, we opted for ordering a la carte.  I passed by the buffet bar on the way to the restroom and didn't think the buffet looked that impressive.  However, I thought that the dishes we ordered were just OK.  \n-Plain naan: Slightly greasy and smaller in portion size than naan from other places.\n-Fish Tandoori: Huge cubes of salmon came out on a sizzling platter with green bell peppers and onions.  It was great with a squeeze of lemon.  Only downside was that the salmon was overcooked and a bit dry. \n-Chicken Vindaloo (chicken breast meat):  A huge portion of chicken and potatoes ordered to our preference of mild spiciness.  Only problem was that the chicken was dry.  Without the curry, it would have been much less edible. \n-Saffron Rice: Great mix of saffron rice with cashews and raisins.  \n  \nOverall, portions and value are great.  Our total tab was $35.  Cooking execution needs some work.  Service is tentative.  Ambiance is casual and laid back.  I might or might not go again to give them another chance.  Rating would be 2.5 stars but I'm rounding up.", "rating": 3, "date": "2015-04-26"}, {"excerpts": ["Saffron Rice: ", "Rice in three different shades of red with raisins, peanuts and cashews.  ", "I must say I was pretty impressed by this Biyani.  ", "However, it did not have a couple more un-edible ingredients that would bring out more flavor to a dish I eat at home called \"dam-bout."], "author": "Morris C.", "review": "I went here today with my girlfriend for dinner.  She purchased a living social deal where it was $10 for $20.  By using this deal, we were not able to purchase the buffet  at the rate of $9.99 per person.  We purchased Al a carte.  \n\nOnion naan.:  Bits of onion in the dough and what appears to be garlic and little green specs baked into the naan.  Not bad at all, and it complements the Chicken Tikka Masala very, very nicely.\n\nSaffron Rice: Rice in three different shades of red with raisins, peanuts and cashews.  I must say I was pretty impressed by this Biyani.  However, it did not have a couple more un-edible ingredients that would bring out more flavor to a dish I eat at home called \"dam-bout.\"\n\nChicken Tikka Masala:  The chicken wasn't too dry and the sauce was so good that it made you want to dip everything in it!.\n\nSpinach mesh with Yogurt Pieces: I forgot the actual name of this dish, but I have to say I enjoyed it.  The yogurt had the texture of firm/chewy tofu, and I was very pleased with this dish.\n\nMango Ice Cream:  If you check in on yelp, you get one free mango ice cream!  Unfortunately... my girlfriend and I both \"used\" our mango ice creams and we only ordered one and needed to order one.  The way it tasted was frozen Mango Lassi.  My guess is there is a mango syrup added to a yogurt/milk blend, frozen and then diced into little cubes then served to us.\n\nOverall, I am giving this place a 4 (Though I felt like giving this place a 3 for the majority of the visit due to the wait).  I am a bit upset about two things.  \n\n1) We entered the store at 7:10p.m.  We were seated immediately, but no water/menus were given to us until 7:19p.m.  I saw the waiter and waitress work on bussing the other tables.  One main piece of advice is that you do not have your customers wait for you.  Those tables are less important than us.  Had I ordered the Taj Mahal beer at 7:19p.m. I guarantee you it would've been done before any of the dishes would've touched the table.\n\n2) We ordered at roughly 7:25p.m.  At 7:44p.m. the waitress said our food would be with us shortly (my personal favorite for buying a bit of time). Received our dishes at 7:48p.m.  The wait took far too long.  There was another couple that came in at the same time as us, but instead chose the buffet option, and they were gone before we even had one dish on our table.  \n\nOnce we received the food, we were very pleased.  However, we feel that we probably would've been better off doing the buffet style without the deal from the beginning.\n\nOne note:  If you choose the buffet option, you must order naan through the waiters, you cannot pick that up.\n\nI am definitely going to give this place another try, especially for a chicken tikka masala pizza, which I think would be wonderful.  But the wait today, was a bit too much.", "rating": 4, "date": "2012-01-16"}, {"excerpts": ["The saffron rice came with raisins, something the menu neglected to mention -- I thought it really messed with the flavor of the curry. ", "The garlic naan was soggy and thick. "], "author": "Tiffany W.", "review": "Yikes ...\n\nI can't speak for the restaurant itself, just the food, as I ordered delivery. Star India actually made me lose my appetite. The saffron rice came with raisins, something the menu neglected to mention -- I thought it really messed with the flavor of the curry. The garlic naan was soggy and thick. The chicken tikka malasa and palak paneer were very ordinary.\n\nNot impressed.", "rating": 2, "date": "2013-11-27"}, {"excerpts": ["I'm personally not a spicy fan, and I get the coconut curry (mild) and saffron rice.  ", "I got chicken the first time, but was really disappointed by the taste and quality of the chicken, which is something I've read from some other reviews on here, ", "so I've gone veggie after that.  ", "Overall, this place is great for take-out-- always quick, too!"], "author": "Jess B.", "review": "This has become our go-to Indian place in the Inner Richmond.  Note: I have never eaten in-restaurant, only done take-out.  But from our experience, it's been really good.  The prices are decent because the portions are really big-- I'll usually get a thing of rice, curry dish, and a nan and I will eat half of each and I'm stuffed.  Then I get to have the rest the next day!  I'm personally not a spicy fan, and I get the coconut curry (mild) and saffron rice.  I got chicken the first time, but was really disappointed by the taste and quality of the chicken, which is something I've read from some other reviews on here, so I've gone veggie after that.  Overall, this place is great for take-out-- always quick, too!", "rating": 4, "date": "2013-01-29"}, {"excerpts": ["I ordered Saag Panner, Garlic Naan, Saffron Rice, Papadum and Kheer.  ", "The papadum was delicious and the kheer cool and refreshing.  "], "author": "Carmel U.", "review": "I was really looking forward to a spicy indian meal.  Instead, the food was bland and definitely not as flavorful as other Indian restaurants I've ordered from.\n\nI ordered through delivery.com and remembered enjoying the smells coming from this restaurant whenever I walked by with my dog.  \n\nI ordered Saag Panner, Garlic Naan, Saffron Rice, Papadum and Kheer.  The papadum was delicious and the kheer cool and refreshing.  The rice, naan and saag paneer were a little on the bland side.\n\nI would still give this place another shot.  I'd like to try the meat curries next time - I think I will really enjoy those entrees instead.", "rating": 3, "date": "2011-08-05"}, {"excerpts": ["I highly recommend getting the saffron rice for about a buck more. "], "author": "Diana C.", "review": "My delivery order just arrived, and the food is yummy.  I highly recommend getting the saffron rice for about a buck more. It's delightful - golden raisins and cashews!\n\nI also ordered the navratan korma (veggie korma) as it's one of my favorite Indian dishes aside from chicken tikka masala.  Also very good with a wide variety of veggies.\n\nAnd their mango lassi is yum.\n\nDelivery took a while, almost an hour, but only a little over what I was told on the phone.  It's been faster before.", "rating": 4, "date": "2010-12-21"}, {"excerpts": ["This is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\n", "On occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\n"], "author": "thrasher b.", "review": "I've had very consistent delivery from Star India, which is why I'm giving it 4 stars!\n\nThis is generally what we order:\n\nChili Cheese Naan\nChicken Tandoori\nVegetable Samosa\nSag Paneer\nSaffron Rice\nand one Mango Chutney\n\nAll this is about $30, but it's enough for two meals for two people.\n\nOn occasion, the Chicken Tandoori is better than other times, but overall, no complaints.\n\nIt usually arrives really hot, but that could be because I'm closer to the restaurant than others.\n\nDoubt I'll go to the buffet, because that could change things. For now, the delivery is where it's at!", "rating": 4, "date": "2009-10-08"}, {"excerpts": ["concerning my beloved ethnic food selections, so I tend to order the standards (Palak Paneer, Lamb Curry, Saffron Rice/Basmati, Naan, all great)  ... once or twice it could have used more seasoning.  ", "But  ", "**when you order online", "*"], "author": "Herb C.", "review": "Never been inside this place, keep in mind.  But the delivery was great!  Punctual, professional, proper temperature & packaging ... Pppperfect!\n\nI am notoriously risk averse esp. concerning my beloved ethnic food selections, so I tend to order the standards (Palak Paneer, Lamb Curry, Saffron Rice/Basmati, Naan, all great)  ... once or twice it could have used more seasoning.  But  **when you order online** the \"desired spiciness\" is part of the menu option & never had that problem since.\n\nHaving said that, next time you crave Indian, expand your horizons by trying these:\n\n* Indian Pizza (i hAte badly executed fusion, this was stellar)\n\n* Chili Cheese Bread (if naan had a makeover it would be called)\n\n* Mixed Appetizer Plate (+ a beer and dipping sauces, would have been its own meal, all fried to perfection & delivered in same condition, mMmm)\n\ndisclaimer: actually had to take a 15-20 min. bReak after eating the hot crispy assortment of appetizers -- just so i would be able to fully enjoy the main course. it. was. that. fn. good. oh yeah and the food was still hot.\n\nepilogue: do you have aNy idea how good widmer's apricot hefewiezen is with spicy indian food?  ... goes down niiiiice!", "rating": 4, "date": "2008-12-09"}, {"excerpts": ["The chicken tikka marsala is a good contender to Naan'N'Curry's, but the items I love most are the saffron rice (a great change-up from traditional jasmine rice) and the appetizer sampler, which includes samosas, fried veggies and other goodness. ", "Hopefully one day I will sit down for their all-you-can eat buffet during lunch time!"], "author": "Jenz y.", "review": "Believe it or not, I have never stepped foot in this place - I am basing my review solely on take-out (they deliver to my work). The chicken tikka marsala is a good contender to Naan'N'Curry's, but the items I love most are the saffron rice (a great change-up from traditional jasmine rice) and the appetizer sampler, which includes samosas, fried veggies and other goodness. Hopefully one day I will sit down for their all-you-can eat buffet during lunch time!", "rating": 4, "date": "2007-11-10"}, {"excerpts": ["it's just kind of soggy by the time it gets to my place, so I recommend that you stick with the saffron rice. ", "Other than that, decent Indian delivery for a decent price."], "author": "Suepattra M.", "review": "If I want Indian food and don't want to leave the house, then Star India is the place to call. I dig their Aloo Gobi (the cauliflower is never over-cooked, the potatos are perfect and the spices are just right), and their Chili Chicken is very yummy. I try to love the Naan, but truth be told, through no fault of their own, it's just kind of soggy by the time it gets to my place, so I recommend that you stick with the saffron rice. Other than that, decent Indian delivery for a decent price.", "rating": 3, "date": "2006-09-19"}], "pilau rice": [{"excerpts": ["Pilau rice: basmati rice with peas, tomatoes and spices ($3.50)\n", "This has raisins and nuts. ", "I wish they put that in the description since I literally when through the whole container and picked out all the raisins and nuts. "], "author": "Elena N.", "review": "I've ordered delivery from here a couple of times over the years. This past Friday, I was craving Indian food and decided to give Star India another shot. Since I was by myself, I knew I would only want a curry, naan, samosa and maybe a side of rice. This was one of the only places that has a $20 minimum versus a $25+ min. I ordered via Eat24 since I had a $2 off weekend promo code.\n\nSamosa vegetable ($3.50)\nThe shell was nicely fried, flaky with a little chew. I enjoyed this with the mint dipping sauce.\n\nGarlic naan: garlic leavened bread ($2.25)\nFor me, this could have used a little more garlic, but the naan had a nice chew.\n\nChicken tikka masala: chicken tandoori with herbs and tomato sauce ($10.95)\nGood flavor. The sauce actually got better the next day since it tasted spicier. The chicken was good. I wish the pieces were smaller since it was a little hard to eat with the huge chunks of chicken. The first day, the chicken was good. Slightly dry, but nothing the curry couldn't mask. The next day with reheating, the chicken was so dry! Really hard to eat. No amount of sauce could cover up the dryness. \n\nPilau rice: basmati rice with peas, tomatoes and spices ($3.50)\nThis has raisins and nuts. I wish they put that in the description since I literally when through the whole container and picked out all the raisins and nuts. The rice itself was good and had a nice flavor.\n\nNot sure if I'll order from them again as everything was just okay. But I do like that they have a $20 min. Makes it easy when I'm dining solo!", "rating": 3, "date": "2014-10-12"}, {"excerpts": ["Pilau Rice\n", "The rice was a mushier than I am used to. "], "author": "Mark D.", "review": "Review of delivery from Star India\n\nChicken Vindaloo\nThe sauce was very good. It could probably used a touch more heat but it was a very pleasant mix of spices. However, the chicken itself was dry and a bit tough.\n\nPilau Rice\nThe rice was a mushier than I am used to. It did taste good though.\n\nVegetable Samosa\nThis was very average. Nothing made it stand out and the spice mixture was relatively single toned.\n\nGarlic Naan\n\nThe naan was pretty good. It did not match up to the best of naans I've tried but it was good enough. It was especially good when dipped into the vindaloo sauce.Delivery was prompt, polite, and professional.", "rating": 2, "date": "2011-01-24"}], "plain rice": [{"excerpts": ["SO full having just eaten a little part of one entree, a samosa, and plain rice. \n\n"], "author": "Alex W.", "review": "Really good food, good prices, great and fast service. SO full having just eaten a little part of one entree, a samosa, and plain rice. \n\nThe Lamb Korma was rich and full of soft lamb chunks. You could seriously taste the cashew. Creamy, spicy goodness. \n\nThe Veggie Samosas were perfectly fried and filled with a more interesting potato filling, kinda spicy in a spice way (not just hot) and had some texture. Crunchy and soft. \n\nI ordered through GrubHub and my order arrived about 20 minutes early. So awesome because I ordered at like noon15. The delivery dood was also friendly and confident. \n\nI'm excited to go to work tomorrow because I have leftovers for lunch!!! hahaha!! :D", "rating": 5, "date": "2014-11-05"}, {"excerpts": ["They had chicken tikka masalla, lamb curry, tandoori chicken, a few veggie dishes, daal soup, basic salad, plain rice, plain and herby looking naan and some kind of potato bread that reminded me of the bread you get at Ethiopian restaurants.  ", "They also had samosas and some deep fried veggies and various sauces and dips.  ", "The lamb curry was also very tasty - the lamb itself was quite fatty but for me that only added to the flavor.  ", "Neither dish was particularly spicy but it certainly had enough going on to keep my mouth occupied.  "], "author": "Adam S.", "review": "Most Saturdays, I go for a bike ride into Marin.  My route home brings along Arguello across Geary and many is the time in my post-ride hunger when my nose hairs have prickled at the tasty scents emanating from Star India.\n\nToday, I finally got around to marrying those scents with tastes on my tongue and the experience was pretty good.\n\nThe buffet is in the back, well lit and well labeled so you know exactly what you're getting.  They had chicken tikka masalla, lamb curry, tandoori chicken, a few veggie dishes, daal soup, basic salad, plain rice, plain and herby looking naan and some kind of potato bread that reminded me of the bread you get at Ethiopian restaurants.  They also had samosas and some deep fried veggies and various sauces and dips.  For dessert, they had rice pudding and sweet doughy balls of goodness.\n\nThe samosa were pretty bland - tasty enough but hard to put your finger on exactly what it was you were getting.  Same goes for the potato bread things.  However, the curry dishes were actually pretty good.  I found the chicken tikka masalla to be mild and creamy, just like it should be, with big chunks of decent looking chicken and no bones.  The lamb curry was also very tasty - the lamb itself was quite fatty but for me that only added to the flavor.  Neither dish was particularly spicy but it certainly had enough going on to keep my mouth occupied.  In both cases, there was a high sauce to chicken ratio, but since you are serving yourself it is easy to use the spoon to cherry pick the best chunks of chicken and cut down on some of the sauce.\n\nThe tandoori chicken was a little boney - but I did get to the restaurant after the main lunch rush so perhaps I'd missed all the drumsticks and thighs.   The rice and naan were OK - rice was cooked decently, the naan a little chewy.\n\nJust when I thought I'd eaten enough, I remembered that I'd seen some sweet stuff so I headed back with a little plate to scope it out.  The rice pudding was very good indeed - very creamy tasting and quite decadent.  The sweet doughy balls were also nice and made a good compliment to the rice.  I ended up going back for a little more.\n\nThe place seemed clean, had enough customers to keep the food moving even at 2pm on a weekday and best of all, the things that were supposed to be hot were actually hot - there are few things in this world that I like less than tepid buffet food (yes, I'm talking to you, Lee's Deli - would it kill you to turn up the temp on your food heaters?) and I can happily say that at Star India the temp was definitely hot enough.\n\nFor $8.65 including tax I'll definitely be inclined to stop off next time I am riding past.", "rating": 4, "date": "2007-06-21"}], "star india special biryani": [], "sweet lassi": [], "rose milk": [{"excerpts": ["They ran out of their chai tea unfortunately, but we heard the customers next to us really liking the rose milk. ", "I recommend trying all of the different curries because they all have their own distinct flavors. ", "The service was average. ", "At times I felt rushed to leave. ", "Definitely should not get that feeling at a buffet. \n \n", "This is basically the only Indian food place in the inner Richmond ", "so I shall be back ", ":)"], "author": "Heidi Q.", "review": "Overall impression: The food was average but the price cannot be beat! We went for the $10.99 all you can eat buffet during dinner. \n\nThe chicken tikka masala and complementary naan was my favorite. The rice pudding dessert was great too. They ran out of their chai tea unfortunately, but we heard the customers next to us really liking the rose milk. I recommend trying all of the different curries because they all have their own distinct flavors. The service was average. At times I felt rushed to leave. Definitely should not get that feeling at a buffet. \n \nThis is basically the only Indian food place in the inner Richmond so I shall be back :)", "rating": 3, "date": "2014-11-28"}], "ice tea w lemon": [], "masala tea": [], "chaiindian tea": [], "a vegan mango lassi": [], "ginger ale": [], "raita yogurt": [], "mango ice cream": [{"excerpts": ["Also got a complimentary scoop of mango ice cream with Yelp check-in. ", "Thank you Star India!"], "author": "David W.", "review": "Just had the yellow chicken curry with rice and it was delicious! Also got a complimentary scoop of mango ice cream with Yelp check-in. Thank you Star India!", "rating": 5, "date": "2018-11-07"}, {"excerpts": ["Also if you if check in yelp you get free mango ice cream!"], "author": "Sarah T.", "review": "My first time trying Indian food and it was delicious! Such a good deal too, $10.99 for all you can eat Monday-thurs, it's a little more pricey on the weekends but still a good deal. The customer service was excellent as well, they're very friendly. \nThere was also free chai tea which was delicious. Also if you if check in yelp you get free mango ice cream!", "rating": 5, "date": "2018-08-20"}, {"excerpts": ["Free Mango ice cream ... "], "author": "Sai Raghav P.", "review": "Awesome food and great service. Free Mango ice cream ... yay!\n\nOrdered Palak Paneer, lentil soup and Chilli Chicken.\n\nAll are good!", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["You can also check-in for free mango ice cream, but it doesn't apply if you're choosing to do the buffet option, so keep that in mind! ", ";)"], "author": "Bailey L.", "review": "This place is pretty cheap, I believe it was $10.99 for their buffet. There's about maybe 8 different curry/entree choices(or maybe 10 can't really remember), a salad bar and soup. There is also all you can drink chai! I'm not a super big fan of chai, but if you are, this may be the place for you! \n\nI really enjoyed the butter chicken and their fresh made naan brought out to you on your table. I am not a super huge fan of Indian cuisine, but this place is not bad, especially for the price you're paying. You can also check-in for free mango ice cream, but it doesn't apply if you're choosing to do the buffet option, so keep that in mind! ;)", "rating": 3, "date": "2017-01-22"}, {"excerpts": ["From the chicken tiki marsala to the non-bread and the mango ice cream this place is a sure bet! ", "I am very picky when it comes in the food and this place is awesome. ", "I highly highly highly recommend it. ", "The restaurant is clean and the owners are very friendly. ", "If you haven't been here you must go and see what the fuss is about ", ":)\n", "I promise you won't regret it"], "author": "Emma F.", "review": "Star Indian is the best restaurant ever I have a recommend coming here. I have emailed all over the city and this is by far not only the best tasting with the most affordable my girlfriend and I stumbled upon this place. We fell in love immediately. It's not packed at all and the food is divine. From the chicken tiki marsala to the non-bread and the mango ice cream this place is a sure bet! I am very picky when it comes in the food and this place is awesome. I highly highly highly recommend it. The restaurant is clean and the owners are very friendly. If you haven't been here you must go and see what the fuss is about :)\nI promise you won't regret it", "rating": 5, "date": "2017-11-16"}, {"excerpts": ["Check in for free mango ice cream :)"], "author": "Lily L.", "review": "Friendly staff, food is decent. Complementary chai tea. Check in for free mango ice cream :)", "rating": 4, "date": "2018-02-17"}, {"excerpts": ["Mango Ice Cream:  ", "If you check in on yelp, you get one free mango ice cream!  ", "Unfortunately... my girlfriend and I both \"used\" our mango ice creams and we only ordered one and needed to order one.  ", "The way it tasted was frozen Mango Lassi.  "], "author": "Morris C.", "review": "I went here today with my girlfriend for dinner.  She purchased a living social deal where it was $10 for $20.  By using this deal, we were not able to purchase the buffet  at the rate of $9.99 per person.  We purchased Al a carte.  \n\nOnion naan.:  Bits of onion in the dough and what appears to be garlic and little green specs baked into the naan.  Not bad at all, and it complements the Chicken Tikka Masala very, very nicely.\n\nSaffron Rice: Rice in three different shades of red with raisins, peanuts and cashews.  I must say I was pretty impressed by this Biyani.  However, it did not have a couple more un-edible ingredients that would bring out more flavor to a dish I eat at home called \"dam-bout.\"\n\nChicken Tikka Masala:  The chicken wasn't too dry and the sauce was so good that it made you want to dip everything in it!.\n\nSpinach mesh with Yogurt Pieces: I forgot the actual name of this dish, but I have to say I enjoyed it.  The yogurt had the texture of firm/chewy tofu, and I was very pleased with this dish.\n\nMango Ice Cream:  If you check in on yelp, you get one free mango ice cream!  Unfortunately... my girlfriend and I both \"used\" our mango ice creams and we only ordered one and needed to order one.  The way it tasted was frozen Mango Lassi.  My guess is there is a mango syrup added to a yogurt/milk blend, frozen and then diced into little cubes then served to us.\n\nOverall, I am giving this place a 4 (Though I felt like giving this place a 3 for the majority of the visit due to the wait).  I am a bit upset about two things.  \n\n1) We entered the store at 7:10p.m.  We were seated immediately, but no water/menus were given to us until 7:19p.m.  I saw the waiter and waitress work on bussing the other tables.  One main piece of advice is that you do not have your customers wait for you.  Those tables are less important than us.  Had I ordered the Taj Mahal beer at 7:19p.m. I guarantee you it would've been done before any of the dishes would've touched the table.\n\n2) We ordered at roughly 7:25p.m.  At 7:44p.m. the waitress said our food would be with us shortly (my personal favorite for buying a bit of time). Received our dishes at 7:48p.m.  The wait took far too long.  There was another couple that came in at the same time as us, but instead chose the buffet option, and they were gone before we even had one dish on our table.  \n\nOnce we received the food, we were very pleased.  However, we feel that we probably would've been better off doing the buffet style without the deal from the beginning.\n\nOne note:  If you choose the buffet option, you must order naan through the waiters, you cannot pick that up.\n\nI am definitely going to give this place another try, especially for a chicken tikka masala pizza, which I think would be wonderful.  But the wait today, was a bit too much.", "rating": 4, "date": "2012-01-16"}, {"excerpts": ["\" special of free Mango Ice cream (Homemade)\n-Was ", "and you'll get Homemade Mango Ice cream \n\n\n"], "author": "Tony C.", "review": "Speed walking to Star India....\nBAM!! Smell of Indian food hit me. It was on...\n\n$9.99 All You Can Eat Buffet\n\n\nFood & Drinks-------------------\n+Good Variety\n+Warm\n+Fresh\n+Tasty\n+++Milk Tea\n+++Cold water\n\nService-----------------------------\n+Very Friendly Staff (seemed family owned)\n+Connected with customers on a personal level\n+Refilled water and took away dishes quickly\n+Honored the \"Check-In\" special of free Mango Ice cream (Homemade)\n-Was a little slow on the checkout aspect\n-Ran out of plates for a couple minutes\n-Didn't have the red chicken dish for a good 15 minutes\n\nDecor-------------------------------\n+Lots of nice Indian decor\n+Clean tables and chairs\n\nOverall, my experience was great and will I definitely be back. \nHowever, my way back to my car was the worst part... I guess it was my fault :D\n\n\nTIP: Check in through Yelp on your phone and you'll get Homemade Mango Ice cream \n\n\nEnded my day crawling back to my car from eating so much!", "rating": 5, "date": "2011-12-21"}, {"excerpts": ["The mango ice cream at the end was actually better than it looked, worth trying."], "author": "Daniel F.", "review": "The service here is great and was overall a warm and delightful experience.  The buffet was well maintained and the music was great.  The mango ice cream at the end was actually better than it looked, worth trying.", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["In Deal (Mango Ice Cream) "], "author": "Meg W.", "review": "I've tried Star India twice, once getting the buffet and once à la carte.\n \nYes, the buffet is a great price - $9.99, but the food is lukewarm at best, and you need to give it a good stir to mix in the \"skin\" that forms on top.  There's no naan at the buffet, you'll need to order that separately (and do that right away, bc it can take forever.)  Also, you can't use the Yelp Check-In Deal (Mango Ice Cream) when you get the buffet. \n\nWe had a tastier (and warmer!) meal when we ordered à la carte, everything was delicious, but yeah, your bill will be higher.  \n\nService was off both times we went.  They seem to have an issue with my having a beer.  The first time we went, I needed to point to the beer on the menu- the waiter was either unfamiliar with it, or didn't understand me.  Maybe it's just me, but if you're selling something, know that you are, and recognize the name of it.  It gets better from here... the waiter brought my beer without asking my boyfriend if he wanted a drink, so he ordered a beer when mine was brought to the table.  Umm, the waiter took my beer from me, and gave it to my boyfriend.   This last time we went, I wasn't asked if I wanted to order a drink, the waiter scurried away after my boyfriend ordered his beer.  I gave up.\n\nGetting the bill was another challenge.  The waiter knew we were done, he asked us if we were, then took half our dishes away.  It's frustrating to sit at the table, dirty dishes piled around, watching your waiter BS with the kitchen staff.", "rating": 3, "date": "2012-02-22"}, {"excerpts": ["Their mango ice cream is wonderful.  ", "It's made in-house and is a rather lengthy process.  ", "Try it!"], "author": "Jennifer D.", "review": "This place ain't fancy schmancy but they're pretty darn deeee-licious.\n\nTheir buffet doesn't have a gazillion dishes so don't expect much in selection.  However, they do prepare their food with love.  Everything was pretty tasty and the staff were all very friendly.  \n\nTheir mango ice cream is wonderful.  It's made in-house and is a rather lengthy process.  Try it!", "rating": 4, "date": "2012-02-27"}, {"excerpts": ["Kids were on an ice cream craving so Jeet to the rescue with a separate serving of mango ice cream.  ", "Good food, great service and value.  ", "Thanks!"], "author": "Jeni C.", "review": "We had Mani as our waiter.  He was really friendly and attentive.  Kid friendly!  Kids were on an ice cream craving so Jeet to the rescue with a separate serving of mango ice cream.  Good food, great service and value.  Thanks!", "rating": 5, "date": "2015-01-08"}, {"excerpts": ["Always yummy lots of veggie dishes, checked in and got delicious free mango ice cream! ", "We come here all the time"], "author": "Deb R.", "review": "Always yummy lots of veggie dishes, checked in and got delicious free mango ice cream! We come here all the time", "rating": 4, "date": "2015-01-17"}, {"excerpts": ["Free Chai tea, and their Mango ice cream is AMAZING.  ", "It's homemade and INCREDIBLE.  ", "Right now it's free with Yelp check in.  ", "But even if it wasn't I'd pay for it in a heartbeat."], "author": "Johnny J.", "review": "I went there for their lunch buffet 5 years ago and thought wow it's a really good deal for $9.99.  Went back for dinner and thought, wow it's really cheap, it's still $9.99.  \n\nAnd to my amazement the food is still good, and it's still only 10 bucks for dinner 5 years later.  I love this place.  The food quality is above average, good service.  Warm naan bread to your table even with the buffet.  Free Chai tea, and their Mango ice cream is AMAZING.  It's homemade and INCREDIBLE.  Right now it's free with Yelp check in.  But even if it wasn't I'd pay for it in a heartbeat.", "rating": 4, "date": "2012-07-16"}, {"excerpts": ["The lady hostess was also very nice and courteous, and the free mango ice cream (with yelp check-in) was delicious. ", "It's close to where I live, so I'd come back again for convenience and location, although I prefer more variety in the buffet."], "author": "Angela W.", "review": "3.5 stars\nThey have a relatively limited lunch buffet selection, but what they have tastes good to me at a good price! The lady hostess was also very nice and courteous, and the free mango ice cream (with yelp check-in) was delicious. It's close to where I live, so I'd come back again for convenience and location, although I prefer more variety in the buffet.", "rating": 4, "date": "2012-03-14"}, {"excerpts": ["Mango ice cream is unbelievable!"], "author": "Tatiana G.", "review": "Love it! Such a great place with yummy food and friendly staff. Try buffet.Definitely come here for a delicious Indian cuisine. \nMango ice cream is unbelievable!", "rating": 5, "date": "2012-02-18"}, {"excerpts": ["If you check in on yelp, they will give you free mango ice cream! ", "It comes in cubes and it a bit icier than regular ice cream...delicious."], "author": "June Q.", "review": "Their buffet is very tasty! There is a lot of variety in what they serve and the naan is freshly made to order. I had a delicious lunch there and was very stuffed. They also have my favorite dessert there- the rice pudding. If you check in on yelp, they will give you free mango ice cream! It comes in cubes and it a bit icier than regular ice cream...delicious.", "rating": 4, "date": "2012-03-01"}, {"excerpts": ["We got takeout and yelp won us a free mango ice cream and also a discount.  ", "This place has huge takeout portions and lots of good spicy food for a decent price.  ", "Great for takeout at least!"], "author": "Akshai B.", "review": "This is a great inexpensive indian restaurant!  We got takeout and yelp won us a free mango ice cream and also a discount.  This place has huge takeout portions and lots of good spicy food for a decent price.  Great for takeout at least!", "rating": 5, "date": "2011-06-20"}], "rasmali": [], "tandoori chicken pizza": [{"excerpts": ["this place was recommend by a friend's friend--so they absolutely told us we had to try the tandoori chicken pizza.\n\n"], "author": "Aleli L.", "review": "this place was recommend by a friend's friend--so they absolutely told us we had to try the tandoori chicken pizza.\n\nso we ordered take out--the pizza was really really good!  it almost tasted like a healthy pizza because there wasn't a gang of cheese on it that adds to the greasiness like other pizzas do. we didn't order anything else.  \n\nFood: really good--but i'm only basing it on the tandoori pizza.\n\noh, btw--reading the previous yelper Doble V. i am very picky about eating in certain restaurants due to possible health risks that may be encountered (i.e. are the cooks notwashing their hands as frequently as they should?--most common food borne illness) i know first hand, so i guess i'll wait and hope for the best...", "rating": 3, "date": "2007-09-22"}, {"excerpts": ["Buffet for dinner not just lunch and the Tandoori Chicken pizza is amazing.  ", "If you love Indian food you will love this place."], "author": "Rick R.", "review": "Love it, love it, love it.  Buffet for dinner not just lunch and the Tandoori Chicken pizza is amazing.  If you love Indian food you will love this place.", "rating": 4, "date": "2009-04-10"}], "vegan pizza": [], "vegetarian menu for two": [], "nonvegetarian menu for two": [], "paneer tikka masala": [{"excerpts": ["My friends really liked the buffet and I liked the paneer tikka masala very much.  ", "The staff was very friendly and made sure we never ran out of water or naan. ", "The paneer was a little on the spicy side but definately good and the prices were reasonable."], "author": "Heidi D.", "review": "Excellent food and service. My friends really liked the buffet and I liked the paneer tikka masala very much.  The staff was very friendly and made sure we never ran out of water or naan. The paneer was a little on the spicy side but definately good and the prices were reasonable.", "rating": 4, "date": "2013-09-10"}, {"excerpts": ["Tonight we ordered as we usually do, Nvratan Korma and Paneer Tikka Masala. ", "OMG DISGUSTING. ", "Not only did they raise their prices (understandable I suppose with the state of our economy), but the curry sauces were so extremely watered down "], "author": "Risa R.", "review": "Had I written this review before I received my delivery order tonight, I would have given 4 stars. I've never actually eaten in the restaurant, only ordered through delivery and my entire family used to love this place.  Tonight we ordered as we usually do, Nvratan Korma and Paneer Tikka Masala. OMG DISGUSTING. Not only did they raise their prices (understandable I suppose with the state of our economy), but the curry sauces were so extremely watered down I felt like I was eating vegetables in nothing more than mildly seasoned coconut milk. \n\nDid they change cooks? Normally their food is awesome, but I will NEVER order for delivery from there again. Indian food tends to be a bit on the expensive side. And I just wasted $40 on dinner for my mom and I. \n\nThe only redeeming quality they have is a buffet for $8.95 That I MAY try in the future because not everything can be that bad and I'd rather potentially waste $8.95 than $40. Im in search of a new indian restaurant...", "rating": 2, "date": "2008-08-29"}], "paneer chili": [], "paneer korma": [], "malai kofta": [{"excerpts": ["The chicken tikka masala and malai kofta were basically water with some coloring. ", "Absolutely no flavor and the chicken in the tikka masala was incredibly dry. ", "Samosas were undercooked and a little doughy still, but were edible. "], "author": "Colleen M.", "review": "Note to self: NEVER ORDER FROM HERE AGAIN. The chicken tikka masala and malai kofta were basically water with some coloring. Absolutely no flavor and the chicken in the tikka masala was incredibly dry. Samosas were undercooked and a little doughy still, but were edible. Chili cheese naan was amazing and delicious, as always, but kind of a waste without anything else delicious to eat with it.\n\nWe've ordered from here a bunch of times and it's usually really good, but this is just ridiculous. They obviously took too many orders before close and their solution was to water everything down rather than reach out to customers to say they didn't have enough. Completely unacceptable.", "rating": 1, "date": "2017-07-02"}, {"excerpts": ["i take off a star because their navratan korma is not the tastiest i've had and they don't have malai kofta on the menu."], "author": "tasha h.", "review": "pretty decent indian delivery food and  you can order online. favorite dishes: chicken tikka masala, saag paneer, bengun bertha (or however you spell it), garlic naan.  i take off a star because their navratan korma is not the tastiest i've had and they don't have malai kofta on the menu.", "rating": 4, "date": "2007-11-09"}], "paneer tikka kabob": [], "paneer shahi": [], "paneer bhurji": [], "chicken lemon": [], "methi chicken": []}