{"cool lime starbucks refreshers tm beverage": [], "valencia orange starbucks refreshers tm beverage": [], "very berry hibiscus starbucks refreshers tm beverage": [], "evolution fresh tm defense up": [], "evolution fresh tm orange juice": [], "evolution fresh tm organic ginger limeade": [], "evolution fresh tm sweet greens and lemon": [], "iced coffee with milk": [], "iced espresso classics  vanilla latte": [], "iced espresso classics  caffe mocha": [], "iced espresso classics  caramel macchiato": [], "starbucks caramel iced coffee": [], "starbucks iced coffeemilk": [], "starbucks low calorie iced coffeemilk": [], "starbucks vanilla iced coffee": [], "shaken sweet tea": [], "shaken sweet tea lemonade": [], "tazo bottled berry blossom white": [], "tazo bottled black mango": [], "tazo bottled black with lemon": [], "tazo bottled brambleberry": [], "tazo bottled giant peach": [], "tazo bottled iced passion": [], "tazo bottled lemon ginger": [], "tazo bottled organic black lemonade": [], "tazo bottled organic iced black tea": [], "tazo bottled organic iced green tea": [], "tazo bottled plum pomegranate": [], "tazo bottled tazoberry": [], "tazo bottled white cranberry": [], "teavana shaken iced black tea": [], "teavana shaken iced black tea lemonade": [], "teavana shaken iced green tea": [], "teavana shaken iced green tea lemonade": [], "teavana shaken iced passion tango tm tea": [], "teavana shaken iced passion tango tm tea lemonade": [], "teavana shaken iced peach green tea": [], "iced espresso classics  skinny caramel macchiato": [], "iced espresso classics  skinny vanilla latte": [], "starbucks doubleshot energy coffee drink": [], "starbucks doubleshot energy hazelnut drink": [], "starbucks doubleshot energy mocha drink": [], "starbucks doubleshot energy vanilla drink": [], "starbucks doubleshot energy vanilla light drink": [], "starbucks doubleshot energy white chocolate drink": [], "starbucks doubleshot espresso drink": [], "starbucks doubleshot light espresso drink": [], "starbucks refreshers tm raspberry pomegranate": [], "starbucks bottled caramel frappuccino coffee drink": [], "starbucks bottled coffee frappuccino coffee drink": [], "starbucks bottled mocha frappuccino coffee drink": [], "starbucks bottled mocha light frappuccino coffee drink": [], "starbucks bottled vanilla frappuccino coffee drink": [], "starbucks bottled vanilla light frappuccino coffee drink": [], "starbucks doubleshot protein coffee": [], "starbucks doubleshot protein dark chocolate": [], "starbucks doubleshot protein vanilla": [], "starbucks iced coffee caramel": [], "starbucks iced coffee light sweetened": [], "starbucks iced coffee unsweetened": [], "blonde roast": [], "caff misto": [], "cold brew coffee": [], "featured dark roast": [], "hot chocolate": [{"excerpts": ["They are consistently out of items (hot chocolate, muffins, breakfast items, etc.) ", "and sometimes they don't have enough employees to accommodate the morning, afternoon, or evening rush. ", "Helo?!? ", "Stop wasting your money away on opening up new locations ", "(I'm sure 15,012 in 44 countries ", "*", "*thanks Wikipedia"], "author": "Carloalexi M.", "review": "Ah.. the famous Starbucks empire. They've grown from that wee lil unassuming coffee shop in Seattle, WA to a global conglomerate. I heard they've done collaborated with music recording artists and have gone out to produce their own record label. Fact or myth? \n\nI've been a faithful Starbucks fan for a good 7+ years. I went through a phase when my all-time choice of beverage was the Grande Caramel Frappucino. Now, I've grown up... a whole 2 waist sizes bigger (JK), and I've moved up the into the \"adult drinks.\" I like to pride myself on the fact that I NO LONGER get the girly drinks like Strawberry Frap, but have now embraced more mature, manlier drinks: Americano, double espresso. Though I do like my occasional White Choco Mocha (and it's seasonal kin: Peppermint White Choco Mocha), I stick to my adult drinks to keep me awake while I slave away in my adult job. \n\nI would rate this location a 4 or higher, but the employees keep me from doing it. They are consistently out of items (hot chocolate, muffins, breakfast items, etc.) and sometimes they don't have enough employees to accommodate the morning, afternoon, or evening rush. Helo?!? Stop wasting your money away on opening up new locations (I'm sure 15,012 in 44 countries **thanks Wikipedia** will be enough for now) and start focusing on your CURRENT stores!\n\nBottom line: Starbucks does a good job to suck you in and get you to spend $4/beverage, only to find you getting into your gas-guzzling luxury sports car, and complain about $3 gas prices. Look buddy, you just spent $4 on a damn 16 oz cup of sugar-laden toxic death! LOL. Save me from my sugar high and hand me my insulin please...", "rating": 3, "date": "2009-01-05"}, {"excerpts": ["but I can't wait 10 minutes waiting for my hot chocolate.\n\n", "When finally they get it right, I love my extra hot, hot chocolate with no whipped cream ", "but ... ", "damn... ", "I struggled to get it."], "author": "Marc L.", "review": "I went to a lot of starbucks in the city and this one is by far the worst I tried.\n\n- They are really slow and they don't care\n- They are disorganized and they don't care\n- They don't understand the fact that I don't want whipped cream\n\nIt's a really crowded Starbucks on New Montgomery St in the heart of SOMA. I understand it but I can't wait 10 minutes waiting for my hot chocolate.\n\nWhen finally they get it right, I love my extra hot, hot chocolate with no whipped cream but ... damn... I struggled to get it.", "rating": 3, "date": "2009-03-22"}, {"excerpts": ["All we ordered was a kid's hot chocolate with no special requests, but I guess it was too much to ask???"], "author": "Mae S.", "review": "Let me preface my complaint of this Starbucks' customer service by noting that we moved to the Bay Area a couple years ago from NYC. And most people know the reputation NYC has for 'customer service.'\nMy 4 yr old loves Starbucks. Always friendly, always delicious (at least the ones in our neighborhood). But this location really threw her for a loop (me as well). We were staying at the Palace Hotel because my husband was attending an Orthopaedic conference. In the 2 1/2 days we stayed we visited three times. The place was definitely busy, most of the customers seemed to be surgeons at the conference with us. I didn't see any customers upset with the wait time and they all seemed happy to be at Starbucks, but for some reason the employees gave the impression that they were completely annoyed with our presence. Perhaps the place is usually empty and quiet? Not only were they annoyed, as I sat there with my girls we could see a lot of snickering and inside joking. They had a \"this job would be great if it weren't for having to help customers\" attitude. No friendly greeting or smiles, just \"What can I get you?\" And the sad part is it wasn't the same person who was unfriendly each time we came in, it was all of them. \nI've never seen so many employees in the customer service industry who clearly have a disdain for serving customers. Even my 4-yr old asked why they were so 'mad' there. I noticed a few 5 star reviews noting friendly baristas, but I can only assume those employees have since moved on.\nNext time we'll look for a different location, even if it means walking a few extra blocks. I hate that we left feeling like we just asked for way too much. All we ordered was a kid's hot chocolate with no special requests, but I guess it was too much to ask???", "rating": 1, "date": "2012-02-14"}], "peppermint hot chocolate": [], "salted caramel hot chocolate": [], "caff americano": [], "caff latte": [], "caff mocha": [], "cappuccino": [{"excerpts": ["I got a good cup of cappuccino, so I probably will be back for future afternoon coffee and tea."], "author": "Steven M.", "review": "This Starbucks is more comfortable to hang out compared to the one near Metreon.  I got a good cup of cappuccino, so I probably will be back for future afternoon coffee and tea.", "rating": 3, "date": "2011-08-16"}, {"excerpts": ["However, have they realized how bad their cappuccino is? "], "author": "Sooj O.", "review": "The only reason that people should buy coffee at Starbucks in San Francisco is because Starbucks is the closest place to get your morning caffeine rush.  \n\nI am not on the anti-globalization/anti-Starbucks bandwagon (although I think there are many ways in which globalization should be reconceptualized, I also don't think that Starbucks is the worst corporation on earth... there's stiff competition for that).\n\nBut I am a genuine coffee lover, and hands down, Peets wins.  (Yes, Ritual is better than Peets, of course... but when you are working in SOMA, you have Peets or Starbucks).  \n\nStarbucks is making some efforts.  Recently, there was an article about Starbucks finally realizing how bad their food is and deciding to add new food items (there is nothing more deceptive than a Starbucks pastry...looking so yummy and buttery, yet in actuality tasting oh so dry).  \n\nHowever, have they realized how bad their cappuccino is? Or their latte?  \n\nMost days, I go to Peets (Ritual is reserved for the weekends).  However, there are the random days when I am stuck in a town without a Peets.  I am looking forward to the day when I can find Peets in any town.  In the meantime, I will continue to go to Starbucks when I have to, all the while wishing there was a Peets closer by.", "rating": 2, "date": "2007-01-21"}], "caramel flan latte": [], "caramel macchiato": [{"excerpts": ["The coupon states, \"Indulge in a free tall hazelnut or caramel Macchiato. ", "Our special treat just for you.", "\" ", "Liees.... "], "author": "Christopher S.", "review": "They didn't accept my Starbucks coupon. :( The coupon states, \"Indulge in a free tall hazelnut or caramel Macchiato. Our special treat just for you.\" Liees.... No where on the coupon states this can't be used. \n\nBaristas weren't rude about it or anything, but still an over poor experience for me trying to get a \"special treat\"", "rating": 1, "date": "2013-03-13"}, {"excerpts": ["The drink order was simple enough, a tall caramel macchiato. ", "The first error was made when a short cup was grabbed. ", "She called it out as a tall drink.\n", "Now, I am really understanding, and I honestly don't care if you mess up a little on my drink. ", "I told her, \"Oops, I ordered a tall. ", "Don't worry about it, just put it in a tall cup, add a little more milk ", "and it's fine.", "\"\n", "She replied by dumping it out. ", "\"", "No, I have to start over.", "\"\n", "I wasn't in a huge hurry, but I did have to meet up with someone. ", "My boyfriend, who has unlimited patience, was looking at his watch. ", "This was due to the fact that she had now made the milk and shots, and was letting them both sit separately as she made other people's drinks. ", "Then she poured the now dead shots into the foam and covered it with caramel. ", "She proceeded to make other people's drinks before she finally put the lid on it and hand it out to me. ", "It was in-your-face RUDE! ", "To be honest, I didn't want her to make my drink again. "], "author": "Chelsea P.", "review": "I'm the kind of person who will repeatedly go back somewhere, even if I had a bad experience a couple of times. I used to work at Starbucks for 3 years so I have a general idea of what the baristas should treat you like. I also attend AAU right across the street, which was the only reason why I would go here. I have to say, they have a great location ... and that's about it.\nI would GLADLY walk all the way to the 3rd and Market street Starbucks to get away from this horrible service. Not only have I had people roll their eyes because my drink was not what I asked for (eg. green tea when I asked for black, or short instead of tall) but I have also had the misfortune of them being blatantly rude and making my drink poorly because I politely asked for my correct drink.\n\nThe day that I finally decided not to go there again was in May and I have not gone there since. I figure it's about time I told you all why.\nThe drink order was simple enough, a tall caramel macchiato. The first error was made when a short cup was grabbed. She called it out as a tall drink.\nNow, I am really understanding, and I honestly don't care if you mess up a little on my drink. I told her, \"Oops, I ordered a tall. Don't worry about it, just put it in a tall cup, add a little more milk and it's fine.\"\nShe replied by dumping it out. \"No, I have to start over.\"\nI wasn't in a huge hurry, but I did have to meet up with someone. My boyfriend, who has unlimited patience, was looking at his watch. This was due to the fact that she had now made the milk and shots, and was letting them both sit separately as she made other people's drinks. Then she poured the now dead shots into the foam and covered it with caramel. She proceeded to make other people's drinks before she finally put the lid on it and hand it out to me. It was in-your-face RUDE! To be honest, I didn't want her to make my drink again. I threw it out after we left.\n\nThe most irritating part was that she was so angry at me the entire time and was not talkative, smiling, or polite. She was glaring the whole time. ?!?! WHY?? Certainly it couldn't have been due to me asking for my real drink!?\n\nI have had the WORST service here of ANY Starbucks. I have had men here scoff at me for asking for the syrup that was supposed to be in my drink, people getting irritated at me when they give me the WRONG pastry, and dead shots WHICH CAN BE PREVENTED IF YOU GET THEM IN THE MILK BEFORE 11 SECONDS IS UP!! I always try to say PLEASE and THANK YOU, even though more than half the time I get a grunt in return.\n\nI am not asking for the baristas to be perfect, because I certainly am not. All I would like is when someone is being polite, just be polite back.", "rating": 1, "date": "2011-09-06"}], "cinnamon dolce latte": [], "espresso": [{"excerpts": ["This is my go to Starbucks when I'm craving a Holiday drinks and the more mundane espresso drinks at the office just aren't cutting it. ", "The baristas here are really nice, and the one time my pick up order was done incorrectly, I didn't notice until I returned to the office. ", "When I did bring it back they were exceptionally nice about it! ", "And quickly made me a new one."], "author": "Tiffany K.", "review": "This is my go to Starbucks when I'm craving a Holiday drinks and the more mundane espresso drinks at the office just aren't cutting it. The baristas here are really nice, and the one time my pick up order was done incorrectly, I didn't notice until I returned to the office. When I did bring it back they were exceptionally nice about it! And quickly made me a new one.", "rating": 5, "date": "2017-02-10"}, {"excerpts": ["Americano, double espresso. "], "author": "Carloalexi M.", "review": "Ah.. the famous Starbucks empire. They've grown from that wee lil unassuming coffee shop in Seattle, WA to a global conglomerate. I heard they've done collaborated with music recording artists and have gone out to produce their own record label. Fact or myth? \n\nI've been a faithful Starbucks fan for a good 7+ years. I went through a phase when my all-time choice of beverage was the Grande Caramel Frappucino. Now, I've grown up... a whole 2 waist sizes bigger (JK), and I've moved up the into the \"adult drinks.\" I like to pride myself on the fact that I NO LONGER get the girly drinks like Strawberry Frap, but have now embraced more mature, manlier drinks: Americano, double espresso. Though I do like my occasional White Choco Mocha (and it's seasonal kin: Peppermint White Choco Mocha), I stick to my adult drinks to keep me awake while I slave away in my adult job. \n\nI would rate this location a 4 or higher, but the employees keep me from doing it. They are consistently out of items (hot chocolate, muffins, breakfast items, etc.) and sometimes they don't have enough employees to accommodate the morning, afternoon, or evening rush. Helo?!? Stop wasting your money away on opening up new locations (I'm sure 15,012 in 44 countries **thanks Wikipedia** will be enough for now) and start focusing on your CURRENT stores!\n\nBottom line: Starbucks does a good job to suck you in and get you to spend $4/beverage, only to find you getting into your gas-guzzling luxury sports car, and complain about $3 gas prices. Look buddy, you just spent $4 on a damn 16 oz cup of sugar-laden toxic death! LOL. Save me from my sugar high and hand me my insulin please...", "rating": 3, "date": "2009-01-05"}, {"excerpts": ["6:55pm right as they're closing and despite the chairs being on the tables and people ready to go home, they're always very nice and helpful without being at all annoyed that i'm often running in at the last minute and asking for my espresso as their last customer."], "author": "lisa w.", "review": "i always make it in here at 6:55pm right as they're closing and despite the chairs being on the tables and people ready to go home, they're always very nice and helpful without being at all annoyed that i'm often running in at the last minute and asking for my espresso as their last customer.", "rating": 5, "date": "2007-01-23"}], "espresso con panna": [], "espresso macchiato": [], "flat white": [{"excerpts": ["Get a quad flat white (or even just a regular), and you will feel like you're superman/woman for the remainder of the day. ", "Sure, it's a major chain ", "and yeah, it's Starbucks, but the staff here are super friendly and fast, and can brighten your morning, even the toughest ones like Mondays. ", "Super convenient loc as well, and right outside the doorstep of the Palace Hotel."], "author": "Alison A.", "review": "This location can whip up a drink during the morning rush like nobody's biz. Feeling sleepy?  Get a quad flat white (or even just a regular), and you will feel like you're superman/woman for the remainder of the day. Sure, it's a major chain and yeah, it's Starbucks, but the staff here are super friendly and fast, and can brighten your morning, even the toughest ones like Mondays. Super convenient loc as well, and right outside the doorstep of the Palace Hotel.", "rating": 3, "date": "2015-09-07"}, {"excerpts": ["I've been visiting for the past week, because I had a gift card to use up and I like their new \"flat white\" beverage (even though they still don't have almond milk).  \n\n"], "author": "Felicia P.", "review": "Cute location, but awful customer service. (Unless, of course, you are a young blonde.) The young brown-haired male that worked on V-day yesterday had the nerve to argue with me about how \"I\" want my drink. First he told me to read the sign, then he said, aloud, but to a co-worker, \"She can't read.\" Of course, I asked him if he was talking about me. Of course, he shut right up.\n\nI stopped frequenting Starbucks several years ago, because their coffee is too bitter and they are too big of a monopoly here in the Bay Area. I've been visiting for the past week, because I had a gift card to use up and I like their new \"flat white\" beverage (even though they still don't have almond milk).  \n\nBye, again, Sbux.", "rating": 1, "date": "2015-02-15"}], "flavored latte": [{"excerpts": ["It was BOGO for their holiday drinks and I got the chestnut flavored latte. ", "The barista was friendly and quick with service. ", "The place just went through a renovation and is a bit more spacious, with lots of window counters for you to write your blogs or just chat. ", "Not a bad place to hang out in SOMA if you're waiting for someone."], "author": "William H.", "review": "Pass by this everyday but finally went in to get a latte with a friend. It was BOGO for their holiday drinks and I got the chestnut flavored latte. The barista was friendly and quick with service. The place just went through a renovation and is a bit more spacious, with lots of window counters for you to write your blogs or just chat. Not a bad place to hang out in SOMA if you're waiting for someone.", "rating": 3, "date": "2014-11-15"}], "iced caff americano": [], "iced caff latte": [], "iced caff mocha": [], "iced caramel macchiato": [], "iced cinnamon dolce latte": [], "iced flat white": [], "iced flavored latte": [], "iced skinny flavored latte": [], "iced skinny mocha": [], "iced tiramisu latte": [], "iced vanilla latte": [], "iced vanilla spice latte": [], "iced white chocolate mocha": [], "skinny flavored latte": [], "skinny mocha": [], "skinny peppermint mocha": [], "tiramisu latte": [], "vanilla latte": [], "white chocolate mocha": [], "caff vanilla frappuccino blended coffee": [], "caff vanilla light frappuccino blended coffee": [], "caramel frappuccino blended coffee": [], "caramel light frappuccino blended coffee": [], "caramel ribbon crunch crme frappuccino blended crme": [], "caramel ribbon crunch frappuccino blended coffee": [], "cinnamon dolce frappuccino blended coffee": [], "cinnamon dolce light frappuccino blended coffee": [], "classic chai crme frappuccino blended crme": [], "coffee frappuccino blended coffee": [], "coffee light frappuccino blended coffee": [], "double chocolaty chip crme frappuccino blended crme": [], "espresso frappuccino blended coffee": [], "green tea crme frappuccino blended crme": [], "hazelnut frappuccino blended coffee": [], "java chip frappuccino blended coffee": [], "java chip light frappuccino blended coffee": [], "mini smores frappuccino blended coffee": [], "mini smores frappuccino blended crme": [], "mocha frappuccino blended coffee": [], "mocha light frappuccino blended coffee": [], "smores frappuccino blended coffee": [], "smores frappuccino blended crme": [], "strawberries  crme frappuccino blended crme": [], "toffee mocha frappuccino blended coffee": [], "toffee mocha light frappuccino blended coffee": [], "vanilla bean crme frappuccino blended crme": [], "white chocolate mocha frappuccino blended coffee": [], "flavored steamed milk": [], "chocolate smoothie": [], "evolution fresh tm mango carrot smoothie": [], "evolution fresh tm strawberry smoothie": [], "evolution fresh tm sweet greens smoothie": [], "orange mango smoothie": [], "strawberry smoothie": [], "golden ginger ale fizzio tm handcrafted soda": [], "lemon ale fizzio tm handcrafted soda": [], "spiced root beer fizziotm handcrafted soda": []}