{"cool lime starbucks refreshers tm beverage": [], "valencia orange starbucks refreshers tm beverage": [], "very berry hibiscus starbucks refreshers tm beverage": [], "evolution fresh tm defense up": [], "evolution fresh tm orange juice": [], "evolution fresh tm organic ginger limeade": [], "evolution fresh tm sweet greens and lemon": [], "iced coffee": [{"excerpts": ["We waited 15 minutes for an iced coffee, which should take about 30 seconds because it's all pre-made.  ", "There were a couple of unhappy, uncaffeinated folks in front of us, but I wasn't that upset because at least the coffee was consistent, and the bathroom was open."], "author": "Thu P.", "review": "Terrible Starbucks. It's next to Union Square, so it's very packed with tourists tryna get their caffeine fix. We waited 15 minutes for an iced coffee, which should take about 30 seconds because it's all pre-made.  There were a couple of unhappy, uncaffeinated folks in front of us, but I wasn't that upset because at least the coffee was consistent, and the bathroom was open.", "rating": 3, "date": "2018-06-25"}, {"excerpts": ["I was expecting a little too much for the drink because it tastes just like regular iced coffee with that strong coffee taste and a slight hint of chestnut in there. ", "Overall it was pretty good just that they put way too much ice."], "author": "Lisa W.", "review": "Their service are always ehh especially when it comes to the holiday seasons everyone just wants their drinks. It's always hectic for the workers so I understand if they're moody or what not. Came in to try their chestnut praline latte which is a holiday drink and if I don't get it now then I'll have to wait till next year. I wanted to try the iced version because I would usually get it warm so I got the iced version. I love when the barista/cashier asks if you want whip cream cuz I forget to say no whip cream at times here and there. They took a while to make my drink cuz the place was packed with thirsty folks. I was expecting a little too much for the drink because it tastes just like regular iced coffee with that strong coffee taste and a slight hint of chestnut in there. Overall it was pretty good just that they put way too much ice.", "rating": 3, "date": "2015-12-31"}, {"excerpts": ["Today I ordered an iced coffee and breakfast sandwich. ", "I came in ten minutes later and they hadn't even started my order. ", "I had to tell them that I did a mobile order, which they seemed oblivious to. ", "Once they started my order 12 minutes later, they were sold out of the sandwich I ordered. ", "I will never go here again. ", "Save yourself the headache and go somewhere else."], "author": "Mary S.", "review": "I have worked very close to this Starbucks for over a year and I can say that without a doubt it is the worst Starbucks I've ever been to. The baristas don't pay attention to detail and do not work with a sense of urgency. Because of this, I only mobile order and make sure to leave a ten minute window to account for their slow service. Today I ordered an iced coffee and breakfast sandwich. I came in ten minutes later and they hadn't even started my order. I had to tell them that I did a mobile order, which they seemed oblivious to. Once they started my order 12 minutes later, they were sold out of the sandwich I ordered. I will never go here again. Save yourself the headache and go somewhere else.", "rating": 1, "date": "2017-03-02"}, {"excerpts": ["What part of Tall Sweetened Iced Coffee do the baristas not understand at this Starbucks? ", "I sympathize that it can get busy  and a lot of them are rude tourists (I work in the area), but I'm not one of them ", "and I never EVER am rude to people who prepare my food for karmic reasons. ", "However at this particular Starbucks, no matter your demeanor the end result is the same: f*cked up drinks. ", "I admit there are a few diamonds in the rough at this Starbucks- ", "but they're drowned out by the rest of the douche bags (and that includes the girls that work there)."], "author": "Manny V.", "review": "What part of Tall Sweetened Iced Coffee do the baristas not understand at this Starbucks? I sympathize that it can get busy  and a lot of them are rude tourists (I work in the area), but I'm not one of them and I never EVER am rude to people who prepare my food for karmic reasons. However at this particular Starbucks, no matter your demeanor the end result is the same: f*cked up drinks. I admit there are a few diamonds in the rough at this Starbucks- but they're drowned out by the rest of the douche bags (and that includes the girls that work there).", "rating": 1, "date": "2009-03-10"}], "iced coffee with milk": [], "iced espresso classics  vanilla latte": [], "iced espresso classics  caffe mocha": [], "iced espresso classics  caramel macchiato": [], "starbucks caramel iced coffee": [], "starbucks iced coffeemilk": [], "starbucks low calorie iced coffeemilk": [], "starbucks vanilla iced coffee": [], "shaken sweet tea": [], "shaken sweet tea lemonade": [], "tazo bottled berry blossom white": [], "tazo bottled black mango": [], "tazo bottled black with lemon": [], "tazo bottled brambleberry": [], "tazo bottled giant peach": [], "tazo bottled iced passion": [], "tazo bottled lemon ginger": [], "tazo bottled organic black lemonade": [], "tazo bottled organic iced black tea": [], "tazo bottled organic iced green tea": [], "tazo bottled plum pomegranate": [], "tazo bottled tazoberry": [], "tazo bottled white cranberry": [], "teavana shaken iced black tea": [], "teavana shaken iced black tea lemonade": [], "teavana shaken iced green tea": [], "teavana shaken iced green tea lemonade": [], "teavana shaken iced passion tango tm tea": [], "teavana shaken iced passion tango tm tea lemonade": [], "teavana shaken iced peach green tea": [], "iced espresso classics  skinny caramel macchiato": [], "iced espresso classics  skinny vanilla latte": [], "starbucks doubleshot energy coffee drink": [], "starbucks doubleshot energy hazelnut drink": [], "starbucks doubleshot energy mocha drink": [], "starbucks doubleshot energy vanilla drink": [], "starbucks doubleshot energy vanilla light drink": [], "starbucks doubleshot energy white chocolate drink": [], "starbucks doubleshot espresso drink": [], "starbucks doubleshot light espresso drink": [], "starbucks refreshers tm raspberry pomegranate": [], "starbucks bottled caramel frappuccino coffee drink": [], "starbucks bottled coffee frappuccino coffee drink": [], "starbucks bottled mocha frappuccino coffee drink": [], "starbucks bottled mocha light frappuccino coffee drink": [], "starbucks bottled vanilla frappuccino coffee drink": [], "starbucks bottled vanilla light frappuccino coffee drink": [], "starbucks doubleshot protein coffee": [], "starbucks doubleshot protein dark chocolate": [], "starbucks doubleshot protein vanilla": [], "starbucks iced coffee caramel": [], "starbucks iced coffee light sweetened": [], "starbucks iced coffee unsweetened": [], "blonde roast": [], "caff misto": [], "clover brewed coffee": [{"excerpts": ["Twice now my order for a Clover brewed coffee has been forgotten. ", "This second occasion I timed it. ", "After the order was placed, 5 minutes elapsed before I tried bringing to their attention ", "no one had so much as motioned toward the Clover machine. ", "No one budged. ", "I tried getting someone's attention. ", "To no avail. ", "So I got in line all the whole keeping my eye on the machine. ", "No one so much as looked at it during my entire second trip through the queue. ", "Finally reaching the register, I asked if it was working. ", "He checked. '", "Yes. ", "It works. ", "Why?' ", "It was then ", "I explained I had waited for my Clover brewed coffee ", "and it had not been started yet. ", "I had to proceed to explain what bean I wanted. ", "I ordered it the same time, clearly, in English even going so far as to reach over the counter and point and the bloody sign they have printed on the wall behind the barista. ", "He then proceeded to open the wrong bag of beans. ", "So I gave explicit digital instructions as to which one. "], "author": "Paul V.", "review": "Twice now my order for a Clover brewed coffee has been forgotten. This second occasion I timed it. After the order was placed, 5 minutes elapsed before I tried bringing to their attention no one had so much as motioned toward the Clover machine. No one budged. I tried getting someone's attention. To no avail. So I got in line all the whole keeping my eye on the machine. No one so much as looked at it during my entire second trip through the queue. Finally reaching the register, I asked if it was working. He checked. 'Yes. It works. Why?' It was then I explained I had waited for my Clover brewed coffee and it had not been started yet. I had to proceed to explain what bean I wanted. I ordered it the same time, clearly, in English even going so far as to reach over the counter and point and the bloody sign they have printed on the wall behind the barista. He then proceeded to open the wrong bag of beans. So I gave explicit digital instructions as to which one. I damn near walked around to the back behind the counter and brewed it my bloody self.\n\nI cannot express in enough words how troublesome and irritating it is to order a simple cup of coffee at this location. \n\nEven Yelp! is telling me this post is epic.\n\nMy suggestion: take this location's Clover machine away from it and give it to another location. They don't know what the hell the customer is talking about when a Clover coffee is ordered.\n\nThis has happened twice now. First time, Starbucks customer service gave me some extra $ on my gift card. Cool. Time wasted. Not cool. Second time, I get a physical free beverage coupon. Second suggestion. I keep coming here to this location for Clover and they should give it to me for free every time now. Because every time I order it, they mess it up.\n\nEither fix the issue or just give me my coffee for free next time. \n\n\nTotal time waited: 17 minutes.", "rating": 2, "date": "2014-03-04"}], "coffee traveler": [], "cold brew coffee": [], "decaf pike place roast": [], "featured dark roast": [], "pike place roast": [], "hot chocolate": [{"excerpts": ["I ordered a hot chocolate with no whip cream and waited about 15 minutes to get my order ready. ", "Once it was ready I picked it up and realized that there is a whip cream in it on my way to out. ", "Immediately returned and told it to server over the counter. ", "I was thinking that they will replace is promptly so that I could get on my way. ", "However, the lady picked up my cup and without saying a \"sorry\" just dumped top part of hot chocolate and fill it with milk. ", "Ok I get it, you might have a bad day, or tired, but at least don't do it in front of customer. "], "author": "Jason M.", "review": "This place is very conveniently located in a busy area. I usually top by this branch to grab a coffee on my way to work. It is full of people and long line at even early hours. \n\nOverall, this place is fine and I do understand that they get busy from time to time. However, my last experience with location was not pleasant. \n\nI ordered a hot chocolate with no whip cream and waited about 15 minutes to get my order ready. Once it was ready I picked it up and realized that there is a whip cream in it on my way to out. Immediately returned and told it to server over the counter. I was thinking that they will replace is promptly so that I could get on my way. However, the lady picked up my cup and without saying a \"sorry\" just dumped top part of hot chocolate and fill it with milk. Ok I get it, you might have a bad day, or tired, but at least don't do it in front of customer. It just feels like blank point insult to your daily customers. \n\nAnyways, I will stop by at another Starbucks down the the street from now on. Even though it doesn't change anything in eyes of corporate company, I would at least get better customer experience with some respect.", "rating": 3, "date": "2018-07-13"}, {"excerpts": ["So my husband went in to order a tall hot chocolate for my boy.  ", "As she was writing the order on tall cup, I said that we would like to change it to grande.    ", "My husband asked her if it is too late so she shook her head no.  ", "However I interpreted as if she was shaking her head in annoyance.  ", "I interpreted that way because she had so much attitude as I came to the register.  ", "When I confronted her about it ", "she said she was answering his question and then rolled her eyes.  ", "Wow!!!  ", "Couldn't believe it!  ", "To top it off ", "she was the manager!  ", "I've never experienced a Starbucks manager with this much attitude!  ", "No apologies she just shut me off wouldn't let me get  in another word and ignored me.  ", "Starbucks how can you promote someone like her to this position?"], "author": "Shelly H.", "review": "Wow I've been insulted by the manager of this Starbucks.  Her name was Jasmin, a black lady with curly hair.  This incident happened after celebrating my 40th birthday, December 2nd at 8:45 pm.  Jasmin I will contact your district supervisors and address the incident.  You as the store manager should set a good example for your employees.  Clearly you don't know how to manage a store and you shouldn't have been given the privilege to be a manager.  \nSo my husband went in to order a tall hot chocolate for my boy.  As she was writing the order on tall cup, I said that we would like to change it to grande.    My husband asked her if it is too late so she shook her head no.  However I interpreted as if she was shaking her head in annoyance.  I interpreted that way because she had so much attitude as I came to the register.  When I confronted her about it she said she was answering his question and then rolled her eyes.  Wow!!!  Couldn't believe it!  To top it off she was the manager!  I've never experienced a Starbucks manager with this much attitude!  No apologies she just shut me off wouldn't let me get  in another word and ignored me.  Starbucks how can you promote someone like her to this position?", "rating": 1, "date": "2016-12-02"}, {"excerpts": ["Why would you order a hot chocolate when it is 80 degrees out????"], "author": "Sarah C.", "review": "Hot day!\nAfternoon!\nNeed a refreshing drink!\nGroup of people waiting for their drink!\nFast! \nI didn't have to wait long for my drink!\n\nWhy would you order a hot chocolate when it is 80 degrees out????", "rating": 4, "date": "2011-05-07"}], "peppermint hot chocolate": [], "salted caramel hot chocolate": [], "caff americano": [], "caff latte": [], "caff mocha": [], "caramel flan latte": [], "caramel macchiato": [{"excerpts": ["A iced caramel macchiato with 4 shot of espresso and got only milk in my drink, ask them if they could make another, i wait 5 minutes ", "and I got the same order only milk with ice, waste of time."], "author": "Blanca V.", "review": "This is by far the worst Starbucks I've been. I got my order wrong.  A iced caramel macchiato with 4 shot of espresso and got only milk in my drink, ask them if they could make another, i wait 5 minutes and I got the same order only milk with ice, waste of time.", "rating": 1, "date": "2017-03-30"}, {"excerpts": ["My girlfriend has a caramel macchiato latte and it tasted like milk. ", "No taste of caramel or coffee."], "author": "Joseph R.", "review": "I guess the reviews on here were true. In a rush to have coffee and breakfast and this was across from my hotel. The strawberry creme frap didn't taste like strawberries. My girlfriend has a caramel macchiato latte and it tasted like milk. No taste of caramel or coffee.", "rating": 2, "date": "2015-06-24"}], "cinnamon dolce latte": [], "espresso con panna": [], "espresso macchiato": [], "flat white": [], "flavored latte": [], "iced caff americano": [], "iced caff latte": [], "iced caff mocha": [], "iced caramel macchiato": [{"excerpts": ["A iced caramel macchiato with 4 shot of espresso and got only milk in my drink, ask them if they could make another, i wait 5 minutes ", "and I got the same order only milk with ice, waste of time."], "author": "Blanca V.", "review": "This is by far the worst Starbucks I've been. I got my order wrong.  A iced caramel macchiato with 4 shot of espresso and got only milk in my drink, ask them if they could make another, i wait 5 minutes and I got the same order only milk with ice, waste of time.", "rating": 1, "date": "2017-03-30"}], "iced cinnamon dolce latte": [], "iced flat white": [], "iced flavored latte": [], "iced skinny flavored latte": [], "iced skinny mocha": [], "iced tiramisu latte": [], "iced vanilla latte": [], "iced vanilla spice latte": [], "iced white chocolate mocha": [], "skinny flavored latte": [], "skinny mocha": [], "skinny peppermint mocha": [], "tiramisu latte": [], "vanilla latte": [], "caff vanilla frappuccino blended coffee": [], "caff vanilla light frappuccino blended coffee": [], "caramel frappuccino blended coffee": [], "caramel light frappuccino blended coffee": [], "caramel ribbon crunch crme frappuccino blended crme": [], "caramel ribbon crunch frappuccino blended coffee": [], "cinnamon dolce frappuccino blended coffee": [], "cinnamon dolce light frappuccino blended coffee": [], "classic chai crme frappuccino blended crme": [], "coffee frappuccino blended coffee": [], "coffee light frappuccino blended coffee": [], "double chocolaty chip crme frappuccino blended crme": [], "espresso frappuccino blended coffee": [], "green tea crme frappuccino blended crme": [], "hazelnut frappuccino blended coffee": [], "java chip frappuccino blended coffee": [], "java chip light frappuccino blended coffee": [], "mini smores frappuccino blended coffee": [], "mini smores frappuccino blended crme": [], "mocha frappuccino blended coffee": [], "mocha light frappuccino blended coffee": [], "smores frappuccino blended coffee": [], "smores frappuccino blended crme": [], "strawberries  crme frappuccino blended crme": [], "toffee mocha frappuccino blended coffee": [], "toffee mocha light frappuccino blended coffee": [], "vanilla bean crme frappuccino blended crme": [], "white chocolate mocha frappuccino blended coffee": [], "flavored steamed milk": [], "chocolate smoothie": [], "evolution fresh tm mango carrot smoothie": [], "evolution fresh tm strawberry smoothie": [], "evolution fresh tm sweet greens smoothie": [], "orange mango smoothie": [], "golden ginger ale fizzio tm handcrafted soda": [], "lemon ale fizzio tm handcrafted soda": [], "spiced root beer fizziotm handcrafted soda": []}