{"oysters on the halfshell": [], "vanillasugar doughnuts": [], "smoked salmon mousse": [{"excerpts": ["Smoked salmon mousse", "*\n4. ", "Doughnuts\n5. ", "Monkey bread\n6. ", "Chili verde braised pork belly\n7. ", "Soft scrambled*\n8. ", "Duck confit hash"], "author": "Kayla N.", "review": "We tried dinner and brunch here.  Between the two options, we preferred the brunch.  \n\nFor brunch, we tried:\n1. Bottle of mimosa your way\n2. Oysters on the half shell*\n3. Smoked salmon mousse*\n4. Doughnuts\n5. Monkey bread\n6. Chili verde braised pork belly\n7. Soft scrambled*\n8. Duck confit hash*\n\n* Table favorites.  \n\nBoth times we had decent service.", "rating": 4, "date": "2017-04-30"}, {"excerpts": ["We ordered the following:\n\nSmoked salmon mousse with bagel chips, creme fraiche, and scallions ($8): this starter was quite tasty. "], "author": "Amy C.", "review": "My best friend generously gifted me with a $100 gift certificate to this restaurant, so we came here with a party of 4 for Sunday brunch. The inside of the restaurant is quite large, with high ceilings and a lot of tables. We ordered the following:\n\nSmoked salmon mousse with bagel chips, creme fraiche, and scallions ($8): this starter was quite tasty. The salmon mousse was light and airy, and had some subtle flavors (a little spicy, a little sour, not too fishy), and came with deliciously seasoned and buttered crispy bagel chips.\nStrawberry shortcake doughnuts with shortcake crumble, rhubarb jam, and vanilla cream ($8): these were delicious! The doughnuts were hot and just out of the fryer, and packed on the inside with tart rhubarb jam and dusted on the outside with sugar. I also really liked the vanilla cream on the side.\nThe burger ($16): the burger was large and filling. The meat was juicy and while it didn't have the the usual accompaniments (lettuce, tomato, onion), if had some sort of slaw and mayo-based dressing that was quite delicious. The tater tots were stuffed with bacon and cheese and came with a ranch dressing. Definitely not healthy, but tasty!\nPastrami hash with shishito peppers, corn, poached eggs, and mustard creme fraiche ($17): the hash was very tasty. It came with two poached eggs which had runny yolk (just the way I like them), and the hash itself wasn't too greasy, although it was a little watery.\n\nOverall we had a good time, even though the power went out in the middle of our meal. I thought the price was a bit expensive for the amount of food, but the food itself was quite good.", "rating": 3, "date": "2017-08-06"}, {"excerpts": ["Smoked Salmon mousse with bagel chips\n"], "author": "Christine P.", "review": "4.5 stars rounding up to 5. \n\nThis place was pretty amazing.  I made reservations via Opentable for sunday brunch.  We had a table for 4 adults and 1 baby. \n\nFor snacks we ordered one of everything from their brunch menu: \n\nPuffed Potato & Egg (cauliflower mousse, crispy bacon) \nThis was delicious and I highly recommend.  Love the way the egg yolk perfectly oozes out of the puffed potato once you dig into it.\n\nVanilla Sugar Doughnuts \nSeriously - I could have had 2 orders of these to myself but restrained myself.  Delicious. \n\nSmoked Salmon mousse with bagel chips\nI love salmon and bagel chips so this was definitely a match made in heaven\n\nOysters on the half shelf \nSuper tiny oysters but still delicious.  I could skip this. \n\nFrom Sweets, we ordered: \n\nBrown Butter Crepes\nOur waiter recommended this and I'm so glad we ordered it.  If you love nutella and mascarpone, don't pass this up. \n\nFrom savory we ordered: \n\nDa Burga with tator tots\nbest tator tots i've ever had.  By the time the burger arrived I was stuffed so I can't rate this accordingly but from what I had, it was definitely satifying. \n\nRoasted Corn & Duck confit hash\nLoved the cornbread and poached egg but I don't eat duck so I didn't get to try it.  My girlfriends loved it. \n\nSpicy Tomato baked eggs \nCreamy Polenta, Chicken Confit, Avocado Toast\nI thought this was OK and probably won't order it again.  \n\nChino Valley Farms Soft Scrambled Eggs\nAsparagus, Mushrooms, Ricotta, Grilled Bread Crumble\nDelicious.  LOVED the ricotta and eggs combo.  Definitely recommend\n\nService was good.  Food was flavorful and I highly recommend.", "rating": 5, "date": "2015-05-03"}, {"excerpts": ["Food Gallery:\n\nSmoked Salmon Mousse --  http://bit.ly/XjHVzM\n", "I think the favorites around the table were definitely the Smoked Salmon Mousse, Puffed Potato & Egg, the Avocado & Burrata Salad, and the Roasted Corn & Duck Confit Hash.\n\n"], "author": "Rodney H.", "review": "Here's my story with Stones Throw.  I already heard great things about them from fellow yelper reviews, so when I saw that they had a booth at the 2014 San Francisco Street Food Festival, it was a perfect opportunity to try their famous Puffed Potato & Egg (http://bit.ly/1mVorYv).  Luckily for me, they didn't have a line and after that first bite of their Puffed Potato & Egg, I was hooked and went back and ordered it again at least twice that day.  It was so good!  And with that, I knew I wanted to give their restaurant a try.  The timing for it was actually perfect since I took a huge gamble and decided to try Stones Throw as the venue for Janice C.'s birthday brunch party for a group of 15 folks.\n\nBefore we get to the food, first off, I want to say that communication was really great with Tai Ricci and their staff to help plan for the event.  Even though I had to call them several times to change the head count, they were very patient and accommodating.  Amazing customer service!  Like what all past reviews have stated, get a reservation!!  Even though we had one, the place got packed just a short while after opening.\n\nWhat was great about having a big group was that aside from their oysters and burger, we basically got to try the whole brunch menu in family style form.  Not a bad deal for $25 per guest (for groups of 8 or more it's the minimum before drinks, tax, and gratuity).\n\nFood Gallery:\n\nSmoked Salmon Mousse --  http://bit.ly/XjHVzM\nMilk Jam, Strawberry Compote, Balsamic\n\nVanilla-Sugar Doughnuts --  http://bit.ly/1D8jBSj\nBagel Chips, Crème fraîche, Scallions\n\nPuffed Potato & Egg --  http://bit.ly/1D8jHZX\nCauliflower Mousse, Crispy Bacon\n\nButter-Fried Pancake --  http://bit.ly/1D8jK87\nEuropean-Style Butter, Vermont Maple Syrup\n\nBrioche Pain Perdu --  http://bit.ly/XjIyt1\nYellow Peaches, Vanilla Cream, Salted Almonds\n\nBrown Butter Crepes --  http://bit.ly/1D8jQwH\nNutella, Banana, Mascarpone, Shaved Hazelnuts\n\nBrokaw Avocado & Burrata Salad --  http://bit.ly/XjIJEF\nLa Quercia Prosciutto, Sungold Tomatos, Serpent Cucumbers\n\nRolled Chino Valley Farms Omelette --  http://bit.ly/XjIPMA\nOven-Dried Tomato, Button Mushroom, Herbed Goat Cheese, Brioche Crumble\n\nRoasted Corn & Duck Confit Hash --  http://bit.ly/XjIWYo\nPoached Eggs, Jimmy Nardello Peppers, Red Onion, Corn Bread\n\nIn all essence, everything we had was delicious and plated very nicely despite being served family style.  I think the favorites around the table were definitely the Smoked Salmon Mousse, Puffed Potato & Egg, the Avocado & Burrata Salad, and the Roasted Corn & Duck Confit Hash.\n\nI think the experience might have been a lot different with a small group since we probably would've ended up only trying a few menu items.  So to be able to try all that food for a low nominal price was quite a deal!\n\nSo in the end I'm really glad things went well.  The food was great and everyone had a great time, especially the birthday celebrant!  If you plan to have a big dinner or brunch party, I highly recommend Stones Throw!  I'm pretty sure I'll be returning for another brunch or to try them for dinner in the near future.  Gotta love that Puffed Potato & Egg!", "rating": 5, "date": "2014-09-26"}, {"excerpts": ["Their infamous potato and egg puffs, and the smoked salmon mousse. ", "My toddler son went nuts for the salmon mousse. ", "It's smokey, and had fresno chiles, avocado, fried capers, and pickled red onions on top with house made bagel chips.  ", "We were pretty stoked about it as well.  ", "He didn't go for the potato puffs, but he doesn't like eggs.  ", "Me and my husband on the other hand were very happy with the puffs. ", "Great texture, and great flavor. "], "author": "Erin O.", "review": "This is a 4.5 star review. I came here with my family for a brunch on a friend's recommendation.  As the area would dictate, parking is kind of crazy, but we were able to find a spot a couple of blocks away, so we walked in early, and already in a good mood.  We were warmly welcomed, and seated immediately.  When you have a toddler, quick service is kind of a big deal.  It's a pretty new spot, I think, so the high chairs were brand new, and our little guy didn't fuss much about sitting in the seat.  They don't have a kid's menu, but we asked if they could offer a kid's portion for some of the dishes, and they were accommodating with the pancake, which sounded pretty good to me and my husband.\n\nThey have an interesting and extensive beer list (not every beer, but it's well curated, and give a nice set of options for any flavor profile you'd want), and the cocktail I had was excellent.\n\nWe got 2 small plates to start. Their infamous potato and egg puffs, and the smoked salmon mousse. My toddler son went nuts for the salmon mousse. It's smokey, and had fresno chiles, avocado, fried capers, and pickled red onions on top with house made bagel chips.  We were pretty stoked about it as well.  He didn't go for the potato puffs, but he doesn't like eggs.  Me and my husband on the other hand were very happy with the puffs. Great texture, and great flavor. It would have been easy to eat a plate each.\n\n That said, the mains came pretty soon, and with it, my son's pancake, my duck hash, and his messy breakfast sandwich.  Everyone was happy with the food.  My son can be a bit of a picky eater, but breakfast is usually his favorite. He can polish off a normal pancake, or a square of waffle, but he had 3/4 of one of the butter-fried pancakes. He sat there, popping bites into his mouth, and asking for me to cut more over and over.  We thought he'd get through half, and he just kept going. These are not small pancakes!  It was about 3/4\" thick, and about 7\" wide.  He looked like a contestant who knew he was going to lose in an eating contest, but he had to keep going.\n\nThe hash was excellent. More than anything, the quality of their eggs were great.  The breakfast sandwich was even better than the hash.  The sausage patty was perfectly cooked, and the scale was perfectly balanced.\n\nWe are eager to go back and try dinner another time, and hopefully brunch again, with the whole family.", "rating": 5, "date": "2015-01-30"}, {"excerpts": ["As the smoked salmon mousse was the first dish that was served we couldn't help thinking \"wow this is really fresh and delicious. ", "How refined, creative and yet affordable and voluminous.\" ", "$8 for that is just a complete joke. ", "Then the puffed potato came and we were like ", "\"wow this place is freaking special\". ", "Absolutely delicious. ", "So elaborate yet flavorful. ", "So many chefs intend complexity and fail. ", "That meal was a mastery of flavor combined with creativity and detail. ", "The potato itself is delicious and inventive with the egg inside. ", "You top that with a bed of awesome cauliflower purée and thinly cut ingredients adding texture to an already amazing dish. "], "author": "Antoine C.", "review": "Incredible experience. Best brunch I have ever had. After an incredible brunch experience in Montreal I didn't think anything could top that. This place went above and beyond my wildest expectations. \n\nFrom the restaurant itself to the food, everything about the place is perfect. The service was impeccable while so casual and professional. So many restaurants with this type of food would make you feel like you are lucky that they're serving you. This place serves you the best brunch you could possibly get with the humility of a rookie. \n\nTrust me, this is the best it gets as far as brunch. I beg anyone to give me the name of a place that serves brunch of equal or greater deliciousness. \n\nYou can try but you probably won't find one.\n\nAs the smoked salmon mousse was the first dish that was served we couldn't help thinking \"wow this is really fresh and delicious. How refined, creative and yet affordable and voluminous.\" $8 for that is just a complete joke. Then the puffed potato came and we were like \"wow this place is freaking special\". Absolutely delicious. So elaborate yet flavorful. So many chefs intend complexity and fail. That meal was a mastery of flavor combined with creativity and detail. The potato itself is delicious and inventive with the egg inside. You top that with a bed of awesome cauliflower purée and thinly cut ingredients adding texture to an already amazing dish. Just incredible.\n\nThen came the French toast... I told my girlfriend \"eh, it's just ok\". She tried. And then acknowledged how hilarious I was as those French toasts were the best French toasts we had ever had by far. To be fair they were not really French toasts. Just like the rest they were just another magically flavorful and creative dish that blew us away.\n\nAt that point we had decided \" ok this place is ridiculous\". Just as we were getting the last dish: chicken/polenta/eggs. After being so spoiled I welcomed this dish with disappointment and borderline pissed for ordering that (because of how it looked) Until I tried. Amazing.\n\nThis restaurant has accomplished a level of complexity, flavor, creativity that I did not think possible. And all that with humility and a price tag that I just cannot comprehend.\n\nRush to this gold mine. For your sake.", "rating": 5, "date": "2015-06-10"}, {"excerpts": ["Some places have bagels and lox; stone's throw has smoked salmon mousse with house made bagel chips.  ", "Basic foods that everyone knows how to make, like eggs, find a whole new level here.  "], "author": "Josh P.", "review": "Just had brunch here for the first time and had to give another 5-star review on top of the previous one for dinner.\n\nThis place just elevates food, simple as that.  Some places have bagels and lox; stone's throw has smoked salmon mousse with house made bagel chips.  Basic foods that everyone knows how to make, like eggs, find a whole new level here.  Stone's Throw is now in a heated battle with Brenda's and Plow for best brunch in SF as far as I'm concerned.\n\nAlso, big shout out to Ryan & co. for the philanthropic work with the monday night dinners benefitting the SF food bank.  Best food in Russian Hill + giving back to the community in a big way = 5 shiny stars.", "rating": 5, "date": "2014-08-10"}, {"excerpts": ["* SMOKED SALMON MOUSSE sans scallions :: 5/5 stars :: so much flavor!  ", "mousse was extremely smooth and the pickled items they added complimented the mousse w/o overpowering it.  ", "I think they also added fried capers, which I love!  ", "It added another level of texture.  ", "The bagel chips were a bit hard, I was worried about my teeth on a couple bites!  ", ":D\n", "** DUCK CONFIT HASH :: ", "5/5 stars :: ", "I don't even know where to begin. ", "This was AHHHH-mazing!  ", "I don't even want to describe it, I know I can't do it justice!  ", "Only one other thing to note, I don't even like English peas, but they made me like it!\n", "*"], "author": "Tina F.", "review": "After reading an article from Zagat about Stones Throw's brunch I decided to check it out on Yelp, to my surprise I had already book marked it!  Looking at the menu + pictures, I decided I had to try it out.  I search on a table for Sunday morning and OMG, they have availability the upcoming weekend.  \n\nNo, I didn't have to schedule it weeks in advance and no I didn't have to go online at midnight to try to get a table for the next day block (30 or 60). \n\nApproximately an hour before our reservations I receive two text messages from them.  First one to double check if our situation had changed and whether or not we were still coming.  And the second one was a tip regarding parking.  They suggested we take an Uber and if we did, it would be 5% off our entire meal!  Woaaa that is sooo cool!  We opted not to take Uber, only because we had several errands we had to run that day.  We will definitely take them up on that offer when we have dinner there.  And trust me, after that brunch... we will have many dinners there.\n\nReservations were at a decent time, 11:30!!  We show up about 25 minutes early, because we're always early.  Luckily they have availability and seat us immediately.  We ordered:\n\n** PITCHER OF PIMM'S :: 4/5 stars :: for $20, it's a pretty good deal.  And normally I'd say a pitcher for $20 is a great deal, but the pitcher was FULL of ice and the glasses they brought to pour the PIMM'S in was also full of ice... so it was a bit deceptive.  But it was very refreshing and great compliment to brunch\n** SMOKED SALMON MOUSSE sans scallions :: 5/5 stars :: so much flavor!  mousse was extremely smooth and the pickled items they added complimented the mousse w/o overpowering it.  I think they also added fried capers, which I love!  It added another level of texture.  The bagel chips were a bit hard, I was worried about my teeth on a couple bites!  :D\n** DUCK CONFIT HASH :: 5/5 stars :: I don't even know where to begin. This was AHHHH-mazing!  I don't even want to describe it, I know I can't do it justice!  Only one other thing to note, I don't even like English peas, but they made me like it!\n** \"DA BURGA\" aka DA DISASTER :: 5/5 stars :: everything was perfect, from the great sauces all the way down to the ooey gooey of the cheese melting down the sides of the patty!  Probably my favorite burger in the city for now.\n\nStaff was friendly and perfectly attentive.  I love this place and can't wait to come back for dinner!  Happy eating!", "rating": 5, "date": "2016-05-02"}, {"excerpts": ["We split the puffed potato and egg, smoked salmon mousse, messy breakfast sandwich, and the brioche pain perdu. ", "The only thing that did not completely wow me was the smoked salmon mousse. ", "It was good, but everything else was off the chain! ", "Splitting the sandwich and brioche is perfect balance of sweet and savory."], "author": "Andrea A.", "review": "Stones Throw has yet to disappoint. Had an amazing brunch this morning, after having had dinner here twice. We split the puffed potato and egg, smoked salmon mousse, messy breakfast sandwich, and the brioche pain perdu. The only thing that did not completely wow me was the smoked salmon mousse. It was good, but everything else was off the chain! Splitting the sandwich and brioche is perfect balance of sweet and savory.", "rating": 4, "date": "2014-11-09"}, {"excerpts": ["The Food: I tried the puffed potato and egg, smoked salmon mousse, the hawaiian bread pudding, and the duck confit hash. ", "The puffed potato and egg, was a bit underwhelming. ", "It was good, but had room for improvement. ", "The smoked salmon mousse was very good. ", "A bit reminiscent of a smoked salmon cream cheese, but the pickled red onions made all the difference for me. ", "The duck confit hash was the best I had tried. ", "The eggs came out a bit runny looking, but once all mixed together, it was perfect. ", "Paired with a charred piece the bread, the dish had a very sophisticated flavor profile. ", "The kicker for me was the hawaiian bread pudding! ", "Wow, I had never seen a dish like this before, especially for brunch. ", "The bread pudding was not too mushy, not too firm, but very supple. ", "The sauce added good sweetness and salt, with the nuttiness of the macadamia  to top it off. ", "This dish was my favorite "], "author": "Andy C.", "review": "The Short: I would definitely go back, one of the better brunches that I've had in the city. THe mains bursted with flavor and had a lot of items one couldn't find elsewhere.\n\nThe Food: I tried the puffed potato and egg, smoked salmon mousse, the hawaiian bread pudding, and the duck confit hash. The puffed potato and egg, was a bit underwhelming. It was good, but had room for improvement. The smoked salmon mousse was very good. A bit reminiscent of a smoked salmon cream cheese, but the pickled red onions made all the difference for me. The duck confit hash was the best I had tried. The eggs came out a bit runny looking, but once all mixed together, it was perfect. Paired with a charred piece the bread, the dish had a very sophisticated flavor profile. The kicker for me was the hawaiian bread pudding! Wow, I had never seen a dish like this before, especially for brunch. The bread pudding was not too mushy, not too firm, but very supple. The sauce added good sweetness and salt, with the nuttiness of the macadamia  to top it off. This dish was my favorite and I'd highly recommend it.\n\nThe service: We went for brunch around 11:45a on a Sunday. No wait, but we sat at the bar. I guess reservations might be a smart thing to do. Wait staff was nice, a bit slow on everything, but nothing terrible.\n\nThe ambience: Warm, clean, and simple, the interior at Stones Throw was very appealing. Glass windows opening up to the neighborhood on Russian Hill with the cable cars passing by were very nice. Bartenders on the side mixing carafes of delicious looking drinks excellently prepared. Great location for a date or for guests.\n\nOverall: The main dishes were great, I would definitely want to go back. I want to try their dinner menu as well. The mains popped with flavor and the setting was too nice to pass up. I'd definitely recommend this place to someone without hesitation.", "rating": 4, "date": "2016-06-05"}], "puffed potato  egg": [], "yogurt  granola": [], "butterfried pancakes": [], "brioche pain perdu": [{"excerpts": ["Bagel Chips, Crème fraîche, Scallions\n\nPuffed Potato & Egg --  http://bit.ly/1D8jHZX\nCauliflower Mousse, Crispy Bacon\n\nButter-Fried Pancake --  http://bit.ly/1D8jK87\nEuropean-Style Butter, Vermont Maple Syrup\n\nBrioche Pain Perdu --  http://bit.ly/XjIyt1\nYellow Peaches, Vanilla Cream, Salted Almonds\n\nBrown Butter Crepes --  http://bit.ly/1D8jQwH\nNutella, Banana, Mascarpone, Shaved Hazelnuts\n\nBrokaw Avocado & Burrata Salad --  http://bit.ly/XjIJEF\n"], "author": "Rodney H.", "review": "Here's my story with Stones Throw.  I already heard great things about them from fellow yelper reviews, so when I saw that they had a booth at the 2014 San Francisco Street Food Festival, it was a perfect opportunity to try their famous Puffed Potato & Egg (http://bit.ly/1mVorYv).  Luckily for me, they didn't have a line and after that first bite of their Puffed Potato & Egg, I was hooked and went back and ordered it again at least twice that day.  It was so good!  And with that, I knew I wanted to give their restaurant a try.  The timing for it was actually perfect since I took a huge gamble and decided to try Stones Throw as the venue for Janice C.'s birthday brunch party for a group of 15 folks.\n\nBefore we get to the food, first off, I want to say that communication was really great with Tai Ricci and their staff to help plan for the event.  Even though I had to call them several times to change the head count, they were very patient and accommodating.  Amazing customer service!  Like what all past reviews have stated, get a reservation!!  Even though we had one, the place got packed just a short while after opening.\n\nWhat was great about having a big group was that aside from their oysters and burger, we basically got to try the whole brunch menu in family style form.  Not a bad deal for $25 per guest (for groups of 8 or more it's the minimum before drinks, tax, and gratuity).\n\nFood Gallery:\n\nSmoked Salmon Mousse --  http://bit.ly/XjHVzM\nMilk Jam, Strawberry Compote, Balsamic\n\nVanilla-Sugar Doughnuts --  http://bit.ly/1D8jBSj\nBagel Chips, Crème fraîche, Scallions\n\nPuffed Potato & Egg --  http://bit.ly/1D8jHZX\nCauliflower Mousse, Crispy Bacon\n\nButter-Fried Pancake --  http://bit.ly/1D8jK87\nEuropean-Style Butter, Vermont Maple Syrup\n\nBrioche Pain Perdu --  http://bit.ly/XjIyt1\nYellow Peaches, Vanilla Cream, Salted Almonds\n\nBrown Butter Crepes --  http://bit.ly/1D8jQwH\nNutella, Banana, Mascarpone, Shaved Hazelnuts\n\nBrokaw Avocado & Burrata Salad --  http://bit.ly/XjIJEF\nLa Quercia Prosciutto, Sungold Tomatos, Serpent Cucumbers\n\nRolled Chino Valley Farms Omelette --  http://bit.ly/XjIPMA\nOven-Dried Tomato, Button Mushroom, Herbed Goat Cheese, Brioche Crumble\n\nRoasted Corn & Duck Confit Hash --  http://bit.ly/XjIWYo\nPoached Eggs, Jimmy Nardello Peppers, Red Onion, Corn Bread\n\nIn all essence, everything we had was delicious and plated very nicely despite being served family style.  I think the favorites around the table were definitely the Smoked Salmon Mousse, Puffed Potato & Egg, the Avocado & Burrata Salad, and the Roasted Corn & Duck Confit Hash.\n\nI think the experience might have been a lot different with a small group since we probably would've ended up only trying a few menu items.  So to be able to try all that food for a low nominal price was quite a deal!\n\nSo in the end I'm really glad things went well.  The food was great and everyone had a great time, especially the birthday celebrant!  If you plan to have a big dinner or brunch party, I highly recommend Stones Throw!  I'm pretty sure I'll be returning for another brunch or to try them for dinner in the near future.  Gotta love that Puffed Potato & Egg!", "rating": 5, "date": "2014-09-26"}, {"excerpts": ["We split the puffed potato and egg, smoked salmon mousse, messy breakfast sandwich, and the brioche pain perdu. ", "The only thing that did not completely wow me was the smoked salmon mousse. ", "It was good, but everything else was off the chain! ", "Splitting the sandwich and brioche is perfect balance of sweet and savory."], "author": "Andrea A.", "review": "Stones Throw has yet to disappoint. Had an amazing brunch this morning, after having had dinner here twice. We split the puffed potato and egg, smoked salmon mousse, messy breakfast sandwich, and the brioche pain perdu. The only thing that did not completely wow me was the smoked salmon mousse. It was good, but everything else was off the chain! Splitting the sandwich and brioche is perfect balance of sweet and savory.", "rating": 4, "date": "2014-11-09"}], "brown butter crepess": [], "brokaw avocado  burrata salad": [], "rolled chino valley farms egg omelette": [], "roasted corn  duck confit hash": [], "da burga": [{"excerpts": ["For our entrees, my friend ordered the salmon and I opted for \"da burga.", "\" ", "I was bummed to see they weren't offering the bass anymore, because salmon is well, salmon... ", "The whole experience was a little underwhelming to say the least. ", "My burger was definitely over cooked ", "but I wasn't much in the mood to complain about it ", "(the irony is that I spent 3 years of my life working at a burger joint, having faced the back end of complaints about patty temperatures). ", "The salmon was also *just okay", "* "], "author": "Liz C.", "review": "Perhaps my mistake was coming in with too high of expectations. Nevertheless, I had a decent meal and experience here. \n\nService was spectacular, with the servers never missing an opportunity to top our glasses off. And the Sangiovese Uccelliera that wine our server suggested was enjoyable. My complaints (or failure, really, to be impressed) had more to do with the dishes. \n\nWe started with the duck pate, potato puffs, and squid ink pasta. Out of these, I would only order the potato puffs again - the puff just sort of melts in your mouth. For our entrees, my friend ordered the salmon and I opted for \"da burga.\" I was bummed to see they weren't offering the bass anymore, because salmon is well, salmon... The whole experience was a little underwhelming to say the least. My burger was definitely over cooked but I wasn't much in the mood to complain about it (the irony is that I spent 3 years of my life working at a burger joint, having faced the back end of complaints about patty temperatures). The salmon was also *just okay* (a recurring theme here).\n\nFor dessert, we shared the peanut butter jelly donuts. I was pleasantly surprised, the soft beignets and the pb&j really did complement each other well. I appreciate the concept of the dessert menu - upscale renditions of childhood favorites. It was fun to write my own down as an inspiration suggestion for the dessert chef. \n\nOverall, this is not a place I would choose to return to, based on the food quality alone. That, however, is barely an insult to any restaurant in SF considering the multitude of options we have here. Nevertheless, I can dig the vibe, service, drink menu, and space of the place. Worth a stop on the SF eater trail but don't have high expectations.", "rating": 3, "date": "2016-11-18"}, {"excerpts": ["My fiancé and I split \"Da Burga,\" and to be honest ", "I wasn't overly impressed. ", "While good, it tasted like a standard burger to me ", "and I wasn't sure what made it worth $16. "], "author": "Valerie L.", "review": "Had a lovely dinner at Stones Throw and the service was A+. Other restaurants should take note. They were super attentive, didn't spend forever rattling off specials on the menu, the water glass was always filled, and they surprised us with a PB&J dessert at the end! \n\nThe highlights were the squid ink pasta and puffed potato & egg, although the amberjack crudo (a new item that they added to the menu that day) was also refreshing and tasty. I would recommend those three items. The duck pate was also solid but I wish it was accompanied by a different type of bread instead of a soft pretzel. That's just a personal preference.\n\nMy fiancé and I split \"Da Burga,\" and to be honest I wasn't overly impressed. While good, it tasted like a standard burger to me and I wasn't sure what made it worth $16. The tater tots were nicely done, but I wish there were more of them. \n\nThe dessert menu is fun and I love the concept of asking people to write down their favorite childhood desserts. They pick a few to incorporate into future menus.\n\nWhat I liked most is that it was \"fine dining\" in a relaxed environment. It felt like eating creative food in a neighborhood restaurant and I didn't feel like it was too stuffy at all. Would love to check out their brunch sometime.", "rating": 4, "date": "2017-03-29"}, {"excerpts": ["I was a big fan of Da Burga as the bread was light and fluffy! ", "The burger patty was freshly made and crumbled nicely with the bread. ", "I also enjoyed the coleslaw that blended quite well with the burger. "], "author": "Derek S.", "review": "Came by with a reservation via OpenTable the other night and was certainly glad that I did as I was seated immediately upon arrival to a full restaurant! Parking in Russian Hill is challenging and the restaurant does offer 5% off your bill for using Uber.\n\nThe restaurant itself is unique as it's in an older building. There are even a couple standing tables by the door near the bar for a casual meal!\n\nStarted off with the squid ink conchiglie pasta which was on the salty side. The pasta had a fantastic texture and the seafood tasted fresh!\n\nMoved on to the puffed potato & eggs and this one was lackluster. It was sort of bland, although it was unique in the sense that it had an egg yolk inside the puff potato! The cauliflower mousse and crispy chicken skin was a unique add-on to the dish.\n\nThe spring vegetable salad was very good. Vegetables were fresh and the custard made the salad filling!\n\nI was a big fan of Da Burga as the bread was light and fluffy! The burger patty was freshly made and crumbled nicely with the bread. I also enjoyed the coleslaw that blended quite well with the burger. The tater tots were okay.\n\nEnded off the meal with the Peanut Butter & Jelly Donuts which was the highlight of the meal. The beignets were light and fluffy (if only they could make them filled!) The peanut butter and jelly with the dish complemented this dessert quite well!\n\nAmbiance of the restaurant was more on the casual side as it was pretty loud inside and the tables were pretty close together... Staff was friendly! \n\n~$45/head after tax and tip. There is a ~5% SF Health charge for the wait staff.", "rating": 4, "date": "2016-03-23"}, {"excerpts": ["I think the entree our table was most in awe of was the burger, or \"DA BURGA\" as its aptly named on the menu.  ", "This entree is of gargantuan proportions and is every bit as mouthwatering as it looks.....from what I was told by my two tablemates that ordered this behemoth burger.  ", "The burger bun is equally just as thick as the meat that sits between the two pieces, which barely contained the melted cheddar cheese that slowly trickled onto the plate.  ", "And its companion?  ", "Not just your ordinary fries, but baked potato tator tots.  ", "I was able to try a tator tot, and after doing so I began to doubt my original decision to order the gnnochi.  ", "I'll be back to try \"DA BURGA\" for sure!!  ", "Those peanut butter and jelly donuts are awesome!"], "author": "Michael C.", "review": "Leave no STONE unturned.\n\nMy brother kindly took my mom, myself, and some friends to dinner on our last night in the bay area.  I found out that same night that he was wanting to try this restaurant for some time, and he thought a \"last supper\" with the family was a good reason for an inaugural visit.\n\nAnd about that STONE being unturned, I guess in this case the STONE would be a metaphor for the menu.  My advice:  peruse the menu carefully as there are certainly many appetizing dishes to choose from.\n\nThe restaurant is cozy, yet elegant and simply decorated.  Though we were slightly early for our reservation, the host extended a warm welcome and showed our group of five to our table.\n\nSome of the group did their due diligence in researching (via Yelp) the more popular or well-known dishes.  However, their menu has many appetizers, entrees, etc. to choose from, as well as an extensive wine and spirits list.\n\nFOOD:  Thanks to some helpful recommendations via Yelp, our group chose a variety of appetizers to share, these included the puffed potato and eggs, duck pate & mousse, and the squid ink pasta.  \n\nFirstly, do order the puffed potato and eggs and the squid ink pasta.  All of the accolades from other yelpers are indeed true.  The potato and eggs are fluffy, light and delicious, while the pasta delivers bold flavors thanks to the seafood combination of calamari, squid, shrimp, and clams.  The duck pate and mousse was alright, and I'd recommend asking for more bread if needed.  \n\nMy dinner entree was the butternut squash ravioli.  It was simply divine.  Cheesey goodness is more like it actually.  Although the portion was smaller than I anticipated, the gnnochi was excellent.  The brussels sprout pesto, truffle, and sage complemented the ricotta gnudi splendidly.  In contrast, my mother ordered the trout, accompanied with brussels sprouts, celery root and beef jus.  She liked it every much, as evident by her finishing almost the entire portion.\n\nI think the entree our table was most in awe of was the burger, or \"DA BURGA\" as its aptly named on the menu.  This entree is of gargantuan proportions and is every bit as mouthwatering as it looks.....from what I was told by my two tablemates that ordered this behemoth burger.  The burger bun is equally just as thick as the meat that sits between the two pieces, which barely contained the melted cheddar cheese that slowly trickled onto the plate.  And its companion?  Not just your ordinary fries, but baked potato tator tots.  I was able to try a tator tot, and after doing so I began to doubt my original decision to order the gnnochi.  I suppose a second visit is in order on a future trip to the bay area.\n\nSWEET TREAT:  To end the meal, we all shared the peanut butter and jelly donuts.  For all my Hawaii friends and family on Yelp, this is basically the bay area's version of malasadas.  The generous portion of jelly within the donut was, of course, a fantastic combination with the peanut butter and truly brought back fond childhood memories.  A comfort food and dessert rolled into one.  \n\nSERVICE:  Outstanding.  Our server was a friendly and humorous woman who was extremely patient with our group, and took the time to answer all our questions to the best of her ability.  She kindly offered recommendations on appetizers, entrees, and cocktails.  She checked on us in a timely during the entire meal and provided excellent customer service.  \n\nBOTTOM LINE:  An incredible meal with wonderful friends and family.  I'll be back to try \"DA BURGA\" for sure!!  Those peanut butter and jelly donuts are awesome!", "rating": 5, "date": "2016-01-04"}, {"excerpts": ["*\"DA BURGA", "\" aka DA DISASTER: "], "author": "Elena N.", "review": "I normally have a birthday dinner with my coworkers every year. This year, we celebrated a little later than usual. A couple weeks prior, I made a reservation through OpenTable for a party of 4 for Thursday, October 15th at 6:30pm.\n\nFood:\n*PUFFED POTATO & EGGS: Cauliflower Mousse, Chives, Crispy Chicken Skin ($8)\n*DUCK PÂTÉ & MOUSSE: French's Mustard, Cornichons, Warm Soft Pretzel ($8)\n*SQUID INK CONCHIGLIE PASTA: Spicy Capers, Clams, Calamari, Shrimp, Tender Greens ($15 x1.5 for Main portion = $22.50)\n*38 NORTH DUCK BREAST: Duck Confit, Crispy Polenta, Tokyo Turnips, Huckleberries, Hazelnuts ($28)\n*\"DA BURGA\" aka DA DISASTER: Dressed & Ready, 'Everything' Baked Potato Tater Tots ($16)\n*PEANUT BUTTER & JELLY DONUTS\n\nI know everyone raves about the puffed potato and eggs, but for me, what blew me away were the baked potato tater tots. I already love tater tots. Stones Throw then goes and stuffs them with baked potato toppings?! I'm in heaven! For my entree, I got the duck breast which was perfectly cooked! Crispy skin, tender meat. We all shared the puffed potato appetizer. I thought they were good, but they didn't exactly blow my mind. Maybe I needed to eat more than one to fully appreciate it?\n\nOne of my coworkers wanted the squid ink pasta, but it was listed under starters so she was afraid the portion would've been too small for a main. The restaurant was nice enough to make her an entree sized portion which ended up being 1.5 times the starter price. They were also very sweet and gave us the donut dessert for my birthday.\n\nWines by the glass:\n*Sauvignon Blanc Scarbolo, Friuli, Italy 2014 ($11)\n*Chardonnay Talley 'Bishop's Peak', San Luis Obispo, CA 2014 ($9)\n*Cabernet Sauvignon Medlock Ames 'Bell Mountain', Alexander Valley, CA 2012 ($14)\n\nWe all decided to do wines by the glass since one coworker ordered beer and we all had different glasses of wine. The wines were decently priced and I enjoyed my cab with the duck.\n\nVery fun place to have dinner and for a casual special occasion.", "rating": 5, "date": "2015-10-19"}, {"excerpts": ["From savory we ordered: \n\nDa Burga with tator tots\nbest tator tots i've ever had.  "], "author": "Christine P.", "review": "4.5 stars rounding up to 5. \n\nThis place was pretty amazing.  I made reservations via Opentable for sunday brunch.  We had a table for 4 adults and 1 baby. \n\nFor snacks we ordered one of everything from their brunch menu: \n\nPuffed Potato & Egg (cauliflower mousse, crispy bacon) \nThis was delicious and I highly recommend.  Love the way the egg yolk perfectly oozes out of the puffed potato once you dig into it.\n\nVanilla Sugar Doughnuts \nSeriously - I could have had 2 orders of these to myself but restrained myself.  Delicious. \n\nSmoked Salmon mousse with bagel chips\nI love salmon and bagel chips so this was definitely a match made in heaven\n\nOysters on the half shelf \nSuper tiny oysters but still delicious.  I could skip this. \n\nFrom Sweets, we ordered: \n\nBrown Butter Crepes\nOur waiter recommended this and I'm so glad we ordered it.  If you love nutella and mascarpone, don't pass this up. \n\nFrom savory we ordered: \n\nDa Burga with tator tots\nbest tator tots i've ever had.  By the time the burger arrived I was stuffed so I can't rate this accordingly but from what I had, it was definitely satifying. \n\nRoasted Corn & Duck confit hash\nLoved the cornbread and poached egg but I don't eat duck so I didn't get to try it.  My girlfriends loved it. \n\nSpicy Tomato baked eggs \nCreamy Polenta, Chicken Confit, Avocado Toast\nI thought this was OK and probably won't order it again.  \n\nChino Valley Farms Soft Scrambled Eggs\nAsparagus, Mushrooms, Ricotta, Grilled Bread Crumble\nDelicious.  LOVED the ricotta and eggs combo.  Definitely recommend\n\nService was good.  Food was flavorful and I highly recommend.", "rating": 5, "date": "2015-05-03"}, {"excerpts": ["[4] Da Burga - Stones Throw house burger with cheddar cheese atop a beef patty with a brioche bun served with cheesy baked potato tater tots. ", "The tater tots were bomb. "], "author": "Elaine N.", "review": "I have a few friends in the city that I would never doubt their foodie senses. When one of those friends was raving about his recent visit to Stones Throw I knew I had to check it out ASAP. My sister and I booked a reservation for 6pm on a Saturday night, we were really surprised that there were reservations available just an hour before showing up! We were seated right when we walked through the door. The restaurant was dimly lit but still very casual with a small bar area with stools by the window.\n\nWe got a few items to share... \n\n[1] Puffed Potato & Egg - runny egg yolk within a creamy semi-mashed potato ball with a crispy chicken skin served with cauliflower mousse and chives. For a dish you would expect to be extremely heavy, it was surprisingly light and the perfect way to start off the meal. \n\n[2] Duck Pate & Mousse - the duck pate was very rich and light, served with french mustard and cornichons (sour French pickles) and two freshly baked pretzel rolls.\n\n[3] Squid Ink Conchiglie Pasta - looked like conch shaped pasta with capers, clams, calamari, shrimp, and greens. This was one of my favorite dishes of the evening. The pasta had a great texture and good flavor.\n\n[4] Da Burga - Stones Throw house burger with cheddar cheese atop a beef patty with a brioche bun served with cheesy baked potato tater tots. The tater tots were bomb. com and the burger was pretty finger-licking good too. \n\nThey have a pretty substantial list of bottled beers with lots of imports and there is a solid wine list as well. The service was fantastic, attentive but not too attentive where it's annoying. They do a little fun game with the dessert menu where you note what your favorite childhood dessert was and the chef will choose the suggestion he likes, puts a spin on it, and adds it to the menu. If yours gets chosen, he will invite you back to try out his new creation! We had a great first time at Stones Throw and will definitely be back soon.", "rating": 5, "date": "2015-01-03"}, {"excerpts": ["Da Burga - meh... not as flavorful as an in-n-out :T freals.\n", "Duck Confit Hash - meh. "], "author": "Grace L.", "review": "Overpriced & Over-salted. Service was mediocre. Actually felt quite rushed during brunch when the restaurant wasn't busy on a lazy Sunday.\n\nI will say potato egg balls were great. But nothing else was rave-worthy. \n\nMonkey Bread - meh... not enough topping to bread ratio.\nDa Burga - meh... not as flavorful as an in-n-out :T freals.\nDuck Confit Hash - meh. Over-salted.\n\nI won't be back and I can't recommend to others.", "rating": 2, "date": "2015-09-10"}, {"excerpts": [": I got Da Burga -- pretty good, but felt like it could have been better. ", "The tots were good. ", "My husband got the lasagna -- umm, not what we expected... ", "It was a different take on lasagna, which was interesting. ", "But the portion was TINY. "], "author": "Andrea L.", "review": "I wanted to like this place, but in the end I had a lot of mixed feelings. \n\nAmbiance: I really liked the ambiance, including the look of the menu. However, I think the ambiance created a different expectation for me. Even from their website, I was expecting rustic and simple. I love rustic and simple, but this was not that. \n\nDrinks: Huge wine selection. We got a couple bottles. Later on I did notice they had a small cocktail list but never did try any. \n\nAppetizers: Pork belly and pig ears were really good. Potato puffs were okay. Okonomiyaki and octopus were good. Squid ink pasta was REALLY good -- my fave of the night. \n\nEntrees: I got Da Burga -- pretty good, but felt like it could have been better. The tots were good. My husband got the lasagna -- umm, not what we expected... It was a different take on lasagna, which was interesting. But the portion was TINY. Even with all the appetizers we got, the portion was so tiny that he wasn't satisfied. \n\nDessert: We got Not your Grandma's Apple Pie. It was very loosely based in apple pie. It was a custard with a rolled wafer and some kind of frozen tart crystal over the top. Very different. Refreshing, and definitely not apple pie. It can throw you off if you were expecting apple pie. \n\nOverall: The style of the food (trendy) and the prices for the tiny portion sizes didn't match the ambiance for me. It would have been more appropriate for the ambiance to be closer to something like Hakkasan. I really was expecting something more rustic, traditional, simple with a twist or something. There were definitely some high points and things I enjoyed, but I probably won't be back.", "rating": 3, "date": "2014-06-01"}, {"excerpts": ["We ordered the Duck Pate and Mousse, Puffed Potato and Egg, Squid Ink Pasta, Banh Mi Pork Belly, Grilled Spanish Octopus, 38 North Duck Breast, Duo of Beef Ribeye and Braised Short rib, Da Burga, and the Peanut Butter and Jelly donuts. ", "My favorites were the Duck Pate and Mousse, Puffed Potato Egg, and Squid Ink Patsa. ", "The Duck Pate and Mousse was amazing ", "the layer was mustard goes so well with the pretzel bread. ", "Puffed Potato Egg came together ", "so well it was lightly fried and amazing. ", "I am also totally obsessed with the Squid Ink Pasta! ", "The Pasta was nice and briny and went so well with the seafood."], "author": "Eileen H.", "review": "Its a really solid place. Not everything we got was great but I still really enjoyed it and would definitely come back. We ordered the Duck Pate and Mousse, Puffed Potato and Egg, Squid Ink Pasta, Banh Mi Pork Belly, Grilled Spanish Octopus, 38 North Duck Breast, Duo of Beef Ribeye and Braised Short rib, Da Burga, and the Peanut Butter and Jelly donuts. My favorites were the Duck Pate and Mousse, Puffed Potato Egg, and Squid Ink Patsa. The Duck Pate and Mousse was amazing the layer was mustard goes so well with the pretzel bread. Puffed Potato Egg came together so well it was lightly fried and amazing. I am also totally obsessed with the Squid Ink Pasta! The Pasta was nice and briny and went so well with the seafood.", "rating": 5, "date": "2016-03-23"}, {"excerpts": ["Da Burga, definitely one of the best in town, it will sate the insatiable.  "], "author": "Kevin M.", "review": "So much delicious going on I'm not sure where to start, so let's start with the team!  This is the ultimate neighborhood restaurant that any pleasant urbanite would dream having in their quaint part of their metro.  Its the place where everyone knows your name.\n\nOpen for brunch and dinner, the team is always ready to greet you with smiles, provided you smile too, and guide you in to sit down and explore the milieu of amazing beverages, yes, unique in nature, you'll find wines and ciders(yes get those), that you never knew about and most likely won't forget. For you teetotalers, there is a zero-alcohol Pimm's Cup derivative which will make you order three and you'll feel 100% sober, except slightly guilty, maybe.\n\nOn to the food - starters are amazing, don't skip the duck paté, this was my go-to until foie became legal again.  Yes.  Foie.  Live with it.  Puffed potatoes are unstoppable, so why are you not ordering them.  Da Burga, definitely one of the best in town, it will sate the insatiable.  It has matured into perfection.\n\nChef Halverson is a pasta expert so always get a pasta course.  And if they have the Octopus Okonomiyaki, duh, get that!  Entrees are stunning and stuffing, fish dishes here i have had rock, but don't overlook the duck.  Halverson has webbed feet or something, which propels his duck cookery skills into flight mode.  \n\nDessert is a cute journey into nostalgia, and I'll leave that to surprise you.  Just think of your favorite childhood dessert and nuff said.\n\nExcept, get off thine posterior and harken off to Stones' Throw, stat.", "rating": 5, "date": "2015-01-25"}, {"excerpts": ["We were debating if we should order 3 small plates and 2 mains but the only main that was appealing to us was Da Burga "], "author": "Linda N.", "review": "We had dinner reservations here at 5:45 on a Thursday.\n\nWe were debating if we should order 3 small plates and 2 mains but the only main that was appealing to us was Da Burga so we decided on 4 small plates and 1 main.\n\n\"How was the potato puffs?\"  Delicious.- This delicate potato puff was perfectly cooked and the egg yolk had the perfect consistency.  \n\n\"How was the duck pate?\"  Delicious.- I love pate and to smear and on the mini loaf of pretzel bread made it more enjoyable.\n\n\"How was the pasta?\" Delicious.- I've never had squid ink pasta before.  Honestly, I don't know if it's supposed to taste the way it sounds but it was good.  \n\n\"How was the pork belly?\" Delicious.- The pork belly was okay but the crispy pig ear was yummy.\n\n\"How was the burger?\"  Delicious.- Soft brioche bun, juicy meat, melted cheese, and tasty cole slaw with a side of crispy tots.  FAB-U-LOUS.  They even divided it onto two plates for us!  \n\n\"How was the chocolate cake?\"- Delicious.- Really rich, like really.  The caramel made it a little too sweet for me but it was good.\n\n\"How was the apple pie?\"  Delicious.- This was a creative, innovative, and tasty version of the apple pie.  Very different and worth the try.\n\nFrom the time I sat down to the time I threw my white towel on the table, service was impeccable.  The servers were very attentive and friendly.  I love, loVe, LOVE the decor style.", "rating": 5, "date": "2014-06-22"}, {"excerpts": ["\"Da Burga\" - Very solid burger with a thick patty on a toasted brioche bread that did not get soggy even to the very last bite. "], "author": "Cindy A.", "review": "The 4 snacks, 5 starters, and 5 entree menu is small and simple with thought out dishes. \n\nPuffed potato eggs - This is the best dish of the night. As a lover of potatoes and all things egg, I'm amazed at how they even constructed this dish. The outside is perfectly crispy and once you bite into the potato, you get a slightly running yolk inside. \n\nSquid ink conchiglie pasta -A perfectly balanced dish. There was enough flavor and salt to compliment the seafood, but not over power it. \n\n\"Da Burga\" - Very solid burger with a thick patty on a toasted brioche bread that did not get soggy even to the very last bite. There wasn't any faults in the burger, but I wouldn't say it's one of the best I've ever had. \n\n\"Toad in the Hole\" Lasagna - The dish looks small, but it's very hearty and you really can't say no to runny egg. The mushrooms layered in this lasagna are very earthy and rich. The greens on the dish helped with presentation, but I didn't particular think they add much to the dish in terms of taste\n\nChocolate Bananas Foster- DELICIOUS. Not too sweet even though we got a heavy hand of the caramelized banana and walnut topping. The brownies pieces are small but incredibly decadent. My boyfriend and I were thinking about ordering two dessert dishes, but the waiter suggested sharing just one. He was right.\n\nMy boyfriend and I split all the dishes above and walked away satisfied with only $40 damage to our wallets.", "rating": 4, "date": "2014-05-26"}, {"excerpts": ["\"Da Burga", "\" aka ", "Da Disaster - ", "Our waiter was pushing the burger super hard when we asked for a recommendation, so we decided to trust him. ", "I'm glad we did. ", "I've never really had a religious experience before, so I don't know if this was one, but ", "I'm pretty sure it was. ", "Also, Cheddar. ", "Bacon. ", "Tater Tots. "], "author": "Jonathan B.", "review": "Had an absolutely amazing meal here over the weekend. The space is very attractive, and the seating is well-spaced (read: you won't be sitting on top of the couple next to you). \n\nHighlights (there were lots of them): \nPuffed potato & eggs - The yolk is INSIDE the potato... think about it.\n\nDuck Pate & Mousse - I love pretty much anything involving liver. I'd eat 5 of these.\n\nSquid Ink Pasta - Bright flavors from this dish. Slightly briny in a good way. I know that a lot of people on here are all about this dish, and don't get me wrong I thought it was really good... Just not amaaazing.\n\nPan Roasted Salmon - One of the best salmon dishes I've had anywhere. And I've eaten a lot of salmon... so you can totally trust me. \n\n\"Da Burga\" aka Da Disaster - Our waiter was pushing the burger super hard when we asked for a recommendation, so we decided to trust him. I'm glad we did. I've never really had a religious experience before, so I don't know if this was one, but I'm pretty sure it was. Also, Cheddar. Bacon. Tater Tots. Drops Mic.\n\nSo ya, it's good you should go.", "rating": 5, "date": "2015-07-27"}, {"excerpts": ["We also ordered \"da burga\" with tater tots and the asparagus w/ duck confit hash which were both just a tasty.  ", "The duck confit by itself was a bit on the saltier side, but once you mix the bite with a piece of the biscuit + the runny eggs, it was solid flavor combination in my mouth.  ", "Da burga was cooked to perfection, we asked for it to be medium and that was def. ", "what we received, one juicy well seasoned burger.  ", "The tater tots accompanied with it is just as amazing!  "], "author": "Janetto L.", "review": "Our new found brunch (and dinner) spot!  \n\nIt's been awhile since a restaurant has captivated me with 5 stars, but Stones Throw is a solid 5 and more!   From the decors to the staff down to their amazing food, they are the perfect restaurant of what every new establishment should be.\n\nWe arrived about 10 minutes before they open their doors on a Sunday morning.  We left the house a little bit early in fear that parking was going to be hard.  It can be, especially on Hyde St., but thankfully Stones Throw has teamed up with Uber.  Instead of having to worry about parking, Uber it and show your receipt to your server, 5% will be taken off your bill.  Not only is that one great way to accommodate your customers, the hostess literally walked outside and welcomed us into the restaurant even before they were opened for service.  The staff all felt that it was too chilly to be outside so although they were still setting up some things, they wanted us to be indoors.  Totally a nice gesture on their part that will be ingrained in my head - we got to stay warm and preview the bar while looking through the menu.  If you are into beers, you will definitely appreciate their  extensive selection.  \n\nNot only was the front of the house super warm and welcoming, our server Danielle was amazing too!  Super cheerful and friendly, she's the exact person to help bring a smile to anyone's face.  She was very attentive all throughout our brunch, constantly filling our waters and checking if she could get us anything.\n\nSimplicity is the key to this successful eatery.  Their brunch menu is not too extensive, but they keep things simple by focusing on a few small bites, some savories, and a few sweets.  Thanks to the recommendations of Cherylynn N., we started with the Puffed Potato & Egg and boy, they were insanely delicious (thanks Cherylynn!).  I'm usually not a fan of egg yolks either, but the techniques in preparing this dish made us yearning for more!  The chefs not only managed to get the yolk oozy delicious, but the outer layer on the potato had the right amount of crispiness.  \n\nWe also ordered \"da burga\" with tater tots and the asparagus w/ duck confit hash which were both just a tasty.  The duck confit by itself was a bit on the saltier side, but once you mix the bite with a piece of the biscuit + the runny eggs, it was solid flavor combination in my mouth.  Da burga was cooked to perfection, we asked for it to be medium and that was def. what we received, one juicy well seasoned burger.  The tater tots accompanied with it is just as amazing!  Bacon, sour cream, and chives blended into each tater tot as if I was biting into a loaded potato.\n\nTo balance out the savories, we opted for the spiced pumpkin doughnuts with pumpkin butter as our dessert.  The doughnuts were light and fluffy and resembled a lot like beignets.  I'm nowhere close to being a pumpkin fan like my husband, but even I liked it.  It's not often that he finishes his dessert either but when he does, you know it's a great dessert.  The pumpkin butter was a nice touch, he only wished there was more of it and maybe have it filled inside each doughnut.   \n\nLook no further, stop by Stones Throw for either Sunday Brunch or a nice dinner, you will not be disappointed!", "rating": 5, "date": "2014-03-28"}, {"excerpts": ["We got the Duck Pate & Mousse, Puffed Potato & Egg, Pork Belly & Crispy Pig's Ear, \"Da Burga\", the duck breast, and the apple pie.  "], "author": "Joyce C.", "review": "I brought my boyfriend here for his birthday a few moths back.  The food was awesome!\n\nWe got the Duck Pate & Mousse, Puffed Potato & Egg, Pork Belly & Crispy Pig's Ear, \"Da Burga\", the duck breast, and the apple pie.  I have to say, I LOVED the puffed potato and pork belly.  \n\nThe service was great and I will definitely be back!", "rating": 4, "date": "2014-05-04"}, {"excerpts": ["Da Burga"], "author": "Michelle K.", "review": "Yes Please!\n\nI went to Stones Throw last night and it was a great experience.\n\nFor those who are looking for the quick recommendations - here were my favs:\n- Duck Pate - Perfect in every way. Loved the warm pretzels!\n- Squid Ink Pasta - if you like seafood, order this. Has a perfect kick.\n- Pork Belly Salad - NOMZ! Perfectly cooked Pork Belly \n- Any dessert - they're all deconstructed and fab. \n\nThe longer review.\n\nShowed up a few minutes before my 8pm reservation. The host gave us a 'proactive apology' that there would be a delay as they were very busy along with 2 glasses of Champange.\n\nEnded up sitting down around 8:30 and staying until 11 or so.\n\nI admit that we went a bit overboard with ordering but wanted to try everything!\n\nAside from the four items I wrote about above, we also tried...\n- Puffed Potato and Eggs: Good but not INCREDIBLE\n- Dungeness Crab Salad: Again, this was good but I probably wouldn't order again. It was a bit over seasoned in my opinion and I was hoping for pure Crab especially since it's crab season in SF!\n- Raviolo: I had never had a Raviolo, i.e. a giant Ravioli but this was worth trying. Very rich and hearty and something that I'd recommend sharing only because it's so heavy. \n- Salmon: YUM! big fan - good mix of flavors.\n- Da Burga: The potato tots are GREAT - yum!\n\nI look forward to heading back in 2 weeks :)", "rating": 5, "date": "2013-11-27"}, {"excerpts": ["* \"DA BURGA", "\" aka DA DISASTER :: ", "5/5 stars :: everything was perfect, from the great sauces all the way down to the ooey gooey of the cheese melting down the sides of the patty!  "], "author": "Tina F.", "review": "After reading an article from Zagat about Stones Throw's brunch I decided to check it out on Yelp, to my surprise I had already book marked it!  Looking at the menu + pictures, I decided I had to try it out.  I search on a table for Sunday morning and OMG, they have availability the upcoming weekend.  \n\nNo, I didn't have to schedule it weeks in advance and no I didn't have to go online at midnight to try to get a table for the next day block (30 or 60). \n\nApproximately an hour before our reservations I receive two text messages from them.  First one to double check if our situation had changed and whether or not we were still coming.  And the second one was a tip regarding parking.  They suggested we take an Uber and if we did, it would be 5% off our entire meal!  Woaaa that is sooo cool!  We opted not to take Uber, only because we had several errands we had to run that day.  We will definitely take them up on that offer when we have dinner there.  And trust me, after that brunch... we will have many dinners there.\n\nReservations were at a decent time, 11:30!!  We show up about 25 minutes early, because we're always early.  Luckily they have availability and seat us immediately.  We ordered:\n\n** PITCHER OF PIMM'S :: 4/5 stars :: for $20, it's a pretty good deal.  And normally I'd say a pitcher for $20 is a great deal, but the pitcher was FULL of ice and the glasses they brought to pour the PIMM'S in was also full of ice... so it was a bit deceptive.  But it was very refreshing and great compliment to brunch\n** SMOKED SALMON MOUSSE sans scallions :: 5/5 stars :: so much flavor!  mousse was extremely smooth and the pickled items they added complimented the mousse w/o overpowering it.  I think they also added fried capers, which I love!  It added another level of texture.  The bagel chips were a bit hard, I was worried about my teeth on a couple bites!  :D\n** DUCK CONFIT HASH :: 5/5 stars :: I don't even know where to begin. This was AHHHH-mazing!  I don't even want to describe it, I know I can't do it justice!  Only one other thing to note, I don't even like English peas, but they made me like it!\n** \"DA BURGA\" aka DA DISASTER :: 5/5 stars :: everything was perfect, from the great sauces all the way down to the ooey gooey of the cheese melting down the sides of the patty!  Probably my favorite burger in the city for now.\n\nStaff was friendly and perfectly attentive.  I love this place and can't wait to come back for dinner!  Happy eating!", "rating": 5, "date": "2016-05-02"}, {"excerpts": ["For my main I had \"Da Burga\". ", "It was pretty tasty. ", "Up there with Marlowe and Zuni which is saying a lot. ", "The stuffed tater tots were amazing. \n", "So, with the quaint and romantic surroundings in Russian Hill, I thought this place was definitely BOMB rating. ", "I look forward to returning."], "author": "Matt H.", "review": "I went to Stones Throw last night. Thoroughly enjoyed myself. \nStandouts:\nService - service was absolutely amazing. From the super friendly hostess who seated me to our awesome server Angelyne to the friendly guy who topped my water off at least a dozen times (he has an eagle eye and will swoop in to top your water off if your glass is half empty without fail) to the professional chefs in the kitchen who we could hear working in unison - the service blew me away and was as good if not better than 2 or 3 star Michelin restaurants. I never review service in my reviews because to me it just isn't that important to me, however when you get service that is as good as this you realize how every restaurant you spend your hard earned money in should have service this good.\nFood - I thought the food was divine. My mind was not blown, but I thought everything I tried was excellent. I had the egg puffs and duck pate to start. Both were quite nice. The house made pretzel rolls for the pate was a nice touch and everything worked quite well together. Alysha poured us perfect tastings for 4 different wines before we made our selection (gladly, I'll add, which again was foreign to me). I went with the Pinot, which was beautiful. \nWe shared the burrata salad. It was pretty good, but I didn't think it was amazing. For my main I had \"Da Burga\". It was pretty tasty. Up there with Marlowe and Zuni which is saying a lot. The stuffed tater tots were amazing. \nSo, with the quaint and romantic surroundings in Russian Hill, I thought this place was definitely BOMB rating. I look forward to returning.", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["We shared a couple of dishes which were all very good, the standout being the Da Burga. ", "The slaw that they use on it complements the richness of the cheese and meat perfectly. ", "The Everything Tots that come with it are an experience themselves as well. ", "Needless to say, we have returned a few times to relive the experience of Da Burga. ", "Once was when my wife was pregnant and thus couldn't eat the burger at their usual medium rare serving. ", "When they brought out the meal the waiter actually waited for my wife to cut into it to see if it was cooked enough. ", "Before she even thought about it, he was taking it back to the kitchen so that they could cook it just a little bit longer. ", "Literally, three people swung by to make sure that it was okay the second time around. ", "We weren't upset, we didn't make any big commotion, but it was SO NICE, to know that they genuinely cared. ", "That made the experience even better! ", "Kudos to the staff of Stones Throw! ", "We shall return (the wife is excited to get Da Burga at the proper temperature now that the baby is out)."], "author": "Ben B.", "review": "I have had really good experiences at Stones Throw. We first went for my wife's birthday, when they certainly pulled out all the stops. We shared a couple of dishes which were all very good, the standout being the Da Burga. The slaw that they use on it complements the richness of the cheese and meat perfectly. The Everything Tots that come with it are an experience themselves as well. Little balls of cheesy salty goodness.\n\nNeedless to say, we have returned a few times to relive the experience of Da Burga. Once was when my wife was pregnant and thus couldn't eat the burger at their usual medium rare serving. When they brought out the meal the waiter actually waited for my wife to cut into it to see if it was cooked enough. Before she even thought about it, he was taking it back to the kitchen so that they could cook it just a little bit longer. Literally, three people swung by to make sure that it was okay the second time around. We weren't upset, we didn't make any big commotion, but it was SO NICE, to know that they genuinely cared. That made the experience even better! Kudos to the staff of Stones Throw! We shall return (the wife is excited to get Da Burga at the proper temperature now that the baby is out).", "rating": 5, "date": "2015-05-24"}, {"excerpts": ["Da Burga ", "w baked potato tots - definitely worth getting. ", "You can't go wrong with the tots..think deep fried baked potato skins w bacon! "], "author": "Cindy N.", "review": "Believe the hype, this restaurant is pretty damn good! Go with a group so you can share family style.\n\nPuffed Potato & Egg - wow...just wow. A deep fried mini potato ball with a creamy egg yolk! So good we asked for seconds.\n\nSquid Ink Conchiglie Pasta - flavorful! Must get this when you're here.\n\nDa Burga w baked potato tots - definitely worth getting. You can't go wrong with the tots..think deep fried baked potato skins w bacon! Yum!\n\nChocolate Banana Foster - if you like banana foster, you need to get this!", "rating": 5, "date": "2014-05-27"}, {"excerpts": ["I have tried everything that's currently on the menu (expect Da Burga) and you really can't go wrong. "], "author": "Lauren C.", "review": "I have been lucky enough to dine at Stones Throw twice in the last week. The beer and wine selection (50 of each) is awesome and the staff is super helpful in helping you identify what you'd like based on your preferences.\n\nThe food is the real winner here. I have tried everything that's currently on the menu (expect Da Burga) and you really can't go wrong. Don't miss the following:\n\n- Puffed Potato & Eggs: in fact, order 2. One order comes with 4 pieces of these tasty, pillow-like bites and an amazing sauce\n- Duck Pate: Possibly the best thing on the menu. Decent chunk of spread only comes with 2 pretzel balls - might want to order an extra pretzel or two (there's more than enough meat to cover it)\n- Squid Ink Pasta: assortment of shellfish, spicy capers and kale. Scraped the plate clean.\n- Octopus Okonomiyaki - the Okonomiyaki Pancake was divine, but the octopus was slightly over-charred for our liking. Nevertheless, we still inhaled it.\n- The Chicken Main Course - so good. Ordered it both times and finished it both times.\n\nThe first time we were there the chef came over to our table to thank us for dining. We enjoyed a beer with him and though the whole experience was amazing. Both times I was there the chef also presented our table with a free dish (duck pate the first time, roasted sunchoke soup the second). Although I will probably wait a little longer until my next visit (for the menu to change), I can't wait to go back.", "rating": 5, "date": "2015-01-26"}, {"excerpts": ["\"Da Burga\" ($16):\nHighly recommended if you like burgers. ", "It was cooked perfectly medium rare "], "author": "Julia H.", "review": "Had a really great dinner here and would recommend trying it!\n\nPuffed Potato & Eggs with Cauliflower Mousse, Chives, Crispy Chicken Skin ($8)\nI thought the puff was a lot smaller than what it looked like in pictures, but it was still really good and a great dish to start with. \n\nSquid Ink Conchiglie Pasta ($15): \nMy favorite dish of the night. Best squid ink pasta I've ever had! Not too heavy with sauce, but extremely flavorful. Only downside is that the portion was pretty small and I wanted more after I finished. \n\nWarm Pork Belly & Crispy Pig's Ears with Grilled peaches and apricot vinaigrette($14): \nThe Pork Belly was very tender and I loved the crunchy pig ears. I really enjoyed the fruit element as well, which made the dish less heavy and overwhelming. \n\n\"Da Burga\" ($16):\nHighly recommended if you like burgers. It was cooked perfectly medium rare and I loved the \"Everything\" Baked Potato tots that came with it!\n\nChocolate Bananas Foster ($8): \nThe presentation of this dish was unique as they pour a boiling caramel sauce on top; however, I thought it was a little too sweet and rich for me. \n\nOVERALL:\nThe food was really good and memorable so I would definitely come back again, especially for the squid ink pasta. Parking is a real pain though and we were circling around the neighborhood for around 20 minutes, so be prepared if you plan on driving and you have a reservation!", "rating": 4, "date": "2014-09-19"}, {"excerpts": ["Definitely coming back here to try da burga my next visit to SF!"], "author": "Joanna L.", "review": "We started off with the duck pate, puffed potato and eggs, and warm mushroom ragout followed by the squid ink pasta and warm pork belly - every dish was bursting with flavour and definitely woke my taste buds. Definitely coming back here to try da burga my next visit to SF!", "rating": 4, "date": "2014-11-25"}, {"excerpts": ["I went with the burger (da burga) with a side of loaded tater tots. ", "I thought the burger was OK. ", "With a hefty $17 price tag, i was expecting better but in my opinion it was too rich. ", "the bun felt and tasted soaked in butter, the meat was average at best ", "and it wasn't really \"dressed up\" with anything more than some cheese.  ", "The loaded tater tots were very good however. ", "You bite into them and it tastes like you are eating the best part of a baked potato. ", "My girlfriend got the scrambled egg dish with vegetables which she was satisfied with but nothing special (not too many vegetarian options on the Menu). ", "We also split the salad with green goddess dressing and avocado.  "], "author": "Steven G.", "review": "Decided on Stones throw for a brunch with 4 people. I made a reservation 2 weeks in advance and got called, emailed, and texted reminding me of my reservation which was a bit bizarre. \n\nI went with the burger (da burga) with a side of loaded tater tots. I thought the burger was OK. With a hefty $17 price tag, i was expecting better but in my opinion it was too rich. the bun felt and tasted soaked in butter, the meat was average at best and it wasn't really \"dressed up\" with anything more than some cheese.  The loaded tater tots were very good however. You bite into them and it tastes like you are eating the best part of a baked potato. My girlfriend got the scrambled egg dish with vegetables which she was satisfied with but nothing special (not too many vegetarian options on the Menu). We also split the salad with green goddess dressing and avocado.  It was definitely on the smaller side and worth a split as an appetizer as it was well dressed and the ingredients were fresh.\n\nThey have a good bottled beer selection but good luck finding a bottle worth getting for less than $12.\n\nAll in all, stones throw was good food at an unreasonable price point. \n\n2 burgers, a breakfast sandwich, scrambled eggs, 2 beers and the mimosas for the table ($25) came out to $160+ and definitely not worth it for the quality of the meal.", "rating": 3, "date": "2015-01-25"}, {"excerpts": ["Da Burga 4/5 ", "- I've had my fair share of gourmet burgers and this is pretty top notch. ", "Ordered the meat medium-rare ", "and that's what I received (so hard to find a restaurant that doesn't overcook the meat!). ", "The tater tots are genius! ", "It's infused with what tastes like sour cream, cheese, and other herbs. "], "author": "Donna M.", "review": "**Utilize OpenTable before attempting to dine here! We had reservations at 8pm for a table of 2 and we still needed to wait about 10-15 minutes on a Tuesday night. There were many more patrons awaiting a table who arrived before us, so definitely take advantage of making rezzies ahead of time.\n\nWhat we ate:\n\nPotato Puffs 4.5/5 - soo delicious! One of the best Scottish eggs I've had! The poached egg broke beautifully and didn't overpower the taste of the potato crust. The cauliflower puree was nicely done and really brought the dish together. My only gripe is that I couldn't find the chicken skin!\n\nDa Burga 4/5 - I've had my fair share of gourmet burgers and this is pretty top notch. Ordered the meat medium-rare and that's what I received (so hard to find a restaurant that doesn't overcook the meat!). The tater tots are genius! It's infused with what tastes like sour cream, cheese, and other herbs. Not to mention, deep fried to utter perfection.\n\nPotato Pancake with Squid 4.5/5 - I've never had something so delicious. All of the side dishes were designed to enhance the flavors of this starter, which again, was genius. \n\nI'm sad that i was too full to try to the banana foster, but we shall meet again Stones Throw.", "rating": 4, "date": "2014-09-17"}, {"excerpts": ["da burga...", "INSANE. ", "Party in your mouth, 100%. "], "author": "Gillian W.", "review": "Any one giving this place 3 Stars is clinically insane.\n\nDuck pate, puffed potatoes, squid ink pasta, da burga...INSANE. Party in your mouth, 100%. It also looks so pretty and inventive and fun. \n\nThe beer and wine selection is ginormous and the helpful/amazing staff are so happy to help you figure out what you're doing with your life (re: drinks)!\n\nIf I could, I'd work there just so I could partake in the \"family dinners\" they do before service.", "rating": 5, "date": "2014-06-02"}, {"excerpts": ["\"Da Burga\" with Loaded Tater Tots = EXCELLENT. "], "author": "Roy C.", "review": "*4.5 stars*\n\nI really feel that I need to stop saying this with each new restaurant that I try because each time I say it, it lowers my credibility, but for some reason, it keeps being true: this is my favorite new restaurant in SF. \n\nThese new restaurants have been KILLING it in San Francisco recently and there hasn't been a more exciting time to be trying new places in the city. Stones Throw is just the most recent addition to this list and, for the most part, it stands triumphant.\n\nThe decor is ultra-minimal (feels like an art gallery without the art), the atmosphere is intimate yet lively, and the service is INCREDIBLE. Perhaps it's just the honeymoon stages of a new restaurant (before exhaustion and tenure lead to jaded indifference), but every employee that we came into contact with was cheerful, friendly, and absolutely on-point. Even the busboys were chatting up a storm with us, asking us our favorite dishes thus far and adding in their recommendations. I'll call out our server, Dave L, specifically, because he was awesome -- our wine and water glasses were always filled; his food descriptions were excellent; and he was honest with us about a couple of dishes to avoid for the night (which I always appreciate).\n\n-----------------------------\nFOOD:\n\nPuffed Potato & Egg = GREAT. Nice crisp, delicious subtle flavor.\n\nDuck Pate w/ Pretzel = GREAT. Smooth and creamy pate, nice salty touch from the pretzel.\n\nSquid Ink Pasta = EXCELLENT. Never had squid ink pasta shells (it's usually in spaghetti or paella form), but this is amazing for squid ink lovers.\n\nGrilled Octopus = GOOD. Good flavor but wasn't grilled enough. I prefer the grilled octopus at Mason Pacific.\n\nPork Belly Salad = EXCELLENT. Perfectly cooked crispy pork belly with a nice sweet kick from the pickled onions.\n\n\"Da Burga\" with Loaded Tater Tots = EXCELLENT. Love the oily brioche bun; the meat was a juicy and perfectly-cooked medium rare; and the loaded tater tots were addicting as hell.\n\nGrilled Rib-Eye = OKAY. This was the one truly disappointing dish of the night -- the rib eye wasn't very tender and the flavors were actually pretty boring. I wish I had listened to my gut and went with the duck that everyone raves about.\n\n-----------------------------\nDESSERTS:\n\nI was on the fence with the desserts because even though I understand and appreciate their idea of adding a fancy twist to old childhood favorites, some of them just didn't really work. \n\nIn particular, the \"Not Your Grandma's Apple Pie\" is a complete deconstruction and then molecular gastronomic reconstruction of \"apple pie\" -- so instead of a warm, crumbly apple pie, it's a cold apple-flavored pot de creme with a crispy wafer roll. It wasn't that the flavors weren't good (they were), but it's just not what I was expecting and I think the dessert is done a disservice by being compared to an apple pie.\n\nThe PB&J donuts were good, but the donuts weren't airy enough. The Oatmeal Cream Pie didn't really stick out as memorable either -- it just tasted like an overly-sweet... well yeah... Oatmeal Cream Pie.\n\n-----------------------------\n\nStones Throw has the potential to be one of the best American Contemporary restaurants in SF. It has the talent, the service, the menu, and actually quite reasonable prices. If it weren't for the Rib Eye and the strangely uninspired desserts, I would've easily given this place a resounding 5 stars. I'll definitely be back though, and I'm pretty confident that once it gets it's gears going, Stones Throw is going to be among the very top of the SF restaurant food chain.", "rating": 4, "date": "2013-11-26"}, {"excerpts": ["P \n\n- Da burga: "], "author": "Amy S.", "review": "5 stars for the food (we came here for brunch), 3 stars for the service (our waiter was extremely unfriendly) \n\nThings I tried:\n- Puffed Potato and Egg: SO SOOOOO SOOOOO GOOD!!! If you're from LA and know Porto's, think potato ball, with an egg yolk on the inside. It was heavenly. The potato and crust was super flavorful and the cauliflower mousse that came with it was just amazing. I could have eaten all four =P \n\n- Da burga: Who eats burgers for brunch?? WELL I DID AND IT WAS DELICIOUS! This thing was HUGE! AND it came with the best tater tots I've ever had. Like the description said, it literally had everything. It tasted like it had cheese and chives and other magic ingredients. And the burger, that's a whole other story. The bun was crispy on the top but soft, the meat was covered in cheese, and it had this amazing cole slaw that was just AMAZING. \n\n- Asparagus & Duck Confit Hash: two of my friends got this as recommendation from our waiter and they both really enjoyed it. The egg was perfectly cooked and I tried the duck and it was so tender! \n\nDefinitely worth a try seeing as it's still new and not super crowded yet. I'd still make a reservation just in case. It's definitely worth a try!", "rating": 4, "date": "2014-05-07"}, {"excerpts": ["Followed by the every healthy Da Burga... really delicious.  "], "author": "Michael F.", "review": "Loved it.  Had the Beets starter and the Duck Pate (with Yummy Pretzel Rolls).  Followed by the every healthy Da Burga... really delicious.  Finished with the Lemon Meringue... which was fantastic.  \n\nTerrific atmosphere... really great, energetic staff with excellent wine selection.", "rating": 4, "date": "2014-01-10"}, {"excerpts": ["(I heard the octopus was amazing and will get that next time instead)\n\nENTREE - 3.5\nWe all got \"Da Burga\" (4 stars) all around the table. "], "author": "Erica L.", "review": "Overall a great experience and I will definitely come back to try more of their menu. Here is how I rate the experience by courses:\n\nSNACKS - 5 stars\nSalted beets + burrata - excellent, interesting presentation where it looks like tartare\nPotato puffs - BOMB status, GET THIS\nPretzel with duck mousse/pate - 5 stars & BOMB status, GET THIS\n\nAPP - 3 stars\nThe crispy pork belly  salad was actually not that amazing. The pork belly was kind of dry; however, everything else in the salad was awesome, especially the fried pork ears. (I heard the octopus was amazing and will get that next time instead)\n\nENTREE - 3.5\nWe all got \"Da Burga\" (4 stars) all around the table. First few bites were amazing - really good quality meat, yummy brioche-like bread, loaded with cheddar. BUT, it gets a little too rich and a bit much after a while, and this was probably the only burger i didn't finish in life (not due to portion size but due to the heaviness/richness). The twice baked potato tots that came as a side were also a bit rich (and a little salty), and I couldn't finish them either. (Next time I'd want to try the duck or rib eye)\n\nDESSERT - 4 stars\nPB & J donut/beinets - YUM! really good\n\nDef recommend and I look fwd to coming back!", "rating": 4, "date": "2013-12-07"}, {"excerpts": ["Da burga  was good and had a nice zing that came with the pickled cabbage.  ", "The tots that came with da burga were a little to flavorful, overly bacony.  ", "I could only eat one...\n", "The Egg n ", "a hole lasagna was tasty and the presentation elegant.  ", "One negative aspect of this restaurant is the limited menu.  ", "I think they should add a few more dishes or at least have nightly specials.  ", "Over all this place is definitely worth a visit."], "author": "Mr. P.", "review": "Nice spot!  The food had great presentation, flavor and texture.  Da burga  was good and had a nice zing that came with the pickled cabbage.  The tots that came with da burga were a little to flavorful, overly bacony.  I could only eat one...\nThe Egg n a hole lasagna was tasty and the presentation elegant.  One negative aspect of this restaurant is the limited menu.  I think they should add a few more dishes or at least have nightly specials.  Over all this place is definitely worth a visit.", "rating": 4, "date": "2014-05-04"}, {"excerpts": ["\"DA BURGA", "\" aka DA DISASTER is amazing! ", "Described perfectly by our wait person and pairs nicely with a Mr Pimms"], "author": "Jody G.", "review": "Nice neighborhood place!.\n\nGreat atmosphere.\nService was spectacular. \n\n\"DA BURGA\" aka DA DISASTER is amazing! Described perfectly by our wait person and pairs nicely with a Mr Pimms", "rating": 5, "date": "2014-11-02"}, {"excerpts": ["Out of a table of 4, we all ended up ordering the duck breast and the burger (Da Burga).  ", "Duck breast was quite tender and juicy.  ", "Despite what some of the reviews may tell you, the burger was flat out.... outstanding!  ", "Seriously, this burger (cooked medium rare and ground fresh) is in my list of top 3 burgers ever consumed in my lifetime.  ", "This restaurant is highly recommended.  ", "Do not miss this stop during your visit to San Fran.  ", "You won't regret it!"], "author": "Shia Y.", "review": "Patron beware, even if you have a reservation you may be required to wait for your table even if 1) there seem to be plenty of open tables, and 2) you are punctual.  That aside, the atmosphere is very casual despite the $$$ rating which lends to further comfort.  There doesn't appear to be any enforced dress code despite the dollar rating.  If it matters to you, they have an expansive wine and beer selection but no full bar.  In short, appetizers were very good; squid-ink pasta, duck pate, and halibut tartare.  Duck pate and squid ink pasta being on the stand out list.   Out of a table of 4, we all ended up ordering the duck breast and the burger (Da Burga).  Duck breast was quite tender and juicy.  Despite what some of the reviews may tell you, the burger was flat out.... outstanding!  Seriously, this burger (cooked medium rare and ground fresh) is in my list of top 3 burgers ever consumed in my lifetime.  This restaurant is highly recommended.  Do not miss this stop during your visit to San Fran.  You won't regret it!", "rating": 5, "date": "2015-08-07"}, {"excerpts": ["And this time I will try \"da Burga\" !\n", "If you are looking for a new gem for foodies you have it right there!\n", "See you soon !\n", "Sebastien Oxner"], "author": "jean sebastien o.", "review": "Just amazing ! The service was perfect and the food delicious ! Can't wait to go back on Thursday with some new friend! I had taken other friend last time and they already went back! I am looking forward for the octopus! And this time I will try \"da Burga\" !\nIf you are looking for a new gem for foodies you have it right there!\nSee you soon !\nSebastien Oxner", "rating": 5, "date": "2014-05-06"}, {"excerpts": ["P. My friend had \"da burga\" which came with the best tater tots I've ever had.  ", "My husband had the ribeye, which was perfectly prepared, and I had the pork tenderloin with pork belly spatzle.   ", "We finished with the donuts, smores and pavlova desserts which were all delicious.   ", "It's pretty unusual to find a place that does all three courses equally well and doesn't disappoint as the dinner progresses.  ", "This place has it all.  ", "To top it off, they have an extensive beer menu.  ", "I had the Dieu du Ciel Rigor Mortis which went well with everything, in addition to having a high enough ABV to make it worth the calories ;)."], "author": "Antoinette D.", "review": "This is my new favorite restaurant.   We had the squid ink pasta, mushroom ragout, potato & egg and octopus appetizers.   They were all good, but do yourself a favor and have the squid ink pasta and octopus!  I hate these things normally, but this place makes the pasta look so appetizing and the octopus is so tender, it's amazing! I couldn't resist a taste which eventually turned into almost finishing both dishes :P. My friend had \"da burga\" which came with the best tater tots I've ever had.  My husband had the ribeye, which was perfectly prepared, and I had the pork tenderloin with pork belly spatzle.   We finished with the donuts, smores and pavlova desserts which were all delicious.   It's pretty unusual to find a place that does all three courses equally well and doesn't disappoint as the dinner progresses.  This place has it all.  To top it off, they have an extensive beer menu.  I had the Dieu du Ciel Rigor Mortis which went well with everything, in addition to having a high enough ABV to make it worth the calories ;).", "rating": 5, "date": "2014-10-30"}, {"excerpts": ["The pork belly and the da burga were also delicious but the burger and the tater tots were a bit too salty eaten together. ", "Everything was perfectly cooked. ", "Service was wonderful, our waiter was very knowledgeable and gave us great recommendations from the menu. ", "I really liked the space too!"], "author": "lisa a.", "review": "The highlights were the stuffed potato eggs & grilled octopus (so tender!). The pork belly and the da burga were also delicious but the burger and the tater tots were a bit too salty eaten together. Everything was perfectly cooked. Service was wonderful, our waiter was very knowledgeable and gave us great recommendations from the menu. I really liked the space too!", "rating": 5, "date": "2014-01-14"}], "pitcher of pimms": [], "bottle of mimosa your way": [{"excerpts": ["Bottle of mimosa your way\n2. ", "Oysters on the half shell", "*\n3. "], "author": "Kayla N.", "review": "We tried dinner and brunch here.  Between the two options, we preferred the brunch.  \n\nFor brunch, we tried:\n1. Bottle of mimosa your way\n2. Oysters on the half shell*\n3. Smoked salmon mousse*\n4. Doughnuts\n5. Monkey bread\n6. Chili verde braised pork belly\n7. Soft scrambled*\n8. Duck confit hash*\n\n* Table favorites.  \n\nBoth times we had decent service.", "rating": 4, "date": "2017-04-30"}], "hop to it": []}