{"s classic submarine": [], "s cheese steak sub": [], "s italiano sub": [], "s turkey sub": [], "s roast beef sub": [], "s hot pastrami sub": [], "s corned beef sub": [], "s mortadella sub": [], "s salami sub": [], "s ham sub": [], "s cheese sub": [], "s bbq beef sub": [], "s the atomic sub": [], "g avocado salami and swiss cheese sub": [], "g avocado turkey and swiss cheese sub": [], "g avocado roast beef and swiss cheese sub": [], "g avocado pastrami and swiss cheese sub": [], "g avocado corned beef and swiss cheese sub": [], "g avocado roast beef and cucumber sub": [], "g avocado cheese and cucumber sub": [], "g turkey pastrami and cheese sub": [], "g turkey ham and swiss cheese sub": [], "g tuna salad combo sub": [], "meatball sub": [{"excerpts": ["I highly recommend their hot pastrami sandwich, turkey avocado, and meatball sub. ", "Those three are seriously what gets customers coming back every time. ", "The biggest deciding factor is their special sauce. "], "author": "John M.", "review": "Submarine Center is by far one of the best sandwich places in the Bay Area. I can personally say it is in my personal list of top 3 sandwich shops in San Francisco in general! If you don't agree with me then you will have to go there and see how busy it is! The sandwiches are absolutely fresh, warm, and everything just melts in your mouth instantly. I highly recommend their hot pastrami sandwich, turkey avocado, and meatball sub. Those three are seriously what gets customers coming back every time. The biggest deciding factor is their special sauce. It is some kind of italian dressing blend I believe but holy moly is it good. \n\nThis shop is no hassle to get to. There is plenty of parking in the residential areas near that place, and you are next to the West Portal station. \n\nWhen you walk in, you see a lot of sports memorabilia, especially 49ers gear.", "rating": 5, "date": "2018-04-03"}, {"excerpts": ["I ordered the Super for my Meatball Sub and after finishing, I was bloated. ", "I think the Center would have satisfied my hunger ", "and I would have been content with the Center. ", "All sandwiches come with mustard, mayo, onions, lettuce, tomatoes, and their secret sauce. ", "We brought back the sandwiches to work to eat (10-15 mins) and it does have a decent weight to it. ", "However my bread for the meatball sub was a bit burnt on top, but nothing too bad - still edible! ", "My meatball sub was drenched with red sauce which is good, but it didn't seem to pair well with the mustard and onions. ", "Also the meatballs were a bit bland in flavor - it simply tasted like the red sauce. ", "I'd prefer the meatballs to be more seasoned and more flavorful. ", "I would add cheese (extra money) to the sandwich if you're thinking of ordering a meatball sub. ", "Otherwise I think I'd order a different sandwich here. ", "I remember ordering the Hot Pastrami Sub (Super) the previous time I came here and that sandwich definitely tasted better and was not burnt at all. "], "author": "Alvin Y.", "review": "Came here Friday for lunch with co-workers. We ordered using Yelp's Eat24 service so when we arrived at 12:10pm, we just needed to walk to the right side of the sandwich shop to pick up orders. I like that there are two lines - one line for ordering (left side) and the other line for order pick ups. Submarine Center is right next to the West Portal metro station so it makes commuting here from work easy! The sandwich shop is not that huge (several tables), but the walls are aligned with sports memorabilia from the 49ers to the Giants and even the Warriors. Very cool to see if you're a sports fanatic.\n\nFor the sandwiches, they come in 3 sizes - Mini ($6.20), Center ($7.70), and Super ($9.75). If you can eat a lot, the Super is the one for you. I ordered the Super for my Meatball Sub and after finishing, I was bloated. I think the Center would have satisfied my hunger and I would have been content with the Center. All sandwiches come with mustard, mayo, onions, lettuce, tomatoes, and their secret sauce. We brought back the sandwiches to work to eat (10-15 mins) and it does have a decent weight to it. However my bread for the meatball sub was a bit burnt on top, but nothing too bad - still edible! My meatball sub was drenched with red sauce which is good, but it didn't seem to pair well with the mustard and onions. Also the meatballs were a bit bland in flavor - it simply tasted like the red sauce. I'd prefer the meatballs to be more seasoned and more flavorful. I would add cheese (extra money) to the sandwich if you're thinking of ordering a meatball sub. Otherwise I think I'd order a different sandwich here. I remember ordering the Hot Pastrami Sub (Super) the previous time I came here and that sandwich definitely tasted better and was not burnt at all. I also wish this sandwich shop had Dutch Crunch as an option for bread.\n\nOverall a decent price value for what you get. The Super is pretty good size for the sandwiches and you don't need to wait long if you order ahead. Plus with the walls filled with sports memorabilia, this sandwich shop is pretty cool. I'd come back again and try a different sandwich.", "rating": 3, "date": "2017-07-05"}, {"excerpts": ["Got a meatball sub here, pretty good but definitely not the best. ", "The service wasn't that great either. ", "The only communication I had with the cashier was when he told me the price. ", "You pretty much walk up to the front and tell one of the sandwich artists what you want and the cashier rings you up. ", "Cool little joint steps away from the West Portal muni entrance and relatively quick. ", "Go ahead and give them a shot, I will most likely be back to try the atomic sometime soon too!"], "author": "Navdeep D.", "review": "Got a meatball sub here, pretty good but definitely not the best. The service wasn't that great either. The only communication I had with the cashier was when he told me the price. You pretty much walk up to the front and tell one of the sandwich artists what you want and the cashier rings you up. Cool little joint steps away from the West Portal muni entrance and relatively quick. Go ahead and give them a shot, I will most likely be back to try the atomic sometime soon too!", "rating": 4, "date": "2017-08-11"}, {"excerpts": ["They are the reason why I eat veggies with my meatball sub... ", "I couldn't imagine it any other way now. ", "I dream about eating their sub often, I wish I could say that I go often though I don't ", "but I wish I could. ", "All I know is in 20 years I have relocated many times and many of my favorites have closed their doors, so it's great to see a love remain open. \n"], "author": "Madhu D.", "review": "Back in my SFSU college days, after class on special occasions (which meant when I had money to spare) I would take the Muni up to West Portal and enjoy a warm sandwich at this spot. It's where I discovered my love for meatball subs. It's a family run business. Mom and Dad and the mustached, cute sons. They were very quick, and it felt like the kind of place where you didn't want to mess up the rhythm so you better know what you want once you get up there. They were friendly through the process, yet you don't want to be that person slowing the machine. It's been nearly 20 yrs since my first steps into this spot and it's still the same... minus the mustached sons. The place was packed on a Saturday afternoon at 2pm. I starred in awe of the owners how they have remained the same... just with a few greys. The walls are still covered with the same local 49ers memorabilia and some new local additions. The main thing is that the food is still the same... the process, the taste, the small space and the machine is still pumping it out. I love their fresh cut pickles and cucumbers. I love that they heat up all the sandwiches. I love all of their toppings. They are so busy and constantly refilling it so you really don't get a bad piece. They are the reason why I eat veggies with my meatball sub... I couldn't imagine it any other way now. I dream about eating their sub often, I wish I could say that I go often though I don't but I wish I could. All I know is in 20 years I have relocated many times and many of my favorites have closed their doors, so it's great to see a love remain open. \nTill next time.\n\nps. parking does suck, but suck it up and hunt for a spot... or take the train or bus in.", "rating": 5, "date": "2017-04-21"}, {"excerpts": ["This time, he just had to have a meatball sub. ", "I had desperately craved a deli sandwich several weeks ago, so perhaps this one was just slightly delayed. ", "Unfortunately for him, he didn't get off work till past midnight, so short of making his own, finding one was impossible. ", "I promised I would take him to get a meatball sub the next day, figuring that since he's been so good about my cravings, I could indulge him this once.\n\n", "I'm pretty sure he would have been relatively content with a meatball sub from Subway or Togo's. ", "He, of course, ordered a meatball sub with provolone  and extra marinara sauce. ", "This is coming from a guy who refuses to order anything but a meatball sub at any other sandwich spot. \n\n"], "author": "Leigh R.", "review": "We all know that pregnancy cravings are intense. I have a particularly humorous story about one of those, but that's not what this review is about. \n\nSee, not everyone realizes that sympathetic pregnancy cravings are a real thing. This is evidenced by the fact that, after buying me a gallon sized package of Goldfish (because I was craving them,) and watching me gobble up a ridiculous amount, he proceeded to polish them off. \"I can't stop eating these!\" he said.\n\nLast night, another sympathetic craving hit. This time, he just had to have a meatball sub. I had desperately craved a deli sandwich several weeks ago, so perhaps this one was just slightly delayed. Unfortunately for him, he didn't get off work till past midnight, so short of making his own, finding one was impossible. I promised I would take him to get a meatball sub the next day, figuring that since he's been so good about my cravings, I could indulge him this once.\n\nI'm pretty sure he would have been relatively content with a meatball sub from Subway or Togo's. However, I decided that if I was taking him out for a sandwich, it was going to be a damn good one.\n\nI've been coming to Submarine Center for upwards of 10 years now. It was *the* place to go in high school on days when classes ended at noon. I don't get to go as often as I'd like, but when I do, it's consistently amazing.\n\nI had been telling my boyfriend about this place pretty much since we started dating. Almost a year later, I finally got to take him. He, of course, ordered a meatball sub with provolone  and extra marinara sauce. I ordered my usual hot pastrami with provolone, tomatoes, and secret sauce.\n\nI always worry when I take someone to try a place that I've recommended. What if they don't like it as much as I thought they would? Thankfully, Submarine Center is always amazing, and my boyfriend loved his sandwich.\n\nI've tried almost everything on the menu over the years, and everything has been delicious, but pastrami is my consistent favorite. It's tender, juicy, flavorful, everything pastrami should be. My boyfriend took a bite of my sandwich, and he said it was so good, it's making him consider ordering pastrami next time. This is coming from a guy who refuses to order anything but a meatball sub at any other sandwich spot. \n\nThere's only one type of bread that they use, but it's absolutely perfect. It has a good \"bite\" to it (not too hard, but not like you're biting into air either) and is toasted nicely. It might sound weird, since it's something so simple, but this bread can really set them apart from other sandwich places. I'm a huge fan of their secret sauce, and I find that it complements the pastrami perfectly.\n\nA lot of people are comparing Submarine Center to Ike's. Personally, I think they attract different audiences. Go to Submarine Center when you want a \"classic\" but really high quality sandwich. Go to Ike's when you want something richer, or a bigger variety of toppings. Ike's would probably be a better option for vegetarians and vegans too. It's really all about what you're looking for.", "rating": 5, "date": "2013-11-11"}, {"excerpts": ["The multi-hamed Classic Submarine is particularly outstanding, as is the Meatball Sub (preferably with melted Provolone), but ", "their sandwich making prowess can make even a mundane Turkey sandwich sing.  ", "Lines can extend beyond the door of the small shop, but they tend to move quickly despite the attention each sandwich gets.  ", "One word of advice: they go big on the onions if you request \"everything\" (which you should), so if you're not thusly inclined, ask them to go easy.  ", "Over the years, parking in West Portal has become pretty tough, so be prepared.  ", "I also noticed that you can also order for pick-up (no delivery, yet) via Eat24.  ", "A local favorite."], "author": "Ronald C.", "review": "As a native West Portalian and Sub Center regular for 25+ years, I hesitate to draw more attention to the sub mecca of the west (of Twin Peaks), for fear of further extending the wait for my favorite sandwich in the City.  But in the spirit of sharing, I highly recommend their sandwiches if you're in the neighborhood.  The key to Sub Center's brilliance is the toasting of the sandwich, in an open-faced fashion, to melt the cheese and crisp the french baguette to perfection.  The multi-hamed Classic Submarine is particularly outstanding, as is the Meatball Sub (preferably with melted Provolone), but their sandwich making prowess can make even a mundane Turkey sandwich sing.  Lines can extend beyond the door of the small shop, but they tend to move quickly despite the attention each sandwich gets.  One word of advice: they go big on the onions if you request \"everything\" (which you should), so if you're not thusly inclined, ask them to go easy.  Over the years, parking in West Portal has become pretty tough, so be prepared.  I also noticed that you can also order for pick-up (no delivery, yet) via Eat24.  A local favorite.", "rating": 5, "date": "2016-01-25"}, {"excerpts": ["Their pastrami, ham/turkey, or meatball sub are all amazing. ", "Definitely have to get it toasted with secret sauce. ", "Everyone  who works here is very friendly and recognize me. ", "When my brother was younger he used to get the pizza and that looked great too! ", "Definitely need to check this place out if you haven't already!"], "author": "Shannon P.", "review": "I have been coming here for almost 8 years, and I love it! Their pastrami, ham/turkey, or meatball sub are all amazing. Definitely have to get it toasted with secret sauce. Everyone  who works here is very friendly and recognize me. When my brother was younger he used to get the pizza and that looked great too! Definitely need to check this place out if you haven't already!", "rating": 5, "date": "2014-07-19"}, {"excerpts": ["My 2 favorite subs would have to be Atomic Sub (hot pastrami, roasted turkey breast, corned beef brisket) with avocado and jalapenos or the Meatball Sub. ", "The bread here is toasted perfectly, gives you a generous amount of meat, and omg the secret sauce ", "I do not know what it is but please more. ", "A must try when you passing by West Portal"], "author": "Alvin K.", "review": "I've been coming here since I was going to West Portal Elementary school which was back 99'. My top 3 favorite submarine place of ALL TIME. Most definitely not the cheapest place to eat but its well worth it. My 2 favorite subs would have to be Atomic Sub (hot pastrami, roasted turkey breast, corned beef brisket) with avocado and jalapenos or the Meatball Sub. The bread here is toasted perfectly, gives you a generous amount of meat, and omg the secret sauce I do not know what it is but please more. A must try when you passing by West Portal", "rating": 5, "date": "2015-11-04"}, {"excerpts": ["I had the atomic sub, which has pastrami, turkey, cheese, and hot peppers, and my friend had the meatball sub, which has yummy red sauce (and lettuce and tomatoes, which really add a nice touch).  ", "Both were DEE-LISHUS.  ", "I'm going to have to hang out in West Portal more from now on "], "author": "Kimberly Q.", "review": "Was in the neighborhood today, so a friend in-the-know and I ducked in out of the rain and bought a couple of hot sammywiches.  I had the atomic sub, which has pastrami, turkey, cheese, and hot peppers, and my friend had the meatball sub, which has yummy red sauce (and lettuce and tomatoes, which really add a nice touch).  Both were DEE-LISHUS.  I'm going to have to hang out in West Portal more from now on so I can try everything.  \n\nThe guys who work there are super-sweet too.", "rating": 5, "date": "2011-03-19"}, {"excerpts": ["Meatball Sub\n"], "author": "Daniel M.", "review": "This place does not disappoint!  \n\nI've been coming here since my junior year in high school, 1996, and the quality and taste of their sandwiches have not gotten worse over time!  14 years of consistency! \n\nCame here yesterday, Sunday, around 1ish for a sandwich with Melly Mel.  Kind of beat the rush, but even then they were a bit slow.....but I won't hold it against them!  The wait is worth it!  \n\nEvery sandwich is toasted, and they make it however you like it.  They have yet to mess up my orders, even when I ordered multiple sandwiches!\n\nHere's what I suggest one should try:\nItalian Sausage Sub\nMeatball Sub\nAtomic Sub\n\nParking can be a bit hard, but....when you find a spot, and take a bite into your sandwich...all that stress and anger you felt when some old lady stole your spot, will disappear.  And if it doesn't, maybe you should played parking chicken with that old lady.", "rating": 5, "date": "2010-11-08"}, {"excerpts": ["I did get a bite of my eating buddy's meatball sub.. that in itself was enough to warrant a return trip. ", "Love a good neighborhood place!"], "author": "tessie n.", "review": "It was like organized chaos with the crowd of people and the ordering. But the guys behind the counter knew what they were doing and did it well. \n\nOnly one kind of bread, but the toasting was the key. I had a healthier turkey, no mayo, no sauce, no cheese sub (yes I know.. but it's the new year and I was trying to make up for all the holiday piggie-ness). As \"clean\" as the sub was, it was still quite tasty. Turkey was moist, bread was warm and crispy. \n\nI did get a bite of my eating buddy's meatball sub.. that in itself was enough to warrant a return trip. Love a good neighborhood place!", "rating": 3, "date": "2011-01-03"}, {"excerpts": ["They make really tasty meatballs, so I recommend the meatball sub."], "author": "Andrew R.", "review": "Great sandwich shop in neighborhood of West Portal.  Thats right, I get around.  Grab a sandwich to-go and head up to Mt. Davidson to check out the gigantic cross that overlooks SF.  Its weird and cool at the same time.\n\nThey make really tasty meatballs, so I recommend the meatball sub.", "rating": 4, "date": "2009-09-28"}, {"excerpts": ["So after my softball game on Saturday, we stopped by here for a super meatball sub with all the fixin's. ", "The meatballs were DELICIOUS!! "], "author": "Jen D.", "review": "Eugy has been coming here since he was a young boy. He got so excited just talking about the sandwiches here. So after my softball game on Saturday, we stopped by here for a super meatball sub with all the fixin's. The meatballs were DELICIOUS!! The sauce was a little bland, but nothing some salt won't fix. \n\nI liked this place so much that as I was walking home from B2B yesterday, I stopped off and got a center turkey and swiss with all the fixin's. VERY VERY yummy. I love how they put the sandwiches in the over for a few minutes to melt the cheese and toast the bread before putting the final toppings on. Nice touch. \n\nBe prepared for a line if you go during lunch hours or on the weekend.", "rating": 5, "date": "2008-05-19"}, {"excerpts": ["I have tasted other people's subs, and the \"Bomb\" is scrumptious, the meatball sub....amazing....\n\n"], "author": "Bianca L.", "review": "Could I please give this place a 10???? For most San Franciscans, fond memories from high school, involve Sub Center...nomatter where you went, public,private.....Sub Center was part of it. The sandwiches are simply, the BEST in the city, actually, the best I have ever had...ANYWHERE!\n\nThe Scene\nThis is a gem of West Portal, mission impossible parking and all, once you enter into this small, 4 table heaven, you can say goodbye to all worries. Really, you stand in line, order your sandwich, shuffle along the counter to pay, and then out on those brown tray come the mana from heaven.\n\nThe Food\nLong ago, I tried the center turkey....and never have i strayed since....it is the perfect size, the special sauce is AMAZING, the bread is crisply, but soft inside, it soaks up the flavors of the turkey, the sauce, just PERFECTION....literally, my mouth is watering as I type....\nWhile I always order  the same thing....the guy even knows me, and what I order....over 12 years later, he still remembers me.....that is SERVICE!!!\nI digress....I have tasted other people's subs, and the \"Bomb\" is scrumptious, the meatball sub....amazing....\n\nI love this place to death, it is a family run business and I will die, literally, if they ever close.", "rating": 5, "date": "2008-07-01"}, {"excerpts": ["But the meatball sub is definitely worth it. ", "I've tried the others and they are pretty good too, but if I were to rate this place on just the other sammies, I'd give it a 3. ", "Throw MS into the mix, and it's a 4."], "author": "Peter T.", "review": "The place tends to get overcrowded and a bit chaotic. \n\nBut the meatball sub is definitely worth it. I've tried the others and they are pretty good too, but if I were to rate this place on just the other sammies, I'd give it a 3. Throw MS into the mix, and it's a 4.", "rating": 4, "date": "2007-06-08"}, {"excerpts": ["5/18/08 - Came here for a meatball sub after my first lunch at the pizza place down the street. ", "SOOOOO delicious. ", "I always get the meatball because of the seasoning in the meat. ", "Yum!"], "author": "Teresa Y.", "review": "Right next door is Toasties, and I will choose Submarine Center over that any day. Great sandwiches, but at a higher cost. Perfect bread every time. Quick with your orders and friendly staff.\n\nEdit: 5/18/08 - Came here for a meatball sub after my first lunch at the pizza place down the street. SOOOOO delicious. I always get the meatball because of the seasoning in the meat. Yum!", "rating": 5, "date": "2008-01-29"}, {"excerpts": ["The owner made sure my meatball sub was toasted just enough and checked on it once before taking it out. \n"], "author": "S c.", "review": "Went for lunch on a weekday.  I've been coming here for about ten years now and it hasn't changed. \n\n- Their meatball submarine is almost too delicious.  Juicy meatballs with a slightly sweet marinara sauce.  Got it with some provolone and everything else (lettuce, tomato, onion), but make sure you eat it relatively soon after picking it up.  The sub should still be crispy when you eat it but the marinara and special sauce gets soaked up in the bread\n- Good portions for the price\n- Quick service. The owner made sure my meatball sub was toasted just enough and checked on it once before taking it out. \n- Family run, making it such a cute shop\n\nIt makes you never want any chain sandwich place again!", "rating": 5, "date": "2011-07-20"}, {"excerpts": ["Today i had an opportunity to sample their Turkey / Cheese / Avocado sub along with their Spicy Meatball sub. ", "Each were decent sandwiches. ", "The very nice latin folks @ ", "Sub Center were careful if not measured with the amount of materials and condiments.  ", "This sort of reminded me of Subway.  ", "$20.00 for two sandwiches (1sm. ", "/ 1md.) was far more expensive than Subway and these guys are only a few bites ahead on flavor.  ", "If Sub Center is out of the way for you, there is no reason to make the trip across town.  ", "Marina Submarine (MS) on Union Street San Francisco has nothing to worry about.  ", "Till I find better, MS will remain the City Sub champ in my book."], "author": "Tom B.", "review": "Having heard quite a bit about Submarine Center, I was really looking forward to checking it out.  Today i had an opportunity to sample their Turkey / Cheese / Avocado sub along with their Spicy Meatball sub. Each were decent sandwiches. The very nice latin folks @ Sub Center were careful if not measured with the amount of materials and condiments.  This sort of reminded me of Subway.  $20.00 for two sandwiches (1sm. / 1md.) was far more expensive than Subway and these guys are only a few bites ahead on flavor.  If Sub Center is out of the way for you, there is no reason to make the trip across town.  Marina Submarine (MS) on Union Street San Francisco has nothing to worry about.  Till I find better, MS will remain the City Sub champ in my book.", "rating": 2, "date": "2011-07-17"}, {"excerpts": ["I'll definitely be trying the meatball sub next time."], "author": "Erica G.", "review": "Okay, so now I get it!  I was wondering how a tiny sandwich shop could be the most popular - and top rated - restaurant on Yelp.  So I finally tried one.  Here's why this place is so great.  The subs are served on soft, warm bread that doesn't make you look like a dog with a chew toy when you take a bite and is toasted so the cheese is perfectly melted.  I will say though, I tried to be healthy and ordered a turkey sub and had an awful case of food envy watching the meatball subs come out of the oven.  I'll definitely be trying the meatball sub next time.", "rating": 5, "date": "2006-04-19"}, {"excerpts": ["If I still lived in the Sunset and worked in W. Portal, I'd still be getting the meatball sub at this place each and every time I enter or exit that W. Portal station. ", "I always liked to time it just right to get my sandwich before the next train came. ", "Sometimes it worked and usually I'd miss my train. ", "Those guys in there are pretty damn quick. ", "The line moves fast. ", "They've got it down to a science."], "author": "Michael R.", "review": "If I still lived in the Sunset and worked in W. Portal, I'd still be getting the meatball sub at this place each and every time I enter or exit that W. Portal station. I always liked to time it just right to get my sandwich before the next train came. Sometimes it worked and usually I'd miss my train. Those guys in there are pretty damn quick. The line moves fast. They've got it down to a science.", "rating": 5, "date": "2007-01-21"}], "italian sausage sub": [{"excerpts": ["Here's what I suggest one should try:\nItalian Sausage Sub\n"], "author": "Daniel M.", "review": "This place does not disappoint!  \n\nI've been coming here since my junior year in high school, 1996, and the quality and taste of their sandwiches have not gotten worse over time!  14 years of consistency! \n\nCame here yesterday, Sunday, around 1ish for a sandwich with Melly Mel.  Kind of beat the rush, but even then they were a bit slow.....but I won't hold it against them!  The wait is worth it!  \n\nEvery sandwich is toasted, and they make it however you like it.  They have yet to mess up my orders, even when I ordered multiple sandwiches!\n\nHere's what I suggest one should try:\nItalian Sausage Sub\nMeatball Sub\nAtomic Sub\n\nParking can be a bit hard, but....when you find a spot, and take a bite into your sandwich...all that stress and anger you felt when some old lady stole your spot, will disappear.  And if it doesn't, maybe you should played parking chicken with that old lady.", "rating": 5, "date": "2010-11-08"}], "italian combo sub": [{"excerpts": ["Some faves to order include the roast beef sub, the turkey sub, the barbecue beef sub, the Italian combo sub, and the belly bustin' Atomic. \n\n"], "author": "Dawn L.", "review": "I've been going to this sub shop ever since I was a little kid. I have memories of going with my dad and looking up at the counter as the subs were being made. My favorite part was when the man behind the counter put the subs into the oven for baking. \n\nOver 20 years later I'm still coming to this spot for yummy, healthy, and expertly made subs. Some faves to order include the roast beef sub, the turkey sub, the barbecue beef sub, the Italian combo sub, and the belly bustin' Atomic. \n\nYou're best to step up the counter knowing exactly what you want because the guys that work there are busy and quick. Come during lunch time and they have even less time to spend on you so don't stand there dawdling and gaping at the menu on the wall. If you really can't decide just order the roast beef sub. You'll never go wrong with this classic. \n\nGive yourself extra time to find parking during the busy hours (lunch esp) and be ready to take your sub somewhere else to eat as the tables are often filled. The shop also offers regular sandwiches which are also good, in addition to chips and sodas. If you're short on time after work, pop on over after you get off the L, K, or M at West Portal and bring home a sub for dinner. Your stomach and loved one will thank you for it.", "rating": 5, "date": "2009-07-12"}, {"excerpts": ["my italian combo sub was a six incher with 2 italian sausages (sliced), roast beef, marinara sauce. ", "they added onions and then toasted it in the oven for a few minutes before adding tomato slices, and shredded iceberg lettuce. ", "the roast beef was medium rare!! ", "it was AMAZING. ", "the sub was hot, crunchy in all the right places, and the meats were abundant and flavorful. ", "i couldn't believe my buds. "], "author": "May T.", "review": "oh jesus.\n\ni found the holy grail of sandwich shops in the most aberrant place in west portal today. well, that's not true. a friend directed me to this place after deciding not to spend 20 minutes in line for brunch at the four seasons. \n\ninstead, our group headed over to sub center and found the tastiest toasted subs this side of the mississippi river. i'm talking real east coast deli type subs, where the bread is toasty soft, shredded lettuce, thin sliced deli meats, and lots of italian style subs to satisfy any able bodied person with a healthy appetite.\n\nmy italian combo sub was a six incher with 2 italian sausages (sliced), roast beef, marinara sauce. they added onions and then toasted it in the oven for a few minutes before adding tomato slices, and shredded iceberg lettuce. the roast beef was medium rare!! it was AMAZING. the sub was hot, crunchy in all the right places, and the meats were abundant and flavorful. i couldn't believe my buds. i could even smash the sammie to fit the circumference of my mouth, which is a feat upon itself given the amount of ingredients stuffed into it.\n\nthis tiny sub shack has walls decorated with autographed photos bay area sports figures. there are about 4 tables in the sub center, but i noticed most people running off with their purchases to enjoy elsewhere. yummy. i want to go back and try the philly cheesesteak. i heard it was \"goooood.\"", "rating": 5, "date": "2007-10-14"}], "polish sausages sub": [], "hot smokies sub": [], "cheese pizza sub": [], "pepperoni pizza sub": [], "salami pizza sub": [], "veggie pizza sub": [], "ham pizza sub": [], "pastrami pizza sub": [], "sausage pizza sub": [], "potato salad": [{"excerpts": ["The potato salad wasn't anything special.\n\n"], "author": "Ryan D.", "review": "Lived near West Portal for 3 years and just ate here for the first time. It was quite delicious, reminded me of a sub place in southern california that I used to goto frequently. The potato salad wasn't anything special.\n\nIt does appear that they take CC/ATM cards now.", "rating": 4, "date": "2011-10-02"}, {"excerpts": ["potato salad served very cold (thumbs-up) but needed salt, soup was really excellent, some kind of vegetable barley business.\n\n"], "author": "Walter K.", "review": "A dang tasty sub sandwich, and like Marina Sub, my other favorite sub shop in SF, they toast the sandwiches properly with a huge oven that somehow produces an entirely different style of toasting from that found at Quiznos or Subway.  No comparison.  It would be like comparing a frozen grocery store burrito to one from a taqueria in the Mission.  You just don't do it, at least not if you want to retain any respect among your friends.  The bread is more approachable, the cheese is evenly melted, the meat gets somewhat toasted, but the vapors don't immerse themselves in your clothing and hair to where you smell like the sandwich shop for the rest of the day, nor do the corners of the bread get all blackened and knife-sharp.\n\nI prefer Marina Sub, but this place is totally in the running and if you're closer to it, I can see going here more often than not.  Marina is better for a couple of reasons: bologna on the basic sub, dressing is a bit better (IMO, girlfriend liked it more here), Tony the Marina restaurateur is always all smiles, and he puts like 3x the quantity of avocado on your sandwich, plus watching him slice it up is like an in-person Iron Chef experience.\n\nWith that summary in place, more detail:\n\nBread: generally soft, but with some risk of mouth-slicing-up.\nCheese: melted, tasty.\nDressing: Italian salad dressing, vinegar flavor.\nSides: potato salad served very cold (thumbs-up) but needed salt, soup was really excellent, some kind of vegetable barley business.\n\nCash only, but there's an ATM in the bar next door.  Only one guy sitting in there drinking hard liquor at 11:30am.  It occurs to me that, if I'm ever wondering if I'm an alcoholic, I'll know it's very likely if I find myself in a bar before 3pm, alone, drinking.\n\nSeemed very popular with the local workmen which is always a good sign.  Two sandwiches with bonus avocado were about $14.  Add'l sides were another $6.  So say $10 per person for tasty vittles, eh?  Not bad!", "rating": 3, "date": "2007-09-19"}, {"excerpts": ["Tip: Try the potato salad. ", "Whoa..."], "author": "Ezduzit S.", "review": "This is the OG sandwich spot, as evidenced by the faded 49ers memobilia displayed. I think they stop adding to it after our second Superbowl. I hate it when people try to compare their sandwiches. This shop stands alone.  Fast. Efficient. Most importantly, tasty. After all these years, they got the ingredients and system down pat. Parking can suck at times, but its worth the few laps around the block.\n\nTip: Try the potato salad. Whoa...", "rating": 5, "date": "2007-06-27"}, {"excerpts": ["Skip the macaroni or potato salad and just go with the bigger sandwich."], "author": "Glenn L.", "review": "My go-to spot for sandwiches on the way to the SF Giants game.  Just hop off the L-Taraval and grab a Turkey-Pastrami combo.  Messy and they will eventually leak through the bag (it is better to eat it within an hour), but there is something about the finely chopped meats and lettuce and other veggies, with the melted cheese that makes it.  I think the bread is the key.  The guys working to prep the sandwiches are amazingly fast.  Skip the macaroni or potato salad and just go with the bigger sandwich.", "rating": 4, "date": "2009-09-23"}], "macaroni salad": [{"excerpts": ["I added a macaroni salad and a coke.  "], "author": "Greg B.", "review": "Okay, I don't get it.  I was visiting the area today and needed Yelp to really help me find a good Pastrami sandwich because, well, who doesn't love a good pastrami sandwich?\n\nThis place was super-high rated and I thought I couldn't miss.  Well...\n\nI got in a little early and the place was empty when I came in.  I ordered the large pastrami.  \"With everything?\" I was asked.  Hmmm.  Where I come from pastrami sandwiches come with pickles and mustard.  And maybe cheese.  \n\n\"What's everything?\" \n\nThe (nice) guy behind the counter pointed over to a few items that were available.  Lettuce, tomato and onion.  Jalapenos, mustard and mayo.  Let me give this place the benefit of the doubt.  \"Everything but mayo\" (because God knows mayo should never grace a pastrami sandwich.  And I added provolone.\n\nSome good-looking pastrami was put on the bread with mustard then cheese on top, then the whole thing was put in an over.  A few minutes later, it came out and on went lettuce, tomato and onion.  And Italian (Special Sauce) dressing.\n\nI added a macaroni salad and a coke.  Then sat down to eat.\n\nThe sandwich:  wow, what a disappointment.  First off, no pickles?  Really?  Second, the bread was so crusty I couldn't take a bite without poking my lips and scratching the roof of my mouth.  That would have been fine if there was enough pastrami and if it had really strong flavor.  Which there wasn't.  The condiments overwhelmed it and the pastrami was hardly noticeable.    Hardly the best sandwich I've had.  Subway beats it (though it's been a decade+ since I had a pastrami there and it was awful).\n\nThen there was the \"macaroni\" salad.  Yes, it was technically correct because it had macaroni in it.  But it was TERRIBLE.  It was nowhere near fresh and so gummy and bland it tasted like I was eating glue.  I had about three bites and I tossed it.\n\nThe coke, however, was perfect.\n\nI don't visit the area often but will never return, and I can't imagine there aren't better places around.  It had a nice, neighborhood vibe and everyone was very friendly -- probably why people like this place so much.  Good for them.  And maybe some of the other sandwiches rule.  But the pastrami is not a star here.", "rating": 2, "date": "2012-07-18"}, {"excerpts": ["but I made the mistake of ordering some macaroni salad with my sandwich :( \n", "It had so much frickin mayo ...", "NASTY! \n", "Otherwise ... the sandwiches here are like little morsels sent from the heavans and kissed by angels. ", "Go for the hot pastrami .... ", "you can't lose....", "the italian dressing they put on the if you let them give you the works is perfect.... not too oily ... not too vinegary ... love this place and it will love you back.\n", "Next time I will order fries at the Bullshead next door as my side dish :)"], "author": "Jeremy R.", "review": "The sandwiches here are SO good... I would love to give them a five star but I made the mistake of ordering some macaroni salad with my sandwich :( \nIt had so much frickin mayo ...NASTY! \nOtherwise ... the sandwiches here are like little morsels sent from the heavans and kissed by angels. Go for the hot pastrami .... you can't lose....the italian dressing they put on the if you let them give you the works is perfect.... not too oily ... not too vinegary ... love this place and it will love you back.\nNext time I will order fries at the Bullshead next door as my side dish :)", "rating": 4, "date": "2008-07-28"}], "coleslaw": [{"excerpts": ["We also never leave without their coleslaw - the best I've tasted in San Francisco.  ", "The people are friendly and fast, and the prices are entirely reasonable.  ", "Go there."], "author": "Daniel P.", "review": "What a fantastic submarine sandwich.  We also never leave without their coleslaw - the best I've tasted in San Francisco.  The people are friendly and fast, and the prices are entirely reasonable.  Go there.", "rating": 5, "date": "2011-02-02"}], "pickle": [{"excerpts": ["In addition to the sandwich I got two drinks, two chips and a whole $1.50 pickle. "], "author": "Christy V.", "review": "First time here and was in the neighborhood so I decided to try it out since the review was high on yelp. I got super size on both sandwich roast beef and avocado ,pastrami and Swiss. I also paid extra $2 for extra meat on the pastrami which I'm not sure if he gave it to me even though I did ask him again to confirm. In addition to the sandwich I got two drinks, two chips and a whole $1.50 pickle. Total came up to be $37 dollars. \n\nTotally not worth it. The Sandwich for a super size is so small for the price I paid. Just check the picture of the so call extra pastrami meat sandwich. Even Louie's, Ike's, Roxie,etc. has more meat without paying extra $2 for meat. The bread didn't wow me either and everything comes with basic lettuce, onion and tomato. Honestly I should give it 2 star than 3star but the pastrami meat was pretty good with flavor. The sandwich reminds me of Safeway sandwich so it's decent you can get anywhere even a corner store. Service is nothing wow but they were busy and it is a fast food Togo place so can't expect too much. \n\nAnyway... would I come back? Probably not. So many other sandwiches that's so good and a few on my list of places referred by friends to try. Not sure how this place got high ratings or maybe through time it gotten worse than remain it's consistency's.", "rating": 3, "date": "2018-04-08"}, {"excerpts": ["I got the super size pastrami with everything except mayonnaise and a half of a pickle. ", "Yummy yummy the best sandwich ever....", "the bread is crisp outside and tender on the inside.  ", "I took the other half of the sandwich home to San Diego and my son finished it 4 hours later.  ", "He loves it. ", "Great Sammy."], "author": "t d.", "review": "Thank you Yelpers for another great find.  I was in the neighborhood and needed lunch, turned to yelp, and you all led me to the perfect spot. I got the super size pastrami with everything except mayonnaise and a half of a pickle. Yummy yummy the best sandwich ever....the bread is crisp outside and tender on the inside.  I took the other half of the sandwich home to San Diego and my son finished it 4 hours later.  He loves it. Great Sammy.", "rating": 5, "date": "2018-02-27"}, {"excerpts": ["I should have asked for a pickle in it. ", "Why do sandwich places no longer put pickles? "], "author": "Astrid V.", "review": "I went a a great time since there was no one in when I got there. \nThey have very few vegetarian options, which was kind of disappointing, but it was a good price and a good size, so I wasn't unhappy.  Flavor wise I can get better at deli world, and as another guest posted, the bread was pretty bland. I should have asked for a pickle in it. Why do sandwich places no longer put pickles? When did that innocent vegetable because so expensive? \n\nBut a good spot to get something relatively cheap in West Portal. Worth the visit", "rating": 3, "date": "2016-01-10"}, {"excerpts": ["Would be nice if they threw in a small side pickle ", "but it's probably an option to buy. ", "Will be coming back to try more."], "author": "Mike O.", "review": "Got the hot pastrami for a snack on a weekday before noon. Killer sandwich with ridiculous bread. The bread is really what separated this sandwich. I mean hard to imagine it without Rye but Its ok bc there in house bread is bomb. Great service. Would be nice if they threw in a small side pickle but it's probably an option to buy. Will be coming back to try more.", "rating": 5, "date": "2015-07-13"}, {"excerpts": ["If you like pickle on your sandwich they take a whole, large, fat, juicy pickle and slice it on the spot to stack on the sandwich.\n\n"], "author": "Marlene T.", "review": "My friend and I decided to have lunch and he told me that whenever he is in the city, hands down no matter how many days, he just has to get a sandwich here ... every day. He's told me he'd like to try the other food spots near it but he just hasn't been able to bear the thought he'd be passing up a sandwich from this place.\n\nI ordered a pastrami and much to my dismay I didn't see the Atomic until it was too late. If I ever go there again I am surely going to order that one, with three types of meat and spicy peppers, how could one go wrong?\n\nThe pastrami sandwich was perfectly toasted and delicious. While I don't like mayo on my sandwich this place places it on perfectly and the sandwich would be lost without it. The mayo combines dreamily with the italian dressing to make a creamy sauce that is very, very good.\n\nThe service is very fast and efficient. It's interesting to see how the guys behind the counter are so quick with a metal spoon scooping \"slices\" of avocado in perfect even proportions. If you like pickle on your sandwich they take a whole, large, fat, juicy pickle and slice it on the spot to stack on the sandwich.\n\nWe each ordered the middle size sandwich so that we would each have a half to snack on later. \n\nMy friend that was with me over heard a guy in line expressing genuine fondness of this place and delight at that fact that despite he'd been gone for almost a decade living on the east coast, this place was still open. And that he'd waiting a very long time to get a favorite sub.\n\nThat's a testament to itself.\n\nI think this place just serves honest good food. It's not high end gourmet but hits the spot for true hunger. A top list sandwich spot in my book.", "rating": 4, "date": "2009-08-04"}, {"excerpts": ["Togos, Subway, Quizno's, Mr. Pickle, etc... is a joke.\n\n"], "author": "Yvette R.", "review": "YES PEOPLE 5 STARS!! I could cry just writing this review. This place brings me such joy. When people talk smack about this place...I feel as if they are talking about a family member (rolling my head) \" Oh no they didn't!\"  This is my all time submarine place. NOTHING... I MEAN NOTHING COMPARES! Togos, Subway, Quizno's, Mr. Pickle, etc... is a joke.\n\nIt all began when my father introduced me to the Sandwich Center. I don't know if I really believe in love at first sight...maybe lust at first sight but right then and there I knew love at first bite does exist. Another yelper said,  \"eating their bread is like taking the sacrament\" (forgive me lord...) but HELL YES!!!! Their secret sauce is mmm mmm good. They toast their bread unlike other sandwich shops. They use real SF sourdough. Quizno's doesn't know the meaning of \"toasting bread\" like the Submarine Center. I've definitely matured over the years - from the mini, to the center, now to the super. I enjoy every single bite. Not only are the sandwiches the best, but the family who started this business back when I was 8 still run this shop today and I'm 35. Now that's dedication with a continued small town feel.  \n\nThis place has brought 2 generations of love. My father brought me here and now I bring my kids here. Someday maybe my kids will bring their kids. I live an hour away but make the commute at least once a month because no one ever forgets their first love. It's definitely worse when I'm pregnant - make that twice a month. Although prices have gone up...this is one place I'll sacrifice the extra dollar or two for.  AMEN!", "rating": 5, "date": "2008-12-31"}], "soup du jour": [{"excerpts": ["My go to sandwich is the Hot Pastrami and usually a cup of the soup du jour as well."], "author": "Neil B.", "review": "Never had a bad sandwich here.  It is definitely always packed for a reason.  My go to sandwich is the Hot Pastrami and usually a cup of the soup du jour as well.", "rating": 5, "date": "2015-10-06"}], "apple juice": [{"excerpts": ["Wash that all down with Martinelli's apple juice ", "[everything tastes good with Martinelli's apple juice]  "], "author": "Vanessa W.", "review": "During high school, I was a nerd. I took Advanced Placement courses for three subjects [English, Art History & Environmental Science], was one of the captains of the varsity tennis team, was former French Club President [I ran unopposed], homeroom President, captain of our mock trial/pre-law team..I could go on and on about my perfect record.\n\nI have a secret, though. Please don't tell my parents. During my senior year, the class right before lunch was history. I would ask to use the restroom 10 minutes before class ended & my teacher was so clueless - he never noticed that I would never come back. Instead, I would rush out the class, meet  up with my boyfriend, run past the fat security guards at school and catch the L train on Taraval Street to go to West Portal. \n\nTo go get a sandwich at the Submarine Center, of course.\n\nMy sandwich was always, always a center Submarine. Gooey, melted cheeses with ham & salami, crispy lettuce, juicy ripe tomatoes, crunchy onions, accompanied by a wonderful duet of light mayonnaise and their special vinaigrette -- all on a toasted baguette. Wash that all down with Martinelli's apple juice [everything tastes good with Martinelli's apple juice]  and well, the nerd in me became a rebel during lunchtime.  \n\nActually - I don't even remember what class I had after lunch. We would be so happy and full after eating our sandwiches, my high school boyfriend and I would never go back to school.\n\nThis place is such a great local find. They've got autographs and pictures of famous athletes [49ers] and celebrities. Their staff is fast at making sandwiches. Their ingredients are always fresh and delicious. This place is the best.", "rating": 5, "date": "2009-03-15"}, {"excerpts": ["I usually get the full sub and a bottle of apple juice."], "author": "Kevin N.", "review": "This is a great place for a quick bite. I don't think I ever had a bad sub, and they're all tasty! I usually get the full sub and a bottle of apple juice.", "rating": 4, "date": "2013-01-19"}]}