{"bbq spring rolls": [], "crunch roll": [], "vietnamese crepe": [{"excerpts": ["Must get: Imperial rolls and Banh Xeo (vietnamese crepe)"], "author": "Elouise D.", "review": "I've dined in and gotten delivery several times and never let me down!\n\nMust get: Imperial rolls and Banh Xeo (vietnamese crepe)", "rating": 5, "date": "2017-08-14"}], "golden shrimp": [{"excerpts": ["The combo sampler consists of imperial rolls, shrimp spring rolls, fried golden shrimp and papaya salad. ", "I thought it was decent, considering they gave all the various dipping sauces for each appetizer. ", "The golden shrimp was really breaded with not much shrimp.. ", "Imperial rolls were yummy! ", "Nothing stood out, but then again it's kind of tough to mess up a spring roll lol. "], "author": "Cassie T.", "review": "Combo sampler - 3.5/5\nBun Bo Hue - 2/5\n\nThe combo sampler consists of imperial rolls, shrimp spring rolls, fried golden shrimp and papaya salad. I thought it was decent, considering they gave all the various dipping sauces for each appetizer. The golden shrimp was really breaded with not much shrimp.. Imperial rolls were yummy! Nothing stood out, but then again it's kind of tough to mess up a spring roll lol. Overall it was a good item to order if you are craving a little of everything!\n\nI've been looking for a restaurant in SF that has really authentic bun bo hue, so I came here specifically for that but was pretty disappointed. The broth was just missing something, I can't exactly put my finger on it... but it actually tasted a tiny bit like Bo Kho, a different Vietnamese dish. The broth just didn't taste like BBH to me, but they were very generous with the meat though! I guess if you're used to the BBH from San Jose like Bun Bo Hue An Nam or BBH Noodle, this place may leave you a bit disappointed.\n\nSide note, the interior of this restaurant is sooo modern and beautiful!! Definitely one of the nicest Vietnamese restaurants I've ever been to.", "rating": 3, "date": "2017-06-21"}, {"excerpts": ["The appetizer combo comes with imperial rolls, papaya salad, golden shrimp, and shrimp summer rolls. ", "The imperial rolls were my favorite -- deep fried, but light and crispy. ", "The platter came with three dipping sauces. ", "I could easily eat the whole order on my own. "], "author": "Erin G.", "review": "What I ate: Pho, appetizer combo.\nVisit date: December 4, 2016\nFirst time? Yes.\n\nCold and hungry? Noodle soup to the rescue! We visited Sunflower Garden after an event across the street. I ordered the pho with rare beef and meatballs, and the appetizer combo to share. The pho comes customizable; you can also get tripe, flank, and tendon in your soup. The broth was full bodied, but definitely needed the added hoisin and sriracha sauces. A bowl is good for two. The appetizer combo comes with imperial rolls, papaya salad, golden shrimp, and shrimp summer rolls. The imperial rolls were my favorite -- deep fried, but light and crispy. The platter came with three dipping sauces. I could easily eat the whole order on my own. Yum!\n\nParking is street and it gets busier after 6pm. This is a family friendly place with clean bathrooms and friendly staff.", "rating": 3, "date": "2016-12-05"}], "fried taro flour cake": [{"excerpts": ["The fried taro flour cake is delicious and unique. ", "Everything else we've gotten has been unusually good. ", "Highly recommend!"], "author": "John K.", "review": "Been here a few times, it's our favorite Vietnamese restaurant in SF (and we go to a lot). The fried taro flour cake is delicious and unique. Everything else we've gotten has been unusually good. Highly recommend!", "rating": 5, "date": "2017-07-15"}], "chicken cabbage salad": [], "shrimp or beef papaya salad": [], "bbq pork beef or chicken cabbage salad": [], "beef combination noodle soup": [{"excerpts": ["What I ordered:\n\nBeef Combination Noodle Soup (~$10)\n"], "author": "Xin W.", "review": "Quaint little place near 9th and Irving. Relatively new, just opened a few months ago. Great ambience and very contemporary interior. Awesome vibe!\n\nWhat I ordered:\n\nBeef Combination Noodle Soup (~$10)\nThai Iced Tea (~$4)\n\nTbh I feel this is a little pricey for the food I'm getting. Walk 10 blocks down to 19th and Irving, and all the Pho places there are so much cheaper and better. \nThe beef pho I got here is mediocre at best, it's nothing special. The soup tasted actually a little bland compared to the other pho places I've been around the neighborhood. The thai iced tea was good though! I just wish it was cheaper though.\n\nI really want to like this place. Maybe I ordered the wrong item from the menu?", "rating": 3, "date": "2016-11-22"}, {"excerpts": ["My boyfriend and I ordered the appetizer combo, bun bo hue, and beef combination noodle soup. \n\n", "Bo Hue & Beef combination noodle soup", ": Do you ever eat food and think to yourself there's just that ONE ingredient missing? ", "and if that ONE ingredient was in it, it'd taste way better ", "but you just don't quite know what it is? ", "My boyfriend and I came to an agreement that both of the soup was missing that one ingredient and we couldn't find out what it was. ", "My bun bo hue was pretty watery and bland ", "and my boyfriend's pho was just bland. "], "author": "Elaine C.", "review": "Pretty and a very clean interior!\n\nWanted to try a new pho place, so I came by on a Wednesday afternoon and was seated right away. My boyfriend and I ordered the appetizer combo, bun bo hue, and beef combination noodle soup. \n\nAppetizer combo: I was very surprised that it was good! Each and every one was very fresh, unlike other restaurants that can taste a bit stale. It is a bit pricey ($14) but I would definitely order it again.\n\nBun Bo Hue & Beef combination noodle soup: Do you ever eat food and think to yourself there's just that ONE ingredient missing? and if that ONE ingredient was in it, it'd taste way better but you just don't quite know what it is? My boyfriend and I came to an agreement that both of the soup was missing that one ingredient and we couldn't find out what it was. My bun bo hue was pretty watery and bland and my boyfriend's pho was just bland. HOWEVER, I give them props for giving us lots of meat!\n\nI'm honestly the type of person to never go back to a place if it doesn't make me satisfied, but I really liked the appetizer combo so I'd come back, but I'll just make sure to order a rice place instead of soup.", "rating": 3, "date": "2016-11-04"}, {"excerpts": ["Xe Lua - Beef Combination Noodle Soup - delicious broth, generous portions of all meats, plus the tendon was super thick and juicy  \n\n"], "author": "Patty J.", "review": "(Ordered delivery via Yelp Eat24) - I ordered on a cold rainy night and received a delivery confirmation of 1 hour. Totally reasonable and expected. Food arrived 15 min early! Always a fun surprise. Looks like I have a new go-to Pho delivery spot.\n\nPho Xe Lua - Beef Combination Noodle Soup - delicious broth, generous portions of all meats, plus the tendon was super thick and juicy  \n\nBun Ga Cari - Curry Chicken Rice Vermicelli Soup - nice curry, not too heavy. Good amount of chicken. Had plenty for leftovers the next day. Bonus!\n\nImperial Rolls didn't come with mint, but that was the only downside.", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["Their Beef Combination Noodle Soup and BBQ dishes are good! ", "For the Beef Combination Noodle Soup, you can even customize the meat!"], "author": "Janet C.", "review": "Their Beef Combination Noodle Soup and BBQ dishes are good! For the Beef Combination Noodle Soup, you can even customize the meat!", "rating": 4, "date": "2016-09-09"}], "hue vermicelli noodle beef soup": [], "sea soup": [{"excerpts": ["It's not the best, but their bun rieu/ sea soup is not bad. ", "My friend also liked the five spiced chicken noodle soup, although perilla is probably better. \n"], "author": "Debbie D.", "review": "It's not the best, but their bun rieu/ sea soup is not bad. My friend also liked the five spiced chicken noodle soup, although perilla is probably better. \nDefinitely get the fried roll, it comes with veggies to eat it with.\n\nThe decor is nice, higher end than Kevin's noodle house couple blocks down.", "rating": 4, "date": "2018-08-16"}, {"excerpts": ["I order the bun rieu (sea soup) here ", "and it is incredibly delicious with such rich broth and generous portions of crab meat, tomato, and all the other toppings. "], "author": "Phillip V.", "review": "This is my absolute go-to for Vietnamese food in this part of SF. It's usually not too crowded inside and everything is very affordable! I've brought friends here and they've always enjoyed it and (much like me) wondered why they hadn't tried this place before and why it wasn't featuring a line out the door. As long as it keeps having fast service, a really clean, pretty interior, and delicious food, I'll keep coming back!\n\nI order the bun rieu (sea soup) here and it is incredibly delicious with such rich broth and generous portions of crab meat, tomato, and all the other toppings. I've also tried the rare steak appetizer here and it was delicious.\n\nOverall, excellent Vietnamese restaurant in the Inner Sunset and I highly recommend to all.", "rating": 5, "date": "2017-11-21"}, {"excerpts": ["Every time I go I always get the sea soup. ", "It's sooo gooooood!!!!!\n", "But yeah basically:\n- food- can't go wrong with sea soup (bun rieu)\n- free tea in cute teapots! ", "WIN!\n- clean, love the fish tank with colorful bubbles \n- there's ALWAYS SEATS! ", "I love that there's no wait\n", "- prices are probably one of the most affordable now for Vietnamese food in"], "author": "Ruth Y.", "review": "Every time I go I always get the sea soup. It's sooo gooooood!!!!!\nBut yeah basically:\n- food- can't go wrong with sea soup (bun rieu)\n- free tea in cute teapots! WIN!\n- clean, love the fish tank with colorful bubbles \n- there's ALWAYS SEATS! I love that there's no wait\n- prices are probably one of the most affordable now for Vietnamese food in", "rating": 5, "date": "2018-04-27"}, {"excerpts": ["For $10.00 the Sea Soup over a rice vermicelli is prepared with a crab paste - chicken broth base and is a bit sweet with more tofu than shrimp yet very good.\n\n"], "author": "Caesar A.", "review": "If your're on the fence about Sun Flower Garden common down, pull up a chair and have a bite. The restaurant is inexpensive, clean, service is good and the food seems fresh and tastes pretty good to me.\n\nAt $6.95 I have not had a better Spring Roll. And, at $10.00 the Chicken Vermicelli just can't be beat and for an additional $2 they offer three Prawns.\n\nFor $10.00 the Sea Soup over a rice vermicelli is prepared with a crab paste - chicken broth base and is a bit sweet with more tofu than shrimp yet very good.\n\nAt $10.00 the Vermicelli Noodle Beef Soup seems authentic. Its lightly spiced beef broth (a hint of lemongrass) with sliced beef, pork and pork blood cubes really hit the spot.\n\nAt $21.50 the Grilled Rack of (4) Lambs came on a bed of lettuce atop a dollop of sticky rice. I found the lamb over marinated taking away its lambness and a bit tuff and chewy.", "rating": 4, "date": "2017-08-11"}, {"excerpts": ["From time to time I always order the sea soup come with   4 whole shrimps, bean curds ,  also on the side with bean sprouts, 1 slice of lime, jalapeño and a complimentary tea pot for the price of 10$ . ", "It is pretty inexpensive compare other places. ", "Personal suggestion gotta ask the servers for their house made chili sauce.  ", "They offer free wifi and cable tv that can watch warriors game highly recommend this place."], "author": "Rongbo T.", "review": "One of my favorite Vietnamese noodle soup places. From time to time I always order the sea soup come with   4 whole shrimps, bean curds ,  also on the side with bean sprouts, 1 slice of lime, jalapeño and a complimentary tea pot for the price of 10$ . It is pretty inexpensive compare other places. Personal suggestion gotta ask the servers for their house made chili sauce.  They offer free wifi and cable tv that can watch warriors game highly recommend this place.", "rating": 5, "date": "2018-02-01"}, {"excerpts": ["The sea soup is excellent and something we always get. ", "Same for the taro pan fried appetizer and fried imperial rolls also with taro. ", "We are definitely repeat customers and this is where we bring friends when they are visiting from out of town."], "author": "wendy w.", "review": "We love this place!  Great viet food with a little fusion. Polite staff and clean dining and bathroom. The sea soup is excellent and something we always get. Same for the taro pan fried appetizer and fried imperial rolls also with taro. We are definitely repeat customers and this is where we bring friends when they are visiting from out of town.", "rating": 5, "date": "2017-07-17"}], "vikon chicken noodle soup": [], "wonton combination egg noodle soup": [], "five spice chicken noodle soup": [], "bbq pork beef or chicken noodle soup": [], "beef stew rice noodle soup": [], "sauteed curry calamari or shrimp": [], "sauteed chicken or beef": [], "shrimp with mixed vegetables": [], "chicken or beef with mixed vegetables": [], "chicken or beef with string beans": [], "shrimp with cashew nuts": [], "chicken or beef with cashew nuts": [], "sauteed eggplant and shrimp": [], "sauteed eggplant and chicken or beef": [], "sauteed shrimp and broccoli": [], "sauteed chicken or beef with broccoli": [], "shaking beef with tomato fried rice": [{"excerpts": ["I've tried the Sunflower vermicelli bowl (meat + imperial rolls), Mongolian Beef, and my favorite - Shaking Beef with Tomato fried rice. ", "Really nice and tender pieces of meat and the fried rice uses a tomato paste not chunks of tomato, which gives it a unique flavor. ", "I also tried the Mango smoothie which was a huge portion, perfect thickness, and great ingredients."], "author": "Nick L.", "review": "I've come here 3 times since they've opened and love everything so far! I've tried the Sunflower vermicelli bowl (meat + imperial rolls), Mongolian Beef, and my favorite - Shaking Beef with Tomato fried rice. Really nice and tender pieces of meat and the fried rice uses a tomato paste not chunks of tomato, which gives it a unique flavor. I also tried the Mango smoothie which was a huge portion, perfect thickness, and great ingredients.", "rating": 5, "date": "2016-06-23"}], "grilled rack of lambs": [], "steamed sea bass": [], "fish sauce chicken wings": [], "seafood stir fry noodles": [], "stir fry noodles": [], "garlic noodles": [{"excerpts": ["Some of the better dishes are the beef pho, the wonton noodle soup, and the garlic noodles with BBQ portk. \n\n", "stick with the noodles."], "author": "Mimi T.", "review": "We order take out from here about once a week. \nSome of the better dishes are the beef pho, the wonton noodle soup, and the garlic noodles with BBQ portk. \n\nTheir rolls,  appetizers and rice dishes are just okay. stick with the noodles.", "rating": 4, "date": "2018-06-26"}, {"excerpts": ["Would also recommend the garlic noodles too."], "author": "Kristine C.", "review": "Good pho, clean restaurant, decent prices and great service. Would also recommend the garlic noodles too.", "rating": 4, "date": "2018-08-12"}, {"excerpts": ["Ordered the chicken garlic noodles to go. ", "The noodles were fine- not the best I've had but not terrible. ", "The chicken however was pretty gross. ", "It was basically all cartilage and I ended up throwing it away. ", "Definitely not worth the 13 dollars I paid for it. "], "author": "Tony G.", "review": "Ordered the chicken garlic noodles to go. The noodles were fine- not the best I've had but not terrible. The chicken however was pretty gross. It was basically all cartilage and I ended up throwing it away. Definitely not worth the 13 dollars I paid for it. Will not be returning.\n\nI did think the interior of the restaurant was quite nice however- very clean and cute.", "rating": 3, "date": "2017-04-08"}, {"excerpts": ["Food is decent- garlic noodles are little bland and eggplant had good flavor but was a little soggy. ", "Portions are big enough but on the smaller side considering perilla is right around the corner and is very good."], "author": "J A.", "review": "Food is decent- garlic noodles are little bland and eggplant had good flavor but was a little soggy. Portions are big enough but on the smaller side considering perilla is right around the corner and is very good.", "rating": 3, "date": "2017-04-08"}, {"excerpts": ["There are just some days that require garlic noodles. ", "On those days come to Sunflower. ", "Nice new location. ", "Portion was definitely smaller than Potrero but still sufficient. ", "Nice ambiance and near the park."], "author": "Sandi E.", "review": "There are just some days that require garlic noodles. On those days come to Sunflower. Nice new location. Portion was definitely smaller than Potrero but still sufficient. Nice ambiance and near the park.", "rating": 4, "date": "2016-06-24"}], "clay pot catfish": [], "vegetarian imperial rolls": [{"excerpts": ["Satisfaction is guaranteed with the vegetarian imperial rolls and any pho from the menu."], "author": "Obi O.", "review": "This is my favorite spot for vietnamese in the inner sunset. Satisfaction is guaranteed with the vegetarian imperial rolls and any pho from the menu.", "rating": 5, "date": "2016-11-25"}], "vegetarian spring roll": [], "cabbage salad": [{"excerpts": ["If I get a pho and the cabbage salad, I feel I've gotten all of my daily nutrients ", "plus I'm merrily satisfied without feeling full.  ", "They also deliver now which I haven't tried but will since I'm often too lazy to walk the 4 blocks.  ", "I've had people tell me the pho down on Larkin is much better ", "but since I've never eaten there, Sunflower will do just fine.  ", "I like Sunflower better then Perilla, and Yummy Yummy ", "is either closed or too full of people whenever I want pho (but I have gotten take away from Yummy ", "and it was good).  ", "I hope Sunflower and I grow old together."], "author": "Kai T.", "review": "Been eating here since it was named Sandy's (something) and located down the block a few stores.  I always loved this place because the people are so nice and the food was good and affordable.  This new store is fancier and they upped the prices a little but still, my go-to Vietnamese pho place.  If I get a pho and the cabbage salad, I feel I've gotten all of my daily nutrients plus I'm merrily satisfied without feeling full.  They also deliver now which I haven't tried but will since I'm often too lazy to walk the 4 blocks.  I've had people tell me the pho down on Larkin is much better but since I've never eaten there, Sunflower will do just fine.  I like Sunflower better then Perilla, and Yummy Yummy is either closed or too full of people whenever I want pho (but I have gotten take away from Yummy and it was good).  I hope Sunflower and I grow old together.", "rating": 4, "date": "2017-03-07"}], "vegetarian rice noodle soup": [], "vietnamese vegetarian crepe": [], "vegetarian spicy hue noodle soup": [], "vermicelli hot and sour rice noodle soup": [], "vegetarian hot and sour soup": [], "vegetarian chow fun": [], "vegetarian fried rice": [], "vegetarian chow mein": [], "tofu and mix vegetable rice platter": [], "vegetarian bird nest noodle": [], "stir fried curry bean curd": [], "stir fried tofu with cashew nuts": [], "stir fried eggplant in garlic sauce": [], "stir fried basil vegetarian chicken": [], "sunflower vermicelli bowl": [{"excerpts": ["I ordered Imperial Rolls, Sunflower Vermicelli Bowl "], "author": "Thuan N.", "review": "This review is for food only, since I ordered delivery. I ordered Imperial Rolls, Sunflower Vermicelli Bowl (Bun Cha Gio Thit Nuong), and Sauteed Curry Chicken.\n\nImperial Rolls: 4/5. These were good, although not special or exceptional. But they were good. I appreciate that they provided vermicelli, but I wish they provided more than just one lettuce leaf. However, that's not a big deal and is only a nitpick.\n\nBun Cha Gio Thit Nuong: 1/5. The meat (pork) was dry and tough, and the sauce was too strong and had an unbalanced flavor. It was a chore to finish eating the meat.\n\nSauteed Curry Chicken: 2/5. Again, the meat (chicken) was dry, and the sauce tasted somewhat overseasoned.\n\nOverall: Dry meat is a deal-breaker for me, especially when the sauce and seasoning are not great, which was my experience. I'm not sure why the meat was overcooked this much. I probably won't order delivery from here again, although I would be open to stopping in, so I can at least ask the staff about the food.", "rating": 2, "date": "2017-03-25"}, {"excerpts": ["The atmosphere feels very modern and intimate and the food (we got the $10 Sunflower Vermicelli Bowl) was really good.\n", "I only gave it a 4/5 because I'm cheap and feel like $10 is a little steep when other nearby places go for $7-$9, but the service and food was nice. ", "Glad to have a good Vietnamese place near Parnassus so that we don't have to walk all the way to Perilla haha."], "author": "Nathan D.", "review": "Wed June 8th 2016\nSo this place just opened a few days ago by the people that manage New Sandy's just a few doors down.\nThe atmosphere feels very modern and intimate and the food (we got the $10 Sunflower Vermicelli Bowl) was really good.\nI only gave it a 4/5 because I'm cheap and feel like $10 is a little steep when other nearby places go for $7-$9, but the service and food was nice. Glad to have a good Vietnamese place near Parnassus so that we don't have to walk all the way to Perilla haha.", "rating": 4, "date": "2016-06-08"}, {"excerpts": ["I've tried the Sunflower vermicelli bowl (meat + imperial rolls), Mongolian Beef, and my favorite - Shaking Beef with Tomato fried rice. ", "Really nice and tender pieces of meat and the fried rice uses a tomato paste not chunks of tomato, which gives it a unique flavor. ", "I also tried the Mango smoothie which was a huge portion, perfect thickness, and great ingredients."], "author": "Nick L.", "review": "I've come here 3 times since they've opened and love everything so far! I've tried the Sunflower vermicelli bowl (meat + imperial rolls), Mongolian Beef, and my favorite - Shaking Beef with Tomato fried rice. Really nice and tender pieces of meat and the fried rice uses a tomato paste not chunks of tomato, which gives it a unique flavor. I also tried the Mango smoothie which was a huge portion, perfect thickness, and great ingredients.", "rating": 5, "date": "2016-06-23"}], "imperial rolls vermicelli bowl": [], "five spice chicken rice plate": [{"excerpts": ["We had Spring Rolls, a BBQ Pork Vermicelli Bowl, and the Five Spice Chicken Rice Plate. ", "It was all bland and uninteresting."], "author": "Harold W.", "review": "This place looks nice, but that is all.  The service is slow and mediocre even when the restaurant is empty. The servers don't say \"hello\" or \"welcome\", they just take your order, and they bring it and don't return until you wave at them.  Despite what yelp says, they do not have beer or wine. We had Spring Rolls, a BBQ Pork Vermicelli Bowl, and the Five Spice Chicken Rice Plate. It was all bland and uninteresting.", "rating": 1, "date": "2016-08-31"}], "bbq rice platter": [], "bbq pork chop rice plate": [], "pork chop combination rice plate": [], "grilled korean beef short ribs rice plate": [], "clay pot rice": [{"excerpts": ["Some of my notable favorites that I have ordered are chicken pho, seafood pho, Mongolian beef over rice, imperial rolls, BBQ chicken/beef vermicelli bowl, and chicken clay pot rice. ", "My secret favorite thing to get here is their avocado smoothie! ", "It is so creamy and delicious ", "I am craving it right now. ", "Now I just gotta find some time to come back to the Inner sunset ", "so I can eat here again!"], "author": "Annie L.", "review": "I cheated on Perilla down the street with Sunflower Garden ever since it opened. I feel bad because the owners at Perilla don't see me much anymore but I'm obsessed with the food here! Literally my favorite Vietnamese restaurant in SF. It's new, clean and modern. There is always seating. Giant pot of tea. Great service every time and they know what I want when I go there because I go there at least 2x a week since they opened. Now that I moved work locations, I haven't been there in over 6 months and I'm super sad! \n\nSome of my notable favorites that I have ordered are chicken pho, seafood pho, Mongolian beef over rice, imperial rolls, BBQ chicken/beef vermicelli bowl, and chicken clay pot rice. My secret favorite thing to get here is their avocado smoothie! It is so creamy and delicious I am craving it right now. Now I just gotta find some time to come back to the Inner sunset so I can eat here again!", "rating": 5, "date": "2018-05-08"}, {"excerpts": ["Clay pot rice and wonton soup were both excellent. \n\n"], "author": "jason e.", "review": "Great new addition to the neighborhood. Clay pot rice and wonton soup were both excellent. \n\nClean place, friendly staff. In the rotation!\n\nIt's byob, by the way!", "rating": 5, "date": "2016-07-15"}], "rare steak": [{"excerpts": ["I've also tried the rare steak appetizer here and it was delicious.\n\n"], "author": "Phillip V.", "review": "This is my absolute go-to for Vietnamese food in this part of SF. It's usually not too crowded inside and everything is very affordable! I've brought friends here and they've always enjoyed it and (much like me) wondered why they hadn't tried this place before and why it wasn't featuring a line out the door. As long as it keeps having fast service, a really clean, pretty interior, and delicious food, I'll keep coming back!\n\nI order the bun rieu (sea soup) here and it is incredibly delicious with such rich broth and generous portions of crab meat, tomato, and all the other toppings. I've also tried the rare steak appetizer here and it was delicious.\n\nOverall, excellent Vietnamese restaurant in the Inner Sunset and I highly recommend to all.", "rating": 5, "date": "2017-11-21"}], "steamed vegetable": [], "noodles": [{"excerpts": ["Food:\n-Sea noodles (bun rieu) ", "$10: my friend ordered this and liked it. ", "It's got your crab paste, fried tofu, tomato, and vermicelli noodles all mixed into a delicious and hearty chicken broth.\n\n- 5 spice chicken noodle soup $10: I ordered my noodles with 5 spice chicken to the side since I came from a workout. "], "author": "Corinna T.", "review": "Beautiful interior for a Vietnamese restaurant with plenty of seating. The food was yummy as well.\n\nFood:\n-Sea noodles (bun rieu) $10: my friend ordered this and liked it. It's got your crab paste, fried tofu, tomato, and vermicelli noodles all mixed into a delicious and hearty chicken broth.\n\n- 5 spice chicken noodle soup $10: I ordered my noodles with 5 spice chicken to the side since I came from a workout. Needed my protein fix. The chicken was easy to cut, and surprisingly, I finished it all. The chicken portion was generous :) \n\n-Fried imperial rolls: delicious and served piping hot.  The perfect appetizer to accompany the soups.\n\nOverall, a lovely restaurant, and another one for the books when I'm craving Vietnamese food.", "rating": 4, "date": "2018-07-19"}, {"excerpts": ["Some of the better dishes are the beef pho, the wonton noodle soup, and the garlic noodles with BBQ portk. \n\n", "stick with the noodles."], "author": "Mimi T.", "review": "We order take out from here about once a week. \nSome of the better dishes are the beef pho, the wonton noodle soup, and the garlic noodles with BBQ portk. \n\nTheir rolls,  appetizers and rice dishes are just okay. stick with the noodles.", "rating": 4, "date": "2018-06-26"}, {"excerpts": ["There was egg, tomatos, fried tofu, and bean sprouts, and basil in the soup, along with noodles. ", "The broth was delicious and it felt very clean ", ":) "], "author": "Jackie C.", "review": "This is a lovely restaurant in inner sunset :) My friend and I wanted to grab dinner nearby UCSF  campus, and decided to come to Sunflower Garden. It wasn't terribly crowded so we got seated right away. \n\nThis is a Vietnamese restaurant with a fusion flavor. There are rice bowls, vermicilli bowls, and soup bowls. The soup bowls are unique as it's not the typical pho style, but a mix of different ingredients, again with a fusion flavor. There are also vegetarian dishes, and some yummy look appetizers. \n\nMy friend ordered a vermicilli bowl, and I ordered the the Sea Bowl. It was delicious! There was egg, tomatos, fried tofu, and bean sprouts, and basil in the soup, along with noodles. The broth was delicious and it felt very clean :) The serving size is huge, so you'll have plenty to take home for another meal. \n\nIt's also very cost affordable! It was only $10 for a huge soup! The service is great as well! I will definitely come here again when I'm close to campus :)", "rating": 4, "date": "2017-10-03"}, {"excerpts": ["Get the Sea noodles!!  ", "If you like seafood, the broth is great.  ", "The 5 spice chicken today was tender, juicy and tasty.  ", "Lot of meat in the combination Pho.  ", "Broth could be a touch better, but the meat makes up for it.  "], "author": "Carlo W.", "review": "Get the Sea noodles!!  If you like seafood, the broth is great.  The 5 spice chicken today was tender, juicy and tasty.  Lot of meat in the combination Pho.  Broth could be a touch better, but the meat makes up for it.  The BBQ chicken was also very good.  \n\nWould come back again.", "rating": 5, "date": "2018-09-06"}, {"excerpts": ["I really enjoyed their rare beef salad and vermicelli noodles (grilled pork with egg rolls). ", "I'm not too big of a fan of their bun bo hue though. "], "author": "Mandy D.", "review": "I really enjoyed their rare beef salad and vermicelli noodles (grilled pork with egg rolls). I'm not too big of a fan of their bun bo hue though. However, one of the best vermicelli dishes I've ever had. \n\nService was good and the staff were very nice. Very homie.", "rating": 4, "date": "2017-06-12"}, {"excerpts": ["Pro: lots of meat and noodles\n", "Con: broth was very light in flavor, had 1 tripe and 1 beef tendon. ", "1 of each only! "], "author": "Linda C.", "review": "I had such high hopes for this place with all the reviews. I ordered combo beef pho and fish sauce fried chicken wings. \n\nSigh....this is probably more of a hit or miss in good Vietnamese food. I miss my friends' parents' home cooking and my original hometown. \n\nBeef bone broth tastes like water with some flavor, even with the added sauce, lime, jalapeño, Vietnamese basil/perilla, etc. it tasted like diluted beef broth. Not even sure it was bone broth at all.\n\nPro: lots of meat and noodles\nCon: broth was very light in flavor, had 1 tripe and 1 beef tendon. 1 of each only! So sad. \n\nChicken wings tasted like normal fried chicken wings. Where's the fish sauce? Oh well for normal fried wings, it's good. At least the sticky rice with fried garlic and mixed greens with it were yummy. Anything with sweet Thai chili sauce from the bottle is always good. Lol.", "rating": 3, "date": "2018-06-07"}, {"excerpts": ["Would also recommend the garlic noodles too."], "author": "Kristine C.", "review": "Good pho, clean restaurant, decent prices and great service. Would also recommend the garlic noodles too.", "rating": 4, "date": "2018-08-12"}, {"excerpts": ["For the main course ee gotwonton soup with extra noodles and the chicken Vermicelli bowl.   ", "With the Vermicelli,  It comes with an egg roll ", "and i didn't realize it had pork in it,  ", "so be sure to ask for a vegetarian before hand. ", "The wonton soup is humongous. ", "Honestly,  it could easily feed 3 people.  ", "It was pretty good too. "], "author": "Arman J.", "review": "I have been wanting to try this place out for a long time.  This used to be a Chinese grocery store for the longest time. They've done a fantastic job renovating the pace.  The ambience is very nice and you could definitely come here for a date or dinner with friends. They have 2 big booths and a large side booth seat with multiple tables across in addition to chairs which seat couples or can be combined to accommodate 10+ people.\n\nThere is a 60 inch plasma screen TV and they're very nice about putting on the game if you ask. As soon as we were seated (without a wait on 6 pm on a Saturday) they brought us hot tea and water. The menu is very extensive with your traditional Vietnamese pho and vermicelli bowls,  in addition to appetizers. \n\nWe got the chicken spring rolls as an appetizer.  The peanut sauce was really good and you get 4 large rolls,  so it is definitely worth the $6.95. For the main course ee gotwonton soup with extra noodles and the chicken Vermicelli bowl.   With the Vermicelli,  It comes with an egg roll and i didn't realize it had pork in it,  so be sure to ask for a vegetarian before hand. The wonton soup is humongous. Honestly,  it could easily feed 3 people.  It was pretty good too. If you're hungry,  you can't go wrong. \n\nSo,  overall,  this place is pretty good and the prices are decent,  but i wasn't blown away.  I will probably come back again,  but it's more of a \"safe\" option, as opposed to a place I'll be dying to come back to.", "rating": 4, "date": "2017-03-18"}, {"excerpts": ["The noodles were separate and there wasn't really enough space in the broth container so an extra bowl from your kitchen is required. \n", "They were super tasty and the sticky rice was a great ending. ", "The mango wasn't the ripest but the rice was amazing."], "author": "Valentina G.", "review": "We ordered for delivery the beef soup, the vegetable soup, and the mango sticky rice. I especially appreciated that there was a vegetable pho because it's difficult to find. It was very tasty, well salted. \nWhen the soups were delivered the broth part was still really hot. The noodles were separate and there wasn't really enough space in the broth container so an extra bowl from your kitchen is required. \nThey were super tasty and the sticky rice was a great ending. The mango wasn't the ripest but the rice was amazing.", "rating": 4, "date": "2018-03-19"}, {"excerpts": ["The noodles were overcooked; it was hard to eat with chopsticks because the noodles kept breaking.\n\n"], "author": "Rachelle M.", "review": "Service is extremely slow, and food wasn't all that good.\n\nWe got seated straight away, but waited forever to get menus and place our order. Then, we waited about half an hour before our food came, and we ordered pho, which can be cooked really quickly. \n\nThe soup base had little flavor, except for all the salt they put. The noodles were overcooked; it was hard to eat with chopsticks because the noodles kept breaking.\n\nThey seem to take a lot of delivery orders because the staff would approach our table with a phone in hand, taking orders over the phone, and I saw DoorDash delivery folks come in as well.\n\nThey don't bus the tables until they need to seat new customers. There were dirty dishes at every empty table. There was one table that hadn't been bused for at least 45 minutes.\n\nThey have high volume, but are not appropriately staffed to handle it. You're better off going to Perilla or Yummy Yummy in the area.", "rating": 1, "date": "2017-11-05"}, {"excerpts": ["favorite dish was Garlic  Noodles with Five Spice Chicken . ", "It was only $12.25 for this dish , totally worth the pric"], "author": "Tai N.", "review": "This restaurant is the best place to go if I want to eat Vietnamese foods .The foods was great .I always enjoy it whenever I come here .My favorite dish was Garlic  Noodles with Five Spice Chicken . It was only $12.25 for this dish , totally worth the pric", "rating": 5, "date": "2018-02-03"}, {"excerpts": ["Noodles completely stuck together even after adding hot broth and stirring a lot. ", "Imperial rolls tasted like they were made a few days before and heated up - one bite and we threw away.  "], "author": "Kelly B.", "review": "Absolutely disgusting.  We threw entire order out (had delivered).  Basil for pho was BROWN and lettuce in chicken noodle soup was almost brown.  Noodles completely stuck together even after adding hot broth and stirring a lot. Imperial rolls tasted like they were made a few days before and heated up - one bite and we threw away.  Soggy, salty and disgusting.\n\nFood was at least a day old if not more.", "rating": 1, "date": "2017-05-23"}, {"excerpts": ["Too much noodles and tofu. \n\n"], "author": "Monica N.", "review": "Came here because I was craving Bun Rieu. It was quite a disappointment. Somewhat Blan and not much meat in the soup. Too much noodles and tofu. \n\nService was kind of slow although I was the few people of 3-4 tables that was in there.", "rating": 3, "date": "2017-05-18"}, {"excerpts": ["I went back today and the noodles had an excellent texture al dente which has been lacking in the past, in fact I don't think I've ever had Pho that didn't have soft to limp noodles. "], "author": "YearOf M.", "review": "I went back today and the noodles had an excellent texture al dente which has been lacking in the past, in fact I don't think I've ever had Pho that didn't have soft to limp noodles. I hope this isn't an exception!!!\n\nThe salad and appetizer combo are good but nothing that stood out from other restaurants. I would order those again and will try other items, but imo the pho is outstanding and as ErinG noted, customizable.", "rating": 5, "date": "2017-01-30"}, {"excerpts": ["Noodles cooked just right. ", "So soft. ", "And I'm a little picky about my fish sauce being too vinegar-y "], "author": "Nora N.", "review": "OH DANG.\n\nThis place has... UNBEATABLE prices. \nIt's modern and a little fancy inside. A good date spot. Nice window seats to watch the town go by.\n\nI'd park on Irving(?) street if you can.\n\nMy only gripe was the the server brought out my food about 5 minutes before my date's food. We elected to wait. \n\nThe Pho was.. literally the best Pho I've ever tasted. Great quality ingredients. Warm and inviting and rich with flavor. \n\nThe grilled pork vermicelli was perfect too. Noodles cooked just right. So soft. And I'm a little picky about my fish sauce being too vinegar-y but they did good. \n\nI would definitely recommend this place for a date spot, a lunch meet, a family occasion too. Looked like they hard large tables are tables bunched together to accommodate bigger groups. \n\nThanks for an awesome experience.", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["Ordered the chicken garlic noodles to go. ", "The noodles were fine- not the best I've had but not terrible. ", "The chicken however was pretty gross. ", "It was basically all cartilage and I ended up throwing it away. ", "Definitely not worth the 13 dollars I paid for it. "], "author": "Tony G.", "review": "Ordered the chicken garlic noodles to go. The noodles were fine- not the best I've had but not terrible. The chicken however was pretty gross. It was basically all cartilage and I ended up throwing it away. Definitely not worth the 13 dollars I paid for it. Will not be returning.\n\nI did think the interior of the restaurant was quite nice however- very clean and cute.", "rating": 3, "date": "2017-04-08"}, {"excerpts": ["There was a good portion of noodles and shrimp. ", "The soup was nice and flavorful. ", "The claypot tasted good but had so much more rice than toppings. ", "There were only maybe 5 pcs of chicken ", "but I guess it was because there was also some shrimp and sausage. ", "Overall, everything tasted good. ", "Would come back for the seafood noodle but not the claypot."], "author": "Christine L.", "review": "Came for lunch on a Saturday, no wait but the food took a while. We ordered the seafood noodle soup and the clay pot. The seafood noodle soup was the best in SF. The tofu was nice and crispy. There was a good portion of noodles and shrimp. The soup was nice and flavorful. The claypot tasted good but had so much more rice than toppings. There were only maybe 5 pcs of chicken but I guess it was because there was also some shrimp and sausage. Overall, everything tasted good. Would come back for the seafood noodle but not the claypot.", "rating": 5, "date": "2016-08-06"}, {"excerpts": ["Also noodles really tasted soggy and not fresh. ", "My friends pho.was a beef one and she also said it was bad."], "author": "Julie V.", "review": "Worse pho ever had!!!\nI ordered vegetarian spicy hue soup with extra veggies. It only had bok choy and a very few mushrooms. Normally vegetarian pho is chock full of veggies. Also noodles really tasted soggy and not fresh. My friends pho.was a beef one and she also said it was bad.", "rating": 1, "date": "2017-05-08"}, {"excerpts": ["Love their sweet and sour veggie noodles. ", "In fact, this place has the best vegetarian options I've seen at a Vietnamese restaurant. ", "Place is also clean and staff is friendly."], "author": "Linda L.", "review": "Yum... my favorite Vietnamese noodle spot! Love their sweet and sour veggie noodles. In fact, this place has the best vegetarian options I've seen at a Vietnamese restaurant. Place is also clean and staff is friendly.", "rating": 5, "date": "2016-11-03"}, {"excerpts": ["The rice noodles were also slightly overcooked. "], "author": "Gene G.", "review": "Caution: Their Pho is an MSG bomb! I'm particularly sensitive to MSG and I gave up on eating it after one spoonful of their broth. Even my wife, who is Vietnamese and used to eating Pho with MSG, got really thirsty and dry-mouthed shortly after eating it- and she didn't even really drink much of the broth.\n\nThe rice noodles were also slightly overcooked. The portion of herbs and beansprouts was the smallest I've ever had at any Vietnamese restaurant.\n\nWe also ordered their Pork Chop combination plate for $13.00. This is usually an indulgent feast at most Vietnamese restaurants. Here however, it was just one wafer thin pork chop, three thin slices of cucumber, and two bites of egg cake. Nice presentation, but a total rip off for the price. This was maybe $6 worth of food, at most.\n\nMy wife and I will not be returning. Such a disappointment as we were excited to see a new Vietnamese restaurant in our neighborhood.", "rating": 1, "date": "2016-06-20"}, {"excerpts": ["Food is decent- garlic noodles are little bland and eggplant had good flavor but was a little soggy. ", "Portions are big enough but on the smaller side considering perilla is right around the corner and is very good."], "author": "J A.", "review": "Food is decent- garlic noodles are little bland and eggplant had good flavor but was a little soggy. Portions are big enough but on the smaller side considering perilla is right around the corner and is very good.", "rating": 3, "date": "2017-04-08"}, {"excerpts": ["There are just some days that require garlic noodles. ", "On those days come to Sunflower. ", "Nice new location. ", "Portion was definitely smaller than Potrero but still sufficient. ", "Nice ambiance and near the park."], "author": "Sandi E.", "review": "There are just some days that require garlic noodles. On those days come to Sunflower. Nice new location. Portion was definitely smaller than Potrero but still sufficient. Nice ambiance and near the park.", "rating": 4, "date": "2016-06-24"}, {"excerpts": ["Soup was light but flavorful, good amount of noodles. ", "Only downside was the chicken was a little on the salty side, seemed like it was marinated in fish sauce too long."], "author": "Brendan C.", "review": "Clean modern space with above average pho. I had the five spice chicken pho ($10). Soup was light but flavorful, good amount of noodles. Only downside was the chicken was a little on the salty side, seemed like it was marinated in fish sauce too long.", "rating": 4, "date": "2017-01-30"}], "mango sticky rice dessert": [], "vietnamese ice coffee": [], "fresh squeeze orange juice": []}