{"pieces oyster katsu": [], "pieces vegetable gyoza": [], "soft shell crabs": [], "grill beef short ribs": [], "kani tempura": [], "tempura udon noodle": [], "chicken udon noodle": [], "beef udon noodle": [], "seafood udon noodle": [{"excerpts": ["My boyfriend always gets the seafood udon noodle soup: delicious broth with broccoli, shrimp, salmon, butterfish and tuna. ", "I can't remember the name of the roll that I usually get - salmon, yellowtail, avocado and roe, deep-fried - but its SO GOOD!  "], "author": "Jamie J.", "review": "This is my favorite sushi spot in SF so far. It's moderately priced and fresh. Its never too crowded, and the owners - Bing and Mandy - are very friendly and accommodating. \n\nMy boyfriend always gets the seafood udon noodle soup: delicious broth with broccoli, shrimp, salmon, butterfish and tuna. I can't remember the name of the roll that I usually get - salmon, yellowtail, avocado and roe, deep-fried - but its SO GOOD!  A full cup of tasty, hot tea is served to every guest, and they are very punctual with their refills. \n\nIf you like a low-key, friendly atmosphere, then this is the place for you. The owners will sometimes sit with the regulars, chatting and maybe sharing a hit of sake, or watching sports or Chinese and Korean soap opera on the television over the sushi bar. Occasionally, the service is a little slow, so don't show up if you need to be out in a hurry. It has the feel of a local bar, where everyone is relaxed and not trying to impress anyone.", "rating": 4, "date": "2011-12-27"}], "tempura soba": [], "eel steak": [], "salmon steak": [], "combination dish": [], "red tuna sashimi with  item combo": [], "hamachi sashimi with  item combo": [], "chicken domburi": [], "tempura donburi": [{"excerpts": ["I ordered tempura donburi and Alex ordered katsu donburi.  ", "I found it weird on the menu that a Philadelphia roll didn't exist ", "but it was called a \"New Wave roll", "\" instead, that was my first time seeing that change.  ", "We got free tea (delicious) and miso soup (mediocre) with our meals, always gets me in a good mood.  "], "author": "Lori D.", "review": "Not too bad, especially for its price.\n\nMy boyfriend Alex and I wanted dinner after watching Black Swan in West Portal.  He left his phone at home so we were without 3G and had to search for food the old-fashioned way... window browsing and menu examination.  Fuji looked good but too much money for us at that time.  So we kept wandering and came across Sushi Suki.  Menu looked affordable so we walked in.  There were 3 other parties there besides us.  Waitress told us to sit at any table.  We sat down near the door and then she said we should somewhere else to be warmer.  Courteous of her to mention that, she was also wearing a parka, something I haven't seen in a restaurant before, let alone in San Francisco...\n\nI ordered tempura donburi and Alex ordered katsu donburi.  I found it weird on the menu that a Philadelphia roll didn't exist but it was called a \"New Wave roll\" instead, that was my first time seeing that change.  We got free tea (delicious) and miso soup (mediocre) with our meals, always gets me in a good mood.  The waitress was prompt and nice, on top of the tea refills, although we had to ask for water, it wasn't automatically given.\n\nOur donburi dishes were plenty of food for about 7-8 bucks each.  Mine was tempura, sauce, and rice, cannot get any simpler than that, and it tasted fresh to me.  He was shocked to have eggs in his dish (doesn't like eggs) but he didn't mind them at all, that was very shocking.\n\nBathroom was clean and with ample seat covers, much appreciated.\n\nNot sure if I would eat sushi from here but the food is cheap, fresh and tasty.  I'd come back and maybe get noodles next time.", "rating": 3, "date": "2011-01-30"}], "oyako donburi": [], "tofu sukiyaki": [], "veggie tempura and udon": [], "veggie tempura and soba": [], "salmon maki roll": [], "hamachi maki roll": [], "canadian maki roll": [], "new wave maki roll": [], "unagi maki roll": [], "dynamite maki roll": [], "pieces spicy tuna maki roll": [], "caterpillar maki roll": [], "dragon maki roll": [], "tempura maki roll": [], "rainbow maki roll": [], "spider maki roll": [], "er maki roll": [], "crazy maki roll": [{"excerpts": ["One of my friends got an order of gyoza for us to share (average), while I ended up ordering the Chicken Katsu dinner entree (comes with rice, miso soup, and salad/japanese coleslaw) and the Crazy Maki roll (tuna and salmon inside with hamachi on top).  ", "The Chicken Katsu was pretty good...", "the meat was still juicy and the breading wasn't too heavy or thick.  ", "I thought the order was a little small compared to other places when you get it as an entree, but it was still filling enough.  ", "Plus, let's be honest, it's probably not the best thing health-wise to have that much fried stuff anyways..."], "author": "Mike L.", "review": "When a couple of buddies and I were looking for an out of the way sort of spot with easy parking to grab a late dinner, Sushi Suki came to mind.  On the far end of West Portal, I used to pass this place all the time on the way home from work and I wondered if it was any good.  So, this seemed like as good of a time as any to come out this way to try it out.  \n\nI have to admit that when we walked in and found ourselves to be the only customers, alarm bells started going off in my head.  I didn't expect the place to be packed (hence our reason for being there), but I didn't think it would be empty either.  Fortunately though, a couple of parties filed in soon after we did, so that was a bit comforting.  One definite bonus was that the service was pretty attentive, and the waitress (owner?) was pretty friendly with us.\n\nFor whatever reason, the menu felt pretty simple and basic even though there's a decent variety of things to order.  I guess how they split the list of rolls onto a separate sheet just threw me off.  The menu is made up of the usual suspects, but it's tilted towards sashimi and rolls (they offer a sushi/sashimi dinner combo that you can go in on with multiple people).  Prices are pretty fair, as I dont think a single item we had cracked $10 (one of my friends got the cold soba and Spicy Tuna roll, the other got a dinner combo box).\n\nOne of my friends got an order of gyoza for us to share (average), while I ended up ordering the Chicken Katsu dinner entree (comes with rice, miso soup, and salad/japanese coleslaw) and the Crazy Maki roll (tuna and salmon inside with hamachi on top).  The Chicken Katsu was pretty good...the meat was still juicy and the breading wasn't too heavy or thick.  I thought the order was a little small compared to other places when you get it as an entree, but it was still filling enough.  Plus, let's be honest, it's probably not the best thing health-wise to have that much fried stuff anyways...haha.  \n\nAs for the sushi, I thought that the Spicy Tuna was rather generic and bland...did not feel any spiciness at all.  I know in general, most Spicy Tuna rolls really aren't all that spicy anyways, but this one really did not give off a trace of heat for me.  Either that, or maybe my taste buds have finally gone numb from years of eating spicy food (man I hope not...).  The Crazy Maki is definitely a winner though - good sized cuts of fresh fish, and not a lot of rice to fill you up either.  I would definitely get this one again, and it was only $9.95, which is pretty good considering other places might try to get away with charging more.\n\nWould come back on those lazy sort of days when I'm bumming it and want some Japanese food (hello Crazy Maki!), and it definitely helps that there's a wealth of parking around here.  Not sure if I would ever come to crave it, but it beats having to look for parking at places like Kitaro...", "rating": 3, "date": "2010-10-21"}], "tiger maki roll": [], "new york maki roll": [], "sushi suki maki roll": [], "deep fried spicy tuna roll": [], "pieces red tuna sashimi": [], "pieces halibut sashimi": [], "pieces kampachi sashimi": [], "pieces salmon sashimi": [], "pieces white tuna sashimi": [], "pieces butter fish sashimi": [], "pieces sashimi combo a": [], "pieces sashimi combo b": [], "sashimi and sushi": [{"excerpts": ["The sashimi and sushi was fresh and the beef and chicken teriyaki was juicy and tender.  ", "Not bad for everything under $15!"], "author": "Karen W.", "review": "Got together with my gal pals and the place is a mom and pop type of restaurant with reasonable prices and A-ok entrees!  it's farther away from the rustle and bustle of the West Portal Station so there was parking available on the street.  We ordered two combo dinners, one with shrimp tempura and chicken teriyaki, the other with white tuna sashimi and beef teriyaki, spinach salad, unagi maki, Dynamite maki, hamachi maki, chicken udon and tonkatsu.  The sashimi and sushi was fresh and the beef and chicken teriyaki was juicy and tender.  Not bad for everything under $15!", "rating": 3, "date": "2016-12-05"}, {"excerpts": ["Sashimi and sushi were very good and fresh. ", "I also liked the plates they used to serve the food. ", "They are like art palettes with a small side dish for the soy sauce. ", "Looks like they have solid frequent customers. ", "I only gave it 4/5 stars because the space needs to be organized better. ", "It's very narrow and you have to pass a couple of storage spots to get to the restroom. ", "The stuff looks disorganized and not very neat which a lot of people might not like of a place that has to have high sanitary conditions. ", "The food and drinks (especially their tea) were super good. ", "If in the area again, I would come back."], "author": "Alix H.", "review": "Stopped here by mere coincidence...nice little hole in the wall. Sashimi and sushi were very good and fresh. I also liked the plates they used to serve the food. They are like art palettes with a small side dish for the soy sauce. Looks like they have solid frequent customers. I only gave it 4/5 stars because the space needs to be organized better. It's very narrow and you have to pass a couple of storage spots to get to the restroom. The stuff looks disorganized and not very neat which a lot of people might not like of a place that has to have high sanitary conditions. The food and drinks (especially their tea) were super good. If in the area again, I would come back.", "rating": 4, "date": "2017-07-02"}, {"excerpts": ["Has good sashimi and sushi. ", "Also has some cooked alternatives such as terayaki."], "author": "Jackie H.", "review": "Fish is usually really fresh. Good place to grab a snack. Has good sashimi and sushi. Also has some cooked alternatives such as terayaki.", "rating": 5, "date": "2016-12-20"}, {"excerpts": ["Sushi Suki is the place to go for excellent sashimi and sushi."], "author": "Marie H.", "review": "We have been going to Sushi Suki regularly for the last eight years, it is a neighborhood gem! The sashimi is fresh and always in generous portions.  Bing, the owner goes to the fish market daily so the sashimi are always fresh.  The uni is fresh, hamachi, toro, and tuna are delicious.  The hamachi kama is grilled to perfection.  The recent addition is the fresh scallop sashimi, OMG!  so good!  They have good selection of cold sake and Japanese beer.  The ambiance is friendly and homey.  The noise level can be loud at times when they have private parties, and it is always festive. Mandy, the server and wife of Bing is friendly and fun.  Sushi Suki is the place to go for excellent sashimi and sushi.", "rating": 5, "date": "2014-08-29"}], "pieces scallop sushi": [], "pieces shiro maguro sushi": [], "pieces maguro sushi": [], "pieces hamachi sushi": [], "pieces sake sushi": [], "pieces hirame sushi": [], "pieces tai sushi": [], "pieces saba sushi": [], "pieces toro sushi": [], "pieces tako sushi": [], "pieces unagi sushi": [], "pieces tobiko sushi": [], "pieces ikura sushi": [], "pieces uni sushi": [], "pieces amaebi sushi": [], "pieces ebi sushi": [], "pieces tamago sushi": [], "pieces mirugai sushi": [], "pieces sunrise sushi sushi": [], "pieces waru sushi": [], "avocado asparagus roll": [{"excerpts": ["I literally pig out on the avocado asparagus roll."], "author": "Ruby S.", "review": "This place has stayed my favorite hole in the wall since I started going in 2006. I'm pretty sure the staff is almost the exact same too! That, I love! Anyways the sushi is so good! I literally pig out on the avocado asparagus roll.", "rating": 5, "date": "2018-02-12"}, {"excerpts": ["Kappa is good here as is the avocado asparagus roll."], "author": "Katie D.", "review": "Good price and pretty good sushi.  I am a fan of veggie rolls and before I was coming here I was always going to Fuji Sushi which is across the street and way overpriced  in my opinion. Kappa is good here as is the avocado asparagus roll.", "rating": 4, "date": "2012-07-14"}], "takan roll": [], "mango roll": []}