{"deluxe on tofu noodle": [], "taka on tofu noodle": [], "deluxe bowl": [{"excerpts": ["I ordered their Deluxe bowl with brown rice. ", "The box doesn't look like much, but when you pick it up, it definitely has some weight to it. ", "The cuts are really decent and fresh. ", "Your meal also comes with a small cup of miso soup and a baggie of edamame."], "author": "Junella T.", "review": "Don't sleep on this place. The outside is nothing to look at but the portions are generous, the fish fresh, and the staff is efficient and friendly. \n\nThe line can look pretty long, but it goes pretty fast. If you come 30 mins before noon or even after, the line dies down. There isn't any real seating inside so this place is more of a carry out joint. \n\nThey have a newer updated menu with a few additions than online. I ordered their Deluxe bowl with brown rice. The box doesn't look like much, but when you pick it up, it definitely has some weight to it. The cuts are really decent and fresh. Your meal also comes with a small cup of miso soup and a baggie of edamame.", "rating": 4, "date": "2018-10-16"}, {"excerpts": ["Deluxe bowl 5/5: ", "fish was tasty and fresh"], "author": "Gary R.", "review": "Great place for a quick lunch to go. Stopped by at 11:30am on a Monday and there was no wait. Great variety of sushi bowls and burritos. Comes with free miso soup and edamame.\n\nDeluxe bowl 5/5: fish was tasty and fresh", "rating": 5, "date": "2017-09-05"}], "deluxe bowl gluten free": [], "taka bowl": [{"excerpts": ["I usually get the taka bowl. ", "The fish is fresh, and the portion is pretty well-sized for the price. ", "My only gripe is that the rice isn't always consistent, but I don't mind much."], "author": "Cynthia M.", "review": "I like to stop by this place after work often. They recently started closing later, and they give $1 off after worktime (I don't remember the exact time). I usually get the taka bowl. The fish is fresh, and the portion is pretty well-sized for the price. My only gripe is that the rice isn't always consistent, but I don't mind much.", "rating": 4, "date": "2018-10-29"}, {"excerpts": ["I usually stick with the Taka Bowl, consisting of salmon, spicy tuna, avocado, masago, seaweed salad, crab salad, etc. ", "During lunch time, there's a moderate line, but they are really efficient and it moves fast. "], "author": "James N.", "review": "This place has been a great grab-and-go lunch spot. The portion size is great and they usually give you miso soup and edamame in addition. I usually stick with the Taka Bowl, consisting of salmon, spicy tuna, avocado, masago, seaweed salad, crab salad, etc. During lunch time, there's a moderate line, but they are really efficient and it moves fast. The burritos are also pretty interesting; I'm not a huge fan, but I'll get it once in a while.\n\nGet ten meals and on your next one, save $10. The app once failed and a person took my name and number down to later apply the ten stamps to my account. I've also seen it happen a few weeks ago to another person. I wouldn't trust them to apply those points to your account, since when I stopped by again a few weeks later, I was still at zero and it was awkward...\n\nMEALPAL comments:\nDefinitely one of my favorites on MealPal. Skip the line and just get your food. You won't get edamame and miso soup with MealPal though. The portion size is rather decent unlike most MealPal locations that exhibit a one-third reduction. I like going on Tuesdays for their Taka bowls - Taka Tuesdays!", "rating": 4, "date": "2018-04-17"}, {"excerpts": ["I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\n"], "author": "Meghan J.", "review": "I've been a supporter of Sushi Taka ever since I started working in the area. Being just a short distance from work, it was an easy go-to. Not gonna lie-I was wrapped up in the whole sushi burrito thing for a while, lol. \n\nThis place has expanded their menu, offering more than just the few choices of the sushi burritos and bowls from the previous menu. (It doesn't look like the entire menu is listed for the Order Pickup on here, so you will have to order there for the other options). They have newly-added bases for you to choose (white/brown rice, mixed greens, ramen salad). I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\nThe place is small, but more of a pick-up-your-food-type-of place. Though the line is often out the door, the service is quick- I am out the door shortly after ordering at the counter (in my experiences, at least). Solid sushi burrito/poke spot! It's been difficult to find another good poke spot in the area, but it's nice to know Taka is here to stay!", "rating": 5, "date": "2017-08-04"}, {"excerpts": ["After enduring the same long slow moving line, this time I decided to get the Taka Bowl ($10.58) which as per the menu consists of salmon poke, spicy tuna, crab salad, spicy tobiko, egg crepe, avocado, mixed greens and seaweed salad. ", "This time I said yes I do want miso soup and got a small container with miso soup along with my Taka Bowl. ", "The Taka Bowl was also good. ", "The only thing that I didn't like was the imitation crab salad ", "so I'd drop that the next time, but that is more of a personal choice. "], "author": "Ahmad J.", "review": "I've tried Sushi Taka for lunch a couple of days ago. It is located on California & Kearny which is like the end of FiDi and start of Chinatown, so it ended up being quite a walk from my office. At the peak lunch hour there was a huge line almost 15 people deep which meant it was definitely popular. Unfortunately the line moved very slowly and it took almost 15 minutes for my turn to order. The menu here is rice bowls and sushi burritos. I decided to get the Fire Bowl ($9.66). The gentleman behind the counter asked if I wanted miso soup and not knowing that it comes free with the Fire Bowl, I declined. \n\nAs per the menu the Fire bowl consists of fresh Salmon, spicy Tuna, spicy tobiko, egg crepe, mixed greens, seaweed Salad and spicy mayo. What I got contained all elements. It also tasted good. Everything seemed to be fresh and even the rice was of a decent quality. As I liked what I got I came back after a couple of days. After enduring the same long slow moving line, this time I decided to get the Taka Bowl ($10.58) which as per the menu consists of salmon poke, spicy tuna, crab salad, spicy tobiko, egg crepe, avocado, mixed greens and seaweed salad. This time I said yes I do want miso soup and got a small container with miso soup along with my Taka Bowl. The Taka Bowl was also good. The only thing that I didn't like was the imitation crab salad so I'd drop that the next time, but that is more of a personal choice. The hot miso soup was average but a welcome addition for a cold day.\n\nPrice wise most of their items are below the $12 mark which is considered good for the area. Quality is also good for the price. Service is slow. They need to speed up as standing outside in the cold is not fun and they should simply provide the miso soup to everyone rather than ask each person individually. Overall there are some rough edges but this is a solid place to get a decent sushi bowl at a reasonable price in FiDi.", "rating": 4, "date": "2017-07-06"}, {"excerpts": ["+ Taka Bowl (salmon + spicy tuna)\n+ Salmon Bowl (salmon)\n\n"], "author": "Fanny W.", "review": "Picking up my MealPal...\n\"What's your number?\"\n\"1908\"\n\"Here you go\" *looks to my friend* \"And you, what's your number?\"\n\"Oh no, she doesn't have MealPal\"\n\"I know, I'm asking for her number\"\nTHIS GUY IS THE BEST! He's all smiles every time I visit. Best response ever!\n\nPros:\n+ Decent ingredients\n+ Friendly service\n+ A table or two outside\n+ Food is always ready for MealPal\n+ Generous portions for MealPal\n\nCons:\n- Rice can be a bit stiff\n\nRecommendations:\n+ Ahi Poke Bowl (tuna)\n+ Taka Bowl (salmon + spicy tuna)\n+ Salmon Bowl (salmon)\n\nA solid 3.5 in terms of food quality. The food isn't bad, the price is right, and the service is good. I'm not an imitation crab or spicy tuna fan, but I'll eat it since it's in my bowl. It's not the best, but my tastebuds were not offended, so Sushi Taka is doing pretty good.\n\nYes, the rice bothers me. But for $7 through MealPal, I ain't complainin'. The fish is good, and that's what matters the most. Will be back!", "rating": 4, "date": "2018-01-30"}, {"excerpts": ["I got a taka bowl with no tamago or seaweed because I don't like either. ", "Cool that they give you complimentary miso soup and edamame. ", "The taka bowl was pretty bland and nothing was too special about it. ", "Not sure on the hype here. ", "If I come back I may try one of the rolls instead."], "author": "Hayley D.", "review": "Decided to check this place out because of the long lines I always see. \n\nCame here for lunch around 12:00 and there wasn't a line yet. I got a taka bowl with no tamago or seaweed because I don't like either. Cool that they give you complimentary miso soup and edamame. The taka bowl was pretty bland and nothing was too special about it. Not sure on the hype here. If I come back I may try one of the rolls instead.", "rating": 3, "date": "2017-05-05"}, {"excerpts": ["I tried the Taka Bowl and the Unagi Bowl. ", "The Taka Bowl seemed to have a pretty good variety of toppings: ", "Salmon, spicy tuna, imitation crab, avocado, seaweed salad, and tamago. ", "Good variety of toppings but...not very much of each topping. ", "Or the rice for that matter. ", "The photos are pretty deceiving. ", "Unagi Bowl tasted good, but it was even smaller than the Taka Bowl. ", "Unagi Bowl tasted good, but it was even smaller than the Taka Bowl. "], "author": "Sara L.", "review": "I tried the Taka Bowl and the Unagi Bowl. Brown rice instead of white rice was free, which was nice. \n\nThe Taka Bowl seemed to have a pretty good variety of toppings: Salmon, spicy tuna, imitation crab, avocado, seaweed salad, and tamago. Good variety of toppings but...not very much of each topping. Or the rice for that matter. The photos are pretty deceiving. At the least, I think they could at least fill the bowl container with more rice, which would make the bowl more filling without being a big cost to them.\n\nUnagi Bowl tasted good, but it was even smaller than the Taka Bowl. Again, I get that unagi can be expensive, but I barely had any rice with each bite. \n\nOverall, a good lunch spot, but not the greatest value in my opinion, at least for the bowls. Maybe the rolls are better value. As a side note, I find it funny that their Yelp check-in offer is free miso soup and edamame, but you already get it with any bowls and rolls LOL.", "rating": 3, "date": "2017-02-06"}, {"excerpts": ["For example, the Taka bowl through MealPal has less fish, no avocado and more filler like carrots or slaw. "], "author": "Melissa H.", "review": "This place is pricey, like most lunch spots in the fi-di. I usually get it through a meal app which helps cut the cost, but you definitely don't get the same meal going that route. For example, the Taka bowl through MealPal has less fish, no avocado and more filler like carrots or slaw. I do have to say that the quality of the fish is better than other options in the area.\n\nIf you do go at lunch time, go early or really late. During peak time the line will be quite long.", "rating": 4, "date": "2017-09-02"}, {"excerpts": ["Although the fire bowl or sushi taka bowl are some of the popular choices here, unfortunately, I do not think I will come back to try it. ", "I'll just stick to sushiritto or ohana, across the street next time."], "author": "Bailey L.", "review": "I have came back and tried the truffle salmon bowl through meal pal, I believe this item isn't on their menu though. I really enjoyed the crab salad, seaweed salad and egg crepe that it came with, but I didn't really enjoy the truffle salmon. The salmon did not taste very fresh and it was also very salty with the truffle flavor, in my opinion. Although the fire bowl or sushi taka bowl are some of the popular choices here, unfortunately, I do not think I will come back to try it. I'll just stick to sushiritto or ohana, across the street next time.", "rating": 3, "date": "2017-01-27"}, {"excerpts": ["I had their Taka Bowl and it was very good though I wished the rice was much fluffier. ", "It had a nice mix of crab, salmon, tuna, mixed greens, and seaweed salad. ", "I enjoyed it a lot. ", "The place always has a line and Friday at 1130am was no exception. ", "I had a MealPass ", "so I just had to find my name on their list and let them know."], "author": "Jen L.", "review": "I had their Taka Bowl and it was very good though I wished the rice was much fluffier. It had a nice mix of crab, salmon, tuna, mixed greens, and seaweed salad. I enjoyed it a lot. The place always has a line and Friday at 1130am was no exception. I had a MealPass so I just had to find my name on their list and let them know.", "rating": 4, "date": "2017-04-10"}, {"excerpts": ["I used to like Sushi Taka a lot (only getting the Taka Bowl) and would go fairly often since the winter of 2016. ", "At the time, I'd say 5 stars. "], "author": "Timur A.", "review": "I used to like Sushi Taka a lot (only getting the Taka Bowl) and would go fairly often since the winter of 2016. At the time, I'd say 5 stars. It was awesome!\n\nI just picked up a taka bwol today after not going there for a few months. Maybe my expectations were too high? Maybe I somehow had a much rosier memory of what I got, but I felt pretty let down. I'm not a fan of the unsliced quarter of avocado and the carrots -- avocado is tricky to eat and didn't taste fresh; carrots are a weird flavor between sort of cooked and pickled. The seaweed salad also tasted stale. I wish the Sushi Taka of days gone would make a return!\n\nAlso, minor thing, but the round bowls used to be a nice touch. It was easy to mix up the ingredients and they looked cool.", "rating": 3, "date": "2017-09-20"}, {"excerpts": ["They had a freestanding message board stating their weekly special, which was their Taka Bowl with sushi rice (https://www.yelp.com/user_local_photos?select=lEGLmG-P9CPYIVBYGScaew&userid=saJuyv784apZzH--psHZ3Q) (think chirashi).  ", "This item consists of Salmon Poke, Spicy Tuna, Crab Salad, Spicy Tobiko, Egg Crepe, Avocado, Mixed Greens, and Seaweed Salad.  ", "The flavors were good and the variety of ingredients made it extremely interesting.  ", "The regular bowl options are white or brown rice as well as mixed greens.  ", "I especially liked the spicy tuna as a nice change of pace.\n"], "author": "Mike C.", "review": "The hot trend these days seems to be rice bowls with \"sushi quality\" raw fish and a variety of ingredients to spruce them up into this wondrous meal that makes your eyes roll without giving you an ounce of guilt... sigh... did I say all that?!\nWalking to the Financial District from Chinatown, I often see a line here but, for over a year, never stopped or researched them.  A friend suggested getting lunch here on a recent weekday morning.  \nArriving just after noon, as expected, there was a line, but the wait wasn't long.  They had a freestanding message board stating their weekly special, which was their Taka Bowl with sushi rice (https://www.yelp.com/user_local_photos?select=lEGLmG-P9CPYIVBYGScaew&userid=saJuyv784apZzH--psHZ3Q) (think chirashi).  This item consists of Salmon Poke, Spicy Tuna, Crab Salad, Spicy Tobiko, Egg Crepe, Avocado, Mixed Greens, and Seaweed Salad.  The flavors were good and the variety of ingredients made it extremely interesting.  The regular bowl options are white or brown rice as well as mixed greens.  I especially liked the spicy tuna as a nice change of pace.\nA few weeks later, I tried the Unagi bowl (https://www.yelp.com/user_local_photos?select=lEGLmG-P9CPYIVBYGScaew&userid=saJuyv784apZzH--psHZ3Q).  I was also impressed by my bowl and the variety of flavors and ingredients.  Having tried a couple of the \"poke bowl\" places in the Bay Area recently, the format is a bit different here as the topping and combinations are designated, making this a no-brainer. \nThough the Yelp page says free miso soup and edamame beans when checking in, it isn't even necessary as they automatically have them waiting for you (the edamame beans, while available, are prepacked at the window corner - if you come after 1 pm, they may run out).\nAlso, in reading their company's background posted on the wall, they are an authentic Japanese chain which ramps up the credibility in my book.\nAnother nice perk is, if you sign up for their frequent diner program, you will get a free one after so many meals.\nYes, this is added to my lunch rotation.\nAnd, like my policy regarding restaurants in general, just follow the line!", "rating": 4, "date": "2016-11-07"}, {"excerpts": ["MealPal - Taka Bowl on 06/16/17. \n\n"], "author": "Alice L.", "review": "MealPal - Taka Bowl on 06/16/17. \n\nWhat it is: A poke bowl with chunks of salmon, spicy minced tuna, pickled cabbage and carrots, and crab salad over rice. \n\n- Salmon chunks - Nicely marinated, tasted fresh. \n- Spicy minced tuna - medium spicy, not bad (often hard to tell with this type of tuna because it's all minced). \n- Pickled cabbage and carrots - Not sure what these are doing in a poke bowl. Picture on MealPal showed seaweed salad, and another MealPal reviewer mentioned she got seaweed salad and tamago. The cabbage and carrots are clearly cheap fillers, even though stuff like seaweed salad and corn aren't expensive and would have been much more suitable.\n- Crab salad - typical crab salad, really middle of the road. \n- Rice - mostly okay, some parts mushy. \n- No sauce. :( There was enough flavor but the whole thing was somewhat dry. \n\nVery filling but based on comparisons with other reviews, the MealPal version is clearly not up to the standards of a \"regular\" meal here. 3/5 for taste, with 1 star added for value.", "rating": 4, "date": "2017-06-19"}, {"excerpts": ["He got the spicy tuna roll ($10.11) and I got the Taka bowl ($10.58).  ", "All orders come with free miso soup.  ", "After getting our orders we sat outside and enjoyed the warm day with our fresh fish at the TransAmerica building.  ", "The spicy tuna roll came rolled up with spicy tuna, crab salad, avocado, radish, cucumber and potato chips.  ", "My taka bowl came with slices of salmon, spicy tuna, crab salad, egg crepe shreds, avocado, seaweed salad, and mixed greens.  ", "I also like for the bowls you can choose between brown rice, white rice and mixed greens.  ", "Next time I'll go for the mixed greens or brown rice.  ", "The fish was super fresh, even the salmon, which at a lot of places can taste super fishy.  ", "The spicy tuna was flavorful and didn't pack a ton of heat, but it was difficult to eat with chopsticks in bowl form, better for the roll since it's more contained in that.  ", "Seaweed salad was nicely dressed with the sesame oil, and the crab salad, though imitation crab was light and delightful. ", "Between the three raw fish bowls, only the salmon poke is the only one that doesn't come with spicy tuna.  ", "I'll try to get that one next time, or a sushi burrito.  ", "My friend enjoyed his spicy tuna roll and I got a bite of it as well.  ", "The potato chips was unusual but a nice surprise inside to make it unique and add even more crunchiness to the cucumbers and daikon.  ", "The miso soup doesn't appear to have tofu bits or seaweed in it, it also has a ton of crunchy bubble looking things in it.  "], "author": "Cat C.", "review": "A line does form even after the typical lunch rush time in this small shop.  I can see why though, the fish is super fresh, and their bowls are so filling!  They're more affordable than Sushiritto and  a little more affordable.  Also, gotta love the 100 health score!  \n\nI came here with a friend after 1PM and there was still a line out the door.  We did get our food fairly quickly though after ordering.  He got the spicy tuna roll ($10.11) and I got the Taka bowl ($10.58).  All orders come with free miso soup.  After getting our orders we sat outside and enjoyed the warm day with our fresh fish at the TransAmerica building.  The spicy tuna roll came rolled up with spicy tuna, crab salad, avocado, radish, cucumber and potato chips.  My taka bowl came with slices of salmon, spicy tuna, crab salad, egg crepe shreds, avocado, seaweed salad, and mixed greens.  I also like for the bowls you can choose between brown rice, white rice and mixed greens.  Next time I'll go for the mixed greens or brown rice.  The fish was super fresh, even the salmon, which at a lot of places can taste super fishy.  The spicy tuna was flavorful and didn't pack a ton of heat, but it was difficult to eat with chopsticks in bowl form, better for the roll since it's more contained in that.  Seaweed salad was nicely dressed with the sesame oil, and the crab salad, though imitation crab was light and delightful. Between the three raw fish bowls, only the salmon poke is the only one that doesn't come with spicy tuna.  I'll try to get that one next time, or a sushi burrito.  My friend enjoyed his spicy tuna roll and I got a bite of it as well.  The potato chips was unusual but a nice surprise inside to make it unique and add even more crunchiness to the cucumbers and daikon.  The miso soup doesn't appear to have tofu bits or seaweed in it, it also has a ton of crunchy bubble looking things in it.  I just passed after two sips.  \n\nAll in all, Sushi Taka is a great spot to go for some healthy seafood.  They do offer cooked rolls and bowls too, but, go for the fish for sure!  Raw fish craving totally satisfied here!", "rating": 4, "date": "2016-04-09"}, {"excerpts": ["I've tried the taka bowl, fire bowl, salmon poke bowl and a couple of their sushi burritos and everything here is FREAKIN BOMB. ", "I've been guilty of eating here 3-4 times a week haha. ", "Everything from the free edamame / miso to the fresh fish and seaweed salad will satisfy any craving you have for some high quality sashimi. "], "author": "Rebecca W.", "review": "Sushi Taka is hands down my favorite place of all time. I work a block away, but I would probably travel across town just to get the fire bowl here. I've tried the taka bowl, fire bowl, salmon poke bowl and a couple of their sushi burritos and everything here is FREAKIN BOMB. I've been guilty of eating here 3-4 times a week haha. Everything from the free edamame / miso to the fresh fish and seaweed salad will satisfy any craving you have for some high quality sashimi. I LOVE THIS PLACE. \n\ntip: you get wayyy more fish when you go later in the day. I usually go around 2 to avoid the lines, and they usually give me almost 2x the amount of fish!", "rating": 5, "date": "2016-04-30"}, {"excerpts": ["The Taka bowl was delicious and under $11. ", "In fidi, that's a great deal! ", "The line was long but the bowl was worth the wait. ", "The staff was really nice and you can record your fivestar card here. "], "author": "Joanna S.", "review": "The Taka bowl was delicious and under $11. In fidi, that's a great deal! The line was long but the bowl was worth the wait. The staff was really nice and you can record your fivestar card here. Free edamame on the side of the take out joint and free miso soup with Yelp check in! \n\nThere's no seats and it is kind of on the edge of fidi, but it's worth the walk and the wait! I loved the bowl with crab, salmon, tuna and mixed greens over brown rice!", "rating": 5, "date": "2016-09-08"}, {"excerpts": ["I always get the Taka Bowl, which consists of spicy tuna and salmon along with seaweed salad, imitation crab, shredded carrots, fried onions, an avocado slice, and rice. ", "The salmon is so fresh ", "and it's all ", "just so...good! ", "The portion of each component is on point too, so I'm never stuck with too much rice at the end of my meal. ", "It's a great bang for your buck (~$12; an average price for a poke bowl) because the bowl is extremely filling and you also get miso soup and edamame with your order. ", "Sometimes the line can look daunting, but the restaurant itself is just small and the workers are FAST! ", "I'm in and out in less than 10 minutes, which is a miracle during the lunch rush hour. ", "They have a virtual stamp card program, so I recommend using it so that you can eventually get a free bowl (something that I neglected to do until my third bowl)!"], "author": "Shannen N.", "review": "This is the perfect lunch spot for FiDi workers - quick, delicious, and at a reasonable price point! I always get the Taka Bowl, which consists of spicy tuna and salmon along with seaweed salad, imitation crab, shredded carrots, fried onions, an avocado slice, and rice. The salmon is so fresh and it's all just so...good! The portion of each component is on point too, so I'm never stuck with too much rice at the end of my meal. It's a great bang for your buck (~$12; an average price for a poke bowl) because the bowl is extremely filling and you also get miso soup and edamame with your order. Sometimes the line can look daunting, but the restaurant itself is just small and the workers are FAST! I'm in and out in less than 10 minutes, which is a miracle during the lunch rush hour. They have a virtual stamp card program, so I recommend using it so that you can eventually get a free bowl (something that I neglected to do until my third bowl)!", "rating": 5, "date": "2017-09-02"}, {"excerpts": ["I got the taka bowl with sushi rice and it came with a miso soup! ", "The salmon, tuna, and scallop was so fresh. ", "I'll definitely be coming back!"], "author": "Stephanie P.", "review": "My new favorite sushi spot! I got the taka bowl with sushi rice and it came with a miso soup! The salmon, tuna, and scallop was so fresh. I'll definitely be coming back!", "rating": 5, "date": "2017-10-11"}, {"excerpts": ["I got the taka bowl and it was a decent size! ", "Bonus that you don't have to check in to get the edamame and soup! "], "author": "Sarah I.", "review": "Solid sushi bowl and burritos! You will see a line outside but like everyone has stated, the line moves quickly and the people take your order while you wait in line to pay. \n\nI got the taka bowl and it was a decent size! Bonus that you don't have to check in to get the edamame and soup! They automatically give it to you! \n\nThe people in front of me got the burrito and it was like the size of my forearm. The people there even had trouble wrapping it up. \n\nI would def recommend this place over the other sushi bowls in the area. Service is way faster and the salmon was really fresh! \n\nBonus that they also have stamp cards! Get that free bowl!", "rating": 4, "date": "2017-01-13"}, {"excerpts": ["I got the Taka bowl with free miso soup and edamame. ", "It reminds me kind of of a poke bowl with the spicy raw salmon, fish roe, imitation crab, and avocado, rice and various veggies. ", "It was very flavorful and the portion was satisfying. ", "I'll be stopping by again for lunch soon!"], "author": "Michelle C.", "review": "I got the Taka bowl with free miso soup and edamame. It reminds me kind of of a poke bowl with the spicy raw salmon, fish roe, imitation crab, and avocado, rice and various veggies. It was very flavorful and the portion was satisfying. I'll be stopping by again for lunch soon!", "rating": 5, "date": "2016-11-30"}, {"excerpts": ["Taka bowl used to come with an avocado mixture, now just a plain half avocado slice\n\nDouble fish is more like 1.5x fish, again with the portions shrinking\n\n\n"], "author": "Nadim K.", "review": "This used to be one of my favorites places in the financial district however they have changed for the worst.\n\nThe portions are now less and bowls cost more.\n\nThe presentation has changed for the worst.\n\nTaka bowl used to come with an avocado mixture, now just a plain half avocado slice\n\nDouble fish is more like 1.5x fish, again with the portions shrinking\n\n\nThey have changed for the worst since their health score has been revised. At least the fish still tastes good.", "rating": 3, "date": "2017-07-03"}, {"excerpts": ["I ordered the taka bowl and asked for no salmon, and instead get more of the spicy tuna. ", "Instead I got a small portion of tuna and a heaping amount of crab. ", "Plus the rice was cold! ", "What Asian restaurant serves cold rice with their entree?! ", "It was just an overall sad lunch. ", "If I wrote a review last year, it would deserve a 5!"], "author": "Sharyn Y.", "review": "I haven't been here in quite awhile but Sushi taka has unfortunately downgraded. They changed their containers which either makes it seem portions have become smaller, or the amount really is less than before. And the prices are more expensive.  I understand prices must go up, but for the portion to go down with it? It doesn't make sense to me. I ordered the taka bowl and asked for no salmon, and instead get more of the spicy tuna. Instead I got a small portion of tuna and a heaping amount of crab. Plus the rice was cold! What Asian restaurant serves cold rice with their entree?! It was just an overall sad lunch. If I wrote a review last year, it would deserve a 5!", "rating": 2, "date": "2017-03-20"}, {"excerpts": ["and I tried the Taka Bowl. ", "The salmon had a slight bad fishy taste and the avocado was a little brown.  ", "I wish the ingredients were more fresh. ", "I'm pretty disappointed compared to the poke places in LA."], "author": "Edmund W.", "review": "It was my first time and I tried the Taka Bowl. The salmon had a slight bad fishy taste and the avocado was a little brown.  I wish the ingredients were more fresh. I'm pretty disappointed compared to the poke places in LA.", "rating": 2, "date": "2017-04-13"}, {"excerpts": ["I can only speak to the Taka Bowl because I've ordered it every time since my first visit. ", "It's consistently good, the line moves quickly, and while not cheap, it's in line with other FiDi options. ", "The staff is always friendly, too, despite some the lunchtime chaos."], "author": "Mike N.", "review": "I can only speak to the Taka Bowl because I've ordered it every time since my first visit. It's consistently good, the line moves quickly, and while not cheap, it's in line with other FiDi options. The staff is always friendly, too, despite some the lunchtime chaos.", "rating": 5, "date": "2017-04-23"}, {"excerpts": ["In the area, we grabbed the taka bowl and teriyaki bowl. ", "They offer complimentary edamame and miso soup if you want it. ", "Miso soup was too salty for my taste, but you can't really go wrong with edamame. ", "My taka bowl was filling. ", "I liked that they had my two fav fish, tuna and salmon. ", "But the spicy tuna was all mashed up, which makes me really sad because I don't like that texture. ", "I was really expecting cubed fish. ", "This place is okay."], "author": "Liliana P.", "review": "In the area, we grabbed the taka bowl and teriyaki bowl. They offer complimentary edamame and miso soup if you want it. Miso soup was too salty for my taste, but you can't really go wrong with edamame. My taka bowl was filling. I liked that they had my two fav fish, tuna and salmon. But the spicy tuna was all mashed up, which makes me really sad because I don't like that texture. I was really expecting cubed fish. This place is okay.", "rating": 3, "date": "2016-05-15"}, {"excerpts": ["Taka bowl - a little bit of everything on top of brown rice makes this a lunch highlight!  ", "Great flavors, fresh ingredients and complementary edamame and miso soup for early birds!  ", "Love it!"], "author": "Carolyn O.", "review": "Taka bowl - a little bit of everything on top of brown rice makes this a lunch highlight!  Great flavors, fresh ingredients and complementary edamame and miso soup for early birds!  Love it!", "rating": 5, "date": "2016-07-25"}, {"excerpts": ["I got the Taka bowl (Spicy Tuna and Salmon Poke). ", "The Tuna was mashed up together into a ball where I could barely pick it apart ", "and it also tasted pretty fishy despite the spicy sauce, meaning it's not very fresh. ", "The Salmon was ok, but nothing great. ", "I probably would not spend the $11 here again, but it's nice that the lunch combo comes with miso and edamame."], "author": "Aya K.", "review": "Meh. \n\nI was in the mood for a poke bowl, so I decided to try this out since it's decently close to my office. The bowl presentation is pretty and everything is pretty good, EXCEPT the fish...which is pretty much a deal breaker for me. I got the Taka bowl (Spicy Tuna and Salmon Poke). The Tuna was mashed up together into a ball where I could barely pick it apart and it also tasted pretty fishy despite the spicy sauce, meaning it's not very fresh. The Salmon was ok, but nothing great. I probably would not spend the $11 here again, but it's nice that the lunch combo comes with miso and edamame.", "rating": 3, "date": "2016-05-03"}], "fire bowl": [{"excerpts": ["I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\n"], "author": "Meghan J.", "review": "I've been a supporter of Sushi Taka ever since I started working in the area. Being just a short distance from work, it was an easy go-to. Not gonna lie-I was wrapped up in the whole sushi burrito thing for a while, lol. \n\nThis place has expanded their menu, offering more than just the few choices of the sushi burritos and bowls from the previous menu. (It doesn't look like the entire menu is listed for the Order Pickup on here, so you will have to order there for the other options). They have newly-added bases for you to choose (white/brown rice, mixed greens, ramen salad). I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\nThe place is small, but more of a pick-up-your-food-type-of place. Though the line is often out the door, the service is quick- I am out the door shortly after ordering at the counter (in my experiences, at least). Solid sushi burrito/poke spot! It's been difficult to find another good poke spot in the area, but it's nice to know Taka is here to stay!", "rating": 5, "date": "2017-08-04"}, {"excerpts": ["I decided to get the Fire Bowl ($9.66). ", "The gentleman behind the counter asked if I wanted miso soup and not knowing that it comes free with the Fire Bowl, I declined. \n\n", "As per the menu the Fire bowl consists of fresh Salmon, spicy Tuna, spicy tobiko, egg crepe, mixed greens, seaweed Salad and spicy mayo. ", "What I got contained all elements. ", "It also tasted good. ", "Everything seemed to be fresh and even the rice was of a decent quality. ", "As I liked what I got I came back after a couple of days. "], "author": "Ahmad J.", "review": "I've tried Sushi Taka for lunch a couple of days ago. It is located on California & Kearny which is like the end of FiDi and start of Chinatown, so it ended up being quite a walk from my office. At the peak lunch hour there was a huge line almost 15 people deep which meant it was definitely popular. Unfortunately the line moved very slowly and it took almost 15 minutes for my turn to order. The menu here is rice bowls and sushi burritos. I decided to get the Fire Bowl ($9.66). The gentleman behind the counter asked if I wanted miso soup and not knowing that it comes free with the Fire Bowl, I declined. \n\nAs per the menu the Fire bowl consists of fresh Salmon, spicy Tuna, spicy tobiko, egg crepe, mixed greens, seaweed Salad and spicy mayo. What I got contained all elements. It also tasted good. Everything seemed to be fresh and even the rice was of a decent quality. As I liked what I got I came back after a couple of days. After enduring the same long slow moving line, this time I decided to get the Taka Bowl ($10.58) which as per the menu consists of salmon poke, spicy tuna, crab salad, spicy tobiko, egg crepe, avocado, mixed greens and seaweed salad. This time I said yes I do want miso soup and got a small container with miso soup along with my Taka Bowl. The Taka Bowl was also good. The only thing that I didn't like was the imitation crab salad so I'd drop that the next time, but that is more of a personal choice. The hot miso soup was average but a welcome addition for a cold day.\n\nPrice wise most of their items are below the $12 mark which is considered good for the area. Quality is also good for the price. Service is slow. They need to speed up as standing outside in the cold is not fun and they should simply provide the miso soup to everyone rather than ask each person individually. Overall there are some rough edges but this is a solid place to get a decent sushi bowl at a reasonable price in FiDi.", "rating": 4, "date": "2017-07-06"}, {"excerpts": ["I had the Fire bowl today with brown rice.  ", "Where did the egg go?  ", "No mixed greens?  ", "I still enjoyed it though.  ", "All that protein is very filling.  ", "It can be a lot of rice so you can ask for less or just not eat it.  ", "It has salmon pieces, spicy tuna, seaweed salad and pickled carrots with spicy mayo.  "], "author": "Susan C.", "review": "I've picked up lunch here a few times and food is consistent.  It's reliable and the biggest draw for me is the location because I'm less than a block away.  \n\nI have had most thing here -- sushi burritos and bowls.  I had the Fire bowl today with brown rice.  Where did the egg go?  No mixed greens?  I still enjoyed it though.  All that protein is very filling.  It can be a lot of rice so you can ask for less or just not eat it.  It has salmon pieces, spicy tuna, seaweed salad and pickled carrots with spicy mayo.  I need to remember to ask them to hold the spicy mayo next time.\n\nI signed up for their loyalty program so they send me coupons regularly.  I used a $2 coupon today.  It's all tied to a phone number so it's easy to track and redeem.\n\nEveryone is offered free miso soup and edamame.  No extra fee for that.  But they ran out of edamame at 1:10 when I was there today.\n\nSeems that they buy everything processed (spicy tuna out of a tub?), pickled carrots in huge bags??  I could be totally off but it don't look made onsite.", "rating": 3, "date": "2017-07-19"}, {"excerpts": ["I generally always get the fire bowl and swap the rice out for mixed greens. "], "author": "David J.", "review": "Love Sushi Taka and the people that run it. Such pleasant friendly people and always willing and able to cater to adjustments. I generally always get the fire bowl and swap the rice out for mixed greens. Great size, good quality ingredients, and made super fast.\n\nI have tried their salmon poke burrito many times as well and it beats the pants off the 'original' burrito guys down the road at Sushiritto, and cheaper to boot. \n\nIcing on the cake here is the free miso soup and edamame as well. A great little accompaniment for their food.\n\nThey have a loyalty scheme too which is great - come 10 times and save $10.", "rating": 5, "date": "2018-03-04"}, {"excerpts": ["I ordered the fire bowl which was.... good, but not great, in my opinion. "], "author": "Jaq I.", "review": "I ordered the fire bowl which was.... good, but not great, in my opinion. I have really high standards for sushi and poke bowls, and this didn't really meet my expectations. \n\nHowever, the customer service here is amazing. The folks that work here are super friendly, quick, and efficient. Perfect for grabbing a quick lunch when you're in a rush!\n\nThe customer service alone is enough for me to return back. :)", "rating": 4, "date": "2018-02-04"}, {"excerpts": ["Although the fire bowl or sushi taka bowl are some of the popular choices here, unfortunately, I do not think I will come back to try it. ", "I'll just stick to sushiritto or ohana, across the street next time."], "author": "Bailey L.", "review": "I have came back and tried the truffle salmon bowl through meal pal, I believe this item isn't on their menu though. I really enjoyed the crab salad, seaweed salad and egg crepe that it came with, but I didn't really enjoy the truffle salmon. The salmon did not taste very fresh and it was also very salty with the truffle flavor, in my opinion. Although the fire bowl or sushi taka bowl are some of the popular choices here, unfortunately, I do not think I will come back to try it. I'll just stick to sushiritto or ohana, across the street next time.", "rating": 3, "date": "2017-01-27"}, {"excerpts": ["Ordered a fire bowl! ", "Definitely big portions. ", "I'm a swimmer and anyone who has experience with competitive swimming knows that swimmers eat A LOT! ", "At the end of my meal, I ate everything and was definitely satisfied. ", "The fire bowl comes with seaweed salad, mixed greens, spicy tuna, spicy tobiko, salmon, and tempura bits. ", "On the website, it said that it also comes with the egg crepe, all over a bed of your choice of either white or brown rice (that they put a little teriyaki sauce over to give it some flavor). ", "They were out of brown rice today and also out of the egg crepe because I didn't get any in my fire bowl. \n\n", "Fire bowl comes with edamame and miso soup. ", "They are first come, first serve as they only have a limited amount. ", "When I got there, they ran out of edamame. ", "So I didn't have any :( ", "The miso soup comes from a dispenser! ", "I've never had miso soup from a dispenser ", "so I was skeptical. ", "But after tasting it, it was pretty standard with seaweed tempura bits. ", "Would've loved to have some tofu cubes in there though. ", "Fresh sushi, bang for your buck, quick and easy place! ", "Will definitely be back."], "author": "Cynthia T.", "review": "Ordered a fire bowl! Definitely big portions. I'm a swimmer and anyone who has experience with competitive swimming knows that swimmers eat A LOT! At the end of my meal, I ate everything and was definitely satisfied. The fire bowl comes with seaweed salad, mixed greens, spicy tuna, spicy tobiko, salmon, and tempura bits. On the website, it said that it also comes with the egg crepe, all over a bed of your choice of either white or brown rice (that they put a little teriyaki sauce over to give it some flavor). They were out of brown rice today and also out of the egg crepe because I didn't get any in my fire bowl. \n\nFire bowl comes with edamame and miso soup. They are first come, first serve as they only have a limited amount. When I got there, they ran out of edamame. So I didn't have any :( The miso soup comes from a dispenser! I've never had miso soup from a dispenser so I was skeptical. But after tasting it, it was pretty standard with seaweed tempura bits. Would've loved to have some tofu cubes in there though. Fresh sushi, bang for your buck, quick and easy place! Will definitely be back.", "rating": 4, "date": "2016-02-17"}, {"excerpts": ["I ordered the fire bowl and could barely finish it. ", "Fish was not very fresh and flavors were bland."], "author": "Laura D.", "review": "Why this place has a line around the block on a daily basis baffles me and further illustrates the fact that there are very few good sushi options downtown. I ordered the fire bowl and could barely finish it. Fish was not very fresh and flavors were bland.", "rating": 1, "date": "2017-05-08"}, {"excerpts": ["I've tried their fire bowl (like a poke bowl with spicy tuna, salmon, tobiko, seaweed salad, salad, egg crepe) and their unagi bowl. ", "Both are great options and are REALLY filling. ", "All dishes come with edamame and miso soup on the side! ", "You also get a choice of brown or white rice as a base. ", "All their fish here is so fresh and they give huge chunks! ", "I was surprised when I came here today and was served big blocks of salmon. ", "And their unagi is smothered in that delicious sauce.. mmmm. "], "author": "Kathleen S.", "review": "I actually like coming here for lunch because they give you a lot of food for a good price! They offer bowls and sushi burritos; each time I've come here I've gotten a bowl because I tend to get messy with the burritos. \n\nI've tried their fire bowl (like a poke bowl with spicy tuna, salmon, tobiko, seaweed salad, salad, egg crepe) and their unagi bowl. Both are great options and are REALLY filling. All dishes come with edamame and miso soup on the side! You also get a choice of brown or white rice as a base. All their fish here is so fresh and they give huge chunks! I was surprised when I came here today and was served big blocks of salmon. And their unagi is smothered in that delicious sauce.. mmmm. Each bowl ranges from $9-$12 and they're good portions!\n\nThis place seems really popular as well; I've always seen a line out the door curving along the sidewalk. The service is pretty fast with three people usually in the back; two making the food and one person at the register. I would recommend coming here especially if you don't want to wait in the sushiritto line or want a bowl version of that.", "rating": 5, "date": "2016-05-27"}, {"excerpts": ["After I ordered my fire bowl and salmon bowl, I swear I didn't even blink 5 times and the first bowl was already made. ", "My friend said the fire bowl was a bit spicy for her (she doesn't eat spicy food at ALL. "], "author": "Cathy C.", "review": "Sushi Taka is the closest poke to my office, so I quickly headed over there at 11 AM because I didn't want to bother standing in line with the rest of SF. When I got there around 11:15 today, I was the first and the employee (I think he was the owner) was super friendly. After I ordered my fire bowl and salmon bowl, I swear I didn't even blink 5 times and the first bowl was already made. Amazing!\n\nThe salmon poke bowl was very tasty. I would say it's a perfect lunch-size bowl of food. My friend said the fire bowl was a bit spicy for her (she doesn't eat spicy food at ALL. So not bad)\n\nEdamame and miso soup were already placed in containers so you just grab them to the left. Both a bit salty but still good nonetheless.\n\nFor the price (~$10/bowl), how fast I got my food (seriously. lightning speed) and good customer service, you can't beat that anywhere else! WOO! I'M A FAN!", "rating": 5, "date": "2016-07-15"}, {"excerpts": ["I work a block away, but I would probably travel across town just to get the fire bowl here. ", "I've tried the taka bowl, fire bowl, salmon poke bowl and a couple of their sushi burritos and everything here is FREAKIN BOMB. ", "I've been guilty of eating here 3-4 times a week haha. ", "Everything from the free edamame / miso to the fresh fish and seaweed salad will satisfy any craving you have for some high quality sashimi. "], "author": "Rebecca W.", "review": "Sushi Taka is hands down my favorite place of all time. I work a block away, but I would probably travel across town just to get the fire bowl here. I've tried the taka bowl, fire bowl, salmon poke bowl and a couple of their sushi burritos and everything here is FREAKIN BOMB. I've been guilty of eating here 3-4 times a week haha. Everything from the free edamame / miso to the fresh fish and seaweed salad will satisfy any craving you have for some high quality sashimi. I LOVE THIS PLACE. \n\ntip: you get wayyy more fish when you go later in the day. I usually go around 2 to avoid the lines, and they usually give me almost 2x the amount of fish!", "rating": 5, "date": "2016-04-30"}, {"excerpts": ["$11 for the fire bowl to go.\n", "I remember when they were just a 2 person operation, but now they have like 6 people in there pumping out sushi bowls.\n", "Although I was used to the nice round bowl before, I don't mind the clear plastic one. ", "Now you can show off your food to the world lol!\n", "There is a line that wraps around the corner of the building everyday, so it shows how popular they have been getting.\n", "I'm a pretty big eater, but I can usually fill up on one of these bowls + edamame and miso soup. ", "However, there are days I'm starving ", "and I request the \"Double Fish\" (for any raw fish bowl). ", "2x the fish, you'll have more fish than rice at just a few bucks more.\n", "If you're about to die of starvation, I guess you can go for the \"Triple Fish\", never really been that hungry before. ", "Pretty sure these options are still on there as part of their ura-menu.\n", "Request the Dragon Bowl if you want Unagi and shrimp tempura."], "author": "Mike O.", "review": "Still one of the best bangs for your buck in the FIDI during lunch time. $11 for the fire bowl to go.\nI remember when they were just a 2 person operation, but now they have like 6 people in there pumping out sushi bowls.\nAlthough I was used to the nice round bowl before, I don't mind the clear plastic one. Now you can show off your food to the world lol!\nThere is a line that wraps around the corner of the building everyday, so it shows how popular they have been getting.\nI'm a pretty big eater, but I can usually fill up on one of these bowls + edamame and miso soup. However, there are days I'm starving and I request the \"Double Fish\" (for any raw fish bowl). 2x the fish, you'll have more fish than rice at just a few bucks more.\nIf you're about to die of starvation, I guess you can go for the \"Triple Fish\", never really been that hungry before. Pretty sure these options are still on there as part of their ura-menu.\nRequest the Dragon Bowl if you want Unagi and shrimp tempura.", "rating": 4, "date": "2017-05-18"}, {"excerpts": ["The fire bowl is my favorite."], "author": "Christine M.", "review": "I'm generally a cheapskate who prefers to bring lunch from home. I've worked in the Fidi for years and it pains me to pay $12 or more for a small amount of unexceptional salad or whatever. That said, I love this place because they give you lots of rice and fresh raw fish for a very fair price(confused about the reviews complaining about small portions tbh). They even throw in a free miso soup. I tend to go at 1 PM and the wait is probably 3 minutes or less. The fire bowl is my favorite.", "rating": 4, "date": "2017-05-02"}, {"excerpts": ["I've tried the Fire Bowl and Super Bowl ", "(their weekly special bc it was the super bowl weekend, ahhh such a clever name...) ", "both were amazing!  ", "The salmon is my favorite.  ", "You can see the fatty lines throughout the cuts.  ", "The spicy tuna is a tad too spicy, but still good.  "], "author": "Lynn L.", "review": "Every time I pass by this street I always see a line around the corner for this hole in the wall.  After 3 years of passing this place I finally decided to come on a rainy day.  I figured rainy day means less people right...?  I was right!  Even if there is a line, it usually goes by quick.  I've tried the Fire Bowl and Super Bowl (their weekly special bc it was the super bowl weekend, ahhh such a clever name...) both were amazing!  The salmon is my favorite.  You can see the fatty lines throughout the cuts.  The spicy tuna is a tad too spicy, but still good.  The avocado that was in the Super Bowl was more like guacamole, which I could've skipped.  \n\nA coworker came along that had gluten allergies and they were very accommodating.  They joked around with her saying, \"Yes of course we can adjust for you... it will only take a few hours!\"  It was funny until I heard them recite the same joke on 2 people behind her... You jokester you...\n\nHealthy, affordable, friendly service... why are you still reading reviews? GO NOW!", "rating": 4, "date": "2016-02-12"}, {"excerpts": [",\nSeaweed Salad added,\nFried Little Tempura Bits,\nSpicy Tobiko Topping,\nGreens also,\nAka Fire Bowl!\n\n", "Seriously, I like their Fire Bowl."], "author": "Scott L.", "review": "Lunch time in the FIDI,\nStand in line,\nIt goes fast!\nOrder your bowl,\nTuna and Salmon,\nBrown Rice Please!,\nSeaweed Salad added,\nFried Little Tempura Bits,\nSpicy Tobiko Topping,\nGreens also,\nAka Fire Bowl!\n\nSoup included.\nOn your way,\nGet back to work.\nEat in your Office,\nWhat a life?!?\n\nSeriously, I like their Fire Bowl.", "rating": 4, "date": "2016-04-29"}, {"excerpts": ["We got the Salmon Poke Bowl and Fire Bowl and both were quite good. ", "The box is deceiving - at first glance, I thought it was a small portion but by the end I was definitely full. "], "author": "Jennifer D.", "review": "I read on yelp that the line would be wrapped around the block but I came toward the end of the lunch hours and there was no wait! We got the Salmon Poke Bowl and Fire Bowl and both were quite good. The box is deceiving - at first glance, I thought it was a small portion but by the end I was definitely full. And both bowls also came with a complimentary side of Miso Soup!\n\nThere is no seating indoors so that's a con, but there are nearby parks or areas where you can eat your food. Also, when we asked for two cups of water they didn't have proper cups so they served us water in the miso soup bowls (which was odd).\n\nOverall, a good lunch spot but nothing too special!", "rating": 3, "date": "2017-04-04"}, {"excerpts": ["For a little under $10 you get a decent size Fire Bowl (Spicy Tuna, Salmon, Spicy Roe, Tempura Flakes Seaweed Salad", ") Edamame and a small miso soup.  ", "They offer other bowls like Salmon Poke, Unagi, Beef, Chicken Teriyaki, and Tofu.  ", "They also offer sushi burritos like Sushirrito.  ", "I haven't tried any other item on the menu except the Fire Bowl because for me, it was love at first bite!  ", "Everything is made fresh to order and the service is fast.\n \n", "There's no seating at this corner locale ", "so it's take out only.  ", "The line can get quite long at around 12:30 so if you arrive around noon to 12:15, the wait should not be long."], "author": "Scott L.", "review": "Located in Chinatown.\n \nFor a little under $10 you get a decent size Fire Bowl (Spicy Tuna, Salmon, Spicy Roe, Tempura Flakes Seaweed Salad) Edamame and a small miso soup.  They offer other bowls like Salmon Poke, Unagi, Beef, Chicken Teriyaki, and Tofu.  They also offer sushi burritos like Sushirrito.  I haven't tried any other item on the menu except the Fire Bowl because for me, it was love at first bite!  Everything is made fresh to order and the service is fast.\n \nThere's no seating at this corner locale so it's take out only.  The line can get quite long at around 12:30 so if you arrive around noon to 12:15, the wait should not be long.", "rating": 4, "date": "2016-03-14"}, {"excerpts": ["Total damage for a fire bowl: $10.50"], "author": "Jenny L.", "review": "05.24.16 | bookmarked 02.08.12\n\nBetter and cheaper Sushirito. Serves sushi bowls in addition to the giant rolls. Each order comes with edamame and miso soup.\n\nLine can get long but moves rather quickly. No seating, so find yourself a nice public park nearby and enjoy the lunch!\n\nTotal damage for a fire bowl: $10.50", "rating": 4, "date": "2016-05-27"}, {"excerpts": ["I ordered the fire bowl both time and it was awesome.  ", "Their fish (salmon and spicy tuna) is fresh and they drizzle a tasty sauce over the bowl.  ", "I also really like the seaweed salad and the eggs that come in the bowl.  ", "Everything just works really well.  ", "The portion is large AND they give you a miso soup and edamame.  ", "It's one of the better deals around."], "author": "Carrie L.", "review": "This is a popular lunch time spot.  There's usually a line out the door, but they are efficient.  I have only been here twice, but have not waited for more than 10 minutes both times.  \n\nI ordered the fire bowl both time and it was awesome.  Their fish (salmon and spicy tuna) is fresh and they drizzle a tasty sauce over the bowl.  I also really like the seaweed salad and the eggs that come in the bowl.  Everything just works really well.  The portion is large AND they give you a miso soup and edamame.  It's one of the better deals around.", "rating": 5, "date": "2016-11-17"}, {"excerpts": ["Ordered the Fire bowl, there was no \"fire\", but it was mighty tasty! ", "They give you generous amounts of fish and free sides of edamame and miso soup. ", "No worries, they have sriracha in the condiments section for the fire factor. ", "A well spent $9-10. \n \n", "NOTE: ", "On your first visit, you can save $1 when you sign up for the 5 star reward program."], "author": "Jennifer H.", "review": "Ordered the Fire bowl, there was no \"fire\", but it was mighty tasty! They give you generous amounts of fish and free sides of edamame and miso soup. No worries, they have sriracha in the condiments section for the fire factor. A well spent $9-10. \n \nNOTE: On your first visit, you can save $1 when you sign up for the 5 star reward program.", "rating": 5, "date": "2016-07-11"}, {"excerpts": ["I ordered the fire bowl with white rice (my preference is brown rice, but they were sold out of that...", "all good). ", "I also received a miso soup. ", "Both the poke bowl and miso soup were good! ", "The food is fresh, customer service is friendly, and pricing is affordable. ", "I plan to go back!"], "author": "Stacie S.", "review": "I work in the area and have seen this eatery numerous times with long lines, so I thought I'd give it a try. I ordered the fire bowl with white rice (my preference is brown rice, but they were sold out of that...all good). I also received a miso soup. Both the poke bowl and miso soup were good! The food is fresh, customer service is friendly, and pricing is affordable. I plan to go back!", "rating": 5, "date": "2016-10-23"}, {"excerpts": ["The fire bowl is the best deal around. ", "And it is really tasty. ", "The guys are always so nice and happy every time I come here , and I come at least once a week. "], "author": "S. S.", "review": "Love this place. The fire bowl is the best deal around. And it is really tasty. The guys are always so nice and happy every time I come here , and I come at least once a week. Also, miso soup and edamame is free with your purchase. \n\nIf you do want to come, make sure to come early on take a late lunch because normal lunch rush has a line out the door and around the corner.", "rating": 5, "date": "2016-07-15"}, {"excerpts": ["I got the fire bowl because it had more ingredients ", "and it was the same price as the dragon bowl. ", "EXCEPT for the fact that I didn't get any kimchi in my bowl, unless it was there ", "and I didn't see it or eat it. ", "That was strange. ", "The bowl looks super full, which is great, but it's a little rice heavy. ", "Regardless, it's still a hearty meal. ", "The fish tasted fresh, unlike some of the reviewers. "], "author": "Jeannie L.", "review": "This is one of those places you kinda walk by and not notice, but notice. It's a strange description but it works. It's one of those places that doesn't really catch your eye, but you see it because it's on the corner of the busy block of Kearny for Fidi people looking for lunch. \n\nThis place isn't anything fancy on the inside at all. It looks small and dinky. The menu is straight forward. You can't find it online, but I posted readable pictures. There's nothing more that irks me than a place without an accessible online menu. I like to know what I'm in for before going to a place. \n\nI got the fire bowl because it had more ingredients and it was the same price as the dragon bowl. EXCEPT for the fact that I didn't get any kimchi in my bowl, unless it was there and I didn't see it or eat it. That was strange. The bowl looks super full, which is great, but it's a little rice heavy. Regardless, it's still a hearty meal. The fish tasted fresh, unlike some of the reviewers. Maybe I got there on a good day? \n\nWith your bowl or roll, you get a salad and miso soup (if you choose to do so, they will ask if you want a free salad and soup -- why wouldn't you say yes?). The miso soup comes out of a machine, so it's not the best but it's free... so it's decent. \n\nI'll come back to try out the other bowls to see if there's much of a difference... I don't think there will be but at least it's a easy way to get a hearty bowl of rice and fish.", "rating": 4, "date": "2015-02-23"}, {"excerpts": ["The Fire bowl is awesome. ", "It's a hit of spicy. ", "Not flaming lips or so. ", ":) I definitely love come back. ", "Its fast too, i walked in ( did not order for pick up) pick what I want to order and pay. ", "Comes with miso soup. ", "Walk back to my office and only a block away. ", "And enjoy the quick order and yummy fish with roe!"], "author": "Leeto B.", "review": "First time customer. The Fire bowl is awesome. It's a hit of spicy. Not flaming lips or so. :) I definitely love come back. Its fast too, i walked in ( did not order for pick up) pick what I want to order and pay. Comes with miso soup. Walk back to my office and only a block away. And enjoy the quick order and yummy fish with roe!", "rating": 5, "date": "2017-04-14"}, {"excerpts": ["I walked right up, bought my lunch ($10.50), and they almost immediately handed me my fire bowl. ", "Pretty great! ", "As other reviews mention, there is indeed no real seating inside and the staff are quite friendly.\n", "As for the food, both the free miso soup and the fire bowl were delightful! ", "The miso soup is pretty much like all other good miso soups, so no need to go into detail there. ", "The fire bowl definitely exceeded my expectations. ", "All the ingredients, particularly the fish (salmon and spicy tuna), were nice and fresh. ", "The spicy mayo added a nice little kick to the combo as well. ", "Excellent.\n", "Will eat there again."], "author": "Laura B.", "review": "Since I heard that the lines get long here, I came to a late lunch around 2, when there was no one in line at all. I walked right up, bought my lunch ($10.50), and they almost immediately handed me my fire bowl. Pretty great! As other reviews mention, there is indeed no real seating inside and the staff are quite friendly.\nAs for the food, both the free miso soup and the fire bowl were delightful! The miso soup is pretty much like all other good miso soups, so no need to go into detail there. The fire bowl definitely exceeded my expectations. All the ingredients, particularly the fish (salmon and spicy tuna), were nice and fresh. The spicy mayo added a nice little kick to the combo as well. Excellent.\nWill eat there again.", "rating": 5, "date": "2016-04-20"}, {"excerpts": ["The fire bowl is amazing. ", "It's best to get there a little before noon to avoid the long line."], "author": "Meghan M.", "review": "One of the best lunch places in the Financial District. The fire bowl is amazing. It's best to get there a little before noon to avoid the long line.", "rating": 5, "date": "2017-04-30"}, {"excerpts": ["My favorite so far is the Fire Bowl.  ", "It consists of seaweed salad, mixed greens, spicy tuna, spicy tobiko, salmon, and tempura bits.  ", "Fire Bowl is $9.50 and it comes with hot miso soup.  \n\n"], "author": "Erick L.", "review": "I've been going to this lunch spot for maybe 2x a week now...it's my substitution to my 4x a week subway :)\n\nMy favorite so far is the Fire Bowl.  It consists of seaweed salad, mixed greens, spicy tuna, spicy tobiko, salmon, and tempura bits.  Fire Bowl is $9.50 and it comes with hot miso soup.  \n\nService is usually fast (I come around 3ish maybe that's why).\n\nThis spot is just a block away from work, so that's a plus.", "rating": 4, "date": "2016-04-05"}, {"excerpts": ["I ordered the fire bowl, with brown rice. ", "The fish was very fresh and had good flavor. ", "I love the concept of fresh sushi grade fish in a bowl. ", "Super fast and very friendly service."], "author": "Laura M.", "review": "Great place for take out lunch. I ordered the fire bowl, with brown rice. The fish was very fresh and had good flavor. I love the concept of fresh sushi grade fish in a bowl. Super fast and very friendly service.", "rating": 4, "date": "2016-09-12"}, {"excerpts": ["I got the Fire Bowl. ", "It has various things in like sashimi tuna and salmon, imitation crab, avocado, kimichi, etc. ", "I was so excited to try it cause it looked really bomb from what I saw. ", "I got back to the office and it was rather fishy. ", "Not the fresh kind of fishy...", "but kind of.....not fresh kind ", "of fishy if that makes sense? ", "Hah. ", "I was willing to give it a try. ", "Took my first bite...", "it was ...", "ok. ", "I had a piece of salmon and honestly, it's not the kind of salmon I'm use to. ", "It was very vein-y compared to other sashimi I've had. ", "Was not my cup of tea. ", "Then, the tuna, it was..once again...ok. ", "Cut into small bite size pieces. ", "It was really dyed because it kind of seeped into my rice. "], "author": "Denise L.", "review": "Hm...maybe they're having an off day? Who knows. \n\nI guess I am a sushi snob? I got the Fire Bowl. It has various things in like sashimi tuna and salmon, imitation crab, avocado, kimichi, etc. I was so excited to try it cause it looked really bomb from what I saw. I got back to the office and it was rather fishy. Not the fresh kind of fishy...but kind of.....not fresh kind of fishy if that makes sense? Hah. I was willing to give it a try. Took my first bite...it was ...ok. I had a piece of salmon and honestly, it's not the kind of salmon I'm use to. It was very vein-y compared to other sashimi I've had. Was not my cup of tea. Then, the tuna, it was..once again...ok. Cut into small bite size pieces. It was really dyed because it kind of seeped into my rice. On the plus side, they gave me a LOT of imitation crab.\n\nOther than that...I thought this place was just ...ok. My coworker couldn't finish her burrito like sushi because she said the seaweed was just too much for her. I could tell the staff were Japanese and the girl at the counter was very nice but....def. not my cup of tea. Think I'll stick to my usual sushi burrito place....\n\nOh and all meals I think comes with salad and miso soup. My coworker had the salad and she said it was very fresh, which is a plus.", "rating": 2, "date": "2015-01-14"}, {"excerpts": ["Sushi Taka over Sushirrito \n\nFire bowl all day! "], "author": "Neil M.", "review": "Sushi Taka over Sushirrito \n\nFire bowl all day! Awesome staff! They definitely know how to work a long line in a productive manner.  Menu is straight forward and they will not cheat you out of portions. I used to save half to eat later in the day but it's just too good!  That Miso soup machine they got, I need for the house! I like how they also have a point system, not many eateries in SF have them so it's definitely a great way of bringing clients back.", "rating": 4, "date": "2016-02-19"}, {"excerpts": ["The Fire bowl is the way to go! ", "Compared to sushiritto, there is so much more flavor here. ", "The people are always nice and they get you in and out, fast. "], "author": "Ann N.", "review": "Sushi taka is the best of its kind. I usually get the bowls and am never disappointed. The Fire bowl is the way to go! Compared to sushiritto, there is so much more flavor here. The people are always nice and they get you in and out, fast. The line can look long, but the wait ends up being short and the food is worth it! \n\nThanks, sushi taka!", "rating": 5, "date": "2016-02-11"}, {"excerpts": ["If you like spicy, definitely add wasabi or Sriracha to the fire bowl, as it isn't that hot to start with."], "author": "Thomas H.", "review": "Good grab-and-go sushi bowls, basically poke by a different name without the customization options. The fish tastes fresh and it's a solid deal including miso and edamame. Don't be put off by the line, it moves quickly. If you like spicy, definitely add wasabi or Sriracha to the fire bowl, as it isn't that hot to start with.", "rating": 4, "date": "2017-02-15"}, {"excerpts": ["I always get one of the two bowls (usualy the fire bowl) and it fills me up!"], "author": "Wilson T.", "review": "Good prices, all inclusive with salad and miso soup. Fast and friendly service is a plus. Fivestars so buy 10, get 1 free.\n\nI always get one of the two bowls (usualy the fire bowl) and it fills me up!", "rating": 5, "date": "2015-10-26"}, {"excerpts": ["Ordered the fire bowl ($10) and it came with salmon and spicy tuna, lettuce, rice and spicy sauce. ", "It also came with a little side of crunchy tempura toppings. ", "There are a bunch of lunch places in fidi that have sushi burritos and sushi bowls ", "but I have to say that I thought this was the best, especially for the price! ", "There was a line when we got there ", "but it wasn't more than a 20 minute ", "wait. ", "The staff and chef are also super nice, which was a huge plus!"], "author": "Charissa S.", "review": "So happy to have found such a great new lunch spot! Came across this place with my coworker on our way from picking up her dry cleaning. Ordered the fire bowl ($10) and it came with salmon and spicy tuna, lettuce, rice and spicy sauce. It also came with a little side of crunchy tempura toppings. There are a bunch of lunch places in fidi that have sushi burritos and sushi bowls but I have to say that I thought this was the best, especially for the price! There was a line when we got there but it wasn't more than a 20 minute wait. The staff and chef are also super nice, which was a huge plus!", "rating": 4, "date": "2015-08-20"}, {"excerpts": ["Everything on the menu is definitely worth a try although my recommendation for the first timer is the Fire Bowl. ", "Definitely packed with tons of flavor with the perfect balance of fish and rice. ", "Don't forget to unlock the free edamame offer on Yelp ", "and if you sign up for the rewards program Five Star then you can accumulate points and have the choice to receive coupon offers for this place via text."], "author": "Serena C.", "review": "One of the best affordable poke bowls or sushi burritos to grab. Reasonable price for the amount given and I always get full by the time I get to the last bite. One thing to definitely be wary of is to try not to go during the peak lunch hours of 12-1 for the lines get quite long. If you are short on time avoid that hour. Everything on the menu is definitely worth a try although my recommendation for the first timer is the Fire Bowl. Definitely packed with tons of flavor with the perfect balance of fish and rice. Don't forget to unlock the free edamame offer on Yelp and if you sign up for the rewards program Five Star then you can accumulate points and have the choice to receive coupon offers for this place via text.", "rating": 4, "date": "2016-09-14"}, {"excerpts": ["I used to be a regular - almost getting fire bowl everyday. ", "However, I hadn't been to sushi take for 3 months until today. ", "Bought fire bowl as usual but ", "when I saw my bowl - man I wonder how much food they took away from the original fire bowl that they used to have. ", "It used to come with both miso soup and ginger - though they still kept the miso soup, the amount of food in the bowl is less than 2/3 of what it used to be. ", "Honestly personally I'd prefer if the restaurant increase the price or have a notice that they are increasing the price or decreasing the food due to rising cost. ", "But gradually putting less food in your bowl is, in my opnion, sneaky and not transparent. ", "Does the food still taste good? ", "Yes. ", "Is the decreasing food amount a huge problem that I'd never go back? ", "Not really. ", "But is it a big enough problem that I'd reconsider before going to them? ", "Yes, definitely."], "author": "Aki J.", "review": "I used to be a regular - almost getting fire bowl everyday. However, I hadn't been to sushi take for 3 months until today. Bought fire bowl as usual but when I saw my bowl - man I wonder how much food they took away from the original fire bowl that they used to have. It used to come with both miso soup and ginger - though they still kept the miso soup, the amount of food in the bowl is less than 2/3 of what it used to be. Honestly personally I'd prefer if the restaurant increase the price or have a notice that they are increasing the price or decreasing the food due to rising cost. But gradually putting less food in your bowl is, in my opnion, sneaky and not transparent. Does the food still taste good? Yes. Is the decreasing food amount a huge problem that I'd never go back? Not really. But is it a big enough problem that I'd reconsider before going to them? Yes, definitely.", "rating": 3, "date": "2016-05-16"}, {"excerpts": ["Fire bowl is all you need to know. ", "Price is very reasonable."], "author": "Karen H.", "review": "When I came for their sushi burrito, I was disappointed. Now I found out they are known for their rice bowls. So yummy! Fire bowl is all you need to know. Price is very reasonable.", "rating": 4, "date": "2016-07-29"}, {"excerpts": ["The portions sizes are great and the amount of fish in my usual order of fire bowl salad is more than reasonable for the price that they charge. \n\n"], "author": "Diana S.", "review": "I often crave this place! Their poke is AMAZING! It's about a 15 minute walk from my office but the trek is worth it every time. The portions sizes are great and the amount of fish in my usual order of fire bowl salad is more than reasonable for the price that they charge. \n\nThe staff is friendly and they do not skimp on the orders at all! My only issue was that on one of my visits, they forgot to add the pickled radish and the portion was much smaller than usual where the bowl wasn't even filled up. However, I consider that a one time thing and it was because the staff that made my bowl wasn't the person I usually see when I go. \n\nI constantly get coupons from their rewards program and I haven't been back in a while but I should go again and soon!", "rating": 5, "date": "2016-09-07"}, {"excerpts": ["I was originally going to get the Fire Bowl but noticed that they were having a special called the Super Bowl due to the Superbowl taking place this Sunday. ", "This one consisted of salmon, spicy tuna, avocado, crab meat, seaweed salad, and rice. ", "It sounded really good ", "so I got this bowl instead. ", "I'm so glad they offer brown rice too! ", "The order also came with miso soup and after paying for my order, it was ready within minutes! ", "They workers here are super friendly and nice too! ", "One of my coworkers has gluten allergies so there was a lot of things she could not eat especially anything with soysauce in it. ", "But they were really accomodating and did their best to offer her all gluten free items for her sushiritto. ", "My coworker was really thankful and she really enjoyed her sushiritto! ", "The Super Bowl was really good too! ", "The spicy tuna is definitely spicy and the salmon was fresh and deliscious. ", "I felt really healthy eating this too and the bowl is a perfect amount of food! ", "Next time I come back, I'll definitely go for the Fire Bowl! ", ":)"], "author": "Mary C.", "review": "Dropped by here for lunch yesterday with some coworkers. It was my first time trying this place and I was worried that there was going to be a long line by the time we got there but behold...there were only 3 people in line. Woot woot! :) This place is pretty small but it looks like people usually get to go anyways. I was originally going to get the Fire Bowl but noticed that they were having a special called the Super Bowl due to the Superbowl taking place this Sunday. This one consisted of salmon, spicy tuna, avocado, crab meat, seaweed salad, and rice. It sounded really good so I got this bowl instead. I'm so glad they offer brown rice too! The order also came with miso soup and after paying for my order, it was ready within minutes! They workers here are super friendly and nice too! One of my coworkers has gluten allergies so there was a lot of things she could not eat especially anything with soysauce in it. But they were really accomodating and did their best to offer her all gluten free items for her sushiritto. My coworker was really thankful and she really enjoyed her sushiritto! The Super Bowl was really good too! The spicy tuna is definitely spicy and the salmon was fresh and deliscious. I felt really healthy eating this too and the bowl is a perfect amount of food! Next time I come back, I'll definitely go for the Fire Bowl! :)", "rating": 4, "date": "2016-02-06"}, {"excerpts": ["Love love love the fire bowl! ", "The staff is great and really appreciates their return customers, and they also have an awesome rewards program. ", "Try it out!!"], "author": "Clay P.", "review": "Sushi Taka is near my old office so my coworkers and I would walk over at lunch at least once a week. Sometimes the line seems daunting, but that's because the food is worth it! Love love love the fire bowl! The staff is great and really appreciates their return customers, and they also have an awesome rewards program. Try it out!!", "rating": 4, "date": "2016-08-24"}, {"excerpts": ["I think I'll stick with my usual Fire Bowl next time.  ", "The line was already long at 11:30am.  ", "Staff are always friendly.  ", "Place is clean as well.  ", "I also notice the Health Dpt. ", "gave them 100 pts.  ", "Good job!"], "author": "Angela T.", "review": "I've been coming here for a while.  They are doing a 10% off promotion for their 4 years Anniversary today, so I thought I try their Salmon Poke Bowl.  The salmon was fresh, but not very flavorful.  Their seaweed salad was good. I think I'll stick with my usual Fire Bowl next time.  The line was already long at 11:30am.  Staff are always friendly.  Place is clean as well.  I also notice the Health Dpt. gave them 100 pts.  Good job!", "rating": 5, "date": "2016-02-03"}, {"excerpts": ["and I decided to go with the Fire Bowl, because I like everything spicy!  ", "I also asked for an extra side of wasabi, which I always need!  ", "I walked next door to get a Vietnamese Iced Coffee (I said I'm off the wagon), and when I came back, my food was waiting for me!   ", "The nice man who always makes the sushi gave me my food and was as pleasant as he always is and "], "author": "Brandy B.", "review": "I really struggled between three and four stars on this review but had to go high.  Today I was craving my go to chicken bento that I want when I tumble off the diet wagon and mosey'd on over to Sushi Taka.  There new girl working the front unapologetically informed me that they no longer carried my preferred box.  Instead, she offered me a few different options fo bowls and I decided to go with the Fire Bowl, because I like everything spicy!  I also asked for an extra side of wasabi, which I always need!  I walked next door to get a Vietnamese Iced Coffee (I said I'm off the wagon), and when I came back, my food was waiting for me!   The nice man who always makes the sushi gave me my food and was as pleasant as he always is and I was on my way.  \n\nWhen I got to my desk, there was no extra wasabi, no more machta rice, and the amount of fish left much to be desired... BUT, the flavor was there and by the end of it I was stuffed!  Since Tenmatsu charges a ridiculous $14  for a Chirashi bowl, I'm thinking this might be my new spot.  Unfortunatley for my chicken bento cravings, it's back to Tokyo for me.  *sadface", "rating": 4, "date": "2014-04-01"}, {"excerpts": ["My favourite is the fire bowl as its topped with spicy light mayo that doesn't overwhelm. ", "Love that the rice is already has soy sauced "], "author": "Kellie T.", "review": "Love this place so much. I work at Embarcadero and it takes me 20 minutes to walk there one-way but i would do it again and again. The sushi is always fresh and never stale and i specially love it when they have the specials. \n\nMy favourite is the fire bowl as its topped with spicy light mayo that doesn't overwhelm. Love that the rice is already has soy sauced added over it and the seaweed + egg + sushi + spicy mayo combi is awesome.\n\nThere is starting to be a queue now but its because their sushi is great and i love sushi taka more than sushirito. thumbs up guys! I brought my friends there today and they love the sushi too :)", "rating": 5, "date": "2015-08-27"}, {"excerpts": ["I tried the fire bowl for the first time today and I am a little torn.  ", "I like the spiciness, different texture with big cubes of salmon, minced spicy tuna, seaweed salad, small pieces of lettuce and small crunchy rice crackers?  ", "It's a good combination and the fish taste pretty fresh.  ", "The biggest disappointment is the rice!  ", "I am usually not picky about my rice but the rice is cooked too mushy here, too much water and it totally ruins the whole experience.  ", "It's an easy fix ", "and I hope they will do something about that because rice is also an important ingredient here."], "author": "winnie l.", "review": "I tried the fire bowl for the first time today and I am a little torn.  I like the spiciness, different texture with big cubes of salmon, minced spicy tuna, seaweed salad, small pieces of lettuce and small crunchy rice crackers?  It's a good combination and the fish taste pretty fresh.  The biggest disappointment is the rice!  I am usually not picky about my rice but the rice is cooked too mushy here, too much water and it totally ruins the whole experience.  It's an easy fix and I hope they will do something about that because rice is also an important ingredient here.", "rating": 3, "date": "2015-11-13"}], "fire bowl gluten free": [], "hamachi bowl": [{"excerpts": ["I got the Hamachi bowl. ", "The fish was fresh, the flavor just right.  ", "The crab-meat salad was an extra credit.  ", "The rice was near perfect. ", "A bit seaweed on the side.  "], "author": "Sin-Yaw W.", "review": "Wow!  What a deal and what a meal.  No wonder the line went all the way to the corner.  I will probably come here whenever.\n\nI got the Hamachi bowl. The fish was fresh, the flavor just right.  The crab-meat salad was an extra credit.  The rice was near perfect. A bit seaweed on the side.  All for $12.\n\nI don't really believe that a blue-fin tuna bowl can be had for $15.  So I did not try.", "rating": 5, "date": "2017-10-26"}], "salmon poke bowl": [{"excerpts": ["I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\n"], "author": "Meghan J.", "review": "I've been a supporter of Sushi Taka ever since I started working in the area. Being just a short distance from work, it was an easy go-to. Not gonna lie-I was wrapped up in the whole sushi burrito thing for a while, lol. \n\nThis place has expanded their menu, offering more than just the few choices of the sushi burritos and bowls from the previous menu. (It doesn't look like the entire menu is listed for the Order Pickup on here, so you will have to order there for the other options). They have newly-added bases for you to choose (white/brown rice, mixed greens, ramen salad). I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\nThe place is small, but more of a pick-up-your-food-type-of place. Though the line is often out the door, the service is quick- I am out the door shortly after ordering at the counter (in my experiences, at least). Solid sushi burrito/poke spot! It's been difficult to find another good poke spot in the area, but it's nice to know Taka is here to stay!", "rating": 5, "date": "2017-08-04"}, {"excerpts": ["Food: I always opt for the Salmon Poke Bowl with white rice. ", "I absolutely love salmon poke and they do a good job of not over complicating their poke bowls. ", "The majority of their bowls come with white/brown rice, seaweed salad, and crab with a some of the bowls mixing it up here and there. ", "Unlike other poke bowls, there isn't much room for customization but sometimes simpler is better.", "Their salmon is already dressed in some sort of shoyu based sauce. ", "The fish taste super fresh and I love the salmon flavor that comes out. "], "author": "Eric L.", "review": "Working in financial district, Sushi Taka is quite a frequent lunch spot for us. I would say we get it probably once a week because it's that good! The line goes super quick and there aren't a ton of options to choose from so it becomes pretty easy to order.\n\nFood: I always opt for the Salmon Poke Bowl with white rice. I absolutely love salmon poke and they do a good job of not over complicating their poke bowls. The majority of their bowls come with white/brown rice, seaweed salad, and crab with a some of the bowls mixing it up here and there. Unlike other poke bowls, there isn't much room for customization but sometimes simpler is better.Their salmon is already dressed in some sort of shoyu based sauce. The fish taste super fresh and I love the salmon flavor that comes out. A huge plus is that with every bowl you order, they give you a FREE miso soup and little packet of edamame. \n\nTip: If you enjoy Sushi Taka as much as I do, be sure to input your phone number into their rewards system. For every 10 bowls you order, you will receive $10 off your next 11th bowl.", "rating": 5, "date": "2017-12-08"}, {"excerpts": ["I ordered the salmon poke bowl with brown rice. ", "The line looks long but they are super efficient so it moves quickly! ", "Each order comes with miso soup and edamame. ", "The salmon was good quality, buttery and fresh! ", "I enjoyed the masago, tamago, and seaweed salad as well. "], "author": "Tara A.", "review": "Good lunch option in the fidi! I ordered the salmon poke bowl with brown rice. The line looks long but they are super efficient so it moves quickly! Each order comes with miso soup and edamame. The salmon was good quality, buttery and fresh! I enjoyed the masago, tamago, and seaweed salad as well. I just wish there was more sauce in the bowl because the only part that had sauce mixed in was the salmon, and it only covered part of the rice.\n\nThe sushi burritos look yummy too!", "rating": 3, "date": "2017-05-10"}, {"excerpts": ["The salmon poke bowl had super moist, buttery salmon. ", "Could not stop eating it. ", "It was seasoned in soy sauce so the fish taste wasn't quite there ", "but hey, quality fish. ", "The only qualm I had was that the very middle of the fish was still slightly frozen. ", "At first glance, the portion looked on the smaller side, but was actually pretty decent for $11.50. ", "The egg was actually layered and pretty good. ", "Felt like the imitation crab salad took up a bit more of the bowl than I'd have liked and was really salty. ", "Seaweed salad was more sour than I've had...think it may have been on its way to being bad :(. ", "Still though. ", "SALMON. "], "author": "Nicole H.", "review": "Wow. That's some fresh salmon.\n\nThe salmon poke bowl had super moist, buttery salmon. Could not stop eating it. It was seasoned in soy sauce so the fish taste wasn't quite there but hey, quality fish. The only qualm I had was that the very middle of the fish was still slightly frozen. At first glance, the portion looked on the smaller side, but was actually pretty decent for $11.50. The egg was actually layered and pretty good. Felt like the imitation crab salad took up a bit more of the bowl than I'd have liked and was really salty. Seaweed salad was more sour than I've had...think it may have been on its way to being bad :(. Still though. SALMON. 4.5/5.\n\nThe unagi bowl was a bit more standard. The same amount of fish (or even a bit more) than what your average sushi restaurant would give you for ~$5 less in price ($11.50 here vs. $16+ at most spots). Unagi wasn't bad but I like it more smoky. 3.5/5.\n\nI've had a couple of the other items since-- spicy tuna is pretty standard, the scallops they had were also tasty. I wish they were open on the weekends, but when everything else is closed, I suppose that only makes sense. \n\nSushi Taka, what did we do to deserve you here?\n--\n\nEdit: I stopped back in and the employee behind the counter, Bert, provided some awesome customer service and threw in some extra edamame since it was a slow day. Really appreciate it, Sushi Taka!", "rating": 4, "date": "2017-08-22"}, {"excerpts": ["My boyfriend ordered the Salmon poke bowl and portions were pretty big! ", "It had rice underneath and came with some seaweed salad as well as some chipolte creamy sauce and wasabi creamy sauce. ", "This is a very popular item on meal pal, I heard it gets sold out within seconds "], "author": "Natalie L.", "review": "I tried this place for meal pal (well I ate my boyfriend's meal pal to be exact :D)\n\nMy boyfriend ordered the Salmon poke bowl and portions were pretty big! It had rice underneath and came with some seaweed salad as well as some chipolte creamy sauce and wasabi creamy sauce. This is a very popular item on meal pal, I heard it gets sold out within seconds and I do believe it because it darn worth it and good!\n\nI would definitely come back and try their other items!", "rating": 4, "date": "2017-01-04"}, {"excerpts": ["New fav spot is ramen bar for their salmon poke bowl."], "author": "sharon s.", "review": "This used to be one of my favorite poke bowl spots. \n\nIt seems like quality/ingredients have changed over the years. They used to have these little crunchy things, and egg. Now they have crab salad and pickled carrots (not a fan of either). And once or twice the fish was still slightly frozen. \n\nNew fav spot is ramen bar for their salmon poke bowl.", "rating": 3, "date": "2017-07-31"}, {"excerpts": ["I ordered the salmon poke bowl, and it came with a little tub of edamame and a little tub of miso soup. ", "The salmon was thick, chunky and tasted fresh and buttery! ", "I was very satisfied with the salmon! ", "I would have liked it to have more sauce or flavor, as I found the overall bowl to be a little bland when I mixed everything. "], "author": "Kris C.", "review": "Delicious!! I ordered the salmon poke bowl, and it came with a little tub of edamame and a little tub of miso soup. The salmon was thick, chunky and tasted fresh and buttery! I was very satisfied with the salmon! I would have liked it to have more sauce or flavor, as I found the overall bowl to be a little bland when I mixed everything. (They do give a packet of soy sauce and provide miso dressing at the corner before you exit!)\n\nStaff is friendly! The line can be long and discouraging during lunch hours, but it really goes quick. You order, you pay, you pick up your food and you leave. I hope to be back soon!!", "rating": 4, "date": "2015-11-24"}, {"excerpts": ["The salmon poke bowl was very tasty. ", "I would say it's a perfect lunch-size bowl of food. "], "author": "Cathy C.", "review": "Sushi Taka is the closest poke to my office, so I quickly headed over there at 11 AM because I didn't want to bother standing in line with the rest of SF. When I got there around 11:15 today, I was the first and the employee (I think he was the owner) was super friendly. After I ordered my fire bowl and salmon bowl, I swear I didn't even blink 5 times and the first bowl was already made. Amazing!\n\nThe salmon poke bowl was very tasty. I would say it's a perfect lunch-size bowl of food. My friend said the fire bowl was a bit spicy for her (she doesn't eat spicy food at ALL. So not bad)\n\nEdamame and miso soup were already placed in containers so you just grab them to the left. Both a bit salty but still good nonetheless.\n\nFor the price (~$10/bowl), how fast I got my food (seriously. lightning speed) and good customer service, you can't beat that anywhere else! WOO! I'M A FAN!", "rating": 5, "date": "2016-07-15"}, {"excerpts": ["I've tried the taka bowl, fire bowl, salmon poke bowl and a couple of their sushi burritos and everything here is FREAKIN BOMB. ", "I've been guilty of eating here 3-4 times a week haha. ", "Everything from the free edamame / miso to the fresh fish and seaweed salad will satisfy any craving you have for some high quality sashimi. "], "author": "Rebecca W.", "review": "Sushi Taka is hands down my favorite place of all time. I work a block away, but I would probably travel across town just to get the fire bowl here. I've tried the taka bowl, fire bowl, salmon poke bowl and a couple of their sushi burritos and everything here is FREAKIN BOMB. I've been guilty of eating here 3-4 times a week haha. Everything from the free edamame / miso to the fresh fish and seaweed salad will satisfy any craving you have for some high quality sashimi. I LOVE THIS PLACE. \n\ntip: you get wayyy more fish when you go later in the day. I usually go around 2 to avoid the lines, and they usually give me almost 2x the amount of fish!", "rating": 5, "date": "2016-04-30"}, {"excerpts": ["We got the Salmon Poke Bowl and Fire Bowl and both were quite good. ", "The box is deceiving - at first glance, I thought it was a small portion but by the end I was definitely full. "], "author": "Jennifer D.", "review": "I read on yelp that the line would be wrapped around the block but I came toward the end of the lunch hours and there was no wait! We got the Salmon Poke Bowl and Fire Bowl and both were quite good. The box is deceiving - at first glance, I thought it was a small portion but by the end I was definitely full. And both bowls also came with a complimentary side of Miso Soup!\n\nThere is no seating indoors so that's a con, but there are nearby parks or areas where you can eat your food. Also, when we asked for two cups of water they didn't have proper cups so they served us water in the miso soup bowls (which was odd).\n\nOverall, a good lunch spot but nothing too special!", "rating": 3, "date": "2017-04-04"}, {"excerpts": ["The salmon poke bowl here is fairly simple, which is what I think makes it good (and how it should be IMO lol). ", "The salmon poke is shoyu style and also comes with seaweed, the egg crepe thingies, tobiko, and crab salad on top of rice. ", "Everything is good and when I get it via the mealpal app ", "it's like $6ish? "], "author": "Terra C.", "review": "Since poke has become v hot and trendy, a lot of places have added poke to their menus BUT I feel like a lot of places have poke bowls with a bunch of random things that kind of take away from the flavor of the fish. The salmon poke bowl here is fairly simple, which is what I think makes it good (and how it should be IMO lol). The salmon poke is shoyu style and also comes with seaweed, the egg crepe thingies, tobiko, and crab salad on top of rice. Everything is good and when I get it via the mealpal app it's like $6ish? not baaaaaddddd\n\nI've only had Sushi Taka through the mealpal app, but I think the quality of the food here is actually really good here (which is obvs key when eating raw fish) so I'll probably be back to try more!", "rating": 4, "date": "2017-02-07"}, {"excerpts": ["So how did Sushi Taka fair when I ordered the Salmon Poke Bowl?  "], "author": "Sam C.", "review": "After being in-and-out of Hawaii over the past year, I've been searching for a place in San Francisco that satisfies my intense desire for poke bowls. I judge my poke bowls based on the following criteria:\n\n1. freshness of the fish\n2. flavors/sauce rolled into the fish\n3. authenticity of the bowls (i.e., comparable to ones that you can find in Hawaii)\n4. orgasmic flavors that brings me back to that one time in Hawaii\n\nSo how did Sushi Taka fair when I ordered the Salmon Poke Bowl?  It only satisfied 2 out of the 4 criteria.\n\n1. the salmon was fresh (not sure if the salmon was wild or farmed)\n2. the flavor accompanying the fish was a bit underwhelming\n3. it looked delicious and visually appealing\n4. the taste didn't satisfy my craving (no happy ending here, people)\n\nWith that said, the people working there are very friendly and strive to create an amazing experience for their customers.  And that's a good thing in my book!\n\nI'm looking forward to going back and trying out their other items.", "rating": 3, "date": "2015-10-14"}, {"excerpts": ["They are doing a 10% off promotion for their 4 years Anniversary today, so I thought I try their Salmon Poke Bowl.  ", "The salmon was fresh, but not very flavorful.  ", "Their seaweed salad was good. "], "author": "Angela T.", "review": "I've been coming here for a while.  They are doing a 10% off promotion for their 4 years Anniversary today, so I thought I try their Salmon Poke Bowl.  The salmon was fresh, but not very flavorful.  Their seaweed salad was good. I think I'll stick with my usual Fire Bowl next time.  The line was already long at 11:30am.  Staff are always friendly.  Place is clean as well.  I also notice the Health Dpt. gave them 100 pts.  Good job!", "rating": 5, "date": "2016-02-03"}], "spicy tuna bowl": [{"excerpts": ["I got a spicy tuna bowl and there was a lot more rice and sides than fish, which tasted a little off as well. ", "It's definitely a lunch option, just not on a must-go-to level for me. ", "I'd come back to try out the rest of their menu, though.\n", "The miso soup and edamame check-in offer is nice, though they gave me 5-6 pods to stretch out how fast they run out of them."], "author": "Amy H.", "review": "The service is indeed fast for its small space and menu variety. I got a spicy tuna bowl and there was a lot more rice and sides than fish, which tasted a little off as well. It's definitely a lunch option, just not on a must-go-to level for me. I'd come back to try out the rest of their menu, though.\nThe miso soup and edamame check-in offer is nice, though they gave me 5-6 pods to stretch out how fast they run out of them.", "rating": 3, "date": "2018-02-26"}, {"excerpts": ["I got the Spicy Tuna Bowl off Meal Pal and it is a 15-20 min walk from work. ", "The flavor was tasty, but I feel that the bowl was a little empty. ", "There is more rice ", "then I like and more side things then tuna. ", "It was more imitation crab then tuna. "], "author": "Mei L.", "review": "I got the Spicy Tuna Bowl off Meal Pal and it is a 15-20 min walk from work. The flavor was tasty, but I feel that the bowl was a little empty. There is more rice then I like and more side things then tuna. It was more imitation crab then tuna. Additionally, I wish there was more then just a little seaweed salad and 2 small pieces of sweet egg omelette.\n\nI wish for maybe so squid salad or Japanese pickles. My fried that ordered there seemed to get more fish, so maybe if the salmon bowl is on meal pal, I will order it.", "rating": 3, "date": "2017-05-18"}, {"excerpts": ["I like the spicy tuna bowl the most. ", "They give you free edemame and miso soup for lunch until they run out:)"], "author": "Lisa C.", "review": "The seafood is always fresh and the food never disappoints. They're similar to sushiritto where they have sushi burrritos but I like getting their sushi bowl. I like the spicy tuna bowl the most. They give you free edemame and miso soup for lunch until they run out:)", "rating": 5, "date": "2017-04-23"}], "unagi bowl": [{"excerpts": ["Their unagi bowl is really yummy and the flavors are really bright. ", "I think the Meal Pal version is different from the dish on their regular menu, but I have no complaints. "], "author": "Lori C.", "review": "I tried Sushi Taka through Meal Pal and I'm happy that I did. Their unagi bowl is really yummy and the flavors are really bright. I think the Meal Pal version is different from the dish on their regular menu, but I have no complaints. The bowl comes with unagi, roe, seaweed salad, corn, imitation crab, and sushi rice. \n\nThe restaurant is small and really only a storefront, so there is usually a line out the door, which means go early! I'm looking forward to trying other items on their menu.", "rating": 4, "date": "2018-09-25"}, {"excerpts": ["I mainly get some version of the poke bowls, but I've also tried the cooked unagi bowl (which was good, but not my favourite). ", "I prefer to take my lunch order to-go and eat it more comfortably in a park nearby or back at the office. ", "However, they do have a small seating area outside if you need a place to stay. ", "(I've only stayed to eat lunch there once, which was fine, but it was a busy street with lots of cars and people, so it wasn't very peaceful). ", "Usually when I come to Sushi Taka during lunch rush hour, there's a line out the door and around the corner. ", "Luckily, they participate in a lot of pickup (Postmates, Ritual, etc.) and delivery (Postmates, Grubhub, etc.) ", "programs if you're more time constrained; I usually use pickup and don't need to wait in line, which is fab! ", "Sushi Taka (despite it being a bit of a walk for me) is definitely one of my favourite lunch places, and I'm sure I'll be back soon for more :)"], "author": "Bianca C.", "review": "Sushi Taka has so many tasty options. I think I come here about once a week (!!) with my coworkers to pick up lunch. I mainly get some version of the poke bowls, but I've also tried the cooked unagi bowl (which was good, but not my favourite). I prefer to take my lunch order to-go and eat it more comfortably in a park nearby or back at the office. However, they do have a small seating area outside if you need a place to stay. (I've only stayed to eat lunch there once, which was fine, but it was a busy street with lots of cars and people, so it wasn't very peaceful). Usually when I come to Sushi Taka during lunch rush hour, there's a line out the door and around the corner. Luckily, they participate in a lot of pickup (Postmates, Ritual, etc.) and delivery (Postmates, Grubhub, etc.) programs if you're more time constrained; I usually use pickup and don't need to wait in line, which is fab! Sushi Taka (despite it being a bit of a walk for me) is definitely one of my favourite lunch places, and I'm sure I'll be back soon for more :)", "rating": 5, "date": "2018-09-22"}, {"excerpts": ["The unagi bowl was a bit more standard. ", "The same amount of fish (or even a bit more) than what your average sushi restaurant would give you for ~$5 less in price ($11.50 here vs. $16+ at most spots). ", "Unagi wasn't bad ", "but I like it ", "more smoky. "], "author": "Nicole H.", "review": "Wow. That's some fresh salmon.\n\nThe salmon poke bowl had super moist, buttery salmon. Could not stop eating it. It was seasoned in soy sauce so the fish taste wasn't quite there but hey, quality fish. The only qualm I had was that the very middle of the fish was still slightly frozen. At first glance, the portion looked on the smaller side, but was actually pretty decent for $11.50. The egg was actually layered and pretty good. Felt like the imitation crab salad took up a bit more of the bowl than I'd have liked and was really salty. Seaweed salad was more sour than I've had...think it may have been on its way to being bad :(. Still though. SALMON. 4.5/5.\n\nThe unagi bowl was a bit more standard. The same amount of fish (or even a bit more) than what your average sushi restaurant would give you for ~$5 less in price ($11.50 here vs. $16+ at most spots). Unagi wasn't bad but I like it more smoky. 3.5/5.\n\nI've had a couple of the other items since-- spicy tuna is pretty standard, the scallops they had were also tasty. I wish they were open on the weekends, but when everything else is closed, I suppose that only makes sense. \n\nSushi Taka, what did we do to deserve you here?\n--\n\nEdit: I stopped back in and the employee behind the counter, Bert, provided some awesome customer service and threw in some extra edamame since it was a slow day. Really appreciate it, Sushi Taka!", "rating": 4, "date": "2017-08-22"}, {"excerpts": ["I tried the Taka Bowl and the Unagi Bowl. ", "The Taka Bowl seemed to have a pretty good variety of toppings: ", "Salmon, spicy tuna, imitation crab, avocado, seaweed salad, and tamago. ", "Good variety of toppings but...not very much of each topping. ", "Or the rice for that matter. ", "The photos are pretty deceiving. ", "Unagi Bowl tasted good, but it was even smaller than the Taka Bowl. ", "Unagi Bowl tasted good, but it was even smaller than the Taka Bowl. "], "author": "Sara L.", "review": "I tried the Taka Bowl and the Unagi Bowl. Brown rice instead of white rice was free, which was nice. \n\nThe Taka Bowl seemed to have a pretty good variety of toppings: Salmon, spicy tuna, imitation crab, avocado, seaweed salad, and tamago. Good variety of toppings but...not very much of each topping. Or the rice for that matter. The photos are pretty deceiving. At the least, I think they could at least fill the bowl container with more rice, which would make the bowl more filling without being a big cost to them.\n\nUnagi Bowl tasted good, but it was even smaller than the Taka Bowl. Again, I get that unagi can be expensive, but I barely had any rice with each bite. \n\nOverall, a good lunch spot, but not the greatest value in my opinion, at least for the bowls. Maybe the rolls are better value. As a side note, I find it funny that their Yelp check-in offer is free miso soup and edamame, but you already get it with any bowls and rolls LOL.", "rating": 3, "date": "2017-02-06"}, {"excerpts": ["Had the Unagi Bowl through MealPal. "], "author": "Carrie L.", "review": "Had the Unagi Bowl through MealPal. I arrived at 12 and a line around the corner already, luckily I was able to go straight to the cashier.\n\nMy first time here and I really enjoyed it! The unagi was well seasoned - definitely will be back for their rolls!", "rating": 4, "date": "2016-11-22"}, {"excerpts": ["A few weeks later, I tried the Unagi bowl (https://www.yelp.com/user_local_photos?select=lEGLmG-P9CPYIVBYGScaew&userid=saJuyv784apZzH--psHZ3Q).  ", "I was also impressed by my bowl and the variety of flavors and ingredients.  ", "Having tried a couple of the \"poke bowl\" places in the Bay Area recently, the format is a bit different here as the topping and combinations are designated, making this a no-brainer. \n", "Though the Yelp page says free miso soup and edamame beans when checking in, it isn't even necessary as they automatically have them waiting for you (the edamame beans, while available, are prepacked at the window corner - if you come after 1 pm, they may run out).\n", "Also, in reading their company's background posted on the wall, they are an authentic Japanese chain which ramps up the credibility in my book.\n", "Another nice perk is, if you sign up for their frequent diner program, you will get a free one after so many meals.\n", "Yes, this is added to my lunch rotation.\n", "And, like my policy regarding restaurants in general, just follow the line!"], "author": "Mike C.", "review": "The hot trend these days seems to be rice bowls with \"sushi quality\" raw fish and a variety of ingredients to spruce them up into this wondrous meal that makes your eyes roll without giving you an ounce of guilt... sigh... did I say all that?!\nWalking to the Financial District from Chinatown, I often see a line here but, for over a year, never stopped or researched them.  A friend suggested getting lunch here on a recent weekday morning.  \nArriving just after noon, as expected, there was a line, but the wait wasn't long.  They had a freestanding message board stating their weekly special, which was their Taka Bowl with sushi rice (https://www.yelp.com/user_local_photos?select=lEGLmG-P9CPYIVBYGScaew&userid=saJuyv784apZzH--psHZ3Q) (think chirashi).  This item consists of Salmon Poke, Spicy Tuna, Crab Salad, Spicy Tobiko, Egg Crepe, Avocado, Mixed Greens, and Seaweed Salad.  The flavors were good and the variety of ingredients made it extremely interesting.  The regular bowl options are white or brown rice as well as mixed greens.  I especially liked the spicy tuna as a nice change of pace.\nA few weeks later, I tried the Unagi bowl (https://www.yelp.com/user_local_photos?select=lEGLmG-P9CPYIVBYGScaew&userid=saJuyv784apZzH--psHZ3Q).  I was also impressed by my bowl and the variety of flavors and ingredients.  Having tried a couple of the \"poke bowl\" places in the Bay Area recently, the format is a bit different here as the topping and combinations are designated, making this a no-brainer. \nThough the Yelp page says free miso soup and edamame beans when checking in, it isn't even necessary as they automatically have them waiting for you (the edamame beans, while available, are prepacked at the window corner - if you come after 1 pm, they may run out).\nAlso, in reading their company's background posted on the wall, they are an authentic Japanese chain which ramps up the credibility in my book.\nAnother nice perk is, if you sign up for their frequent diner program, you will get a free one after so many meals.\nYes, this is added to my lunch rotation.\nAnd, like my policy regarding restaurants in general, just follow the line!", "rating": 4, "date": "2016-11-07"}, {"excerpts": ["I'd also recommend the Unagi bowl, which was a more than generous portion of both eel and rice.  \n\n"], "author": "Hamilton P.", "review": "Very little to say other than the obvious: phenomenal.\n\nThe spicy tuna roll is the way to go. It's packed, the seaweed is crispy, rice perfect, and large enough to fill you up. \n\nI'd also recommend the Unagi bowl, which was a more than generous portion of both eel and rice.  \n\nOrder ahead and skip the line during lunch hours, otherwise you may need to dedicate 15-minutes or more to wait.", "rating": 5, "date": "2017-02-16"}, {"excerpts": ["I've tried their fire bowl (like a poke bowl with spicy tuna, salmon, tobiko, seaweed salad, salad, egg crepe) and their unagi bowl. ", "Both are great options and are REALLY filling. ", "All dishes come with edamame and miso soup on the side! ", "You also get a choice of brown or white rice as a base. ", "All their fish here is so fresh and they give huge chunks! ", "I was surprised when I came here today and was served big blocks of salmon. ", "And their unagi is smothered in that delicious sauce.. mmmm. "], "author": "Kathleen S.", "review": "I actually like coming here for lunch because they give you a lot of food for a good price! They offer bowls and sushi burritos; each time I've come here I've gotten a bowl because I tend to get messy with the burritos. \n\nI've tried their fire bowl (like a poke bowl with spicy tuna, salmon, tobiko, seaweed salad, salad, egg crepe) and their unagi bowl. Both are great options and are REALLY filling. All dishes come with edamame and miso soup on the side! You also get a choice of brown or white rice as a base. All their fish here is so fresh and they give huge chunks! I was surprised when I came here today and was served big blocks of salmon. And their unagi is smothered in that delicious sauce.. mmmm. Each bowl ranges from $9-$12 and they're good portions!\n\nThis place seems really popular as well; I've always seen a line out the door curving along the sidewalk. The service is pretty fast with three people usually in the back; two making the food and one person at the register. I would recommend coming here especially if you don't want to wait in the sushiritto line or want a bowl version of that.", "rating": 5, "date": "2016-05-27"}, {"excerpts": ["I had the unagi bowl with rice, great portion and value, fast service and ", "everything looks fresh. ", "It also came with a miso soup and edamame."], "author": "Inga W.", "review": "Great place for a healthy lunch for us fish lovers. I had the unagi bowl with rice, great portion and value, fast service and everything looks fresh. It also came with a miso soup and edamame.", "rating": 4, "date": "2017-02-22"}, {"excerpts": ["i ordered the unagi bowl for $11.04 plus tax = $12. ", "all orders include a free miso soup & edamame. ", "they also don't charge you for paper bags. ", "how awesome is that? ", "the down side is that this isn't a sit down restaurant, but there are plenty of POPO spaces in the fidi for you to enjoy your lunch! ", "the unagi bowl was delicious. ", "don't be intimidated by the long line; it moves quick. ", "the sushi burritos here are definitely better than sushirrito! ", "they use five stars rewards program, so make sure you sign up!"], "author": "Sylvia H.", "review": "definitely one of my favorite lunch spots in the fidi! i ordered the unagi bowl for $11.04 plus tax = $12. all orders include a free miso soup & edamame. they also don't charge you for paper bags. how awesome is that? the down side is that this isn't a sit down restaurant, but there are plenty of POPO spaces in the fidi for you to enjoy your lunch! the unagi bowl was delicious. don't be intimidated by the long line; it moves quick. the sushi burritos here are definitely better than sushirrito! they use five stars rewards program, so make sure you sign up!", "rating": 5, "date": "2016-09-11"}, {"excerpts": ["Unagi bowl all day (goes well with Sensi Sauce if you ever cross paths with it).  ", "They close too early."], "author": "Bernard W.", "review": "Great quick fix for Japanese lovers.  Unagi bowl all day (goes well with Sensi Sauce if you ever cross paths with it).  They close too early.", "rating": 4, "date": "2016-09-21"}], "salmon teriyaki bowl": [], "shrimp tempura bowl": [{"excerpts": ["I got the shrimp tempura bowl ", "and I really enjoyed it. ", "The flavours were delicious together. ", "It came with shrimp tempura, sushi mayo, teriyaki sauce, crab, wakame, edamame, corn and some fried bits on top. ", "I'm not sure what it was ", "but it added to the texture of the dish. ", "I also added avocado. ", "The sushi rice was just the right seasoning ", "and I found it really filling. ", "I didn't even use and soya sauce. ", "It's a good place to grab and go as there really isn't any seating ", "so just bear that in mind. ", "The service was quick and the owner was very friendly."], "author": "Grace T.", "review": "I got the shrimp tempura bowl and I really enjoyed it. The flavours were delicious together. It came with shrimp tempura, sushi mayo, teriyaki sauce, crab, wakame, edamame, corn and some fried bits on top. I'm not sure what it was but it added to the texture of the dish. I also added avocado. The sushi rice was just the right seasoning and I found it really filling. I didn't even use and soya sauce. It's a good place to grab and go as there really isn't any seating so just bear that in mind. The service was quick and the owner was very friendly.", "rating": 4, "date": "2018-08-06"}], "bbq beef bowl": [{"excerpts": ["Been here the 3rd time within 2 weeks, and I always order the same thing, BBQ Beef Bowl. ", "It's actually a Gyudon recipe where beef and onion are simmered in a mildly sweet sauce flavored with dashi, soy sauce and mirin. ", "The bowl includes a side of pickled carrots, seaweed salad, slices of narutomaki (japanese fish cakes), and fried garlic in chilli oil garnish (love the fried garlic). ", "If you come early, your order comes with a side of edamame and miso soup until it runs out. ", "The flavor of the Beef Bowl is always consistent, and I don't have any weird lingering after-taste in my mouth, which I think is caused by preservatives. "], "author": "Summer O.", "review": "Been here the 3rd time within 2 weeks, and I always order the same thing, BBQ Beef Bowl. It's actually a Gyudon recipe where beef and onion are simmered in a mildly sweet sauce flavored with dashi, soy sauce and mirin. The bowl includes a side of pickled carrots, seaweed salad, slices of narutomaki (japanese fish cakes), and fried garlic in chilli oil garnish (love the fried garlic). If you come early, your order comes with a side of edamame and miso soup until it runs out. The flavor of the Beef Bowl is always consistent, and I don't have any weird lingering after-taste in my mouth, which I think is caused by preservatives. So I enjoy it very much!\n\nThe owner is Japanese, and when I see him, I noticed that he works with the staff in serving customers as well as training his staff to have good customer service practices. It shows that he's fully involved and strives to improve his business, which is a good trait to have as a business owner.  \n\nI haven't had any of their raw fish menus just because I don't prefer raw fish for lunch during my work days, but I feel confident that they are good given there's always a long line here. This will be one of my go-to place, and I can't wait to complete my rewards card and get $10 discount after 10 stamps!", "rating": 5, "date": "2018-05-08"}], "tofu bowl": [], "ahi poke bowl": [{"excerpts": [":\n- Rice can be a bit stiff\n\nRecommendations:\n+ Ahi Poke Bowl (tuna)\n"], "author": "Fanny W.", "review": "Picking up my MealPal...\n\"What's your number?\"\n\"1908\"\n\"Here you go\" *looks to my friend* \"And you, what's your number?\"\n\"Oh no, she doesn't have MealPal\"\n\"I know, I'm asking for her number\"\nTHIS GUY IS THE BEST! He's all smiles every time I visit. Best response ever!\n\nPros:\n+ Decent ingredients\n+ Friendly service\n+ A table or two outside\n+ Food is always ready for MealPal\n+ Generous portions for MealPal\n\nCons:\n- Rice can be a bit stiff\n\nRecommendations:\n+ Ahi Poke Bowl (tuna)\n+ Taka Bowl (salmon + spicy tuna)\n+ Salmon Bowl (salmon)\n\nA solid 3.5 in terms of food quality. The food isn't bad, the price is right, and the service is good. I'm not an imitation crab or spicy tuna fan, but I'll eat it since it's in my bowl. It's not the best, but my tastebuds were not offended, so Sushi Taka is doing pretty good.\n\nYes, the rice bothers me. But for $7 through MealPal, I ain't complainin'. The fish is good, and that's what matters the most. Will be back!", "rating": 4, "date": "2018-01-30"}], "poke poke bowl": [], "salmon poke burrito": [{"excerpts": ["I have tried their salmon poke burrito many times as well "], "author": "David J.", "review": "Love Sushi Taka and the people that run it. Such pleasant friendly people and always willing and able to cater to adjustments. I generally always get the fire bowl and swap the rice out for mixed greens. Great size, good quality ingredients, and made super fast.\n\nI have tried their salmon poke burrito many times as well and it beats the pants off the 'original' burrito guys down the road at Sushiritto, and cheaper to boot. \n\nIcing on the cake here is the free miso soup and edamame as well. A great little accompaniment for their food.\n\nThey have a loyalty scheme too which is great - come 10 times and save $10.", "rating": 5, "date": "2018-03-04"}], "ahi poke burrito": [], "spicy salmon burrito": [{"excerpts": ["I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\n"], "author": "Meghan J.", "review": "I've been a supporter of Sushi Taka ever since I started working in the area. Being just a short distance from work, it was an easy go-to. Not gonna lie-I was wrapped up in the whole sushi burrito thing for a while, lol. \n\nThis place has expanded their menu, offering more than just the few choices of the sushi burritos and bowls from the previous menu. (It doesn't look like the entire menu is listed for the Order Pickup on here, so you will have to order there for the other options). They have newly-added bases for you to choose (white/brown rice, mixed greens, ramen salad). I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\nThe place is small, but more of a pick-up-your-food-type-of place. Though the line is often out the door, the service is quick- I am out the door shortly after ordering at the counter (in my experiences, at least). Solid sushi burrito/poke spot! It's been difficult to find another good poke spot in the area, but it's nice to know Taka is here to stay!", "rating": 5, "date": "2017-08-04"}, {"excerpts": ["I have only ever gotten the spicy salmon burrito ", "and today I grabbed one after about a 5 month hiatus from Sushi Taka. ", "It was terrible. ", "I remembered there being lemon in it, which was what I liked, and it appears to no longer be an ingredient in this item. ", "Bummer. ", "Also asked for extra jalapenos and I can barely taste any. ", "The worst part is that there are entirely too many carrots (are they even pickled? ", "I can't tell), and they overpower all the other flavors. "], "author": "Lisa L.", "review": "I'm sitting here scratching my head trying to figure out what I used to like about this place. I have only ever gotten the spicy salmon burrito and today I grabbed one after about a 5 month hiatus from Sushi Taka. It was terrible. I remembered there being lemon in it, which was what I liked, and it appears to no longer be an ingredient in this item. Bummer. Also asked for extra jalapenos and I can barely taste any. The worst part is that there are entirely too many carrots (are they even pickled? I can't tell), and they overpower all the other flavors. Honestly considering throwing this one away and stepping out again to try something else-- somewhere else. \n\nIt's too bad because I think I have about 7 stamps on my lunch card here and I probably won't ever be back. Sushirrito only from here on out.", "rating": 3, "date": "2018-02-06"}], "spicy tuna burrito": [], "unagi burrito": [], "salmon teriyaki burrito": [], "shrimp tempura burrito": [{"excerpts": ["I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\n"], "author": "Meghan J.", "review": "I've been a supporter of Sushi Taka ever since I started working in the area. Being just a short distance from work, it was an easy go-to. Not gonna lie-I was wrapped up in the whole sushi burrito thing for a while, lol. \n\nThis place has expanded their menu, offering more than just the few choices of the sushi burritos and bowls from the previous menu. (It doesn't look like the entire menu is listed for the Order Pickup on here, so you will have to order there for the other options). They have newly-added bases for you to choose (white/brown rice, mixed greens, ramen salad). I've tried the Spicy Salmon Burrito, Shrimp Tempura Burrito, the Taka Bowl, Fire Bowl, and the Salmon Poke Bowl which are all fairly consistent in quality; the fish is always fresh and plentiful and the crab salad is flavorful.\n\nThe place is small, but more of a pick-up-your-food-type-of place. Though the line is often out the door, the service is quick- I am out the door shortly after ordering at the counter (in my experiences, at least). Solid sushi burrito/poke spot! It's been difficult to find another good poke spot in the area, but it's nice to know Taka is here to stay!", "rating": 5, "date": "2017-08-04"}, {"excerpts": ["I've come here a few times for their Shrimp tempura burrito. ", "Always given fresh ingredients. ", "Portion size is a bit small. ", "Flavor is a bit lacking. ", "I was hoping for some mayo/sauce for the crab meat. ", "I would probably stick to Sushirrito."], "author": "Benita M.", "review": "I really wanted to like Sushi Taka. The staff is always nice. They have a long line during lunch but they've sped up the process. While you wait in line, someone will ask you (if you're close to the door) what you would like to order. By the time you get to the front to pay, your order will be ready. Efficient! Every order also comes with a small miso soup and edamame.\n\nI've come here a few times for their Shrimp tempura burrito. Always given fresh ingredients. Portion size is a bit small. Flavor is a bit lacking. I was hoping for some mayo/sauce for the crab meat. I would probably stick to Sushirrito.", "rating": 3, "date": "2017-04-26"}, {"excerpts": ["I ended up ordering a shrimp tempura burrito and asked them not to include crab, cabbage, and tobiko. ", "I was worried at first because my order was kinda complicated "], "author": "Julia C.", "review": "I don't eat raw fish so I never considered Sushi Taka as a lunch option even though my coworkers and friends rave about it. But today my bf was picking up food from Sushi Taka for his coworkers. I decided to walk with him since it's just on Kearny st. and I can grab food somewhere close by afterwards.\n\nWhen we got to Sushi Taka I noticed that they also had cooked items like chicken teriyaki and shrimp tempura.\n\nI ended up ordering a shrimp tempura burrito and asked them not to include crab, cabbage, and tobiko. I was worried at first because my order was kinda complicated (I'm a super picky eater).\n\nBut after a 5 minute wait I was pleasantly surprised that they totally got everything right! Such amazing service! I hope I didn't cause too much inconvenience to their staff.\n\nThe meal even came with edamame and miso soup!", "rating": 4, "date": "2017-07-20"}, {"excerpts": ["Got the shrimp tempura burrito which is supposed to come with avocado and cucumber.  ", "I was watching the guy (i think the owner) put it together and didnt see him put it in.  ", "I mentioned this and he said he did.  ", "He didnt even bother to take a look.  ", "I go back to the office, and of course I was right...", "no green in sight.  ", "For an $11 burrito, I expect everything I paid for to be there esp since I even brought it up.  ", "The balance was def off taste wise without both ingredients...was too salty.  "], "author": "C A.", "review": "UPDATE: The owner contacted me to issue an apology and a refund after seeing my review.  While the refund is not necessary, I appreciate that he took the extra step to rectify an issue that has occurred so I've upgraded my rating by a star.  I can't give more than that as I still feel the food was too salty, but I'm more inclined now to give it another try to see if he made the improvements like he said he would.\n\n-------\nGot the shrimp tempura burrito which is supposed to come with avocado and cucumber.  I was watching the guy (i think the owner) put it together and didnt see him put it in.  I mentioned this and he said he did.  He didnt even bother to take a look.  I go back to the office, and of course I was right...no green in sight.  For an $11 burrito, I expect everything I paid for to be there esp since I even brought it up.  The balance was def off taste wise without both ingredients...was too salty.  The miso soup also just tasted like salt water and the edamame was way too salty as well.\n\nMistakes happen, I just didn't care for the nonchalant response given and the food was overly salty.\n\nBetter off going to sushiritto or onigilly a few blocks down.  Won't be back.", "rating": 3, "date": "2016-07-22"}, {"excerpts": ["I ordered be shrimp tempura burrito and got a bowl of miso too. ", "The burrito as a whole was delicious, rice was fresh and sticky just like sushi rice, and all the ingredients as a whole worked together to just make a delicious burrito. ", "Only thing to look out for is it's a little salty-- ", "so if sodium is not your thing skip the extra soy sauce they provide for you. ", "I've also used yelp to place pick up orders three times now. ", "Every time my burrito is ready by the time I walk there. ", "And they're very organized about the pickup system. "], "author": "Ali F.", "review": "Absolutely love this place. Work about a half mile from here and it's so convenient. First time I went I walked in and ordered. No line, super friendly staff and took less than 3 minutes from order to out the door. I ordered be shrimp tempura burrito and got a bowl of miso too. The burrito as a whole was delicious, rice was fresh and sticky just like sushi rice, and all the ingredients as a whole worked together to just make a delicious burrito. Only thing to look out for is it's a little salty-- so if sodium is not your thing skip the extra soy sauce they provide for you. I've also used yelp to place pick up orders three times now. Every time my burrito is ready by the time I walk there. And they're very organized about the pickup system. In and out, perfect for a busy day at the office.\n\nOverall the staff is kind, the shop is small but fast paced and the food is delicious. Great for a quick and filling lunch!", "rating": 5, "date": "2017-10-06"}], "chicken teriyaki burrito": [], "bbq beef burrito": [], "california burrito": []}