{"bowl of rice": [{"excerpts": ["It comes with a bowl of miso soup, small salad, 4 piece California Roll, shrimp and vegetable tempura, and a large fillet of Donkatsu with a heaping bowl of rice.  ", "I ordered the Rainbow Roll and it was nicely presented. ", "However, it was just mediocre.  "], "author": "Sunmy B.", "review": "Sushi Toni is a good lunch spot, but I wouldn't dine here for dinner.   My son enjoyed the Donkatsu & Tempura lunch combo, which was a decent amount of food for the price.  It comes with a bowl of miso soup, small salad, 4 piece California Roll, shrimp and vegetable tempura, and a large fillet of Donkatsu with a heaping bowl of rice.  I ordered the Rainbow Roll and it was nicely presented. However, it was just mediocre.  It was fresh and tasty enough to appease a sushi craving, but it didn't blow me away.  \n\nThe decor is more on the tacky side.  The walls are lined with framed pictures of Japanese anime characters and there is a electric organ that sits against the wall.  If you ask me, it looks a bit out of place. The one thing that was a bit disappointing is that it's not authentically Japanese in the sense that it's owned by Koreans.  \n\nAll in all, the sushi wasn't bad, the service was prompt, and the sushi chef was friendly.  A good place for lunch.", "rating": 3, "date": "2009-12-29"}], "chicken gyoza pcs": [], "shumai pcs": [], "tuna tadaki": [], "c b salad": [], "wakame salad": [{"excerpts": ["Sushi is fresh and tasty - I always recommend the wakame salad. ", "Don't just wakaway and ignore it. ", "Ha, get it? ", "Ok, I had too... ", "Sorry."], "author": "A X.", "review": "Ok - this place is across the street from me, and I'm a huge sushi fiend - so I essentially eat here every five minutes. \n\nThe place only opens for dinner (You'll need to go to Maru's around the corner of you want lunchtime sushi) and is incredibly small. They do really well trying to accommodate large groups and can easily move tables around. \n\nThey have a decent sushi bar area and the owner (named Toni - shocker) is there every night and is incredibly friendly. \n\nThis is a perfect sushi place to make one of your 'regular spots' and its easy to get to know the staff. \n\nSushi is fresh and tasty - I always recommend the wakame salad. Don't just wakaway and ignore it. Ha, get it? Ok, I had too... Sorry.", "rating": 5, "date": "2012-10-13"}, {"excerpts": ["I order the saba nigiri, albacore nigiri, Hanakah roll (salmon skin, smoked salmon, Ikura), and Swamp roll (wakame salad and spicy tuna). ", "Everything was excellent. ", "The chef/owner also wanted us to try his special miso soup. ", "They just got their liquor license a few days ago, and sake and soju are on their way. ", "I can't wait to try their cocktail concoctions!"], "author": "Lily T.", "review": "Sushi Toni is located at what was formerly Sushi Man. The current owner also previously owned Tempura House around the corner, which is now replaced by Mari Sushi. Sit by the sushi bar, and he will make sure you feel right at home. I don't know if that's his personal style, but that's the thing with newly opened businesses: the service is usually extraordinary. He's an avid green tea drinker, so you can strike a conversation with him on that!\n\nI order the saba nigiri, albacore nigiri, Hanakah roll (salmon skin, smoked salmon, Ikura), and Swamp roll (wakame salad and spicy tuna). Everything was excellent. The chef/owner also wanted us to try his special miso soup. They just got their liquor license a few days ago, and sake and soju are on their way. I can't wait to try their cocktail concoctions!", "rating": 5, "date": "2009-08-04"}], "spinach oshitashi": [{"excerpts": ["Spinach oshitashi $5.50: ", "Tasty with the tangy sesame sauce, but gone in a few bites. ", "Such elusive oshi.\n", "(++) ", "Caterpillar roll $11.50: ", "Perfect balance of avocado and eel. ", "The generous avo adds a nice buttery taste and texture.\n", "(", "+", "+", "+) ", "Lion King roll $10.50: "], "author": "Edna C.", "review": "Trying to find decent, authentic, non-touristy sushi around Downtown SF is more difficult than expected. We finally settled on Akiko but had problems locating the hidden, nondescript storefront; we made our way inside, only to find that it was packed before 6pm and that reservations one week in advance are recommended o.O You can thus imagine our gratefulness to find the no-frills, authentic-looking Sushi Toni with no wait (there was a wait ~7pm when we left! I have a theory that the crowd always follows us)\n\nIn our post-SF-explorations hunger, we splurged on 2 appetizers and 2 rolls--looking at the extensive menu with pictures of specialty rolls just makes you hungrier.\n\n(+) Hamachi kama $12.50: Quite tender (though I've had better) and decent portion. You have to poke around to find the fleshy parts... I've never understood fish anatomy, especially the kama (collar)\n(+/-) Spinach oshitashi $5.50: Tasty with the tangy sesame sauce, but gone in a few bites. Such elusive oshi.\n(++) Caterpillar roll $11.50: Perfect balance of avocado and eel. The generous avo adds a nice buttery taste and texture.\n(+++) Lion King roll $10.50: Baked mozzarella cheese in a sushi roll sounds strange to me every time, but the Lion King is the comfort food of sushi rolls and Toni's version is flavorful and delightfully savory... like crab mac n cheese in fusion sushi roll form.\n\nService is friendly--we received an extremely sincere apology when there was a bit of the wait for the food. As you would expect, the server was a very nice mama-san, and the place has a family-run vibe.\n\nOverall, the food is good and the restaurant is clean. I would suggest going for sushi/sashimi and passing on appetizers, which are quite pricey and were responsible for racking up the bill to ~$45 for 2. (But then again, when have appetizers ever been a bargain? Why do I never learn)\n\nFun fact: This reminds me of my favorite sushi place in Mountain View, called Sushi Tomi (also no-frills and authentic). I wonder if Toni and Tomi are cousins :3", "rating": 5, "date": "2015-07-06"}, {"excerpts": ["- Spinach Oshitashi - steamed spinach with special house sesame sauce, I like it!\n\n"], "author": "Manda Bear B.", "review": "*********************** 672 **************************\n\n        I love their location, next to the adult theater, how cool is that! Their nigiri is the cheapest in town, and decent!  \n\n- Sashimi for lunch is only $12.50 choices 2 each, salmon, tuna, & hamachi! Steal!!!\n\n- Sunomono salad with salmon is good here. \n\n- Spinach Oshitashi - steamed spinach with special house sesame sauce, I like it!\n\n- Dynamite Boom & Lion King rolls, worth to check it out.\n\n          I love the fact Sushi Toni is so casual with TVs for me to watch sport. Service is super nice. Even 1 time, my bestfriend & I came in just to drink Sake and watch the game, they were totally cool with us. + 1 star for service!!!\n\n         They located on the stiff street, don't wear 5 inches heels like me! Eeek!", "rating": 4, "date": "2011-09-13"}], "tekka m": [], "kappa m": [], "baked salmon": [{"excerpts": ["it's fatty, creamy, filled with freshly baked salmon and a special sauce that will make you ecstatic. "], "author": "Priya S.", "review": "When I'm craving a no-frills, casual, local sushi spot w/ some of the friendliest waiters and waitresses I've met, I come to Sushi Toni.\n\nI am a huge fan of specialty rolls and am not really into sashimi or any type of raw fish so Sushi Toni is quite perfect for me. They have some of the best specialty rolls - the Volcano Roll here is seriously incredible - it's fatty, creamy, filled with freshly baked salmon and a special sauce that will make you ecstatic. Close contenders are the Dragon Roll, the Lion King Roll and the Crunch Roll. \n\nI've also had the Chicken Donburi and while I did enjoy it, I don't think there was anything really unique or enticing about it. It's quite plain. So I'd recommend sticking to the specialty rolls and the actual sushi items instead of the rice bowls. \n\nHappy Eating, Yelpers!\n\nP.S. It's conviniently located about 2 blocks from the Sutter Stockton Garage for all the drivers out there and it's within a 3 - 4 block radius from Union Square.", "rating": 4, "date": "2013-03-15"}, {"excerpts": [": it combines crab, avocado, and baked salmon topped with melted cheese. ", "I'm on the fence about combining the cold ingredients with the warm baked salmon... "], "author": "Samantha L.", "review": "It's a cute and small sushi bar located in a very busy area. I'm not sure why i even considered trying to find parking at peak hours in Union Square area! I'm not normally a fan of sushi, especially sashima, but i easily ate myself through many rolls which ultimately sorted out to $35 per person. That's A LOT of sushi, no?!\n\nThe memorable sushi:\n\nLion King Roll: it combines crab, avocado, and baked salmon topped with melted cheese. I'm on the fence about combining the cold ingredients with the warm baked salmon... but it all somehow worked.\n\nRomeo & Juliet: My first taste of soybean paper! I can't actually tell any difference between soybean paper and traditional seaweed paper. Nonetheless, i loved the salmon, avocado, and scallop combo.", "rating": 3, "date": "2011-03-28"}, {"excerpts": ["their baked salmon roll was good & the shrimp tempura roll were pretty good!\n\n"], "author": "Karina B.", "review": "Def the best sushi place, i've had in SF so far. their baked salmon roll was good & the shrimp tempura roll were pretty good!\n\nit was definitely NOT BAD, it was goooooood", "rating": 4, "date": "2011-10-24"}, {"excerpts": ["We had the baked salmon roll, salmon teriyaki, vegetable tempura, and vegetable udon."], "author": "Zach S.", "review": "We're giving this place a 4 star review just because Toni is so hilarious.  He's really a class act. He's funny, interesting, and surely will entertain you.  Sit close to the sushi bar.  We had the baked salmon roll, salmon teriyaki, vegetable tempura, and vegetable udon.", "rating": 4, "date": "2010-06-25"}], "spicy yellowtail": [{"excerpts": ["Red Dragon, BTS, and Spicy Yellowtail is what ordered. ", "The beer was very cold and matched perfectly with my sake! ", "Don't miss out, tourist!!"], "author": "Junior E.", "review": "Visiting San Fran this weekend. Wanted to eat sushi but didn't have formal clothing. This place fit the bill.  The sushi was also excellent.  Curb appeal isn't the greatest but this place is great. Loved the low key atmosphere and people. Red Dragon, BTS, and Spicy Yellowtail is what ordered. The beer was very cold and matched perfectly with my sake! Don't miss out, tourist!!", "rating": 4, "date": "2017-12-16"}, {"excerpts": ["I ordered a bowl of miso soup to start along with a spicy yellowtail roll and a specialty caterpillar roll. ", "The miso soup was pretty good, although the tofu had no solidity at all. ", "I guess that is just a preference though. ", "The spicy yellowtail roll came in six pieces and was pretty poorly rolled, unfortunately. ", "Two or three of the pieces had the wrapper visibly cutting into the center of the roll, and fell apart upon picking up. ", "They tasted ", "The spicy yellowtail roll came in six pieces and was pretty poorly rolled, unfortunately. ", "Two or three of the pieces had the wrapper visibly cutting into the center of the roll, and fell apart upon picking up. ", "They tasted "], "author": "John B.", "review": "Summary:\nMiso soup costs extra. One roll was excellent and the other was subpar. The atmosphere and service were less than okay, and the price was less than okay.  Go find somewhere else, as there are literally dozens of other options! \n\nI had a hankering for sushi, and Sushi Toni seemed to be a decent place to try, being close and supposedly cheap. It was really cool that their website had a digital copy of the menu, so I was able to take some extra time to look through and think about what I wanted to eat. \n\nService:\nI got there at around 5:20, as they open at 5pm. There were two other single customers sitting at the bar finishing up their meals, so I took a seat at the bar and waited! I should note that I made it all the way to almost being seated before a staff member addressed me, even though the chefs were behind the bar chopping away. I was helped rather quickly though and my food was prepared quickly, so that was nice! However, it seemed a little odd to be sitting right across the counter with the sushi chefs and never interact with them save for getting my plate handed to me. The staff didn't seem to give off a particularly welcoming attitude, and the sushi chefs were practically silent the entire time I was there!\n\nFood:\nI ordered a bowl of miso soup to start along with a spicy yellowtail roll and a specialty caterpillar roll. The miso soup was pretty good, although the tofu had no solidity at all. I guess that is just a preference though. I think I also bit into a piece of onion in the soup, which was an interesting addition I hadn't come across before. \n\nThe rolls were very interesting, to say the least. Really hit-or-miss. The spicy yellowtail roll came in six pieces and was pretty poorly rolled, unfortunately. Two or three of the pieces had the wrapper visibly cutting into the center of the roll, and fell apart upon picking up. They tasted okay though, but were nothing spectacular. \n\nThe caterpillar roll, on the other hand, was really good! A true sushi experience. In terms of texture, there's sliced avocado on the top that is super creamy and delicious, and the roll itself had a good mix of crunch and fish. In terms of flavor, it was something else. My first bite was unexpectedly sweet, and the remainder of the 7 pieces was similarly sweet and filled with flavor and texture. It was great!\n\nHowever, that bowl of miso soup, a regular roll, and a specialty roll ended up being over $21 for just me, so it definitely wasn't the cheapest sushi I've ever had (which was two starters, miso soup, two regular rolls and three specialty rolls for ~$50 between two people)", "rating": 2, "date": "2015-06-06"}, {"excerpts": ["It's light, refreshing and pretty great\n- Spicy yellowtail: ", "It was okay to me; ", "more to my friend's liking\n- Baked Volcano", ": I think this was what it was called anyway; it was basically stuffed with crab meat and cheese was baked on top (so the entire plate was hot). "], "author": "Jessica L.", "review": "In town for a little short trip in San Francisco!\n\nDecor: Small, cozy almost mom and pop like. not pretentious at all.\n\nService: Well attended to. Got to hear nice hum of korean in the background, haha.\n\nFood: \n- Romeo & Juliet: THE BEST one we got! It's light, refreshing and pretty great\n- Spicy yellowtail: It was okay to me; more to my friend's liking\n- Baked Volcano: I think this was what it was called anyway; it was basically stuffed with crab meat and cheese was baked on top (so the entire plate was hot). My friend and I found this dish a bit too heavy for our tastes, but it was still good.\n\nOverall: I think it was a decently priced restaurant and I got my sushi fix here, so I'm satisfied!", "rating": 4, "date": "2012-01-08"}, {"excerpts": ["I order the unagi donburi and spicy yellowtail roll; both were disappointing.  \n\n"], "author": "Bo T.", "review": "I really wanted to like Sushi Toni, but I was left unsatisfied after my dinner there.  I order the unagi donburi and spicy yellowtail roll; both were disappointing.  \n\nThe rice was soggy and my roll was so loose it fell apart when I picked it up.  It seems pretty elementary to me that if you're a sushi chef you should be able to make a nice roll, but I must've gotten the chef in training.  \n\nThe best thing about Sushi Toni was the friendly waitress.  She was attentive and quick.  Too bad the food isn't better.", "rating": 2, "date": "2009-11-12"}], "shrimp  asparagus": [], "tuna  yellowtail": [], "yellowtail": [{"excerpts": ["We also got a sashimi platter which had a few different types of tuna, yellowtail, and salmon - delicious and healthy!\n\n"], "author": "Maansi D.", "review": "I've been looking for an affordable, good sushi spot and it took a second. A friend of mine recommended Sushi Toni as one of her favorites and I decided to give it a shot. I was not disappointed. The sushi rolls were fantastic! I tried the Red Dragon doll and the Volcano Roll - both were really yummy. We also got a sashimi platter which had a few different types of tuna, yellowtail, and salmon - delicious and healthy!\n\nThe restaurant is no frills, which is fine by me if it means affordable, quality sushi. Our server (who I suspected was the owner) was so nice she even threw in a free dessert for us (also delish).\n\nYou can also BYOB for a corking fee of $15, which is not bad at all.\n\nDefinitely planning on going back- excited to have found our spot!", "rating": 4, "date": "2017-10-19"}, {"excerpts": ["; Yellowtail and salmon sashimi looked twice as large on Yelp than in person. \n\n"], "author": "Ee Vonn Y.", "review": "Interior - Moist, attacked by bugs throughout my meal.\n\nPortions - Small; Yellowtail and salmon sashimi looked twice as large on Yelp than in person. \n\nPhiladelphia and Volcano rolls - Average. \n\nService - Good. They reheated the hot sake for us when it got cold.", "rating": 3, "date": "2016-08-03"}, {"excerpts": ["Red Dragon, BTS, and Spicy Yellowtail is what ordered. ", "The beer was very cold and matched perfectly with my sake! ", "Don't miss out, tourist!!"], "author": "Junior E.", "review": "Visiting San Fran this weekend. Wanted to eat sushi but didn't have formal clothing. This place fit the bill.  The sushi was also excellent.  Curb appeal isn't the greatest but this place is great. Loved the low key atmosphere and people. Red Dragon, BTS, and Spicy Yellowtail is what ordered. The beer was very cold and matched perfectly with my sake! Don't miss out, tourist!!", "rating": 4, "date": "2017-12-16"}, {"excerpts": ["I ordered a bowl of miso soup to start along with a spicy yellowtail roll and a specialty caterpillar roll. ", "The miso soup was pretty good, although the tofu had no solidity at all. ", "I guess that is just a preference though. ", "The spicy yellowtail roll came in six pieces and was pretty poorly rolled, unfortunately. ", "Two or three of the pieces had the wrapper visibly cutting into the center of the roll, and fell apart upon picking up. ", "They tasted ", "The spicy yellowtail roll came in six pieces and was pretty poorly rolled, unfortunately. ", "Two or three of the pieces had the wrapper visibly cutting into the center of the roll, and fell apart upon picking up. ", "They tasted "], "author": "John B.", "review": "Summary:\nMiso soup costs extra. One roll was excellent and the other was subpar. The atmosphere and service were less than okay, and the price was less than okay.  Go find somewhere else, as there are literally dozens of other options! \n\nI had a hankering for sushi, and Sushi Toni seemed to be a decent place to try, being close and supposedly cheap. It was really cool that their website had a digital copy of the menu, so I was able to take some extra time to look through and think about what I wanted to eat. \n\nService:\nI got there at around 5:20, as they open at 5pm. There were two other single customers sitting at the bar finishing up their meals, so I took a seat at the bar and waited! I should note that I made it all the way to almost being seated before a staff member addressed me, even though the chefs were behind the bar chopping away. I was helped rather quickly though and my food was prepared quickly, so that was nice! However, it seemed a little odd to be sitting right across the counter with the sushi chefs and never interact with them save for getting my plate handed to me. The staff didn't seem to give off a particularly welcoming attitude, and the sushi chefs were practically silent the entire time I was there!\n\nFood:\nI ordered a bowl of miso soup to start along with a spicy yellowtail roll and a specialty caterpillar roll. The miso soup was pretty good, although the tofu had no solidity at all. I guess that is just a preference though. I think I also bit into a piece of onion in the soup, which was an interesting addition I hadn't come across before. \n\nThe rolls were very interesting, to say the least. Really hit-or-miss. The spicy yellowtail roll came in six pieces and was pretty poorly rolled, unfortunately. Two or three of the pieces had the wrapper visibly cutting into the center of the roll, and fell apart upon picking up. They tasted okay though, but were nothing spectacular. \n\nThe caterpillar roll, on the other hand, was really good! A true sushi experience. In terms of texture, there's sliced avocado on the top that is super creamy and delicious, and the roll itself had a good mix of crunch and fish. In terms of flavor, it was something else. My first bite was unexpectedly sweet, and the remainder of the 7 pieces was similarly sweet and filled with flavor and texture. It was great!\n\nHowever, that bowl of miso soup, a regular roll, and a specialty roll ended up being over $21 for just me, so it definitely wasn't the cheapest sushi I've ever had (which was two starters, miso soup, two regular rolls and three specialty rolls for ~$50 between two people)", "rating": 2, "date": "2015-06-06"}, {"excerpts": ["Yellowtail fin weren't so much but taste alright. ", "I had a bit fun with myself and ordered as I would usually go for sushi weekend one a month. ", "Waiter came check on me several times to see if I wanted to cancel any dish ('coz he thought I ordered too much ;)) he even recommended to cancel my tempura noodle) ", "man, I can eat more than my body look ;))\nFriendly atmosphere, I ended up having a great conversation with a couple and their daughter, who recently got a job in SF so she moved from NYC to here, whereas I am about to move to NYC. ", "The family was fun and lovely. \n", "A great experience for my last night in the city life. ", ";) will come back for some excellent rolls"], "author": "Bao V.", "review": "I have been craving udon curry for so long and haven't found a good one yet. Yelp reviews are so confusing plus not many option for Japanese restaurants (affordable one). Finished packing and gathering miscellaneous stuff, I had 4 hours to spend and was hungry with no curry. Seriously, any yelpers read this review, pls recommend a good place for udon curry and noodle in general that also offer sushi (basic rolls are fine).\nAnyhow, while swiping through yelp, I realized I had bookmarked Sushi Toni for quite awhile and never been. The reviews are completely opposite, some are extremely positive and some are even 1 star only. Oh well, I decided to give it a taste and did not regret at all.\nFirst of all, the place is cozy and lovely, unlike others yelped that too small or corky. The sushi chef and most of the staff are Koreans, except for two Mexican sous chef. I guess, they just make the name Japanese;) but knowing they are Koreans, I was relief coz some reviews said they were sick or so after eating. However, Koreans are known for their cleanliness and details (well, most of them). My ex is a heavy case of OCD :))\n*I came about 6pm so the place wasn't that crowded. Waiter seated and watered me right away. Food took less than five mins to be served. Oh my Gosh, de-lizzz. Who ever said the portion was small are greedy. They are just fine. You probably order a Cali roll, the biggest of them all, but usually, rolls are not supposed to be to big. A even mouth size is fine. I love it! Like many recommendation, Romeo-Ju rolls are the best!!! Must try. Salmons were fresh. Yellowtail fin weren't so much but taste alright. I had a bit fun with myself and ordered as I would usually go for sushi weekend one a month. Waiter came check on me several times to see if I wanted to cancel any dish ('coz he thought I ordered too much ;)) he even recommended to cancel my tempura noodle) man, I can eat more than my body look ;))\nFriendly atmosphere, I ended up having a great conversation with a couple and their daughter, who recently got a job in SF so she moved from NYC to here, whereas I am about to move to NYC. The family was fun and lovely. \nA great experience for my last night in the city life. ;) will come back for some excellent rolls", "rating": 5, "date": "2016-03-29"}, {"excerpts": ["Had the rainbow roll and yellowtail small roll (very little fish in the yellowtail roll, mostly rice)"], "author": "Mike B.", "review": "Service was good, but got food poisoning the next morning, not pleasant.  Had the rainbow roll and yellowtail small roll (very little fish in the yellowtail roll, mostly rice)", "rating": 1, "date": "2016-10-06"}, {"excerpts": ["My friend and I split the seaweed salad and the yellowtail sashimi. ", "The seaweed salad was a nice large portion and I thought perfectly dressed (not too overwhelmingly) ", "and the sashmi was amazing... very smooth and fresh. ", "I then had one of the special eel rolls and my friend had the spicy salmon. ", "Both were very good and no complaints. ", "I'm sure there are a ton of amazing sushi restaurants in San Fran ", "but I think this is a great place to stop if you're in the neighborhood and craving sushi!"], "author": "Aryn C.", "review": "Visiting San Fran for work and walked into Sushi Toni craving sushi. My friend and I split the seaweed salad and the yellowtail sashimi. The seaweed salad was a nice large portion and I thought perfectly dressed (not too overwhelmingly) and the sashmi was amazing... very smooth and fresh. I then had one of the special eel rolls and my friend had the spicy salmon. Both were very good and no complaints. I'm sure there are a ton of amazing sushi restaurants in San Fran but I think this is a great place to stop if you're in the neighborhood and craving sushi!", "rating": 4, "date": "2015-02-16"}, {"excerpts": ["We ordered spicy scallops, uni, red snapper and yellowtail nigiri's, seaweed salad, dynamite boom roll, ice cream tempura and salmon+avocado roll.\n\n"], "author": "Alice W.", "review": "I felt like some sushi and didn't want to venture too far from the nest. After much research on yelp, we decided on Sushi Toni. We ordered spicy scallops, uni, red snapper and yellowtail nigiri's, seaweed salad, dynamite boom roll, ice cream tempura and salmon+avocado roll.\n\nWe sat at the bar and the chef/owner was very friendly and chatted us up as we were waiting for the food. The fish tasted fresh and the service was friendly. Definitely worth a try.", "rating": 4, "date": "2011-10-09"}, {"excerpts": ["What we ordered:\n\n4x Yellowtail Sushi\n4x Edamame\n2x Sake (forgot which)\n4x Beer (forgot which)\n\nEverything was awesome.  "], "author": "David P.", "review": "Can't wait to come back here.  I was here one year ago 8/12 and on a drunken escapade with a friend of mine.  We stumbled into this place not knowing what to expect.  Needless to say both my friend and were blown away by the service and most of all food.  It was late, possibly after 12am.  It was just myself, my friend, the chef, waitress, and a male stripper construction worker regular.  We had an awesome time with the chef and got drunk with him.  What we ordered:\n\n4x Yellowtail Sushi\n4x Edamame\n2x Sake (forgot which)\n4x Beer (forgot which)\n\nEverything was awesome.  The Edamame was my favorite and best i ever had.  It came with a special green roe that I have never seen or tasted before.  This is a must if you're a Edamame fan (not that many of us).  \n\nComing back again for Outsidelands and definitely making an annual pilgrimage to this place!", "rating": 5, "date": "2013-07-30"}, {"excerpts": ["I ordered the yellowtail collar and being that it takes a while to cook it, they waited until last second to start grilling it. ", "I was sitting there without any food left to eat as my stomach began to settle. ", "I walked out and told them to just keep it (after paying for it),"], "author": "Oliver T.", "review": "Overrated. I was the only person in there and they took forever to get my sushi order out. I ordered the yellowtail collar and being that it takes a while to cook it, they waited until last second to start grilling it. I was sitting there without any food left to eat as my stomach began to settle. I walked out and told them to just keep it (after paying for it),", "rating": 2, "date": "2014-09-01"}, {"excerpts": ["It's light, refreshing and pretty great\n- Spicy yellowtail: ", "It was okay to me; ", "more to my friend's liking\n- Baked Volcano", ": I think this was what it was called anyway; it was basically stuffed with crab meat and cheese was baked on top (so the entire plate was hot). "], "author": "Jessica L.", "review": "In town for a little short trip in San Francisco!\n\nDecor: Small, cozy almost mom and pop like. not pretentious at all.\n\nService: Well attended to. Got to hear nice hum of korean in the background, haha.\n\nFood: \n- Romeo & Juliet: THE BEST one we got! It's light, refreshing and pretty great\n- Spicy yellowtail: It was okay to me; more to my friend's liking\n- Baked Volcano: I think this was what it was called anyway; it was basically stuffed with crab meat and cheese was baked on top (so the entire plate was hot). My friend and I found this dish a bit too heavy for our tastes, but it was still good.\n\nOverall: I think it was a decently priced restaurant and I got my sushi fix here, so I'm satisfied!", "rating": 4, "date": "2012-01-08"}, {"excerpts": ["We had a the two most popular items by fellow yelpers: volcano rolls,  Romeo &Juliet, and salmon and yellowtail. ", "The volcano rolls is interesting, served warm - but in fact it was actually hot - too hot to eat even after cooling for a few minutes. ", "The rainbow roll was good - very tasty and a good combination of stuff. \n", "The salmon and yellowtail was ok, fairly typical. ", "Both the volcano and salmon&yellowtail actually had rice falling...before we even touched it. \n", "Service was fine - we had to pay extra to substitute salmon for crab meat. "], "author": "Bhavin M.", "review": "Probably a 3.5 star.\nFood was good, fish was fresh but rolls had too much rice (some was actually falling in the serving plate itself). \n\nWe had a the two most popular items by fellow yelpers: volcano rolls,  Romeo &Juliet, and salmon and yellowtail. The volcano rolls is interesting, served warm - but in fact it was actually hot - too hot to eat even after cooling for a few minutes. The rainbow roll was good - very tasty and a good combination of stuff. \nThe salmon and yellowtail was ok, fairly typical. Both the volcano and salmon&yellowtail actually had rice falling...before we even touched it. \nService was fine - we had to pay extra to substitute salmon for crab meat. Prices were generally, as guided. \n\nOverall, its ok, nothing to write home about. In summary, I would not be opposed to going back but I am not planning another trip.  \n\nThe star reviews (4) overall guided us a bit to come try out Sushi Toni, although if you actually read the reviews you realize that there is a fair degree of polarizing opinions, and well - reality is probably somewhere in the middle.", "rating": 3, "date": "2012-01-03"}, {"excerpts": ["There were no special fishes, just the usual tuna, salmon, yellowtail, etc.  ", "Again some of it fishy, some of it has a weird color and texture (as if it was frozen).  ", "We also ordered a couple of specialty rolls.  ", "Word to sushi places, ease up or don't use mayo.  ", "I don't know why this has become a convention in sushi places, but I have found that the good ones don't use much if any mayo at all.  ", "Honestly the texture and the throat feel of mayo makes the sushi taste even more fishy and less fresh.  ", "Good  fish should stand on its own and in my opinion leave you with a fresh and crisp feel after  the meal.  ", "This place used too much mayo in their sauces for the rolls.  "], "author": "Scott C.", "review": "I was so disappointed with this place.  Based off of the reviews, I expected the food to be at least OK.  It was not.  The only reason I am giving the place 2 stars instead of 1 is because the people working there were very friendly and the service was quite good.  That said, the sushi itself sucked.  The fish was not very fresh and many of the pieces tasted too fishy.  Some of the pieces tasted as if they had been frozen.  We ordered a sashimi combo dinner which included 12 pieces of assorted fish (chefs choice).  There were no special fishes, just the usual tuna, salmon, yellowtail, etc.  Again some of it fishy, some of it has a weird color and texture (as if it was frozen).  We also ordered a couple of specialty rolls.  Word to sushi places, ease up or don't use mayo.  I don't know why this has become a convention in sushi places, but I have found that the good ones don't use much if any mayo at all.  Honestly the texture and the throat feel of mayo makes the sushi taste even more fishy and less fresh.  Good  fish should stand on its own and in my opinion leave you with a fresh and crisp feel after  the meal.  This place used too much mayo in their sauces for the rolls.  It was so bad, I had to find a dessert place just to cleanse the palate.  \n\nI wish I liked the food more, because the people that worked there were so nice.", "rating": 2, "date": "2010-03-01"}, {"excerpts": ["I order the unagi donburi and spicy yellowtail roll; both were disappointing.  \n\n"], "author": "Bo T.", "review": "I really wanted to like Sushi Toni, but I was left unsatisfied after my dinner there.  I order the unagi donburi and spicy yellowtail roll; both were disappointing.  \n\nThe rice was soggy and my roll was so loose it fell apart when I picked it up.  It seems pretty elementary to me that if you're a sushi chef you should be able to make a nice roll, but I must've gotten the chef in training.  \n\nThe best thing about Sushi Toni was the friendly waitress.  She was attentive and quick.  Too bad the food isn't better.", "rating": 2, "date": "2009-11-12"}, {"excerpts": ["I ordered the usual sushi fare.... salmon, yellowtail etc.  ", "I was impressed by their uni as it was nice and creamy and no fishy taste at all.  "], "author": "Al C.", "review": "2nd time here on a business trip to SF.  The staff and sushi chefs are pretty friendly.  I ordered the usual sushi fare.... salmon, yellowtail etc.  I was impressed by their uni as it was nice and creamy and no fishy taste at all.  The sushi chef then recommended the live scallop to me.  He said that they only get some like once a month.  I thought \"what the heck\" so I went ahead and got it.  Its not just one piece of scallop over sushi rice, it is a huge scallop sliced into strips so that you end up with like 8 pieces of sushi.  Then they took out the muscle around the scallop, mixed it with some onions, and turned it into a fritter.  The live scallop cost me $24 but its worth it.  Highly recommended.", "rating": 4, "date": "2011-01-30"}, {"excerpts": ["I was given regular tuna & yellowtail which he assumed I wanted after asking me if I liked that - which I said, \"Yea...h I suppose.", "\"\n"], "author": "Heather W.", "review": "Service is good - that was the best part, sadly.\nThe food is overpriced. Food tasted fine. There are other Sushi restaurants with better food & pricing & portion sizes.\nThe Chef's Special Roll was nothing special - even if I mentioned that Salmon is one of my favorite & I preferred white tuna than regular, both of which did not show up in my \"special\" roll. I was given regular tuna & yellowtail which he assumed I wanted after asking me if I liked that - which I said, \"Yea...h I suppose.\"\nOn that note the other \"Family Affair Roll\" I ordered was similar portion-wise, so that tells me that the \"Chef's Special Roll\" DEFINITELY was NOT worth $15.00!\nWorse of all, me & my daughter experienced an dull ache in the stomach afterward as if the food wasn't clean... I know this could be an isolated case, but I wanted to note that anyway.\nWe were polite & didn't say anything - I regret that. This review wouldn't even surface actually if not for the stomach ache we experienced. I feel indignant that there is bodily discomfort which prompted this review.\nIt was more like the more you think about what you were served, the more it was frowned upon ESPECIALLY with the \"Chef's Special Roll\" which was a custom ordered item with what the customer wanted. I didn't get my salmon nor my white tuna - totally INCONSIDERATE...!!!", "rating": 2, "date": "2011-04-15"}], "salmon  avocado": [], "asparagus": [{"excerpts": ["We also ordered a standard Philadelphia roll, shrimp and crab roll, and a shrimp and asparagus roll. "], "author": "Marissa F.", "review": "Fast service, cozy environment, and reasonable prices for being so close to touristy Union Square. \n\nLion King roll: BF gave it a 5/5. The combo of warm crab, lemony goodness from the salmon, and melted mozzarella cheese was a delicious change from the cold rolls he ordered.\n\nYum Yum roll: A 5/5 from me! So crunchy and so yum yum. The sauces and crunch added to the cool taste of avocado and crab. \n\nWe also ordered a standard Philadelphia roll, shrimp and crab roll, and a shrimp and asparagus roll. The three were a bit small but still good and fresh-tasting. \n\nI'm sure we'll be back again, Sushi Toni! I look forward to visiting again.", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["We also ordered an asparagus roll, which was the best roll we ordered (not saying much). \n\n"], "author": "Josiah L.", "review": "Don't know why they have such good reviews. Perhaps for their plates, but their rolls are subpar at best. \n\nWe ordered a Dynamite Boom roll, and it came with both avacodo and fish, which were not listed as ingredients (it was supposed to be squid, octopus, mussel, and shrimp). In addition, my wife can't eat fish, and I'm allergic to avacodo. Furthermore, the fish was not fresh at all; it tasted rotten! Definitely a shady practice sneaking old fish into a roll (with lots of sauce to hide it). Later they said it was part of their \"secret recipe\" sauce. \n\nThey acted as though they would take it off our bill, but still charged us $3.70 for it!\n\nWe ordered a spider roll, which didn't taste great, but wasn't as bad as the first. We also ordered an asparagus roll, which was the best roll we ordered (not saying much). \n\nIt's one thing to have subpar rolls, but it's absolutely unacceptable to change the ingredients in an order.\n\nWe felt sick to our stomachs afterwards. \n\nFor a four-star comparison, try Aniki's Sushi, in Fremont.", "rating": 1, "date": "2015-07-17"}], "salmon skin": [{"excerpts": ["it's made of salmon and salmon skin. ", "When it came we were kind of surprised. ", "The salmon skin was inside the roll and the top of the salmon was topped with 2 popping balls. "], "author": "Amy Y.", "review": "I came here with my boyfriend around 9:30 pm. When we got there we got seated pretty quickly. I had to wait in line at the bathroom. There is one bathroom and it is unisex, it was pretty clean. I give kudos to places with clean restaurants. Anyways I came out and they asked if I was ready to order. The green tea there is good, except the service of waiter/wAitress is slow. I don't like places where I have to constantly call them to refill my tea. At any location, on average I can drink 7-8 cups of tea if not more. So at this location I only drank 2 cups and I had to request one time which is kind of disappointing. Anyways, we ordered 3 rolls California, Hannukah, and family affair. The California came wkrh6 pieces, overall it was great. The only thing was that the wasabi was not that strong, it was very under powered and eating a scoop is completely doable. Next came the family affair roll, wow it looked like a master piece of artwork. I really enjoyed taking pictures of it, the taste was unique as the top was spicier than the wasabi. I loved the sprouts on top, I felt like it was very well made. Next, we wanted to try another roll and my bf picked Hannukah it's made of salmon and salmon skin. When it came we were kind of surprised. The salmon skin was inside the roll and the top of the salmon was topped with 2 popping balls. I felt like it was very interesting, but the taste was a bit too strong for me, it was a little too salty. \n\nOverall if you ask me, I suggest iyakaza ninja that is a block away for some better sushi.", "rating": 2, "date": "2016-04-16"}, {"excerpts": ["The only other note I have for this place is that the salmon skin here is a little bit strange. ", "It's kind of chewy and not very crispy. ", "Otherwise, if you've got money to spend, the other rolls here are pretty decent."], "author": "Andrew S.", "review": "I came with my parents a month ago and sat at the sushi bar. The rolls here are very clean and good-tasting, but the quantity of food you get for the price is lacking. The three of us spent about $55 for four rolls, but we were nowhere near finished matching our appetite. We closed our bill and walked to Great Eastern Restaurant in Chinatown to finish our meal.\n\nThe only other note I have for this place is that the salmon skin here is a little bit strange. It's kind of chewy and not very crispy. Otherwise, if you've got money to spend, the other rolls here are pretty decent.", "rating": 4, "date": "2015-04-12"}, {"excerpts": ["Then came the Hannukah roll, an salmon skin cut roll (\"circumcision roll\"?) topped with smoked salmon and salmon roe. ", "If you like salmon, this is the one for you. "], "author": "Jackson G.", "review": "I came here at 10:30pm on a Monday night. The place was empty except for a large party which probably thought they would be the ones to close Sushi Toni out. They were mistaken; no one is later than I.\n\nThe dining area is divided between the large main section and the bar, which has a few tables situated nearby. My girlfriend and I sat at a table by the bar and promptly ordered:\n- a large Kirin\n- a small carafe of hot sake (I didn't check the name)\n- miso soup\n- nigiri: sake, maguro, hamachi\n- special rolls: Hannukah, Volcano\n\nThe service was speedy and the waitress friendly. The hot sake was piping. Mm.\n\nThe nigiri was fresh, and the cut size larger than average, which is rare for a sushi joint; in my experience, the restaurants serving large pieces of fish are compensating for poor quality. Sushi Toni is the exception and their hamachi nigiri is especially good.\n\nThen came the Hannukah roll, an salmon skin cut roll (\"circumcision roll\"?) topped with smoked salmon and salmon roe. If you like salmon, this is the one for you. Crunchy skin, smokey fish, and that creamy texture of rice and bursting roe.\n\nFinally, the Volcano roll, served on a hot plate. Baked crab, avocado, tobiko, 2 kinds of sauce, and green onion. This one was tasty, and it was good to finish on a hot dish. The crab was plentiful -- definitely the centerpiece of the roll. It was a bit heavy with the sauce, which was sweet, spicy, and thick. Good, though.\n\nI would return to Sushi Toni to test the limits of their fish and to explore some of their special rolls, of which they seem to have many.", "rating": 4, "date": "2013-08-20"}, {"excerpts": ["I order the saba nigiri, albacore nigiri, Hanakah roll (salmon skin, smoked salmon, Ikura), and Swamp roll (wakame salad and spicy tuna). ", "Everything was excellent. ", "The chef/owner also wanted us to try his special miso soup. ", "They just got their liquor license a few days ago, and sake and soju are on their way. ", "I can't wait to try their cocktail concoctions!"], "author": "Lily T.", "review": "Sushi Toni is located at what was formerly Sushi Man. The current owner also previously owned Tempura House around the corner, which is now replaced by Mari Sushi. Sit by the sushi bar, and he will make sure you feel right at home. I don't know if that's his personal style, but that's the thing with newly opened businesses: the service is usually extraordinary. He's an avid green tea drinker, so you can strike a conversation with him on that!\n\nI order the saba nigiri, albacore nigiri, Hanakah roll (salmon skin, smoked salmon, Ikura), and Swamp roll (wakame salad and spicy tuna). Everything was excellent. The chef/owner also wanted us to try his special miso soup. They just got their liquor license a few days ago, and sake and soju are on their way. I can't wait to try their cocktail concoctions!", "rating": 5, "date": "2009-08-04"}], "shrimp  crab": [], "eel  avocado": [], "salmon  yellowtail": [], "philadelphia": [{"excerpts": ["Philadelphia and Volcano rolls - Average. \n\n"], "author": "Ee Vonn Y.", "review": "Interior - Moist, attacked by bugs throughout my meal.\n\nPortions - Small; Yellowtail and salmon sashimi looked twice as large on Yelp than in person. \n\nPhiladelphia and Volcano rolls - Average. \n\nService - Good. They reheated the hot sake for us when it got cold.", "rating": 3, "date": "2016-08-03"}, {"excerpts": ["Then had a Philadelphia roll and a swamp roll. ", "Everything was ok, nothing to write home about. ", "Rolls were on the small side ", "and I left still hungry (average appetite, not a huge eater) ", "Everyone in the restaurant was friendly and attentive plus it was very clean (including the restroom!). ", "There's an interesting adult venue next door if that's your thing. ", "We walked but I imagine parking would be tricky."], "author": "Mysti R.", "review": "We started with green salad, gyoza, and edamame. Then had a Philadelphia roll and a swamp roll. Everything was ok, nothing to write home about. Rolls were on the small side and I left still hungry (average appetite, not a huge eater) Everyone in the restaurant was friendly and attentive plus it was very clean (including the restroom!). There's an interesting adult venue next door if that's your thing. We walked but I imagine parking would be tricky.", "rating": 3, "date": "2017-02-12"}, {"excerpts": ["We also ordered a standard Philadelphia roll, shrimp and crab roll, and a shrimp and asparagus roll. "], "author": "Marissa F.", "review": "Fast service, cozy environment, and reasonable prices for being so close to touristy Union Square. \n\nLion King roll: BF gave it a 5/5. The combo of warm crab, lemony goodness from the salmon, and melted mozzarella cheese was a delicious change from the cold rolls he ordered.\n\nYum Yum roll: A 5/5 from me! So crunchy and so yum yum. The sauces and crunch added to the cool taste of avocado and crab. \n\nWe also ordered a standard Philadelphia roll, shrimp and crab roll, and a shrimp and asparagus roll. The three were a bit small but still good and fresh-tasting. \n\nI'm sure we'll be back again, Sushi Toni! I look forward to visiting again.", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["We ordered the Crunchy Roll, which was in the shape of a star (bonus points for awesomeness), a Philadelphia Roll and a Volcano Roll.\n\n"], "author": "Molly M.", "review": "During our most recent visit to San Francisco, I was seriously craving some legitimate sushi. Sushi Toni was just a couple of streets up from where we were staying, so weren't in.\n\nThe place is cozy, but not cramped, and has a nice, small bar area, which is where we sat. The servers and the chefs were all very nice and fast to deliver. \n\nWe ordered the Crunchy Roll, which was in the shape of a star (bonus points for awesomeness), a Philadelphia Roll and a Volcano Roll.\n\nFirst of all - everything was SO fresh! From the rice, to the fish and crab to the ginger. Potions were perfectly sized and everything was uniquely crafted. Also, I was really enjoying watching the chefs prepare everything - plus, they're hilarious.\n\nIf you're in the area and want some good, late-night sushi, this place is where its at.", "rating": 5, "date": "2015-01-15"}, {"excerpts": ["We had a volcano roll, shrimp roll, philadelphia roll, and rainbow roll, all of which were good...especially the rainbow roll!  ", "The mizo soup was also good and only $2!  ", "Service was great.  ", "Definitely worth a stop."], "author": "Jesse M.", "review": "Sushi was good and prices are pretty good too.  We had a volcano roll, shrimp roll, philadelphia roll, and rainbow roll, all of which were good...especially the rainbow roll!  The mizo soup was also good and only $2!  Service was great.  Definitely worth a stop.", "rating": 4, "date": "2015-10-26"}, {"excerpts": ["We ordered the dragon roll, crunchy spicy tuna, and the philadelphia and were very pleased. ", "And saki bombs are always good times."], "author": "Ann A.", "review": "Really yummy, cute little sushi place. The cooks are really friendly. The rolls are a little on the large side though, which make if uncomfortable to eat, but if you're okay with getting a little messy then it's perfect. We ordered the dragon roll, crunchy spicy tuna, and the philadelphia and were very pleased. And saki bombs are always good times.", "rating": 4, "date": "2011-06-04"}, {"excerpts": ["For the Rainbow Roll, Unakyu Maki roll, Tuna Sashimi, and philadelphia roll plus 2 orders of mochi's it "], "author": "Anthony J. C.", "review": "Staff is super friendly and there's live music here from 8:30 pm-11pm I think.\n\nFor the Rainbow Roll, Unakyu Maki roll, Tuna Sashimi, and philadelphia roll plus 2 orders of mochi's it came out to about $45, so prices aren't too high. \n\nI'll eat Sushi to Beyonce and Bob Marley anyday", "rating": 4, "date": "2009-10-07"}], "tuna  avocado": [], "tamago": [{"excerpts": ["My friend and I shared the Dynamite boom roll ($12.5), the Dragon roll ($14.5), and Tamago ($4). ", "I really liked the dynamite roll, which had unagi, lobster, and a bunch of other things topped with a nice spicy sauce. ", "It was my first time having tamago, which is suppose to be sweet dish. ", "The egg block tasted sweet but we are suppose to still dip it in soy sauce and wasabi. "], "author": "Wendy F.", "review": "Tasty Japanese food in Downtown! \n\nFOOD: My friend and I shared the Dynamite boom roll ($12.5), the Dragon roll ($14.5), and Tamago ($4). I really liked the dynamite roll, which had unagi, lobster, and a bunch of other things topped with a nice spicy sauce. It was my first time having tamago, which is suppose to be sweet dish. The egg block tasted sweet but we are suppose to still dip it in soy sauce and wasabi. Not bad though. \n\nSERVICE: We came in a party of 8 and the staff worked hard to bring all of our dishes out in a timely fashion, which I really appreciated. \n\nSETTING: The restaurant is pretty small and doesn't look too fancy. It's located on one of the hills close to Union Square, so any time you are craving for Japanese food you know where to go.\n\nPRICE: With tip and tax we each paid around $18. Japanese food is suppose to be pricey so I wasn't too surprised. \n\nOVERALL IMPRESSION: Pretty good sushi, but I think I had better quality and quantity food back home in Texas so my standards are pretty high.", "rating": 3, "date": "2015-06-21"}, {"excerpts": ["In addition to the typical hamachi, maguro, ebi, tamago, sake, I also got walu and saba. ", "Oh and they sprinkled furikake on my rice. "], "author": "Beverly T.", "review": "I went back for the chirashi and it was actually pretty awesome. The portion was decent and most of the fish were fresh. What I liked the most was the variety. In addition to the typical hamachi, maguro, ebi, tamago, sake, I also got walu and saba. Oh and they sprinkled furikake on my rice. Yum! \n\nSide note: Apparently my friend Josh's uncle owns this place. HOOK IT UP UNCLE TONI!", "rating": 4, "date": "2012-06-27"}], "inari": [{"excerpts": ["the albacore sashimi, sweet egg, and inari are all delicious! ", "And the service is amazing...", "they helped me charge my iPhone "], "author": "Anna L.", "review": "Love this place! The first time I went was almost 11 pm and I was so tired...forgot the place name but remember delicious, high quality and reasonably priced sushi...\n\nAnd this time in San Francisco, I am craving for sushi so I yelped this place. The moment I went in, I was like ---I have been here...this is the place!!!\n\nThe fish is fresh and delicious, rolls are super good and the chef don't judge me when I order California roll...the albacore sashimi, sweet egg, and inari are all delicious! And the service is amazing...they helped me charge my iPhone and it was such a life saver.\n\nThank you so much chef for the amazing sushi, will be back every time in SF!!!", "rating": 5, "date": "2014-07-05"}, {"excerpts": ["I also got the Veggie Tempura and Inari (tofu) nigiri - which was more like a cake wrap. ", "Everything I had was really fresh and tasty. ", "The waitresses were also really nice and the chefs were humble ", ":) ", "I ended up ordering more after eating what I had first "], "author": "Lucy L.", "review": "I was looking for some good cheap sushi and found it here! \n\nThe Kappa Maki was absolutely delicious (and only $3). I also got the Veggie Tempura and Inari (tofu) nigiri - which was more like a cake wrap. Everything I had was really fresh and tasty. The waitresses were also really nice and the chefs were humble :) I ended up ordering more after eating what I had first I couldn't resist! \n\nWorth the visit for a nice relaxed quick feed.", "rating": 5, "date": "2011-08-21"}], "shiromaguro": [], "kanikama": [], "tai": [{"excerpts": ["Sakura Tai and Hotate like candy."], "author": "T V.", "review": "Best sushi I've had in a long time. Real attention to detail with subtle and delicious sauces. Very fresh, very high quality ingredients. Sakura Tai and Hotate like candy.", "rating": 5, "date": "2017-01-10"}], "smoke salmon": [], "amaebi": [], "mackerel": [], "steamed octopus": [], "squid": [{"excerpts": ["We ordered a Dynamite Boom roll, and it came with both avacodo and fish, which were not listed as ingredients (it was supposed to be squid, octopus, mussel, and shrimp). ", "In addition, my wife can't eat fish, and I'm allergic to avacodo. ", "Furthermore, the fish was not fresh at all; it tasted rotten! ", "Definitely a shady practice sneaking old fish into a roll (with lots of sauce to hide it). "], "author": "Josiah L.", "review": "Don't know why they have such good reviews. Perhaps for their plates, but their rolls are subpar at best. \n\nWe ordered a Dynamite Boom roll, and it came with both avacodo and fish, which were not listed as ingredients (it was supposed to be squid, octopus, mussel, and shrimp). In addition, my wife can't eat fish, and I'm allergic to avacodo. Furthermore, the fish was not fresh at all; it tasted rotten! Definitely a shady practice sneaking old fish into a roll (with lots of sauce to hide it). Later they said it was part of their \"secret recipe\" sauce. \n\nThey acted as though they would take it off our bill, but still charged us $3.70 for it!\n\nWe ordered a spider roll, which didn't taste great, but wasn't as bad as the first. We also ordered an asparagus roll, which was the best roll we ordered (not saying much). \n\nIt's one thing to have subpar rolls, but it's absolutely unacceptable to change the ingredients in an order.\n\nWe felt sick to our stomachs afterwards. \n\nFor a four-star comparison, try Aniki's Sushi, in Fremont.", "rating": 1, "date": "2015-07-17"}, {"excerpts": ["Found the squid rolls to be a bit tough. ", "LOVED the volcano rolls but the romeo and juliet was not for me. ", "Got take away a second time. ", "The girl remembered my gluten intolerance and that I had liked the volcano rolls. ", "Tried the lion rolls this time and the shrimp rolls both were lovely! ", "Fresh fish, lovely flavours and friendly service"], "author": "Heather R.", "review": "The first time I went here they were very helpful about gluten free options. Found the squid rolls to be a bit tough. LOVED the volcano rolls but the romeo and juliet was not for me. Got take away a second time. The girl remembered my gluten intolerance and that I had liked the volcano rolls. Tried the lion rolls this time and the shrimp rolls both were lovely! Fresh fish, lovely flavours and friendly service", "rating": 4, "date": "2013-03-09"}], "surf clam": [{"excerpts": ["I especially liked how they included two pieces of the Arctic surf clam (hokkigai), something I've very much enjoyed in the past but haven't ordered much of recently.  "], "author": "H K.", "review": "I'll say this place is 3.5+ stars.  I've bookmarked this place a long time ago, to the point where it's second from the bottom of my list.  I finally went there a week and a half ago on the Wednesday evening prior to a Chicago concert at the Masonic Auditorium two blocks uphill from here.  The chirashi was pretty good as far as the variety of sushi it contained.  I especially liked how they included two pieces of the Arctic surf clam (hokkigai), something I've very much enjoyed in the past but haven't ordered much of recently.  The sushi rice could use more vinegar taste that's associated with it though.\n\nI also liked the hostess that was serving that evening.  She's so nice, sweet, and cute.  She may be reason alone for me to make the effort to return there. =)", "rating": 4, "date": "2013-08-17"}], "scallop": [{"excerpts": ["* Romeo & Juliet roll - 3.5 stars\npic: http://www.yelp.com/biz_photos/sushi-toni-san-francisco?select=VmapT0TjLtfx5lmc2BPcfA#rPDS6zkIM16WF_au9zD92g\n(soybean paper with salmon & avocado, scallop outside with tobika. ", "$9.95)\n"], "author": "Ziyan C.", "review": "Not a bad spot, not super memorable either. They use quality ingredients, the rice is sticky and soft.\n\nTotal $33 including tax/tip, for a light dinner for two.\n\n* Romeo & Juliet roll - 3.5 stars\npic: http://www.yelp.com/biz_photos/sushi-toni-san-francisco?select=VmapT0TjLtfx5lmc2BPcfA#rPDS6zkIM16WF_au9zD92g\n(soybean paper with salmon & avocado, scallop outside with tobika. $9.95)\nI love salmon + avocado, and this had a hint of sweet flavoring.\n\n* Single Sushi combo A ($15.50)\npic: http://www.yelp.com/biz_photos/sushi-toni-san-francisco?select=VmapT0TjLtfx5lmc2BPcfA\nJust tried a piece of nigiri, and it was good! Can't really rate the whole thing based on one little piece but my friend enjoyed it and it's his go-to dish here.", "rating": 3, "date": "2013-05-18"}, {"excerpts": ["The thin slices of scallop on top was slightly sweet in flavor. ", "Def. ", "a nice surprise. \n", "3. "], "author": "Grace C.", "review": "Ambiance: Casual sushi place with (PG) anime character pictures hung around the wall. Friendly waitresses. \n\nOrdered:\n**Free hot tea!\n1. 49er-  lemon slices on top of sushi. The zest goes well with the salmon. \n2. Romeo and Juliet Roll- Def. worth a try. The thin slices of scallop on top was slightly sweet in flavor. Def. a nice surprise. \n3. Rainbow Roll- Tasty if you like shrimp tempura rolled inside of it. \n\nPrices are decent for the quality and quantity of sushi that you get.", "rating": 4, "date": "2012-01-04"}, {"excerpts": ["Nonetheless, i loved the salmon, avocado, and scallop combo."], "author": "Samantha L.", "review": "It's a cute and small sushi bar located in a very busy area. I'm not sure why i even considered trying to find parking at peak hours in Union Square area! I'm not normally a fan of sushi, especially sashima, but i easily ate myself through many rolls which ultimately sorted out to $35 per person. That's A LOT of sushi, no?!\n\nThe memorable sushi:\n\nLion King Roll: it combines crab, avocado, and baked salmon topped with melted cheese. I'm on the fence about combining the cold ingredients with the warm baked salmon... but it all somehow worked.\n\nRomeo & Juliet: My first taste of soybean paper! I can't actually tell any difference between soybean paper and traditional seaweed paper. Nonetheless, i loved the salmon, avocado, and scallop combo.", "rating": 3, "date": "2011-03-28"}, {"excerpts": ["The R&J roll was salmon, rice and avocado wrapped in soybean paper topped with a large scallop in a light eel sauce. ", "It was really really good! ", "I loved it!  "], "author": "Sandy G.", "review": "More like 3.5 stars. The inside of the restaurant is pretty small so we decided to order food to go and eat it back at the hotel. Tried the beef teriyaki combo-$18. Steak was on the thin side and a little tough, prob due to being overcooked. The tempura it came with was nice and crunchy. The 5 piece Calif. roll that was included was really good, tasted creamy. Imitation crab was used. Also ordered two rolls- the Naruto roll $14 and Romeo & Juliet roll $12.50. The R&J roll was salmon, rice and avocado wrapped in soybean paper topped with a large scallop in a light eel sauce. It was really really good! I loved it!  The Naruto roll is a no rice roll wrapped in cucumber. It was very bland. Tasted like the fish had been frozen and defrosted, there was no flavor whatsoever. This roll was 5 pieces and definitely not worth the $14.", "rating": 3, "date": "2014-07-24"}, {"excerpts": ["Ordered the Romeo & Juliet (Scallop), Crunch Roll, a couple pieces of sushi, and asked the chef to make me \"something special\" (and it WAS).  "], "author": "Matt G.", "review": "Nothing glamorous here.  But, man, is the sushi fresh, creative and good.  Ordered the Romeo & Juliet (Scallop), Crunch Roll, a couple pieces of sushi, and asked the chef to make me \"something special\" (and it WAS).  Delicious meal, maybe a little bit expensive but not the run of the mill sushi place.\n\nWould recommend....", "rating": 4, "date": "2010-04-22"}, {"excerpts": ["Believe it was scallop and salmon.\n\n"], "author": "Nhung T.", "review": "I went here based upon glancing at the overall rating. When I entered the restaurant, I got really curious and started to read further into the reviews and oh boy it wasn't what I have expected. So I decided to order a large sake and just one roll, romeo and Juliet (read it on yelp). Can't go wrong with sake but the roll was just okay for me, it was actually fishy. Believe it was scallop and salmon.\n\nThere's nothing special about the menu.", "rating": 2, "date": "2012-01-03"}, {"excerpts": ["Spicy tuna handroll-average-not spicy at all and on the pricey side ( 6.50 )\nSpicy scallop handroll-ok ( 6.50 )\nSpider roll- good\n", "Lion King "], "author": "Lizete S.", "review": "We came here for lunch.  The service was ok and overall the food was average..nothing really spectacular.\n\nWe had the following:\nSpicy tuna handroll-average-not spicy at all and on the pricey side ( 6.50 )\nSpicy scallop handroll-ok ( 6.50 )\nSpider roll- good\nLion King roll-ok\nCrunch roll-very good\n\nOur drinks were served in a timely manner even though our food took awhile.  We were the only ones in the restaurant and surprised it took so long. The hot sake was ok and the hubby had a large Asahi.   For a meal costing $67 we've definitely had better elsewhere.", "rating": 3, "date": "2010-10-02"}, {"excerpts": ["\"Spicy scallop please!", "\"\nToni: \"Eh no no. ", "I have fresh scallop today. ", "Even better.", "half filled with scallop nigiri..  ", "half filled with dipping sauce.. ", "Then they took the left over scallop trimmings, sliced it with some veggies and turned it into tempura.  \n\n"], "author": "Beatrice T.", "review": "Great portions, quality fish, FAST service (not one of those bars where the chef is overworked and you can only order one piece every 10 minutes), and a very warm inviting atmosphere.  May not be the best sushi I've had... but still very good and I will definitely be visiting Toni again.  He's friendly, funny, and knows how to show his customers a good time.  A great first visit. \n\nMe: \"Spicy scallop please!\"\nToni: \"Eh no no. I have fresh scallop today. Even better.\"\n\nAs we finished our miso soup a lovely open shell arrived.. half filled with scallop nigiri..  half filled with dipping sauce.. Then they took the left over scallop trimmings, sliced it with some veggies and turned it into tempura.  \n\nToni: \"Good?\"\nMe: Good. \n\nThe scallops were fresh, although sliced a little too thin for my taste, and I personally do not like lemon slices with my fish but can't deny good craftmanship and quality. \n\nA few more minutes.. down came a platter of salmon sashimi.  I prefer the fatty buttery melt-in-your mouth pieces.  Toni gives you the cleaner slices that have a nice bite to them.  Personal preference. \n\nWhite tuna appetizer platter next. Very nice presentation of colors. My favorite plate of the evening, when I generally don't even care for tuna. Great texture with the fish ever so lighty brushed with a blow torch. Flavor was fab. \n\nToni: \"Good?\"\nMe: \"MMHMMM!\"\n\nLion king and dragon roll followed.  The sashimi portions were so large that my date and I were struggling already.  Dragon roll was standard but lion king had a nice twist using mozeralla cheese instead of just the mayo-based sauce.  \n\nCatching on to my loyalty to rich fatty goodness.. Toni treated us to some black sesame ice cream which was one of the best I've had.  \n\nToni :\"OOH. I don't need to ask.  She likes this one\"\nDate: \"Yea.. it's gone and I've only had one bite.\"\nMe: \"nom nom nom.\"\n\nA shot of saki and $75 bucks later (pre-tip).. we were in a good place.. stuffed and waiting for our tummies to settle so we could devour our leftovers.", "rating": 4, "date": "2009-09-05"}, {"excerpts": ["I tried the Scallop and Tuna sushi ", "and it was excellent.  ", "I had the green tea which was refreshing and apparently comes with every meal.  ", "I also had some kind of Monk fish that had been marinating in Saki for a few hours and then boiled.  "], "author": "Jason D.", "review": "Like all the other reviews, the place has a nice, upgraded atmosphere.  The wait service was beck and call and the owner Toni was behind the sushi bar.  I chose this place mainly on the review and glad they were here to make my night for sushi decision.\n\nThe sushi was very fresh as the owner Toni promised.  I tried the Scallop and Tuna sushi and it was excellent.  I had the green tea which was refreshing and apparently comes with every meal.  I also had some kind of Monk fish that had been marinating in Saki for a few hours and then boiled.  I also got to try he shiitake mushrroms Brandy tried and was awesome.\n\nI would highly suggest giving it a try if you live in the area or visiting from out of town.  You wont be dissapointed!", "rating": 5, "date": "2009-08-17"}, {"excerpts": ["The sushi chef then recommended the live scallop to me.  ", "He said that they only get some like once a month.  ", "I thought \"what the heck", "\" so I went ahead and got it.  ", "Its not just one piece of scallop over sushi rice", ", it is a huge scallop sliced into strips so that you end up with like 8 pieces of sushi.  ", "Then they took out the muscle around the scallop, mixed it with some onions, and turned it into a fritter.  ", "The live scallop cost me $24 but its worth it.  ", "Highly recommended."], "author": "Al C.", "review": "2nd time here on a business trip to SF.  The staff and sushi chefs are pretty friendly.  I ordered the usual sushi fare.... salmon, yellowtail etc.  I was impressed by their uni as it was nice and creamy and no fishy taste at all.  The sushi chef then recommended the live scallop to me.  He said that they only get some like once a month.  I thought \"what the heck\" so I went ahead and got it.  Its not just one piece of scallop over sushi rice, it is a huge scallop sliced into strips so that you end up with like 8 pieces of sushi.  Then they took out the muscle around the scallop, mixed it with some onions, and turned it into a fritter.  The live scallop cost me $24 but its worth it.  Highly recommended.", "rating": 4, "date": "2011-01-30"}, {"excerpts": ["Yelp reviewers rave about the Romeo and Juliet roll (salmon and avocado wrapped in soybean paper, topped with scallop) and I have to concur. ", "They're also able to make spicy scallop handrolls, which are a favorite of mine ever since I moved to SF. ", "Basic maki rolls range from $4.50-$6.50 and specialty rolls are on average $9-$10. ", "Everything is rolled well and made with quality ingredients. ", "If you're looking for an affordable sushi dinner, this is the place to go"], "author": "Larisa J.", "review": "Their maki rolls are creative, tasty and affordable. The 49er roll (tobiko, siso, avacado topped with salmon and a lemon wedge) tastes just as good as the salmon citrus roll at Michelin rated Sushi Ran. I'm a huge fan of seaweed salad, so the fact that I can get it over a spicy tuna roll and call is a Swamp roll is pretty perfect. Yelp reviewers rave about the Romeo and Juliet roll (salmon and avocado wrapped in soybean paper, topped with scallop) and I have to concur. I like the Family Affair roll (tuna, white tuna and cucumber) even though they get a little carried away with the white and green onion garnish on top. The Red Dragon and Crunch rolls are also worth trying out. They're also able to make spicy scallop handrolls, which are a favorite of mine ever since I moved to SF. Basic maki rolls range from $4.50-$6.50 and specialty rolls are on average $9-$10. Everything is rolled well and made with quality ingredients. If you're looking for an affordable sushi dinner, this is the place to go", "rating": 4, "date": "2013-03-27"}, {"excerpts": ["The live scallop roll, with live scallop tempura, and live scallop liver was amazingly delicious and fresh.\n\n", "nothing surpassed in luscious lip-smacking succulent flavor-fullness the live scallop items.\n\n", "($25 of that was the live scallop)."], "author": "Jan M.", "review": "We had a small feast here. The live scallop roll, with live scallop tempura, and live scallop liver was amazingly delicious and fresh.\n\nThe Romeo & Juliet Roll was one of the most beautiful flavor combinations I've had. The Caterpillar Roll with fresh juicy avocado was also delicious, but nothing surpassed in luscious lip-smacking succulent flavor-fullness the live scallop items.\n\nBetween three hungry dudes, it ended up being about $100, which was pretty reasonable. ($25 of that was the live scallop).", "rating": 5, "date": "2011-07-30"}, {"excerpts": ["live scallop nigiri, soup w/ shrimps head, ", "tempura of said shrimp's body, a fair amount of very good nigiri, collarbone of hamachi and black sesame ice cream.  ", "what's holding me back from going the full 5 stars is that i've had better fish in the city, namely sebo.  ", "not to say there's anything bad going on here.  "], "author": "Swarup B.", "review": "almost a 5 star but not there yet.\n\nwent here w/ my buddy for lunch on my b-day and found out that sushi toni's had only been open for a month or two.  we sat down at the bar and decided to go omakase.  what came next were a plethora of items.  live scallop nigiri, soup w/ shrimps head, tempura of said shrimp's body, a fair amount of very good nigiri, collarbone of hamachi and black sesame ice cream.  what's holding me back from going the full 5 stars is that i've had better fish in the city, namely sebo.  not to say there's anything bad going on here.  in fact, it's pretty damn good.\n\ntoni was working the bar and we had a great time just talking and hanging with him.  not sure of the attention time we'd get w/ him at peak time but it was just right especially on my b-day.", "rating": 4, "date": "2009-11-08"}, {"excerpts": ["Ask for the live scallop if they have it, it is DELICIOUS! ", "The waitresses are very attentive and always quick to bring me refills. ", "There's a new younger one who doesn't look asian ", "but she is GORGEOUS. ", "Sometimes I can get her to take a shot with me, which is awesome. ", "It's a great place for celebrations ", "and I see a lot of groups stopping in before they go clubbing. ", "but I would recommend calling ahead if you're bringing a big group or coming on a weekend. ", "Definitely worth the hike up the hill!"], "author": "Rich Q.", "review": "I've eaten here several times and everything about this place keeps me coming back for more. The fish is always fresh, and Tony is a genius with his sushi. He can make pretty much anything you ask for, and rolls are fairly large for what you pay. Ask for the live scallop if they have it, it is DELICIOUS! The waitresses are very attentive and always quick to bring me refills. There's a new younger one who doesn't look asian but she is GORGEOUS. Sometimes I can get her to take a shot with me, which is awesome. It's a great place for celebrations and I see a lot of groups stopping in before they go clubbing. but I would recommend calling ahead if you're bringing a big group or coming on a weekend. Definitely worth the hike up the hill!", "rating": 5, "date": "2011-02-25"}], "tuna": [{"excerpts": ["I got spicy tuna with avocado and cream cheese. ", "And a few avocado rolls. ", "I don't really recommend their edamame. ", "If it wasn't for the load of soy sauce I probably wouldn't have finished it."], "author": "Avi K.", "review": "Good food. Small portions. Nice customer service. I got spicy tuna with avocado and cream cheese. And a few avocado rolls. I don't really recommend their edamame. If it wasn't for the load of soy sauce I probably wouldn't have finished it.", "rating": 4, "date": "2018-09-02"}, {"excerpts": ["We also got a sashimi platter which had a few different types of tuna, yellowtail, and salmon - delicious and healthy!\n\n"], "author": "Maansi D.", "review": "I've been looking for an affordable, good sushi spot and it took a second. A friend of mine recommended Sushi Toni as one of her favorites and I decided to give it a shot. I was not disappointed. The sushi rolls were fantastic! I tried the Red Dragon doll and the Volcano Roll - both were really yummy. We also got a sashimi platter which had a few different types of tuna, yellowtail, and salmon - delicious and healthy!\n\nThe restaurant is no frills, which is fine by me if it means affordable, quality sushi. Our server (who I suspected was the owner) was so nice she even threw in a free dessert for us (also delish).\n\nYou can also BYOB for a corking fee of $15, which is not bad at all.\n\nDefinitely planning on going back- excited to have found our spot!", "rating": 4, "date": "2017-10-19"}, {"excerpts": ["I was feeling hungry and ordered the dragon roll as well as the regular spicy tuna roll. ", "I could actually feel the heat in the spicy tuna roll. ", "I not uncommonly inhaled every last crumb of my food, so it was up to par. ", "A total of $20+ for a meal is on the pricey side, but it is the city and also sushi, and there are not a lot of interesting food options in that area."], "author": "Amy G.", "review": "My friends and I popped into Sushi Toni walking out from an entertaining performance at the Masonic. It helps compose an eclectic row of small businesses, starting with a ritzy and festive looking French hotel, an \"adult theater,\" and then Sushi Toni. Never fear, the poster in the kitchen says Sushi Toni has an \"A\" for hygiene. I was feeling hungry and ordered the dragon roll as well as the regular spicy tuna roll. I could actually feel the heat in the spicy tuna roll. I not uncommonly inhaled every last crumb of my food, so it was up to par. A total of $20+ for a meal is on the pricey side, but it is the city and also sushi, and there are not a lot of interesting food options in that area.", "rating": 4, "date": "2017-12-02"}, {"excerpts": ["We ordered 3 rolls to share: spicy tuna, Yum-Yum and the Lion King roll. ", "We really enjoyed all three rolls. ", "I took pictures of the menu section of all their Special Rolls they make. ", "The menu is as of May 2016. "], "author": "Cynthia L.", "review": "Thanks Yelp for helping us find this little gem of a place. Like others have said, small restaurant space...about 8 small tables and I think there's a small sushi bar area.\n\nWe ordered 3 rolls to share: spicy tuna, Yum-Yum and the Lion King roll. We really enjoyed all three rolls. I took pictures of the menu section of all their Special Rolls they make. The menu is as of May 2016. Prices were pretty good. \n\nThe workers there were quick and efficient. We sat down, ordered, sushi arrived quickly, ate, paid and we were on our way to explore the city. Very pleased with this restaurant and we're glad Yelp led us in the right direction.", "rating": 4, "date": "2016-06-01"}, {"excerpts": ["A lackluster presentation (no effort was put into the slices) and old tough seared tuna were a couple of his choices.\n\n"], "author": "Bo L.", "review": "Got the chef's choice sashimi dinner meal. Soup was from a pre-made packet (plus a few slivers of fresh onion), the salad was drenched in a white dressing, and the \"chef's choice\" was extremely mediocre: A lackluster presentation (no effort was put into the slices) and old tough seared tuna were a couple of his choices.\n\nWith all the sushi options in this town, I won't be back.", "rating": 2, "date": "2017-09-19"}, {"excerpts": ["The regular spicy tuna roll was alright too. \n", "However, my brother got the chicken teriyaki plate and it was super delicious!"], "author": "Laura T.", "review": "I try sushi everywhere I go because I'm an addict but it's been the first time I've been disappointed tasting sushi when traveling. The rolls just weren't that amazing. Got two signature rolls which were pretty mediocre. The regular spicy tuna roll was alright too. \nHowever, my brother got the chicken teriyaki plate and it was super delicious!", "rating": 3, "date": "2016-12-24"}, {"excerpts": ["The spicy tuna hand rolls come as a tuna mince w siracha (no mayo) so they tasted dry. ", "Service was good and we thanked her for working a holiday. ", "Extra star for leaving a Scrooge review on christmas"], "author": "Jenna S.", "review": "Was really expecting better after some of the reviews. Miso was tasty but didn't have any of the tofu or seaweed bits that you want. Cucumber and seaweed salad was partially frozen and swimming in melted water. Veggie tempura arrived w undercooked soggy batter. The rainbow roll was good but much more rice than fish. The spicy tuna hand rolls come as a tuna mince w siracha (no mayo) so they tasted dry. Service was good and we thanked her for working a holiday. Extra star for leaving a Scrooge review on christmas", "rating": 3, "date": "2016-12-25"}, {"excerpts": ["The Family Affair Roll had white tuna on top and red tuna inside. ", "It had sprouts and onions as well on top and was very good and fresh as well. ", "Overall, a nice dinner to relax after walking around all day. ", "A good casual, inexpensive spot for dinner if you're around Market street for dinner and don't want to pay $$$."], "author": "Isabel C.", "review": "Went after a long day at SF Pride! Was cautious that it might be overrun with people after Pride, but we were seated right away. We ordered the Rainbow Roll, a salmon sashimi dinner, and the Family Affair Roll. The Rainbow Roll was interesting because they used a shrimp tempura instead of crab for the inside. Definitely made it more memorable and was very enjoyable, a good twist on the usual Rainbow roll. The salmon sashimi dinner was 9 pieces with a bowl of white rice. We mostly just ate the sashimi by itself and it was very tender and melted in your mouth. Sometimes sashimi is a bit tough and cold, and this was not that, very good indeed. The Family Affair Roll had white tuna on top and red tuna inside. It had sprouts and onions as well on top and was very good and fresh as well. Overall, a nice dinner to relax after walking around all day. A good casual, inexpensive spot for dinner if you're around Market street for dinner and don't want to pay $$$.", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["Red Dragon Roll, tuna roll and edamame. ", "All were great ", "and I'd def recommend this place."], "author": "jordan s.", "review": "Delicious sushi. I got the Rainbow Roll,  Red Dragon Roll, tuna roll and edamame. All were great and I'd def recommend this place.", "rating": 5, "date": "2017-09-28"}, {"excerpts": ["The sushi rice was nicely spiced and adequately sour, and the crab salad and spicy tuna were of better quality than most comparably priced locations.  \n\n"], "author": "Hailey H.", "review": "I have really mixed feelings about this place ... I'll break it out into a few categories. \n\nAtmosphere: 6/10\nThe decor was interesting, weird yellow sponge paint that was a little assaulting to the senses, and an eclectic mix of picture frames filled with images of either animated Japanese schoolgirls, stills from Pokemon, or cuts of fish. The music seemed incongruous as well and featured a mish-mash of late 80's/early 90's one hit wonders. If you like to listen to *slightly too loud for conversation* ABBA, New Radicals and hear \"Come on Eileen\" at least twice in the span of a meal, this is certainly your place. \n\nService: 3/10\nThey seemed genuinely concerned and kept asking how we were and if everything was ok while we were eating our appetizers (miso soup and salad) but that seemed to expire very shortly as it took over 30 minutes for me to receive my SINGULAR roll. My boyfriend however received his Chicken Katsu in about 5 minutes which lead to him picking at it for 25 minutes as it got cold to be polite and wait for me. When I asked the waitress what the deal was, it seemed that she forgot to put the order in, and as soon as she went up to check with the sushi chef it was miraculously ready in seconds. \n\nFood: 8/10\nI was angry eating by the time I received my food, but it was truly very good quality. The sushi rice was nicely spiced and adequately sour, and the crab salad and spicy tuna were of better quality than most comparably priced locations.  \n\nSo if you are an extremely patient ABBA loving sushi connoisseur with a penchant for the color yellow, be sure to hit up this spot. If not ... don't .", "rating": 3, "date": "2016-09-15"}, {"excerpts": ["The tuna and salmon looked brownish as if they were sitting there for days! \n\n"], "author": "Tamara S.", "review": "Came here with my hubby and we didn't even eat! We pretended we got a call and had to urgently leave! \n\nFirst of all the place was dead empty at around 2:30pm. We sat at the bar, and as we looked as the fish in front of us we knew we had to leave. The fish looked old and not all appetizing. The tuna and salmon looked brownish as if they were sitting there for days! \n\nAnd on top of that, the sushi chef was not Japanese! We didn't even wanted to try the food, we just bailed!", "rating": 1, "date": "2015-09-21"}, {"excerpts": ["Spicy Tuna roll (6 pieces) - $7\n", "I know spicy tuna roll, how wow could that get? ", "BUT WOW. ", "it wasn't the can tuna. ", "It was actual cuts of good tuna. ", "It melted in your mouth and they just have a way with their fish. ", "Udon portions are large and the soup warmed me right up. "], "author": "Christina O.", "review": "Korean owned sushi restaurant. Small, and intimate so probably a party of four max. \nHouse warm sake- $4 (S) $6.50 (L)\nSpicy Tuna roll (6 pieces) - $7\nUdon (vegetable and chicken)- $11-13\n\nThe sushi was so fresh. I know spicy tuna roll, how wow could that get? BUT WOW. it wasn't the can tuna. It was actual cuts of good tuna. It melted in your mouth and they just have a way with their fish. Udon portions are large and the soup warmed me right up. It's not the kind of soup where it's just soy sauce and some other spices, it's actual udon soup. \n\nService was great, server asked if he could take the dish with wasabi and ginger. I told him I liked to complement the udon with ginger and right away without me asking, he gave me a side dish of ginger. \n\nDef will be back to try the other rolls and sashimi!", "rating": 5, "date": "2015-08-23"}, {"excerpts": ["I ordered the yum yum roll and the spicy tuna and the spicy tuna was so fresh and had amazing spices, you can tell the fish they get is fresh and the service was awesome!\n\n"], "author": "Jackie H.", "review": "I LOVED this sushi place!! I'm a sushi fanatic so I'm very picky about my sushi, but their rolls were amazing! My sister got the avocado roll (very simple) and said it was the best roll she's ever had\n\nI ordered the yum yum roll and the spicy tuna and the spicy tuna was so fresh and had amazing spices, you can tell the fish they get is fresh and the service was awesome!\n\nWe were in and out of there in no time but they do not rush you at all, I was incredibly pleased with the service there and I will 100% go back.", "rating": 5, "date": "2017-02-19"}, {"excerpts": ["Spicy tuna ordered as hot as you want. ", "I picked #7 in a scale up to 10. ", "Seven Was just about right. ", "I returned to this place, the tuna was out of this world. ", "Ask chef Toni to prepare something special and spicy, you will be amazed. ", "If you're feeling adventurous, in a scale to 10, ask for number 9 spicy tuna."], "author": "Daniel V.", "review": "Spicy tuna ordered as hot as you want. I picked #7 in a scale up to 10. Seven Was just about right. It gave plenty of kick without loosing the flavor.\n\nI returned to this place, the tuna was out of this world. Ask chef Toni to prepare something special and spicy, you will be amazed. If you're feeling adventurous, in a scale to 10, ask for number 9 spicy tuna.", "rating": 5, "date": "2016-01-02"}, {"excerpts": ["Ordered a chirashi bowl, sashimi combo, and spicy tuna hand roll. ", "Sashimi looked and tasted old. "], "author": "Annie L.", "review": "Ugh. Yelp, you have been letting me down a lot lately. This place was disappointing, to say the least, after seeing all these great reviews. Sushi was just not fresh and for the price I paid, I expect it to be decent, at the very least. \n\nOrdered a chirashi bowl, sashimi combo, and spicy tuna hand roll. Sashimi looked and tasted old. Sushi rice in the chirashi wasn't sushi rice. \n\nServer never refilled our drinks or came around once.", "rating": 1, "date": "2013-08-22"}, {"excerpts": ["I ordered the sashimi dinner and decided on albacore tuna.  ", "It came with 9 pieces: 3 seared, 3 belly, 3 body. ", "It didn't taste all that fresh to me, and I wish it was stated on the menu that it was a variety. ", "I would rather not eat albacore seared, ", "but oh well. ", "Another person in my party ordered the 49er roll and it was made with way too much rice. ", "My kids got the California roll and shrimp tempura. ", "California roll was your typical fare, a little on the small side. "], "author": "Char D.", "review": "I hate to give this place 2 stars because the server was completely on top of things, but the sushi was just not that good here. Sushi is definitely one of my favorite foods, but it just didn't make the cut.  \n\nI ordered the sashimi dinner and decided on albacore tuna.  It came with 9 pieces: 3 seared, 3 belly, 3 body. It didn't taste all that fresh to me, and I wish it was stated on the menu that it was a variety. I would rather not eat albacore seared, but oh well. Another person in my party ordered the 49er roll and it was made with way too much rice. My kids got the California roll and shrimp tempura. California roll was your typical fare, a little on the small side. Shrimp tempura was also small and didn't have the flaky panko texture.\n\nWhat I can say about this place is their uni nigiri is perfect. As I stated in my previous reviews, I absolutely LOVE uni. It tasted like it was just caught. \n\nSo they deserve 2 stars. Perfect service, perfect uni. But the sushi was just ok...\n\nTip: This place is really small so I wouldn't suggest it for large groups.", "rating": 2, "date": "2014-08-04"}, {"excerpts": ["It's not really a crunch roll either, they just put the crunchy stuff in the middle of a spicy tuna roll.\n", "The Eel & Avocado Roll was good too.  ", "The eel was pretty good.\n", "My boyfriend had the Red Dragon Roll and that was the best one.  ", "It was flavorful, the tuna was fresh, it was just an amazing roll.  \n\n"], "author": "Stephanie B.", "review": "My boyfriend and I decided to come here since we were in the area and we just Yelped it on my phone.\n\nI did enjoy their sushi, but I feel like it's a hit or miss with what you order.  You'll either get an amazing roll or another which is not great at all.\n\nWe ordered the 49er Roll, which was good.  It's basic so you can't really fail.  \nWe also ordered the Crunch Roll, which was pretty bad.. I thought.  The rice paper that they put on it really just dries the entire roll out.  It's not really a crunch roll either, they just put the crunchy stuff in the middle of a spicy tuna roll.\nThe Eel & Avocado Roll was good too.  The eel was pretty good.\nMy boyfriend had the Red Dragon Roll and that was the best one.  It was flavorful, the tuna was fresh, it was just an amazing roll.  \n\nI don't think I'd come back here because I love the spend money at a place were ALL the sushi is yummy!\n\nOn top of it, it's super small in here and it gets pretty packed.  The service is pretty good, but they're letting their son work there and he's probably like 14 or something.  He spilled my water all over the floor when he was pouring and some on my phone.  It was fine, I just think they shouldn't put that responsibility on a kid.", "rating": 3, "date": "2012-01-08"}, {"excerpts": ["I got like 2-3 pieces of tuna, salmon, and another fish. ", "I also asked for an order of nigiri unagi which they put in the same to go container "], "author": "Tao Tao W.", "review": "2.5 stars - not that impressed at all but i will say that they were very nice and accomodating but food wise NOT IMPRESSED...\n\nWe got the gyoza - standard\n\nI asked for a chirashi sans rice and if you see the picture. It was SO NOT worth $20. I got like 2-3 pieces of tuna, salmon, and another fish. I also asked for an order of nigiri unagi which they put in the same to go container so I'm not sure if they subbed out the other pieces but compared to the normal Chirashi that my fiance got, it was very much on the week side. \n\nNaruto roll also was standard and nothing special. I feel ike they cheated though because they used a piece of soy paper whereas other restaurants usually do not do that.", "rating": 2, "date": "2014-04-01"}, {"excerpts": ["Tuna was uneatable also bad. ", "I can not believe that chief actually put bad smelling fish on the plate. ", "Disgusting."], "author": "Andrew S.", "review": "I've been eating sushi in SF for ten years and Tony was the worst experience so far. \nIf you ran out of sushi options in the city only order baked rolls there.\n\nPhilly roll had fish about to go bad. Tuna was uneatable also bad. I can not believe that chief actually put bad smelling fish on the plate. Disgusting.", "rating": 1, "date": "2015-07-16"}, {"excerpts": ["It all tasted fine and I had some small regret that I didn't try the tuna belly.  ", "Unfortunately, I was already full.  "], "author": "Vinny P.", "review": "Sushi Toni really did the trick for us.  We had just arrived and were looking for a simple light meal and they fit the bill perfectly.\n\nI went with a small order of some sushi and some sashimi.  It all tasted fine and I had some small regret that I didn't try the tuna belly.  Unfortunately, I was already full.  Our server was pleasant and service was quick.\n\nFor a no frills but very enjoyable meal, I recommend Sushi Toni.", "rating": 4, "date": "2014-10-31"}, {"excerpts": ["We tried a spicy tuna roll, the 49er's roll, and the love affair roll. ", "We also tried the chicken teriyaki. ", "It was an overall good experience. ", "However they were all out of tempura ice cream."], "author": "Emma M.", "review": "Most sushi places were packed at 10 on a Saturday night but this was luckily not. We were seated right away and we didn't have to wait long for our food either. We tried a spicy tuna roll, the 49er's roll, and the love affair roll. We also tried the chicken teriyaki. It was an overall good experience. However they were all out of tempura ice cream.", "rating": 4, "date": "2016-07-10"}, {"excerpts": ["Spicy tuna is actually spicy which is great. ", "Thanks."], "author": "Markus S.", "review": "Good, fresh Sushi for a reasonable price. Polite and nice staff. Spicy tuna is actually spicy which is great. Thanks.", "rating": 5, "date": "2016-03-22"}, {"excerpts": ["Their tuna was extra fresh, and he created a special octopus salad for us. ", "They have a good selection of rolls, and I especially like the 49er roll. ", "It was unlike any other 49er roll that I've ever tried. ", "I can't wait to come back here. ", "I feel like this place will quickly become our go-to spot. ", "It's a pretty casual vibe, nothing too fancy. ", "But the food and banter definitely makes up for it."], "author": "Regina L.", "review": "What a great find!! I've been looking for a great sushi spot in the area; unfortunately most of the sushi places are too expensive or a little too touristy. Luckily, our friends recommended that we check out Sushi Toni. Chris, the sushi chef, is incredibly nice and friendly. Ask him what's fresh, and he'll tell you the truth. His rolls are creative and are super tasty; no need for soy sauce! Their tuna was extra fresh, and he created a special octopus salad for us. They have a good selection of rolls, and I especially like the 49er roll. It was unlike any other 49er roll that I've ever tried. I can't wait to come back here. I feel like this place will quickly become our go-to spot. It's a pretty casual vibe, nothing too fancy. But the food and banter definitely makes up for it.", "rating": 5, "date": "2014-02-25"}, {"excerpts": ["The swamp/marsh roll had seaweed salad with spicy tuna, which was too Spicy and didn't compliment the seaweed on top. ", "Perhaps we should have stuck to nigiri. ", "We didn't order any drinks. ", "Just edamame and miso soup. ", "The server was just one lady, very nice and attentive. ", "She gave us extra ginger so thumbs up! ", "Overall a chill place, nothing exquisite but right down the middle good."], "author": "Zara S.", "review": "A-ok. It satisfied the sushi craving. The rolls were interesting but per other yelpers' comments, there was too much rice...and the grains seemed over cooked/a little mushy. The fish was tender, but not enough of it in my opinion. The swamp/marsh roll had seaweed salad with spicy tuna, which was too Spicy and didn't compliment the seaweed on top. Perhaps we should have stuck to nigiri. We didn't order any drinks. Just edamame and miso soup. The server was just one lady, very nice and attentive. She gave us extra ginger so thumbs up! Overall a chill place, nothing exquisite but right down the middle good.", "rating": 3, "date": "2015-10-22"}, {"excerpts": ["My dad got a spicy tuna roll and tuna sashimi. ", "He said the sushi tasted fresh and good too. ", "I would recommend this place to a friend."], "author": "Amber K.", "review": "At first, I was a little bit concerned that this place was empty when I got in. However, the sushi was delicious and decently priced. The place started to get more full of people as the night went on. I got salmon sashimi, a shrimp tempura roll, and a rainbow roll. My dad got a spicy tuna roll and tuna sashimi. He said the sushi tasted fresh and good too. I would recommend this place to a friend.", "rating": 4, "date": "2015-10-24"}, {"excerpts": ["Rainbow Roll (12.50$)\nShrimp tempura with cucumber, tuna, salmon, avocado and himachi\n", "This roll is also a tradition in my family :)\n", "Will definitely recommend to try if you haven't before as well as 49ers ", "Roll "], "author": "Olga B.", "review": "I'm a HUUUUUUUUGE fan of special rolls and any types of raw fish (sashimi) especially, so Susho Toni will be my choice in that area :) \nSashimi is always fresh and tender, yaaaammy!  Can't resist each time I'm here! \nSalmon sashimi is the best! It's not just 2-3 pieces on the plate which make you enjoy your dish longer :)\n\nFOOD:\n\n1. Miso Soup (2$)\nAlways thought that Miso Soup is more like a complementary stuff and should be given to a customer to prepare his tommy for the main part, but seems like it's only my idea. Miso Soup was good enough, delicious and hot - best thing to start with :)\n\n2. Dragon Roll (12.50$)\nCrab, avocado, shrimp tempura cucumber, tobiko and sesame - mmm.. \nI just LOVE all rolls with avocado :)\n\n3. Volcano Roll (8.50$)\nBaked crab with avocado, green onions and spicy sauce - just perfect for those, who are in love with spicy stuff :)\n\n4. 49ers Roll (11$)\nJust tradition :) \nEach time we are going out to sushi place, 49ers will be in the order :)\nSalmon and pieces of lemon on the top - so easy and tasty combination!\n\n5. Spider Roll (8.50$)\nDeep fried soft crab with cucumber, avocado and tobiko. \nI {L O V E} CRAB!!!\nCrab is perfectly cooked each time I'm here.\n\n6. Rainbow Roll (12.50$)\nShrimp tempura with cucumber, tuna, salmon, avocado and himachi\nThis roll is also a tradition in my family :)\nWill definitely recommend to try if you haven't before as well as 49ers Roll :)\n\n7. Dessert - Mochi Ice Cream\nSmall, sweet strawberry ice cream that looks like French Macarons :)\nWas good, but they can start doing bigger portions though.\n\nService was great.\nRecommend.", "rating": 4, "date": "2013-04-05"}, {"excerpts": ["I had salmon sushi and a spicy tuna roll. "], "author": "Cindy B.", "review": "This place has 3 star sushi with super friendly service so I'm giving it an extra star for that. \n\nI had salmon sushi and a spicy tuna roll. All good and the fish tasted pretty fresh, however it was nothing to rave about.\n\nThe ambiance is nothing special either. \n\nPrices were extremely reasonable, which made me happy because it was a fairly cheap sushi dinner. That's another plus to this place.", "rating": 4, "date": "2010-09-15"}, {"excerpts": ["We got the Rainbow Roll, Spicy Tuna, Eel & Avocado, and Salmon & Avocado. ", "the Eel was my favorite, just fantastic, and the other rolls were all good too. ", "It was about $50 for the two of us (4 rolls + 2 beers) which is pretty standard for an SF sushi restaurant, although I thought it was a little high for the look and feel of the place (and for listening to Mariah Carey's greatest hits album). ", "But then again, as I said, the rolls were tasty, and that's what really matters."], "author": "Lindsey B.", "review": "4-stars for this place is spot on- come here for the sushi, not the ambiance! The place is pretty small and a little dirty looking, but the sushi we ordered was surprisingly good. We got the Rainbow Roll, Spicy Tuna, Eel & Avocado, and Salmon & Avocado. the Eel was my favorite, just fantastic, and the other rolls were all good too. It was about $50 for the two of us (4 rolls + 2 beers) which is pretty standard for an SF sushi restaurant, although I thought it was a little high for the look and feel of the place (and for listening to Mariah Carey's greatest hits album). But then again, as I said, the rolls were tasty, and that's what really matters.", "rating": 4, "date": "2014-12-11"}, {"excerpts": ["This time we had the Dragon Roll, Crunch Roll, Spicy Tuna Roll and a Spider Roll.  ", "That's right", ", I am not very adventurous.  "], "author": "brandie y.", "review": "Solid small, unassuming  neighborhood sushi bar that's worth a try.\n\nThis time we had the Dragon Roll, Crunch Roll, Spicy Tuna Roll and a Spider Roll.  That's right, I am not very adventurous.  Having said that, I like what I like, and I like Sushi Toni.\n\nGood food, good sake selection and friendly service.  What's not to like?", "rating": 4, "date": "2013-01-28"}, {"excerpts": ["The combo plate was decent but the sashimi was all tuna and salmon -- and then more tuna and salmon nigiri.  "], "author": "Caroline C.", "review": "Came here with my in-laws who were visiting from LA (where there are plenty of  outstanding sushi restaurants) based on the good reviews on Yelp, but was really disappointed.\n\nService: 2 stars / nice but slow\n- Despite the restaurant only having a couple tables occupied, the waitstaff took pretty long to get our drinks, food, and bussing extra plates off the table.\n\nFood: 1 stars / small portions and way overpriced\n- My in-laws ordered the tempura udon and the $45 sashimi plate.  The tempura udon came with only 1 tiny shrimp tempura, a 3 small veggies.  Most decent Japanese restaurants will at least have 2 shrimp (or a decent sized one).  And if you pay $45 for any one plate, you'd expect to be wowed by the presentation or taste, right?  Neither applied.\n- My husband and I ordered the Sushi/Sashimi Combo Plate and a selection of nigiri, and the Agedashi Tofu.  The combo plate was decent but the sashimi was all tuna and salmon -- and then more tuna and salmon nigiri.  And I'm not a big fan of salmon in the first place. \n\nI really can't imagine how this restaurant has gotten so many good reviews, unless their rolls are out of this world (and we don't typically order rolls).  If you're a true sushi/sashimi fan, you will not like this place.", "rating": 1, "date": "2012-02-19"}, {"excerpts": ["We ordered some of their standard sushi rolls (Dragon, Caterpillar, Spider roll, and Spicy Tuna) and they were just not up to par with other sushi places we've been to. ", "The presentation was good, but the fish ingredients seemed far from fresh. ", "These are fairly standard rolls for SF, so I expected better. "], "author": "Robert M.", "review": "I went with my girlfriend and her parents on a Friday evening. We ordered some of their standard sushi rolls (Dragon, Caterpillar, Spider roll, and Spicy Tuna) and they were just not up to par with other sushi places we've been to. The presentation was good, but the fish ingredients seemed far from fresh. These are fairly standard rolls for SF, so I expected better. This rating would have been lower, but upon remarking that the sushi wasn't that good they gave a free dessert of tempura banana and ice cream. I appreciated that.", "rating": 3, "date": "2015-09-01"}, {"excerpts": ["I also had the white tuna sushi.  ", "Everyone was very friendly.  ", "I would definitely go back."], "author": "Mark B.", "review": "Very good and reasonably priced sushi.  I had the Romeo and Juliet roll based on a recommendation.  It was very good.  So was the Eel and avocado roll.  I also had the white tuna sushi.  Everyone was very friendly.  I would definitely go back.", "rating": 4, "date": "2016-01-14"}, {"excerpts": ["- Sashimi for lunch is only $12.50 choices 2 each, salmon, tuna, & hamachi! "], "author": "Manda Bear B.", "review": "*********************** 672 **************************\n\n        I love their location, next to the adult theater, how cool is that! Their nigiri is the cheapest in town, and decent!  \n\n- Sashimi for lunch is only $12.50 choices 2 each, salmon, tuna, & hamachi! Steal!!!\n\n- Sunomono salad with salmon is good here. \n\n- Spinach Oshitashi - steamed spinach with special house sesame sauce, I like it!\n\n- Dynamite Boom & Lion King rolls, worth to check it out.\n\n          I love the fact Sushi Toni is so casual with TVs for me to watch sport. Service is super nice. Even 1 time, my bestfriend & I came in just to drink Sake and watch the game, they were totally cool with us. + 1 star for service!!!\n\n         They located on the stiff street, don't wear 5 inches heels like me! Eeek!", "rating": 4, "date": "2011-09-13"}, {"excerpts": ["The sashimi was fresh and the tuna roll it came with was filled with so much rice, you would have never known there was tuna in there except for this red looking spec\n\n"], "author": "Steven C.", "review": "I saw this as one of the higher rated sushi places near my place in SF. I also saw they had a check-in deal on 4square for spend $10 get $10 credited to your Amex account.\n\nI went here expecting so pretty good sushi. What I got was, very slow service and so-so sushi. \n\nI ordered the sushi sashimi combo plate and the Family Affair roll. The sashimi was fresh and the tuna roll it came with was filled with so much rice, you would have never known there was tuna in there except for this red looking spec\n\nThe family affair roll is loaded with stacks and stacks of onions. it tasted pretty good, but the roll sizes are small and the prices really don't justify them either.\n\nIt took a pretty darn long time for us to get our food and they came out at such staggered times that by the time our whole table received our food others were playing games on their iphone because they had finished already.\n\nI also asked for the black sesame ice cream that people raved about and the waitress told me they dont serve that hear. i seriously thought I was in the wrong restaurant because of the ratings they received and the service I had just gotten.\n\nThe PRO\nThe place is decorated with anime, so you can look at pictures of Pokemon and Naruto to sooth yourself while you wait for the food.\n\nI'm surprised this place got such good reviews, but without the Amex deal I would not return to this place for sushi", "rating": 2, "date": "2012-01-03"}, {"excerpts": ["The tuna avocado roll was okay. ", "The avocado eel roll was really off-putting. ", "Would not recommend."], "author": "Margot W.", "review": "Not fresh or well done. Most of the lettuce in the green salad was rotten. The tuna avocado roll was okay. The avocado eel roll was really off-putting. Would not recommend.", "rating": 2, "date": "2015-02-24"}, {"excerpts": ["However, I'd originally spit out the piece of tuna nigiri because I was worried.  ", "They REFUSED to replace the piece of tuna!  ", "One lousy piece, but my favorite on the platter.  ", "They said it was my fault for not knowing how nigiri is always served."], "author": "Sona P.", "review": "Food - 4 stars, Service - 2 stars\n\nI ordered the Nigiri combo (12 pieces, $25).  Not a great deal, but the sashimi didn't have combos, only 9 straight pieces of the same fish.  This was a mistake, as a lot of the nigiri pieces were terrible (fishy).  Friend ordered the Dragon Roll and loved it.\n\nBad stuff:  I have a gluten allergy and asked the waitress if any type of sauce came with the nigiri.  She said no, but the nigiri came with wasabi added to the bottom on top of the rice.  Now, apparently this is how nigiri is always served, so my mistake.  They were nice enough to show me the package of wasabi to confirm there was no gluten and to bring me gluten-free soy sauce.  However, I'd originally spit out the piece of tuna nigiri because I was worried.  They REFUSED to replace the piece of tuna!  One lousy piece, but my favorite on the platter.  They said it was my fault for not knowing how nigiri is always served.", "rating": 3, "date": "2011-10-10"}, {"excerpts": ["A sample of what we enjoyed last night included:\n\nmaguro - sushi, sashimi\nhamachi - sushi, sashimi\nsake - sushi, sashimi, kama\nmakeral - sashimi\nscapllops - sushi\nspicy tuna - roll (swamp roll, yummy!), sashimi\noysters - deep fried (yummy!!!)\n\n"], "author": "Jonathon J.", "review": "I've enjoyed Tony's sushi for years.  From the days at Maru sushi, to Sushi Boom and am very happy (read VERY EXCEITED!!!) that he's opened his new place.  I've enjoyed great times with family and friends and it is always the best.  The food is fresh, creative, and the food and environment are even better here on Bush St.  My best meals are when I got in and let Toni decide what's the best for that evening.  \n\nA sample of what we enjoyed last night included:\n\nmaguro - sushi, sashimi\nhamachi - sushi, sashimi\nsake - sushi, sashimi, kama\nmakeral - sashimi\nscapllops - sushi\nspicy tuna - roll (swamp roll, yummy!), sashimi\noysters - deep fried (yummy!!!)\n\nI've been several times since the grand opening a few weeks ago and am already planning to get back there this Fiday evening for the live music.  Stop by if you're in the area, heck, stop by even if you're not.  The friendly atmosphere and food are definitely worth your time.", "rating": 5, "date": "2009-08-26"}, {"excerpts": ["We ordered a Red Dragon roll, a Spicy Tuna roll, a B.T.S. roll and a 49er's roll. "], "author": "Cristina P.", "review": "What a good sushi restaurant. \n\nSo here's the deal: \n\nI haven't eaten here, so I can't speak to the service per se, but I have had a great experience with them. I ordered take out (4 rolls, 2 miso soups and a salad) for my boyfriend and I. The woman on the phone was super nice and said that it'd be a 25 minute wait AND she asked if that was okay. Giving them 2 stars just for that courtesy. \n\nI, of course, said that was alright. The food was ready when I arrived and the woman was super nice and quick. The ambience isn't spectacular - pretty standard, small sushi place - but the food definitely makes it worth going here (or at least ordering from here). \n\nArriving home, we opened up the bag to some of the most delicious-looking sushi we've ever seen. We ordered a Red Dragon roll, a Spicy Tuna roll, a B.T.S. roll and a 49er's roll. The Red Dragon was unbelievably good - a must order.\n\nUPDATE: \n\nI totally forgot to mention how delicious-TASTING the rolls were too. If you're familiar with my Zushi Puzzle review, you'll understand just how good this place is- it's definitely on par with Zushi.", "rating": 4, "date": "2010-11-14"}, {"excerpts": ["Spicy tuna handroll-average-not spicy at all and on the pricey side ( 6.50 )\nSpicy scallop handroll-ok ( 6.50 )\nSpider roll- good\n", "Lion King "], "author": "Lizete S.", "review": "We came here for lunch.  The service was ok and overall the food was average..nothing really spectacular.\n\nWe had the following:\nSpicy tuna handroll-average-not spicy at all and on the pricey side ( 6.50 )\nSpicy scallop handroll-ok ( 6.50 )\nSpider roll- good\nLion King roll-ok\nCrunch roll-very good\n\nOur drinks were served in a timely manner even though our food took awhile.  We were the only ones in the restaurant and surprised it took so long. The hot sake was ok and the hubby had a large Asahi.   For a meal costing $67 we've definitely had better elsewhere.", "rating": 3, "date": "2010-10-02"}, {"excerpts": ["We had a a spicy tuna roll, uni nigiri, veggie tempura and a chirashi bowl. ", "Honestly the food was ok... nothing really stood out. ", "Nothing memorable for me to come back to."], "author": "Cynthia C.", "review": "Came here on a Saturday night. The great thing about this place is that it's open late on the weekends. We had a a spicy tuna roll, uni nigiri, veggie tempura and a chirashi bowl. Honestly the food was ok... nothing really stood out. Nothing memorable for me to come back to.", "rating": 2, "date": "2011-04-04"}, {"excerpts": ["I loved the seaweed salad on top and the spicy tuna was on point.  \n\n"], "author": "Isabella O.", "review": "Looked for a light lunch around Union Square, not too expensive, and ended up here.  We arrived at an empty restaurant and it was all good.  The waitress & sushi maker were extremely nice and the food was good good good.\n\nFood: \nVolcano Roll: Good warm roll.  There's definitely a lot of stuff going on in this one.  I loved the baked crab, just melted in my mouth.  The spiciness was just enough.\n\nSwamp Roll: Really refreshing.  I loved the seaweed salad on top and the spicy tuna was on point.  \n\nTempura Udon: mmmmm..... it was a chilly afternoon in the city and this soup hit the spot.  The broth was delicious and there was an ample amount of veggies stewing in there.\n\nOverall: We enjoyed it, definitely worth the walk (up a crazy steep hill), and the Sapporo was ice cold... yummm.", "rating": 4, "date": "2010-11-28"}, {"excerpts": ["Really good crunch roll and average spicy tuna ", "(but you really can't make stand out spicy tuna). ", "I wish I would have read the other reviews before I visited ", "so I would have known to talk to the chef. ", "I overheard two people sitting at the bar getting recommendations after I had already ordered!"], "author": "Kate B.", "review": "Really good crunch roll and average spicy tuna (but you really can't make stand out spicy tuna). I wish I would have read the other reviews before I visited so I would have known to talk to the chef. I overheard two people sitting at the bar getting recommendations after I had already ordered!", "rating": 4, "date": "2012-12-26"}, {"excerpts": ["I ordered miso, seaweed salad, shrimp nigiri, spicy tuna rolls and the infamous lion king roll.\n\n"], "author": "Rachel S.", "review": "Sushi Toni was a good, solid sushi bar.  My partner and I ordered miso, seaweed salad, shrimp nigiri, spicy tuna rolls and the infamous lion king roll.\n\nEverything was very fresh and expertly prepared.  The lion king roll should be renamed the schizophrenic roll.  There were so many flavors that it was almost overpowering.  It was however, delicious, but should definitely be eaten in moderation.\n\nI would recommend this place for anyone in the union square area, but make sure you have at least an hour for lunch-- there were only three tables full when we were there and still the service was super slow.", "rating": 4, "date": "2011-03-06"}, {"excerpts": ["The two rolls we chose were the red dragon roll which is named from the fresh tuna on the outside of the roll and let me tell you, it was red. ", "It was remarkable We also got the Lion King roll which we had ordered in our home town ", "so we wanted to make a comparison. ", "This roll isn't like most, it is salmon baked with mozzarella cheese and a mustard type sauce on top. "], "author": "Robin O.", "review": "With the myriads of sushi restaurants in the City, choosing one is a hard decision. So with the help of Yelpers, and the close proximity to our hotel Sushi Toni was the perfect spot. \n\nThe entire staff greets you when you walk in the door including the sushi chefs, the wait staff continues to be attentive while you are there and the food is fresh and tasty. \n\nWe ordered a the steamed shumai which was had perfect texture and flavor. The two rolls we chose were the red dragon roll which is named from the fresh tuna on the outside of the roll and let me tell you, it was red. It was remarkable We also got the Lion King roll which we had ordered in our home town so we wanted to make a comparison. This roll isn't like most, it is salmon baked with mozzarella cheese and a mustard type sauce on top. Odd sounding I am sure, but tasty nonetheless. \n\nOverall, if we are ever in the neighborhood again, this will be high on our list to revisit.", "rating": 5, "date": "2010-03-08"}, {"excerpts": ["4 STARS for the food: really yummy seaweed salad and spicy tuna roll. ", "They were pretty quick!!"], "author": "Cnn F.", "review": "Passed by this place a million times and finally decided to go in. \n\n3 STARS for the restaurant: not very big. \n\n4 STARS for the food: really yummy seaweed salad and spicy tuna roll. They were pretty quick!!", "rating": 4, "date": "2010-12-16"}, {"excerpts": ["and it was \"top grade\" tuna (NOT TORO, just regular tuna).\n\n"], "author": "Zu W.", "review": "The fish quality here is good I will give them that.  The staff was friendly.  The decor was cool.  It had anime pictures all over, pretty cute.  \n\nMy boyfriend and I strolled in here really late one evening (11pm on Wed.) because we saw a huge sign at the door that said \"people on yelp love us\".  LoL I'm such a sucker.  Anyway so we found out he's been only opened for 2 months and the place is korean owned.\n\nHowever I'm rating 3 stars because the rolls were mediocre, they were rather stingy with the fish, and I thought it was over priced.  We ordered a 7 piece sashimi, which was $15 and the pieces were maybe 1in X 1in X 1/4in.  and it was \"top grade\" tuna (NOT TORO, just regular tuna).\n\nOwner plays bob marley all day long.  Got annoying after hearing the same song for the 10th time in one sitting. I like the idea that  he like reggae tho, cool dude.\n\nI liked the romeo and juliet roll, and the california roll, but I think everything is really \"standard\" or mediocre, nothing that was spectacular.  I wouldn't eat here again if I had other options.  I think I can definitely find better sushi somewhere in this town.", "rating": 3, "date": "2009-10-13"}, {"excerpts": ["Before I begin, I must concede that the only sushi I had was the spicy tuna.  ", "It was good, but not great.  ", "The other thing I ordered was a teriyaki  salmon.  ", "The sauce was thick, cornsyrupy, nothing special.  "], "author": "Brianna H.", "review": "Before I begin, I must concede that the only sushi I had was the spicy tuna.  It was good, but not great.  The other thing I ordered was a teriyaki  salmon.  The sauce was thick, cornsyrupy, nothing special.  Likewise, the salmon wasn't all that fresh or special. \n\nNothing tasted all that fresh or amazing on this particular night.  But the service was fast (albeit the restaurant was mostly empty), and the waitress was sweet.", "rating": 3, "date": "2009-09-29"}, {"excerpts": ["There were no special fishes, just the usual tuna, salmon, yellowtail, etc.  ", "Again some of it fishy, some of it has a weird color and texture (as if it was frozen).  ", "We also ordered a couple of specialty rolls.  ", "Word to sushi places, ease up or don't use mayo.  ", "I don't know why this has become a convention in sushi places, but I have found that the good ones don't use much if any mayo at all.  ", "Honestly the texture and the throat feel of mayo makes the sushi taste even more fishy and less fresh.  ", "Good  fish should stand on its own and in my opinion leave you with a fresh and crisp feel after  the meal.  ", "This place used too much mayo in their sauces for the rolls.  "], "author": "Scott C.", "review": "I was so disappointed with this place.  Based off of the reviews, I expected the food to be at least OK.  It was not.  The only reason I am giving the place 2 stars instead of 1 is because the people working there were very friendly and the service was quite good.  That said, the sushi itself sucked.  The fish was not very fresh and many of the pieces tasted too fishy.  Some of the pieces tasted as if they had been frozen.  We ordered a sashimi combo dinner which included 12 pieces of assorted fish (chefs choice).  There were no special fishes, just the usual tuna, salmon, yellowtail, etc.  Again some of it fishy, some of it has a weird color and texture (as if it was frozen).  We also ordered a couple of specialty rolls.  Word to sushi places, ease up or don't use mayo.  I don't know why this has become a convention in sushi places, but I have found that the good ones don't use much if any mayo at all.  Honestly the texture and the throat feel of mayo makes the sushi taste even more fishy and less fresh.  Good  fish should stand on its own and in my opinion leave you with a fresh and crisp feel after  the meal.  This place used too much mayo in their sauces for the rolls.  It was so bad, I had to find a dessert place just to cleanse the palate.  \n\nI wish I liked the food more, because the people that worked there were so nice.", "rating": 2, "date": "2010-03-01"}, {"excerpts": ["I order the saba nigiri, albacore nigiri, Hanakah roll (salmon skin, smoked salmon, Ikura), and Swamp roll (wakame salad and spicy tuna). ", "Everything was excellent. ", "The chef/owner also wanted us to try his special miso soup. ", "They just got their liquor license a few days ago, and sake and soju are on their way. ", "I can't wait to try their cocktail concoctions!"], "author": "Lily T.", "review": "Sushi Toni is located at what was formerly Sushi Man. The current owner also previously owned Tempura House around the corner, which is now replaced by Mari Sushi. Sit by the sushi bar, and he will make sure you feel right at home. I don't know if that's his personal style, but that's the thing with newly opened businesses: the service is usually extraordinary. He's an avid green tea drinker, so you can strike a conversation with him on that!\n\nI order the saba nigiri, albacore nigiri, Hanakah roll (salmon skin, smoked salmon, Ikura), and Swamp roll (wakame salad and spicy tuna). Everything was excellent. The chef/owner also wanted us to try his special miso soup. They just got their liquor license a few days ago, and sake and soju are on their way. I can't wait to try their cocktail concoctions!", "rating": 5, "date": "2009-08-04"}, {"excerpts": ["Uninspired tuna appetizer, decent sashimi, huge but salty veggie udon soup. ", "Nothing memorable, nothing offensive."], "author": "Danielle S.", "review": "Eh. Uninspired tuna appetizer, decent sashimi, huge but salty veggie udon soup. Nothing memorable, nothing offensive.", "rating": 3, "date": "2012-01-30"}, {"excerpts": ["But I do love wasabi, tuna, and avacado. ", "Sushi Toni is good for a light dinner in a non-fussy environment. ", "I went with a couple of friends after yoga, and the three of us split 4 rolls.  ", "The specialty roll was a lot bigger than the ordinary rolls.  ", "It looked like they have a good sake options. ", "I'll give it another go, but neither the specialty roll or eel did much to knock me off of my tuna, avocado, and wasabi train."], "author": "Lynn M.", "review": "Note--I'm not a sushi connoisseur. But I do love wasabi, tuna, and avacado. Sushi Toni is good for a light dinner in a non-fussy environment. I went with a couple of friends after yoga, and the three of us split 4 rolls.  The specialty roll was a lot bigger than the ordinary rolls.  It looked like they have a good sake options. I'll give it another go, but neither the specialty roll or eel did much to knock me off of my tuna, avocado, and wasabi train.", "rating": 3, "date": "2012-01-24"}, {"excerpts": ["White tuna appetizer platter next. ", "Very nice presentation of colors. ", "My favorite plate of the evening, when I generally don't even care for tuna. ", "Great texture with the fish ever so lighty brushed with a blow torch. "], "author": "Beatrice T.", "review": "Great portions, quality fish, FAST service (not one of those bars where the chef is overworked and you can only order one piece every 10 minutes), and a very warm inviting atmosphere.  May not be the best sushi I've had... but still very good and I will definitely be visiting Toni again.  He's friendly, funny, and knows how to show his customers a good time.  A great first visit. \n\nMe: \"Spicy scallop please!\"\nToni: \"Eh no no. I have fresh scallop today. Even better.\"\n\nAs we finished our miso soup a lovely open shell arrived.. half filled with scallop nigiri..  half filled with dipping sauce.. Then they took the left over scallop trimmings, sliced it with some veggies and turned it into tempura.  \n\nToni: \"Good?\"\nMe: Good. \n\nThe scallops were fresh, although sliced a little too thin for my taste, and I personally do not like lemon slices with my fish but can't deny good craftmanship and quality. \n\nA few more minutes.. down came a platter of salmon sashimi.  I prefer the fatty buttery melt-in-your mouth pieces.  Toni gives you the cleaner slices that have a nice bite to them.  Personal preference. \n\nWhite tuna appetizer platter next. Very nice presentation of colors. My favorite plate of the evening, when I generally don't even care for tuna. Great texture with the fish ever so lighty brushed with a blow torch. Flavor was fab. \n\nToni: \"Good?\"\nMe: \"MMHMMM!\"\n\nLion king and dragon roll followed.  The sashimi portions were so large that my date and I were struggling already.  Dragon roll was standard but lion king had a nice twist using mozeralla cheese instead of just the mayo-based sauce.  \n\nCatching on to my loyalty to rich fatty goodness.. Toni treated us to some black sesame ice cream which was one of the best I've had.  \n\nToni :\"OOH. I don't need to ask.  She likes this one\"\nDate: \"Yea.. it's gone and I've only had one bite.\"\nMe: \"nom nom nom.\"\n\nA shot of saki and $75 bucks later (pre-tip).. we were in a good place.. stuffed and waiting for our tummies to settle so we could devour our leftovers.", "rating": 4, "date": "2009-09-05"}, {"excerpts": ["Tuna, white tuna, onions, cucumber, green onions, and tobiko.  ", "All the ingredients seemed very fresh except the tobiko came off as a little stale and hard.  "], "author": "William F.", "review": "After being at game 5 of the NLCS and the its bitter defeat of our Giants with Timmy Lincecum on the mound - damn you phillies! - I found myself extremely hungry.  I felt as hungry as Paul Bunyon after a long day's work... yes, it is true.  So, I ventured onto my ailing iPhone - which is another story in itself - and found Sushi Toni's as the snickers to my hunger. \n\nOverall, I can't say I was too impressed.  The service was fast and I could overhear the sushi chef conversing with the patrons at the sushi bar, but I found myself next to a TV watching the highlights of the game I had just came from.  Boo.  Well, as this is my first review, I don't want it to be about the sour taste I had in my mouth from the game so hear it goes:\n\nFamily Affair Roll:  Though it is one of the pricier specialty sushi rolls on the menu, ($12.50 if i remember correctly), it was a delight to eat.  Tuna, white tuna, onions, cucumber, green onions, and tobiko.  All the ingredients seemed very fresh except the tobiko came off as a little stale and hard.  It just felt like i had a bunch of mini-BBs in my mouth.\n\n49'ers Roll:  Salmon, simo, avocado, tobiko, and lemon.  The lemon is sliced meticulously thin and placed on top of each individual piece of sushi.  Great taste as the mixture of the juicy lemon slice combines with the Salmon.\n\nWell there it is, I was in-and-out in a jiffy and wasn't displeased with the price but again, I was still bitter from an upsetting defeat on our home turf and would have given Sushi Toni more stars if it cured my depression of the night.\n\nB - OK", "rating": 3, "date": "2010-10-22"}, {"excerpts": ["I tried the Scallop and Tuna sushi ", "and it was excellent.  ", "I had the green tea which was refreshing and apparently comes with every meal.  ", "I also had some kind of Monk fish that had been marinating in Saki for a few hours and then boiled.  "], "author": "Jason D.", "review": "Like all the other reviews, the place has a nice, upgraded atmosphere.  The wait service was beck and call and the owner Toni was behind the sushi bar.  I chose this place mainly on the review and glad they were here to make my night for sushi decision.\n\nThe sushi was very fresh as the owner Toni promised.  I tried the Scallop and Tuna sushi and it was excellent.  I had the green tea which was refreshing and apparently comes with every meal.  I also had some kind of Monk fish that had been marinating in Saki for a few hours and then boiled.  I also got to try he shiitake mushrroms Brandy tried and was awesome.\n\nI would highly suggest giving it a try if you live in the area or visiting from out of town.  You wont be dissapointed!", "rating": 5, "date": "2009-08-17"}, {"excerpts": ["the fact that I can get it over a spicy tuna roll and call is a Swamp roll is pretty perfect. ", "I like the Family Affair roll (tuna, white tuna and cucumber) even though they get a little carried away with the white and green onion garnish on top. ", "The Red Dragon and Crunch rolls are also worth trying out. "], "author": "Larisa J.", "review": "Their maki rolls are creative, tasty and affordable. The 49er roll (tobiko, siso, avacado topped with salmon and a lemon wedge) tastes just as good as the salmon citrus roll at Michelin rated Sushi Ran. I'm a huge fan of seaweed salad, so the fact that I can get it over a spicy tuna roll and call is a Swamp roll is pretty perfect. Yelp reviewers rave about the Romeo and Juliet roll (salmon and avocado wrapped in soybean paper, topped with scallop) and I have to concur. I like the Family Affair roll (tuna, white tuna and cucumber) even though they get a little carried away with the white and green onion garnish on top. The Red Dragon and Crunch rolls are also worth trying out. They're also able to make spicy scallop handrolls, which are a favorite of mine ever since I moved to SF. Basic maki rolls range from $4.50-$6.50 and specialty rolls are on average $9-$10. Everything is rolled well and made with quality ingredients. If you're looking for an affordable sushi dinner, this is the place to go", "rating": 4, "date": "2013-03-27"}, {"excerpts": ["The Chef's Special Roll was nothing special - even if I mentioned that Salmon is one of my favorite & I preferred white tuna than regular, both of which did not show up in my \"special\" roll. ", "I was given regular tuna & yellowtail which he assumed I wanted after asking me if I liked that - which I said, \"Yea...h I suppose.", "\"\n", "I didn't get my salmon nor my white tuna - totally INCONSIDERATE...!!!"], "author": "Heather W.", "review": "Service is good - that was the best part, sadly.\nThe food is overpriced. Food tasted fine. There are other Sushi restaurants with better food & pricing & portion sizes.\nThe Chef's Special Roll was nothing special - even if I mentioned that Salmon is one of my favorite & I preferred white tuna than regular, both of which did not show up in my \"special\" roll. I was given regular tuna & yellowtail which he assumed I wanted after asking me if I liked that - which I said, \"Yea...h I suppose.\"\nOn that note the other \"Family Affair Roll\" I ordered was similar portion-wise, so that tells me that the \"Chef's Special Roll\" DEFINITELY was NOT worth $15.00!\nWorse of all, me & my daughter experienced an dull ache in the stomach afterward as if the food wasn't clean... I know this could be an isolated case, but I wanted to note that anyway.\nWe were polite & didn't say anything - I regret that. This review wouldn't even surface actually if not for the stomach ache we experienced. I feel indignant that there is bodily discomfort which prompted this review.\nIt was more like the more you think about what you were served, the more it was frowned upon ESPECIALLY with the \"Chef's Special Roll\" which was a custom ordered item with what the customer wanted. I didn't get my salmon nor my white tuna - totally INCONSIDERATE...!!!", "rating": 2, "date": "2011-04-15"}, {"excerpts": ["We ordered the dragon roll, crunchy spicy tuna, and the philadelphia and were very pleased. ", "And saki bombs are always good times."], "author": "Ann A.", "review": "Really yummy, cute little sushi place. The cooks are really friendly. The rolls are a little on the large side though, which make if uncomfortable to eat, but if you're okay with getting a little messy then it's perfect. We ordered the dragon roll, crunchy spicy tuna, and the philadelphia and were very pleased. And saki bombs are always good times.", "rating": 4, "date": "2011-06-04"}, {"excerpts": ["Toni will hook you up with his amazing spicy tuna and insightful baseball facts :D.  ", "His wife will give you smiles from the moment you walk in until you leave.  ", "The service and atmosphere gives this place the extra star to make it 4 stars."], "author": "Tony N.", "review": "This is one of my favorite place to get sushi.  I'm going to be honest, so don't stop reading...the sushi here is not the best I've had.  If you want mouth watering, melt in your mouth sushi, then definitely go somewhere else.  They don't have great looking sushi like Kabuto either.  However, if you're looking for above average, reasonably priced sushi then definitely try this place out!  If you're looking for great personality and kind service, then you've found your spot.  Toni will hook you up with his amazing spicy tuna and insightful baseball facts :D.  His wife will give you smiles from the moment you walk in until you leave.  The service and atmosphere gives this place the extra star to make it 4 stars.", "rating": 4, "date": "2010-11-16"}, {"excerpts": ["My advice is to stick with basic options (my favorite is the tuna sashimi) and not try anything too too fancy. ", "The miso soup is also a great basic."], "author": "Emmy L.", "review": "Ok, Sushi Toni is not going to be the most amazing sushi you ever had. The menu is not super inventive and the teriyaki leaves something to be desired. BUT - the service is very good and the price is reasonable for Union Square. My advice is to stick with basic options (my favorite is the tuna sashimi) and not try anything too too fancy. The miso soup is also a great basic.", "rating": 3, "date": "2011-12-15"}, {"excerpts": ["For about $50, my friend and I had miso soup, the Chef's choice sashimi platter, two orders of nigiri (eel and red snapper), two rolls (spicy tuna and salmon), and an order of green tea mochi for dessert. ", "Plus, the service was great, and everyone there was very friendly and welcoming."], "author": "Nika S.", "review": "The sushi here was quite good, definitely fresh, but I wouldn't say it's one of the top sushi restaurants I've been to. For the price, however, you can't beat it. For about $50, my friend and I had miso soup, the Chef's choice sashimi platter, two orders of nigiri (eel and red snapper), two rolls (spicy tuna and salmon), and an order of green tea mochi for dessert. Plus, the service was great, and everyone there was very friendly and welcoming.", "rating": 4, "date": "2010-05-10"}, {"excerpts": ["order the mega sashimi platter... small pieces and the salmon and tuna did not see fresh. ", "udon was terrible, would have done better with instant. ", "should have gone to sakana down the street instead."], "author": "J C.", "review": "my first yelp disappointment, so much so that I had to write a review. order the mega sashimi platter... small pieces and the salmon and tuna did not see fresh. udon was terrible, would have done better with instant. should have gone to sakana down the street instead.", "rating": 1, "date": "2012-08-23"}, {"excerpts": ["For the Rainbow Roll, Unakyu Maki roll, Tuna Sashimi, and philadelphia roll plus 2 orders of mochi's it "], "author": "Anthony J. C.", "review": "Staff is super friendly and there's live music here from 8:30 pm-11pm I think.\n\nFor the Rainbow Roll, Unakyu Maki roll, Tuna Sashimi, and philadelphia roll plus 2 orders of mochi's it came out to about $45, so prices aren't too high. \n\nI'll eat Sushi to Beyonce and Bob Marley anyday", "rating": 4, "date": "2009-10-07"}, {"excerpts": ["The dinner combinations are a pretty good deal, and I thought the salmon and tuna sashimi I got was very tasty.  ", "We also ordered a few rolls including a rainbow roll which was quite good.  ", "The chef came out at the end and even shared a few stories with us, which were quite funny and amusing.  ", "Overall, it wasn't unreasonable - probably you will spend about $20 or so per person."], "author": "Larry C.", "review": "Sushi Toni is a nice sushi place in the city with a really friendly staff.  The sushi was well prepared.  The place isn't huge but we had no issues getting seating.  The dinner combinations are a pretty good deal, and I thought the salmon and tuna sashimi I got was very tasty.  We also ordered a few rolls including a rainbow roll which was quite good.  The chef came out at the end and even shared a few stories with us, which were quite funny and amusing.  Overall, it wasn't unreasonable - probably you will spend about $20 or so per person.", "rating": 3, "date": "2009-09-23"}], "fresh water eel": [], "assorted sashimi": [{"excerpts": ["Our order was included 3 nigiri dishes, an assorted sashimi, and two rolls. ", "The uni was good but can be very expensive - when we ordered it was $16.50 for two pieces. ", "I don't recommend the assorted sashimi; ", "5 small slices of fish for $13.50 "], "author": "Angela I.", "review": "Our order was included 3 nigiri dishes, an assorted sashimi, and two rolls. The uni was good but can be very expensive - when we ordered it was $16.50 for two pieces. I don't recommend the assorted sashimi; 5 small slices of fish for $13.50 -- you're better off ordering a different sashimi set.\n\nThe rolls were good and most reasonably priced. We ordered the lion king and potato bug rolls. Compared to other sushi places I've been to (not in Bay Area) the size of the rolls are on the smaller side.\n\nI enjoyed our meal, but overall it was too expensive for the amount of food we got. However, maybe this is as good as sushi places get in the Bay Area.", "rating": 3, "date": "2017-11-25"}], "hanukkah roll": [{"excerpts": ["I tried to order the \"Hanukkah roll,\" which was the most Jewish thing I did this Hanukkah, but they were out of smoked salmon.  ", "The waitress instead suggested the \"49ers\" roll because it also had salmon (not smoked). ", "I accepted her suggestion without reading the description carefully. ", "It included raw, thin slices of lemon including the rind on top, which I didn't particularly care for. "], "author": "Adam B.", "review": "Interesting sushi place.\n\nI tried to order the \"Hanukkah roll,\" which was the most Jewish thing I did this Hanukkah, but they were out of smoked salmon.  The waitress instead suggested the \"49ers\" roll because it also had salmon (not smoked). I accepted her suggestion without reading the description carefully. It included raw, thin slices of lemon including the rind on top, which I didn't particularly care for. There's a reason we don't normally eat lemon rind.\n\nI also ordered the \"Lion King\" roll, which was baked (!) with crab, avocado, salmon, and mozzarella cheese (!!). I'd never had hot sushi before, and it was, well, interesting. When the fish is cooked, the dish is hot, and it is topped with oh-so-Japanese mozzarella cheese, I think sushi stops being sushi and becomes an artfully plated fish entree with rice. Nevertheless, it tasted quite good.", "rating": 4, "date": "2010-12-13"}], "swamp roll": [{"excerpts": ["The Dragon and the swamp roll are excellent!\n\n"], "author": "krista t.", "review": "Very good food!\n\nThe Dragon and the swamp roll are excellent!\n\nI will come back again when in town", "rating": 5, "date": "2018-03-08"}, {"excerpts": ["Then had a Philadelphia roll and a swamp roll. ", "Everything was ok, nothing to write home about. ", "Rolls were on the small side ", "and I left still hungry (average appetite, not a huge eater) ", "Everyone in the restaurant was friendly and attentive plus it was very clean (including the restroom!). ", "There's an interesting adult venue next door if that's your thing. ", "We walked but I imagine parking would be tricky."], "author": "Mysti R.", "review": "We started with green salad, gyoza, and edamame. Then had a Philadelphia roll and a swamp roll. Everything was ok, nothing to write home about. Rolls were on the small side and I left still hungry (average appetite, not a huge eater) Everyone in the restaurant was friendly and attentive plus it was very clean (including the restroom!). There's an interesting adult venue next door if that's your thing. We walked but I imagine parking would be tricky.", "rating": 3, "date": "2017-02-12"}, {"excerpts": ["The food was good, I had the swamp roll and he had the sushi combo. ", "I am the most heinous person to take an order from because I am gluten free, but our server handled my questions like a champ. ", "He even, unprompted, brought out a bottle of gluten free soy sauce. ", "Gluten free soy sauce!", "! "], "author": "Kathryn P.", "review": "I love this place. Your quintessential sushi restaurant, complete with framed anime posters, a good roll selection and kitschy t-shirts.\n\nMy boyfriend and I were looking for sushi close by and as others have said, that's surprisingly difficult in one of the busiest areas of the city. We were desperately hungry, so my expectations were low, but I was pleasantly surprised when we were greeted with excellent customer service and seated right away. The food was good, I had the swamp roll and he had the sushi combo. I am the most heinous person to take an order from because I am gluten free, but our server handled my questions like a champ. He even, unprompted, brought out a bottle of gluten free soy sauce. Gluten free soy sauce!! It's a thing, and as a wheat-averse person, I was almost moved to tears. \n\nI also thought the prices were very fair, maybe even cheap for San Francisco, at least in my experience. Yayyy sushi toni!!!", "rating": 5, "date": "2015-08-19"}, {"excerpts": ["The family roll & swamp roll are great and you won't be disappointed with their chicken udon either."], "author": "Nate R.", "review": "Great rolls with a relaxed atmosphere. The family roll & swamp roll are great and you won't be disappointed with their chicken udon either.", "rating": 5, "date": "2017-08-25"}, {"excerpts": ["The swamp roll is good but you need to take the seaweed salad off or it over powers"], "author": "Sombrero Q.", "review": "Friendly staff, decent sushi. The family affair roll wasn't my favorite. But the salmon sashimi was amazing, and so was the dragon roll. The swamp roll is good but you need to take the seaweed salad off or it over powers", "rating": 4, "date": "2016-12-03"}, {"excerpts": ["This place met that and their family affair roll and swamp roll are so good! ", "Thanks guys! ", "Nice place off the beaten path to relax."], "author": "Denny B.", "review": "I'm a snob with my sushi. No mayo or may sauces. The fish, rice, and seaweed must be quality. This place met that and their family affair roll and swamp roll are so good! Thanks guys! Nice place off the beaten path to relax.", "rating": 5, "date": "2015-06-16"}, {"excerpts": ["Try the Swamp Roll and be sure to ask if there are any special rolls!\n", "The owner was there and very personable. ", "He is going to have music some Fridays that he is excited about."], "author": "Dawn R.", "review": "It was a bit of a hike from Union Square-up hill all the way... but the place is clean and the people are very nice and attentive! We sat at a table, but may try sitting at the bar, so we can watch them making the dishes! \nThe sushi was fresh and yummy! Try the Swamp Roll and be sure to ask if there are any special rolls!\nThe owner was there and very personable. He is going to have music some Fridays that he is excited about.", "rating": 4, "date": "2009-08-25"}, {"excerpts": ["A sample of what we enjoyed last night included:\n\nmaguro - sushi, sashimi\nhamachi - sushi, sashimi\nsake - sushi, sashimi, kama\nmakeral - sashimi\nscapllops - sushi\nspicy tuna - roll (swamp roll, yummy!), sashimi\noysters - deep fried (yummy!!!)\n\n"], "author": "Jonathon J.", "review": "I've enjoyed Tony's sushi for years.  From the days at Maru sushi, to Sushi Boom and am very happy (read VERY EXCEITED!!!) that he's opened his new place.  I've enjoyed great times with family and friends and it is always the best.  The food is fresh, creative, and the food and environment are even better here on Bush St.  My best meals are when I got in and let Toni decide what's the best for that evening.  \n\nA sample of what we enjoyed last night included:\n\nmaguro - sushi, sashimi\nhamachi - sushi, sashimi\nsake - sushi, sashimi, kama\nmakeral - sashimi\nscapllops - sushi\nspicy tuna - roll (swamp roll, yummy!), sashimi\noysters - deep fried (yummy!!!)\n\nI've been several times since the grand opening a few weeks ago and am already planning to get back there this Fiday evening for the live music.  Stop by if you're in the area, heck, stop by even if you're not.  The friendly atmosphere and food are definitely worth your time.", "rating": 5, "date": "2009-08-26"}, {"excerpts": ["Swamp Roll: ", "Really refreshing.  "], "author": "Isabella O.", "review": "Looked for a light lunch around Union Square, not too expensive, and ended up here.  We arrived at an empty restaurant and it was all good.  The waitress & sushi maker were extremely nice and the food was good good good.\n\nFood: \nVolcano Roll: Good warm roll.  There's definitely a lot of stuff going on in this one.  I loved the baked crab, just melted in my mouth.  The spiciness was just enough.\n\nSwamp Roll: Really refreshing.  I loved the seaweed salad on top and the spicy tuna was on point.  \n\nTempura Udon: mmmmm..... it was a chilly afternoon in the city and this soup hit the spot.  The broth was delicious and there was an ample amount of veggies stewing in there.\n\nOverall: We enjoyed it, definitely worth the walk (up a crazy steep hill), and the Sapporo was ice cold... yummm.", "rating": 4, "date": "2010-11-28"}, {"excerpts": ["I order the saba nigiri, albacore nigiri, Hanakah roll (salmon skin, smoked salmon, Ikura), and Swamp roll (wakame salad and spicy tuna). ", "Everything was excellent. ", "The chef/owner also wanted us to try his special miso soup. ", "They just got their liquor license a few days ago, and sake and soju are on their way. ", "I can't wait to try their cocktail concoctions!"], "author": "Lily T.", "review": "Sushi Toni is located at what was formerly Sushi Man. The current owner also previously owned Tempura House around the corner, which is now replaced by Mari Sushi. Sit by the sushi bar, and he will make sure you feel right at home. I don't know if that's his personal style, but that's the thing with newly opened businesses: the service is usually extraordinary. He's an avid green tea drinker, so you can strike a conversation with him on that!\n\nI order the saba nigiri, albacore nigiri, Hanakah roll (salmon skin, smoked salmon, Ikura), and Swamp roll (wakame salad and spicy tuna). Everything was excellent. The chef/owner also wanted us to try his special miso soup. They just got their liquor license a few days ago, and sake and soju are on their way. I can't wait to try their cocktail concoctions!", "rating": 5, "date": "2009-08-04"}, {"excerpts": ["The only notable roll was the swamp roll.  ", "But I wouldn't necessarily every go out of my way just to order one again.  ", "Service was average.  ", "Prompt but not personable.  ", "So-so restaurant overall, not terrible but not amazing either."], "author": "Jeff G.", "review": "Mediocre...While the quality of the fish is fine, the portion size and size of the rolls themselves are small.  Sashimi is also particularly expensive.  The only notable roll was the swamp roll.  But I wouldn't necessarily every go out of my way just to order one again.  Service was average.  Prompt but not personable.  So-so restaurant overall, not terrible but not amazing either.", "rating": 3, "date": "2012-01-24"}, {"excerpts": ["the fact that I can get it over a spicy tuna roll and call is a Swamp roll is pretty perfect. ", "I like the Family Affair roll (tuna, white tuna and cucumber) even though they get a little carried away with the white and green onion garnish on top. ", "The Red Dragon and Crunch rolls are also worth trying out. "], "author": "Larisa J.", "review": "Their maki rolls are creative, tasty and affordable. The 49er roll (tobiko, siso, avacado topped with salmon and a lemon wedge) tastes just as good as the salmon citrus roll at Michelin rated Sushi Ran. I'm a huge fan of seaweed salad, so the fact that I can get it over a spicy tuna roll and call is a Swamp roll is pretty perfect. Yelp reviewers rave about the Romeo and Juliet roll (salmon and avocado wrapped in soybean paper, topped with scallop) and I have to concur. I like the Family Affair roll (tuna, white tuna and cucumber) even though they get a little carried away with the white and green onion garnish on top. The Red Dragon and Crunch rolls are also worth trying out. They're also able to make spicy scallop handrolls, which are a favorite of mine ever since I moved to SF. Basic maki rolls range from $4.50-$6.50 and specialty rolls are on average $9-$10. Everything is rolled well and made with quality ingredients. If you're looking for an affordable sushi dinner, this is the place to go", "rating": 4, "date": "2013-03-27"}, {"excerpts": ["Excellent salmon nigiri and super spicy swamp roll."], "author": "G. J.", "review": "Delicious and friendly! Toni is a laugh and a half. Excellent salmon nigiri and super spicy swamp roll.", "rating": 4, "date": "2010-08-18"}], "family affair roll": [{"excerpts": ["The family affair roll is ok.  "], "author": "Lei H.", "review": "I don't why this place get so many 4 stars.  It's just okay.  Don't get the udon.  We got the tempura udon and it's very naked and almost bland.  Luckily I have pretty sensitive taste bud so it's not completely hot water but I would say some of the worst I have ever tasted.   Also only one tempura shrimp and absolutely no veggie in the soup just 4 pieces of tempura. \n\nThe Romeo Juliet roll is good.  The family affair roll is ok.  The onions on top throws me off a little. \n\nThe waitress barely speaks English.  It seems to owned by Chinese and not Japanese.   Must be a tourist place.  Will not be back.", "rating": 3, "date": "2016-11-25"}, {"excerpts": ["Next came the family affair roll, wow it looked like a master piece of artwork. ", "I really enjoyed taking pictures of it, the taste was unique as the top was spicier than the wasabi. ", "I loved the sprouts on top, I felt like it was very well made. ", "Next, we wanted to try another roll and my bf picked Hannukah "], "author": "Amy Y.", "review": "I came here with my boyfriend around 9:30 pm. When we got there we got seated pretty quickly. I had to wait in line at the bathroom. There is one bathroom and it is unisex, it was pretty clean. I give kudos to places with clean restaurants. Anyways I came out and they asked if I was ready to order. The green tea there is good, except the service of waiter/wAitress is slow. I don't like places where I have to constantly call them to refill my tea. At any location, on average I can drink 7-8 cups of tea if not more. So at this location I only drank 2 cups and I had to request one time which is kind of disappointing. Anyways, we ordered 3 rolls California, Hannukah, and family affair. The California came wkrh6 pieces, overall it was great. The only thing was that the wasabi was not that strong, it was very under powered and eating a scoop is completely doable. Next came the family affair roll, wow it looked like a master piece of artwork. I really enjoyed taking pictures of it, the taste was unique as the top was spicier than the wasabi. I loved the sprouts on top, I felt like it was very well made. Next, we wanted to try another roll and my bf picked Hannukah it's made of salmon and salmon skin. When it came we were kind of surprised. The salmon skin was inside the roll and the top of the salmon was topped with 2 popping balls. I felt like it was very interesting, but the taste was a bit too strong for me, it was a little too salty. \n\nOverall if you ask me, I suggest iyakaza ninja that is a block away for some better sushi.", "rating": 2, "date": "2016-04-16"}, {"excerpts": ["We ordered the Rainbow Roll, a salmon sashimi dinner, and the Family Affair Roll. ", "The Rainbow Roll was interesting because they used a shrimp tempura instead of crab for the inside. ", "Definitely made it more memorable and was very enjoyable, a good twist on the usual Rainbow roll. ", "The salmon sashimi dinner was 9 pieces with a bowl of white rice. ", "We mostly just ate the sashimi by itself and it was very tender and melted in your mouth. ", "Sometimes sashimi is a bit tough and cold, and this was not that, very good indeed. ", "The Family Affair Roll had white tuna on top and red tuna inside. ", "It had sprouts and onions as well on top and was very good and fresh as well. ", "Overall, a nice dinner to relax after walking around all day. ", "A good casual, inexpensive spot for dinner if you're around Market street for dinner and don't want to pay $$$."], "author": "Isabel C.", "review": "Went after a long day at SF Pride! Was cautious that it might be overrun with people after Pride, but we were seated right away. We ordered the Rainbow Roll, a salmon sashimi dinner, and the Family Affair Roll. The Rainbow Roll was interesting because they used a shrimp tempura instead of crab for the inside. Definitely made it more memorable and was very enjoyable, a good twist on the usual Rainbow roll. The salmon sashimi dinner was 9 pieces with a bowl of white rice. We mostly just ate the sashimi by itself and it was very tender and melted in your mouth. Sometimes sashimi is a bit tough and cold, and this was not that, very good indeed. The Family Affair Roll had white tuna on top and red tuna inside. It had sprouts and onions as well on top and was very good and fresh as well. Overall, a nice dinner to relax after walking around all day. A good casual, inexpensive spot for dinner if you're around Market street for dinner and don't want to pay $$$.", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["Next up was the family affair roll which had a great fresh taste to it. "], "author": "Nancy L.", "review": "Delicious. I'm surprised at some of the negative reviews. The sushi, rolls, and nigiri were delicious. I tried the salmon and octopus nigiri and found it tasty with a good texture. Next up was the family affair roll which had a great fresh taste to it. I finished with the naruto roll. The naruto doesn't have rice so the favors are delicate. The service was spot on. Overall it was very good.", "rating": 4, "date": "2016-04-19"}, {"excerpts": ["The family affair roll wasn't my favorite. ", "But the salmon sashimi was amazing, and so was the dragon roll. "], "author": "Sombrero Q.", "review": "Friendly staff, decent sushi. The family affair roll wasn't my favorite. But the salmon sashimi was amazing, and so was the dragon roll. The swamp roll is good but you need to take the seaweed salad off or it over powers", "rating": 4, "date": "2016-12-03"}, {"excerpts": ["Be sure to include the Family Affair Roll and the Demon Slayer Sake in your order!"], "author": "A M.", "review": "A totally understated neighborhood joint with exceptionally good sushi and an awesome staff.  I've been for dinner three times and am already welcomed like a regular. The rolls are always fresh and delicious, the service is excellent and you'll never have to wait for a table.\n\nBe sure to include the Family Affair Roll and the Demon Slayer Sake in your order!", "rating": 5, "date": "2014-12-12"}, {"excerpts": ["This place met that and their family affair roll and swamp roll are so good! ", "Thanks guys! ", "Nice place off the beaten path to relax."], "author": "Denny B.", "review": "I'm a snob with my sushi. No mayo or may sauces. The fish, rice, and seaweed must be quality. This place met that and their family affair roll and swamp roll are so good! Thanks guys! Nice place off the beaten path to relax.", "rating": 5, "date": "2015-06-16"}, {"excerpts": ["I ordered the sushi sashimi combo plate and the Family Affair roll. ", "The family affair roll is loaded with stacks and stacks of onions. "], "author": "Steven C.", "review": "I saw this as one of the higher rated sushi places near my place in SF. I also saw they had a check-in deal on 4square for spend $10 get $10 credited to your Amex account.\n\nI went here expecting so pretty good sushi. What I got was, very slow service and so-so sushi. \n\nI ordered the sushi sashimi combo plate and the Family Affair roll. The sashimi was fresh and the tuna roll it came with was filled with so much rice, you would have never known there was tuna in there except for this red looking spec\n\nThe family affair roll is loaded with stacks and stacks of onions. it tasted pretty good, but the roll sizes are small and the prices really don't justify them either.\n\nIt took a pretty darn long time for us to get our food and they came out at such staggered times that by the time our whole table received our food others were playing games on their iphone because they had finished already.\n\nI also asked for the black sesame ice cream that people raved about and the waitress told me they dont serve that hear. i seriously thought I was in the wrong restaurant because of the ratings they received and the service I had just gotten.\n\nThe PRO\nThe place is decorated with anime, so you can look at pictures of Pokemon and Naruto to sooth yourself while you wait for the food.\n\nI'm surprised this place got such good reviews, but without the Amex deal I would not return to this place for sushi", "rating": 2, "date": "2012-01-03"}, {"excerpts": ["Family Affair Roll:  ", "Though it is one of the pricier specialty sushi rolls on the menu, ($12.50 if i remember correctly), it was a delight to eat.  "], "author": "William F.", "review": "After being at game 5 of the NLCS and the its bitter defeat of our Giants with Timmy Lincecum on the mound - damn you phillies! - I found myself extremely hungry.  I felt as hungry as Paul Bunyon after a long day's work... yes, it is true.  So, I ventured onto my ailing iPhone - which is another story in itself - and found Sushi Toni's as the snickers to my hunger. \n\nOverall, I can't say I was too impressed.  The service was fast and I could overhear the sushi chef conversing with the patrons at the sushi bar, but I found myself next to a TV watching the highlights of the game I had just came from.  Boo.  Well, as this is my first review, I don't want it to be about the sour taste I had in my mouth from the game so hear it goes:\n\nFamily Affair Roll:  Though it is one of the pricier specialty sushi rolls on the menu, ($12.50 if i remember correctly), it was a delight to eat.  Tuna, white tuna, onions, cucumber, green onions, and tobiko.  All the ingredients seemed very fresh except the tobiko came off as a little stale and hard.  It just felt like i had a bunch of mini-BBs in my mouth.\n\n49'ers Roll:  Salmon, simo, avocado, tobiko, and lemon.  The lemon is sliced meticulously thin and placed on top of each individual piece of sushi.  Great taste as the mixture of the juicy lemon slice combines with the Salmon.\n\nWell there it is, I was in-and-out in a jiffy and wasn't displeased with the price but again, I was still bitter from an upsetting defeat on our home turf and would have given Sushi Toni more stars if it cured my depression of the night.\n\nB - OK", "rating": 3, "date": "2010-10-22"}, {"excerpts": ["I like the Family Affair roll (tuna, white tuna and cucumber) even though they get a little carried away with the white and green onion garnish on top. ", "The Red Dragon and Crunch rolls are also worth trying out. "], "author": "Larisa J.", "review": "Their maki rolls are creative, tasty and affordable. The 49er roll (tobiko, siso, avacado topped with salmon and a lemon wedge) tastes just as good as the salmon citrus roll at Michelin rated Sushi Ran. I'm a huge fan of seaweed salad, so the fact that I can get it over a spicy tuna roll and call is a Swamp roll is pretty perfect. Yelp reviewers rave about the Romeo and Juliet roll (salmon and avocado wrapped in soybean paper, topped with scallop) and I have to concur. I like the Family Affair roll (tuna, white tuna and cucumber) even though they get a little carried away with the white and green onion garnish on top. The Red Dragon and Crunch rolls are also worth trying out. They're also able to make spicy scallop handrolls, which are a favorite of mine ever since I moved to SF. Basic maki rolls range from $4.50-$6.50 and specialty rolls are on average $9-$10. Everything is rolled well and made with quality ingredients. If you're looking for an affordable sushi dinner, this is the place to go", "rating": 4, "date": "2013-03-27"}, {"excerpts": ["On that note the other \"Family Affair Roll", "\" I ordered was similar portion-wise, so that tells me that the \"Chef's Special Roll\" DEFINITELY was NOT worth $15.00!\n", "Worse of all, me & my daughter experienced an dull ache in the stomach afterward as if the food wasn't clean... ", "I know this could be an isolated case, but I wanted to note that anyway.\n", "We were polite & didn't say anything - I regret that. ", "This review wouldn't even surface actually if not for the stomach ache we experienced. ", "I feel indignant that there is bodily discomfort which prompted this review.\n", "It was more like the more you think about what you were served, the more it was frowned upon ESPECIALLY with the \"Chef's Special Roll\" which was a custom ordered item with what the customer wanted. "], "author": "Heather W.", "review": "Service is good - that was the best part, sadly.\nThe food is overpriced. Food tasted fine. There are other Sushi restaurants with better food & pricing & portion sizes.\nThe Chef's Special Roll was nothing special - even if I mentioned that Salmon is one of my favorite & I preferred white tuna than regular, both of which did not show up in my \"special\" roll. I was given regular tuna & yellowtail which he assumed I wanted after asking me if I liked that - which I said, \"Yea...h I suppose.\"\nOn that note the other \"Family Affair Roll\" I ordered was similar portion-wise, so that tells me that the \"Chef's Special Roll\" DEFINITELY was NOT worth $15.00!\nWorse of all, me & my daughter experienced an dull ache in the stomach afterward as if the food wasn't clean... I know this could be an isolated case, but I wanted to note that anyway.\nWe were polite & didn't say anything - I regret that. This review wouldn't even surface actually if not for the stomach ache we experienced. I feel indignant that there is bodily discomfort which prompted this review.\nIt was more like the more you think about what you were served, the more it was frowned upon ESPECIALLY with the \"Chef's Special Roll\" which was a custom ordered item with what the customer wanted. I didn't get my salmon nor my white tuna - totally INCONSIDERATE...!!!", "rating": 2, "date": "2011-04-15"}], "romeo and juliet roll": [{"excerpts": ["Romeo and Juliet roll and Black and White roll are highly recommended. ", "Cute graphic shirts for souvenirs too if you're interested."], "author": "Kim M.", "review": "Sushi Toni is a cute quaint little spot that was right across from the hotel we stayed at in San Fran. I was pretty impressed by the uni and had some pretty good udon. Romeo and Juliet roll and Black and White roll are highly recommended. Cute graphic shirts for souvenirs too if you're interested.", "rating": 4, "date": "2016-09-24"}, {"excerpts": ["We ordered the beef teriyaki dinner set, Nabe udon, Romeo and Juliet roll, black and white roll and unagi nigiri. \n", "Lets start off with what was good. ", "The romeo+Juliet roll was really good. ", "I recommend it to evertone. ", "The black and white roll was good too", ", I like the amount of spice they add to it. ", "I just enjoyed the romeo and Juliet a lot more, though. ", "The unagi nigiri is just like anywhere you can go for sushi. ", "I would come back here if I'm ever in the neighborhood, but that's probably not going to be often. ", "The service here was meh, we did come an hour before closing, so that could be why."], "author": "cadence p.", "review": "Great place for decent priced sushi. My brother and mother and I came here Monday night to dine in. We ordered the beef teriyaki dinner set, Nabe udon, Romeo and Juliet roll, black and white roll and unagi nigiri. \nLets start off with what was good. The romeo+Juliet roll was really good. I recommend it to evertone. The black and white roll was good too, I like the amount of spice they add to it. I just enjoyed the romeo and Juliet a lot more, though. The unagi nigiri is just like anywhere you can go for sushi. I would come back here if I'm ever in the neighborhood, but that's probably not going to be often. The service here was meh, we did come an hour before closing, so that could be why.", "rating": 4, "date": "2016-06-03"}, {"excerpts": ["The Romeo and Juliet roll is perfect. ", "It's melts in your mouth like butter"], "author": "Mark D.", "review": "If you're over 21, you must get the demon slayer sake. It's pairs perfectly with all the other dishes. The Romeo and Juliet roll is perfect. It's melts in your mouth like butter", "rating": 4, "date": "2016-10-16"}, {"excerpts": ["+ Reasonable prices compared to the other places nearby\n+ Nice service and staff although we never went when it was full\n+ Romeo and Juliet Roll\n+ BTS Roll & Dynamite Roll if you like bake/fried \n+ Rainbow Roll\n", "+ "], "author": "Manohak S.", "review": "We've eaten here a few times and the sushi is solid but not fancy. \n\n+ Reasonable prices compared to the other places nearby\n+ Nice service and staff although we never went when it was full\n+ Romeo and Juliet Roll\n+ BTS Roll & Dynamite Roll if you like bake/fried \n+ Rainbow Roll\n+ Yellow Tail Roll\n\n- Old/ weird decor and vibe\n- Not the most cleanest place\n- Rolls are on the smaller side\n- Miso soup was too salty and not impressive", "rating": 4, "date": "2014-08-21"}, {"excerpts": ["Romeo and Juliet roll is a must try! ", "Nigiri was perfect."], "author": "Brad H.", "review": "Great sushi and friendly people! Romeo and Juliet roll is a must try! Nigiri was perfect.", "rating": 5, "date": "2013-12-04"}, {"excerpts": ["I had the Romeo and Juliet roll based on a recommendation.  ", "It was very good.  ", "So was the Eel and avocado roll.  "], "author": "Mark B.", "review": "Very good and reasonably priced sushi.  I had the Romeo and Juliet roll based on a recommendation.  It was very good.  So was the Eel and avocado roll.  I also had the white tuna sushi.  Everyone was very friendly.  I would definitely go back.", "rating": 4, "date": "2016-01-14"}, {"excerpts": ["Next time I would like to try the Romeo and Juliet Roll.\n\n"], "author": "Tai F.", "review": "With SN in giant stilettos and me a little tired from a busy day fighting a parking ticket we couldn't muster the energy to go too far from the hotel for some sushi. Luckily Sushi Toni was right down the way (and reasonably close to a male strip club!) \n\nThe staff was nice but a little absent minded. They always seemed to be standing right outside of us thinking, \"Should I refill that water? When would be a good time to clear that plate? Are they ready to order?\" It was like they wanted to help but weren't quite sure how. \n\nAfter taking a fair amount of time to study the menu I made some decisions. Their specialty rolls are very unique and exciting. They offer some combinations I have not yet heard of. I would return just for that. \nI ended up with some salmon sushi and a volcano roll (crab, avocado, spicy sauce, eel sauce, tobiko) and a rainbow roll. \n\nSushi wise the salmon was pretty good. The rice wasn't warm (like I've experienced and not liked lately) and the fish was good quality. The rainbow roll was yummy too (though those are hard to mess up). The volcano roll (and I can't believe I'm going to say this) had just too much sauce. I love sauce. I love it all over things (and my face). But on this roll it overwhelmed anything that might have been happening. It still tasted good (as sauces often do) but it was pretty one noted. Next time I would like to try the Romeo and Juliet Roll.\n\nTo top off the meal we tried to order the black sesame ice cream but they were out. Sad story.\n\nI have a good vibe from here and it's clear they are really trying. With their exciting roll combinations it could have been largely my fault I had a so-so experience. I would be interested in testing out some of their other neat rolls.", "rating": 3, "date": "2011-08-09"}, {"excerpts": ["I liked the romeo and juliet roll, and the california roll, but I think everything is really \"standard\" or mediocre, nothing that was spectacular.  ", "I wouldn't eat here again if I had other options.  ", "I think I can definitely find better sushi somewhere in this town."], "author": "Zu W.", "review": "The fish quality here is good I will give them that.  The staff was friendly.  The decor was cool.  It had anime pictures all over, pretty cute.  \n\nMy boyfriend and I strolled in here really late one evening (11pm on Wed.) because we saw a huge sign at the door that said \"people on yelp love us\".  LoL I'm such a sucker.  Anyway so we found out he's been only opened for 2 months and the place is korean owned.\n\nHowever I'm rating 3 stars because the rolls were mediocre, they were rather stingy with the fish, and I thought it was over priced.  We ordered a 7 piece sashimi, which was $15 and the pieces were maybe 1in X 1in X 1/4in.  and it was \"top grade\" tuna (NOT TORO, just regular tuna).\n\nOwner plays bob marley all day long.  Got annoying after hearing the same song for the 10th time in one sitting. I like the idea that  he like reggae tho, cool dude.\n\nI liked the romeo and juliet roll, and the california roll, but I think everything is really \"standard\" or mediocre, nothing that was spectacular.  I wouldn't eat here again if I had other options.  I think I can definitely find better sushi somewhere in this town.", "rating": 3, "date": "2009-10-13"}, {"excerpts": ["Can't go wrong with the romeo and juliet roll made with soybean paper, lion king roll, hamachi kama or fresh scallops when they're available. "], "author": "Miriam K.", "review": "I had my raw oyster cherry popped here -- and it was unforgettable!\n\nChef Toni makes everything super fresh, goes out of his way to keep you entertained, and will provide the 411 on the detailed prep process behind the makings of his amazing fresh raw oysters or other yummy eats. \n\nCan't go wrong with the romeo and juliet roll made with soybean paper, lion king roll, hamachi kama or fresh scallops when they're available. Black sesame ice cream is a solid finisher too. \n\nCute and clean ambiance, good value, super sweet waitresses and just half a hop away from Union Square shopping or a night out on the town. I'm in withdrawal if I don't get my Sushi Toni fix at least once a week!", "rating": 5, "date": "2009-10-16"}, {"excerpts": ["my favorite was the romeo and juliet roll."], "author": "Jae C.", "review": "had dinner here a few weeks back. not sure what the complaints about bad service were for because we had great service. the sashimi and rolls were affordable and tasty.\n\nmy favorite was the romeo and juliet roll.", "rating": 4, "date": "2012-04-22"}, {"excerpts": ["Yelp reviewers rave about the Romeo and Juliet roll (salmon and avocado wrapped in soybean paper, topped with scallop) and I have to concur. ", "They're also able to make spicy scallop handrolls, which are a favorite of mine ever since I moved to SF. ", "Basic maki rolls range from $4.50-$6.50 and specialty rolls are on average $9-$10. ", "Everything is rolled well and made with quality ingredients. ", "If you're looking for an affordable sushi dinner, this is the place to go"], "author": "Larisa J.", "review": "Their maki rolls are creative, tasty and affordable. The 49er roll (tobiko, siso, avacado topped with salmon and a lemon wedge) tastes just as good as the salmon citrus roll at Michelin rated Sushi Ran. I'm a huge fan of seaweed salad, so the fact that I can get it over a spicy tuna roll and call is a Swamp roll is pretty perfect. Yelp reviewers rave about the Romeo and Juliet roll (salmon and avocado wrapped in soybean paper, topped with scallop) and I have to concur. I like the Family Affair roll (tuna, white tuna and cucumber) even though they get a little carried away with the white and green onion garnish on top. The Red Dragon and Crunch rolls are also worth trying out. They're also able to make spicy scallop handrolls, which are a favorite of mine ever since I moved to SF. Basic maki rolls range from $4.50-$6.50 and specialty rolls are on average $9-$10. Everything is rolled well and made with quality ingredients. If you're looking for an affordable sushi dinner, this is the place to go", "rating": 4, "date": "2013-03-27"}], "dynamite boom roll": [{"excerpts": ["My friend and I shared the Dynamite boom roll ($12.5), the Dragon roll ($14.5), and Tamago ($4). ", "I really liked the dynamite roll, which had unagi, lobster, and a bunch of other things topped with a nice spicy sauce. ", "It was my first time having tamago, which is suppose to be sweet dish. ", "The egg block tasted sweet but we are suppose to still dip it in soy sauce and wasabi. "], "author": "Wendy F.", "review": "Tasty Japanese food in Downtown! \n\nFOOD: My friend and I shared the Dynamite boom roll ($12.5), the Dragon roll ($14.5), and Tamago ($4). I really liked the dynamite roll, which had unagi, lobster, and a bunch of other things topped with a nice spicy sauce. It was my first time having tamago, which is suppose to be sweet dish. The egg block tasted sweet but we are suppose to still dip it in soy sauce and wasabi. Not bad though. \n\nSERVICE: We came in a party of 8 and the staff worked hard to bring all of our dishes out in a timely fashion, which I really appreciated. \n\nSETTING: The restaurant is pretty small and doesn't look too fancy. It's located on one of the hills close to Union Square, so any time you are craving for Japanese food you know where to go.\n\nPRICE: With tip and tax we each paid around $18. Japanese food is suppose to be pricey so I wasn't too surprised. \n\nOVERALL IMPRESSION: Pretty good sushi, but I think I had better quality and quantity food back home in Texas so my standards are pretty high.", "rating": 3, "date": "2015-06-21"}, {"excerpts": ["We ordered a Dynamite Boom roll, and it came with both avacodo and fish, which were not listed as ingredients (it was supposed to be squid, octopus, mussel, and shrimp). ", "In addition, my wife can't eat fish, and I'm allergic to avacodo. ", "Furthermore, the fish was not fresh at all; it tasted rotten! ", "Definitely a shady practice sneaking old fish into a roll (with lots of sauce to hide it). "], "author": "Josiah L.", "review": "Don't know why they have such good reviews. Perhaps for their plates, but their rolls are subpar at best. \n\nWe ordered a Dynamite Boom roll, and it came with both avacodo and fish, which were not listed as ingredients (it was supposed to be squid, octopus, mussel, and shrimp). In addition, my wife can't eat fish, and I'm allergic to avacodo. Furthermore, the fish was not fresh at all; it tasted rotten! Definitely a shady practice sneaking old fish into a roll (with lots of sauce to hide it). Later they said it was part of their \"secret recipe\" sauce. \n\nThey acted as though they would take it off our bill, but still charged us $3.70 for it!\n\nWe ordered a spider roll, which didn't taste great, but wasn't as bad as the first. We also ordered an asparagus roll, which was the best roll we ordered (not saying much). \n\nIt's one thing to have subpar rolls, but it's absolutely unacceptable to change the ingredients in an order.\n\nWe felt sick to our stomachs afterwards. \n\nFor a four-star comparison, try Aniki's Sushi, in Fremont.", "rating": 1, "date": "2015-07-17"}, {"excerpts": ["We ordered spicy scallops, uni, red snapper and yellowtail nigiri's, seaweed salad, dynamite boom roll, ice cream tempura and salmon+avocado roll.\n\n"], "author": "Alice W.", "review": "I felt like some sushi and didn't want to venture too far from the nest. After much research on yelp, we decided on Sushi Toni. We ordered spicy scallops, uni, red snapper and yellowtail nigiri's, seaweed salad, dynamite boom roll, ice cream tempura and salmon+avocado roll.\n\nWe sat at the bar and the chef/owner was very friendly and chatted us up as we were waiting for the food. The fish tasted fresh and the service was friendly. Definitely worth a try.", "rating": 4, "date": "2011-10-09"}], "ers roll": [], "potato bug roll": [{"excerpts": ["I had a cucumber salad, the Naruto roll and the Potato Bug roll. ", "Naruto was a sashimi roll, wrapped in cucumber and sans rice. ", "Potato Bug is basically an eel cucumber roll topped with eel. ", "I prefer mine without extra unagi sauce and no aioli "], "author": "Kate D.", "review": "Decent sushi place in the Nob Hill area. I had a cucumber salad, the Naruto roll and the Potato Bug roll. Naruto was a sashimi roll, wrapped in cucumber and sans rice. Potato Bug is basically an eel cucumber roll topped with eel. I prefer mine without extra unagi sauce and no aioli so I can actually taste my food. \n\nPortions were decent and the food was good, if unremarkable. It's good sushi. Just not outstanding sushi.", "rating": 4, "date": "2018-06-08"}], "bts roll": [{"excerpts": ["+ Reasonable prices compared to the other places nearby\n+ Nice service and staff although we never went when it was full\n+ Romeo and Juliet Roll\n+ BTS Roll & Dynamite Roll if you like bake/fried \n+ Rainbow Roll\n", "+ "], "author": "Manohak S.", "review": "We've eaten here a few times and the sushi is solid but not fancy. \n\n+ Reasonable prices compared to the other places nearby\n+ Nice service and staff although we never went when it was full\n+ Romeo and Juliet Roll\n+ BTS Roll & Dynamite Roll if you like bake/fried \n+ Rainbow Roll\n+ Yellow Tail Roll\n\n- Old/ weird decor and vibe\n- Not the most cleanest place\n- Rolls are on the smaller side\n- Miso soup was too salty and not impressive", "rating": 4, "date": "2014-08-21"}, {"excerpts": ["The BTS roll is my favorite.\n\n"], "author": "Jack C.", "review": "A trip to Sushi Toni makes you remember why sushi is so popular in California!  Great service, great food, and if you are very lucky a jolly Toni will be there to tell you stories or cheer you to more saki!\n\nThe BTS roll is my favorite.\n\nAsk Toni for the Special Roll and he will create something fabulous... we had a shrimp and lobster roll last time. Amazing!", "rating": 5, "date": "2012-05-09"}, {"excerpts": ["Favorites include: salmon roll for a light, simple dish; BTS roll (deep friend california roll drizzled in delicious sauce), great for an American palette; anything with eel.\n\n"], "author": "Nicolas B.", "review": "Pros: service is great -- Toni himself is very friendly --, price per portion is competitive, and the sushi is fantastic!  Favorites include: salmon roll for a light, simple dish; BTS roll (deep friend california roll drizzled in delicious sauce), great for an American palette; anything with eel.\n\nCons: the space is a little cramped.\n\nI strongly recommend going with a group so you can try several different dishes, most people have their particular favorites.\n\nThis is by far my favorite sushi restaurant in the city.", "rating": 5, "date": "2012-02-24"}], "cilantro roll": [{"excerpts": ["Get the cilantro roll - it has thin sliced lime on top. "], "author": "Wesley M.", "review": "Really had a good time at this restaurant last night. Good, affordable, and inventive sushi rolls that I haven't had anywhere else. Get the cilantro roll - it has thin sliced lime on top. It's my absolute favorite. \n\nThe head chef is really cool and approachable. Give this place a try in the Union Square area. I wouldn't recommend going with a group larger than 4 since it's a small place.", "rating": 5, "date": "2016-06-21"}, {"excerpts": ["Naruto, 49er and cilantro roll are the BOMB!!!!"], "author": "Duangta M.", "review": "Oh my god!!! it's very very good. I almost cry when I ate my first bite. I'm a sushi lover, I eat sushi once a week.\n\nthis place serve u very good and fresh food. it's so awesome!!!!! I love this place. \n\nNaruto, 49er and cilantro roll are the BOMB!!!!", "rating": 5, "date": "2016-11-05"}, {"excerpts": ["Coming back to Sushi,  we usually order the Cilantro Roll,  California Roll,  ", "Lion King Roll and Donbura - ", "all of which have the freshest seafood and taste fantastic. ", "If I could give these guys 10 stars,  I would!  ", "Please keep doing what you are doing.  "], "author": "Sun B.", "review": "My review is long overdue!  This restaurant has served us so well.  My husband and I met here while dating,  then got married and often visited.  Then got pregnant and often visited.  We have wonderful memories here since many years.  It is a small and cute place to eat some freshly prepared sushi and etc.  Given the awesome service that we receive each time,  we often visit this restaurant for special occasions too.  If you,  the owner is reading this,  then we want to let you know that we asked for you the last time we visited (which was last week) to let you know how much we love dining at Sushi Toni.\n\nComing back to Sushi,  we usually order the Cilantro Roll,  California Roll,  Lion King Roll and Donbura - all of which have the freshest seafood and taste fantastic. If I could give these guys 10 stars,  I would!  Please keep doing what you are doing.  We look forward to visiting your restaurant for decades and decades [ incl future generation :-) ]\n\nHats off to the owner for having such an  awesome restaurant and staff!  We are highly impressed by both their service and food each time.", "rating": 5, "date": "2016-02-18"}, {"excerpts": ["Would recommend the Cilantro Roll."], "author": "David M.", "review": "Love this place.  Casual sushi bar near Union Square.  I was in San Francisco last week and went there twice.  The sushi is always fresh and the staff is always attentive.  Would recommend the Cilantro Roll.", "rating": 5, "date": "2017-09-18"}, {"excerpts": ["Cilantro roll, 49ers roll, and the volcano roll are my favorites."], "author": "Steven X.", "review": "Fantastic place with seating always available. Lovely selection and quick service since it's a small place. Our last visit there we sat at the bar with Toni, who had lots of fun stories! We try to go as often as we can, even after we moved to South Bay. Cilantro roll, 49ers roll, and the volcano roll are my favorites.", "rating": 5, "date": "2015-09-20"}, {"excerpts": ["Nabeyaki udon, Unagi was awesome, tempura and the cilantro roll \nI would highly recommend this place as a previous Japanese restaurant owner the quality is very good,"], "author": "David C.", "review": "This place ricks.  What a pleasant surprise. Sushi is very fresh and everything we ordered tasted great.  Nabeyaki udon, Unagi was awesome, tempura and the cilantro roll \nI would highly recommend this place as a previous Japanese restaurant owner the quality is very good,", "rating": 5, "date": "2014-11-28"}, {"excerpts": ["The 49er roll and cilantro roll are delicious too. ", "I always come to this place after a trip to Union Square!"], "author": "Dean T.", "review": "Three words... Yum Yum Roll. So good and tasty. I don't care if it's not really the way the Japanese people imagined their dish served! The 49er roll and cilantro roll are delicious too. I always come to this place after a trip to Union Square!", "rating": 5, "date": "2014-06-10"}, {"excerpts": ["One of the best sushi rolls I had was the \"cilantro roll\"!! ", "The chef knows what he's doing and could customize any awesome rolls that you ask for, right at the spot."], "author": "Jennifer Y.", "review": "From the friendliest  customer service to the freshest sashimi and sushi, I would definitely come back. One of the best sushi rolls I had was the \"cilantro roll\"!! The chef knows what he's doing and could customize any awesome rolls that you ask for, right at the spot.", "rating": 5, "date": "2013-12-19"}], "yum yum roll": [{"excerpts": ["Yum Yum roll: ", "A 5/5 from me! ", "So crunchy and so yum yum. "], "author": "Marissa F.", "review": "Fast service, cozy environment, and reasonable prices for being so close to touristy Union Square. \n\nLion King roll: BF gave it a 5/5. The combo of warm crab, lemony goodness from the salmon, and melted mozzarella cheese was a delicious change from the cold rolls he ordered.\n\nYum Yum roll: A 5/5 from me! So crunchy and so yum yum. The sauces and crunch added to the cool taste of avocado and crab. \n\nWe also ordered a standard Philadelphia roll, shrimp and crab roll, and a shrimp and asparagus roll. The three were a bit small but still good and fresh-tasting. \n\nI'm sure we'll be back again, Sushi Toni! I look forward to visiting again.", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["Yum yum roll is crunchy and creamy and the 49er roll is refreshing. "], "author": "Marilee A.", "review": "First time here and tried two sushi rolls.\nYum yum roll is crunchy and creamy and the 49er roll is refreshing. The miso soup and salad are also good! \n\nThe service is good but kind of slow with the orders. We had a part of 6 so it may have been that but we all got our orders 10 mins apart.", "rating": 5, "date": "2016-10-22"}, {"excerpts": ["I got the \"yum yum roll\" and it was pretty horrible to be honest ", "I was super disappointed since I took Uber just to get there ", "I felt very ripped off. ", "Total waste of money I can get way better sushi at many other places in the city. ", "Sorry guys :-("], "author": "Rita A.", "review": "I'm honestly not sure why this place has 4 stars. I got the \"yum yum roll\" and it was pretty horrible to be honest I was super disappointed since I took Uber just to get there I felt very ripped off. Total waste of money I can get way better sushi at many other places in the city. Sorry guys :-(", "rating": 2, "date": "2015-10-25"}, {"excerpts": ["I ordered the yum yum roll and the spicy tuna and the spicy tuna was so fresh and had amazing spices, you can tell the fish they get is fresh and the service was awesome!\n\n"], "author": "Jackie H.", "review": "I LOVED this sushi place!! I'm a sushi fanatic so I'm very picky about my sushi, but their rolls were amazing! My sister got the avocado roll (very simple) and said it was the best roll she's ever had\n\nI ordered the yum yum roll and the spicy tuna and the spicy tuna was so fresh and had amazing spices, you can tell the fish they get is fresh and the service was awesome!\n\nWe were in and out of there in no time but they do not rush you at all, I was incredibly pleased with the service there and I will 100% go back.", "rating": 5, "date": "2017-02-19"}, {"excerpts": ["We ordered take out of the Lion King roll and Yum Yum roll. ", "Both were delicious. ", "Lion King roll was only 6 pieces though, but very unique and tasty. ", "Loved the tempura bits on Yum Yum roll. ", "Well priced for sushi near Union Square."], "author": "M L.", "review": "We ordered take out of the Lion King roll and Yum Yum roll. Both were delicious. Lion King roll was only 6 pieces though, but very unique and tasty. Loved the tempura bits on Yum Yum roll. Well priced for sushi near Union Square.", "rating": 4, "date": "2016-12-16"}, {"excerpts": ["We ordered the 49ers roll and the Yum Yum roll with a Peach J Pop drink (the drink was pretty awesome)."], "author": "Anna L.", "review": "Overall: 3.8/5\n\nStaff: 4/5 - The place is quite small so the waitress we had was attentive. She wasn't very talkative, but polite non the less.\n\nAtmosphere: 4/5 - Again, the place was small, so it was rather cozy. You could sit at a table, or sit at a bar and watch them male the sushi\n\nMenu: 3.75/5 There was a good variety of sushi and an appropriate amount of selections for the average diner. They even had pictures :)\n\nPrice: 3.75/5 - Coming from Minneapolis, where we have thousands of lakes but no oceans to catch wonderful fish from, I had imagined that the prices would be cheaper. However, I still give it a 3.5 considering it is San Francisco, and everything else around was quite a bit pricier. \n\nQuality of food: 3.5/5 - I enjoyed the sushi as much as any other sushi I have had. It wasn't exquisite, but it wasn't disastrous either. We ordered the 49ers roll and the Yum Yum roll with a Peach J Pop drink (the drink was pretty awesome).", "rating": 4, "date": "2015-09-24"}, {"excerpts": ["Ordered the yum yum roll, the volcano roll, and the lion king roll and they were all delicious!!! ", "I would definitely recommend trying this place out."], "author": "Tiffany L.", "review": "Ordered the yum yum roll, the volcano roll, and the lion king roll and they were all delicious!!! I would definitely recommend trying this place out.", "rating": 5, "date": "2016-08-24"}, {"excerpts": ["Yum Yum Roll. ", "So good and tasty. ", "I don't care if it's not really the way the Japanese people imagined their dish served! "], "author": "Dean T.", "review": "Three words... Yum Yum Roll. So good and tasty. I don't care if it's not really the way the Japanese people imagined their dish served! The 49er roll and cilantro roll are delicious too. I always come to this place after a trip to Union Square!", "rating": 5, "date": "2014-06-10"}], "black  white roll": [], "naruto roll": [{"excerpts": ["I had a cucumber salad, the Naruto roll and the Potato Bug roll. ", "Naruto was a sashimi roll, wrapped in cucumber and sans rice. ", "Potato Bug is basically an eel cucumber roll topped with eel. ", "I prefer mine without extra unagi sauce and no aioli "], "author": "Kate D.", "review": "Decent sushi place in the Nob Hill area. I had a cucumber salad, the Naruto roll and the Potato Bug roll. Naruto was a sashimi roll, wrapped in cucumber and sans rice. Potato Bug is basically an eel cucumber roll topped with eel. I prefer mine without extra unagi sauce and no aioli so I can actually taste my food. \n\nPortions were decent and the food was good, if unremarkable. It's good sushi. Just not outstanding sushi.", "rating": 4, "date": "2018-06-08"}, {"excerpts": ["I finished with the naruto roll. ", "The naruto doesn't have rice so the favors are delicate. ", "The service was spot on. ", "Overall it was very good."], "author": "Nancy L.", "review": "Delicious. I'm surprised at some of the negative reviews. The sushi, rolls, and nigiri were delicious. I tried the salmon and octopus nigiri and found it tasty with a good texture. Next up was the family affair roll which had a great fresh taste to it. I finished with the naruto roll. The naruto doesn't have rice so the favors are delicate. The service was spot on. Overall it was very good.", "rating": 4, "date": "2016-04-19"}, {"excerpts": ["Chirashi bowl and Naruto roll is always fresh and delish but not enough to fill me up. ", "We usually get the other fulfilling rolls like dragon roll, rainbow roll and sake maki's (salmon basic roll). ", "I think this is the only sushi place nearby that is fresh, affordable and gets us full! ", "We are pretty much a regular here."], "author": "Sharmaine M.", "review": "I look forward to laundry only because on the way, bf treats me to Sushi Toni :) Every time we come here all their fish are fresh!  Staff usually welcomes us every time we enter and they are very attentive. Chirashi bowl and Naruto roll is always fresh and delish but not enough to fill me up. We usually get the other fulfilling rolls like dragon roll, rainbow roll and sake maki's (salmon basic roll). I think this is the only sushi place nearby that is fresh, affordable and gets us full! We are pretty much a regular here.", "rating": 5, "date": "2016-03-06"}, {"excerpts": ["Naruto roll also was standard and nothing special. ", "I feel ike they cheated though because they used a piece of soy paper whereas other restaurants usually do not do that."], "author": "Tao Tao W.", "review": "2.5 stars - not that impressed at all but i will say that they were very nice and accomodating but food wise NOT IMPRESSED...\n\nWe got the gyoza - standard\n\nI asked for a chirashi sans rice and if you see the picture. It was SO NOT worth $20. I got like 2-3 pieces of tuna, salmon, and another fish. I also asked for an order of nigiri unagi which they put in the same to go container so I'm not sure if they subbed out the other pieces but compared to the normal Chirashi that my fiance got, it was very much on the week side. \n\nNaruto roll also was standard and nothing special. I feel ike they cheated though because they used a piece of soy paper whereas other restaurants usually do not do that.", "rating": 2, "date": "2014-04-01"}, {"excerpts": ["the Naruto roll $14 and Romeo & Juliet roll $12.50. ", "The Naruto roll is a no rice roll wrapped in cucumber. ", "It was very bland. ", "Tasted like the fish had been frozen and defrosted, there was no flavor whatsoever. ", "This roll was 5 pieces and definitely not worth the $14."], "author": "Sandy G.", "review": "More like 3.5 stars. The inside of the restaurant is pretty small so we decided to order food to go and eat it back at the hotel. Tried the beef teriyaki combo-$18. Steak was on the thin side and a little tough, prob due to being overcooked. The tempura it came with was nice and crunchy. The 5 piece Calif. roll that was included was really good, tasted creamy. Imitation crab was used. Also ordered two rolls- the Naruto roll $14 and Romeo & Juliet roll $12.50. The R&J roll was salmon, rice and avocado wrapped in soybean paper topped with a large scallop in a light eel sauce. It was really really good! I loved it!  The Naruto roll is a no rice roll wrapped in cucumber. It was very bland. Tasted like the fish had been frozen and defrosted, there was no flavor whatsoever. This roll was 5 pieces and definitely not worth the $14.", "rating": 3, "date": "2014-07-24"}], "unakyu maki": [{"excerpts": ["For the Rainbow Roll, Unakyu Maki roll, Tuna Sashimi, and philadelphia roll plus 2 orders of mochi's it "], "author": "Anthony J. C.", "review": "Staff is super friendly and there's live music here from 8:30 pm-11pm I think.\n\nFor the Rainbow Roll, Unakyu Maki roll, Tuna Sashimi, and philadelphia roll plus 2 orders of mochi's it came out to about $45, so prices aren't too high. \n\nI'll eat Sushi to Beyonce and Bob Marley anyday", "rating": 4, "date": "2009-10-07"}], "double hamachi roll": [], "chef special roll": [], "sushi combo a": [{"excerpts": ["Single Sushi combo A ($15.50)\npic: ", "http://www.yelp.com/biz_photos/sushi-toni-san-francisco?select=VmapT0TjLtfx5lmc2BPcfA\n", "Just tried a piece of nigiri, and it was good! ", "Can't really rate the whole thing based on one little piece but my friend enjoyed it and it's his go-to dish here."], "author": "Ziyan C.", "review": "Not a bad spot, not super memorable either. They use quality ingredients, the rice is sticky and soft.\n\nTotal $33 including tax/tip, for a light dinner for two.\n\n* Romeo & Juliet roll - 3.5 stars\npic: http://www.yelp.com/biz_photos/sushi-toni-san-francisco?select=VmapT0TjLtfx5lmc2BPcfA#rPDS6zkIM16WF_au9zD92g\n(soybean paper with salmon & avocado, scallop outside with tobika. $9.95)\nI love salmon + avocado, and this had a hint of sweet flavoring.\n\n* Single Sushi combo A ($15.50)\npic: http://www.yelp.com/biz_photos/sushi-toni-san-francisco?select=VmapT0TjLtfx5lmc2BPcfA\nJust tried a piece of nigiri, and it was good! Can't really rate the whole thing based on one little piece but my friend enjoyed it and it's his go-to dish here.", "rating": 3, "date": "2013-05-18"}, {"excerpts": ["We got the sushi combo A", ", Dragon roll, rainbow roll, sake nigiri, unagi nigiri, and a couple appetizers and ", "they all tasted great. ", "The fish was quite fresh and the service here was amazing. ", "Definitely will come back again."], "author": "Tim P.", "review": "Loved my experience here. We arrived at about 9:45 and got seated right away by our friendly waitress. We got the sushi combo A, Dragon roll, rainbow roll, sake nigiri, unagi nigiri, and a couple appetizers and they all tasted great. The fish was quite fresh and the service here was amazing. Definitely will come back again.", "rating": 5, "date": "2017-08-26"}], "sushi combo b": [], "sushi combo c": [{"excerpts": ["I got the sushi combo C and ", "everything on it was high quality and tasty. ", "The sushi chef toasted one of the nigri with a blow torch and it had the most amazing flavor. "], "author": "Brenna H.", "review": "Very good sushi! I got the sushi combo C and everything on it was high quality and tasty. The sushi chef toasted one of the nigri with a blow torch and it had the most amazing flavor. I'd order that again and again!\n\nThe miso soup and salad that came with it were only OK... I actually had better last weekend in Front Royal, VA. Who would have thought? Definitely not me.", "rating": 4, "date": "2014-08-26"}], "serious nigiri combo": [], "ikura don": [], "sake don": [], "saba mackerel": [], "tako steamed octopus": [], "tai red snapper": [], "sake salmon": [], "maguro tuna": [], "hamachi yellowtail": [], "albacore white tuna": [], "chefs choice pcs": [], "sas deluxe": [], "sushi  sashimi deluxe": [], "super deluxe": [], "vegetable tempura pcs": [], "combo tempura pcs shrimps pcs vegetable": [], "shrimp tempura pcs": [], "beef katsu": [], "ribeye steak teriyaki": [], "vegetable udon": [{"excerpts": ["The vegetable udon I got was rather bland.  ", "The soup had no flavor and even after adding soy sauce I felt like I wasn't getting much out of the flavor (besides soy sauce, which is not really what you want from udon).  ", "Definitely pass on this item."], "author": "Danielle C.", "review": "This review is, ironically, not really about the sushi since I don't really eat sushi (I don't like seafood much).  So, take this review with a grain of salt.\n\nThis restaurant seems a little bit homey but divey at the same time.  It's dimly lit.  There's a sushi bar but of course you can sit out in the main area.\n\nTheir ikura (salmon roe) was rather fresh, which is great!  I did like their house salad and the dressing that came along with it.  Some Japanese places have really good dressing, and I'll put this one on that list.\n\nThe vegetable udon I got was rather bland.  The soup had no flavor and even after adding soy sauce I felt like I wasn't getting much out of the flavor (besides soy sauce, which is not really what you want from udon).  Definitely pass on this item.", "rating": 3, "date": "2014-07-23"}, {"excerpts": ["The vegetable udon was blah. "], "author": "George S.", "review": "The rice on the sushi was terrible. The vegetable udon was blah. You can do much better at the same price.\n\nThe salmon nigiri was fresh and good, though.", "rating": 2, "date": "2011-11-14"}, {"excerpts": ["We had the baked salmon roll, salmon teriyaki, vegetable tempura, and vegetable udon."], "author": "Zach S.", "review": "We're giving this place a 4 star review just because Toni is so hilarious.  He's really a class act. He's funny, interesting, and surely will entertain you.  Sit close to the sushi bar.  We had the baked salmon roll, salmon teriyaki, vegetable tempura, and vegetable udon.", "rating": 4, "date": "2010-06-25"}], "nabe udon": [{"excerpts": ["We ordered the beef teriyaki dinner set, Nabe udon, Romeo and Juliet roll, black and white roll and unagi nigiri. \n", "Lets start off with what was good. ", "The romeo+Juliet roll was really good. ", "I recommend it to evertone. ", "The black and white roll was good too", ", I like the amount of spice they add to it. ", "I just enjoyed the romeo and Juliet a lot more, though. ", "The unagi nigiri is just like anywhere you can go for sushi. ", "I would come back here if I'm ever in the neighborhood, but that's probably not going to be often. ", "The service here was meh, we did come an hour before closing, so that could be why."], "author": "cadence p.", "review": "Great place for decent priced sushi. My brother and mother and I came here Monday night to dine in. We ordered the beef teriyaki dinner set, Nabe udon, Romeo and Juliet roll, black and white roll and unagi nigiri. \nLets start off with what was good. The romeo+Juliet roll was really good. I recommend it to evertone. The black and white roll was good too, I like the amount of spice they add to it. I just enjoyed the romeo and Juliet a lot more, though. The unagi nigiri is just like anywhere you can go for sushi. I would come back here if I'm ever in the neighborhood, but that's probably not going to be often. The service here was meh, we did come an hour before closing, so that could be why.", "rating": 4, "date": "2016-06-03"}, {"excerpts": ["The nabe udon comes out in a hot iron mini-pot. ", "It is hot (I know this because I am lame and touched it even though the waitress said not to). ", "Every bit is filled with something: chicken, calamari, shrimp, mussel...", "you name it, it's there! ", "Most Japanese places are hella shady about their nabe ingredients. ", "You may get ONE shrimp or ONE clam, but definitely not the infinite portions i received at Sushi Tony! ", "Toni! ", "Toné!!! ", "And the broth was simply divine. "], "author": "A A.", "review": "This place should be called Sushi Tony! Toni! Toné!...or Sushi Bel Biv DeVoe...or Sushi Keith Sweat. Why, you ask? Lemme tell you why. Not only did the boy and I enjoy some bomb@ss grub, but we did so to the tunes of the aforementioned, as well as Jon B, Shai, H-Town, New Edition and more of the smooth R&B jams I used to bump when I was in my teenage-angst phase.\n\nSo imagine my delight when I walked into this tiny, cozy restaurant right by Union Square and the first thing I hear is, \"Ahhhh, yeah....Give me some good love (some body rockin, knockin da boots)...Some body rockin baby, Give me some good love (some body rockin, knockin da boots)\" Uh-huh. Word. This place is the truth. But five star review for the music aside, this place was a real surprise. I don't expect much in terms of quality or value at any restaurant in the vicinity of Union Square. But Sushi Tony! Toni! Toné! (yes, I will refer to this place as such from now on) is both yummy and affordable.\n\nOur meal breakdown:\n\n* Romeo & Juliet Roll- absolutely delicious! This roll is described as salmon & avocado inside with scallops on top. Now I am not a fan of raw scallops, or scallops in general, but this roll was SO good! And for $9.95, there were at least 7 or 8 pieces! The salmon slices were fresh and perfectly complemented the avocado squares. Again, the scallops were delicious. Almost melted in our mouths!\n\n* Chirashi- This is the boy's go-to Japanese order. Always. Anywhere. Anytime. This is his barometer. Chirashi (chef's choice of sashimi-styled sushi atop vinegared rice) at Sushi Tony! Toni! Toné! was amazing! Unlike other Japanese restaurants, they served their Chirashi in a longer, but more shallow bowl. Most places serve it in a bowl (kinda like what you would eat udon or cereal out of). Sushi Tony! Toni! Toné! gave generous portions, thick (but well-cute sashimi slices) and they put furikake (AKA the salt & pepper of Japan- it's got sesame seeds, spices, and seaweed) atop the vinegared rice. This extra flavoring took this Chirashi plowl (plate + bowl = zinger!) to another level. Definite re-order. MUST TRY THIS, PEOPLE! $18.\n\n*  Nabe Udon- Sadly, $12.50 cannot buy you much these days. Especially for Japanese. That's what- 2 1/3 pieces of sashimi at some uppity joint? Or maybe 7/8 of a specialty roll? Well at Sushi Tony! Toni! Toné! , $12.50 bought me all that is good and right in the world.  This dish takes a while to make, so if you are super starved, you may need a starter to tide you over til the real deal. The nabe udon comes out in a hot iron mini-pot. It is hot (I know this because I am lame and touched it even though the waitress said not to). Every bit is filled with something: chicken, calamari, shrimp, mussel...you name it, it's there! Most Japanese places are hella shady about their nabe ingredients. You may get ONE shrimp or ONE clam, but definitely not the infinite portions i received at Sushi Tony! Toni! Toné!!! And the broth was simply divine. Not too salty, but perfectly flavored.\n\n*** each entree comes with salad  and soup (tho noodles will not get miso soup since you're eating soup as an entree ***\n\nMiscellaneous Mentionings-\nThere were lots of 20 and 30-somethings in the restaurant when the boy and I went. Many of whom had a little too much Sake. One table went buckwild when \"Rumpshaker\" came on. One dude walked up to a girl at another table and threw his number at her (she didn't take it). All through this, the waitresses and sushi chefs stayed professional and friendly.\n\nSo aside from reliving my junior year of high school by listening to the grooves of the 90s, I got fed and fed WELL. This place is a definite revisit. \"FICKLE ONE\"- APPROVED. Betta recognize! =)", "rating": 5, "date": "2011-02-03"}], "chicken donburi": [{"excerpts": ["I've also had the Chicken Donburi and ", "while I did enjoy it, I don't think there was anything really unique or enticing about it. ", "It's quite plain. "], "author": "Priya S.", "review": "When I'm craving a no-frills, casual, local sushi spot w/ some of the friendliest waiters and waitresses I've met, I come to Sushi Toni.\n\nI am a huge fan of specialty rolls and am not really into sashimi or any type of raw fish so Sushi Toni is quite perfect for me. They have some of the best specialty rolls - the Volcano Roll here is seriously incredible - it's fatty, creamy, filled with freshly baked salmon and a special sauce that will make you ecstatic. Close contenders are the Dragon Roll, the Lion King Roll and the Crunch Roll. \n\nI've also had the Chicken Donburi and while I did enjoy it, I don't think there was anything really unique or enticing about it. It's quite plain. So I'd recommend sticking to the specialty rolls and the actual sushi items instead of the rice bowls. \n\nHappy Eating, Yelpers!\n\nP.S. It's conviniently located about 2 blocks from the Sutter Stockton Garage for all the drivers out there and it's within a 3 - 4 block radius from Union Square.", "rating": 4, "date": "2013-03-15"}, {"excerpts": ["The food was really good, but I have to say that it is not very Japanese-y as I tasted lots of flavors in our tempura udon (w/ salad) and chicken donburi (w/ salad & miso soup) that tasted more Korean than Japanese (the giveaway was the prevalent sesame seasoning).  "], "author": "Maile N.", "review": "We went to Sushi Toni for dinner last night out of curiosity as I pass by this place often walking around my neighborhood.  The food was really good, but I have to say that it is not very Japanese-y as I tasted lots of flavors in our tempura udon (w/ salad) and chicken donburi (w/ salad & miso soup) that tasted more Korean than Japanese (the giveaway was the prevalent sesame seasoning).  Don't get me wrong, I still liked our dishes a lot (and I love Korean food!), but really, this place is a fusion of Japanese and Korean food and flavors.  \n\nGood tempura batter (not too thick) and the miso soup was right on.  \n\nThe decor is definitely Korean-influenced, tea cups would normally be much thicker so you don't burn your hands on the hot green tea contents, and soup spoons are not normally given with miso soup.  \n\nService was really nice and friendly, and it's an upbeat place with lively music (I hear there is live music now and then - very cool!).  I might come back to try the sushi.\n\nTempura udon+chicken donburi+2 hot teas = $25\n\nLastly, my sincere condolences to the family of the owner of the previous restaurant located here called Sushi Man.", "rating": 3, "date": "2009-10-23"}], "chicken teriyaki combo": [], "beef teriyaki combo": [], "salmon teriyaki combo": [], "tonkatsu combo": [], "tempura banana": [{"excerpts": ["This rating would have been lower, but upon remarking that the sushi wasn't that good they gave a free dessert of tempura banana and ice cream. ", "I appreciated that."], "author": "Robert M.", "review": "I went with my girlfriend and her parents on a Friday evening. We ordered some of their standard sushi rolls (Dragon, Caterpillar, Spider roll, and Spicy Tuna) and they were just not up to par with other sushi places we've been to. The presentation was good, but the fish ingredients seemed far from fresh. These are fairly standard rolls for SF, so I expected better. This rating would have been lower, but upon remarking that the sushi wasn't that good they gave a free dessert of tempura banana and ice cream. I appreciated that.", "rating": 3, "date": "2015-09-01"}], "tempura banana with ice cream": []}