{"whole squid": [{"excerpts": ["I loved their whole squid it was so juicy and chewy. "], "author": "Tina C.", "review": "We were seated right away when we got there at 7pm. Customer Service was top notch because whatever we need they would bring it to us immediately. I loved their whole squid it was so juicy and chewy. Everything was really fresh, my personal favorite was their volcano roll and four seasons roll. I would definitely come back next time when I'm in the neighborhood.", "rating": 5, "date": "2016-07-10"}, {"excerpts": ["-Agedashi tofu (Not bad, not the best)\n-Grilled whole squid (I like the dipping sauces that come with it)\n-Tuna ", "poki (Really good, tuna was fresh)\n-Sake ", "sashimi (My fave!)\n", "-Red ", "dragon roll (Not memorable)\n-Lion ", "king roll (", "Not as good as Sushi House's)\n-Lover's roll (Not memorable)\n-Hot summer roll ", "(The only thing I remember is that it was spicy)\n", "-Fresh uni (No offense, but it was like licking the sea floor, guh-ross! "], "author": "Audrey T.", "review": "I wasn't in charge of ordering, so I can't give you the full rundown of everything that we had. Items I do remember:\n\n-Edamame (Normal edamame--it's hard to screw up edamame after all)\n-Grilled lamb chop with house sauce (Didn't have any; I don't eat lamb)\n-Agedashi tofu (Not bad, not the best)\n-Grilled whole squid (I like the dipping sauces that come with it)\n-Tuna poki (Really good, tuna was fresh)\n-Sake sashimi (My fave!)\n-Red dragon roll (Not memorable)\n-Lion king roll (Not as good as Sushi House's)\n-Lover's roll (Not memorable)\n-Hot summer roll (The only thing I remember is that it was spicy)\n-Fresh uni (No offense, but it was like licking the sea floor, guh-ross! Not my thing!)\n-Amaebi \n-Warm sake (Good for washing out the taste of uni)\n\nThe best was definitely the sake sashimi though our second plate was a bit frostbitten, which means it's fresh, right? Yes, service is on the slow side, but we ordered a lot of food and the place was pretty packed, so it was expected.\n\nOh yeah, they accidentally gave us this random roll, we ate it all before we realized it, and the waitresses never figured it out. Oops, sorry to whoever didn't get their roll!", "rating": 3, "date": "2010-07-30"}], "cold tofu": [], "ankimo sashimi": [], "tuna poki sashimi": [], "albacore tataki sashimi": [], "tokyo ahi sashimi": [], "albacore poki sashimi": [], "pieces halibut carpaccio": [], "pieces chirashi": [], "waru sashimi": [], "hamachi belly nigiri sushi": [], "hotategai nigiri sushi": [], "saba nigiri sushi": [], "uni nigiri sushi": [], "otoro nigiri sushi": [], "sake belly nirgiri sushi": [], "kobe beef nigiri sushi": [], "nigiri tasting combo": [], "avo kyu roll": [], "negihama maki roll": [], "haight street roll": [], "devil mountain deep fried roll": [], "city roll": [{"excerpts": ["The City Roll was a complex play on texture with crispy soft shell crab, succulent yellow tail, and fatty avocado. "], "author": "Sean S.", "review": "I used to frequent their excelsior location on mission street very often when I lived in the area, but since I moved they shut down and this is the closest Raw to me. I had only been to this location one time before and enjoyed it but with so many other options wasn't compelled to come back. In the last 5 years they've remodeled their inside and definitely upped their game because this place is solid. \n\nAll the nigiri i had was incredibly fresh, highlighted t the always stunning sake belly. The fish was perfectly presented and lush in color with a great ratio of plump meat to soft rice. \n\nBoth rolls I tried were also knockouts. The City Roll was a complex play on texture with crispy soft shell crab, succulent yellow tail, and fatty avocado. It towed the line between over the top American and more traditional in a way that really spoke to me. \n\nThe Mexican Desert Roll was more rich and absolutely awesome. Perfectly presented with little slides of jalapeño and dabs of hot sauce atop squishy imitation crab and seared smoky albacore. It legit tasted like sushi nachos and I would order it again in a second. \n\nService was great and they even brought out a big bowl of mango ice cream for my brothers birthday. Highly recommend and will return when in the area!", "rating": 4, "date": "2018-05-06"}], "salmon lovers roll": [{"excerpts": ["Salmon Lovers roll and fire dragon roll were barely edible."], "author": "Adelie P.", "review": "This was some of the worst sushi i've ever had.. It didn't give me food poisoning, so it's getting a star for that, but that's about it. The best part of the meal was the miso soup... The rest was barely edible, and even though mine was the first delivery order (or close to it) of the evening, the food tasted like it was been prepared days ago. Everything was dry, lumpy and did not taste fresh.. From the sushi menu - toro and Albacore Belly were inedible. Salmon and yellowtail were alright. Salmon Lovers roll and fire dragon roll were barely edible.", "rating": 2, "date": "2017-05-18"}], "mexican dessert roll": [], "four seasons roll": [{"excerpts": ["Four seasons roll is as delicious as it looks!"], "author": "Raisa G.", "review": "My go to sushi in the sunset district. Casual ambiance, good sushi, pretty cheap. Four seasons roll is as delicious as it looks!", "rating": 4, "date": "2016-01-02"}, {"excerpts": ["I always get the hot summer roll or the four seasons roll. ", "Both are very good. ", "Also the garlic edamame is delicious. ", "The wait staff are very nice and the wait is not often long (for food or for a table)."], "author": "Emily S.", "review": "This is my favorite sushi place. I always get the hot summer roll or the four seasons roll. Both are very good. Also the garlic edamame is delicious. The wait staff are very nice and the wait is not often long (for food or for a table).", "rating": 5, "date": "2017-11-17"}, {"excerpts": ["We ordered the four seasons roll, philly roll, and fresh oysters. ", "the fresh oysters were madddd tiny! ", "i don't think they're worth the price, $2 each. ", "but they were good ", "i guess. ", "My favorite was the four seasons roll. "], "author": "Maggie L.", "review": "My friend and i came here after work around 10pm on a week night. It wasn't busy at all. We ordered the four seasons roll, philly roll, and fresh oysters. the fresh oysters were madddd tiny! i don't think they're worth the price, $2 each. but they were good i guess. My favorite was the four seasons roll. it was delicious! \n\none thing i would like to note though is that you can only order ONE item off of the special dine in menu, which you can order off of when you spend $15 or more. to order a second item your bill must be over $30. I didn't know that, so i wish they would have put that on that menu. \n\noverall i would come back. sashimi and rolls are very good and very reasonably priced.", "rating": 4, "date": "2015-03-12"}, {"excerpts": ["Next was the FOUR SEASONS ROLL with eel, imitation crab, and avocado topped with tuna and avocado, 8 pieces for $12.99 (http://s3-media4.ak.yelpcdn.com/bphoto/d71TaWul4vjL-oIbw2uc3w/l.jpg). ", "This was my favorite by far...", "EXCEPT FOR THE WASABI SAUCE. ", "AUGH. ", "The rolls aren't mind-blowing, but I would recommend the TARAVAL STREET ROLL, $8.99, and the FOUR SEASONS ROLL, $12.99, as long as you don't mind the overpowering wasabi sauce (or ask for it on the side)."], "author": "Adele F.", "review": "Funnily, we went here unintentionally. After the 2013 Color Run, our party of 5 was craving something light for lunch (or so we thought). We had planned on dining at Sushi Zen, but our hunger got the best of us--the more convenient, eye-catching Sushi Raw got our business.\n\nDespite the affordable lunch specials, we decided to go family style with 4 rolls and some Big Discount items (described below).\n\nWe first chose the ISLAND ROLL with tuna, salmon, and yellow tail wrapped with cucumber, 6 pieces for $12.99 (http://s3-media3.ak.yelpcdn.com/bphoto/VoBBC_Z9yH2uIaZQhzsexQ/l.jpg). The combination was refreshing, although the cucumber was not that crisp and the fish were not markedly fresh. Since this is a light roll, eat this first because its flavor can be easily overpowered!\n\nNext was the FOUR SEASONS ROLL with eel, imitation crab, and avocado topped with tuna and avocado, 8 pieces for $12.99 (http://s3-media4.ak.yelpcdn.com/bphoto/d71TaWul4vjL-oIbw2uc3w/l.jpg). This was my favorite by far...EXCEPT FOR THE WASABI SAUCE. AUGH. They drizzle it on top with the other sauces, but because I have an aversion to wasabi, it totally killed my palate :(\n\nThird was the TARAVAL STREET ROLL with eel, shrimp tempura, imitation crab meat, cilantro, and mango, topped with tobiko, 6 pieces for $8.99 (http://s3-media2.ak.yelpcdn.com/bphoto/5fGG2OQ6tgVzHbvU6WNoiQ/l.jpg). This is a good, reliable roll, though the mango is not very noticeable. Gotta love that shrimp tempura though!\n\nLast was the HOT SUMMER ROLL with spicy tuna topped with crab meat, salmon, and baked with spicy sauce and tobiko, 8 pieces for $12.99 (http://s3-media3.ak.yelpcdn.com/bphoto/chB1j_Q8rzFnGwu7a_iVxA/l.jpg). The stringy red things on top were very interesting texture-wise, but the crab meat and spicy tuna overpowered the subtlety of the salmon.\n\nFor every $15 ordered off the regular menu, you get the option to choose an item off the Big Discount menu (borrowing Jessica C's picture: http://www.yelp.com/biz_photos/sushi-raw-san-francisco-3?select=GbuCLrQRKTIfUm9ue_ZgzQ#93Snh8xG0eUMkiLS4qRc9w). Since we had ordered over $45, we chose 3 items: UNAGI HAND ROLL for $1 (http://s3-media1.ak.yelpcdn.com/bphoto/MzsP_bAr1K-0v-IZyN005g/l.jpg), SPICY TUNA HAND ROLL for $1 (http://s3-media2.ak.yelpcdn.com/bphoto/OEtkgaDNi7yYFJ8muZH78g/l.jpg), and SEAWEED SALAD for $2, normally $4.99. The spicy tuna was fantastic.\n\nOur total bill was $52, which came out to $13 per person. After a morning of colorrific running that cost each of us $50, having a decent lunch at less than a third of that price was pretty good. The rolls aren't mind-blowing, but I would recommend the TARAVAL STREET ROLL, $8.99, and the FOUR SEASONS ROLL, $12.99, as long as you don't mind the overpowering wasabi sauce (or ask for it on the side).", "rating": 3, "date": "2013-03-13"}, {"excerpts": ["My cousin, sister and I ordered crunch California roll, hot summer roll, and four seasons roll. ", "We also ordered the Fuji mountain roll, which came out with fire. ", "Really amazing and quite unique! ", "All of the sushi are pretty good but nothing spectacular. ", "As a matter of fact, all of them are pricey and come in small portion. ", "We also ordered spicy tuna hand roll and sashimi. ", "They're only 1$ for every 15$ order ", "so might as well.\n \n", "Customer service was mediocre. ", "There were two waitresses. ", "One was very attentive. ", "She refills our water and asks us often if we need anything while the other one is rude af. ", "She took our soy sauce and gave it to other table. ", "she also took our plates away without even asking if we're done. ", "No smile,excuse,thank you, nothing. "], "author": "Mary U.", "review": "Good but definitely not the best. Since they are open late, it's a good spot to get your late night sushi cravings satisfied. \n\nMy cousin, sister and I ordered crunch California roll, hot summer roll, and four seasons roll. We also ordered the Fuji mountain roll, which came out with fire. Really amazing and quite unique! All of the sushi are pretty good but nothing spectacular. As a matter of fact, all of them are pricey and come in small portion. We also ordered spicy tuna hand roll and sashimi. They're only 1$ for every 15$ order so might as well.\n \nCustomer service was mediocre. There were two waitresses. One was very attentive. She refills our water and asks us often if we need anything while the other one is rude af. She took our soy sauce and gave it to other table. she also took our plates away without even asking if we're done. No smile,excuse,thank you, nothing. She seems miserable. \n\nI'll probably come back BUT only if I don't have any other choice to satisfy my sushi cravings. Otherwise, i would rather be in other sushi spots!", "rating": 3, "date": "2014-03-21"}, {"excerpts": ["Everything was really fresh, my personal favorite was their volcano roll and four seasons roll. ", "I would definitely come back next time when I'm in the neighborhood."], "author": "Tina C.", "review": "We were seated right away when we got there at 7pm. Customer Service was top notch because whatever we need they would bring it to us immediately. I loved their whole squid it was so juicy and chewy. Everything was really fresh, my personal favorite was their volcano roll and four seasons roll. I would definitely come back next time when I'm in the neighborhood.", "rating": 5, "date": "2016-07-10"}, {"excerpts": ["The four seasons roll was off the hook! .. "], "author": "Jessica C.", "review": "I was very impressed w the rolls & the presentation was great! We had about 7 or 8 rolls and they were all amazing.. One after another.. The four seasons roll was off the hook! .. The hot summer roll too. \n\nI like my rolls big, fresh, and meaty.. \n\nAtmosphere: trendy, chill, quiet, modern. The place is well put together. \n\nService: the waitress was very knowledgable of the menu and was great at helping us pick put some things we'd like. ... One thing I found odd was she stopped us at 4 or 5 rolls and said that would be enough.. (wtf?) .. There were 3 of us and we had just flown in from Maui and hadn't eaten in like 12 hours! We were starved. We did end up ordering 3 more rolls, but I found that to be a bit odd. ... \n\nThe beer is ice cold and served in a frosty mug! .. Great place!! I'll definitely be back as soon as I'm in that neighborhood again", "rating": 4, "date": "2012-03-04"}, {"excerpts": ["Four Seasons roll is my favorite roll here. ", "All the other ones are amazing and fun too. ", "They really try to create special designs for presentation. "], "author": "Erica L.", "review": "Very fresh sushi! just a little bit overpriced.\n\nFour Seasons roll is my favorite roll here. All the other ones are amazing and fun too. They really try to create special designs for presentation. COOL.\n\nI've gotten the sushi boat twice so far. It's really good, but I just wish they'd switch out the california rolls. and.... its not even A BOAT!! lol it's just on a loong plate. how can you call it a sushi BOAT? =.=\" \n\nAlso had raw oysters from their special appetizer menu. really good. oysters are small and sweet. \n\nTried their Udon, I rarely like udon from anywhere and this place was pretty good. I liked the clear broth and the noodles were very soft and chewy. \n\nService is good.\n\n\nDon't get me wrong, this is NOT my FAVORITE sushi restaurant. I would give 4.5 stars if I could.  I just really like it for a fancy night out that wont KILL your pocket like some other sushi restaurants in SF.", "rating": 5, "date": "2012-02-26"}, {"excerpts": ["We have the four seasons roll (presented beautifully), dynamite roll, 3 spicy tuna hand rolls (okay) , and the double hamachi roll (alright) to fill three bellies. \n\n"], "author": "Kelly C.", "review": "Right when I walked in, a table with two older men called my name \"Carrie!..Carrie!\" and said to each other that's Carrie and looked over to the waitress and said to her \"That looks like Carrie.\"  I walked in clarifying that my name is Kelly... Anyways, after the confusion I was seated far away from them which is a good thing. I quickly scanned the place and it was pretty decent although once the sushi chef opened the raw fish fridge at the sushi table, I immediately smelled a stench of dead fish. \n\nMy party arrived and we ordered like crazy. My favorite part is the unfiltered sake, Nigori. Yumm..my favorite sake. The sushi was alright..nothing special..just filling. We have the four seasons roll (presented beautifully), dynamite roll, 3 spicy tuna hand rolls (okay) , and the double hamachi roll (alright) to fill three bellies. \n\nSomething to note.. for every $15 you spend, you can order 1 item from the dollar menu which we did (the 3 handrolls). We originally thought we could order unlimited items from the dollar menu IF you spent $15 total but it's actually 1 item every $15. \n\nOverall, it was a good time but would probably never come here again.", "rating": 3, "date": "2011-07-31"}, {"excerpts": ["I've ordered delivery from here since it's couple blocks away, really good sushi rolls I love the ones they have like the four seasons roll ", "it's ", "amaze balls try it you won't regret it.  ", "Went in for pickup really nice place to dine in as well."], "author": "Nirea S.", "review": "I've ordered delivery from here since it's couple blocks away, really good sushi rolls I love the ones they have like the four seasons roll it's amaze balls try it you won't regret it.  Went in for pickup really nice place to dine in as well.", "rating": 5, "date": "2014-01-17"}, {"excerpts": ["we were sooooo turned off by the \"four seasons roll\" having so much mayo that we had to send it back ", "(we NEVER send food back). ", "They were nice enough to give us another roll and take the previous off the bill. ", "But i gotta say it left a \"MEH\" taste in my mouth for now.."], "author": "Michelle I.", "review": "OK, second time around we came in with out nifty yelp coupon. And while the sushi was ok we were sooooo turned off by the \"four seasons roll\" having so much mayo that we had to send it back (we NEVER send food back). They were nice enough to give us another roll and take the previous off the bill. But i gotta say it left a \"MEH\" taste in my mouth for now..", "rating": 3, "date": "2011-10-03"}, {"excerpts": ["I've only had the rolls, and I recommend the Lion King Roll, Lover's Roll, and Four Seasons Roll. ", "The waitresses have always been nice as well, quick to refill the tea or water and check in once in a while."], "author": "Min H.", "review": "I came to Sushi Raw for the first time when a former roomie of mine wanted to meet up here. I was skeptical at first, because the sushi selection on Taraval is not the most stellar... but she insisted that we go, and she was right!\n\nI've been here a couple of times since then, and it's been consistently good. I've only had the rolls, and I recommend the Lion King Roll, Lover's Roll, and Four Seasons Roll. The waitresses have always been nice as well, quick to refill the tea or water and check in once in a while.", "rating": 4, "date": "2010-11-18"}, {"excerpts": ["The four seasons roll is the best there. ", "The atmosphere is really nice at this location and the one on lower Haight. ", "I will come back."], "author": "Karen T.", "review": "I give them 3.5 stars. I think this place might stick around for a while. Everything that opens in thus location seems to fail, like the spot is cursed. This is the second sushi raw location I've been to now and I like both of them. The fish boat we ordered was big and good variety. The four seasons roll is the best there. The atmosphere is really nice at this location and the one on lower Haight. I will come back.", "rating": 3, "date": "2010-10-20"}, {"excerpts": ["Four Seasons Roll is really good, the rest is forgetable. ", "It hits the spot but I have had way better."], "author": "David N.", "review": "Four Seasons Roll is really good, the rest is forgetable. It hits the spot but I have had way better.", "rating": 3, "date": "2013-05-14"}, {"excerpts": ["We ordered three rolls.. the lion king roll, four seasons roll and the walnut prawn roll. ", "all of the food was very well made. ", "i recommend them all.\n"], "author": "Jay R.", "review": "09.09.12 with 1 other\n\nWe ordered three rolls.. the lion king roll, four seasons roll and the walnut prawn roll. all of the food was very well made. i recommend them all.\nalso for every $15 you spend, you can get a cheap deal.. like a hand roll for $1 \n\nthe rolls were on the pricey side around $11-$13 a roll\nbut last year i bought a Yelp deal $20 for $40 worth of food, so of course we had to take advantage of the deal before it was expired. \n\nexcellent service at this location. the staff were all very friendly and attentive.\n\na great expeience for my first time here, if i am in the area and craving sushi i would go back.", "rating": 4, "date": "2012-09-11"}, {"excerpts": ["We got the bento box with teriyaki salmon, saba mackerel, yellow tail sashimi ($13.95 + $2 extra for sashimi) and a Four Seasons roll ($13) and a small Kirin beer. \n\n", "The Four Seasons roll was to die for. "], "author": "Eddie L.", "review": "This location on 19th Ave has never done well with restaurants but this one looked promising.\n\nI must start off by saying the food here is absolutely delicious! We got the bento box with teriyaki salmon, saba mackerel, yellow tail sashimi ($13.95 + $2 extra for sashimi) and a Four Seasons roll ($13) and a small Kirin beer. \n\nThe fish is top tier. The sashimi was tender, juicy, and fresh but about 1/3 smaller cuts than your average sushi place. The salmon was grilled very well but they kinda smothered it with too much teriyaki. Still very good though. Their saba mackerel was better than I expected. \n\nThe Four Seasons roll was to die for. The decoration of the plate was beautiful and truly art. \n\nAgain, I thoroughly enjoyed our meal but I knocked down 1 star for the price. $36 for 2 people before tip and we didn't really get that much food. My gf was still hungry and was debating to ordered another roll but decided not to. \n\nI knocked down another half star because of the small cuts for their sashimi. Any legit sushi place needs to have legit sashimi. yes it tasted good but no one deserves cuts that small, especially for the price I paid. \n\nThe place has been opened for 12 days they said and it was pretty empty for a Sat night at 8pm. It was only 2 other tables and very quiet, almost uncomfortable eating when you have 3 waitresses and 2 sushi chefs congregated talking 10 ft from you. \n\nDefinitely glad I tried it but I probably won't be coming back due getting better value for your money at other nearby sushi spots.", "rating": 3, "date": "2010-07-03"}], "sunset strip roll": [{"excerpts": ["I recommend getting the Sunset strip roll and the Hot summer roll...all I can say is wow "], "author": "Tiffany P.", "review": "This place is amazing, I will warn you it's pretty pricey but if you like good sushi then you  will love it here.  \n\nI recommend getting the Sunset strip roll and the Hot summer roll...all I can say is wow I can't wait to go back! \n\nOn top of the amazing sushi was our waitress she was very attentive and when I was trying to figure out which roll I wanted to order next she offered some suggestions. I couldn't believe how fast our sushi was prepared the wait was less than 5 minutes.\n\nAnd they deliver so really what are you waiting for? Ok seriously go try it now!", "rating": 5, "date": "2013-07-26"}], "niagara falls roll": [], "items bento special": [], "items sashimi bento special": [], "unagi ramen": [], "aji fly": [], "oyster katsu": [], "beef short ribs": [{"excerpts": ["The beef, beef short ribs, and sushi are all good. ", "The tempura batter is one of the best in my opinion, I like my tempura cooked where the fried parts are flaky not the ones that are jagged and hurt when you take a bite into it. ", "The bass was alright, I personally wouldn't order it again. ", "The rolls are a little more expensive (around $10 each) so I didn't order any, but the next time I come, I'll try some of those."], "author": "Ryan L.", "review": "It turns out that this place JUST opened up so I decided to try it since I was in the area. First off, the windows are covered in a black film that makes it nearly impossible to see inside. Don't go staring into it because everyone on the inside can clearly see you. \n\nThe restaurant has a modern theme and music to fit a lounge-like ambiance. I thought the food was about average-price for a Japanese restaurant and the service was pretty good; the waitresses - very nice.\n\nI think the 3 selection bento boxes are worth $13.95 since there are over ten choices to choose from. The beef, beef short ribs, and sushi are all good. The tempura batter is one of the best in my opinion, I like my tempura cooked where the fried parts are flaky not the ones that are jagged and hurt when you take a bite into it. The bass was alright, I personally wouldn't order it again. The rolls are a little more expensive (around $10 each) so I didn't order any, but the next time I come, I'll try some of those.", "rating": 4, "date": "2010-06-26"}], "unajuy": [], "hamachi shioyaki": [], "oz snapple": [], "chicken teriyaki rice plate": [], "beef teriyaki rice plate": [], "salmon teriyaki rice plate": [{"excerpts": ["I ordered the salmon teriyaki rice plate ($10), and I swear when I first looked at it ", "I thought it looked like an appetizer. ", "The portion was tiny with a small serving of rice, two small salmon strips and salad. ", "We were about to start eating until we realized the waitress didn't give us any forks. ", "I understand that it's a sushi restaurant, but not everyone eats with only chopsticks, and I know that it's even harder to eat salmon with chopsticks. ", "My boyfriend actually ended up going up to the waitress and having to ask for forks because we were just sick of sitting there and waiting for her to come back. ", "The food was okay", ", I think the service just killed my whole experience there. ", "Our bill came up to about $50 for three people (no appetizers). ", "I'd say it wasn't worth it considering the fact that our portions were small, and I walked out still feeling a bit hungry ", "so we ended up grabbing something else to eat."], "author": "Rachelle C.", "review": "I had just finished my maternity photo shoot and we decided to have an early dinner here since it was nearby. Good thing I wasn't super hungry because there was only one waitress and the restaurant was half full. The waitress sat us down and gave us the menus, then she came back about 5 minutes later and gave us waters. I waited for her to come back to ask her for some straws for the waters, but she did not come back for another 10minutes. The waitress kept on speed walking and dragging her feet back and forth between tables and from the back, it was a little weird. She finally came over and took our orders, and brought our straws. It took about another 20 minutes for our food to come out, and I was a bit disappointed. I ordered the salmon teriyaki rice plate ($10), and I swear when I first looked at it I thought it looked like an appetizer. The portion was tiny with a small serving of rice, two small salmon strips and salad. We were about to start eating until we realized the waitress didn't give us any forks. I understand that it's a sushi restaurant, but not everyone eats with only chopsticks, and I know that it's even harder to eat salmon with chopsticks. My boyfriend actually ended up going up to the waitress and having to ask for forks because we were just sick of sitting there and waiting for her to come back. The food was okay, I think the service just killed my whole experience there. Our bill came up to about $50 for three people (no appetizers). I'd say it wasn't worth it considering the fact that our portions were small, and I walked out still feeling a bit hungry so we ended up grabbing something else to eat.", "rating": 1, "date": "2016-10-11"}, {"excerpts": ["I ordered the Salmon Teriyaki rice plate while my friend ordered the Saba Shioyaki. "], "author": "Marc T.", "review": "After the whole 24 hr Fitness Pacdebacle, my homie treated me out here \n\nPretty decent Japanese joint that has replaced the many restaurants near Seniores. I hope this one sticks through. This is one of the only late night sushi places around. Also this is one of the few healthy late night options.\n\nThe sushi here is decent. A bit overpriced (I'd opt to go Shimo or Okazu Ya since one has bigger cuts for the same price while the other is cheaper), but hell, its open late... \n\nThe tuna rolls were pretty normal, but good. The fish was of good quality and the rice texture was decent. Looking at the fish in the display, those were of also good quality. My gripe is on the price of their fish, which is kind of expensive for what you're getting \n\nI ordered the Salmon Teriyaki rice plate while my friend ordered the Saba Shioyaki. Both are pretty much grilled fish with some rice, salad and miso.\n\nThe miso was your standard miso soup... didn't have any green onions which was sad for me, but it tasted pretty normal. Nothing amazing, but then again I've never had amazing miso soup.\n\nThe salad was whatever. Didn't care so much for the dressing on it. Tasted almost like an Italian dressing or something\n\nThe salmon and saba portions were perfect for a post work out meal or just for any person who's trying to eat right. They both were grilled nicely and lightly seasoned. The saba also did not have as fishy a flavor as other saba that I've tried, which gets plus points in my book.\n\nThe rice is also of perfect portion control.  We opted for the sushi rice because it tastes better.\n\nOverall this place is ok. A bit overpriced for what you're getting but its an awesome late night spot to eat at for  the health conscious plus the portion control is good. I only wish they had brown rice. Since it is a healthy late night spot, I'll probably come back. However, there are better options for sushi around town if you're looking for lunch/dinner", "rating": 2, "date": "2011-01-13"}], "saba shioyaki rice plate": [], "tonkatsu rice plate": [], "chicken katsu rice plate": [], "aji fly rice plate": [], "oyster katsu rice plate": [], "beef short ribs rice plate": [], "unajuy rice plate": [], "hamachi shioyaki rice plate": [], "sea bass rice plate": [], "curry beef rice plate": [], "beef teriyaki bento": [], "salmon teriyaki bento": [], "saba shioyaki bento": [], "tonkatsu bento": [{"excerpts": ["For example, when we ordered the tonkatsu bento, we would receive two cutlets.  ", "But more recently, it has been reduced to a single cutlet.  ", "Although probably  better for us in the long run, we felt that we were treated inconsistently.  ", "The final straw was when we (party of 4) arrived around 6 pm on a Friday evening.  ", "There were 3 people in the whole restaurant but they tried to seat us by the front door next to a table with a young baby.  ", "I wanted to avoid the draft coming in the front door whenever people entered and didn't want to sit that close to a young baby and asked if we could sit at one of the open tables by the window.  ", "The waitress said they could not do that because they would not be able to split the tables ", "IF 2 groups of 2 came in.  ", "There was no reservations, but they were planning for the possible contingency.  ", "Ok, we are not ones to linger - we eat and run.  ", "Yet, they would rather have us leave than to try to accommodate us.  ", "No apology or anything.  ", "This was surprising given that we have been visiting every week.  ", "In view of their attitude, we will accommodate them and won't be back."], "author": "Will L.", "review": "We were coming here about once a week. Initially, we were impressed with the attentive and friendly service, tastiness of the entrees and the good value.  Unfortunately, the restaurant has gone downhill until the final straw when we felt they no longer valued our business and walked out of the restaurant (more about that later).  As stated, our initial experiences were very positive.  Portions were generous and the service was attentive and friendly.  However, we slowly noticed a deterioration of the service, friendliness and the food.  For example, when we ordered the tonkatsu bento, we would receive two cutlets.  But more recently, it has been reduced to a single cutlet.  Although probably  better for us in the long run, we felt that we were treated inconsistently.  The final straw was when we (party of 4) arrived around 6 pm on a Friday evening.  There were 3 people in the whole restaurant but they tried to seat us by the front door next to a table with a young baby.  I wanted to avoid the draft coming in the front door whenever people entered and didn't want to sit that close to a young baby and asked if we could sit at one of the open tables by the window.  The waitress said they could not do that because they would not be able to split the tables IF 2 groups of 2 came in.  There was no reservations, but they were planning for the possible contingency.  Ok, we are not ones to linger - we eat and run.  Yet, they would rather have us leave than to try to accommodate us.  No apology or anything.  This was surprising given that we have been visiting every week.  In view of their attitude, we will accommodate them and won't be back.", "rating": 1, "date": "2017-12-29"}], "chicken katsu bento": [], "aji fly bento": [], "oyster katsu bento": [], "beef short ribs bento": [], "unajuy bento": [], "hamachi shioyaki bento": [], "sea bass bento": [], "curry beef bento": []}