{"piece shrimp tempura": [], "veggie tempura appetizer": [], "piece gyoza": [], "piece potato croquettes": [], "piece spring rolls": [], "teriyaki tofu": [{"excerpts": ["I also love the teriyaki tofu (silly, I know, with the beef and potstickers), which comes lightly fried with a sweet sauce. ", "Every bento box comes with rice, miso soup, and a small salad with lettuce and cucumbers and a yummy sesame dressing. "], "author": "Umilia M.", "review": "I've been here many times when singing at The Mint next door. Once you order, Sushi Delight will bring your meal right to you at the bar--super convenient. \n\nI usually order the bento box with three items out of over a dozen to choose from (including California rolls, pork or chicken katsu, potato croquettes, sashimi, veggie or assorted tempura, spring rolls., etc.). \n\nI'm not the biggest fish fan, which rules out a lot of Sushi places, but Sushi Delight has lots of yummy non-fish options.  The teriyaki beef is always lean and flavorful, cut in little strips, the gyoza is nicely browned on one side, but not tough, the interior stuffing is moist. I also love the teriyaki tofu (silly, I know, with the beef and potstickers), which comes lightly fried with a sweet sauce. Every bento box comes with rice, miso soup, and a small salad with lettuce and cucumbers and a yummy sesame dressing. The rest of my family loves their California Rolls, which are a great deal during happy hour.\n\nThe food is brought to your table promptly, and the staff is always adept and cordial (especially Tinkerbell).\n\nI really appreciate that they accept cards, which lets me save my cash for The Mint.", "rating": 5, "date": "2011-05-19"}], "steam rice": [], "combo a": [{"excerpts": ["-With the sushi combo A, you can get 12 pieces of fresh nigiri. ", "Enjoy the likes of tuna, salmon, butterfish, mackerel, hamachi, etc., miso soup, and salad - all for $14.50.\n", "-They've got a fine variety of combo rolls. ", "The 49'ner is especially tasty with salmon, special sauce, and thin slices of lemon.\n", "-We also ordered uni spoons: a delicious concoction of uni, fish roe, and quail egg. ", "Truly a party in your mouth! "], "author": "Gina L.", "review": "3.5 stars! Sushi Delight was surprisingly delicious and verrrrry affordable. I'll definitely come here again for the quality of food one gets for the price. \n\nAmbiance:\n-Small walk-in nook with a sushi bar at the back of the restaurant\n-I guess one could describe it as \"cozy casual\" with its' wooden walls and sparse Japanese decorations bought at Japantown.\n-The only way to the bathroom is literally through the kitchen. Walking there is a bit awkward as you can greet the chefs on your way to relieve yourself. That being said, the bathroom is quite clean!\n-A sister restaurant to The Mint karaoke bar next door, enjoy embarrassing karaoke performances being sung real-time - they are projected on a flat-screen TV above the sushi bar. Be glad that you can't actually hear them.\n\nFood:\n-My expectations were surpassed here! What a deal.\n-With the sushi combo A, you can get 12 pieces of fresh nigiri. Enjoy the likes of tuna, salmon, butterfish, mackerel, hamachi, etc., miso soup, and salad - all for $14.50.\n-They've got a fine variety of combo rolls. The 49'ner is especially tasty with salmon, special sauce, and thin slices of lemon.\n-We also ordered uni spoons: a delicious concoction of uni, fish roe, and quail egg. Truly a party in your mouth! You get 2 for $7.\n\nService:\n-A bit slow on Sundays. I guess they weren't expecting large crowd of us to come rolling in. They only had one waiter, a sushi chef, and another guy in the back. I confirmed this via my trip to the bathroom.\n\nTips:\n-Apparently, you can order Sushi Delight at The Mint next door. \n-Ask the waiter to have your group's Polaroid taken to join the slowly growing Polaroid gallery along the restaurant's wall.\n\nAs many a Sushi Delight visitor has exclaimed, \"sushi-licious!\"", "rating": 3, "date": "2010-08-16"}, {"excerpts": ["We ordered: \n\nCombo A - Maguro (red tuna), Shiro Maguro (white tuna), Hamachi (yellowtail), Saba (mackerel), Sake (salmon), Tai (red snapper) with miso soup and salad. "], "author": "Julia T.", "review": "It didn't seem that impressive when we walked in. The place is pretty plain, like hundreds of middle of the road sushi places. I was bummed that normally during their happy hour, they offer an oyster special but it was not available that day. We didn't take advantage of the other choices which was a special on California Rolls (I'm not a fan...blah) and 2 for 1 sake. Now to the good! Other than my initial impression, we had a very enjoyable time. Our server was attentive and the food was good. We ordered: \n\nCombo A - Maguro (red tuna), Shiro Maguro (white tuna), Hamachi (yellowtail), Saba (mackerel), Sake (salmon), Tai (red snapper) with miso soup and salad. This was the highlight of the night! The fish was so fresh it almost gleamed...! I couldn't put my finger on what else was special about it but my bf pointed it out. They don't press down on the fish. Some places will almost mash the fish into the rice that it almost loses its texture. But at Sushi Delight, all the fish are just sitting on the rice. Couldn't stop putting those beautiful and tasty niguris in my mouth. I was so sad when we ate them all. =( \n\n49er Roll - Eel and avocado topped with salmon and sliced lemon. Again all very fresh! I like the lemon taste but I never like eating lemon slices. I'm glad the lemon slices were small so I didn't feel guilty pulling it off the fish. \n\nAlaska Roll - Salmon and avocado. I'm happy the fish was not lost in the rice! It was very flavorful. I could taste every ingredient. \n\nFuto Maki - Egg, Shitake, Avocado, Cucumber, Spinach. Do all Futo Makis have avocado? Because this was the first time I really tasted it! I love avocado so this was a great thing. The egg was really good too, sweet and fluffy.\n\nSpicy Scallop - Self explainatory. Bf said it was really spicy. I'm weaksauce so I don't eat spicy things. \n\nI have a feeling that Sushi Delight reads yelp reviews so a big thank you to our server who caught the questionable smug on my plate! I was just about to wipe it off but she turned around, said she caught that too and said she'd replace it. Is it just me and my mom or are other people used to wiping down plates/bowls with their napkins and tea when they eat out? I was totally fine doing just that but it was nice that the server noticed. :p", "rating": 4, "date": "2009-03-13"}, {"excerpts": ["Additionally I feel that $15 for 12 pieces (combo A, sucka) of sushi is a deal in the city.  "], "author": "Steven R.", "review": "I'm hoping the way I like my sushi isn't indicative of how I am in bed (no, I don't rate myself) :\n\nRelatively simple.  Hopefully that isn't always bad.\n\nSo while I already feel you guys hating me because I gave this place more than 3 stars, hear me out.\n\nLike I said, I'm mainly a sushi guy.  I'll try a roll here and there, but the base of my experience is all about raw fish on rice.  The fish here was excellent and extremely fresh.  In fact, I had to stop myself from eating like a starved hog.  My main complaint of course, was the fish pieces were a little small.  We're not talking tiny, but it's nice when the rice is mostly (if not completely) obscured by the fish.  This was not the case but the fish was really tasty.  Additionally I feel that $15 for 12 pieces (combo A, sucka) of sushi is a deal in the city.  I'm interested in going for the $1 oyster happy hour.\n\nI was ready to downgrade this to a 3 after consuming my spicy salmon roll.  While it was fresh, it was relatively tasteless.  I had to bump it back up when I tried the caterpillar roll.  I think it was eel inside covered with avocado.  It was amazing.  I had to convince my dining partner she was full so she'd let me eat the rest.  It didn't work and I had to trade her some salmon.\n\nOverall, it's a great place for what it is; a tiny neighborhood sushi joint.  Yeah, it's on Market Street but it never makes claims of being anything more and even eschews the ubiquitous \"best sushi in town\" tag a lot of places like to throw on their menus.  The staff were all insanely nice and I think I heard \"thank you\" about 8 times before I left.     \n\nIf you live nearby and are tired of relying on Hanabi for your weekly sushi fix, this is more than worth the walk.", "rating": 4, "date": "2007-08-17"}], "combo b": [{"excerpts": ["i got the sushi combo B and it was great.  ", "Went great with my scotch and soda."], "author": "Cynthia B.", "review": "Last night I was at the Mint and I noticed everyone was eating sushi.  I found out that you ordered it next-door and they would bring it over for you.  i got the sushi combo B and it was great.  Went great with my scotch and soda.", "rating": 5, "date": "2009-08-15"}], "combo c": [], "combo d": [], "combo e": [], "combo f": [], "piece veggie caterpillar roll": [], "piece veggie tempura roll": [], "piece avocado cucumber roll": [], "piece avocado maki": [], "piece cucumber maki": [], "piece spinach maki": [], "piece shitake maki": [], "piece shitake avocado roll": [], "piece inari": [], "sashimi combo": [{"excerpts": ["Also got the sashimi combo and the Voodoo roll. ", "Voodoo roll is extremely unique and very delish. ", "sashimi combo had 6 types of fish - very fresh... all this plus a bottle of sake for approx 50$. seems very reasonable to me!\n", "overall, all the sushi/sashimi was pretty good quality and reasonably priced. and good service. ", "i'm sensing that this might soon become in my list of \"regular\" places along with underground sushi, amesia hide and sushi zone..."], "author": "Priya K.", "review": "came for dinner on memorial day monday. got some of their specials - butterfish, la bomba, hamachi toro (didnt get the regular toro, coz it is in the \"dont eat\" list - monterey bay aquarium). The hamachi toro was SO good that we got another order of it.\nAlso got the sashimi combo and the Voodoo roll. Voodoo roll is extremely unique and very delish. sashimi combo had 6 types of fish - very fresh... all this plus a bottle of sake for approx 50$. seems very reasonable to me!\noverall, all the sushi/sashimi was pretty good quality and reasonably priced. and good service. i'm sensing that this might soon become in my list of \"regular\" places along with underground sushi, amesia hide and sushi zone...", "rating": 4, "date": "2009-05-25"}], "sashimi pcs": [], "voodoo roll": [{"excerpts": ["Voodoo Roll: Pretty cool presentation, the seaweed salad is on on top of the roll with a spicy mayo sauce, taste is OK\n", "Cherry Blossom Roll: ", "OK, nothing special\nSpicy Tuna Roll: "], "author": "Natalie L.", "review": "This is the go to order place when you had a few drinks at the Mint Karaoke Lounge. It is connected together and you can go in a order and they will bring the food to you, pretty sweet and convenient. \n\nWe ordered a few rolls:\nLava Roll: OK\nVoodoo Roll: Pretty cool presentation, the seaweed salad is on on top of the roll with a spicy mayo sauce, taste is OK\nCherry Blossom Roll: OK, nothing special\nSpicy Tuna Roll: OK, I didn't like the jalapenos mixed inside \n\nOverall, everything is very ok, probably after a few drinks everything tastes amazing. Sushi is not the freshest, too much rice, quality of ingredient is meh. I wouldn't come here purposely for sushi, but it is very convenient if you are karaoking at The Mint, the majority of their business are from there.", "rating": 3, "date": "2016-03-26"}, {"excerpts": ["So I went for the spider roll (soft shell crab), voodoo roll (spicy tuna, cucumber, deep fried and then topped with more tuna and seaweed) and a some saba nigiri.  ", "I also got to try some of the 49er roll which had salmon, unagi, avocado and lemon.  ", "Everything was pretty darn tasty and the voodoo roll was intriguing enough, that it caught the attention of the girls sitting next to us. \n\n"], "author": "Kim N.", "review": "With the name Sushi Delight and being the supplier of food for an adjacent karaoke bar, I wasn't expecting much.  My fear of karaoke had already been smashed this night and to my surprise, the fare from S.D. also surpassed my expectations. I guess it was a night of good new experiences. \n\nTo be perfectly honest I never stepped foot into the actual restaurant but was impressed that they were able to find us through the drunken messes of people next door. Another patron was eating some katsu don and said that he was decently impressed. So I went for the spider roll (soft shell crab), voodoo roll (spicy tuna, cucumber, deep fried and then topped with more tuna and seaweed) and a some saba nigiri.  I also got to try some of the 49er roll which had salmon, unagi, avocado and lemon.  Everything was pretty darn tasty and the voodoo roll was intriguing enough, that it caught the attention of the girls sitting next to us. \n\nAgain my skepticism was shattered (2 for 2 on the night), I actually really enjoyed the food,  and now I have a late night place for sushi", "rating": 4, "date": "2006-11-21"}, {"excerpts": ["I tried the voodoo roll, which was delightful with warm and cold temperatures, crispy and creamy textures, a very interesting dish.  \n\n"], "author": "Linda H.", "review": "My first visit to Sushi Delight was with a Restaurant.com coupon.  I hoped to eat at The Mint next door, but the coupon was only valid on the restaurant side.  \nI tried the voodoo roll, which was delightful with warm and cold temperatures, crispy and creamy textures, a very interesting dish.  \n\nThe amaebi heads were served separately from the shrimp, which was unusual.  The shrimp was pretty good, but the heads were outstanding, fried to a crispy, delicate crunch.  \n\nThe aji was out of this world, sooo fresh, and served with just the right touch of garlic.  The aji's \"market price\" was quite fair, I think it was $6.  \n\nCombo #1 was a nice assortment of nigiri sushi.  The standouts were white tuna and hamachi, but it was all very good.  Generous serving size on the miso soup.\n\nService was prompt and friendly.  \n\nIn summary, I would definitely visit again.  In combination with The Mint next door, it's a whole evening of fun!", "rating": 4, "date": "2011-10-26"}, {"excerpts": ["I like their VooDoo Roll, Labamba roll, hamachi-kama & for desert; tempura ice cream!  ", "Friendly staff, and the head chef/owner is always present to guarantee good hospitality.  ", "I also enjoy that there's a flat screen at the sushi bar, so you can watch the drunk karaoke patrons at the Mint bar next door sing there hearts out to the audience! ", "lol"], "author": "Jimmy N.", "review": "I'm a regular here!  I like their VooDoo Roll, Labamba roll, hamachi-kama & for desert; tempura ice cream!  Friendly staff, and the head chef/owner is always present to guarantee good hospitality.  I also enjoy that there's a flat screen at the sushi bar, so you can watch the drunk karaoke patrons at the Mint bar next door sing there hearts out to the audience! lol", "rating": 4, "date": "2012-07-05"}, {"excerpts": ["We also ordered the voodoo roll and the sashimi deluxe (fresh fresh fresh!!!) and also a few other rolls which I dont  quite remember since I was too busy stuffing my face.\n\n "], "author": "M W.", "review": "Came here for dinner last night with a few girlfriends and had a blast! The oysters here were so delicious and FRESH! We ordered about 3 dozen for the 4 of us and emptied out their stock of oysters :)\n\nWe also ordered the voodoo roll and the sashimi deluxe (fresh fresh fresh!!!) and also a few other rolls which I dont  quite remember since I was too busy stuffing my face.\n\n If you come you MUST try their icecream tempura...sooooo good!!", "rating": 5, "date": "2009-05-18"}, {"excerpts": ["The 'famous Voodoo roll' is all hype; and if you ask me all that is wrong with american sushi - deepfried, sauce soaked, covered in accoutrement to the point that you can't even tell if there is any fish in there to begin with.  "], "author": "Justin B.", "review": "I yearn for sushi.  I dream about sushi.  If I was a crustacean I would make love to sushi.  And as for Sushi Delight's 'La Bomba' special [scallop wrapped in salmon], its like a tantric orgasm.\n\nWith that being said, I  enjoyed but didn't love the other food/aspects of Sushi Delight.\n\nThe rolls are cheap and good, if not great, and they have quite an extensive offering.  As for their sashimi I've definitely had better but it was good enough.  The 'famous Voodoo roll' is all hype; and if you ask me all that is wrong with american sushi - deepfried, sauce soaked, covered in accoutrement to the point that you can't even tell if there is any fish in there to begin with.  The waitstaff can be a bit unattentive and slow too, and considering the small size of the place this really should not be an issue.  \n\nAn added bonus is the big screen TV where you can watch the best that SF has to offer attempt karaoke at 'The Mint'.  After you finish eating you can even head on over to the Mint, through a door in the restaurant, and take part in the madness if your heart so desires.", "rating": 3, "date": "2009-01-24"}, {"excerpts": ["In the end, two gorgeous girls got gorgeously drunk off 3 large sakes, 1 voodoo roll (eh, a bit too much fluff and not enough substance), 1 tempura appetizer (perfect, best tempura I've had), 2 pieces of butter fish nigiri (melty ", "and I ate both b/c Marina can't handle her drink), 2 pieces of hamachi toro (tasty and worth the price, didn't make my mouth sing or my face orgasm but a solid second place), 2 pieces of ama-ebi (sweet, succulent, with a sprinkle of tobiko on top and a side of FRIED HEAD!), and I think we had one more order or some kind of fish.  ", "But you know what?  ", "I was too wasted to remember now.  ", "The whole dinner was around $50.  ", "I was stuffed.  "], "author": "Christina C.", "review": "Let me see here.....$4.80 for Hamachi Toro?  Wha?  Where's the hidden camera?\n\nOh, must be like old maguro, the kind that's turned ashy and gray from disinterest.  \n\nNo, no, I was wrong...while this is not as fragrant as the most extravagant (and ridiculously expensive) hamachi toro i've ever had, the butterfish was quite nice.\n\nThis Hamachi Toro was worth every bit of the $4.80 for 2 pieces of nigiri.  The rating for this sushi joint is a combination of value, taste, style (who am I kidding?), timing, and sake.   Normally, I'll something where it's a certain amount of stars and then some stupid disclaimer about value because, come on let's be honest.  I'm chinese and no matter how good the puddin' is, you can't charge me that much for something without my ancestors crying.\n\nNow, due to my unfortunate financial situation as a poor starving, debted stupid student, this is one of those place I can go for sushi (after living large as a workin' girl) without hating myself, feeling cheap and dirty, feeling like I've lowered my standards, like I've really let myself go.  \n\nThis is not one of those places where the fish is sour and you bath it in soy sauce and wasabi in an attempt to disinfect it.\n\nThis place has legitimate fish.  The tempura appetizer was perfect.  I was a bit drunk already but we ordered 3 large hot sake anyways!  Come on girls!  If you're gonna fall down, fall hard!\n\nI saw on the menu that there was yaki-tori which I desperately wanted to try during the cherry blossom festival but later did not regret not waiting in the hour long line to get HAMBURGER in the yaki-tori.  I want my octo-puss.\n\nMy favorite part?  The Ama-ebi came with the fried heads!  I'm going to come back here again and again for that!  Without the BF (and don't you tell him where I am, this will be our secret, ok?).  \n\nIn the end, two gorgeous girls got gorgeously drunk off 3 large sakes, 1 voodoo roll (eh, a bit too much fluff and not enough substance), 1 tempura appetizer (perfect, best tempura I've had), 2 pieces of butter fish nigiri (melty and I ate both b/c Marina can't handle her drink), 2 pieces of hamachi toro (tasty and worth the price, didn't make my mouth sing or my face orgasm but a solid second place), 2 pieces of ama-ebi (sweet, succulent, with a sprinkle of tobiko on top and a side of FRIED HEAD!), and I think we had one more order or some kind of fish.  But you know what?  I was too wasted to remember now.  The whole dinner was around $50.  I was stuffed.  And very very drunk.  \n\nAfter that, we went to get some cash, then wave our knee high boots around on Market trying to hail a cab but since we were in the almost-castro, everyone thought we were lady-boys and drove right bye.  Bastards.", "rating": 5, "date": "2008-12-23"}, {"excerpts": ["We also tried the voodoo roll, per many yelpers recommendations, and it was soooooooo good. "], "author": "S F.", "review": "I had always wanted to try this sushi, and was encouraged after reading these yelp reviews. We went during Happy Hour, 5-7, $1 oysters (excellent), $2 California rolls, and buy one get one free sake. \n\nWe also tried the voodoo roll, per many yelpers recommendations, and it was soooooooo good. My dinind companion said it was one of his favorite sushi rolls EVER.\n\nThe service was good, our water was constantly being refilled...and at a sushi restaurant that is really all I need (plus great sushi, and this place delivered).", "rating": 4, "date": "2008-07-06"}, {"excerpts": ["I highly recommend the 49ers roll (sake (salmon), lemon, avocado, unagi) and the voodoo roll (with spicy tuna and shredded seaweed on top) is unusual and tasty. "], "author": "Jill M.", "review": "Alright, folks, picture this: you are at the Mint, having a blast but suddenly find yourself starving and craving something substantial to eat. There's an answer to your prayers... Sushi Delight. What can be better than Karaoke and good sushi?? It's truly a win-win situation.\n\nAn awesome choice for good eats while crooning your little heart out at the Mint. You simply go next door -- it's connected directly to the Mint) place and pay for your order, and they bring it out to you at your table within the bar. Delight even has a screen showing the singers from next door so you don't miss a beat while placing your order. Very fancy schmancy :)\n\nThe pricing is moderate but fair because the fish is fresh and delicious. I highly recommend the 49ers roll (sake (salmon), lemon, avocado, unagi) and the voodoo roll (with spicy tuna and shredded seaweed on top) is unusual and tasty. I also particularly love their house salad, which is generously sized and served with the yummy miso dressing.\n\nSushi Delight is definitely more of a roll or bento box kind of place rather than a nigiri place.", "rating": 4, "date": "2006-11-20"}, {"excerpts": ["I Highly recommend the voodoo roll.\n\n"], "author": "Spencer C.", "review": "We went here during the early bird spec- er, I mean Happy Hour from 5-7. $1 oysters, $2 California rolls, and buy one get one free sake. The oysters were delicious, and everything we ordered was great! I Highly recommend the voodoo roll.\n\nThe service when we went was excellent, our water must have been refilled 10 times.  Not much of an ambiance, but really I could care less as long as the sushi is good!!", "rating": 4, "date": "2008-07-06"}, {"excerpts": ["And that infamous voodoo roll?  ", "Outstanding."], "author": "Sheila A.", "review": "Simply some of the freshest, most delicate hamachi sashimi I've ever eaten.  $1 oysters, and two-for-one sake during happy hour (we didn't try the $2 California rolls).  \n\nA friend and I shared the large sashimi, a few rolls, and a couple bottles of sake, and wound up just exactly full enough.  \"I wish we could hit rewind and do that again!\" she lamented.  \n\nThe service was friendly and just helpful enough.  And that infamous voodoo roll?  Outstanding.", "rating": 5, "date": "2008-09-22"}, {"excerpts": ["The Voodoo roll wasn't that great ", "and it was very small in portion."], "author": "Travis S.", "review": "The Voodoo roll wasn't that great and it was very small in portion.", "rating": 2, "date": "2014-01-01"}, {"excerpts": ["I HAD to try the voodoo roll as so many other yelpers have suggested. ", "It was tasty. ", "Yum. ", "Yum. ", "I still think they're decent, and the Karoake bar is really fun (although they didn't have it playing on the screen this time), and the voodoo roll is delicious. ", "So, it gets 3 stars, but beware the shady service."], "author": "Sue Y.", "review": "We were drawn here by their 2 for 1 sake happy hour special. That plus, our friend used to work here and that's why we used to come.\n\nI HAD to try the voodoo roll as so many other yelpers have suggested. It was tasty. Yum. Yum. Yum.\n\nThe other rolls were okay. They didn't wow me off my seat and I know of several other sushi joints with equivalent or better sushi in the city for less money. \n\nBut the 2 for 1 sake. That's what we came for. And that's what we were going to have. \n\nWe had 15 min left and we asked the waiter if we could order 20 more at the happy hour price (hey! we're not alchies -- we had a big party.). Anyways, the guy said it was okay and that he would bring them out slowly to keep them warm. \n\nHe brought out two, and four,... and suddenly when we asked him how many we had left, he said we only had 3 more.... strange,.. hmmm,...It took me later in the night  to figure this out, but after comparing notes later, we realized that there was no way he gave us 20, and when we counted, we figured it was 10, 12 tops. This wouldn't have made me mad, because we were drinking them after happy hour, but I simply wish he had told us this prior or even during instead of being shady about it. \n\nDon't think that we were taking advantage of their happy hour either. We ate a LOT of sushi there too, so our bill was VERY large, and we brought them  a LOT of business. No more though. Not with shady service like that.\n\nI still think they're decent, and the Karoake bar is really fun (although they didn't have it playing on the screen this time), and the voodoo roll is delicious. So, it gets 3 stars, but beware the shady service.", "rating": 3, "date": "2009-01-17"}, {"excerpts": ["it was pretty damn tasty, I keep reading about this Voodoo Roll so ", "next time i think i'll definitely have to give that a shot.  "], "author": "Lulu C.", "review": "Aside from the fact that our server actually \"shushed\" our table a couple times (there was 8 of us girls), i would definitely head back to this little sushi joint for their $1 oysters, and their two for one sake..(how can you beat that?!) The oysters are absolutely delicious. WOW. not fishy at all, the sauce explodes in your mouth and has a slight kick.  I think our table ordered 3 dozen.  Their seaweed salad is an absolute delight, so scrumptious, tasty and generously portioned.  I got the Dynamite Roll and it was pretty damn tasty, I keep reading about this Voodoo Roll so next time i think i'll definitely have to give that a shot.  The prices are very reasonable, and the quality of the food is totally worth it.  \n\n  The service was friendly, even if we did get shushed!  What's even better is that this place is connected by just a heavy door to Mint right next door where you can bust out your tunes after having a few sake bombs too many.  We shut the place down & had some sake with the server & sushi chef! it was so much fun running between sake shots and belting out \"drop it like its hot!\" \n\n Definitely a great place to fill up before heading over to sing your full bellies out!", "rating": 4, "date": "2008-10-08"}, {"excerpts": ["Also got the sashimi combo and the Voodoo roll. ", "Voodoo roll is extremely unique and very delish. ", "sashimi combo had 6 types of fish - very fresh... all this plus a bottle of sake for approx 50$. seems very reasonable to me!\n", "overall, all the sushi/sashimi was pretty good quality and reasonably priced. and good service. ", "i'm sensing that this might soon become in my list of \"regular\" places along with underground sushi, amesia hide and sushi zone..."], "author": "Priya K.", "review": "came for dinner on memorial day monday. got some of their specials - butterfish, la bomba, hamachi toro (didnt get the regular toro, coz it is in the \"dont eat\" list - monterey bay aquarium). The hamachi toro was SO good that we got another order of it.\nAlso got the sashimi combo and the Voodoo roll. Voodoo roll is extremely unique and very delish. sashimi combo had 6 types of fish - very fresh... all this plus a bottle of sake for approx 50$. seems very reasonable to me!\noverall, all the sushi/sashimi was pretty good quality and reasonably priced. and good service. i'm sensing that this might soon become in my list of \"regular\" places along with underground sushi, amesia hide and sushi zone...", "rating": 4, "date": "2009-05-25"}, {"excerpts": ["Their Voodoo Roll is really good, but I don't get it deep fryed as it is on the menu. ", "They also have a pretty good selection of cold sake which is one of my favorite alcoholic beverages. ", "They also have a TV  where you can watch the folks next door sing karaoke, which is rather entertaining."], "author": "Danielle S.", "review": "Their Voodoo Roll is really good, but I don't get it deep fryed as it is on the menu. They also have a pretty good selection of cold sake which is one of my favorite alcoholic beverages. They also have a TV  where you can watch the folks next door sing karaoke, which is rather entertaining.", "rating": 4, "date": "2008-11-19"}, {"excerpts": ["The voodoo roll with tuna, salmon and seaweed was definitely the highlight. ", "All in all the place was nice and clean with good green tea and miso soup on the house. ", "Not a bad spot for a late night sushi craving. ", "Maybe next time I'll be brave and try some nigiri."], "author": "Michael E.", "review": "The florescent glow in the window says \"Late Night Sushi\" which is either a good thing or really sketchy. Our group bit the bullet and decided to try it a little late on a Sunday night. We decided to steer clear of the nigiri and just go with rolls to be safe. The voodoo roll with tuna, salmon and seaweed was definitely the highlight. All in all the place was nice and clean with good green tea and miso soup on the house. Not a bad spot for a late night sushi craving. Maybe next time I'll be brave and try some nigiri.", "rating": 3, "date": "2005-07-18"}], "shrimp tempura rainbow roll": [{"excerpts": ["Got the shrimp tempura rainbow roll. ", "Be warned, the INGREDIENTS ARE NOT THE SAME AS THE MENU. ", "Got this roll because it was one of the few not marked as spicy. ", "To my surprise, there was an overwhelming amount of a wasabi sauce on top of the roll which was not mentioned anywhere on the menu. ", "When I brought it up to the waiter, with attitude she responded \"uh what do you want me to do about it?? ", "Change it??", "\" ", "Yes, if you advertise one thing and give me something else, I want to get what I ordered. ", "I got a new order with no sauce on top but still wasn't pleased. ", "The shrimp tempura tasted really off which is what left me with a bad taste in my mouth and an even worse feeling in my stomach. "], "author": "Kiana N.", "review": "Was in the area tonight and had 2 options: this place or taco bell. I should've gotten taco bell. To start off, I've been sick for the past several hours after leaving this restaurant. The whole experience was so unejoyable. There were 2 big parties there being SO loud I was starting to get a headache, the workers didn't seem to mind all their yelling and screaming but not too enjoyable for the rest of the customers. \nReally disappointed in the food. Got the shrimp tempura rainbow roll. Be warned, the INGREDIENTS ARE NOT THE SAME AS THE MENU. Got this roll because it was one of the few not marked as spicy. To my surprise, there was an overwhelming amount of a wasabi sauce on top of the roll which was not mentioned anywhere on the menu. When I brought it up to the waiter, with attitude she responded \"uh what do you want me to do about it?? Change it??\" Yes, if you advertise one thing and give me something else, I want to get what I ordered. I got a new order with no sauce on top but still wasn't pleased. The shrimp tempura tasted really off which is what left me with a bad taste in my mouth and an even worse feeling in my stomach. Definitely won't be back.\n\nSummary:\nAtmosphere: Too Loud \nFood: Made me Sick\nMenu: Limited, ingredients not accurate \nService: Slow and Rude \nPricing: Expensive for what you get", "rating": 1, "date": "2017-10-20"}, {"excerpts": ["Out on a date night, we ordered the \"Dinner For Two A\" for $59.00 which included edamame, 2 miso soup, seaweed salad (or house salad), gyoza, 10 pcs nigiri, shrimp tempura rainbow roll, dynamite roll, 2 spicy tuna handroll, and 2 pcs mochi ice cream (we got strawberry and green tea)! ", "The edamame and miso soup were standard, seaweed salad had a unique flavor that I didn't care for, and the sushi was so-so. ", "It ended up being way too much food for the two of us. "], "author": "Nicole W.", "review": "For such a foodie area, I was surprised this sushi spot didn't live up to my expectations. Out on a date night, we ordered the \"Dinner For Two A\" for $59.00 which included edamame, 2 miso soup, seaweed salad (or house salad), gyoza, 10 pcs nigiri, shrimp tempura rainbow roll, dynamite roll, 2 spicy tuna handroll, and 2 pcs mochi ice cream (we got strawberry and green tea)! The edamame and miso soup were standard, seaweed salad had a unique flavor that I didn't care for, and the sushi was so-so. It ended up being way too much food for the two of us. If I go back, I'll definitely select my own rolls. \n\nOverall average sushi. The best part about this place is the live feed to Mint (karaoke bar next door). That was totally hilarious!", "rating": 3, "date": "2015-05-30"}, {"excerpts": ["I ordered the shrimp tempura rainbow roll and sake maki roll. ", "It arrived earlier than expected by a courteous delivery guy and the food was good! ", "Thanks guys made my night"], "author": "Rachel T.", "review": "Eat24 review- So delivered sushi can either go really well or terribly wrong right? In my case it went really well. Sunday night I'm craving sushi without leaving the house. I ordered the shrimp tempura rainbow roll and sake maki roll. It arrived earlier than expected by a courteous delivery guy and the food was good! Thanks guys made my night", "rating": 5, "date": "2017-03-19"}, {"excerpts": ["If you are looking for fancy $20 sushi rolls, there are none to be had, though the Shrimp Tempura Rainbow Roll comes close. ", "I personally recommend the Uni Spoons, and daily happy hour with dollar oysters. "], "author": "Benjamin M.", "review": "5 stars may seem like a bit much for this hole in the wall attached to the Mint, but after one night sitting at the bar with owner/sushi chef, Ray, I became a regular. Unpretentious, great fresh fish at affordable prices. If you are looking for fancy $20 sushi rolls, there are none to be had, though the Shrimp Tempura Rainbow Roll comes close. I personally recommend the Uni Spoons, and daily happy hour with dollar oysters. Come enough and you might be on the wall of fane too.\n\nBONUS: a live video feed of people doing karaoke sit at the bar. Very entertaining stuff when dining at the entrance to the Castro.", "rating": 5, "date": "2011-04-21"}, {"excerpts": ["we ordered the 49er roll, shrimp tempura rainbow roll, an alaskan roll, and a chicken karrage appetizer.  ", "everything was good except for the chicken; i wouldn't order it again."], "author": "H. L.", "review": "i like this place because it's open late (yay!).  i used to go to this place in russian hill because it was open late (and is cheap), but sushi delight tastes a lot better than the place in russian hill... so this will be my new late night cheap sushi spot.\ni came on a saturday night (around 11ish) and found parking easily.\nwe ordered the 49er roll, shrimp tempura rainbow roll, an alaskan roll, and a chicken karrage appetizer.  everything was good except for the chicken; i wouldn't order it again.", "rating": 4, "date": "2009-04-19"}], "tiger roll": [{"excerpts": ["Tiger roll and rainbow roll were my favorite!"], "author": "Dominique V.", "review": "This place is NOT as bad as everyone thinks. The deal is really good $25 for all you can eat and $29 for all you can eat AND drink.\nFood came out kind of slow but we ordered a lot the first round and got pretty full off of that.\nTiger roll and rainbow roll were my favorite!", "rating": 3, "date": "2017-05-25"}], "lion king roll": [], "karaoke roll": [{"excerpts": ["I got the karaoke roll and the two-piece white tuna nigiri and was very pleasantly surprised! ", "It was DELICIOUS and the fact that they bring it out into the karaoke bar for you was awesome! ", "The portion sizes are also great - the karaoke roll was 8 pieces for 11 bucks, which is a good deal in my book. "], "author": "Casey G.", "review": "This place was so cool! I was at the Mint next door and all of a sudden I see people bringing out sushi so I'm like \"Where is the sushi coming from? I LOVE sushi!\"\n\nI ran next door to Sushi Delight and wow was it good! I got the karaoke roll and the two-piece white tuna nigiri and was very pleasantly surprised! It was DELICIOUS and the fact that they bring it out into the karaoke bar for you was awesome! The portion sizes are also great - the karaoke roll was 8 pieces for 11 bucks, which is a good deal in my book. Also, my friend said that they let him build his own roll, which is pretty cool since I have never heard of a place that is open to that.\n\nIf you're ever in the neighborhood, give this place a try! It's definitely a hidden gem.", "rating": 4, "date": "2011-08-21"}, {"excerpts": ["We split the Tempura Shrimp Rainbow Roll, the Karaoke Roll, the 49er roll and some scallop, salmon, and hamachi nigiri.  ", "The Karaoke roll was delicious and we both agreed and stole the show for the night.  ", "The low priced check was a pleasant surprise as well-very reasonable for the quality."], "author": "Rob B.", "review": "No complaints about Sushi Delight! When i first went in, I was a little worried about the noise pollution of the Karaoke Bar next door and the live Karaoke feed playing on the TV behind the bar, but soon I didn't notice or care about these at all.  The service here was GREAT-teas and waters remained full and the sushi all came out well-timed.  We had an old restaurant.com coupon and they still accepted it.  After the GF and I had taken a LONG run we definitely needed this place. We split the Tempura Shrimp Rainbow Roll, the Karaoke Roll, the 49er roll and some scallop, salmon, and hamachi nigiri.  The Karaoke roll was delicious and we both agreed and stole the show for the night.  The low priced check was a pleasant surprise as well-very reasonable for the quality.", "rating": 4, "date": "2011-09-29"}], "super spicy tuna roll": [], "dinner a for": [], "dinner b for": [], "chashu pork belly dinner": [], "pork katsu": [{"excerpts": ["the pork katsu don is also very tasty", ", it's under eight bucks and comes with miso soup and a salad.\n", "the albacore is always great as is the hamachi toro, when they've got it.\n", "if you want exotic go somewhere else. \nfor the price you really can't beat the quality at  sushi delight."], "author": "tinkerbell e.", "review": "i totally live here.\nif your looking for cheap bites and a friendly crowd this is the place. \n\nwhen i was looking for apartments in san francisco i checked out a place on duboce. it was kinda pricie but cute so i decided to checkout the hood and see what it had to offer. taco bell/kfc, not so much. then i saw sushi delight next to kareoke. was it a dream or had i just found heaven?\ni went in and sat at the bar and started chatting up the ray, the sushi chef, and his brother jason the waiter. the were so funny. i don't remember what i had that first night but i think i've worked my way across the menu and bake in the year living around the corner from there.\na joke that started early on was about the fish balls on the menu. when i order them i like to say very loud and proud \" i would like one order of ray's delicious spicy balls\" this always makes him smile no matter how busy they are. they're quite tasty if you like balls.\nthe pork katsu don is also very tasty, it's under eight bucks and comes with miso soup and a salad.\nthe albacore is always great as is the hamachi toro, when they've got it.\nif you want exotic go somewhere else. \nfor the price you really can't beat the quality at  sushi delight.", "rating": 5, "date": "2006-12-31"}], "veggie tempura entree": [], "chicken katsu don": [{"excerpts": ["Very good Chicken Katsu Don, chicken katsu, seaweed salad is one of my faves and one of the only places I get cucumbers fresh from. ", "I always get delivery, their very courteous and polite. ", "Even called to confirm the order was correct. ", "Will be my go-to japanese restaurant."], "author": "Risa H.", "review": "Very good Chicken Katsu Don, chicken katsu, seaweed salad is one of my faves and one of the only places I get cucumbers fresh from. I always get delivery, their very courteous and polite. Even called to confirm the order was correct. Will be my go-to japanese restaurant.", "rating": 4, "date": "2014-09-01"}], "pork katsu don": [{"excerpts": ["the pork katsu don is also very tasty", ", it's under eight bucks and comes with miso soup and a salad.\n", "the albacore is always great as is the hamachi toro, when they've got it.\n", "if you want exotic go somewhere else. \nfor the price you really can't beat the quality at  sushi delight."], "author": "tinkerbell e.", "review": "i totally live here.\nif your looking for cheap bites and a friendly crowd this is the place. \n\nwhen i was looking for apartments in san francisco i checked out a place on duboce. it was kinda pricie but cute so i decided to checkout the hood and see what it had to offer. taco bell/kfc, not so much. then i saw sushi delight next to kareoke. was it a dream or had i just found heaven?\ni went in and sat at the bar and started chatting up the ray, the sushi chef, and his brother jason the waiter. the were so funny. i don't remember what i had that first night but i think i've worked my way across the menu and bake in the year living around the corner from there.\na joke that started early on was about the fish balls on the menu. when i order them i like to say very loud and proud \" i would like one order of ray's delicious spicy balls\" this always makes him smile no matter how busy they are. they're quite tasty if you like balls.\nthe pork katsu don is also very tasty, it's under eight bucks and comes with miso soup and a salad.\nthe albacore is always great as is the hamachi toro, when they've got it.\nif you want exotic go somewhere else. \nfor the price you really can't beat the quality at  sushi delight.", "rating": 5, "date": "2006-12-31"}], "items bento box": [], "unagi roll": [{"excerpts": ["got spider roll and unagi roll ", "both tasted like they came from a grocery store. ", "I give 1 star for fast delivery."], "author": "Nina M.", "review": "Such a disappointment and its a surprise because of the good reviews it has it might be just what i got. got the mixed tempura all there was was one shrimp and then potatoes, got spider roll and unagi roll both tasted like they came from a grocery store. I give 1 star for fast delivery.", "rating": 1, "date": "2013-09-01"}], "sake maki": [{"excerpts": ["I ordered the shrimp tempura rainbow roll and sake maki roll. ", "It arrived earlier than expected by a courteous delivery guy and the food was good! ", "Thanks guys made my night"], "author": "Rachel T.", "review": "Eat24 review- So delivered sushi can either go really well or terribly wrong right? In my case it went really well. Sunday night I'm craving sushi without leaving the house. I ordered the shrimp tempura rainbow roll and sake maki roll. It arrived earlier than expected by a courteous delivery guy and the food was good! Thanks guys made my night", "rating": 5, "date": "2017-03-19"}], "hamachi maki": [], "spicy hamachi roll": [{"excerpts": ["My spicy hamachi roll was not fresh, very dull. ", "My partner's ramen was a boring let-down as well. ", "I think people give this place high reviews simply because it is connected to the karaoke place. ", "Come on yelpers, you can do better."], "author": "Mark S.", "review": "My spicy hamachi roll was not fresh, very dull. My partner's ramen was a boring let-down as well. I think people give this place high reviews simply because it is connected to the karaoke place. Come on yelpers, you can do better.", "rating": 2, "date": "2010-07-19"}], "spicy salmon roll": [{"excerpts": ["Spicy salmon roll, eel roll", ", ramen noodle soup with fish balls, all were pretty good. ", "Not great but decent. ", "My friends were also pretty happy with the chicken and beef teriyaki. ", "I'd order delivery from here again if I don't find a better Japanese place that delivers to my apartment."], "author": "anna s.", "review": "I got delivery from here once and it was pretty solid. Spicy salmon roll, eel roll, ramen noodle soup with fish balls, all were pretty good. Not great but decent. My friends were also pretty happy with the chicken and beef teriyaki. I'd order delivery from here again if I don't find a better Japanese place that delivers to my apartment.", "rating": 3, "date": "2013-12-15"}, {"excerpts": ["I was ready to downgrade this to a 3 after consuming my spicy salmon roll.  ", "While it was fresh, it was relatively tasteless.  ", "I had to bump it back up when I tried the caterpillar roll.  ", "I think it was eel inside covered with avocado.  ", "It was amazing.  ", "I had to convince my dining partner ", "she was full ", "so she'd let me eat the rest.  ", "It didn't work and "], "author": "Steven R.", "review": "I'm hoping the way I like my sushi isn't indicative of how I am in bed (no, I don't rate myself) :\n\nRelatively simple.  Hopefully that isn't always bad.\n\nSo while I already feel you guys hating me because I gave this place more than 3 stars, hear me out.\n\nLike I said, I'm mainly a sushi guy.  I'll try a roll here and there, but the base of my experience is all about raw fish on rice.  The fish here was excellent and extremely fresh.  In fact, I had to stop myself from eating like a starved hog.  My main complaint of course, was the fish pieces were a little small.  We're not talking tiny, but it's nice when the rice is mostly (if not completely) obscured by the fish.  This was not the case but the fish was really tasty.  Additionally I feel that $15 for 12 pieces (combo A, sucka) of sushi is a deal in the city.  I'm interested in going for the $1 oyster happy hour.\n\nI was ready to downgrade this to a 3 after consuming my spicy salmon roll.  While it was fresh, it was relatively tasteless.  I had to bump it back up when I tried the caterpillar roll.  I think it was eel inside covered with avocado.  It was amazing.  I had to convince my dining partner she was full so she'd let me eat the rest.  It didn't work and I had to trade her some salmon.\n\nOverall, it's a great place for what it is; a tiny neighborhood sushi joint.  Yeah, it's on Market Street but it never makes claims of being anything more and even eschews the ubiquitous \"best sushi in town\" tag a lot of places like to throw on their menus.  The staff were all insanely nice and I think I heard \"thank you\" about 8 times before I left.     \n\nIf you live nearby and are tired of relying on Hanabi for your weekly sushi fix, this is more than worth the walk.", "rating": 4, "date": "2007-08-17"}], "veggie": [{"excerpts": ["I usually order the bento box with three items out of over a dozen to choose from (including California rolls, pork or chicken katsu, potato croquettes, sashimi, veggie or assorted tempura, spring rolls., etc.). \n\n"], "author": "Umilia M.", "review": "I've been here many times when singing at The Mint next door. Once you order, Sushi Delight will bring your meal right to you at the bar--super convenient. \n\nI usually order the bento box with three items out of over a dozen to choose from (including California rolls, pork or chicken katsu, potato croquettes, sashimi, veggie or assorted tempura, spring rolls., etc.). \n\nI'm not the biggest fish fan, which rules out a lot of Sushi places, but Sushi Delight has lots of yummy non-fish options.  The teriyaki beef is always lean and flavorful, cut in little strips, the gyoza is nicely browned on one side, but not tough, the interior stuffing is moist. I also love the teriyaki tofu (silly, I know, with the beef and potstickers), which comes lightly fried with a sweet sauce. Every bento box comes with rice, miso soup, and a small salad with lettuce and cucumbers and a yummy sesame dressing. The rest of my family loves their California Rolls, which are a great deal during happy hour.\n\nThe food is brought to your table promptly, and the staff is always adept and cordial (especially Tinkerbell).\n\nI really appreciate that they accept cards, which lets me save my cash for The Mint.", "rating": 5, "date": "2011-05-19"}, {"excerpts": ["They have a great selection even for veggie lovers. \n", "I live for their Dragon, 49er, and Rainbow roll ! ", "* Drool !!!\n", "Whatever you order rest assured it will be FRESH and DEEELICIOUS !!\n", "This is a great place to meet friends or have a casual date."], "author": "marcus p.", "review": "I've been eating here since before Ray & Jason took it \nover. First it was a burger joint ( Hot & Chunky ). \nThen a sushi place ( Forgot the original name ? \nBut the couple that owned it were fantastic sushi chefs \nand were very warm and friendly ! ) Now it's Sushi Delight. \n( It has been for several years now. ) IMO Ray & Jason \ntook the restaurant to the next level as far as quality and \npresentation is concerned. They're friendly and Ray knows \nhow to serve up some seriously scrumptious sushi !! \nThey have a great selection even for veggie lovers. \nI live for their Dragon, 49er, and Rainbow roll ! * Drool !!!\nWhatever you order rest assured it will be FRESH and DEEELICIOUS !!\nThis is a great place to meet friends or have a casual date.", "rating": 5, "date": "2010-03-03"}, {"excerpts": ["for the vegetarian that digs sushi, like me -\n\ngood selection of veggie sushi and appetizers.  "], "author": "Karen O.", "review": "for the vegetarian that digs sushi, like me -\n\ngood selection of veggie sushi and appetizers.  but the reason to write this review is that they'll make a vegetarian soup for any ramen or udon bowl.  just ask.  awesome!\n\nand if you're a karaoke-goer, just walk through the shared door to place your order, and they'll deliver right to you in The Mint.", "rating": 4, "date": "2010-02-26"}, {"excerpts": ["they have more choices than the standard veggie rolls. ", "The Veggie Delight & Veggie Caterpillar rolls are two of my favorite. \n\n"], "author": "Sapna M.", "review": "Sushi Delight is great - the food is fresh, the prices are very reasonable & the people who work here are super nice!\n\nA huge plus is their extensive vegetarian sushi options ... they have more choices than the standard veggie rolls. The Veggie Delight & Veggie Caterpillar rolls are two of my favorite. \n\nI eat here all the time - it's a great place for a nice, casual, inexpensive sushi meal!", "rating": 4, "date": "2009-06-13"}], "fish ball": [], "piece mochi ice cream": [], "cans of soda": []}