{"egg roll": [], "jumbo soft shell crab": [], "horenzo oshitashi": [], "wakame": [{"excerpts": ["Honestly not my favorite miso soup, but very delicious) and the Wakame Salad($3 ", "I LOVED the salad, though its pretty much the same everywhere) as well. "], "author": "Courtney T.", "review": "Any All You Can Eat sushi place makes me semi-hesitant. My friends visiting from out of town were persistent about finding an AYCE sushi place, so we decided on Sushi Hunter. I called at 6pm on the 30th and made a reservation for 6:30pm, the girl on the phone was very nice. I showed up around 6:20pm and was seated promptly. It was not super busy which was nice. The environment is OK, the walls are painted bright blue which is a somewhat bright color for  dinner ambience. The place is small, so I imagine the brighter color helps the room feel bigger. \n\nThe service is mostly why I'm rating 5 stars (but don't get me wrong, the food was great too). I've worked in the service industry in the past for many years, so I am very critical of my dining experiences. I didn't catch the name of our server, but she was extremely attentive, knew the menu well, helped me with a recommendation, and made sure we had everything we needed. Any extra plates, dishes, napkins that were taking up space were removed in a timely manner. \n\nMy date and I ordered off the a la cart menu and our dishes came out very quick - we took part in the happy hour and ordered 2 alaska rolls ($6 each) and 1 spicy tuna roll($6), and then ordered the specialty Lion king roll. The Lion King roll ($15 was charged, though I thought the menu said $14) differs from place to place and I have to say their Lion King is my favorite of all the other sushi restaurants I've been too. I really enjoyed the Chicken Karrage happy hour appetizer ($4) which was extremely delicious (the batter was nice and crispy and the meat was very tender), a miso soup($1 Honestly not my favorite miso soup, but very delicious) and the Wakame Salad($3 I LOVED the salad, though its pretty much the same everywhere) as well. We spent $53 including 2 hot teas. \n\nOur other 2 friends ordered the all you can eat - one vegan/vegetarian and one with meat. I talked to them yesterday and they still feel full :P The AYCE takes longer when you order alot of things, so they recommend ordering only 5 things at a time. It did take their dishes much longer for ours to come out, but their dishes always featured alot of items. \n\nIf this place was more convenient to get to, I would make a point to come here more often. When I am in the area craving sushi, Sushi Hunter will be the top of my list. Thank you Sushi Hunter for a great dinner! :)", "rating": 5, "date": "2016-01-02"}, {"excerpts": ["Wakame - LOVED! ", "Chewy and perfectly marinated. ", "My friend hadn't had a lot of wakame before and she actually asked if we could order more. "], "author": "Josephine L.", "review": "I always have a good time at AYCE sushi places because, hey, lump sum + sushi forever = good times in my tummy. But I'll preface this by saying I've been completely and utterly spoiled by Toronto and its mecca of AYCE sushi places that defies logic, both in terms of price (soooo cheap), quality (soooo good) and quantity (this menu is how many pages long and they're ALL included in the deal?)\n\nAaaanyway, Sushi Hunter is a decent offering for a city with very few AYCE sushi restaurants. The service was super friendly--they actually asked us to move mid-way through our meal to accommodate a large incoming party, and gave us plenty of plum wine on the house to compensate. The decor is pretty minimal and a tad tacky in terms of lighting, but spacious enough that you could easily have a big group and not want for space. \n\nThe food? Here are my thoughts:\n\nAlaska Roll - Rice could have been better and salmon was a bit...soft....but overall satisfying.\n\nPhilly Roll - Not too much cream cheese. That's a good thing.\n\nRock 'n' Roll Roll - My friend's choice. It wasn't bad, but eel does very little to excite me.\n\nWild Fire Roll - Spicy salmon and cucumber. Such simple things bring such great pleasure.\n\nHamachi and Salmon Maki - My two favorite fish in an AYCE setting. Yeah, we ordered a lot of this.\n\nWakame - LOVED! Chewy and perfectly marinated. My friend hadn't had a lot of wakame before and she actually asked if we could order more. Why yes, hon, I believe we can on account of this is an AYCE place!\n\nChicken Karaage - Is there any food the Japanese don't do well? Fried chicken is manna from heaven. Period. This was pretty good. Not super oily with tender meat.\n\nIt's best to come here with a large group (e.g. friends' night out, birthday party, etc.) and just order everything on the menu that catches your fancy. Sushi is obviously very shareable, but most of the other menu items are too, so it's a great \"family dinner\"-style place.", "rating": 3, "date": "2014-02-22"}, {"excerpts": ["The wakame salad was amazing. ", "Loads of sesame, nice tangy taste, just the right amount of sauce and chili. ", "We had 4 orders of it. ", "The funny thing was the order portion got bigger and bigger as we got them.\n", "Miso soup was amazing. "], "author": "Erica L.", "review": "Oh my god oh my god oh my god sushi hunter was amazing!!!\n\nJust came back from a TON of deliciousness with my boyfriend. $25 for all you can eat, $28 on Fri-Sun, $18 for kids. \n\nCheck my picture for a glimpse of their all you can eat menu. There's a large variety of stuff you can get.\n\nOk so my advice: go in a huge group, maybe 4-6. Order everything on the menu, share it amongst the group. I feel kinda bad ordering a lot when it's just me and my boyfriend. I peel off the rice and eat the nigiri as sashimi to conserve stomach space. \n\nThe appetizers:\nThe edamame's really good. Nice and warm, nicely salted, good portion, 1 order is enough for 3 people. \nFried tofu's not as good. They should've used egg tofu instead of the gamey tofu. The sauce for the fried tofu could've been more savory too, it's very watered down. Nori and fish shavings would be a nice touch to it too. The horenzo's yummy! It doesn't have the tart feeling on your tongue after you eat normal spinach. The sauce is nice and not too sweet. \nThe wakame salad was amazing. Loads of sesame, nice tangy taste, just the right amount of sauce and chili. We had 4 orders of it. The funny thing was the order portion got bigger and bigger as we got them.\nMiso soup was amazing. Lots of tofu, lots of seaweed, and the sprinkled spring onion makes it perfect. \n\nSushi:\nNigiri's come in 2 pieces per order. Rolls come in 6 pieces per order. Salmon, tuna, ika, eel were yummy. Don't get the seared tuna, it's just tasted like a lower quality tuna, seared, and powered with pepper. The white tuna wasn't nice either, it was very fishy, gamey, and didn't taste fresh at all. The rolls are nice. Small portions but it's nice cuz you can order more. Philadephia was better than San Francisco, the cream cheese adds a nice tangy taste to it. \n\nOther stuff:\nUdon was nice. Good portion for 1-2 people. Broth is clear, noodles were chewy. The crunchy stuff (i forgot what it's called) is really nice in it.\nTeriyaki beef was yummy too. The sauce was tangy.\nThe tempuras weren't my favorite, but my bf liked it. They were missing the raddish stuff that goes in the sauce. The shrimps were teeny and it was over-coated with batter. I'm not accustomed to broccoli and carrot tempura, so that was a bit weird. \nThe curry tonkatsu was nice at first, but it was too much for a person. But it's nice and crispy, the curry wasn't bad either. \n\nTheir plating on the appetizers and other stuff is nice and decent. They do a good job plating it like delicacies. \n\nAlso note their bathroom signs (the boy sign and the girl sign) are a decapitated boy and a decapitated girl. I thought that was really funny. \n\nOverall it's a nice, clean restaurant. The ambiance is nice and relaxing, service was really good (didn't take long to bring our food out, waitresses were cute and on top of their stuff) and bathroom was really big (at least for the girls) and clean.\nI would come here over a normal sushi place like the sushi boat because it's soooooooo much cheaper this way. And you get more choices of food. I'll see you again soon Sushi Hunter!", "rating": 4, "date": "2011-08-08"}, {"excerpts": ["And not only sushi, either, the menu included appetizers (edamame, wakame salad, agedashi tofu) and entrees (tempura, donburi, katsu) as well.  \n\n"], "author": "Cathy Y.", "review": "A third location to defy the \"dirty overhang + sketchy neon signs = avoid\" rule (the other two being Bamboo Hut and Chili Cha Cha)\n\nAll you can eat sushi: $26 on weekend nights and $24 on weekdays.  They have an extensive AYCE menu, where you order the food and the waitresses bring out what you order.  And not only sushi, either, the menu included appetizers (edamame, wakame salad, agedashi tofu) and entrees (tempura, donburi, katsu) as well.  \n\nBut, of course, we must stuff ourselves full of the sushi to get our money's worth!  The rolls weren't top-of-the-line (for example, the spider roll did not include tobiko) and the nigiri didn't cause me to make my O face, but everything was very tasty and fresh.  And, I feel it's important to add, I didn't feel like they were trying to overstuff me with rice on rolls or nigiri.\n\nSo, put aside your worries about the sketchy storefront, and enjoy unlimited tasty sushi!", "rating": 4, "date": "2010-12-17"}, {"excerpts": ["My favorites were the hamachi nigiri (very fresh!), wakame, and agedashi tofu. ", "One of the pros of doing ayce sushi here is that there is no limit to how much you are allowed to order at once, as long as you are able to finish it. ", "One complaint I do have is that the texture of the rice is ehh (a little too much on the mushy side), and I've heard that the fish to rice ratio of the nigiri can be kind of one-sided (meaning way too much rice and not enough fish). "], "author": "Leeann C.", "review": "I came here with a group of 5 for ayce sushi dinner on a Saturday night. Among the 5 of us, we ordered probably 4 or 5 rounds of countless nigiri and rolls, plus several appetizers. My favorites were the hamachi nigiri (very fresh!), wakame, and agedashi tofu. One of the pros of doing ayce sushi here is that there is no limit to how much you are allowed to order at once, as long as you are able to finish it. One complaint I do have is that the texture of the rice is ehh (a little too much on the mushy side), and I've heard that the fish to rice ratio of the nigiri can be kind of one-sided (meaning way too much rice and not enough fish). For the price, I think I'd rather have ayce sushi at Sushi 85 in Mountain View.\n\n-L.", "rating": 3, "date": "2010-08-23"}, {"excerpts": ["Wakame Salad: pretty small portion for $3.95 ", "but I liked that they drained it pretty well...", "a lot of places don't bother to and the salad ends up being too wet\n~ ", "Volcano Roll: "], "author": "Katelynn L.", "review": "I bought a restaurant.com gift certificate for Sushi Hunter a while back and finally put it to use today.  Since it is not valid for the all you can eat deal, my boyfriend and I just ordered from the regular menu.\n\nWe shared the following:\n~ Wakame Salad: pretty small portion for $3.95 but I liked that they drained it pretty well...a lot of places don't bother to and the salad ends up being too wet\n~ Volcano Roll: my favorite of the rolls we ordered...super hot like the menu says...yum!\n~ Deep Sea Swimmer Roll: spicy tuna and cucumber inside topped with butterfish and tempura crunches...I couldn't really taste the butterfish but it was a very good roll nonetheless\n~ Titanic Roll: even though it has tempura prawn inside and is topped with salmon, tuna and spicy crab salad, this was a surprisingly light roll...the salmon and tuna were very fresh as well\n\nThe sushi at Sushi Hunter is definitely better than a lot of other places that I've been to and I like that their rolls are different than the standard ones at a lot of places.  Plus, they didn't put a lot of mayo in their rolls, which is awesome.\n\nEven though we ordered less than $40 of food (the gift certificate is good for $25 off for $35 or more), our total came out to be a little under $25 after tax and 18% gratuity (automatically added for using the gift certificate), so I am definitely glad we had that.  If parking wasn't such a pain, I'd love to come back more often.", "rating": 4, "date": "2010-03-27"}, {"excerpts": ["I love the seared tuna and the fact that there are tons of non-sushi items like agedashi and wakame.  ", "Service is good. ", "You can basically guarantee that when you order all you can eat they'll forget something, but as long as you ask again you'll get it.  ", "All you can drink sake is awesome/terrible idea.  "], "author": "Jesse L.", "review": "Definitely my favorite sushi place in the city.  It is not the best sushi, but the all you can eat is fresh and made to order.  I love the seared tuna and the fact that there are tons of non-sushi items like agedashi and wakame.  Service is good. You can basically guarantee that when you order all you can eat they'll forget something, but as long as you ask again you'll get it.  All you can drink sake is awesome/terrible idea.  Not sure I've ever been here without accidentally breaking something. \n\nWeird side note, one of the waiters recognized me at a Warriors/Mavs playoff games a couple years back.  That won me over.", "rating": 4, "date": "2009-01-28"}, {"excerpts": ["One thing Sushi Hunter does better though is including some of the started stuff like Saba Shioyaki, Agedashi Tofu, Wakame, and Gyoza as well in the AYCE menu. ", "If I was just in a sushi mood I'd easily pick 85 over Hunter, but if I was 'hunting' for more variety (and didn't care about the extra drive the The City) "], "author": "Valerie F.", "review": "I like this place well enough but Sushi 85 in Mountain View is nearer and has a much bigger selection and is just as fresh, and in the case of fish roe fresher taste/quality of fish. That being comparing the AYCE food coma menu's to each other. One thing Sushi Hunter does better though is including some of the started stuff like Saba Shioyaki, Agedashi Tofu, Wakame, and Gyoza as well in the AYCE menu. If I was just in a sushi mood I'd easily pick 85 over Hunter, but if I was 'hunting' for more variety (and didn't care about the extra drive the The City) Sushi Hunter would be a better choice. \n\nPark in the City Parking near the cop shop and walk one block down and two over", "rating": 4, "date": "2009-02-09"}, {"excerpts": ["But it was the WORST edamame I have ever, and the wakame was a bit greasy.  "], "author": "Amme P.", "review": "Normally I would not think of going to North Beach for sushi, and to be honest, I was just walking home wanting sushi.  \n\nI actually went here instead of sushi on north beach (which I know to be good) JUST so I could yelp about it. \n\nThe prices are reasonable.  But it was the WORST edamame I have ever, and the wakame was a bit greasy.  The sushi was adequate.  \n\nAs other reviews mention, if you are looking for great prices, this place is great, but not great if you are looking for great sushi.", "rating": 3, "date": "2007-03-27"}, {"excerpts": ["Great gyoza, tasty tempura, wonderful wakame, eggcelent eggrolls. \n", "If you want fancy rolls, order off the menu or go elsewhere."], "author": "jacob s.", "review": "Go here for value and for Japanese favorites. The sushi buffet is good but not great, but the side dishes included in the buffet are great. Great gyoza, tasty tempura, wonderful wakame, eggcelent eggrolls. \nIf you want fancy rolls, order off the menu or go elsewhere.", "rating": 4, "date": "2012-02-20"}, {"excerpts": ["The menu included appetizers like gyoza, wakame, salad, udon, miso soup; entrees like tonkatsu, curry katsu, fried makarel; rolls (about 10 or so); and nigiri sushi of all sorts. ", "And even better: there was enough variety that even I (8 months pregnant) had a good choice of sushi (the sashimi looked sooooo fresh and, according to everyone, tasted good too! "], "author": "Felicia S.", "review": "My cousins suggested this restaurant after they tried it (they found it on Yelp!). When I heard it was an all-you-can-eat, I expected mediocre (at best) sushi and I was surprised at the quality! \n\nFirst of all, there were 18 of us and we waited about 10 minutes for our table - not bad considering it was a Friday night. Then the menus came out for the all-you-can-eat... I thought it was going to be buffet style so this was great cuz they make the sushi fresh for you. The menu included appetizers like gyoza, wakame, salad, udon, miso soup; entrees like tonkatsu, curry katsu, fried makarel; rolls (about 10 or so); and nigiri sushi of all sorts. And even better: there was enough variety that even I (8 months pregnant) had a good choice of sushi (the sashimi looked sooooo fresh and, according to everyone, tasted good too! Sigh, after the baby comes we'll go again!)\n\nThe service was good in the beginning, but, because our party was so big, they started mixing up our orders and gave us seconds of previous items. Also, they took a while for certain orders - had to keep reminding them about the order. But they did let us stay as long as we wanted and we never felt rushed. In fact, we did loiter until closing time.... =P Yet they never kicked us out, even after we paid!\n\nThe only item that was a bit disappointing was the Kentucky roll: fried chicken with lettuce. A bit dry. \n\nOverall, pretty good all-you-can-eat and I'd definitely go back!", "rating": 4, "date": "2009-06-20"}, {"excerpts": ["The gyoza was my favorite, tempura was crispy (and oily), agedashi tofu was average, wakame salad got a bit salty towards the bottom of the bowl, chicken anything was terrible. ", "The chicken katsu, the chicken karaage - what mean were they using?"], "author": "Jonas T.", "review": "$23 for a sushi buffet doesn't sound too bad, but the buffet menu was very limited. The fish was fresh; however, I wish they had offered sashimi. All that rice just filled me up too quickly. The gyoza was my favorite, tempura was crispy (and oily), agedashi tofu was average, wakame salad got a bit salty towards the bottom of the bowl, chicken anything was terrible. The chicken katsu, the chicken karaage - what mean were they using?", "rating": 3, "date": "2006-10-21"}], "sunomono": [], "hawaii poke": [], "negi hama": [{"excerpts": ["My bento contained curry tonkatsu, saba shioyaki, and negi hama (yellow tail and green onion).  ", "The curry on the tonkatsu was bland and the meat, poorly breaded.  ", "Saba shio made up for it though - quite tasty!  ", "And the negi hama was nothing to rave about.  \n\n"], "author": "Kathleen W.", "review": "Sushi Hunter screams trendy.  The walls are washed a cool blue, the bar glows, cute decor, and the music was bumping.  Unfortunately, the dining experience was average and not as wow-worthy as the restaurant itself.\n\nMy two friends came for the AYCE experience, but I was not as hungry.  The unwritten rule here is that all individuals in your party have to order AYCE.  However, since the restaurant was so empty I was able to order a bento dinner and skirt the rule.  \n\nThe selection and quality was average.  My bento contained curry tonkatsu, saba shioyaki, and negi hama (yellow tail and green onion).  The curry on the tonkatsu was bland and the meat, poorly breaded.  Saba shio made up for it though - quite tasty!  And the negi hama was nothing to rave about.  \n\nMy counterparts on the AYCE menu had many items to choose from, but since we're talking AYCE you have to maximize the fish and minimize the carbs to get your money's worth ($28/person).  They were able to find enough favorites to be stuffed silly!  :P  \n\nIf you ask me...these rolls, nigiri, entrees, and appetizers do not compare to my favorite AYCE sushi place in Daly City - Kome.  The sushi is fresher, the rolls are SPECTACULAR (and huge), they have tons of seafood, dim sum, etc at a lower price of $22.95/person.  If it came down to the two, I would select Kome in a heartbeat.", "rating": 3, "date": "2012-08-15"}, {"excerpts": ["i had the bento box with teriyaki chicken, negi hama (yellow tail), and tekka (teppa?) ", "roll (tuna roll). ", "my boyfriend had a bento box with tempura, salmon shioyaki, and nigiri, chef's choice. ", "all of the different items were okay... ", "chef's choice was yellowtail, tuna, and unagi. ", "the miso soup was wonderful (!), probably my favorite miso soup of any restaurant.. but I take issue with the fact that the waitress asked us if we wanted some edamame to start, and then charged us for it. ", "maybe that's standard, but i feel like they just offer that for free at a lot of japanese restaurants? ", "and then there's that tension moment where you assume it's free, but you don't want to ask because it's tacky to ask \"is it free?\"  ", "so it's not free. ", "anyway, the food was pretty decent.... not too filling. ", "with restaurant.com, it was $34 for two bento boxes, an alaska roll, two tsingtao's, and edamame. ", "i have no issues with this place, but i'd never crave it either."], "author": "Kimberly S.", "review": "(okay, so this restaurant is really a 3.5...)\n\nin the past, i've always had the all-you-can-eat which is pretty solid. i'd probably opt for Sushi Hana's all-you-can-eat over Sushi Hunter's.... it's worth it if you get a lot of nigiri. \n\ntonight i ordered from the regular menu...it was an okay experience. i had the bento box with teriyaki chicken, negi hama (yellow tail), and tekka (teppa?) roll (tuna roll). my boyfriend had a bento box with tempura, salmon shioyaki, and nigiri, chef's choice. all of the different items were okay... chef's choice was yellowtail, tuna, and unagi. the miso soup was wonderful (!), probably my favorite miso soup of any restaurant.. but I take issue with the fact that the waitress asked us if we wanted some edamame to start, and then charged us for it. maybe that's standard, but i feel like they just offer that for free at a lot of japanese restaurants? and then there's that tension moment where you assume it's free, but you don't want to ask because it's tacky to ask \"is it free?\"  so it's not free. anyway, the food was pretty decent.... not too filling. with restaurant.com, it was $34 for two bento boxes, an alaska roll, two tsingtao's, and edamame. i have no issues with this place, but i'd never crave it either.", "rating": 3, "date": "2010-02-23"}], "salmon skin roll": [{"excerpts": ["The end all was the salmon skin roll with ", "I don't know what the fuck on it as some type of garnish. "], "author": "Henry W.", "review": "I tried again. This place still hasn't at least have the respect to make proper sushi rice. Just over cooked white rice. \n\nThe end all was the salmon skin roll with I don't know what the fuck on it as some type of garnish. Literary look like shavings from when you sharpen your pencil. \n\nMy wife likes this place. I guess she's going to have to find another place to go to.", "rating": 1, "date": "2018-02-05"}], "crunch roll": [{"excerpts": ["My personal favorite was the Crunch Roll, and there were a few other good-tasting rolls out there ", "(Wild Fire roll, Rock'n Roll). ", "But the rest was meh. "], "author": "Rahul R.", "review": "Came here last night with 5 others for what was all of our first times with AYCE (all you can eat) sushi. We made a reservation for 8pm, showed up 5 minutes early, got our table immediately. The waiter helped us out in ordering food for our first round, as we were all unsure what to get.\n\nLike others have said, the food was good but nothing special. My personal favorite was the Crunch Roll, and there were a few other good-tasting rolls out there (Wild Fire roll, Rock'n Roll). But the rest was meh. I despised the maki and the nigiri wasn't too tasty, which left a lasting impression.\n\nThe service was good for us -- the waiter would come by to take our plates and orders whenever we finished a round, brought more water frequently, and were helpful in general.\n\nI am disappointed by the price, however. For $30 AYCE, I expected more. $30 isn't even accurate because they add tax and then the 18% gratuity. So for 6 people, $180 AYCE becomes $230, meaning we all just paid close to $40 for decent AYCE sushi.\n\nOverall, I wouldn't come back here again without trying out (or at least reading through more reviews of) other AYCE sushi restaurants nearby.", "rating": 3, "date": "2017-08-26"}, {"excerpts": ["The crunch roll was my favorite!"], "author": "Danielle B.", "review": "All you can eat sushi was so good! It was really nice to be able to make reservations online, super quick and easy.  The service was good and the sake was flowing, what more could you ask for?! The crunch roll was my favorite!", "rating": 5, "date": "2015-03-24"}, {"excerpts": ["I do like the crunch roll and the devil roll at first, "], "author": "Danielle J.", "review": "So I'd been here before as we live nearby and love all you can eat sushi and after that experience (which wasnt particularly bad), I swore off all you can eat sushi ever again...\n\nUnfortunately today we decided to give it another go (maybe 4 months later).  Given this time it was a Saturday, the all you can eat is more $ than weekdays (makes sense and we knew that beforehand), and the place was pretty packed.  They put us at a little 2 person stand alone in between a bunch of other tables en route to the bathroom table, where my boyfriend bitched about staring at/facing the wall.\n\nDefinitely cramped and whenever anyone walked to the bathroom my boyfriend had to scoot his seat in so they could get by...\n\nAside from that issue, our waters were nearly empty at all points in time, the initial waters they gave us were warm (ice had long melted), and only about half full.  When we'd ask for more water, they literally would ignore us and walk around and refill everyone else in the entire place's water and still not refill ours (nor were other patrons waters actually empty as ours were).  \n\nAdditionally, after our initial sushi order, our waitress essentially never came over to us again.\nDuring our first round of rolls my boyfriend discovered a sticker stuck inside a roll, from the skin of an avocado.  Worrisome that 1) they put avocado skins in the sushi rolls, and 2) that the stickers would also be inside the roll.  We pointed this out to one of the waitresses (as ours had never returned), but she sort of laughed like it was no biggie...hm ok.\nSo as many people said, the time between orders is pretty ridic, and when you have no water and are being crammed in between huge parties/tables nearby who constantly need to go to the bathroom and trample you, the experience is that much less enjoyable.\n\nMost of the rolls (as our water in the rare occasions we had water), were somewhat warm, and yes, mostly rice and little fish.  I do like the crunch roll and the devil roll at first, but then after a couple orders i'd rather jump out a window than finish anymore of either of those rolls.\n\nWe had to wait for eternity to be able to tackle someone for a 2nd refill of water (which also hindered our ability to down as much sushi as we could otherwise), and to get our bill.\n\nThis time we will NOT be back. I mean it this time. And if we do return, I am 100% certain I will again regret it.\n\nAwful service, worrisome food. That said, the one male waiter (maybe a manager) was very nice and definitely overworked. They need a larger staff, at least for the busy weekend shifts....and given the stickers inside the sushi rolls, perhaps a new kitchen/quality control staff as well.", "rating": 2, "date": "2010-05-15"}, {"excerpts": ["While we were still working on those, our sushi rolls ( 2 orders of spicy tuna, 2 orders of rock n roll, crunch roll, albacore maki, and a San Francisco roll)  along with our salmon, tuna, and hamachi sushi nigiri AND our chicken katsu were making its way to the table. \n\n"], "author": "Krystal T.", "review": "My friends and I were looking for a place to eat before we went over to a show at Cobb's; didn't really feel like Italian so we were trying to list off different cuisines. Then someone mentioned sushi..which at that time just sounded like the best idea ever. But sushi in North Beach? Yes, sushi in North Beach.. better yet, all-you-can-eat sushi in North Beach :) \n\nWe were kinda in a rush since we only had about an hour before our show. So we sat down, glanced at the menu, waved down the waitress (before a group of 6 could), and started ranting off what we wanted. \n\nThe food came out pretty quick; there were two sushi chefs working and two waitresses. Within 5 minutes our appetizers (edamame,  2 wakames, fried tofu, cold tofu, and 4 miso soups) started slowly appearing.. and disappearing at the same time. While we were still working on those, our sushi rolls ( 2 orders of spicy tuna, 2 orders of rock n roll, crunch roll, albacore maki, and a San Francisco roll)  along with our salmon, tuna, and hamachi sushi nigiri AND our chicken katsu were making its way to the table. \n\nBetween four people, we had a decent amount of food. We even had enough time.. and stomach space to get a couple more nigiri. Too bad the group of 6 decided to take all the hamachi for the rest of the night. Selfish. \n\nEven though we were about 20 minutes late to the show, it was worth it. The salmon and hamachi slices  were SO unbelievably fresh; it just melted in my mouth. I think I would've been able to just sit there and eat chunks of it. The other rolls on the menu looked really interesting and good; must try those the next time I'm there. \n\nMinus points for charging $1 for tea- thought only dim sum places do that", "rating": 4, "date": "2009-04-06"}], "rockn roll": [], "teriyaki chicken roll": [], "san francisco roll": [{"excerpts": ["While we were still working on those, our sushi rolls ( 2 orders of spicy tuna, 2 orders of rock n roll, crunch roll, albacore maki, and a San Francisco roll)  along with our salmon, tuna, and hamachi sushi nigiri AND our chicken katsu were making its way to the table. \n\n"], "author": "Krystal T.", "review": "My friends and I were looking for a place to eat before we went over to a show at Cobb's; didn't really feel like Italian so we were trying to list off different cuisines. Then someone mentioned sushi..which at that time just sounded like the best idea ever. But sushi in North Beach? Yes, sushi in North Beach.. better yet, all-you-can-eat sushi in North Beach :) \n\nWe were kinda in a rush since we only had about an hour before our show. So we sat down, glanced at the menu, waved down the waitress (before a group of 6 could), and started ranting off what we wanted. \n\nThe food came out pretty quick; there were two sushi chefs working and two waitresses. Within 5 minutes our appetizers (edamame,  2 wakames, fried tofu, cold tofu, and 4 miso soups) started slowly appearing.. and disappearing at the same time. While we were still working on those, our sushi rolls ( 2 orders of spicy tuna, 2 orders of rock n roll, crunch roll, albacore maki, and a San Francisco roll)  along with our salmon, tuna, and hamachi sushi nigiri AND our chicken katsu were making its way to the table. \n\nBetween four people, we had a decent amount of food. We even had enough time.. and stomach space to get a couple more nigiri. Too bad the group of 6 decided to take all the hamachi for the rest of the night. Selfish. \n\nEven though we were about 20 minutes late to the show, it was worth it. The salmon and hamachi slices  were SO unbelievably fresh; it just melted in my mouth. I think I would've been able to just sit there and eat chunks of it. The other rolls on the menu looked really interesting and good; must try those the next time I'm there. \n\nMinus points for charging $1 for tea- thought only dim sum places do that", "rating": 4, "date": "2009-04-06"}], "philadelphia roll": [{"excerpts": ["I ordered a spicy scallop and Philadelphia roll. ", "The salmon texture was off and not fresh. "], "author": "Emily H.", "review": "I had my doubts walking into this place due to the low reviews. I should have went with my gut. I'm a big believer that sushi rice is super important to sushi. Theirs was soggy: they type that sticks to your teeth. I ordered a spicy scallop and Philadelphia roll. The salmon texture was off and not fresh. TMI but the food didn't sit well with me that night. \n\nIf you're forced to come here, order the udon. I didn't taste it, but my friends said it wasn't bad. If you can avoid it, do.", "rating": 1, "date": "2016-07-19"}, {"excerpts": ["Philadelphia Roll - Fresh Salmon, Avocado & Cream Cheese\nRed Dragon Roll - Tempura Prawn Inside, Topped with Tuna & Avocado\nTokyo Pizza Roll - Red Snapper & Mozzarella Cheese ", "Inside, Slightly Fried, Topped with Scallion & Tomato Sauce\n \n", "Sweet. ", "I lucked out again because I actually found a winner in picking one of the best sushi I've ever tasted. ", "Well...fusion sushi. ", "The selection I've tasted were of definite quality but the Tokyo Pizza Roll was to die for and something that I know I'd have a craving for in the near future. "], "author": "Charmian D.", "review": "We were on a classified mission for a sushi joint...so what was I doing in North Beach you might ask?\n\nNot my fault...I didn't drive, I took a nap after an exciting task of bookkeeping all day and my driver missed Geary St so we ended up at North Beach by the time I woke up...whaaat! \n\nHowever, we actually spotted a sushi joint...thought I'd try this place out\n\nI glanced at my to eat list and gorged on the following:\n\nPhiladelphia Roll - Fresh Salmon, Avocado & Cream Cheese\nRed Dragon Roll - Tempura Prawn Inside, Topped with Tuna & Avocado\nTokyo Pizza Roll - Red Snapper & Mozzarella Cheese Inside, Slightly Fried, Topped with Scallion & Tomato Sauce\n \nSweet. I lucked out again because I actually found a winner in picking one of the best sushi I've ever tasted. Well...fusion sushi. The selection I've tasted were of definite quality but the Tokyo Pizza Roll was to die for and something that I know I'd have a craving for in the near future. Interesting that it happens at an area which I would visit for a bite off a calzone or a chomp off a pasta plate.\n\nMission accomplished...all is forgiven. But, driver, don't forget your GPS next time...", "rating": 5, "date": "2009-06-25"}], "spicy scallop roll": [{"excerpts": ["-The AYCE sushi option had a good combination of appetizers, nigiri, and rolls on the menu (favorites: salmon, surf clam, spicy scallop roll). ", "There's no limit to order size as well - get as much as you want for the first round (or any round). ", "Eat lots of nigiri to make it worth your ", "$.\n", "-Good ", "place for groups of 8-10.\n", "-We ate for 2 hours, but I never felt rushed in the process. \n", "-I liked the giant fish-shaped light fixture on the ceiling. "], "author": "Aileen L.", "review": "Saddened by the 2-hour wait for AYCE Korean BBQ in Japantown, my friend and I ventured here for consolation. Of course it was packed on a Saturday night - the servers were definitely stressed out from accommodating customers' requests. Since they were preoccupied with serving tables with 50+ piece sushi plates, it took us 10+ minutes to get seated (despite there being 2 tables readily available). We could have just seated ourselves, gotten our own menus, and saved everyone the trouble...\n\nThings I appreciated:\n-The AYCE sushi option had a good combination of appetizers, nigiri, and rolls on the menu (favorites: salmon, surf clam, spicy scallop roll). There's no limit to order size as well - get as much as you want for the first round (or any round). Eat lots of nigiri to make it worth your $.\n-Good place for groups of 8-10.\n-We ate for 2 hours, but I never felt rushed in the process. \n-I liked the giant fish-shaped light fixture on the ceiling. Yep.\n\nThings I didn't appreciate as much:\n-The sushi was mediocre (in terms of freshness / flavor) - but at least it was plentiful!\n-Rolls were much smaller/plainer than I expected. Pretty sure the non-AYCE rolls were much bigger.\n-Service during peak hours. It got a lot better once people started leaving by 10-10:30pm (since there was no one else to serve but us, muahaha!).\n-Parking was a complete nightmare. You'll definitely have an appetite by the time you find a spot around this area.\n\nOverall: a decent SF alternative if you don't want to venture to Davis for AYCE sushi.", "rating": 3, "date": "2014-09-21"}, {"excerpts": ["We ordered two miso soups, the Large Sashimi Plate, two pieces of Ikura, the Spicy Scallop Roll (spicy tuna and cucumber), and the Spicy Tataki (spicy tuna and cucumber topped with seared white tuna and garlic).  ", "The Large Sashimi Plate contains 25 pieces and costs $33, which is the best deal we've ever found and the reason we get it every time.  "], "author": "Niya Y.", "review": "My boyfriend and I ordered dinner from Sushi Hunter two weeks ago.  It's our go-to sushi place because it's close to our apartment, decently priced, and makes deliveries.  They also have an in-house all you can eat menu for $25 per person, which I have taken advantage of more than once.\n\nWe ordered two miso soups, the Large Sashimi Plate, two pieces of Ikura, the Spicy Scallop Roll (spicy tuna and cucumber), and the Spicy Tataki (spicy tuna and cucumber topped with seared white tuna and garlic).  The Large Sashimi Plate contains 25 pieces and costs $33, which is the best deal we've ever found and the reason we get it every time.  The only drawback is that you can't request specific types of fish, so if you're really picky, you're probably better off ordering individual sashimis.\n\nPer usual, everything tasted good.  The salmon sashimi could always be fresher, and there could always be more mackerel in the sashimi plate (this time we got none), but at the end of day, sushi of any kind makes me happy.\n\nPer not usual, they were late in delivering our meal.  They told us it would take 45 minutes, but we waited for an hour, and when I called them, they told me that we had wait an additional 10 minutes because they were understaffed.  As apology, they gave us a 10-ounce bottle of nigori (cloudy) sake, which I mixed with orange juice and which more than compensated for the extra wait.", "rating": 4, "date": "2011-05-30"}, {"excerpts": ["I got 3 orders of salmon nigiri, udon soup, a house salad, and a spicy scallop roll. ", "My friend got even more than I did. ", "The house dressing on the salad was really good and and spicy. ", "It was none of that thousand island bullshit, it was homemade. ", "The fish is fresh as well. ", "The waitresses were super friendly and nice and kept coming to our table to ask if we wanted to order anything more. ", "I definitely like this place and will be back for the all you can eat menu."], "author": "Jennifer J.", "review": "I really like this place. In a sea of Italian restaurants it is nice to have an option for good sushi. The all you can eat menu is the way to go. I went on a Saturday and it was $28. I got 3 orders of salmon nigiri, udon soup, a house salad, and a spicy scallop roll. My friend got even more than I did. The house dressing on the salad was really good and and spicy. It was none of that thousand island bullshit, it was homemade. The fish is fresh as well. The waitresses were super friendly and nice and kept coming to our table to ask if we wanted to order anything more. I definitely like this place and will be back for the all you can eat menu.", "rating": 4, "date": "2012-08-26"}], "devil roll": [{"excerpts": ["I really enjoyed the devil roll, and their gyoza were sinfully delicious."], "author": "Brian W.", "review": "Sushi Hunter is a fantastic restaurant with friendly staff and an excellent selection; both on their made-to-order all you can eat, and à la carte menus. I really enjoyed the devil roll, and their gyoza were sinfully delicious.", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["Rolls are standard fare - none of the fancier varieties, but relatively solid California rolls, rock n rolls, spicy tunas and the like (check out the devil roll, my personal fave!)\n\n"], "author": "Gary E.", "review": "There are two terms that generally shouldn't be used in the same sentence. \"All you can eat\" and \"sushi\".\n\nY'see, when it comes to an all you can eat affair, it's generally quality over quantity. Seriously - think of the majority of all you can eat places you've been to, and you'll likely remember lots and lots of food, but none of it particularly good.\n\nAnd when you take quality away from sushi, then... well, it often involves calling in sick, and setting up camp in the bathroom the next morning.\n\nSushi Hunter, tho, is in the minority in giving quality AND quantity. Their $23.95 all you can eat menu is a serious value if you go in there hungry - although in true all you can eat fashion, it evens out in the end. (My friend and I certainly wolfed down more than $24 worth of sushi. The girls, on the other hand, nowhere near it. So... balance!) Their nigiri was acceptable - not mind blowingly good, but I've CERTAINLY had worse (I've actually had FAR worse, which led to one of those affore mentioned sessions in the bathroom). Their tempura was actually quite good. Their gyoza was, in my admittedly limited opinion, excellent. Rolls are standard fare - none of the fancier varieties, but relatively solid California rolls, rock n rolls, spicy tunas and the like (check out the devil roll, my personal fave!)\n\nThe service, I have to say, can be a tad spotty - but when the chefs are whipping out unlimited goodies for tubbs like me, with two waitresses running hither and tither, I couldn't hold it against them.\n\nLike I said. It's not the best sushi money can buy, but this little place in North Beach is a helluva deal, and a new favourite spot of mine.", "rating": 4, "date": "2009-07-23"}, {"excerpts": ["Try the chicken karaage, gyoza, and especially the devil roll."], "author": "Jenny L.", "review": "Hurray for sushi buffet in the city!  Now I can be a fatty without driving out to the boonies!\n\nI should have looked more closely at their website before going, but they validate parking for 90 minutes!  Sweetens the pot that much more, since it borders the nightmare of all parking hell, NoBe.\n\n$26 for all you can eat menu (http://www.sushi-hunter.com/ayce.htm).  Like all other sushi buffets, they tend to mess up your order and forget things.  A lot.  But we spent a lot of time in there, so we just kept ordering.  It was great.\n\nTry the chicken karaage, gyoza, and especially the devil roll.", "rating": 4, "date": "2009-07-09"}, {"excerpts": ["Devil roll, hot angel roll, Alaska roll, wild fire roll\nSalmon nigiri"], "author": "L B.", "review": "Not bad for all you can eat sushi.\nDevil roll, hot angel roll, Alaska roll, wild fire roll\nSalmon nigiri", "rating": 4, "date": "2013-08-16"}, {"excerpts": ["I do like the crunch roll and the devil roll at first, "], "author": "Danielle J.", "review": "So I'd been here before as we live nearby and love all you can eat sushi and after that experience (which wasnt particularly bad), I swore off all you can eat sushi ever again...\n\nUnfortunately today we decided to give it another go (maybe 4 months later).  Given this time it was a Saturday, the all you can eat is more $ than weekdays (makes sense and we knew that beforehand), and the place was pretty packed.  They put us at a little 2 person stand alone in between a bunch of other tables en route to the bathroom table, where my boyfriend bitched about staring at/facing the wall.\n\nDefinitely cramped and whenever anyone walked to the bathroom my boyfriend had to scoot his seat in so they could get by...\n\nAside from that issue, our waters were nearly empty at all points in time, the initial waters they gave us were warm (ice had long melted), and only about half full.  When we'd ask for more water, they literally would ignore us and walk around and refill everyone else in the entire place's water and still not refill ours (nor were other patrons waters actually empty as ours were).  \n\nAdditionally, after our initial sushi order, our waitress essentially never came over to us again.\nDuring our first round of rolls my boyfriend discovered a sticker stuck inside a roll, from the skin of an avocado.  Worrisome that 1) they put avocado skins in the sushi rolls, and 2) that the stickers would also be inside the roll.  We pointed this out to one of the waitresses (as ours had never returned), but she sort of laughed like it was no biggie...hm ok.\nSo as many people said, the time between orders is pretty ridic, and when you have no water and are being crammed in between huge parties/tables nearby who constantly need to go to the bathroom and trample you, the experience is that much less enjoyable.\n\nMost of the rolls (as our water in the rare occasions we had water), were somewhat warm, and yes, mostly rice and little fish.  I do like the crunch roll and the devil roll at first, but then after a couple orders i'd rather jump out a window than finish anymore of either of those rolls.\n\nWe had to wait for eternity to be able to tackle someone for a 2nd refill of water (which also hindered our ability to down as much sushi as we could otherwise), and to get our bill.\n\nThis time we will NOT be back. I mean it this time. And if we do return, I am 100% certain I will again regret it.\n\nAwful service, worrisome food. That said, the one male waiter (maybe a manager) was very nice and definitely overworked. They need a larger staff, at least for the busy weekend shifts....and given the stickers inside the sushi rolls, perhaps a new kitchen/quality control staff as well.", "rating": 2, "date": "2010-05-15"}, {"excerpts": ["Good eats: devil roll, tempura, udon, gyoza\n\n"], "author": "Amy S.", "review": "Its okay. The beef teriyake was fantastic before the remodel. Now its tough and not very tasty. Did the ayce thing --Came out to 33 a person after tax and tip. Found parking a block away--got lucky! \n\nStaff was attentive enough but the sushi was just meh. some rolls were packed with rice. \n\nGood eats: devil roll, tempura, udon, gyoza\n\nBad eats: beef teriyake, veggie croquette (only potatoe now) and kentucky roll \n\nThe remodel makes it dimmer and more loungesque. There were two loud bday parties to the right and left of us but we didnt mind. Then we turned around and saw a family with 2 babies. Ha-its def. a mixed crowd place!", "rating": 3, "date": "2010-01-25"}, {"excerpts": ["Get the Devil Roll.  ", "It is to DIE for!  ", "I can't find it online, but it should be on the dining room menu.  ", "=)"], "author": "Marilou A.", "review": "$24.95 for all-you-can-eat sushi and other Japanese entrees!  It's not like one of the gazillion Chinese Buffets in the Tri-City area either-- everything is made to order!  You take a look at the menu (http://www.sushi-hunter.com/menu1.htm), place your orders, and the food comes out within 10 minutes.  If you're still hungry or want to try out more, just keep placing more orders.  We had 11 people and I have no idea how the servers kept up with all of our orders/demands.  \n\nTips:\n\n1) Make reservations. This place is a magnet for large-parties, so you want to make sure they can accommodate you and your guests. \n\n2) If you're driving, get there very early!  Parking in North Beach is a bi-atch!  If you get there late, just drive 5 or 6 blocks out from the restaurant and walk!\n\n3) Get the Devil Roll.  It is to DIE for!  I can't find it online, but it should be on the dining room menu.  =)", "rating": 4, "date": "2008-07-21"}, {"excerpts": ["Gyoza still great and this new item they have on the buffet menu, the \"devil roll\",  that is ", "a slightly fried spicy tuna roll was very nice."], "author": "Marc S.", "review": "Though I still love the place, I have to downgrade a bit based on my latest visit.  First, they kept bugging me about what I wanted to drink as I was waiting for some friends to arrive.  Second, the tuna sashimi on this Monday was an unnatural red that looked like some plutonium got loose in the restaurant.  It tasted ok, but was a bit disturbing to the party.  As the local, I felt obligated to eat most of the order.  In all, my most recent meal was still very enjoyable, but can't give top rating anymore.  Gyoza still great and this new item they have on the buffet menu, the \"devil roll\",  that is a slightly fried spicy tuna roll was very nice.", "rating": 4, "date": "2009-05-06"}, {"excerpts": ["The fish is fresh and all the rolls were really good especially the Devil Roll.  \n\n"], "author": "Tiffany L.", "review": "I always wanted to come eat here for their ALL YOU CAN EAT!  So.. I did last week.\n\nWent with a big group and we all got all you can eat.  We stayed for about 2 hours and never been that full in my life. The fish is fresh and all the rolls were really good especially the Devil Roll.  \n\nI didn't eat all day just so i can save room for this meal and it was worth it!\n\nONLY thing I didn't like..was the fact that they put hella (yeah i just said hella) rice in the nigiri!! We had to find other ways of disposing the rice so we don't get charged a fee.... shhhhh", "rating": 4, "date": "2009-07-19"}, {"excerpts": ["I got the Devil Roll, spicy tuna and siracha. ", "It was okay. ", "I felt it could have been a lot more flavorful. ", "I also got another roll with just unagi and cucumber. ", "Again, it was okay. ", "3 stars for an average sushi joint."], "author": "Jackie M.", "review": "I've been to Sushi Hunter on many occasions seeing that there are only 2 sushi places in North Beach. Anyways, Sushi Hunter isn't bad, but it isn't great. My sister and I usually just come here when we are too lazy to go all the way to Downtown or Richmond for sushi we really love. The last time I was here I got the Devil Roll, spicy tuna and siracha. It was okay. I felt it could have been a lot more flavorful. I also got another roll with just unagi and cucumber. Again, it was okay. 3 stars for an average sushi joint.", "rating": 3, "date": "2012-04-26"}], "seared maguro nigiri": [], "albacore nigiri": [], "sake nigiri": [{"excerpts": ["My favorite food is sake nigiri (salmon basically) and it isn't like this is the best I have ever had ", "but it is easily in the top half and quite tasty. ", "I ate all of these and then another plate too."], "author": "Jason P.", "review": "There's no way all u can eat sushi can be tasty right? Wrong. It can! Combined with their attentive service who know how to have a good time this place is my now two time bday fun night out. My favorite food is sake nigiri (salmon basically) and it isn't like this is the best I have ever had but it is easily in the top half and quite tasty. I ate all of these and then another plate too.", "rating": 5, "date": "2018-05-05"}, {"excerpts": ["My favorite was the sake nigiri. ", "I could probably eat 50 of those in a sitting."], "author": "Linz C.", "review": "This place is great! There aren't that many AYCE sushi places in the city and sushi hunter has a great selection for the price. The service was great, our waitress always came by to see of we wanted to order more.  Not only do they have rolls and sashimi, but you can also order things like tempura, miso soup, teriyaki, and all sorts of little dishes! My favorite was the sake nigiri. I could probably eat 50 of those in a sitting.", "rating": 4, "date": "2014-03-10"}], "sake hara nigiri": [], "hamachi nigiri": [{"excerpts": ["I ordered the hamachi nigiri and it was so chewy ", "I had to spit it out. "], "author": "Angie H.", "review": "I ordered the hamachi nigiri and it was so chewy I had to spit it out. :(\n\nService was eh too, but it was just one waitress for the whole restaurant so whatever. With that being said we got our food 25 minutes after we ordered. \n\nDo not have high expectations coming here. Won't be coming back.", "rating": 2, "date": "2014-10-12"}, {"excerpts": ["My favorites were the hamachi nigiri (very fresh!), wakame, and agedashi tofu. ", "One of the pros of doing ayce sushi here is that there is no limit to how much you are allowed to order at once, as long as you are able to finish it. ", "One complaint I do have is that the texture of the rice is ehh (a little too much on the mushy side), and I've heard that the fish to rice ratio of the nigiri can be kind of one-sided (meaning way too much rice and not enough fish). "], "author": "Leeann C.", "review": "I came here with a group of 5 for ayce sushi dinner on a Saturday night. Among the 5 of us, we ordered probably 4 or 5 rounds of countless nigiri and rolls, plus several appetizers. My favorites were the hamachi nigiri (very fresh!), wakame, and agedashi tofu. One of the pros of doing ayce sushi here is that there is no limit to how much you are allowed to order at once, as long as you are able to finish it. One complaint I do have is that the texture of the rice is ehh (a little too much on the mushy side), and I've heard that the fish to rice ratio of the nigiri can be kind of one-sided (meaning way too much rice and not enough fish). For the price, I think I'd rather have ayce sushi at Sushi 85 in Mountain View.\n\n-L.", "rating": 3, "date": "2010-08-23"}, {"excerpts": ["Hamachi nigiri great as well as tunas. ", "Wait staff very friendly. ", "Good value, good food, nice location, and best about eating all you can eat at sushi is you're not going home feeling sick or going into a food coma ", "but you still for sure get your dollar's worth. ", "Highly recommended! ", "Also, they do bottomless house hot sake for a good deal if you feel like getting a cheap buzz!"], "author": "Moshe B.", "review": "I'm rating this based off the All-You-Can-Eat option. There are definetly better sushi restaurants in SF but I don't know anywhere else in the city or near SF for made per order all you can eat sushi. I think fish quality is fresh and good. Have been 4-5 separate times and never had issues with quality of ingredients. Like ordering the seaweed salad, miso, gyoza, and then the nigiri and rolls. Hamachi nigiri great as well as tunas. Wait staff very friendly. Good value, good food, nice location, and best about eating all you can eat at sushi is you're not going home feeling sick or going into a food coma but you still for sure get your dollar's worth. Highly recommended! Also, they do bottomless house hot sake for a good deal if you feel like getting a cheap buzz!", "rating": 5, "date": "2014-07-12"}, {"excerpts": ["Want a miso soup, some gyoza, oshitashi, tempura and a hamachi nigiri the first round - great! ", "Second round, maybe some more gyoza", ", some salad, a couple rolls - no problem! ", "Third round (if you can make it that far)... and on and on. "], "author": "Stefani P.", "review": "I took my honey here the other day, because I'm always on the lookout for new Japanese restaurants, and I heard they do all you can eat sushi. I wasn't sure what I was expecting, but it wasn't what I got at Sushi Hunter - and I mean that with the best possible intent.\n\nI've been to a few All-You-Can-Eat sushi places, and they have always been done one of two ways: Either you select from the boats going around the bar, which are usually filled with mainly things you don't want. OR it's buffet style, and you have no idea how long anything has been out, and the rice being a little firm isn't helping your thoughts on it.\n\nSushi Hunter does AYCE in an entirely new and much more awesome way. You get a menu with a selection of items that include nigiri, maki, appetizers, teriyaki - pretty much all the mainstays of any sushi restaurant, and get this... You order as you go. Want a miso soup, some gyoza, oshitashi, tempura and a hamachi nigiri the first round - great! Second round, maybe some more gyoza, some salad, a couple rolls - no problem! Third round (if you can make it that far)... and on and on. They bring it out to you just as though you were ordering from a normal menu and paying for it ala carte, so it's always as fresh as whenever you first order it, so why not order a little at a time?\n\nTheir service is fantastic - our server was very attentive, and smiled the entire time we were there. The food was decent - again with the \"typical mid-range of a casual Japanese place.\" I'd definitely go back if I felt like stuffing myself on sushi at a fixed cost.\n\nFor the record, for two of us on the AYCE menu with a bottle of sake, and a 20% tip, we spent $85. Not bad considering how bloated we were when we left.", "rating": 4, "date": "2009-07-22"}, {"excerpts": ["* \n \nHamachi Nigiri?  ", "*", "**BULLSEYE!", "*", "** \n \nPresent me the fruits of my labors, waitress!  ", "Bring me the spoils of the hunt! \n \n", "Unfortunately this was NOT AT ALL the case.\n \n", "In the back of my mind, I can only hope that shooting range sushi was the owner's original intention when naming his/her restaurant \"Sushi Hunter,\" a dream crushed only by liability reasons and patrons' unwillingness to sign waivers upon entry.  ", "However, I was disappointed by much more than Sushi Hunter's unwillingness to let me fire my rubber pellets at will. \n \n", "First of all, we were here for a birthday party for the one-and-only Ashley M.  ", "While I give props to the staff for putting up with our incessant sake bombing, boisterous curse-laden toasts and repeated spilling of booze all over the table, the kitchen seemed to be completely overwhelmed by our party of ~20 ordering the famous all-you-can-eat menu.  ", "They couldn't bring out the gyoza, maki, nigiri, or even edamame and sake fast enough to fill our tummies.  ", "And we weren't gorging ourselves or having some sort of eating competition; we were just eating at a normal pace.  ", "There was absolutely, positively no way to get our money's worth of the promised \"all-you-can-eat sushi\" and \"all-you-can-drink sake.\"  ", "No way.  ", "For $24.95 for sushi, $13 for mediocre hot sake and $6/beer"], "author": "Erin L.", "review": "Don't be fooled.  I went into this place with high hopes.  Extraordinarily high hopes.  After all, this restaurant is named SUSHI HUNTER.   The name alone makes it sound like it boasts the most thrilling dining experience San Francisco has to offer.  The first thing that went through my mind was \"Am I really going to get to HUNT for my own SUSHI?!\"  Was I expected to roll up to this place, packin' my CO2 pellet gun, continuously guzzle down carafe after caraffe of hot sake, and aim my barrel at little round targets on wooden sushi boats circling the dining room Kaiten-zushi style? \n \nEdamame? ***BAM!*** \n \nSpicy tuna roll?   ***BOOM!*** \n \nHamachi Nigiri?  ***BULLSEYE!*** \n \nPresent me the fruits of my labors, waitress!  Bring me the spoils of the hunt! \n \nUnfortunately this was NOT AT ALL the case.\n \nIn the back of my mind, I can only hope that shooting range sushi was the owner's original intention when naming his/her restaurant \"Sushi Hunter,\" a dream crushed only by liability reasons and patrons' unwillingness to sign waivers upon entry.  However, I was disappointed by much more than Sushi Hunter's unwillingness to let me fire my rubber pellets at will. \n \nFirst of all, we were here for a birthday party for the one-and-only Ashley M.  While I give props to the staff for putting up with our incessant sake bombing, boisterous curse-laden toasts and repeated spilling of booze all over the table, the kitchen seemed to be completely overwhelmed by our party of ~20 ordering the famous all-you-can-eat menu.  They couldn't bring out the gyoza, maki, nigiri, or even edamame and sake fast enough to fill our tummies.  And we weren't gorging ourselves or having some sort of eating competition; we were just eating at a normal pace.  There was absolutely, positively no way to get our money's worth of the promised \"all-you-can-eat sushi\" and \"all-you-can-drink sake.\"  No way.  For $24.95 for sushi, $13 for mediocre hot sake and $6/beer, we would have had to have consumed a shit-ton more than we did to make it worth the lump sum we paid at the end of the night.  \n\nIn my mind, the greatest affront Sushi Hunter committed was that after we paid the bill because part of our party was leaving, the waitresses refused to bring us one final bottle of sake to finish off the meal.  Just because a few people left the table and we paid our bill with obligatory 17% tip, service just stops dead?  Good thing my CO2 chamber was emptied by the time that happened...\n\nAdmittedly, I did have a great time for Ashley's birthday party but it was because of the company, not the service or food.  If I ever go back to Sushi Hunter, I'm going in with a vengeance.  I'm wearing camo, I'm not eating for two days beforehand, and I'm chowing down on maki Sonya \"Black Widow\" Thomas-style! Livin' the dream.  Huntin' the sushi.", "rating": 2, "date": "2007-11-04"}], "hamachi hara nigiri": [], "escolar nigiri": [], "tai nigiri": [], "hokkigai nigiri": [], "hotate nigiri": [{"excerpts": ["The Hotate nigiri was also disappointing..."], "author": "Alyssa G.", "review": "Yikes. No wonder this place has 60% off restaurant.com certificates...I'm surprised they're still open! \n\nI made reservations, and when we arrived, the place was half empty, yet our hostess told us we \"needed\" a reservation. Hmmm, really?\n\nThere were so many (too many) things wrong with Sushi Hunter, I apologized to my friend for bringing him here, although the company actually made up for a pretty horrible dinner.\nFirst off, they charge the same amount (around $4.75) for nigiri, and only give you about 2/3 of fish. I'm the kinda sushi fan that believes fish should \"drape\" over the sides of the rice for a decent nigiri. Apparently SH doesn't share that same belief. Their motto? More rice!\n\nI think over 1/2 of what I ate was rice, which is very disappointing. The Hotate nigiri was also disappointing...I'm guessing they use bay scallops instead of the bigger sea scallops, which is why the scallop pieces were chopped up rather than placed over the rice without seaweed.\n\nOur waitress didn't know simple questions when we asked her (such as what fish they serve that are sustainable, or whether the salmon is fresh or farmed, etc.).\n\nWhat I can say is that the decor is alright, very \"aquatic\" themed. And overall, I have to admit that my favorite nigiri here was the red snapper, pretty damn good. Unfortunately, that's about it.\n\nWhy spend $80 here when you can literally go right across the street and have amazing paella and wine at Iluna Basque?", "rating": 1, "date": "2010-08-29"}], "uni nigiri": [{"excerpts": ["I did have to order a uni nigiri separate and it turned out to be very good.  ", "I didn't think we'd drink that much sake, so we skipped the the all-you-can-drink special.  ", "Five sake bombs was enough for me.  ", "All in all, a very enjoyable AYCE experience.  ", "Four stars would truly be given if they added a little more to their AYCE menu."], "author": "JeFF T.", "review": "It's not the BEST sushi place, but for All-You-Can-Eat, it's up there.  While I scanned the AYCE menu, I was a little disappointed that not everything was AYCE.  Naturally, all the standard nigiri, maki, teriyaki, tempura were on the AYCE menu...but no sashimi, no uni, no amaebi, no toro, no hamachi kama.  I know, they'd go broke if they did that.  However, despite that flaw, EVERYTHING we ordered was great...although the eel came out a little cool.  The tempura was light and crispy.  The chicken karaage was crisp, yet moist.  I did have to order a uni nigiri separate and it turned out to be very good.  I didn't think we'd drink that much sake, so we skipped the the all-you-can-drink special.  Five sake bombs was enough for me.  All in all, a very enjoyable AYCE experience.  Four stars would truly be given if they added a little more to their AYCE menu.", "rating": 3, "date": "2006-08-19"}], "ama ebi nigiri": [], "masago nigiri": [], "shiitake maki": [], "broccoli roll": [], "sweet potato roll": [], "zucchini roll": [], "futomaki": [], "nigiri set chefs combination": [], "chirashi chefs combination": [], "sashimi plate chefs combination": [], "single chefs combination": [], "lover chefs combination": [], "sushi hunter chefs combination": [], "vegetable udon soup": [], "beef udon soup": [], "chicken udon soup": [], "tempura udon soup": [], "seafood udon soup": [], "beef yaki udon": [], "vegetable yaki udon": [], "new york steak teriyaki": [], "salmon teriyaki": [], "unaju": [], "big easy roll": [], "crazy horse roll": [{"excerpts": ["The Alaska Roll didn't hold up as well, but the Specialty Roll (the Crazy Horse Roll) was still piping hot. \n\n"], "author": "Natalie N.", "review": "Sushi Hunter, round 3!! Notes on Take Out: I came in on my way home after work to order about 4 dishes. The restaurant was half full and the service was pretty slow. That being said everyone working were very nice. I think they hired some new people who are still learning the menu, but helpful and friendly.\n\nThe fish was fresh and tasty. I got 2 types of Nigiri and even made the trek home with hot pot stickers, which were still delicious. The Alaska Roll didn't hold up as well, but the Specialty Roll (the Crazy Horse Roll) was still piping hot. \n\nI will get take out here again, just be more prepared to wait. Sushi is hard to come by in North Beach!", "rating": 3, "date": "2010-02-04"}], "alaska king roll": [], "hot tuna roll": [{"excerpts": ["Hot Tuna Roll (tuna & avocado inside, topped with seared tuna) for only $10.50.  ", "Rolls were decent size.  ", "I specially like the seared tuna on top; lightly seared and very tasty!  "], "author": "Celeste M.", "review": "I am still buzzing from the Sapporo that I enjoyed with my meal at Sushi Hunter today!  Yes, 600mL bottle of Sapporo about 45 minutes ago...  Great food, great service, great atmosphere, great company and overall great experience!  We even told the waitress to take her clothes off in Japanese... bad, I know, really bad.  She was very uncomfortable with us the whole time.  Hey, that was the only phrase we knew and thought it would be funny.... Ha!  We're sorry.\n\nLet me rewind and let you know how my friend and I ended up eating here today...  \n     As the Italy vs. Spain game come to a disappointing ending, the guy I am recently dating, Rob, gave me a call to meet up for early dinner, late lunch.  I suggested Mood Sushi (on Beach and Taylor), but apparently, the sushi chef does not come in  until 5p (it was 3:40pm).  We headed back to Columbus, North Beach Sushi, but they did not open until 4:30p (it was 3:55p).  We were hungry, very hungry, have not eaten anything all day and was ready to settle for whatever we can find, sushi or not, but decided that we've come this far and sushi was what we wanted... Thank goodness for Sushi Hunter (third time's a charm)!  \n     Why have I not eaten at SH before since I live in the neighborhood and love sushi? Well, it's simple, one of my roommate said she did not like it so I never even thought about trying it out myself.  Today, I have to say that I disagree with her because I really like this place...\n      Rob and I shared a Specialty Roll,  Hot Tuna Roll (tuna & avocado inside, topped with seared tuna) for only $10.50.  Rolls were decent size.  I specially like the seared tuna on top; lightly seared and very tasty!  We also each had a bento box.  For $13.95, our bento boxes included; rice, miso soup, Nigiri Sushi (3 pcs Chef's Choice sushi nigiri), Sashimi (3 pcs Chef's Choice raw fish) and 6 pcs California roll.  \n\n     Our sushi cravings were surely satisfied without spending too much money.  We would definitely come back and maybe even try the ALL YOU CAN EAT SUSHI next time :-)!", "rating": 3, "date": "2008-06-22"}], "oyishi roll": [{"excerpts": ["Oyishi roll is the jawn and cold sake warms my heart. ", "Go here."], "author": "Tommy H.", "review": "Just moved into the hood and this will def be my new go-to for sushi. Happy hour can't be beat. Go nigiri: butterfish is the favorite, hamachi and salmon are second favorite. Oyishi roll is the jawn and cold sake warms my heart. Go here.", "rating": 4, "date": "2013-06-27"}], "tiger eye roll": [{"excerpts": ["Tiger Eye Roll (salmon, cream cheese, and jalpeno in soy paper)+\n"], "author": "Sarah W.", "review": "BEST sushi I've had in San Francisco HANDS DOWN!!\n\nSeriously.. I didn't expect a whole lot.. and boy was I wrong!!\n\n\nToyko Pizza Roll (Mozzarella cheese YUM) +\nJapanese Bagel Roll (cream cheese YUM) +\nDragon Roll+\nTiger Eye Roll (salmon, cream cheese, and jalpeno in soy paper)+\nUnfilitered Sake =\n\nHEAVEN :)\n\nI didn't try the all you can eat.. but we basically spent just as much on our meal and it was fabulous. By the looks of the menu its all very basic/mediocre rolls, and I always want to try something new. So, my advice.. don't go with the all you can eat.\n\nOur waitress was very nice, but didn't seem to speak English very well so be prepared so ask for WATER several times (4 times in my case) before receiving any.", "rating": 4, "date": "2008-05-27"}], "dark rainbow roll": [{"excerpts": ["I liked the Dark Rainbow roll a lot. ", "As far as quality and taste of sushi, it was decent, but not spectacular. ", "Portions "], "author": "Catherine O.", "review": "My overall experience here wasn't too bad. My friend and I ordered several sushi rolls with the recommendation of the waitress, who was very kind and attentive to us. \n\nI liked the Dark Rainbow roll a lot. As far as quality and taste of sushi, it was decent, but not spectacular. Portions I don't believe live up to their price. \n\nNot a bad place to go, if you are around the North Beach area and want some sushi nearby. Otherwise I think I've had better.", "rating": 3, "date": "2008-01-11"}], "deep sea swimmer roll": [{"excerpts": ["my favorite of the rolls we ordered...super hot like the menu says...yum!\n~ Deep Sea Swimmer Roll: spicy tuna and cucumber inside topped with butterfish and tempura crunches..."], "author": "Katelynn L.", "review": "I bought a restaurant.com gift certificate for Sushi Hunter a while back and finally put it to use today.  Since it is not valid for the all you can eat deal, my boyfriend and I just ordered from the regular menu.\n\nWe shared the following:\n~ Wakame Salad: pretty small portion for $3.95 but I liked that they drained it pretty well...a lot of places don't bother to and the salad ends up being too wet\n~ Volcano Roll: my favorite of the rolls we ordered...super hot like the menu says...yum!\n~ Deep Sea Swimmer Roll: spicy tuna and cucumber inside topped with butterfish and tempura crunches...I couldn't really taste the butterfish but it was a very good roll nonetheless\n~ Titanic Roll: even though it has tempura prawn inside and is topped with salmon, tuna and spicy crab salad, this was a surprisingly light roll...the salmon and tuna were very fresh as well\n\nThe sushi at Sushi Hunter is definitely better than a lot of other places that I've been to and I like that their rolls are different than the standard ones at a lot of places.  Plus, they didn't put a lot of mayo in their rolls, which is awesome.\n\nEven though we ordered less than $40 of food (the gift certificate is good for $25 off for $35 or more), our total came out to be a little under $25 after tax and 18% gratuity (automatically added for using the gift certificate), so I am definitely glad we had that.  If parking wasn't such a pain, I'd love to come back more often.", "rating": 4, "date": "2010-03-27"}], "salmon moonlight roll": [{"excerpts": ["the salmon moonlight roll and the salmon don were eh. ", "the salmon wasnt the texture we perfer. "], "author": "Katie F.", "review": "So this place is tucked at the very end of a really awesome area.\nThe only item we ordered that was great was the gyoza. the salmon moonlight roll and the salmon don were eh. the salmon wasnt the texture we perfer. Id rather go to Mona Lisa or cafe grecco or something like that. \n\nso not worth the 2 hour bart ride and 20 minute walk. I would have much rather have gone to El Rio for a picnic style dinner and a strip tease. at least the girls who frequent there are cute.", "rating": 3, "date": "2009-10-03"}], "spicy tataki roll": [], "titanic roll": [{"excerpts": ["The titanic roll was very good. ", "The service was excellent. "], "author": "Randa G.", "review": "The titanic roll was very good. The service was excellent. A cozy neighborhood restaurant with friendly staff and pretty tasty sushi. \n\nI would recommend it for sure.", "rating": 4, "date": "2015-12-22"}, {"excerpts": ["I couldn't really taste the butterfish but it was a very good roll nonetheless\n~ Titanic Roll: ", "even though it has tempura prawn inside and is topped with salmon, tuna and spicy crab salad, this was a surprisingly light roll..."], "author": "Katelynn L.", "review": "I bought a restaurant.com gift certificate for Sushi Hunter a while back and finally put it to use today.  Since it is not valid for the all you can eat deal, my boyfriend and I just ordered from the regular menu.\n\nWe shared the following:\n~ Wakame Salad: pretty small portion for $3.95 but I liked that they drained it pretty well...a lot of places don't bother to and the salad ends up being too wet\n~ Volcano Roll: my favorite of the rolls we ordered...super hot like the menu says...yum!\n~ Deep Sea Swimmer Roll: spicy tuna and cucumber inside topped with butterfish and tempura crunches...I couldn't really taste the butterfish but it was a very good roll nonetheless\n~ Titanic Roll: even though it has tempura prawn inside and is topped with salmon, tuna and spicy crab salad, this was a surprisingly light roll...the salmon and tuna were very fresh as well\n\nThe sushi at Sushi Hunter is definitely better than a lot of other places that I've been to and I like that their rolls are different than the standard ones at a lot of places.  Plus, they didn't put a lot of mayo in their rolls, which is awesome.\n\nEven though we ordered less than $40 of food (the gift certificate is good for $25 off for $35 or more), our total came out to be a little under $25 after tax and 18% gratuity (automatically added for using the gift certificate), so I am definitely glad we had that.  If parking wasn't such a pain, I'd love to come back more often.", "rating": 4, "date": "2010-03-27"}], "white tuxedo roll": [], "bento box": [{"excerpts": ["They also have a nice variety of sashimi/nigiri/bento box dinner combinations if you're feeling indecisive. \n\n"], "author": "Chelsea B.", "review": "I have the sincerest appreciation for Sushi Hunter. This restaurant fulfills all of my personal sushi-needs, and as a human that can consume sushi like a high powered ocean vacuum, I have sizable needs. \n\nSushi Hunter has excellent food and a full menu, stellar service and exceptional customer appreciation, and a space that lacks an ego and welcomes you with humility and cleanliness. \n\nSome things that will tickle your sushi-bone: \n\nSashimi (Always good, but here's some gooder-ers):\n - Sake\n - Red snapper\n - Hamachi \n - Albacore \n\nNigiri: \n - Saba (tastes like low tide in the best way possible). \n - Sake Hara (tastes like butter). \n\nThey have a nice selection of rolls, the one that stood out to me the most was the Crazy Horse. They also have a nice variety of sashimi/nigiri/bento box dinner combinations if you're feeling indecisive. \n\nMy last dinner at Sushi Hunter was a lovely 2.5 hour endeavor. My friend and I kept the orders coming, but not for one second did the wait staff hint at us leaving. We felt comfortable taking our time, enjoying our meal, and ordering more at our leisure. Hot tea was always refilled, and the wait staff never overlooked our needs despite the busy hour and the sake-bombing riffraff at the table next to us. \n\nOverall, head over here for a lovely, casual, tasty sushi-sperience with great service.", "rating": 5, "date": "2013-05-06"}, {"excerpts": ["Don't get the Bento box, it sucks & the chicken is horrible & rice is disgusting. ", "Only saving grace was the Uni spoon."], "author": "Toby D.", "review": "Don't get the Bento box, it sucks & the chicken is horrible & rice is disgusting. Only saving grace was the Uni spoon.", "rating": 2, "date": "2016-09-25"}, {"excerpts": ["My kid's bento box was also adequate, with the stand-out being the tempura. ", "Very crisp and not at all greasy. "], "author": "Valeria R.", "review": "Sushi hunter is not bad, but it's not write-home-about-it great either.\n\nThe interior is a bit of a surprise. It's a lot sleeker than I imagined it from the outside. And no complaints about the service.\n\nMy nigiri was adequate, but not necessarily memorable. The size and quality were commensurate with the price, which was reasonable.\n\nMy kid's bento box was also adequate, with the stand-out being the tempura. Very crisp and not at all greasy. I stole a few pieces and considered ordering more.\n\nWhen the check arrived, I felt satisfied that I had gotten what I paid for. But I most likely wouldn't return. Again, not because it was bad, just not...great.", "rating": 3, "date": "2011-01-16"}, {"excerpts": ["There are bento box stuff from fried tofu to pork cutlets. ", "If you want rice they also offer a side of rice! ", "You mind as well make your own bento box! ", "There are a couple nigri to pick from and also a variety of rolls from spider roll, hot angel roll, california roll, etc. ", "The rolls are average to me though ", "but you get a lot of the 23 price. "], "author": "Sarah C.", "review": "The exterior does not do justice to the interior. It is very modern and like most Asian restaurants they play hip hop music. The plush white seats goes very well with the sharp blue walls. The sushi counter has this blue glow like those super fobby cars. \n\nWe did the all-you-can-eat for 23 a person. The menu offers a lot! There are appetizers from edamame and gyoza. There are bento box stuff from fried tofu to pork cutlets. If you want rice they also offer a side of rice! You mind as well make your own bento box! There are a couple nigri to pick from and also a variety of rolls from spider roll, hot angel roll, california roll, etc. The rolls are average to me though but you get a lot of the 23 price. My friend is a advent customer of this place and he says that one time they didn't do the all-you-can-eat the price was more than 23 a person. \n\nThey also offer ice cream/mochi for a cheaper price if you are doing the all-you-can-eat. The mochi comes with caramel on top which clashes with the mochi. =/\n\nThe waitresses are super nice and attentive especially the one with the tall hair. \n\nAwesome bathrooms that has a strange layout. There is two chairs in there if you want to take a break from the people you are eating with.", "rating": 4, "date": "2010-09-09"}, {"excerpts": ["This review is based on the bento box on a to-go order.  \n \n", "This is the closet sushi restaurant near the area I am staying, so I decided to try it after getting off work since it is near the bus stop at the Washington Square park. ", "I ordered the bento box to go. ", "I ordered the pork cutlet, vegetable tempura, and tuna rolls. ", "It came with miso soup and salad. ", "My pork cutlet was pretty small. ", "Probably 4 inches long, and 2 inches wide, 0.5 inch high. ", "The salad and soup is mediocre for japanese restaurants. ", "The worst part about the meal was actually the vegetable tempura which was basically tasteless. ", "The sauce did not help whatsoever. "], "author": "Becky Q.", "review": "This review is based on the bento box on a to-go order.  \n \nThis is the closet sushi restaurant near the area I am staying, so I decided to try it after getting off work since it is near the bus stop at the Washington Square park. I ordered the bento box to go. I ordered the pork cutlet, vegetable tempura, and tuna rolls. It came with miso soup and salad. My pork cutlet was pretty small. Probably 4 inches long, and 2 inches wide, 0.5 inch high. The salad and soup is mediocre for japanese restaurants. The worst part about the meal was actually the vegetable tempura which was basically tasteless. The sauce did not help whatsoever. The tuna roll is decent, nothing special.  \n\nI have yet to have a dine-in experience and to try their actual rolls.", "rating": 2, "date": "2011-10-30"}, {"excerpts": ["The typical non-sushi dishes (Bento Box with Chicken Teriyaki & Tempura) was...", "ok. ", "There are better sushi places out there people!!!"], "author": "Karen S.", "review": "Ok. Bleah. This place is close by and since the Yelp reviews were pretty good, I decided to try it out. Bleah. This place is about as tasty as it looks from the outside (fake sushi in the window says enough). \n\nThe sushi was ok if not below-average. The typical non-sushi dishes (Bento Box with Chicken Teriyaki & Tempura) was...ok. There are better sushi places out there people!!!", "rating": 2, "date": "2007-02-10"}, {"excerpts": ["The standard bento box you get at other places for $7 or $8 is about $15 here. ", "The portions on everything seem small and overpriced. "], "author": "Mike S.", "review": "This is a nice looking place and the food is OK, but the prices are way too high. The standard bento box you get at other places for $7 or $8 is about $15 here. The portions on everything seem small and overpriced. Ive ate here twice and there wasn't anyone else there both times.\n\nYokohama down the street on Columbus is way better and more affordable but they have weird hours.", "rating": 2, "date": "2010-09-15"}, {"excerpts": ["side of bland tempura saucing, \"dark water\"....finding bento box common...medley of small portioned teriyaki, tonkatsu, etc. with rice, miso 'n' salad....udon looking tastier than most items ordered...\n\n"], "author": "Hen A.", "review": "seemingly authentic...quaint sushi bar...table seating few...corner tucked...northbeach little italy....menu sportin' typical japanese-american fare....california rolls, nigiri sushi, tempura, teriyaki, udon and such....finding rolls extremely over dense and packed ultra tight with rice...pricing norm at $ten plus/minus per flavored decorated fat rice rolls....neither cheap nor expensive....also, experiencing undercooked, almost raw hard, tempura vegetable....side of bland tempura saucing, \"dark water\"....finding bento box common...medley of small portioned teriyaki, tonkatsu, etc. with rice, miso 'n' salad....udon looking tastier than most items ordered...\n\n$twenty-five all-you-can-eat from seperate limited menu....observing limited to rolls, nigiri sushi, fried, tempura, etc...rice packed filler items...non-buffet type all-you-can-eat...menu order and wait all-you-can-eat....no sashimi for all-you-can-eat....passing on all-you-can-eat...", "rating": 1, "date": "2008-05-27"}, {"excerpts": ["can't say how good the sushi is..\n\n--bottom line..skip the bento box either way..."], "author": "James K.", "review": "I'm reviewing only the Bento Boxes, FYI..can't say how good the sushi is..\n\n--bottom line..skip the bento box either way...boxes come with miso soup, salad, white rice and choice of 3 sides (chicken, steak, tempura, eggroll, gyoza etc)\n\n--the biggest problem I have is the portion size of the chicken teriyaki..I've had a lot of bento boxes and seriously, it's a slap to my face when they give you literally 5 small pieces of chicken!! I'm dead serious..most place give you at least twice that amount if not more! for 14.95 dinner, it's a total rip\n\n--that's my main complaint..the gyoza was okay but I prefer mine to be more crispy...tempura pretty good..rice is rice but not piping hot\n\n--staff was sorta slow but did pick up towards the end\n\n--service was friendly and clean bathrooms helps..it's kind of mean with the 2 stars so i'm going with 2 3/4 stars if that's worth anything to people out there", "rating": 2, "date": "2009-10-11"}, {"excerpts": ["i had the bento box with teriyaki chicken, negi hama (yellow tail), and tekka (teppa?) ", "roll (tuna roll). ", "my boyfriend had a bento box with tempura, salmon shioyaki, and nigiri, chef's choice. ", "all of the different items were okay... ", "chef's choice was yellowtail, tuna, and unagi. ", "the miso soup was wonderful (!), probably my favorite miso soup of any restaurant.. but I take issue with the fact that the waitress asked us if we wanted some edamame to start, and then charged us for it. ", "maybe that's standard, but i feel like they just offer that for free at a lot of japanese restaurants? ", "and then there's that tension moment where you assume it's free, but you don't want to ask because it's tacky to ask \"is it free?\"  ", "so it's not free. ", "anyway, the food was pretty decent.... not too filling. ", "with restaurant.com, it was $34 for two bento boxes, an alaska roll, two tsingtao's, and edamame. ", "i have no issues with this place, but i'd never crave it either."], "author": "Kimberly S.", "review": "(okay, so this restaurant is really a 3.5...)\n\nin the past, i've always had the all-you-can-eat which is pretty solid. i'd probably opt for Sushi Hana's all-you-can-eat over Sushi Hunter's.... it's worth it if you get a lot of nigiri. \n\ntonight i ordered from the regular menu...it was an okay experience. i had the bento box with teriyaki chicken, negi hama (yellow tail), and tekka (teppa?) roll (tuna roll). my boyfriend had a bento box with tempura, salmon shioyaki, and nigiri, chef's choice. all of the different items were okay... chef's choice was yellowtail, tuna, and unagi. the miso soup was wonderful (!), probably my favorite miso soup of any restaurant.. but I take issue with the fact that the waitress asked us if we wanted some edamame to start, and then charged us for it. maybe that's standard, but i feel like they just offer that for free at a lot of japanese restaurants? and then there's that tension moment where you assume it's free, but you don't want to ask because it's tacky to ask \"is it free?\"  so it's not free. anyway, the food was pretty decent.... not too filling. with restaurant.com, it was $34 for two bento boxes, an alaska roll, two tsingtao's, and edamame. i have no issues with this place, but i'd never crave it either.", "rating": 3, "date": "2010-02-23"}, {"excerpts": ["We also each had a bento box.  "], "author": "Celeste M.", "review": "I am still buzzing from the Sapporo that I enjoyed with my meal at Sushi Hunter today!  Yes, 600mL bottle of Sapporo about 45 minutes ago...  Great food, great service, great atmosphere, great company and overall great experience!  We even told the waitress to take her clothes off in Japanese... bad, I know, really bad.  She was very uncomfortable with us the whole time.  Hey, that was the only phrase we knew and thought it would be funny.... Ha!  We're sorry.\n\nLet me rewind and let you know how my friend and I ended up eating here today...  \n     As the Italy vs. Spain game come to a disappointing ending, the guy I am recently dating, Rob, gave me a call to meet up for early dinner, late lunch.  I suggested Mood Sushi (on Beach and Taylor), but apparently, the sushi chef does not come in  until 5p (it was 3:40pm).  We headed back to Columbus, North Beach Sushi, but they did not open until 4:30p (it was 3:55p).  We were hungry, very hungry, have not eaten anything all day and was ready to settle for whatever we can find, sushi or not, but decided that we've come this far and sushi was what we wanted... Thank goodness for Sushi Hunter (third time's a charm)!  \n     Why have I not eaten at SH before since I live in the neighborhood and love sushi? Well, it's simple, one of my roommate said she did not like it so I never even thought about trying it out myself.  Today, I have to say that I disagree with her because I really like this place...\n      Rob and I shared a Specialty Roll,  Hot Tuna Roll (tuna & avocado inside, topped with seared tuna) for only $10.50.  Rolls were decent size.  I specially like the seared tuna on top; lightly seared and very tasty!  We also each had a bento box.  For $13.95, our bento boxes included; rice, miso soup, Nigiri Sushi (3 pcs Chef's Choice sushi nigiri), Sashimi (3 pcs Chef's Choice raw fish) and 6 pcs California roll.  \n\n     Our sushi cravings were surely satisfied without spending too much money.  We would definitely come back and maybe even try the ALL YOU CAN EAT SUSHI next time :-)!", "rating": 3, "date": "2008-06-22"}, {"excerpts": ["My first bento box was salmon rolls, salmon nigiri, miso, and tempura.  ", "My second bento box was salmon rolls, teriyaki chicken rolls, tamago, and udon.  ", "The eating just continued from there.  ", "The sushi was good but for me it was more about the variety of dishes one could order on Sushi Hunter's All-You-Can-Eat Menu."], "author": "Josh K.", "review": "I recently had a chance to check out Sushi Hunter's All-You-Can-Eat Menu and thought this was a great deal for under $25.  The dishes are made to order and the service was very good.  For the best value out of the buffet, one might load up on just the sushi but I enjoyed making as many bento boxes as possible.  My first bento box was salmon rolls, salmon nigiri, miso, and tempura.  My second bento box was salmon rolls, teriyaki chicken rolls, tamago, and udon.  The eating just continued from there.  The sushi was good but for me it was more about the variety of dishes one could order on Sushi Hunter's All-You-Can-Eat Menu.", "rating": 4, "date": "2008-06-28"}, {"excerpts": ["I like the bento box there."], "author": "Sarah F.", "review": "This place is awesome to go to if you're REALLY hungry.  They have an all you can eat menu; so come hungry.  However, know that if someone in your party orders the all you can eat, everyone at your table must do the same.  I find this irritating.  I like the bento box there.", "rating": 2, "date": "2008-01-27"}], "tuna hand roll": [], "white tuna hand roll": [], "salmon hand roll": [], "unagi hand roll": [], "spicy scallop hand roll": [{"excerpts": ["I tried the mackerel, salmon, tuna, albacore, yellowtail, eel, a spicy scallop hand roll, and God know what else . ", "ALL good.  ", "Yeah, I stayed a while.   ", "Total tab ended up being like $34 (with some green tea and a Kirin).  ", "And I ate A LOT.  ", "Practically had to roll myself out of here.  ", "Oh, service kicked ass here.  ", "Friendly staff.  ", "Even got some complimentary stuff from the chef.  "], "author": "Chris B.", "review": "Complete surprise!  DAMN this was good.  After sampling beers over at Rogue Ales I was going to come here, get a quick bite to eat, and head home.  Didn't expect much.  \"Sushi Hunter?\"  Odd name.  Maybe I'll just get a roll or two.  I walk inside, well not bad... sit at the bar.  Look at the menu... \"all you can eat\"  Oh really!  Been searching for an all you can eat place - that doesn't suck.   Nonetheless, let's order a few pieces and see how it is.  \n\nKid you not... Every.  Single.  Piece.  Of.  Fish.  Extremely fresh, tasty, flavorful, MELT in your mouth.  I tried the mackerel, salmon, tuna, albacore, yellowtail, eel, a spicy scallop hand roll, and God know what else . ALL good.  Yeah, I stayed a while.   Total tab ended up being like $34 (with some green tea and a Kirin).  And I ate A LOT.  Practically had to roll myself out of here.  Oh, service kicked ass here.  Friendly staff.  Even got some complimentary stuff from the chef.  YUM.\n\nI want to give this place 5 stars bit I will hold back for now, need to come back 2-3 more times to make sure they are consistent.  Been screwed before.  But this place looks promising and appears to be a welcome change from all the hoity-toity places.", "rating": 4, "date": "2010-01-20"}], "hamachi hand roll": [], "tempura shrimp hand roll": [], "salmon skin hand roll": [], "ginger": [{"excerpts": ["My friend told me about this place, so we took the decision to try it today, unfortunately was an horrible experience, we ordered like 8 different kind of rolls, they put them all in same plate without even asking us, the presentation as you can see in the pic is terrible, the service so slow, and when we asked for ginger they bring us a very small quantity not enough even for one person, I'm giving them 2 stars because the food taste was quite fine, they need to do more effort, for sure ", "I'll not come back again"], "author": "Prince O.", "review": "My friend told me about this place, so we took the decision to try it today, unfortunately was an horrible experience, we ordered like 8 different kind of rolls, they put them all in same plate without even asking us, the presentation as you can see in the pic is terrible, the service so slow, and when we asked for ginger they bring us a very small quantity not enough even for one person, I'm giving them 2 stars because the food taste was quite fine, they need to do more effort, for sure I'll not come back again", "rating": 2, "date": "2017-11-19"}, {"excerpts": ["I had to ask for pickled Ginger.\n", "This was a All you can eat for $30.00. ", "(But there are limits in the fine print)\n", "The total tab came out about $43.00 They added an 18% gratuity? ", "I did get a recipe.\n", "I did leave full, but this is not a Re-Do"], "author": "Ed S.", "review": "3 Stars is pushing the rating. 2 1/2\nThe place was 1/2 empty on a Saturday. The place was very noisy. There crowd (8-10) at one table made up most of the noise. The Music from the sound system mad up the rest of the noise.  The service was OK but NOT great. The Sushi was OK but not great. The Ice Tea was marginal (3.50). I had to ask for pickled Ginger.\nThis was a All you can eat for $30.00. (But there are limits in the fine print)\nThe total tab came out about $43.00 They added an 18% gratuity? I did get a recipe.\nI did leave full, but this is not a Re-Do", "rating": 3, "date": "2016-09-26"}, {"excerpts": ["- Do not get the salad... the ginger dressing was weird and not good. \n\n"], "author": "Jess K.", "review": "There are a lot of wonderful sushi restaurants in SF.. this one was ok. \n\nPositives: \n- No problem making a reservation for 8 people on a Friday night. \n- Our server was very friendly and helpful. \n- Option for all you can eat sushi and drink sake. \n- Pretty good special rolls. \n\nNegatives: \n- Not GREAT fish... I really enjoyed the roll I ordered (deep sea swimmer), the rest were ok... not super distinctive from each other. \n- Not much atmosphere. \n- Do not get the salad... the ginger dressing was weird and not good. \n\nI would go here again, but its not on the top of my list.", "rating": 3, "date": "2014-03-02"}, {"excerpts": ["Acceptable:\nNorway Roll - Strong flavor of mackerel paired against equally sharp punch of ginger w/sweetness from a bit of green onion.\n\n"], "author": "Christina J.", "review": "Cantonese-owned, but they survive as the only sushi bar in North Beach.  Sit at the bar, hiphop bumpin' in the background, and you'll see the sushi chef toss the fish in and out of the glass case like hunks of meat.  They skimp on the fish, with the nigiri sliced thin enough that it's practically draped over irregular of balls of rice.  Even the rolls have too much rice & not enough flavor...\n\n-- Crazy Horse\nSad average-sized roll with mismatched ingredients & barely any fried tempura goodness on the outside.  Totally not worth $11.\n\nAcceptable:\nNorway Roll - Strong flavor of mackerel paired against equally sharp punch of ginger w/sweetness from a bit of green onion.\n\nButterfish - Similar to yellowtail in its rich buttery flavor\n\nI am unimpressed:\nDinner for 2 = $37", "rating": 1, "date": "2009-08-31"}], "wasabi": [{"excerpts": ["It takes them 20 minutes to just bring out wasabi, yet they expect us to finish quickly in the case of a \"full house\". ", "Why offer all you can eat if the restaurant can't handle the demands?"], "author": "Sharon T.", "review": "Compared to all-you-can-eat sushi restaurants in SJ and LA, this one is subpar. A relative put it as \"the sushi you get at a buffet (that provides a vast variety of entrees) but without the buffet\". The quality really isn't as great as it should be for the price they charged us. Plus, our 3-year olds and 5-year olds were charged as individuals for the all-you-can-eat, but all they have is a few bites of the excess rice (the rolls were 90% rice anyways)! Other sushi restaurants we've attended in the bay never charged our infants for all-you-can-eat. The servers would randomly leave our table and not take our full orders, so we would have to flag them down. The waitress was quite impatient with our arrivals and was even trying to remove our reserved seats and tables claiming that they were expecting a \"full house\" despite empty tables throughout our entire dinner. It takes them 20 minutes to just bring out wasabi, yet they expect us to finish quickly in the case of a \"full house\". Why offer all you can eat if the restaurant can't handle the demands?", "rating": 2, "date": "2016-12-31"}, {"excerpts": ["They were very friendly but they took ages to bring the food out, and once they did they had us waiting 15 minutes for utensils so we could eat the salad standing right in front of our faces, they forgot our plates, they did not bring wasabi or soy sauce for a bit either, and never brought out the green tea we ordered. ", "It took another 15 min to run our check. ", "First time in my life I walk out without tipping. ", "And as a former bartender/waiter that says a lot because I am very very flexible with mistakes in this industry."], "author": "Sandra C.", "review": "ok... this place's service was bad. They were very friendly but they took ages to bring the food out, and once they did they had us waiting 15 minutes for utensils so we could eat the salad standing right in front of our faces, they forgot our plates, they did not bring wasabi or soy sauce for a bit either, and never brought out the green tea we ordered. It took another 15 min to run our check. First time in my life I walk out without tipping. And as a former bartender/waiter that says a lot because I am very very flexible with mistakes in this industry.", "rating": 1, "date": "2011-09-05"}, {"excerpts": ["I also liked their stronger than average wasabi!"], "author": "Tommy T.", "review": "Although I went there to check out the $22.95 \"all-you-can-eat deal,\" I ended up just getting a sashimi dinner set for about $18 bucks instead.\r\n\r\n\"All-you-can-eat\" is great for people with a larger appetite so they can chow down a couple of rolls plus terriyaki-type dishes. I decided against it since I'll can only stomach one roll and maybe one more thing. So it's not worth it for me. \r\n\r\nI was hoping that the $22.95 deal would include sashimi, but it that menu is mostly sushi rolls (6 pieces) and cooked food.\r\n\r\nMenu and prices aside, the sashimi is quite fresh at Sushi Hunter. The staff was courteous and attentive. I also liked their stronger than average wasabi!", "rating": 3, "date": "2006-10-18"}, {"excerpts": ["First off, the rice, wasabi, and miso soup were very watered down and bland.  ", "Next, the gyoza was greasy and tiny with a boring dipping sauce.  ", "Lastly, the sushi was some of the poorest quality that I have ever had.  ", "The flavors were boring, the unagi seemed like it was sitting out for a while, and the tuna looked and tasted like it was left out in the warm air for waaaay too long.  ", "With so many decent or good places in town to get sushi, everyone should take a WIDE berth around this one.  ", "The review below by Nick S. is right on the money.  ", "DO NOT EAT HERE for any reason!!"], "author": "Evan H.", "review": "My girlfriend, her friend and I went here for lunch today, and the sushi was awful.  First off, the rice, wasabi, and miso soup were very watered down and bland.  Next, the gyoza was greasy and tiny with a boring dipping sauce.  Lastly, the sushi was some of the poorest quality that I have ever had.  The flavors were boring, the unagi seemed like it was sitting out for a while, and the tuna looked and tasted like it was left out in the warm air for waaaay too long.  With so many decent or good places in town to get sushi, everyone should take a WIDE berth around this one.  The review below by Nick S. is right on the money.  DO NOT EAT HERE for any reason!!", "rating": 1, "date": "2009-04-11"}], "soy paper for sushi rolls": [], "seared maguro sashimi": [], "sake hara sashimi": [], "hamachi sashimi": [{"excerpts": ["I ordered my standard Hamachi sashimi  plate with 2 orders of Salmon nigiri. ", "Sushi Hunter failed on both orders. ", "The Hamachi sashimi was back, not belly. ", "It was tough and watery, indicating it had been improperly stored or re-frozen. ", "I told the waitress this grade of hamachi should be relegated to rolls or maybe poke style dishes only. ", "The salmon nigiri was very skimpy and had no fat lines, so therefor was a very low grade. "], "author": "Mark B.", "review": "I just moved back to North Beach after a 20 year absence and this place is only a block away so I thought I'd give it a try. I sat at the very small bar and was attended to quickly by the waitress only. The two sushi slicers never even looked up at me. I ordered my standard Hamachi sashimi  plate with 2 orders of Salmon nigiri. Sushi Hunter failed on both orders. The Hamachi sashimi was back, not belly. It was tough and watery, indicating it had been improperly stored or re-frozen. I told the waitress this grade of hamachi should be relegated to rolls or maybe poke style dishes only. The salmon nigiri was very skimpy and had no fat lines, so therefor was a very low grade. I told the waitress that a nigiri fish should always reflect in size relative to the person it is being served to, and this portion was more appropriate for a small girl.\n\nThe true rating would be 1/2 star. The waitress offered a blank lifeless smile in response to my complaints. There was never even a glance from the two stooges behind the fish cooler. I will tell all my North Beach buddies to never come here.", "rating": 1, "date": "2013-08-10"}], "hamachi hara sashimi": [], "saba sashimi": [], "tai sashimi": [], "tako": [{"excerpts": ["Almost all the nigiris (salmon, mackerel, yellowtail, tako etc.)\n             "], "author": "Leah E.", "review": "Date:  November 29, 2008 @ 6:08 PM \n\nOccasion: Saturday Date Night with Boyfriend.\n\nRationale:    \nI wanted a semi-guilt free food (which means, sushi, in my book) after boyfriend and I stuffed ourselves during Thanksgiving. Thought this was the chance to try Sushi Hunter which I found through Open Table and Yelp.\n\nVenue:  Small Mom and Pop in the heart of North Beach.\n               Better described as \"All You Can Order and Eat Sushi\" for $25.95\n\nAmbiance/Decor:  Minimal and Casual.\n\nSocial Scene:  \n-  2 young teenagers on a date\n-  An Asian family who got hooked up with good stuff, I mean we watched tray after tray of beautiful sushi arrived at their table(Seems like they knew the owner)\n-  We missed the two large parties (about 20 each) the staff were setting tables for.\n\nService:  5 stars for the service. Very attentive and efficient. Our drinks were always filled. The server came to the table a lot to ask if we wanted to order some more from the buffet menu.\n\nDrinks:  Green tea and Diet Coke\n                                          \nTaste:  Seaweed Salad/Gyoza  \n             Chicken Teriyaki/Shrimp Tempura\n             Udon (Very tasty actually. I'm not a big fan but it was good.)\n             Almost all the nigiris (salmon, mackerel, yellowtail, tako etc.)\n             A bunch of rolls\n\nRECOMMEND:  \n1. This place is great for big parties, or at least 4 people.\n2.  Then, you can order everything on the menu.\n3.  It is more fun to share and watch your friends eat tons of sushi.\n\nSKIP:\n1.  If you don't eat at lot like me.\n2.  If you are expecting superb sushi because you eat their sushi for fun but not for the best quality.\n3.  If you expect great sushi rolls, the rolls were skinny and not like what I get from Nijiya market in J-Town.\n4. If you hate looking or paying $25.00 for parking,\n\nTab:  $70.00 for 2 All You Can Eat buffet and drinks, tax and tip\n\nParking:  $22.50\n\nOverall:  \nWe were a little disappointed at the place. If we were in North Beach and wanted sushi, we will go to this place but we will not purposely go back given the lack of parking in the area and abundance of very good sushi in the City.  \n\nMore About Our Date Night:\nThe night was beautiful, not too cold. We went to the Italian glass store, admired the pastries at one of the bakeshops but still too full, took in the scene and beauty of North Beach at night.", "rating": 3, "date": "2008-11-30"}], "hokkigai": [{"excerpts": ["Ordered and tried all the nigiri, and maguro, ika, sake, and hokkigai "], "author": "Tina H.", "review": "Came here with a group of 11 for all you can eat sushi. Couple of limitations that were annoying but bearable:\n\n1) All or nothing for your table when it comes to AYCE\n2) All you can eat menu is much more limited in sushi choices than the regular menu (doesn't include the more pricey fish and rolls), and somewhat costly for the selection ($28 on a Friday)\n3) All you can drink ($12) only includes hot sake, so though they encourage you to drink sake bombs, the beers add up fast.\n\nOverall, the variety in food was fair though since it wasn't just sushi and we also ordered appetizers to start. I actually preferred the appetizers like assorted tempura, gyoza, mackerel, and beef teriyaki that we ordered to the actual fish as it wasn't terribly fresh. Out of the rolls on the AYCE menu, the roll with hotate was the only notable one. Ordered and tried all the nigiri, and maguro, ika, sake, and hokkigai we're the only ones that I re-ordered as the rest tasted too fishy to be very fresh.\n\nStaff was friendly and attentive enough given how busy they were (there were multiple large groups). Took a few tries to get more water, and they missed a few items we ordered on a few of the rounds, so we had to ask for them again, but since it was AYCE, no harm done.\n\nUltimately you get what you pay for, fair and great for groups, but definitely not fit for a foodie.", "rating": 2, "date": "2013-03-27"}], "hotate sashimi": [], "escolar sashimi": [], "ika sashimi": [], "real crab california roll": [], "green somethings": [], "giants": [], "warriors": [{"excerpts": ["After 17 mins of the Warriors game we snapped to our senses\nand decided to abort this mission. ", "Lame...we really wanted to like this spot but the reviews were absolutely right. ", "They just don't have it together"], "author": "Jovone W.", "review": "Just Don't...\nLe sigh, despite the reviews my BF and I decided to give Sushi Hunter a fair try. We walk in at 7:30pm, we're warmly greeted and sat in the very empty restaurant (5 tables and 2 of them are closing out) Andddddd no one comes back...ever. The server is doing a mix of walking in circles and nothing. After 17 mins of the Warriors game we snapped to our senses\nand decided to abort this mission. Lame...we really wanted to like this spot but the reviews were absolutely right. They just don't have it together", "rating": 1, "date": "2016-05-14"}, {"excerpts": ["Weird side note, one of the waiters recognized me at a Warriors/Mavs playoff games a couple years back.  ", "That won me over."], "author": "Jesse L.", "review": "Definitely my favorite sushi place in the city.  It is not the best sushi, but the all you can eat is fresh and made to order.  I love the seared tuna and the fact that there are tons of non-sushi items like agedashi and wakame.  Service is good. You can basically guarantee that when you order all you can eat they'll forget something, but as long as you ask again you'll get it.  All you can drink sake is awesome/terrible idea.  Not sure I've ever been here without accidentally breaking something. \n\nWeird side note, one of the waiters recognized me at a Warriors/Mavs playoff games a couple years back.  That won me over.", "rating": 4, "date": "2009-01-28"}], "c spicy": [], "ers spicy": [], "tiger king spicy": [], "tropical": [], "uni spoon  pcs": [], "wasabi tako": [], "fish taco  pcs": [], "tokyo mango  pcs": [], "hunters  pcs": [], "seafood sunomono": [], "albacore tataki  pcs": [], "ankimo  pcs": [], "salmon tataki  pcs": [], "sesame seed albacore  pcs": [], "salmon poki": [], "tuna poki": [], "yuzu miso": [], "garlic edamame": [{"excerpts": ["The crunch rolls are delicious and so are the garlic edamame. ", "The gyoza is also really good, especially during happy hour prices. ", "Beautiful part of the city, and easy to walk by without noticing. ", "Definitely worth stopping by."], "author": "Brandon S.", "review": "Christy assisted us with a perfect evening recently. My parents were in town for my mom's birthday, and the staff here made it very fun for us.. they taught her how to properly drink her first sake bomb! The crunch rolls are delicious and so are the garlic edamame. The gyoza is also really good, especially during happy hour prices. Beautiful part of the city, and easy to walk by without noticing. Definitely worth stopping by.", "rating": 5, "date": "2016-11-08"}, {"excerpts": ["The waitress was superb from recommending amazing garlic edamame and butterfish rolls, to clapping us through our sushi bombs, to singing happy birthday bringing the birthday girl free ice cream! ", "Thanks for making this our new favorite neighborhood sushi place!!!"], "author": "Drew L.", "review": "PERFECT NIGHT!\nWe had last minute company and they accommodated 6 people on a Saturday night. The waitress was superb from recommending amazing garlic edamame and butterfish rolls, to clapping us through our sushi bombs, to singing happy birthday bringing the birthday girl free ice cream! Thanks for making this our new favorite neighborhood sushi place!!!", "rating": 5, "date": "2016-11-10"}], "asari miso": [], "asari itamei": [], "grilled lamb chop  pc": [], "yaki enoki mushroom": [], "japanese barbecue pork": [], "roasted pork  agadashi tofu": [], "royal salmon": [], "salmon kama": [{"excerpts": ["Highly recommend Salmon Kama, Grilled Ama Ebi and Butter Fish.", "One of the best sushi restaurant in the Bay Area!"], "author": "Vivian L.", "review": "Highly recommend Salmon Kama, Grilled Ama Ebi and Butter Fish.One of the best sushi restaurant in the Bay Area!", "rating": 5, "date": "2016-03-06"}], "hamachi kama": [{"excerpts": ["Naturally, all the standard nigiri, maki, teriyaki, tempura were on the AYCE menu...but no sashimi, no uni, no amaebi, no toro, no hamachi kama.  ", "I know, they'd go broke if they did that.  ", "However, despite that flaw, EVERYTHING we ordered was great...although the eel came out a little cool.  ", "The tempura was light and crispy.  ", "The chicken karaage was crisp, yet moist.  "], "author": "JeFF T.", "review": "It's not the BEST sushi place, but for All-You-Can-Eat, it's up there.  While I scanned the AYCE menu, I was a little disappointed that not everything was AYCE.  Naturally, all the standard nigiri, maki, teriyaki, tempura were on the AYCE menu...but no sashimi, no uni, no amaebi, no toro, no hamachi kama.  I know, they'd go broke if they did that.  However, despite that flaw, EVERYTHING we ordered was great...although the eel came out a little cool.  The tempura was light and crispy.  The chicken karaage was crisp, yet moist.  I did have to order a uni nigiri separate and it turned out to be very good.  I didn't think we'd drink that much sake, so we skipped the the all-you-can-drink special.  Five sake bombs was enough for me.  All in all, a very enjoyable AYCE experience.  Four stars would truly be given if they added a little more to their AYCE menu.", "rating": 3, "date": "2006-08-19"}], "grilled calamari": [], "house ramen": [], "chicken karaage ramen": [], "tonkatsu ramen": [], "vegatable ramen": []}