{"steamed soybeans": [], "mussel on half shell": [], "sakemaki": [], "hamanegi": [], "garisaba": [], "new zealand roll": [], "king california": [{"excerpts": ["The rolls are also quite decently priced at about $10-11 each; I enjoyed the king California roll (real crab, avocado, cucumber, fish eggs). "], "author": "Vincent L.", "review": "A solid, no-nonsense venue for authentic sushi from real Japanese chefs.\n\nNothing will be cheap here, but nothing will be terribly expensive either. I actually found the sashimi combo plate quite a decent deal despite the high initial price tag as it came with 14 decent cuts of fish. Ordering nigiri sushi runs you $7-8 per order, at two pieces per order. The rolls are also quite decently priced at about $10-11 each; I enjoyed the king California roll (real crab, avocado, cucumber, fish eggs). They also have goopy apps that will delight gringo tastes, in particular the baked mussels, which come drenched with spicy mayo. \n\nService is matter-of-fact and to the point, while the venue feels like a former diner. All in all, it's about the food here, and it doesn't disappoint. A nice find thanks to all you Yelpers out there!", "rating": 4, "date": "2018-08-10"}, {"excerpts": ["Next we got the King California roll (not slathered in mayo and made with real Alaskan crab vs the imitation crab meat like usual spots) $9, Hawaiian 2 Roll, Hamachi and macadamia nuts roll - $9, and lastly the Rainbow roll. ", "It was packed with a fresh assortment of sashimi on top (hamachi, albacore, red tuna, red snapper, and delicious eel) inside was wrapped with shisito leaves, avocado, and some cucumbers for crunch. ", "Totally a great date spot or a spot to hang with friends! ", "Would definitely be back!"], "author": "Jamie C.", "review": "Great authentic Sushi spot. They are real Japanese chefs and servers. The food was delicious, fresh, and meticulously prepared. \n\nThis place is a little small, and there usually is a wait (about 40 mins - 1 hour) but it's well worth the wait. The ambiance is cool. Simple and quant little spot. This place is cash only so come prepared. \n\nWe ordered the baked mussel appetizer, 2 pieces come in one order - $7 well worth it! Definitely a must try. It was one of my favorite dishes of the night. Next we got the King California roll (not slathered in mayo and made with real Alaskan crab vs the imitation crab meat like usual spots) $9, Hawaiian 2 Roll, Hamachi and macadamia nuts roll - $9, and lastly the Rainbow roll. It was packed with a fresh assortment of sashimi on top (hamachi, albacore, red tuna, red snapper, and delicious eel) inside was wrapped with shisito leaves, avocado, and some cucumbers for crunch. Totally a great date spot or a spot to hang with friends! Would definitely be back!", "rating": 5, "date": "2017-06-03"}, {"excerpts": ["Highlights include the baked bass, spicy hamachi roll and the King California roll. ", "We also tried the spicy tuna, Hawaiian #1 and the hamachi nigiri. ", "They were all excellent and I wish we were staying here longer so we could go back! ", "All the fish/produce was super fresh and all the rolls were made right in front of us. ", "Would definitely recommend this to any sushi lover out there!! ", "Is a must visit for sure!"], "author": "Gage B.", "review": "Excellent sushi. \n\nWe got there right at 5 and did not have to wait at all. Very happy with everything we tried. Highlights include the baked bass, spicy hamachi roll and the King California roll. We also tried the spicy tuna, Hawaiian #1 and the hamachi nigiri. They were all excellent and I wish we were staying here longer so we could go back! All the fish/produce was super fresh and all the rolls were made right in front of us. Would definitely recommend this to any sushi lover out there!! Is a must visit for sure!", "rating": 5, "date": "2015-10-29"}, {"excerpts": ["Roll #1, King California and the hamachi roll. ", "I wouldn't reorder the hamachi roll just because it seemed quite bland ", "but again it's rare to find a mid price sushi restaurant with great quality fish in sf. ", "I'd come back again, but likely right at opening."], "author": "Tiffany L.", "review": "Came here on a Friday night during prime time. Prepare for a 45-60 minute wait. I have been meaning to try this place since moving to sf but read about long waits. The quality of fish is great and portions are generous. We ordered the sea bass which was a little disappointing since I think there was more mango than fish but tasty nonetheless. We also ordered salmon sashimi which melted in our mouths and 3 rolls- Hawaiian Roll #1, King California and the hamachi roll. I wouldn't reorder the hamachi roll just because it seemed quite bland but again it's rare to find a mid price sushi restaurant with great quality fish in sf. I'd come back again, but likely right at opening.", "rating": 4, "date": "2013-08-04"}, {"excerpts": ["Garosaba\nKing California \nHamamasa\nMango Hamachi \n", "Rainbow Roll: "], "author": "Adorable T.", "review": "Came here with a party of 3 at 4:45 on a Thursday night and there was already a line.\nI'm extremely glad that I came early, because there's only one chef, and we didn't get our food until about 6:45. Started off the night with a hot sake--very good.\n\nThe lady is extremely nice and helpful with ordering.\n\nGarosaba\nKing California \nHamamasa\nMango Hamachi \nRainbow Roll: YES\nStuffed Shitake Mushroom\nBaked Sea Bass: Amazing!!\nMackeral\n\nThere was nothing bad. This was probably the best rainbow roll I've ever had. The sushi was not traditional in taste, but the balance of rice and fish/vegetables was exactly how I've always imagined them to do it in Japan. Not filled on rice!!!\n\nDamage? $100 (t&t included)--not bad! Super full, had a great time, satisfied.", "rating": 5, "date": "2013-01-23"}, {"excerpts": ["We ordered the baked bass, stuffed mushrooms, two orders of the 14-pc sashimi platter [thick generous slices of deliciousness], a spider roll, a King California roll [none of that imitation crap!], a sushi platter, and two large hot sakes. \n\n"], "author": "Tinna H.", "review": "It seemed like we would never please the mother with our celebratory dining choices. Year after year of birthday or Mother's Day dinners, it's usually a complaint or if it's pretty good - \"Meh, it was only okay.\" \n\nThis year, we took her to Sushi Zone. We ordered the baked bass, stuffed mushrooms, two orders of the 14-pc sashimi platter [thick generous slices of deliciousness], a spider roll, a King California roll [none of that imitation crap!], a sushi platter, and two large hot sakes. \n\nShe thanked us for dinner, and that was that. I guess we finally picked a winner! \n\n*noted*\n\nCash only! Since they use REAL crab meat, you can order a California roll here without me pointing and laughing at you!", "rating": 5, "date": "2010-07-19"}, {"excerpts": ["Between 5 people, we ordered the baked bass, stuffed mushrooms, 2  orders of the 14 piece sashimi, a spider roll, a king california roll, a sashimi combination, and 2 large hot sakes. ", "If you're not a raw seafood fan, you can find rolls or appetizers. ", "There are no udon/soba/ramen or non-seafood items otherwise. "], "author": "Donna H.", "review": "It's no secret. The way to this girl's heart is raw seafood. It's also the way to my mom's heart too, so we came here to celebrate her bday.\n\nTo beat the rush, we arrived at 5:30PM for an earlier dinner, and it worked! We immediately scored one of the booth tables (seats max 5 or 6 if you all squeeze in real tight). The sushi bar seating is better for individuals or groups of 2-3. If you find yourself waiting, you can always order drinks to kill time.\n\nBetween 5 people, we ordered the baked bass, stuffed mushrooms, 2  orders of the 14 piece sashimi, a spider roll, a king california roll, a sashimi combination, and 2 large hot sakes. If you're not a raw seafood fan, you can find rolls or appetizers. There are no udon/soba/ramen or non-seafood items otherwise. It came to about $32 per person. \n\nThe 14 piece sashimi was heavenly. *Le sigh* They were huge, fresh morsels of deliciousness. Usually, I'm not a fan of regular Tuna sashimi, but it was really good compared to other places I've tried before. They definitely don't skimp on the portions, so you feel okay about dropping almost $30 for the sashimi. \n\nThe only drag was the wait between our appetizers and getting all the sashimi and rolls. There's one guy behind the counter, so a wait is expected. They also ran out of the specials really fast. I really wanted to try the Hamachi Kama (cheek) or the Salmon Kama. It was a little disappointing. Next time, hopefully, they will have Uni too. They were out and were waiting for a delivery that evening. I guess we got there a little too early. If we had gotten there later, it would've been super fresh too *SUPER SAD LOWER LIP POUT*. Oh, and that Scallop nigiri looks AMAZING. Putting that on my list as well. 4.5 stars till I get to try the Uni though! Until next time!!!!!", "rating": 5, "date": "2010-07-10"}, {"excerpts": ["We ordered the baked sea bass mango, hawaiian #2, spicy hamachi roll, spicy salmon mango roll, king california roll, uni, ama-ebi, and albacore nigiri.  ", "The nigiri was delicious.  ", "The portions were generous, the fish was buttery and melted upon contact.  ", "The King California Roll was good, but the real crab was real dry.  ", "It was either from a can or purchased in bulk and processed.  ", "I've become such a snoooooob since I've learned how to efficiently rip the flesh from shellfish.  ", "It's a skill that has been good on my wallet because I will no longer accept machine imitations.  ", "Snob, I know.  "], "author": "Christina C.", "review": "With a movie/tv show shooting around the corner, staffed with men wearing fishing vests and cargo shorts, featuring police officer-looking cast, it was your typical Monday evening in the almost-castro, in the heart of genuine San Francisco.  How many cliches can you fit into 15 mins?  If I saw a drag queen running down the street, it would have rounded out the count.\n\nWe were not the first in line.  But we did get the last booth.  Nee-ner-nee-ner-nee-ner.  Nothing makes me feel more entitled than observing the groups of people who showed up after us with children in tow.  Young children.  People who were told that the wait was more than an hour.  Young children who are then forced to wait an hour for dinner becuase they have either sophisticated palates or dip-sheep as parents.  It calls for another bottle of hot sake.\n\nWe ordered the baked sea bass mango, hawaiian #2, spicy hamachi roll, spicy salmon mango roll, king california roll, uni, ama-ebi, and albacore nigiri.  The nigiri was delicious.  The portions were generous, the fish was buttery and melted upon contact.  The uni was caressed in a leaf of shiso and as golden as a solid gold ingot from the Aztec temples.  \n\nThe rolls ranged from good to weird.  Weird in a jive ass way.  The King California Roll was good, but the real crab was real dry.  It was either from a can or purchased in bulk and processed.  I've become such a snoooooob since I've learned how to efficiently rip the flesh from shellfish.  It's a skill that has been good on my wallet because I will no longer accept machine imitations.  Snob, I know.  Deal with it.\n\nSpicy Hamachi had a lot of flavor.  The spicy mayo was creamy without being slimy and overpowering the already flavorful hamachi.  \n\nSpicy Mango Salmon: I think my testate shriveled up and curled back inside my body when i ordered this.  No good will come of a name that includes both \"Mango\" and \"Spicy.\"  The sushi purist inside of me committed seppuku and hung himself out to dry.  Whereas the dumb blond in me said, \"oooooh, mango!\"\n\nBaked Sea Bass Mango - this was the worst thing I've ever had to sit in front of.  It beats out \"foam\" as the stupidest idea for food, style and taste.  You get two mussel shells (but no mussel) which have a layer of diced mango on the bottom, a small sliver of white fish (maybe it's sea bass, maybe it's halibut, maybe it's chicken!) and then frosted over with mayo.  Baked.  Sprinkled with Masago egss.  Not even tobiko.  It was masago.  I think.  For $6.  \n\nThe food would have earned a 4 star rating.  But the service was ridiculously slow.  It took an hour and a half to get our food.  I was late for class.  The sake was watered down and rather expensive for hot sake.  The miso soup had a strange smokey tangy flavor.  A scent you might call it.  I'm no Top Chef, but Padma might say \"This doesn't smell right.\"", "rating": 3, "date": "2010-08-31"}, {"excerpts": ["Also had the king California (with real crab meat) & spicy tuna. ", "All taste fantastic."], "author": "Marissa M.", "review": "This place is amazing. Freshness and quality. Be prepared to wait. But make sure you wait...it's worth it! I recommend the Spicy Mango Salmon and the Hawaiian #2 rolls. The Hawaiian roll has mango in it and is topped with macadamia nuts...tastes amazing. Also had the king California (with real crab meat) & spicy tuna. All taste fantastic.", "rating": 4, "date": "2011-09-14"}], "tunamasa roll": [], "hamamasa roll": [], "rock n roll": [{"excerpts": ["We ordered the following: \n\n- seaweed salad\n- baked mussels \n- miso soup \n- spicy salmon with mango\n- rock n roll\n- hamachi roll\n- Hawaiian special #2 \n\n"], "author": "Heather Y.", "review": "This is probably one of my favorite sushi restaurants in the city. All the ingredients are incredibly fresh and combined in the most unique and intricate manner. I came with my sister around 6 pm on a random Monday evening (which is actually the ideal timing / day to come bc the place is tiny and they don't take reservations so it's essentially first come first serve). We ordered the following: \n\n- seaweed salad\n- baked mussels \n- miso soup \n- spicy salmon with mango\n- rock n roll\n- hamachi roll\n- Hawaiian special #2 \n\nThe baked mussels were phenomenal - chopped up mussels with flavorful sauce (literally tasted like creamy buttery deliciousness that just melted in your mouth). Nothing like I've tasted before. Each serving comes with 2 and I definitely wanted more after I downed my one mussel. Maybe order 2 servings so you can have 2 each with your friend / date. \n\nI thought the Hawaiian roll was unique but wasn't as amazing as the spicy salmon w mango and hamachi roll. All in all, the ingredients tasted super fresh and this place is definitely my favorites. The venue is a bit on the smaller side, so try to avoid coming on a popular evening at a popular time (i.e. Friday or sat night at 7.. As ull be waiting for awhile).", "rating": 4, "date": "2014-05-04"}, {"excerpts": ["We also ordered the baked mussels, spicy hamachi roll, Rock n Roll  roll (just ok), and the mango/avocado roll. \n\n"], "author": "Siv L.", "review": "Wait can be long (2 hours on a Friday night) and people can be crabby because of it (but there are nearby bars to pass the time) but worth it for the baked mango seabass! It was heaven in my mouth!\n\nWe also ordered the baked mussels, spicy hamachi roll, Rock n Roll  roll (just ok), and the mango/avocado roll. \n\nWould definitely come back for the baked mango sea bass!", "rating": 5, "date": "2013-11-10"}, {"excerpts": ["all their other rolls where typical of anywhere else (alaskan, yellowtail, rock n roll, etc etc), and none of it tasted any different (except the spider roll).  ", "definitely not worth the wait."], "author": "H. L.", "review": "low stars for:\n1. ridiculous wait (1hr 15 minutes) & an additional 20 minutes after we were seated to have our orders taken.  yes, i think i'll need that extra 20 minutes to decide what i want to eat because 1+ hrs just isn't enough.\n2. lack of service (basically took our order and handed us the bill.  didn't even serve us the food, and we had no water or tea or drink refilled).\n3. poor quality sushi\n\nthe soft shelled crab had this really strange taste to it that made it terrible.  i don't think it was the quality of the crab but how it was prepared.  anyways, i did not enjoy it.\n\nhad their hawaiian #2 roll (white tuna, mango, & macadamia nuts).  my albacore was the same grade as \"spicy tuna.\"  you know they use the worst cuts of the tuna for that because it's all mashed up and super spicy so you can't taste it.  well, this all mashed up albacore was lacking in quantity too.  all i could taste was mango.\n\nall their other rolls where typical of anywhere else (alaskan, yellowtail, rock n roll, etc etc), and none of it tasted any different (except the spider roll).  definitely not worth the wait.", "rating": 2, "date": "2009-05-03"}], "papaya unagi": [{"excerpts": ["Hawaiian Roll #2\nPapaya Unagi\nSpicy Hamachi\n", "Baked mussels\nBaked Bass\n", "And an assortment of the sizable nigiri.\n", "Hamachi Kama is one of the best around.\n", "Start with a large hot sake...\n"], "author": "Mike V.", "review": "Still here twice a month. At least yelp reminds me how many years it's been. \n\nHawaiian Roll #2\nPapaya Unagi\nSpicy Hamachi\nBaked mussels\nBaked Bass\nAnd an assortment of the sizable nigiri.\nHamachi Kama is one of the best around.\nStart with a large hot sake...\n...finish with the Oshinko w/ Shiso.\n\nCheck out Pisco around the corner if there's a wait.\n\nDon't give up and go to Roku next door. Not even close on its best day.\n\nLook for parking on the north side of market, due to street directions and no turn lanes, it's the last to fill up.", "rating": 5, "date": "2016-02-03"}, {"excerpts": ["Fresh and so tasty especially the Papaya unagi roll and mango anything roll. ", "It's worth the wait! ", "(And there is usually a good 30+ minute wait, but if you are inside you can order beer, sake and edamame while you drool in anticipation!)"], "author": "Joanna G.", "review": "Simply excellent. The baked mango striped bass in mussel shells is to die for. Fresh and so tasty especially the Papaya unagi roll and mango anything roll. It's worth the wait! (And there is usually a good 30+ minute wait, but if you are inside you can order beer, sake and edamame while you drool in anticipation!)", "rating": 5, "date": "2018-01-19"}, {"excerpts": ["Papaya Unagi Roll - Kinda weird!  ", "I don't think I enjoyed the mix of a large chunk of papaya with unagi.  ", "It's definitely not a roll for purists.  ", "Papaya just isn't a strong enough fruit to counter the distinct flavor of unagi.\n", "*", "**", "Omakase sashimi platter (14 pc, around $40) - nothing special on this plate, but the quality of the fish was good and fresh.  ", "Being a small restaurant, I wasn't expecting anything beyond the usual maguro, hamachi, sake, tako, etc.  ", "But it would have been a nice surprise to see some katsuo or uni or something.  ", "Not sure this plate is worth it... ", "I can get a similar plate at Sushitomi in Mountain View for cheaper and with more variety.  "], "author": "Ruth C.", "review": "I'm fortunate enough to have lovely gentlemen friends who live within a block of this restaurant and therefore can place their names on the waiting list and wait at home which makes the wait much less of a big deal.\n\nAs previous reviewers have noted, this place is tiny and seats 2 booths (5 people each) and a bar that has about 10 seats.  For a decent sushi place in a trendy neighborhood, the wait of course will be long for most.\n\nDefinitely a family-run affair with just one chef and one waitress.  There is passion and care in what they do and it does reflect in the adventurousness in some of the very traditional food options.\n\n****Miso soup - a slightly above average miso soup - the miso they use is good.\n*****Baked Seabass with Mango - I was incredibly skeptical about this mix of baked fish, mango and Japanese mayo topped with roe, but it turned out to be my favorite of the night.  Very very good and a must order.\n***Hawaiian Roll - Good, but the textures threw me a bit... really soft melty fish with crunchy macadamia nuts... not sure if I'm a fan.  The roll was falling apart a bit which was a sign that this was hastily put together.\n**Spider Roll - I love soft shell crab, and I've had this roll at many places before... and this one didn't really cut it for me.  The rolls was sliced too thin and the whole thing was falling apart.  The taste wasn't memorable.\n*Papaya Unagi Roll - Kinda weird!  I don't think I enjoyed the mix of a large chunk of papaya with unagi.  It's definitely not a roll for purists.  Papaya just isn't a strong enough fruit to counter the distinct flavor of unagi.\n***Omakase sashimi platter (14 pc, around $40) - nothing special on this plate, but the quality of the fish was good and fresh.  Being a small restaurant, I wasn't expecting anything beyond the usual maguro, hamachi, sake, tako, etc.  But it would have been a nice surprise to see some katsuo or uni or something.  Not sure this plate is worth it... I can get a similar plate at Sushitomi in Mountain View for cheaper and with more variety.  The cuts were pretty thick, but the 2 pc each could easily have been 3.\n\nYou can have order beer and sake here which always makes sushi taste better.  I'm a fan, and I would come back.  Support small businesses!", "rating": 4, "date": "2013-01-27"}, {"excerpts": ["We ordered the, Baked Mussells, Baked Bass, Spicy Hamachi Roll, Hawaiian Roll #2, Papaya Unagi, Scallop Roll and Sake (Salmon) Nigiri. \n\n", "The rest of our rolls soon came in a big platter, Spicy Hamachi Roll (http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=loGRPESSoT-C9r_YdCKgHA), Hawaiian Roll #2 (http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=W-jEgXnPgCUYZ7adawCleQ), and Papaya Unagi (http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=4ojs7fM0he8UaU0Mwboucg). ", "Everything was super delicious and fresh. ", "The Hawaiian Roll #2 was what I was looking forward to due to all the suggestions on Yelp and it did live up to the hype. "], "author": "Myron J.", "review": "Sushi Zone has been bookmarked for places to try for over a year. As the near year began, I wanted to tackle as many places to try on my growing list of bookmarks. When the opportunity came up to get sushi, I went to my bookmarks and went with Sushi Zone. Reading the reviews of the long wait was somewhat of a deterrent but if I wanted to knock Sushi Zone off my list, I just had to SUCK IT UP!\n\nLuckily, I didn't have to wait too long since Matt L. was waiting on a table while I got off work, drove to Sushi Zone and found parking.  It is street parking in the area so it's the luck of the draw you find good parking. Sushi Zone is SMALL...REALLY SMALL! It seats 8 people at the bar and 2 booths with 4 seats in each...for a grand whopping total of 16 seats for the patrons to fight over. I got there a little late so Matt L. had to give our seat away to the next people on the list since the whole party has to be present for them to seat you. We ended up waiting another 30 minutes before we got seated. \n\nWe got seated in the booth that fits 4 so we got a couple of nasty glares when we sat down. I thought we had to communal with another party but we had the whole booth to ourselves. The waitress came over and got us started with drinks, we had a large Sapporo. That came quickly and we were ready to order when she came back. We ordered the, Baked Mussells, Baked Bass, Spicy Hamachi Roll, Hawaiian Roll #2, Papaya Unagi, Scallop Roll and Sake (Salmon) Nigiri. \n\nThe appetizers, Baked Mussells and Baked Bass came first. The Baked Bass was good but not really really good. The bass was a little over cooked so it had the tough feeling. I enjoyed the mango in the bass though. The Baked Mussells was AMAZING! Perfectly cooked! It was buttery good, wished I got 2 more. These are both baked and served in a mussell shell. (See http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=YxYdjiGc86rz-YD0R9pF5w and here http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=CWM2-LObYAxV1k3OrUsp_Q).\n\nIt took a while for the rest of our rolls to come but we expected it since this place was PACKED and there is only one sushi chef behind the counter working his butt off. The rest of our rolls soon came in a big platter, Spicy Hamachi Roll (http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=loGRPESSoT-C9r_YdCKgHA), Hawaiian Roll #2 (http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=W-jEgXnPgCUYZ7adawCleQ), and Papaya Unagi (http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=4ojs7fM0he8UaU0Mwboucg). Everything was super delicious and fresh. The Hawaiian Roll #2 was what I was looking forward to due to all the suggestions on Yelp and it did live up to the hype. The macadamia nuts on top added a great contrasting texture to the soft melt in your mouth goodness of the roll.\n\nWe took a quick break from the food and got another beer, this time an Asahi. We flagged down our waitress (there's only one working the entire restaurant) and ordered 2 more dishes. We waited 25 minutes for the rest of our food to come. The Sake Nigiri (http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=id_zuZQ4rt460t5NMJc9qA) was melt in your mouth good. The Scallop Roll (http://www.yelp.com/biz_photos/M175LTlKPJjAWREIUPyMGg?select=74u6cOM8660XjhmmCR7u5g) was my least favorite dish of the night, the scallop was super slimy and the texture was just weird to me. \n\nAll in all, the meal took around 2.5 hours with waiting and eating. Overall, I enjoyed the food and the service at Sushi Zone. The food was fresh and a little different from other Japanese restaurants (fruit in the dishes) and the service was attentive. Props to our waitress for working so hard. It's CASH ONLY. I will definitely be back the next time I don't mind waiting for some BOMB Japanese food.", "rating": 4, "date": "2011-01-14"}, {"excerpts": ["Other dishes we ordered: Alaskan Roll, Salmon Skin Hand Roll (only because I get this at every sushi place I walk into) and the Papaya Unagi "], "author": "Patricia T.", "review": "17 seats, 2 conventional ovens, 2 refrigerators, one electric gas stove and a sushi bar. This place is smaller than my garage when I lived back in Houston, Texas. But, admittedly, for their prices, I definitely cannot complain. Their selection is mediocre, but their quality and the passion that comes out of artful cooking certainly places this little sushi joint at 5 stars.  \n\nWe got the Salmon Kama -- it was really good, but I think we'll try the more traditional Hamachi Kama next time.  We also tried their popular Baked Bass with Mango -- highly recommend! I'm not a big fan of fruits in savory dishes, but I'll definitely break out of my norm for this one. Other dishes we ordered: Alaskan Roll, Salmon Skin Hand Roll (only because I get this at every sushi place I walk into) and the Papaya Unagi (I probably would never get this again). \n\nAll in all, I would definitely frequent this place more often.  Can't wait until we meet again, Sushi Zone!", "rating": 4, "date": "2013-05-07"}, {"excerpts": ["Papaya Unagi - This was just mouthwatering. ", "I never thought papaya and unagi together ", "but I'm sure glad Sushi Zone did. "], "author": "Julia T.", "review": "I found it! Finally, a neighborhood sushi joint that I LOVE (not just like). The wait is long and even after you sit down it will take some time but I'll basically do anything for delicious food. Sushi Zone really deserves a better name. It sounds so genetic which is why I stayed away for so long. What a mistake. The delicious rolls, sashimi, and nigiris have me kicking myself! \n\nI first tried Sushi Zone two weeks ago before I went on vacation in Florida. My bf and I always have to get our sushi fixes before trips because it's so hard to find a good sushi place when you're traveling. We almost ordered every roll but here were some of my favorites:\n\nThe Hawaiian #2 - is similar to the Hawaiian. It just depends on if you like albacore or tuna better. Huge macadamia nuts and mango pieces make this taste like you really are in Hawaii. So good.\n\nPapaya Unagi - This was just mouthwatering. I never thought papaya and unagi together but I'm sure glad Sushi Zone did. I know I'm ordering this one every time I come here!\n\nSpider Roll - The tempura was perfect. Sometimes it's battered too thickly or it's BREADED and fried (yuck!) but this one was light and crisp. The crab was so fresh, you could taste the guts and juices. I LOVE IT. \n\nRainbow Roll - Each piece was wrapped with a beautiful piece of sashimi. That's awesome. Best rainbow roll ever!\n\nSpicy Scallop - The sushi chef cut nigiri quality scallops to mix into the spicy mayo for this roll. It was sweet, fresh and had just a hint of spice. \n\nThe Sashimi combo plate was a great value too at just $20.50. I also tried the famous baked sea bass with mango. It was good but I'd rather have ordered more rolls! I was actually sad to leave SF the next day since the night before I found such a great sushi joint. The whole time I was away, I dreamt of Sushi Zone. I rushed right back after I got off the plane!", "rating": 5, "date": "2009-11-19"}, {"excerpts": ["papaya unagi, spicy hamachi..."], "author": "S P.", "review": "This is my go-to place for sushi in SF!! The rolls are so unique and delicious! I always get....\n\nAppetizer: Baked stripped bass (with mango and spicy mayo sauce served in a oyster shell)\n\nRolls: Hawaiian #2, papaya unagi, spicy hamachi...these are my top three!\n\nI LOVE Sushi Zone!!! The wait is very long, so be prepared for that (sometimes 2-3 hrs)...well worth it. Rolls are usually around $6...SO cheap!!", "rating": 5, "date": "2011-05-04"}, {"excerpts": ["Papaya Unagi: 4/5. ", "Also very unique and definitely worth a try too. ", "It's amazing how complimentary papaya can be to bbq eel, flavor and texture-wise. ", "It took me a while to wrap my head around this one in a good way!\n", "Spider Roll: 3/5. ", "This was a bit dry (rice & soft shell crab), and I was left with the unfortunate task of eating one of the end-roll pieces where the crab head and legs were sticking out. ", "I have arachnophobia so this was a big feat "], "author": "F C.", "review": "Tips: NOT good for groups over 3 people. There are only two booths that hold 6 people max if you squish, so waiting for those are a huge pain (what our group had to go through...). Huge pain = 2 hours w/o breaking a sweat.\n\nFirst Impressions: 3/5. I really did not like the name... but had high hopes because quite a few friends had been here and claimed they loved it (even the hipstery ones). The location was also pretty awkwardly hidden, but that's something that I knew i had to deal with regarding all places in SF. I did like how intimate the setting was though. It even felt casual & secluded when inside despite being so popular w/ its the roughly 800 reviews already written on Yelp.\n\nDecor/Ambiance: 4/5. My first impression was a 3/5 because everything did look very average, but I could honestly see myself going to this place quite often at every chance I got, so based on my preferences of the ideal sushi bar, I added another star. It's cramped, but things seem all the more fun that way in the city I've found. The interior isn't sparkling new or anything, but I really appreciated the down-to-earth, humble feel. It's probably not what I'd recommend for a first-date kinda place (especially w/ the long wait on most times), but it's almost a great hole-in-the-wall discovery if SF weren't so hipstery to know about it already, haha.\n\nService: 4/5. Just from my first visit, I could tell everyone working there was old-staff. The way they communicated, greeted old customers... everything was very fluid and everyone was well-trained, so there weren't any mess-ups at all. There was only one waitress too, and she was able to spot that I was a newcomer and immediately guide me to their little whiteboard of sign-ins. Throughout our wait, she would also check on us from time to time and apologized for the wait even though they really didn't have to. I always appreciate service a lot more when the staff is still able to respect customers despite the unwavering stream of success. It's good karma if anything else! During dinner, the waitress was also experienced enough to tell us that we probably had not ordered enough food for the group, and she was right on the money. Had she just written our orders down and let the events fall as they would, we would've either left hungry or be forced to wait a while for just one more serving. I appreciated that she didn't force it on us, but casually brought up the idea to let us decide for ourselves. The staff at Sushi Zone definitely made me want to come visit again, support their business, and become a regular.\n\nFood: 4/5.\nBaked Bass Appetizer (Mango, Spicy Mayo, & Fish Eggs, $6.50): 4.5/5. This was definitely unlike anything I'd ever had at a sushi restaurant, and I've been to so many. The texture was so smooth and it was served in such a unique way... no wonder it cost so much!\nRolls. The only slight disappointment was that the rice didn't taste as fresh as it could've been, but for a busy restaurant, I understand this is all about timing sometimes. The presentation for most rolls was also a bit muted, but I know they're not looking to seriously WOW people with art and whatnot... that's not what they're going for and definitely not their first priority.\nSpicy Tuna: 3/5. This was probably the 2nd most average thing ordered but a necessity for a few friends to order anyway.\nSpicy Himachi: 3/5. Nothing too special... the 3rd most average?\nSpicy Mango Salmon: 2/5. This was the most average thing we ordered, but we just chose it under pressure when the waitress hinted we didn't order enough. I wouldn't recommend this.\nHawaiian Roll #1 (Tuna, Avacado, Scallion, Mayo Sauce w/ Macadamia Nuts): 4.5/5. I loved this one! What a breath of fresh air it was to even be able to choose something seriously different and unexpected. Ok, maybe it's because I haven't been to Hawaii, but this was delicious. I'm definitely going to try the HR#2 next time I visit.\nPapaya Unagi: 4/5. Also very unique and definitely worth a try too. It's amazing how complimentary papaya can be to bbq eel, flavor and texture-wise. It took me a while to wrap my head around this one in a good way!\nSpider Roll: 3/5. This was a bit dry (rice & soft shell crab), and I was left with the unfortunate task of eating one of the end-roll pieces where the crab head and legs were sticking out. I have arachnophobia so this was a big feat (it seriously looked like a spider was crawling out of both ends...), but I took one for the team because I think everyone else in my party had arachnophobia, haha.\n\nOverall: 4/5. While many of the rolls are just rated 3/5, I'd still give them another chance, and this says a lot because we waited for about 2 hours! Realistically, this place isn't worth the 2 hour wait, but on SF terms, I'd wait an hour for it assuming waiting 30min is normal for most restaurants during dining hours.", "rating": 4, "date": "2012-07-14"}, {"excerpts": ["The Papaya Unagi roll was also very good.\n\n"], "author": "Eric B.", "review": "Waited about an hour, but it was totally worth it. The stuffed mushrooms were really good, but they only give you 2 per order. The Hawaiian Roll #2 is my new favorite roll. It has tuna, mango, & crushed macadamia nuts. The Papaya Unagi roll was also very good.\n\nSo far, it's the best sushi I've had in the San Francisco area. I'd definitely eat there again. Just be prepared to wait.", "rating": 5, "date": "2009-12-11"}, {"excerpts": ["Papaya unagi. ", "Mackerel and ginger. "], "author": "Omid T.", "review": "Sushi seems to lie on two different poles in San Francisco.\n\n\n You've got the expensive, serious sushi, where fresh fish is flown in from international fish markets on a regular basis, the presentation is an art form, and you have to take out a mortgage if you want to indulge in a complete dinner.\n\n\n Then you've got the cheap places where you stick to the rolls, order up a few sake bombs, and pray that you consumed enough alcohol to kill whatever bug might've been in the cheap fish.\n\n\n Very few places bridge the gap, occupying the veritable neutral zone in between these polar opposites of the sushi scene. The aptly named Sushi Zone fills it admirably.\n\n\n While one would to best to avoid rolls (maki) and go for the good stuff at high-end sushi restaurants, and avoid nigiri and stick to California rolls and Dynamite rolls and Caterpillar rolls on the low-end, Sushi Zone has a unique niche by specializing in rolls comprised of fresh, less commonplace combos.\n\n\n Papaya unagi. Mackerel and ginger. Mango and striped bass.\n\n\n Traditional? Barely.\n\n\n Delicious, fresh, and prepared by an entertaining middle-aged Japanese man with amusing stories? Most definitely.\n\n\n The downside, of course, is the well-documented wait. It can be eternal. Infernal. Downright perpetual. Another downside is the small size. Not only does it contribute to the wait, but if you happen to be seated near someone with no sense of voice modulation, you may well spend an hour involuntarily listening to someone's boring, insipid stories.\n\n\n But dammit, I love the mango and striped bass. And hence, I love Sushi Zone. Loudmouth-annoying-girl-with-boring-stories-sitting-behind-me and all.", "rating": 4, "date": "2008-07-03"}, {"excerpts": ["the PAPAYA UNAGI, CALIFORNIA , SPICY TUNA & SALMON SKIN ROLLS were just remarkable! "], "author": "Nelle A.", "review": "so, \"curiosity\" didn't kill us after all.....\n\nlast saturday, as we were walking from market & 4th street towards the castro, we saw this line forming in front of a tiny joint that has a \"closed\" sign and we were wondering what the heck this was all about!?!...this place must serve the best sushi in town!!!!\n\ntherefore, last night, we went to check out the ZONE and guess what?! we were seated right away.... we didn't wait!!! we were LUCKY!!!\n\nwe were delighted with our orders of TUNA SAHIMI: it was fresh, the kind that softens, diffuses once it touches your palate!!! also, it was a GRADE A slice.\n\nthe PAPAYA UNAGI, CALIFORNIA , SPICY TUNA & SALMON SKIN ROLLS were just remarkable! delectable mixture of fruits, spices, condiments, fish & crab were nicely incorporated to an amazing maki.\n\nmoreover, they have two kinds of cali roll: fresh and imitation, and we surely went for the fresh one! however, the spicy tuna wasn't spicy. i noticed that he put more green onions than the \"hot\" stuff that a spicy tuna roll should have.\n\nas for the expertise or where the chef did his apprenticeship is not my business, as long as he did a great job slicing those sashimi and rolling those maki & nigiri is appropriate for me to rate him as an excellent chef.\n\nconsequently, our inquiring minds were not destroyed by the cramped space and extensive wait ( for the food, in our case).", "rating": 4, "date": "2007-05-10"}, {"excerpts": ["i ordered a papaya unagi roll and a roll with hamachi, avocado and fish eggs.  ", "both rolls were delicious.  \nbe prepared to wait a while for your orders.  ", "everything won't come out at the same time, so ", "it's really better to just order everything to share since the dishes most likely will come out one at a time as the lone sushi chef seems to make one item of each ticket at a time.  ", "the other guy prepares the non roll items such as the striped bass in the seashell.  \n", "the place seems to have a bigger selection of their rolls.  ", "a few nigiri, and sashimi is a choice of just one kind or chef's choice.\n", "the staff is really friendly and attentive.  ", "they never make you feel rushed even if people are waiting in line.  ", "that might be the downside if you're the one standing in line, but this place doesn't seem to believe in the quantity of people they serve each night... ", "rather it's about the quality of service for their guests who are sitting down having their meal.  ", "so... if you chose to wait for a spot to have a meal at sushi zone, then don't be mad at the restaurant if guests decide to linger at their tables.  ", "the staff is not going to drop off the check until the guest asks and the staff is not going to try and make them leave to seat new guests.\n", "when we were done with our food, the waitress asked if we wanted anything else so with that indication we asked if they had desserts ", "and she said they have green tea ice cream, so we shared a scoop of that in the end.  ", "when we were done, we asked for the check - it's cash only so bring cash.\n", "i'd definately go back - but again, i'll make sure to be there right before 5pm\n", ":)"], "author": "charlotte s.", "review": "had dinner here with my friend yesterday.\ni had never been here, but luckily she had (she was the one who suggested this place) and told me that we would have to be there at 5pm when they opened or else we'd have to wait... we're not the type of people who wait to have a meal.  we want to eat when we want to eat cus we're hungry.  nothing is worth waiting for cus there's always somewhere else you can go.\nwe arrived at 4:50pm and it was still closed.  we saw the staff of 3 busteling around the little restaurant getting everything ready.  a few minutes after we got there, two other people came to wait for opening.  at 5pm, the waitress opened the door and told us that they were running behind a little and would open the door in 5 minutes.  \nsure enough, in 5 minutes, she turned the sign over in the window to 'open', opened the door for us and asked if it was just the two of us.  we sat at the sushi bar right by the cash register.\nthere are two booths that fit 4 people in the restaurant, and i think the sushi bar can fit up to 10 people.  the two people who were waiting outside with us supposedly had one more coming so they had to wait until everyone in their party arrived.  so keep that in mind if you're coming here.  it doesn't matter if some of you are there already.  you won't get seated until everyone in your party is present.  \nthe restaurant was full within 20 minutes of being open...\nmy friend suggested a few signature items i should try.  like the striped bass with mango and some creamy stuff served on a seashell... that was really good.  it's served warm from their little toaster oven.  my friend also ordered the hawaiian roll 2 which had macademia nuts sprinkled on top of the rolls... very good.  i ordered a papaya unagi roll and a roll with hamachi, avocado and fish eggs.  both rolls were delicious.  \nbe prepared to wait a while for your orders.  everything won't come out at the same time, so it's really better to just order everything to share since the dishes most likely will come out one at a time as the lone sushi chef seems to make one item of each ticket at a time.  the other guy prepares the non roll items such as the striped bass in the seashell.  \nthe place seems to have a bigger selection of their rolls.  a few nigiri, and sashimi is a choice of just one kind or chef's choice.\nthe staff is really friendly and attentive.  they never make you feel rushed even if people are waiting in line.  that might be the downside if you're the one standing in line, but this place doesn't seem to believe in the quantity of people they serve each night... rather it's about the quality of service for their guests who are sitting down having their meal.  so... if you chose to wait for a spot to have a meal at sushi zone, then don't be mad at the restaurant if guests decide to linger at their tables.  the staff is not going to drop off the check until the guest asks and the staff is not going to try and make them leave to seat new guests.\nwhen we were done with our food, the waitress asked if we wanted anything else so with that indication we asked if they had desserts and she said they have green tea ice cream, so we shared a scoop of that in the end.  when we were done, we asked for the check - it's cash only so bring cash.\ni'd definately go back - but again, i'll make sure to be there right before 5pm\n:)", "rating": 4, "date": "2006-11-29"}], "mango hamachi": [{"excerpts": ["Mango hamachi roll - 3/5\nSpicy scallop roll - 3/5\n", "Unagi papaya roll - 5/5\n", "Rainbow roll - 4/5\n", "Tekka maki - 4/5\n"], "author": "Mark O.", "review": "Dinner review. \n\nMango hamachi roll - 3/5\nSpicy scallop roll - 3/5\nUnagi papaya roll - 5/5\nRainbow roll - 4/5\nTekka maki - 4/5\nBaked sea bass - 5/5 - Perfect. \n\nOverall, this is now my favorite sushi place in SF. Good quality and very generous portions. The baked sea bass is \"as good as it gets.\"", "rating": 5, "date": "2015-11-24"}, {"excerpts": ["Mango hamachi roll was delicious but couldn't tell the difference between 1 and 2 that much.\n\n"], "author": "Mimi T.", "review": "Want to eat dinner by yourself or just one other friend? This is the right place. For large groups, not so much. The ambience is a little quirky but service is great. And there's almost always a wait so be prepared. There's only two tables equipped for four people a piece and the bar which can fit about 8 people.\n\nFood is yummy though but a bit pricey. Mango hamachi roll was delicious but couldn't tell the difference between 1 and 2 that much.\n\nCash only.", "rating": 4, "date": "2016-01-10"}, {"excerpts": ["The baked mussels, mango hamachi, and uni are all a must! \n\n"], "author": "Alison H.", "review": "One of my favorite spots in the city for sushi! Always great service and fresh fish! The baked mussels, mango hamachi, and uni are all a must! \n\nGet there when it opens if you don't want to wait! It is also cash only.", "rating": 5, "date": "2016-02-11"}, {"excerpts": ["Garosaba\nKing California \nHamamasa\nMango Hamachi \n", "Rainbow Roll: "], "author": "Adorable T.", "review": "Came here with a party of 3 at 4:45 on a Thursday night and there was already a line.\nI'm extremely glad that I came early, because there's only one chef, and we didn't get our food until about 6:45. Started off the night with a hot sake--very good.\n\nThe lady is extremely nice and helpful with ordering.\n\nGarosaba\nKing California \nHamamasa\nMango Hamachi \nRainbow Roll: YES\nStuffed Shitake Mushroom\nBaked Sea Bass: Amazing!!\nMackeral\n\nThere was nothing bad. This was probably the best rainbow roll I've ever had. The sushi was not traditional in taste, but the balance of rice and fish/vegetables was exactly how I've always imagined them to do it in Japan. Not filled on rice!!!\n\nDamage? $100 (t&t included)--not bad! Super full, had a great time, satisfied.", "rating": 5, "date": "2013-01-23"}, {"excerpts": ["We also ordered Hamachi Nigiri, White Tuna Nigiri, Hawaiian #1 roll, Mushroom roll and Mango Hamachi roll: All fish were so fresh and the slice of the fish was generous.  "], "author": "Liza T.", "review": "This was my second time to come here.  My first time was about 5 years ago.   Surprisingly, the food was still as good as before.\n\nCame here with a friend on a Friday at 5:30pm and the restaurant was already packed.  Luckily we were the first party on the waiting broad.  We got seated at 6pm.  \n\nA lot of people complained about the wait for the food.  Yes, it was a pain because there was only one chef and he was doing one order at a time.  So you probably expect to wait another 30 minutes for your food.\n\nWe ordered:\n\nBaked mussels:  I tried this in 5 years ago and the taste of the mussels were always in my mind.  After so many years, the taste was pretty much the same.  Delicious!  The sauce was flavorful and the portion was good.  Must order item!\n\nWe also ordered Hamachi Nigiri, White Tuna Nigiri, Hawaiian #1 roll, Mushroom roll and Mango Hamachi roll: All fish were so fresh and the slice of the fish was generous.  The portion of the rolls and sushi were good.  \n\nThe service was very friendly.  Even though there was only one waitress, she was still attentive; just kinda slow sometimes.  \n\nDeducted one star?!?!?!  Definitely the wait..............too long ;-(", "rating": 4, "date": "2012-01-25"}, {"excerpts": ["The Mango Hamachi Roll (yellowtail, mango & scallion $5.50) comes out next.  \n\n"], "author": "Teri C.", "review": "Being out of the country for a month puts you into a sushi fix, and Lorna D. had just the place to take me to during a visit back to The City.  Arriving around nine in the evening, she's surprised to see it's so packed for a Tuesday night.  Sure, it's been a year since her last visit and we get on the long list of waiting hopefuls.  With only two tables for four and about 10 counter seats, our wait extends out for about an hour.\n\nDiners are in no rush as they linger over sake and Sapporo.  With only one sushi chef, one waitress, and another assistant who manages the fryer and washes the dishes, the pace of food coming out is far from a hurried state.  We get seated a little after ten despite the CLOSED sign being put out a quarter to that hour.\n\nThe waitress takes our drink orders, which is simple with water and tea.  We also throw in some edamame since we're starving and we know the sushi is going to take awhile.  Their menu is brief, one laminated page and their specials board. \n\nThe first item to arrive is the Spicy Tuna Roll (Tuna, avocado & scallion w/ a mayonnaise base $5.50) and I am reminded of why I first started enjoying the spicy tuna roll...the mayonnaise based spicy sauce.  (I hate it when they use that Sriracha sauce. Blah!)  It comes in six pieces and the roll isn't wrapped very tightly, so you definitely have to make it in one bite.\n\nNumber two is the Spider Roll (Softshell crab, avocado, and shiso $9.00), also cut into six pieces.  The crab is still very hot as it just emerged from the fryer.  The shiso adds a nice finish to this crunchy bite.\n\nWe look over at our neighbors and are tempted by their nigiri choices.  We also order one amaebi nigiri ($4.50) and its sweet plumpness is pleasant to our tastebuds.  The deep fried shrimp heads come out shortly.    \n\nLorna D. has an obsession with mango, and anytime she sees a roll with this sweet fruit, she had to get it.  The Mango Hamachi Roll (yellowtail, mango & scallion $5.50) comes out next.  \n\nThe Alaskan Roll (salmon, avocado, & scallion $5.00) is quite satisfying with its chunky salmon bits and I find myself smiling with glee on all this lovely sushi.\n\nIt's way past 11 and I tell Lorna this is our last chance for any additional rolls she may want.  (There's another party behind us that has yet to be served!)  We go for the Spicy Scallop Roll ($5.50) and learn they are out, so we opt for the Spicy Albacore Roll ($5.50) instead.  The spiciness proves a bit too much for Lorna D., but I really couldn't ask for more.\n\nService is what you can expect when there's such few staff.  The waitress will fill your water and tea glass when you ask, just don't expect her to come around and do it automatically.  She's too busy taking orders, bringing sushi platters back and forth, and clearing the dishes.  Patience is definitely a virtue here.\n\nSushi is fresh and good. No frills at all.  Next time I would love to pig out on their sashimi and nigiri since their fatty chunks of fish were making me drool.\n\nAt $42 with tip and tax, we left content and with very full bellies.  \n\nCash only.  Don't bother coming with anyone else besides your plus one, otherwise the wait will be even longer. \n\n(Pics of our sushi dinner can be found in the business profile.)", "rating": 4, "date": "2008-02-11"}, {"excerpts": ["and I had the papaya eel and mango hamachi rolls.  ", "I was pretty skeptical of the papaya and eel ", "but they went together so well.  ", "Even Fiance, who hates eel, said it was delicious.  ", "Everything we tried was delicious and the fish was so fresh.  "], "author": "Stephanie M.", "review": "This place is incredible.  We decided to come here because we couldn't get reservations for Kiss.  Kind of glad it worked out that way.  Fiance and I showed up at 4:30 because we were sure there would be a wait.  Unsurprisingly, there were 8 people already lined up before us.  The entire restaurant seats about 16 people but you have enough elbow and leg room.  The service is a little slow but that's because everything is made to order with care and precision.  Fiance had the sushi combo and I had the papaya eel and mango hamachi rolls.  I was pretty skeptical of the papaya and eel but they went together so well.  Even Fiance, who hates eel, said it was delicious.  Everything we tried was delicious and the fish was so fresh.  The prices are a little higher than I'm used to but for the size and quality of the sushi, it was so worth it.\n\nThe only complaint I had was the parking, but it's San Francisco so it comes along with the territory.", "rating": 5, "date": "2013-03-31"}, {"excerpts": ["Mango Hamachi: "], "author": "Elaine L.", "review": "I think perhaps a 3.5 for not accepting credit cards and being 1.5 hr wait everytime I've come here. BRING CASH. Luckily, this place isn't too pricey.\n\nI've been here twice, one with a party of 5 and another time party of 2. Both times 1hr+ wait. This place is super tiny so I suggest that you put your name down on the whiteboard and go do something for at least 45 min. Both times we arrived around 7:30-8 and the wait was just as long. Perhaps next time we'll come around opening time which is 5pm (who eats dinner that early). Parking isn't difficult, mostly all meters.\n\nWe ordered: \n\nBaked Bass: DELICIOUS! Chopped up bass meat mixed with some creamy mayo sauce with some ponzu and scallions. One order comes with two pieces.\n\nBaked Mussels: JUST AS GOOD! Pretty much the same concept as bass but with chunks of mangoes added. Mouthwatering goodness! Each order also comes with two pieces.\n\nSashimi Combo: Comes with salmon, red tuna, mackerel, albacore, shrimp, and yellow tail I think? Not skimp on the pieces.\n\nHawaiian Roll #1: Tuna with avocado and a generous amount of chopped macadamia nuts sprinkled on top. YUM!\n\nHawaiian Roll #2: Yellowtail with mango and also with avocado I think, plus the mountain of macadamia nuts sprinkled on top. JUST AS GOOD AS #1.\n\nUnagi papaya: Exactly what the name says, eel with papaya. I am not a fan of papaya so I did not try this but my cousins sure had no problem annihilating it within minutes. \n\nMango Hamachi: The flavors really compliment each other and gives that tropical taste.\n\nHama Masa: One of the few rolls that didn't really leave a strong impression in my head, but nonetheless delicious.\n\nSpicy Hamachi Roll: Exactly how it sounds too. Very fresh, very simple, very good!\n\nSalmon & Albacore Nigiri: Very fresh and generous on the cut.\n\nI like my sushi simple and fresh, because I find restaurants that like to mask the freshness of their fish with some kinda spicy mayo sauce or teriyaki sauce, kinda jive? Kinda overpriced and for no reason. The rolls here have the best of both. Simple yet with a touch of hawaiian influences. The best thing about it is that it won't break the bank. Each roll is about $5.50-$7 for a decent size too. Just remember not to come here hungry because it will be over an hr.", "rating": 4, "date": "2011-10-12"}, {"excerpts": ["We decided on a sea bass appetizer (it's one of their most popular appetizers - two mussel shells with baked sea bass and mango), a spicy mango salmon maki and a mango hamachi ", "maki along with a 14 piece sashimi combo. "], "author": "Christine P.", "review": "First things first: Sushi Zone is cash only. Make sure before you walk in to have enough on hand. If not, there's a Bank of America about four blocks away (I'm not kidding - the Husband had to run down there after we ordered). \n\nMoving on to more important matters: I am the 670th person to review Sushi Zone! So like with so many of the delightful places in SF, Sushi Zone has more reviews than it knows what to do with so why am I adding my two cents? Because I want to ensure that by adding a positive review, SZ continues its good reputation online.\n\nIt's Saturday night and the Husband and I are meeting up with an old college friend of the Husband. We decide on sushi and although Umi tends to be my go-to place, we thought it would be good to try something new. Street parking wasn't as bad as we were expecting but the line at SZ was something else. We waited about an hour for the three of us but they will serve you a drink while you wait if you'd like. So we stood right outside the door drinking our large Sapporos, feeling a little naughty. \n\nOnce we were seated, we were pleased to find that the prices were wallet-friendly. We decided on a sea bass appetizer (it's one of their most popular appetizers - two mussel shells with baked sea bass and mango), a spicy mango salmon maki and a mango hamachi maki along with a 14 piece sashimi combo. The total came out to about $95 without tip and the three of us left quite full and happy.\n\nThe baked sea bass mussel shell was fantastic. I highly recommend it! The sashimi was fresh and the maki were homemade-tasting. I've had more polished sushi but I like the homemade presentation and flavor at Sushi Zone. \n\nWe were kind of squashed up against a group of three guys at the bar and when you're shoulder to shoulder with a stranger, you're bound to become friendly unless you're completely anti-social. The cute old Asian man making all of the sushi was preparing something delicious-looking and I asked the guy next to me what it was that smelled so good. It was apparently his order and the chef apparently overhead me because as he handed my neighbor the plate, he also handed him a small additional plate and nodded to me. It was a small taste for me and the Husband and the Friend! How nice! It was the Chef's Special and I think it was lightly seared tuna. Yum!\n\nThe wait time was pretty intense but with the large Sapporos, we did ok. Luckily the weather wasn't too bad otherwise I think we might have left. At the end of the meal, the three of us agreed that it was worth the wait. On a Saturday night, you have to expect that a well-run place like this is going to have a wait time.", "rating": 4, "date": "2011-08-14"}, {"excerpts": ["Mango hamachi roll\nBaked sea mussel \nBaked sea bass"], "author": "Jennifer W.", "review": "Authentic sushi restaurant.\nReasonably priced. \n\nI'd take my friends or family here, then you know how much I love the sushi here. \n\nRecommendation:\nHawaiian roll #2 \nSpicy hamachi roll \nMango hamachi roll\nBaked sea mussel \nBaked sea bass", "rating": 5, "date": "2014-03-20"}, {"excerpts": ["Their menu is not particularly large and they are known for a few of their more popular items such as the mango hamachi roll. ", "If you're into that sort of thing (fusion sushi) then you might like it. ", "It was just \"meh\" since I'm not a big fan of having any sort of fruits in my dinner or the sweet and savory combination. \n", "We started out with mussels on half shells. ", "I forgot the exact name but we ordered two, one had mango in it and the other didn't. ", "You can probably guess which one I preferred. ", "Beware that one order only comes with two pieces which is a bit pricey. \n", "We also ordered the spicy tuna roll, spider roll, and the tekka roll. ", "They were all pretty good but nothing out of the ordinary. \n", "Prices are slightly lower than elsewhere but due to the inconvenience of the long wait and difficult parking around the area I most likely will not be returning when there are similar to better places for sushi closer to home. ", "A few of us in our party of 4 left with a half filled stomach."], "author": "Bunnie L.", "review": "Come early or be prepared to wait as this place is super small. Their menu is not particularly large and they are known for a few of their more popular items such as the mango hamachi roll. If you're into that sort of thing (fusion sushi) then you might like it. It was just \"meh\" since I'm not a big fan of having any sort of fruits in my dinner or the sweet and savory combination. \nWe started out with mussels on half shells. I forgot the exact name but we ordered two, one had mango in it and the other didn't. You can probably guess which one I preferred. Beware that one order only comes with two pieces which is a bit pricey. \nWe also ordered the spicy tuna roll, spider roll, and the tekka roll. They were all pretty good but nothing out of the ordinary. \nPrices are slightly lower than elsewhere but due to the inconvenience of the long wait and difficult parking around the area I most likely will not be returning when there are similar to better places for sushi closer to home. A few of us in our party of 4 left with a half filled stomach.", "rating": 2, "date": "2013-01-29"}, {"excerpts": ["The mango hamachi roll was ehh..."], "author": "Jac T.", "review": "*3.5-4 stars*\n\nI LOVE the small restaurant atmosphere, I LOVE the sign-in, i LOVE the selection.\n\n[THUMBS DOWN]:\nI really don't like the sashimi.  I got the sake and tako; and for $10 for 4 pieces, I really expected it to be fresh and not have a bad lingering taste.\n\nThe spicy hamachi wasn't spicy..and fell flat on taste.  \n\nThe mango hamachi roll was ehh...i can barely remember how it tasted--that says ALOT!  \n\n[THUMBS UP]\nThe spider roll was delicious!! I wish we got that first though--by that time, I was full and couldn't eat more then 2 pieces, and really wanted more...\n\n[THUMBS IN-THE-MIDDLE]:\nThe hawaiian roll was ok--I really like the crunchiness of the mac nuts.  \n\nNext time, I want to hamachi kama and salmon kama!", "rating": 4, "date": "2010-06-12"}, {"excerpts": ["My suggestions are the Hawaiian #2, mango hamachi, and stuffed jalepeno.  ", "Well worth the long wait and their prices are reasonable for the portion size.  ", "Next time I will try to get there right when they open to avoid the long wait.  ", "Definitely coming back!"], "author": "Janelle D.", "review": "Can I just say the best sushi I've ever had...so far!  Melt in your mouth goodness! My suggestions are the Hawaiian #2, mango hamachi, and stuffed jalepeno.  Well worth the long wait and their prices are reasonable for the portion size.  Next time I will try to get there right when they open to avoid the long wait.  Definitely coming back!", "rating": 5, "date": "2011-06-08"}, {"excerpts": ["the mango hamachi was the only good thing that I got here."], "author": "Diane L.", "review": "It's not that great.....small ass establishment and ehh. I hella remember the mussels only came with 3 pieces smh....To be honest I barely remember what I ordered here cuz obviously it wasn't the best. I think I got the Hawaiian #1 and #2 rolls....didn't like the macadamia nuts on there with their sweet sauce, but if I had to pick one roll the mango hamachi was the only good thing that I got here.", "rating": 3, "date": "2012-03-09"}, {"excerpts": ["Baked Mussels, Mango Hamachi etc... to die for. ", "It's a small place & the wait is long but very worth it."], "author": "Meikee M.", "review": "I discovered this place waaay back in the day when the original owner was running it. I've taken all my friends & everyone agrees AMAZING! Baked Mussels, Mango Hamachi etc... to die for. It's a small place & the wait is long but very worth it.", "rating": 5, "date": "2012-02-24"}, {"excerpts": ["- mango hamachi\n - unagi w/ papaya\n.....", "there may be more but don't remember off the top of my head right now!!!"], "author": "Cindi N.", "review": "LOVE SUSHI ZONE!!!   my #1 all-time favorite sushi place!!!!  am so happy to see nori's sushi boom & flourish with a line outside the door starting @ 4:50pm, people willing to wait for a couple of hours and all these awesome reviews!!!!  nori would be happy!!!!\n\nLOVES:\n - striped bass mango in mussel shell appetizer (signature appetizer)!!!!!!!!\n - stuffed mushroom w/ salmon appetizer\n - eggplant (nasu) nigiri!!!!!\n- spicy scallop\n - spicy tuna\n - mango hamachi\n - unagi w/ papaya\n.....there may be more but don't remember off the top of my head right now!!!", "rating": 5, "date": "2007-01-30"}, {"excerpts": ["I love the hawaii rolls, the unagi papaya, mango hamachi, eggplant nigiri,  the baked mussels, .....      "], "author": "Regi K.", "review": "I love this place.    I always come way before 6pm and ensure I'm one of the first wave of customers for the evening, otherwise you can expect to eat 2-3 hours if you come any later.  \n\nI must have my own spicy tuna rolls.  That's just not one I can share.  I love the hawaii rolls, the unagi papaya, mango hamachi, eggplant nigiri,  the baked mussels, .....      I love all the fruity combinations, the liberal use of avocados, and the yummy fresh fish.   \n\nI've been coming here since it was Nori's, and then when his best friend took the restaurant over and he kept the same menu... yippeee!!!!!", "rating": 5, "date": "2008-03-26"}, {"excerpts": ["We ordered:\n- Baked Mussels\n- Mango Hamachi\n- Alaska Roll\n- Spider Roll\n"], "author": "Jason S.", "review": "I have a theory that once a restaurant has more than 300 reviews, the rating will kind of peak off and subsequent reviews won't matter anymore. Still, I have to put in my two cents on this joint, which clearly has been ranted and raved about since the fledgling days of Yelp.com.\n\nI came to this place a few times before. All those times, I had a really bad experience due to the horrendous wait. At one point, we waited 1.5 hours just to sit, and another 30 to 45 minutes just for the food to come to our table. \n\nAnyways, this review isn't about those previous visits. This review is about the latest I made to this restaurant, which you got to admit, has really awesome food for the price. My partner & I made it to this restaurant on a Saturday 20 minutes before it was going to open. The wait didn't seem that long, but soon after we arrived to stand in line outside, people kept coming up to the point that by the opening at 5pm, the whole restaurant was full. Regardless, the waitress who seated and served us was extremely courteous and quick to serve as usual. We were seated right next to the 2 people ahead of us on the bar. \n\nWe ordered:\n- Baked Mussels\n- Mango Hamachi\n- Alaska Roll\n- Spider Roll\n- Indian Roll\n\nAll of these were DELICIOUS! My partner is in love with the baked mussels (but what about me??!) and even though I'm not a fan of octopus, the indian roll was delectable and I can't wait to try out the other rolls next time!\n\nWe are going back, and I recommend everyone to visit this place...20 minutes before it opens on a Saturday.", "rating": 4, "date": "2008-10-05"}, {"excerpts": ["And the mango hamachi rolls make me start salivating when I see them. "], "author": "Jesse M.", "review": "SHIZAM! It is like a taste explosion in my mouth!!!\n\nMy buddy introduced me to this place and told me I had to try the striped sea bass and mango shooters. Oh.....my......god. I wish I could line up a dozen of them on the bar and pound one after another, they are that good!! And the mango hamachi rolls make me start salivating when I see them. they are onolicious!\n\nShow up early or come after 830 or else you will be waiting forever.", "rating": 5, "date": "2009-07-16"}, {"excerpts": ["I cannot leave Sushi Zone without having the Hawaiian #1 and #2 rolls, mango hamachi roll,  and mussels.  \n\n"], "author": "Michelle T.", "review": "My ABSOLUTE FAVORITE sushi joint in SF!! I cannot leave Sushi Zone without having the Hawaiian #1 and #2 rolls, mango hamachi roll,  and mussels.  \n\nI have waited 2 hours more than once to be seated but I expected that. And yes, there is only 1 chef, assistant chef and waitress so you must be patient. For those of you who complain about this....deal with it or leave so that Sushi Zone lovers can take your place.\n\nAlso, please be considerate and do not sit for hours on end so that starving people waiting in line don't have to watch you eat and drink copious amounts of sake. Thank you!", "rating": 5, "date": "2008-10-05"}, {"excerpts": ["Truly the apotheosis of sushi, the Platonic pinnacle of raw (and in the case of that mango hamachi mussel shell niblet of heaven, cooked) fish.\n\n", "Get the spicy tuna, mango hamachi, and the Hawaiian #1 (", "oh god yess, the Hawaiian #1) and tell yourself your evening would have been a boring one anyway."], "author": "V. m. g.", "review": "The most terrible thing about Sushi Zone: this restaurant will *completely ruin* all other sushi experiences for you.  I cannot go to any other sushi place, as I already know it will never measure up to the luminous and infinite goodness that is The Zone.  Truly the apotheosis of sushi, the Platonic pinnacle of raw (and in the case of that mango hamachi mussel shell niblet of heaven, cooked) fish.\n\nSo it is freakin tragedy that the establishment that would so render all other sushi establishments superfluous (if not an affront) basically makes you a zombie slave to its infrastructural limitations.  Like everyone else has said: it's TEEN-EINTSY (two tables for four and maybe 6 or 7 at the bar), has a staff of three (one waitress, a chef, and a diswasher/rice maker/mussel baker/and more), and a waitlist system that causes endless amounts of anxiety ('course, that could just be the hunger talking).\n\nI understand the frustration that others have expressed about the wait--which is utterly ridiculous and entirely unavoidable--but we regulars put ourselves through this bcs, again: zombie slaves.  It is the best fucking sushi EVER, and some of us love sushi that much.  So here are some rules we've come up with to better manage the experience:\n\n1. Eat something before you go.  Seriously.  It will be two hours before you eat again, so pick an appropriate meal for your digestive pace.\n\n2. SZ opens at 5 pm.  You need to show up sometime around 4:40 pm to secure a place in line that will assure you seating among that first batch of diners.  Do not be surprised if there is already a queue when you get there.  Use that information to assess how much earlier you have to arrive next time.\n     NB: if you miss first seating (this is not an actual term, it's just how I think of it), you *might* be able to pare down your wait time if you arrive some time around 6:45 and get your name on that list pronto.  I've never tried this strategy, but it's one I've thought about after watching the ebb and flow of the dinner crowd.\n\n3. If you got seated at 5 pm, you will eat around 6:30.  Yup.  Hope you had that suggested meal.\n\n4.  Although you may not be able to help the hunger-induced cross-eyed grimace on your face, try not to glare at those seated.  Likewise, I *completely* understand the urge to linger at your table--finally getting seated feels like a darwinian victory--but just try not to be too gloaty about it.  Someone might eat you, and you could hardly blame them.\n\nI disagree with the reviewer who said SZ becomes more and more inefficient as the night wears on.  On the contrary, given their staff and space constraints, I constantly marvel at the well-honed efficiency of the organization.  The three of them NEVER STOP WORKING, and working HARD, and yet they are always pleasant and courteous and the food and drink come out just as fast as they can.  (90 minutes?!?  Um, again, remember the constraints.)\n\nIt's true that The Zone is not for everyone, and you really have to be ready to take in ALL aspects of that dining experience.  But if you know what you're getting into, and can prepare for it, you will be rewarded with sushi nirvana.  Get the spicy tuna, mango hamachi, and the Hawaiian #1 (oh god yess, the Hawaiian #1) and tell yourself your evening would have been a boring one anyway.", "rating": 5, "date": "2008-03-04"}, {"excerpts": ["Mango Hamachi - really?.."], "author": "Wilson T.", "review": "This place sucks! \n\nI don't know what all the hype is, it's just another sushi restaurant. \n\nGood points: \nRestaurant is run by REAL Japanese people, not Juan Carlos and the crew. \n\nBad Points: \nWaited 2 hrs, finally got seats in front of the sushi chef. Watched him make a Hawaiian #2, then realizing he mad a mistake, he scrapes off the saucy fish and throws it back in to the fridge. NICE! \nAfter about 1/2 hr, we finally get our food order going. \n\nMango Hamachi - really?..Hamachi roll w/ mango - 1 star \n\nSpider Roll - Possibly the worst Spider Roll I've ever had. I don't even think they put a batter on the crab. Crab tasted burnt and was mainly on the end pieces, hardly any filling the middle. - 1 star \n\nThe Hawaiian #2 - Macadamia nuts and mango pieces w/ saucy fish. I looked at the fish and it seemed familiar...ya! the shit the sushi chef scraped off earlier and put back in the fridge is now I'm my mother fuck'n sushi! WTF! \nNothing special about this roll either. - 1 star \n\nI will never go back to Sushi Zone again. Just because you put mangos, papayas, or macadamia nuts in your sushi doesn't make it special or taste any better! \n\nOverall - I give it a big 1-star on my middle finger! FUCK YOU Sushi Zone!", "rating": 1, "date": "2010-01-30"}, {"excerpts": ["For the meal we decided that the Hawaiian #2 and Mango Hamachi sounded most appealing from yelpers. ", "I don't normally eat raw fish (I know, what am I doing eating sushi) but I decided that I really should eat these rolls that were getting rave reviews. ", "The Hawaiian #2 was VERY good. ", "Like, kind of amazing. ", "I always thought that eating in one bite was just something I did out of convenience, but the way the ingredients worked together and pretty much NEEDED each other in this roll made me appreciate sushi that much more.  ", "The Mango Hamachi was good as well but the Hawaii #2 took the cake for the raw rolls.\n", "The we ordered the Rock n' Roll and the Artichoke and Avocado rolls. ", "The Rock n' Roll usually never goes wrong (and it didn't) ", "and it's not raw so naturally", ", I wanted to order that. ", "It was very good but not really unique to this place. ", "The Artichoke and Avocado was very... different at first. ", "But after 3 pieces of it, it really kind of grew on me. "], "author": "Virginia C.", "review": "My boyfriend and I decided to eat at Sushi Zone based fully on it being the 2nd highest ranked place that came up when I searched \"sushi bars\" and was within my spending budget. After gathering a few tips from previous yelp reviews, we set off in search of the hole-in-the-wall, hour-long-wait sushi bar. We arrived around 6:30pm and, after we wrote our name on a little white board, we were told we had around an hour wait. There was a few bar stools for us to wait but they were all occupied so we walked around the area. Sadly, everything closed by 7pm so we were left to wander through laundermats until we thought it would be in our best interest to stay in the restaurant to listen for our name. By 7:40pm, we were seated with our orders placed.\n\nWe chose two appetizers: Baked Mussels and Baked Sea Bass. Both of which were delicious but the winner was the Baked Mussels. The Baked Sea Bass had warmed mangos at the bottom of the mussel shell that it was baked in that didn't rub me in the right way.\n\nFor the meal we decided that the Hawaiian #2 and Mango Hamachi sounded most appealing from yelpers. I don't normally eat raw fish (I know, what am I doing eating sushi) but I decided that I really should eat these rolls that were getting rave reviews. The Hawaiian #2 was VERY good. Like, kind of amazing. I always thought that eating in one bite was just something I did out of convenience, but the way the ingredients worked together and pretty much NEEDED each other in this roll made me appreciate sushi that much more.  The Mango Hamachi was good as well but the Hawaii #2 took the cake for the raw rolls.\nThe we ordered the Rock n' Roll and the Artichoke and Avocado rolls. The Rock n' Roll usually never goes wrong (and it didn't) and it's not raw so naturally, I wanted to order that. It was very good but not really unique to this place. The Artichoke and Avocado was very... different at first. But after 3 pieces of it, it really kind of grew on me. I can't say it was my favorite and that I would order it again, but I did think that it was interesting.\n\nThe waitress and chef were both very curteous and welcoming and we got through the meal without ever getting pressure from them to leave. We finally left close to 9 and there were still lots of people waiting so don't try to wait out the crowd, just get there earlier than you plan to eat and your chance will come.", "rating": 5, "date": "2010-12-31"}, {"excerpts": ["When it was our turn, we ordered spicy hamachi, mango hamachi and spicy tuna, baked mussel, five orders of different nigiri. ", "I have never had fish that fresh ", "I didn't bother to eat with ginger (which I usually pile up on top of the fish to cover even 1% fishy taste while eating at  this price range japanese restaurant) ", "Hamachi is the highlight of this sushi bar, We end up spending $55 plus $10 tip, and we totally dont mind to wait again."], "author": "mushroom L.", "review": "I woulda given it five stars if not that \"loooooong\" wait. We went to there at 6:30pm Sunday night, and had our butt sit till 9:00pm to get out first bite of that fantastic fish. My hubby was really upset cuz he went from \"I am not that hungry\" to \"I am gonna eat that bench leather at the entry\" during the 2.5 hour wait. But its worth waiting... people behind me kept saying. Well, it was! When it was our turn, we ordered spicy hamachi, mango hamachi and spicy tuna, baked mussel, five orders of different nigiri. I have never had fish that fresh I didn't bother to eat with ginger (which I usually pile up on top of the fish to cover even 1% fishy taste while eating at  this price range japanese restaurant) Hamachi is the highlight of this sushi bar, We end up spending $55 plus $10 tip, and we totally dont mind to wait again.", "rating": 4, "date": "2007-05-21"}, {"excerpts": [", it's definitely a commitment worth having - with a mango hamachi roll to boot."], "author": "Domenique B.", "review": "you have to be patient for a table, otherwise your date turns into an orangutang and the idea of a quick bite vanishes from your mind. monkey or no, it's definitely a commitment worth having - with a mango hamachi roll to boot.", "rating": 5, "date": "2006-07-02"}], "sushi combination plate": [], "chirashisushi": [], "sashimi combination plate": [], "suzuki": [{"excerpts": ["We also had the unagi sushi and suzuki sushi. "], "author": "Katherine Y.", "review": "This is such an amazing sushi place, but it is super tiny and there will be a wait! Trust me, the wait is worth it!\n\nJust how small is it? There are only 2 tables here with group seating (4 people per table) and space at the sushi bar for up to about 6 people. So, it's probably best to only bring 1-2 friends here at a time. I would also recommend this as a good date spot.\n\nI came here with a friend on a Tuesday night around 8:00 pm and waited an hour for a seat. The wait was fine because we just signed up on the list and went next door to Pisco Latin Lounge for drinks, which was the perfect way to kill time. \n\nAt about 9 pm, we were seated at the bar. There was only one waitress there and she took our order quickly. There is also only one sushi chef there and our order came out in just a few minutes. \n\nWe attempted to be adventurous and ordered the Hawaiian #2, which had mango, hamachi, and macadamia nuts on top. It was surprisingly good! We also ordered the Octopus roll, which was okay, but we thought it was a bit too chewy.\n\nThe couple next to us had the baked oysters which smelled amazing and looked delicious. It was highly recommended to us by the couple, but we were too full at that point to order them. I will have to try them next time!\n\nWe also had the unagi sushi and suzuki sushi. The rice in both were perfectly seasoned - slightly sweet and perfectly complemented the fish. \n\nOverall we had a great experience here. For good sushi that doesn't break the bank, this is the place to go!", "rating": 5, "date": "2014-07-26"}, {"excerpts": ["They have Suzuki, Japanese sea bass, my favorite and hard to get. \n\n"], "author": "René X.", "review": "I would love to give five stars because, honestly, this is the second best sushi restaurant I have encountered, outside of Japan. I have lived there and traveled 30+ countries but the quality/size here is phenomenal. \n\nThe cost-benefit ratio is excellent, meaning this place is, hands down, a steal. The nigiri are huuuge. They have Suzuki, Japanese sea bass, my favorite and hard to get. \n\nHowever, the waiting is a big minus. We waited 1h+ for our table and then another hour for our food and that while the place can only seat about 15 ppl. It is tiny. \n\nNormally, this would be a ruled-out for me because I go out to satisfy my hunger and not to wait 2 hours. But, as I said before, the food is exceptional. \n\nSO, if you have the time and want to wait, it is worth it. If you are hungry and want a sushi snack, go somewhere else. \n\nBE ADVISED: cash only!(next ATM is in a liquor store a block away).", "rating": 4, "date": "2014-05-10"}, {"excerpts": ["Suzuki\n\n- Hawaiian roll\n"], "author": "Kay N.", "review": "I finally came here again Sunday evening 12/28/08.  There was ample street parking and of course no need to feed the meter at all b/c it was Sunday.  \n\n~4:45PM  Time of arrival\nSign on door: \"We will open at 5:30PM\"  =/  (They were having slight electrical problems - they probably need a new breaker box or to balance out the flow of electricity..)\n~5:20PM  Time we were let through the door\n\nI love the intimate setting at Sushi Zone.  \nThe one chef making the sushi and appetizers, the one assistant making the baked appetizers and the one waitress tending to the customers.  It gives me a cozy feeling and I love that the place is small and hole-in-the-wall-ish.\n\nThis time I got some of what I hadn't ordered on my last visit.\n\n- Baked sea bass w/ mango \nsoso SO good!  I should've gotten a couple orders of this one.\n\n- Nigiri\nSaba! (my favorite)\nSake\nMaguro\nHamachi\nSuzuki\n\n- Hawaiian roll\nA fun roll w/ tuna, creaminess of avocado+mayo, crunchiness of macadamia, mmm..\n\n- Spicy albacore roll\nYum.\n\n- Hot sake \nI'm not the biggest sake fan, but this one did not leave a gross aftertaste in my mouth, so not bad.\n\nIt was all very satisfying, and I love getting in early, eating as part of the first group in, and leaving at around 6:30PM, so I still have the rest of the night to do whatever floats my boat. \n\nYay Sushi Zone  ^_^  Intimate, friendly, affordable and delicious.\n\n(P.S. Check out several pics of the food I ate on Sushi Zone's business profile.)", "rating": 5, "date": "2008-12-29"}, {"excerpts": ["The Suzuki (Striped Bass) was delicious!!!  ", "It came with a ponzu dipping sauce.  ", "The overall waiting experience was like a marathon and I am not sure I would do it again.  ", "The overall food experience was very good, the quality of fish and flavor of the sushi made the wait somewhat worth it.  ", "Make sure you get a snack before heading over and have lots of patience."], "author": "Petri Y.", "review": "Right off the bat, this place is Japanese owned which is definitely a plus as the waitress and staff were very polite and the food was presented in very neat and clean fashion.  After putting our name on the list for 2, we waited roughly 50 minutes to sit.  This place does has pretty limited seating and it is a bit warm and stuffy.  We finally sat at the sushi bar on the stools.  We placed our order and received our beverages, soup, and stuffed jalapeno appetizer in 15 minutes.  The Jalapeno appetizer was alright, I was expecting a little punch and you only get two small peppers with a little albacore for $5.50.  Our sushi took another hour and twenty minutes.  The sushi however was quite tasty and the fish was very fresh.  We noticed the sushi chef took a whole half of a hamachi (yellow tail) fish skin on and took time in trimming it making sure all the inedible bits were clear for perfect nigiri presentation.  The Hawaiian Mac Nut #2 roll had a very nice flavor combination.  The spicy hamachi roll was also quite tasty but again, it lacked that spicy punch.  The albacore roll was very good, nice quality fish.  Octopus roll was OK, the flavor and make up was just like the albacore roll so it tasted like the almost the same except with Tako.  The Suzuki (Striped Bass) was delicious!!!  It came with a ponzu dipping sauce.  The overall waiting experience was like a marathon and I am not sure I would do it again.  The overall food experience was very good, the quality of fish and flavor of the sushi made the wait somewhat worth it.  Make sure you get a snack before heading over and have lots of patience.", "rating": 4, "date": "2009-05-03"}], "shitake": [{"excerpts": ["YES\nStuffed Shitake Mushroom\n", "Baked Sea Bass: ", "Amazing!!\n"], "author": "Adorable T.", "review": "Came here with a party of 3 at 4:45 on a Thursday night and there was already a line.\nI'm extremely glad that I came early, because there's only one chef, and we didn't get our food until about 6:45. Started off the night with a hot sake--very good.\n\nThe lady is extremely nice and helpful with ordering.\n\nGarosaba\nKing California \nHamamasa\nMango Hamachi \nRainbow Roll: YES\nStuffed Shitake Mushroom\nBaked Sea Bass: Amazing!!\nMackeral\n\nThere was nothing bad. This was probably the best rainbow roll I've ever had. The sushi was not traditional in taste, but the balance of rice and fish/vegetables was exactly how I've always imagined them to do it in Japan. Not filled on rice!!!\n\nDamage? $100 (t&t included)--not bad! Super full, had a great time, satisfied.", "rating": 5, "date": "2013-01-23"}, {"excerpts": ["-striped bass mango\n-seaweed salad\n-jalapeño albacore\n-stuffed shitake\n-spicy hamachi\n-spicy mango\n-Hawaiian #2\n-spider roll\n\n"], "author": "Thomas J.", "review": "No reservations. 1-2 hour long wait but it is worth it.  Like any restaurant, you have to order properly.  Here are the stars at Sushi Zone:\n\n-striped bass mango\n-seaweed salad\n-jalapeño albacore\n-stuffed shitake\n-spicy hamachi\n-spicy mango\n-Hawaiian #2\n-spider roll\n\nThe sushi and cooked appetizers are fresh, inventive and worth every minute of the wait.  This is a small place with 8 seats at the bar and two tabletops for groups of 4.  \n\nNo tempura, no noodles.  But the best hole in the wall sushi place in SF.", "rating": 5, "date": "2011-01-16"}, {"excerpts": ["w/shitake - I've only had this when I'm sure I won't go without the sea bass "], "author": "Marty F.", "review": "Much has been said about the long wait - to this I'll merely observe that there must be a reason, and it's not just because of the high demand for good sushi, and the low supply of seats.  I think the wait serves as a necessary hurdle to filter out those who are impatient, or who didn't bring cash, or who prefer instant gratification, or who don't know any better.  It's probably not a good idea to bring people who are used to super fast service, or who are deliriously starving.\n\nSometimes I just can't make it to Sushi Zone because logistics prevent me from (gasp!) blocking out an entire evening for dinner.  And that's ok - going without one night makes me appreciate it the next time.  But there are ways to deal with the wait to make it tolerable so you can partake in this gift to San Francisco - no, to humanity itself.  I suggest:\n* enjoy a drink at Martuni's\n* put your name on the list right after work, then go home for an hour (and do whatever you can do in an hour) and come back\n* have a good conversation with your friends\n* take a walk through the Castro\n\nBut please - don't glare at those who are lucky enough to be eating - they had to wait, too, and they usually know enough to not take any longer than they have to.  We're all in this together.\n\nThe fish - whether in the maki or nigiri - has never been less than pristine for me.  My standards were set in Tokyo, at the Tsukiji fish market - I know.  My only quibble is that there is never any fatty tuna on the menu - sometimes I like to splurge.  But that's ok - the bare necessities are what make Sushi Zone shine.\n\nWhat I have enjoyed over and over:\nSea bass mango - what a friend calls 'sea bass crack' - is so fucking good... get it as an appetizer.\nSpicy hamachi maki - julienned jalepeno, lime, and avocado - amazing!\nSalmon skin maki - salty goodness!\nSaba nigiri - my very high mackerel standards are always met here\nSalmon (sake) nigiri - always great (best with slice of lime)\nHawaiian #2 maki - like a party in your mouth and everyone's invited\nSpicy mussels maki - like its hamachi brother above - amazing\nSpider maki - probably the most expensive thing on the menu, and worth it\nBaked salmon w/shitake - I've only had this when I'm sure I won't go without the sea bass crack - very tasty\n\nI've always had excellent service here - and by that I mean courteous, pleasant, and happy to see you.  If you can get there early, great.  If not - it's gonna be ok - sit back, relax, and enjoy the best sushi in SF for the price.", "rating": 5, "date": "2007-06-06"}, {"excerpts": ["Same goes with the Stuffed Shitake w/ Salmon and the Stuffed Jalapeno w/ Albacore (which I wish were spicy). ", "The Spicy Mussel roll is good but again, not spicy.  ", "The Spicy Mango Salmon, Spicy Albacore, and Spicy Hamachi ", "(I like the slice of lime in this roll) are really good. ", "A popular roll and definitely a favorite is "], "author": "Audrey B.", "review": "In response to Sean L.'s review, the wait is long not because the kitchen doesn't know how to work efficiently, but because they really only have one sushi chef,  one who assists when not cleaning or preparing, another who makes the baked goodies, and one waitress. First come, first served. \n\nThis place is pretty damn orgasmic. Be sure to write your name and party size on the white board located near the furthest booth from the entrance. If you don't have the patience to wait or don't like the sush here, I'd hit you with a chopstick, but I won't. Less people means less of a wait. I contemplated writing a review for Sushi Zone. No matter how much I want to share this goodness with the world, wouldn't it be nice to keep this place a secret?\n\nFirst time I came here it was 630pm, put our names down and waited, and waited, and waited till we couldn't wait anymore! FYI, don't come here after 5pm and hungry. It's torture to watch one person or two enjoying their sushi while everyone else is waiting for theirs either sitting or waiting to be seated, and there you are knowing you won't be able to eat for another hour or two. Thank goodness for Hunan Garden next door. Read review on Hunan Garden.\n\nSecond visit, I came here around 5. This time I stayed, and waited about an hour to eat. OMG!!! Sooo gooood! I can understand why people are willing to wait patiently even though the wait isn't so pleasant. I come here religiously and always before they open. Now if I can only do the same with Catholicism. Get here at 5, and there's a line. You could  always put your name down, grab drinks around the corner and come back in an hour. Don't forget the cash!\n\nEverything's pretty dang delish. The Baked Striped Bass w/ Mango comes in 2 pieces- I'll bet you can't just have one! Same goes with the Stuffed Shitake w/ Salmon and the Stuffed Jalapeno w/ Albacore (which I wish were spicy). The Spicy Mussel roll is good but again, not spicy.  The Spicy Mango Salmon, Spicy Albacore, and Spicy Hamachi (I like the slice of lime in this roll) are really good. A popular roll and definitely a favorite is the Hawaiian #2- Albacore, Mango, Macadamia Nuts. \n\nOmg, I'm having withdrawals and it's only been 3 days since I've been here last.", "rating": 5, "date": "2009-06-02"}, {"excerpts": ["We got the stuffed shitake mushroom caps stuffed with baked salmon and some delicious sauce thing.  ", "My favorite roll was the spicy hanamachi (sp?) roll which had tuna (I think), jalapenos and bits of lime.  ", "The lime really did it for me.  ", "I can't remember what fish it was, but the combination of everything tasted so good, it didn't really matter to me.  ", "We also got the salmon skin roll (always a goodie) and the Hawaiian roll number 2 (mango and tuna with macadamia nuts on top, genius!).  ", "MmmmMmmm.  ", "The only thing I wasn't so nuts about was the miso soup.  ", "I can overlook that though because of that lime/jalapeno combo!  ", "Slam dunk."], "author": "Sobrina T.", "review": "After reading all these reviews, I was expecting to wait for the whole night, but the wait actually wasn't too bad.  I think it was about 45 minutes, but keep in mind it was a Thursday night.  The place is teeny tiny -- 2 tables and 8 sushi bar seats.  We got the stuffed shitake mushroom caps stuffed with baked salmon and some delicious sauce thing.  My favorite roll was the spicy hanamachi (sp?) roll which had tuna (I think), jalapenos and bits of lime.  The lime really did it for me.  I can't remember what fish it was, but the combination of everything tasted so good, it didn't really matter to me.  We also got the salmon skin roll (always a goodie) and the Hawaiian roll number 2 (mango and tuna with macadamia nuts on top, genius!).  MmmmMmmm.  The only thing I wasn't so nuts about was the miso soup.  I can overlook that though because of that lime/jalapeno combo!  Slam dunk.", "rating": 5, "date": "2007-06-14"}, {"excerpts": ["but I could only remember the shitake mushroom with salmon because it was mui excellente!..", "and I'm not being bias because i am a salmon lover. ", "As for the sushi rolls - we ordered the Hawaiian (raw tuna and mango), rock and roll, spicy tuna and a roll with unagi and papaya. ", "There was nothing spectacular about the presentation of the sushi because it seemed like every roll looked the same. ", "But the freshness of their fish and fruit is what makes Sushi Zone special. ", "If you love raw fish then this is the sushi go to spot for you if you have the patience to wait. ", "I will have to come back again to try their other entrees."], "author": "Bonnie Y.", "review": "After living in sf for just about my whole life i never knew about this great sushi hot spot. This restaurant is about the size of my living room..literally. There are two tables and one long counter top space which could house about 20 people max. There is usually a long wait for this place if you don't come at the right times because it is so small. Come at 5 when it opens and then every hr and half thereafter to avoid long waits. Since my friend is a regular there he knew the exact time frame we should arrive so we didn't have to wait at all. There is only one sushi chef so the food can take some time to prepare. We ordered a few appetizers to start but I could only remember the shitake mushroom with salmon because it was mui excellente!..and I'm not being bias because i am a salmon lover. As for the sushi rolls - we ordered the Hawaiian (raw tuna and mango), rock and roll, spicy tuna and a roll with unagi and papaya. There was nothing spectacular about the presentation of the sushi because it seemed like every roll looked the same. But the freshness of their fish and fruit is what makes Sushi Zone special. If you love raw fish then this is the sushi go to spot for you if you have the patience to wait. I will have to come back again to try their other entrees.", "rating": 3, "date": "2008-08-06"}], "mango avocado": []}