{"small salad": [{"excerpts": ["Delicious beginning to end...perfectly fried and comes with a small salad and yummy mayo-ish dressing. ", "GET THIS!! "], "author": "Yee-Shing W.", "review": "Meh I wasn't impressed. I had the Tokyo Ramen, unaware that it only comes with ONE sliver of pork. Sad. We also wanted to try the soba noodles and was also a bit disappointed. \n\nThe only high point was the chicken karaage - I would go back just for this appetizer alone. Delicious beginning to end...perfectly fried and comes with a small salad and yummy mayo-ish dressing. GET THIS!! If I could rate this dish alone, it would be 5 stars hands down.\n\nOtherwise, nothing to write home about - still on the hunt for ramen as good as LA's Daikokuya...", "rating": 3, "date": "2010-12-08"}], "hiya yakko": [{"excerpts": ["this time i got the hiya yakko tofu, edamame, and pea shoots ramen.  ", "sometimes im a picky eater.  ", "i wanted a certain broth (shio) with certain toppings (chicken and veggies) and she had to go into the kitichen and ask.  ", "it took her a good 5 minutes.  ", "AND it was an $1 to make THAT ramen $12.  ", "WTF??  ", "its not like shio broth is more expensive.  ", "i was like nm and got the pea shoots ramen which they call cilantro ", "but it isnt really cilantro.  ", "when it came i was a bit shocked, the pea shoots were raw.  ", "i pushed them underneath the ramen but they were still raw when i ate them last.  "], "author": "claudia y.", "review": "for some reason i had thought this place was called zuzu.  but i think it is because i was reading the name from the inside of the glass and they write the s with the same corners as the z.  or maybe im dyslexic.  anyways ...\n\nwe got here at around 8:30 on a monday night and the place only had one table open.  we were seated promptly.  the service is a bit weird.  the waitresses kept looking at me funny.  i have no idea why.  do i have something on my face?  anyways again ...\n\nwe both ordered nabeyaki udon.  me with the oden one.  my friend with the beef one.  both were kind of small for charging $12something for it.  you eat oden with mustard.  when i asked for it.  guess what they brought me.  on a little soy sauce plate.  as if i couldnt tell.  guess what?  heinz mustard!!!  wth.  they didnt have the japanese mustard?\n\nthe udon noodles were chewy and not mushy.  i like them that way.  but im not asking for mustard there again to eat with my oden.  maybe im not getting oden there again.\n\ni came here again on a second try and actually got so infuriated with the seating situation that i left but i cant remember why now.  i remember asking the hostess if i could sit down and she said no or something.  last night i went back and noticed that they seat people first come first serve regardless of table size.  for example if the next names on the list were john 1 and jane 3 and the next open table was for 4 people they would go ahead and seat the one dude john at the table for 4.  \n\nthis time i got the hiya yakko tofu, edamame, and pea shoots ramen.  sometimes im a picky eater.  i wanted a certain broth (shio) with certain toppings (chicken and veggies) and she had to go into the kitichen and ask.  it took her a good 5 minutes.  AND it was an $1 to make THAT ramen $12.  WTF??  its not like shio broth is more expensive.  i was like nm and got the pea shoots ramen which they call cilantro but it isnt really cilantro.  when it came i was a bit shocked, the pea shoots were raw.  i pushed them underneath the ramen but they were still raw when i ate them last.  ugh\n\nand theres a big sign that says they dont do take out anymore\n\ni really want to like this place .. but theyre making it hard", "rating": 3, "date": "2008-09-30"}], "agedashi": [{"excerpts": ["Also had agedashi tofu for appetizer, that was really good as you could see it wasn't deep fried... lightly coated and perfect! ", "I will definitely return to try other items on the menu."], "author": "Annique D.", "review": "Tried their veg ramen today with miso broth. It was pretty good. Our server was so helpful and patient when we were trying to figure out the veg options...Also had agedashi tofu for appetizer, that was really good as you could see it wasn't deep fried... lightly coated and perfect! I will definitely return to try other items on the menu.", "rating": 4, "date": "2018-09-18"}, {"excerpts": ["Aside from noodles, you can also get Japanese appetizers like agedashi tofu and takoyaki (fried octopus balls), most for about $6 or less per plate; various rice bowls (don) added as a side for $3-5 per bowl; and $10.95 plates of Japanese curry. "], "author": "Daniel B.", "review": "I've returned to Suzu Noodle House a couple times since my last review, which I wrote almost six years ago. According to Joseph L, this place has changed owners, but I haven't noticed a difference. It doesn't seem like this restaurant has skipped a beat as it's been consistently busy the times I've visited or passed by walking around Japan Center. You still have to write your name on a waiting list outside. A server will call your party when an appropriate-sized table is ready.\n\nAs mentioned in my previous review, Suzu is located inside Miyako Mall at Japan Center in Japantown. It's just inside the Post St entrance near Webster St, on the ground level. The restaurant is small with seating for about 30 inside and about a half-dozen outside (in the mall) at three two-tops. I wouldn't come here with a group larger than 4 to 6 people. Even a party of 6 could be pushing it. Note there's an automatic 18% gratuity applied for parties of 5 or more. Reservations are not accepted.\n\nSuzu offers 17 different types of ramen, priced at $9.50 to $12.95 per bowl, and 4 different types of soba and udon noodles, priced at $8.95 to $11.95 per bowl. In addition, they have $11.95 nabeyaki udon hot pots. Nabeyaki udon is served inside a hot pot with ingredients like vegetables, tofu, seaweed, and egg. Aside from noodles, you can also get Japanese appetizers like agedashi tofu and takoyaki (fried octopus balls), most for about $6 or less per plate; various rice bowls (don) added as a side for $3-5 per bowl; and $10.95 plates of Japanese curry. Beverage-wise, a limited selection of beer, wine, and sake are available.\n\nGenerally, this is a quick, casual, and reliable Japanese restaurant. The food isn't going to knock your socks off, but it's been good every time I've had it. I consider it comfort food. This is one of my sister's favorite places to eat in Japantown.\n\nI noticed Suzu no longer has \"Tokyo Ramen\" on the menu, but it could've just been renamed. Two ramen have been marked off the menu. I tried the \"Suzu Ramen\" ($12.95, their most expensive ramen) on my last visit. It comes with two pieces of karaage (Japanese fried chicken) and gyoza (dumplings) plus corn, greens, chashu (braised pork), and half a boiled egg.\n\nYou can choose the broth on any of the ramen. They offer shoyu (soy sauce), miso, and shio (salt). They do not have tonkotsu. I had the shoyu broth with my Suzu ramen and the bowl was A-OK. The ingredients were fresh and the bowl was filling. It was far from the tastiest bowls of ramen I've had, but it wasn't bad either. The pieces of karaage and gyoza were nice and big. I'm not used to having pieces of karaage and gyoza floating around in my ramen soup and it worked out better than I expected. The outside of the karaage did get expectedly soggy though. Ultimately, I was satisfied.\n\nSince my original review, I've also tried the tonkatsu don add-on ($3) and it was delicious. It's a small version of tonkatsu (Japanese fried pork cutlet) with tonkatsu sauce on top, laid atop a bed of white rice inside a bowl. The tonkatsu was delectably crispy. It's kind of like schnitzel. The tonkatsu sauce is similar to Worcestershire sauce. Too bad they don't have a full-sized tonkatsu entree. I bet it'd be good.\n\nMy sister really likes the udon noodles served soba-style, meaning cold and with the dipping sauce on the side. The thick noodles are served on a plate topped with shredded seaweed with a tiny clump of wasabi. She's been getting this dish for years. You can get udon or soba noodles served hot or cold and with sides like tempura.\n\nService is speedy. Orders come out from the kitchen in a reasonable amount of time and waiting for a table still doesn't take more than 10 to 15 minutes. Restrooms are located around the corner, across from the toy store (Japantown Collectibles).", "rating": 4, "date": "2016-02-15"}, {"excerpts": ["I ordered agedashi tofu as appetizer and my friend order kakuni don as a combo for her noodle. \n\n", "It was $19.50 not including tips for one suzu ramen with agedashi tofu.."], "author": "Cynthia S.", "review": "I went to Japantown to meet with my friend and we decided to eat ramen. We choose Suzu because she hasn't been there. I thought there would be a long waiting lists but, it was pass lunch time, so there's no wait. We were greated by (I think) Japanese woman and sit in the corner. The tea came right away after we sat down. \n\nWe little bit confused with all the ramen choices, because all sounds appetizing. I and my friend got suzu ramen since they put karaage and gyoza in it. I ordered agedashi tofu as appetizer and my friend order kakuni don as a combo for her noodle. \n\nThe food was just ok if you compare with other ramen place around.. The ramen was little overcooked, they gave us hard boiled egg, and the broth was just ok. I think I can taste something in the broth that I can't figure that out, it taste like bamboo shoot liquid. I and my friend was talking about spicy food, thats why I asked for sriracha, but they gave me other chili (not sriracha) because they said that I have to pay a dollar extra to get the spicy paste.. Nevermind then. It already tasted better with the chili sour thing.\n\nThe waiter was pretty attentive, she asked if we were doing okay and came back couple times to refill the tea.. \n\nIt was $19.50 not including tips for one suzu ramen with agedashi tofu..", "rating": 3, "date": "2015-03-18"}, {"excerpts": ["We ordered:\n\n- Agedashi tofu: standard.\n\n- Chicken kaarage: softer type of batter. "], "author": "Linda L.", "review": "Came here with parents over the weekend. The place was already pretty filled at 5:30pm (we thought we would be super early to catch dinner). Luckily very short wait for us. Service is sufficient, but definitely not friendly. We ordered:\n\n- Agedashi tofu: standard.\n\n- Chicken kaarage: softer type of batter. Wasn't super flavorful (we all peppered ours immediately). I'm personally not a fan of that.\n\n- Seaweed salad: standard, but yum.\n\n- Pork Belly ramen in shoyu broth: I actually liked this a lot. Very flavorful, lots of pork belly, and al dente noodles.\n\nOverall I would come back for ramen but skip the appetizers.", "rating": 3, "date": "2014-01-21"}, {"excerpts": ["We also got gyoza and agedashi tofu for appetizers; the gyoza were good, though they came out last, about 10 minutes after we'd gotten our ramen, and the tofu skin was too gelatinous. ", "My dad raved about the tonkotsu broth, but my heart still belongs to Orenchi in Santa Clara."], "author": "Kathy L.", "review": "Only so-so, which is disappointing considering it's in Japantown, so you'd expect the best to be here. While the noodles were firm and chewy the way I like it, the shoyu broth was nothing special. I had the pork belly ramen, and there are 3-4 generous pieces, but a little too much fat on them. I ended up taking the fat off the last piece and just eating the meat. I love pork belly, but this was too much. We also got gyoza and agedashi tofu for appetizers; the gyoza were good, though they came out last, about 10 minutes after we'd gotten our ramen, and the tofu skin was too gelatinous. My dad raved about the tonkotsu broth, but my heart still belongs to Orenchi in Santa Clara.", "rating": 2, "date": "2012-01-29"}, {"excerpts": ["Eventually we realize that we didn't get the agedashi tofu ", "so we ask.  ", "In a minute, it comes out.  ", "The tofu is sticking together which means it's been sitting out for sometime now... "], "author": "Rose E.", "review": "We should've read the reviews first rather than following our noses.  \n\nWe spent the whole day sightseeing so my husband, cousin (who was visiting from another country), and I decided to walk around Japantown when we were hit by this glorious smell.  We were starving but decided to sign in and wait as the place was packed and there were many people waiting.  This is where this place started to lose stars. We sat right next to the sign up sheet and I noticed my name was next. The waitress totally passed us up and started calling out names for party of 2's because there was a small table available.  I thought to myself, shouldn't she have asked us first if we wanted that table.  After calling out several names, I sort of say something under my breath and I guess she heard me, she eventually asked but we, of course wanted a bigger table... - one star\n\nNow we're seated at our table and we all opt for seafood dishes as it was holy week.  My cousin and I decided to get the J ramen (I think that's the name), it's spicy with, well, it should have shrimp and salmon.  So we're waiting for someone to take our order.  I notice two parties come in after us and they have their orders taken before we do.  I flag one of the waiters who was bussing off a table and he ignores me and continues setting up a freaking table... - one star\n\nEventually we place our orders and one of our appetizers comes, the octopus dumplings.  It's pretty good. The waiter offers us small plates and acknowledges that we have another appetizer coming. So now, I'm like, \"OK, he's going to get a couple brownie points for that one\".  Our main dishes arrives. My husband has the shrimp curry and my cousin and I have ramen.  I'm mixing all the goodness in my bowl and notice there's NO salmon.  My cousin doesn't have any either.  The salmon was replaced by 2 small clams and mushy tofu.  Geez, the waiter could have told us... - one star (actually this should be - two stars)\n\nEventually we realize that we didn't get the agedashi tofu so we ask.  In a minute, it comes out.  The tofu is sticking together which means it's been sitting out for sometime now... -one star\n\nAt this point, we all just want to go home.  I'm partly embarrassed because here I am showing my cousin around the city, it was her first time here, we're having a great time and earlier that day she says she loves it here but then we decide to eat at this place, everything just goes downhill from there. We decide not to leave a tip because they didn't deserve it.  As we were walking towards the bathroom which is around the corner, the waiter comes up running and asks, \"was there a problem?\"  I don't hesitate and tell him.  All he says, \"OK, I just wanted to know.\"  Not even an apology.  HORRIBLE SERVICE!!!", "rating": 1, "date": "2012-04-13"}, {"excerpts": ["Me and my sis got the Agedashi Tofu, Takuwan, the Butter Corn Ramen and Spicy Negi Ramen. ", "Originally we wanted to eat the takoyaki but the waitress seems to mistook or odered for the Takuwan( Its kinda silly considering Takoyaki is way different than Takuwan) ", "Perhaps they misunderstood the first syllable of the word? ", "HMMMM.........", "So i guess service wise", ", it wasnt that good. ", "But the food saved this place. ", "I liked my butter corn ramen, the Agedashi Tofu was crispy and hot, and the Takuwan which we didnt even consider was pretty good! \n\n"], "author": "Cavin T.", "review": "Came to this place at 6.45 pm and waited till 7.30 pm.......HMM they certainly have a weird waiting list system. They allow people who doesnt show up who made the reservation ahead of those who showed up and waited the entire time. Somehow thats just weird. \n\nMe and my sis got the Agedashi Tofu, Takuwan, the Butter Corn Ramen and Spicy Negi Ramen. Originally we wanted to eat the takoyaki but the waitress seems to mistook or odered for the Takuwan( Its kinda silly considering Takoyaki is way different than Takuwan) Perhaps they misunderstood the first syllable of the word? HMMMM.........So i guess service wise, it wasnt that good. But the food saved this place. I liked my butter corn ramen, the Agedashi Tofu was crispy and hot, and the Takuwan which we didnt even consider was pretty good! \n\nSuzu noodle is pretty small, so I reckon they might want to expand the place to get more profit, but overall since the food was decent, id give this place 3 stars!", "rating": 3, "date": "2012-06-03"}, {"excerpts": ["We also ordered a side of agedashi.  ", "Like the ramen, it's beautifully presented.  ", "The order comes with four small squares of lightly fried tofu.  ", "The texture is perfectly silky.  "], "author": "Carol L.", "review": "I have been looking forward to starting off my trip to SF with a stop at Suzu!  Met up with a couple of friends, and with my suitcase in tow, we came here for dinner.  This place is small and sits at the entrance to a small mall in Japantown.  There are only 8 tables inside and two outside in the hallway, so the wait is unavoidably long.  Fortunately, we only had a half hour wait.\n\nThe three of us had the Spicy Mabo Ramen.  Theirs is the best I've had so far.  The broth is very flavorful, the noodles are a bit thicker than other places and al dente.  It's all nice and spicy too, so make sure you have some water or tea to help you out.\n\nWe also ordered a side of agedashi.  Like the ramen, it's beautifully presented.  The order comes with four small squares of lightly fried tofu.  The texture is perfectly silky.  It comes topped with green onion, minced daikon radish and ginger, and sits in a light broth.\n\nWhile the posted hours indicate that Suzu closes at 9:30 pm, we saw that they turned away a customer a little after 9 pm?!  They are not open on Tuesdays.", "rating": 5, "date": "2009-06-26"}, {"excerpts": ["As for appetizers, the potato croquette is nice due to it's nice crispy outside and creamy center, the vegetable tempura is a good choice as well since it has a variety of items, however the agedashi tofu wasn't too great.\n\n"], "author": "Patrick L.", "review": "Good service, small place, okay food.\n\nI'd recommend the suzu ramen since it has the same broth as the chiashu and karaage ramen, but comes with both meats in it. The noodles are great, they have a nice bouncy texture when you chew them. \n\nThe broth however isn't the best. It's not cloudy... and it lacks any sort of depth. I think they also use too much pickled bamboo shoots as well. The egg is hard boiled and not soft boiled, which is unfortunate. The chiashu is very lean and a little on the dry side.\n\nAs for appetizers, the potato croquette is nice due to it's nice crispy outside and creamy center, the vegetable tempura is a good choice as well since it has a variety of items, however the agedashi tofu wasn't too great.\n\nOver all this place is convenient if you're going to the other shops in the konikuniya shopping mall or the movies, but probably not worth making a trip just to try it alone.", "rating": 3, "date": "2011-12-27"}, {"excerpts": ["We got the agedashi toshu, croquette, Karaage ramen with spicy, spicy ramen and Suzu ramen combo with curry.  ", "Everything was good. "], "author": "Carol K.", "review": "I havent' been to Suzu in awhile.  I went with my husband and a friend.  I remember the last time we were there, the ramen was just okay.  This time we went for dinner on Wednesday, the experience was pretty good.  \n\nWe got the agedashi toshu, croquette, Karaage ramen with spicy, spicy ramen and Suzu ramen combo with curry.  Everything was good. Everyone left happy and full.\n\nI have to go back another time to make sure it is consistenly good. hehe. Will definitely be back.", "rating": 4, "date": "2011-09-09"}, {"excerpts": ["Agedashi Tofu appetizer was small, but tasty. "], "author": "3beeskitchen ..", "review": "For the price, the portions are a wee-bit small. The broth was good, their curry is scrumdiddlyumptious and the ramen noodles were decent. Agedashi Tofu appetizer was small, but tasty. We also ordered a side of Curry $5 (VERY SMALL) and a side order of Chicken Kaarage (Also VERY SMALL).\n\nTHEY DO NOT DO TO-GO ORDERS \n\nWeird? Very. Service was not great and the ramen was good, but didn't live up to its' hype.", "rating": 3, "date": "2013-02-07"}, {"excerpts": ["But the bf thought it was too expensive--$40 for two bowls of noodles, a beer, and the agedashi tofu appetizer.  ", "I'd go back again."], "author": "C L.", "review": "I liked it, the ramen noodles were yummy, firm yet not too firm.  I had it with the tonkatsu, which was very tasty with just a hint of ginger.  But the bf thought it was too expensive--$40 for two bowls of noodles, a beer, and the agedashi tofu appetizer.  I'd go back again.", "rating": 2, "date": "2012-06-25"}, {"excerpts": ["The other thing I don't ever pass up here is their agedashi (fried tofu).  ", "They are probably the best agedashi I had here in SF.    \n\n"], "author": "Chris C.", "review": "My 200th review (after being MIA for like a year.) is my favorite ramen place in Japantown.  Having coming back from a recent trip to Tokyo and having my best bowl of ramen ever in my life in Ropponggi Hills area,  its safe to say that I know what good ramen taste like.   Suzu comes really close to the ramen I had in Tokyo,  nice aldente ramen noodle, just the right amount of broth flavor to each bowl and just right amount of meat and veggies to fill you up.  I eaten almost everything on the menu and to date my favorite has been the mabo ramen,  just the right amount of heat and great spicy broth.  The other thing I don't ever pass up here is their agedashi (fried tofu).  They are probably the best agedashi I had here in SF.    \n\nService can be spotty at times but for the most part it is nice enough but I mainly come here for the ramen and willing to deal with spotty service.  Too bad so many people have found out about this place and now the waits are worse now.  Bah!   Oh wells.  \n\nSo people can you guys  just stay away from here so I can get to my bowl of ramen quicker....pretty please?", "rating": 5, "date": "2009-06-14"}, {"excerpts": ["The agedashi tofu was really good with a yummy broth and ginger shavings.  ", "I will be coming back again, yay!!!"], "author": "Akemi O.", "review": "Ok I ate here again on Mon.  The miso ramen was so much better than the last review I gave it.  Super flavorful and had ample chashu and toppings.\nThe broth was very rich and delicious :)  I wonder if they changed owners again?? The agedashi tofu was really good with a yummy broth and ginger shavings.  I will be coming back again, yay!!!", "rating": 4, "date": "2010-07-27"}, {"excerpts": ["We ordered the ramen along with the chicken kaarage & agedashi tofu.  ", "Once again, not too impressed."], "author": "Stacey L.", "review": "Kevin felt like ramen for lunch and wanted to try this ramen house.  Little did he remember that we had eaten here before.  So I reminded him that he wasn't too fond of the food the last go around.  When we got there we signed our names on to the wait list and waited about 15 min for a table.  We ordered the ramen along with the chicken kaarage & agedashi tofu.  Once again, not too impressed.", "rating": 2, "date": "2011-02-27"}, {"excerpts": ["We also got the agedashi. ", "It was OK. ", "I think I'm going to give up on the quest to find a better agedashi than gombei. "], "author": "Tray I.", "review": "After much ado, I finally came here to check out one of the \"best\" ramen places in sf. *sigh* I'm still searching. \n\nThe noodles are gummy. I don't really like this texture in my noodles, but my friend who went with me did. So to one his own. It wasn't so gummy that you could taste flour or that it would remind you of an italian pasta, but it is a gummy noodle. This is probably my one and only gripe that doesn't make this a great noodle shop. But to one his own, again, my friend thought it was great. \n\nThey have mapo ramen! Yum. I like my mapo ramen with a thicker soup (just like I like my curry udon with a thick soup) but if you can't have the real thing, I'm happy to have something in the same arena. There isn't much tofu in this mapo which was also disappointing. But th soup is very good. Just spicy enough to remind you that you're eating mapo but not overwhelming. Also not super oily. Very tasty. \n\nWe also got the agedashi. It was OK. I think I'm going to give up on the quest to find a better agedashi than gombei. Nothing seems to compare. \n\nWill I be back? Yes! Not for their ramen, but to try the karaage curry. That just sounds so delicious. Also, I'll be back on a really hot day for the soba which I almost got, but it was a chilly night and I wanted something to warm me up. \n\nPrice was also reasonable. I'm not sure what people are expecting to pay for ramen but for being under 10 bucks, this is a pretty decent price.", "rating": 3, "date": "2008-05-30"}, {"excerpts": ["Gyoza can sometimes be a little burned and the agedashi tofu was a little bland. ", "Its a small restaurant and fairly popular so be prepared to wait especially on weekends. ", "They do one thing well and that is the ramen."], "author": "Belle Madamoiselle Z.", "review": "Overall my favorite ramen house in bay area so far. Ramen is always tasty, my favorite is the spicy Mabo ramen with tofu. Gyoza can sometimes be a little burned and the agedashi tofu was a little bland. Its a small restaurant and fairly popular so be prepared to wait especially on weekends. They do one thing well and that is the ramen.", "rating": 4, "date": "2011-07-14"}, {"excerpts": ["I got the Spicy Ramen, extra spicy with agedashi tofu for an appetizer. ", "The agedashi was nice, better than some other places I've had it, but not as good as Sushi Koko's. ", "The spicy ramen was spicy, but not spicy enough, even at extra spicy. ", "The broth was good, tho; nicely flavorful without being salty or too heavy. ", "The spice gave it heat, but didn't provide much else which made me sad. ", "The toppings were standard: chashu, seaweed, bamboo, green onion and tea (?) egg. ", "The chashu was all right, but the egg was over done. ", "I prefer it a little softer boiled. ", "The noodles were nicely firm with a good chew to them. ", "Oh, and the bowls are BIG. ", "It was a satisfying meal, but not one I would brave the parking hunt around Japantown for."], "author": "Myrna A.", "review": "This place is decent, tho I don't think I would stand in line unless the wait was really short. I got the Spicy Ramen, extra spicy with agedashi tofu for an appetizer. The agedashi was nice, better than some other places I've had it, but not as good as Sushi Koko's. The spicy ramen was spicy, but not spicy enough, even at extra spicy. The broth was good, tho; nicely flavorful without being salty or too heavy. The spice gave it heat, but didn't provide much else which made me sad. The toppings were standard: chashu, seaweed, bamboo, green onion and tea (?) egg. The chashu was all right, but the egg was over done. I prefer it a little softer boiled. The noodles were nicely firm with a good chew to them. Oh, and the bowls are BIG. It was a satisfying meal, but not one I would brave the parking hunt around Japantown for.", "rating": 3, "date": "2011-03-23"}, {"excerpts": ["good appetizers, the agedashi is not too bad and the karaage chicken is very nice, one of the better ones out there.  ", "the curry is just out of the bag, like a lot of places that have curry but dont specialize in it.  "], "author": "Junglist S.", "review": "suzu is one of our \"go-to\" places in the mall for ramen.\n\nmy recent favorite is the Hiyashi Chuka.  cold ramen in a sweet soy vinegar sauce, with salad tempura sliced bits of stuff and karaage chicken.  sooooo good!  i could eat that everyday almost.\n\ntheir tempura is very nice.  its hard to get good tempura, its a delicate art.  theirs is pretty good.  good appetizers, the agedashi is not too bad and the karaage chicken is very nice, one of the better ones out there.  the curry is just out of the bag, like a lot of places that have curry but dont specialize in it.  but its tasty, and paired with some cold soba is a nice meal.\n\nso bottom line is that its one of the better ramen places in japantown, taking into consideration the quality, variety, price and portions.  sometimes the service can be slow but whatever.\n\nFYI - this place is at the bottom of the stairs, down from the bookstore/crepe place.\n\nFYI - my \"go-to\" curry place is On The Bridge.", "rating": 4, "date": "2006-07-24"}, {"excerpts": ["Chicken karaage and agedashi tofu appetizers are good.  ", "Almost always long lines ", "but at least they quickly take your order and serve you.  ", "Combos are good deals.  "], "author": "L S.", "review": "My wife and I love the spicy negi ramen.  Noodles are fresh and broth is great.  Chicken karaage and agedashi tofu appetizers are good.  Almost always long lines but at least they quickly take your order and serve you.  Combos are good deals.  Tried nabeyaki udon once which was just okay, so now I just stick with spicy negi ramen.  Service for tea refill and water can be iffy.  No options for different types of broth.", "rating": 4, "date": "2009-12-01"}, {"excerpts": ["Oh, had the Agedashi as a starter, and it was OK. ", "As I was fleeing the restaurant, I noticed that Bushi-Tei Bistro next door serves ramen with a choice of side dish for much less $ than Suzu. ", "This was such a negative experience that I joined yelp to review the place and to save others from the mouth burning torture."], "author": "Dedicated E.", "review": "Went back to Suzu yesterday. First time in over a year. Always liked their ramen. Something has changed. Well, the service has always been neutral to indifferent, so that's the same. Tried to order the Chashu Ramen and was told they were out of Chashu (odd, since that's like one of the main varieties of ramen noodles, but OK) so ordered the Spicy Ramen. Holy Mother of Ramen! The broth was so spicy, it was inedible! Diners at next table noticed that I was STRUGGLING with the soup and commented! Did the kitchen accidentally give me double dose of spicy?! I can handle spicy, but not this one. I should have said something, but sometimes I wimp out and hate myself for wimping out. But, that's what I did. (OK, maybe I could have said something but just got the feeling the waitress wouldn't really care. That's my interpretation though.)  I don't think I will return. Oh, had the Agedashi as a starter, and it was OK. As I was fleeing the restaurant, I noticed that Bushi-Tei Bistro next door serves ramen with a choice of side dish for much less $ than Suzu. This was such a negative experience that I joined yelp to review the place and to save others from the mouth burning torture.", "rating": 2, "date": "2009-09-24"}], "tuna and salmon sashimi": [], "tenzaru udon": [], "tororo soba": [], "udon": [{"excerpts": ["I ordered the combination which included the hot udon noodle and a small bowl of chicken curry donburi.   ", "The soup broth of the udon is probably one of the best I ever had in the city.   ", "Great for a cold San Francisco day or when you are trying to recover from a cold.....so tasty.     "], "author": "Lawrence L.", "review": "Cozy Noodle House located below the bookstore in the Japan Town Center.     The restaurant offers indoor and outdoor seating.  The outdoor is actually still inside the shopping center so there is a cover and you can bring your pets.\n\n\nThe menu offers a wide variety of ramen, rice dishes and other noodle dishes.  I ordered the combination which included the hot udon noodle and a small bowl of chicken curry donburi.   The soup broth of the udon is probably one of the best I ever had in the city.   Great for a cold San Francisco day or when you are trying to recover from a cold.....so tasty.     Same with the curry sauce over rice.....nice texture.\n\nLove this place, 2 thumbs up for Suzu!!!!", "rating": 5, "date": "2018-10-17"}, {"excerpts": ["Ordered the Cha Shu Udon with the Shoyu base which was just perfect. "], "author": "Kath H.", "review": "Ordered the Cha Shu Udon with the Shoyu base which was just perfect. The broth was hearty but light (my favorite) and the Cha Shu was not too fatty, which I loved. \n\nThe service was efficient, friendly and the food came out really quickly. \n\nDefinitely coming back for more!", "rating": 5, "date": "2018-10-14"}, {"excerpts": ["They serve ramen, udon, and rice dishes. ", "Our table ordered some of each. ", "For a few more dollars you can add a don to your noodle dish. ", "I ordered the beef udon hot pot.\n\n", "My beef udon was not that great. ", "The noodles, veggies, and broth were good but the beef was gross. ", "It had a slimy film on it. ", "I think it was supposed to be stewed in some sort of brown sauce, but it only made it soggy. ", "The taste was even worse. ", "It had a distinct freezer taste. ", "I left most of it in the bowl and just ate the veggies."], "author": "Junella T.", "review": "Man I really wanted to love this place but my experience was so meh I don't think I'll be back especially with so many choices in Japantown. \n\nCame here on a Friday night and everywhere was packed. The wait for this place wasn't that bad. Maybe about 20 mins. The menu is pretty standard. They serve ramen, udon, and rice dishes. Our table ordered some of each. For a few more dollars you can add a don to your noodle dish. I ordered the beef udon hot pot.\n\nThe food came out at different intervals so we had to wait a bit. The ramen was the last thing that came out. My beef udon was not that great. The noodles, veggies, and broth were good but the beef was gross. It had a slimy film on it. I think it was supposed to be stewed in some sort of brown sauce, but it only made it soggy. The taste was even worse. It had a distinct freezer taste. I left most of it in the bowl and just ate the veggies.", "rating": 3, "date": "2018-01-06"}, {"excerpts": ["Got the meat udon and shrimp tempura udon . ", "It was fast and the udon noodles tasted like store bought. ", "Nothing impressive... wouldn't come here again for udon, maybe the ramen is better? \n\n"], "author": "Melanie T.", "review": "Got the meat udon and shrimp tempura udon . It was fast and the udon noodles tasted like store bought. Nothing impressive... wouldn't come here again for udon, maybe the ramen is better? \n\nI would compare this place to fast food noodles. Nothing fancy or out of the ordinary. They", "rating": 2, "date": "2018-02-04"}, {"excerpts": ["I had the Nebayaki Udon and my boyfriend had the Ebi Curry Rice. \n\n", "Nebayaki Udon - You can get it with Miso (chicken and pork broth) or Shoyu (fish broth) ", "I opted for the Miso hoping for more flavor. ", "The broth was indeed very flavorful, maybe a little too salty at times. "], "author": "Kelly N.", "review": "My boyfriend and I came here on a Saturday afternoon trying to catch the second round of lunch around 1pm. We put our names down and had to wait 20 min to get seated, but that's pretty typical for restaurants in Japantown on the weekends. \n\nI had the Nebayaki Udon and my boyfriend had the Ebi Curry Rice. \n\nNebayaki Udon - You can get it with Miso (chicken and pork broth) or Shoyu (fish broth) I opted for the Miso hoping for more flavor. The broth was indeed very flavorful, maybe a little too salty at times. The portion size was on the small size but perfect for me. \n\nEbi Curry (comes with miso soup and salad) The dish came with four large pieces of fried shrimp. The curry was a little too sweet for my taste but it was alright. The portion size was also perfect for him. Not the most amazing curry though. \n\nThe service was very good. They had a lot of waitresses working this day so we were easily helped. I think this was overall an average experience. There's definitely better options in Japantown but this did its job.", "rating": 3, "date": "2017-12-11"}, {"excerpts": ["It's a comfortable little eatery serving classic udon & soba noodle soups, nabeyaki & other Japanese mains, like katsu, teriyaki, etc. ", "I've been coming here for years ", "and it's mainly because it's away from all the heavy foot traffic from the other eateries ", "and it's probably the best bang for your buck too. ", "I particularly love their combo specials. ", "The specials consist of a choice of noodles and a mini entree. ", "On my last visit I chose the house ramen in shoyu based broth & chicken katsu don over warm rice. ", "Miso soup and matcha tea included too. ", "The combo deals never fails me. "], "author": "Eric R.", "review": "*I went seeking love*\n*kept looking outside myself*\n*found it here inside*\n\nSelf Love - Japanese Haiku\n\nI love things Japanese. From antique ukiyo-e to silk kimonos, from century-old bonsai trees to karate, from zenism to godzilla, from haiku to kawaii, and of course the foods! Japantown in San Francisco is one of my stops when I'm in the Richmond district. I love the shops, the aura, the restaurants. In Japantown you can eat almost anything Japanese, from low-grade refrigerator bentos to high-end sushi. It's always happening in J-town. So many choices, but one steady I have is a noodle spot located away from the other mall restaurants. It's on the Kinokuniya side of foot traffic, on the lower level next to the garden store. This little spot is called...\n\nSuzu Noodle House\n\nIt's a comfortable little eatery serving classic udon & soba noodle soups, nabeyaki & other Japanese mains, like katsu, teriyaki, etc. I've been coming here for years and it's mainly because it's away from all the heavy foot traffic from the other eateries and it's probably the best bang for your buck too. I particularly love their combo specials. The specials consist of a choice of noodles and a mini entree. On my last visit I chose the house ramen in shoyu based broth & chicken katsu don over warm rice. Miso soup and matcha tea included too. The combo deals never fails me. Especially knowing I'll have enough yen for dessert elsewhere. \n\nSuzu Noodle House \n\nIn a weird way you could say it's my semi-secret hidden gem in busy Japantown. It's never too busy here, unless it's movie night next door then you might wait. It also reminds me of my visits in Tokyo where many customers eat and go - so even if there's a wait it clears up pretty quick. Great spot for a solo ninja or a couple in adolescent love.", "rating": 4, "date": "2017-10-07"}, {"excerpts": ["Their menu is pretty limited to ramen, udon, and curry bowls. ", "I would not go here if you were not in the mood for any of those because you will be disappointed. ", "My mom and my grandpa got ramen bowls "], "author": "Tiffany V.", "review": "Never heard of this place but there was a pretty substantial line outside on a Saturday afternoon. I was with my mom and grandma and we were trying to figure out where to get lunch. I saw they had only okay reviews on Yelp and a food safety warning but figured it must be good if there was a line while other restaurants sat empty. \n\nWe waited about 10 minutes and got a table by the kitchen. Their menu is pretty limited to ramen, udon, and curry bowls. I would not go here if you were not in the mood for any of those because you will be disappointed. My mom and my grandpa got ramen bowls and I got their shrimp curry. \n\nTheir portions are HUGE. I wish we just shared a dish instead because none of us finished our orders. It was the biggest curry bowl of my life and came with salad and soup. They give you this really interesting deep fried pile of veggies that I've never seen before. Not even sure really what it is as the menu didn't list it in the description but I think it was onions and carrots. It also comes with my favorite Japanese pickles. \n\nRamen bowls are also huge. Spicy ramen was not super spicy. Price is so cheap for the amount of food you get. Everything priced around $10.", "rating": 4, "date": "2018-03-26"}, {"excerpts": ["I definitely will be coming back just for the Curry and perhaps will give the Udon noodles a try too!"], "author": "MyTien P.", "review": "I was having a huge craving for some spicy curry and my friend who resides in Japantown highly recommended Suzu Noodle House. He loves coming here whenever he's feeling lazy and doesn't want to venture too far for some decent quality Asian food. I'm glad he took me here because I really enjoyed every dish we ordered!\n\nBetween the two of us, we ordered a bowl of Spicy Chashu Ramen and the Chicken Katsu Curry. The Curry was amazing and best I've had yet in San Francisco, even better than Volcano Curry House in the Inner Richmond. I couldn't get enough and it was my favorite dish of the night. The Ramen was also tasty and good for a cold day in SF, but overall I got tired of it after a few bites and found the broth to be pretty oily.\n\nI definitely will be coming back just for the Curry and perhaps will give the Udon noodles a try too!", "rating": 4, "date": "2017-08-20"}, {"excerpts": ["Had the udon with veggie tempura and added the chicken katsu.  ", "We also ordered the gyoza and the Suzu style ramen.\n", "The gyoza were large and packed with flavor but as others have also written, the shape is a bit odd.  ", "Who cares though?  ", "They were delicious.\n", "I really enjoyed my udon ", "and it's broth.  ", "Not sweet at all but heartily flavorful.\n", "The katsu was served over rice and was a nice addition as my choices were non-meat choices.  ", "The sliced and breaded chicken breast was moist and full of flavor.\n", "My \"little brother\" ordered the Suzu ramen and loved it--just a note here --it is presented in a miso broth.  "], "author": "Thomas D.", "review": "Loved it.  Had the udon with veggie tempura and added the chicken katsu.  We also ordered the gyoza and the Suzu style ramen.\nThe gyoza were large and packed with flavor but as others have also written, the shape is a bit odd.  Who cares though?  They were delicious.\nI really enjoyed my udon and it's broth.  Not sweet at all but heartily flavorful.\nThe katsu was served over rice and was a nice addition as my choices were non-meat choices.  The sliced and breaded chicken breast was moist and full of flavor.\nMy \"little brother\" ordered the Suzu ramen and loved it--just a note here --it is presented in a miso broth.  And, it's a large serving--he is going to try something more soy based next time.\n\nService was great. We were seated and served very quickly.\nClap! Clap! Clap!", "rating": 4, "date": "2017-06-27"}, {"excerpts": ["Prices are fair, and if you love ramen/udon soup then this is the place for you in Japan Town. ", "The sizes are huge and the quality is right up there with that of the soups of Tampopo.  "], "author": "Benny H.", "review": "I've been coming to Japan Town since I was a wee lad, and I've always seen this place as one of the most busy locations in Japan Town.  Even with that soaring popularity we never tried it out. Well that was rectified yesterday! \n\nYou put your name on a list and hope for the best.  The wait wasn't that long, but depending on the list it can be a long wait, as this place isn't the largest.  Prices are fair, and if you love ramen/udon soup then this is the place for you in Japan Town. The sizes are huge and the quality is right up there with that of the soups of Tampopo.  Again, the place is really small so expect to bump into the tables next to you. \n\nOverall, it was  a great experience, and would probably try this place again at some point.", "rating": 4, "date": "2017-02-20"}, {"excerpts": ["I asked the waitress if the cold udon comes with dipping sauce and she hesitantly answered yes. ", "Then when another waitress brought the order, it was cold soba. ", "I informed the waitress that I ordered the cold udon, not cold soba, and she seemed confused and she went to ask the original waitress, and then realizing the mistake, I heard her said, ", "\"$hit.", "\" \n", "The right order finally came, and the quality is mediocre at best. ", "This is not worth $10."], "author": "Michelle L.", "review": "I wished I had read the poor food safety alert before walking into this restaurant. I went there on a Thursday afternoon at around 3pm, and only a few people are seated. Despite that, service was slow. I asked the waitress if the cold udon comes with dipping sauce and she hesitantly answered yes. Then when another waitress brought the order, it was cold soba. I informed the waitress that I ordered the cold udon, not cold soba, and she seemed confused and she went to ask the original waitress, and then realizing the mistake, I heard her said, \"$hit.\" \nThe right order finally came, and the quality is mediocre at best. This is not worth $10.", "rating": 1, "date": "2018-04-19"}, {"excerpts": ["+Tempura Udon ($12.95): pretty standard udon, nothing too special.\n", "+", "Croquette Rice Bowl Add-On ($3.95?)", ": I appreciated that they had super cheap add-one available, which makes it good for sharing. ", "However I wouldn't get their croquettes. "], "author": "Helen W.", "review": "I was up in the Japantown area, and due to bad planning, the place we had wanted to go for lunch was closed that day. We ended up just looking on Yelp for someplace nearby, and Suzu had the most decent reviews.\n\nSuzu is located on the bottom floor of the West Mall. It was pretty much empty when we arrived, but there really wasn't anyone actively there to greet us. We stood around for a bit before someone finally came to seat us. Although I think one of the staff was on his lunch break.\n\nWe ordered:\n+Cha Shu Ramen ($11): i wasn't expecting much, and it wasn't amazing, but actually was a pretty solid Ramen. The broth was pleasant and not overly salty. They also gave a pretty generous portion of meat. My one complaint was that they pretty much just threw in a stalk of bokchoy (or some related veggie) that was uncooked and pretty gross.\n+Tempura Udon ($12.95): pretty standard udon, nothing too special.\n+Croquette Rice Bowl Add-On ($3.95?): I appreciated that they had super cheap add-one available, which makes it good for sharing. However I wouldn't get their croquettes. The insides somehow managed to be a watery consistency, and didn't have much flavor.\n\nIf you are planning to eat in Japantown, I would say Suzu Noodle is one of the better options available.", "rating": 3, "date": "2017-05-03"}, {"excerpts": ["I usually get their Nabe Yaki Udon with tempura on the side. ", "(be sure to tell them this if not your tempura will be placed in the soup =soggy tempura) "], "author": "Cyndi L.", "review": "Service: \nAll of the staff here is very polite and friendly. Always greet you with a smile and brings you water or tea as they seat you. \n\nFood: \nBest Karaage and Tempura! I usually get their Nabe Yaki Udon with tempura on the side. (be sure to tell them this if not your tempura will be placed in the soup =soggy tempura) Their curry dishes are also very good, but they give you a lot of curry sauce and rice but very little meat. \n\nCON:\nThere are no substitutions. If you don't like certain food, you can only remove them but can not add additional. Like I wanted to replace the Eggplant tempura with something else and the waitress said no, you can only remove no substituting. So pretty much, take it or leave it kind of situation.", "rating": 4, "date": "2017-06-20"}, {"excerpts": ["The menu is quite extensive, with tons of ramen options, and also options for soba, udon, nabeyaki, and rice bowls!\n\n", "I wouldn't necessarily go out of my way to come back here, but it does offer solid options for ramen, udon, and soba. ", "The wait also isn't that bad, especially when you can walk around Japantown while you wait!"], "author": "Jingxi Z.", "review": "Given the current state of the ramen scene in San Francisco, this place is not bad if you need to satisfy a ramen craving. That's just why I took my mom here on Sunday afternoon and boy was there a crowd of people waiting to eat here! \n\nThere were a bunch of parties ahead of us but thankfully the wait wasn't that bad, maybe around 30 minutes? The menu is quite extensive, with tons of ramen options, and also options for soba, udon, nabeyaki, and rice bowls!\n\nMy mom got the miso ramen and I opted for the Hiyashi Soba (cold noodles with assorted tempura and toppings). We also added on an unagi don and kakuni don to make both noodles a combo meal.\n\nThe food came out pretty fast and all the food we ordered was solid. I didn't find any of the food too special. The miso ramen soup tasted a little dull and the pieces of meat they added looked sad. My soba noodles tasted fresh and light, but again, nothing special.\n\nMy unagi don didn't come with too much unagi and it seemed they overcompensated for that by drenching it in sauce. My mom really enjoyed the kakuni don (braised pork or something like that) so would recommend that. Both dons were pretty small but I think they're supposed to just be a small little taste to compliment the noodles.\n\nI used to come here back in high school whenever I went to Japantown - it was the go-to ramen place! But I do think the quality has gone down since then. I wouldn't necessarily go out of my way to come back here, but it does offer solid options for ramen, udon, and soba. The wait also isn't that bad, especially when you can walk around Japantown while you wait!", "rating": 4, "date": "2017-06-20"}, {"excerpts": ["Their ramen and udon is above average. ", "This last visit, we had tempura udon and Ebi fry curry. "], "author": "Micki M.", "review": "Been here a number of times now and I think it's time for a review. \n\nTheir ramen and udon is above average. This last visit, we had tempura udon and Ebi fry curry. The portions were better than most eateries here in Japantown, which IMO tend to go by Japanese standards, which tends to be on the small side. \n\nOur food came out rather quickly and everything was cooked to perfection. The tempura was crispy and not greasy. The curry was good. The Ebi fry had Tonkatsu sauce on it, which I felt should have been left off and put on the side. The salad and miso soup was delicious, just wish that the miso soup had tofu in it. Although the place wasn't as busy as it is in the height of rush hour, I felt that the service lacked, which is why my review is one star shy!", "rating": 4, "date": "2016-06-13"}, {"excerpts": ["They are both mediocre, so if you're looking to have good noodles or udon, go somewhere else."], "author": "Yisha z.", "review": "My husband and I were so hungry the day we went in, we ordered a Suzu ramen and  a cha Shu ramen and I thought everything was supposed to tasted good when you're hungry but that's not the story here.  They are both mediocre, so if you're looking to have good noodles or udon, go somewhere else.", "rating": 3, "date": "2018-05-23"}, {"excerpts": ["has been nebayaki udon. ", "Ramen was average, all I remembered was lots of noodles that I couldn't finish. ", "Nebayaki udon has mixed vegetables and choice of meat served in a pot, with shoyu or miso base. ", "I liked the variety, and the beef was marinated and very flavorful. ", "Udon quality varied, it could be chewy or soggy. ", "Will come back for their nebayaki udon on a cold or windy day, it's not easy to find!"], "author": "Jaclyn C.", "review": "It's one of my go-to restaurants in Japantown. Most of the time there was no wait, but sometimes it was crowded when I walked by. Bunch of options, I've tried their ramen and my favorite has been nebayaki udon. Ramen was average, all I remembered was lots of noodles that I couldn't finish. Nebayaki udon has mixed vegetables and choice of meat served in a pot, with shoyu or miso base. I liked the variety, and the beef was marinated and very flavorful. Udon quality varied, it could be chewy or soggy. Also tried a little of karaage curry, generous portion with tempura vegetables on the side - pretty unique.\n\nTheir croquette as appetizer was pretty different from what I'm used to, it was mostly creamy. Wish they had this note on the menu.\n\nWill come back for their nebayaki udon on a cold or windy day, it's not easy to find!", "rating": 4, "date": "2016-05-22"}, {"excerpts": ["Suzu offers 17 different types of ramen, priced at $9.50 to $12.95 per bowl, and 4 different types of soba and udon noodles, priced at $8.95 to $11.95 per bowl. ", "In addition, they have $11.95 nabeyaki udon hot pots. ", "Nabeyaki udon is served inside a hot pot with ingredients like vegetables, tofu, seaweed, and egg. ", "My sister really likes the udon noodles served soba-style, meaning cold and with the dipping sauce on the side. ", "The thick noodles are served on a plate topped with shredded seaweed with a tiny clump of wasabi. ", "She's been getting this dish for years. ", "You can get udon or soba noodles served hot or cold and with sides like tempura.\n\n"], "author": "Daniel B.", "review": "I've returned to Suzu Noodle House a couple times since my last review, which I wrote almost six years ago. According to Joseph L, this place has changed owners, but I haven't noticed a difference. It doesn't seem like this restaurant has skipped a beat as it's been consistently busy the times I've visited or passed by walking around Japan Center. You still have to write your name on a waiting list outside. A server will call your party when an appropriate-sized table is ready.\n\nAs mentioned in my previous review, Suzu is located inside Miyako Mall at Japan Center in Japantown. It's just inside the Post St entrance near Webster St, on the ground level. The restaurant is small with seating for about 30 inside and about a half-dozen outside (in the mall) at three two-tops. I wouldn't come here with a group larger than 4 to 6 people. Even a party of 6 could be pushing it. Note there's an automatic 18% gratuity applied for parties of 5 or more. Reservations are not accepted.\n\nSuzu offers 17 different types of ramen, priced at $9.50 to $12.95 per bowl, and 4 different types of soba and udon noodles, priced at $8.95 to $11.95 per bowl. In addition, they have $11.95 nabeyaki udon hot pots. Nabeyaki udon is served inside a hot pot with ingredients like vegetables, tofu, seaweed, and egg. Aside from noodles, you can also get Japanese appetizers like agedashi tofu and takoyaki (fried octopus balls), most for about $6 or less per plate; various rice bowls (don) added as a side for $3-5 per bowl; and $10.95 plates of Japanese curry. Beverage-wise, a limited selection of beer, wine, and sake are available.\n\nGenerally, this is a quick, casual, and reliable Japanese restaurant. The food isn't going to knock your socks off, but it's been good every time I've had it. I consider it comfort food. This is one of my sister's favorite places to eat in Japantown.\n\nI noticed Suzu no longer has \"Tokyo Ramen\" on the menu, but it could've just been renamed. Two ramen have been marked off the menu. I tried the \"Suzu Ramen\" ($12.95, their most expensive ramen) on my last visit. It comes with two pieces of karaage (Japanese fried chicken) and gyoza (dumplings) plus corn, greens, chashu (braised pork), and half a boiled egg.\n\nYou can choose the broth on any of the ramen. They offer shoyu (soy sauce), miso, and shio (salt). They do not have tonkotsu. I had the shoyu broth with my Suzu ramen and the bowl was A-OK. The ingredients were fresh and the bowl was filling. It was far from the tastiest bowls of ramen I've had, but it wasn't bad either. The pieces of karaage and gyoza were nice and big. I'm not used to having pieces of karaage and gyoza floating around in my ramen soup and it worked out better than I expected. The outside of the karaage did get expectedly soggy though. Ultimately, I was satisfied.\n\nSince my original review, I've also tried the tonkatsu don add-on ($3) and it was delicious. It's a small version of tonkatsu (Japanese fried pork cutlet) with tonkatsu sauce on top, laid atop a bed of white rice inside a bowl. The tonkatsu was delectably crispy. It's kind of like schnitzel. The tonkatsu sauce is similar to Worcestershire sauce. Too bad they don't have a full-sized tonkatsu entree. I bet it'd be good.\n\nMy sister really likes the udon noodles served soba-style, meaning cold and with the dipping sauce on the side. The thick noodles are served on a plate topped with shredded seaweed with a tiny clump of wasabi. She's been getting this dish for years. You can get udon or soba noodles served hot or cold and with sides like tempura.\n\nService is speedy. Orders come out from the kitchen in a reasonable amount of time and waiting for a table still doesn't take more than 10 to 15 minutes. Restrooms are located around the corner, across from the toy store (Japantown Collectibles).", "rating": 4, "date": "2016-02-15"}, {"excerpts": ["Their udon has no bite whatsoever. ", "I'd thought they got the package from supermarket and MESSED IT UP! ", "Save yourselves and go anywhere else with lesser wait."], "author": "Joy F.", "review": "Ok. Truly truly, Japan towns food hasn't been known to impress already. However, this place was packed every time I swing by I thought for sure they are decent. Nope. Wrong. Their udon has no bite whatsoever. I'd thought they got the package from supermarket and MESSED IT UP! Save yourselves and go anywhere else with lesser wait.", "rating": 2, "date": "2018-02-19"}, {"excerpts": ["but I changed it up and ordered some Tempura Udon. ", "I seen a lot of complaints of how long it takes to get food here ", "but it was fast for me. ", "A good soup starts with the broth ", "and I thought it was a little off. ", "I didn't really want to eat/drink the broth. ", "The noodles were good, but its hard to mess up udon noodles, but on the other hand the Tempura shrimp and veggies were delicious. ", "So know I'm thinking to myself ", "I shoulda just ordered Tempura by itself. ", "But the pictures of the soup tricked me! "], "author": "Arron E.", "review": "All these years I've been going to Japantown and never tried this place. So I bring some soup lovers on a weekday so it wasn't busy when I came in. I don't really like going to a restaurant and having my entree be a soup but I changed it up and ordered some Tempura Udon. I seen a lot of complaints of how long it takes to get food here but it was fast for me. A good soup starts with the broth and I thought it was a little off. I didn't really want to eat/drink the broth. The noodles were good, but its hard to mess up udon noodles, but on the other hand the Tempura shrimp and veggies were delicious. So know I'm thinking to myself I shoulda just ordered Tempura by itself. But the pictures of the soup tricked me! My company ordered ramen, 2 ordered spicy ramen which wasn't spicy at all, 1 ordered a pork belly ramen and all 4 soups underwhelmed us. \n\nMaybe the buzz here is the prices on the food? I mean you can get a small rice bowl on the side for 3 bucks with a soup. You can sucker me with that offer.", "rating": 3, "date": "2015-10-01"}, {"excerpts": ["We ordered spicy ramen, nabeyaki (udon noodles with tempura), fried baby tako (octopus), and unagi don. ", "The spicy ramen was oily, nabeyaki noodles were ok but not the best, the octopus was way too greasy, and the unagi don's rice was undercooked. ", "I would not recommend this place."], "author": "Jade C.", "review": "Rating: 2.5 (Closer to 2 though)\n\nWe were at Japantown and decided to try this place since we've pretty much tried every other place at J-town. First of all, there was a waitlist with a few people ahead of us. We were seated in about 10 minutes. We ordered spicy ramen, nabeyaki (udon noodles with tempura), fried baby tako (octopus), and unagi don. The spicy ramen was oily, nabeyaki noodles were ok but not the best, the octopus was way too greasy, and the unagi don's rice was undercooked. I would not recommend this place.", "rating": 2, "date": "2017-07-04"}, {"excerpts": ["Friends seemed to like ramen and various udon dishes. ", "Perfectly satisfactory, but wouldn't go out of my way to return."], "author": "Shendi X.", "review": "There aren't too many places in J-town I rave about, and this was about the same - had a good curry, but nothing stand-out. Generous portion of chicken; same with rice. Friends seemed to like ramen and various udon dishes. Perfectly satisfactory, but wouldn't go out of my way to return.", "rating": 3, "date": "2017-02-19"}, {"excerpts": ["I think this place tries to provide variety in noodles (hence the name) by offering soba, udon, and ramen, but doesn't really excel at any of those."], "author": "Mengo Z.", "review": "It pains me to give this review as the waitresses are nice, patient when explaining the menu and fairly attentive. But the ramen is NOT GOOD.  We originally came to Japantown to try out another popular ramen place upstairs, but due to the crazy lines and our hangry state, we decided to look elsewhere and Suzu looked decent (from an initial glance at the Yelp reviews).  While the servings are pretty generous, they leave a lot to be desired in the taste department.\n\nDown to the actual food:\n- Chicken Karaage (3 stars): 5 bulky pieces of chicken that I was not entirely sure whether they were cooked long enough (would have preferred them much smaller) and the side salad was drenched in dressing.  A lemon slice on side would have been nice.\n- Gyoza (2 stars): 4 pieces of super bland, oily, misshapen gyoza and weak dipping sauce.  Very likely that these were previously frozen.\n- Ramen (miso): I'm a huge ramen aficionado, so I have fairly high standards.  The way I think of it, I'm downing something pretty unhealthy so I might as well really enjoy it!\n-- broth (1 star): wow where to start. the broth was super duper oily and lacked any sort of flavor. I barely sipped any of it, and even the spicy sauce on the side didn't help.  You could look at the bowl from the top and see a thin layer of oil across the top.\n-- pork belly (4 stars): the saving grace of this ramen place.  Unlike other places where pork belly is thinly sliced, this place had huge chunks of pork belly which actually really hit the spot.\n-- noodles (3 stars): your standard ramen noodles, pretty chewy but nothing to write home about\n-- toppings (2 stars) - comes with half of a hard-boiled egg, and that's it, all other toppings cost extra, whereas I'm used to other ramen places throwing in a sheet of nori or some sliced bamboo.  I ordered a shrimp tempura on the side which tasted like it was fried while frozen (soggy meat inside). \n\nI think this place tries to provide variety in noodles (hence the name) by offering soba, udon, and ramen, but doesn't really excel at any of those.", "rating": 3, "date": "2017-09-28"}, {"excerpts": ["The menu is pretty straightforward: appetizers, udon/soda, combo add-on options and ramen. ", "No tonkotsu ramen here ): ", "I ordered the mixed tempura appetizer ($7.90) and the spicy miso ramen ($10.95). ", "I enjoyed the tempura more than the ramen. ", "The tempura came out hot and crispy, and it's a pretty big plate! ", "You get 2 of the following: shrimp, kabocha, broccoli, carrot, potato, and then 1 eggplant and zucchini slice. ", "Yum! ", "The spicy miso ramen was just an average bowl of noodles. ", "The soup had okay flavor (there was a hint of acidity?) and a nice kick but nothing crazy spicy. ", "There's a serious lack of toppings and the ones included were mediocre: one leaf of what I think was bok choy, half a hard boiled egg, a single sad sad slice of chasu, green onions, some bamboo shoots, and then a shit ton of bean sprouts!! ", "I love bean sprouts ", "but wow. ", "So much. ", "As for the noodles, they were good and al dente. "], "author": "Doris K.", "review": "There's better ramen elsewhere in Japantown (Waraku, Ramen Yamadaya). \n\nMy friend and I stopped by on a Wednesday afternoon around 4ish and were seated right away. Given the random timing, it's not surprise the restaurant was fairly empty. Overall service was nice and the staff was super attentive to the water level in our cups. As soon as we were almost done, someone would come by and refill! There were also already menus and utensils at the table, which is always nice. I don't know about you, but I hate being seated only to have to wait for someone to bring a menu.\n\nThe menu is pretty straightforward: appetizers, udon/soda, combo add-on options and ramen. No tonkotsu ramen here ): I ordered the mixed tempura appetizer ($7.90) and the spicy miso ramen ($10.95). I enjoyed the tempura more than the ramen. The tempura came out hot and crispy, and it's a pretty big plate! You get 2 of the following: shrimp, kabocha, broccoli, carrot, potato, and then 1 eggplant and zucchini slice. Yum! The spicy miso ramen was just an average bowl of noodles. The soup had okay flavor (there was a hint of acidity?) and a nice kick but nothing crazy spicy. There's a serious lack of toppings and the ones included were mediocre: one leaf of what I think was bok choy, half a hard boiled egg, a single sad sad slice of chasu, green onions, some bamboo shoots, and then a shit ton of bean sprouts!! I love bean sprouts but wow. So much. As for the noodles, they were good and al dente. They give A LOT of noodles. \n\nGiven that there are much alternatives, I won't be back =/ Glad to have tried it and crossed it off my list haha", "rating": 3, "date": "2016-04-20"}, {"excerpts": ["They also can use the veggie broth for any Udon or Soba Noodle dishes.\n\n"], "author": "Lanie L.", "review": "Tucked away in a small corner of Japantown's main shopping center, across from a shop that sells \"NEAT ASIAN THINGS\" is a small ramen restaurant that has veggie options!\n\nGoing around Japantown can be a chore when you're hungry and an herbivore, but Suzu not only has a great selection of ramen, but provides a vegetarian option as well!\n\nThey also can use the veggie broth for any Udon or Soba Noodle dishes.\n\nThe veggie broth with miso is actually quite tasty and I found myself wanting to slurp every last drop, even though I was super stuffed after inhaling the large portion of noodles that come with every bowl.\n\nThe restaurant is pretty small, with only 8 tables inside, and 3 more outside. Service is minimal, but courteous. \n\nGood to know that if I'm hungry and in the area, there's a great little place to dive in and have a quick bite!", "rating": 5, "date": "2014-10-28"}, {"excerpts": ["Me too, this is my new favorite spot for Japanese udon noodles in Japan town.  ", "Their broth is usually very flavorful and their noodles have just the right amount of chewiness.  ", "Also if you're not a soup kind of person, their hiyashi udon is definitely a yum!  ", "They are mostly known for their ramen ", "but I'm much more of an udon girl", ", I like my noodles thick ;D."], "author": "Nina W.", "review": "Solid 4.  Are you totes over Mifune?  Me too, this is my new favorite spot for Japanese udon noodles in Japan town.  Their broth is usually very flavorful and their noodles have just the right amount of chewiness.  Also if you're not a soup kind of person, their hiyashi udon is definitely a yum!  They are mostly known for their ramen but I'm much more of an udon girl, I like my noodles thick ;D.", "rating": 4, "date": "2015-12-26"}, {"excerpts": ["We ordered Ramen, Tempura Udon, and a Daikon Salad. ", "As soon as the waitress took our order the place was packed with people. \n", "The food came out rather fast- about 10 minutes after we ordered! ", "The ramen and tempura were great, but the Udon was just \"okay\" - the noodles were a bit bland.\n", "The daikon salad was just chopped daikon and tomatoes- no seasoning, oil, or dressing. ", "The bill came out to about $38. \n", "Minus a star because there were a bunch of fruit flies in the place which was annoying/disturbing."], "author": "A L.", "review": "My boyfriend and I went for dinner at about 7pm on a Wednesday night. The place was half empty and a women told us to sit wherever we wanted. We ordered Ramen, Tempura Udon, and a Daikon Salad. As soon as the waitress took our order the place was packed with people. \nThe food came out rather fast- about 10 minutes after we ordered! The ramen and tempura were great, but the Udon was just \"okay\" - the noodles were a bit bland.\nThe daikon salad was just chopped daikon and tomatoes- no seasoning, oil, or dressing. The bill came out to about $38. \nMinus a star because there were a bunch of fruit flies in the place which was annoying/disturbing.", "rating": 3, "date": "2016-07-22"}, {"excerpts": ["The udon is my absolute favorite for the past 6 years. "], "author": "Jess W.", "review": "The change of ownership and the decrease in quality of food doesn't appeal to me. I visit less often and when I do, I always forget to not to order the \"beef\" nabeyaki with the miso broth. My problem is the beef. It is this glob of slimey and fatty chunk of inedible\"beef.\" I don't know about you, but I do not like the sweet and style pork style of meat in my broth. It leaks oil and it makes it look and feel disgusting. However, everything else in the bowl is delicious. But now I am just paying a extra for vegetarian style bowl of nabeyaki. \n\nDo not order the ramen here. Don't fall for the ramen trend here. They weren't originally known for this. \n\nThe udon is my absolute favorite for the past 6 years. It's fresh and well, delicious. \n\nThe line can still get ridiculously long for a small space.", "rating": 3, "date": "2015-02-04"}, {"excerpts": ["Next time I'm gonna try and get a nabeyaki Udon or Soba for a lighter option. \n\n"], "author": "Melissa Z.", "review": "TLDR: Great deal for a lot of pretty damn good food.\n\nI've been wanting to try this place for a while and I finally got to a few weeks ago. They have pretty much any type of Japanese noodle you could possibly want. We had to wait outside for a bit before we got seated but we used up the entire time trying to figure out what we each wanted. On top of all the noodle choices, you can also add a don to your noodle for just $3 extra. They had a bunch of different choices which made deciding that much harder for us.\n\nI decided to get the Spicy Miso Ramen without a don because the noodle portions already looked really big to me. I'm glad I made that choice because I could barely finish all my food and everyone else who ordered dons ended not being able to finish everything. \n\nPrices were very reasonable, especially for the quantity and quality of food offered. I had read that the place was really cheap and I was afraid that the noodles would be really sad and lackluster. My one complaint would be that the Ramen I got had A LOT of oil in it. Probably mostly from the spicy oil. Next time I'm gonna try and get a nabeyaki Udon or Soba for a lighter option. \n\nMost noodle places only have one type of noodle and a variety of other dishes, but Suzu is truly very centered around noodle. Good place to go if you're an avid noodle lover (like me) and know that you want noodle bug have trouble deciding what type until the last minute.", "rating": 4, "date": "2016-10-13"}, {"excerpts": ["The Udon looked good too - it's just that I had to pick between the many tasty options.  ", "I picked the ramen with Japanese chicken - the chicken comes on a side plate to keep it crispy. ", "The broth was delicious as well as the ramen noodles.   ", "The service is quick and attentive.  ", "The place was packed."], "author": "Barbara P.", "review": "Fantastic ramen dishes.  The Udon looked good too - it's just that I had to pick between the many tasty options.  I picked the ramen with Japanese chicken - the chicken comes on a side plate to keep it crispy. The broth was delicious as well as the ramen noodles.   The service is quick and attentive.  The place was packed.", "rating": 5, "date": "2017-06-06"}, {"excerpts": ["Ordered the nabeyaki udon and it comes with tempura (shrimp, carrot, pumpkin). ", "Wish they put the tempura on the side as by the time it got to my table, it was super soggy (ended up just taking the batter off). ", "The broth was a bit salty and it was so hot from the cast iron bowl that it made my noodles taste more overcooked than intended. ", "I wish the egg that comes in the udon/ramen was a softboiled egg instead of a boiled one."], "author": "Lauren K.", "review": "Packed restaurant with everyone eating noodles. Ordered the nabeyaki udon and it comes with tempura (shrimp, carrot, pumpkin). Wish they put the tempura on the side as by the time it got to my table, it was super soggy (ended up just taking the batter off). The broth was a bit salty and it was so hot from the cast iron bowl that it made my noodles taste more overcooked than intended. I wish the egg that comes in the udon/ramen was a softboiled egg instead of a boiled one.", "rating": 3, "date": "2015-06-26"}, {"excerpts": ["I'll have to come back for a complete analysis on the soba and udon :)"], "author": "Astrid V.", "review": "My manager and I came in slightly in a rush, we had a half hour to eat but didn't want to grab a ready made bentos on the other side of the mall (don't judge, we just knew what we didn't want to eat). We waited maybe 2 minutes to sit down, and let the waitress know we didn't have much time when ordering, and she didn't make us promises but she made sure our food came out fast. I don't know how much effort was made but just FYI it was appreciated. \n\nYou may have heard of the food here already, or maybe you've noticed that they're always full up, but let me just confirm that the food is delicious. In a mall full of disappointment, Suzu is a refreshing oasis of decent flavor. My manager and I got the Tsukemen and Hayashi Chukka, respectively, and they were both fantastic  (I'm going off of what she said, I didn't eat any of the tsukemen).  My dish was flavorful and had a sesame based sauce to pour over instead of Ramen broth, and I got the karaage on the side because I'm a vegetarian, but it was refreshing and bursting with bright flavors. The tempura was perfect too! I wish I had time to enjoy it, but we cut it close enough.\n\nIt's also a bonus that the noodles are up to par (I mean, look at the name). The Ramen noodles in my dish were eggy and chewy and crinkly, just the way I like them. I'll have to come back for a complete analysis on the soba and udon :)", "rating": 5, "date": "2016-08-26"}, {"excerpts": ["I ordered the meat nabeyaki udon and loved it! ", "The soy broth was perfect! ", "And the price was VERY reasonable!"], "author": "Jodi M.", "review": "Loved this place! Very authentic! I ordered the meat nabeyaki udon and loved it! The soy broth was perfect! And the price was VERY reasonable!", "rating": 5, "date": "2015-07-08"}, {"excerpts": ["Pretty good udon and ramen place. ", "I came here with my sister and I got the nabeyaki while she ordered the kimchi. ", "The portions are large and I was definitely more than full after finishing my pot. ", "They also put a lot of ingredients inside. ", "I would go with 3.5 stars, but am rounding down since unfortunately the tempura was disappointing. ", "The shrimp was tiny and so were the vegetable pieces. ", "My sister on the other hand LOVED her kimchi udon pot, so maybe I'll try that next time. "], "author": "Sophia H.", "review": "Pretty good udon and ramen place. I came here with my sister and I got the nabeyaki while she ordered the kimchi. The portions are large and I was definitely more than full after finishing my pot. They also put a lot of ingredients inside. I would go with 3.5 stars, but am rounding down since unfortunately the tempura was disappointing. The shrimp was tiny and so were the vegetable pieces. My sister on the other hand LOVED her kimchi udon pot, so maybe I'll try that next time. :)\n\nOverall I think the price was decent ($15 incl. tax and tip) for the meal. I would come back again since it hits the spot on cold days.", "rating": 3, "date": "2015-01-27"}, {"excerpts": ["Good place for ramen and udon. ", "Probably will be my go to place for udon. ", "The seating is limited and it does get packed ", "do you might not want to bring a group of over 4 people here. ", "I hope the quality stays the same and that the service always will be so fast."], "author": "Lily P.", "review": "Good place for ramen and udon. Probably will be my go to place for udon. The seating is limited and it does get packed do you might not want to bring a group of over 4 people here. I hope the quality stays the same and that the service always will be so fast.", "rating": 4, "date": "2015-04-08"}, {"excerpts": ["Great Ramen or Udon/Soba noodles here!  ", "Small restaurant but fast to order.  ", "Customer service isn't the greatest as the waitresses don't say much.  ", "But the food was good.  ", "There's plenty other noodle houses to choose from in SF though, especially here in Japantown.  ", "We might come back.  ", "My husband is the one who is the biggest noodle nut, lol!"], "author": "Rosie M.", "review": "Great Ramen or Udon/Soba noodles here!  Small restaurant but fast to order.  Customer service isn't the greatest as the waitresses don't say much.  But the food was good.  There's plenty other noodle houses to choose from in SF though, especially here in Japantown.  We might come back.  My husband is the one who is the biggest noodle nut, lol!", "rating": 4, "date": "2016-06-13"}, {"excerpts": ["Le boyfriend wanted ramen but I wanted udon. ", "What restaurant provides both? ", "This place! ", "I've tried their ramen before and really liked it ", "but last night I was craving udon. ", "As a first timer trying the udon here, I was pretty impressed. ", "I ordered the nabeyaki udon and it comes with a couple of tempura veggies and one shrimp. ", "I should've asked for the tempura on the side cause I prefer them not to be soggy (when it sits in the broth for too long. ) ", "the broth was sweet and the noodles were soft and not super chewy. ", "Perfect amount of cabbage and ", "whatever other veggies they put in there (see attached photo). ", "Le boyfriend got the spicy miso ramen and curry bowl (combo for an extra $3) he really enjoyed it.  ", "The only thing I don't like is that they completely cook the egg.\n", "It's a small restaurant ", "so if you decide to come on a weekend, come early or prepare to wait!"], "author": "naviee P.", "review": "Dilemma! Le boyfriend wanted ramen but I wanted udon. What restaurant provides both? This place! I've tried their ramen before and really liked it but last night I was craving udon. As a first timer trying the udon here, I was pretty impressed. I ordered the nabeyaki udon and it comes with a couple of tempura veggies and one shrimp. I should've asked for the tempura on the side cause I prefer them not to be soggy (when it sits in the broth for too long. ) the broth was sweet and the noodles were soft and not super chewy. Perfect amount of cabbage and whatever other veggies they put in there (see attached photo). Le boyfriend got the spicy miso ramen and curry bowl (combo for an extra $3) he really enjoyed it.  The only thing I don't like is that they completely cook the egg.\nIt's a small restaurant so if you decide to come on a weekend, come early or prepare to wait!", "rating": 4, "date": "2015-02-25"}, {"excerpts": ["I still recommend the miso nabeyaki udon! ", "I've tried the chicken karage ramen, which was good was well, but a tad on the bland side. ", "My friend had the spicy pork ramen and unfortunately he was disappointed in it. ", "I tried a bit of the broth and it just tasted...off. "], "author": "Noelle H.", "review": "Since my first visit, I've been back multiple times.\n\nI still recommend the miso nabeyaki udon! I've tried the chicken karage ramen, which was good was well, but a tad on the bland side. My friend had the spicy pork ramen and unfortunately he was disappointed in it. I tried a bit of the broth and it just tasted...off. Not flavorful at all. \n\nBut minus one star because the past couple of times I've been back the service is always lacking. One visit in particular where I felt it was almost hostile. When they get busy it seems that they just want to flip tables and will drop the check as soon as you get food. Don't bother asking for water or napkins either because you'll get glared out. Sheesh!", "rating": 3, "date": "2013-08-21"}, {"excerpts": ["*Udon or buckwheat noodle also offered\n", "*Parking can be difficult to find but there is a lot next to Nijiya Market"], "author": "Nicole S.", "review": "I've been trying to go to Suzu for the longest but there's always seem to have been too long of a wait or they were closing and wouldn't take any more names on the list.  \n\nOne Wednesday night, our party of two arrived around 8:45pm.  There were a few names in front of ours but we had only about a 10-15 minute wait. \n\nI decided to go with the spicy ramen ($9.95) which I found only average.  Suzu's standard ramen is typically served in a chicken and pork broth and LIMITED amount of toppings: green onions, bamboo shoots, 1 piece of pork and half a boiled egg.  In addition to the standard ramen, the spicy ramen came with chili pork slices and bean sprouts.  It seemed like only chili oil was added to my broth which took away the hearty chicken and pork flavor I was expecting.  The egg noodles were ok, not too chewey.  Though you're given a decent amount of noodles, the lack of toppings and lack of flavoring of the broth is enough for me to probably not return.\n\nSERVICE:\nI guess service here is a hit or miss.  Once our table was ready, a hostess called my name, walked into the restaurant, and kind of mumbled and walked into the kitchen.  My friend and I didn't hear her but proceeded to walk to the corner of the room to seat ourselves at the empty table.  Once we sat down, service was definitely better.  Those waitresses checked on us and made sure our water cups were filled.\n\nWHAT TO KNOW:\n*Credit cards are accepted\n*Usual appetizers are offered (i.e. chicken karaage, gyoza, etc.)\n*Udon or buckwheat noodle also offered\n*Parking can be difficult to find but there is a lot next to Nijiya Market", "rating": 3, "date": "2013-07-02"}, {"excerpts": ["Salty pork belly ramen in soy sauce soup, mushy beef in nabeyaki udon and tasteless butter corn ramen. ", "But all I know is that I do not recommend the beef nabeyaki udon at all! ", "The beef was coated with some kind of breading that felt like it was left in liquid too long because it was very, VERY soggy, even though that was the first thing I tired when I got it. ", "The beef was also very salty too. ", "Everything else in the bowl had no flavor. ", "The soup itself was very bland. ", "And that egg.... ", "I've had a good amount of udon/ramen in my life, and this is by far the worst for me. ", "Being inside japantown, I didn't expect the quality to be so bad. ", "Not recommended."], "author": "Sandy C.", "review": "Salty pork belly ramen in soy sauce soup, mushy beef in nabeyaki udon and tasteless butter corn ramen. Came here to eat with coworkers and we all left unsatisfied. \n\nMaybe we all ordered the wrong thing? But all I know is that I do not recommend the beef nabeyaki udon at all! The beef was coated with some kind of breading that felt like it was left in liquid too long because it was very, VERY soggy, even though that was the first thing I tired when I got it. The beef was also very salty too. Everything else in the bowl had no flavor. The soup itself was very bland. And that egg.... it was so over cooked for all three of us!\n\nI've had a good amount of udon/ramen in my life, and this is by far the worst for me. Being inside japantown, I didn't expect the quality to be so bad. Not recommended.", "rating": 1, "date": "2014-12-26"}, {"excerpts": ["For the food, I ordered the Nabeyaki Udon. ", "I'm a huge fan of shrimp tempura ", "and I was slightly disappointed that there was only one in the bowl, but the one that they do give you is pretty large. ", "The other restaurants in the mall have udon, ramen, and various other kinds of Japanese food, so you're kind of limited here. ", "If you want a combination of sushi AND noodles, there are a lot of other Japanese restaurants that will offer you that."], "author": "Sara W.", "review": "This place is your standard Japanese noodle house. I wasn't blown away with any of the dishes but it was enough to satisfy my cravings.\n\nWe came during the cherry blossom festival, so there was definitely a bit of a wait. You should write your name down as early as possible, they keep a sign in sheet at the front. \n\nThe restaurant is very tiny so you may find yourself a little cramped, I wouldn't recommend it for larger parties. It's perfect if you're dining alone or with just one other person. \n\nFor the food, I ordered the Nabeyaki Udon. I'm a huge fan of shrimp tempura and I was slightly disappointed that there was only one in the bowl, but the one that they do give you is pretty large. And my advice is to eat it quickly unless you want the shrimp to become soggy in the broth! \n\nThe broth itself was decent, again, nothing mind blowing, it wasn't bursting with flavor but it was a nice soy sauced based broth. I didn't find myself sipping it at the end though, I'd say it was more on the bland side so I thought it needed just a little bit more flavor. \n\nThe prices are pretty decent, about 10 dollars per dish. I may come back again if I'm craving noodles, but I would probably skip this place because that is the only type of dish hey serve. The other restaurants in the mall have udon, ramen, and various other kinds of Japanese food, so you're kind of limited here. If you want a combination of sushi AND noodles, there are a lot of other Japanese restaurants that will offer you that.", "rating": 3, "date": "2014-04-24"}, {"excerpts": ["Suzu specializes in ramen, udon and soba with house-made noodles. ", "There are also various dons (rice bowls) and curries on the menu. ", "Can't decide? ", "They have combos ", "were you can mix and match ramen, udon or soba with a don of your choice. \n\n"], "author": "Cherylynn N.", "review": "*Sees a packed restaurant*\n\"Honey, there's a lot of people in there. It must be good.\"\n*Walks in Suzu Noodle House*\n\n*Sees a crowd outside Suzu\"\n\"Yo, that place looks CRACKIN'!\"\n\"Yah, bro we're only in SF once so let's check it out.\"\n*Puts name on waitlist*\n\n.....\n.....\n.....\n\nOne of my friends was craving ramen but he didn't want to drive down to San Mateo so we ended up at Suzu. There's always a crowd outside Suzu so I thought it had to be good. For me, a tale-tell sign of a good Asian restaurant is if you see native patrons. There was zero at Suzu. \n\nSuzu specializes in ramen, udon and soba with house-made noodles. There are also various dons (rice bowls) and curries on the menu. Can't decide? They have combos were you can mix and match ramen, udon or soba with a don of your choice. \n\nOk, ok so I know ordering a don in a noodle house is like ordering fish at a steakhouse but let me explain. I'm allergic to MSG so I try to stay away from soupy/saucy Asian foods. Also, I was eyeing the other table's ramen and the portion of noodles seemed very large which immediately set off in my head that it's probably \"quantity\" over \"quality\". If I'm going to get a MSG attack, it better be worth it and this case it didn't look to be. \n\nCHICKEN KATSU DON - $10.95\nhttp://www.yelp.com/biz_photos/gPUXFQkf4koX8CmWJR7wMg?select=p_01XBxOX6m_4WGs0DBv1w\nOne breaded chicken cutlet was sliced and placed top of a Mount Everest mountain of rice and drizzled with tonkatsu sauce. The katsu was crisp and tender but very bland. The tonkatsu sauce tasted straight from a bottle as it had that syrupy consistency. It was nothing that I couldn't get at Nijiya Market down the block in the pre-packed food section for half the price.\n \nMy friend, the human vacuum (but never gains weight) ordered the ramen combo with a katsu don. He normally inhales his food and finishes our leftovers. This time he didn't even finish his own food. My other friend ordered the curry don which she didn't like. I tried a sip of the broth and it was awful. The broth was ALL salt with no depth of flavor or spice. It tasted like it was made from a powder packet. You can actually still taste the raw curry powder in the broth like it wasn't cooked long enough in the broth. \n\nService was equally as bad. The rude waitresses passed our table over 10 times without coming to take our order. It wasn't a big deal at first since we were busy chatting. We had to wave our hands in the air to get their attention. It took about 15 minutes to get our food. \n\n2.5 STARS rounded up to 3 STARS for filling my tummy without an MSG attack. \n\nJust because a restaurant has a crowd outside does NOT mean it's good. Thanks for the lesson, Suzu. \n\nOTHER NOTES:\n*Small restaurant with 30 seats\n*It's always crowded even on non-peak hours\n*Expect a 30-45 minute wait during peak hours on weekends \n*CC's Accepted", "rating": 3, "date": "2011-11-03"}, {"excerpts": ["I ordered the Curry udon here ", "and it was basically udon in a miso base that was meant for ramen and with a slap of curry on top of it. ", "The only other time I had curry udon was when it was like udon in like ", "a curry sauce not soup. ", "I never seen it like this, I always seen it the way I had it before. ", "Anyways it was a bit saltier, maybe because of the miso and curry combined. ", "My girlfriend just get some miso ramen which I thought was whatever. ", "Nothing was extreme. ", "I have had way better in Japan and down in socal. "], "author": "Tuan T.", "review": "Okay, I definitely remember this place being a four star place but I can see why it's getting bumped down a star or a half star now. The wait was rather long, and I got rather hungry. Don't know if that makes a difference (usually does) but my experience was average.\n\nI came in with my girlfriend on a visit to SF and I been going to SF for years since I lived in Norcal, and would see this place since it opened but never really went and tried it. I ordered the Curry udon here and it was basically udon in a miso base that was meant for ramen and with a slap of curry on top of it. The only other time I had curry udon was when it was like udon in like a curry sauce not soup. I never seen it like this, I always seen it the way I had it before. Anyways it was a bit saltier, maybe because of the miso and curry combined. My girlfriend just get some miso ramen which I thought was whatever. Nothing was extreme. I have had way better in Japan and down in socal. I want to be impressed not disappointed Japan town.\n\nI give this place a 3 stars because at least the service was decent and the food was average. I want to be wowed if I ever come back.", "rating": 3, "date": "2014-01-07"}, {"excerpts": ["But the ramen and udon tasted good."], "author": "Vikram A.", "review": "Didn't seem like a very busy spot. Probably we went on an off-time. \n\nVeggie tempura was VERY OILY! But the ramen and udon tasted good.", "rating": 4, "date": "2016-01-10"}, {"excerpts": ["We ordered the meat veggie ramen, the spicy ramen with green onions and nabeyaki udon. ", "Only the nabeyaki udon was somewhat decent tasting."], "author": "Jingwen Y.", "review": "This place is for tourists who doesn't know any better. Unfortunately I fell for it as well.\n\nFirst thing I noticed when I enter Japan Town is the door ads for this place. Since I was super hungry and the weather was super windy I thought ramen would be perfect.\n\nThe service was so-so. The only reason why I say that is that I was standing in the door way for quite awhile before someone made eye contact with me. Is that an Asian thing? When I did made contact, I told the hostess that it's a table for 3 and she asked if I had put my name down even though at the time, the place was not completely full.\n\nBesides the food portion, I find the food rather bland. We ordered the meat veggie ramen, the spicy ramen with green onions and nabeyaki udon. Only the nabeyaki udon was somewhat decent tasting.", "rating": 3, "date": "2014-05-24"}, {"excerpts": ["They specialize in udon, soba and ramen noodles here.  ", "I came for the ramen.  ", "They have three different broths based with shuyo (soy sauce), shio (sea salt) or miso (soybean paste) made of chicken and pork.  ", "My bf ", "and I both chose the shio broth.  ", "His was pork belly ramen with extra noodles.  ", "It came with a boiled egg, green onions and bamboo shoots.  ", "He took it out to the bottom of the bowl.  "], "author": "Elizabeth S.", "review": "They specialize in udon, soba and ramen noodles here.  I came for the ramen.  They have three different broths based with shuyo (soy sauce), shio (sea salt) or miso (soybean paste) made of chicken and pork.  My bf and I both chose the shio broth.  His was pork belly ramen with extra noodles.  It came with a boiled egg, green onions and bamboo shoots.  He took it out to the bottom of the bowl.  I did likewise to my kimchi tofu spicy ramen with a fried shrimp added.  \n\nThey have a pretty plentiful selection of ramen here.  However, much of it is pretty simple.  -not loaded with stuff unless you do the extras which can add up quickly when a bowl starts at $10 plus.  Apparently, I chose one that came with nothing other than kimchi, tofu and green onion.  Oh, well.  I still enjoyed it.  \n\nWhat else here?  The service is pretty non-existant.  She seats you with your tea and water, brings your food and is never to be seen again unless you can get her attention in the vicinity.  One small glass of water and tea for each of us.  That's fine.  It reflected in the tip and really we're not inclined to return despite the hearty ramen.  We don't go out to eat for self-service.  Besides that, this is just a tiny joint in the Japantown mall.  There are a million other choices around here.", "rating": 3, "date": "2014-04-23"}, {"excerpts": ["Food: ordered the gyoza as appetizer, small size of the katsu don and tempura udon. \n\n", "the potstickers came out first, my katsu don next, and then after a moment my boyfriend got his udon (with the tempura on the side - thank you)!!\n\n", "Experience: I am definitely coming here every single time I want katsu don or udon because our dishes were very delicious and the service was great. ", "also I believe we spent less than $20 on the both of us, which never happens!!"], "author": "Anastasia A.", "review": "Food: ordered the gyoza as appetizer, small size of the katsu don and tempura udon. \n\nService: restaurant was starting to get busy but we got to sit down before having to wait! we were given water and hot tea soon after and our server took our order and was able to answer a question I had. the potstickers came out first, my katsu don next, and then after a moment my boyfriend got his udon (with the tempura on the side - thank you)!!\n\nExperience: I am definitely coming here every single time I want katsu don or udon because our dishes were very delicious and the service was great. also I believe we spent less than $20 on the both of us, which never happens!!", "rating": 5, "date": "2016-11-10"}, {"excerpts": ["Not sure what all of the bad reviews are about, this place is great to stop in and have a solid bowl of ramen, udon, or soba noodles. ", "Fast service, in and out in 30 minutes, if you really need to be. "], "author": "Stephanie L.", "review": "Not sure what all of the bad reviews are about, this place is great to stop in and have a solid bowl of ramen, udon, or soba noodles. Fast service, in and out in 30 minutes, if you really need to be. Good hot sake, green tea. No complaints on my end! Definitely stop here if you're hanging out in Japantown for the afternoon.", "rating": 5, "date": "2016-09-09"}, {"excerpts": ["They have a pretty diverse menu with more traditional ramens as well as udon and sobas. ", "For a little extra money, you can make your noodle bowl a combo with the addition of a donburi of your choice. ", "I had the kimchi nabeyaki soba, which came in a hotpot that kept my food piping hot for the entire time. ", "It was a good balance of kimchi, vegetables, and soba, not leaving me overly full. ", "It felt like a homey dish that I would eat at home, not loaded with sodium or extra flavorings. ", "My boyfriend had the tonkatsu ramen, which came with perfectly chewy noodles. ", "He also had the curry chicken donburi, another homey bowl of comfort food. ", "The wait can get extensive sometimes as people know the best spots to go to in Japantown, but it's definitely worth the wait!"], "author": "Ashley T.", "review": "Suzu Noodle House is one of my favorite spots in Japantown as of now. They have a pretty diverse menu with more traditional ramens as well as udon and sobas. For a little extra money, you can make your noodle bowl a combo with the addition of a donburi of your choice. I had the kimchi nabeyaki soba, which came in a hotpot that kept my food piping hot for the entire time. It was a good balance of kimchi, vegetables, and soba, not leaving me overly full. It felt like a homey dish that I would eat at home, not loaded with sodium or extra flavorings. My boyfriend had the tonkatsu ramen, which came with perfectly chewy noodles. He also had the curry chicken donburi, another homey bowl of comfort food. The wait can get extensive sometimes as people know the best spots to go to in Japantown, but it's definitely worth the wait!", "rating": 4, "date": "2014-12-17"}, {"excerpts": ["Located in the very back of the Japantown shopping center, this little noodle house offers an array of udon and ramen. "], "author": "Vivian L.", "review": "Located in the very back of the Japantown shopping center, this little noodle house offers an array of udon and ramen. Although there aren't a lot of tables, the wait for one isn't terrible due to quick service and fast turnaround.\n\nThere aren't size options to choose from, but my bowl of veggie and meat ramen came in a much larger bowl than the bowl of Suzu ramen. They charge for $1 for add-ins like an egg, corn, and even green onions, and $2 for things like extra noodles and shrimp. I felt $1 is a little much for a regular egg. It's not soft boiled and deliciously gooey and runny, either. It's already pre-cut, too. I guess I'm just spoiled by Orenchi in the South Bay. My broth was a little more oily than I'm used to, but the broth of the Suzu ramen was actually quite good.\n\nOverall, I would probably come back again if I'm in need of a quick noodle fix.", "rating": 3, "date": "2014-01-28"}, {"excerpts": ["I'll probably come back again when there isn't a line just to try the curry ramen or udon.  ", "I wouldn't wanna spend $15 on the same bowl of ramen again."], "author": "Audrey D.", "review": "Totally average.  I came in around 6pm on a Thursday and was seated immediately.\nI had the Karage shoyu ramen with extra spicy paste and added bamboo shoots.  Bamboo was good.  Wish I had asked for more toppings.  The spice was hardly there, maybe 2/10, and I found myself adding more and more of the red pepper that was on the table.  The broth had an interesting flavor that I initially didn't like but gradually grew on me as I started tasting a strong soy sauce flavor.  I ultimately could not finish the broth and ended up with a stomach ache later (my bad for trying).  The noodles were average.\nI'll probably come back again when there isn't a line just to try the curry ramen or udon.  I wouldn't wanna spend $15 on the same bowl of ramen again.", "rating": 3, "date": "2015-01-23"}, {"excerpts": ["Other items in the menu are hearty nabeyaki udon hot pots.\n\n", "The combos are a nice way to try 2 items at once, u get a medium size portion of udon, soba or ramen, plus your choice of a side dish portion of any donburi. "], "author": "Luis C.", "review": "New hours!\nNow open 11:30am-9pm daily! http://media1.px.yelpcdn.com/bphoto/8QAMC7Xi6i3YG8KvCj79bA/l\n\nSuzu's reputation as the best ramen in Japantown is well deserved. http://media1.px.yelpcdn.com/bphoto/d8KJBHTXPyhfDZZOE_RnxQ/l Although most everyone would agree that the best ramen shops are in the South Bay.\n\nIn my opinion reviews older than a year or two are no longer valid, because the staff has changed and the broth has really improved over time. The chef blends filtered chicken and pork broths for a savory taste that will appeal to most western palates. The noodles are decent, and the chasu pork is tender although sliced very thin. http://media1.px.yelpcdn.com/bphoto/2EfcozLEisfRUXMADGUviQ/l But like many others this place makes hard boiled eggs, I prefer soft boiled eggs. Unlike other ramen shops that have a basic bowl and charges extra for each topping, here u simply pick from a dozen ramen bowl choices ($8.95-$11.95). There are also 8 ramen combos for $10.95 that include a side of donburi. Other items in the menu are hearty nabeyaki udon hot pots.\n\nOn the appetizers side, the gyoza is good. http://media1.px.yelpcdn.com/bphoto/JZCqn2a_XipgBpN524X6Sg/l The batch I bought just last week was freshly made, with a nice crisp bottom. Karaage (fried chicken morsels) on the other hand was only okay, nice crispy outside but the meat was a little mushy. http://media1.px.yelpcdn.com/bphoto/HmtvyQesNI2wlSQQgqamPg/l The combos are a nice way to try 2 items at once, u get a medium size portion of udon, soba or ramen, plus your choice of a side dish portion of any donburi. http://media3.px.yelpcdn.com/bphoto/suF1RjEWHln-y9CQFsl1pA/l\n\nCome on weekdays, or get there early to get one of the 30 coveted seats (5 tables for 2, 4 tables for 4, and 2 tables for 2 outside). Sadly there's no space to expand (unless that flower shop on the left closes). On weekends, make sure to write your name on the waiting list as soon as u get there.\n\nNO to go orders. http://media1.px.yelpcdn.com/bphoto/BkSqAJkHmacQ-36FAlxVGg/l\nThey don't validate Japantown garage parking.", "rating": 4, "date": "2010-09-07"}, {"excerpts": ["I tried their chicken udon and the chicken was really tender! ", "My udon was great, I wold definitely recommend it. ", "Most of the people with me ordered ramen and that look good too, but I think the general consensus is that they've had better. \n   ", "Come with a small party, great on a cold day, and service sims fast!"], "author": "Mia S.", "review": "Come here on a rainy day and crammed in a party of 8 in the small place. I tried their chicken udon and the chicken was really tender! My udon was great, I wold definitely recommend it. Most of the people with me ordered ramen and that look good too, but I think the general consensus is that they've had better. \n   Come with a small party, great on a cold day, and service sims fast!", "rating": 4, "date": "2013-07-16"}, {"excerpts": ["I have never had any udon and ramen as salty as this place. ", "Seriously overloaded on salt. ", "The texture of the chicken was like it was boiled for hours. ", "One star only because service was alright."], "author": "Erik Y.", "review": "I have never had any udon and ramen as salty as this place. Seriously overloaded on salt. The texture of the chicken was like it was boiled for hours. One star only because service was alright.", "rating": 1, "date": "2016-07-14"}, {"excerpts": ["I love the fact that there are so many options, especially since I prefer udon noodles. \n\n"], "author": "Bret P.", "review": "One of my favorite Ramen places so far. I love the fact that there are so many options, especially since I prefer udon noodles. \n\nStaff is friendly and pretty quick to get through the waiting list for seating. \n\nThey'll make it how you want it but are happy to make suggestions if what you ordered might not be the best combo. \n\nGood date place.", "rating": 5, "date": "2015-03-09"}, {"excerpts": ["They cook all their dishes (especially their udon and ramen) absolutely correctly! ", "No complaints here! ", "You definitely won't regret your lunch or dinner there!"], "author": "Juliet R.", "review": "After living in Singapore for 12 years, I refuse to eat Asian food anywhere except Suzu Noodle House. They cook all their dishes (especially their udon and ramen) absolutely correctly! No complaints here! You definitely won't regret your lunch or dinner there!", "rating": 5, "date": "2016-05-11"}, {"excerpts": ["The food is traditional udon and noodles and is very meddle done.\n\n"], "author": "v n.", "review": "Very small and usually full. Reasonable prices. Nice staff, although hurried. The food is traditional udon and noodles and is very meddle done.\n\nWe live in the area and had not been before but will make it a regular spot.", "rating": 5, "date": "2016-02-28"}, {"excerpts": ["The kimchee udon and the curry udon are really flavorful and filling. ", "I would order either again. "], "author": "Ashley Y.", "review": "The kimchee udon and the curry udon are really flavorful and filling. I would order either again. :)\n\nThe restaurant is not good for big groups but the wait was not unbearable. If you go here I suggest going in a part of 2-6. The service was a little slow, but I don't blame them because there were a lot of customers there at the time. I give 4 stars based on the food because I really liked it.", "rating": 4, "date": "2012-06-08"}, {"excerpts": ["I also had a mini Chicken Katsu Don bowl on the side ($3.00 with the purchase of ramen, udon, or soba) and that was delicious too.\n\n"], "author": "Tim P.", "review": "Had the BUTTER&CORN Ramen (Paula Deen would be proud) and it was AWWWWESOME! The square pat of butter melts into the broth and really makes a difference in the flavor of the ramen! The sweet niblets of corn sank to the bottom of the bowl but was a nice surprise with every chopstick full of ramen and pork. I also had a mini Chicken Katsu Don bowl on the side ($3.00 with the purchase of ramen, udon, or soba) and that was delicious too.\n\nSUZU itself can hold about 25+ customers with some seating outside along the restaurant. My party of three waited 20 minutes for our seats but the wait wasn't bad. Will definitely be back when I need my BUTTER RAMEN FIX!", "rating": 5, "date": "2012-01-15"}, {"excerpts": ["Tempura Udon: was not exceptional either.  ", "I've had others that were equivalent if not better than what I tasted that night.  ", "For one, there seemed to be a lack of sustenance in the dish.  ", "After you put in your tempura shrimp which was served separately (and for good reason otherwise they would've become super soggy), there was only a few pieces of actual seaweed and kamaboko pieces.  ", "The majority of the dish was udon noodle and soup!\n\n"], "author": "Vera L.", "review": "Tokio Ramen: a pork-based soup (as all ramen normally are) with a few pieces of fatty pork slices, half of a hard-boiled egg cooked in sauce, seaweed, several slices of pickled root, and kamaboko (fishcake).  Tasted like it was made with water from the Dead Sea.  In other words, it was true to its origin in being Japanese by being way too salty.  On my trip to Japan in 2008, Momma Lim and I had stopped by a local street ramen store that appeared to be pretty popular by the amount of locals that were eating in it.  The ramen was so salty that we had to pour iced green tea (served complimentary) into our soup to eat the ramen.  They did say that colon cancer is 2nd (or was it 1st) cause of death in the country.  Lung cancer actually may top that being that Japanese people love their cigarettes.  But I digress... the Tokio ramen at Suzu was equivalent to that soup base in Tokyo.  Would it have been different if it was a different ramen like miso ramen? Perhaps, but salty ramen is still salty ramen! And salt is not good as an overdose!\n\nTempura Udon: was not exceptional either.  I've had others that were equivalent if not better than what I tasted that night.  For one, there seemed to be a lack of sustenance in the dish.  After you put in your tempura shrimp which was served separately (and for good reason otherwise they would've become super soggy), there was only a few pieces of actual seaweed and kamaboko pieces.  The majority of the dish was udon noodle and soup!\n\nEel and Avocado roll: fresh avocado slices with unagi (bbq eel) wrapped in nori and rice.  Nothing extraordinary.  Even portion wise I think Tokyo Shokudo here in Atlanta serves much bigger rolls in general.  Could be the cost of living difference?\n\nNot terrible, but I'm sure there are better ramen places here in SF!", "rating": 3, "date": "2014-04-21"}, {"excerpts": ["My recommendation: Karrage, Nabeyaki Udon, Miso Nabeyaki Udon. ", "Wonton Ramen", "/Udon with Shio soup base."], "author": "Lisha K.", "review": "My recommendation: Karrage, Nabeyaki Udon, Miso Nabeyaki Udon. Wonton Ramen/Udon with Shio soup base.", "rating": 5, "date": "2015-05-01"}, {"excerpts": ["Great Udon tempura here! ", "Perfectly cooked tempura was not too oily, and the veggies were in no way mushy, something I often get with veggie tempura. ", "The Udon noodles were also perfectly cooked with excellent flavor. ", "The Udon broth had just the right touch of green onion, seaweed, etc. ", "Service was excellent as well. ", "I definitely would return here and hope to try the ramen next time."], "author": "Glenn A.", "review": "Great Udon tempura here! Perfectly cooked tempura was not too oily, and the veggies were in no way mushy, something I often get with veggie tempura. The Udon noodles were also perfectly cooked with excellent flavor. The Udon broth had just the right touch of green onion, seaweed, etc. Service was excellent as well. I definitely would return here and hope to try the ramen next time.", "rating": 4, "date": "2013-10-22"}, {"excerpts": ["i usually get the combo deal, where you get to choose betweenramen, udon, or soba, and with their beautifully laid-out menu maps, you get to choose an additional \"don\" item. ", "their ramen is amazing, and their udon broth is the best i've ever had here in san francisco. "], "author": "Mike N.", "review": "THE BEST RAMEN IN JAPANTOWN. PER.I.OD.\n\nthe establishment is small. like \"we only have 10 tables, and you have to wait every time you come here by putting your name on a clipboard because we're that popular\" small.\n\nother than waiting awkwardly outside in the hallway every time we come here, the food is ahhhhh-mazzzzz-inggggg. i usually get the combo deal, where you get to choose betweenramen, udon, or soba, and with their beautifully laid-out menu maps, you get to choose an additional \"don\" item. all under $15.\n\ntheir ramen is amazing, and their udon broth is the best i've ever had here in san francisco. i've yet to try their soba noodles.\n\nmy suggestion for this business is to take their popularity and grow it by adding a second location or removating this one to a bigger space. the only other ramen joint that is worthwhile to go to in the city is katana-ya, but because suzu is right across the street from where we live, it's naturally my favorite ramen spot.\n\nwe'll be back!", "rating": 4, "date": "2011-12-20"}, {"excerpts": ["We had the Udon noodles and they made it extra "], "author": "Chris M.", "review": "The portions are huge, and the quality is pretty solid on the chicken ramen.  We had the Udon noodles and they made it extra SPICY just the way we like it.\n\nThe place was packed, and staff was friendly. \n\nMinus 1-star for long wait... told us it would be 5 mins and ended up taking over 20 mins.\n\nI've now tried 3 of the noodle houses in Japan town and this ranks in the top 2.", "rating": 4, "date": "2014-07-25"}, {"excerpts": ["I really love the curry udon and able to add unagi with rice.\n", "both are my favorite.\n"], "author": "Rina C.", "review": "I really love the curry udon and able to add unagi with rice.\nboth are my favorite.\nit's nice to get a table outside instead of inside the restaurant.\n\nmy friend didn't like the spicy raman he ordered though.\n\nchicken kargage is decent.", "rating": 5, "date": "2013-12-31"}, {"excerpts": ["That the great tasting ramen/udon changed. ", "The service was great like usual, so I can't knock them there. ", "Blah where do i go for ramen now..."], "author": "Tung T.", "review": "Suzu Suzu Suzu....\n\nWhat happened? \n\nYou used to be so good to me. You used to love me with your luscious and flavorful ribbons of ramen kisses, lather me with your silky and loving broth. But those days are over! Now you are just lame and timid. Cold hearted and fat. Not to mention, you don't dress up like you used to (the suzu ramen special). \n\nBut really though guys, for those who have eaten at Suzu from way back, you know exactly what I'm talking about. I used to adore this place, by far the best place to eat in Japantown SF. Their broths were a bit salty but was so on point back then. I can easily gulp the whole bowl down. Now all I get are mediocre tasting broth served to me luke warm and little accompaniments (which i didn't mind back then because their broth and ramen was so perfectly delicious).\n\nI went to Suzu last Saturday for my friend's birthday and waited a bit to get seated, no surprise there. I never minded the wait, as Suzu was worth it to me. I quickly realized my usual Suzu special was not there anymore, super sad face. So i settled for the pork belly ramen. Which you guessed it, came with half an egg...a few pieces of pork belly,...and ramen. And then you think to yourself...hmm not that bad...i can live with this, until you tasted the pork belly! What is this? Weird tasting sweet marinade covering this over cook piece of porkbelly. Even my imaginary friend could've cooked a juicier piece of pork belly. I was utterly disappointed. \n\nFor everyone who have been going to Suzu for a long time, please go there again and let me know that i'm not tripping. That the great tasting ramen/udon changed. The service was great like usual, so I can't knock them there. Blah where do i go for ramen now...", "rating": 2, "date": "2013-05-16"}, {"excerpts": ["My father ordered the udon and tempura vegetables + shrimp combo, and I ordered the miso broth kimchi nabeyaki with tempura vegetables. ", "I had no idea what nabeyaki was, but I recognized kimchi and udon ", "so I ordered it anyway. ", "It's basically a big hot pot full of chewy, delicious udon noodles topped with tons of vegetables and tofu, and maybe even a hard boiled egg! ", "The kimchi was just right, and the noodles were cooked perfectly. ", "I couldn't finish it all (too much food,) but I enjoyed it thoroughly. ", "Especially the egg! ", "I don't like to eat raw eggs at restaurants so ", "the fact that it was hard boiled put me at ease. ", "The tempura vegetables were equally enjoyable (tempura eggplant is my favorite, it was cooked so well.) ", "I will say the barely tea was too weak, but at least it's a healthy and cleanly option as opposed to a soda or alcohol. ", "If you don't think you can last the long wait time, grab a little snack and put your name on the list, it's totally worth it. ", "I don't understand why the wait time is such a bad thing, it's not the restaurant's fault. ", "It's surprisingly quiet for a place with glass walls (the wood frames insulate it well.) ", "It's a cozy, intimate place with good soups and noodles. ", "The portions aren't small either, or perhaps my stomach is just little. ", "The prices are excellent as well,  under $40 for two people!"], "author": "Aneesa I.", "review": "I have been to this restaurant two times now, and the first time was actually about three years ago with my family. When I first ate at this restaurant it was a Monday, mid-day, in the summertime. This place was the only business in the whole mall that actually had more than two tables filled so we decided to try it out. Two of us ordered the kimchi-ramen, and someone else ordered the tuna don with a bowl of ramen. The fish was very high-quality and the ramen noodles were the best, much better than most ramen noodles I've had elsewhere. I enjoyed the meal so much I vowed to come back and eat here again. I constantly thought about returning for years. I did not get the opportunity to do so until now because every other time I have visited Japantown, this place is packed and the wait time is about forty-five minutes (for good reason,) and when you are famished from walking around in the foggy S.F. summers in a big coat, anything quick is good. \nMy father and I were in the city together and decided to have dinner at a restaurant in Japantown around seven on a Saturday night--probably the busiest time of the week for this mall. Every restaurant was filled with lines extending into the halls, but we both decided we needed to have the amazing noodles at Suzu again, no matter the wait. My father ordered the udon and tempura vegetables + shrimp combo, and I ordered the miso broth kimchi nabeyaki with tempura vegetables. I had no idea what nabeyaki was, but I recognized kimchi and udon so I ordered it anyway. It's basically a big hot pot full of chewy, delicious udon noodles topped with tons of vegetables and tofu, and maybe even a hard boiled egg! The kimchi was just right, and the noodles were cooked perfectly. I couldn't finish it all (too much food,) but I enjoyed it thoroughly. Especially the egg! I don't like to eat raw eggs at restaurants so the fact that it was hard boiled put me at ease. The tempura vegetables were equally enjoyable (tempura eggplant is my favorite, it was cooked so well.) I will say the barely tea was too weak, but at least it's a healthy and cleanly option as opposed to a soda or alcohol. If you don't think you can last the long wait time, grab a little snack and put your name on the list, it's totally worth it. I don't understand why the wait time is such a bad thing, it's not the restaurant's fault. It's surprisingly quiet for a place with glass walls (the wood frames insulate it well.) It's a cozy, intimate place with good soups and noodles. The portions aren't small either, or perhaps my stomach is just little. The prices are excellent as well,  under $40 for two people!", "rating": 5, "date": "2014-03-20"}, {"excerpts": ["i ordered chicken karage udon with small side of tempura over rice.\n", "the soup was really good ", "it has that ", "very good ", "flavor.the noodles were cooked perfectly.overall ", "it was a OK visit.not really much in the menu.and its all simply noodles or salad."], "author": "Enah N.", "review": "we had a quick lunch here last week and as always there is a line...well the place is quite small for noodle lovers.we were at the 4th line on the list...it took some time for us to get seated and gave us a chance to walk around the stores around the noodle house since its inside the japantown center.\ni ordered chicken karage udon with small side of tempura over rice.\nthe soup was really good it has that very good flavor.the noodles were cooked perfectly.overall it was a OK visit.not really much in the menu.and its all simply noodles or salad.", "rating": 3, "date": "2013-05-20"}, {"excerpts": ["Fried chicken noodle soup and the udon noodles (non ramen) can be made without pork- hard to find!  ", "I had the chicken udon (they also have beef) with miso and was delicious and pork free."], "author": "M M.", "review": "Good noodles, no nonsense place. Food comes out fast. Fried chicken noodle soup and the udon noodles (non ramen) can be made without pork- hard to find!  I had the chicken udon (they also have beef) with miso and was delicious and pork free.", "rating": 4, "date": "2015-08-16"}, {"excerpts": ["Spicy tofu kimchi udon is my faaaaavorite. ", "Sometimes it's not spicy enough but the flavor is always spot on. ", "This is the only item I ever order here ", "and I definitely get cravings for it! ", "I always try to eat here if they're open whenever I'm in Japantown! ", "Udon then boba = best lunch/dinner ever!"], "author": "Nas M.", "review": "One of my favorite spots for soup. Spicy tofu kimchi udon is my faaaaavorite. Sometimes it's not spicy enough but the flavor is always spot on. This is the only item I ever order here and I definitely get cravings for it! I always try to eat here if they're open whenever I'm in Japantown! Udon then boba = best lunch/dinner ever!", "rating": 5, "date": "2015-06-23"}, {"excerpts": ["Having also tried the Tokyo Ramen and Udon as well as the Suzu Ramen... ", "I would definitely recommend the latter! ", "(In retrospect, it seems \nobvious to order the namesake of the place...) "], "author": "Brenda Y.", "review": "Had such a nice time here with some friends who drove up from Los Angeles! Thank you so much for the warm welcome, SF. The service was friendly and prompt, and we were seated immediately. It's super cozy and simple inside; nothing fancy.\n\nI got the spicy ramen-- no special requests-- and it was delicious. I was satisfied by the serving size (drink your broth, people!), but if you're worried about the noodles not being enough, definitely hit up their combos, which are a great deal. \n\nHaving also tried the Tokyo Ramen and Udon as well as the Suzu Ramen... I would definitely recommend the latter! (In retrospect, it seems \nobvious to order the namesake of the place...) It was by far the most savory, and the potstickers were fantastic.\n\nExtraneous notes:\n*Order a soda means getting a can... which means no refills. I always wish I knew this kind of thing going into a restaurant, so here you go!\n*You know those ridiculous sparkly photobooth pictures that asian girls always take? There's a store upstairs in the same shopping mall that has like... 20 of those machines, seemingly imported straight from Japan. BEST $7 ever spent!", "rating": 4, "date": "2011-03-26"}, {"excerpts": ["Having the mild egg allergy I do and noting that their menu mentions that the ramen there are egg noodles, I got the veggie udon. ", "The broth and veggies were nothing to write home about (and ", "in fact, I think I make a better udon soup at home in that regard), but the consistency of their udon is what would bring me back here again. ", "Soft, but with that sort of al dente chew to it that can be called \"QQ\" (in the good/Asian sense). "], "author": "Stephanie C.", "review": "A ramen place with a vegetarian option--not something I come across often! I stopped by here with friends for dinner on a weeknight, having discovered that the place we were planning to go to had nothing on the menu I could eat (except maybe plain rice, sigh).\n\nHaving the mild egg allergy I do and noting that their menu mentions that the ramen there are egg noodles, I got the veggie udon. The broth and veggies were nothing to write home about (and in fact, I think I make a better udon soup at home in that regard), but the consistency of their udon is what would bring me back here again. Soft, but with that sort of al dente chew to it that can be called \"QQ\" (in the good/Asian sense). The omnivores thought their ramen was okay, and gave the place a \"B+\" in terms of the food.\n\nAnother thing about this place is that while the noodles come out good and hot, the service is kind of cold. Of the waitresses that stopped by to take our orders, bring our food, or refill our cups, I think exactly one smiled once. It wasn't bad service, but yeah, they aren't all that friendly-seeming and the dishes don't all come out at once, which can be awkward if you care about that sort of thing (I don't).", "rating": 3, "date": "2013-04-08"}, {"excerpts": ["You get your choice of ramen (Tokyo style), udon or soba (both traditional) and a small entree bowl of your choice (katsu, tonkatsu, curry, etc etc). ", "My boyfriend ordered the karrage ramen. "], "author": "Jackie F.", "review": "Delicious delicious delicious!!!!!!!!!!!\n\nI ordered the soba set, with a small donburi. You get your choice of ramen (Tokyo style), udon or soba (both traditional) and a small entree bowl of your choice (katsu, tonkatsu, curry, etc etc). My boyfriend ordered the karrage ramen. Everything was tasty!!!!!!!\n\nI love how some people just aren't cut out for the wait. It's like.....the place looks delish, why not just wait the 15 minutes?? I will say that I dislike the stragglers, the ones that linger after they've already finished. Slurp down your soup and GTFO. That's how I feel about noodle houses, especially crowded ones......\n\nI will come back here if in JapanTown and a hot bowl of ramen or soba calls my name. Of course, that is, if the call of another restaurant hasn't already snatched my attention.....", "rating": 5, "date": "2010-10-24"}, {"excerpts": ["Over-rated place with overcooked egg on the ramen, hard beef on the udon, super stingy on napkin, $1 for tap water. ", "And at the end they charge service charge 18% for 3 adults 2 small children. ", "Bah never again."], "author": "san h.", "review": "Over-rated place with overcooked egg on the ramen, hard beef on the udon, super stingy on napkin, $1 for tap water. And at the end they charge service charge 18% for 3 adults 2 small children. Bah never again.", "rating": 1, "date": "2015-05-01"}, {"excerpts": ["Very tasty ramen and udon noodles, with many combinations.   ", "We tried the ramen with vegetables, ramen with pork slices, all very good. ", "The udon with tempura was with a fish based broth, also very good. "], "author": "JJ B.", "review": "Very tasty ramen and udon noodles, with many combinations.   We tried the ramen with vegetables, ramen with pork slices, all very good. The udon with tempura was with a fish based broth, also very good. Put take the tempura out quickly or it will get soft:-)\n\nMy wife was bot in the mood for noodles so she had their plain tempura. The tempura by itself was very good, with the vegetables or shrimp perfectly cooked inside. Sometimes tempura has mushy batter, but not here, it's very well done, crispy dark golden crispy, not oily. \n\nStaff are very nice, kid friendly. \nYou might have to wait a little at busy times but there are plenty stores around to look into :-)", "rating": 4, "date": "2014-01-27"}, {"excerpts": ["Step 4: get table at Suzu and order soba, udon, or ramen with your choice of dish over rice.\n"], "author": "Alice L.", "review": "Suzu has quickly become my new bi-monthly ritual:\n\nStep 1: park car in front of Kabuki Springs on Geary\nStep 2: go to Kabuki springs and relax in the communal baths for minimum 1 hour.\nStep 3: drop off bag in car and walk 100 ft to Kinukuniya Center.\nStep 4: get table at Suzu and order soba, udon, or ramen with your choice of dish over rice.\nStep 5: enjoy and repeat in two weeks.\n\nI like that you can order half size sets of noodle plus rice dishes.  Most times I want both and now I can have it!  I like the soup in the hot soba, though it doesn't come with anything in it.  Hot ramen has a piece of pork and some veggies.  The mabo kaarage don is yum yum.  The set is about $12 (rice bowl + noodle soup).\n\nOnly reason I took off 1 star is because the servers are kinda moody and seem like they hate life.  Oh, and they don't do togo orders.", "rating": 4, "date": "2010-10-02"}, {"excerpts": ["Solid, well cooked Soba and Udon, generous, fresh vegetables, decent service, quick food on a Saturday night. ", "The Japantown mall setting doesn't do much for the eyes."], "author": "Surya G.", "review": "Solid, well cooked Soba and Udon, generous, fresh vegetables, decent service, quick food on a Saturday night. The Japantown mall setting doesn't do much for the eyes.", "rating": 4, "date": "2015-05-10"}, {"excerpts": ["After we got a table we were pretty set on what we wanted and I ended up getting the unagi avocado roll dinner combo with cold udon (since I felt a craving for cold udon for some reason).\n\n", "The udon came out to be cooked very nicely though, and the flavor was just wonderful. ", "Sadly I was still left pretty hungry after I finished though. ", "Good food, but I wish I had just a bit more."], "author": "Trung N.", "review": "While trying to convince my friends to go to another ramen place I liked elsewhere on the way back home, we ended up being too hungry to make the trip so we ended up staying and eating at Japantown instead. Having some prior pleasant experiences eating here before, I figured I offer the suggestion amongst my friends and we ended up grabbing food here.\n\nBeing quite a small place, there was a decent wait time as we waited to get seated. After we got a table we were pretty set on what we wanted and I ended up getting the unagi avocado roll dinner combo with cold udon (since I felt a craving for cold udon for some reason).\n\nThe roll came out and it was a decent small appetizer portion of 4 small pieces. Nothing too special about it. The udon came out to be cooked very nicely though, and the flavor was just wonderful. Sadly I was still left pretty hungry after I finished though. Good food, but I wish I had just a bit more.", "rating": 3, "date": "2010-08-16"}, {"excerpts": ["I like how they have combos where you can get something like a side of ma po tofu over rice, or curry, or salmon-don with your ramen or udon or soba (even though it's way too much food when you do get that!). ", "The only thing is they often have a wait, but many people go walk around the little mall while they wait...which means they skip down the list pretty quick. ", "The nice thing is that they don't always cross your name off the list if you're not there when they call your name, since so many people do that. ", "Overall, solid place for a meal."], "author": "Christine L.", "review": "Reasonable prices, flavorful ramens, combo meals! Sold!\n\nI trek a bit further from the pad to get to Suzu over Tanpopo for some ramen. Their ramen is yummy, satisfying, but I have to admit that I'm not a ramen snob. I like how they have combos where you can get something like a side of ma po tofu over rice, or curry, or salmon-don with your ramen or udon or soba (even though it's way too much food when you do get that!). The only thing is they often have a wait, but many people go walk around the little mall while they wait...which means they skip down the list pretty quick. The nice thing is that they don't always cross your name off the list if you're not there when they call your name, since so many people do that. Overall, solid place for a meal.", "rating": 4, "date": "2010-12-14"}, {"excerpts": ["PLUS your choice of noodle hot/cold ramen, udon, or soba with 1 slice of pork, green onions, dried seaweed, and bamboo shoot in a tasty pork broth. "], "author": "Karen P.", "review": "I believe this is the best place to eat compared to the other restaurants in the mall. Great deal on the Lunch Combo (10.95) for mini rice dish  (like with Tempura, Salmon Sashimi, Ugani, and there's more choices) PLUS your choice of noodle hot/cold ramen, udon, or soba with 1 slice of pork, green onions, dried seaweed, and bamboo shoot in a tasty pork broth. Great portion size. \n\nI tried the Salmon Sashimi over rice & ramen lunch combo. The salmon sashimi was soo good, it melted in my mouth. :)`  The ramen was delicious, a little al dente/chewy just the way I like my ramen. The broth was a little too greasy though. \n\nOverall experience: B", "rating": 4, "date": "2010-06-18"}, {"excerpts": ["You have a choice of noodle (ramen, soba, udon). "], "author": "Leanne K.", "review": "4 1/2 stars. I went two times in a weeks time. I think everyone who eats here always starts out in frustration because it is so hard to get a table here. The wait is always soooo long. There is only one cook, so the food comes out at a slow, but even pace in the order it's supposed to come out in.\n\nI love their lunch specials because you get an extra side dish with your ramen for the same price it would be for just the ramen at dinner time. I get the Salmon Don Noodle Combo. You have a choice of noodle (ramen, soba, udon). I always get ramen. \n\nThe salmon is fresh and when you combine that with the warm rice and a hint of wasabi, YUMMY! The ramen is filling. For people who really like salt, this dish is a little bland, so they have spices on your table you can add. I like it the way it is. \n\nTIP: Get there right when it opened at 11:30, then you'll get a table. or go close to 2:45pm and the line usually isn't so bad because they close after lunch at 3pm and people get frustrated and go somewhere else.", "rating": 4, "date": "2010-02-21"}, {"excerpts": ["This is a review of the one time I came here and ordered a combo special (in the $12-13ish range), which includes a noodle (ramen, udon, or soba) and some kind of donburi (rice dish). \n", "Since I had just come back from NYC and had high expectations (especially after Ippudo), I didn't want to ruin this place and order ramen, so I ordered the soba noodles instead.  "], "author": "Jeanne L.", "review": "This is a review of the one time I came here and ordered a combo special (in the $12-13ish range), which includes a noodle (ramen, udon, or soba) and some kind of donburi (rice dish). \nSince I had just come back from NYC and had high expectations (especially after Ippudo), I didn't want to ruin this place and order ramen, so I ordered the soba noodles instead.  I also got a salmon don. \n\nSince I couldn't resist, I did end up trying my friend's bowl of ramen as well.  The noodles in both the ramen and the soba were both firm and chewy in texture, which I love.  I actually have no complaints about the soba whatsoever.  The ramen was just ok.  The broth was simple, but nothing special.\n\nThe salmon don was very lackluster.  The fish didn't taste fresh.  This could have been due to the fact that the rice that it sat on was a bit too warm.  The rice was also lacking proper seasoning with rice vinegar and sugar.  \n\nThis place always seems to have a wait, which I don't understand, but hype does drive more hype.  I definitely won't be waiting half an hour to eat here again.  Heck, I probably wouldn't even if there was no wait.  There's plenty of other restaurants in Japantown to try.", "rating": 2, "date": "2011-10-27"}, {"excerpts": ["What would be better to chow down on than some good soup (udon/ramen)?\n\n", "My eating partner ordered the Vegetable Udon. ", "I didn't really like it too much because the vegatables were overpowering just like the pork in my ramen. ", "I would recommend just getting regular udon to appreciate the soup and delicious, chewy noodles.\n\n", "Supposedly this is one of the best places to get ramen/udon. ", "I would disagree though given that I've had ramen all over California and even in Japan. "], "author": "Marlon T.", "review": "This place usually has a line which means it's worth waiting for.\n\nI came here on July 4th and I was freezing because I was only wearing shorts and a T-shirt. What would be better to chow down on than some good soup (udon/ramen)?\n\nWe waiting about 20 minutes to get a table. The place is small and it feels like they can have more tables--but whatever. We finally got to sit down in the warm room and anticipated delicious noodles and soup.\n\nI ordered the Chashu Ramen. I feel that the taste of the pork was overpowering. Retrospectively, I would have ordered the Miso Ramen or the Tokyo Ramen--I feel that they would have been more balanced and tasteful. My eating partner ordered the Vegetable Udon. I didn't really like it too much because the vegatables were overpowering just like the pork in my ramen. I would recommend just getting regular udon to appreciate the soup and delicious, chewy noodles.\n\nThis is one of those places you always pass up if frequent Japantown but never think about eating here. Supposedly this is one of the best places to get ramen/udon. I would disagree though given that I've had ramen all over California and even in Japan. Albeit, this place is about a little over average (3.5).\n\nLastly, service was great!", "rating": 4, "date": "2010-07-06"}, {"excerpts": ["My fiance always gets the udon pot and it is almost always so hot that he cannot start eating until Im already halfway thru. ", "This place is hands down the best ramen you can get n japantown . ", "The also have a few udon, appetizers, etc.."], "author": "L V.", "review": "This place always has a wait, but if you go early in the day you can usually have little (10 min) to no wait. I always get the spicy ramen with the miso broth and its amazing! Although there have been several times that its completely lacked in salt. If adding a lot of extra salt doesn't bother you, get the spicy ramen! It is very spicy but for someone that considers themselves to like spicy things, its very tolerable. My fiance always gets the udon pot and it is almost always so hot that he cannot start eating until Im already halfway thru. This place is hands down the best ramen you can get n japantown . The also have a few udon, appetizers, etc..", "rating": 4, "date": "2014-05-24"}, {"excerpts": ["The waitress told us only with the udon. ", "This actually makes no sense to me - if they have chicken broth for the Udon, why can't they use it for ramen? ", "Anyway, we both just gave in and settled for the pork broth. ", "You have to choose a broth flavor as well - soy sauce, miso, or salt. ", "My friend who got the soy said it was a bit bland, but my friend with the miso really liked it. ", "I got the soy as well ", "but I ordered the spicy ramen, so in the end all I could taste was spice! ", "I'll be honest, it was a tad too spicy for me ", "- the noodles were good but there was so much spice I had trouble sipping the broth. ", "It was also an unnaturally bright red color and I ended up doing a napkin bib to avoid staining my shirt! "], "author": "Lindsey B.", "review": "Okay but not spectacular. I came here last night after having drinks at a bar around the corner. I was craving something hot due to the chilly and foggy weather (ie. summer in SF). I had been here a few times before and knew the ramen was standard, so it was an easy decision.\n\nWe didn't have to wait long considering it was a Saturday night (even though the place is pretty tiny). It's located right inside the Japantown mall so I imagine it gets a lot of traffic. My friend and I don't eat pork so we asked if there was a chicken broth available instead. The waitress told us only with the udon. This actually makes no sense to me - if they have chicken broth for the Udon, why can't they use it for ramen? Anyway, we both just gave in and settled for the pork broth. You have to choose a broth flavor as well - soy sauce, miso, or salt. My friend who got the soy said it was a bit bland, but my friend with the miso really liked it. I got the soy as well but I ordered the spicy ramen, so in the end all I could taste was spice! I'll be honest, it was a tad too spicy for me - the noodles were good but there was so much spice I had trouble sipping the broth. It was also an unnaturally bright red color and I ended up doing a napkin bib to avoid staining my shirt! The space can get really stuffy and hot inside, add in the hot tea and hot soup and I was sweating by the end of the meal.\n\nOverall I think this place can be good, but there are a lot of choices and you have to know what to order.", "rating": 3, "date": "2014-08-03"}, {"excerpts": ["Loved the Nabyaki Udon. ", "Huge portion served very hot (excellent post movie, rainy SF day choice.)"], "author": "Beth J.", "review": "Small noodle house inside Japantown. Loved the Nabyaki Udon. Huge portion served very hot (excellent post movie, rainy SF day choice.)", "rating": 5, "date": "2014-12-19"}, {"excerpts": ["I ordered the tempura udon -- the tempura batter was just right, not too thick or thin; the udon noodles were cooked just tender enough (and the menu says they're handmade - impressive & yummy!); and the udon broth was tasty.  "], "author": "Maile N.", "review": "I would definitely come back here!  I ordered the tempura udon -- the tempura batter was just right, not too thick or thin; the udon noodles were cooked just tender enough (and the menu says they're handmade - impressive & yummy!); and the udon broth was tasty.  Love it!  \n\nLuckily before our movie at the Kabuki we were able to get a table right away, were served efficiently and made our way to our show just in time!  It's a small place so you have to catch it at just the right time -- put your name down on the waitlist asap on arrival.\n\nDinner+tax+tip = $13", "rating": 5, "date": "2009-07-28"}, {"excerpts": ["I love the soba noodles, and udon noodles. ", "Super large amount of food for about 12-13 bucks. ", "Definitely a Japantown spot worth going to. ", "YAY"], "author": "Julia D.", "review": "This has become one of my new favorite places. I came here before a movie at the Kabuki. The list was a little long but went fast. Pro tip: don't walk away because they will give away your table. I love the soba noodles, and udon noodles. Super large amount of food for about 12-13 bucks. Definitely a Japantown spot worth going to. YAY", "rating": 5, "date": "2013-12-21"}, {"excerpts": ["The Japanese curry udon is incredible."], "author": "Kirk J.", "review": "Fantastic noodles. My girlfriend and I eat here at least once a month. The Japanese curry udon is incredible.", "rating": 5, "date": "2014-12-28"}, {"excerpts": ["I'm still fairly new to the wonderful world of noodles (specifically ramen, udon, and soba variety anyways) but I am beginning to figure out what I do and don't like.\n", "I hate to say it but "], "author": "Dan B.", "review": "Going out to eat with my sister inevitably ends with either one or both of us overly stuffed bellies and mass amounts of left overs.\nOur latest battleground, Suzu Noodle House.\n\nHere's the review after feasting on noodles, appetizers, and tempura:\n\nI'm still fairly new to the wonderful world of noodles (specifically ramen, udon, and soba variety anyways) but I am beginning to figure out what I do and don't like.\nI hate to say it but the noodles here was mediocre - under seasoned broth, okay tasting ramen, and super salty chasu.\n\nIt's a cool looking restaurant.  The location is ideal if you want to grab a quick bite before a movie (quick being dependent on the waiting list, of course).  And the plethora of positive reviews from yelp would have you believe you were in for a treat.\n\nUnfortunately, Suzu reminded me more of Majikku Ramen - more look than substance.\n\nOverall, I liked the tempura and might even go back for more.  It was crispy without being soaked in oil.\nThe thing is Suzu is suppose to be known for their noodles, right?", "rating": 3, "date": "2009-03-09"}, {"excerpts": ["The miso nabeyaki udon was very flavorful but there was a bit too much tempura floating in it. ", "My husband ordered katsudon and was disappointed it didn't have the eggs and green onions like he was used to. ", "Still, it was good. "], "author": "Lau B.", "review": "This place was busy busy! We had a short wait after writing our names on the clipboard by the door. It was a longer wait to get our order in to the poor overwhelmed server. \n\nThe miso nabeyaki udon was very flavorful but there was a bit too much tempura floating in it. My husband ordered katsudon and was disappointed it didn't have the eggs and green onions like he was used to. Still, it was good. Mom ordered the pork ramen with soba noodles instead and said it was tasty but not earth-shattering.\n\nAll in all, tasty food but not the absolute best. I think I've been spoiled by my local ramen house!", "rating": 3, "date": "2011-10-19"}, {"excerpts": ["Definitely recommend you take advantage of their combo special where you get to start off with a choice of a basic noodle-y dish (udon, ramen, or soba) accompanied by a small but packed rice bowl of your choice (ranging from donburi to chicken katsu, tuna, or curry). "], "author": "Betty W.", "review": "Definitely recommend you take advantage of their combo special where you get to start off with a choice of a basic noodle-y dish (udon, ramen, or soba) accompanied by a small but packed rice bowl of your choice (ranging from donburi to chicken katsu, tuna, or curry). The portions are very decent for what you pay (around 11-13 dollars) and it's more than ample enough to fill you up.\n\nUnfortunately it only adequately fills you up as opposed to satisfyingly or even sufficiently filling you up. Their food, from what I've tried, is generic-good at best. Their ramen is fairly sub-par, though not horrible on a freezing cold SF night (aka every night) when you want a hot bowl of noodle soup. I've just had way, way better elsewhere. The broth is salty and uninspired, though, and the pork slices are salty and overcooked/too lean, while the noodles are just kind of . . . there.\n\nI'm doing a really good job of selling this place, I know, but it's always fairly packed and the hot tea refills are consistent, so it's not too bad. Not amazing, but if you have to have a quick meal somewhere in Japantown, it's alright. What's the Yelp commentary correlated with a 3-star rating? Oh, right: A-OK.", "rating": 3, "date": "2010-12-24"}, {"excerpts": ["Been here several times and tried a variety of dishes including several different ramen and udon, katsu curry, karaage, takoyaki, gyoza and more. ", "Authentic and extremely flavorful; the soups are rich and complex. ", "Unagi don was especially memorable. ", "Not so memorable are both the atmosphere and the service, but neither are bad enough to diminish the overall experience. ", "Well worth a visit!"], "author": "Josh H.", "review": "Been here several times and tried a variety of dishes including several different ramen and udon, katsu curry, karaage, takoyaki, gyoza and more. Authentic and extremely flavorful; the soups are rich and complex. Unagi don was especially memorable. Not so memorable are both the atmosphere and the service, but neither are bad enough to diminish the overall experience. Well worth a visit!", "rating": 4, "date": "2014-06-09"}, {"excerpts": ["If you are looking for delicious mouth watering udon...", "Word of advice - do not get the beef nabeyaki udon. ", "The meat is in these large gooey cubes, super tough and frankly disgusting. ", "It has no business being in a soup broth.  ", "It tasted spoiled as well. ", "I complained about it and the waitress admitted that it wasn't well received.  ", "I asked why they served it then ", "and she said some people eat it all up.  ", "Id like to know who and treat them to a decent meal! ", "She said I should try something else next time and I told her flat out there will not be one.  ", "She finally gets the point and asked if I wanted a discount on my meal (did she really need to ask?!) ", "I said if you like ", "and then when I get my final bill...no discount whatsoever! ", "I still gave some tip because I can't help myself not because she deserved it.  ", "Needless to say the service matched my feelings for the meal....", "I have to admit SF does not offer a lot of great options/selections when it comes to udon and I've looked far and wide.  ", "If you are on a diet and looking to throw back up your meal, Suzu might be the place for you."], "author": "Joanna C.", "review": "If you are looking for delicious mouth watering udon...Suzu is not the place for you! \n\nJust left the establishment and my meal isn't sitting well.  I might (will) throw it back up once I return home.  Word of advice - do not get the beef nabeyaki udon. The meat is in these large gooey cubes, super tough and frankly disgusting. It has no business being in a soup broth.  It tasted spoiled as well. I complained about it and the waitress admitted that it wasn't well received.  I asked why they served it then and she said some people eat it all up.  Id like to know who and treat them to a decent meal! She said I should try something else next time and I told her flat out there will not be one.  She finally gets the point and asked if I wanted a discount on my meal (did she really need to ask?!) I said if you like and then when I get my final bill...no discount whatsoever! I still gave some tip because I can't help myself not because she deserved it.  Needless to say the service matched my feelings for the meal....a big F!\n\nI have to admit SF does not offer a lot of great options/selections when it comes to udon and I've looked far and wide.  If you are on a diet and looking to throw back up your meal, Suzu might be the place for you.", "rating": 1, "date": "2015-08-12"}, {"excerpts": ["So our table got three combos (ramen/soba/udon + a donburi). ", "I specifically asked (since I didn't remember) which ramen the combo comes with; I asked if I can pick any of the ramen flavors. "], "author": "Dom L.", "review": "Still one of the tastier ramen house in J-town, but slipping in my ratings book due to poor service/communication and portions that seem to get smaller and smaller. The broth was very salty today too. That plus the wait plus the cost versus what you get and I don't know if I will be back anytime soon. \n\nSo our table got three combos (ramen/soba/udon + a donburi). I specifically asked (since I didn't remember) which ramen the combo comes with; I asked if I can pick any of the ramen flavors. The waitress said I can pick any one of the ones on top;  just not the ones around $12. \n\nSo I ordered one Tokyo ramen and two cha-shu ramen. When the first one came out, I looked at it and I thought it was cha-shu so I gave it too my nephew, than the next two came out and they all look identical. I asked the waitress which one was the Tokyo ramen and she didn't know. Then she said 'oh wait', two of those are tokyo and the other is cha-shu. And I looked carefully and the cha-shu one has two extra pieces of cha-shu. So I asked what's the difference? And where is my egg? I was told that the combo size ramen doesn't come with egg! Which ticks me off (even though this happened last time I ate here but I guess I had a better experience so I didn't remember that part) because nowhere on the menu does it say that. So we tell the waitress we what we really ordered and she was nice enough to bring us several extra pieces of cha-shu. Little did I know that the there is an extra $2 surcharge for this. So the combo costs $13 for a small bowl of ramen and a smaller bowl of donburi plus a $2 surcharge. That's $15 per person. For ramen. Yikes!\n\nWe also ordered two plates of gyoza which definitely wasn't as good as last time. First they came out as soon as I ordered them - which I feared made them not freshly made. My fears were confirmed when they were not crunchy on the bottom at all and they were lukewarm at best. If everyone at my table (especially my son) wasn't so hungry, I might have sent them back.\n\nSo I'm out $67 (three combos+2 gyozas) and I'm still hungry afterwards. That to me is the epitome of a bad eating experience.", "rating": 2, "date": "2011-03-27"}, {"excerpts": ["We ordered a bowl of udon and ramen (off of the lunch specials menu).  ", "The udon broth was slightly sweet, the noodles were cooked perfectly, chewy, hot, delicious.  ", "The ramen was in a saltier broth and it was perfect as well.  ", "We split the two bowls between the three of us and "], "author": "Rachael B.", "review": "Oh how I miss ramen.  In Colorado, we don't have many options for even decent ramen.  We came to Japantown specifically for ramen, almost went to the place on the second level but saw there was no line for a table at Suzu.  \n\nWe ordered a bowl of udon and ramen (off of the lunch specials menu).  The udon broth was slightly sweet, the noodles were cooked perfectly, chewy, hot, delicious.  The ramen was in a saltier broth and it was perfect as well.  We split the two bowls between the three of us and I could've easily polished off two on my own (I say that now, but the portion size was great, not too huge, not too small).\n\nService was fast, food was great, staff was helpful.  I'd definitely come back and will recommend Suzu to people traveling to SF!", "rating": 3, "date": "2011-08-30"}, {"excerpts": ["I opted for the udon & tekka don.  ", "The udon was awesome - al dente, overall great.  ", "The tekka don was a waste - I would NOT recommend.  ", "The boy's ramen was good & kaarage mapo tofu don was solid - spicy, flavorful.  "], "author": "Meredith K.", "review": "I was hyped to finally wait in a short line to dine here.  Friday night at 8pm, 10 min wait - yay!  \nI thought I'd get a combo to try more...but I have a feeling it wasn't the best idea.  I opted for the udon & tekka don.  The udon was awesome - al dente, overall great.  The tekka don was a waste - I would NOT recommend.  The boy's ramen was good & kaarage mapo tofu don was solid - spicy, flavorful.  Next time, we decided to opt for a single noodle dish instead of trying a combo.  \n\n(Note to self: re-yelp on 2nd visit and hope for 4-5 stars)  \nFrom my experience, this is one of the best noodle houses in SF that I've been to.", "rating": 3, "date": "2011-08-27"}, {"excerpts": ["In descending order of our choices this evening:\nNabeyaki udon - Definitely the highlight, great broth.\n", "Unagidon with soba - Also a well-balanced broth, prefer the soba noodles to the udon.\n", "Karaage chicken curry - Very tasty as noted in many reviews.\n"], "author": "John M.", "review": "Between the horror stories of the service and the wait, we were more than lucky, especially considering we had a party of 7. They definitely present a vibe of \"eat, pay, and leave,\" but our procedure is typically to eat, pay, and leave, so it works for me. Also as to portion size, it's perfectly fine for the cost, and the last thing Americans need to do is eat more. \n\nIn descending order of our choices this evening:\nNabeyaki udon - Definitely the highlight, great broth.\nUnagidon with soba - Also a well-balanced broth, prefer the soba noodles to the udon.\nKaraage chicken curry - Very tasty as noted in many reviews.\nMiso ramen - Solid, a bit salty.\n\nI don't know enough about local noodle houses to put this place in context, but if I worked around here I'd stop in for lunch regularly, if not passionately.", "rating": 3, "date": "2009-01-17"}, {"excerpts": ["First time I had udon, it was delicious. ", "Second time I chose ramen and there was this eggy taste ", "I wasn't too fond of. ", "Plus their soup tasted exactly the same as the kind they used for the udon noodles (maybe even less flavour) which had me upset. \n\n"], "author": "Christal Y.", "review": "First time I had udon, it was delicious. Second time I chose ramen and there was this eggy taste I wasn't too fond of. Plus their soup tasted exactly the same as the kind they used for the udon noodles (maybe even less flavour) which had me upset. \n\nThere's usually a long line, but it's not due necessarily to it's popularity. More like the small space and slow service. Depends on who you get, you can have a good or bad experience - unfortunately that speaks for Suzu as a whole.... \n\nno consistency... \n\nOne thing I couldn't stop eating though: Karaage chicken. So yum! Other places have just batter, but this is real, juicy chicken.", "rating": 3, "date": "2011-07-20"}, {"excerpts": ["I usually get their great deal on ramen, udon, or yaki-soba and a side of rice and assorted dishes.  ", "Their ramen is good, flavor-full, and will fill you up.  "], "author": "Reb R.", "review": "I love this place for their perfectly priced ramen and a side entree.  When I come here, the wait is a bit long as it's usually packed with people, but it's definitely worth the wait.  Located right in Japantown, you can browse the other stores before they call your name. \n\nI usually get their great deal on ramen, udon, or yaki-soba and a side of rice and assorted dishes.  Their ramen is good, flavor-full, and will fill you up.  Plus their side dishes can include unagi, teriyaki chicken, tempura, or chicken katsu and rice.. all for around $11 or $13!! \n\nIt's a bit small, but intimate enough for a party of 2 or 4.", "rating": 4, "date": "2011-08-11"}, {"excerpts": ["I ordered the chicken karage and miso nabeyaki udon at the recommendation of the waitress. ", "The miso nabeyaki udon was very good and rich with flavor. ", "Maybe a little too thick because I couldn't drink too much of the soup. "], "author": "Momo C.", "review": "I'd give this a place a 3.5.\n\nCame 30 minutes before closing and the restaurant was filled with people. We sat out on the \"patio\" instead of waiting for a table inside.\n\nI ordered the chicken karage and miso nabeyaki udon at the recommendation of the waitress. The miso nabeyaki udon was very good and rich with flavor. Maybe a little too thick because I couldn't drink too much of the soup. Could use some more vegetables in my opinion. \n\nThe karaage didn't come out until we were halfway through our meal and I even had to go inside the restaurant to catch a server's attention to ask where our karage was. She came back after 5 minutes and said that the kitchen was backed up with orders and it would come out shortly. However, I am pretty sure the first waitress just forgot to order it and lied about the kitchen thing because the appetizers from tables who sat down after us arrived in a timely manner. I'm also a server and I forget to put in orders too, servers are human after all, but there was no need to lie about it.\n\nOverall, the food is good. But I am disappointed in service. The server who took our order never checked on us and the staff only started paying more attention to us after the karage incident. I don't recommend sitting out in the patio if you want more attention.", "rating": 3, "date": "2011-07-31"}, {"excerpts": ["I got the plain hot udon and the salmon mini donburi. ", "the rest of my group got the miso ramen with either a unagi mini donburi or tuna mini donburi.  ", "The food came out pretty fast, and they served tea.  ", "I enjoyed my udon, and the broth was good.  ", "The salmon donburi was decent.\n", "My companions said the ramen noodles were a bit thicker than they usually have, and their broth was really salty.  "], "author": "A F.", "review": "Wow! this place was busy sunday night.  I was in a party of 4 and we had to wait 45 minutes to get a table.  We got seated right in front of the door so there were cold blasts of air...anyway, more on the food.\n\nI got the plain hot udon and the salmon mini donburi. the rest of my group got the miso ramen with either a unagi mini donburi or tuna mini donburi.  The food came out pretty fast, and they served tea.  I enjoyed my udon, and the broth was good.  The salmon donburi was decent.\nMy companions said the ramen noodles were a bit thicker than they usually have, and their broth was really salty.  But they also admitted that it was miso, and if they ate the noodles and broth with the green onions, it cut down the saltiness a lot, which helped make it more enjoyable.\n\nI would have given 4 stars, but we had to keep flagging down servers to get refills on tea and to take our order...but they were nice about splitting the check. I'll be back to try other items on the menu.", "rating": 3, "date": "2012-03-27"}, {"excerpts": ["Their menu offers so many varieties of ramen, soba, udon and don- not to mention combination lunches and dinner for only $10.95!  ", "Their broth is so flavorful and their noodles is cooked just right- ", "it has a bite to it. ", "NOT SOGGY like other noodle houses. ", "This is one of the few places where I don't stick to just one item on the menu. ", "I know for the most of us, we're so comfortable with ordering what we had the first time that we naturally to back to what is \"safe\". ", "I've actually tried the salmon don, Tokyo ramen, pea shoot ramen, karaage Ramen, and the chashu ramen. "], "author": "Jenny K.", "review": "I'm sorry, but Suzu beats Ka-tanaya. I really think so. I really enjoy their ramen and the cha shu is one of the best I've had in the city. Yes, the line can be pretty ridiculous but the food really makes up for it. \n\nTheir menu offers so many varieties of ramen, soba, udon and don- not to mention combination lunches and dinner for only $10.95!  Their broth is so flavorful and their noodles is cooked just right- it has a bite to it. NOT SOGGY like other noodle houses. This is one of the few places where I don't stick to just one item on the menu. I know for the most of us, we're so comfortable with ordering what we had the first time that we naturally to back to what is \"safe\". I've actually tried the salmon don, Tokyo ramen, pea shoot ramen, karaage Ramen, and the chashu ramen. Not disappointed with any of them!\n\nSuzu, you are my go-to spot when I'm in dying need for ramen.", "rating": 4, "date": "2010-06-22"}, {"excerpts": ["Udon is another at the top of my list especially if i can get my tempura on the side. ", "It took me a while to warm up to ramen ", "but I'm starting to come around. ", "It might even end up at the top of my list!\n", "Suzu has become my go to ramen joint in Japan town. ", "There's always a bit of a wait ", "but to me it's worth it. ", "They have the best Karaage that I've had anywhere, very crispy, well seasoned and fresh. ", "The ramen noodles are dense and chewy, the broth is rich and flavorful. ", "Last time I got the spicy ramen which is soooo goood and soooo spicy!\n", "You know how there's a point when spicy food goes from deliciously spicy to masochistic? "], "author": "Melanie V.", "review": "Recently I've been on a \"which noodle soup do I like best?\" kick. For a long time it was pho, no question. I think living in SF has changed that. There's just not the quality of pho in SF as there is in SJ. Udon is another at the top of my list especially if i can get my tempura on the side. It took me a while to warm up to ramen but I'm starting to come around. It might even end up at the top of my list!\nSuzu has become my go to ramen joint in Japan town. There's always a bit of a wait but to me it's worth it. They have the best Karaage that I've had anywhere, very crispy, well seasoned and fresh. The ramen noodles are dense and chewy, the broth is rich and flavorful. Last time I got the spicy ramen which is soooo goood and soooo spicy!\nYou know how there's a point when spicy food goes from deliciously spicy to masochistic? well the spicy ramen is just before that point. \n\nLet me illustrate:\n\n\n-------------------------------------------- - Masochistic spicy\n           ----------------------------- - Suzu spicy ramen\n\n\nDoes that help?\n\nSo far I like the ramen at suzu better than the ramen at Santa Ramen, which may be blasphemy, I know, but what can I say? I likes what I likes.", "rating": 4, "date": "2010-05-17"}, {"excerpts": ["My wife had the Udon and it was nothing special either."], "author": "Edward L.", "review": "I had the miso ramen but was not too impressed with broth.  There wasn't much depth of flavor.  My wife had the Udon and it was nothing special either.", "rating": 3, "date": "2013-11-05"}, {"excerpts": ["The noodles and broth were both very good -- I liked the udon more than the ramen -- but for the price I expected a way more satisfying meal."], "author": "Annie F.", "review": "I would lean more towards a 2.5...\n\nLike the other reviewers mentioned, the dishes here are heavy on broth & noodles, and short on the stuffing. I've been twice in the last week or so; the first time I got the beef & vegetable ramen, and the second the chicken & veggie.\n\nBoth dishes were pretty sparse on the veggie. I think the chicken dish had approximately 3 zucchini slices and 1 broccoli floret. I don't even remember any in the beef. As for the amount of meat, the chicken had barely a full chicken thigh in it, and the beef about 6 strips. Pretty low for the hefty 12$+ price tag.\n\nThe noodles and broth were both very good -- I liked the udon more than the ramen -- but for the price I expected a way more satisfying meal.", "rating": 2, "date": "2011-03-16"}, {"excerpts": ["My friend ordered the unagi and udon combo. ", "He said it was delish. ", "I believe him since he loves noodles too and can be picky. \n", "Service was decent. ", "We had to ask for tea several times. ", "That was a bit annoying.\n", "The waitress recommended the cold udon and shrimp and veggie tempura. ", "It sounded good and I will try it next time. ", "I'm sure it will be good when the weather gets warmer."], "author": "Molly T.", "review": "This is my second ramen meal for this week. \n\nI was not satisfied with my last meal somewhere else. So this was a place that I always had a good experience. I needed to satisfy my ramen craving. I ordered my usual..spicy ramen. It comes with a piece of pork, some green onions, bamboo shoots, and lots and lots of spice!! The broth was super spicy hot....just the way I like it especially on a cold night like tonight. The ramen noodles were perfect and did not get soggy 10 minutes into the meal. Perfect! My friend ordered the unagi and udon combo. He said it was delish. I believe him since he loves noodles too and can be picky. \nService was decent. We had to ask for tea several times. That was a bit annoying.\nThe waitress recommended the cold udon and shrimp and veggie tempura. It sounded good and I will try it next time. I'm sure it will be good when the weather gets warmer.", "rating": 4, "date": "2010-04-08"}, {"excerpts": ["I ordered the nabayaki udon and it was *shrug", "Maybe my mistake was ordering udon... was the hype all about the ramen? ", "I guess I will have to try again to find out."], "author": "Crystal S.", "review": "I came here during the Nihonmachi Street Fair. We waited about 30-40 minutes during peak lunch time (12-1pm).\n\nI knew there was a lot of hype about this restaurant so I wanted to give it a try. Anyway I was pretty disappointed as I didn't really see anything special about the place. I ordered the nabayaki udon and it was *shrug* eh.... the soup wasn't very flavorful... tasted more on the watery side than brothy side.\n\nMaybe my mistake was ordering udon... was the hype all about the ramen? I guess I will have to try again to find out.", "rating": 2, "date": "2010-08-24"}, {"excerpts": ["Even udon, which normally bores me, is perfectly done here. \n\n"], "author": "Diana H.", "review": "My favorite ramen spot. The noodles are fresh and have the perfect texture. I've tried most of the different flavors broths, but my favorite is always miso. The bottom of the bowl is always a little sad. \n\nEven udon, which normally bores me, is perfectly done here. \n\nYou will probably have to wait if you don't come early enough, and they are closed on some random weekday. Check the hours before you go. \n\nSave room for dessert, Sophies Crepes are right upstairs!", "rating": 5, "date": "2010-06-22"}, {"excerpts": ["For just $3 or $4 more, you can get a dinner combo that includes a big bowl of ramen (or soba or udon noodles but no meat), and a side bowl of rice with something on it. ", "Like the Tonkatsu. "], "author": "Cindy W.", "review": "Cold SF temps makes for a perfect ramen night. Trying to stave off the chill from my bones, I was excited to find a table waiting at the typically line out the door Suzu. \n\nI had my heart set on ramen, going with Tokyo Ramen ($8.95). My large bowl contained thick chewy ramen, a slice of cha shu (agree that there should be more of it), bamboo shoots, wakame (seaweekd), half of a hard boiled egg, and some negi (green onions) for flavor. The highlight for me was the broth, a sweet savory blend of chicken and pork broth. Great flavor! Really enjoyed spooning all of the tasty warm liquids.\n\nFor just $3 or $4 more, you can get a dinner combo that includes a big bowl of ramen (or soba or udon noodles but no meat), and a side bowl of rice with something on it. Like the Tonkatsu. It's a great deal and exceptionally filling.\n\nI like the authentic nature of this small ramen shop. Easy comfort food that fast and filling. Just be willing to wait or come at off hours.", "rating": 4, "date": "2010-09-09"}, {"excerpts": ["For a mere $8.99 you can procure a gigantuan bowl of ramen or udon (excellent broth!) ", "accompanied by curry over rice or whatever over rice dish it is you fancy. ", "Oher choices include tuna sashimi, unagi and tonkatsu.\r\n\r\n", "This combination deal has many choices, and makes me happy every time.\r\n\r\n", "I only wish they'd serve the tempura sauce on the side to prevent sogginess."], "author": "Miriam W.", "review": "One of my favorite places for lunch in the City. For a mere $8.99 you can procure a gigantuan bowl of ramen or udon (excellent broth!) accompanied by curry over rice or whatever over rice dish it is you fancy. Oher choices include tuna sashimi, unagi and tonkatsu.\r\n\r\nThis combination deal has many choices, and makes me happy every time.\r\n\r\nI only wish they'd serve the tempura sauce on the side to prevent sogginess.", "rating": 4, "date": "2005-10-15"}, {"excerpts": ["I love noodles...especially ramen and udon!  ", "I haven't had the udon here, but the ramen was delicious.  ", "I had the kaarage ramen, and the kaarage fried chicken (lightly fried chicken...in kind of a sweet batter) ", "is super tasty.  "], "author": "Wendy L.", "review": "Yumilicious.  I love noodles...especially ramen and udon!  I haven't had the udon here, but the ramen was delicious.  I had the kaarage ramen, and the kaarage fried chicken (lightly fried chicken...in kind of a sweet batter) is super tasty.  The noodles are made fresh daily, and you can taste the difference.\n\nThis is no Top Ramen!  The wait isn't too long, but there are only a few tables (6-8 tables).", "rating": 4, "date": "2006-11-27"}, {"excerpts": ["I got the cold udon, which was great. ", "The rest of my family got ramen that tasted fantastic. ", "It's a cute little spot and perfect before you walk around Japantown."], "author": "Morgan T.", "review": "The noodles are super tender and perfectly cooked. I got the cold udon, which was great. The rest of my family got ramen that tasted fantastic. It's a cute little spot and perfect before you walk around Japantown.", "rating": 4, "date": "2013-05-29"}, {"excerpts": ["My order was one of the best udon dishes I've ever had.  ", "The udon noodles were the perfect texture, soup was super tasty, it was yum!  ", "Portion was huge too ", "and I could have avoided ordering the sashimi to start if I knew how large the soup would be.  ", "It took me like 10 minutes to decide on ordering the miso nabe yake udon.  ", "Heh!"], "author": "Michelle N.", "review": "I'm in love!  Again!\n\nOne of my best friends introduced me to this place last Friday.  I ordered the Miso Nabe Yaki Udonand salmon/tuna sashimi to start.  The others ordered the Karaage Ramen.  My order was one of the best udon dishes I've ever had.  The udon noodles were the perfect texture, soup was super tasty, it was yum!  Portion was huge too and I could have avoided ordering the sashimi to start if I knew how large the soup would be.  The salmon sashimi was really good...it even had a buttery flavor.\n\nI'd definitely return as there were several items on the menu that I wanted to try.  It took me like 10 minutes to decide on ordering the miso nabe yake udon.  Heh!", "rating": 4, "date": "2009-11-09"}, {"excerpts": ["They have some great lunch combos for $10.95 and up, which include a small rice bowl and a bowl of  ramen/udon/soba. ", "I ordered the tonkatsu and ramen, which was probably a mistake. ", "The tonkatsu was a bit too crispy for my taste. ", "The ramen was super generic and I got ONE piece of pork and probably 3 bamboo shoots. "], "author": "Jen C.", "review": "We waited a good 30 minutes before getting seated. This place is TINY! There are less than 10 tables in this hole in the wall. The waitresses were super nice and the service was great. 5 Stars for that.\n\nI was FAMISHED and so ready to eat, and of course, ordered more than I should have. They have some great lunch combos for $10.95 and up, which include a small rice bowl and a bowl of  ramen/udon/soba. I ordered the tonkatsu and ramen, which was probably a mistake. The tonkatsu was a bit too crispy for my taste. The ramen was super generic and I got ONE piece of pork and probably 3 bamboo shoots. The noodles were al dente (read: good), but nothing special. \n\nI do wish I had gotten the salmon or tuna combo instead. Overall, 3.5 stars (Yelp should really allow for half stars!).", "rating": 3, "date": "2010-03-14"}, {"excerpts": ["Asked for veggie broth with udon, and they couldn't do it"], "author": "emma w.", "review": "Very unaccomadating. Asked for veggie broth with udon, and they couldn't do it", "rating": 3, "date": "2015-04-03"}, {"excerpts": ["Suzu's udon, unagi-don, and unagi-cucumber roll totally kick butt. ", "Chewy udon noodles, delicious broth, soft hot eel...delish!\n\n", "The udon is super nommy. ", "i nom-inate it."], "author": "Jade L.", "review": "Suzu's udon, unagi-don, and unagi-cucumber roll totally kick butt. Chewy udon noodles, delicious broth, soft hot eel...delish!\n\nEh, but i do NOT like the ramen. Had it about 2 or 3 times and was consistently underwhelmed. Not a fan of the limp noodles nor of the mediocre broth. \n\nBut dude. The udon is super nommy. i nom-inate it.", "rating": 4, "date": "2010-06-29"}, {"excerpts": ["Wow. can't believe I didn't write this place up!\ncheap Udon with curry.\n"], "author": "Sophia Y.", "review": "Wow. can't believe I didn't write this place up!\ncheap Udon with curry.\nyum!\n\nif you want to spend more $$, go to Maki upstairs. but this is good when maki is full or you don't want to spend that much...", "rating": 4, "date": "2010-09-29"}, {"excerpts": ["The price is around $11.95-$13.95 and you can get a small bowl of rice / sashimi or sushi rolls plus a bowl of regular ramen/udon/soba!  ", "The portions were small but still able to fill you up.  ", "I highly recommend their udon noodles, very chewy and tasty. \n\n"], "author": "Liza T.", "review": "ALWAYS ALWAYS A LINE........Went there around 8:45pm last Sat and there was still a line (please note they closed at 9:30pm)!  My friend and I waited 20 minutes for a table....Unbelievable! \n\nFinally, we were seated, gotten our menu, and the waitress gave us water.  The waitresses are nice but very SLOW.  It even took them another 10 minutes to place our order.......The lunch/dinner combinations are pretty good deal.  The price is around $11.95-$13.95 and you can get a small bowl of rice / sashimi or sushi rolls plus a bowl of regular ramen/udon/soba!  The portions were small but still able to fill you up.  I highly recommend their udon noodles, very chewy and tasty. \n\nOverall I'm definitely happy with this place and will be going back for sure (of course avoid the peak hours)!", "rating": 4, "date": "2009-12-17"}, {"excerpts": ["They also have udon and other stuff I may try later.  ", "I'm told the mapuo ramen is good.  ", "I will be back, many, many times.  ", "I prefer this place over the Dojo so far because I like the traditional ramen more than the crazy Dojo-style... ", "it's not as oily, and I think the noodles are better here.\n", "Broth: Really deep flavor, a tad oily, but really flavorful.  ", "Seriously, close to Daikokuya level.\n", "Noodles: Best noodles I've had so far, possibly ever in the US.  \n", "Other: bamboo shoots, green onions, konbu in generous portions.  ", "Chashu is tasty and not fatty.  ", "I would've liked options to add more stuff, but this was quite good.\n", "Bonus: free green tea\nTips", ": Expect a 30 minute wait, small ramen shop.  ", "But its indoors in a Japanese mall of sorts.  "], "author": "Jeffrey Y.", "review": "This is my Lv 85 quest to find the best ramen in the Bay.  Will update as I continue - hope there's a good item at the end..\n\n10-pt scale rating + descriptors on broth, noodles, bonuses.  I also note wait times and such.  I used to review commercial products, so hopefully this will be standardized.  I will get the most popular item there if I can, otherwise whatever I like.\n\n10/10 is Daikokuya (LA).  Ratings lower than a 5/10 - I won't return.\n\nReviewed so far:\nSuzu Noodle House (SF) - 8.5/10\nRamen Dojo (San Mateo) - 8/10\nMaru Ichi (Mountain View) - 6.5/10\nRyowa (Mountain View) - 3.5/10\nHimawari (san Mateo) - 3/10\n\nTo try:\nTanpopo\nIzakaya Sozai\nSanta Ramen\nRamen Parlor\nOrenchi Ramen\n\nSUZU NOODLE HOUSE (SF) - 8.5/10, Chashu shio Ramen.\nOverall: My favorite ramen in the BA so far.  Traditional ramen shop size, feel, and ramen style.  They also have udon and other stuff I may try later.  I'm told the mapuo ramen is good.  I will be back, many, many times.  I prefer this place over the Dojo so far because I like the traditional ramen more than the crazy Dojo-style... it's not as oily, and I think the noodles are better here.\nBroth: Really deep flavor, a tad oily, but really flavorful.  Seriously, close to Daikokuya level.\nNoodles: Best noodles I've had so far, possibly ever in the US.  \nOther: bamboo shoots, green onions, konbu in generous portions.  Chashu is tasty and not fatty.  I would've liked options to add more stuff, but this was quite good.\nBonus: free green tea\nTips: Expect a 30 minute wait, small ramen shop.  But its indoors in a Japanese mall of sorts.  Don't sit on the patio side unless you like slower service.\n\nRamen Dojo (San Mateo) - 8/10, Garlic pork ramen, mild spicy.\nOverall: Garlic pork ramen, oh my goodness this is good.  This place has a VERY unique style, unique for kuro ramen even.  They specialize in spicy ramen... personally speaking, mild is enough for me, and I have high spice tolerance.  Medium was my limit and was pushing it (about 4/5 at a korean place).  Generous portions, customization, delicious broth, HOT soup... this is worth the wait.  I've been there twice, and probably will go more.\nBroth: REALLY TASTY with a long-lasting flavor.  It's a bit oily, but so good!!  It's kuro ramen, so it's blackish, but don't be put off by that.  IT IS SO GOOD.  And they gives you a LOT.  \nNoodles: Really great texture, generous portions.  \nOther: Comes with bean sprouts, lettuce, chives (great addition btw), quail egg, mushrooms, whole fried garlic.  Chashu among the best I've had in ramen.  There is little fat compared to other places, great texture, great taste.  I highly recommend getting extra chashu for $1.50 (cheap compared to the other additions - which are questionable in price).\nBonus: Great customization options, appetizers are pretty good.\nTips: Be prepared to wait BEFORE they open.  They have exactly 24 seats.  Line up and be one of the first 24 people.  If you're 25th, leave or wait another 30-40 minutes.  I recommend getting there 30 minutes early on a weekday dinner (maybe 20) or 45 minutes early for weekends.  Being #18 is the same as #1 in seating.  They will come out with a clipboard and ask for party size before opening - better have your whole party there.  Also, if you're there late, they can run out of garlic pork broth...\n\nMaru Ichi (Mountain View) - 6.5/10.  Kuro ramen with bamboo shoots.\nOverall: Quite filling with a great portion size.  No real wait if you can find parking.  \nBroth:  Not as tasty as the Dojo but not as oily either.  Pretty flavorful but not the best, but good size and price.  And no wait.\nNoodles: The noodles are a bit thinner than other places.  Texture-wise, they were spot on - chewy, great texture, and definitely good ramen noodles.  \nOther: Bean sprouts, scallions.  Options to add more.\nBonus: Kimchi to snack on while you wait - good quality too.  Free tea.  I like that you can see the dude making the noodles in the window - pretty killer machine he's using.  \nTips: Not much of a wait, this place is huge inside.  Great for quick ramen in MTV area.  I'd go back.\n\nRyowa (Mountain View) 3.5/10 - Tonkatsu ramen with gyoza and rice.\nOverall: Filling portions, not terrible.  Cool decor with Japanese TV shows and ramen bar feel.  $0.50 gets you 3 gyoza and rice.  \nBroth: Watery, not that great.  I wouldn't get this again.\nNoodles: Noodles were great texture, thin\nOther: Gyoza were really quite good, but I don't go to a ramen place for gyoza.  \nBonus: Free kimchi to snack on\nTips: Short to no wait, def get the combo for $0.50 more.  But Maru Ichi is way better.\n\nHimawri (San Mateo) - 3/10.  Miso ramen.\nOverall: Honestly not impressed.  It's not terrible, but for west coast this was not passing.  My bowl had lots of stuff, but eh..\nBroth: not flavorful, watered down\nNoodles: Noodles ok, I can make better\nOther: lots of stuff, forget what\nBonus: empty place, no lines\nTips: It was cheap and fast..", "rating": 5, "date": "2012-03-16"}, {"excerpts": ["but I know that most Soba and Udon dishes taste like water.  ", "The ones here are delicious and come with another side (like raw salmon, or another meat of choice...) "], "author": "Aaron W.", "review": "Oh yes, yes yes.  Found a good noodle place with flavorful noddle soups.  Hmm they may be too oily and considered American, not sure... but I know that most Soba and Udon dishes taste like water.  The ones here are delicious and come with another side (like raw salmon, or another meat of choice...) Super great deals.\n\nThe staff though are very cold.  Like, very cold.  I think they might be robots.  But they get the job done.", "rating": 4, "date": "2009-10-22"}, {"excerpts": ["On my most recent trip, I took a shot at the udon and was not disappointed. "], "author": "Susan L.", "review": "Thanks to Neil K. I can avoid the endless food options in Japantown and head straight to Suzu for a hearty warm bowl of ramen. There's something about those nifty curly noodles that always hits the spot! Broth is rich but not salty. Noodles are cooked to perfection. What more could you ask for? On my most recent trip, I took a shot at the udon and was not disappointed. If it weren't for the freaking hot 'special iron pot', I would have slurped down the bowl in a matter of minutes!\n\nA quick tale: They have a couple 2-tops outside the restaurant. One time we sat at a table inside, right next to one of those tables, with only a thick clear glass pane separating us. As soon as we sat down, we knew right away that the couple next to us was having the 'break up' talk. The boy avoided eye contact. The girl fought back the tears. They both slowly sipped their tea to avoid talking. Can you say \"Awkward!\" at the dinner table?", "rating": 5, "date": "2009-09-01"}, {"excerpts": ["The tempura udon in an iron pot I got was surprisingly good. ", "I'm not a huge fan of Udon because people don't know how to cook it. ", "I hate mushy udon, flavorless udon, or bad broth. ", "The udon here is perfectly cooked, slightly chewy, lots of flavor from the fish broth, and the broth is clear but flavorful. ", "It comes with a blah shrimp tempura and mushy carrot tempura. "], "author": "Yuchi C.", "review": "Obviously popular spot. Line can be long, seats get filled up about 10 minutes after they open at 5 on a Thursday.\n\nThe tempura udon in an iron pot I got was surprisingly good. I'm not a huge fan of Udon because people don't know how to cook it. I hate mushy udon, flavorless udon, or bad broth. The udon here is perfectly cooked, slightly chewy, lots of flavor from the fish broth, and the broth is clear but flavorful. It comes with a blah shrimp tempura and mushy carrot tempura. I was very pleased with the noodle and broth nonetheless.\n\nThe ramen my friend had looked yummy, 6-7 slices of cha siu, nice textured handmade noodles, deliciously looking broth. \n\nFried chicken appetizer is quite nice too, it's crispy outside, juicy thigh meat inside. Did I mention I hate fried food? This one tastes ok to me so it might be pretty good for everyone else.\n\nGood alternative of Tanpopo, or Katana-ya. Though the best ramen place in the bay area still awaits to be discovered...", "rating": 3, "date": "2009-12-12"}, {"excerpts": ["Both my girlfriend and I had the tempuradon combo...which was a bowl of ramen, udon, or soba with a side bowl of white rice with tempura on top.  ", "We both had the ramen choice with our tempura. ", "The first thing I noticed about the food was that the tempura was really good.  ", "I could not think of another place where I've had such fresh tempura in the city.  ", "The ramen was equal in its \"homemade\" taste. "], "author": "Jimmy L.", "review": "I'm no expert on ramen or noodle houses, but I'd love to find any noodle house that tickles my salty desires, and Suzu did just that. \n\nThe place is a bit small, and its clear by the wait, this place is known for good food. So be prepared to wait when you come, especially if you are in a group of more than 4. \n\nBoth my girlfriend and I had the tempuradon combo...which was a bowl of ramen, udon, or soba with a side bowl of white rice with tempura on top.  We both had the ramen choice with our tempura. The first thing I noticed about the food was that the tempura was really good.  I could not think of another place where I've had such fresh tempura in the city.  The ramen was equal in its \"homemade\" taste. I will definitely be returning to try more of the menu. \n\n...and as long as its cold, this place will be high on my seasonal places to eat to get warm.", "rating": 4, "date": "2009-11-22"}, {"excerpts": ["Nabeyake udon was underwhelming, small, over priced for what you get.  ", "I have yet to find a Ramen place on par with NYC or LA here in SF, kind of sad."], "author": "Robert K.", "review": "Food 3, service 2.5.  Ramen noodles cooked well, broth and toppings mediocre.  Nabeyake udon was underwhelming, small, over priced for what you get.  I have yet to find a Ramen place on par with NYC or LA here in SF, kind of sad.", "rating": 3, "date": "2012-12-04"}, {"excerpts": ["The udon was terrific, mine with chicken broth rice cake, hard boiled egg, pea pod, seaweed, cabbage, tofu, green onion. ", "I added red pepper flakes a shoyu. ", "The guy had udon with fish broth (delicious) and all the vegetables I had and the addition of shrimp tempura. ", "My only complaint was that the soup was so freaking hot, that it took a good half hour before I could eat it. ", "Maybe the trick is to phone order ahead of time......"], "author": "Bleep S.", "review": "Write your name on a pad of paper right outside the door and wait for a table. The udon was terrific, mine with chicken broth rice cake, hard boiled egg, pea pod, seaweed, cabbage, tofu, green onion. I added red pepper flakes a shoyu. The guy had udon with fish broth (delicious) and all the vegetables I had and the addition of shrimp tempura. My only complaint was that the soup was so freaking hot, that it took a good half hour before I could eat it. Maybe the trick is to phone order ahead of time......", "rating": 4, "date": "2009-11-21"}, {"excerpts": ["I tried the kim-chee udon and enjoyed it.  ", "I would come here again ", "but it's not my new favorite place or anything like that. ", "Nothing really stood out."], "author": "Jacquie S.", "review": "This place wasn't bad. I came here with a friend after roaming around the hood looking for a place to eat, there was a line so we figured it was good. \n\nWe had the tempura which we expected to be a lot bigger. I tried the kim-chee udon and enjoyed it.  I would come here again but it's not my new favorite place or anything like that. Nothing really stood out.", "rating": 5, "date": "2009-09-09"}, {"excerpts": ["Fueled on mediocre Udon and a handful of cookies, by the time we sat down at Suzu, I'm sure dirt in a bowl would have sufficed "], "author": "Jen I.", "review": "Apparently I need to check out Tanpopo for Ramen since the naysayers seem to like that place much more then Suzu, though I found Suzu awesome in so many ways.\n\nDinner combo of Sake Don & Ramen for a mere $10 was a pretty sweet deal in my opinion.\n\n'dia and I tried to have lunch here but they had closed their waitlist as soon as we got there.  Apparently they shut between 3:00PM and 5:30PM between lunch & dinner seatings.\n\nWe found sustenance at mediocre Maifun (ugh) and loitered japantown for several hours before returning to Suzu for dinner.  \n\nI was beat down tired.  I had a messenger bag full of random stuffs that I managed to lug from the Mission to Jtown.  We had hit the grocery store where I had stocked up on azuki beanpaste for MochiBall Making Extravaganza 2009 as well as Soy Milk (as it always seems to be so much cheaper in Japantown).  I felt like a hobo.  A pack mule.  A Hobo Pack Mule Extraordinaire.  Apparently I have amazing back muscles.\n\nFueled on mediocre Udon and a handful of cookies, by the time we sat down at Suzu, I'm sure dirt in a bowl would have sufficed and I would have yelped a 5-star review.\n\nThe mini bowl of Sake Don was the right size to compliment the larger bowl of Ramen so it didn't feel like too much food.\n\nService was courteous and was consistent with refilling water and tea even long after we paid our bill and lingered in conversation.", "rating": 5, "date": "2009-03-16"}, {"excerpts": ["Plus they also do a mean bowl of udon and soba, not usually my first choice for Japanese noodles, but very well done here if you're craving it (a step up from the generic Japanese restaurant). "], "author": "Roland C.", "review": "Tiny place in the first floor of the Kinokuniya building, but it doesn't have the tiny ramen place appeal (i.e. a bar, television, and watching them cook in front of you). It's just a small restaurant with some overflow onto tables outside. They also seem to have the strangest hours, I know they have the schedule, but why are they always closed when I come to Japantown?\n\nIn the few times I've been able to eat here though, they've actually served up pretty good bowls of ramen. A good variety, enough to satisfy most tastes, but not so many that you worry they're spreading themselves too thin. Plus they also do a mean bowl of udon and soba, not usually my first choice for Japanese noodles, but very well done here if you're craving it (a step up from the generic Japanese restaurant). Their lunch combo also looks pretty respectable as well.\n\nI've also never had problems with service, they look busy, but despite the small wait staff on hand, I've gotten my bowls with a good quick turnaround. This usually is my second choice in noodles when I come to Japantown, if for some reason I'm not feeling Tanpopo (or just too lazy to hike over there from Kinokuniya).", "rating": 4, "date": "2009-02-03"}, {"excerpts": ["Other then that the gyoza was still good and the basic udon seemed to be much the same as before.\n\n"], "author": "GIR ..", "review": "Apparently Suzu's popularity is going strong, a crowd of loitering hungry people outside the restaurant eyeballed us as we approached to put our name to the waiting list, and there was no let up in the number of impatient hungry the entire time we were here.\n\nThat said I was less then thrilled with the pork and veggie ramen - the noodles themselves were still very good, but the veggies were comprised of mostly cabbage with just one or two tiny florets of broccoli and a snap pea or two, and the pork was all odds and ends, little nubs and random fatty pieces that were not close to the quality of the slices you get in the standard ramen. The broth was also very fatty, great big islands of it floating and making your lips sticky, while at the same time it was bland and not nearly as flavorful as the other ramens I have had here.  Other then that the gyoza was still good and the basic udon seemed to be much the same as before.\n\nIt was a let down to see that while the restaurant has made improvements and updated the menu the quality of this newer dish was lacking, and the added insult to injury was that the price is a step up. \n\nPS: FYI they no longer offer food to go, am now on the lookout for a replacement for my ramen fix take away needs.", "rating": 3, "date": "2009-05-09"}, {"excerpts": [", Noodles were a little big for my tastes, both noodles and broth kinda gave me a Udon feel, although noodles weren't that big, but I kept switching to a Udon experience during my food trip. ", "Now it looks like the place just started offering \"spicy\" as almost every dish that had new by it was a spicy dish. ", "Now the \"Spicy\" I got here was a bit surprising to me. ", "I say this because usually when I ask for spicy in a Japanese Noodle House (AKA Ramen Shop) ", "I'm thinking of getting a Chili-oil based sauce. ", "at Suzu ", "I got a very SE Asian style hot sauce. ", "It was good, don't get me wrong, but I'm not sure it's the right kind of Hot and Spicy ", "I was going for. ", "It is Spicy though. "], "author": "Paul V.", "review": "Located in the heart of Japan-town in Miyako Mall, East Building. I was happy to try a new place out. I usually hit up Tanpopo, but I'm always down to try new places. This place is a solid 3 star establishment. Food was good, but not incredible. Karage was yummy and fresh tasting. I ordered a combo special with Spicey Chosu Ramen and Chicken Curry. \n\nThe Ramen was ok, Noodles were a little big for my tastes, both noodles and broth kinda gave me a Udon feel, although noodles weren't that big, but I kept switching to a Udon experience during my food trip. Now it looks like the place just started offering \"spicy\" as almost every dish that had new by it was a spicy dish. Now the \"Spicy\" I got here was a bit surprising to me. I say this because usually when I ask for spicy in a Japanese Noodle House (AKA Ramen Shop) I'm thinking of getting a Chili-oil based sauce. at Suzu I got a very SE Asian style hot sauce. It was good, don't get me wrong, but I'm not sure it's the right kind of Hot and Spicy I was going for. It is Spicy though. I liked that, I just think it was a interesting Fusion, I wasn't necessarily trying to get out of my bowl of Japanese Ramen.\n\nEverythign said, sure I'd go back, service was good, drinks were your average price. Nothing to call out for good prices there, however the combos prices were very well-priced.", "rating": 3, "date": "2009-03-17"}, {"excerpts": ["Tiny, cute JTown shop (it used to house an adorable mochi shop) that serves up udon, ramen, soba and donburi.  "], "author": "Lolia S.", "review": "Tiny, cute JTown shop (it used to house an adorable mochi shop) that serves up udon, ramen, soba and donburi.  Gotta love the neon \"noodle\" sign. \n\nI thought by coming early (before 6 PM) we could avoid the lines.  The place was packed and we still had to wait.  Wait staff passed by with trays of noodle soup, croquettes, and rice dishes.  Everything looked really good - nice presentation, lovely Japanese ceramic dishes.\n\nIn the end, the highly anticipated spicy-negi ramen was slightly above average.  The noodles were  firm/al dente and chewy.  The dark soy broth was too salty but with good flavor.  I wouldn't call it spicy.  However, they did serve it piping hot.  The overall portion size was smaller than average.  Skimpy ingredients: I received one slice of pork, abundant green onions, and a few bamboo shoot slivers.  It was simple and satisfying but not crave-worthy.  \n\nMost of the tables are for two people.  I wouldn't come with a large group (over 4 people).", "rating": 3, "date": "2007-10-22"}, {"excerpts": ["This noodle house makes a really great curry udon and even if the ramen is average, it doesn't mean you can't try their other dishes.  ", "My girlfriend and I love the area, the atmosphere and the service we get from this charming noodle house in J-town ", "and I'm sure anybody who isn't a stuck up ", "Again, try their combo special with the salmon sashimi don and curry udon.  ", "Their soba is delish too if you don't feel like ramen or udon."], "author": "Keika L.", "review": "Listen all you ramen snobs!  Did you ever think that it's hard to make AUTHENTIC Japanese ramen because the ingredients are limited in the US?  You guys piss me off!\n\nThis noodle house makes a really great curry udon and even if the ramen is average, it doesn't mean you can't try their other dishes.  My girlfriend and I love the area, the atmosphere and the service we get from this charming noodle house in J-town and I'm sure anybody who isn't a stuck up \"This isn't like the ramen in Japan\" a**hole would appreciate what they do offer.\n\nAgain, try their combo special with the salmon sashimi don and curry udon.  Their soba is delish too if you don't feel like ramen or udon.", "rating": 5, "date": "2008-03-24"}, {"excerpts": ["I had the tempura udon and was very happy with it. ", "The dashi (broth) was on the sweet side, but I like it like that. ", "My hubbs had the ramen and he liked it the same. ", "Not crazy ", "aobut it "], "author": "Stephanie I.", "review": "Ramen is one of those dishes that people get all crazy - up in yo- bidness about. From time to time... I do to, but not tonight. \n\nEvery now and then you want fast, courteous service in a clean and simple environment. And that is exactly what I found here.\n\nWe arrived and there was a 15 minute wait. The hostess brought us some tea and water while we sat and perused the menu. The location is in the J-town Mall so you are generally pretty comfy hanging out waiting for a seat. \n\nI had the tempura udon and was very happy with it. The dashi (broth) was on the sweet side, but I like it like that. My hubbs had the ramen and he liked it the same. Not crazy aobut it but it was good. \n\nThe portions of Hiyayako (cold tofu) and croquette were admittedly on the smaller side, but after finishing off my noodles and the appetizers, we were pretty full.\n\nNo question... I'd eat there again.", "rating": 4, "date": "2007-04-09"}, {"excerpts": ["Yes, the ramen is divine, but don't forget the udon. ", "One of the best Japanese noodle joints I've found in the city thus far. ", "But a pointer: if the small restaurant is crowded and/or you're forced to sit outside, good luck with service. ", "The waitresses have gotten better, but they are still space cadets. ", "I think they're channeling Atom Boy somewhere far far away. ", "Moshi moshi?\r\n\r\n", "Closed Tuesdays."], "author": "I Love Beef C.", "review": "Ra ra ra. Yes, the ramen is divine, but don't forget the udon. One of the best Japanese noodle joints I've found in the city thus far. But a pointer: if the small restaurant is crowded and/or you're forced to sit outside, good luck with service. The waitresses have gotten better, but they are still space cadets. I think they're channeling Atom Boy somewhere far far away. Moshi moshi?\r\n\r\nClosed Tuesdays.", "rating": 4, "date": "2006-09-06"}, {"excerpts": ["I had the nabeyaki udon and my friend had the tokyo ramen.  ", "We shared a chicken karaage and katsu don.  ", "We both thought the udon had a really tasty broth.  ", "I love tofu and thought it was great there were two large slabs in my udon.  ", "Definitely one of the best udon's ", "I've had...be patient though and let it cool though.  ", "I burnt my mouth ", "cause I couldn't wait.  ", "Can't comment on the ramen since I didn't really try it.  ", "nabeyaki udon, katsu don"], "author": "Dik Shun K.", "review": "I went here when they first opened and frankly, didn't think much of it.  I decided to give it another shot after it was recommended by a japanese girlfriend of a friend.  \n\nI must say, the food has vastly improved since the first time I went as evidenced by the wait when we got there.  The wait was not that bad (~15 minutes) but I think we happened to get there just as the first wave was finishing up.  I had the nabeyaki udon and my friend had the tokyo ramen.  We shared a chicken karaage and katsu don.  We both thought the udon had a really tasty broth.  I love tofu and thought it was great there were two large slabs in my udon.  Definitely one of the best udon's I've had...be patient though and let it cool though.  I burnt my mouth cause I couldn't wait.  Can't comment on the ramen since I didn't really try it.  I had a sip of the broth and it was pretty good.  \n\nThe karaage was good but we thought there weren't enough pieces and they were a bit small.  We ended up ordering a katsu don since we were still hungry and we're pigs.  Katsu don was very good but we were disappointed that they didn't have oyako don on the menu.  We asked if they could make one since we're both huge oyako don fans but they wouldn't do it.  \n\nDSKO favs: nabeyaki udon, katsu don", "rating": 4, "date": "2008-09-12"}, {"excerpts": ["For instance you can choose a noodle out of RAMEN, SOBA or UDON with a small donburi/rice bowl. \n"], "author": "Chacha M.", "review": "Good ramen noodle and soup!\nI love that they have combo menu for lunch time.\nFor instance you can choose a noodle out of RAMEN, SOBA or UDON with a small donburi/rice bowl. \nThe lunch combos seem to sell alot !\n\nThey also have all vegetarian soup for the noodle dishes, if you like to make sure the soup isn't animal based, just  ask!", "rating": 3, "date": "2006-12-11"}, {"excerpts": ["Suzu features te-zukuri menrui (hand-made ramen, soba, and udon noodles), which is not altogether common in SF, even in Japantown.  "], "author": "Todd E.", "review": "Hip-Hip Hooray for tasty ramen!\n\nSuzu features te-zukuri menrui (hand-made ramen, soba, and udon noodles), which is not altogether common in SF, even in Japantown.  This tiny and casual, but clean and comfortable noodle shop is in the Kinokuniya building, right next to the Kabuki movie theatre and downstairs from the fantastic Kinokuniya bookstore.  \n\nI recommend first trying the standard, the classic cha-shu shoyu ramen (ramen with roast pork in soy-based sauce).  It's quite good here.  When you're feeling adventurous or want something different, try the ma-bo ramen.  It's the bastard combination of ramen with spicy ma-bo tofu and pork.  A little unusual, but tasty!  I wasn't a big fan of the kara-age ramen, the fried chicken gets a little soggy in the soup, so maybe ask for the chicken on the side.\n\nI wouldn't say that Suzu does anything incredibly spectacular or wonderful, but it's a decent ramen shop with fresh noodles, conveniently located, inexpensive, and tastes like the real deal.", "rating": 4, "date": "2007-02-07"}, {"excerpts": ["I like my mapo ramen with a thicker soup (just like I like my curry udon with a thick soup) but if you can't have the real thing, I'm happy to have something in the same arena. ", "There isn't much tofu in this mapo which was also disappointing. ", "But th soup is very good. ", "Just spicy enough to remind you that you're eating mapo but not overwhelming. ", "Also not super oily. "], "author": "Tray I.", "review": "After much ado, I finally came here to check out one of the \"best\" ramen places in sf. *sigh* I'm still searching. \n\nThe noodles are gummy. I don't really like this texture in my noodles, but my friend who went with me did. So to one his own. It wasn't so gummy that you could taste flour or that it would remind you of an italian pasta, but it is a gummy noodle. This is probably my one and only gripe that doesn't make this a great noodle shop. But to one his own, again, my friend thought it was great. \n\nThey have mapo ramen! Yum. I like my mapo ramen with a thicker soup (just like I like my curry udon with a thick soup) but if you can't have the real thing, I'm happy to have something in the same arena. There isn't much tofu in this mapo which was also disappointing. But th soup is very good. Just spicy enough to remind you that you're eating mapo but not overwhelming. Also not super oily. Very tasty. \n\nWe also got the agedashi. It was OK. I think I'm going to give up on the quest to find a better agedashi than gombei. Nothing seems to compare. \n\nWill I be back? Yes! Not for their ramen, but to try the karaage curry. That just sounds so delicious. Also, I'll be back on a really hot day for the soba which I almost got, but it was a chilly night and I wanted something to warm me up. \n\nPrice was also reasonable. I'm not sure what people are expecting to pay for ramen but for being under 10 bucks, this is a pretty decent price.", "rating": 3, "date": "2008-05-30"}, {"excerpts": ["I grabbed an order of the udon + tonkatsu combo.  ", "The udon was pretty good, though the tonkatsu was kinda meh.  ", "I do like the service and the atmosphere, as it seemed to be pretty chill amongst how packed it was overall."], "author": "Ren L.", "review": "Though it was a Friday evening, it was still relatively busy (it's always busy at this place).  We sat down after a 15 minute wait, which wasn't too bad.  I grabbed an order of the udon + tonkatsu combo.  The udon was pretty good, though the tonkatsu was kinda meh.  I do like the service and the atmosphere, as it seemed to be pretty chill amongst how packed it was overall.", "rating": 3, "date": "2011-06-07"}, {"excerpts": ["I had the udon and unadon combo - very happy with the texture of the udon and the unadon was delicious too.  ", "Even the house red wine wasn't terrible.  ", "They forgot to bring our edamame out and charged us for it, but other than that, the experience was positive."], "author": "B. Y.", "review": "Have heard about this place for a while and was warned about long lines so we were happy when our wait was only about 5 minutes.  I had the udon and unadon combo - very happy with the texture of the udon and the unadon was delicious too.  Even the house red wine wasn't terrible.  They forgot to bring our edamame out and charged us for it, but other than that, the experience was positive.", "rating": 4, "date": "2011-09-19"}, {"excerpts": ["I'm leaving a little room for improvement as I felt that my ramen could have had more meat and stuff in it and the Udon could have been more flavorful, but I'll be back.\n\n"], "author": "She-Ra ..", "review": "I'm always a little afraid of the places in Japantown, but I decided to drop in.  it's very clean, reasonably priced and although there was a wait, everything moved a long quickly.   I'm leaving a little room for improvement as I felt that my ramen could have had more meat and stuff in it and the Udon could have been more flavorful, but I'll be back.\n\n** Edited to add**Had to deduct another star as everyone I ate with suffered  GI problems that night (and the next day) and this is the most likely culprit...", "rating": 2, "date": "2009-06-11"}, {"excerpts": ["My wife had the udon combination with  Ton Katsu. ", "The broth was also very salty and the udon noodles had also the instant udon  texture. ", "The Ton Katsu was average . ", "I believe Katana-Ya downtown is now a much better choice for ramen in San Francisco.  ", "It is a shame, as the service and the ambience  at SUZU  is still very good."], "author": "Victor S.", "review": "This place used to serve a very decent ramen. Somehow the quality has gone down hill.  I had the Ramen Combination with Katsu Don.   The ramen broth was salty and flavorless,  It almost had the taste of instant ramen. The katsudon was good but very heavy. My wife had the udon combination with  Ton Katsu. The broth was also very salty and the udon noodles had also the instant udon  texture. The Ton Katsu was average . I believe Katana-Ya downtown is now a much better choice for ramen in San Francisco.  It is a shame, as the service and the ambience  at SUZU  is still very good.", "rating": 1, "date": "2011-01-29"}, {"excerpts": ["Both udon and ramen noodles have very good quality here, so almost every time I pay less attention to the soup if it's a noodle soup.\n\n", "One thing sure about the soup is that it was not impressive like Seafood Udon in Kirala.\n\n", "But again, both hot noodle soup (udon and ramen) and cold ramen are great here and probably noncomparable to others in the town."], "author": "Andrew Y.", "review": "Hands down, the best Japanese noodles I've had in town. In J-town, for regular J-cuisine, I would go to Kui Shin Bo, but for noodles, I go here. \n\nThe soup is definitely above average, maybe even great. But I am so mesmerized by the quality of noodles I chew in this place. Both udon and ramen noodles have very good quality here, so almost every time I pay less attention to the soup if it's a noodle soup.\n\nOne thing sure about the soup is that it was not impressive like Seafood Udon in Kirala.\n\nI've ordered only 2 appetizers so far, and they were pretty good. But it was a little pricy, so there is 1 star deducted. Another reason for 1 star gone is some waitress wanted me to sit outside a couple of times, and it was just annoying.\n\nBut again, both hot noodle soup (udon and ramen) and cold ramen are great here and probably noncomparable to others in the town.", "rating": 4, "date": "2008-01-05"}, {"excerpts": ["I had the udon and unagi-don combo.  ", "Again, not too memorable.  ", "The bf found a hair in his cold udon.  ", "Not just any hair, but the kind you really don't want in your food.  "], "author": "Yvonne C.", "review": "This is sad.  I don't remember much about this dining experience...and it's only been a week and a half.  I had a bite of my mom's Tokyo ramen.  Ehh, it was okay. Not good enough for me to crave it like I crave Koraku in LA. I had the udon and unagi-don combo.  Again, not too memorable.  I think I inhaled it because I was starving after the 20min wait in this rinky-dink joint.   \n\nAh yes...now I remember why I wanted to write this review.  The bf found a hair in his cold udon.  Not just any hair, but the kind you really don't want in your food.  That was enough for me to not want to go back.  \n\nOh and the service?  Let's just say despite the hair incident, I probably won't go back for that either.", "rating": 1, "date": "2008-07-16"}, {"excerpts": ["Awesome Ramen or Udon!  ", "My husband and I just love this place, ", "okay-so does our 2 yr old, ha. ", "There is a steady stream of people who come to eat here. ", "That to me says how good the food is.  ", "I am thrilled to live walking distance to this place. ", "I love SF's Japan town, this place offers steaming hot giant bowls of heaven, filled with fresh veg, meat tender noodles, tasty broths...", "comfort! ", "A great compliment to our cool-foggy days, oh- yes please!"], "author": "Jeneal J.", "review": "Awesome Ramen or Udon!  My husband and I just love this place, okay-so does our 2 yr old, ha. There is a steady stream of people who come to eat here. That to me says how good the food is.  I am thrilled to live walking distance to this place. I love SF's Japan town, this place offers steaming hot giant bowls of heaven, filled with fresh veg, meat tender noodles, tasty broths...comfort! A great compliment to our cool-foggy days, oh- yes please!", "rating": 4, "date": "2011-10-04"}, {"excerpts": ["I didn't try out any of their garden-variety soba/udon/donburi dishes. ", "I'm sure that they're nice "], "author": "Bono B.", "review": "(Rating is for the ramen.)\n\nWhy aren't there any decent, dedicated ramen-only joints in SF? I have my conspiracy theories on the matter, but that's beyond the scope of this review.\n\nAt any rate, I've basically given up on eating ramen in this fair city, but I let my guard down the other day and checked out this restaurant in a moment of low blood sugar level induced weakness.\n\nThe broth was a big letdown for me. For me, this is the litmus test part of the ramen experience, apart from the noodles themselves.\n\nThe shoyu-base soup tasted like it was made from a commercial base. It didn't have the complex depth and character that would come from hours of cooking ingredients in a gigantic stock pot- a common sight found in typical ramen joints in Japan.\n\nThe eggy ramen noodles were fine. Nice and predictable.\n\nThe fixin's like the chashu and menma were regulation issue. Nothing to write back to mom about (besides, I wouldn't recommend this place to my mom).\n\nI didn't try out any of their garden-variety soba/udon/donburi dishes. I'm sure that they're nice (how can you mess up simple dishes like that?), based on seeing other happy diners chowing down on them at the restaurant.\n\nBottom line- don't go to Suzu for their ramen if you're expecting a lot from your ramen experience.", "rating": 2, "date": "2006-10-02"}, {"excerpts": ["9.95 or so for the combo Udon Donburi with a huge bowl of Ramen that accompanies that, so that's what I picked.  ", "Trick is, the donburi had very little rice in it ", "(I guess I am now used to American sized portions at the other 88% of Japanese restaurants in the Bay Area).", ", but yea, the Bowl of Ramen noodles was very tasty - excellent HOT broth and the noodles were of a nice consistency that I expect of hand-made noodle  shops.  "], "author": "Harry W.", "review": "The summary:\nRamen is good and very hot, waitlist on a Friday evening is over 40 minutes to get in on the 8-9 tables they have there.   Service is very slow and overwhelmed as there are inexplicably only two waitresses there on weekends.\n\nThe Details:\nPrices are quite reasonable, only 6.50 for a bowl of veggie ramen.  \n9.95 or so for the combo Udon Donburi with a huge bowl of Ramen that accompanies that, so that's what I picked.  Trick is, the donburi had very little rice in it (I guess I am now used to American sized portions at the other 88% of Japanese restaurants in the Bay Area)., but yea, the Bowl of Ramen noodles was very tasty - excellent HOT broth and the noodles were of a nice consistency that I expect of hand-made noodle  shops.  The side of Sashimi (Maguro and Salmon) was small but good - reminds me of those authentically sized portions in Japan.\n\nThe Gyoza we ordered was tasty and good, but a bit on the greasy side.\n \nSuzu is better than Santa Ramen, which is often slammed rightfully for the MSG, but well, just to even things out, here's a message to Suzu's management:\n\nSuzu needs the following:\n1) More waitress staff and more tables on weekends.   \n\n2) You are wasting a good 25% of your precious floor space with that 12 foot long  blue corian counter that is just for looks.  Put some tables there, and hire an additional waitress fercryinoutlowd!!\n \nOK.. back to the review.. \n\nNo detectable MSG overload here at Suzu.  I still like Ramen Club in San Mateo better.  Koji is the MAN @ Ramen Club..\n\nSo there ya have it.", "rating": 3, "date": "2007-01-09"}, {"excerpts": ["Both their udon and ramen are delicious. ", "I just wish they wouldn't cheap out on the kamaboko (that pink and white fish cake thing)  and ", "chashu (pork) pieces. ", "For the price you pay, they should give more meat. ", "The nabeyaki udon came with one piece of tempura shrimp, one piece of eggplant, and one piece of carrot. ", "C'monnn.  ", "Wish they validated parking here."], "author": "C. Z.", "review": "Both their udon and ramen are delicious. I just wish they wouldn't cheap out on the kamaboko (that pink and white fish cake thing)  and chashu (pork) pieces. For the price you pay, they should give more meat. The nabeyaki udon came with one piece of tempura shrimp, one piece of eggplant, and one piece of carrot. C'monnn.  Wish they validated parking here.", "rating": 3, "date": "2011-03-24"}, {"excerpts": ["At first it seemed kind of expensive (over $10 for udon??), but my friend and I were devoid of any new, fresh choices in j-town.  "], "author": "Tori S.", "review": "At first it seemed kind of expensive (over $10 for udon??), but my friend and I were devoid of any new, fresh choices in j-town.  We picked Suzu because we'd both never been there, and we were both in a ramen mood.\n\nTheir dinner specials are a LOT of food - a hefty bowl of ramen (only a bit smaller than the regular bowls) plus something with rice and a choice of unagi, tuna sashimi, etc.  I ordered the maguro don combo, which was the fish, rice, and ramen (not.. combined in a bowl).  My friend ordered their Tokyo ramen, going off the theory that the first listing is usually their \"signature\" dish.\n\nThe ramen was pretty good - not as good as Tanpopo, but for the price (a meal around $20) + both of us really full = a good place to go back.", "rating": 4, "date": "2009-03-12"}, {"excerpts": ["Your noodle choices: ramen, udon or soba. \n\n", "For 8.95 - get a regular sized serving of ramen, udon or soba and a side of donburi with your choice of tuna or salmon sashimi, pork cutlet, curry, or unagi.  ", "At dinner you just pay one more dollar for the same thing. "], "author": "Judy L.", "review": "I love Suzu. The space is small and serves noodles hot or cold. Your noodle choices: ramen, udon or soba. \n\nAppetizer: The chicken karaage is fantastic.\n\nBest thing on the menu: Lunch combination. This is the best value! For 8.95 - get a regular sized serving of ramen, udon or soba and a side of donburi with your choice of tuna or salmon sashimi, pork cutlet, curry, or unagi.  At dinner you just pay one more dollar for the same thing. Its awesome!\n\nYes the broth is salty - so drink plenty of tea and water in the hours after eating at Suzu.", "rating": 5, "date": "2007-03-16"}, {"excerpts": ["We both ordered this iron pot dish with udon and fish cake galore. ", "The picture in the menu was so enticing. ", "But the flavor was not so much. ", "Aside from the noodles being incredibly overcooked (seemed like those cheap packets of udon you can buy for $0.50 cents), there was this one fish cake with a gooey white inside that reminded me of a man's orgasm wrapped with tofu skin. ", "It coated my mouth in a very unsatisfactory manner. ", "Not even semi-luke warm tea could wash it away. "], "author": "Stephanie L.", "review": "On a cold Saturday, my friend and I were on a hunt for a hot bowl of noodle soup. We passed by this \"noodle house\" because it was cheap and empty. We both ordered this iron pot dish with udon and fish cake galore. The picture in the menu was so enticing. But the flavor was not so much. Aside from the noodles being incredibly overcooked (seemed like those cheap packets of udon you can buy for $0.50 cents), there was this one fish cake with a gooey white inside that reminded me of a man's orgasm wrapped with tofu skin. It coated my mouth in a very unsatisfactory manner. Not even semi-luke warm tea could wash it away. Sure, the iron pot dish offered a variety of fish cakes but that was all it offered. \n\nNow to the worst dish of all. I ordered some \"steamed shrimp dumplings\" and instead got store bought and over cooked chewy dime sized dumplings. I've eaten these before when I bought a packet from 99 Ranch because they were on sale for $1.99. They were so disgusting. Best part? They charged you $6.00 for 5 little tiny dumplings.\n\nI won't go into the terrible service because the food says it all.\n\nAfter we sat down and started eating, we noticed a huge line outside. I don't know why this place gets crowded. Oh yeah, there are like no seats in this small \"restaurant.\" They could barely handle two parties of 5. Thankfully, they're out two customers. I'm never coming here again.", "rating": 2, "date": "2008-06-01"}, {"excerpts": ["Suzu used to be one of my favorite ramen/udon spots to go to. ", "They changed ownership. ", "Not sure when, but I asked the waitress to confirm it. ", "Food is way less fresh and authentic now. ", "I won't be going back unless someone points a gun to my head."], "author": "justin u.", "review": "I don't write reviews often but had to in this case. Suzu used to be one of my favorite ramen/udon spots to go to. They changed ownership. Not sure when, but I asked the waitress to confirm it. Food is way less fresh and authentic now. I won't be going back unless someone points a gun to my head.", "rating": 2, "date": "2012-08-13"}, {"excerpts": ["I don't know what everyone is rambling about but the Tori Udon I ordered was great. ", "Udon noodles in general is one of my favorite foods. ", "It had enough pieces of chicken in the soup to satisfy me and the noodles itself was great. ", "I kinda like that seaweed thing they had in the soup. ", "I'm not that great with chopsticks ", "but I made sure I finished all the noodles and pieces of chicken. ", "It was that good. ", "PS ", "it's not that uncommon to see cooks that are not of the ethnic food in the kitchen..."], "author": "Gerard Y.", "review": "I don't know what everyone is rambling about but the Tori Udon I ordered was great. Udon noodles in general is one of my favorite foods. It had enough pieces of chicken in the soup to satisfy me and the noodles itself was great. I kinda like that seaweed thing they had in the soup. I'm not that great with chopsticks but I made sure I finished all the noodles and pieces of chicken. It was that good. PS it's not that uncommon to see cooks that are not of the ethnic food in the kitchen...", "rating": 4, "date": "2007-05-30"}, {"excerpts": ["They'll let you order the lunch specials at dinner time -- a small portion of things like tempura-don or katsu-don, plus a giant bowl of noodles (your choice or ramen, udon or soba) bigger than your head -- for an extra $1 more. ", "You'll have more food than you can eat for under $10!"], "author": "anita c.", "review": "Pretty good ramen and quick food on the ground floor of the Japan Center mall. Atmosphere is nicer than the upstairs noodle place, and the service is very sweet. \n\nThey'll let you order the lunch specials at dinner time -- a small portion of things like tempura-don or katsu-don, plus a giant bowl of noodles (your choice or ramen, udon or soba) bigger than your head -- for an extra $1 more. You'll have more food than you can eat for under $10!", "rating": 4, "date": "2006-08-01"}, {"excerpts": ["Every time I've been here, which is about once every 1-2 yrs, things have been pretty tasty - I usually stick with the soba and udon soups which are pretty good, and their salmon sashimi don.     "], "author": "Tyler C.", "review": "Every time I've been here, which is about once every 1-2 yrs, things have been pretty tasty - I usually stick with the soba and udon soups which are pretty good, and their salmon sashimi don.     A friend who lives nearby seems to think they had a dip in quality over the past couple of  years but recently have been getting back to their early, hi-flying days.   \n\nNo experience with their ramen....", "rating": 4, "date": "2007-11-10"}, {"excerpts": ["Also highly recommend the miso nabe yake udon.\n"], "author": "Snuggie L.", "review": "One of the best non-sushi restaurants in SF. It's very small so the wait times can be long and they don't do reservations or take out. The pot stickers.. just thinking about them makes me start drooling. Also highly recommend the miso nabe yake udon.\nCloses at 9pm, not recommended for parties larger than 4-5..the place is small!\n\n\nUpdate: Yes, they do take out but the line can be long still.", "rating": 4, "date": "2009-07-08"}, {"excerpts": ["He usually gets the udon and i get the ramen that comes with the sashimi on rice. ", "The broth of both tastes just right. ", "This is probably one of the best ramen places i've eaten at in SF. ", "I've been here several times and each time it has not let me down!"], "author": "Jessica C.", "review": "The boyfriend and I always end up eating here whenever we come to Japan town. The wait usually around 15 - 20 minutes. He usually gets the udon and i get the ramen that comes with the sashimi on rice. The broth of both tastes just right. This is probably one of the best ramen places i've eaten at in SF. I've been here several times and each time it has not let me down!", "rating": 4, "date": "2010-08-07"}, {"excerpts": ["Quick service, solid ramen and udon, and warm and toasty tea on a cold day.  ", "They give you healthy portions of noodles and the broth is tasty without being overly salty.  "], "author": "Jennifer S.", "review": "Quick service, solid ramen and udon, and warm and toasty tea on a cold day.  They give you healthy portions of noodles and the broth is tasty without being overly salty.  A good choice for noodles.\n\nJust be sure to go there on off hours - it's a super small place and the tables fill up quickly.", "rating": 4, "date": "2011-01-16"}, {"excerpts": ["Vegetarian Udon noodle, various ramen noodle, soba, donburi, and small plates. "], "author": "Rie H.", "review": "It's hard to find a good ramen place.  This place does not have the best soup, but menu covers pretty much everything.  Vegetarian Udon noodle, various ramen noodle, soba, donburi, and small plates. Perfect for a quick bite. \n\nI go there alone sometimes for a quick bite.  It's rate to find a restaurant where women can go without feeling bit off.", "rating": 4, "date": "2006-01-01"}, {"excerpts": ["My fave is the karage ramen & vegetarian udon. ", "FYI vegetarian people; the vegie udon is not really pure vegetarian, but the broth is already a mix of meat & pork broth. ", "So, no it's not for vegetarians here.\n", "Reasonable price, nice taste of soup, fast service!\n", "Just put your name on the list of the paper provided, & they'll seat you whenever the seat is avail.\n", "it's alaways a full house here, cuz the place itself is very small."], "author": "Ms C.", "review": "If you want to taste authentic Japanese Noodle & Ramen, go here.\nI think it's a not bad for a soup noodle during cold days you want to go here.\nMostly all the noodle soup here are very tasty. So go ahead try everything! My fave is the karage ramen & vegetarian udon. FYI vegetarian people; the vegie udon is not really pure vegetarian, but the broth is already a mix of meat & pork broth. So, no it's not for vegetarians here.\nReasonable price, nice taste of soup, fast service!\nJust put your name on the list of the paper provided, & they'll seat you whenever the seat is avail.\nit's alaways a full house here, cuz the place itself is very small.", "rating": 4, "date": "2007-10-05"}, {"excerpts": ["I like it here because it is cheap and they make pretty good udon.  ", "Anything else other than soup is just whatever.  ", "However, the combos are cheap.  ", "I usually get the udon and tekka don or unagi don.  ", "The place is really small ", "so I prefer to sit on the outside tables (2).  ", "The staff is pretty friendly as well."], "author": "Sonja P.", "review": "I like it here because it is cheap and they make pretty good udon.  Anything else other than soup is just whatever.  However, the combos are cheap.  I usually get the udon and tekka don or unagi don.  The place is really small so I prefer to sit on the outside tables (2).  The staff is pretty friendly as well.", "rating": 3, "date": "2010-03-30"}, {"excerpts": ["a spicy negi ramen, unagi don buri and curry udon was ordered and it took them quite awhile to prepare it.\n\n", "the curry udon was just average, i had better. \n\n"], "author": "Nelle A.", "review": "a tiny eatery that serves greasy broth that 's quite acceptable when you are starving and having a bad case of cold. \n\nwith it's insufficient area, they could only afford to have 7 tables that could either seat 2 or 4 people. they can't even manage to have their very own washroom on their premises, but instead you'll be directed to the mall's public restroom conveniently located next to the restaurant.\n\nthe chicken karaage and gyoza was passable and everything was eaten on that plate. satisfying indeed!\na spicy negi ramen, unagi don buri and curry udon was ordered and it took them quite awhile to prepare it.\n\nthe ramen was oddly served in it's \"packaged form.\" they could have at least separated the noodles to have a fresh, natural appearance.\nthe unagi was generously portioned to a good big size and it was savory (thanks for a satisfactory teriyaki sauce).\nthe curry udon was just average, i had better. \n\nbut then, it's a tolerable place to have some soup.", "rating": 3, "date": "2007-12-20"}, {"excerpts": ["Big udon fan here, and Suzu had AMAZING udon. ", "The noodles were perfectly cooked and the broth was just spectacular. ", "I got the udon with tempura, and that was also great. \n\n"], "author": "Joe G.", "review": "Big udon fan here, and Suzu had AMAZING udon. The noodles were perfectly cooked and the broth was just spectacular. I got the udon with tempura, and that was also great. \n\nI will be back, again and again and again!", "rating": 5, "date": "2010-09-06"}, {"excerpts": ["My husband and I love coming here for their udon and ramen bowls... ", "I also like their chicken karaage.  ", "It's definitely worth the wait if there's a line.  ", "The people are very friendly, too!"], "author": "Neda B.", "review": "I wish I could slurp here more often but I think the salt, though delicious, would be bad for my health!  My husband and I love coming here for their udon and ramen bowls... I also like their chicken karaage.  It's definitely worth the wait if there's a line.  The people are very friendly, too!", "rating": 4, "date": "2009-10-25"}, {"excerpts": ["My other friend ordered Udon with unagi over rice. ", "She got a bowl of udon in a reasonable size bowl that does fill you up. ", "She also got a nice small bowl of unagi over rice. ", "She liked her meal. ", "$10.50\n4. ", "I saw my friend get the udon and realized I wanted the same except karage over rice. ", "In my opinion, I like there udon the best here at Suzu's. ", "The fried karage over rice ", "I like a lot. ", "The sauce they used was really good. ", "$10.50\n+ 2 sodas "], "author": "Priscilla S.", "review": "The second time I ever went to Japantown was during the Cherry Blossom festival (really fun, except I was practically melting in the heat). It was 4 of us having fun, walking around. Eventually we did get hungry and went in kintetsu mall to see where we should eat. Most of the restaurant were packed and we went downstairs and waited at Suzu's. None of us went there before but the food looked good.\n\nWe were starving so the wait seemed like forever but probably was only 10-15 minutes. We were seated, gotten our menu, and the waitress gave us water. Suzu is best for couples/dates, not really groups. For Suzu, the max you should have in your group is 4, that's how many there biggest table can fit. The waitresses are nice, not grumpy or very impatient.\nNever had Japanese food before so I didn't know what to get and just thought I'd wait to get crepe.\n\n1. My girlfriend ordered Karage ramen, which was ramen in a miso broth(?), and it had fried chicken in it. My girlfriend liked it and said it was good. It was only $9.50(?)\n2. My friend ordered (I think) spicy ramen. It was a big bowl, looked spicy, however she said it wasn't spicy at all. We each took a bit and 1 of my friend said it was, but me and my girlfriend said it wasn't spicy at all. There's a kick but it wasn't spicy. A disappointment. $???\n3. My other friend ordered Udon with unagi over rice. She got a bowl of udon in a reasonable size bowl that does fill you up. She also got a nice small bowl of unagi over rice. She liked her meal. $10.50\n4. I saw my friend get the udon and realized I wanted the same except karage over rice. In my opinion, I like there udon the best here at Suzu's. The fried karage over rice I like a lot. The sauce they used was really good. $10.50\n+ 2 sodas (soda i think is $1.50 (?))\n\nTotal + tax =about $50\n\nI come back. There food is good, not amazing but it's good.", "rating": 4, "date": "2009-07-13"}, {"excerpts": ["chewy udon, salty broth, crispy tempura, and since i onry have half hour for lunch, burnt tongue."], "author": "Winter R.", "review": "i ruv. \n\nchewy udon, salty broth, crispy tempura, and since i onry have half hour for lunch, burnt tongue.", "rating": 4, "date": "2007-04-30"}, {"excerpts": ["After Tombo closed in San Mateo, I was lost when it came to a good bowl of Udon.  ", "That was until we tried this spot out.  ", "It is what I think Japanese food is all about.  ", "Nothing in excess, just the right amount of food.  ", "Their lunch specials are a small rice bowl of your choice and a medium size bowl of noodles.  ", "It is a small place, so don't bring more than 4 folks with you ", "and I think they are closed on Tuesdays!"], "author": "Jason A.", "review": "After Tombo closed in San Mateo, I was lost when it came to a good bowl of Udon.  That was until we tried this spot out.  It is what I think Japanese food is all about.  Nothing in excess, just the right amount of food.  Their lunch specials are a small rice bowl of your choice and a medium size bowl of noodles.  It is a small place, so don't bring more than 4 folks with you and I think they are closed on Tuesdays!", "rating": 4, "date": "2006-03-29"}, {"excerpts": ["My coworkers ordered Miso ramen and Udon, both of which seemed fine.  ", "Not great but ", "okay.  ", "I might come back when I am nearby."], "author": "M Y.", "review": "I went to this place with my coworkers for dinner on Thursday night.  It was a bit crowded and we had to wait about 15 minutes.  I ordered Shio ramen, which was good/okay.  My coworkers ordered Miso ramen and Udon, both of which seemed fine.  Not great but okay.  I might come back when I am nearby.", "rating": 3, "date": "2009-12-10"}, {"excerpts": ["We've tried all of the ramen and some of the udon and soba. ", "It's all delicious. ", "It gets a star taken off because of the inconsistent service e.g. four of the five times we've ordered appetizers, it's come out after the noodles which is really frustrating."], "author": "Andy L.", "review": "Wow. We've eaten at this place a good dozen times now and everytime we've left pretty satisfied. We've tried all of the ramen and some of the udon and soba. It's all delicious. It gets a star taken off because of the inconsistent service e.g. four of the five times we've ordered appetizers, it's come out after the noodles which is really frustrating.", "rating": 4, "date": "2008-10-14"}, {"excerpts": ["I usually get a big tasty bowl of vegetarian udon or ramen, my husband always orders the spicy negi ramen. ", "The gyoza and shumai appetizers are both good, and the edamame is just salty enough. ", "Obviously it's tiny so avoid the movie rush-hour on weekends. ", "On cold or rainy nights, you can't beat underground parking and comfort food. ", "We're only ever disappointed when we forget that it's closed on Tuesdays and have to eat at any of the other restaurants in Japantown."], "author": "guinevere h.", "review": "Our favorite noodle joint in the city. I usually get a big tasty bowl of vegetarian udon or ramen, my husband always orders the spicy negi ramen. The gyoza and shumai appetizers are both good, and the edamame is just salty enough. Obviously it's tiny so avoid the movie rush-hour on weekends. On cold or rainy nights, you can't beat underground parking and comfort food. We're only ever disappointed when we forget that it's closed on Tuesdays and have to eat at any of the other restaurants in Japantown.", "rating": 5, "date": "2007-01-13"}, {"excerpts": ["Fresh noodles and creative options ranging from your standard udon to a curried edition.  ", "They also have GREAT Ramen. ", "Get there ", "*before* they open at 11:30 or you'll be waiting. ", "There was a large line which drew us to try it out in the first place. ", "We were lucky that we got in immediately. ", "Price was reasonable too."], "author": "Sheree E.", "review": "What a great place! Fresh noodles and creative options ranging from your standard udon to a curried edition.  They also have GREAT Ramen. Get there *before* they open at 11:30 or you'll be waiting. There was a large line which drew us to try it out in the first place. We were lucky that we got in immediately. Price was reasonable too.", "rating": 5, "date": "2009-11-17"}, {"excerpts": ["I've also had their udon here and they are very silky delicous!"], "author": "Joe O.", "review": "Just ate here the other night  with a friend before we saw \"(500) Days of Summer\" (pretty awesome movie btw) and I must admit that the ramen noodles are pretty tasty.  Toothsome and fresh are other words that come to mind. I had the one with pork (so tender and flavorful and plentiful) and my friend Mike had the salmon ramen combo (not as exciting by the looks of it).  I've also had their udon here and they are very silky delicous!", "rating": 4, "date": "2009-08-13"}, {"excerpts": ["My udon was excellent and the ramen received two thumbs up. ", "Quite a bit better than Katana-Ya I'd say!"], "author": "Will A.", "review": "I bookmarked Suzu Noodle House in January, 2008 and it took me a year to actually try it out, but I'm a fan! There always seems to be a long wait but thanks to plenty of no-shows we were seated almost immediately. My udon was excellent and the ramen received two thumbs up. Quite a bit better than Katana-Ya I'd say!", "rating": 4, "date": "2009-04-09"}, {"excerpts": ["The kids both had vegetarian udon and to be truthful, we could have just had one order as they are pretty substantial and the kids were unable to eat it all.  ", "One bowl would have been enough.  ", "I had Kraaage Ramen and it was good, a bit too salty, but still pretty good.  ", "Staff were nice, friendly and efficient.  ", "We'll be back!"], "author": "Ron T.", "review": "This is a nice safe bet when in the area.  I went  with my kids before heading over to Yoshi's to see Oregon perform one of Yoshi's Sunday Matinee for Kids shows.  The kids both had vegetarian udon and to be truthful, we could have just had one order as they are pretty substantial and the kids were unable to eat it all.  One bowl would have been enough.  I had Kraaage Ramen and it was good, a bit too salty, but still pretty good.  Staff were nice, friendly and efficient.  We'll be back!", "rating": 3, "date": "2009-04-06"}, {"excerpts": ["It's a great casual spot for delicious fresh ramen, udon and soba. ", "My husband calls me a certified noodle-a-holic and this is my first choice when I get that noodle craving. \r\n\r\n", "The steaming bowl of ramen with chicken kara-age (order it appetizer size, otherwise the serving is kind of small) is my favorite - the ramen is the perfect balance of toothsome softness and chewiness, while the light, sweet broth is redolent with sweet flavor of pork and green onion. ", "The combo is also good, their sake (salmon) and ", "maguro (tuna) sashimi is also good, albeit a bit small. ", "The prices are right though - for less than $10 per person, it's a great deal."], "author": "Dara Z.", "review": "I'll say it - best noodle house in SF! It's a great casual spot for delicious fresh ramen, udon and soba. My husband calls me a certified noodle-a-holic and this is my first choice when I get that noodle craving. \r\n\r\nThe steaming bowl of ramen with chicken kara-age (order it appetizer size, otherwise the serving is kind of small) is my favorite - the ramen is the perfect balance of toothsome softness and chewiness, while the light, sweet broth is redolent with sweet flavor of pork and green onion. The combo is also good, their sake (salmon) and maguro (tuna) sashimi is also good, albeit a bit small. The prices are right though - for less than $10 per person, it's a great deal.", "rating": 5, "date": "2006-04-08"}, {"excerpts": ["i got the chicken curry udon, which was tasty. ", "unfortunately, i didn't get it until my friends were halfway done with their noodles! ", "i'm usually pretty patient, but this was ridiculous...", "plus, this place isn't big, it's not like they couldn't notice that i was the only one out of the three of us without a large bowl of noodles in front of me. ", "when i finally asked, they just kept saying 'it's coming, it's coming, sorry."], "author": "Angela W.", "review": "just got back from dinner there. i got the chicken curry udon, which was tasty. unfortunately, i didn't get it until my friends were halfway done with their noodles! i'm usually pretty patient, but this was ridiculous...plus, this place isn't big, it's not like they couldn't notice that i was the only one out of the three of us without a large bowl of noodles in front of me. when i finally asked, they just kept saying 'it's coming, it's coming, sorry.' hmm...i just want my noodles! \n\nmy cousin had the shiyo ramen, which was had a tasty, light broth, but a little on the salty side. we also got an order of edamame. it came with salt on the outside, which usually i kinda like, but these were really salty. we also got the hiyayakko appetizer, which was really just a piece of tofu with some chopped green onion on top, hmm...i could make this at home. and we waited about 20 minutes for these apps, how long does it take to cut some tofu and chop some green onions? \n\nanyways, i would maybe come back to try it again, just because it was tasty, and i like me a bowl of hot soup noodles on a cold day. i'll just have to be prepared to wait awhile for my food...", "rating": 2, "date": "2008-07-20"}, {"excerpts": ["we both ordered nabeyaki udon.  ", "me with the oden one.  ", "my friend with the beef one.  ", "both were kind of small for charging $12something for it.  ", "you eat oden with mustard.  ", "when i asked for it.  ", "guess what they brought me.  ", "on a little soy sauce plate.  ", "as if i couldnt tell.  ", "guess what?  ", "heinz mustard!!!  ", "wth.  ", "the udon noodles were chewy and not mushy.  ", "i like them that way.  ", "but im not asking for mustard there again to eat with my oden.  "], "author": "claudia y.", "review": "for some reason i had thought this place was called zuzu.  but i think it is because i was reading the name from the inside of the glass and they write the s with the same corners as the z.  or maybe im dyslexic.  anyways ...\n\nwe got here at around 8:30 on a monday night and the place only had one table open.  we were seated promptly.  the service is a bit weird.  the waitresses kept looking at me funny.  i have no idea why.  do i have something on my face?  anyways again ...\n\nwe both ordered nabeyaki udon.  me with the oden one.  my friend with the beef one.  both were kind of small for charging $12something for it.  you eat oden with mustard.  when i asked for it.  guess what they brought me.  on a little soy sauce plate.  as if i couldnt tell.  guess what?  heinz mustard!!!  wth.  they didnt have the japanese mustard?\n\nthe udon noodles were chewy and not mushy.  i like them that way.  but im not asking for mustard there again to eat with my oden.  maybe im not getting oden there again.\n\ni came here again on a second try and actually got so infuriated with the seating situation that i left but i cant remember why now.  i remember asking the hostess if i could sit down and she said no or something.  last night i went back and noticed that they seat people first come first serve regardless of table size.  for example if the next names on the list were john 1 and jane 3 and the next open table was for 4 people they would go ahead and seat the one dude john at the table for 4.  \n\nthis time i got the hiya yakko tofu, edamame, and pea shoots ramen.  sometimes im a picky eater.  i wanted a certain broth (shio) with certain toppings (chicken and veggies) and she had to go into the kitichen and ask.  it took her a good 5 minutes.  AND it was an $1 to make THAT ramen $12.  WTF??  its not like shio broth is more expensive.  i was like nm and got the pea shoots ramen which they call cilantro but it isnt really cilantro.  when it came i was a bit shocked, the pea shoots were raw.  i pushed them underneath the ramen but they were still raw when i ate them last.  ugh\n\nand theres a big sign that says they dont do take out anymore\n\ni really want to like this place .. but theyre making it hard", "rating": 3, "date": "2008-09-30"}, {"excerpts": ["They have a fairly wide variety of noodles to choose from--udon, ramen, soba, somen--and have fairly authentic tasting dishes.  "], "author": "Karisa L.", "review": "I have tried many noodle places in Japantown and throughout San Francisco and few of them hold a flame to Suzu.  My personal favorite is the combo ramen noodles and salmon don (salmon sashi over rice).  It is a pretty hearty portion for a decent price (around $10).  They have a fairly wide variety of noodles to choose from--udon, ramen, soba, somen--and have fairly authentic tasting dishes.  Also, the ramen with kara age chicken (japanese fried chicken) comes highly recommended.\n\nThe only drawback is that the restaurant is very small and they don't take reservations so you usually have to wait.  But it is definitely worth it!", "rating": 5, "date": "2009-05-15"}, {"excerpts": ["the Tokoyo Ramen and my hubby had the udon & unagi combo.  ", "We thought the food was good and the service was great.  ", "The only problem was that the restaurant is so small there was just a huge line!  ", "I would definitely go back again...maybe not during peak time :)"], "author": "JenJen W.", "review": "My hubby and I came here for lunch today and it was packed! We waited for about 15  minutes and finally got a table.  I had the Tokoyo Ramen and my hubby had the udon & unagi combo.  We thought the food was good and the service was great.  The only problem was that the restaurant is so small there was just a huge line!  I would definitely go back again...maybe not during peak time :)", "rating": 4, "date": "2009-01-19"}, {"excerpts": ["The udon and soba noodles are very good... however 12.50 is steep!  ", "The big drag to the restaurant is the long wait list to eat- since there are no reservations.  ", "I waited almost 45 minutes to get seated and then the service is somewhat typical (terse yet efficient).  ", "With two apps and two entrees and one large beer ", "the total came up to 65 dollars!  ", "65 dollars to get udon and soba noodles?  ", "Look, go to Mifune upstairs and get that same fresh noodles for half the cost."], "author": "Anne L.", "review": "The udon and soba noodles are very good... however 12.50 is steep!  The big drag to the restaurant is the long wait list to eat- since there are no reservations.  I waited almost 45 minutes to get seated and then the service is somewhat typical (terse yet efficient).  With two apps and two entrees and one large beer the total came up to 65 dollars!  65 dollars to get udon and soba noodles?  Look, go to Mifune upstairs and get that same fresh noodles for half the cost.", "rating": 3, "date": "2008-10-27"}, {"excerpts": ["I had one of their hot pot udon dishes and both the noodles and broth were excellent. ", "There was some tempura in it as well and the squash tempura was very tasty. \n", "The only drawback was that the service was rather slow. ", "I think they only had 2 waiters and they were doing some cooking as well."], "author": "Olivia H.", "review": "Wow, I couldn't believe how small this place was. There was maybe 6 tables inside and 2 more small ones outside. Fortunately, we went early for dinner and didn't have to wait too long. The food was great. I had one of their hot pot udon dishes and both the noodles and broth were excellent. There was some tempura in it as well and the squash tempura was very tasty. \nThe only drawback was that the service was rather slow. I think they only had 2 waiters and they were doing some cooking as well.", "rating": 4, "date": "2008-03-17"}, {"excerpts": ["we also tried a noodle dish for the famous udon.  ", "while the noodles themselves were firm and delicious, the broth was like dishwater.  "], "author": "T S.", "review": "i'd seen long lines for a year so i was really mystified when i finally ate here.  was this one of those san francisco places that was all buzz and no content? i think so.\n\nthe waitress who seated us after a 25 minute wait in line was pretty surly and disinterested.  i knew we were in for disappointment when the $9.95 sashimi platter arrived...4 pieces of tuna, 4 of salmon, each piece the size and taste of a tiny eraser.  we also tried a noodle dish for the famous udon.  while the noodles themselves were firm and delicious, the broth was like dishwater.  my friend couldn't even eat it.\n\nthe tasteless minature sashimi, the blah soup broth, and a highly oversalted edamame came to $30.  on a good day at mifune upstairs it allwould have been $10 less and much much better.\n\nplus no line.  and sweet waitresses.\ndon't bother on this one.", "rating": 2, "date": "2008-11-18"}, {"excerpts": ["Tried nabeyaki udon once which was just okay, so now I just stick with spicy negi ramen.  ", "Service for tea refill and water can be iffy.  ", "No options for different types of broth."], "author": "L S.", "review": "My wife and I love the spicy negi ramen.  Noodles are fresh and broth is great.  Chicken karaage and agedashi tofu appetizers are good.  Almost always long lines but at least they quickly take your order and serve you.  Combos are good deals.  Tried nabeyaki udon once which was just okay, so now I just stick with spicy negi ramen.  Service for tea refill and water can be iffy.  No options for different types of broth.", "rating": 4, "date": "2009-12-01"}, {"excerpts": ["We ordered the salmon sashimi/ udon noodle combo and were not disappointed. ", "Fresh, buttery sahimi with perfectly textured rice and rich udon broth (loved the crispy onions in that bowl). ", "Feeling really spoiled right now as I've been to J-town 4 times within the last 2 weeks. ", "I could go there every day."], "author": "Sandrita R.", "review": "The itty bitty noodle house that could. This petite corner spot was very impressive in both service and presentation We ordered the salmon sashimi/ udon noodle combo and were not disappointed. Fresh, buttery sahimi with perfectly textured rice and rich udon broth (loved the crispy onions in that bowl). Feeling really spoiled right now as I've been to J-town 4 times within the last 2 weeks. I could go there every day.", "rating": 3, "date": "2008-05-09"}, {"excerpts": ["I ordered a vegetable and tempura udon noodle bowl. ", "Very good flavor...simple miso broth. ", "The udon noodles were perfectly cooked. ", "The charsu meat was very good. "], "author": "Matt K.", "review": "Suzu is a simple, small ramen place. The fried chicken appetizer is very good. I ordered a vegetable and tempura udon noodle bowl. Very good flavor...simple miso broth. The udon noodles were perfectly cooked. The charsu meat was very good. Has the \"authentic\" ramen house feel, seems like they have 1 cook in the kitchen, and 1 waitress.\n\nThis place would be an excellent place to come when the weather cools down. Warm noodles on a cold day, does it get any better?", "rating": 4, "date": "2008-09-06"}, {"excerpts": ["The sign didn't deter me from eating there because I really liked their tempura udon.  ", "What drove me away was the waitress's reaction.  ", "I wanted her to explain the sign and settle my unease.  ", "Maybe it was nothing or perhaps it was some Japanese ingredients that the health dept. ", "didn't understand.  ", "So when I asked the waitress what the sign meant and she pretended she didn't know what sign I was talking about, my alarm went off.  ", "I pointed the sign to her and she brusquely responded by showing me to my table.   ", "At the table, I asked her again what the sign meant ", "and she said she didn't know.  ", "I thought with that reaction, it must be something, so I left.  ", "I still can't find a tastier tempura udon place, but I'll keep looking."], "author": "Lisa F.", "review": "Did anyone read a discreetly posted sign from the health dept. on their lower left window?  It's right next to their high score report also from the health dept. Check it out next time you go. It reads something like the food and beverages they serve might cause cancer, birth and reproductive defects. I had to read it several times to comprehend because I guess I didn't believe what I was reading.\n\nI was waiting outside their entrance when I noticed it.  The sign didn't deter me from eating there because I really liked their tempura udon.  What drove me away was the waitress's reaction.  I wanted her to explain the sign and settle my unease.  Maybe it was nothing or perhaps it was some Japanese ingredients that the health dept. didn't understand.  So when I asked the waitress what the sign meant and she pretended she didn't know what sign I was talking about, my alarm went off.  I pointed the sign to her and she brusquely responded by showing me to my table.   At the table, I asked her again what the sign meant and she said she didn't know.  I thought with that reaction, it must be something, so I left.  I still can't find a tastier tempura udon place, but I'll keep looking.", "rating": 1, "date": "2006-11-18"}, {"excerpts": ["But I love the noodles, especially the hot Udon noodles with the chicken katsu curry on the side. ", "A perfect amount of food! ", "And it's pretty inexpensive too."], "author": "Anna G.", "review": "I love, love, love Suzu! Sure, it's in a mall--not the classiest of locations. Sure, it's tiny. But I love the noodles, especially the hot Udon noodles with the chicken katsu curry on the side. A perfect amount of food! And it's pretty inexpensive too.", "rating": 5, "date": "2007-10-22"}, {"excerpts": ["the udon with shrimp tempura is sublime. ", "all of japantown can be considered my happy place, and this is truly one of its crown jewels."], "author": "Sally R.", "review": "the udon with shrimp tempura is sublime. all of japantown can be considered my happy place, and this is truly one of its crown jewels.", "rating": 5, "date": "2010-06-29"}, {"excerpts": ["Delicious, inexpensive bowls of udon or soba.  ", "Good tempura.  ", "I did not like the ramen, but overall, a good standby for a quick meal in Japantown."], "author": "erika s.", "review": "Delicious, inexpensive bowls of udon or soba.  Good tempura.  I did not like the ramen, but overall, a good standby for a quick meal in Japantown.", "rating": 4, "date": "2008-03-08"}, {"excerpts": ["But when a Japanese friend told me the udon and dashi are pretty good at Suzu, I decided to give it a chance.  ", "The wait was a bit long because it was Friday night.  ", "Nabeyaki udon is my favorite and I tend to order it at every Japanese restaurant that offers it.  ", "So I was happy to find there were a variety on the menu.  ", "I was a little put off by the price though.  ", "Although it's not grossly overpriced, it is definitely on the higher end.  ", "The other udon dishes and combinations are a better value I think.\n\n", "I ordered the Chicken Nabeyaki Udon. ", "The udon was pretty chewy and had the thickness I love.  ", "Unfortunately, the service was ridiculously slow and it wasn't just for us.  ", "I would come back here for a bowl of udon.  ", "Hopefully the wait and service won't be so slow next time..."], "author": "M C.", "review": "I've always passed by Suzu while I'm in Japantown, but the line is outrageous.  I'm also really picky about Japanese food since I lived there.  But when a Japanese friend told me the udon and dashi are pretty good at Suzu, I decided to give it a chance.  The wait was a bit long because it was Friday night.  Nabeyaki udon is my favorite and I tend to order it at every Japanese restaurant that offers it.  So I was happy to find there were a variety on the menu.  I was a little put off by the price though.  Although it's not grossly overpriced, it is definitely on the higher end.  The other udon dishes and combinations are a better value I think.\n\nI ordered the Chicken Nabeyaki Udon. The udon was pretty chewy and had the thickness I love.  Unfortunately, the service was ridiculously slow and it wasn't just for us.  The surrounding tables were looking even more impatient than we were.\n\nI would come back here for a bowl of udon.  Hopefully the wait and service won't be so slow next time...", "rating": 4, "date": "2008-10-05"}, {"excerpts": ["Best Udon in town but the place is small and usually a long wait before seating.  ", "The Udon there is so good!  ", "I think it might have changed hands recently and the food quality has slightly suffered.  ", "Still not bad though."], "author": "Nicholas W.", "review": "Best Udon in town but the place is small and usually a long wait before seating.  The Udon there is so good!  I think it might have changed hands recently and the food quality has slightly suffered.  Still not bad though.", "rating": 4, "date": "2010-08-15"}, {"excerpts": ["others had spicy negi ramen, udon w/ a side of karaage, and soba with tempura. ", "i tried the ramen and udon and both types of noodles were perfectly cooked. ", "i now heart suzu."], "author": "Angi C.", "review": "yum... i heart noodles. but i only heart not-overcooked, al-dente noodles. 4 of us came here before a movie next door. i had the yamakake don - tuna with grated potatoes - which i was excited to see on the menu (fyi, if you don't like slimy things, don't order this.) it was good with an extra dash of soy, but i like things saltier than others, i think. others had spicy negi ramen, udon w/ a side of karaage, and soba with tempura. i tried the ramen and udon and both types of noodles were perfectly cooked. i now heart suzu.", "rating": 4, "date": "2007-07-15"}, {"excerpts": ["My husband tried the Udon and like it as well.  ", "The menu is limited ", "but I think they added on a little more variety now of the way you can order your Ramen or Udon.  ", "The wait is often very long and service could be slow at time.  ", "Will I go out of my way to come here and eat Ramen", "......", "the answer is no ", "but if I am in the neighborhood", "......Yes!"], "author": "Mel T.", "review": "Ramen is good here but Katana-ya is better.  If you find yourself in Japan Town and wanting a bowl of Ramen, this is the place.  The Ramen texture is chewy and the broth is yummy.  My husband tried the Udon and like it as well.  The menu is limited but I think they added on a little more variety now of the way you can order your Ramen or Udon.  The wait is often very long and service could be slow at time.  Will I go out of my way to come here and eat Ramen......the answer is no but if I am in the neighborhood......Yes!", "rating": 3, "date": "2008-07-06"}, {"excerpts": ["I tried the tempura and ramen lunch combo and the cold udon and unagi over rice combo.  ", "The tempura was pretty good.  ", "Nice, crisp veggies, nothing to complain about there.  ", "The unagi was pretty standard, was not disappointed with that either.  ", "My ramen noodles were pretty good.  ", "They had that certain chewiness that I feel really distinguishes well-made ramen.  ", "It could have been a little bit firmer, but I should have asked the waitress for that.  ", "The broth was a little bit disappointing.  ", "It lacked complexity.  ", "I can't even remember what else was served with the ramen.  ", "All I remember about it was the noodles.  ", "The cold udon was probably my favorite thing there.  ", "It was chewy and firm and the dipping sauce was simple and delicious.  ", "I would definitely come back for the noodles, but maybe try a different kind of broth for ramen (like maybe miso instead of shio) or just go straight for the really simple stuff that focuses mainly on the noodles."], "author": "Linh N.", "review": "I tried the tempura and ramen lunch combo and the cold udon and unagi over rice combo.  The tempura was pretty good.  Nice, crisp veggies, nothing to complain about there.  The unagi was pretty standard, was not disappointed with that either.  My ramen noodles were pretty good.  They had that certain chewiness that I feel really distinguishes well-made ramen.  It could have been a little bit firmer, but I should have asked the waitress for that.  The broth was a little bit disappointing.  It lacked complexity.  I can't even remember what else was served with the ramen.  All I remember about it was the noodles.  The cold udon was probably my favorite thing there.  It was chewy and firm and the dipping sauce was simple and delicious.  I would definitely come back for the noodles, but maybe try a different kind of broth for ramen (like maybe miso instead of shio) or just go straight for the really simple stuff that focuses mainly on the noodles.", "rating": 4, "date": "2009-08-12"}, {"excerpts": ["and at Suzu House, a bowl of unagi don comes accompanied by a bowl of your choice of udon, soba or ramen, for less than $10! if you're there at lunch time, that is.  wash that all down with some sake ", "and you're ready Kabuki (theater that is...)."], "author": "ray e.", "review": "unagi. that's all you have to say to get my attention. and at Suzu House, a bowl of unagi don comes accompanied by a bowl of your choice of udon, soba or ramen, for less than $10! if you're there at lunch time, that is.  wash that all down with some sake and you're ready Kabuki (theater that is...).", "rating": 5, "date": "2008-03-05"}, {"excerpts": ["My favorites: vegetarian udon (I get that in ramen form, though), salmon sashimi, salmon don, vegetable tempura, unagi don, and their ramen--all y'all who don't like their ramen are CRAZY.  ", "This is the only ramen in town I'll eat (though someone mentioned that there was egg in their noodles, so that would explain everything since i am an egg lover).  ", "It's nice and al dente, and I love the soup ", "(my dad says it tastes bitter, though, and prefers Sapporo-Ya upstairs).  ", "I often get it as part of their lunch combo (some kind of rice bowl + ramen) because it's so cheap I'd feel stupid ordering just one item for almost the same price, but I really shouldn't because there's just too much food and somebody else has to finish my ramen every time.  ", "What else...", "oh, they're always coming around with hot tea refills.  ", "I have never had to ask.  ", "And there's a little sink in the corner for you to wash your hands before you eat.  ", "They've been closed now for the past week, though, and won't be open again until the 18th.  ", "What is going on??  ", "If anybody knows, please message me, thanks."], "author": "Janice C.", "review": "I couldn't decide if I should write them a crappy review so that I wouldn't have to wait in line all the time...or a good one so they never go out of business.  But since they have been good to me, I am giving them five stars.  They're always friendly and conversational, and they always remember me and what my dad wants, though I guess it would be hard not to, since we go there almost twice a week.  My favorites: vegetarian udon (I get that in ramen form, though), salmon sashimi, salmon don, vegetable tempura, unagi don, and their ramen--all y'all who don't like their ramen are CRAZY.  This is the only ramen in town I'll eat (though someone mentioned that there was egg in their noodles, so that would explain everything since i am an egg lover).  It's nice and al dente, and I love the soup (my dad says it tastes bitter, though, and prefers Sapporo-Ya upstairs).  I often get it as part of their lunch combo (some kind of rice bowl + ramen) because it's so cheap I'd feel stupid ordering just one item for almost the same price, but I really shouldn't because there's just too much food and somebody else has to finish my ramen every time.  What else...oh, they're always coming around with hot tea refills.  I have never had to ask.  And there's a little sink in the corner for you to wash your hands before you eat.  They've been closed now for the past week, though, and won't be open again until the 18th.  What is going on??  If anybody knows, please message me, thanks.", "rating": 5, "date": "2006-10-09"}, {"excerpts": ["I heard the nabe udon was supposed to be yummy too."], "author": "T C.", "review": "This place was pretty good. BF and I stopped by on Sunday afternoon around 4:45pm because he felt like ramen. It was closed until 5pm, so we decided to wait 15 minutes. They were a few people standing around waiting already so I suggested that we wait there too. (BF wanted to go look at the bookstore and come back at 5). Thank goodness we waited because a line formed behind us. We were 3rd to enter the restauarant. They seated us right next to the sink thats in the dining room (which is weird in itself, and possibly unsanitary). Luckily, the waitress took our order first and we were first to get our food. I had the karage rame and BF had the mabo tofu ramen because he likes spicy. Since this was technically our late lunch and we were eating dinner later, we decided not to get a combo or any appetizers. I liked my karage and BF's was pretty spice (which he likes). I like the noodles, which are supposedly home-made. We even paid and left before some people who were seated at the same time as us got their food. I guess you can say we got pretty lucky.\n\nI would definitely come back again to try some of the other dishes. I heard the nabe udon was supposed to be yummy too.", "rating": 4, "date": "2009-02-17"}], "tori udon": [{"excerpts": ["I don't know what everyone is rambling about but the Tori Udon I ordered was great. ", "Udon noodles in general is one of my favorite foods. ", "It had enough pieces of chicken in the soup to satisfy me and the noodles itself was great. ", "I kinda like that seaweed thing they had in the soup. ", "I'm not that great with chopsticks ", "but I made sure I finished all the noodles and pieces of chicken. ", "It was that good. ", "PS ", "it's not that uncommon to see cooks that are not of the ethnic food in the kitchen..."], "author": "Gerard Y.", "review": "I don't know what everyone is rambling about but the Tori Udon I ordered was great. Udon noodles in general is one of my favorite foods. It had enough pieces of chicken in the soup to satisfy me and the noodles itself was great. I kinda like that seaweed thing they had in the soup. I'm not that great with chopsticks but I made sure I finished all the noodles and pieces of chicken. It was that good. PS it's not that uncommon to see cooks that are not of the ethnic food in the kitchen...", "rating": 4, "date": "2007-05-30"}], "miso nabeyaki udon  dinner only": [], "nabe yaki udon": [{"excerpts": ["I usually get their Nabe Yaki Udon with tempura on the side. ", "(be sure to tell them this if not your tempura will be placed in the soup =soggy tempura) "], "author": "Cyndi L.", "review": "Service: \nAll of the staff here is very polite and friendly. Always greet you with a smile and brings you water or tea as they seat you. \n\nFood: \nBest Karaage and Tempura! I usually get their Nabe Yaki Udon with tempura on the side. (be sure to tell them this if not your tempura will be placed in the soup =soggy tempura) Their curry dishes are also very good, but they give you a lot of curry sauce and rice but very little meat. \n\nCON:\nThere are no substitutions. If you don't like certain food, you can only remove them but can not add additional. Like I wanted to replace the Eggplant tempura with something else and the waitress said no, you can only remove no substituting. So pretty much, take it or leave it kind of situation.", "rating": 4, "date": "2017-06-20"}], "yamakake don": [{"excerpts": ["i had the yamakake don - tuna with grated potatoes - which i was excited to see on the menu ", "(fyi, if you don't like slimy things, don't order this.) ", "it was good with an extra dash of soy, but i like things saltier than others, i think. "], "author": "Angi C.", "review": "yum... i heart noodles. but i only heart not-overcooked, al-dente noodles. 4 of us came here before a movie next door. i had the yamakake don - tuna with grated potatoes - which i was excited to see on the menu (fyi, if you don't like slimy things, don't order this.) it was good with an extra dash of soy, but i like things saltier than others, i think. others had spicy negi ramen, udon w/ a side of karaage, and soba with tempura. i tried the ramen and udon and both types of noodles were perfectly cooked. i now heart suzu.", "rating": 4, "date": "2007-07-15"}], "ebi  shrimp fried curry": [], "maguro don": [{"excerpts": ["I ordered the maguro don combo, which was the fish, rice, and ramen (not.. combined in a bowl).  "], "author": "Tori S.", "review": "At first it seemed kind of expensive (over $10 for udon??), but my friend and I were devoid of any new, fresh choices in j-town.  We picked Suzu because we'd both never been there, and we were both in a ramen mood.\n\nTheir dinner specials are a LOT of food - a hefty bowl of ramen (only a bit smaller than the regular bowls) plus something with rice and a choice of unagi, tuna sashimi, etc.  I ordered the maguro don combo, which was the fish, rice, and ramen (not.. combined in a bowl).  My friend ordered their Tokyo ramen, going off the theory that the first listing is usually their \"signature\" dish.\n\nThe ramen was pretty good - not as good as Tanpopo, but for the price (a meal around $20) + both of us really full = a good place to go back.", "rating": 4, "date": "2009-03-12"}], "salmon sashimi don": [{"excerpts": ["Again, try their combo special with the salmon sashimi don and curry udon.  "], "author": "Keika L.", "review": "Listen all you ramen snobs!  Did you ever think that it's hard to make AUTHENTIC Japanese ramen because the ingredients are limited in the US?  You guys piss me off!\n\nThis noodle house makes a really great curry udon and even if the ramen is average, it doesn't mean you can't try their other dishes.  My girlfriend and I love the area, the atmosphere and the service we get from this charming noodle house in J-town and I'm sure anybody who isn't a stuck up \"This isn't like the ramen in Japan\" a**hole would appreciate what they do offer.\n\nAgain, try their combo special with the salmon sashimi don and curry udon.  Their soba is delish too if you don't feel like ramen or udon.", "rating": 5, "date": "2008-03-24"}, {"excerpts": ["Every time I've been here, which is about once every 1-2 yrs, things have been pretty tasty - I usually stick with the soba and udon soups which are pretty good, and their salmon sashimi don.     "], "author": "Tyler C.", "review": "Every time I've been here, which is about once every 1-2 yrs, things have been pretty tasty - I usually stick with the soba and udon soups which are pretty good, and their salmon sashimi don.     A friend who lives nearby seems to think they had a dip in quality over the past couple of  years but recently have been getting back to their early, hi-flying days.   \n\nNo experience with their ramen....", "rating": 4, "date": "2007-11-10"}], "chicken curry don": [{"excerpts": ["The chicken curry don is soaked with curry sauce. "], "author": "Kelvin Y.", "review": "I had the shoyu ramen. Very ordinary and tasted like the $0.99 instant noodle. They also gave me ONE piece of old bok choy which was very odd. \n\nThe chicken curry don is soaked with curry sauce. I felt like I was drinking a bowl of curry soup. \n\nThe worst part about this restaurant is all their servers wear plastic gloves when they served you dishes! I understand the intention but it's actually not hygienic at all because the germs would just stay on the gloves. Not to mention how unappetizing it is!", "rating": 2, "date": "2017-05-13"}, {"excerpts": ["I got the chicken curry don with a spicy negi ramen. ", "The ramen broth was flavorful but a bit greasy with the noodles al dente to perfection. "], "author": "Anna S.", "review": "A bit of a wait during lunch... but so worth it!\n\nCombo meal. Choose any \"don\" item (smaller size)  with a ramen (full size) for $10. I'm sold! Yadayada mean?!\n\nI got the chicken curry don with a spicy negi ramen. The ramen broth was flavorful but a bit greasy with the noodles al dente to perfection. The ramen came with a spicy green onion concoction, chasu, and bamboo shoots.\n\nThis ramen place is more on the greasy side than MSG side.\nI was told that they make their own noodles too.", "rating": 4, "date": "2008-07-23"}, {"excerpts": ["chicken curry don + ramen ", "combo = $9.95. ", "off the heezy, son! "], "author": "B B.", "review": "chicken curry don + ramen combo = $9.95. off the heezy, son! nuff said!\n\nservice was pretty awful since i sat outside. i'm sure they forgot about me. cuz i waited FOREVER for my fucking check. but the food makes up for it.  i'll definately be back!", "rating": 4, "date": "2008-08-27"}], "hot sake": [{"excerpts": ["Good hot sake, green tea. ", "No complaints on my end! ", "Definitely stop here if you're hanging out in Japantown for the afternoon."], "author": "Stephanie L.", "review": "Not sure what all of the bad reviews are about, this place is great to stop in and have a solid bowl of ramen, udon, or soba noodles. Fast service, in and out in 30 minutes, if you really need to be. Good hot sake, green tea. No complaints on my end! Definitely stop here if you're hanging out in Japantown for the afternoon.", "rating": 5, "date": "2016-09-09"}, {"excerpts": ["Tokyo ramen & hot sake.", "\"  Followed by Sapporo.  ", "Hai, dozo!"], "author": "Roland C.", "review": "Suzu is my regular ramen house in San Francisco.  It's serves up the best actual ramen type noodles in the city in my honest opinion, & I've tried many ramen joints here searching for good ramen.  Of course you've got to wait during peak times.  That's inevitable, for there are only about 10 tables, including the 2 out in the mall area.  But I think it's worth the wait.  The noodles are home made, fresh, and have great tooth.  I go for the basic Tokyo ramen.  I'm no nonsense about ramen.  After all, ramen is all about the noodles.  The broth is for flavoring; if you drink it, you may end up with a belly ache - it's way too fatty to absorb without digestion issues.  \n     I've had some items on the side once in a while.  Karaage, sashimi, tofu, seaweed, etc.  Not very often, however.  I usually order my bowl of ramen as I'm sitting down to a table.  \"Tokyo ramen & hot sake.\"  Followed by Sapporo.  Hai, dozo!", "rating": 5, "date": "2008-05-20"}], "cold sake": [], "japanese beer": [{"excerpts": ["It stays open relatively late for brothy, savory, noodle slurping goodness with a swig of Sapporo Japanese Beer to wash it all down, not to mention the price was right. ", "Note to self: the waitress didn't know the difference between white and dark (breast/thigh) meat chicken. ", "I asked her if the chicken was white meat and she gave a firm ", "yes ", "and it was dark meat....", "yikes!!!! ", "(dark meat repulses me). ", "However the broth and the egg made up for the confusion.  ", "Aahhhh I am all about that Ramen life...."], "author": "Stacie J.", "review": "Amongst a lot of people and things I am on to the next phenomenon.......Ramen. So prior to having dinner at Suzu Noodle House, I had already had a not so satisfying bowl of ramen. Suzu definitely turned it around for me. It stays open relatively late for brothy, savory, noodle slurping goodness with a swig of Sapporo Japanese Beer to wash it all down, not to mention the price was right. Note to self: the waitress didn't know the difference between white and dark (breast/thigh) meat chicken. I asked her if the chicken was white meat and she gave a firm yes and it was dark meat....yikes!!!! (dark meat repulses me). However the broth and the egg made up for the confusion.  Aahhhh I am all about that Ramen life....", "rating": 3, "date": "2016-03-20"}], "house wine": [{"excerpts": ["Speaking of thirst, if you are thinking of ordering house wine, ask yourself if you like Charles Shaw aka two buck Chuck because that was what I saw in the fridge. ", "So be aware. "], "author": "Kwoky L.", "review": "So if you are expecting authentic Japanese ramen, please look further and away from this place. Shio broth has this uncanny similarity to Chinese broth and it lacks depth and flavour. All I could taste was MSG. I could not drink enough water to quench the thirst. \n\nSpeaking of thirst, if you are thinking of ordering house wine, ask yourself if you like Charles Shaw aka two buck Chuck because that was what I saw in the fridge. So be aware. Servers were unfriendly.\n\nNeedless to say I felt cheated and I would rather spend my $10 at other ramen places.", "rating": 2, "date": "2013-09-08"}], "green tea ice cream": [], "azuki over green tea ice cream": []}