{"skinny guacamole no chips": [], "grilled corn  black bean taco salad": [], "sopa de tortilla": [{"excerpts": ["California Burrito\nSopa de Tortilla \nElote"], "author": "Stephanie M.", "review": "Tacko is one of my favorite casual spots in the Marina. Actually, San Francisco can be very small. My mom met the owner on her plane ride from Nicaragua to San Francisco. She raved so much about him and his restaurant that every time she's in town, she always wants to go to Tacko. Service is a tad slow and prices are a little high, but the food makes up for that and always consistently good. Try one of these (or all) and you can't go wrong: \n\nWatermelon or Mango Agua Fresca \nCarne Asada Taco (Nicks Way)\nCarnitas Taco (Nicks Way) \nCalifornia Burrito\nSopa de Tortilla \nElote", "rating": 4, "date": "2018-04-09"}, {"excerpts": ["For the more adept, try the sopa de tortilla. ", "And for the master foodie, get the lobster roll. ", "Very friendly staff. ", "Can get busy during dinner rush. ", "Best time is 2pm lunch."], "author": "Matt H.", "review": "I'm giving them five stars cause I really can't find anything wrong with what they do. They are affiliated with taco shop@under dogs, nicks crispy tacos and formally with rouge, so it's the same menu. I feel like this is better quality and prep due to the open kitchen.  I recommend the carnitas nicks way, for beginners. For the more adept, try the sopa de tortilla. And for the master foodie, get the lobster roll. Very friendly staff. Can get busy during dinner rush. Best time is 2pm lunch.", "rating": 5, "date": "2014-03-19"}], "elote con queso": [{"excerpts": ["*Elote con Queso (Corn on the Cob w/ Cheese): ", "Fresh corn on the cob brushed with lime salsa and dusted with Cotija cheese and cayenne pepper. ", "($3.95)\n", "*Mexican \"Street-Style\" Tacos: ", "Three authentic Mexican tacos, One each of carne asada, carnitas and pollo, topped with cilantro and onions on small corn tortillas ($8.50)\n", "*", "\"Baja Style\" Fish Taco: ", "One taco with beer-battered fish in soft corn tortillas, with cilantro, cabbage, red onions and roasted tomato and lime salsas ($5.50)\n", "*", "California Burrito: ", "A SoCal special, Your choice of meat, french fries, cheese and pico ", "de gallo ($10.95), add Carnitas (+$3.50)\n"], "author": "Elena N.", "review": "I was craving tacos, so the roommate and I decided to order Tacko for dinner on Sunday, June 12th. One of my coworkers raves about this place, so I wanted to try it. We ordered delivery via DoorDash. Placed order at 8:30pm and it arrived at 9:06pm. I live in Outer Richmond.\n\n*Elote con Queso (Corn on the Cob w/ Cheese): Fresh corn on the cob brushed with lime salsa and dusted with Cotija cheese and cayenne pepper. ($3.95)\n*Mexican \"Street-Style\" Tacos: Three authentic Mexican tacos, One each of carne asada, carnitas and pollo, topped with cilantro and onions on small corn tortillas ($8.50)\n*\"Baja Style\" Fish Taco: One taco with beer-battered fish in soft corn tortillas, with cilantro, cabbage, red onions and roasted tomato and lime salsas ($5.50)\n*California Burrito: A SoCal special, Your choice of meat, french fries, cheese and pico de gallo ($10.95), add Carnitas (+$3.50)\n*Quesadilla: A crispy flour tortilla with your choice of meat, melted jack cheese, & pico de gallo ($9.95), add Chicken (+$3.50)\n\nI like the tacos at Underdog's, so I was happy with the street tacos. All were meaty and flavorful. I normally like the fish tacos there too, but this one was more batter than fish. Maybe I got an off taco, but I was a little disappointed. The elote was good. The corn super tender. The roommate enjoyed his burrito and quesadilla. I tasted the quesadilla and it had a good amount of chicken and cheese. Was a nice melty bite. They also gave us a small bag of chips and two different salsas.\n\nOther than the fish taco, everything else was as good as I remember. Glad I can also get tacos Nick's Way from another location if the craving hits.", "rating": 4, "date": "2016-06-18"}, {"excerpts": ["I love love love their lobster roll and elote con queso. ", "Must try!!! ", "A little pricey but worth it."], "author": "Mimi L.", "review": "We found this place while walking endlessly through the streets of San Francisco. I love love love their lobster roll and elote con queso. Must try!!! A little pricey but worth it.", "rating": 5, "date": "2017-09-24"}, {"excerpts": ["The Elote con Queso (corn with cheese) is so delicious and tender too. ", "The lobster roll is just \"ok\" because the bread gets too soggy, but the amount of lobster makes up for it and puts a smile on my face. ", "If you are really hungry, the San Francisco burrito is a beast and SO good. ", "You can't go wrong with anything on the menu. ", "But if you are only here once, get a Nick's Way taco. ", "You are welcome."], "author": "Julia L.", "review": "The BEST tacos. This is one of our go-to food spots in our neighborhood. We always bring friends from out of town here and they LOVE it. Growing up in Southern California, I know a good taco and Tacko does not disappoint. For the perfect size meal, for me 2 Nick's Ways tacos and for my boyfriend usually 3, sometimes 4 Nick's Ways tacos if he's really hungry.  The Elote con Queso (corn with cheese) is so delicious and tender too. The lobster roll is just \"ok\" because the bread gets too soggy, but the amount of lobster makes up for it and puts a smile on my face. If you are really hungry, the San Francisco burrito is a beast and SO good. You can't go wrong with anything on the menu. But if you are only here once, get a Nick's Way taco. You are welcome.", "rating": 5, "date": "2017-07-29"}, {"excerpts": ["Their Elote Con Queso is a must get from their menu!  ", "It's corn on the cob that is buttered, mayo-ed and sprinkled with cheese and light chili pepper!  ", "It tasted so good after a couple of drinks from a bar nearby!  ", "Well, anything tastes great, I would suppose, after drinking!  ", "Get that and some street tacos!  ", "It was Tacko Tuesdays, so street tacos were 2 for $2!  ", "Steal deal!  "], "author": "Tiffany D.", "review": "Beach theme taco shop! \n\nTheir Elote Con Queso is a must get from their menu!  It's corn on the cob that is buttered, mayo-ed and sprinkled with cheese and light chili pepper!  It tasted so good after a couple of drinks from a bar nearby!  Well, anything tastes great, I would suppose, after drinking!  Get that and some street tacos!  It was Tacko Tuesdays, so street tacos were 2 for $2!  Steal deal!  I liked their carnitas taco more than their carne asada taco!\n\nThey have a grand selection of hot sauces to delightfully choose from!  I love hot sauces and feeling the burn!  Yummy!\n\nSpacious seating and surprisingly self-serving up sparkling water!  Fancy!", "rating": 4, "date": "2014-04-09"}, {"excerpts": ["The elote con queso ($3.50) was tasty! \n\n"], "author": "Kristin F.", "review": "If you like Nick's Crispy Tacos, you will like it here. They serve the tacos \"Nick's way\", which is the only way. They have a lot more options on the menu and a variety of drinks. The chicken tacos and the fish tacos were good. The elote con queso ($3.50) was tasty! \n\nYou can't really go wrong with their guacamole, so be sure to give that a try. The place fills up though, the line quickly formed out the door when we visited on a Friday night.", "rating": 4, "date": "2015-07-11"}], "mexicanstreet style": [], "baja stylefish taco": [], "grilled fish or gulf shrimp taco": [], "beer battered fish": [{"excerpts": ["Beer battered fish taco ", "(I hate fish ", "but I come here twice a week for this) ", "get it nicks way because then there is guac on it and stuff and hell ", "yeah ", "let's party. \n", "3. ", "Salad is great and fresh \n4. ", "Soup is so perfect. ", "Especially when we have poopy weather ya know? ", "But even on a warm day I'm D\n5. ", "I tried a bite of the quesadilla twice ", "and both times good. ", "I've never ordered because I'm just not that type of person but roommate swears by them. ", "WARNING they take longer than other things to make \n6. ", "Tip. ", "Don't get a burrito here ", "it's just not the best thing on the menu. ", "but anything else is incredible. \n", "7. ", "The workers are like Serbian ", "but I love them ", "and they are so nice \n8. ", "Bubbly water on tap. \n", "9. ", "The owner is chill \n10. ", "Friendly. ", "Great. ", "If you read this whole post add me on insta @rachman93 and dm me ", "and then I'll give you a prize."], "author": "Rachel M.", "review": "HOLY SHIT I'm mad at the community. Why does this place have only 4 stars??? Okay. I'll tell you what to order. \n1. Guac and salsa (great pick) ask for both on the side they give you more. Then ask for a side of carne asada and damn you'll thank me later. \n2. Beer battered fish taco (I hate fish but I come here twice a week for this) get it nicks way because then there is guac on it and stuff and hell yeah let's party. \n3. Salad is great and fresh \n4. Soup is so perfect. Especially when we have poopy weather ya know? But even on a warm day I'm D\n5. I tried a bite of the quesadilla twice and both times good. I've never ordered because I'm just not that type of person but roommate swears by them. WARNING they take longer than other things to make \n6. Tip. Don't get a burrito here it's just not the best thing on the menu. but anything else is incredible. \n7. The workers are like Serbian but I love them and they are so nice \n8. Bubbly water on tap. \n9. The owner is chill \n10. Friendly. Great. If you read this whole post add me on insta @rachman93 and dm me and then I'll give you a prize.", "rating": 5, "date": "2018-03-02"}, {"excerpts": ["2) the Baja fish taco - beer battered fish on two soft corn tacos with slaw.\n\n"], "author": "Shirley N.", "review": "Wow, great tacos and guacamole with chips and salsa.  \n\nHad two tacos -\n1) carne asada which comes Nick's way - two taco shells, a crispy fried taco enclosed by a soft taco shell.  Piled with jack cheese, pinto beans, salsa, and guacamole.  \n2) the Baja fish taco - beer battered fish on two soft corn tacos with slaw.\n\nGiven a choice, I'd go with having every taco Nick's Way.  $1.50 extra if not served that way.\n\nPlenty of seating.  Select seating from several counters on high bar type stools or grab a table which is picnic table style.\n\nCompostable flatware and food served in plastic baskets.", "rating": 5, "date": "2012-01-05"}, {"excerpts": ["I ordered the carnitas taco and the beer battered fish taco. ", "The fish taco had no flavor and a nasty mayonnaise filled slaw on it. ", "The carnitas one was fine, but filled with mostly beans. ", "My fiancé ordered the shrimp burrito - and described it as \"meh\" - it didn't have enough flavor. ", "We also ordered an order of guac, which was fine, but again, pretty flavorless. ", "We drank water and it cost us $40. ", "If we're paying that much for tacos, they should be good at least. ", "I prefer Tacolicious."], "author": "Jillian P.", "review": "Expensive for being not that good. I ordered the carnitas taco and the beer battered fish taco. The fish taco had no flavor and a nasty mayonnaise filled slaw on it. The carnitas one was fine, but filled with mostly beans. My fiancé ordered the shrimp burrito - and described it as \"meh\" - it didn't have enough flavor. We also ordered an order of guac, which was fine, but again, pretty flavorless. We drank water and it cost us $40. If we're paying that much for tacos, they should be good at least. I prefer Tacolicious.", "rating": 2, "date": "2013-08-19"}, {"excerpts": ["I had great beer battered fish taco, mahi-mahi taco, and horchata.   ", "Maybe, I should have given this place a bad review ", "so I don't have to share this place with the rest of the yelp world."], "author": "Asit P.", "review": "I wasn't sure what to make of a Northeastern theme taco place.   It is San Francisco, and we have the Mission.    However, if you live in the Marina or Cow Hollow, this is the best place to get tacos.   I have often visited Tacolicious, but this place best it easily.   First, the tacos are better.   Second, you don't have to wait 30 to 40 minutes before you are seated.   I had great beer battered fish taco, mahi-mahi taco, and horchata.   Maybe, I should have given this place a bad review so I don't have to share this place with the rest of the yelp world.", "rating": 5, "date": "2011-09-17"}], "fish or gulf shrimp": [], "bean and cheese": [], "poco queso": [{"excerpts": ["I ordered \"Poco Queso\" because I had to eat something small and fast.  ", "Ew!  ", "Horrible. ", "Menu reads: Just melted jack cheese folded in a crispy flour tortilla\"  ", "How can you mess that up? ", "This product is fried. ", "Why doesn't it say that? ", "It looked deep fried and when I bit into it buckets of oil squirted out onto my blouse.  ", "I tried one more bite because I was hungry and it was just so riddled with oil, I had to toss the whole thing.  ", "What a disappointment."], "author": "Colleen S.", "review": "The place is cute and clean. The help is only so so friendly.  I ordered \"Poco Queso\" because I had to eat something small and fast.  Ew!  Horrible. Menu reads: Just melted jack cheese folded in a crispy flour tortilla\"  How can you mess that up? This product is fried. Why doesn't it say that? It looked deep fried and when I bit into it buckets of oil squirted out onto my blouse.  I tried one more bite because I was hungry and it was just so riddled with oil, I had to toss the whole thing.  What a disappointment.", "rating": 1, "date": "2014-06-26"}, {"excerpts": ["I've had the carne asada one and the plain poco queso. ", "Both times I had it done suiza style (on the side since i ", "only like dipping it in the guac). "], "author": "Mona A.", "review": "If i had written this review the week that Tacko opened, it would most likely be one start lower since they were still working their kinks out. I decided to wait and give it another try since a lot of restaurants deal with these types of problems.\n\nInitially, I was pretty upset with the closing of Kasa since i live half a block away from the spot. When Tacko opened, we were pretty stoked. Everyone raves about the tacos, and don't get me wrong they are amazing, but i LOVE the quesadillas. I've had the carne asada one and the plain poco queso. Both times I had it done suiza style (on the side since i only like dipping it in the guac). They are a must try.\n\nLast week we went in on a Friday night. Unfortunately the line was still moving slower than i would prefer, but much faster than when they first opened. I think they need one extra person back there to bag the chips ect. While we were in line, Nick the owner started chatting with us(4 girls) and gave us a margarita pail, as well as a modelo for the one guy with us. He also then came and checked on our table while we were eating. The amazing food and service made up for a extra minutes we waited in line to order.\n\nIf you are in the area, be sure to pop in. Tacko will definitely become a staple for my friends and I here in the neighborhood.", "rating": 5, "date": "2011-06-29"}], "monterey jack cheese": [{"excerpts": ["- \n\nWe all got Nick's Way:\n\nOne taco w/ a crispy corn tortilla wrapped in a soft tortilla w/ Monterey jack cheese, pinto beans, pico de gallo & guacamole.\n\n"], "author": "Lilian L.", "review": "Had lunch with Gino with Arthur on a Friday when it was Fleet Week.\n\n- \n\nWe all got Nick's Way:\n\nOne taco w/ a crispy corn tortilla wrapped in a soft tortilla w/ Monterey jack cheese, pinto beans, pico de gallo & guacamole.\n\nI got the one carne asada & one carnitas.\n\n^ I hated the carne asada and I love carne asada, but aside from that the tacos were really good and I highly recommend the carnitas.", "rating": 5, "date": "2018-10-18"}, {"excerpts": ["It had pinto beans, Monterey Jack cheese, pico de gallo, cabbage, red onions, and GUACAMOLE. ", "HOLY GUACAMOLE, WAS THERE GUACAMOLE. ", "I also loved how they grilled the burrito, very nice touch. "], "author": "Kaitlyn F.", "review": "WHOA. WHOA. WHOA. Okay, I may be new to the city and I may not know much about \"authentic\" Mexican food...but I do know what good Mexican food, and this is it my friends! Located in quaint little Cow Hollow lies this little Mexican gem. What do you mean I'm not in the Mission?! The vegetarian burrito from this place is everything I dream about and more. Instead of meat, you get guacamole. GUACAMOLE. No extra charge! I'm crying real tears of happiness! It had pinto beans, Monterey Jack cheese, pico de gallo, cabbage, red onions, and GUACAMOLE. HOLY GUACAMOLE, WAS THERE GUACAMOLE. I also loved how they grilled the burrito, very nice touch. Needless to say, I ate all of it. \n\nFor someone like me who isn't vegetarian but prefers to eat meat-free as much as I can, this place was a dream come true. I could get a full-sized burrito stuffed with yummy ingredients for $7.95. Now that might sound like a lot but this is San Francisco...so you just gotta deal with it I guess. \n\nIf you're ever in Cow Hollow and craving some bomb Mexican food, I would definitely recommend Tacko. Especially if you are looking for a vegetarian alternative. I don't know how their meat holds up, but if it's anything like the vegetarian option...you have nothing to worry about!", "rating": 5, "date": "2016-09-30"}], "pinto beans": [{"excerpts": ["- \n\nWe all got Nick's Way:\n\nOne taco w/ a crispy corn tortilla wrapped in a soft tortilla w/ Monterey jack cheese, pinto beans, pico de gallo & guacamole.\n\n"], "author": "Lilian L.", "review": "Had lunch with Gino with Arthur on a Friday when it was Fleet Week.\n\n- \n\nWe all got Nick's Way:\n\nOne taco w/ a crispy corn tortilla wrapped in a soft tortilla w/ Monterey jack cheese, pinto beans, pico de gallo & guacamole.\n\nI got the one carne asada & one carnitas.\n\n^ I hated the carne asada and I love carne asada, but aside from that the tacos were really good and I highly recommend the carnitas.", "rating": 5, "date": "2018-10-18"}, {"excerpts": ["The tortillas are higher quality than the standard, but the pinto beans and meats tasted really dry and there wasn't enough guacamole in the burritos to cover this up.  ", "I still ate half of each hence the A-OK rating, but this is not a meal I would stay at work late for."], "author": "Brooke R.", "review": "This place proves that you don't need to be from Mexico, or start your restaurant in California, to have good Mexican food.  I snagged a chicken and a beef burrito as I headed out of work and wasn't expecting much.  I got a little more than I expected, but would have preferred more....anything.  The tortillas are higher quality than the standard, but the pinto beans and meats tasted really dry and there wasn't enough guacamole in the burritos to cover this up.  I still ate half of each hence the A-OK rating, but this is not a meal I would stay at work late for.", "rating": 3, "date": "2018-02-09"}, {"excerpts": ["A Mission style favorite, Carne Asada, rice, pinto beans, pico de gallo, cheese and guacamole. ", "The burrito was HUGE! ", "Like I said, I typically don't care for Mexican food but this was good! ", "Lots of meat ", "so I wasn't feeling like I wasted money. "], "author": "Rockne H.", "review": "Not really a big fan of Mexican food unless it's been a full night of drinking. For some reason, I was drawn to this place because it didn't remind me of the typical hole in wall Mexican establishment. It resembled a San Diego, oceanside town, maybe East coast fishing town kind of joint. The Nantucket art gave that away, but could be the picnic style tables with high bar stools. \n\nWhen you go in, it's pretty simple. Just approach the counter, order your food, get a number and they'll bring your order to your table when it's ready. For my meal, I got the Carne Asade San Francisco burrito for $10.25. A Mission style favorite, Carne Asada, rice, pinto beans, pico de gallo, cheese and guacamole. The burrito was HUGE! Like I said, I typically don't care for Mexican food but this was good! Lots of meat so I wasn't feeling like I wasted money. Very filling and satisfying. \n\nTacko is super fast and convenient. It's next to all the Cow Hollow pubs and taverns so when you're in the area, stop by and get yourself a burrito. You'll be glad you did!", "rating": 4, "date": "2015-11-18"}, {"excerpts": ["I'm only writing this review in the hopes that the manager sees it and changes this infuriating policy: They have items with both pinto and black beans on the menu, but they won't substitute black beans for pinto beans. ", "Picture the scene: you order a taco and ask for black beans, but you're told that tacos come with pinto beans and that black beans are only for salads. ", "What?! ", "Who are you, the God of Beans? ", "Dining in San Francisco will certainly expose you to a wealth of asinine policies but this definitely tops the list. ", "PS they will offer to give you your taco with no beans and then sell you an extra side of black beans to put on yourself. ", "Awesome customer service, guys."], "author": "Cole I.", "review": "I'll start by saying the food here is good. The service could be faster and the prices could be better but that's just life in SF. I'm only writing this review in the hopes that the manager sees it and changes this infuriating policy: They have items with both pinto and black beans on the menu, but they won't substitute black beans for pinto beans. Picture the scene: you order a taco and ask for black beans, but you're told that tacos come with pinto beans and that black beans are only for salads. What?! Who are you, the God of Beans? Dining in San Francisco will certainly expose you to a wealth of asinine policies but this definitely tops the list. PS they will offer to give you your taco with no beans and then sell you an extra side of black beans to put on yourself. Awesome customer service, guys.", "rating": 2, "date": "2017-09-21"}, {"excerpts": ["It had pinto beans, Monterey Jack cheese, pico de gallo, cabbage, red onions, and GUACAMOLE. ", "HOLY GUACAMOLE, WAS THERE GUACAMOLE. ", "I also loved how they grilled the burrito, very nice touch. "], "author": "Kaitlyn F.", "review": "WHOA. WHOA. WHOA. Okay, I may be new to the city and I may not know much about \"authentic\" Mexican food...but I do know what good Mexican food, and this is it my friends! Located in quaint little Cow Hollow lies this little Mexican gem. What do you mean I'm not in the Mission?! The vegetarian burrito from this place is everything I dream about and more. Instead of meat, you get guacamole. GUACAMOLE. No extra charge! I'm crying real tears of happiness! It had pinto beans, Monterey Jack cheese, pico de gallo, cabbage, red onions, and GUACAMOLE. HOLY GUACAMOLE, WAS THERE GUACAMOLE. I also loved how they grilled the burrito, very nice touch. Needless to say, I ate all of it. \n\nFor someone like me who isn't vegetarian but prefers to eat meat-free as much as I can, this place was a dream come true. I could get a full-sized burrito stuffed with yummy ingredients for $7.95. Now that might sound like a lot but this is San Francisco...so you just gotta deal with it I guess. \n\nIf you're ever in Cow Hollow and craving some bomb Mexican food, I would definitely recommend Tacko. Especially if you are looking for a vegetarian alternative. I don't know how their meat holds up, but if it's anything like the vegetarian option...you have nothing to worry about!", "rating": 5, "date": "2016-09-30"}, {"excerpts": ["So if you want a pansy burrito with pinto beans (wtf) and you are used to papalote grade burritos then this is your place. \n", "Side note this place is a NAUTICAL THEMED Mexican food restaurant...", "First time that has happened. ", "Should have known."], "author": "Britt T.", "review": "Hmm coming from San Diego, I was excited to hear this place had a San Diego burrito. when I read there wasn't rice or beans in it , I was very confused. I ended up getting the carne asada SF burrito for like 10.75 - what a rip off. Anyways the burrito wasn't bad but it wasn't real mexican food. It's SF mexican food. So if you want a pansy burrito with pinto beans (wtf) and you are used to papalote grade burritos then this is your place. \nSide note this place is a NAUTICAL THEMED Mexican food restaurant...First time that has happened. Should have known.", "rating": 3, "date": "2014-09-25"}, {"excerpts": ["I couldn't even taste the difference w pinto beans. ", "Now when I go to Fillmore, I know where to go. ", "Thank you Tacko for one of the best burritos!"], "author": "Adrianna T.", "review": "I wish I would've taken a picture of the San Francisco burrito when there was something left... But after drinking all day at pride, this burrito hit the spot! The carne asada, pico de gallo, and guac was PERFECT!!! Even though I usually get refried beans in my burrito, (they didn't have them) I couldn't even taste the difference w pinto beans. Now when I go to Fillmore, I know where to go. Thank you Tacko for one of the best burritos!", "rating": 5, "date": "2015-06-29"}, {"excerpts": ["Piled with jack cheese, pinto beans, salsa, and guacamole.  \n"], "author": "Shirley N.", "review": "Wow, great tacos and guacamole with chips and salsa.  \n\nHad two tacos -\n1) carne asada which comes Nick's way - two taco shells, a crispy fried taco enclosed by a soft taco shell.  Piled with jack cheese, pinto beans, salsa, and guacamole.  \n2) the Baja fish taco - beer battered fish on two soft corn tacos with slaw.\n\nGiven a choice, I'd go with having every taco Nick's Way.  $1.50 extra if not served that way.\n\nPlenty of seating.  Select seating from several counters on high bar type stools or grab a table which is picnic table style.\n\nCompostable flatware and food served in plastic baskets.", "rating": 5, "date": "2012-01-05"}, {"excerpts": ["They were very generous with the guacamole and the cheese and pinto beans add a really nice flavor. ", "The cripy shell with the soft corn tortillas on the outside are a great combo and are definitely the way to go. "], "author": "Rachel P.", "review": "I just ate at Tacko for the first time and I was very impressed! I was looking all over Union street for a good tacqueria and finally gave up when I found this place. I was pleasantly surprised when I walked in and saw the food proportions on other customers' plates. I ordered two crispy chicken tacos \"Nick's way\" and let me tell you they were sooooo tasty! They were very generous with the guacamole and the cheese and pinto beans add a really nice flavor. The cripy shell with the soft corn tortillas on the outside are a great combo and are definitely the way to go. I will definitely be back to try more items on the menu!\n\nService was good and the guy at the cashier helped me in ordering just two tacos instead of three (he told me that would've been too much, and he was right). Also, the girl who called my order when it was ready was sweet and I felt like she was really genuinely happy to be serving me. Great overall first time experience!", "rating": 4, "date": "2014-03-12"}, {"excerpts": ["We went with the San Francisco burrito filled with Carne Asada, Pinto Beans, Cheese, Rice, Pico de Gallo Salsa, Guacamole, and Sour Cream on the side.\n\n"], "author": "Diana V.", "review": "Mmmm, upscale tacos in The Marina? \n\nYikes? No. Yum : )\n\nAs Amy J. put it so well in her review (http://www.yelp.com/biz/tacko-san-francisco#hrid:jgLpDl2J_FrJUjqb0PJg_A) she and I found ourselves hungry and in Cow Hollow (or was it the Marina? hmmmm).\n\nWe wanted a bite to eat and walked past Tacko. It's bright, clean, and minimalist interior beckoned us in, as did the reasonably priced menu.\n\nI asked the guy in line behind us what he recommended, just 'cause he looked like a regular who was antsn' for some tacos and burritos. He made a few recommendations. \n\nWe went with the San Francisco burrito filled with Carne Asada, Pinto Beans, Cheese, Rice, Pico de Gallo Salsa, Guacamole, and Sour Cream on the side.\n\nI swear, it was one of the best burritos I have had. Even after splitting it in half and sharing, I was still full (what!?)\n\nThe servers were friendly and looked happy to be there, and the food showed up at our table pretty quickly.\n\nThey also had several shelves filled with every type of hot sauce that you could imagine!\n\nAccording to the guy, next time I will try the Mexican Street Style Tacos and the Chips and Salsa.", "rating": 5, "date": "2011-12-14"}, {"excerpts": ["Wrapped up in corn tortillas with cilantro, salsa and the unnecessary additions of pinto beans and shredded chicken. "], "author": "Jason B.", "review": "Completely unsustainable.\n\nThis is important: http://en.wikipedia.org/wiki/Sustainable_fishery\n\nBut Tacko does not seem to care. Otherwise more attention would have been paid to the size of the grilled mahi mahi in my taco. It was huge.\n\nWrapped up in corn tortillas with cilantro, salsa and the unnecessary additions of pinto beans and shredded chicken. It was delicious.\n\nHopefully they leave some for the rest of the world.", "rating": 4, "date": "2013-11-20"}, {"excerpts": ["My boyfriend and I like The San Francisco burrito -- pinto beans, cheese, rice, sour cream, pico de gallo salsa, guacamole, with your choice of meat. ", "We like it with carne asada. ", "Yum!"], "author": "Sarah Z.", "review": "Alright, so it's not authentic Mexican cuisine and you can find far better for cheaper in the Mission. But when you live in the area and you're in the mood for a decent burrito then this is your best bet. My boyfriend and I like The San Francisco burrito -- pinto beans, cheese, rice, sour cream, pico de gallo salsa, guacamole, with your choice of meat. We like it with carne asada. Yum!", "rating": 4, "date": "2013-03-24"}], "mexican rice": [], "carnitas or chicken": [], "carne asada fish or gulf shrimp": [], "assorted draft": [], "assorted bottles": [], "affligem blonde golden state cider juicy jamaica": [], "shark attack  oz": [], "tecate can": [], "margarita": [{"excerpts": ["They have very distinct flavors of agua fresca but you also can't go wrong with the house margarita or sangria if you want something with higher than zero ABV!"], "author": "Nidhi M.", "review": "One of my favorite places for a zero hustle cal-mex fix in Cow Hollow neighborhood. I am a vegetarian and they have great selection to choose from. Something that is not very obvious on the menu is a burrito bowl, and to top it all you can add fries for a more hearty meal!\n\nIf you like things on the spicy and tangy side of the spectrum, there is a wide selection of hot sauces to choose from (not your neighborhood grocery store kind).\n\nThey have very distinct flavors of agua fresca but you also can't go wrong with the house margarita or sangria if you want something with higher than zero ABV!", "rating": 4, "date": "2018-07-07"}, {"excerpts": ["Margarita y sangria were ok. ", "Probably should have stuck with beer. ", "Liked the water dispenser and many hot sauce choices. ", "Def"], "author": "tina l.", "review": "Our first visit. Food and service was wonderful. Really enjoyed the chips, salsa, y guacamole. The street tacos were delicious. The vibe was fun but loud. Burritos were a huge hit. Margarita y sangria were ok. Probably should have stuck with beer. Liked the water dispenser and many hot sauce choices. Def", "rating": 4, "date": "2018-10-02"}, {"excerpts": ["Got the San Francisco carne asada burrito, queso corn, chips/salsa/guac and a margarita. ", "It's busy on a Wednesday - looks like locals eat here which is a good sign. ", "Everything was tasty and the staff is friendly. ", "Food came out quick too. "], "author": "JoAnn H.", "review": "Day 4 in San Francisco. Been to many restaurants and I love this place. The only one I'm leaving a glowing review for. Got the San Francisco carne asada burrito, queso corn, chips/salsa/guac and a margarita. It's busy on a Wednesday - looks like locals eat here which is a good sign. Everything was tasty and the staff is friendly. Food came out quick too. I'll def come back. \n\nUpdate: Been here a while now since I first started this review and there's a constant line of people to dine in, they keep walking in. And also noticeable pickup is happening. Turnover is good. It's busy with loud conversation right now - but not too loud though. Enough to feel like a night out even though it's Wednesday.", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["Worse than cheap margarita mix - very syrupy, no tequila. ", "For the first time ever, my boyfriend and I didn't even finish our first glass (and we ordered a pitcher). ", "We also weren't offered salt on the glass rim.... who drinks a margarita without salt? ", "At the very least, the salt would have covered up the shitty tasting margarita.\n\n"], "author": "Amanda R.", "review": "Came here recently and ordered crispy fish tacos (Nick's way) and margaritas. The tacos were okay, but I definitely prefer Nick's Crispy Tacos over Tacko. The tortillas seemed a bit stale, and the fish wasn't very warm. Maybe I ordered the wrong thing?\n\nThe margaritas on the other hand were terrible. Worse than cheap margarita mix - very syrupy, no tequila. For the first time ever, my boyfriend and I didn't even finish our first glass (and we ordered a pitcher). We also weren't offered salt on the glass rim.... who drinks a margarita without salt? At the very least, the salt would have covered up the shitty tasting margarita.\n\nAlso, the atmosphere was disappointing. Hole in the wall feel, with marina bro's yelling everywhere. Not my style, may be for other people.\n\nI probably won't be back unless Nick's Crispy Tacos is closed again and I'm absolutely craving fish tacos.", "rating": 2, "date": "2017-01-01"}, {"excerpts": ["I had also ordered a strawberry margarita but given a regular margarita, they were so busy I didn't bother to ask them to change it. ", "May come back next time if I'm in the area."], "author": "Alexander K.", "review": "If you're looking for some top notch quality meat, this is the place to visit. I came here last night with my wife although it was really busy (to be expected on a Friday night) we still got our food in a timely matter. Given the meat was a little dry probably from standing aside on the grill the quality was still great. I had also ordered a strawberry margarita but given a regular margarita, they were so busy I didn't bother to ask them to change it. May come back next time if I'm in the area.", "rating": 4, "date": "2018-03-10"}, {"excerpts": ["I also had a tasty margarita. ", "Watch out for the bar crawl times if you don't like crowds. ", "We are definitely going back."], "author": "Kevin H.", "review": "I've been meaning to eat at Tacko for over two years, but just walk on by to or from the Marina. Finally, we stopped in today--even though the Bay to Breakers crowd was there.\n\nService was a tad slow, but I'll give them a pass because of the crowd. The staff was very friendly and helpful as well.\n\nI had the three taco platter with three different meats. All of them were delicious. Both the red and green sauces in the squirt bottles in the table were great too. A nice heat to both with solid flavor in each.\n\nMy wife had the burrito with carnitas: excellent and filling. The tacos were also filling because they were generous with the protein.\n\nMy son had the carnitas quesadilla, which was more than he could finish (he's 27, so don't think I'm talking about kid portions). He loved his food as well.\n\nI also had a tasty margarita. Watch out for the bar crawl times if you don't like crowds. We are definitely going back.", "rating": 5, "date": "2017-05-21"}, {"excerpts": ["I ordered a margarita and felt like I was drinking lemonade. ", "Good place to go to if you want Americanized Mexican food."], "author": "Rosita S.", "review": "Was hoping for some good Mexican food, but this place lacked flavor and was over priced. Nothing special about it. I ordered a margarita and felt like I was drinking lemonade. Good place to go to if you want Americanized Mexican food.", "rating": 2, "date": "2017-07-26"}, {"excerpts": ["It's nicks taco but in a better environment and more margarita selections. ", "I have been here a few times and it doesn't disappoint. ", "I've been here to drink with coworkers and friends a ", "I've seen families here with kids. ", "The neighborhood is awesome but parking might be difficult. ", "Overall a great place for \"gringo\" Mexican food done right. ", "Peacado nicks way is the best fish taco I've ever had. ", "Grilled is good and the carne asada taco is awesome too. ", "A fav is also the elote!"], "author": "Bryant L.", "review": "It's nicks taco but in a better environment and more margarita selections. I have been here a few times and it doesn't disappoint. I've been here to drink with coworkers and friends a I've seen families here with kids. The neighborhood is awesome but parking might be difficult. Overall a great place for \"gringo\" Mexican food done right. Peacado nicks way is the best fish taco I've ever had. Grilled is good and the carne asada taco is awesome too. A fav is also the elote!", "rating": 5, "date": "2017-04-09"}, {"excerpts": ["Drinking Mexican margarita"], "author": "Vivi T.", "review": "My favorite Mexico food. Love to come and have a burrito chips and salsa. Drinking Mexican margarita", "rating": 5, "date": "2017-05-16"}, {"excerpts": ["I do wish they would serve tequila, but their margarita-ish hits the spot every time. ", "It's made from agave wine. \n", "4- Like shopping for that luxury purse, don't even ask how much their lobster roll will cost (market price).  ", "Just take out your credit card, pay the good man the toll and say Geronimo! ", "This ride will take your first bite from Nantucket to SFO within 15 mins. ", "Like that girl group  Fifth Harmony sang....", "\"baby ", "I'm worth it!", "\" ", "Every bite to the penny. ", "That buttery lobster goodness will make you wet (in the mouth..)\n", "5- Guac over everything. \n", "6-Elote ", "con queso", ": I've never been so full off $3! ", "it's the best and cheapest lunch in the marina!! \n", "7- want a taco? ", "When it's not Tuesday, ALWAYS make it Nick's way. \n", "8- ", "ARE YOU HUNGOVER? ", "get a San Diego burrito with the fries inside and Watermelon juice.  ", "That food baby will keep you afloat working for the rest of you shift without taking your nunchucks and whacking a customer (writing from experience).\n", "9- Call in your order and its ready for pick up within 10/15 mins. ", "(Usually)\n", "10- ", "Lastly, The people working here from the owner to the cooks are all damn awesome humans-  Period! ", "Never be that typical douchey drunk Marina folk and give them a hard time. ", "Chill bro, just stuff your face with more GUAC!"], "author": "Melanie D.", "review": "It amazes me how many times I've been here, and  never written an actual review. At one point, I became a duchess, but was finally dethroned by some guy who has checked in for a whopping 38 times!  But I digress...\n\nThis review will be my collective top 10 tips on Tacko:\n\n1- cantaloupe juice (when in season) is a MUST!\n1.5- pick the red salsa. always the red salsa.\n2- quesadilla suiza plus extra shrimp (you pay more but damn it's so worth it!!!) \n3- just add tequila...I do wish they would serve tequila, but their margarita-ish hits the spot every time. It's made from agave wine. \n4- Like shopping for that luxury purse, don't even ask how much their lobster roll will cost (market price).  Just take out your credit card, pay the good man the toll and say Geronimo! This ride will take your first bite from Nantucket to SFO within 15 mins. Like that girl group  Fifth Harmony sang....\"baby I'm worth it!\" Every bite to the penny. That buttery lobster goodness will make you wet (in the mouth..)\n5- Guac over everything. \n6-Elote con queso: I've never been so full off $3! it's the best and cheapest lunch in the marina!! \n7- want a taco? When it's not Tuesday, ALWAYS make it Nick's way. \n8- ARE YOU HUNGOVER? get a San Diego burrito with the fries inside and Watermelon juice.  That food baby will keep you afloat working for the rest of you shift without taking your nunchucks and whacking a customer (writing from experience).\n9- Call in your order and its ready for pick up within 10/15 mins. (Usually)\n10- Lastly, The people working here from the owner to the cooks are all damn awesome humans-  Period! Never be that typical douchey drunk Marina folk and give them a hard time. Chill bro, just stuff your face with more GUAC!", "rating": 5, "date": "2015-05-05"}, {"excerpts": ["Or margarita.  "], "author": "Jennifer L.", "review": "Couldn't really tell if the burritos were good or bad.  I want to say that they're like a mixture of something you'd find at a hole-in-the-wall place in the Mission and Chipotle, but my taste buds were going nuts......... mostly because I wanted to try as many of the hot sauces on the hot sauce wall as possible.  \n\nAnd even though I ended up with heart burn, it's a must-do.  Where else can you try a million and a half types of hot sauce / salsa!?\n\nYou'll want to alleviate the fire in your mouth with some of their horchata, too.  Or margarita.  Just don't go with the white sangria because it tasted like nothing.......\n\nIn any case, I highly recommend coming here after / during / before day drinking in the area.", "rating": 4, "date": "2013-05-09"}, {"excerpts": ["My margarita was also great! ", "I'll definitely be back."], "author": "Nikki G.", "review": "WOW. Just ate two of the best tacos I've ever had. Got a chicken taco and a steak taco, both \"Nick's style\". Topped with salsa, guacamole (fresh, good), beans. The chicken and steak were both delicious - juicy and flavorful. Also, at $5 a piece, pretty generously sized. My margarita was also great! I'll definitely be back.", "rating": 5, "date": "2014-03-05"}, {"excerpts": ["Service takes forever, place is filled with marina bros, and the margaritas taste like straight Mr T's margarita mix. ", "Fish tacos nick's way weren't any better than Nick's crispy. ", "Very disappointed."], "author": "Alexei I.", "review": "Service takes forever, place is filled with marina bros, and the margaritas taste like straight Mr T's margarita mix. Fish tacos nick's way weren't any better than Nick's crispy. Very disappointed.", "rating": 2, "date": "2016-11-30"}, {"excerpts": ["I also order a margarita, no to sweet not too boozy, just perfect. ", "But I was most impressed with their hospitality and will to to above and beyond."], "author": "Yadira G.", "review": "I was wondering in the Fillmore when I walked in to Tacko, they gave me the most warm and genuine welcome. I ordered three tacos, the duck, carne asada and shrimp. And all three were amazing, fresh ingredients and the right amount of seasoning. I also order a margarita, no to sweet not too boozy, just perfect. But I was most impressed with their hospitality and will to to above and beyond.", "rating": 5, "date": "2016-02-15"}, {"excerpts": ["Finally, we had a 'Margaritaish,' which, as far as we could tell, is a really freaking strong Margarita with crushed ice. ", "It was delicious, and for $6, you totally get your money's worth. "], "author": "Matthew L.", "review": "This place rocks. First, a heads-up about what you're getting into: This is a counter-focused, sit-down-with-a-number-and-we'll-bring-it-to-you kinda place, so don't expect tableside service and baskets of free chips n' salsa and you'll do fine.\n\nThis brings me to my next point: Order. The. Tortilla chips. These things are thick, crunchy, and delicious, able to withstand the soggifying effects of salsa and guacamole alike with impunity. They are the Omega Chip, the tortilla fragments to which all other chips aspire. Seriously, they're good. Get them with guac or salsa or whatever, but GET THEM.\n\nDinner here was great, too. I had an enormous San Francisco burrito stuffed full of beans, rice, guac, and more, then delightfully crisped on the grill. My wife had a quesadilla jam-packed with carnitas and other fillings, to the point where it was more like a semi-flat chimichanga.\n\nFinally, we had a 'Margaritaish,' which, as far as we could tell, is a really freaking strong Margarita with crushed ice. It was delicious, and for $6, you totally get your money's worth. Besides the great food, Tacko is fast, clean, and staffed by friendly people. \n\nWhat's not to like?", "rating": 5, "date": "2012-01-27"}, {"excerpts": ["I would have liked to see some margarita or pitcher specials....", "The vibe also wasn't as great. "], "author": "Holly G.", "review": "Yum!\n\nI was really happy to hear that Tacko had the same owners at Nick's Crispy tacos because I'm a huge fan. I went to try it out on Tuesday (clearly, Taco Tuesday) and the food was amazing, just like at Nick's. I ordered WAY too much-- \n\nCarne Asada Taco, Nick's way\nBaja Fish Taco, Nick's way\nCorn\n\nEverything was so delicious, and the tacos were so big I wasn't able to finish them. I'm so happy to know this place is so close to my apartment (or am i?)\n\nThe only downside is that the Taco Tuesday wasn't nearly as cool as at Nick's. The street tacos were $2 and Tecate's were $2, but that's about it. I would have liked to see some margarita or pitcher specials....The vibe also wasn't as great. There weren't as many people there and they didn't have the party music on!\n\nBUT one thing that really blew my mind was the selection of hot sauce--they had everything you could ever want to smother your taco in! I will absolutely be back to eat tacos here again!", "rating": 4, "date": "2012-02-10"}, {"excerpts": ["I also love that they offer Sangria, Margarita's and 6 different Fresca's, they take credit cards ", "(Nick's doesn't), and the decor is light and modern. \n", "The only thing that throws me off a little is the whole Nantucket theme of said decor. ", "The only thing remotely 'Nantucket-y' on the menu is the lobster roll. ", "It's strange to base the entire theme of a restaurant that serves Mexican food on one menu item. ", "But they get 5 stars anyway because of the taste of the food, great value, and chic decor (regardless of how misplaced it seems)."], "author": "Maria A.", "review": "Been a fan of Nick's Crispy Taco's for a long time. So I was thrilled when I heard an 'upgraded' version was moving into Kasa's old spot. \n\nThe Carne Asada Quesadillas, Grilled Corn and Black Bean Taco Salad, and Strawberry Fresca were all delish. \n\nI ordered shrimps w/ my Taco Salad and got 8 pieces!!! The salad itself was $6.25. With the shrimps it was $9. Such an amazing value for the flavorful food I got. Anywhere else this salad would be at least $15.\n\nI also love that they offer Sangria, Margarita's and 6 different Fresca's, they take credit cards (Nick's doesn't), and the decor is light and modern. \nThe only thing that throws me off a little is the whole Nantucket theme of said decor. The only thing remotely 'Nantucket-y' on the menu is the lobster roll. It's strange to base the entire theme of a restaurant that serves Mexican food on one menu item. But they get 5 stars anyway because of the taste of the food, great value, and chic decor (regardless of how misplaced it seems).", "rating": 5, "date": "2011-05-31"}, {"excerpts": ["The food is always very fresh, the drinks, although simple are great (sangria, beer, margarita, sodas, etc). ", "I go back and forth between Tacos Nicks Way and the Tacko Salad with beef. ", "The lines usually go really fast and you can typically easily find an easy place to sit. ", "Love eating here ", "and it's a go to for us."], "author": "Brent T.", "review": "Love this place in the Marina. My friend and I come here ALL the time and its very consistent. The food is always very fresh, the drinks, although simple are great (sangria, beer, margarita, sodas, etc). I go back and forth between Tacos Nicks Way and the Tacko Salad with beef. The lines usually go really fast and you can typically easily find an easy place to sit. Love eating here and it's a go to for us.", "rating": 5, "date": "2012-11-27"}, {"excerpts": ["Not to mention the sandpail filled with margarita. ", "Yummmm."], "author": "Claire R.", "review": "The only reason this places gets 4 stars is because it gets really expensive really fast. However, the food is fantastic! I could eat 4,000 baja tacos in one sitting. We ordered a the baja taco and a carne asada and chicken taco. All excellent. Not to mention the sandpail filled with margarita. Yummmm.", "rating": 4, "date": "2013-07-03"}, {"excerpts": ["They have a bucket of Margarita!!! ", "AMAZEFORDAYZ!!", "! ", "and thats all she wrote.."], "author": "Sean MC E.", "review": "MMMM grilled fish tacos!! that was good! perfect constancy. Got it Nock's way, and I didn't need to add much to the taco just a hint of lime and it was perfect, well done. Now that i got that out of the way. They have a bucket of Margarita!!! AMAZEFORDAYZ!!! and thats all she wrote..", "rating": 4, "date": "2012-06-25"}, {"excerpts": ["While we were in line, Nick the owner started chatting with us(4 girls) and gave us a margarita pail, as well as a modelo for the one guy with us. ", "He also then came and checked on our table while we were eating. "], "author": "Mona A.", "review": "If i had written this review the week that Tacko opened, it would most likely be one start lower since they were still working their kinks out. I decided to wait and give it another try since a lot of restaurants deal with these types of problems.\n\nInitially, I was pretty upset with the closing of Kasa since i live half a block away from the spot. When Tacko opened, we were pretty stoked. Everyone raves about the tacos, and don't get me wrong they are amazing, but i LOVE the quesadillas. I've had the carne asada one and the plain poco queso. Both times I had it done suiza style (on the side since i only like dipping it in the guac). They are a must try.\n\nLast week we went in on a Friday night. Unfortunately the line was still moving slower than i would prefer, but much faster than when they first opened. I think they need one extra person back there to bag the chips ect. While we were in line, Nick the owner started chatting with us(4 girls) and gave us a margarita pail, as well as a modelo for the one guy with us. He also then came and checked on our table while we were eating. The amazing food and service made up for a extra minutes we waited in line to order.\n\nIf you are in the area, be sure to pop in. Tacko will definitely become a staple for my friends and I here in the neighborhood.", "rating": 5, "date": "2011-06-29"}], "red wine sangria": [], "wine red rosé white": [], "homemade agua fresca": [{"excerpts": ["I also got the mango Homemade Agua Fresca and it was so refreshing and delicious! \n", "A great place to go for some great tacos!"], "author": "Alyx V.", "review": "It was my first meal in the Bay Area and my friends asked me what I was in the mood for. \"San Francisco food\" I told them. They brought me here and I'm glad they did! This place is pretty chill - no frills, just great food! I got the Mexican \"Street Style\" tacos and loved all three. I really appreciated how simple they were - carne asada, carnitas, and chicken topped with cilantro and onions. Just a few great ingredients and they were good to go. The meat on all three of the tacos was super tender and the toppings were fresh. I tried their green salsa on the carnitas and it paired really well. I also got the mango Homemade Agua Fresca and it was so refreshing and delicious! \nA great place to go for some great tacos!", "rating": 4, "date": "2017-11-03"}], "assorted sodas": []}