{"totopos y salsa": [], "jicama ensalada": [], "nachos con queso": [{"excerpts": ["My boyfriend and I split the nachos con queso with carnitas and a very tasty fish taco. ", "Don't know which one he ordered, but nevertheless both dishes were mouthwatering and yummy to le tummy. ", "Even our visitors were gushing about TacoBar's burritos all weekend. ", "I particularly relished in their watermelon juice. ", "I see that there are more in SF, must eat, enjoy and repeat."], "author": "Jamie L.", "review": "I have not had the chance to check out the lovely array of restaurants and bars on the Fillmore St. Luckily, my boyfriend and I were entertaining his cousin and wife who were staying in the Japantown. Even after the rain, the four of us walked further and further seeing, stopping, and contemplating what to fill our stomachs with. So when we see a sign that has the words \"taco\" and \"bar\" in its name. We. Were. Sold. \n\nMy boyfriend and I split the nachos con queso with carnitas and a very tasty fish taco. Don't know which one he ordered, but nevertheless both dishes were mouthwatering and yummy to le tummy. Even our visitors were gushing about TacoBar's burritos all weekend. I particularly relished in their watermelon juice. I see that there are more in SF, must eat, enjoy and repeat.", "rating": 4, "date": "2012-04-03"}], "avocado ensalada cesar": [{"excerpts": ["I went with the Avocado Ensalada Cesar (Romaine, w/Avocado dressing, Cotija Cheese, Cilantro & Totopos Croutons). ", "You can add chicken, steak or shrimp for a fee. ", "I was pretty happy with the flavors and the price (less than $10) ", "was perfect for the portion size. \n", "*", "The bf went with 3 tacos - 2 steak and 1 brisket (which was on special and came with horseradish cream sauce). ", "He loved the flavors, but felt that they were a tad pricey for what they were. ", "He added guac to the tacos ad they ended up being around $5/each. \n", "*", "Corn tortillas - just eh, which upset me because I was hoping they would have some killer tortillas. ", "Oh well. \n", "*", "Lime Margarita - just ok. "], "author": "Dru M.", "review": "Walking through the neighborhood, searching for the lucky establishment where we would dine for the evening and in the distance...the bf and I see TacoBar. SOLD! \n\nThis is how it goes. Check over the menu...order at the register, then BAM (minutes later you have your food. Crazy fast! There are several tables inside, as well as a table bistro table and a few 2 tops outside. \n\nService was solid. From the moment we walked through the door...everyone was very friendly and again the food came out very fast. \n\nWhat we ordered...\n*Guacamole - smooth and delicious. Chips are thick and very good. They will sprinkle Cotija cheese on them too if you would like. \n*I went with the Avocado Ensalada Cesar (Romaine, w/Avocado dressing, Cotija Cheese, Cilantro & Totopos Croutons). You can add chicken, steak or shrimp for a fee. I was pretty happy with the flavors and the price (less than $10) was perfect for the portion size. \n*The bf went with 3 tacos - 2 steak and 1 brisket (which was on special and came with horseradish cream sauce). He loved the flavors, but felt that they were a tad pricey for what they were. He added guac to the tacos ad they ended up being around $5/each. \n*Corn tortillas - just eh, which upset me because I was hoping they would have some killer tortillas. Oh well. \n*Lime Margarita - just ok. A bit strong on the lime and not so much on the tequila. \n\nOverall...tasty food, great service and a fun atmosphere. I highly suggest you give them a try!", "rating": 3, "date": "2012-01-08"}], "ensalada de camaron": [], "sopa de tortilla": [{"excerpts": ["Sopa de tortilla (yeah, that's tortilla soup) is excellent here. ", "Tacos are much more of a *", "** ", "thing - I prefer El Tonayense - but the soup is *great", "*"], "author": "Bowen D.", "review": "Sopa de tortilla (yeah, that's tortilla soup) is excellent here. Tacos are much more of a *** thing - I prefer El Tonayense - but the soup is *great*", "rating": 4, "date": "2011-08-05"}], "esquites corn in a cup": [], "carne asada pollo carnitas": [], "veracruz pescado": [{"excerpts": ["What converted me into a TacoBar fan last night was their VERACRUZ PESCADO - or steamed fish burrito. "], "author": "Sebastian F.", "review": "Now actually, $8.50 for a burrito are not that bad. What you get in return are high quality ingredients that make your fast (Mexican) food a delightful surprise.\n\nWhat converted me into a TacoBar fan last night was their VERACRUZ PESCADO - or steamed fish burrito. Fantastic tortilla, the ingredients great in taste, and all nicely presented and wrapped up. \n\nChips and guac - also a delight. \n\nLooks like I'm a fan now.", "rating": 4, "date": "2015-11-12"}, {"excerpts": ["Ordered a Veracruz pescado taco. ", "The fishy had a not in a good way fishy taste. ", "A waste of money to me."], "author": "Jennifer M.", "review": "Ordered a Veracruz pescado taco. The fishy had a not in a good way fishy taste. A waste of money to me.", "rating": 3, "date": "2016-12-29"}, {"excerpts": ["Tacobar's Veracruz pescado burrito is the jam -- I've probably eaten them 100 times here!  "], "author": "Emily W.", "review": "Tacobar's Veracruz pescado burrito is the jam -- I've probably eaten them 100 times here!  Add a little pico de gallo and OMG!!  Service is quick and always friendly.  Food is always fresh, colorful, and delicious.  Great, casual little neighborhood restaurant.  Excellent for carry out too!", "rating": 5, "date": "2016-02-01"}, {"excerpts": ["I found the soap de tortillas, carne asado taco, Veracruz pescado taco, and horchata all to be rather bland. ", "Better Mexican food can be found elsewhere."], "author": "Michael B.", "review": "I finally went here after walking past many times and had high hopes of satisfying my Mex food craving. While the service was fine the food unfortunately was not. I found the soap de tortillas, carne asado taco, Veracruz pescado taco, and horchata all to be rather bland. Better Mexican food can be found elsewhere.", "rating": 2, "date": "2015-11-24"}, {"excerpts": ["I ordered the Veracruz Pescado and carnitas tacos with a hibiscus tea agua fresca.  \n\n"], "author": "Melissa L.", "review": "I'm a big fan of Mexican food so I was looking forward to trying TacoBar.  The menu looked really good with a variety of tempting items offered.  I ordered the Veracruz Pescado and carnitas tacos with a hibiscus tea agua fresca.  \n\nThe food was good, but I wish that there was more of it.  Each taco was the size of a street taco.  Perhaps a side of chips with each order would have helped.  I dropped in after a hard workout so maybe my opinion was influenced by the fact that I was super hungry.  \n\nLooking around I liked that the owner was socially responsible and wanted to serve fresh, tasty, well made food at somewhat reasonable prices.  I'm all for that and like to support local businesses, but the only downside is that the portions are really on the small side.  Oddly enough, a side order of chips is pretty generous and is a bargain for the price.\n \nWould I go back?  Yes I'd give TacoBar another try, but I'll probably order a burrito or quesadilla next time.", "rating": 3, "date": "2011-04-16"}, {"excerpts": ["The best entree I've had here was definitely the veracruz pescado burrito: not too crazy heavy and the fish is generally pretty tasty. ", "Everything else I've tried - from the salads (way too heavily dressed) to the quesadillas (pretty bland) to the tortilla soup (tasty, but nothing out of this world) has been fairly average - and not all that cheap for what it is. ", "With La Mediterranee down the street offering cheap, fresh food with a heck of a lot more flavor, I typically pass on the TB"], "author": "Amanda F.", "review": "If this place weren't a mere half block from my apartment, I'd probably never have stopped in.\n\nDon't get me wrong, the chips and salsa are great. In fact, if I'm ever looking for just chips and salsa, Tacobar would be in my top-8 SF choices. Anything else? I'll probably pass.\n\nThe best entree I've had here was definitely the veracruz pescado burrito: not too crazy heavy and the fish is generally pretty tasty. Everything else I've tried - from the salads (way too heavily dressed) to the quesadillas (pretty bland) to the tortilla soup (tasty, but nothing out of this world) has been fairly average - and not all that cheap for what it is. With La Mediterranee down the street offering cheap, fresh food with a heck of a lot more flavor, I typically pass on the TB", "rating": 2, "date": "2010-12-09"}, {"excerpts": ["Go for the Veracruz Pescado Taco.  ", "Great flavor!\n", "I tasted the Carnitas as well ", "but I'm not a big fan of shredded beef.  \n", "Great new addition to the Fillmore District.  ", "Will be back for the Burros and Quesadillas.  ", "Maybe today!  ", ";)"], "author": "John W.", "review": "Go for the Veracruz Pescado Taco.  Great flavor!\nI tasted the Carnitas as well but I'm not a big fan of shredded beef.  \nGreat new addition to the Fillmore District.  Will be back for the Burros and Quesadillas.  Maybe today!  ;)", "rating": 4, "date": "2011-07-03"}, {"excerpts": ["I came back and had the Veracruz Pescado burrito.  ", "The fish was fresh and well spiced. "], "author": "Joahnna M.", "review": "New mex in the hood so I gave it a chance...a friend and I shared tortilla chips & guac, carne asada burrito, chicken taco, veracruz fish taco and a mango juice drink. Total price: 40$ (includes tip).\n\nPretty much all the dishes were bland, especially their guacamole. I had to pour the green hot sauce on everything to give it some kick.\n\nVeracruz fish taco was my fav. I came back and had the Veracruz Pescado burrito.  The fish was fresh and well spiced. The taste reminded me of the authentic Mexican food I've had in Sayulita.\n\n3 starts for the fish dishes at TacoBar!", "rating": 3, "date": "2010-06-24"}, {"excerpts": ["I had the vegetarian taco and my boyfriend had the veracruz pescado burro. "], "author": "G O.", "review": "Everything I felt about this place has already been written, but I want to lower this place's ratings so I can save others from spending an exorbitant amount on a crappy Mexican lunch.\n\nI had the vegetarian taco and my boyfriend had the veracruz pescado burro. Also bought the totopos (chips) and salsa. The big theme here is BLAND but the other is EXPENSIVE. How do they manage to make wonderful Mexican food made with organic ingredients taste so flavorless? Also, no free chips - paid $2.95 for a small bowl of chips and tasteless pico de gallo. In all, paid $22 for a tiny lunch for two people that I would have paid probably less than $10 for at Pancho Villa in the Mission and it would have tasted way better. \n\nOn top of that, when we finally snagged a table outside, it was filled with someone else's dirty dishes with no bussing service in sight. I ended up bussing the table myself to someone inside - two trips - but at least the hostess/waitress thanked me cheerfully both times. \n\nBottom line: at $5 for a bland taco, save your money and pray for the return of La Salsa.", "rating": 1, "date": "2010-04-17"}, {"excerpts": ["I don't think I've ever tasted a more delicious taco than the two I ordered, one was a \"Veracruz Pescado\" with grilled Mahi-Mahi, and the other was \"Baja Pescado\" with Tempura beer battered Mahi-Mahi. ", "Both were awesome, but I must say the \"Baja\" was OUTSTANDING!!!!!! ", "My friend ordered the Carne Asada Quesadilla, and was very pleased. ", "I couldn't believe how much beef was in it, and it was delicious. "], "author": "Vince F.", "review": "I ordered take-out last thursday night from TacoBar. I don't think I've ever tasted a more delicious taco than the two I ordered, one was a \"Veracruz Pescado\" with grilled Mahi-Mahi, and the other was \"Baja Pescado\" with Tempura beer battered Mahi-Mahi. Both were awesome, but I must say the \"Baja\" was OUTSTANDING!!!!!! My friend ordered the Carne Asada Quesadilla, and was very pleased. I couldn't believe how much beef was in it, and it was delicious. The Mexican Rice Pudding was also very tasty, with chopped Mango on top. This was my second time eating the food from TacoBar. Again, I highly reccommend this place for authentic Mexican cuisine, you will not regret it. Also, the service was outstanding, the girl that took the order on the phone, and the waiter who helped bag it, just overall ***** (five stars)!!!!!", "rating": 5, "date": "2012-01-29"}], "baja pescado": [{"excerpts": ["The Baja Pescado burrito and tacos ", "are my go to things to have here, and quite possibly the only thing worth getting here. ", "I think the other tacos on the menu are pretty mediocre. ", "The burrito bowl is awful as well, and I would rather go to Chipotle for one. ", "I do also like the chips, salsa and guac combo here. ", "Their corn on the cob is also decent, except for the fact that it's boiled rather than roasted. "], "author": "Neivin M.", "review": "Tacobar is just another overpriced restaurant in Lower Pac Heights. While it does have some good options like the fresh chips, guacamole and some well cooked deep fried fish tacos and burritos, you would can find exponentially better Mexican cuisine south of Market. \n\nThe Baja Pescado burrito and tacos are my go to things to have here, and quite possibly the only thing worth getting here. I think the other tacos on the menu are pretty mediocre. The burrito bowl is awful as well, and I would rather go to Chipotle for one. I do also like the chips, salsa and guac combo here. Their corn on the cob is also decent, except for the fact that it's boiled rather than roasted. The agua fresca here is pretty hit or miss, and I've had times where it was delicious and other times where it tasted quite foul.\n\nAll in all, I would only go to Tacobar if I was really craving a burrito while I was in the area, because if you want a good fish taco, you should just go to Woodhouse Fish Co. down the street.", "rating": 2, "date": "2018-07-24"}, {"excerpts": ["Their Baja Pescado taco is legit good. ", "Not skimpy at all, always freshly fried, great balance of cabbage slaw, and tasty sauces\n3) ", "Their short rib taco with horseradish (an occasional special menu item) is a revelation \n4) ", "Their salsas are great and they don't adulterate their pricy guacamole with tomatoes \n5) "], "author": "Seema S.", "review": "I used to live 2 blocks from La Taqueria (and am still loyal to their carne asada), so I feel like a bit of a sell-out giving props to Taco Bar. But context is everything... \n\n1) Yes it's expensive for a taqueria (cost of chips and guacamole is absurd) based on the standard set by Mission taquerias\n2) Their Baja Pescado taco is legit good. Not skimpy at all, always freshly fried, great balance of cabbage slaw, and tasty sauces\n3) Their short rib taco with horseradish (an occasional special menu item) is a revelation \n4) Their salsas are great and they don't adulterate their pricy guacamole with tomatoes \n5) They have amazing churros\n\nService is fine, not great. But that's true of most places in SF. :-/", "rating": 4, "date": "2018-04-28"}, {"excerpts": ["The Baja pescado (tempura beer batter) is delicious with the slaw and salsa that it comes with. ", "Also had a pomegranate margarita which was very good. ", "A burrito for 10 and a margarita for 7 is a great deal in this area. ", "Definitely coming back"], "author": "Roman K.", "review": "This place is underrated imo. The Baja pescado (tempura beer batter) is delicious with the slaw and salsa that it comes with. Also had a pomegranate margarita which was very good. A burrito for 10 and a margarita for 7 is a great deal in this area. Definitely coming back", "rating": 5, "date": "2017-10-29"}, {"excerpts": ["I got the Baja Pescado burrito ($9). ", "The beer battered mahi mahi was tasty except there was a TON of cabbage slaw in mine and 1/3 of my bites ", "were slaw only. ", "I'd probably get the taco version next time instead. ", "My boyfriend got the carne asada nachos ($10) which I thought was way better. ", "It was full of cheese, beans, meat, salsa, and guacamole. ", "The serving size for both of our orders was very filling."], "author": "Linda X.", "review": "I've definitely had better Mexican food before but this satisfied my craving. The service is really nice here and the place is clean with plenty of seating.\n\nI got the Baja Pescado burrito ($9). The beer battered mahi mahi was tasty except there was a TON of cabbage slaw in mine and 1/3 of my bites were slaw only. I'd probably get the taco version next time instead. My boyfriend got the carne asada nachos ($10) which I thought was way better. It was full of cheese, beans, meat, salsa, and guacamole. The serving size for both of our orders was very filling.", "rating": 3, "date": "2015-11-29"}, {"excerpts": ["The Baja Pescado with guac was absolutely incredible. ", "I tried the Esquites, which was ok, but def just go with corn on the cob next time. ", "Regardless - very tasty. ", "The red wine sangria isn't too sweet - just perfect. ", "Cute place and nice service."], "author": "Kristina W.", "review": "The Baja Pescado with guac was absolutely incredible. I tried the Esquites, which was ok, but def just go with corn on the cob next time. Regardless - very tasty. The red wine sangria isn't too sweet - just perfect. Cute place and nice service.", "rating": 5, "date": "2015-06-30"}, {"excerpts": ["I've been here couple of times and normally get the baja pescado tacos. ", "Beer battered Mahi Mahi with cabbage slaw, roasted Ancho chile salsa and lime sauce. ", "The fish is always fresh and served piping hot. ", "I don't even need additional green salsa from the squirt bottle because this is just perfect on its own. ", "Their thick chips just have the right amount of salt and I always ask them not to put cheese because I pair mine with their creamy guac. ", "Their carne asada burrito is a good choice as well, with more meat than rice ratio. "], "author": "Janice C.", "review": "Once in a blue moon, I get these intense cravings for fish tacos that are impossible to quell and it's just sad because when that happens, I'm nowhere near the Mission. \n\nLet me just get it out there, Tacobar is your frou-frou taco joint: you can find line-caught Mahi-Mahi here, their beef is from Piedmontese cows raised without any hormones, free-range chicken, etc, so you get my drift. Don't think it's not authentic, because it is and the flavors are well-balanced.\n\nI've been here couple of times and normally get the baja pescado tacos. Beer battered Mahi Mahi with cabbage slaw, roasted Ancho chile salsa and lime sauce. The fish is always fresh and served piping hot. I don't even need additional green salsa from the squirt bottle because this is just perfect on its own. Their thick chips just have the right amount of salt and I always ask them not to put cheese because I pair mine with their creamy guac. Their carne asada burrito is a good choice as well, with more meat than rice ratio. Just be prepared to spend $$ because of the location.\n\nThe line moves quickly and service is decent. My only complaint?! please serve your sangria COLD. I don't want to add ice to it. That just kills my alcohol craving.", "rating": 4, "date": "2011-07-13"}, {"excerpts": ["But mostly, I just stick with the tacos - especially the Baja Pescado tacos ", "(Tempura beer battered mahi mahi, with cabbage slaw, roasted Ancho salsa and lime sauce). ", "They usually come out in under five minutes in a plastic basket paired with two ketchup dispensers full of green and red salsa. ", "I usually wolf my meal down in 5 minutes "], "author": "Kevin B.", "review": "With a name like TacoBar, you better be good. Fortunately, TacoBar lives up to its name. There's nothing fancy about this Pac Heights taco stand. They do basic tacos (carne asadas, carnitas, chicken, fish, etc.). They all come served on a soft tortilla with your standard pinto beans, onions, and salsa. If you're looking for heartier fare, they also offer burritos, quesadillas, and tortas. I've tried their Tortilla soup and their Avocado Ensalada Caesar, and both were quite tasty and filling. But mostly, I just stick with the tacos - especially the Baja Pescado tacos (Tempura beer battered mahi mahi, with cabbage slaw, roasted Ancho salsa and lime sauce). They usually come out in under five minutes in a plastic basket paired with two ketchup dispensers full of green and red salsa. I usually wolf my meal down in 5 minutes and then I'm out the door to embark on my next adventure.\n\nTacoBar's service is always quick and friendly. My only complaint about the place is that they list the menu items on the wall without their prices. Not sure I understand the strategy behind this tactic. Why are you trying to keep your prices secret from the customers? Also, it's unclear to me whether I'm supposed to bus my own table when I'm done. Last time I was there, I handed my dirty plate to the taco technician and he gave me a  \"Dude, why are you giving me your dirty plate? Can't you see I'm busy?\" kind of look. Oh well, these are minor complaints. I'm going to keep coming back here when I need my quick taco fix.\n\nBTW, if you're worried about parking, they have a lot on California St. @ Fillmore (adjacent to Pizzeria Delfina), or you can always park illegally at Mollie Stone's. Though don't blame if you get towed.\n:  )", "rating": 4, "date": "2013-04-24"}, {"excerpts": ["Just order the Baja pescado TACO ESPECIAL style, and you'll know what I mean. "], "author": "Joanna S.", "review": "Whoa, TacoBar exceeded all of our expectations. Just order the Baja pescado TACO ESPECIAL style, and you'll know what I mean. The melted cheese outer shell was such a perfect addition to a well fried fish taco. \n\nYou know what? i think it's better than Nick's! (Bold statement right?)", "rating": 4, "date": "2012-07-05"}, {"excerpts": ["I also decided to try the Baja Pescado Burrito and it didn't live up to the same expectations I had set from eating the quesadilla. ", "The fish just tasted bad :( I really really wanted to love the burrito as much as the quesadilla ", "but I think the fish was bad! ", "Unfortunate."], "author": "Clay P.", "review": "I'm really torn on how to rate TacoBar. Part of me wants to give it a five, and parts of me wants to give a three, so naturally I'll just settle at four stars. I got a chicken quesadilla, and it was incredible. Really good grilled chicken inside, a ton of delicious cheese, and cooked to perfection. I also decided to try the Baja Pescado Burrito and it didn't live up to the same expectations I had set from eating the quesadilla. The fish just tasted bad :( I really really wanted to love the burrito as much as the quesadilla but I think the fish was bad! Unfortunate.", "rating": 4, "date": "2016-06-28"}, {"excerpts": ["Had a delicious pollo burrito with no beans and with the habanero sauce, my husband has the Baja Pescado with cheese and swears by it. ", "The magaritas are also delicious. ", "Definitely coming back. ", "Ate the food too fast to take a picture."], "author": "Liz S.", "review": "Had a delicious pollo burrito with no beans and with the habanero sauce, my husband has the Baja Pescado with cheese and swears by it. The magaritas are also delicious. Definitely coming back. Ate the food too fast to take a picture.", "rating": 5, "date": "2015-08-08"}, {"excerpts": ["The Baja Pescado is a solid choice when your hungry and need to stop of a shopping break along Fillmore. ", "Start it off with chips and guacamole, and share a margarita pitcher!"], "author": "Regina D.", "review": "The Baja Pescado is a solid choice when your hungry and need to stop of a shopping break along Fillmore. Start it off with chips and guacamole, and share a margarita pitcher!", "rating": 3, "date": "2014-09-19"}, {"excerpts": ["I'm addicted to their Baja Pescado tacos (tempura beer battered mahi mahi). ", "I have to have them at least once a week. ", "That with an order of tortillas chips and guacamole, and an Horchata drink...mmm.  \n", "Maybe a little pricey compared to places in the Mission ", "but it's the only place to get tacos in Pac Heights."], "author": "patricia F.", "review": "I'm addicted to their Baja Pescado tacos (tempura beer battered mahi mahi). I have to have them at least once a week. That with an order of tortillas chips and guacamole, and an Horchata drink...mmm.  \nMaybe a little pricey compared to places in the Mission but it's the only place to get tacos in Pac Heights.", "rating": 4, "date": "2013-11-16"}, {"excerpts": ["Only had the Baja Pescado but too much cabbage and not a fan of either of their salsas. ", "Good service though. ", "I'd recommend going somewhere else unless you're dying for Mexican and on filmore"], "author": "Tristan S.", "review": "Seconding Isabella's review. Not that good and a bit pricey for a burrito over $10. Only had the Baja Pescado but too much cabbage and not a fan of either of their salsas. Good service though. I'd recommend going somewhere else unless you're dying for Mexican and on filmore", "rating": 3, "date": "2015-06-07"}, {"excerpts": ["I DO know - the Baja Pescado Tacos ", "- they are, quite simply, Excellent. ", "Great fish, delicately fried, nice toppings... ", "(OK, perhaps their tortillas are a bit small for the piece of fish they put on them, which results in them being a bit unmanageable to eat, but I appreciate that they're corn instead of flour). ", "I'd put these against the ones at Woodhouse Fish Company any day. ", "In fact, I think I like them BETTER. ", "Not that Woodhouse's are BAD. ", "They're lovely, in fact. ", "These are just a tad more enjoyable to me. ", "The only other thing I wish is that the seating area weren't so fast-food like. ", "I'd love some dimmer lighting, more comfortable seating, a few more drink options. ", "I rarely feel inclined to sit down & have my meal here. ", "Instead, I always take my order to go. ", "Overall, though, I'm happy to have TacoBar in my neighborhood. ", "It's a place I visit frequently. :-)"], "author": "Eric H.", "review": "I only ever order one thing when I come here, so I can't speak for the rest of the menu, but for the item I DO know - the Baja Pescado Tacos - they are, quite simply, Excellent. Great fish, delicately fried, nice toppings... (OK, perhaps their tortillas are a bit small for the piece of fish they put on them, which results in them being a bit unmanageable to eat, but I appreciate that they're corn instead of flour). I'd put these against the ones at Woodhouse Fish Company any day. In fact, I think I like them BETTER. Not that Woodhouse's are BAD. They're lovely, in fact. These are just a tad more enjoyable to me. The only other thing I wish is that the seating area weren't so fast-food like. I'd love some dimmer lighting, more comfortable seating, a few more drink options. I rarely feel inclined to sit down & have my meal here. Instead, I always take my order to go. Overall, though, I'm happy to have TacoBar in my neighborhood. It's a place I visit frequently. :-)", "rating": 4, "date": "2015-11-24"}, {"excerpts": ["I ordered the Baja Pescado burrito, which had beer-battered mahi mahi.  ", "I will admit that the size of the burrito was huge ", "(it lasted me two meals) and the fish was amazing and fresh (best part of the burrito).  ", "Overall, however, it was quite salty and for the price"], "author": "Can C.", "review": "Alright, I know it's in SF, so I shouldn't expect reasonable prices, but honestly, nine dollars for a burrito is pushing it.  I would consider returning if it were amazing.  Unfortunately, it wasn't amazing.  :\\\n\nTacoBar is a cute little place on the corner of Fillmore and California.  I ordered the Baja Pescado burrito, which had beer-battered mahi mahi.  I will admit that the size of the burrito was huge (it lasted me two meals) and the fish was amazing and fresh (best part of the burrito).  Overall, however, it was quite salty and for the price, it didn't blow me away.\n\nThe horchata was pretty good, but again, I'm not sure I would buy it again for the price I paid.\n\nI think I'll try other Mexican places in the area before deciding if I will return to TacoBar, but chances are I won't be inclined to come back often.", "rating": 3, "date": "2011-10-03"}, {"excerpts": ["If you do go in, let me point you towards the baja pescado or beef tounge tacos. ", "They are solid but nothing to write home about."], "author": "Aaron M.", "review": "If I still lived in the mission, I would never go to Tacobar. While I still stop in often enough when I can't go without a mexican meal, It pains me to pay 25% more in cash for ~50% of the taste you can get from any podunk taqueria in the mission. Fortunately for them, Pac Heights doesn't offer much in the way of competition and they do brisk business. If you do go in, let me point you towards the baja pescado or beef tounge tacos. They are solid but nothing to write home about.", "rating": 3, "date": "2014-09-10"}, {"excerpts": ["Baja Pescado and the quesadillas are the best. ", "The burrito isn't that good. ", "Pricy but pretty good ", "and it's close to home. ", "Probably wouldn't go out of my way to go here as I would for tacolicious."], "author": "Brian M.", "review": "Baja Pescado and the quesadillas are the best. The burrito isn't that good. Pricy but pretty good and it's close to home. Probably wouldn't go out of my way to go here as I would for tacolicious.", "rating": 4, "date": "2013-06-02"}, {"excerpts": ["The Baja Pescado taco was amazing!! "], "author": "Pat W.", "review": "Today was my first time at taco bar. I live relatively close so I called in an order and did take out. The Baja Pescado taco was amazing!! Then I ran I to a bump in the road when they forgot to put guacamole and sour cream in my burrito.\n\nI called and they checked the ticket and I applaud them for their customer service. They realized they messed up and actually walked to my house and delivered a new burrito. You don't get much better service and the food was good. I would recommend this place to anyone!\n\nThanks taco bar :)", "rating": 5, "date": "2012-11-04"}, {"excerpts": ["Baja Pescado Burrito = amazing. ", "Large portion size, fresh, delicious."], "author": "Charles G.", "review": "Baja Pescado Burrito = amazing. Large portion size, fresh, delicious.", "rating": 4, "date": "2012-08-20"}, {"excerpts": ["So whenever I work from home, I inevitably end up down the street ordering 2 Baja Pescado tacos and a Coke. ", "And man, it's worth it every. ", "single. time. "], "author": "Jessica O.", "review": "You would think I would save money on lunch, working from home as often as I do. After all, what else are all those leftovers doing in my refrigerator??\n\nAlas, this is not the case. Because TacoBar is 3 blocks away. So whenever I work from home, I inevitably end up down the street ordering 2 Baja Pescado tacos and a Coke. And man, it's worth it every. single. time. Even if it does negate the money I saved on gas that morning.\n\nEveryone here is super friendly, the restaurant is extremely clean, and while the tacos don't quite measure up to Tortilla Heights (Nick's Way, of course), they still completely satisfy my never-ending fish taco craving. Also, the red salsa is delicious, and the prices are great.", "rating": 4, "date": "2011-06-02"}, {"excerpts": ["Their Baja pescado burro is as good as a fish burrito gets (5 stars)- absolutely delicious and the only reason this rating is as high as it is. ", "But I'm trying to eat a little healthier than fried food ", "so I have been branching out and have been disappointed each time. ", "The grilled fish burro is ok (3.5 stars). "], "author": "Esembee B.", "review": "2.5 stars. Their Baja pescado burro is as good as a fish burrito gets (5 stars)- absolutely delicious and the only reason this rating is as high as it is. But I'm trying to eat a little healthier than fried food so I have been branching out and have been disappointed each time. The grilled fish burro is ok (3.5 stars). The grilled shrimp burro was not worth the time or calories to eat it. Maybe 5 shrimp, a fruit salsa that added much-needed sweetness on the few moments I could taste it. The burrito was mainly cabbage slaw- overly pickled, assertive cabbage slaw that overpowered everything else and made the burrito taste like one note. Crunchy pickle wrapped in a tortilla is not what I was expecting for lunch today.", "rating": 3, "date": "2015-01-09"}, {"excerpts": ["Baja pescado taco is where it's at. ", "Delicious succulent fish, mouth watering sauces, corn tortillas, what could be better?  ", "Knocked a star off because it's a bit pricey"], "author": "kitty c.", "review": "Baja pescado taco is where it's at. Delicious succulent fish, mouth watering sauces, corn tortillas, what could be better?  Knocked a star off because it's a bit pricey", "rating": 4, "date": "2012-06-26"}, {"excerpts": ["So far I've tried the baja pescado, carne asada & vegetariano especial...", "all three are so, so yummy.  ", "But here's the truly mind blowing thing.  ", "The vegetariano especial came in a soft taco shell inside a crispy shell made of CHEESE.  ", "What is this taco technology they have going on?!?  ", "Mind blowing.  ", "A crispy shell of cheese.  "], "author": "Emily T.", "review": "So far I've tried the baja pescado, carne asada & vegetariano especial...all three are so, so yummy.  But here's the truly mind blowing thing.  The vegetariano especial came in a soft taco shell inside a crispy shell made of CHEESE.  What is this taco technology they have going on?!?  Mind blowing.  A crispy shell of cheese.  Freal?\n\nThe nachos are also amazing, made so by the house-pickled jalapenos.  You'll want to order a side of them to put on *everything*.  So, so good.", "rating": 5, "date": "2011-06-08"}, {"excerpts": ["This place is pricey but the baja pescado tacos are so worth it.. ", "they are ", "UHH-MAA-ZING lol try them ", "i'm sure you will all feel the same. ", "I work close by and since one of my co-workers ", "turned me on ", "I am addicted. ", "Expect me here on my lunch breaks they are really that good"], "author": "nicole i.", "review": "This place is pricey but the baja pescado tacos are so worth it.. they are UHH-MAA-ZING lol try them i'm sure you will all feel the same. I work close by and since one of my co-workers turned me on I am addicted. Expect me here on my lunch breaks they are really that good", "rating": 4, "date": "2011-12-02"}, {"excerpts": ["The chicken was ok, steak better than most and the Baja Pescado was legendary. ", "Cabbage slaw, ancho salsa and Baja line sauce were an amazing combo!  ", "Next time I'm near ", "I'll definitely stop by again!!"], "author": "D S.", "review": "I needed some tacos and this place didn't disappoint. I got the cucumber line agua fresca and three tacos. The chicken was ok, steak better than most and the Baja Pescado was legendary. Cabbage slaw, ancho salsa and Baja line sauce were an amazing combo!  Next time I'm near I'll definitely stop by again!!", "rating": 4, "date": "2013-11-14"}, {"excerpts": ["I ordered the baja pescado burritto \"especial\" and it blew me away, so fresh and tasty!!!  ", "The food came with a big basket of chips ", "and I sat outside and enjoyed the sun while I ate. ", "It was a bit pricey ", "but im ", "going to say its worth it for the fresh ingredients alone, usually after eating a big burritto ", "im left with a lump in my stomach, not here, i felt satisfied and happy! \n", "TRY IT!"], "author": "David R.", "review": "I loved this new edition to fillmore street.  I ordered the baja pescado burritto \"especial\" and it blew me away, so fresh and tasty!!!  The food came with a big basket of chips and I sat outside and enjoyed the sun while I ate. It was a bit pricey but im going to say its worth it for the fresh ingredients alone, usually after eating a big burritto im left with a lump in my stomach, not here, i felt satisfied and happy! \nTRY IT!", "rating": 5, "date": "2010-05-05"}, {"excerpts": ["Great baja pescado tacos, crispy little side salad, and that cup of corn.  ", "Yum."], "author": "Robert M.", "review": "I've grown inordinately fond of this little spot.  Is it possible for take-out to be better than food consumed on the premises?  Well, today it was.  We decided to do a last-minute office lunch and placed an order for pick up.  (Don't even try to call before 11:30.)  Great baja pescado tacos, crispy little side salad, and that cup of corn.  Yum.", "rating": 4, "date": "2011-08-17"}, {"excerpts": ["I ordered the Baja Pescado Taco \"Especial\", which cost me almost $6.  ", "It had one piece of over-fried fish in the taco and some kind of cheese disc which they wrapped in foil and put on the side.  "], "author": "Tina F.", "review": "I've walked by this place almost every day since it opened earlier this year, and I FINALLY decided to try it today.  I wasn't in a rush since I've heard it's overpriced and nothing special.  They were right.  \n\nI ordered the Baja Pescado Taco \"Especial\", which cost me almost $6.  It had one piece of over-fried fish in the taco and some kind of cheese disc which they wrapped in foil and put on the side.  In my opinion, Rubio's fish tacos taste better and are half the price.  \n\nOne plus, though, is the service.  Everyone from the waitress to the cashier were super friendly.  I might come here again if I'm in a Mexican-craving moment since it's convenient.", "rating": 3, "date": "2010-08-06"}, {"excerpts": ["I had the Baja pescado tacos, chips and guacamole.  ", "I grew up in San Diego and I consider myself a Mexican food snob.  ", "When traveling to other areas I typically avoid Mexican places because they never stack up.  ", "I've tried other places in the bay area and have never been thrilled, but I would definitely come back."], "author": "Sara R.", "review": "I arrived on a busy thursday evening and I received prompt and courteous service.  Very yummy food! I had the Baja pescado tacos, chips and guacamole.  I grew up in San Diego and I consider myself a Mexican food snob.  When traveling to other areas I typically avoid Mexican places because they never stack up.  I've tried other places in the bay area and have never been thrilled, but I would definitely come back.", "rating": 4, "date": "2012-09-13"}, {"excerpts": ["I don't think I've ever tasted a more delicious taco than the two I ordered, one was a \"Veracruz Pescado\" with grilled Mahi-Mahi, and the other was \"Baja Pescado\" with Tempura beer battered Mahi-Mahi. ", "Both were awesome, but I must say the \"Baja\" was OUTSTANDING!!!!!! ", "My friend ordered the Carne Asada Quesadilla, and was very pleased. ", "I couldn't believe how much beef was in it, and it was delicious. "], "author": "Vince F.", "review": "I ordered take-out last thursday night from TacoBar. I don't think I've ever tasted a more delicious taco than the two I ordered, one was a \"Veracruz Pescado\" with grilled Mahi-Mahi, and the other was \"Baja Pescado\" with Tempura beer battered Mahi-Mahi. Both were awesome, but I must say the \"Baja\" was OUTSTANDING!!!!!! My friend ordered the Carne Asada Quesadilla, and was very pleased. I couldn't believe how much beef was in it, and it was delicious. The Mexican Rice Pudding was also very tasty, with chopped Mango on top. This was my second time eating the food from TacoBar. Again, I highly reccommend this place for authentic Mexican cuisine, you will not regret it. Also, the service was outstanding, the girl that took the order on the phone, and the waiter who helped bag it, just overall ***** (five stars)!!!!!", "rating": 5, "date": "2012-01-29"}, {"excerpts": ["Baja pescado burrito is the best one. ", "Tacos are good. ", "The rice, beans and cheese burrito is basic but is good. ", "Nachos are great. ", "But pass on the margaritas if you aren't into blended icy drinks. ", "Service is fast and friendly, especially when you call ahead to order."], "author": "Melissa B.", "review": "A neighborhood staple. Baja pescado burrito is the best one. Tacos are good. The rice, beans and cheese burrito is basic but is good. Nachos are great. But pass on the margaritas if you aren't into blended icy drinks. Service is fast and friendly, especially when you call ahead to order.", "rating": 4, "date": "2011-12-12"}, {"excerpts": ["I go in and order a baja pescado burrito on the menu for $8.5. ", "I add guacamole which I know is extra and ask to replace the cabbage with a small portion of rice/beans.....and she tells me the total is $14.  ", "How do you go from $8.5 to $14 by swapping out a few mexican ingredients!   ", "I hadn't ordered anything else! ", "Mind you this includes ZERO CHIPS.  ", "Not even a handful on top of the bag. ", "ZERO.  ", "And you get 2 tablespoons of red and green salsa.   ", "SERIOUSLY?!  ", "The food is decent but it's nothing to brag to your friends about.  ", "Besides, the pricing and service bring the quality of the food down.  "], "author": "Allyson H.", "review": "I have given this place a fair shot... have been 4 or 5 times. I will say I'm happy that we know where the meat is coming from. Concept is good, atmosphere is cute but way too bright like a Johny Rocket's at midnight.   It's above the quality of La Tortilla or whatever it was before.  \n\nBUT Tacobar....THIS place is incredibly overpriced, the service is poor...slow and not friendly...did I mention the awful fluorescent lighting? I have ordered in twice and to-go twice.  Waited WAY too  long for both services.  Once it was busy and I waited 20 mins for -to-go (they hadn't been open for long so I was patient).   The manager so nicely gave me some chips because he realized I had been there forever and got skipped in the line somehow.\n\nSo tonight, hopeful.... I go in and order a baja pescado burrito on the menu for $8.5. I add guacamole which I know is extra and ask to replace the cabbage with a small portion of rice/beans.....and she tells me the total is $14.  How do you go from $8.5 to $14 by swapping out a few mexican ingredients!   I hadn't ordered anything else! Mind you this includes ZERO CHIPS.  Not even a handful on top of the bag. ZERO.  And you get 2 tablespoons of red and green salsa.   SERIOUSLY?!  The food is decent but it's nothing to brag to your friends about.  Besides, the pricing and service bring the quality of the food down.  It just does. \n\nWe all know there is better Mexican in the mission and then there is the AMAZING Little Chihuahua...which is a similar concept of using local organic ingredients and natural meat.  At Little Chihuahua you get all the chips you want and there is self service to about half a dozen salsas that are delicious.  And Little Chihuahua is on there second store and they are reasonably priced.  SO TACOBAR....rethink your business model, your customer service, your prices and try again.  You aren't doing it right and your reviews are NOT positive. \n\nLittle Chihuahua..YOU ARE THE BEST AND SEE YOU SOON.", "rating": 2, "date": "2010-11-08"}], "mucho queso": [], "quesadilla camaron": [{"excerpts": ["I had a quesadilla camaron, which was filled with succulent shrimp and an abundance of cheese. "], "author": "Valerie S.", "review": "Hungry people on a business trip, staying in Pacific Heights, wandering the streets looking for food. Luckily, there are a lot of choices on Fillmore and California and the surrounding areas. When faced with the choice, we ducked into TacoBar to feast on a huge array of amazing food. At the table were chips, salsa, guacamole, burritos, quesadillas, tacos, beans, rice, horchata, cerveza... basically, we went big. \n\nI had a quesadilla camaron, which was filled with succulent shrimp and an abundance of cheese. I overate, absolutely, but between the guacamole and the salsa verde I kept smothering it in, I just couldn't stop! \n\nEveryone was totally fat and happy after our meal. The food came out quickly, was hot and tasty, and the service was good. It's a combo take-away/restaurant, which was great for our mid-afternoon lunching. \n\nMexican food just gets better and better, the closer you are to the source.", "rating": 4, "date": "2013-10-13"}, {"excerpts": ["The Quesadilla Camaron is my favorite. ", "You cannot go wrong at Taco Bar. ", "We crave it constantly."], "author": "Fallon R.", "review": "This is our go-to place. It is never too crowded so we are able to sit outside on the weekend. The Quesadilla Camaron is my favorite. You cannot go wrong at Taco Bar. We crave it constantly.", "rating": 5, "date": "2014-04-16"}], "queso quesadilla": [], "rice  beans burrito": [], "rice  cheese burrito": [], "rice cheese  beans burrito": [], "mexicano rice  oz": [], "beans pinto or black  oz": [], "tortillas  corn or  flour": [], "grilled shrimp": [{"excerpts": ["The weekend brunch items are pretty big, but the tacos are small (I like the grilled shrimp or the carne Asada). ", "I also like the tortilla soup ", "- it's big and has a lot of tortilla strips in it, so it's filling."], "author": "Holly P.", "review": "I live close by and eat here often.  Its solid / basic Mexican food (tacos, burritos, quesadillas, etc).   Food is consistent and fresh but nothing special. The line moves quickly and it doesn't take too long to get food.  Employees are friendly.  \n\nLike most places on Fillmore, it's overpriced for what it is.   It's still one of the more casual and faster places in the area (the Grove is even more overpriced, although Glazed and Roam have them beat for value.  Just depends what you're in the mood for).  \n\nI recommend the esquite / elote when they have corn and the watermelon Agua Fresca.  The weekend brunch items are pretty big, but the tacos are small (I like the grilled shrimp or the carne Asada). I also like the tortilla soup - it's big and has a lot of tortilla strips in it, so it's filling.", "rating": 4, "date": "2017-08-12"}, {"excerpts": ["Pollo Burrito, Carne Asada Tacos & Coconut Flan\nDevour:  Shrimp Taco & Grilled Shrimp\n", "Total:  $32.41"], "author": "Genevieve Y.", "review": "Date & Time:  Wednesday April 14, 2010 @ 1pm \nDining Companions:  Dana & Janie\nScene:  Well-Heeled Pairs of Young Ladies in Elizabeth Charles Dresses  & Guys in Blazers, Thomas Pink Shirts, Jeans & Loafers\nVibe:  Chill\nDecor:  Bright & Cheery.  Edison Lighting.  Mosaic Patterned Walls.  Communal Table, Cushioned Bench, Counter-Seating & Dining Al Fresco\nService:  Very, Very Nice & Humble\nImbibe:  Jamaica Agua Fresca.  Mango & Horchata Agua Fresca, Magarita & Sangrias Available\nMediocre: Pollo Burrito, Carne Asada Tacos & Coconut Flan\nDevour:  Shrimp Taco & Grilled Shrimp\nTotal:  $32.41", "rating": 3, "date": "2010-04-14"}, {"excerpts": ["We tried 5 tacos: the poblano and mushroom and the yucatan pork on the specials board, the grilled fish, grilled shrimp, and carnitas. "], "author": "Sam P.", "review": "Like a taqueria version of Colibri or Tacolicious, TacoBar does more of a pan-mexican range of tacos than the Jalisco-style common in the Mission. The food is quality and authentic to what I found in Mexico City and other parts of central Mexico. \n\nWe tried 5 tacos: the poblano and mushroom and the yucatan pork on the specials board, the grilled fish, grilled shrimp, and carnitas. All this was after some great chips (sprinkled with cotija) with three quality table salsas (red, green, and spicy charred red).\n\nMost memorable was the vegetarian taco, with its great balance of herbs, pepper, and earthy mushroom flavors, rajas-style. I don't know why more places don't do stuff like this. For $3.75, it was enough bites to be a great deal for such flavor. \n\nThe fish and yucatan pork tied for second. The fish was a decent sized piece covered in a rich tomato-y sauce, Veracruz-style, over a bed of cabbage. Crunch, sauce, silky fish, nice bites. \n\nThe carnitas was the biggest portion. I was tempted to turn it into two tacos. And for $3.75, it was basically as much food as two $2 tacos at Mission places. The shrimp on the other hand was fairly tiny, so we didn't share that. But very very tasty nonetheless.\n\nIf you want great Mission tacos, go to Taqueria Vallarta. It's a totally different deal. \n\nBut TacoBar is by far the cheapest option I've found in its natural competitive set, the pan-Mexican places like Tacolicious and Colibri.\n\n**\n\nSecond trip in a week: Tried the special baja fish, which added guac and a crispy cheese layer outside the soft tortilla. The fish was delicious, super crispy and piping hot. Overall the package was unusual, tasty, and gimmicky, the kind of thing they should market more (it's rather hidden on the menu).\n\nMore importantly, this time we found the jicama and grapefruit salad. It was delicious and a huge portion. The chili-encrusted peanuts were a great foil. We'll go back just for this.", "rating": 4, "date": "2012-09-29"}, {"excerpts": ["I keep going back for the Camaron Burro: ancho marinated grilled shrimp with cabbage slaw and mango salsa. ", "A truly lighter, healthier, tasty take on a burrito.  ", "Most worthy for a small taqueria."], "author": "Jake Z.", "review": "Taco Bar is Cali-fresh, often organic top quality ingredients. They just don't brag about it a ton. I keep going back for the Camaron Burro: ancho marinated grilled shrimp with cabbage slaw and mango salsa. A truly lighter, healthier, tasty take on a burrito.  Most worthy for a small taqueria.", "rating": 5, "date": "2014-10-10"}, {"excerpts": ["The grilled shrimp burro was not worth the time or calories to eat it. ", "Maybe 5 shrimp, a fruit salsa that added much-needed sweetness on the few moments I could taste it. ", "The burrito was mainly cabbage slaw- overly pickled, assertive cabbage slaw that overpowered everything else and made the burrito taste like one note. ", "Crunchy pickle wrapped in a tortilla is not what I was expecting for lunch today."], "author": "Esembee B.", "review": "2.5 stars. Their Baja pescado burro is as good as a fish burrito gets (5 stars)- absolutely delicious and the only reason this rating is as high as it is. But I'm trying to eat a little healthier than fried food so I have been branching out and have been disappointed each time. The grilled fish burro is ok (3.5 stars). The grilled shrimp burro was not worth the time or calories to eat it. Maybe 5 shrimp, a fruit salsa that added much-needed sweetness on the few moments I could taste it. The burrito was mainly cabbage slaw- overly pickled, assertive cabbage slaw that overpowered everything else and made the burrito taste like one note. Crunchy pickle wrapped in a tortilla is not what I was expecting for lunch today.", "rating": 3, "date": "2015-01-09"}, {"excerpts": ["The grilled shrimp were incredibly fresh, sweet, lightly seasoned, and served in a tortilla with perfect shredded cabbage and mango salsa. ", "Tacobar uses it as an incredibly crisp accompaniment inside the burro, which added texture, crunch, and balance to the lightly seasoned shrimp and spicy mango salsa.\n\n"], "author": "P. B.", "review": "It is important that you know I generally dislike Mexican food or the Tex-Mex that passes for Mexican cuisine throughout most of the U.S.\n\nTacoBar is bright and cheerful. The staff is welcoming and friendly and the prices are affordable.\n\nIt is the most delicious burro (different type of burrito) that I have ever eaten that compels me to write. The quality of the ingredients, care in preparation, and imaginative components create exceptional food that is beyond delicious. The grilled shrimp were incredibly fresh, sweet, lightly seasoned, and served in a tortilla with perfect shredded cabbage and mango salsa. It was scrumptious, flavorful, and unlike an ordinary burrito.\n\nShredded cabbage? Yes, a vegetable I usually avoid. Tacobar uses it as an incredibly crisp accompaniment inside the burro, which added texture, crunch, and balance to the lightly seasoned shrimp and spicy mango salsa.\n\nHibiscus Iced Tea was the perfect beverage. I plan on eating here every time I'm in the neighborhood. Ok, the competition in this neighborhood for delicious, healthy, and affordable food is intense. Between Woodhouse, La Meditteranee, Troya, Jane, and La Boulange, TacoBar is probably the least expensive, offers the most flavorful, and quickest meals.", "rating": 4, "date": "2011-01-26"}], "pescado fish": [], "pico de gallo": [{"excerpts": ["Placed my order for the carne asada burrito, which consisted of pinto beans, Mexicano rice and Pico de Gallo.  ", "No side of chips or salsa came with the order. ", "As for the burrito, it had good flavor but a couple bites into it, I didn't taste the beef yet. "], "author": "Al L.", "review": "Having to be at CPMC for visitations for a week, I walked down to Fillmore get dinner \"to go\" on during this time.  Walked by and checked out the menu and decided to get a burrito at TacoBar at the corner of California and Fillmore. \n\nPlaced my order for the carne asada burrito, which consisted of pinto beans, Mexicano rice and Pico de Gallo.  No side of chips or salsa came with the order. As for the burrito, it had good flavor but a couple bites into it, I didn't taste the beef yet. This was a carne asada burrito that was short on the beef. \n\nRestaurant had a nice décor and service was friendly, but given the price, the burrito was just ok relative to ones I've had in the City.", "rating": 3, "date": "2016-07-17"}, {"excerpts": ["$20 for two tacos and a quesadilla filled with mostly beans and pico de gallo. ", "It's interesting that they don't list the prices on their menu."], "author": "Eric W.", "review": "Underwhelming and overpriced. $20 for two tacos and a quesadilla filled with mostly beans and pico de gallo. It's interesting that they don't list the prices on their menu.", "rating": 1, "date": "2016-05-30"}, {"excerpts": ["The tacos came with pinto beans and pico de gallo.\n\n"], "author": "Stephanie C.", "review": "On our way to the Kabuki to see Prometheus a few weeks back, we stumbled upon TacoBar. The smells of carne asada and carnitas drew us in and we were warmly welcomed by the staff.\n\nNow, anyone who knows me, knows that I LOVE Mexican food. I was excited that we came upon this place but I wasn't so excited about the prices. For standard street tacos, we paid a pretty penny ($3.45/each), however the tacos were pretty good! Not great, but good. I had the carnitas tacos and the carnitas were juicy and tender, not dry at all. The boyfriend had some fish tacos, made with Mahi Mahi ($3.75/each), which were delicious! The tacos came with pinto beans and pico de gallo.\n\nI think if you're in the Pac Heights area, TacoBar is a solid spot to grab a quick bite. However, like other Mexican restaurants outside of the Mission, I just wouldn't make the trek out there.", "rating": 3, "date": "2012-07-03"}, {"excerpts": ["The best feature is that the chips and salsa come with pico de gallo style salsa, plus 2 hot sauces (green/tomatillo and a smoky red), AND crumbled cojita cheese. ", "It's a big step up from the standard chips and salsa at most places, where the quality of the chips is an afterthought."], "author": "Laura J.", "review": "This is my go-to place to grab a burrito (not that there are many places in Pacific Heights), and while it isn't the best burrito you'll ever have, it's really solid. \n\nThe carnitas are fresh and not fatty, but usually I get a veggie burrito. They have a good Jarritos selection and alright margaritas. The taco salad isn't great. Really, the take-away here is to stick with a burrito. \n\nNot a destination taqueria, but a great local place. The best feature is that the chips and salsa come with pico de gallo style salsa, plus 2 hot sauces (green/tomatillo and a smoky red), AND crumbled cojita cheese. It's a big step up from the standard chips and salsa at most places, where the quality of the chips is an afterthought.", "rating": 4, "date": "2014-07-26"}, {"excerpts": ["Add a little pico de gallo and OMG!!  ", "Service is quick and always friendly.  ", "Food is always fresh, colorful, and delicious.  ", "Great, casual little neighborhood restaurant.  ", "Excellent for carry out too!"], "author": "Emily W.", "review": "Tacobar's Veracruz pescado burrito is the jam -- I've probably eaten them 100 times here!  Add a little pico de gallo and OMG!!  Service is quick and always friendly.  Food is always fresh, colorful, and delicious.  Great, casual little neighborhood restaurant.  Excellent for carry out too!", "rating": 5, "date": "2016-02-01"}, {"excerpts": ["Nothing like having a vegetarian breakfast burrito with no pico de gallo and substitute the beans for refried beans and add guacamole, after a morning run. ", "It's a pretty good size too. ", "The Aguas Frescas are pretty fresh and not sweet, just thirst quenching and refreshing. ", "Neighborhood gem."], "author": "leba g.", "review": "They serve breakfast! Nothing like having a vegetarian breakfast burrito with no pico de gallo and substitute the beans for refried beans and add guacamole, after a morning run. It's a pretty good size too. The Aguas Frescas are pretty fresh and not sweet, just thirst quenching and refreshing. Neighborhood gem.", "rating": 5, "date": "2015-07-19"}, {"excerpts": ["this time they didn't mix in the pico de gallo. ", "Chorizo they use is not at all what would be used at an authentic mexican spot....and the prices DEFINITELY not reflective of their food. ", "A plate of eggs and chorizo and an average tasting Carne asada burrito w 2 small horchatas almost $30. ", "RIDICULOUS!", "! ", "sorry fellow yelpers...", "I should've never doubted you. ", "2 stars just because the establishment was clean."], "author": "MC P.", "review": "Definitely below average. Please note that I came here for breakfast so I can't attest to their tacos. Very Inauthentic Mexican. I should've known better. Had the chorizo and eggs. 1st order had to be returned because the scrambled eggs were watery...very gross. Initial reaction when I mentioned that they were inedible wasn't very customer friendly. They remade my eggs...this time they didn't mix in the pico de gallo. Chorizo they use is not at all what would be used at an authentic mexican spot....and the prices DEFINITELY not reflective of their food. A plate of eggs and chorizo and an average tasting Carne asada burrito w 2 small horchatas almost $30. RIDICULOUS!! sorry fellow yelpers...I should've never doubted you. 2 stars just because the establishment was clean.", "rating": 2, "date": "2015-05-24"}, {"excerpts": ["The salsa is pico de gallo that is simple bland. ", "Some heat or salt would make it better. ", "Then for the meal I had a vegi taco that had good guacamole on it which is all I can compliment on. ", "My SO had the vegi torta that was bland too."], "author": "Seamus L.", "review": "The food is meh. It's neither the comfort Tex-mex nor amazing Mexican. It seems like half the food is prepackaged and then microwaved.\n\nWe started with chips and salsa where the chips are thick but sadly sort of cold. The salsa is pico de gallo that is simple bland. Some heat or salt would make it better. Then for the meal I had a vegi taco that had good guacamole on it which is all I can compliment on. My SO had the vegi torta that was bland too.", "rating": 2, "date": "2014-12-07"}, {"excerpts": ["I got a carne asada burrito ($7.95) with rice, pico de gallo, and no beans (they give me gas).  "], "author": "Mitch W.", "review": "While in SF, we ate at TacoBar because it looked good.  It kind of reminds me of an independent Baja Fresh.\n\nI got a carne asada burrito ($7.95) with rice, pico de gallo, and no beans (they give me gas).  It's a fairly large burrito and it comes out hot and fresh.  \n\nI don't really see anything spectacular about this place hence the 3 stars.\n\nCheers!", "rating": 3, "date": "2010-08-11"}, {"excerpts": ["has the pico de gallo, sour cream, and guac on the side ", "and that's why I love them) and the woman went back in to get them. ", "She didn't return - instead a guy who I believe was the owner came. ", "He showed me my receipt and told me I never ordered guacamole, and I said \"I got this with the special extra\" and he said \"that's not the same as guacamole. "], "author": "Elizabeth T.", "review": "I really wanted to be a fan of this place - when I saw it being built, I was ecstatic. This morning, when I checked the reviews, I chalked the low ratings up to \"lower pac height snobs\" who were expecting too much out of a taco place. Unfortunately, I have either become one of those folks, or, as I suspect, this place isn't marketing itself well.\n\nTacoBar makes you think it will be a down-to-earth taco place, however, it's actually a pseudo-gourmet take on Mexican food. That alone doesn't give it the low rating, though - it's the price mixed with the attitudes mixed with the poor explanations of what you are getting.\n\nWhen my boyfriend and I ordered, we got 2 carnitas tacos, a carne asada quesadilla with the extra crema fresca and guacamole, and chips and salsa. A lot of people on here complained about the price of chips, but for the quality of chip and salsa, they were amazing. However, the guy in front of me got his salsa and some cheese heaped on the chips, and I got a relatively small pot of salsa. I had to ask why mine were different than his, and they said \"oh you have to ask for that\" which I didn't understand (how would I know that?) and then I had to ask for the cheese. I thought the guac came with the chips, but that was my mistake, and I was fine with that.\n\nWe sat outside (not a ton of seating, but it's a nice place inside) and besides the really annoying guy's barking dog (people, don't go to a restaurant and tie your dog up. You are a jerk when you do this) it was really nice. I was annoyed that when I tried to use a squeeze bottle for the salsa, the top wasn't screwed on and it all poured out everywhere, but again, small thing. \n\nMy biggest disappointment was the main course. My boyfriend had tacos, which he said were fine - the pork was a little bland and a little dry. However, my \"quesadilla\" was not a quesadilla. At first we thought I got a burrito in some flakey kind of flatbread. I inquired as to where my sour cream and guac were (every quesadilla I've ever gotten has the pico de gallo, sour cream, and guac on the side and that's why I love them) and the woman went back in to get them. She didn't return - instead a guy who I believe was the owner came. He showed me my receipt and told me I never ordered guacamole, and I said \"I got this with the special extra\" and he said \"that's not the same as guacamole. You have to pay a lot of money for that.\" \n\nI thought that was a really weird and rude thing to say, so I told him he should explain his menu better and he pointed at my food and said \"I can see guacamole in there.\" Then he left.\n\nThere was, indeed, something resembling a little guacamole inside my not-quesadilla, but it was such a pathetic amount that I will say that no one should get the extra - for two bucks a glop of sour cream and a tiny green coloring of guacamole isn't worth it. Avocado isn't gold, people. \n\nOverall, however, I didn't like the quesadilla. The tortilla wasn't a tortilla, it was shaped like a burrito and difficult to eat, and overall this take on fusion wasn't what I was expecting nor what I would have ordered had I know. Couple that with the rude owner and the lack of explanations, I'm never going back to this place. \n\nIf you guys can get your attitudes in order and figure out a good system for selling things that doesn't leave people confused and feeling ripped off, I'll come back. I have no qualms paying $25 like I did today for the meal I had - I just don't want to feel verbally assaulted by the owner because I asked where my sides were. Food isn't a fine art. It's food.", "rating": 2, "date": "2010-04-24"}, {"excerpts": ["They had this baked cheese crisp inside of a corn tortilla, topped with pinto beans, pico de gallo, and guacamole. ", "I asked for the guac to be left off but they left it on. "], "author": "Kayla N.", "review": "This place is ok. When we walked by, there was a really long line of people waiting to order. When we discovered that everywhere else had an hour or longer wait for lunch, we walked back in the direction of TacoBar. Lo and behold, the line was reasonable and there was an open table outside (we brought our poochie with us).\n\nHubby got a carne asada burrito and really enjoyed it. I got the vegetarian tacos and was a little underwhelmed. They had this baked cheese crisp inside of a corn tortilla, topped with pinto beans, pico de gallo, and guacamole. I asked for the guac to be left off but they left it on. On well. \n\nI wanted to like the crispy cheese more but it lacked something- salt maybe. Also, I POURED red salsa all over my tacos and it added...nothing. I LOVE salsa- and most sauces for that matter- and was disappointed that there really wasn't anything to it.\n\nWe'll see if we come back here.", "rating": 3, "date": "2010-04-18"}, {"excerpts": ["I got my Steak Taco to go and got to eating it within a few minutes -- it wasn't really warm, the pinto beans (loose, not mashed or refried for ease of eating) were falling from every direction and the carne asada and pico de gallo were barely visible - NO NAPKINS INCLUDED!  ", "My friend I was sitting near wondered when I'd become a vegetarian and why I was eating a runny, bean taco!  ", "For $5 bucks, I got a bland, nasty pinto bean taco, with an unnoticeable garnish of carne asada and pico de gallo and no napkins...  ", "NOT COOL "], "author": "Rocky S.", "review": "I, too, like many other yelpers was excited of the Taco Bar opening.  I missed my La Salsa fixes and was very happy to learn that some of the unemployed La Salsa staff was working at Taco Bar.  I wish it could be a different reality with this place.... it's terrible.\n\nI went the week they opened to try it and although I'm not too picky, the menu seemed rather vague and lacked details.  There are desert items and horchata beverages listed by the cash register,  but you wouldn't notice through a crowd.  You think the street signs are unclear in Mexico?  Try Tacobar.\n\nI decided to go with the Tortilla Soup, for a sky-rocketed $7.95.  This is not a restaurant, nor is the atmosphere restaurant-like.  It's supposed to be a high-end Mexican cantina.  Well, at modest Mexican cantinas I get chips & salsa, and when I ask for water I'm given a real glass of water -- Tacobar insists you buy bottled water, or you can self-serve yourself with a freakin' DIXIE CUP OF WATER!  I'm not rinsing and spitting for my dentist, yo!  I'm paying $9 bucks for bland and too salty soup without chips and salsa while sitting in a corner with my knees hitting the wall!  You think that shopping and driving in Mexico are an altered state of reality?  Try Tacobar.\n\nI suspected I was expecting too much my first visit, so I gave Tacobar another try yesterday.  I got a Carne Asada Taco to go.  I was given a little attitude on ordering just one taco - but that's all I wanted this time.  I asked about chips and salsa, as I didn't get them the first time I was there as anyone would expect from Mexican cuisine, but I was told that's separate.  Well, my one taco was more than $5 bucks so chips and salsa really should've been included.  I didn't get them.\n\nI got my Steak Taco to go and got to eating it within a few minutes -- it wasn't really warm, the pinto beans (loose, not mashed or refried for ease of eating) were falling from every direction and the carne asada and pico de gallo were barely visible - NO NAPKINS INCLUDED!  My friend I was sitting near wondered when I'd become a vegetarian and why I was eating a runny, bean taco!  For $5 bucks, I got a bland, nasty pinto bean taco, with an unnoticeable garnish of carne asada and pico de gallo and no napkins...  NOT COOL AT ALL JACK.\n\nI know I can sit down at a real Mexican restaurant with a waiter waiting on me, a full meal with great flavour and a live Mariachi Band for what I've wasted at Tacobar.  Not only is it not good food, it's a negative vibe also -- No real smiles when you walk in.  I've seen the owner leering around the shop probably wondering how things are going.  He should really ask the diners instead of staring/glaring at them, because so far his ideas are way off the mark.  You want an overpriced and seriously deficient Mexican meal? Try Tacobar.", "rating": 1, "date": "2010-04-28"}, {"excerpts": ["Even the pico de gallo included in the taco was bland--needs more cilantro, spices, onions, fire, FLAVOR! "], "author": "Caroline I.", "review": "Summary: Bland chicken taco, but deceptively tasty if (1) you drown it in the green salsa and (2) it's 4:45pm and you haven't eaten all day.  Sure beats gnawing your arm off!\n\nI anticipated giving this place 1 star, as I was warned that it was craptastic/bland-tastic.  The taco was decent sized, seemed to weigh a lot.  I like to drench my tacos w/tons of salsa, so the taco actually had flavor to me. \"Green salsa flavor\", that is.  At the end, I decided to try a piece of the chicken on its own, without swimming in the green salsa.  And...it was indeed bland.  Even the pico de gallo included in the taco was bland--needs more cilantro, spices, onions, fire, FLAVOR! Funny how starving all day and dumping on verde salsa can cloud judgement and magically add a star to yelp review!\n\nI was surprised there were actually a fair number of people eating here. But, they all looked tired, like they'd been shopping and starving all day, eating at an odd hour...\n\nI have no desire to return (unless I happen to find myself on Fillmore & Cal, about to gnaw my arm off once again).", "rating": 2, "date": "2010-05-22"}, {"excerpts": ["The tacos were relatively large, filled with pinto beans, meat and some pico de gallo. ", "Unfortunately the tacos were bland, the meat and pico de gallo had very little flavor ", "and I mostly tasted the pinto beans. "], "author": "Matt S.", "review": "I tried this place for the first time this afternoon. I ordered two carne asada tacos, and was surprised that they were $4.85 apiece. With a drink the order came to over $13.\n\nThe tacos were relatively large, filled with pinto beans, meat and some pico de gallo. Unfortunately the tacos were bland, the meat and pico de gallo had very little flavor and I mostly tasted the pinto beans. I poured on a generous amount of their house salsa, but it didn't add much flavor either. \n\nI was very disappointed, if I return I may try one of their burritos which are a little more reasonably priced (around $8), but there are other better and cheaper places in the neighborhood so I won't be hurrying back.", "rating": 2, "date": "2010-04-21"}, {"excerpts": ["Also, no free chips - paid $2.95 for a small bowl of chips and tasteless pico de gallo. "], "author": "G O.", "review": "Everything I felt about this place has already been written, but I want to lower this place's ratings so I can save others from spending an exorbitant amount on a crappy Mexican lunch.\n\nI had the vegetarian taco and my boyfriend had the veracruz pescado burro. Also bought the totopos (chips) and salsa. The big theme here is BLAND but the other is EXPENSIVE. How do they manage to make wonderful Mexican food made with organic ingredients taste so flavorless? Also, no free chips - paid $2.95 for a small bowl of chips and tasteless pico de gallo. In all, paid $22 for a tiny lunch for two people that I would have paid probably less than $10 for at Pancho Villa in the Mission and it would have tasted way better. \n\nOn top of that, when we finally snagged a table outside, it was filled with someone else's dirty dishes with no bussing service in sight. I ended up bussing the table myself to someone inside - two trips - but at least the hostess/waitress thanked me cheerfully both times. \n\nBottom line: at $5 for a bland taco, save your money and pray for the return of La Salsa.", "rating": 1, "date": "2010-04-17"}, {"excerpts": ["TacoBar has great burritos, super fresh guacamole and pico de gallo, and good beer. ", "Some other reviewers have criticized it for being overpriced, and it does cost a little more than other taco joints that don't look quite as nice inside, but I had really, really good food here ", "and I would go here again. ", "You order at the counter and they bring it out to you, but there's still pleasant, speedy service. ", "It's a very cool corner eatery."], "author": "Lowen B.", "review": "3 1/2 Stars. TacoBar has great burritos, super fresh guacamole and pico de gallo, and good beer. Some other reviewers have criticized it for being overpriced, and it does cost a little more than other taco joints that don't look quite as nice inside, but I had really, really good food here and I would go here again. You order at the counter and they bring it out to you, but there's still pleasant, speedy service. It's a very cool corner eatery.", "rating": 3, "date": "2010-09-03"}, {"excerpts": ["The Chipotle Guacamole was absolutely delicious and the Pico de Gallo, I could have easily consumed buckets had my trousers had more Lycra.  ", "My friend loved her chicken tacos and said the chicken was moist and flavorful, and the tortillas were perfectly prepared.  ", "The wall menu is easy to read and all the prices displayed.  ", "The only problem was deciding on what to eat.  ", "We arrived at noon and everything looked appealing as we observed all the patrons devouring their meals with contented expressions."], "author": "Lauren L.", "review": "Finally, a great Mexican cafe in the neighborhood.  No it is not Mission Street cheap but you get what you pay for... simply QUALITY and TASTE!  The Chipotle Guacamole was absolutely delicious and the Pico de Gallo, I could have easily consumed buckets had my trousers had more Lycra.  My friend loved her chicken tacos and said the chicken was moist and flavorful, and the tortillas were perfectly prepared.  The wall menu is easy to read and all the prices displayed.  The only problem was deciding on what to eat.  We arrived at noon and everything looked appealing as we observed all the patrons devouring their meals with contented expressions.", "rating": 5, "date": "2010-04-22"}, {"excerpts": ["The menu says the veggie tacos have beans, pico de gallo, guac, and melted cheese.  ", "But it's not melted cheese - it's GRILLED cheese.  ", "On the OUTSIDE of the tortilla.  ", "And I LOVE it.  ", "I see cravings for these in my future - next time will skip the burrito and go right to the good stuff."], "author": "K K.", "review": "I can't speak to the meat tacos, but the veggie stuff is pretty good.  I'm really picky about chips, and these were great chips.  They're actual tortillas cut up and fried (what is it with taquerias in the Mission handing out stale Doritos???) and then they sprinkle them with Cotija cheese, which almost makes up for the fact that you have to purchase them.  I couldn't taste anything in the veggie burrito except guac - and I don't love guac - so I was unthrilled about the burrito.  \n\nBut the tacos...  The menu says the veggie tacos have beans, pico de gallo, guac, and melted cheese.  But it's not melted cheese - it's GRILLED cheese.  On the OUTSIDE of the tortilla.  And I LOVE it.  I see cravings for these in my future - next time will skip the burrito and go right to the good stuff.", "rating": 4, "date": "2010-08-24"}, {"excerpts": ["Not even pico de gallo. ", "I understand that Mexican food doesn't have to be super spicy to be good, but a little cilantro, onion, herbs, anything. \n", "The only salsas are two squirt bottles on each table. ", "The red salsa has a smoky, roasted flavor. ", "The green one tastes like cactus/nopales. ", "Pretty good, but if you want spice neither of those will satisfy you.\n", "No complimentary chips. ", "It is expensive.\n", "Ice cream flavors look intriguing. \n", "Still left yearning for a solid Mexican restaurant in the neighborhood. \n", "I don't think I will go back. ", "Though I am curious to try their burrito. ", "They looked really sad and I am wondering if they could be as bad as they look. ", "I guess it's a lose/lose bet with myself."], "author": "Camila F.", "review": "Well, it doesn't suck. I guess when you have a place as well designed and trendy looking, it kind of raises your expectations. So with that in mind we were mostly disappointed in our food.\nWe ordered 4 facos; baja fish, fish varacruz, carne asada and carnitas. The tacos look really impressive. They are mini cornucopias of lettuce and filling. The baja fish taco was by far the best with a tangy dressing  and fried fish. It's a no-brainer. The veracruz was a little anemic on the fish and the veracruz sauce tasted like canned tomatoes. The carne asada was tender but had no real flavor. Carnitas tasted boiled and bland. The pinto beans in the meat tacos had no flavor and the meat tacos were topped with plain chopped tomatoes. Not even pico de gallo. I understand that Mexican food doesn't have to be super spicy to be good, but a little cilantro, onion, herbs, anything. \nThe only salsas are two squirt bottles on each table. The red salsa has a smoky, roasted flavor. The green one tastes like cactus/nopales. Pretty good, but if you want spice neither of those will satisfy you.\nNo complimentary chips. It is expensive.\nIce cream flavors look intriguing. \nStill left yearning for a solid Mexican restaurant in the neighborhood. \nI don't think I will go back. Though I am curious to try their burrito. They looked really sad and I am wondering if they could be as bad as they look. I guess it's a lose/lose bet with myself.", "rating": 3, "date": "2010-05-10"}], "mango salsa": [{"excerpts": ["Love the mango salsa and shrimps. ", "Keep in mind you probably need more than 2 tacos to get full here"], "author": "Alex L.", "review": "Love the mango salsa and shrimps. Keep in mind you probably need more than 2 tacos to get full here", "rating": 4, "date": "2017-06-16"}, {"excerpts": ["Likes: \nMango salsa\nPulled pork taco special \n", "Chips topped w cotija cheese"], "author": "Daniela J.", "review": "Decent casual fast food on filmore. Nothing too great but it's nice to have a spot for some quick take out. The meat in the tacos was a little dry but I liked the salsa and guac\n\nLikes: \nMango salsa\nPulled pork taco special \nChips topped w cotija cheese", "rating": 3, "date": "2015-06-15"}, {"excerpts": ["The crunch on the deep fried fish is to die for with the mango salsa is perfect! ", "The shrimp tacos taste amazing as well! ", "We also saw somebody order a churro, out of curiosity we ordered it and it was no mistake! ", "The churro came out and it was nice and warm after biting into it! ", "We actually have Steven to thank a couple doors down at Travel Visa Pro since he recommended this place! ", "Small little restaurant also, but with cute decor. ", "On the tables they have espanol kiddie flash cards teaching you Spanish words. ", "Only knock is its a bit pricey, but hey you are in the city right!?"], "author": "Rosh E.", "review": "Hands down the best fish and shrimp tacos I have ever had in my life! The crunch on the deep fried fish is to die for with the mango salsa is perfect! The shrimp tacos taste amazing as well! We also saw somebody order a churro, out of curiosity we ordered it and it was no mistake! The churro came out and it was nice and warm after biting into it! We actually have Steven to thank a couple doors down at Travel Visa Pro since he recommended this place! Small little restaurant also, but with cute decor. On the tables they have espanol kiddie flash cards teaching you Spanish words. Only knock is its a bit pricey, but hey you are in the city right!?", "rating": 4, "date": "2014-02-19"}, {"excerpts": ["Because it's filled with plump, juicy prawns, cabbage slaw, roasted ancho salsa, & jicama/mango salsa.\n\n"], "author": "Mariela D.", "review": "When I met TacoBar's \"burros\", the healthier no-rice version of the burrito, I thought: \"Finally. a burrito I am free to love without shame.\" It's the burrito I am not embarrassed to Instagram about. Because it's filled with plump, juicy prawns, cabbage slaw, roasted ancho salsa, & jicama/mango salsa.\n\nBUT THEN...I ruin my calorie count by ordering the coconut flan. \n\nBut in my defense: \nOh my GOD. If you tasted it, you would understand. I have \"moments\" with this flan. MOMENTS, I tell you.\n\nLike...excuse me, but me and my flan need to be alone right now. Please go away. /shutsdoor\n\nBut it all balances out, because the rest of the menu is healthy and light. Burros come with carne asada, chicken, Mahi Mahi (tempura beer battered or grilled), or prawns.\n\nThey also serve sangrias and margaritas if you want to get happy hour started early....like at noon. Not that I do that, ever. \n\nI've been back three times in the past month so I think this is a sign of a pretty good relationship. If only I could stop whoring around with that flan. \n/probablynotgonnahappen", "rating": 4, "date": "2012-08-08"}, {"excerpts": ["The shrimp themselves were nicely seasoned and the mango salsa was great.\n\n"], "author": "Marty F.", "review": "I went for dinner and got 3 tacos, all fish-themed:\n\nThe mahi-mahi taco was bland and largely tasted of dry corn tortilla\n\nThe shrimp taco was spicier and tastier.  The shrimp themselves were nicely seasoned and the mango salsa was great.\n\nThe fried fish taco was the most substantial and tasty. The fish had nice crispy batter outside and wasn't overcooked inside. Spicy salsa and lime-sour cream sauce sealed the deal.\n\nThe three tacos was plenty of food for dinner, and the price for just the tacos was reasonable.\n\nI also ordered a glass of sangria, which was tasty, but cost too much for the small glass.", "rating": 3, "date": "2012-01-30"}, {"excerpts": ["I keep going back for the Camaron Burro: ancho marinated grilled shrimp with cabbage slaw and mango salsa. ", "A truly lighter, healthier, tasty take on a burrito.  ", "Most worthy for a small taqueria."], "author": "Jake Z.", "review": "Taco Bar is Cali-fresh, often organic top quality ingredients. They just don't brag about it a ton. I keep going back for the Camaron Burro: ancho marinated grilled shrimp with cabbage slaw and mango salsa. A truly lighter, healthier, tasty take on a burrito.  Most worthy for a small taqueria.", "rating": 5, "date": "2014-10-10"}, {"excerpts": ["The grilled shrimp were incredibly fresh, sweet, lightly seasoned, and served in a tortilla with perfect shredded cabbage and mango salsa. ", "Tacobar uses it as an incredibly crisp accompaniment inside the burro, which added texture, crunch, and balance to the lightly seasoned shrimp and spicy mango salsa.\n\n"], "author": "P. B.", "review": "It is important that you know I generally dislike Mexican food or the Tex-Mex that passes for Mexican cuisine throughout most of the U.S.\n\nTacoBar is bright and cheerful. The staff is welcoming and friendly and the prices are affordable.\n\nIt is the most delicious burro (different type of burrito) that I have ever eaten that compels me to write. The quality of the ingredients, care in preparation, and imaginative components create exceptional food that is beyond delicious. The grilled shrimp were incredibly fresh, sweet, lightly seasoned, and served in a tortilla with perfect shredded cabbage and mango salsa. It was scrumptious, flavorful, and unlike an ordinary burrito.\n\nShredded cabbage? Yes, a vegetable I usually avoid. Tacobar uses it as an incredibly crisp accompaniment inside the burro, which added texture, crunch, and balance to the lightly seasoned shrimp and spicy mango salsa.\n\nHibiscus Iced Tea was the perfect beverage. I plan on eating here every time I'm in the neighborhood. Ok, the competition in this neighborhood for delicious, healthy, and affordable food is intense. Between Woodhouse, La Meditteranee, Troya, Jane, and La Boulange, TacoBar is probably the least expensive, offers the most flavorful, and quickest meals.", "rating": 4, "date": "2011-01-26"}, {"excerpts": ["They should think about having rice instead of slaw and just dressing it with a nice mango salsa.  ", "It would hold up better.  ", "I like the people that run this place--they always make you feel like you are a very welcome customer and the service is awesome.  ", "A tad on the pricey side, but I'm sure the cost of commercial leases on Fillmore force the prices up for the merchants."], "author": "Eve C.", "review": "I've had the enselada avocado cesar and the burro camarones.  I really enjoy the salad, which has a generous amount of well-seasoned chicken, crispy lettuce and ripe avocado.  It's really good with a couple of generous splashes of the salsa verde.  The burro camarones, while it was yummy, had a lot of liquid in it and therefore it wasn't really possible to eat the last 1/5 or so of the burro because it simply falls apart into a heap of shredded cabbage and watery juice.  They should think about having rice instead of slaw and just dressing it with a nice mango salsa.  It would hold up better.  I like the people that run this place--they always make you feel like you are a very welcome customer and the service is awesome.  A tad on the pricey side, but I'm sure the cost of commercial leases on Fillmore force the prices up for the merchants.", "rating": 4, "date": "2011-11-08"}], "totopos": [{"excerpts": ["I went with the Avocado Ensalada Cesar (Romaine, w/Avocado dressing, Cotija Cheese, Cilantro & Totopos Croutons). ", "You can add chicken, steak or shrimp for a fee. ", "I was pretty happy with the flavors and the price (less than $10) ", "was perfect for the portion size. \n", "*", "The bf went with 3 tacos - 2 steak and 1 brisket (which was on special and came with horseradish cream sauce). ", "He loved the flavors, but felt that they were a tad pricey for what they were. ", "He added guac to the tacos ad they ended up being around $5/each. \n", "*", "Corn tortillas - just eh, which upset me because I was hoping they would have some killer tortillas. ", "Oh well. \n", "*", "Lime Margarita - just ok. "], "author": "Dru M.", "review": "Walking through the neighborhood, searching for the lucky establishment where we would dine for the evening and in the distance...the bf and I see TacoBar. SOLD! \n\nThis is how it goes. Check over the menu...order at the register, then BAM (minutes later you have your food. Crazy fast! There are several tables inside, as well as a table bistro table and a few 2 tops outside. \n\nService was solid. From the moment we walked through the door...everyone was very friendly and again the food came out very fast. \n\nWhat we ordered...\n*Guacamole - smooth and delicious. Chips are thick and very good. They will sprinkle Cotija cheese on them too if you would like. \n*I went with the Avocado Ensalada Cesar (Romaine, w/Avocado dressing, Cotija Cheese, Cilantro & Totopos Croutons). You can add chicken, steak or shrimp for a fee. I was pretty happy with the flavors and the price (less than $10) was perfect for the portion size. \n*The bf went with 3 tacos - 2 steak and 1 brisket (which was on special and came with horseradish cream sauce). He loved the flavors, but felt that they were a tad pricey for what they were. He added guac to the tacos ad they ended up being around $5/each. \n*Corn tortillas - just eh, which upset me because I was hoping they would have some killer tortillas. Oh well. \n*Lime Margarita - just ok. A bit strong on the lime and not so much on the tequila. \n\nOverall...tasty food, great service and a fun atmosphere. I highly suggest you give them a try!", "rating": 3, "date": "2012-01-08"}, {"excerpts": ["Also bought the totopos (chips) and salsa. ", "The big theme here is BLAND but the other is EXPENSIVE. ", "How do they manage to make wonderful Mexican food made with organic ingredients taste so flavorless? "], "author": "G O.", "review": "Everything I felt about this place has already been written, but I want to lower this place's ratings so I can save others from spending an exorbitant amount on a crappy Mexican lunch.\n\nI had the vegetarian taco and my boyfriend had the veracruz pescado burro. Also bought the totopos (chips) and salsa. The big theme here is BLAND but the other is EXPENSIVE. How do they manage to make wonderful Mexican food made with organic ingredients taste so flavorless? Also, no free chips - paid $2.95 for a small bowl of chips and tasteless pico de gallo. In all, paid $22 for a tiny lunch for two people that I would have paid probably less than $10 for at Pancho Villa in the Mission and it would have tasted way better. \n\nOn top of that, when we finally snagged a table outside, it was filled with someone else's dirty dishes with no bussing service in sight. I ended up bussing the table myself to someone inside - two trips - but at least the hostess/waitress thanked me cheerfully both times. \n\nBottom line: at $5 for a bland taco, save your money and pray for the return of La Salsa.", "rating": 1, "date": "2010-04-17"}], "cheese queso": [], "crema": [{"excerpts": ["The corn comes on the cob or in a cup and is served with crema fresca. \n\n"], "author": "Stephanie T.", "review": "Taco Bar is right down the street from my house and has become my go-to dinner option when I do not feel like cooking.\n\nI usually order the jicama salad and a side of corn on the cob.\n\nThe salad comes with jicama, grapefruit, roasted peanuts, and avocado. It is really light and makes for a refreshing meal.\n\nThe corn comes on the cob or in a cup and is served with crema fresca. \n\nI have also tried their carnitas nachos and quesadillas. They are both good, a little pricey, and I would suggest eating these items at the restaurant as they do not travel well.", "rating": 4, "date": "2011-09-13"}, {"excerpts": ["When my boyfriend and I ordered, we got 2 carnitas tacos, a carne asada quesadilla with the extra crema fresca and guacamole, and chips and salsa. ", "A lot of people on here complained about the price of chips, but for the quality of chip and salsa, they were amazing. ", "However, the guy in front of me got his salsa and some cheese heaped on the chips, and I got a relatively small pot of salsa. ", "I had to ask why mine were different than his, and they said \"", "oh you have to ask for that\" which I didn't understand ", "(how would I know that?) ", "and then I had to ask for the cheese. "], "author": "Elizabeth T.", "review": "I really wanted to be a fan of this place - when I saw it being built, I was ecstatic. This morning, when I checked the reviews, I chalked the low ratings up to \"lower pac height snobs\" who were expecting too much out of a taco place. Unfortunately, I have either become one of those folks, or, as I suspect, this place isn't marketing itself well.\n\nTacoBar makes you think it will be a down-to-earth taco place, however, it's actually a pseudo-gourmet take on Mexican food. That alone doesn't give it the low rating, though - it's the price mixed with the attitudes mixed with the poor explanations of what you are getting.\n\nWhen my boyfriend and I ordered, we got 2 carnitas tacos, a carne asada quesadilla with the extra crema fresca and guacamole, and chips and salsa. A lot of people on here complained about the price of chips, but for the quality of chip and salsa, they were amazing. However, the guy in front of me got his salsa and some cheese heaped on the chips, and I got a relatively small pot of salsa. I had to ask why mine were different than his, and they said \"oh you have to ask for that\" which I didn't understand (how would I know that?) and then I had to ask for the cheese. I thought the guac came with the chips, but that was my mistake, and I was fine with that.\n\nWe sat outside (not a ton of seating, but it's a nice place inside) and besides the really annoying guy's barking dog (people, don't go to a restaurant and tie your dog up. You are a jerk when you do this) it was really nice. I was annoyed that when I tried to use a squeeze bottle for the salsa, the top wasn't screwed on and it all poured out everywhere, but again, small thing. \n\nMy biggest disappointment was the main course. My boyfriend had tacos, which he said were fine - the pork was a little bland and a little dry. However, my \"quesadilla\" was not a quesadilla. At first we thought I got a burrito in some flakey kind of flatbread. I inquired as to where my sour cream and guac were (every quesadilla I've ever gotten has the pico de gallo, sour cream, and guac on the side and that's why I love them) and the woman went back in to get them. She didn't return - instead a guy who I believe was the owner came. He showed me my receipt and told me I never ordered guacamole, and I said \"I got this with the special extra\" and he said \"that's not the same as guacamole. You have to pay a lot of money for that.\" \n\nI thought that was a really weird and rude thing to say, so I told him he should explain his menu better and he pointed at my food and said \"I can see guacamole in there.\" Then he left.\n\nThere was, indeed, something resembling a little guacamole inside my not-quesadilla, but it was such a pathetic amount that I will say that no one should get the extra - for two bucks a glop of sour cream and a tiny green coloring of guacamole isn't worth it. Avocado isn't gold, people. \n\nOverall, however, I didn't like the quesadilla. The tortilla wasn't a tortilla, it was shaped like a burrito and difficult to eat, and overall this take on fusion wasn't what I was expecting nor what I would have ordered had I know. Couple that with the rude owner and the lack of explanations, I'm never going back to this place. \n\nIf you guys can get your attitudes in order and figure out a good system for selling things that doesn't leave people confused and feeling ripped off, I'll come back. I have no qualms paying $25 like I did today for the meal I had - I just don't want to feel verbally assaulted by the owner because I asked where my sides were. Food isn't a fine art. It's food.", "rating": 2, "date": "2010-04-24"}, {"excerpts": ["The nachos had a good mix of chips, cheese, beans, crema, and avocado so that it wasn't greasy or too dry.  ", "The service was really great and very attentive.  ", "Looking forward to coming back here again."], "author": "Julie P.", "review": "Came here looking for a new place to dine on Fillmore for a light lunch.  TacoBar, you hit the spot!  I got the nachos, and my husband got the fish tacos.  Both were really delicious and flavorful. And for someone who hates onions and cilantro, I like that you don't bury the fish underneath all that for your fish tacos.  The nachos had a good mix of chips, cheese, beans, crema, and avocado so that it wasn't greasy or too dry.  The service was really great and very attentive.  Looking forward to coming back here again.", "rating": 4, "date": "2012-07-29"}, {"excerpts": ["NOT Especial at all) was a hot mess of bland, not crispy or fresh tasting fish, topped off with some more bland guacamole and crema. ", "It was not easy to eat, nor good to eat. ", "YUCK. ", "And PLEASE tell me how you can possibly justify charging $1.95 to add a teaspoon of guac, a teaspoon of crema, and crap plastic cheese to my already overpriced taco?! "], "author": "Abby Z.", "review": "\"How is everything?\" asked the woman walking around who appeared to be the owner...\n\nI wanted to tell her it was the worst meal I've paid for in months, and that I was disappointed that they could not have figured out how to sneak a peak of flavor into my bland dinner. Instead, I shrugged and said, \"this cheese, its a bit...rubbery.\" To which she replied it was meant to be a cheese crisp. This is the cheese crisp I had paid $1.95 to have added to my fish taco that they had sandwiched between my two tortillas. Well, someone ought to educate the owner on what happens when you fry cheese. The oil comes out, the flavor leaves with it, and you are left with rubbery cheese that is neither palatable nor very digestible. A good garnish, yes, but give me some cotija, not this crappy cheese disc thing. The part that gets me the the most, though, is that if you are going to walk around asking your (clearly disappointed) patrons how their (clearly bland) meal is, then listen to them!! Don't you realize you are in the first few months of being open and that your diners may have some real feedback to help you improve and make me actually want to come back?! Listen to your paying customers, your neighbors, and your potential future return patrons.\n\nAlex D. had the carnitas taco. He left at least 2/3 of it behind. His poor little tasteless, all-filler-no-killer, bland bean and tasteless salsa mess, was so bad he didn't want to waste precious tummy space on it.\n\nMy fish taco which I made Especial (read: NOT Especial at all) was a hot mess of bland, not crispy or fresh tasting fish, topped off with some more bland guacamole and crema. It was not easy to eat, nor good to eat. YUCK. And PLEASE tell me how you can possibly justify charging $1.95 to add a teaspoon of guac, a teaspoon of crema, and crap plastic cheese to my already overpriced taco?! I'm not a cheap person, and I'll be the first to pay for quality, but this my friends was not quality at all.\n\nThe Jicama salad was a poor excuse for a salad. It was literally huge discs of jicama, combined with unrecognizable mashed tasteless grapefruit, cilantro, and peanuts - it was impossible to eat. At least julienne cut the freakin' jicama so your diner can eat your bad tasteless salad!\n\nI just returned from Puerto Vallarta where I had amazing food, with tons of flavor. Maybe my taste buds are spoiled, but I think even someone who dines at Denny's would think TacoBar has forgotten their flavor in their food.\n\nI've read that the owner here used to work with the guys from Nick's Crispy tacos. Save yourself from this mess of a taco shop and go to Nick's. I don't love that place either, but at least your won't feel ripped off by some bitchy owner at this new Pac Heights establishment and you can use your leftover cash to catch a cab to the Mission for some real flavor.\n\nNever again.", "rating": 1, "date": "2010-05-16"}], "house pickled jalapenos": [], "coconut flan": [{"excerpts": ["Pollo Burrito, Carne Asada Tacos & Coconut Flan\nDevour:  Shrimp Taco & Grilled Shrimp\n", "Total:  $32.41"], "author": "Genevieve Y.", "review": "Date & Time:  Wednesday April 14, 2010 @ 1pm \nDining Companions:  Dana & Janie\nScene:  Well-Heeled Pairs of Young Ladies in Elizabeth Charles Dresses  & Guys in Blazers, Thomas Pink Shirts, Jeans & Loafers\nVibe:  Chill\nDecor:  Bright & Cheery.  Edison Lighting.  Mosaic Patterned Walls.  Communal Table, Cushioned Bench, Counter-Seating & Dining Al Fresco\nService:  Very, Very Nice & Humble\nImbibe:  Jamaica Agua Fresca.  Mango & Horchata Agua Fresca, Magarita & Sangrias Available\nMediocre: Pollo Burrito, Carne Asada Tacos & Coconut Flan\nDevour:  Shrimp Taco & Grilled Shrimp\nTotal:  $32.41", "rating": 3, "date": "2010-04-14"}, {"excerpts": ["He was very friendly and recommended the coconut flan. ", "It was as good as he said it would be. "], "author": "Ralph I.", "review": "I visited this restaurant on 19 June 2012 while on vacation in San Francisco.\n\nAfter reading other reviewers of Taco Bar, I have to wonder if we ate at the same restaurant.\n\nOverall, the food is very good. I had two of the pulled pork tacos, which were a special the day I was there. The tacos were on your standard size corn tortilla, like you would find in any local supermarket. Another reviewer mentioned that the tortillas were three inches, mine clearly were not. The pork, which was topped by a small amount of citrus marinated onions,  was tender, tasty, plentiful and clearly of excellent quality. It was not something that you would see in a cheaper taco and wonder what part of the pig it came from. Each taco was $3.25, and in my opinion worth it. After I was finished eating a a man that I think was the chef came to my table. He was very friendly and recommended the coconut flan. It was as good as he said it would be. It was a denser flan, not jello-like in consistency, and very good. \n\nOther reviewers mentioned the small portions that one gets at the Taco Bar. After scoping out what the other patrons were eating and seeing the size of my tacos and flan, I have to wonder again if we were eating at the same restaurant.\n\nAnother reviewer mentioned that this place is \"deceptive\". I didn't find it so, but if you are doubtful about this place just check out a menu and look around at what others are eating. When I was there the place was very crowded and busy, a deceptive place wouldn't have such a crowd I would think.\n\nAs for the price, I believe it was fair, given the quality of the food and the quick and friendly service. \n\nI found the food at Taco Bar food to be authentic. I come from Los Angeles and have a good idea as to what good Mexican food is thanks to my Mexican friends, colleagues and students. \n\nThis place is worth your time and cash, check it out, you won't be sorry.", "rating": 4, "date": "2012-06-23"}, {"excerpts": ["Horchata was good, coconut flan with crispy coconut flakes was excellent. ", "Fast, friendly service. "], "author": "Kelly T.", "review": "Pescado tacos were awesome. The Baja's fried with cabbage slaw and chile lime sauce and the Veracruz was grilled. Good fresh fish. The tacos come with two squeeze bottles full of red and green salsa, both flavorful and the verde with a bit of kick. \n\nHorchata was good, coconut flan with crispy coconut flakes was excellent. Fast, friendly service. Not cheap, but at just under $4 per pescado taco, pretty decent.\n\nWe just happened in here as we were walking down Fillmore, but it's good enough I'd hop off my bus ride home for a quick dinner.", "rating": 4, "date": "2013-12-23"}, {"excerpts": ["Waited 20 minutes just to get a Coconut Flan to go. ", "Over priced Mexican food if you want REAL Mexican food thats worth it for the price go to El Farolito on Mission street"], "author": "Lennie G.", "review": "Waited 20 minutes just to get a Coconut Flan to go. Over priced Mexican food if you want REAL Mexican food thats worth it for the price go to El Farolito on Mission street", "rating": 1, "date": "2015-06-11"}, {"excerpts": ["I ruin my calorie count by ordering the coconut flan. \n\n"], "author": "Mariela D.", "review": "When I met TacoBar's \"burros\", the healthier no-rice version of the burrito, I thought: \"Finally. a burrito I am free to love without shame.\" It's the burrito I am not embarrassed to Instagram about. Because it's filled with plump, juicy prawns, cabbage slaw, roasted ancho salsa, & jicama/mango salsa.\n\nBUT THEN...I ruin my calorie count by ordering the coconut flan. \n\nBut in my defense: \nOh my GOD. If you tasted it, you would understand. I have \"moments\" with this flan. MOMENTS, I tell you.\n\nLike...excuse me, but me and my flan need to be alone right now. Please go away. /shutsdoor\n\nBut it all balances out, because the rest of the menu is healthy and light. Burros come with carne asada, chicken, Mahi Mahi (tempura beer battered or grilled), or prawns.\n\nThey also serve sangrias and margaritas if you want to get happy hour started early....like at noon. Not that I do that, ever. \n\nI've been back three times in the past month so I think this is a sign of a pretty good relationship. If only I could stop whoring around with that flan. \n/probablynotgonnahappen", "rating": 4, "date": "2012-08-08"}, {"excerpts": ["I did have a coconut flan which was just okay. "], "author": "T L.", "review": "(See pics)\n\nWell, I don't know about the tacos other than watching my friend having it. I did have a coconut flan which was just okay. For some reasons Fillmore cafes tend to be crayon colourful.\n\nThe nachos had the salsa on top of them, which we found a bit unusual as the chips got soggy a bit quickly before we can finish the whole basket.", "rating": 3, "date": "2011-01-29"}, {"excerpts": ["Oh, and did I mention the dessert menu includes coconut flan and tequila ice cream? ", "Yes, please!"], "author": "Alice W.", "review": "Move over Nick's Crispy Tacos and Tacolicious... there is new kid on the block! \n\nTaco Bar, located in the former La Salsa space on the corner of Fillmore and California, is brought to you by a Nick's Crispy Tacos alum, who sought to bring a slice of Mexican deliciousness to Pac Heights. \n\nUnfortunately, the food is just okay (burritos, quesadillas, tacos), and at $5 per taco, the prices are a bit steep. My lunch of 2 tacos and a drink was $14. The batter on the fish in my fish taco was thick and slightly undercooked and the carne asada taco was bland. I am hopeful that because today is opening day, the kinks will be worked out in time. Taco Bar does get bonus points for its commitment to use local organic ingredients whenever possible, such as line caught fresh fish, free range chicken and all natural Angus beef and pork.\n\nOh, and did I mention the dessert menu includes coconut flan and tequila ice cream? Yes, please!", "rating": 3, "date": "2010-04-14"}, {"excerpts": ["The coconut flan is pretty interesting.. not something i am really craving for, but nice to try once in a while... 4 stars for that too."], "author": "Aditya M.", "review": "Not bad at all.. not in my list of top mexican places, but a pretty solid and consistent place for burritos.\nThe veggie burrito is pretty good, and really big and filling. They don't seem to give free chips with it, and don't seem to have a salsa bar either.. so a star off for that.\nThe coconut flan is pretty interesting.. not something i am really craving for, but nice to try once in a while... 4 stars for that too.", "rating": 4, "date": "2011-07-18"}], "mexican rice pudding": [{"excerpts": ["The Mexican Rice Pudding was also very tasty, with chopped Mango on top. ", "This was my second time eating the food from TacoBar. ", "Again, I highly reccommend this place for authentic Mexican cuisine, you will not regret it. ", "Also, the service was outstanding, the girl that took the order on the phone, and the waiter who helped bag it, just overall *", "**** (five stars)!!!!!"], "author": "Vince F.", "review": "I ordered take-out last thursday night from TacoBar. I don't think I've ever tasted a more delicious taco than the two I ordered, one was a \"Veracruz Pescado\" with grilled Mahi-Mahi, and the other was \"Baja Pescado\" with Tempura beer battered Mahi-Mahi. Both were awesome, but I must say the \"Baja\" was OUTSTANDING!!!!!! My friend ordered the Carne Asada Quesadilla, and was very pleased. I couldn't believe how much beef was in it, and it was delicious. The Mexican Rice Pudding was also very tasty, with chopped Mango on top. This was my second time eating the food from TacoBar. Again, I highly reccommend this place for authentic Mexican cuisine, you will not regret it. Also, the service was outstanding, the girl that took the order on the phone, and the waiter who helped bag it, just overall ***** (five stars)!!!!!", "rating": 5, "date": "2012-01-29"}], "soda mexicana": [], "bottled root beer": [], "fresh lime agave margarita": [{"excerpts": ["I had the Fresh Lime Agave Margarita for starters followed by the grilled    \n                mahi mahi & shrimp tacos. "], "author": "Teena Marie T.", "review": "WHO... me + 1 \n\nWHAT... Baja/Fresh Mex meets contemporary design... great flavors & spices. Was \n               def. on my list of spots to try, but not sure if I had a craving for Mexican ... if \n               this spot would pop into my mind first.\n\n               I had the Fresh Lime Agave Margarita for starters followed by the grilled    \n                mahi mahi & shrimp tacos. Margarita was just alright... and my fav of the two \n                tacos was the shrimp. \n\nWHEN... Thursday afternoon - not too long of a wait.\n\nWHERE...Limited seating, counter seating, outside seating  & communal tables. After \n                  waiting for a spot to open up, sat at the counter.", "rating": 3, "date": "2012-01-24"}], "fresh lime agave pomegranate margarita": [], "citrus red wine sangria": []}