{"ceviche mixto": [], "chicken pozole verde": [], "roasted beets and citrus": [], "mf chicken tacos": [], "fried plantains": [{"excerpts": ["The fried plantains were my fave. ", "And my husband had had all the tacos. ", "He likes the brisket and chicken the best! \n", "If you're in the area I'd recommend it."], "author": "Angela C.", "review": "Solid place. My husband and I have been here twice now and both times have been good. \nDefinitely not authentic, but I don't think anyone comes here for authenticity. \nOverall a good vibe. A little pricey but what isn't now? And solid food. The fried plantains were my fave. And my husband had had all the tacos. He likes the brisket and chicken the best! \nIf you're in the area I'd recommend it.", "rating": 3, "date": "2016-11-16"}], "caesar picante": [], "butternut squash and kale": [], "shotandabeer braised chicken": [], "fried avocado": [{"excerpts": ["The fried avocado taco does not make it ok for them to get rid of the chorizo potato taco.  ", "Just so you know.  "], "author": "Jessica F.", "review": "Yikes!  I used to really like Tacolicious but am bummed about some of the menu changes.  Bring back the chorizo potato taco PLEASE!  The fried avocado taco does not make it ok for them to get rid of the chorizo potato taco.  Just so you know.  We ordered 12 tacos and when I lifted one off the plate we were all grossed out with the pool of oil underneath.  \n\nMy friends spent quite a bit of time here yesterday, but we were constantly ordering and super low maintenance, but we overheard the servers talking crap about us because they felt like we were there for too long.  So um, that's awkward.  Not coming back!", "rating": 1, "date": "2018-05-06"}, {"excerpts": ["I like fried avocado tacos. ", "When you first come they give you chips and salsa ", "like everywhere , it's free and fresh. ", "I was really excited to go and try their \"pictures \" tacos  ", "but it's disappointing. ", "Good luck to you..."], "author": "İrem S.", "review": "I'm giving 2 because chicken tacos and Guatemole was good. Other wise I didn't like at all. I walk in there and before I go I put myself to list from yelp. Nobody welcome me , I was standing up 20 mins waiting for table. I don't  like steak taco at all almost make me choke two times. I asked the server guy if he can change it for me he said he can't do that. I didn't like the service , taste etc. Ambiance was nice. They have a veggie options which is good. I like fried avocado tacos. When you first come they give you chips and salsa like everywhere , it's free and fresh. I was really excited to go and try their \"pictures \" tacos  but it's disappointing. Good luck to you...", "rating": 2, "date": "2018-08-08"}, {"excerpts": ["Such an amazing find, great food, if you're vegetarian the fried avocado tacos are amazing! ", "Definitely coming back :)"], "author": "Shannon S.", "review": "Such an amazing find, great food, if you're vegetarian the fried avocado tacos are amazing! Definitely coming back :)", "rating": 5, "date": "2018-03-31"}], "mf chicken north beach exclusive": [], "skirt steak carne asada": [], "taco especial de alambre": [], "brussel sprouts a la plancha": [], "cauliflower al pastor": [], "traditional churros con chocolate": [], "chocotacolicious": []}