{"soft drink": [], "spring rolls": [{"excerpts": ["We ordered Hot & Sour soup, 2 orders of potstickers, general chicken, and spring rolls.\n\n", "And last but not least, the spring rolls were out of this world! "], "author": "Isabella K.", "review": "Me and my family visited this location earlier today. We ordered Hot & Sour soup, 2 orders of potstickers, general chicken, and spring rolls.\n\nThe Hot & Sour soup was excellent! It came out fast and was delicious.\n\nThe potstickers are outstanding. Every single time we visit SF we get these potstickers. They're so good! It came out last though.\n\nThe general chicken was the best I've ever had. Perfect amount of flavor.\n\nAnd last but not least, the spring rolls were out of this world! The best we've ever had! \n\nService is amazing!", "rating": 5, "date": "2015-05-02"}, {"excerpts": ["Everything we ordered from the spring rolls to the curry tofu w/rice to the braised beef ligament noodles tasted great.  ", "I really enjoyed mixing the sweet sauce with the onion pancakes, it was awesome.  ", "And pretty impressive veggie selection"], "author": "Swetha G.", "review": "Ginormous food portions!  One entree, and it's usually less than $7, can easily feed two!  \n\nEverything we ordered from the spring rolls to the curry tofu w/rice to the braised beef ligament noodles tasted great.  I really enjoyed mixing the sweet sauce with the onion pancakes, it was awesome.  And pretty impressive veggie selection, I saw plenty of things that I wanted to try.  \n\nGreat service, UBER cheap prices, lots of tasty and good and filling food.  I think Taiwan Restaurant's a bargain, definately get a bang for your buck.", "rating": 4, "date": "2008-07-13"}, {"excerpts": ["We ate the pork buns, fresh steamed vegetables, \"spring rolls\", lemon chicken, and a few other dishes. ", "I thought the pork buns were delicious, but I was unimpressed with the \"spring rolls\". ", "I was expecting uncooked and NOT deep fried. ", "Basically, what came out were some egg rolls. ", "Im typically pretty health conscious, so I stayed away from those. ", "I thought the vegetables were cooked well and the lemon chicken was tasty, although I did not feel like anything was worth writing home about. ", "I may eat there again someday."], "author": "Joelle B.", "review": "I recently ate here with a couple of my friends and I was pleased by how CLEAN the place appeared. I was seated quickly and the staff was pretty friendly. We ate the pork buns, fresh steamed vegetables, \"spring rolls\", lemon chicken, and a few other dishes. I thought the pork buns were delicious, but I was unimpressed with the \"spring rolls\". I was expecting uncooked and NOT deep fried. Basically, what came out were some egg rolls. Im typically pretty health conscious, so I stayed away from those. I thought the vegetables were cooked well and the lemon chicken was tasty, although I did not feel like anything was worth writing home about. I may eat there again someday.", "rating": 3, "date": "2008-09-18"}, {"excerpts": ["won ton soup -- good\nmu shi pork --- terrible\nsteamed dumplings (beef) -- ok\nfried spring rolls -- ok\n\nservice -- good\n\nwe didn't eat all of the food and refused to take it home -- bad sign."], "author": "M F.", "review": "won ton soup -- good\nmu shi pork --- terrible\nsteamed dumplings (beef) -- ok\nfried spring rolls -- ok\n\nservice -- good\n\nwe didn't eat all of the food and refused to take it home -- bad sign.", "rating": 2, "date": "2008-02-16"}], "piece fried wonton": [], "fried spareribs": [{"excerpts": ["There are a few commendable dishes...like the soy bean milk & chinese donut, fried spareribs, the \"three-cup\" chicken and some of the other noodle soups. \n\n"], "author": "Jeremy F.", "review": "Everything was a bit too doughy for my taste...the \"cow-tongue\" crispy bread, the Shanghai thick noodles (which was a hybrid of flat noodles...strange), green onion pancake, and the skin of the xiao long bao (steamed dumplings) & potstickers. just everything...doughy! If it wasn't for the tea or the soy bean milk, i'd probably have a hard time stuffing all that food down my throat.\n\nThere are a few commendable dishes...like the soy bean milk & chinese donut, fried spareribs, the \"three-cup\" chicken and some of the other noodle soups. \n\nI come here sometimes when I'm craving taiwanese food and don't want to go far. The prices are reasonable for what it is. On weekends, you might have to wait a bit before getting seated.", "rating": 2, "date": "2008-12-19"}], "spice beef cold": [], "shredded jelly fish with cucumber": [], "assorted cold plate": [], "piece deep fried prawns": [{"excerpts": ["this tasted as expected it should.\n- 8 PIECE DEEP FRIED PRAWNS: tasty and would order again.\n- DRY BRAISED GREEN BEANS: ", "this was listed under their vegetarian options, it was not!! ", "There was ground beef in the dish.\n"], "author": "Hello E.", "review": "Overall, not satisfied and would not return. Below are dish I ordered.\n\n- HOT & SOUR SOUP: this tasted as expected it should.\n- 8 PIECE DEEP FRIED PRAWNS: tasty and would order again.\n- DRY BRAISED GREEN BEANS: this was listed under their vegetarian options, it was not!! There was ground beef in the dish.\n- BLACK BEAN SAUCE SQUIDS: could not taste the black bean sauce. dish was tasteless. would not order again.\n- CURRY TOFU: was very bland and tasteless. would not order again.", "rating": 2, "date": "2017-09-04"}], "hot and sour soup": [{"excerpts": ["We also got the hot and sour soup -- good for when you're sick, and the usual General Tso's chicken. ", "The chicken is good when you're hungry because they give you a lot for cheap."], "author": "Natascha E.", "review": "My new favorite Taiwanese breakfast and lunch spot. The owners/workers here so nice it feels homey.\n\nThey have the fried donut and soy milk which gives me nostalgia when I was in Taiwan and I had those for breakfast. \n\nWe also got the hot and sour soup -- good for when you're sick, and the usual General Tso's chicken. The chicken is good when you're hungry because they give you a lot for cheap.", "rating": 4, "date": "2018-11-03"}, {"excerpts": ["Hot and sour soup was salty and not sour or spicy. ", "The vegetarian dumplings had very thick floury skin and we ended up having to scrap the veggies out. "], "author": "Jannies L.", "review": "Owners or chef has changed. Their Chinese donuts which used to be worth a trip over from mission is thick and too doughy now. Hot and sour soup was salty and not sour or spicy. The vegetarian dumplings had very thick floury skin and we ended up having to scrap the veggies out. The soy milk was sandy and not hot. \n\nI've been to Taiwan and this restaurant before and it's very disappointing. Never again...", "rating": 1, "date": "2014-09-28"}, {"excerpts": ["On my most recent visit, we ordered the Xiao Lin Dumplings and Hot and Sour Soup to start off. ", "Xiao Lin Dumplings are fickle creatures. ", "The chef made them amazingly juicy and tender with the right amount of broth in each morsel. ", "Dipped in red vinegar, it makes you crave for another. ", "The hot and sour soup was standard, nothing special about it. "], "author": "Anna F.", "review": "Taiwan Restaurant may not look like much, but this place has THE BEST dan dan mien, fit to appease the gastronomy gods.\n\nWhat is are these foreign sounding items of deliciousness, you inquire?\n\nDan Dan Mien are noodles topped with a generous heaping of spicy or peanut sauce. The noodles are traditionally freshly pulled thick noodles made in house. The name of the noodles come from the \"dan\" merchants use to peddle the noodles in China. Also, \"dan\" means \"bouncy\" or \"springy\" in Chinese, which perfectly describes the process of how the dan dan mien is made, as well as the texture of the noodles when eaten. But, enough about the history of dan dan mien.\n\nOn my most recent visit, we ordered the Xiao Lin Dumplings and Hot and Sour Soup to start off. Xiao Lin Dumplings are fickle creatures. The chef made them amazingly juicy and tender with the right amount of broth in each morsel. Dipped in red vinegar, it makes you crave for another. The hot and sour soup was standard, nothing special about it. I will give credit because it's not overly sour, which is always a good thing.\n\nOur main course is the dan dan mien. I ordered a garlic peanut sauce one because the classic has always been my favorite since I was a child. My friends ordered the spicy flavored one. We ended up eating the noodles family style, split into smaller bowls. Why? Because the portions of these dan dan mien are HUGE. One bowl can serve 2-3 people. But it's not just quantity, it's also quality also.\n\nThe garlic peanut version had a milder taste, the tones of peanut and garlic meld together with the creamy noodles, it's very rich and filling. The spicy variety is also very buttery, but has a spicy kick to it. It's not Sirarcha-worshiper spicy, just enough to go with the rich creamy texture of dan dan mien.\n\nService here is slow because there's only two waiters, the owner and a hired employee. Atmosphere is very casual and the decor is drab, but that's because they spend their resources on making good food. They tend to the taste buds, not the eyes.\n\nBottom line: Delicious dan dan mien. Try it~", "rating": 4, "date": "2012-07-08"}, {"excerpts": ["- Hot and sour soup.  ", "One of the few places that makes it with chicken instead of pork!\n", "- Ma Po tofu.  ", "One of my comfort dishes, personally satisfying.\n"], "author": "J C.", "review": "Great no frills Chinese (more than Taiwanese) food.  Good comfort food.  Not greasy, no MSG.  Extremely clean tables, everything gets wiped clean.  I've even seen them wiping down the soy sauce and condiment bottles, and menus.  Nice family-run place (fewer of these left here in SF!).  Nice mix of customers, and family-friendly.\n\nI come here regularly to get my fix.  I stick to the basics (e.g., beef and broccoli) and everything has been good so far.  The highlights:\n- Pot stickers are a must.  As everyone has mentioned.  Every table orders it, and you'll see why.\n- Green beans are cooked perfectly.  Not mushy, CRUNCHY!  I usually get green beans with tofu or chicken.\n- Hot and sour soup.  One of the few places that makes it with chicken instead of pork!\n- Ma Po tofu.  One of my comfort dishes, personally satisfying.\n- Brown rice is an option!\n\nThat's really about it.  I haven't ventured into the fringes/exotic parts of the menu, which seems to be where other people's complaints are coming from.  That's really not what I'm looking for in this place anyways (even though I am an American-born Taiwanese).  Just go here and try it out when you're craving some old-school basic Chinese grub.  You won't be disappointed in this local's spot.", "rating": 5, "date": "2014-09-28"}, {"excerpts": ["Along with it I tried their hot and sour soup which was tasty with a lighter color texture than most other restaurants' version.\n\n"], "author": "H K.", "review": "I give this place three stars for their nice service.  It's much better than when I last came here many years ago.\n\nI ordered their shrimp and chives dumpling.  It was okay, the skin was probably thicker than it should have been, thus making it more chewy.  Along with it I tried their hot and sour soup which was tasty with a lighter color texture than most other restaurants' version.\n\nFor actual Taiwanese food fan, there is a section of the menu more dedicated to food items more associated with Taiwan.  I would love to check those out despite my limited knowledge of their cuisine since I'm not a native of Taiwan.  At least the menu looks much better than, say, Taipei Restaurant on Ocean Avenue. One disappointment is that they do not serve fried stinky tofu, one item I definitely I associate with other Taiwanese restaurants that I've visited regularly.", "rating": 3, "date": "2011-11-21"}, {"excerpts": ["pretty pretty good\n\nhard working folks \n\nspinach, dumplings, tofu, hot and sour soup - all pretty pretty good\n\nwould go back\n\nparking is a biatch around there though"], "author": "Bobby B.", "review": "pretty pretty good\n\nhard working folks \n\nspinach, dumplings, tofu, hot and sour soup - all pretty pretty good\n\nwould go back\n\nparking is a biatch around there though", "rating": 3, "date": "2010-03-13"}, {"excerpts": ["we ordered the green onion pancake, siu loong bow, hot and sour soup, and shanghai style chowmein.  ", "everything was very tasty and my tastebuds were having a blast.  "], "author": "Lauren Y.", "review": "i don't come here too often, but the dishes are always good when i do.  the waitress that took our order was very nice.  we ordered the green onion pancake, siu loong bow, hot and sour soup, and shanghai style chowmein.  everything was very tasty and my tastebuds were having a blast.  they also have yummy chinese donut and hot soymilk.\n\nwhat i also like about this place is that you can see some of the guys making the chinese donuts in the front window.  it's fun to watch them if you're waiting for a table.", "rating": 4, "date": "2007-12-03"}, {"excerpts": ["The hot and sour soup is pretty good too."], "author": "Alan N.", "review": "This place hasn't really been the same since the change of ownership about 2 years ago.  But I still love it.  I been coming here since when I was a toddler.  They have the best Chinese donuts, and their potstickers are all homemade in the display window.  You gotta have the General Tsuo's Chicken, Spicy Shrimp, and green onion pancake.  The hot and sour soup is pretty good too.", "rating": 4, "date": "2007-11-15"}, {"excerpts": ["some beef thing ok, and the potstickers, eggrolls, lo mein, hot and sour soup,... ", "but my very favorite was the pork buns. ", "they were stuffed with meat and so filling and tasty. ", "next time if i ever went again id get a full order of just those! ", "good customer service, a guy even came back to check about sesame allergies since we were allergic to peanuts. ", "none of us loved the potstickers actually.  ", "and s was eh on the beef and noodles. ", "but overall a pretty good chinese food place. ", "nothing really special."], "author": "Merredith L.", "review": "i'm not a huge fan of chinese food but my friends and i came here on saturday evening, armed with boba drinks from up the street. s was starved so we got a lot of food. a lot. and it was still only $50 somethng! that was a meal for 4 people plus leftovers. i had the velvet chicken which was pretty tasty. the general chao (sp?) chicken was good too... some beef thing ok, and the potstickers, eggrolls, lo mein, hot and sour soup,... but my very favorite was the pork buns. they were stuffed with meat and so filling and tasty. next time if i ever went again id get a full order of just those! good customer service, a guy even came back to check about sesame allergies since we were allergic to peanuts. none of us loved the potstickers actually.  and s was eh on the beef and noodles. but overall a pretty good chinese food place. nothing really special.", "rating": 3, "date": "2008-04-14"}, {"excerpts": ["also worthy of consideration are the green beans (with minced pork), hot and sour soup, and general's chicken. ", "oh, the szechuan beef is top notch."], "author": "dusty d.", "review": "one of my favorite chinese restaurants in the city--the crispy prawns here are mind blowing. also worthy of consideration are the green beans (with minced pork), hot and sour soup, and general's chicken. oh, the szechuan beef is top notch.", "rating": 4, "date": "2008-03-14"}], "fishermans soup": [], "szechwan pickled soup": [], "seaweed and egg flower soup": [], "spinach and bean curd soup": [], "west lake minced beef soup": [], "wor wonton soup": [], "taiwan pickled cabbage with pork tripe soup": [], "squid in broth with chinese cabbage": [], "petals of pork soup": [], "fish ball soup": [], "taiwan country favorite chicken": [], "taiwan country favorite spareribs": [{"excerpts": ["Taiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\n"], "author": "Mr. D.", "review": "2 Words- Amazing food!!!\n I Recommend  the Dim Sum!!\nTaiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\nFresh Chinese donuts daily, and they are delicious with their fresh sweet soy milk! \n\nWhenever I'm in the area I have to come here because the servers are the best. Especially George, he always makes me laugh. The things we talk about together is just Hilarious.  \n\nSometimes when Im not feeling well won ton soup is the way to go. I honestly recommend this place because service is amazing, food is amazing, perfect atmosphere, and great prices.", "rating": 5, "date": "2015-03-26"}, {"excerpts": ["My favorites here are the dry braised green beans with meat, mustard greens shredded pork noodle soup (omg! such comfort food), Taiwan country favorite spareribs, red snapper filet and the very simple/plain chicken chow mein (they use the thick Shanghai style noodles for this dish).\n\n"], "author": "Everso T.", "review": "I've gone to this restaurant over the past couple decades whenever I'm in the neighborhood. My father likes this place because the food isn't greasy or overly salty. I've always had polite service here but then I've been told I'm not very demanding. Still, I can discern the difference between being neglected and treated rudely from decent service provided by a family-run business (not polished but still taken care of well).\n\nAs with most restaurants, there are a few reliable dishes on the menu and I stick with those when I want a guaranteed good meal. My favorites here are the dry braised green beans with meat, mustard greens shredded pork noodle soup (omg! such comfort food), Taiwan country favorite spareribs, red snapper filet and the very simple/plain chicken chow mein (they use the thick Shanghai style noodles for this dish).\n\nI love the down-homeness of this place. Not fancy or new, but still comfy seating with my one of my favorite soup noodle dishes in town.", "rating": 5, "date": "2014-12-30"}, {"excerpts": ["*TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. ", "fried a little too much, it was a little hard to bite into.  ", "strong taste of basil with it. \n", "*", "*DUMPLINGS -- decent. ", "enough said.\n", "*", "*STEAMED PORK BUNS -- decent. ", "the stuffing inside had a taro texture to it.\n", "*"], "author": "Bernice C.", "review": "The place looks like a typical run-down Chinese restaurant with tacky pink paint color and dim lighting.  I think they tried to make it classy with a dirty sunlight, but i wasn't fooled.  Never go to a restaurant starving, because we ordered a feast for 8.\n\n**HOT SWEET BEAN MILK -- had to add sugar yourself. tasted just like soy milk. nothing impressive.\n**CHINESE STYLE DONUTS [yow teew] -- best i have ever had!!!!!!!! i even ordered one to go. it was light and crispy and not too oily.  The only downside is that the place did not serve congee to eat it with.\n**CHINESE GREEN ONION PANCAKE -- not impressed.  Felt like i could buy a frozen bag of Chinese pancakes and open up a restaurant myself.\n**MONGOLIAN BEEF -- surprisingly, one of the fave dishes out of everything. flavorful and not too spicy.\n**TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. fried a little too much, it was a little hard to bite into.  strong taste of basil with it. \n**DUMPLINGS -- decent. enough said.\n**STEAMED PORK BUNS -- decent. the stuffing inside had a taro texture to it.\n**SHRIMP CHOW FUN -- a dish that can probably be ordered in any chinese restaurant. good but probably not the restaurant's specialty.\n\n\nprobably won't be a repeat customer for anything but the CHINESE STYLE DONUTS.  \n\nand guess what, we ordered so much that it became my thanksgiving dinner.  why do the food gods hate me so?!", "rating": 2, "date": "2010-11-25"}], "pork in red rice wine sauce": [], "fish in red rice wine sauce": [], "chicken in red rice wine sauce": [], "taiwan pickled greens with shredded pork tripe": [], "crispy prawns": [{"excerpts": ["I ordered their Chicken Dumplings, Crispy Prawns (a daily special), Dry Green Beans (a daily special), Green Onion Pancake (not on the menu), Mongolian Beef, Szechuan Hot Sauce Noodles, and Wok-Fried Rice Cakes with Pork and Chinese Cabbage. ", "Food wasn't too salty or, in the case of the Mongolian Beef and Szechuan Hot Sauce Noodles, spicy. ", "With the exception of the overcooked, pasty and bland Wok-Fried Rice Cakes, I would recommend all the dishes, especially the Szechuan Hot Sauce Noodles that is not your usual chow mein but is topped with ", "I think some kind of peanut sauce."], "author": "Cliff W.", "review": "My first time at this establishment and, in particular, eating Taiwanese food was a satisfying experience. The wait staff was friendly, attentive and helpful for a mid-week, early afternoon lunch hour. The vibe and atmosphere of the restaurant was great: it was a calm and quiet setting to enjoy a nice lunch.\n\nI got a sense they take pride in preparing meals for their patrons. For instance, the garlic, onions, and bamboo shoots used in their entrees were finely chopped, unlike other Chinese restaurants, where it's apparent less effort was involved in the preparation. Their food reminded me of home-style cooking, atypical of the oily and greasy Chinese fare one might expect. While food arrived at a nice pace, I didn't feel rushed to finish eating.\n\nI ordered their Chicken Dumplings, Crispy Prawns (a daily special), Dry Green Beans (a daily special), Green Onion Pancake (not on the menu), Mongolian Beef, Szechuan Hot Sauce Noodles, and Wok-Fried Rice Cakes with Pork and Chinese Cabbage. Food wasn't too salty or, in the case of the Mongolian Beef and Szechuan Hot Sauce Noodles, spicy. With the exception of the overcooked, pasty and bland Wok-Fried Rice Cakes, I would recommend all the dishes, especially the Szechuan Hot Sauce Noodles that is not your usual chow mein but is topped with I think some kind of peanut sauce.", "rating": 4, "date": "2011-12-05"}, {"excerpts": ["Pork with mustard greens, crispy prawns, sizzling rice soup, red eggplant and pot stickers are all excellent and can be ordered with no msg and low salt- something which I heartily recommend. \n\n"], "author": "Eric F.", "review": "This is a great family style, relaxed and cheap Chinese restaurant. Pork with mustard greens, crispy prawns, sizzling rice soup, red eggplant and pot stickers are all excellent and can be ordered with no msg and low salt- something which I heartily recommend. \n\nAfter years of great meals here, it's a must stop with guests from out-of-town, especially with kids. \n\nThe only downside is the bathroom, which would not suffer from more frequent cleanings.", "rating": 4, "date": "2006-10-13"}, {"excerpts": ["one of my favorite chinese restaurants in the city--the crispy prawns here are mind blowing. "], "author": "dusty d.", "review": "one of my favorite chinese restaurants in the city--the crispy prawns here are mind blowing. also worthy of consideration are the green beans (with minced pork), hot and sour soup, and general's chicken. oh, the szechuan beef is top notch.", "rating": 4, "date": "2008-03-14"}], "squid with celery": [], "taiwan country favorite": [{"excerpts": ["Taiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\n"], "author": "Mr. D.", "review": "2 Words- Amazing food!!!\n I Recommend  the Dim Sum!!\nTaiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\nFresh Chinese donuts daily, and they are delicious with their fresh sweet soy milk! \n\nWhenever I'm in the area I have to come here because the servers are the best. Especially George, he always makes me laugh. The things we talk about together is just Hilarious.  \n\nSometimes when Im not feeling well won ton soup is the way to go. I honestly recommend this place because service is amazing, food is amazing, perfect atmosphere, and great prices.", "rating": 5, "date": "2015-03-26"}, {"excerpts": ["My favorites here are the dry braised green beans with meat, mustard greens shredded pork noodle soup (omg! such comfort food), Taiwan country favorite spareribs, red snapper filet and the very simple/plain chicken chow mein (they use the thick Shanghai style noodles for this dish).\n\n"], "author": "Everso T.", "review": "I've gone to this restaurant over the past couple decades whenever I'm in the neighborhood. My father likes this place because the food isn't greasy or overly salty. I've always had polite service here but then I've been told I'm not very demanding. Still, I can discern the difference between being neglected and treated rudely from decent service provided by a family-run business (not polished but still taken care of well).\n\nAs with most restaurants, there are a few reliable dishes on the menu and I stick with those when I want a guaranteed good meal. My favorites here are the dry braised green beans with meat, mustard greens shredded pork noodle soup (omg! such comfort food), Taiwan country favorite spareribs, red snapper filet and the very simple/plain chicken chow mein (they use the thick Shanghai style noodles for this dish).\n\nI love the down-homeness of this place. Not fancy or new, but still comfy seating with my one of my favorite soup noodle dishes in town.", "rating": 5, "date": "2014-12-30"}, {"excerpts": ["never found a place that does the Taiwan country favorite ribs like this place. ", "yummy squared! ", "the deep fried doughy thingies (ngow lay so) that they fry up in the front display kitchen are slightly sweet and tasty as well. ", "funniest thing about this Taiwan restaurant is all the Cantonese spoken here by staff and customers alike. ", "i guess I need to go to the South Bay to hear Mandarin spoken in a Chinese restaurant!"], "author": "Jeff W.", "review": "never found a place that does the Taiwan country favorite ribs like this place. yummy squared! the deep fried doughy thingies (ngow lay so) that they fry up in the front display kitchen are slightly sweet and tasty as well. funniest thing about this Taiwan restaurant is all the Cantonese spoken here by staff and customers alike. i guess I need to go to the South Bay to hear Mandarin spoken in a Chinese restaurant!", "rating": 4, "date": "2006-05-20"}, {"excerpts": ["*TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. ", "fried a little too much, it was a little hard to bite into.  ", "strong taste of basil with it. \n", "*", "*DUMPLINGS -- decent. ", "enough said.\n", "*", "*STEAMED PORK BUNS -- decent. ", "the stuffing inside had a taro texture to it.\n", "*"], "author": "Bernice C.", "review": "The place looks like a typical run-down Chinese restaurant with tacky pink paint color and dim lighting.  I think they tried to make it classy with a dirty sunlight, but i wasn't fooled.  Never go to a restaurant starving, because we ordered a feast for 8.\n\n**HOT SWEET BEAN MILK -- had to add sugar yourself. tasted just like soy milk. nothing impressive.\n**CHINESE STYLE DONUTS [yow teew] -- best i have ever had!!!!!!!! i even ordered one to go. it was light and crispy and not too oily.  The only downside is that the place did not serve congee to eat it with.\n**CHINESE GREEN ONION PANCAKE -- not impressed.  Felt like i could buy a frozen bag of Chinese pancakes and open up a restaurant myself.\n**MONGOLIAN BEEF -- surprisingly, one of the fave dishes out of everything. flavorful and not too spicy.\n**TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. fried a little too much, it was a little hard to bite into.  strong taste of basil with it. \n**DUMPLINGS -- decent. enough said.\n**STEAMED PORK BUNS -- decent. the stuffing inside had a taro texture to it.\n**SHRIMP CHOW FUN -- a dish that can probably be ordered in any chinese restaurant. good but probably not the restaurant's specialty.\n\n\nprobably won't be a repeat customer for anything but the CHINESE STYLE DONUTS.  \n\nand guess what, we ordered so much that it became my thanksgiving dinner.  why do the food gods hate me so?!", "rating": 2, "date": "2010-11-25"}], "spice beef crepes": [], "white turnip cakes": [{"excerpts": ["We split the white turnip cakes, mandarin tofu, and fresh vegetable chow fun for lunch. ", "Enormous portions. "], "author": "Tyjen C.", "review": "Delicious! We split the white turnip cakes, mandarin tofu, and fresh vegetable chow fun for lunch. Enormous portions. All for twenty bucks! \n\n*edit: it was our first visit and we found the restaurant from Yelp. Didn't disappoint!", "rating": 5, "date": "2016-12-19"}, {"excerpts": ["Their shredded white turnip cakes (4 per order) were huge, the size of a red bean bun and stuffed with turnip, ground pork and mushrooms.  ", "The shell was thin and flaky on top and thicker on the bottom.  "], "author": "Lolia S.", "review": "This is another old family favorite that I've been going to for years for the Northern Chinese dim sum brunch (noodles and dumplings galore).  I don't know what their regular dishes are like.  They also have a Taiwan specialties section of the menu that looks interesting, but we always have the dim sum.  They now have pork blood casserole - yum.  \n\nTheir menu claims that they were the first restaurant in the US to serve Taiwanese food.  I don't know if that's true but they have been around for decades.  I do like walking by and watching them make fried Chinese donuts in the window.  There aren't many places where you can see that and their donuts are always fresh.  \n\nFor brunch we usually get soy milk (salted or sweet, $1.25).  It's served hot in a bowl.  Delicious.  My father says their donuts aren't as airy and light inside as they should be but I think he's comparing it to what he had in Taiwan.  \n\nTheir shredded white turnip cakes (4 per order) were huge, the size of a red bean bun and stuffed with turnip, ground pork and mushrooms.  The shell was thin and flaky on top and thicker on the bottom.  These were really good.  \n\nThe hot boiled dumplings had a tasty pork filling but there wasn't enough filling and there was too much dough.  Also the soy sauce it was tossed in made the dumplings too salty.  I noticed you can ask for low salt - we should remember to do that though I'd rather get other dumplings (these were like won tons) with less skin.  The Shanghai thick noodle was disappointing - oily and bland.  \n\nThey are trying - they will make dishes w/o msg, with less salt or hot & spicy upon request and they even have brown rice now.  The food comes out very quickly, the décor is very pink but no frills, and the prices are reasonable.", "rating": 3, "date": "2008-08-08"}], "fried rice noodles with shredded pork": [], "south taiwan style soup noodles": [], "petals of pork noodles": [], "petals of pork rice noodles": [], "taiwan seafood vermicelli": [], "taiwan seafood rice": [{"excerpts": ["As for the rest of the menu... some winners include the chicken wings, Taiwan Seafood Rice and Dry-Braised Green Beans.\n\n"], "author": "Sam T.", "review": "I remember coming to Taiwan Restaurant when I was just a kid. This would be one of the few places my parents would go to have chinese fried donut with warm sweet soybean milk. This was my chinese equivalent of a McDonald's happy meal.\n\nYears later... I finally made my return visit to Taiwan Restaurant with a group of my co-workers. Of course I ordered my chinese happy meal. To my amazement some of my co-workers... some who are chinese did not know how to eat this!\n\nSo... this is how you eat a chinese fried donut with a bowl of warm sweet bean milk. The soybean milk should come without sugar. So, add sugar and mix till you find your perfect sweetness. Next, take a piece of donut and dip into the bean milk. Get it soaked and eat! Easy peasy... japanesey. Or you can toss in a couple of pieces of donut into your bowl and eat it like cereal.\n\nAs for the rest of the menu... some winners include the chicken wings, Taiwan Seafood Rice and Dry-Braised Green Beans.\n\nThe dishes may be a little on the salty side but most of the sauces that come with the dishes are tasty.\n\nPrices are cheap... $10 bucks for a big lunch... good deal!", "rating": 4, "date": "2009-04-27"}], "taiwan country rolls": [], "taiwan wokfried glass noodles": [], "south taiwan style soup rice noodles": [], "pork blood with large intestine and tofu": [], "taiwan crispy fried oysters": [], "sesame flat bun": [], "mu shi pork": [{"excerpts": ["won ton soup -- good\nmu shi pork --- terrible\nsteamed dumplings (beef) -- ok\nfried spring rolls -- ok\n\nservice -- good\n\nwe didn't eat all of the food and refused to take it home -- bad sign."], "author": "M F.", "review": "won ton soup -- good\nmu shi pork --- terrible\nsteamed dumplings (beef) -- ok\nfried spring rolls -- ok\n\nservice -- good\n\nwe didn't eat all of the food and refused to take it home -- bad sign.", "rating": 2, "date": "2008-02-16"}], "mu shi chicken": [], "mu shi beef": [], "mu shi shrimp": [], "mu shi vegetables": [], "sizzling beef platter": [{"excerpts": ["prompt service, succulent dumplings, delicious sizzling beef platter, excellent kung "], "author": "Brooke M.", "review": "had a lovely xmas eve dinner here with two of my favorite gents.\n\nreally, what more can you ask for? prompt service, succulent dumplings, delicious sizzling beef platter, excellent kung pao chicken and mu shu to die for!\n\nthe place is pretty no frills but offers up excellent food at cheeeeeap prices", "rating": 4, "date": "2008-12-30"}], "sizzling chicken platter": [], "sizzling shrimp platter": [], "sizzling platter of bean curd with seafood": [], "bean sauce chicken": [], "cashew chicken": [], "curry chicken": [{"excerpts": ["My beloved curry chicken with the fluorescent yellow sauce, and containing naught but chicken and onion.  "], "author": "Walter K.", "review": "Surprise Taiwanese food discovery!  My beloved curry chicken with the fluorescent yellow sauce, and containing naught but chicken and onion.  No green peppers, mushrooms, water chestnuts, bamboo shoots, or other nuggets of anything to clutter it up.\n\nPork chop on rice (pai gu fan) extremely tasty, missing the brown sauce my friend was seeking but apparently it's prepared in many different styles of which this was one.\n\nLow, low prices!  I am going to go back again and again.\n\nA standout location in the Clemental region.", "rating": 4, "date": "2007-12-31"}], "general tsuos chicken": [], "broccoli chicken": [], "velvet chicken": [{"excerpts": ["Also had the velvet chicken. ", "Sauteed with snow peas and a wine sauce. ", "Didn't get much wine out of it, but it felt pretty healthy. "], "author": "Rob W.", "review": "This was a delicious surprise. We rolled in, my food cohort and I, late on a Friday night looking for some post-movie grub. The service instantaneous and good throughout, perhaps because it was 10pm and we were the next-to-last people in there?  \n\nI'm an onion cake kind of guy. Especially when they're the thick, pancakey kind... not those wafer-thin crisps. And these were good. $2.75 for two of them, which are cut into fours and could easily make a meal in and of themselves.\n\nAlso had the velvet chicken. Sauteed with snow peas and a wine sauce. Didn't get much wine out of it, but it felt pretty healthy. Because hey, I didn't have a massive coronary after grubbing down the fried onion cakes, which by rights I probably should have had.\n\nI'd like to go back and see what else they've got going for 'em. The menu was frickin' huge and said \"Fowl\" for the chicken dishes.  Heh heh... fowl... how I love you and your egg brethren... but lets work on the name... still, you've got a good thing going on...", "rating": 4, "date": "2007-08-20"}, {"excerpts": ["i had the velvet chicken which was pretty tasty. ", "the general chao (sp?) ", "chicken was good too... "], "author": "Merredith L.", "review": "i'm not a huge fan of chinese food but my friends and i came here on saturday evening, armed with boba drinks from up the street. s was starved so we got a lot of food. a lot. and it was still only $50 somethng! that was a meal for 4 people plus leftovers. i had the velvet chicken which was pretty tasty. the general chao (sp?) chicken was good too... some beef thing ok, and the potstickers, eggrolls, lo mein, hot and sour soup,... but my very favorite was the pork buns. they were stuffed with meat and so filling and tasty. next time if i ever went again id get a full order of just those! good customer service, a guy even came back to check about sesame allergies since we were allergic to peanuts. none of us loved the potstickers actually.  and s was eh on the beef and noodles. but overall a pretty good chinese food place. nothing really special.", "rating": 3, "date": "2008-04-14"}], "fish flavored chicken": [], "crispy chicken": [{"excerpts": ["Crispy Chicken - the only sad dish of the night. ", "There was crispy skin on some of the chicken pieces, but for the most part it was just dry chicken in a sauce similar to the spare ribs we had. "], "author": "Sophie P.", "review": "My first time having taiwanese food and I was a happy fat child when I was done with dinner. The waiter/owner was really nice and sweet. Decor could use some sprucing up, but I came for the food, not the ambiance. There were 3 of us, we ordered 4 dishes and I have enough food for two days of leftovers. \n\nHere's what we ordered:\n\nSizzling rice soup - yes! thanks to the yelpers that raved about this, or else I would've missed out. Pretty cool hearing that rice sizzle as it gets dropped into the soup. Veggies were fresh and crisp, shrimp was plump and fresh as well.\n\nGreen Onion Pancake - our waiter recommended it since they were out of chinese donuts. I loved this, so simple and tasty, you can't really go wrong with fried dough. Dunked it in the soup for that perfect combo of soft and crispy. \n\nSpare Ribs (I forget which kind since my friend ordered these) - battered deep fried and tossed in a sweet and savory glaze. Reminded me of the chicken wings from San Tung. Huge portion so I have tons of leftovers, yes!\n\nCrispy Chicken - the only sad dish of the night. There was crispy skin on some of the chicken pieces, but for the most part it was just dry chicken in a sauce similar to the spare ribs we had. I'll still eat it, but could've done without this.\n\nI don't know how authentic this place is as far as Taiwanese food goes, but it's damn good. That's all the matters in my book.", "rating": 4, "date": "2012-06-13"}, {"excerpts": ["They had not so crispy chicken which the kids liked, a vegetable delight that was undelightfully bland and a spare rib that had this artificial reddish hue which made me think twice about biting down on it. ", "I did anyway against my better judgement. ", "Ooooh! ", "It tastes like orange chicken! \n", "The one really pleasant surprise was the bill. ", "We had at least 10 dishes for 10 people. ", "OK, more like 8.5 including three kids. ", "Total cost? ", "Less than $100! ", "Not bad if all you want is to feed a gang of hungry peeps who you aren't trying to impress! ", "If I'm flat broke and on a cheap date, this will be on my shortlist. ", "Otherwise, keep on walking down Clement."], "author": "Eric T.", "review": "I was invited to this dive by relatives so this got my hopes up. The service was decent for a typical Chinese restaurant. The natives were friendly! The place itself is clean and appears relatively well maintained. \nNow for the food, gulp! Their oyster pancake was underwhelming and so were the steamed dumplings. Not bad but not the \"I've got to shout it out at the top of the mountain\" variety, you know. They had not so crispy chicken which the kids liked, a vegetable delight that was undelightfully bland and a spare rib that had this artificial reddish hue which made me think twice about biting down on it. I did anyway against my better judgement. Ooooh! It tastes like orange chicken! \nThe one really pleasant surprise was the bill. We had at least 10 dishes for 10 people. OK, more like 8.5 including three kids. Total cost? Less than $100! Not bad if all you want is to feed a gang of hungry peeps who you aren't trying to impress! If I'm flat broke and on a cheap date, this will be on my shortlist. Otherwise, keep on walking down Clement.", "rating": 3, "date": "2013-06-16"}], "smoked tea duck": [], "hot garlic sauce chicken wings": [], "combination fresh vegetables with chicken": [], "asparagus chicken": [], "kao pao chicken": [], "mandarin beef": [{"excerpts": ["we got Mandarin beef, fish egg plant, and squid soup. ", "Would definitely come back."], "author": "Tinaa T.", "review": "Reasonable price and huge portion! The food is delicious too-- we got Mandarin beef, fish egg plant, and squid soup. Would definitely come back.", "rating": 5, "date": "2018-02-12"}, {"excerpts": ["Ordered their sweet and sour soup, potstickers, Mandarin beef and their meat sauce noodles. ", "The food here always tastes so good and you get a lot for the price. ", "The service here is very fast and your orders come fast. ", "I would also recommend their Shanghai dumplings and their Chinese doughnuts where in San Francisco is very rare these days."], "author": "Peter C.", "review": "One of my favorite Taiwanese restaurant since I was a kid. Ordered their sweet and sour soup, potstickers, Mandarin beef and their meat sauce noodles. The food here always tastes so good and you get a lot for the price. The service here is very fast and your orders come fast. I would also recommend their Shanghai dumplings and their Chinese doughnuts where in San Francisco is very rare these days.", "rating": 4, "date": "2012-06-26"}], "mandarin lamb": [{"excerpts": ["I bought the Mandarin Lamb for $9 and didn't realize that the to go box was so small. ", "Inside this togo box was mostly vegetables and a little bit of lamb. ", "I would not suggest coming here if your a college student looking for a good deal."], "author": "Joan B.", "review": "Wow this place is such a rip off. I bought the Mandarin Lamb for $9 and didn't realize that the to go box was so small. Inside this togo box was mostly vegetables and a little bit of lamb. I would not suggest coming here if your a college student looking for a good deal.", "rating": 1, "date": "2012-11-16"}], "mongolian lamb": [{"excerpts": ["Try dumplings, flat bean curds with chinese leeks and  the mongolian lamb, these will topple your Tummy Tiger. \n", "Tonite, 11/13/07, the dry bean curd and leeks, and steamed dumplings were good, however, the rice was dry and looked a few days old. ", "I did complain. ", "Taking two stars off."], "author": "Bert K.", "review": "I like going here as the service is polite usually pretty quick; The boiled dumplings are phat, succulent, stuffed with pork and other tender vittels and deelishus, did I mention you get ten of these tummy stuffers.  My favorite is the flat bean curd with chinese greens; it's a large serving of wonderful flat bean curd noodles and chinese cabbage, sooooo  yummy and healthy. Update, you can ask for brown rice. Try dumplings, flat bean curds with chinese leeks and  the mongolian lamb, these will topple your Tummy Tiger. \nTonite, 11/13/07, the dry bean curd and leeks, and steamed dumplings were good, however, the rice was dry and looked a few days old. I did complain. Taking two stars off.", "rating": 3, "date": "2006-12-04"}], "beef with oyster sauce": [], "green pepper beef": [], "asparagus beef": [], "snow peas beef": [], "beef a la shangtung": [], "curry beef": [], "bean curd beef": [], "combination fresh vegetables with beef": [], "szechwan hot beef": [], "sweet and sour spareribs": [], "fish flavored pork": [{"excerpts": ["We ordered Shanghai thick noodles and the fish flavored pork. \n\n"], "author": "David N.", "review": "I am meh about this place.\n\nI came here on a friday night and there was a couple waiting in front of us. There were two tables that should have been open up, but they were dirty and not cleaned up yet by the two waiters who were busy doing other immaterial things such as getting water for others. They should have hired more waiters. I mean, they're were two available tables that should have been cleaned up and it would only take two minutes to clean up but they didn't! They were busy doing other very menial tasks. \n\nFinally when we were seated, the waiter took another person's order before us even though we were seated first. We ordered Shanghai thick noodles and the fish flavored pork. \n\nAnd then when we finally got our food, the food was lukewarm and got cold quickly within two minutes. It was as if the food was left there for ten minutes until it got served to us.\n\nI totally do not recommend this place as there are so many places in the sunset district that are so much better than this.", "rating": 2, "date": "2010-01-24"}], "mustard greens with shredded pork": [], "peking spareribs mild": [], "pork a la hunan": [], "crispy spareribs": [{"excerpts": ["Lastly, you have to definatly try the CRISPY SPARERIBS.  ", "Omg, to die for.  ", "Very tasty, big portion and crispy.  ", "I never had crispy spareribs like this before. ", "I brought my boyfriend here and he loves it.  ", "So you to should try it out"], "author": "marley b.", "review": "This place is near my work, so I eat here often.  The place looks like crap inside and outside, but the food is delicious.  Start with the steamed dumplings.  The dumplings are cooked when ordered, so it is fresh.  It is served with shredded ginger and you don't need soy sauce at all.  The spicy tofu is good but needs to be more on the softer side.  You can taste the tobacco which is good and it's served with minced pork.  The shrimps with snow peas and carrots is good too.  It has a starchy taste, which I love.  Beef soup with glass noodle is good to eat on a cold day.  It 's served with green veggies.  Very tasty.  Lastly, you have to definatly try the CRISPY SPARERIBS.  Omg, to die for.  Very tasty, big portion and crispy.  I never had crispy spareribs like this before. I brought my boyfriend here and he loves it.  So you to should try it out", "rating": 4, "date": "2008-11-27"}], "lions head": [], "deep fried pork chop": [], "redcooked eggplant": [], "fish flavored eggplant": [], "dry braised green beans": [{"excerpts": ["this tasted as expected it should.\n- 8 PIECE DEEP FRIED PRAWNS: tasty and would order again.\n- DRY BRAISED GREEN BEANS: ", "this was listed under their vegetarian options, it was not!! ", "There was ground beef in the dish.\n"], "author": "Hello E.", "review": "Overall, not satisfied and would not return. Below are dish I ordered.\n\n- HOT & SOUR SOUP: this tasted as expected it should.\n- 8 PIECE DEEP FRIED PRAWNS: tasty and would order again.\n- DRY BRAISED GREEN BEANS: this was listed under their vegetarian options, it was not!! There was ground beef in the dish.\n- BLACK BEAN SAUCE SQUIDS: could not taste the black bean sauce. dish was tasteless. would not order again.\n- CURRY TOFU: was very bland and tasteless. would not order again.", "rating": 2, "date": "2017-09-04"}, {"excerpts": ["Dry braised green beans (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q) - Hard to do this wrong, they did a decent job in savoriness and not overcooking them.\n\n"], "author": "Mike C.", "review": "It's been years, maybe even a decade.  \nThe original in Berkeley was the standard, though didn't dine there often while living on campus.\nThen, their Chinatown/North Beach location was in my regular lunch rotation for takeout food since it was close to work.\nThis Inner Richmond staple is a change from the primarily Cantonese restaurants in the neighborhood.  My friend chose it for her birthday lunch on a recent Saturday.  While ordering post meal takeout, I recognized a waiter from that Chinatown location, leading me to believe ownership is likely the same.  Here's what we shared, all family style:\n\nAppetizers\n1.  Kuo Teh (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=GERaTy5i44rasD7Ug_8WTA) - Also known as pot stickers, these were nicely browned though skins are on the doughy side.\n\n2.  Green onion pancake (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=oJk7G8GtWxavVDwXRmJTXA) - Crisp and served hot, these disappeared from the plate quickly.\n\n3.  Steamed dumplings (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=bVTHJlHoJ4YQiirRjgLw9w) - Better known as Xiao Lung Baos, they are larger than most and like 1., skin on thick side.\n\n4.  Taiwan special deep fried tofu (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=X-L5Bh-SdVNUHMCt3j3tcA) - Seeing a neighboring table's order, we added this.  Fried well but no distinct flavor.\n\n5.  Fried squid (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=2KeA1m_3rWgKrf9FNTJKdA) - Probably my least favorite as they could pass for pork rinds.\n\n6.  Wok-fried Shanghai thick noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=h9FnAuBagMh80C4CBXQsGw) - The noodles were extraordinarily thick almost udon like.  Flavors were very distinct as chef had a light hand on the soy sauce while stir frying.\n\n7.  Bean and meat sauce noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=agbAC1NtfEOYP3SPCl4Izw) - Probably my favorite as seasonings were spot in.  A little more veggies might make this a must-order.\n\n8.  Dry braised green beans (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q) - Hard to do this wrong, they did a decent job in savoriness and not overcooking them.\n\n9.  Smoked tofu, celery, and pork stir fry (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=s2EjsJtnF1mlqI2lsvCMCQ) - My second favorite of the meal, all ingredients shined.  Tofu size made smaller would make this perfect.\n\nAs many comment especially Ken K. (http://www.yelp.com/user_details?userid=DS0Idr2XDhz5e7ZfSy0dYA), this is a pretty far cry from authentic Taiwan food as far as flavors go.  The bar is set high in Southern California with the predominance of locals there.  Here, Cantonese palates reign and welcome any variation of Chinese cuisine available.  Portions are generous and prices are certainly reasonable here.  \nJust don't expect to enjoy the true flavors that you'd enjoy in or around Taipei's night market.", "rating": 3, "date": "2015-05-05"}, {"excerpts": ["Taiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\n"], "author": "Mr. D.", "review": "2 Words- Amazing food!!!\n I Recommend  the Dim Sum!!\nTaiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\nFresh Chinese donuts daily, and they are delicious with their fresh sweet soy milk! \n\nWhenever I'm in the area I have to come here because the servers are the best. Especially George, he always makes me laugh. The things we talk about together is just Hilarious.  \n\nSometimes when Im not feeling well won ton soup is the way to go. I honestly recommend this place because service is amazing, food is amazing, perfect atmosphere, and great prices.", "rating": 5, "date": "2015-03-26"}, {"excerpts": ["My favorites here are the dry braised green beans with meat, mustard greens shredded pork noodle soup (omg! such comfort food), Taiwan country favorite spareribs, red snapper filet and the very simple/plain chicken chow mein (they use the thick Shanghai style noodles for this dish).\n\n"], "author": "Everso T.", "review": "I've gone to this restaurant over the past couple decades whenever I'm in the neighborhood. My father likes this place because the food isn't greasy or overly salty. I've always had polite service here but then I've been told I'm not very demanding. Still, I can discern the difference between being neglected and treated rudely from decent service provided by a family-run business (not polished but still taken care of well).\n\nAs with most restaurants, there are a few reliable dishes on the menu and I stick with those when I want a guaranteed good meal. My favorites here are the dry braised green beans with meat, mustard greens shredded pork noodle soup (omg! such comfort food), Taiwan country favorite spareribs, red snapper filet and the very simple/plain chicken chow mein (they use the thick Shanghai style noodles for this dish).\n\nI love the down-homeness of this place. Not fancy or new, but still comfy seating with my one of my favorite soup noodle dishes in town.", "rating": 5, "date": "2014-12-30"}, {"excerpts": ["I ordered sweet rice and pork in bamboo leaf, dumplings (pot stickers) and the dry braised green beans. ", "I thought the green bean dish was just the vegetable, but for some reason she asked if I wanted it with the pork and dried shrimp. ", "I was confused but asked for it without the shrimp. ", "The beans and pot stickers came quickly and were fresh and hot. ", "The pot stickers were nicely cooked but not as tasty as I might like. ", "Beans were excellent with lots of ground pork. ", "The pork was too salty for me ", "but I am hypersensitive to salt. ", "The sweet rice and pork was very good. ", "A decent place and reasonable."], "author": "John K.", "review": "I came here on a Monday at noon. It was busy without being crowded. Service was attentive and friendly. I ordered sweet rice and pork in bamboo leaf, dumplings (pot stickers) and the dry braised green beans. I thought the green bean dish was just the vegetable, but for some reason she asked if I wanted it with the pork and dried shrimp. I was confused but asked for it without the shrimp. The beans and pot stickers came quickly and were fresh and hot. The pot stickers were nicely cooked but not as tasty as I might like. Beans were excellent with lots of ground pork. The pork was too salty for me but I am hypersensitive to salt. The sweet rice and pork was very good. A decent place and reasonable.", "rating": 3, "date": "2010-07-28"}, {"excerpts": ["I know it's not anything compared to what you'd find outside of San Francisco, but it's grown on me and I love coming here for steamed vegetarian dumplings, Schezuan spicy noodles, tofu and mustard greens, Taiwan special deep-fried tofu, dry braised green beans, sizzling rice soup.\n\n"], "author": "Timothy P.", "review": "Order carefully. Not everything is great here, but there are some really great standards that keep people coming back. Good clue to know if you are ordering correctly, look at the table next to you. There's a lot of regulars at this restaurant and they know what's good. Not everything on the menu is great, but once you've gone enough times you will find your favorites.\n\nI'm a sucker for this restaurant. I know it's not anything compared to what you'd find outside of San Francisco, but it's grown on me and I love coming here for steamed vegetarian dumplings, Schezuan spicy noodles, tofu and mustard greens, Taiwan special deep-fried tofu, dry braised green beans, sizzling rice soup.\n\nThis place is super cheap, has good food, and has an extensive menu with your normal and not so normal (see \"stuffed baby squids\") Chinese food. \n\nThey are known for the dumplings. They make them in the window. I've heard their Xiao Long Bao are not so good, but I really like their vegetarian steamed dumplings.\n\nMost of what you see in the window is on a small dim sum menu. Look in the bottom right corner of your menu to find it. It's on one of the folds.", "rating": 4, "date": "2007-05-05"}, {"excerpts": ["Red cooked eggplant and dry braised green beans make for delicious side dishes, and the General Tso's chicken is a unique take on the dish, but far and away my favorite. ", "The bright pink bi-level room is bizarrely dramatic but ultimately charmless. ", "If you can get here for lunch, lunch combinations are less than $5 and include soup, your choice of entree, rice, and orange slices for dessert."], "author": "Jon L.", "review": "Taiwan Restaurant is one of the best food bargains in San Francisco, bar none. A tasty and generous meal for two can be had for well under $15. Fill up on dumplings, because they're the real standout here, along with everything else made in tiny front kitchen that looks out on this international stretch of Clement Street. Standouts include delicate boiled shrimp and leek dumplings and picture-perfect kuo teh. Steamed pork buns are enormous and contain a portion of savory ground pork, not the sticky-sweet BBQ pork to which one is accustomed. Red cooked eggplant and dry braised green beans make for delicious side dishes, and the General Tso's chicken is a unique take on the dish, but far and away my favorite. The bright pink bi-level room is bizarrely dramatic but ultimately charmless. If you can get here for lunch, lunch combinations are less than $5 and include soup, your choice of entree, rice, and orange slices for dessert.", "rating": 4, "date": "2005-10-29"}, {"excerpts": ["I called in for Take-Out and ordered the shrimp chow mein, dry braised green beans, lemon chicken and rice.  ", "He said it would be ready in 10 min.  ", "I left the house immediately, especially since finding parking is nearly impossible on Clement.  ", "My BF found a spot out in front, and the food wasn't ready yet.  ", "The food was ready in about 15 min (not 10 min), but it was worth the weight.  ", "The soup was so good and authentic. ", "It had 2 shrimps in it.  ", "The chow mein was good and had 5 shrimps, but were big pieces.  ", "The beans were good, too.  ", "The rice was dry, and the lemon chicken was so-so.  ", "I'd go back and order the soup again and the beans.  ", "I finally found a good and reliable Chinese place!  ", "P.S.  ", "Check the cartons when you look in the bag, most of it had opened when I got home, and my BF spilled the green beans on the table."], "author": "Jen C.", "review": "I just got back from a hike in Mt. Tam and wanted some warm soup and Wor Won Ton Soup sounded so good.  Problem is that I hadn't found a good Chinese restaurant since I've moved here almost 3 years ago!?!  I was always worried about picking a wrong restaurant, but I turned to Yelp and found this place.  I called in for Take-Out and ordered the shrimp chow mein, dry braised green beans, lemon chicken and rice.  He said it would be ready in 10 min.  I left the house immediately, especially since finding parking is nearly impossible on Clement.  My BF found a spot out in front, and the food wasn't ready yet.  The food was ready in about 15 min (not 10 min), but it was worth the weight.  The soup was so good and authentic. It had 2 shrimps in it.  The chow mein was good and had 5 shrimps, but were big pieces.  The beans were good, too.  The rice was dry, and the lemon chicken was so-so.  I'd go back and order the soup again and the beans.  I finally found a good and reliable Chinese place!  P.S.  Check the cartons when you look in the bag, most of it had opened when I got home, and my BF spilled the green beans on the table.", "rating": 3, "date": "2007-11-25"}], "wokfried spinach with garlic": [], "wokfried bean sprouts": [], "wokfried bok choy hearts": [], "chinese cabbage with dried shrimp": [], "combination vegetables deluxe": [], "snow peas with mushrooms and water chestnuts": [], "mushi vegetable": [], "combination vegetables soup": [], "combination vegetables chow mein": [], "vegetables fried rice": [], "bean sauce noodles": [{"excerpts": ["- Black bean sauce noodles.  ", "I like the noodles that they use.  ", "The sauce is a different story.  ", "It just tastes different than I remember it.  "], "author": "Stephanie C.", "review": "This place has really gone down hill.  I used to love coming here on Sunday afternoons with my family as a alternative to dim sum.  I used to enjoy simple dishes like hot sweetened soy milk, fried onion pancakes and thick shanghai chow mein.  My childhood memories will have to stay memories because those days are no more.\n\nHad dinner here with my sister and mom about a month ago.  We came at the perfect time and grabbed the last available table in the place.  The bicycle cops were working extra hard that night \n\n- Cold jellyfish.  I've never ordered this here before.  I was shocked to see that they serve the jellyfish over a huge bed of cucumbers.  I'm not a fan of cucumbers and it sucked that the jellyfish took on the cucumber taste.\n\n- Hot & Sour soup.  It was a bit bland.  I had to add more pepper to make it hotter.  I'm just glad they didn't over do it on the vinegar.\n\n- Salted mustard green bits & pork.  This dish I did like.  Was great with some white rice.\n\n- Black bean sauce noodles.  I like the noodles that they use.  The sauce is a different story.  It just tastes different than I remember it.  I used to like it.\n\nI wonder if they have a different chef i the kitchen now?  If Yelp was available back i the days, I would have rated it a 4.  It's now as bad as it's Chinatown location used to be and that place is closed now.  I really hope they get better.", "rating": 2, "date": "2010-11-03"}], "veggie szechwan hot sauce noodles": [], "fresh vegetable chow fun": [{"excerpts": ["We split the white turnip cakes, mandarin tofu, and fresh vegetable chow fun for lunch. ", "Enormous portions. "], "author": "Tyjen C.", "review": "Delicious! We split the white turnip cakes, mandarin tofu, and fresh vegetable chow fun for lunch. Enormous portions. All for twenty bucks! \n\n*edit: it was our first visit and we found the restaurant from Yelp. Didn't disappoint!", "rating": 5, "date": "2016-12-19"}], "veggie hot and sour soup": [], "shrimp a la shanghai": [], "shrimp with snow peas": [], "shrimp with broccoli": [], "spicy prawns": [{"excerpts": ["I did some examination of my favorite Spicy Prawns, however, and realized the problem is that the batter is simply water and cornstarch which makes for bland flavor. ", "I'm sure they used to put something else in there (when I make this dish at home "], "author": "Otis M.", "review": "I gave Taiwan another try at the urging of the owner and it's clear the previous visit was an off day. Everything was fresh, well prepared and piping hot. \n\nI did some examination of my favorite Spicy Prawns, however, and realized the problem is that the batter is simply water and cornstarch which makes for bland flavor. I'm sure they used to put something else in there (when I make this dish at home I add sesame oil and soy sauce). \n\nBut that gives me justification to explore the menu on my next visit, so I'm good.", "rating": 4, "date": "2015-10-29"}, {"excerpts": ["The other thing not to miss is the spicy prawns. ", "These critters come lightly battered, fried cripsy, with lots of garlic. ", "I almost always get 2 orders. "], "author": "C. A. S.", "review": "One of my favorite small Chinese food spots (see also San Tung). (Though, in this case it would be Republic of Chinese food.) I've travelled to Taiwan a bunch and gone to a famous spot for dumplings in Taipei. The dumplings here are on par.\n\nThe other thing not to miss is the spicy prawns. These critters come lightly battered, fried cripsy, with lots of garlic. I almost always get 2 orders. Also check out the dried braised green beans ... crackin'!\n\nService is good (and quick), too.", "rating": 5, "date": "2006-12-12"}, {"excerpts": ["The vegetarian steamed dumplings are amazing, as are the spicy prawns, the brazed green beans, and the sizzling rice soup. ", "I could go on and on and on, but I'll spare you. ", "The atmosphere is plain, and is often filled to the max with people ", "But it's great food. ", "And prices are great."], "author": "Lindsey S.", "review": "This place is absolutely the BEST freaking Chinese type food in San Francisco... The vegetarian steamed dumplings are amazing, as are the spicy prawns, the brazed green beans, and the sizzling rice soup. I could go on and on and on, but I'll spare you. The atmosphere is plain, and is often filled to the max with people But it's great food. And prices are great.", "rating": 5, "date": "2005-10-19"}], "szechwan prawns": [], "sweet and sour shrimp": [{"excerpts": ["The soup was good and sweet and sour shrimp was really good,  not too tangy like other restaurants.  ", "I was disappointed with service, very slow and up attentive."], "author": "casey j.", "review": "Don't order dumplings.  Not fresh.  Green onions pancake was deep fried, not traditional.  The fried rice had no wok fired flavor.  The soup was good and sweet and sour shrimp was really good,  not too tangy like other restaurants.  I was disappointed with service, very slow and up attentive.", "rating": 2, "date": "2017-06-25"}, {"excerpts": ["i love their cha chang myon (bean & meat sauce noodles), sweet and sour shrimp, crispy spare ribs, and the deep fried squid. \n\n"], "author": "Suzan L.", "review": "I really think that bus stop that is covering this gem should be moved a store over. seriously? i would have missed it! \n\nI love this restaurant...i have total food coma which means that i ate too much...because it was so DELICIOUS! yummy! i love their cha chang myon (bean & meat sauce noodles), sweet and sour shrimp, crispy spare ribs, and the deep fried squid. \n\nand the best part? LEFTOVERS! \nso if your craving taiwanese food...go here!", "rating": 5, "date": "2009-02-28"}], "happy family": [{"excerpts": ["Tasted Sizzling rice soup, Dry Green Beans, and Happy Family Seafood. ", "Pretty good Taiwanese style food and Northern Dishes. ", "Delicious mid-PM Break."], "author": "Yee Ping C.", "review": "Tasted Sizzling rice soup, Dry Green Beans, and Happy Family Seafood. Pretty good Taiwanese style food and Northern Dishes. Delicious mid-PM Break.", "rating": 3, "date": "2017-11-23"}, {"excerpts": ["(www.yelp.com/biz/M0JTO3oyu6gxh1mfFjU-dA), nor the defunct Happy Family Restaurant formerly at Geary and 2nd Ave. ", "(God! ", "I miss them so much!), but you can have fried rice flour-noodles with your steamed mini pork dumplings.  ", "Meaning that you can have a traditionally Fujianese, Southern and coastal dish (rice flour noodles) with a traditionally Northern, Santung staple (the wheat flour bun) at the same table for the same meal in the same restaurant.  ", "I know, I know, this distinction is like...", "wow, they have Neopolitan AND Sicilian pizza here!  ", "Well, it's Chinese cosmopolitan, not just Cantonese.  ", "I just wish they had more \"crazy\" sounding stuff...like that Hakka dish where salt-cured moldy mustard greens are stewed with ham hocks, or go trendy with stinky tofu.  ", "Are you salivating yet?"], "author": "Bruce L.", "review": "The politics and resultant Chinese culture of Taiwan expressed in food...mmm...edutasty!\n\nJust like the polyglot and frequently conflicting flavors of Taiwan's multiple waves of Chinese colonizers, settlers, and refugees, Taiwan Restaurant's menu is a Lazy Susan menagerie of its cuisines' best picks...or at least a very, very close approximation of what those picks can taste like, by using locally available ingredients and importable exotics.  You may not get the full \"authenticity\" of Northern Chinese fare like the shrimp and leek dumplings that you may get at San Tung Chinese Restaurant No. 2 (www.yelp.com/biz/M0JTO3oyu6gxh1mfFjU-dA), nor the defunct Happy Family Restaurant formerly at Geary and 2nd Ave. (God! I miss them so much!), but you can have fried rice flour-noodles with your steamed mini pork dumplings.  Meaning that you can have a traditionally Fujianese, Southern and coastal dish (rice flour noodles) with a traditionally Northern, Santung staple (the wheat flour bun) at the same table for the same meal in the same restaurant.  I know, I know, this distinction is like...wow, they have Neopolitan AND Sicilian pizza here!  Well, it's Chinese cosmopolitan, not just Cantonese.  I just wish they had more \"crazy\" sounding stuff...like that Hakka dish where salt-cured moldy mustard greens are stewed with ham hocks, or go trendy with stinky tofu.  Are you salivating yet?", "rating": 4, "date": "2006-03-05"}], "curry shrimp": [], "braised sliced fresh red snapper fillet": [], "fresh sliced red snapper fillet with lemon sauce": [], "sweet and sour sliced fresh red snapper fillet": [], "squid with hot pepper sauce": [], "fish flavored scallops": [], "scallops sauteed": [], "taiwan pickled greens with squids": [], "black bean sauce squids": [{"excerpts": ["- BLACK BEAN SAUCE SQUIDS: could not taste the black bean sauce. ", "dish was tasteless. "], "author": "Hello E.", "review": "Overall, not satisfied and would not return. Below are dish I ordered.\n\n- HOT & SOUR SOUP: this tasted as expected it should.\n- 8 PIECE DEEP FRIED PRAWNS: tasty and would order again.\n- DRY BRAISED GREEN BEANS: this was listed under their vegetarian options, it was not!! There was ground beef in the dish.\n- BLACK BEAN SAUCE SQUIDS: could not taste the black bean sauce. dish was tasteless. would not order again.\n- CURRY TOFU: was very bland and tasteless. would not order again.", "rating": 2, "date": "2017-09-04"}], "combination fresh vegetables with prawns": [], "asparagus prawns": [{"excerpts": ["I got the asparagus prawns which had at least an entire bunch of asparagus and lots of shrimp in a tasty black bean sauce.\n\n"], "author": "Emily J.", "review": "Quick, inexpensive and ample lunch.  Lunch specials come with soup and  white or brown rice.  The brown rice costs a bit extra. \n\nI got the asparagus prawns which had at least an entire bunch of asparagus and lots of shrimp in a tasty black bean sauce.\n\nThe lunch special servings are at least two - three meals worth.  No one offered to wrap up the leftovers but since I had another half day of training and a long commute home, I probably wouldn't have taken them up on the offer anyway.", "rating": 3, "date": "2011-09-03"}, {"excerpts": ["I got the beef soup noodles and the bf got the asparagus prawns + rice. ", "Meh. "], "author": "Debbie T.", "review": "The food is okay. \n\nI got the beef soup noodles and the bf got the asparagus prawns + rice. Meh. Edible, but not great. \n\nThe portions are HUGE! I think I ate about 1/8 of my noodles and became full. This is the place if you want the bang for your buck. \n\nI'm hoping there's better Chinese food in the area. I wonder the location in SF also owns the one in Berkeley. The Taiwan Restaurant in Berkeley is significantly better.", "rating": 3, "date": "2011-08-01"}], "spicy hot tofu": [], "mandarin braised tofu": [], "mushrooms tofu": [], "taiwan special deep fried tofu": [{"excerpts": ["Taiwan special deep fried tofu (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=X-L5Bh-SdVNUHMCt3j3tcA) - ", "Seeing a neighboring table's order, we added this.  "], "author": "Mike C.", "review": "It's been years, maybe even a decade.  \nThe original in Berkeley was the standard, though didn't dine there often while living on campus.\nThen, their Chinatown/North Beach location was in my regular lunch rotation for takeout food since it was close to work.\nThis Inner Richmond staple is a change from the primarily Cantonese restaurants in the neighborhood.  My friend chose it for her birthday lunch on a recent Saturday.  While ordering post meal takeout, I recognized a waiter from that Chinatown location, leading me to believe ownership is likely the same.  Here's what we shared, all family style:\n\nAppetizers\n1.  Kuo Teh (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=GERaTy5i44rasD7Ug_8WTA) - Also known as pot stickers, these were nicely browned though skins are on the doughy side.\n\n2.  Green onion pancake (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=oJk7G8GtWxavVDwXRmJTXA) - Crisp and served hot, these disappeared from the plate quickly.\n\n3.  Steamed dumplings (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=bVTHJlHoJ4YQiirRjgLw9w) - Better known as Xiao Lung Baos, they are larger than most and like 1., skin on thick side.\n\n4.  Taiwan special deep fried tofu (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=X-L5Bh-SdVNUHMCt3j3tcA) - Seeing a neighboring table's order, we added this.  Fried well but no distinct flavor.\n\n5.  Fried squid (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=2KeA1m_3rWgKrf9FNTJKdA) - Probably my least favorite as they could pass for pork rinds.\n\n6.  Wok-fried Shanghai thick noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=h9FnAuBagMh80C4CBXQsGw) - The noodles were extraordinarily thick almost udon like.  Flavors were very distinct as chef had a light hand on the soy sauce while stir frying.\n\n7.  Bean and meat sauce noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=agbAC1NtfEOYP3SPCl4Izw) - Probably my favorite as seasonings were spot in.  A little more veggies might make this a must-order.\n\n8.  Dry braised green beans (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q) - Hard to do this wrong, they did a decent job in savoriness and not overcooking them.\n\n9.  Smoked tofu, celery, and pork stir fry (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=s2EjsJtnF1mlqI2lsvCMCQ) - My second favorite of the meal, all ingredients shined.  Tofu size made smaller would make this perfect.\n\nAs many comment especially Ken K. (http://www.yelp.com/user_details?userid=DS0Idr2XDhz5e7ZfSy0dYA), this is a pretty far cry from authentic Taiwan food as far as flavors go.  The bar is set high in Southern California with the predominance of locals there.  Here, Cantonese palates reign and welcome any variation of Chinese cuisine available.  Portions are generous and prices are certainly reasonable here.  \nJust don't expect to enjoy the true flavors that you'd enjoy in or around Taipei's night market.", "rating": 3, "date": "2015-05-05"}], "curry tofu": [{"excerpts": ["would not order again.\n- CURRY TOFU: was very bland and tasteless. ", "would not order again."], "author": "Hello E.", "review": "Overall, not satisfied and would not return. Below are dish I ordered.\n\n- HOT & SOUR SOUP: this tasted as expected it should.\n- 8 PIECE DEEP FRIED PRAWNS: tasty and would order again.\n- DRY BRAISED GREEN BEANS: this was listed under their vegetarian options, it was not!! There was ground beef in the dish.\n- BLACK BEAN SAUCE SQUIDS: could not taste the black bean sauce. dish was tasteless. would not order again.\n- CURRY TOFU: was very bland and tasteless. would not order again.", "rating": 2, "date": "2017-09-04"}, {"excerpts": ["Everything we ordered from the spring rolls to the curry tofu w/rice to the braised beef ligament noodles tasted great.  ", "I really enjoyed mixing the sweet sauce with the onion pancakes, it was awesome.  ", "And pretty impressive veggie selection"], "author": "Swetha G.", "review": "Ginormous food portions!  One entree, and it's usually less than $7, can easily feed two!  \n\nEverything we ordered from the spring rolls to the curry tofu w/rice to the braised beef ligament noodles tasted great.  I really enjoyed mixing the sweet sauce with the onion pancakes, it was awesome.  And pretty impressive veggie selection, I saw plenty of things that I wanted to try.  \n\nGreat service, UBER cheap prices, lots of tasty and good and filling food.  I think Taiwan Restaurant's a bargain, definately get a bang for your buck.", "rating": 4, "date": "2008-07-13"}], "mustard greens tofu": [], "hunan tofu with chinese smoked hams": [], "mustard greens with flat tofu": [], "wokfried dry tofu with leeks": [], "wokfried dry tofu with celery": [], "dry tofu salad": [], "spicy hot tofu with prawns": [], "salt and pepper tofu": [], "dry braised green beans with fried tofu": [], "special chow mein": [], "special fried rice": [], "pork chow mein": [], "pork fried rice": [{"excerpts": ["I've also had the potstickers and pork fried rice, good staples that you can't go wrong with.  ", "The potstickers have a nice firm skin and aren't a soggy mess and the pork fried rice is light and not greasy like a lot of places."], "author": "Dawn L.", "review": "Okay I'll admit I've only ever had five dishes from here, but I LOVE everyone (and I get stuck in a dishes I love rut with asian food but thats my choice and don't disregard my review because of it).\n\nTheir General Tsou's Chicken is divine.  Not goopy sweet or ridiculously spicey like most places.  That perfect balance of sweet and spicey and perfect with plain white rice.  \n\nTheir Shrimp and Snow Peas is also amazing.  Simple, light but super flavorful.  This girl loves her snow peas and devours every one.  \n\nI've also had the potstickers and pork fried rice, good staples that you can't go wrong with.  The potstickers have a nice firm skin and aren't a soggy mess and the pork fried rice is light and not greasy like a lot of places.", "rating": 5, "date": "2009-01-24"}], "shrimp chow mein": [{"excerpts": ["We went to get dim sum at night, and ended up with vegi potstickers, eggplant and shrimp chow mein. ", "The eggplant was awesome - potstickers average and chow mein greasy and tasty! ", "Plus, bill for two was less than $25!"], "author": "Kai C.", "review": "Inexpensive and tasty chinese-style food. We went to get dim sum at night, and ended up with vegi potstickers, eggplant and shrimp chow mein. The eggplant was awesome - potstickers average and chow mein greasy and tasty! Plus, bill for two was less than $25!", "rating": 4, "date": "2010-10-02"}, {"excerpts": ["I called in for Take-Out and ordered the shrimp chow mein, dry braised green beans, lemon chicken and rice.  ", "He said it would be ready in 10 min.  ", "I left the house immediately, especially since finding parking is nearly impossible on Clement.  ", "My BF found a spot out in front, and the food wasn't ready yet.  ", "The food was ready in about 15 min (not 10 min), but it was worth the weight.  ", "The soup was so good and authentic. ", "It had 2 shrimps in it.  ", "The chow mein was good and had 5 shrimps, but were big pieces.  ", "The beans were good, too.  ", "The rice was dry, and the lemon chicken was so-so.  ", "I'd go back and order the soup again and the beans.  ", "I finally found a good and reliable Chinese place!  ", "P.S.  ", "Check the cartons when you look in the bag, most of it had opened when I got home, and my BF spilled the green beans on the table."], "author": "Jen C.", "review": "I just got back from a hike in Mt. Tam and wanted some warm soup and Wor Won Ton Soup sounded so good.  Problem is that I hadn't found a good Chinese restaurant since I've moved here almost 3 years ago!?!  I was always worried about picking a wrong restaurant, but I turned to Yelp and found this place.  I called in for Take-Out and ordered the shrimp chow mein, dry braised green beans, lemon chicken and rice.  He said it would be ready in 10 min.  I left the house immediately, especially since finding parking is nearly impossible on Clement.  My BF found a spot out in front, and the food wasn't ready yet.  The food was ready in about 15 min (not 10 min), but it was worth the weight.  The soup was so good and authentic. It had 2 shrimps in it.  The chow mein was good and had 5 shrimps, but were big pieces.  The beans were good, too.  The rice was dry, and the lemon chicken was so-so.  I'd go back and order the soup again and the beans.  I finally found a good and reliable Chinese place!  P.S.  Check the cartons when you look in the bag, most of it had opened when I got home, and my BF spilled the green beans on the table.", "rating": 3, "date": "2007-11-25"}], "shrimp fried rice": [], "beef soup noodles with own gravy": [], "soup glass noodles with fried bean curd": [], "mustard greens with shredded pork noodles": [], "bean and meat sauce noodles": [{"excerpts": ["Bean and meat sauce noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=agbAC1NtfEOYP3SPCl4Izw) - Probably my favorite as seasonings were spot in.  "], "author": "Mike C.", "review": "It's been years, maybe even a decade.  \nThe original in Berkeley was the standard, though didn't dine there often while living on campus.\nThen, their Chinatown/North Beach location was in my regular lunch rotation for takeout food since it was close to work.\nThis Inner Richmond staple is a change from the primarily Cantonese restaurants in the neighborhood.  My friend chose it for her birthday lunch on a recent Saturday.  While ordering post meal takeout, I recognized a waiter from that Chinatown location, leading me to believe ownership is likely the same.  Here's what we shared, all family style:\n\nAppetizers\n1.  Kuo Teh (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=GERaTy5i44rasD7Ug_8WTA) - Also known as pot stickers, these were nicely browned though skins are on the doughy side.\n\n2.  Green onion pancake (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=oJk7G8GtWxavVDwXRmJTXA) - Crisp and served hot, these disappeared from the plate quickly.\n\n3.  Steamed dumplings (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=bVTHJlHoJ4YQiirRjgLw9w) - Better known as Xiao Lung Baos, they are larger than most and like 1., skin on thick side.\n\n4.  Taiwan special deep fried tofu (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=X-L5Bh-SdVNUHMCt3j3tcA) - Seeing a neighboring table's order, we added this.  Fried well but no distinct flavor.\n\n5.  Fried squid (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=2KeA1m_3rWgKrf9FNTJKdA) - Probably my least favorite as they could pass for pork rinds.\n\n6.  Wok-fried Shanghai thick noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=h9FnAuBagMh80C4CBXQsGw) - The noodles were extraordinarily thick almost udon like.  Flavors were very distinct as chef had a light hand on the soy sauce while stir frying.\n\n7.  Bean and meat sauce noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=agbAC1NtfEOYP3SPCl4Izw) - Probably my favorite as seasonings were spot in.  A little more veggies might make this a must-order.\n\n8.  Dry braised green beans (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q) - Hard to do this wrong, they did a decent job in savoriness and not overcooking them.\n\n9.  Smoked tofu, celery, and pork stir fry (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=s2EjsJtnF1mlqI2lsvCMCQ) - My second favorite of the meal, all ingredients shined.  Tofu size made smaller would make this perfect.\n\nAs many comment especially Ken K. (http://www.yelp.com/user_details?userid=DS0Idr2XDhz5e7ZfSy0dYA), this is a pretty far cry from authentic Taiwan food as far as flavors go.  The bar is set high in Southern California with the predominance of locals there.  Here, Cantonese palates reign and welcome any variation of Chinese cuisine available.  Portions are generous and prices are certainly reasonable here.  \nJust don't expect to enjoy the true flavors that you'd enjoy in or around Taipei's night market.", "rating": 3, "date": "2015-05-05"}, {"excerpts": ["Must have dishes are Bean and Meat Sauce Noodles, Szechuan Hot Sauce Noodles (the vegetarian one is just as good, they just don't put pork), and Fish-flavored Egg Plant.\n\n"], "author": "Jason T.", "review": "Taiwan Restaurant is my favorite place to eat in SF.\n\nThe food is VERY affordable with generous portions and tastes awesome. Though, I'm sure the MSG will kill us all sooner than we'd like.\n\nMust have dishes are Bean and Meat Sauce Noodles, Szechuan Hot Sauce Noodles (the vegetarian one is just as good, they just don't put pork), and Fish-flavored Egg Plant.\n\nThe only thing I would stay away from at this place is the lamb. The beef variants are fine. It's just that the lamb at this place never seems right.\n\nAs a kid I always enjoyed watching the sous chefs prepare the dumplings in the front of the restaurant. Really nice touch to show everyone that the food is freshly made.", "rating": 5, "date": "2009-01-04"}, {"excerpts": ["a sample of dishes i've had recently:\n\n- bean and meat sauce noodles :\ngreat; my favorite dish here so far. "], "author": "L C.", "review": "from the outside and the inside, this place will not wow you with its decor.  but, i come here for the food, not the ambiance. \n\nnow, if you're expecting non-greasy chinese food, you are SOL at 95% of chinese restaurants out there. this also depends largely on what you order, however. everything i've had here has never been overly oily or greasy, and i've liked all the items. a sample of dishes i've had recently:\n\n- bean and meat sauce noodles :\ngreat; my favorite dish here so far. Taiwan Restaurant does this dish VERY well, the best zha jiang mien i've had outside of Taiwan. this dish is also HUGE, as are all portions at this restaurant (this dish served me for 3 meals). the noodles were also excellent, chewy and fresh. \n\n- chinese doughnuts & hot soy milk:\ngood, not great (like all yiu tiao, too oily to be eaten often); the yiu tiao are very good, more doughy than normal, though i like that, and still retaining that crispy exterior; super fresh (i first walked in here b/c i saw the guys making them fresh in the window), and huge. the soy milk was ok; fresh, though you add your own sugar or salt to taste. i prefer when they add the flavoring, since the sugar incorporates better and faster. \n\n- pork dumplings:\nsolidly good; extremely fresh---they make them to order i believe (as in stuffing, wrapping, and steaming per order), and are ginormously stuffed to near-bursting. the skins are thicker than i like, but they're still very good. like eating mini pork&veggie buns. \n\n- pork chop fried rice:\nreally good; though, they don't include the stewed egg or ground pork stew here.  the pork chop is great (crisp, but juicy and tender, with a sweetish seasoning). also includes the requisite chopped mustard greens and my favorite, sour pickled veggies (i love these so much i wanted to ask for more on the side). \n\n- mustard greens & shredded pork noodle soup:\ngood; esp nice on a cold night. the broth is light but substantial, very clear flavors. noodles in this were great as well (i think they make anything using dough fresh in-house, there's just no accounting for that taste and texture).\n\nthis is a great place for inexpensive, tasty, fresh taiwanese food w/super generous portions. the service is decent, they're actually friendlier and more helpful than many chinese joints--- if you get the older waitresses (the younger ones, i think the kids of the owner? not so much. not that they're incompetent, just not as attentive and quick). those older ladies know what they're about. \n\ni only wish that (1) this place was closer to me (though SF is better than going to SJ, and waaay closer than LA), and (2) they would include tzo dofu and fan tuan on the menu here", "rating": 4, "date": "2009-04-10"}], "szechuan hot sauce noodles": [{"excerpts": ["Taiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\n"], "author": "Mr. D.", "review": "2 Words- Amazing food!!!\n I Recommend  the Dim Sum!!\nTaiwan country favorite spareribs, salt and pepper pork chops, Szechuan hot sauce noodles, dry braised green beans, and onion pan cakes are my top 5 dishes. \n\nFresh Chinese donuts daily, and they are delicious with their fresh sweet soy milk! \n\nWhenever I'm in the area I have to come here because the servers are the best. Especially George, he always makes me laugh. The things we talk about together is just Hilarious.  \n\nSometimes when Im not feeling well won ton soup is the way to go. I honestly recommend this place because service is amazing, food is amazing, perfect atmosphere, and great prices.", "rating": 5, "date": "2015-03-26"}, {"excerpts": ["For 2 people, we ordered the sweet fresh soymilk, a Chinese doughnut for dipping, spicy wontons and Szechuan Hot Sauce Noodles. ", "Szechuan Hot Sauce Noodles - ", "These were sooo good! ", "The noodles are the kind you usually see in northern Chinese noodle dishes. ", "I don't think they were homemade, though. ", "I really couldn't point out every ingredient in the sauce, but it was super tastey. ", "Items I could point out were ground pork, peanut sauce, tons of hot sauce and and green onions. ", "The dish was so big, we had to take it home some leftovers. ", "The downside is this makes terrible leftovers. ", "The noodles soaked up the sauce, making the noodles mushy. "], "author": "Sam L.", "review": "I was on the hunt for jook (Chinese rice porridge) in the Richmond district, but decided to try for a northern Chinese breakfast at Taiwan Restaurant instead.\n\nThe scene:\n\nAt 11:30am, we were one of the first customers of the day, and the man at the front of the restaurant was frying up some homemade Chinese donuts.\n\nTaiwan Restaurant has a lengthy 4-page menu with items varying from \"Northern Chinese Specialties\" to a variety of dry and soupy noodle dishes. They even have an impressive selection of fried breads which are probably made with lard, but who's counting calories, right?\n\nThe food:\n\nFor 2 people, we ordered the sweet fresh soymilk, a Chinese doughnut for dipping, spicy wontons and Szechuan Hot Sauce Noodles. All came out to about $20.\n\nSoymilk and Chinese doughnut- Disappointingly, the soymilk was lukewarm. One of my pet peeves at a restaurant is lukewarm dishes. However, the doughnuts were fresh. We only ate half of it since it was so big.\n\nSpicy Wontons - The wontons themselves were really good, but it wasn't spicy at all. The skins were thicker than I'm used to, but it was al dente - the way I like it. The meat was super juicy too. The sauce was basically just soy sauce. I didn't see any chili flakes or chili oil in it.\n\nSzechuan Hot Sauce Noodles - These were sooo good! The noodles are the kind you usually see in northern Chinese noodle dishes. I don't think they were homemade, though. I really couldn't point out every ingredient in the sauce, but it was super tastey. Items I could point out were ground pork, peanut sauce, tons of hot sauce and and green onions. The dish was so big, we had to take it home some leftovers. The downside is this makes terrible leftovers. The noodles soaked up the sauce, making the noodles mushy. Dang!\n\nTaiwan Restaurant seems to be a popular restaurant in the Richmond. They seem to be specifically known for their breakfast/lunch items. I'd like to come back to try a noodle soup.", "rating": 3, "date": "2010-03-16"}, {"excerpts": ["I ordered their Chicken Dumplings, Crispy Prawns (a daily special), Dry Green Beans (a daily special), Green Onion Pancake (not on the menu), Mongolian Beef, Szechuan Hot Sauce Noodles, and Wok-Fried Rice Cakes with Pork and Chinese Cabbage. ", "Food wasn't too salty or, in the case of the Mongolian Beef and Szechuan Hot Sauce Noodles, spicy. ", "With the exception of the overcooked, pasty and bland Wok-Fried Rice Cakes, I would recommend all the dishes, especially the Szechuan Hot Sauce Noodles that is not your usual chow mein but is topped with ", "I think some kind of peanut sauce."], "author": "Cliff W.", "review": "My first time at this establishment and, in particular, eating Taiwanese food was a satisfying experience. The wait staff was friendly, attentive and helpful for a mid-week, early afternoon lunch hour. The vibe and atmosphere of the restaurant was great: it was a calm and quiet setting to enjoy a nice lunch.\n\nI got a sense they take pride in preparing meals for their patrons. For instance, the garlic, onions, and bamboo shoots used in their entrees were finely chopped, unlike other Chinese restaurants, where it's apparent less effort was involved in the preparation. Their food reminded me of home-style cooking, atypical of the oily and greasy Chinese fare one might expect. While food arrived at a nice pace, I didn't feel rushed to finish eating.\n\nI ordered their Chicken Dumplings, Crispy Prawns (a daily special), Dry Green Beans (a daily special), Green Onion Pancake (not on the menu), Mongolian Beef, Szechuan Hot Sauce Noodles, and Wok-Fried Rice Cakes with Pork and Chinese Cabbage. Food wasn't too salty or, in the case of the Mongolian Beef and Szechuan Hot Sauce Noodles, spicy. With the exception of the overcooked, pasty and bland Wok-Fried Rice Cakes, I would recommend all the dishes, especially the Szechuan Hot Sauce Noodles that is not your usual chow mein but is topped with I think some kind of peanut sauce.", "rating": 4, "date": "2011-12-05"}, {"excerpts": ["Must have dishes are Bean and Meat Sauce Noodles, Szechuan Hot Sauce Noodles (the vegetarian one is just as good, they just don't put pork), and Fish-flavored Egg Plant.\n\n"], "author": "Jason T.", "review": "Taiwan Restaurant is my favorite place to eat in SF.\n\nThe food is VERY affordable with generous portions and tastes awesome. Though, I'm sure the MSG will kill us all sooner than we'd like.\n\nMust have dishes are Bean and Meat Sauce Noodles, Szechuan Hot Sauce Noodles (the vegetarian one is just as good, they just don't put pork), and Fish-flavored Egg Plant.\n\nThe only thing I would stay away from at this place is the lamb. The beef variants are fine. It's just that the lamb at this place never seems right.\n\nAs a kid I always enjoyed watching the sous chefs prepare the dumplings in the front of the restaurant. Really nice touch to show everyone that the food is freshly made.", "rating": 5, "date": "2009-01-04"}, {"excerpts": ["some suggestions to try would be their mustard green and pork soup noodles, szechuan hot sauce noodles, pork chop noodle soup, bean and meat sauce noodle, potstickers (of course) and of course the shanghai dumplings."], "author": "Jeannie W.", "review": "i have been going to this restaurant for many years now.  used to come here pretty often.  so much so that one of the chefs that makes the potstickers and shanghai dumplings would remember what we ordered each time and prepare our potstickers as soon as we sat down.  had a major craving for shanghai dumplings after i came back from my trip to china, so i thought i'd try to relive the memory of eating shanghai dumplings in shanghai by coming to taiwan restaurant.  i've never been disappointed by this restaurant before, but nothing compares to eating REAL shanghai dumplings in shanghai.  unfortunately, when i took a bite of my shanghai dumpling, it didn't bring me back to shanghai.  don't get me wrong, it was still good, but it just didn't compare to my experience in shanghai.  i guess i somehow was tainted by the experience of eating REAL shanghai dumplings and now nothing else will compare.  overall, taiwan is a good place to eat potstickers, their noodle dishes are tasty and cheap, and their lunch specials (that are only served during weekdays) are well worth the price.  some suggestions to try would be their mustard green and pork soup noodles, szechuan hot sauce noodles, pork chop noodle soup, bean and meat sauce noodle, potstickers (of course) and of course the shanghai dumplings.", "rating": 4, "date": "2007-02-08"}], "braised beef ligament noodles soup": [], "braised lamb soup noodles": [], "wokfried shanghai thick noodles": [], "wokfried rice cakes with pork and chinese cabbage": [], "pork chop on steamed rice": [], "pork chop on soup noodles": [], "japanese seafood noodles": [], "sesame paste and meat sauce noodles": [], "beef chow fun": [{"excerpts": ["We ordered the Jia Jia Mien ( noodles with meat sauce, beef chow fun, 2 orders of pot stickers (6 to an order) and an order of xiao long bao (6 to an order).  "], "author": "Erik H.", "review": "Probably the best pot stickers and xiao long bao on Clement St.  Amazingly my kids love this place despite its crowded and old decor.  Forget that they have a piece of rope tying the door to a pole so the door doesnt fly open\n\nNicknamed the Chinese Pink Palace this has been around since at least the 80s. They have a wok in the window where they make their pot stickers fresh!!\n\nWe ended up here on Christmas Eve.  As my mom says,  the only things you'll find open on Christmas eve are self serve gas stations and Chinese restaurants. As a matter of fact, many Chinese restaurants on Clement St. Were closed.\n\nNobody wanted to cook after Christmas Eve services so we drove along Clement St. Until we found some lights on.  We sat down overdressed and flagged down are waiter for some menus.\n\nWhen they are busy here, you have to flag them down for everything from menus, to more hot tea, to your bill.  It is not rude.  They just staff very thinly.  In fact I think it is a family run business.\n\nWe ordered the Jia Jia Mien ( noodles with meat sauce, beef chow fun, 2 orders of pot stickers (6 to an order) and an order of xiao long bao (6 to an order).  We ate it all up\n\nI give the food a 4 but the ambiance and service a 3. Parking can normally be a pain on Clement St., but not on Christmas Eve.", "rating": 3, "date": "2014-12-26"}, {"excerpts": ["The various dumplings are tasty and fairly inexpensive, but the beef chow fun was mediocre at best. ", "I'll give this place another chance based on it's reputation, but I was fairly unimpressed with my first visit."], "author": "Ziad E.", "review": "The various dumplings are tasty and fairly inexpensive, but the beef chow fun was mediocre at best. I'll give this place another chance based on it's reputation, but I was fairly unimpressed with my first visit.", "rating": 3, "date": "2007-09-07"}], "pork chow fun": [], "chicken chow fun": [], "shrimp chow fun": [{"excerpts": ["*SHRIMP CHOW FUN -- a dish that can probably be ordered in any chinese restaurant. "], "author": "Bernice C.", "review": "The place looks like a typical run-down Chinese restaurant with tacky pink paint color and dim lighting.  I think they tried to make it classy with a dirty sunlight, but i wasn't fooled.  Never go to a restaurant starving, because we ordered a feast for 8.\n\n**HOT SWEET BEAN MILK -- had to add sugar yourself. tasted just like soy milk. nothing impressive.\n**CHINESE STYLE DONUTS [yow teew] -- best i have ever had!!!!!!!! i even ordered one to go. it was light and crispy and not too oily.  The only downside is that the place did not serve congee to eat it with.\n**CHINESE GREEN ONION PANCAKE -- not impressed.  Felt like i could buy a frozen bag of Chinese pancakes and open up a restaurant myself.\n**MONGOLIAN BEEF -- surprisingly, one of the fave dishes out of everything. flavorful and not too spicy.\n**TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. fried a little too much, it was a little hard to bite into.  strong taste of basil with it. \n**DUMPLINGS -- decent. enough said.\n**STEAMED PORK BUNS -- decent. the stuffing inside had a taro texture to it.\n**SHRIMP CHOW FUN -- a dish that can probably be ordered in any chinese restaurant. good but probably not the restaurant's specialty.\n\n\nprobably won't be a repeat customer for anything but the CHINESE STYLE DONUTS.  \n\nand guess what, we ordered so much that it became my thanksgiving dinner.  why do the food gods hate me so?!", "rating": 2, "date": "2010-11-25"}], "rice cakes soup": [], "steamed rice with meat sauce": [], "steamed rice": [{"excerpts": ["so we ordered Spare Rib Pork, Potstickers, Spinach & Garlic, Mongolian Beef, and Steamed Rice.\n\n"], "author": "Michele G.", "review": "Came to this place on a Monday during dinner time.\nIt was empty so very fast service.\n\nLots of seating!\n\nFood: I was reccomended some dishes by someone so we ordered Spare Rib Pork, Potstickers, Spinach & Garlic, Mongolian Beef, and Steamed Rice.\n\nDecently sized portion. Average/cheap pricing.\n\nThey have specials as well if you're on a budget.\n\nThoughts: Spinach & Garlic was cooked well. Good flavor.\nPork was sweet/tangy and lighty crispy. Mongolian Beef waa delicious, spicy! Potstickers are a must try!! So much flavorful and full of meat! Rice was good.\n\nOverall good food with very fast service.", "rating": 4, "date": "2017-04-20"}, {"excerpts": ["I could have just these over steamed rice every day for the rest of my life and be happy. ", "Then came the sizzling rice soup. ", "so many amazing flavors! ", "The pot stickers are also fantastic. ", "My go to spot for any special day, friendly staff that always makes us feel welcome"], "author": "Jack B.", "review": "From my first experience in this modest looking spot I was hooked! A buddy took me here and insisted on what he calls \"pork candy\" which was the pork spare ribs (dry salty rub, delicious!) They are f#$king amazing. I could have just these over steamed rice every day for the rest of my life and be happy. Then came the sizzling rice soup. so many amazing flavors! The pot stickers are also fantastic. My go to spot for any special day, friendly staff that always makes us feel welcome", "rating": 5, "date": "2016-11-26"}, {"excerpts": ["We ate family style and ordered 3 pork buns, prawns and asparagus, steamed rice, and beef ", "chow fun.  ", "I also ordered a glass of plum wine which was only $2.50."], "author": "Mieke B.", "review": "This restaurant is a small, quaint building located in the Richmond District.  The food is tasty, but is high in salt, so if you have health challenges it may not be for you.  They also use soybean oil- not healthy.  The service is adequate, but not as attentive as I prefer for my dining experience.\n\nPart of the reason it receives 3 stars as opposed to 2 stars is because of it's super cheap prices.  3 of us ate for about $25.  We ate family style and ordered 3 pork buns, prawns and asparagus, steamed rice, and beef chow fun.  I also ordered a glass of plum wine which was only $2.50.", "rating": 3, "date": "2013-09-01"}, {"excerpts": ["One time I got the lemon chicken, fried rice noodle and steamed rice. ", "When I scooped out a serving of fried rice noodle it didn't even seem like the portion in the togo box lessened. "], "author": "Charlene C.", "review": "This is my go-to spot for chinese food near my hood. I've gotten take-out from here, brought family and friends for lunches and dinners and I can't stop going back even though there are tons of chinese restaurants all over this neighborhood. \n\nI love their portion sizes. Whenever I get take out it usually lasts me for days. One time I got the lemon chicken, fried rice noodle and steamed rice. When I scooped out a serving of fried rice noodle it didn't even seem like the portion in the togo box lessened. That is awesome!\n\nI also love their noodle soups. So far I've only tried the pork chop noodle soup and the beef stew noodle soup, but they are both so yummy and comforting on a cold, rainy day. I think my new new year's resolution is to go through their entire menu.\n\nThe waitstaff here is also friendly enough. I once made an order 15 minutes before closing and they accommodated. Thank God! I also like the man making chinese donuts in the front. It's quite enticing.\n\nAll in all this is a great taiwanese spot in my opinion and I did go to UC Irvine so I have some clout in my review.", "rating": 5, "date": "2011-03-02"}, {"excerpts": ["The menu looked good, but the only think I ended up enjoying was the steamed rice! ", "We ordered pork soup (I think it's a specialty of the house), sizzling beef, and baby squids. ", "Everything was so salty it actually burned my mouth! ", "And the baby squids were waaaayyyy over garlicy (even for someone like me who cooks everything with a couple cloves of garlic!). ", "We meant to ask them to cook everything with no MSG and low salt but forgot. ", "So I partially feel that the meal could have been better ", "had we asked. "], "author": "Amy B.", "review": "I really wanted to be impressed. Really. My boyfriend had been wanting to go here for a long time so we finally tried it out. The menu looked good, but the only think I ended up enjoying was the steamed rice! We ordered pork soup (I think it's a specialty of the house), sizzling beef, and baby squids. Everything was so salty it actually burned my mouth! And the baby squids were waaaayyyy over garlicy (even for someone like me who cooks everything with a couple cloves of garlic!). We meant to ask them to cook everything with no MSG and low salt but forgot. So I partially feel that the meal could have been better had we asked. That being said, the fact that you have to ask for things to not be loaded down with salt is an issue for me in itself. \n\nWith all of the great places to try, I will definitely NOT be going back. Sorry, Taiwan. I really did want it to be good...:-(", "rating": 2, "date": "2007-07-26"}, {"excerpts": ["We ordered fried pork chop over steamed rice with preserved veggie's, a dish that resembled general chicken but was sliced beef battered with a tangy dark sauce and chicken dumplings. ", "I think we ordered too much meat, we should've ordered a vegi dish. ", "The pork chop was good, it was lightly fried. ", "Although I would probably choose the salt and pepper pork chops over that, like the ones they have in Chinese restaurants. ", "The beef dish was just okay", ", it was an American-Taiwan dish I guess. ", "As for the steam dumpings... aren't they supposed to be really juicy inside? ", "Or am I just comparing this Taiwanese restaurant to other Chinese/dim sum restaurants? ", "=/"], "author": "Vinkin Ken T.", "review": "I went here on a Monday afternoon around 2pm with fellow yelper, jason g. The place was not busy at all, it looked like there was only one waitress that waited the entire restaurant and there were only a couple of customers, so our orders were promptly taken and our orders came out quickly. We ordered fried pork chop over steamed rice with preserved veggie's, a dish that resembled general chicken but was sliced beef battered with a tangy dark sauce and chicken dumplings. I think we ordered too much meat, we should've ordered a vegi dish. The pork chop was good, it was lightly fried. Although I would probably choose the salt and pepper pork chops over that, like the ones they have in Chinese restaurants. The beef dish was just okay, it was an American-Taiwan dish I guess. As for the steam dumpings... aren't they supposed to be really juicy inside? Or am I just comparing this Taiwanese restaurant to other Chinese/dim sum restaurants? =/", "rating": 3, "date": "2010-04-30"}], "piece kuo teh": [], "piece steamed dumplings": [], "piece boiled dumplings": [], "piece vegetarian steamed dumplings": [], "piece boiled leeks shrimp": [], "piece chicken dumplings": [], "piece beef dumplings": [], "japanese seafood noodles soup": [], "taiwan dinner for": [{"excerpts": ["We chose the Taiwan dinner for two, which included black bean chicken, and prawns & peas.  ", "It appeared to be Cantonese style, you know the sauces.  ", "Short wait for the table", ", short wait for the food, short wait for the check.  ", "A solid place to go."], "author": "David D.", "review": "7:30 Thursday night we dropped in and there were 3 tables open.  The place was generally packed.  Good service, good food.  The menu had a tofu section and a vegetarian section, but best of all it had dishes from all parts of China.  The menu explains that Taiwan has eclectic Chinese cuisine.  We chose the Taiwan dinner for two, which included black bean chicken, and prawns & peas.  It appeared to be Cantonese style, you know the sauces.  Short wait for the table, short wait for the food, short wait for the check.  A solid place to go.", "rating": 4, "date": "2006-04-21"}], "peking dinner for": [], "sweet bean milk": [{"excerpts": ["So... this is how you eat a chinese fried donut with a bowl of warm sweet bean milk. ", "The soybean milk should come without sugar. ", "So, add sugar and mix till you find your perfect sweetness. ", "Next, take a piece of donut and dip into the bean milk. ", "Get it soaked and eat! ", "Easy peasy... japanesey. "], "author": "Sam T.", "review": "I remember coming to Taiwan Restaurant when I was just a kid. This would be one of the few places my parents would go to have chinese fried donut with warm sweet soybean milk. This was my chinese equivalent of a McDonald's happy meal.\n\nYears later... I finally made my return visit to Taiwan Restaurant with a group of my co-workers. Of course I ordered my chinese happy meal. To my amazement some of my co-workers... some who are chinese did not know how to eat this!\n\nSo... this is how you eat a chinese fried donut with a bowl of warm sweet bean milk. The soybean milk should come without sugar. So, add sugar and mix till you find your perfect sweetness. Next, take a piece of donut and dip into the bean milk. Get it soaked and eat! Easy peasy... japanesey. Or you can toss in a couple of pieces of donut into your bowl and eat it like cereal.\n\nAs for the rest of the menu... some winners include the chicken wings, Taiwan Seafood Rice and Dry-Braised Green Beans.\n\nThe dishes may be a little on the salty side but most of the sauces that come with the dishes are tasty.\n\nPrices are cheap... $10 bucks for a big lunch... good deal!", "rating": 4, "date": "2009-04-27"}, {"excerpts": ["**HOT SWEET BEAN MILK -- had to add sugar yourself. ", "tasted just like soy milk. ", "nothing impressive.\n", "*"], "author": "Bernice C.", "review": "The place looks like a typical run-down Chinese restaurant with tacky pink paint color and dim lighting.  I think they tried to make it classy with a dirty sunlight, but i wasn't fooled.  Never go to a restaurant starving, because we ordered a feast for 8.\n\n**HOT SWEET BEAN MILK -- had to add sugar yourself. tasted just like soy milk. nothing impressive.\n**CHINESE STYLE DONUTS [yow teew] -- best i have ever had!!!!!!!! i even ordered one to go. it was light and crispy and not too oily.  The only downside is that the place did not serve congee to eat it with.\n**CHINESE GREEN ONION PANCAKE -- not impressed.  Felt like i could buy a frozen bag of Chinese pancakes and open up a restaurant myself.\n**MONGOLIAN BEEF -- surprisingly, one of the fave dishes out of everything. flavorful and not too spicy.\n**TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. fried a little too much, it was a little hard to bite into.  strong taste of basil with it. \n**DUMPLINGS -- decent. enough said.\n**STEAMED PORK BUNS -- decent. the stuffing inside had a taro texture to it.\n**SHRIMP CHOW FUN -- a dish that can probably be ordered in any chinese restaurant. good but probably not the restaurant's specialty.\n\n\nprobably won't be a repeat customer for anything but the CHINESE STYLE DONUTS.  \n\nand guess what, we ordered so much that it became my thanksgiving dinner.  why do the food gods hate me so?!", "rating": 2, "date": "2010-11-25"}], "salty bean milk": [], "sweet soft bean curds": [], "salty soft bean curds": [], "chinese style donuts": [{"excerpts": ["*CHINESE STYLE DONUTS [yow teew] -- ", "best i have ever had!!!!!!!! ", "i even ordered one to go. ", "it was light and crispy and not too oily.  ", "The only downside is that the place did not serve congee to eat it with.\n", "*", "*CHINESE GREEN ONION PANCAKE -- not impressed.  ", "but the CHINESE STYLE DONUTS.  \n\n"], "author": "Bernice C.", "review": "The place looks like a typical run-down Chinese restaurant with tacky pink paint color and dim lighting.  I think they tried to make it classy with a dirty sunlight, but i wasn't fooled.  Never go to a restaurant starving, because we ordered a feast for 8.\n\n**HOT SWEET BEAN MILK -- had to add sugar yourself. tasted just like soy milk. nothing impressive.\n**CHINESE STYLE DONUTS [yow teew] -- best i have ever had!!!!!!!! i even ordered one to go. it was light and crispy and not too oily.  The only downside is that the place did not serve congee to eat it with.\n**CHINESE GREEN ONION PANCAKE -- not impressed.  Felt like i could buy a frozen bag of Chinese pancakes and open up a restaurant myself.\n**MONGOLIAN BEEF -- surprisingly, one of the fave dishes out of everything. flavorful and not too spicy.\n**TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. fried a little too much, it was a little hard to bite into.  strong taste of basil with it. \n**DUMPLINGS -- decent. enough said.\n**STEAMED PORK BUNS -- decent. the stuffing inside had a taro texture to it.\n**SHRIMP CHOW FUN -- a dish that can probably be ordered in any chinese restaurant. good but probably not the restaurant's specialty.\n\n\nprobably won't be a repeat customer for anything but the CHINESE STYLE DONUTS.  \n\nand guess what, we ordered so much that it became my thanksgiving dinner.  why do the food gods hate me so?!", "rating": 2, "date": "2010-11-25"}], "chinese petal buns": [], "chinese pancakes": [{"excerpts": ["Felt like i could buy a frozen bag of Chinese pancakes and open up a restaurant myself.\n", "*", "*MONGOLIAN BEEF -- surprisingly, one of the fave dishes out of everything. ", "flavorful and not too spicy.\n", "*"], "author": "Bernice C.", "review": "The place looks like a typical run-down Chinese restaurant with tacky pink paint color and dim lighting.  I think they tried to make it classy with a dirty sunlight, but i wasn't fooled.  Never go to a restaurant starving, because we ordered a feast for 8.\n\n**HOT SWEET BEAN MILK -- had to add sugar yourself. tasted just like soy milk. nothing impressive.\n**CHINESE STYLE DONUTS [yow teew] -- best i have ever had!!!!!!!! i even ordered one to go. it was light and crispy and not too oily.  The only downside is that the place did not serve congee to eat it with.\n**CHINESE GREEN ONION PANCAKE -- not impressed.  Felt like i could buy a frozen bag of Chinese pancakes and open up a restaurant myself.\n**MONGOLIAN BEEF -- surprisingly, one of the fave dishes out of everything. flavorful and not too spicy.\n**TAIWAN COUNTRY FAVORITE SPARERIBS -- sweet and tangy. fried a little too much, it was a little hard to bite into.  strong taste of basil with it. \n**DUMPLINGS -- decent. enough said.\n**STEAMED PORK BUNS -- decent. the stuffing inside had a taro texture to it.\n**SHRIMP CHOW FUN -- a dish that can probably be ordered in any chinese restaurant. good but probably not the restaurant's specialty.\n\n\nprobably won't be a repeat customer for anything but the CHINESE STYLE DONUTS.  \n\nand guess what, we ordered so much that it became my thanksgiving dinner.  why do the food gods hate me so?!", "rating": 2, "date": "2010-11-25"}], "piece shredded white tunip cakes": [], "piece sweet bean cakes": [], "fuyun eastern oyster": [], "fried shang tung vegetable dumplings": [], "spice tripe": [{"excerpts": ["the 5 spice tripe soup and other Taiwanese dishes that are A little off the beaten path for a white guy like me.  ", "overall we all 4 stuffed ourselves for 26 bucks with tip.  ", "you don't get more bang for he buck here in the city and i am actually looking forward to dinner one day."], "author": "Anthony Y.", "review": "we just got out of this place an it was good.  according to my Taiwanese gf  the oyster pancake was not very authentic according to her albeit high standards.  my favorite food was the Taiwanese doughnut deep fried.  they serve it with your choice of salty or sweet soy milk.  i preferred to try the Sweet as the doughnut was really quite salty enough.  they served it bland which i thought was odd but easily remedied as i just added sugar and stirred.  that was my favorite item that we had today.  and i hadn't seen anything like that before anywhere else in San Fran.\nI tried the oyster pancake... not for me i must say.  there was a gelatinous layer of what appeared to be a cornstarch mixture that was a little to close to slime for my liking.  i also have a a little bit more than a strong aversion to anything fishy to cross my palate as this would serve as my breakfast.  i also had the Taiwanese country spare ribs which i thought were tasty however again according to my gf not up to true Taiwanese standard.  she felt they were more Chinese than Taiwanese but good nonetheless.  \nthe steamed pork dumpling was good and the sticky rice with pork on top was good.  notice a theme here?  had it not been my first meal of the day there were actually a lot of items on the menu that looked interesting to me for example the 5 spice tripe soup and other Taiwanese dishes that are A little off the beaten path for a white guy like me.  overall we all 4 stuffed ourselves for 26 bucks with tip.  you don't get more bang for he buck here in the city and i am actually looking forward to dinner one day.", "rating": 4, "date": "2008-02-02"}], "hot boiled dumplings": [{"excerpts": ["The hot boiled dumplings had a tasty pork filling but there wasn't enough filling and there was too much dough.  ", "Also the soy sauce it was tossed in made the dumplings too salty.  ", "I noticed you can ask for low salt - we should remember to do that though I'd rather get other dumplings (these were like won tons) with less skin.  "], "author": "Lolia S.", "review": "This is another old family favorite that I've been going to for years for the Northern Chinese dim sum brunch (noodles and dumplings galore).  I don't know what their regular dishes are like.  They also have a Taiwan specialties section of the menu that looks interesting, but we always have the dim sum.  They now have pork blood casserole - yum.  \n\nTheir menu claims that they were the first restaurant in the US to serve Taiwanese food.  I don't know if that's true but they have been around for decades.  I do like walking by and watching them make fried Chinese donuts in the window.  There aren't many places where you can see that and their donuts are always fresh.  \n\nFor brunch we usually get soy milk (salted or sweet, $1.25).  It's served hot in a bowl.  Delicious.  My father says their donuts aren't as airy and light inside as they should be but I think he's comparing it to what he had in Taiwan.  \n\nTheir shredded white turnip cakes (4 per order) were huge, the size of a red bean bun and stuffed with turnip, ground pork and mushrooms.  The shell was thin and flaky on top and thicker on the bottom.  These were really good.  \n\nThe hot boiled dumplings had a tasty pork filling but there wasn't enough filling and there was too much dough.  Also the soy sauce it was tossed in made the dumplings too salty.  I noticed you can ask for low salt - we should remember to do that though I'd rather get other dumplings (these were like won tons) with less skin.  The Shanghai thick noodle was disappointing - oily and bland.  \n\nThey are trying - they will make dishes w/o msg, with less salt or hot & spicy upon request and they even have brown rice now.  The food comes out very quickly, the décor is very pink but no frills, and the prices are reasonable.", "rating": 3, "date": "2008-08-08"}, {"excerpts": ["We ordered what that the reviewer recommended, such as the hot boiled dumplings with porkand cabbage and the fried oysters. ", "Well, the fried oysters were good, but nothing outstanding. ", "They lacked that creamy ocean goo in the middle. ", "The fried pork chop noodle soup was kind of bland, and the pork chop was too gristly for me. ", "The boiled dumplings were nothing special.. just your average dumpling. ", "I would not go here again.. also, the leftovers smell kind of funny in our fridge."], "author": "O K.", "review": "I decided to go here after reading a glowing review in the SF Examiner. We ordered what that the reviewer recommended, such as the hot boiled dumplings with porkand cabbage and the fried oysters. Well, the fried oysters were good, but nothing outstanding. They lacked that creamy ocean goo in the middle. The fried pork chop noodle soup was kind of bland, and the pork chop was too gristly for me. The boiled dumplings were nothing special.. just your average dumpling. I would not go here again.. also, the leftovers smell kind of funny in our fridge.", "rating": 2, "date": "2007-03-25"}], "piece steamed pork buns": [], "spice pork ears": [], "south taiwan style soup noodle": [], "south taiwan style rice noodle": [], "sweet rice en crocksalty": [], "steamed vegetable and pork buns": [], "pieces steamed sweet bean buns": [], "steamed buns": [], "dry to fu salad": [], "cashew chicken lunch special": [], "curry chicken lunch special": [], "mandarin beef lunch special": [], "oyster sauce beef lunch special": [], "broccoli beef lunch special": [], "bean curd beef lunch special": [], "bean sprout with pork lunch special": [], "sweet and sour pork lunch special": [], "twicecooked pork lunch special": [], "vegetable deluxe lunch special": [], "broccoli chicken lunch special": [], "general tsuos chicken lunch special": [], "dry braised green beans beef lunch special": [], "dry braised green beans pork lunch special": [], "dry braised green beans chicken lunch special": [], "asparagus beef lunch special": [], "asparagus pork lunch special": [], "asparagus chicken lunch special": [], "broccoli prawns lunch special": [], "dry braised green beans prawns lunch special": [], "spicy prawns lunch special": [], "asparagus prawns lunch special": []}