{"special edamame": [{"excerpts": ["The special edamame is really special."], "author": "Kimia P.", "review": "Really good presentation. Good selection of Sake. \nThe special edamame is really special.", "rating": 5, "date": "2018-10-16"}, {"excerpts": ["Aside from the special edamame, nothing was tasty to me. ", "The beer wasn't even cold!  \n", "Service was fine ok ", "and I got my food fast."], "author": "Lucy M.", "review": "Aside from the special edamame, nothing was tasty to me. The beer wasn't even cold!  \nService was fine ok and I got my food fast.", "rating": 2, "date": "2018-02-22"}, {"excerpts": ["The special edamame was good too as a starter BC ", "it's full of flavor. ", "Get that to munch on while you sip on that sake or beer."], "author": "Jennifer V.", "review": "Food here was amazing. The sashimi combo was a good combination of each type of fish. It was all super buttery and delicious. You can definitely tell how fresh it is. I had the Tashami on fire roll and it was delicious.. they really lit the roll on fire in front of you. Omg but you like udon get the seafood udon noodle soup. I usually love ramen more but this is by far the best udon noodle I have tried to far. I will have to come back when I'm in the area. The special edamame was good too as a starter BC it's full of flavor. Get that to munch on while you sip on that sake or beer.", "rating": 5, "date": "2018-05-27"}, {"excerpts": ["Favorite dishes--special edamame (with a soy and garlic glaze, can't get enough), avocado bomb, bamboo roll! ", "Generous wine pour as well :) great for a night with friends, a date, parents in town, you name it!"], "author": "Elizabeth D.", "review": "Great little sushi spot in a convenient and fun location. Excellent atmosphere, only amplified by the lovely customer service. Grab a seat at the bar for fun conversations and enjoy watching the chefs work their magic. \n\nFavorite dishes--special edamame (with a soy and garlic glaze, can't get enough), avocado bomb, bamboo roll! Generous wine pour as well :) great for a night with friends, a date, parents in town, you name it!", "rating": 5, "date": "2017-10-08"}, {"excerpts": ["Try the special edamame, bang bang shrimp and bamboo roll.... so good!! \n", "Isaac always takes care of us and has a big smile every time we go in. ", "Love the friendly vibe of the place. \n", "Also a great spot to bring out of towners!"], "author": "Meg R.", "review": "Tamashisoul is my FAVORITE sushi spot in SF. My bf and I go there probably once a week, maybe even twice a week sometimes and it's the just best. Try the special edamame, bang bang shrimp and bamboo roll.... so good!! \nIsaac always takes care of us and has a big smile every time we go in. Love the friendly vibe of the place. \nAlso a great spot to bring out of towners!", "rating": 5, "date": "2017-06-28"}, {"excerpts": ["The happy hour included $5 special edamame, $5 beef gyoza, $5 house-warm sake, and $5 classic rolls.  \n\n"], "author": "Susan C.", "review": "Oooooooh!  I'm a fan!  This place is young and fun, yet still sophisticated and artful.  \n\nThere is a love and care to the food produced here and I found the quality of the food especially good for the price.  \n\nMy Uni Nigiri ($8) was amazing quality.  It held together as a nigiri without a \"wall-o-seaweed\" to hold it in place.  The orange uni was very good and fresh with a little black caviar on top which really made it special.  \n\nThe happy hour included $5 special edamame, $5 beef gyoza, $5 house-warm sake, and $5 classic rolls.  \n\nI had the Alaska Roll and the Spicy Tuna Roll.  I loved that there was not a ton of rice on the sushi.  I normally end up removing rice because there is too much.  The fish was very fresh and presented beautifully.   \n\nI also ordered a miso soup ($3) which I thought had great flavor and was a pretty good portion (not a super tiny bowl).  \n\nMr. Man got the beef gyoza which were lovely and fried.  I liked the beefy flavor over the traditional pork.  While the gyoza was a bit oily for my taste, I can't really complain because it was super tasty and crispy.  Mr. Man loved it and gobbled it down in seconds.\n\nService was probably one of the most excellent parts of our experience.  We sat at the bar (it was not too busy) and Jeffery and Ryan really took great care of us.  Most notably, Mr. Man has allergies to all seafood and they were really accommodating about finding things that he could eat next time we come for a full meal.  It is rare that Mr. Man a) likes a sushi place due to his allergies; b) likes anywhere without a full bar; c) would voluntarily ask if we could come back to a sushi place without a full bar soon.  Tamashisoul Sushi really charmed him, and that is a tall order.\n\nI'm a huge fan of this place!  Any sushi place that makes both of us happy is a definite winner to me!", "rating": 4, "date": "2014-12-08"}, {"excerpts": ["Special edamame - quite tasty elevation of normal edamame with some garlic-y concoction on it\nSpecial rolls ", "- I got the Tamishibow which was neat because you don't often see lobster salad with fish and of course avocado. ", "Very tasty and special saucy! "], "author": "MaryKate M.", "review": "Good sushi spot! I always pass it by but finally tried it last night with a few friends.\n\nSpecial edamame - quite tasty elevation of normal edamame with some garlic-y concoction on it\nSpecial rolls - I got the Tamishibow which was neat because you don't often see lobster salad with fish and of course avocado. Very tasty and special saucy! Friends got the Tamashi on Fire and Bamboo, both enjoyed!\nMiso soup - classic miso soup is good but they also have a mushroom miso for a few more dollars for lots of mushrooms and a bigger bowl!", "rating": 4, "date": "2015-01-29"}, {"excerpts": ["I came in at 7pm on a weeknight to order one roll and special edamame. ", "I have made sushi before ", "and I'm fully aware that it only takes about 30 seconds to roll a roll. ", "The edamame only needs 5 or 10 minutes to fry. ", "So, why did it take OVER 45 minutes to get my to-go order? ", "With no explanation or apology for the wait, I left a not happy camper and a bad taste in my mouth about the service here."], "author": "Amanda R.", "review": "Very good sushi joint in cow hollow. \nI have been here multiple times and tried the following rolls/dishes:\n-Rainbow\n-Spider\n-Red hot chili pepper (great, but a little small)\n-California Classic \n-Spicy tuna classic\n-Special edamame (fried in soy sauce, garlic, and maybe a little ginger)\n-Draft beer\n\n\nThe sushi has always been fresh, reasonably priced, and flavorful. \n\nI am knocking off a star because of the terrible to-go service. I came in at 7pm on a weeknight to order one roll and special edamame. I have made sushi before and I'm fully aware that it only takes about 30 seconds to roll a roll. The edamame only needs 5 or 10 minutes to fry. So, why did it take OVER 45 minutes to get my to-go order? With no explanation or apology for the wait, I left a not happy camper and a bad taste in my mouth about the service here.", "rating": 4, "date": "2015-01-04"}, {"excerpts": ["There fish is so fresh and their special edamame is fantastic! ", "Unfortunate they don't have hard alcohol any more."], "author": "Caitlin M.", "review": "Love this sushi place! There fish is so fresh and their special edamame is fantastic! Unfortunate they don't have hard alcohol any more.", "rating": 4, "date": "2018-02-22"}, {"excerpts": ["My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\n"], "author": "David L.", "review": "I'm a fan of Tamashis. Eat there about once a month. Haven't met a roll I didn't like (except the one with cream cheese, but I think that's a personal preference). My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\nTakes reservations (Open table). Trendy spot. Can get pretty loud when full. But I keep coming back.", "rating": 4, "date": "2017-02-17"}, {"excerpts": ["The \"special edamame\" is delicious, with great flavor for the garlic lovers out there. "], "author": "Derek S.", "review": "I love Tamashisoul! The \"special edamame\" is delicious, with great flavor for the garlic lovers out there. Every roll I have tried has been really tasty as well: Double Shrimp, Bamboo, King Salmon, Tuna Love. They have some great sashimi options as well. It is a small and cozy spot and the service is efficient so it is always has been a great experience whether there to dine in or take out.", "rating": 4, "date": "2016-06-25"}, {"excerpts": ["We had red hot chilli popper, bamboo and special edamame. ", "Everything was delicious and fresh! ", "Def coming back"], "author": "Oliver W.", "review": "The sushi was awesome! And out waiter, Jeff, went above and beyond. Constantly checking in and refilling waters. \n\nWe had red hot chilli popper, bamboo and special edamame. Everything was delicious and fresh! Def coming back", "rating": 5, "date": "2015-12-08"}], "goyza": [], "yellow tail kama": [], "shrimp flambe": [], "torched muscles": [], "stuffed jalapeno tempura": [], "miso mushroom soup": [{"excerpts": ["I had an avocado bomb as a server recommend, then had a house salad ,miso mushroom soup, for the main dish i had a sashimi combination which is like well set up course meal. ", "And the specialized sake for sushi was fit for my meal as server Jeffry recommended. ", "Besides the atmosphere and the vibe were beautiful and made me happy night!!  ", "Everything was perfect since i walk into this place. ", "I will definitely come here again. ", "This is the real sushi place in sf."], "author": "HyeMin K.", "review": "This restaurant made me write a review for the first time on yelp!!! \nBecause im not good at writing good words for food. But im a sushi eater as like other asian. There are lots of sushi place iv been in sf but this place is different with others.it was special experience that i found this place . I was surprise that the fish quality was sooo good and fresh for the price. And it was fine dining and they served food in order like appetizer,salad,soup and main dish. I felt like they were watching me while im eating because all the food came out right after finished a dish by order. I had an avocado bomb as a server recommend, then had a house salad ,miso mushroom soup, for the main dish i had a sashimi combination which is like well set up course meal. And the specialized sake for sushi was fit for my meal as server Jeffry recommended. Besides the atmosphere and the vibe were beautiful and made me happy night!!  Everything was perfect since i walk into this place. I will definitely come here again. This is the real sushi place in sf.", "rating": 5, "date": "2014-12-09"}], "tuna mango salad": [{"excerpts": ["My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\n"], "author": "David L.", "review": "I'm a fan of Tamashis. Eat there about once a month. Haven't met a roll I didn't like (except the one with cream cheese, but I think that's a personal preference). My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\nTakes reservations (Open table). Trendy spot. Can get pretty loud when full. But I keep coming back.", "rating": 4, "date": "2017-02-17"}, {"excerpts": ["Tried the Tuna Mango Salad, tuna was fresh and wasn't fishy and the amount of mango that was in the salad was perfect, wasn't too much. ", "It didn't take over the salad, but it was enough where i can still taste it, all the ingredients harmonized and complimented each other very well.\n"], "author": "Juyoung K.", "review": "I've eaten here few times now and decided to finally write a review, I like to try few times before I actually rate and write a review. didn't have to wait because the group i went to had reservation. The place was packed, but hey it was the weekend, just means food is fresh.\nPlace is awesome, like the music they play, the display on the wall is cool and its clean, like the tables, the bar area, and the restroom etc.\nPeople there are super friendly and attentive.\n\nThe most important part of the review - the food. I'm not a huge sushi or seafood fan but this place, it's really good. Food is a form of art, and the way they arranged their plates looked beautiful and tasted good.\nMiso soup was good, it wasn't too salty or chalky like sometimes you can kinda feel the miso soup power stuff, this place didn't have that. \nTried the Tuna Mango Salad, tuna was fresh and wasn't fishy and the amount of mango that was in the salad was perfect, wasn't too much. It didn't take over the salad, but it was enough where i can still taste it, all the ingredients harmonized and complimented each other very well.\nI had Tamashi on Fire, Volcano, Spider, and the Red Hot chili pepper roll.\nThe Red Hot Chili Pepper roll was especially good with spicy tuna, asparagus and jalapeno with tuna, hot peppers and yellowish orangeish fish eggs. again all the ingredients came together perfectly without one flavor dominating the other ingredients.\nyou can tell the chefs are seasoned chefs and knows what they are doing.\nlove this place!", "rating": 5, "date": "2015-02-12"}], "pepper tuna salad": [], "seared salmon salad": [], "seared tuna steak": [], "onion seared albocore steak": [], "king crabsnow crablobster": [], "tempura udon soup": [{"excerpts": ["My tempura udon soup was very good! ", "My husband's chicken yaki udon wasn't that good, though... ", "A bit too vinegar-y tasting, and not much in it.  ", "The atmosphere is nice, though, but the prices were quite high.  ", "It was ok, but I wouldn't go back there again."], "author": "Leanne J.", "review": "There were good parts and not so good parts about our meal.  I was surprised that you have to pay for the green tea (and it's a tea bag, not brewed) :( We ordered a special roll as an appetizer, but it came at the same time as our food.  The roll was OK, which was not what you hope for out of a $12 roll. My tempura udon soup was very good! My husband's chicken yaki udon wasn't that good, though... A bit too vinegar-y tasting, and not much in it.  The atmosphere is nice, though, but the prices were quite high.  It was ok, but I wouldn't go back there again.", "rating": 3, "date": "2018-01-09"}], "chicken yaki udon stirfry": [], "seafood yaki udon stirfry": [], "sushi comination": [], "sashimi combo omakaze chef choice": [], "sushi combo omakaze chef choice": [], "classic rolls": [{"excerpts": ["The happy hour included $5 special edamame, $5 beef gyoza, $5 house-warm sake, and $5 classic rolls.  \n\n"], "author": "Susan C.", "review": "Oooooooh!  I'm a fan!  This place is young and fun, yet still sophisticated and artful.  \n\nThere is a love and care to the food produced here and I found the quality of the food especially good for the price.  \n\nMy Uni Nigiri ($8) was amazing quality.  It held together as a nigiri without a \"wall-o-seaweed\" to hold it in place.  The orange uni was very good and fresh with a little black caviar on top which really made it special.  \n\nThe happy hour included $5 special edamame, $5 beef gyoza, $5 house-warm sake, and $5 classic rolls.  \n\nI had the Alaska Roll and the Spicy Tuna Roll.  I loved that there was not a ton of rice on the sushi.  I normally end up removing rice because there is too much.  The fish was very fresh and presented beautifully.   \n\nI also ordered a miso soup ($3) which I thought had great flavor and was a pretty good portion (not a super tiny bowl).  \n\nMr. Man got the beef gyoza which were lovely and fried.  I liked the beefy flavor over the traditional pork.  While the gyoza was a bit oily for my taste, I can't really complain because it was super tasty and crispy.  Mr. Man loved it and gobbled it down in seconds.\n\nService was probably one of the most excellent parts of our experience.  We sat at the bar (it was not too busy) and Jeffery and Ryan really took great care of us.  Most notably, Mr. Man has allergies to all seafood and they were really accommodating about finding things that he could eat next time we come for a full meal.  It is rare that Mr. Man a) likes a sushi place due to his allergies; b) likes anywhere without a full bar; c) would voluntarily ask if we could come back to a sushi place without a full bar soon.  Tamashisoul Sushi really charmed him, and that is a tall order.\n\nI'm a huge fan of this place!  Any sushi place that makes both of us happy is a definite winner to me!", "rating": 4, "date": "2014-12-08"}, {"excerpts": ["Happy Hour is from 5:00-6:30PM with 30% off classic rolls and skewers. ", "The classic rolls are typically $7 "], "author": "Sangita A.", "review": "Happy Hour is from 5:00-6:30PM with 30% off classic rolls and skewers. The classic rolls are typically $7 so they came out to $4.90/roll.\n\nNo website yet which I would really work on quickly so people can see the wide variety of food this place has to offer.\n\nFood:\n+Mushroom Miso Soup- too salty for me, but they don't skimp on the mushrooms\n+Seaweed Salad- pretty tasty!\n+Albacore Tuna Roll- 8 pieces of flavorful tuna that doesn't need a soy sauce to dip it in. it was a tad too sweet for me though\n+Vegetable Roll- pretty basic but they'll customize it to add whatever you want in it\n+Spicy Hamachi Roll- pretty tasty and filling with jalapeno pieces on top\n\nService:\nWe've always been one of 1-3 tables in there so service was fast and attentive.\n\nAmbience:\nSmall, clean sushi bar/restaurant. You can sit at the bar or at a table. The music is upbeat and I enjoyed it.\n\n-Hungry Hungry Pongy", "rating": 3, "date": "2013-11-13"}], "spicy tuna tar tar": [{"excerpts": ["- Spicy Tuna Tar Tar\n- King Salmon\n- Tamashi "], "author": "L N.", "review": "Great food and awesome service! All the plates we ordered were excellent:\n- Spicy Tuna Tar Tar\n- King Salmon\n- Tamashi On Fire\n\nAlso I forgot my credit card at the restaurant, and the staff called me immediately after they noticed. I really appreciate their honesty.\n\nA great restaurant all in all!", "rating": 5, "date": "2017-08-17"}, {"excerpts": ["Everything we ordered was great and especially loved the smoky flavor of the red hot snapper and spicy tuna tar tar. \n\n"], "author": "Yvonne L.", "review": "Walked in here after watching the Warriors game next door and surprised at how good the sushi is! Everything we ordered was great and especially loved the smoky flavor of the red hot snapper and spicy tuna tar tar. \n\nI do agree with the other reviews that service is slow and glasses were dirty that we asked for new ones.", "rating": 4, "date": "2016-05-23"}, {"excerpts": ["Spicy Tuna Tar Tar ($13)- my hub is rather picky about this dish because it never comes out to how he wants it sometimes. ", "This one was delish. ", "It 4 layers from the bottom with seaweed salad, a layer of a more sweeter and spicy tuna mix, layer of avocado, and then a top layer of tuna ", "but it is mixed with tempura crisps. ", "If you aren't a big fan of the risps like me, i'm sure they can not include it. ", "it comes with a quail egg as well and also taro chips. ", "great presentation and very flavorful. "], "author": "Tao Tao W.", "review": "I have had this place bookmarked since it opened and decided to go today since it was also the Union Street Festival. We totally should have gone earlier and we will def be back. Its right in the heart of the Union St amongst all the shops. Very posh set up with open windows and doors to give it a breezy and welcoming feel. they also have a full bar. We got 2 salads and sashimi. Nice portions and very fresh and quality sashimi. Only two small things - we got hot tea and they serve it in your own little tea pot. It wasn't as hot as we would have liked. Also we got our salads really quick but seemed to have taken longer than neccesary for our main dishes. We were one of 4 other tables and there were two sushi chefs. \n\nHouse Salads - $5 but they are actually quite big servings and just letttuce like a lot of other sushi restaurants. It's a 50/50 blend that comes with a ginger dressing. \n\nSpicy Tuna Tar Tar ($13)- my hub is rather picky about this dish because it never comes out to how he wants it sometimes. This one was delish. It 4 layers from the bottom with seaweed salad, a layer of a more sweeter and spicy tuna mix, layer of avocado, and then a top layer of tuna but it is mixed with tempura crisps. If you aren't a big fan of the risps like me, i'm sure they can not include it. it comes with a quail egg as well and also taro chips. great presentation and very flavorful. Hubs even liked the taro chips\n\nSashimi Omakase ($50) - So worth it, so delish, and so fresh. The cuts are just the right size and you get quite a variety including blue fin tuna, hotati, amaebi, monk fish liver, uni, white tuna, salmon, ikura, saba and a couple of other cuts and a spicy tako mix. \n\nUnagi Sashimi ($6) - I love a good piece of Unagi and this is what gave it that extra star. For $6, I got two huge pieces that were melt in your mouth tender and tasty. So delish and so tasty...", "rating": 5, "date": "2015-06-07"}, {"excerpts": ["Definitely get: Avocado Bomb & Spicy Tuna Tar Tar. ", "The Spicy Tuna Tar Tar was probably the best combination of raw fish I've had in a really really long time.  ", "Avocado, tuna, whatever that delicious sauce was. "], "author": "Reyana F.", "review": "My new favorite sushi spot in the city. I wasn't expecting it but holy CRAP! I've never seen anything like it.\n\nDefinitely get: Avocado Bomb & Spicy Tuna Tar Tar. The Spicy Tuna Tar Tar was probably the best combination of raw fish I've had in a really really long time.  Avocado, tuna, whatever that delicious sauce was. Oh my.\n\nOther good things: Red Hot Chili Pepper roll, Double Shrimp.  The real winners here though are the specialty sushi.\n\nAtmosphere: pretty casual and loud, it's definitely a spot where people go before going out. Super good and I will DEFINITELY be making a trip back to the Marina to go here soon again.", "rating": 5, "date": "2016-04-03"}, {"excerpts": ["MUST Try - \nSpicy tuna tar tar ($13)\n"], "author": "Payal B.", "review": "A good neighborhood sushi bar. Fish is always very fresh. They have have a good list of options in their menu.\n\nMUST Try - \nSpicy tuna tar tar ($13)\nRed Hot chili pepper roll ($12)\nLion King ($11)\nTempura fried ice cream \n\nAverage -\nTamashi on Fire ($14)\n\nDefinitely my go to place for sushi craving!", "rating": 4, "date": "2015-06-02"}, {"excerpts": ["We started with the spicy tuna tar tar, hamachi carpaccio, 5 pieces of sashimi. ", "The server Minh recommended a specific type of sake for our taste. ", "He is fantastic! "], "author": "Victoria T.", "review": "Best sushi I've had ever! We started with the spicy tuna tar tar, hamachi carpaccio, 5 pieces of sashimi. The server Minh recommended a specific type of sake for our taste. He is fantastic! Then we had the bamboo roll and the tuna love. Wow! Service and food is more than deserving of 5 stars!", "rating": 5, "date": "2014-06-14"}], "avocado bomb": [{"excerpts": ["Started with the Avocado Bomb, then ordered the Tamashibow, King Salmon, Lion King and Crunch Dragon. ", "All very tasty. ", "For desert I highly recommend the mochi. ", "The service was nice too. ", "Cons: the place has a funny smell and tables are a bit sticky. ", "Still deserves 5 stars for the great food."], "author": "Rafic K.", "review": "Started with the Avocado Bomb, then ordered the Tamashibow, King Salmon, Lion King and Crunch Dragon. All very tasty. For desert I highly recommend the mochi. The service was nice too. Cons: the place has a funny smell and tables are a bit sticky. Still deserves 5 stars for the great food.", "rating": 5, "date": "2018-02-21"}, {"excerpts": ["We ordered the avocado bomb (so good and our kids ate it without even knowing what it was.  "], "author": "Blake B.", "review": "We were looking for a nearby sushi place one night and Tamashisoul came up so we tried it out.  We didn't have a reservation but we were there early so we were able to be seated right away.  I'm glad we did because we had a wonderful meal.  The staff was very helpful and gave us a few suggestions on what to order.  How was HyeJi able to remember our entire order without writing it down I'm not sure but it was impressive.\n\nWe ordered the avocado bomb (so good and our kids ate it without even knowing what it was.  We also go the Tamashi on Fire (great taste and presentation), red hot chili pepper.  Everything we had was delicious.  Our kids had gyozo, edamame, avocado roll and cucumber roll and loved their meal as well.\n\nIf you're looking for a great sushi spot in the Marina, look no further than here.  We'll be back for sure.", "rating": 5, "date": "2017-12-02"}, {"excerpts": ["Probably not going to order from here again, although the avocado bomb everyone is talking about reminds me of a delicious dish that was similar looking...", "so I could be back for that."], "author": "Nicole H.", "review": "Yelp, you let me down again. Either that, or it's very difficult to do delivery sushi well at all.\n\nI got an amaebi nigiri and a chirashi. The presentation on both dishes were quite lacking. The shrimp's flesh was an almost grey-greenish color, although it tasted fine and was quite meaty. It was over a bed of cucumbers that was starting to water, as if they'd been cut for a while. The ginger and wasabi were thrown into the container haphazardly.\n\nAs for the chirashi, the fish ranged from slightly unfresh tasting (salmon) to solidly fishy (tuna). Unlike more tasty sushi spots, the fish here was also quite solid. I will credit them for giving sizeable chunks of fish though. \n\nProbably not going to order from here again, although the avocado bomb everyone is talking about reminds me of a delicious dish that was similar looking...so I could be back for that.", "rating": 2, "date": "2016-12-23"}, {"excerpts": ["We started with the Avocado Bomb from the specialty items, it was amazing! ", "I highly recommend this. "], "author": "Julia M.", "review": "Three and a half stars for this place! The service was good but the tables were a little cramped. We were basically eating dinner with the couple next to us lol I like the diversity of their menu (we love when sushi places have specialty items). We started with the Avocado Bomb from the specialty items, it was amazing! I highly recommend this. For rolls, we had the Red Hot Snapper, the Red Hot Chili Pepper, and the Las Vegas. All the rolls were good but not great! We were also a little disappointed with how little they were.\n\nOverall good, not incredible though", "rating": 3, "date": "2017-03-30"}, {"excerpts": ["Favorite dishes--special edamame (with a soy and garlic glaze, can't get enough), avocado bomb, bamboo roll! ", "Generous wine pour as well :) great for a night with friends, a date, parents in town, you name it!"], "author": "Elizabeth D.", "review": "Great little sushi spot in a convenient and fun location. Excellent atmosphere, only amplified by the lovely customer service. Grab a seat at the bar for fun conversations and enjoy watching the chefs work their magic. \n\nFavorite dishes--special edamame (with a soy and garlic glaze, can't get enough), avocado bomb, bamboo roll! Generous wine pour as well :) great for a night with friends, a date, parents in town, you name it!", "rating": 5, "date": "2017-10-08"}, {"excerpts": ["We ordered four rolls total: the avocado bomb and the spicy red snapper are the only two who's name I can remember. ", "What really stood out about this establishment was how impressively FRESH the fish was! ", "It was quite obvious it was recently caught. ", "The rolls aren't overpowered with unnecessary sauces or ingredients. "], "author": "Kyle J.", "review": "This sushi place is INCREDIBLE. My girlfriend and I came for a Sunday lunch, around 1PM or so and we sat immediately at the bar. Hot sake, and two large Sapporo's were ordered and came immediately. The bartender (our server) was extremely attentive.\n\nWe ordered four rolls total: the avocado bomb and the spicy red snapper are the only two who's name I can remember. What really stood out about this establishment was how impressively FRESH the fish was! It was quite obvious it was recently caught. The rolls aren't overpowered with unnecessary sauces or ingredients. Just simple, fresh, bite-size deliciousness. \n\nI wish I could come here more often, but being that I was only visiting SanFran I can't! Next time I'm in town, I'll certainly be back. I would recommend it to everyone.", "rating": 5, "date": "2017-03-14"}, {"excerpts": ["We got the Torched Salmon, Avocado Bomb, Kamikaze and Tamashi on Fire. ", "I've seen the fiery sushi concept before and love the concept of it, and the roll was delicious. ", "Their sushi rolls are pretty good here but is rather expensive. ", "The very much ranted Avocado Bomb was alright. ", "I personally didn't find anything too special about it for the price I had to pay."], "author": "Kaye T.", "review": "Is anyone else really annoyed of how the menu is formatted on the website? I'm trying to write a review so I can remember what I ordered but the menu on the website is really impractical! LOL. Don't worry, I'm not writing a review based on that though!!! This place was pretty good. It wasn't too busy when my family and I ate here, so I can't really say much about this place being understaffed. The service here was really great and it's has a pretty quiet atmosphere. We got the Torched Salmon, Avocado Bomb, Kamikaze and Tamashi on Fire. I've seen the fiery sushi concept before and love the concept of it, and the roll was delicious. Their sushi rolls are pretty good here but is rather expensive. The very much ranted Avocado Bomb was alright. I personally didn't find anything too special about it for the price I had to pay.", "rating": 4, "date": "2017-06-07"}, {"excerpts": ["The avocado bomb, the noodles and chicken teriyaki. ", "The unagi ball was the same. ", "We were 5 people and they charged us 20% gratuity plus 3.5% SF service on top of taxes ", "and there was no mention of that on the menu."], "author": "Sharon S.", "review": "We were very disappointed here. Based on the reviews we thought the sushi will be authentic. Everything we ordered was swimming in sauce and too sweet. The avocado bomb, the noodles and chicken teriyaki. The unagi ball was the same. We were 5 people and they charged us 20% gratuity plus 3.5% SF service on top of taxes and there was no mention of that on the menu.", "rating": 2, "date": "2018-05-27"}, {"excerpts": ["but we got the avocado bomb, red hot snapper, bamboo, tamashi on fire, and vanilla tempera ice cream. \n\n"], "author": "Amy Y.", "review": "Came here with my bf and loved this place. We came here after work so it was kind of later in the night and it's located on union street. We drove here and there were lots of parking which was great!! The girl that served us was so sweet and the man that was there was so wonderful too. He kept checking on us and made sure we were good. \n\nThe bummer part was that they charged for green tea. I feel like they shouldn't charge anyone, i MEAN IT IS a japanese restaurant after all... but we got the avocado bomb, red hot snapper, bamboo, tamashi on fire, and vanilla tempera ice cream. \n\nI have to say that the two rolls on fire were pretty interesting to watch.\nBambo was covered in a sweet and sour sauce which, I liked a lot but my bf didn't.  \n\nThe best thing and MUST get is the tempera ice cream. I'm usually not a huge fan of tempera ice cream but woah this was dry good! I absolutely loved ice cream! It tasted amazing!! The flour was perfect and it was huge!!! \n\nThe two roles were pretty much had been topped with mayo and some dot of hot sauce. Wasn't too impressed. \n\nService A+ \nFish very fresh A\nThe method of the sushi was mediocre so I give it a B.", "rating": 4, "date": "2016-02-02"}, {"excerpts": ["Korean flare, from the Avocado Bomb, to the Chef choice nigiri. ", "My new favorite is the tomashibow."], "author": "Bob B.", "review": "My wife hates rice, so when I'm visiting my son in San Francisco, this place is the only place I want to eat. We always sit at the bar and have come to expect polite service, (sometimes can be a little slow) and some of the freshest fish. I understand this isn't a classic Japanese place, but that is why I like it. Korean flare, from the Avocado Bomb, to the Chef choice nigiri. My new favorite is the tomashibow.", "rating": 5, "date": "2017-10-09"}, {"excerpts": ["My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\n"], "author": "David L.", "review": "I'm a fan of Tamashis. Eat there about once a month. Haven't met a roll I didn't like (except the one with cream cheese, but I think that's a personal preference). My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\nTakes reservations (Open table). Trendy spot. Can get pretty loud when full. But I keep coming back.", "rating": 4, "date": "2017-02-17"}, {"excerpts": ["Favorite items so far: avocado bomb, bamboo roll, gyoza, tamashi on fire roll, red hot snapper roll and spicy tuna hand roll!"], "author": "Alyssa C.", "review": "Have been here twice and am already obsessed! Favorite sushi spot in SF so far, and it's so well located for grabbing drinks or hitting bars post dinner. Excellent service from our waiter, he doted on us but not to an annoying extent. The restaurant itself is stylish and usually always pretty busy which creates a fun environment. I would suggest making a reservation here for weekend nights, they tend to get busy around 7/7:30. \n\nFavorite items so far: avocado bomb, bamboo roll, gyoza, tamashi on fire roll, red hot snapper roll and spicy tuna hand roll!", "rating": 5, "date": "2016-10-29"}, {"excerpts": ["Definitely get: Avocado Bomb & Spicy Tuna Tar Tar. ", "The Spicy Tuna Tar Tar was probably the best combination of raw fish I've had in a really really long time.  ", "Avocado, tuna, whatever that delicious sauce was. "], "author": "Reyana F.", "review": "My new favorite sushi spot in the city. I wasn't expecting it but holy CRAP! I've never seen anything like it.\n\nDefinitely get: Avocado Bomb & Spicy Tuna Tar Tar. The Spicy Tuna Tar Tar was probably the best combination of raw fish I've had in a really really long time.  Avocado, tuna, whatever that delicious sauce was. Oh my.\n\nOther good things: Red Hot Chili Pepper roll, Double Shrimp.  The real winners here though are the specialty sushi.\n\nAtmosphere: pretty casual and loud, it's definitely a spot where people go before going out. Super good and I will DEFINITELY be making a trip back to the Marina to go here soon again.", "rating": 5, "date": "2016-04-03"}, {"excerpts": ["Known for their rolls so we tried the avocado bomb and tamashi rolls along with house salads. ", "Food was mediocre. "], "author": "Stephanie T.", "review": "Had a 830 reservation for dinner on a Saturday night and this place was a zoo. 2 large parties, 1 waitress, 1 host who was doing shots with the large parties, and 2 sushi chefs for the zoo. \n\nIt was loud, unorganized and loud. Known for their rolls so we tried the avocado bomb and tamashi rolls along with house salads. Food was mediocre. Service was bad mostly because they are understaffed. \n\nI would recommend UMAMI down the street for better sushi.", "rating": 2, "date": "2015-02-07"}, {"excerpts": ["Tamashi on fire, garlic edamame and avocado bomb. ", "They also have the freshest Uni in town. ", "I'd definitely go back ", "and I highly recommend for you to try this place."], "author": "Gwen M.", "review": "5 stars for good service, fresh fish, great food selection, cozy ambiance and the restaurants's cleanliness. Few of my favorites are: Tamashi on fire, garlic edamame and avocado bomb. They also have the freshest Uni in town. I'd definitely go back and I highly recommend for you to try this place.", "rating": 5, "date": "2015-12-27"}, {"excerpts": ["The fish was good quality, the avocado bomb was amazing\n\nCons:\n"], "author": "Josh L.", "review": "Decent sushi place.  I was went here solely out of my love for sushi and good yelp reviews.  Upon entry, the restaurant smelled fishy, not the good fishy, but not enough to turn me away.  The floors were so sticky that my girlfriend's sandals stuck a few times.  The server was rude and did not seem to enjoy working there.  \n\n2 stars because:\n\nPros:\nThe fish was good quality, the avocado bomb was amazing\n\nCons:\nThe sushi came preseasoned (with wasabi? We were not told what it was, but he said \"preseasoned\"), the dishes were over-salted.\nLost points on cleanliness: my beer glass had dishwater in it, the diet coke tastes like dish soap. The floor was sticky and the server was rude.", "rating": 2, "date": "2015-05-21"}, {"excerpts": ["Another dish that had really really complimentary flavors was the Avocado Bomb. "], "author": "Adelbert Y.", "review": "Pretty fresh sushi. The sake clam soup was really delicious. Very fresh and great flavor in the broth. We ordered the sushi omakaze which came out to be about $60. It had fatty tuna, salmon, shrimp, uni (very fresh, no bitterness at all), and some other fish. Another dish that had really really complimentary flavors was the Avocado Bomb. The thinly sliced avocado, spicy salmon, and taro chips were really awesome.\n\nThe service was a little slow but I'm assuming they're still working out the kinks. The girl working the front should really deserve a raise the way she hustled and bustled.", "rating": 4, "date": "2015-08-29"}, {"excerpts": ["We had the grilled mussels and the Avocado Bomb (delicious avocado, salmon, taro chips and amazing sauce), Chicken Teriyaki (very flavorful, with that chargrilled taste, and a large portion) and several rolls- Las Vegas (fried roll", ", what doesn't taste good fried, but it wasn't overly greasy), Spider Roll, and some kind of Yellowtail roll.  ", "They gave us a complimentary roll which was actually one of my favorites of the night! ", "We tried some sake too (don't remember which one); it was sweet and easy to drink.  ", "Overall, we had a fantastic experience from service to proportions to food quality.  ", "I will definitely be back in the future and would highly recommend this place."], "author": "Kari L.", "review": "My brother was in town and craved sushi so we stopped by for dinner on a Friday night.  What I liked about this place was that the menu is varied and interesting, and there is something for everyone.  We had the grilled mussels and the Avocado Bomb (delicious avocado, salmon, taro chips and amazing sauce), Chicken Teriyaki (very flavorful, with that chargrilled taste, and a large portion) and several rolls- Las Vegas (fried roll, what doesn't taste good fried, but it wasn't overly greasy), Spider Roll, and some kind of Yellowtail roll.  They gave us a complimentary roll which was actually one of my favorites of the night! We tried some sake too (don't remember which one); it was sweet and easy to drink.  Overall, we had a fantastic experience from service to proportions to food quality.  I will definitely be back in the future and would highly recommend this place.", "rating": 5, "date": "2016-07-08"}, {"excerpts": ["The Avocado Bomb (avocado and spicy salmon) was beautifully presented and fun to eat.  ", "(It involves taro chips.) ", "And tasty. ", "As was the white angel, a spicy tuna & albacore number. ", "(Seriously, try the Avocado Bomb)"], "author": "Kaite V.", "review": "The Avocado Bomb (avocado and spicy salmon) was beautifully presented and fun to eat.  (It involves taro chips.) And tasty. As was the white angel, a spicy tuna & albacore number. (It was in the more traditional roll shape.)\n\nThis place is all about the presentation, but the sushi I tried really backed up the image.  I'd happily come here again.  (Seriously, try the Avocado Bomb)", "rating": 5, "date": "2015-01-14"}, {"excerpts": ["My personal favorite is the avocado bomb! ", "But coming from a public health background I think this place deserves 5 stars for healthy food options that are not only simply delicious but also very fresh!"], "author": "Tina G.", "review": "I'm a huge sushi fan and this place is the best in town. Love the unique specialties on menu. My personal favorite is the avocado bomb! But coming from a public health background I think this place deserves 5 stars for healthy food options that are not only simply delicious but also very fresh!", "rating": 5, "date": "2014-12-09"}, {"excerpts": ["We started out with the avocado bomb and it was great. "], "author": "Kelsey K.", "review": "This place is getting better. Although I also rated it five stars in my previous review, I've never enjoyed my meal more than I did tonight. It was probably because my hubby is better at choosing sushi rolls than me and he handled the ordering this time! We started out with the avocado bomb and it was great. Then moved on to the white angel and the bamboo roll. Wow!!! They were sooo delicious and flavorful. We finished off with the tempura ice cream with vanilla ice cream and it was the bomb. I'm looking forward to my next visit already. P.S. The manger is very friendly and personable and makes excellent recommendations. The prices are awesome too!", "rating": 5, "date": "2014-03-16"}, {"excerpts": ["The avocado bomb is amazingly great and has many flavors that work together beautifully.  "], "author": "Debra B.", "review": "The go-to place for sashimi and is one of the only places who will make handrolls without rice.  The avocado bomb is amazingly great and has many flavors that work together beautifully.  Highly recommend the salmon sashimi - they have many kinds of salmon and they are all terrific, the salmon belly melts in your month.  The bamboo roll without rice is so delicious I could eat them all day!\nOn top of a great meal, the team is so nice and fun.  We love sitting at the bar talking with Jeff and watching the awesome chefs.  Min is the owner and is very involved in selecting the best fish.  \nThe ambiance is great and is also a fun place to watch a game or chill with friends.  \nOverall, prob the best fish in the city!", "rating": 5, "date": "2015-09-07"}, {"excerpts": ["Get the avocado bomb! ", "The teriyaki rib eye was great as well as their flavorful edamame & the tuna carpaccio. ", "Sat at the bar with the friendly bartender Ryan. ", "Be patient, the food is worth it."], "author": "Brooke R.", "review": "Food was so good. Get the avocado bomb! The teriyaki rib eye was great as well as their flavorful edamame & the tuna carpaccio. Sat at the bar with the friendly bartender Ryan. Be patient, the food is worth it.", "rating": 5, "date": "2015-02-13"}, {"excerpts": ["Avocado bomb is great. ", "I will be back."], "author": "Hanna A.", "review": "The food is 5, the service 4. But in my opinion only because there where too few waiters. The night I was there they only had 1! And it was next to packed. So of course next to impossible to be 100% on and not the waiters fault. All in all food wins. Avocado bomb is great. I will be back.", "rating": 5, "date": "2015-01-05"}, {"excerpts": ["The avocado bomb is unique and fun to eat especially if you like avocado. "], "author": "Michelle N.", "review": "This place is super delicious!! I came here with some girl friends a while back and we had an amazing time!!\n\nFor a Friday night it was pretty busy! They have a really big cold sake selection which is nice and a lot of different Japanese beers! We were looking to get our weekend started so we ordered some sake bombs which were surprisingly affordable!\n\nThe food was fantastic! The avocado bomb is unique and fun to eat especially if you like avocado. Their rolls have a lot of taste, we had the bamboo, double shrimp, and spider and loved all three! We also wanted to try the salmon, yellowtail, and fluke nigiri which were all super fresh and delicious!\n\nThe service is great!! The servers are really nice and always make sure your glasses are filled, be it water or sake! They always clear plates and make sure you are doing well. Even the sushi chefs are nice! They also make sure you are enjoying your food even though they're busy and engage in conversation. It makes for a really fun atmosphere! I will definitely be back again for some sake bombs and good food", "rating": 5, "date": "2013-12-07"}, {"excerpts": ["I would recommend the Avocado Bomb and Tuna Love. ", "My girlfriend asked me to add that they pour a weak glass of wine. ", "Beers are always the same size though...."], "author": "Kenny B.", "review": "I go here a couple times a month and it is pretty solid. Nothing crazy but great for the price. I would recommend the Avocado Bomb and Tuna Love. My girlfriend asked me to add that they pour a weak glass of wine. Beers are always the same size though....", "rating": 4, "date": "2014-01-31"}, {"excerpts": ["The avocado bomb could have been so good but the overly sweet sauce ruined it. ", "Their fresh fish of the day tasted fishy and old so we had to send it back. ", "The server tried really hard to be warm and a good server ", "so I appreciate that, but he forgot some of the order... ", "Def don't feel it is worth 4 stars. ", "I'd say it is more 2.5"], "author": "Angela Z.", "review": "Pretty just below mediocre. It was loud from talking and the TV screens were awfully invasive.  The food was ok at best. The avocado bomb could have been so good but the overly sweet sauce ruined it. Their fresh fish of the day tasted fishy and old so we had to send it back. The server tried really hard to be warm and a good server so I appreciate that, but he forgot some of the order... Def don't feel it is worth 4 stars. I'd say it is more 2.5", "rating": 3, "date": "2015-11-27"}, {"excerpts": ["I had an avocado bomb as a server recommend, then had a house salad ,miso mushroom soup, for the main dish i had a sashimi combination which is like well set up course meal. ", "And the specialized sake for sushi was fit for my meal as server Jeffry recommended. ", "Besides the atmosphere and the vibe were beautiful and made me happy night!!  ", "Everything was perfect since i walk into this place. ", "I will definitely come here again. ", "This is the real sushi place in sf."], "author": "HyeMin K.", "review": "This restaurant made me write a review for the first time on yelp!!! \nBecause im not good at writing good words for food. But im a sushi eater as like other asian. There are lots of sushi place iv been in sf but this place is different with others.it was special experience that i found this place . I was surprise that the fish quality was sooo good and fresh for the price. And it was fine dining and they served food in order like appetizer,salad,soup and main dish. I felt like they were watching me while im eating because all the food came out right after finished a dish by order. I had an avocado bomb as a server recommend, then had a house salad ,miso mushroom soup, for the main dish i had a sashimi combination which is like well set up course meal. And the specialized sake for sushi was fit for my meal as server Jeffry recommended. Besides the atmosphere and the vibe were beautiful and made me happy night!!  Everything was perfect since i walk into this place. I will definitely come here again. This is the real sushi place in sf.", "rating": 5, "date": "2014-12-09"}, {"excerpts": ["A special shout out goes to the avocado bomb and the Tommy roll!! ", "Only at a \"local\" spot could one of your friends get a roll named after them!"], "author": "Jenny R.", "review": "Tamashisoul is the type of place you want in your local neighborhood.  It is a hidden gem on Union St. where you can expect to be seated quickly, served promptly and be surrounded by a great atmosphere.  I have come with friends on multiple occasions and enjoyed all that Tamashisoul has to offer.  A special shout out goes to the avocado bomb and the Tommy roll!! Only at a \"local\" spot could one of your friends get a roll named after them!", "rating": 5, "date": "2014-12-10"}, {"excerpts": ["I got mushroom miso, uni, and an avocado bomb. ", "The miso was very good. ", "The uni was fine ", "but I've had much better. ", "The avo bomb had interesting flavors & nice presentation, but the salmon inside didn't taste fresh. ", "(And it took 30m to come out"], "author": "Maggie Z.", "review": "Stopped in for a quick bite at the sushi bar tonight to try it out. Took 15-20m for anyone to ackmowledge my existence, and another 10m for them to return for my order. Yes they were busy, but still a total fail- service kinks should be worked out by now. (Noticed others having service problems too.)\nI got mushroom miso, uni, and an avocado bomb. The miso was very good. The uni was fine but I've had much better. The avo bomb had interesting flavors & nice presentation, but the salmon inside didn't taste fresh. (And it took 30m to come out, I suspect bc server forgot to order.)\n\nThe lousy service may have clouded my view and I'm willing to give it another try, but I wasn't impressed.", "rating": 3, "date": "2013-09-17"}], "hamachi carpacio": [], "tuna carpacio": [], "sashimi cocktail": [], "yellowtail tar tar": [], "torched salmon": [{"excerpts": ["We ordered the sweet scallop roll, torched salmon, and white sake tempura roll. ", "The white sake tempura came out first. ", "It's more of a thicker roll with salmon and avocado, wrapped in seaweed and lightly fried. ", "I liked it and the sauces that came with it. ", "The torched salmon and sweet scallop roll came out shortly after. ", "I thought the sweet scallop roll was tiny in comparison to sushi places we usually go to. ", "But it was delicious because I love scallops. ", "The torched salmon is self explanatory--seared salmon with sauces. "], "author": "Tara A.", "review": "My boyfriend and I came here on a random weeknight to eat dinner since I was in the area. It was pretty late, so the restaurant was almost empty except for a rowdy table of dudes lol. \n\nWe ordered the sweet scallop roll, torched salmon, and white sake tempura roll. The white sake tempura came out first. It's more of a thicker roll with salmon and avocado, wrapped in seaweed and lightly fried. I liked it and the sauces that came with it. The torched salmon and sweet scallop roll came out shortly after. I thought the sweet scallop roll was tiny in comparison to sushi places we usually go to. But it was delicious because I love scallops. The torched salmon is self explanatory--seared salmon with sauces. It's also wrapped around an avocado slice, which is a great complement to salmon sashimi. \n\nService was extremely friendly. I liked the sushi, but we weren't that full after 3 dishes.", "rating": 3, "date": "2018-04-28"}, {"excerpts": ["We got the Torched Salmon, Avocado Bomb, Kamikaze and Tamashi on Fire. ", "I've seen the fiery sushi concept before and love the concept of it, and the roll was delicious. ", "Their sushi rolls are pretty good here but is rather expensive. ", "The very much ranted Avocado Bomb was alright. ", "I personally didn't find anything too special about it for the price I had to pay."], "author": "Kaye T.", "review": "Is anyone else really annoyed of how the menu is formatted on the website? I'm trying to write a review so I can remember what I ordered but the menu on the website is really impractical! LOL. Don't worry, I'm not writing a review based on that though!!! This place was pretty good. It wasn't too busy when my family and I ate here, so I can't really say much about this place being understaffed. The service here was really great and it's has a pretty quiet atmosphere. We got the Torched Salmon, Avocado Bomb, Kamikaze and Tamashi on Fire. I've seen the fiery sushi concept before and love the concept of it, and the roll was delicious. Their sushi rolls are pretty good here but is rather expensive. The very much ranted Avocado Bomb was alright. I personally didn't find anything too special about it for the price I had to pay.", "rating": 4, "date": "2017-06-07"}, {"excerpts": ["I even liked the fusion-y appetizer (we got the torched salmon) and roll (we got the Tamashibow). ", "The best was the uni nigiri with quail egg. ", "The amaebi looked really good, even though I couldn't have a piece (there was only one left). ", "The toro was okay, but the piece was huge. "], "author": "Sherry L.", "review": "A friend of mine works here and we came here for dinner on a Tuesday night. I'm pretty skeptical of sushi places in the Marina... well, because, gimicky, expensive, and not authentic. What can I say? I am a major sushi snob.\n\nI was pleasantly surprised by Tamashisoul. The quality of the fish was very good and they had a good variety. I even liked the fusion-y appetizer (we got the torched salmon) and roll (we got the Tamashibow). The best was the uni nigiri with quail egg. The amaebi looked really good, even though I couldn't have a piece (there was only one left). The toro was okay, but the piece was huge. And bonus points for having yuzu on hand!\n\nThere's also a good selection of sake, at good price points, so definitely get some!", "rating": 4, "date": "2015-03-25"}, {"excerpts": ["The torched salmon was incredible.  ", "I also got the Yellow Tail Love, which was good ", "but I would probably try something else next time.  ", "I would definitely come back.  ", "Also great Peroni on tap for $4."], "author": "Reggie G.", "review": "We stopped in for a quick lunch today and it was delicious!  My husband got the tempura udon and I got some specialty rolls, which were both good.  The torched salmon was incredible.  I also got the Yellow Tail Love, which was good but I would probably try something else next time.  I would definitely come back.  Also great Peroni on tap for $4.", "rating": 5, "date": "2015-08-09"}], "white sake tempura": [{"excerpts": ["We ordered the sweet scallop roll, torched salmon, and white sake tempura roll. ", "The white sake tempura came out first. ", "It's more of a thicker roll with salmon and avocado, wrapped in seaweed and lightly fried. ", "I liked it and the sauces that came with it. ", "The torched salmon and sweet scallop roll came out shortly after. ", "I thought the sweet scallop roll was tiny in comparison to sushi places we usually go to. ", "But it was delicious because I love scallops. ", "The torched salmon is self explanatory--seared salmon with sauces. "], "author": "Tara A.", "review": "My boyfriend and I came here on a random weeknight to eat dinner since I was in the area. It was pretty late, so the restaurant was almost empty except for a rowdy table of dudes lol. \n\nWe ordered the sweet scallop roll, torched salmon, and white sake tempura roll. The white sake tempura came out first. It's more of a thicker roll with salmon and avocado, wrapped in seaweed and lightly fried. I liked it and the sauces that came with it. The torched salmon and sweet scallop roll came out shortly after. I thought the sweet scallop roll was tiny in comparison to sushi places we usually go to. But it was delicious because I love scallops. The torched salmon is self explanatory--seared salmon with sauces. It's also wrapped around an avocado slice, which is a great complement to salmon sashimi. \n\nService was extremely friendly. I liked the sushi, but we weren't that full after 3 dishes.", "rating": 3, "date": "2018-04-28"}, {"excerpts": ["Dropped in for happy hour with my boo and we had delicious standard rolls, more exciting rolls (white sake tempura and red hot snapper), and the most delicious sashimi (red snapper and tuna). ", "Our waiter was amazing and gave us incredible recs. ", "Highly recommended!"], "author": "Megan C.", "review": "Amazing sushi spot! Dropped in for happy hour with my boo and we had delicious standard rolls, more exciting rolls (white sake tempura and red hot snapper), and the most delicious sashimi (red snapper and tuna). Our waiter was amazing and gave us incredible recs. Highly recommended!", "rating": 5, "date": "2017-05-22"}, {"excerpts": ["Between the two of us, we ordered the seaweed salad, the bang bang shrimp, the bamboo roll, the red hot chili pepper roll and the white sake tempura roll. ", "All of the food was EXCELLENT and we were perfectly satisfied with the amount. ", "The cost wasn't outrageous either. ", "I rarely write Yelp reviews, but this time I was moved to do so. ", "A gem of a spot!"], "author": "Shannon E.", "review": "My friend and I were on a search for a sushi spot in Pac Heights that was still serving at 9:30 on a Wednesday night -- and we really lucked out with this one!! I am a sushi fanatic and declare this some of the best sushi I've had in the US (and I've eaten at Nobu). Between the two of us, we ordered the seaweed salad, the bang bang shrimp, the bamboo roll, the red hot chili pepper roll and the white sake tempura roll. All of the food was EXCELLENT and we were perfectly satisfied with the amount. The cost wasn't outrageous either. I rarely write Yelp reviews, but this time I was moved to do so. A gem of a spot!", "rating": 5, "date": "2016-01-19"}], "white tuna": [{"excerpts": ["I was completely full from two orders of their specialty rolls: The Bamboo Roll (spicy salmon topped with avocado, crunch, soy tobiko, scallion and their special sauce) and The White Angel Roll (spicy tuna and asparagus topped with white tuna and their special sauce). "], "author": "Alex B.", "review": "Tamashisoul, you've blown me away!\n\nHere's the deal: \n\nIn no way, shape or form did I walk in here today thinking it would be one of the best sushi experiences in a very long time- but it definitely was. These guys know how to make some mean sushi! The presentation is stunning, the service here is awesome and the sushi is down right incredible. The proportion size of the rolls themselves are misleading at first sight. They look smaller than your typical sushi rolls, but don't let that fool you. I was completely full from two orders of their specialty rolls: The Bamboo Roll (spicy salmon topped with avocado, crunch, soy tobiko, scallion and their special sauce) and The White Angel Roll (spicy tuna and asparagus topped with white tuna and their special sauce). The spicy miso soup is also a unique and welcome dish; simple, yet rich in flavor. \n\nOther than the incredible food here, the service is very friendly and quick. I waited no more than 10 minutes for my food, and was back to work in 30 minutes total. It's the perfect place for lunch, and makes for a great dinner as well. When it comes to first impressions, they've aced the test. I can really only say that parking is tough to find (unless you live/work in the area), but it's worth looking an extra 10 minutes.\n\nFinal verdict: You like sushi right? If you said yes, make your way over here as soon as possible for a delicious meal. If you said no, this is still the perfect place to start. Fresh sushi, tasty and made with passion. Basically, if you can't tell by my enthusiasm for this great spot: you need to try it at least once.", "rating": 5, "date": "2016-03-11"}, {"excerpts": ["but she said the walu is actually the white tuna. ", "To my knowledge, not so much but whatever, not that big of a deal. ", "Just letting you know so you don't have to ask if they just have walu sushi or sashimi. ", "Should've went for the uni instead..."], "author": "Athena C.", "review": "Mmmm...I'd come back but only because the Sweet Scallop roll gave me such a good first impression that I'm curious about their other rolls. It's sweet and had a hint of spice. I can do without the Red Hot Snapper roll though, even with the super cool presentation - it comes wrapped in foil and they light it on fire. The waiter says they were trying to do something cool but it seems it didn't work. The breaded tuna was way too salty for me.\n\nSo I noticed that they had walu on one or two of their rolls but they didn't have it as just sushi or sashimi. I asked the nice waitress and she may have been new but she said the walu is actually the white tuna. To my knowledge, not so much but whatever, not that big of a deal. Just letting you know so you don't have to ask if they just have walu sushi or sashimi. Should've went for the uni instead...", "rating": 4, "date": "2016-03-05"}, {"excerpts": ["The cuts are just the right size and you get quite a variety including blue fin tuna, hotati, amaebi, monk fish liver, uni, white tuna, salmon, ikura, saba and a couple of other cuts and a spicy tako mix. \n\n"], "author": "Tao Tao W.", "review": "I have had this place bookmarked since it opened and decided to go today since it was also the Union Street Festival. We totally should have gone earlier and we will def be back. Its right in the heart of the Union St amongst all the shops. Very posh set up with open windows and doors to give it a breezy and welcoming feel. they also have a full bar. We got 2 salads and sashimi. Nice portions and very fresh and quality sashimi. Only two small things - we got hot tea and they serve it in your own little tea pot. It wasn't as hot as we would have liked. Also we got our salads really quick but seemed to have taken longer than neccesary for our main dishes. We were one of 4 other tables and there were two sushi chefs. \n\nHouse Salads - $5 but they are actually quite big servings and just letttuce like a lot of other sushi restaurants. It's a 50/50 blend that comes with a ginger dressing. \n\nSpicy Tuna Tar Tar ($13)- my hub is rather picky about this dish because it never comes out to how he wants it sometimes. This one was delish. It 4 layers from the bottom with seaweed salad, a layer of a more sweeter and spicy tuna mix, layer of avocado, and then a top layer of tuna but it is mixed with tempura crisps. If you aren't a big fan of the risps like me, i'm sure they can not include it. it comes with a quail egg as well and also taro chips. great presentation and very flavorful. Hubs even liked the taro chips\n\nSashimi Omakase ($50) - So worth it, so delish, and so fresh. The cuts are just the right size and you get quite a variety including blue fin tuna, hotati, amaebi, monk fish liver, uni, white tuna, salmon, ikura, saba and a couple of other cuts and a spicy tako mix. \n\nUnagi Sashimi ($6) - I love a good piece of Unagi and this is what gave it that extra star. For $6, I got two huge pieces that were melt in your mouth tender and tasty. So delish and so tasty...", "rating": 5, "date": "2015-06-07"}, {"excerpts": ["Had the white tuna, yellowtail, hamachi, salmon - mmm, want some now.\n\n"], "author": "Jana S.", "review": "This place is AWESOME.  \n\nBest sashimi I've had in the city in a long time!!  Sashimi is fresh, delicious and just MELTS in your mouth.  Way to go Tamashi!  Can't wait to go back.  Had the white tuna, yellowtail, hamachi, salmon - mmm, want some now.\n\nThey also get 5 stars because they have fantastic service - Ginnie was soooo sweet and all the guys behind the sushi bar seriously knew what was going on.  MUSIC is also STELLAR - I must remember to go here when all of Union is quiet and the bars be playing those depressing beats.", "rating": 5, "date": "2013-10-23"}], "sea bass": [], "mackerel": [], "sweet shrimp": [], "squid": [{"excerpts": ["We also tried the smoked squid salad which had a deceiving description. ", "I would be surprised if they actually smoked the squid themselves. ", "This is a typical style of preserving squid in Korea that you can buy in batches from Korean markets. ", "If it is made on premise, than it certainly doesn't taste like it was made fresh. ", "Sorry Tamashisoul, this is just my honest observations from our meal 30 minutes ago. ", "Nothing personal. ", "One last criticism, you don't have a sushi bar ", "so don't ask customers if they want to sit there. ", "You only have a bar..."], "author": "Wes P.", "review": "So after living 2 blocks away for a year, we finally gave in on a tired/lazy night to try this place out. Now to be fair, my wife and I have lived in Japan for about 30 years combined, so we know how to appreciate good sushi. And just to be clear, this does not mean we expect what you get at a $600 a person place like Urasawa in LA or Masa in NY.\n\nBut we do expect fresh seafood. Would you go to a grocery store to purchase fruits past their prime, on the brink of rotting and having an almost intolerable level of funk? I hope not.\n\nThis is what we got in the two seafood dishes we ordered. The chirashi, which is an assortment of sashimi slices in a bowl of sushi rice, and the rainbow row. All fish in both dishes, except the tuna and salmon were inedible. The tuna and salmon were just edible, not enjoyable. The chirashi actually had  slices of tuna \"marinated\" in soy. When this was explained I immediately suspected it was a technique to extend the expiration date of the fish. It certainly did not enhance the tuna but even more oddly, the marinated fish was actually quite dry. In fact, all the fish was drier than what I'm used to, probably due to the length of time it has spent in their refrigerator after being thawed (yes, almost all sushi grade fish is flash frozen) but the marinated tuna was the most dry. Remembering the meal, there were actually thinner slices of fish that were starting to stiffen into shape. Ya, picture that.\n\nSo if you love rolls filled with imitation crab or spicy tuna and something deep fried in or on top your roll, this is your place. Convenient location and decent prices. \n\nIf you expect fresh fish and want to taste it rather than the sauces, fried gimmicks, cream cheese, etc., do not go here. We eat out several nights a week and this was the worst meal I've had in 3-4 years. I almost felt angry I put food like this in my stomach. I feel horrible for saying this but it's true and so unfortunate because theres only a handful of sushi options in this neighborhood. Now, they are of course catering to the local market but I almost see it as if they are taking advantage of their customers who don't know better. Either way, if you want sushi/sashimi, I think this review gives you an idea of who their target market is. Choose based on this.\n\nThe edamame was the best dish. We also tried the smoked squid salad which had a deceiving description. I would be surprised if they actually smoked the squid themselves. This is a typical style of preserving squid in Korea that you can buy in batches from Korean markets. If it is made on premise, than it certainly doesn't taste like it was made fresh. Sorry Tamashisoul, this is just my honest observations from our meal 30 minutes ago. Nothing personal. One last criticism, you don't have a sushi bar so don't ask customers if they want to sit there. You only have a bar...", "rating": 2, "date": "2017-08-29"}, {"excerpts": ["The sushi melts in your month and the squid salad is exquisite!"], "author": "Louise S.", "review": "Favorite sushi spot in the marina for any day or time! Great service and nice clean atmosphere. The sushi melts in your month and the squid salad is exquisite!", "rating": 4, "date": "2016-10-21"}], "flying fish roe": [], "salmon roe": [], "sea urchin": [], "monkfish foie": [{"excerpts": ["The Monkfish foie gras was warm which brought out a gaminess.  ", "It should be chilled.  \n", "(Also, it is supposed to be a starter, but came out of order -- not a big deal at all, but just a note).  ", "Some of the nigiri was great - the salmon was perfect in taste and texture.  ", "However, the swordfish was a little chewy and I had to pull something out of it that wouldn't break down.  "], "author": "Cuppy C.", "review": "I give 3.5 stars.\n\nThe Monkfish foie gras was warm which brought out a gaminess.  It should be chilled.  \n(Also, it is supposed to be a starter, but came out of order -- not a big deal at all, but just a note).  Some of the nigiri was great - the salmon was perfect in taste and texture.  However, the swordfish was a little chewy and I had to pull something out of it that wouldn't break down.  That has never happened to me before.  \n\nI also had stir-fried yakisoba with chicken, and wow- the chicken was sooooo Dry.\n\nThe service was really nice so I wish this could be a much more positive review.  The atmosphere was a bit noisy and I could here the next table's conversation all too clearly.  (Not as noisy as Mas Sake though - but no place is!)\n\nOverall, I was hoping to stumble across a gem, but Tamashisoul was a bit lackluster for me (especially after having really awesome Japanese recently at Gochi Japanese Fusion Tapas).", "rating": 3, "date": "2013-09-12"}], "tuna belly": [], "salmon belly": [{"excerpts": ["Highly recommend the salmon sashimi - they have many kinds of salmon and they are all terrific, the salmon belly melts in your month.  "], "author": "Debra B.", "review": "The go-to place for sashimi and is one of the only places who will make handrolls without rice.  The avocado bomb is amazingly great and has many flavors that work together beautifully.  Highly recommend the salmon sashimi - they have many kinds of salmon and they are all terrific, the salmon belly melts in your month.  The bamboo roll without rice is so delicious I could eat them all day!\nOn top of a great meal, the team is so nice and fun.  We love sitting at the bar talking with Jeff and watching the awesome chefs.  Min is the owner and is very involved in selecting the best fish.  \nThe ambiance is great and is also a fun place to watch a game or chill with friends.  \nOverall, prob the best fish in the city!", "rating": 5, "date": "2015-09-07"}], "yellowtail belly": [], "albacore belly": [], "albalone  seasonal": [], "geoduck  seasonal": [], "tamashi on fire": [{"excerpts": ["We also go the Tamashi on Fire (great taste and presentation), red hot chili pepper.  ", "Everything we had was delicious.  "], "author": "Blake B.", "review": "We were looking for a nearby sushi place one night and Tamashisoul came up so we tried it out.  We didn't have a reservation but we were there early so we were able to be seated right away.  I'm glad we did because we had a wonderful meal.  The staff was very helpful and gave us a few suggestions on what to order.  How was HyeJi able to remember our entire order without writing it down I'm not sure but it was impressive.\n\nWe ordered the avocado bomb (so good and our kids ate it without even knowing what it was.  We also go the Tamashi on Fire (great taste and presentation), red hot chili pepper.  Everything we had was delicious.  Our kids had gyozo, edamame, avocado roll and cucumber roll and loved their meal as well.\n\nIf you're looking for a great sushi spot in the Marina, look no further than here.  We'll be back for sure.", "rating": 5, "date": "2017-12-02"}, {"excerpts": ["I also recommend the Design rolls, like the Tamashi on Fire . "], "author": "Camille B.", "review": "Must try the Rib Eye Yakisoba. The cut of meat was soft and delicious, and the flavor of the noodles was rich. I also recommend the Design rolls, like the Tamashi on Fire . Served in aluminum foil and set ablaze in front of you, this was an experience with a delicious ending! \n\nUnfortunately the service was a little slow. I was struggling to stay focused on the conversation as my stomach started digesting itself . One of our guests had her soup go cold waiting to everyone else to be served.  But if you can handle the wait, it's really quite good.", "rating": 4, "date": "2017-11-21"}, {"excerpts": ["We got the Torched Salmon, Avocado Bomb, Kamikaze and Tamashi on Fire. ", "I've seen the fiery sushi concept before and love the concept of it, and the roll was delicious. ", "Their sushi rolls are pretty good here but is rather expensive. ", "The very much ranted Avocado Bomb was alright. ", "I personally didn't find anything too special about it for the price I had to pay."], "author": "Kaye T.", "review": "Is anyone else really annoyed of how the menu is formatted on the website? I'm trying to write a review so I can remember what I ordered but the menu on the website is really impractical! LOL. Don't worry, I'm not writing a review based on that though!!! This place was pretty good. It wasn't too busy when my family and I ate here, so I can't really say much about this place being understaffed. The service here was really great and it's has a pretty quiet atmosphere. We got the Torched Salmon, Avocado Bomb, Kamikaze and Tamashi on Fire. I've seen the fiery sushi concept before and love the concept of it, and the roll was delicious. Their sushi rolls are pretty good here but is rather expensive. The very much ranted Avocado Bomb was alright. I personally didn't find anything too special about it for the price I had to pay.", "rating": 4, "date": "2017-06-07"}, {"excerpts": ["but we got the avocado bomb, red hot snapper, bamboo, tamashi on fire, and vanilla tempera ice cream. \n\n"], "author": "Amy Y.", "review": "Came here with my bf and loved this place. We came here after work so it was kind of later in the night and it's located on union street. We drove here and there were lots of parking which was great!! The girl that served us was so sweet and the man that was there was so wonderful too. He kept checking on us and made sure we were good. \n\nThe bummer part was that they charged for green tea. I feel like they shouldn't charge anyone, i MEAN IT IS a japanese restaurant after all... but we got the avocado bomb, red hot snapper, bamboo, tamashi on fire, and vanilla tempera ice cream. \n\nI have to say that the two rolls on fire were pretty interesting to watch.\nBambo was covered in a sweet and sour sauce which, I liked a lot but my bf didn't.  \n\nThe best thing and MUST get is the tempera ice cream. I'm usually not a huge fan of tempera ice cream but woah this was dry good! I absolutely loved ice cream! It tasted amazing!! The flour was perfect and it was huge!!! \n\nThe two roles were pretty much had been topped with mayo and some dot of hot sauce. Wasn't too impressed. \n\nService A+ \nFish very fresh A\nThe method of the sushi was mediocre so I give it a B.", "rating": 4, "date": "2016-02-02"}, {"excerpts": ["We ordered the sashimi platter, tamashi on fire special roll, shrimp tempura, sweet scallop roll, and a bamboo roll. ", "The sashimi was fresh and huge, the special rolls were amazing, I especially enjoyed the sweet scallop roll. ", "We paired our food with a large Sapporo to start and then our server Isaac asked if we wanted to try Japanese tequila, it tasted very similar to sake "], "author": "Qumvithea L.", "review": "Walked into this spot with some of the boys on a Saturday night, I was having a rough day that day, and I wanted to fill the void with sushi, sake, and beer. The interior was modern and has a pretty cool feel to it. My friends and I sat at the bar and our bartender/server named Isaac helped us pick what we would eat and drink for the night. \n\nFood:\n\nI'm a sushi snob period, I grew up with an uncle who owned a sushi restaurant so I was exposed to sushi at an early age. My taste and palate as you would define would be refined at this point in my life. We ordered the sashimi platter, tamashi on fire special roll, shrimp tempura, sweet scallop roll, and a bamboo roll. The sashimi was fresh and huge, the special rolls were amazing, I especially enjoyed the sweet scallop roll. We paired our food with a large Sapporo to start and then our server Isaac asked if we wanted to try Japanese tequila, it tasted very similar to sake but it was light and smooth as most sakes are. \n\nService:\n\nIsaac was an attentive server/bartender, he recommended some awesome rolls and alcohol. He was upbeat and fast. \n\nLocation:\n\nUnless your a local, finding parking around the can be arduous.", "rating": 5, "date": "2017-10-07"}, {"excerpts": ["Friends got the Tamashi on Fire and Bamboo, both enjoyed!\n", "Miso soup - classic miso soup is good but they also have a mushroom miso for a few more dollars for lots of mushrooms and a bigger bowl!"], "author": "MaryKate M.", "review": "Good sushi spot! I always pass it by but finally tried it last night with a few friends.\n\nSpecial edamame - quite tasty elevation of normal edamame with some garlic-y concoction on it\nSpecial rolls - I got the Tamishibow which was neat because you don't often see lobster salad with fish and of course avocado. Very tasty and special saucy! Friends got the Tamashi on Fire and Bamboo, both enjoyed!\nMiso soup - classic miso soup is good but they also have a mushroom miso for a few more dollars for lots of mushrooms and a bigger bowl!", "rating": 4, "date": "2015-01-29"}, {"excerpts": ["We took his advice on the White Angle, Crazy Love and Tamashi on Fire. ", "These rolls are a must when coming here. ", "We are from LA, where there are many well know celebrity sushi restaurants. ", "We consider this place one of our favorites. ", "Thank you Isaac for your excellent service. ", "We will be back for more in the near future and definitely send you baby pictures when we have a baby ", "or two maybe three."], "author": "John A.", "review": "My girl friend and I stumbled upon this place on our vacation. We have been in SF for five days and everyday we had a talk about sushi, but decided that on our last day here we grab some place to have some. As our last day being here, we decided that we'd treat ourselves. From the photos, it seemed that it could be a decent place (pictures can be deceiving). We took a Lyft ride from downtown to this spot and walked in surprising ourselves with a cozy and tranquil environment. Our server, Isaac, gave us some great recommendations on sushi rolls. We took his advice on the White Angle, Crazy Love and Tamashi on Fire. These rolls are a must when coming here. We are from LA, where there are many well know celebrity sushi restaurants. We consider this place one of our favorites. Thank you Isaac for your excellent service. We will be back for more in the near future and definitely send you baby pictures when we have a baby or two maybe three.", "rating": 5, "date": "2017-05-21"}, {"excerpts": ["Favorite items so far: avocado bomb, bamboo roll, gyoza, tamashi on fire roll, red hot snapper roll and spicy tuna hand roll!"], "author": "Alyssa C.", "review": "Have been here twice and am already obsessed! Favorite sushi spot in SF so far, and it's so well located for grabbing drinks or hitting bars post dinner. Excellent service from our waiter, he doted on us but not to an annoying extent. The restaurant itself is stylish and usually always pretty busy which creates a fun environment. I would suggest making a reservation here for weekend nights, they tend to get busy around 7/7:30. \n\nFavorite items so far: avocado bomb, bamboo roll, gyoza, tamashi on fire roll, red hot snapper roll and spicy tuna hand roll!", "rating": 5, "date": "2016-10-29"}, {"excerpts": ["I ordered the \"Tamashi on fire\" roll which literally comes out on fire. ", "It was AMAZING! ", "It was definitely one of the best rolls of sushi I have ever had in my life. ", "I also got a California roll which was delicious as well, but I can't wait to get back to try another specialty roll. ", "My friend also greatly enjoyed her rolls as well, as they were also delicious. ", "I will see you again soon, Tamashisoul!!"], "author": "Alex R.", "review": "I went here for the first time the other night with a friend who lives in the area and I can't wait to go back. This place is amazing. It gets pretty crowded and can be a little cramped. We went on a Sunday night, and the only place they could find two seats for us was at the bar. We had no problem with this, as we received excellent service at the bar. The bartender was super attentive and very friendly, despite how busy it was. I ordered the \"Tamashi on fire\" roll which literally comes out on fire. It was AMAZING! It was definitely one of the best rolls of sushi I have ever had in my life. I also got a California roll which was delicious as well, but I can't wait to get back to try another specialty roll. My friend also greatly enjoyed her rolls as well, as they were also delicious. I will see you again soon, Tamashisoul!!", "rating": 5, "date": "2017-01-19"}, {"excerpts": ["Tamashi on fire, garlic edamame and avocado bomb. ", "They also have the freshest Uni in town. ", "I'd definitely go back ", "and I highly recommend for you to try this place."], "author": "Gwen M.", "review": "5 stars for good service, fresh fish, great food selection, cozy ambiance and the restaurants's cleanliness. Few of my favorites are: Tamashi on fire, garlic edamame and avocado bomb. They also have the freshest Uni in town. I'd definitely go back and I highly recommend for you to try this place.", "rating": 5, "date": "2015-12-27"}, {"excerpts": ["Tempura fried ice cream \n\nAverage -\nTamashi on Fire ($14)\n\nDefinitely "], "author": "Payal B.", "review": "A good neighborhood sushi bar. Fish is always very fresh. They have have a good list of options in their menu.\n\nMUST Try - \nSpicy tuna tar tar ($13)\nRed Hot chili pepper roll ($12)\nLion King ($11)\nTempura fried ice cream \n\nAverage -\nTamashi on Fire ($14)\n\nDefinitely my go to place for sushi craving!", "rating": 4, "date": "2015-06-02"}, {"excerpts": ["to the 4 amazing rolls: Tamashi on fire, bamboo, red hot chili pepper, and shrimp dragon roll.\n\n"], "author": "Jeanne C.", "review": "Thanks Yelp for the new find in my neighborhood! Never heard of it or seen it before, so wanted to try something new.\n\nEverything was delicious from the edamame (pepper and salt!) to the 4 amazing rolls: Tamashi on fire, bamboo, red hot chili pepper, and shrimp dragon roll.\n\nAll were very flavorful and delicious, and neither of us could pick a stand out favorite! Always an amazing place when every item is consistently good.\n\nI would definitely come back here!\n\nIt's about $25 with rolls, app and some sake. Not bad! If you're feeling adventurous and a lush, get the \"buy a shot and get a cocktail free\" yelp check in special! It was only Monday, so.... we passed!", "rating": 5, "date": "2015-04-27"}, {"excerpts": ["I had Tamashi on Fire, Volcano, Spider, and the Red Hot chili pepper roll.\n", "The Red Hot Chili Pepper roll was especially good with spicy tuna, asparagus and jalapeno with tuna, hot peppers and yellowish orangeish fish eggs. ", "again all the ingredients came together perfectly without one flavor dominating the other ingredients.\n", "you can tell the chefs are seasoned chefs and knows what they are doing.\nlove this place!"], "author": "Juyoung K.", "review": "I've eaten here few times now and decided to finally write a review, I like to try few times before I actually rate and write a review. didn't have to wait because the group i went to had reservation. The place was packed, but hey it was the weekend, just means food is fresh.\nPlace is awesome, like the music they play, the display on the wall is cool and its clean, like the tables, the bar area, and the restroom etc.\nPeople there are super friendly and attentive.\n\nThe most important part of the review - the food. I'm not a huge sushi or seafood fan but this place, it's really good. Food is a form of art, and the way they arranged their plates looked beautiful and tasted good.\nMiso soup was good, it wasn't too salty or chalky like sometimes you can kinda feel the miso soup power stuff, this place didn't have that. \nTried the Tuna Mango Salad, tuna was fresh and wasn't fishy and the amount of mango that was in the salad was perfect, wasn't too much. It didn't take over the salad, but it was enough where i can still taste it, all the ingredients harmonized and complimented each other very well.\nI had Tamashi on Fire, Volcano, Spider, and the Red Hot chili pepper roll.\nThe Red Hot Chili Pepper roll was especially good with spicy tuna, asparagus and jalapeno with tuna, hot peppers and yellowish orangeish fish eggs. again all the ingredients came together perfectly without one flavor dominating the other ingredients.\nyou can tell the chefs are seasoned chefs and knows what they are doing.\nlove this place!", "rating": 5, "date": "2015-02-12"}, {"excerpts": ["Tamashi on fire roll is rock!! "], "author": "Jae L.", "review": "I tried this new spot with my buddies and just loved it.  Tamashi on fire roll is rock!! I also ordered omakaze style of mixed sushi and sashimi (its a chef's choice) and they were so yummy and fresh as i expected.  \n\nA waiter was kind and attentive to me when i ask for recommendation. Atmosphere was nice and cozy.  I will definitely come back here!!", "rating": 5, "date": "2014-12-06"}, {"excerpts": ["Fav rolls were bamboo, tamashi on fire and white angel. ", "Definitely gonna be my go to sushi spot !"], "author": "Crystina L.", "review": "Yay for this new joint in the marina. Great food and great service. Our server gave us suggestions on what sake to have with our food and super attentive on our needs. Fav rolls were bamboo, tamashi on fire and white angel. Definitely gonna be my go to sushi spot !", "rating": 5, "date": "2013-12-16"}, {"excerpts": ["I asked the waitress what it was - their Tamashi On Fire signature dish - and how the flame affected the flavor. ", "She said it didn't affect the flavor at all. ", "It was only for presentation. "], "author": "Maria Y.", "review": "If our food had not been good, I might have just given this place ONE star because the ambiance is SOOO BAD. Let's begin...\n\nOn a Friday night, while looking at the menu from the street, we were skeptical about the music level but we were hungry and wanted sushi so we went in and got a table for 2 just a few feet from the door. The music was as loud - no exaggeration - as most clubs in the city. It was so loud that it was not enough for the waitress to bend over to talk to us. She had to squat down next to me to talk to me and move and squat down next to my boyfriend to take his order. And these tables are not big. They were closer to cocktail tables than dining tables. I asked the waitress if it was always this loud in here and she said during weekdays, it is more quiet. So I asked if they could turn down the music a little just so we wouldn't have to shout and she said no because the tables are so close that they need to music to be loud so that we don't hear other people's conversations. But we couldn't even hear our own conversation with the waitress! I looked down the row of maybe 10 tables and I saw maybe 3 people talking at that moment and it was STILL loud! I think they are over reacting. No other restaurant on Union Street has to blast their music that loud to facilitate private conversations. Do they think we're talking international spy secrets?? And if the number of tables don't change during the week, why isn't it just as loud then? I've seen just as many people there on a Wednesday without the blasting music. They should just own up to the fact that they want to have a showy hip club vibe rather than a restaurant.\n\nThis idea of \"showy\" comes up again later.\n\nSo we get to food/drink. I wish I could say more about the cocktails which I really wanted that night, but I can't because they DIDN'T HAVE A BARTENDER there. They were about one week old at the time and their bartender was already taking a vacation day? We settled for sake. Luckily for them, the food was good. We had a White Angel and Spider roll and one more roll I can't recall. The White Angel was the best. \n\nI do remember the table next to us got something that was lit on fire when it was presented at the table. I asked them later if it was extraordinarily tasty and they said no. It was good but not incredible. I asked the waitress what it was - their Tamashi On Fire signature dish - and how the flame affected the flavor. She said it didn't affect the flavor at all. It was only for presentation. Well, at least they owned up to that one.  \n\nI might have wanted to stay and see what was up for dessert, but I was tired of shouting by that time. If they can control their image-consciousness and turn down the music, I'd go back often. As of yet, I haven't been able to bear it again.", "rating": 3, "date": "2013-10-03"}], "tamashibow": [{"excerpts": ["Started with the Avocado Bomb, then ordered the Tamashibow, King Salmon, Lion King and Crunch Dragon. ", "All very tasty. ", "For desert I highly recommend the mochi. ", "The service was nice too. ", "Cons: the place has a funny smell and tables are a bit sticky. ", "Still deserves 5 stars for the great food."], "author": "Rafic K.", "review": "Started with the Avocado Bomb, then ordered the Tamashibow, King Salmon, Lion King and Crunch Dragon. All very tasty. For desert I highly recommend the mochi. The service was nice too. Cons: the place has a funny smell and tables are a bit sticky. Still deserves 5 stars for the great food.", "rating": 5, "date": "2018-02-21"}, {"excerpts": ["I even liked the fusion-y appetizer (we got the torched salmon) and roll (we got the Tamashibow). ", "The best was the uni nigiri with quail egg. ", "The amaebi looked really good, even though I couldn't have a piece (there was only one left). ", "The toro was okay, but the piece was huge. "], "author": "Sherry L.", "review": "A friend of mine works here and we came here for dinner on a Tuesday night. I'm pretty skeptical of sushi places in the Marina... well, because, gimicky, expensive, and not authentic. What can I say? I am a major sushi snob.\n\nI was pleasantly surprised by Tamashisoul. The quality of the fish was very good and they had a good variety. I even liked the fusion-y appetizer (we got the torched salmon) and roll (we got the Tamashibow). The best was the uni nigiri with quail egg. The amaebi looked really good, even though I couldn't have a piece (there was only one left). The toro was okay, but the piece was huge. And bonus points for having yuzu on hand!\n\nThere's also a good selection of sake, at good price points, so definitely get some!", "rating": 4, "date": "2015-03-25"}, {"excerpts": ["The garlic edamame was tasty and I was a fan of the Tamashibow roll which is a rainbow roll but with lobster meat. ", "Fun fact: they'll let you so sake bombs, you just can't drop the sake in the glass."], "author": "Aryn V.", "review": "We went here last weekend for my roommate's birthdays. The food was great: good quality and very fresh. Though it's definitely a little more on the expensive end for sushi restaurants you'd find in the Marina. The garlic edamame was tasty and I was a fan of the Tamashibow roll which is a rainbow roll but with lobster meat. Fun fact: they'll let you so sake bombs, you just can't drop the sake in the glass.", "rating": 4, "date": "2016-03-01"}, {"excerpts": ["Finally, we went with the lion king and tamashibow rolls and they were excellent as well. ", "All in all, we couldn't have had a better experience."], "author": "Josh H.", "review": "We started with the calamari - the cuts were long ways which gave it a more meaty texture, so good. We also had the fluke and albacore, both were incredible. Finally, we went with the lion king and tamashibow rolls and they were excellent as well. All in all, we couldn't have had a better experience.", "rating": 5, "date": "2016-05-29"}, {"excerpts": ["the Tamashibow roll (three sauces with four fish) was our favorite.  ", "we really liked that the sushi wasn't largely rice, which is typical of a lot of other places.  ", "the restaurant was full, but we could still hear each other.  ", "we will definitely be coming back here."], "author": "Melissa G.", "review": "we were walking by and decided to try it out...we were really glad that we did!  the garlic edamame was really good and then we had a few rolls all of which were awesome.  the Tamashibow roll (three sauces with four fish) was our favorite.  we really liked that the sushi wasn't largely rice, which is typical of a lot of other places.  the restaurant was full, but we could still hear each other.  we will definitely be coming back here.", "rating": 5, "date": "2013-10-02"}], "bamboo": [{"excerpts": ["Favorite dishes--special edamame (with a soy and garlic glaze, can't get enough), avocado bomb, bamboo roll! ", "Generous wine pour as well :) great for a night with friends, a date, parents in town, you name it!"], "author": "Elizabeth D.", "review": "Great little sushi spot in a convenient and fun location. Excellent atmosphere, only amplified by the lovely customer service. Grab a seat at the bar for fun conversations and enjoy watching the chefs work their magic. \n\nFavorite dishes--special edamame (with a soy and garlic glaze, can't get enough), avocado bomb, bamboo roll! Generous wine pour as well :) great for a night with friends, a date, parents in town, you name it!", "rating": 5, "date": "2017-10-08"}, {"excerpts": ["and I loved the interior with the bamboo on the walls+ ", "the lighting is great. ", "Thanks again for the beautiful service and for letting us stay after the closing hours."], "author": "Stephane M.", "review": "{From the kid}: I came here with my dad earlier today and he and the owner had a good talk. Otherwise, I really liked the avocado rolls+ the catsu chicken with the rice.\nI really had a great time there and I loved the interior with the bamboo on the walls+ the lighting is great. Thanks again for the beautiful service and for letting us stay after the closing hours.", "rating": 5, "date": "2017-04-17"}, {"excerpts": ["and I was seated shortly after...\n\nthe waiter was the full package: cordial, informative, attentive and funny...he made a few  recommendations and I decided on one (the Bamboo roll)...along with the Philly roll and salmon sashimi, it was all fantastic..."], "author": "Gianni A.", "review": "Came to San Fran for the weekend for my girlfriends birthday...on our final night we were looking for a sushi spot (after a -not so great- experience the day prior at a sushi spot downtown) and decided on Tamashisoul...\n\nI recommend making a reservation...we walked in on a Saturday night and it was full...though I didn't have a reservation, the staff was very accommodating and I was seated shortly after...\n\nthe waiter was the full package: cordial, informative, attentive and funny...he made a few  recommendations and I decided on one (the Bamboo roll)...along with the Philly roll and salmon sashimi, it was all fantastic...even had my favorite beer (Peroni) $4 draft... in a city where most restaurants come with a hefty tab, Tamashi was extremely reasonable for the amount of food we had, especially for a lovely looking restaurant...this is a for sure, go to, spot anytime I am in town...", "rating": 5, "date": "2017-10-14"}, {"excerpts": ["Try the special edamame, bang bang shrimp and bamboo roll.... so good!! \n", "Isaac always takes care of us and has a big smile every time we go in. ", "Love the friendly vibe of the place. \n", "Also a great spot to bring out of towners!"], "author": "Meg R.", "review": "Tamashisoul is my FAVORITE sushi spot in SF. My bf and I go there probably once a week, maybe even twice a week sometimes and it's the just best. Try the special edamame, bang bang shrimp and bamboo roll.... so good!! \nIsaac always takes care of us and has a big smile every time we go in. Love the friendly vibe of the place. \nAlso a great spot to bring out of towners!", "rating": 5, "date": "2017-06-28"}, {"excerpts": ["Extremely good sushi, get the Bamboo roll, it is perfect. ", "If you choose to be unpretentious, you'll love it here."], "author": "Stefani C.", "review": "This place is fantastic. Extremely good sushi, get the Bamboo roll, it is perfect. If you choose to be unpretentious, you'll love it here.", "rating": 5, "date": "2017-07-24"}, {"excerpts": ["I was completely full from two orders of their specialty rolls: The Bamboo Roll (spicy salmon topped with avocado, crunch, soy tobiko, scallion and their special sauce) and The White Angel Roll (spicy tuna and asparagus topped with white tuna and their special sauce). "], "author": "Alex B.", "review": "Tamashisoul, you've blown me away!\n\nHere's the deal: \n\nIn no way, shape or form did I walk in here today thinking it would be one of the best sushi experiences in a very long time- but it definitely was. These guys know how to make some mean sushi! The presentation is stunning, the service here is awesome and the sushi is down right incredible. The proportion size of the rolls themselves are misleading at first sight. They look smaller than your typical sushi rolls, but don't let that fool you. I was completely full from two orders of their specialty rolls: The Bamboo Roll (spicy salmon topped with avocado, crunch, soy tobiko, scallion and their special sauce) and The White Angel Roll (spicy tuna and asparagus topped with white tuna and their special sauce). The spicy miso soup is also a unique and welcome dish; simple, yet rich in flavor. \n\nOther than the incredible food here, the service is very friendly and quick. I waited no more than 10 minutes for my food, and was back to work in 30 minutes total. It's the perfect place for lunch, and makes for a great dinner as well. When it comes to first impressions, they've aced the test. I can really only say that parking is tough to find (unless you live/work in the area), but it's worth looking an extra 10 minutes.\n\nFinal verdict: You like sushi right? If you said yes, make your way over here as soon as possible for a delicious meal. If you said no, this is still the perfect place to start. Fresh sushi, tasty and made with passion. Basically, if you can't tell by my enthusiasm for this great spot: you need to try it at least once.", "rating": 5, "date": "2016-03-11"}, {"excerpts": ["but we got the avocado bomb, red hot snapper, bamboo, tamashi on fire, and vanilla tempera ice cream. \n\n"], "author": "Amy Y.", "review": "Came here with my bf and loved this place. We came here after work so it was kind of later in the night and it's located on union street. We drove here and there were lots of parking which was great!! The girl that served us was so sweet and the man that was there was so wonderful too. He kept checking on us and made sure we were good. \n\nThe bummer part was that they charged for green tea. I feel like they shouldn't charge anyone, i MEAN IT IS a japanese restaurant after all... but we got the avocado bomb, red hot snapper, bamboo, tamashi on fire, and vanilla tempera ice cream. \n\nI have to say that the two rolls on fire were pretty interesting to watch.\nBambo was covered in a sweet and sour sauce which, I liked a lot but my bf didn't.  \n\nThe best thing and MUST get is the tempera ice cream. I'm usually not a huge fan of tempera ice cream but woah this was dry good! I absolutely loved ice cream! It tasted amazing!! The flour was perfect and it was huge!!! \n\nThe two roles were pretty much had been topped with mayo and some dot of hot sauce. Wasn't too impressed. \n\nService A+ \nFish very fresh A\nThe method of the sushi was mediocre so I give it a B.", "rating": 4, "date": "2016-02-02"}, {"excerpts": ["We ordered the sashimi platter, tamashi on fire special roll, shrimp tempura, sweet scallop roll, and a bamboo roll. ", "The sashimi was fresh and huge, the special rolls were amazing, I especially enjoyed the sweet scallop roll. ", "We paired our food with a large Sapporo to start and then our server Isaac asked if we wanted to try Japanese tequila, it tasted very similar to sake "], "author": "Qumvithea L.", "review": "Walked into this spot with some of the boys on a Saturday night, I was having a rough day that day, and I wanted to fill the void with sushi, sake, and beer. The interior was modern and has a pretty cool feel to it. My friends and I sat at the bar and our bartender/server named Isaac helped us pick what we would eat and drink for the night. \n\nFood:\n\nI'm a sushi snob period, I grew up with an uncle who owned a sushi restaurant so I was exposed to sushi at an early age. My taste and palate as you would define would be refined at this point in my life. We ordered the sashimi platter, tamashi on fire special roll, shrimp tempura, sweet scallop roll, and a bamboo roll. The sashimi was fresh and huge, the special rolls were amazing, I especially enjoyed the sweet scallop roll. We paired our food with a large Sapporo to start and then our server Isaac asked if we wanted to try Japanese tequila, it tasted very similar to sake but it was light and smooth as most sakes are. \n\nService:\n\nIsaac was an attentive server/bartender, he recommended some awesome rolls and alcohol. He was upbeat and fast. \n\nLocation:\n\nUnless your a local, finding parking around the can be arduous.", "rating": 5, "date": "2017-10-07"}, {"excerpts": ["I had the double shrimp roll and my boyfriend had the bamboo roll and salmon sashimi with bang bang shrimp as an appetizer. ", "Everyone that works here is very accommodating and super nice. ", "Bottom line, definitely check this place out, you won't regret it!!"], "author": "Brea D.", "review": "This place is AMAZING!! My boyfriend and I came here for my birthday and I'm so glad we did. The sushi was to die for and the service was phenomenal! Our waiter was so much fun and he really took the time to give us his recommendations. I had the double shrimp roll and my boyfriend had the bamboo roll and salmon sashimi with bang bang shrimp as an appetizer. Everyone that works here is very accommodating and super nice. Bottom line, definitely check this place out, you won't regret it!!", "rating": 5, "date": "2017-10-14"}, {"excerpts": ["Friends got the Tamashi on Fire and Bamboo, both enjoyed!\n", "Miso soup - classic miso soup is good but they also have a mushroom miso for a few more dollars for lots of mushrooms and a bigger bowl!"], "author": "MaryKate M.", "review": "Good sushi spot! I always pass it by but finally tried it last night with a few friends.\n\nSpecial edamame - quite tasty elevation of normal edamame with some garlic-y concoction on it\nSpecial rolls - I got the Tamishibow which was neat because you don't often see lobster salad with fish and of course avocado. Very tasty and special saucy! Friends got the Tamashi on Fire and Bamboo, both enjoyed!\nMiso soup - classic miso soup is good but they also have a mushroom miso for a few more dollars for lots of mushrooms and a bigger bowl!", "rating": 4, "date": "2015-01-29"}, {"excerpts": ["My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\n"], "author": "David L.", "review": "I'm a fan of Tamashis. Eat there about once a month. Haven't met a roll I didn't like (except the one with cream cheese, but I think that's a personal preference). My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\nTakes reservations (Open table). Trendy spot. Can get pretty loud when full. But I keep coming back.", "rating": 4, "date": "2017-02-17"}, {"excerpts": ["Rolls were good, get the bamboo roll."], "author": "Brittney B.", "review": "Great food, terrible service. Waitress was completely oblivious to us, weren't serving half the things on the drink menu - why are they on the menu then? \n\nRolls were good, get the bamboo roll.", "rating": 2, "date": "2016-04-18"}, {"excerpts": ["Favorite items so far: avocado bomb, bamboo roll, gyoza, tamashi on fire roll, red hot snapper roll and spicy tuna hand roll!"], "author": "Alyssa C.", "review": "Have been here twice and am already obsessed! Favorite sushi spot in SF so far, and it's so well located for grabbing drinks or hitting bars post dinner. Excellent service from our waiter, he doted on us but not to an annoying extent. The restaurant itself is stylish and usually always pretty busy which creates a fun environment. I would suggest making a reservation here for weekend nights, they tend to get busy around 7/7:30. \n\nFavorite items so far: avocado bomb, bamboo roll, gyoza, tamashi on fire roll, red hot snapper roll and spicy tuna hand roll!", "rating": 5, "date": "2016-10-29"}, {"excerpts": ["Every roll I have tried has been really tasty as well: Double Shrimp, Bamboo, King Salmon, Tuna Love. ", "They have some great sashimi options as well. ", "It is a small and cozy spot and the service is efficient so it is always has been a great experience whether there to dine in or take out."], "author": "Derek S.", "review": "I love Tamashisoul! The \"special edamame\" is delicious, with great flavor for the garlic lovers out there. Every roll I have tried has been really tasty as well: Double Shrimp, Bamboo, King Salmon, Tuna Love. They have some great sashimi options as well. It is a small and cozy spot and the service is efficient so it is always has been a great experience whether there to dine in or take out.", "rating": 4, "date": "2016-06-25"}, {"excerpts": ["Had the yellowtail nigiri as well as the bamboo and red hot chili pepper rolls. ", "Rolls were plain BAD - tasted like something that comes out of the microwave, yellowtail wasn't fresh at all! "], "author": "Will S.", "review": "Not so sure about all these 5 stars...thought this place was extremely weak. Garlic edamame was a grease pile. Had the yellowtail nigiri as well as the bamboo and red hot chili pepper rolls. Rolls were plain BAD - tasted like something that comes out of the microwave, yellowtail wasn't fresh at all! GF and I ended up not even finishing half our dinner.\n\nTry your luck elsewhere.", "rating": 1, "date": "2015-09-04"}, {"excerpts": ["I definitely recommend the gyoza and garlic edamame to start out with and for rolls: bamboo, double shrimp, Spider-Man, and the two signature rolls - which I can't remember, but they are the first two listed on the menu.\n\n"], "author": "David P.", "review": "Cute little sushi place in a cute little neighborhood. There was room for our group of 7 and ample street parking (we went on a Saturday at 6:00pm)! \n\nI definitely recommend the gyoza and garlic edamame to start out with and for rolls: bamboo, double shrimp, Spider-Man, and the two signature rolls - which I can't remember, but they are the first two listed on the menu.\n\nThe staff was kind and we had quick service. Our total bill - including a 20% tip - was $153.  (We ordered 3 appetizers and 8 rolls)", "rating": 4, "date": "2016-01-30"}, {"excerpts": ["We had red hot chilli popper, bamboo and special edamame. ", "Everything was delicious and fresh! ", "Def coming back"], "author": "Oliver W.", "review": "The sushi was awesome! And out waiter, Jeff, went above and beyond. Constantly checking in and refilling waters. \n\nWe had red hot chilli popper, bamboo and special edamame. Everything was delicious and fresh! Def coming back", "rating": 5, "date": "2015-12-08"}, {"excerpts": ["We got three rolls which were the bamboo, red hot snapper and crazy love. ", "They were all delicious!! ", "I was so pleased with all three. ", "My least favorite would have to be crazy love but that doesn't mean it was bad, just means it was my least favorite. ", "We also had the shrimp tempura and wasabi shumai for appetizers Both were really tasty as well. \n", "Had a really great experience here. ", "Will be back whenever I'm in the marina!"], "author": "Shannon M.", "review": "The restaurant was pretty empty so took a star off for the slow service. The waiter was super friendly and made conversation. Pretty cute place with a full bar which was a plus. My sister and I got the lychee martini and the mango martini and they were both made perfectly. \n\nNow for the food. We got three rolls which were the bamboo, red hot snapper and crazy love. They were all delicious!! I was so pleased with all three. My least favorite would have to be crazy love but that doesn't mean it was bad, just means it was my least favorite. We also had the shrimp tempura and wasabi shumai for appetizers Both were really tasty as well. \nHad a really great experience here. Will be back whenever I'm in the marina!", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["I ordered the bamboo roll ( spicy salmon ) ", "i thought it was very good ", "but the roll was pretty weak. ", "I had to be cateful about picking it up without having it crumble onto pieces. ", "My bf ordered the king salmon which was BOMB!!! ", "I totally recommend it! ", "Overall i would come back to this place because its pretty good food and the atmosphere is young and hip!!"], "author": "Anudari K.", "review": "Japanese is my fav so im always eager to try new restaurants. This past saturday me n my bf had a craving for some sashimi n nigiris so we looked up on yelp for restaurants that were open after 1030 at night. Nothing around us was open considering it was a saturday night. So we ended up here. (Quite a commute) first, mostly i loved that it was open late!! Till midnight to be exact! Which i loved! Apparently you cant find that on a sat night in a big city. 2nd i loved the contemporary design of the restaurant in case you were planning to dress it up on a sat night. (Not one of those corner dive-y place) 3rd i loved the music!!! All about edm baby! \nNow on to the real stuff: \nI didnt think very highly of the service here. We came around 11 so i felt like the waitress was concerned about cleaning up before closing time. Not too attentive. Kind of slow with our drink order. Went to bar to ask for it. On the contrary, the food was pretty good. I ordered the bamboo roll ( spicy salmon ) i thought it was very good but the roll was pretty weak. I had to be cateful about picking it up without having it crumble onto pieces. My bf ordered the king salmon which was BOMB!!! I totally recommend it! Overall i would come back to this place because its pretty good food and the atmosphere is young and hip!!", "rating": 4, "date": "2014-10-05"}, {"excerpts": ["to the 4 amazing rolls: Tamashi on fire, bamboo, red hot chili pepper, and shrimp dragon roll.\n\n"], "author": "Jeanne C.", "review": "Thanks Yelp for the new find in my neighborhood! Never heard of it or seen it before, so wanted to try something new.\n\nEverything was delicious from the edamame (pepper and salt!) to the 4 amazing rolls: Tamashi on fire, bamboo, red hot chili pepper, and shrimp dragon roll.\n\nAll were very flavorful and delicious, and neither of us could pick a stand out favorite! Always an amazing place when every item is consistently good.\n\nI would definitely come back here!\n\nIt's about $25 with rolls, app and some sake. Not bad! If you're feeling adventurous and a lush, get the \"buy a shot and get a cocktail free\" yelp check in special! It was only Monday, so.... we passed!", "rating": 5, "date": "2015-04-27"}, {"excerpts": ["Between the two of us, we ordered the seaweed salad, the bang bang shrimp, the bamboo roll, the red hot chili pepper roll and the white sake tempura roll. ", "All of the food was EXCELLENT and we were perfectly satisfied with the amount. ", "The cost wasn't outrageous either. ", "I rarely write Yelp reviews, but this time I was moved to do so. ", "A gem of a spot!"], "author": "Shannon E.", "review": "My friend and I were on a search for a sushi spot in Pac Heights that was still serving at 9:30 on a Wednesday night -- and we really lucked out with this one!! I am a sushi fanatic and declare this some of the best sushi I've had in the US (and I've eaten at Nobu). Between the two of us, we ordered the seaweed salad, the bang bang shrimp, the bamboo roll, the red hot chili pepper roll and the white sake tempura roll. All of the food was EXCELLENT and we were perfectly satisfied with the amount. The cost wasn't outrageous either. I rarely write Yelp reviews, but this time I was moved to do so. A gem of a spot!", "rating": 5, "date": "2016-01-19"}, {"excerpts": ["Then we had the bamboo roll and the tuna love. ", "Wow! ", "Service and food is more than deserving of 5 stars!"], "author": "Victoria T.", "review": "Best sushi I've had ever! We started with the spicy tuna tar tar, hamachi carpaccio, 5 pieces of sashimi. The server Minh recommended a specific type of sake for our taste. He is fantastic! Then we had the bamboo roll and the tuna love. Wow! Service and food is more than deserving of 5 stars!", "rating": 5, "date": "2014-06-14"}, {"excerpts": ["Then moved on to the white angel and the bamboo roll. ", "Wow!!! ", "They were sooo delicious and flavorful. ", "We finished off with the tempura ice cream with vanilla ice cream and it was the bomb. ", "I'm looking forward to my next visit already. ", "P.S. ", "The manger is very friendly and personable and makes excellent recommendations. ", "The prices are awesome too!"], "author": "Kelsey K.", "review": "This place is getting better. Although I also rated it five stars in my previous review, I've never enjoyed my meal more than I did tonight. It was probably because my hubby is better at choosing sushi rolls than me and he handled the ordering this time! We started out with the avocado bomb and it was great. Then moved on to the white angel and the bamboo roll. Wow!!! They were sooo delicious and flavorful. We finished off with the tempura ice cream with vanilla ice cream and it was the bomb. I'm looking forward to my next visit already. P.S. The manger is very friendly and personable and makes excellent recommendations. The prices are awesome too!", "rating": 5, "date": "2014-03-16"}, {"excerpts": ["I'd return and try the rolls, as there were several (like the Bamboo) that looked interesting. ", "I wonder if they always have the same strange music selection... ", "I'm down for 90s throwbacks like Spice Girls and Britney Spears every once in a while, but it didn't seem to fit the nice, non-crazy-sake-bombing vibe they were going for on a casual Wednesday evening."], "author": "Kelcey M.", "review": "Not bad for a first try, Tamashisoul. I popped in with a gf last night for dinner around 7:30pm - we were able to get last min reservations without any problem. She chose the sashimi platter, which was a bit overpriced for the amount of food. Good mix of sashimi options (the salmon was particularly tasty), but the fish was situated amongst these huuuge piles of a curly white root-like vegetable. It felt like they were trying to disguise the fact that there were so few pieces of fish on the plate - it would have been a tiny dish if they removed the frills. Chirashi is my go-to at any nice sushi restaurant, and I wouldn't get it here again. The fish was ok, but they put a salad on top of the rice with a pungent dressing that I didn't like... it soaked down through the sushi rice and ruined the nice base flavor. I get that they're trying to be unique, but sometimes the true basics are better than the fancy presentations. \n\nI'd return and try the rolls, as there were several (like the Bamboo) that looked interesting. I wonder if they always have the same strange music selection... I'm down for 90s throwbacks like Spice Girls and Britney Spears every once in a while, but it didn't seem to fit the nice, non-crazy-sake-bombing vibe they were going for on a casual Wednesday evening.", "rating": 3, "date": "2013-10-17"}, {"excerpts": ["Try the sunomono salad with wasabi sauce and fresh octopus and bamboo roll."], "author": "Stephanie T.", "review": "Wow...fresh, creative food with great service. Try the sunomono salad with wasabi sauce and fresh octopus and bamboo roll.", "rating": 5, "date": "2013-11-30"}, {"excerpts": ["The bamboo roll without rice is so delicious I could eat them all day!\n", "On top of a great meal, the team is so nice and fun.  ", "We love sitting at the bar talking with Jeff and watching the awesome chefs.  ", "Min is the owner and is very involved in selecting the best fish.  \n", "The ambiance is great and is also a fun place to watch a game or chill with friends.  \n", "Overall, prob the best fish in the city!"], "author": "Debra B.", "review": "The go-to place for sashimi and is one of the only places who will make handrolls without rice.  The avocado bomb is amazingly great and has many flavors that work together beautifully.  Highly recommend the salmon sashimi - they have many kinds of salmon and they are all terrific, the salmon belly melts in your month.  The bamboo roll without rice is so delicious I could eat them all day!\nOn top of a great meal, the team is so nice and fun.  We love sitting at the bar talking with Jeff and watching the awesome chefs.  Min is the owner and is very involved in selecting the best fish.  \nThe ambiance is great and is also a fun place to watch a game or chill with friends.  \nOverall, prob the best fish in the city!", "rating": 5, "date": "2015-09-07"}, {"excerpts": ["I like this place, and the vibe, bamboo role is awesome, and the staff are so nice, the only reason that I didn't go for 5 star was noise, people speak loud, and the structure of the restaurant makes it even worse. ", "But overall I like there, and if I'm not in favour of silence, I'll definitely go there."], "author": "Yasaman A.", "review": "I like this place, and the vibe, bamboo role is awesome, and the staff are so nice, the only reason that I didn't go for 5 star was noise, people speak loud, and the structure of the restaurant makes it even worse. But overall I like there, and if I'm not in favour of silence, I'll definitely go there.", "rating": 4, "date": "2014-09-17"}, {"excerpts": ["Their rolls have a lot of taste, we had the bamboo, double shrimp, and spider and loved all three! "], "author": "Michelle N.", "review": "This place is super delicious!! I came here with some girl friends a while back and we had an amazing time!!\n\nFor a Friday night it was pretty busy! They have a really big cold sake selection which is nice and a lot of different Japanese beers! We were looking to get our weekend started so we ordered some sake bombs which were surprisingly affordable!\n\nThe food was fantastic! The avocado bomb is unique and fun to eat especially if you like avocado. Their rolls have a lot of taste, we had the bamboo, double shrimp, and spider and loved all three! We also wanted to try the salmon, yellowtail, and fluke nigiri which were all super fresh and delicious!\n\nThe service is great!! The servers are really nice and always make sure your glasses are filled, be it water or sake! They always clear plates and make sure you are doing well. Even the sushi chefs are nice! They also make sure you are enjoying your food even though they're busy and engage in conversation. It makes for a really fun atmosphere! I will definitely be back again for some sake bombs and good food", "rating": 5, "date": "2013-12-07"}, {"excerpts": ["We ordered the bamboo roll, sushi combination, and salmon teriyaki.  ", "Although the food took quite a while, everything was pretty tasty.  ", "Loved the fun vibe and friendly waitstaff."], "author": "Brianna M.", "review": "Was pleasantly surprised, love when that happens!  Came in on a busy Saturday night sans reservations and got seated right away.  We ordered the bamboo roll, sushi combination, and salmon teriyaki.  Although the food took quite a while, everything was pretty tasty.  Loved the fun vibe and friendly waitstaff.", "rating": 4, "date": "2014-05-18"}, {"excerpts": ["Fav rolls were bamboo, tamashi on fire and white angel. ", "Definitely gonna be my go to sushi spot !"], "author": "Crystina L.", "review": "Yay for this new joint in the marina. Great food and great service. Our server gave us suggestions on what sake to have with our food and super attentive on our needs. Fav rolls were bamboo, tamashi on fire and white angel. Definitely gonna be my go to sushi spot !", "rating": 5, "date": "2013-12-16"}, {"excerpts": ["Especially liked the bamboo roll.  ", "l would recommend strongly."], "author": "Shawn C.", "review": "This place is very enjoyable.  Every roll was very good and reasonably priced.  The vibe and the decor of the place are also good fits for union street.  Especially liked the bamboo roll.  l would recommend strongly.", "rating": 4, "date": "2014-05-26"}, {"excerpts": ["With the great variety of options, we selected the avocado salad to start, then had the Spider, Crystal, Yellowtail, and the Bamboo rolls. ", "For us, I'll tell you the truth it might have appeared as if we ordered too much, but we devoured and enjoyed every bite along with sweet sake until nothing was left. ", "You get high value for it because the sushi is excellent quality and especially for the cost. ", "Great customer service - they are attentive and we never felt neglected. ", "I appreciate the friendliness too. ", "I didn't know how close this fairly new place is to me. ", "I am making this my sushi go-to spot."], "author": "Naomi L.", "review": "Came here last night with my sister. With the great variety of options, we selected the avocado salad to start, then had the Spider, Crystal, Yellowtail, and the Bamboo rolls. For us, I'll tell you the truth it might have appeared as if we ordered too much, but we devoured and enjoyed every bite along with sweet sake until nothing was left. You get high value for it because the sushi is excellent quality and especially for the cost. Great customer service - they are attentive and we never felt neglected. I appreciate the friendliness too. I didn't know how close this fairly new place is to me. I am making this my sushi go-to spot.", "rating": 5, "date": "2014-02-16"}], "crazy love": [{"excerpts": ["We started with some rolls -- loved the unique Hawaiian roll wrapped in cucumber, yum -- and then I had the Crazy Love and vegetable tempura. ", "The fish was very fresh, beautifully plated, and paired perfectly. ", "Everyone loved their food. ", "The sushi rice bowl looked amazing. ", "We also had tempura ice cream for dessert -- YUM! ", "I could live off that food forever. ", "So happy I came here! ", "Hope to return soon! ", "Also the wait staff was very nice and fast!! ", "Much  to Tamashisoul!"], "author": "Maya S.", "review": "I came here for my masters graduation dinner and the food was SO DELICIOUS! We started with some rolls -- loved the unique Hawaiian roll wrapped in cucumber, yum -- and then I had the Crazy Love and vegetable tempura. The fish was very fresh, beautifully plated, and paired perfectly. Everyone loved their food. The sushi rice bowl looked amazing. We also had tempura ice cream for dessert -- YUM! I could live off that food forever. So happy I came here! Hope to return soon! Also the wait staff was very nice and fast!! Much  to Tamashisoul!", "rating": 5, "date": "2017-05-19"}, {"excerpts": ["We took his advice on the White Angle, Crazy Love and Tamashi on Fire. ", "These rolls are a must when coming here. ", "We are from LA, where there are many well know celebrity sushi restaurants. ", "We consider this place one of our favorites. ", "Thank you Isaac for your excellent service. ", "We will be back for more in the near future and definitely send you baby pictures when we have a baby ", "or two maybe three."], "author": "John A.", "review": "My girl friend and I stumbled upon this place on our vacation. We have been in SF for five days and everyday we had a talk about sushi, but decided that on our last day here we grab some place to have some. As our last day being here, we decided that we'd treat ourselves. From the photos, it seemed that it could be a decent place (pictures can be deceiving). We took a Lyft ride from downtown to this spot and walked in surprising ourselves with a cozy and tranquil environment. Our server, Isaac, gave us some great recommendations on sushi rolls. We took his advice on the White Angle, Crazy Love and Tamashi on Fire. These rolls are a must when coming here. We are from LA, where there are many well know celebrity sushi restaurants. We consider this place one of our favorites. Thank you Isaac for your excellent service. We will be back for more in the near future and definitely send you baby pictures when we have a baby or two maybe three.", "rating": 5, "date": "2017-05-21"}, {"excerpts": ["We got three rolls which were the bamboo, red hot snapper and crazy love. ", "They were all delicious!! ", "I was so pleased with all three. ", "My least favorite would have to be crazy love but that doesn't mean it was bad, just means it was my least favorite. ", "We also had the shrimp tempura and wasabi shumai for appetizers Both were really tasty as well. \n", "Had a really great experience here. ", "Will be back whenever I'm in the marina!"], "author": "Shannon M.", "review": "The restaurant was pretty empty so took a star off for the slow service. The waiter was super friendly and made conversation. Pretty cute place with a full bar which was a plus. My sister and I got the lychee martini and the mango martini and they were both made perfectly. \n\nNow for the food. We got three rolls which were the bamboo, red hot snapper and crazy love. They were all delicious!! I was so pleased with all three. My least favorite would have to be crazy love but that doesn't mean it was bad, just means it was my least favorite. We also had the shrimp tempura and wasabi shumai for appetizers Both were really tasty as well. \nHad a really great experience here. Will be back whenever I'm in the marina!", "rating": 4, "date": "2015-06-14"}], "double shrimp": [{"excerpts": ["Garlic edamame is to die for :)\ndouble shrimp roll is excellent\n\nCons:\n"], "author": "Nicky V.", "review": "Atmosphere:\nCasual. Dark and intimate decor\n\nInterior:\nOpen seating \nBar available.\nClean restrooms.\n\nService:\nAdequate, greeted us upon arrival. \nHowever, the woman behind the counter recommended a roll that my friend couldn't eat due to a severe gluten after the allergy was mentioned to her. Once the roll came and we informed her my friend couldn't eat it after taking a bite and removing it from her mouth with a napkin back on the plate. The women gave us a blank stare and didn't apologize and was going to make us pay for it, until we asked if she can toss it out for us. I feel like this could've been handled a bit better. \n\nFood:\nMenu has a lot of options. \n\nGarlic edamame is to die for :)\ndouble shrimp roll is excellent\n\nCons:\nIt's a little pricey (as are other sushi restaurants)\n\nOverall:\ngood sushi\nPricey\n\nI may return", "rating": 3, "date": "2017-10-28"}, {"excerpts": ["I had the double shrimp roll and my boyfriend had the bamboo roll and salmon sashimi with bang bang shrimp as an appetizer. ", "Everyone that works here is very accommodating and super nice. ", "Bottom line, definitely check this place out, you won't regret it!!"], "author": "Brea D.", "review": "This place is AMAZING!! My boyfriend and I came here for my birthday and I'm so glad we did. The sushi was to die for and the service was phenomenal! Our waiter was so much fun and he really took the time to give us his recommendations. I had the double shrimp roll and my boyfriend had the bamboo roll and salmon sashimi with bang bang shrimp as an appetizer. Everyone that works here is very accommodating and super nice. Bottom line, definitely check this place out, you won't regret it!!", "rating": 5, "date": "2017-10-14"}, {"excerpts": ["Red Hot Chili Pepper roll, Double Shrimp.  "], "author": "Reyana F.", "review": "My new favorite sushi spot in the city. I wasn't expecting it but holy CRAP! I've never seen anything like it.\n\nDefinitely get: Avocado Bomb & Spicy Tuna Tar Tar. The Spicy Tuna Tar Tar was probably the best combination of raw fish I've had in a really really long time.  Avocado, tuna, whatever that delicious sauce was. Oh my.\n\nOther good things: Red Hot Chili Pepper roll, Double Shrimp.  The real winners here though are the specialty sushi.\n\nAtmosphere: pretty casual and loud, it's definitely a spot where people go before going out. Super good and I will DEFINITELY be making a trip back to the Marina to go here soon again.", "rating": 5, "date": "2016-04-03"}, {"excerpts": ["Every roll I have tried has been really tasty as well: Double Shrimp, Bamboo, King Salmon, Tuna Love. ", "They have some great sashimi options as well. ", "It is a small and cozy spot and the service is efficient so it is always has been a great experience whether there to dine in or take out."], "author": "Derek S.", "review": "I love Tamashisoul! The \"special edamame\" is delicious, with great flavor for the garlic lovers out there. Every roll I have tried has been really tasty as well: Double Shrimp, Bamboo, King Salmon, Tuna Love. They have some great sashimi options as well. It is a small and cozy spot and the service is efficient so it is always has been a great experience whether there to dine in or take out.", "rating": 4, "date": "2016-06-25"}, {"excerpts": ["I definitely recommend the gyoza and garlic edamame to start out with and for rolls: bamboo, double shrimp, Spider-Man, and the two signature rolls - which I can't remember, but they are the first two listed on the menu.\n\n"], "author": "David P.", "review": "Cute little sushi place in a cute little neighborhood. There was room for our group of 7 and ample street parking (we went on a Saturday at 6:00pm)! \n\nI definitely recommend the gyoza and garlic edamame to start out with and for rolls: bamboo, double shrimp, Spider-Man, and the two signature rolls - which I can't remember, but they are the first two listed on the menu.\n\nThe staff was kind and we had quick service. Our total bill - including a 20% tip - was $153.  (We ordered 3 appetizers and 8 rolls)", "rating": 4, "date": "2016-01-30"}, {"excerpts": ["Their rolls have a lot of taste, we had the bamboo, double shrimp, and spider and loved all three! "], "author": "Michelle N.", "review": "This place is super delicious!! I came here with some girl friends a while back and we had an amazing time!!\n\nFor a Friday night it was pretty busy! They have a really big cold sake selection which is nice and a lot of different Japanese beers! We were looking to get our weekend started so we ordered some sake bombs which were surprisingly affordable!\n\nThe food was fantastic! The avocado bomb is unique and fun to eat especially if you like avocado. Their rolls have a lot of taste, we had the bamboo, double shrimp, and spider and loved all three! We also wanted to try the salmon, yellowtail, and fluke nigiri which were all super fresh and delicious!\n\nThe service is great!! The servers are really nice and always make sure your glasses are filled, be it water or sake! They always clear plates and make sure you are doing well. Even the sushi chefs are nice! They also make sure you are enjoying your food even though they're busy and engage in conversation. It makes for a really fun atmosphere! I will definitely be back again for some sake bombs and good food", "rating": 5, "date": "2013-12-07"}], "red hot chili pepper": [{"excerpts": ["We also go the Tamashi on Fire (great taste and presentation), red hot chili pepper.  ", "Everything we had was delicious.  "], "author": "Blake B.", "review": "We were looking for a nearby sushi place one night and Tamashisoul came up so we tried it out.  We didn't have a reservation but we were there early so we were able to be seated right away.  I'm glad we did because we had a wonderful meal.  The staff was very helpful and gave us a few suggestions on what to order.  How was HyeJi able to remember our entire order without writing it down I'm not sure but it was impressive.\n\nWe ordered the avocado bomb (so good and our kids ate it without even knowing what it was.  We also go the Tamashi on Fire (great taste and presentation), red hot chili pepper.  Everything we had was delicious.  Our kids had gyozo, edamame, avocado roll and cucumber roll and loved their meal as well.\n\nIf you're looking for a great sushi spot in the Marina, look no further than here.  We'll be back for sure.", "rating": 5, "date": "2017-12-02"}, {"excerpts": ["For rolls, we had the Red Hot Snapper, the Red Hot Chili Pepper, and the Las Vegas. ", "All the rolls were good but not great! "], "author": "Julia M.", "review": "Three and a half stars for this place! The service was good but the tables were a little cramped. We were basically eating dinner with the couple next to us lol I like the diversity of their menu (we love when sushi places have specialty items). We started with the Avocado Bomb from the specialty items, it was amazing! I highly recommend this. For rolls, we had the Red Hot Snapper, the Red Hot Chili Pepper, and the Las Vegas. All the rolls were good but not great! We were also a little disappointed with how little they were.\n\nOverall good, not incredible though", "rating": 3, "date": "2017-03-30"}, {"excerpts": ["Serious Recommendations: \n- Hamachi Carpaccio\n- Tuna Carpaccio \n\nLess Serious Recommendations:\n- Red Snapper Tataki\n- Red Hot Chili Pepper\n\nEnjoy! "], "author": "Becca S.", "review": "Ok so. This is clearly a good date spot but I think it's reeeaaaally fun (with or without a date) to sit at the bar here. It's more lively and you can people watch and talk to the bartenders. Issac is the BEST - he's super upbeat, attentive, and always makes awesome recommendations, despite my fussy requests to customize everything on the menu. \n\nOh and the food! Right. I haven't liked any sushi in the city but the menu here is sooooo good and the freshness is completely unparalleled (ok, I haven't been to alllll the sushi places in SF, but you get it).\n\nSerious Recommendations: \n- Hamachi Carpaccio\n- Tuna Carpaccio \n\nLess Serious Recommendations:\n- Red Snapper Tataki\n- Red Hot Chili Pepper\n\nEnjoy! :)", "rating": 5, "date": "2017-07-19"}, {"excerpts": ["My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\n"], "author": "David L.", "review": "I'm a fan of Tamashis. Eat there about once a month. Haven't met a roll I didn't like (except the one with cream cheese, but I think that's a personal preference). My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\nTakes reservations (Open table). Trendy spot. Can get pretty loud when full. But I keep coming back.", "rating": 4, "date": "2017-02-17"}, {"excerpts": ["Red Hot Chili Pepper roll, Double Shrimp.  "], "author": "Reyana F.", "review": "My new favorite sushi spot in the city. I wasn't expecting it but holy CRAP! I've never seen anything like it.\n\nDefinitely get: Avocado Bomb & Spicy Tuna Tar Tar. The Spicy Tuna Tar Tar was probably the best combination of raw fish I've had in a really really long time.  Avocado, tuna, whatever that delicious sauce was. Oh my.\n\nOther good things: Red Hot Chili Pepper roll, Double Shrimp.  The real winners here though are the specialty sushi.\n\nAtmosphere: pretty casual and loud, it's definitely a spot where people go before going out. Super good and I will DEFINITELY be making a trip back to the Marina to go here soon again.", "rating": 5, "date": "2016-04-03"}, {"excerpts": ["Had the yellowtail nigiri as well as the bamboo and red hot chili pepper rolls. ", "Rolls were plain BAD - tasted like something that comes out of the microwave, yellowtail wasn't fresh at all! "], "author": "Will S.", "review": "Not so sure about all these 5 stars...thought this place was extremely weak. Garlic edamame was a grease pile. Had the yellowtail nigiri as well as the bamboo and red hot chili pepper rolls. Rolls were plain BAD - tasted like something that comes out of the microwave, yellowtail wasn't fresh at all! GF and I ended up not even finishing half our dinner.\n\nTry your luck elsewhere.", "rating": 1, "date": "2015-09-04"}, {"excerpts": ["Red Hot chili pepper roll ($12)\n", "Lion King ($11)\n"], "author": "Payal B.", "review": "A good neighborhood sushi bar. Fish is always very fresh. They have have a good list of options in their menu.\n\nMUST Try - \nSpicy tuna tar tar ($13)\nRed Hot chili pepper roll ($12)\nLion King ($11)\nTempura fried ice cream \n\nAverage -\nTamashi on Fire ($14)\n\nDefinitely my go to place for sushi craving!", "rating": 4, "date": "2015-06-02"}, {"excerpts": ["to the 4 amazing rolls: Tamashi on fire, bamboo, red hot chili pepper, and shrimp dragon roll.\n\n"], "author": "Jeanne C.", "review": "Thanks Yelp for the new find in my neighborhood! Never heard of it or seen it before, so wanted to try something new.\n\nEverything was delicious from the edamame (pepper and salt!) to the 4 amazing rolls: Tamashi on fire, bamboo, red hot chili pepper, and shrimp dragon roll.\n\nAll were very flavorful and delicious, and neither of us could pick a stand out favorite! Always an amazing place when every item is consistently good.\n\nI would definitely come back here!\n\nIt's about $25 with rolls, app and some sake. Not bad! If you're feeling adventurous and a lush, get the \"buy a shot and get a cocktail free\" yelp check in special! It was only Monday, so.... we passed!", "rating": 5, "date": "2015-04-27"}, {"excerpts": ["Between the two of us, we ordered the seaweed salad, the bang bang shrimp, the bamboo roll, the red hot chili pepper roll and the white sake tempura roll. ", "All of the food was EXCELLENT and we were perfectly satisfied with the amount. ", "The cost wasn't outrageous either. ", "I rarely write Yelp reviews, but this time I was moved to do so. ", "A gem of a spot!"], "author": "Shannon E.", "review": "My friend and I were on a search for a sushi spot in Pac Heights that was still serving at 9:30 on a Wednesday night -- and we really lucked out with this one!! I am a sushi fanatic and declare this some of the best sushi I've had in the US (and I've eaten at Nobu). Between the two of us, we ordered the seaweed salad, the bang bang shrimp, the bamboo roll, the red hot chili pepper roll and the white sake tempura roll. All of the food was EXCELLENT and we were perfectly satisfied with the amount. The cost wasn't outrageous either. I rarely write Yelp reviews, but this time I was moved to do so. A gem of a spot!", "rating": 5, "date": "2016-01-19"}, {"excerpts": ["I told him I wanted the spiciest roll and he directed me to the Red Hot Chili Pepper Roll.  ", "It was a good time, but not the spice scorcher or mouth burner ", "it claims to be.  ", "The server asked how it was and he brought over house-made Sriracha sauce and it was really good.  ", "He also brought over 3 other hot sauces which I totally loved.  ", "The server and sushi chef watched me eat the food in amazement and announced they had tremendous respect for me.  ", "LOL!  ", "It was hot, but it wasn't the hottest I've ever had.  ", "It was good though.  ", "I always enjoy myself when I'm there.  ", "The Shumai Dumplings are a good time as well.  ", "I definitely recommend this place.  ", "One of the reasons I discovered this place is because it's like the only sushi place in the neighborhood open for lunch."], "author": "Shaun W.", "review": "Looking forward to coming back!  I popped in for lunch and was served quickly.  The server was nice and outgoing and answered all my questions.  I told him I wanted the spiciest roll and he directed me to the Red Hot Chili Pepper Roll.  It was a good time, but not the spice scorcher or mouth burner it claims to be.  The server asked how it was and he brought over house-made Sriracha sauce and it was really good.  He also brought over 3 other hot sauces which I totally loved.  The server and sushi chef watched me eat the food in amazement and announced they had tremendous respect for me.  LOL!  It was hot, but it wasn't the hottest I've ever had.  It was good though.  I always enjoy myself when I'm there.  The Shumai Dumplings are a good time as well.  I definitely recommend this place.  One of the reasons I discovered this place is because it's like the only sushi place in the neighborhood open for lunch.", "rating": 5, "date": "2015-05-04"}, {"excerpts": ["I had Tamashi on Fire, Volcano, Spider, and the Red Hot chili pepper roll.\n", "The Red Hot Chili Pepper roll was especially good with spicy tuna, asparagus and jalapeno with tuna, hot peppers and yellowish orangeish fish eggs. ", "again all the ingredients came together perfectly without one flavor dominating the other ingredients.\n", "you can tell the chefs are seasoned chefs and knows what they are doing.\nlove this place!"], "author": "Juyoung K.", "review": "I've eaten here few times now and decided to finally write a review, I like to try few times before I actually rate and write a review. didn't have to wait because the group i went to had reservation. The place was packed, but hey it was the weekend, just means food is fresh.\nPlace is awesome, like the music they play, the display on the wall is cool and its clean, like the tables, the bar area, and the restroom etc.\nPeople there are super friendly and attentive.\n\nThe most important part of the review - the food. I'm not a huge sushi or seafood fan but this place, it's really good. Food is a form of art, and the way they arranged their plates looked beautiful and tasted good.\nMiso soup was good, it wasn't too salty or chalky like sometimes you can kinda feel the miso soup power stuff, this place didn't have that. \nTried the Tuna Mango Salad, tuna was fresh and wasn't fishy and the amount of mango that was in the salad was perfect, wasn't too much. It didn't take over the salad, but it was enough where i can still taste it, all the ingredients harmonized and complimented each other very well.\nI had Tamashi on Fire, Volcano, Spider, and the Red Hot chili pepper roll.\nThe Red Hot Chili Pepper roll was especially good with spicy tuna, asparagus and jalapeno with tuna, hot peppers and yellowish orangeish fish eggs. again all the ingredients came together perfectly without one flavor dominating the other ingredients.\nyou can tell the chefs are seasoned chefs and knows what they are doing.\nlove this place!", "rating": 5, "date": "2015-02-12"}, {"excerpts": ["I loved the Red Hot Chili Pepper roll and the seared Tuna Sashimi melted in my mouth. ", "The Uni (Mendocino, I think) was sublime! ", "Attentive, friendly service made the evening just that much better. ", "A must try neighborhood spot."], "author": "Markus N.", "review": "Stopped in on a busy weekend and they were very accommodating to get me a table even though the place was full and I didn't have a reservation. It is a small, but lively space with a great sushi bar. I loved the Red Hot Chili Pepper roll and the seared Tuna Sashimi melted in my mouth. The Uni (Mendocino, I think) was sublime! Attentive, friendly service made the evening just that much better. A must try neighborhood spot.", "rating": 5, "date": "2013-10-21"}], "samurai": [{"excerpts": ["What I ate: 49er roll (not on the menu), spicy tuna roll, samurai roll, avocado salad, ", "Nigori sake\nVisit date: November 8, 2013\nFirst time? ", "The samurai roll was a California roll with eel and salmon, topped with a spicy aioli and black tobiko. ", "It wasn't overly glamorous with toppings but it felt like a party in my mouth. ", "The 49ers roll isn't on their menu, but you can ask them to make it! ", "They were spot on. "], "author": "Erin G.", "review": "What I ate: 49er roll (not on the menu), spicy tuna roll, samurai roll, avocado salad, Nigori sake\nVisit date: November 8, 2013\nFirst time? Yes.\n\nDespite the fact that the waiter/chefs/restaurant forgot about us, their rolls were flavorful even without alcohol-enhanced taste buds! So yes, we ordered our food, the table next to us was seated and got their food before us, we asked about our food (cause no one seemed to notice our empty table), the table next to us FINISHED their food, and then we got our appetizer. I don't know if it was actually worth the wait, but this place is definitely worth a try. \n\nThe spicy tuna roll is luxuriously smooth and carried a decent amount of spice -- not too much to overpower the fresh tuna flavor and just enough to please this spice-loving foodie. The samurai roll was a California roll with eel and salmon, topped with a spicy aioli and black tobiko. It wasn't overly glamorous with toppings but it felt like a party in my mouth. The 49ers roll isn't on their menu, but you can ask them to make it! They were spot on. Also, bonus, their sushi pieces are bite sized, unlike many a sushi joint with their oversized concoctions.\n\nMy friend and I wanted to try a beverage from their cocktail list, but they didn't have any on our visit. Out waiter recommended the Nigori sake -- sweet and milky. A good intro to sake.", "rating": 4, "date": "2013-11-09"}], "white angle": [{"excerpts": ["We took his advice on the White Angle, Crazy Love and Tamashi on Fire. ", "These rolls are a must when coming here. ", "We are from LA, where there are many well know celebrity sushi restaurants. ", "We consider this place one of our favorites. ", "Thank you Isaac for your excellent service. ", "We will be back for more in the near future and definitely send you baby pictures when we have a baby ", "or two maybe three."], "author": "John A.", "review": "My girl friend and I stumbled upon this place on our vacation. We have been in SF for five days and everyday we had a talk about sushi, but decided that on our last day here we grab some place to have some. As our last day being here, we decided that we'd treat ourselves. From the photos, it seemed that it could be a decent place (pictures can be deceiving). We took a Lyft ride from downtown to this spot and walked in surprising ourselves with a cozy and tranquil environment. Our server, Isaac, gave us some great recommendations on sushi rolls. We took his advice on the White Angle, Crazy Love and Tamashi on Fire. These rolls are a must when coming here. We are from LA, where there are many well know celebrity sushi restaurants. We consider this place one of our favorites. Thank you Isaac for your excellent service. We will be back for more in the near future and definitely send you baby pictures when we have a baby or two maybe three.", "rating": 5, "date": "2017-05-21"}], "shrimp dragon": [{"excerpts": ["to the 4 amazing rolls: Tamashi on fire, bamboo, red hot chili pepper, and shrimp dragon roll.\n\n"], "author": "Jeanne C.", "review": "Thanks Yelp for the new find in my neighborhood! Never heard of it or seen it before, so wanted to try something new.\n\nEverything was delicious from the edamame (pepper and salt!) to the 4 amazing rolls: Tamashi on fire, bamboo, red hot chili pepper, and shrimp dragon roll.\n\nAll were very flavorful and delicious, and neither of us could pick a stand out favorite! Always an amazing place when every item is consistently good.\n\nI would definitely come back here!\n\nIt's about $25 with rolls, app and some sake. Not bad! If you're feeling adventurous and a lush, get the \"buy a shot and get a cocktail free\" yelp check in special! It was only Monday, so.... we passed!", "rating": 5, "date": "2015-04-27"}], "tobiko island": [{"excerpts": ["I ordered the seaweed salad, tobiko island specialty roll, two-piece order of yellowtail sashimi and two-piece order of eel sashimi; my friend also ordered two specialty rolls as well. ", "The seaweed salad was tasty ", "but as I love seaweed salad ", "I thought the portion was too small to split ", "so I would go with this as a serving for one person. ", "The specialty rolls were all good ", "and I thought the quality of the fish in both the rolls and sashimi was tasty as well. ", "Their specialty rolls aren't overly large and I definitely could have split another specialty roll. ", "All in all I think average sushi spot that I would be back to in the neighborhood."], "author": "Aryn C.", "review": "I came here with a friend tonight after yoga (sopping wet from sweat) and it was very busy! I ordered the seaweed salad, tobiko island specialty roll, two-piece order of yellowtail sashimi and two-piece order of eel sashimi; my friend also ordered two specialty rolls as well. The seaweed salad was tasty but as I love seaweed salad I thought the portion was too small to split so I would go with this as a serving for one person. The specialty rolls were all good and I thought the quality of the fish in both the rolls and sashimi was tasty as well. Their specialty rolls aren't overly large and I definitely could have split another specialty roll. All in all I think average sushi spot that I would be back to in the neighborhood.", "rating": 3, "date": "2017-01-08"}, {"excerpts": ["My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\n"], "author": "David L.", "review": "I'm a fan of Tamashis. Eat there about once a month. Haven't met a roll I didn't like (except the one with cream cheese, but I think that's a personal preference). My go to: Red Hot Chili Pepper; Tobiko Island; Bamboo; Yellowtail Love; Special edamame; Tuna mango salad (use to serve with more fish on salad), and Avocado bomb.\n\nTakes reservations (Open table). Trendy spot. Can get pretty loud when full. But I keep coming back.", "rating": 4, "date": "2017-02-17"}], "tuna love": [{"excerpts": ["Every roll I have tried has been really tasty as well: Double Shrimp, Bamboo, King Salmon, Tuna Love. ", "They have some great sashimi options as well. ", "It is a small and cozy spot and the service is efficient so it is always has been a great experience whether there to dine in or take out."], "author": "Derek S.", "review": "I love Tamashisoul! The \"special edamame\" is delicious, with great flavor for the garlic lovers out there. Every roll I have tried has been really tasty as well: Double Shrimp, Bamboo, King Salmon, Tuna Love. They have some great sashimi options as well. It is a small and cozy spot and the service is efficient so it is always has been a great experience whether there to dine in or take out.", "rating": 4, "date": "2016-06-25"}, {"excerpts": ["Then we had the bamboo roll and the tuna love. ", "Wow! ", "Service and food is more than deserving of 5 stars!"], "author": "Victoria T.", "review": "Best sushi I've had ever! We started with the spicy tuna tar tar, hamachi carpaccio, 5 pieces of sashimi. The server Minh recommended a specific type of sake for our taste. He is fantastic! Then we had the bamboo roll and the tuna love. Wow! Service and food is more than deserving of 5 stars!", "rating": 5, "date": "2014-06-14"}, {"excerpts": ["I would recommend the Avocado Bomb and Tuna Love. ", "My girlfriend asked me to add that they pour a weak glass of wine. ", "Beers are always the same size though...."], "author": "Kenny B.", "review": "I go here a couple times a month and it is pretty solid. Nothing crazy but great for the price. I would recommend the Avocado Bomb and Tuna Love. My girlfriend asked me to add that they pour a weak glass of wine. Beers are always the same size though....", "rating": 4, "date": "2014-01-31"}], "kamakaze": []}