{"asari soup": [], "nameko soup": [{"excerpts": ["A couple of favorite items besides the fantastic sushi are the Oyster shots and Nameko soup!"], "author": "N E.", "review": "I've been a loyal customer of Tanuki for 3 years now, it's my favorite Sushi restaurant in San Francisco.  There's very little to critique about the food as it's extremely fresh and they have the best Uni I've ever had in California.  I would recommend sitting up at the bar as you're sure to have a much more enjoyable dining experience.  The chefs are extremely friendly and love to to share a drink or two or three with customers.  A couple of favorite items besides the fantastic sushi are the Oyster shots and Nameko soup!", "rating": 5, "date": "2009-11-17"}], "spinach goma ae salad": [], "green salad small": [], "shiitake mushroom salad": [], "seafood sunomono salad": [], "green salad large": [], "bamboo roll": [{"excerpts": ["we got the scallop lover, crab and avocado roll, uni shooters, tanuki roll, and bamboo roll. ", "All were very tasty. ", "Nothing in particular stood out, but everything was very solid. ", "I would order each of them again."], "author": "Luke T.", "review": "Just had a quick lunch at Tanuki with my father who is visiting from out of town. We've eaten at some of the best sushi restaurants in the world, both traditional style japanese cuisine and ornate fusion approaches. Tanuki is squarely located in the California sushi tradition, and all of its basics are executed to a high standard. The fish is fresh, flavorful, and deliciously tender. The rice is fragrant and perfectly prepared. There is but one waitress during lunch time attending to the whole restaurant, which means things move a bit more slowly. \n\nTanuki's food is not ostentatious, but delicate and simple. Sometimes that's just what you're in the mood for, and today I was. I would happily come back to Tanuki with more friends!\n\nPs. we got the scallop lover, crab and avocado roll, uni shooters, tanuki roll, and bamboo roll. All were very tasty. Nothing in particular stood out, but everything was very solid. I would order each of them again.", "rating": 4, "date": "2013-03-29"}, {"excerpts": ["We ordered the oyster shooters, the bamboo roll, the spicy hamachi roll, the scallop roll ", "and I also wanted an uni shooter. ", "After the waitress took our order, she came back and said they were out of uni.. ", "bummer. ", "But I was still excited for the oyster shooters! ", "I normally don't like sake in mine ", "The spicy hamachi roll wasn't even spicy (and I don't have a high tolerance for spiciness) and the bamboo roll didn't have any kick to it.\n\n"], "author": "Valerie T.", "review": "2.5 Stars\n\nCame here on a Wednesday night after craving some oyster shooters. I heard about this place from a girl friend because it's so rare to find places that have oyster shooters. Also read the yelp reviews and wanted to give it a try. Got here at about 7pm and parking was a bit difficult. There was a slight wait, but got seated fairly quickly and hot tea was brought to our table shortly after.\n\nWe ordered the oyster shooters, the bamboo roll, the spicy hamachi roll, the scallop roll and I also wanted an uni shooter. After the waitress took our order, she came back and said they were out of uni.. bummer. But I was still excited for the oyster shooters! I normally don't like sake in mine so I asked for no sake.\n\nNow this is why I'm deducting stars.. while everyone around us were seated after us, they kept getting our orders before us. But we were enjoying each others company so we compressed our tummies for a while longer anticipating our oyster shooters since that's the easiest order to make. Waited about 35 minutes before asking our waitress why it's taking so long while everyone else is getting their orders.. 5 minutes later she brings them out, but leaves before telling us which ones have sake and which ones don't. We wait for her to come back around to ask which ones are which and she looks puzzled and yells out at another waiter to see which ones are which. They all look at us as if we did something wrong and finally came back and told us that none of them have sake in them. Fine for me since that was what I originally wanted, but no apology of any kind to my friends who wanted sake in them. However, we let that slide.\n\nOnto the next part.. we waited over an hour for our 3 rolls while everyone was still getting their food before ours! And the rolls weren't even hot! It's as if they were just sitting in the back, just chillin' there.\n\nHowever, I enjoyed the oyster shooters and the scallop roll. Those two were my favorites, but I've had better. The spicy hamachi roll wasn't even spicy (and I don't have a high tolerance for spiciness) and the bamboo roll didn't have any kick to it.\n\nService definitely could've been better. All I hoped for was a simple apology that they messed up on our orders and having waited so long for everything to come out, but nope. Nothing.\n\nI may be back.. Mainly because I can't get enough of oyster shooters!", "rating": 2, "date": "2013-01-11"}, {"excerpts": ["Personal favorites:\nyellow tail sashimi - fresh, generous-sized pieces that melted in my mouth\nbamboo roll - this albacore tuna wrapped in rice topped with hamachi and avocado was also generous portions with fresh fish pieces\noyster shooter - not many sushi places have these, so I get excited to find and have them (they also had uni shooters that day)\n\n"], "author": "Carol K.", "review": "Came for: group dinner for sushi sushi sushi\nWill come back for: great sushi / sashimi / other japanese fares\n\nCould it be?  I wasn't sure what to expect on my first visit as the choice for the group outing was based on yelpers...  well, you all did not disappoint; it was.  \nIt was good!  We had quite a spread and chowed down through them: nabeyaki udon, various rolls, daily specials (crab & pumpkin roll), and sashimi. \n\nPersonal favorites:\nyellow tail sashimi - fresh, generous-sized pieces that melted in my mouth\nbamboo roll - this albacore tuna wrapped in rice topped with hamachi and avocado was also generous portions with fresh fish pieces\noyster shooter - not many sushi places have these, so I get excited to find and have them (they also had uni shooters that day)\n\nOur group enjoyed as did I; it was a solid experience.  Moreover, the moderate price points make it a good choice for group outings, quick go-to's and when you simply want some good sushi without having to break your piggy bank.\nThis could be a contender for my other go-to sushi place in SF.  Will just have to go back to confirm.", "rating": 4, "date": "2010-07-16"}, {"excerpts": ["The Bamboo roll and sashimi that I sampled were very fresh.  "], "author": "S L.", "review": "Great little traditional Japanese restaurant, in terms of both food and decor.  I've been to a lot of gaudy Japanese places lately, and it was a breath of fresh air to sit down here to some quality food. \n\nAgedashi tofu was delicious, and even better and easier to eat than other places' tofu because they fry bite-sized cubes.  The Bamboo roll and sashimi that I sampled were very fresh.  Our okame udon was not fancy but still very good, with perfectly-cooked noodles.\n\nI was stuffed by the end of the meal but not feeling gross, since all the flavors were very light.  Highly recommended for a quiet meal out.", "rating": 4, "date": "2010-06-01"}, {"excerpts": ["Try the Bamboo roll or any of the spicy tuna varieties.  ", "Awesome miso with big chunks of tofu and lots of seaweed.  ", "I like the little TV with sports on at the sushi bar."], "author": "Andrea R.", "review": "GREAT sushi.  Fresh rolls, great service.  Try the Bamboo roll or any of the spicy tuna varieties.  Awesome miso with big chunks of tofu and lots of seaweed.  I like the little TV with sports on at the sushi bar.", "rating": 4, "date": "2007-12-08"}], "blue sea roll": [], "butterfly roll": [], "dream roll": [{"excerpts": ["You can't go wrong with the sushi rolls- salmon being my favorite fish, I usually go with the Dream Roll and Tokyo Roll. ", "However, if you're not a raw fish person, Tanuki has filling Donburi bowls (\"rice bowl dish\" typically consisting of fish, meat, or vegetables served over rice) and Udon; "], "author": "Grace L.", "review": "Tanuki is one of my favorite sushi restaurants in the Inner Richmond! My husband and I typically resort here for dinner at least once a month when we're craving something light and fresh. It's a small restaurant but we usually get seated right away and the service is fairly quick. You can't go wrong with the sushi rolls- salmon being my favorite fish, I usually go with the Dream Roll and Tokyo Roll. However, if you're not a raw fish person, Tanuki has filling Donburi bowls (\"rice bowl dish\" typically consisting of fish, meat, or vegetables served over rice) and Udon; the Katsu Donburi and Tempura Udon both being great to share. Tanuki is a winner in my account!", "rating": 5, "date": "2016-11-24"}, {"excerpts": ["Dream Roll: ", "Salmon, unagi and avocado"], "author": "Jocie M.", "review": "Considering it was Valentine's Day, I think the wait was ok, about 15 minutes around 7:30pm. After 8pm there's no wait.\n\nScallop Lover Roll: delicious, baked with salmon inside and raw scallop outside with a sweet mayo sauce. \nFire Roll: spicy hamachi and salmon inside, yums.\nDream Roll: Salmon, unagi and avocado, it's good but a pretty normal tasting roll.\n\nSukiyaki and tuna sashimi combo: Miso soup had big chucks of soft tofu, much appreciated. Noodle salad was dressed in mayo or something, I'm not a fan of mayo but if people like mac salad, it's a similar taste. Sukiyaki was smaller and a little bland compared to other restaurants. The tuna sashimi was pretty fresh. An ok combo overall. I'd go for the sashimi again, but with a different entree.", "rating": 4, "date": "2012-02-14"}, {"excerpts": ["Also really good were the dream roll, space roll, and tropical roll. "], "author": "Amy B.", "review": "I'm always excited to find another great sushi place since, let's face it, I'm a sushi addict. Everything here was fantabulous: the fish was fresh and yummy, the staff was friendly, and it's always a good sign to see that most of the patrons are actually Japanese. \n\nMost notable was the hamachi kama, or grilled yellowtail collar. It was fatty and oily and delicious! Also really good were the dream roll, space roll, and tropical roll. The tokyo roll was also not bad. \n\nThere were 2 downfalls to this place. The first is obvious: the parking sucks! If I'm coming on a weekday from work by bus this downfall would dissappear. The other downfall is that it is expensive! The Chirachi (my favorite!) was $20 bucks whereas most other places it's no more than $13 to $15. And a negihama is $7--more than twice what it is in other good sushi places. The rainbow roll, which I'm happy to report is made with regular crab rather than that tempura crap, is $15!!!! \n\nThis place is really good, but with all of the options for sushi in this great city, I'll keep looking for something both good and affordable.", "rating": 4, "date": "2008-03-16"}], "fire roll": [{"excerpts": ["None of the \"spicy\" rolls were spicy and the Fire roll was disgusting. "], "author": "Brady K.", "review": "I'm completely at a loss on this one... after reading everyone else's reviews, I swear I must've gone to a different restaurant - but I checked and double and triple checked! My main man at sushi, Nobu, loves this place - what parallel universe with Spock's evil twin did I stumble into?\n\nMy girlfriend and I had wanted to try Tanuki for a while and were giddy that we could this saturday night. What a huge disappointment. We sat at the sushi bar and it smelled fishy. WTF? I tried hard not to notice that the fish was stacked haphazardly in the cooler and that the salmon looked improperly trimmed with lots of brown on it - indicating a cut too close to the skin. And then there was the rice...\n\nI had always hoped of one day being capable of discerning different qualities of rice. No problemo here! The vinegar was wrong - as in there was none because it all tasted like clumpy, sticky white rice. And that's all you'd taste because there were gobs and gobs of it messing up the fish. The rice messed up the bland rolls as they disintegrated at my chopsticks light touch. The nigiri was hopeless. They were the weirdest thing I'd ever seen - big floppy blankets of fish plopped on top of more of that damned white rice. \n\nWe couldn't bring ourselves to finish the fish or rolls. None of the \"spicy\" rolls were spicy and the Fire roll was disgusting. The hamachi was gristly and smelled bad.\n\nI feel terrible writing this review because everyone was really nice there. I'm just calling it as I saw it. Unfortunately, truth be told, my girlfriend lost her cookies when we got home. Ug.", "rating": 1, "date": "2008-07-27"}, {"excerpts": ["the fire roll was my favorite. ", "just enough kick and nothing too flashy. ", "simply yellowtail and salmon in a spicy sauce. ", "mmMmm. ", "i saw some other delicious sounding stuff on their special board including a lobster hand roll. ", "can't wait to come back."], "author": "Regina C.", "review": "great sushi!! this place is quite unassuming from the outside. hidden behind a tree, i would never think to walk in. lucky for me and my yelp-wise mind i found this place. the sushi is fresh and really good. the fire roll was my favorite. just enough kick and nothing too flashy. simply yellowtail and salmon in a spicy sauce. mmMmm. i saw some other delicious sounding stuff on their special board including a lobster hand roll. can't wait to come back.", "rating": 5, "date": "2013-06-04"}, {"excerpts": ["Fire Roll: spicy hamachi and salmon inside, yums.\n"], "author": "Jocie M.", "review": "Considering it was Valentine's Day, I think the wait was ok, about 15 minutes around 7:30pm. After 8pm there's no wait.\n\nScallop Lover Roll: delicious, baked with salmon inside and raw scallop outside with a sweet mayo sauce. \nFire Roll: spicy hamachi and salmon inside, yums.\nDream Roll: Salmon, unagi and avocado, it's good but a pretty normal tasting roll.\n\nSukiyaki and tuna sashimi combo: Miso soup had big chucks of soft tofu, much appreciated. Noodle salad was dressed in mayo or something, I'm not a fan of mayo but if people like mac salad, it's a similar taste. Sukiyaki was smaller and a little bland compared to other restaurants. The tuna sashimi was pretty fresh. An ok combo overall. I'd go for the sashimi again, but with a different entree.", "rating": 4, "date": "2012-02-14"}], "harmony roll": [{"excerpts": ["Being a love of scallop, I have to say the harmony roll was very fresh and has pretty decent amount of protein.\n\n"], "author": "Cindy B.", "review": "Happened upon this place while in the neighbourhood and looked thru Yelp.\n\nThey just opened for dinner and the place is almost empty. Looked cozy and the chefs are nice. However, we sat there for a while before the server came to take our order. They were really not busy, I swear!\n\nBeing a love of scallop, I have to say the harmony roll was very fresh and has pretty decent amount of protein.\n\nThe hot hamachi special was pretty disappointing. The sushi rolls are battered and fried that the hamachi was cooked thru instead of flash fried, then sat in a broth so it kind of defeated the deep frying.", "rating": 2, "date": "2010-09-04"}, {"excerpts": ["The Harmony roll was the perfect harmony of spicy and scallop. "], "author": "Jessica L.", "review": "This is a 3.5 star review - the wimpy sushi rolls we got here were very good BUT the biggest turn off EVER in a restaurant is the awful STANK of fish. This place smelled like bad sushi - and I was scared at first.\n\nThe Heavenly roll was HEAVENLY - fantastic tuna. The Harmony roll was the perfect harmony of spicy and scallop. And the Tokyo roll was good even though it included salmon - yay score one for you Tanuki. \n\nOddly, Ali Gato R. and I felt the sushi rice here was strangely good...just something to note.\n\nThis place was good, fast, but SMELLY. Go to Chin's across the street for a less smelly experience, cheaper dishes and wider selection.", "rating": 3, "date": "2007-10-03"}, {"excerpts": ["Harmony Roll - Nothing special but the scallops were good and fresh.\n", "Vege Roll - Forgot the actual name of it ", "but the meal could have done without it.\n", "Sashimi Dinner - ", "Since my friend wanted soup and ", "I wanted sashimi, we ordered a sashimi dinner as well. ", "The dinner came with tuna, white tuna, salmon and hamachi. ", "All good. ", "All fresh. ", "All melts in my mouth and not in my hands.\n", "Hot Sake - Of course, it is not a true japanese meal without some hot sake. ", "The small only gets about 3 shots, but 1.5 shots each was good enough for a dinner.\n", "I will have to come here a lot more since it is so close to home."], "author": "Jimmy N.", "review": "Wow, how can something so good and so close to home pass me by. I usually know the goods around the neighborhood but this place, I had no idea existed.\nMy friend and I wanted to go to dinner and My Tofu House was packed so we decided to Yelp something. Tanuki came up so we decided to give it a try.\nIt's a small place, but surprisingly, fits a good amount of people in there. After about a 10 minute wait, we were seated.\nWhat we ordered.\nAgedashi - I saw that Susy C. recommended this dish and that the sauce was separate from the tofu so I had to try it. I am glad I did because it is probably one of the best agedashi I have ever had.\nOyster Shooters - Quail egg, oyster, ponzu sauce, lemon. I was a little on the tangy side but I love citrus so awesome!\nHarmony Roll - Nothing special but the scallops were good and fresh.\nVege Roll - Forgot the actual name of it but the meal could have done without it.\nSashimi Dinner - Since my friend wanted soup and I wanted sashimi, we ordered a sashimi dinner as well. The dinner came with tuna, white tuna, salmon and hamachi. All good. All fresh. All melts in my mouth and not in my hands.\nHot Sake - Of course, it is not a true japanese meal without some hot sake. The small only gets about 3 shots, but 1.5 shots each was good enough for a dinner.\nI will have to come here a lot more since it is so close to home.", "rating": 5, "date": "2009-02-16"}], "miami roll": [], "negihama roll": [], "negitoro roll": [], "poki roll": [{"excerpts": ["I ordered agedashi tofu, sashimi combo (14 pcs) and the poki roll. \n\n", "The poki roll was nothing special. "], "author": "Amanda R.", "review": "I heard good things about this restaurant so I decided to give it a try. \n\nI ordered agedashi tofu, sashimi combo (14 pcs) and the poki roll. \n\nThe agedashi tofu was so unauthentic. It basically fried tofu in tempura batter and a watery sauce, in which they put such a little amount of sauce it seemed like they were on a budget or something. Like there was HARDLY any sauce in the agedashi tofu. On top of that the agedashi tofu batter was soggy and rubbery. \n\nThe sashimi was so so, didn't taste extremely fresh and was actually kind of rubbery. \n\nThe poki roll was nothing special. It was really plain and extremely simple, and the texture of the fish was kind of tough and did not taste fresh. \n\nI didn't even finish half of my food before I asked for the check. \n\nI wanted to like this restaurant because I heard it was really good, but was disappointed. The only reason why I'm giving it 2 stars is because the sushi chef behind the counter was nice enough to take my order because the waitress was busy going back and fourth with a large group of people. I don't think I'll be back here.", "rating": 2, "date": "2015-10-31"}], "popeye roll": [{"excerpts": ["The Popeye roll was an interesting twist, and arrr, I did feel a little stronger after eating.  ", "All-in-all, the quality of the Hamachi and Toro was great (my baselines for rating sushi restaurants), and the price was very reasonable.  ", "I'm now a fan of the Raccoon Dog... ", "at least, I think that is what Tanuki means in Japanese."], "author": "Marc G.", "review": "Pretty good sushi.  I was impressed by the variety of taste and selection of roll choices.  I have to say that it was about 3.5 stars because I was underwhelmed by the wait staff, but I think they sere short-staffed to one person.  Fortunately, the tastiness of the Fire and Tropical rolls nearly made up for it and the Crab and Sweet Pumpkin tempura scored big points.   The Popeye roll was an interesting twist, and arrr, I did feel a little stronger after eating.  All-in-all, the quality of the Hamachi and Toro was great (my baselines for rating sushi restaurants), and the price was very reasonable.  I'm now a fan of the Raccoon Dog... at least, I think that is what Tanuki means in Japanese.", "rating": 4, "date": "2010-04-18"}], "rock and roll": [], "tanuki roll": [{"excerpts": ["Definitely try sashimi and tanuki roll! ", "Love the dessert too,ice cream is so nice. ", "Tempura with little bit teriyaki sauce and kaki fry for appetizer  are great.couple asahi draft with friends will be perfect japanese restaurant to go. ", "I also try the chicken teriyaki and see bass and salmon teriyaki here too, lol have dinner here almost everynight. ", "Food are fresh and good!"], "author": "Sunny W.", "review": "This restaurant is awesome!!! Definitely try sashimi and tanuki roll! Love the dessert too,ice cream is so nice. Tempura with little bit teriyaki sauce and kaki fry for appetizer  are great.couple asahi draft with friends will be perfect japanese restaurant to go. I also try the chicken teriyaki and see bass and salmon teriyaki here too, lol have dinner here almost everynight. Food are fresh and good!", "rating": 5, "date": "2016-03-03"}, {"excerpts": ["We tried the tanuki roll and scallop lovers roll! ", "Both were delicious. ", "The scallop lovers roll had spicy tuna inside with raw scallops on top with a spicy mayo. ", "Surprisingly delicious ", "and it was unique that it was slightly warmed up ", "so it tasted delicious. ", "The tanuki roll had tempura, avocado, unagi and eggplant ", "and it was melt in your mouth good. ", "All the flavors together combined harmoniously. ", "I can't wait to come back to try more good food!"], "author": "Stella J.", "review": "3.5 stars\nFirst time coming here and I only tried the sushi. I do want to try other things in their menu as well.\n\nWe tried the tanuki roll and scallop lovers roll! Both were delicious. The scallop lovers roll had spicy tuna inside with raw scallops on top with a spicy mayo. Surprisingly delicious and it was unique that it was slightly warmed up so it tasted delicious. The tanuki roll had tempura, avocado, unagi and eggplant and it was melt in your mouth good. All the flavors together combined harmoniously. I can't wait to come back to try more good food!", "rating": 3, "date": "2012-04-28"}, {"excerpts": ["we got the scallop lover, crab and avocado roll, uni shooters, tanuki roll, and bamboo roll. ", "All were very tasty. ", "Nothing in particular stood out, but everything was very solid. ", "I would order each of them again."], "author": "Luke T.", "review": "Just had a quick lunch at Tanuki with my father who is visiting from out of town. We've eaten at some of the best sushi restaurants in the world, both traditional style japanese cuisine and ornate fusion approaches. Tanuki is squarely located in the California sushi tradition, and all of its basics are executed to a high standard. The fish is fresh, flavorful, and deliciously tender. The rice is fragrant and perfectly prepared. There is but one waitress during lunch time attending to the whole restaurant, which means things move a bit more slowly. \n\nTanuki's food is not ostentatious, but delicate and simple. Sometimes that's just what you're in the mood for, and today I was. I would happily come back to Tanuki with more friends!\n\nPs. we got the scallop lover, crab and avocado roll, uni shooters, tanuki roll, and bamboo roll. All were very tasty. Nothing in particular stood out, but everything was very solid. I would order each of them again.", "rating": 4, "date": "2013-03-29"}, {"excerpts": ["While their sashimi combo was ok, and their maguro tataki was a bit bland--but their seafood sunomono (the crab!!), tanuki roll (eel, shrimp tempura, eggplant and avocado--yum!) and their great service is enough to keep me coming back. \n\n"], "author": "Faffy L.", "review": "Some say that Sunday is the worst day for sushi but take me to Tanuki any Sunday for supper because I am in love with the ambiance here. \n\nWhile their sashimi combo was ok, and their maguro tataki was a bit bland--but their seafood sunomono (the crab!!), tanuki roll (eel, shrimp tempura, eggplant and avocado--yum!) and their great service is enough to keep me coming back. \n\nSo come on over, grab a window seat, sip some tea and watch the light dissipate in the quiet calm that is California Street.", "rating": 4, "date": "2007-05-29"}, {"excerpts": ["Ankimo, the Tanuki roll, outstanding yellowtail and maguro sashimi. ", "If you love oysters in the excessive, unhealthy way that my dinner date ", "and I do, order a dozen. "], "author": "Jules H.", "review": "With a sushi restaurant on every block in the city, it's easy to get overwhelmed by the quantity of possible selections. How do you sort out the gems from the riffraff? That's easy: ask an expert. I am lucky enough to have a friend who knows San Francisco dining exceptionally well and forunate enough to have received Tanuki as the ultimate sushi recommendation.\n\nI visited Tanuki on a Tuesday, stayed for several orders of sushi and was thrilled to see how popular this place is. Hit or miss parking and a general distance from the busiest part of the neighborhood, yet a full dining room? Excellent sign. A traditional menu and quick, friendly service? Check. Constant laughter and smiles from both the chefs preparing and the servers delivering our food? I'm sold. \n\nMenu must haves: Ankimo, the Tanuki roll, outstanding yellowtail and maguro sashimi. If you love oysters in the excessive, unhealthy way that my dinner date and I do, order a dozen. You won't be sorry. \n\nFive stars all around, Tanuki is the gold standard for Bay Area sushi.", "rating": 5, "date": "2010-05-20"}, {"excerpts": ["I recommend the hamachi sashimi, Tanuki roll, hamachi kama, ume & shiso roll (i'm not a fan of ume, "], "author": "Valerie F.", "review": "This is easily one of my favorite places in the area and one of the most common names that I recommend when asked for good Japanese restaurants. The prices are consisent and expected for sushi, so people shouldn't leave feeling like they got ripped off.  I recommend the hamachi sashimi, Tanuki roll, hamachi kama, ume & shiso roll (i'm not a fan of ume, but somehow i like it here), and steamed clams in broth (absolutely satisfying on a cold night).\n\nThe vibe is more homey and family-oriented than it is a date spot for music and decor. Parking within a block radius is possible if you prefer early dinners (I usually dine here before 7pm). Otherwise, you may have to spend about 5 minutes circling around Clement or California Streets (overall, parking isn't a big hindrance).", "rating": 4, "date": "2006-12-28"}, {"excerpts": ["Tonight's devour was he fire (spicy yellowtail and salmon), dream (salmon and avocado with eel on top), tanuki roll (fired shrimp roll topped with eggplant and eel), topical (mango avocado, tuna and white tuna), and nasu (eggplant in ponzu marinade). ", "Oh and of course uni and oyster shots! ", "The fish and ingredients down to that tangy ginger were fresh. "], "author": "Lola L.", "review": "It's that time of the week..sushi time! When we went there tonight, the places was empty. At first this worried me but I got over it.\n\nTonight's devour was he fire (spicy yellowtail and salmon), dream (salmon and avocado with eel on top), tanuki roll (fired shrimp roll topped with eggplant and eel), topical (mango avocado, tuna and white tuna), and nasu (eggplant in ponzu marinade). Oh and of course uni and oyster shots! The fish and ingredients down to that tangy ginger were fresh. It was one of those instances where I didn't need soy sauce when I ate piece of raw fish.\n\nThere's only 15 or so tables that seat up to 4 people and a sushi bar.  The walls are semi-bright colors with little abstract painting on the wall. It was quiet tonight but during full house I don't think you'd be able to hear your date.\n\nThe service was prompt and efficient. The prices for each roll ranges from $6 to $13. They also serve cooked food that i must try next time. \nNOTE: they only take reservations for a big party, i.e. 6 or more.", "rating": 4, "date": "2008-09-23"}, {"excerpts": ["The Tanuki roll, WOW, reminds me of Tom Robbins book, Villa Incognito, where Tanuki is kind of a god in a fable where you fill your belly and drink hot tea & Sake while pounding your chest and howling."], "author": "K M.", "review": "Tanuki is a hidden gem, I have purposely not yelped about it because I hoped to keep from waiting in line. I love sushi and this restaurant has been the best sushi experience; of my 6 years in San Francisco. The Tanuki roll, WOW, reminds me of Tom Robbins book, Villa Incognito, where Tanuki is kind of a god in a fable where you fill your belly and drink hot tea & Sake while pounding your chest and howling.", "rating": 5, "date": "2011-06-28"}, {"excerpts": ["this sweet little spot is a really great sushi place--try the Tanuki Roll.  ", "It's their house specialty combo roll that's really unique and tasty.  ", "Parking isn't too bad and we didn't have to wait for a table.  ", "The BF got the Chicken Teriyaki and it came as whole pieces of chicken instead of cut up pieces,  and he was pretty stoked about that.  ", "They staff also gets huge bonus points for quietly tolerating my outspoken girlfriend's graphic accounts of her latest sex ritual.  ", "We'll be back!"], "author": "Sue U.", "review": "Wow! this sweet little spot is a really great sushi place--try the Tanuki Roll.  It's their house specialty combo roll that's really unique and tasty.  Parking isn't too bad and we didn't have to wait for a table.  The BF got the Chicken Teriyaki and it came as whole pieces of chicken instead of cut up pieces,  and he was pretty stoked about that.  They staff also gets huge bonus points for quietly tolerating my outspoken girlfriend's graphic accounts of her latest sex ritual.  We'll be back!", "rating": 5, "date": "2005-07-15"}], "tekka roll": [{"excerpts": ["They happily accomodated our request to modify a tekka roll with some shiso, and the result was actually deliciously tasty.  ", "Sort of loud, though I did like the decor.  ", "I would willingly go back here, but I'd rather find something slightly cheaper - the quality was more in the $5/roll range than the $7/roll.  ", "Nothing special, but definitely solid."], "author": "Becky N.", "review": "Totally acceptably average sushi place, in my opinion.  The fish was fresh, but the rolls weren't very creative and they were small.  It took them a long time to take our initial order, but then again the girls were zooming back and forth from the kitchen so I guess they were just busy.  They happily accomodated our request to modify a tekka roll with some shiso, and the result was actually deliciously tasty.  Sort of loud, though I did like the decor.  I would willingly go back here, but I'd rather find something slightly cheaper - the quality was more in the $5/roll range than the $7/roll.  Nothing special, but definitely solid.", "rating": 3, "date": "2007-08-16"}], "tokyo roll": [{"excerpts": ["You can't go wrong with the sushi rolls- salmon being my favorite fish, I usually go with the Dream Roll and Tokyo Roll. ", "However, if you're not a raw fish person, Tanuki has filling Donburi bowls (\"rice bowl dish\" typically consisting of fish, meat, or vegetables served over rice) and Udon; "], "author": "Grace L.", "review": "Tanuki is one of my favorite sushi restaurants in the Inner Richmond! My husband and I typically resort here for dinner at least once a month when we're craving something light and fresh. It's a small restaurant but we usually get seated right away and the service is fairly quick. You can't go wrong with the sushi rolls- salmon being my favorite fish, I usually go with the Dream Roll and Tokyo Roll. However, if you're not a raw fish person, Tanuki has filling Donburi bowls (\"rice bowl dish\" typically consisting of fish, meat, or vegetables served over rice) and Udon; the Katsu Donburi and Tempura Udon both being great to share. Tanuki is a winner in my account!", "rating": 5, "date": "2016-11-24"}, {"excerpts": ["I loved the Tokyo roll! ", "Noodle salad was good and refreshing. ", "Tried some chicken donburi - it's sweet from the onions. ", "Not really a big fan of savory food tasting sweet in general. "], "author": "Linda L.", "review": "The sushi especially the sashimi is really good and fresh. Unless you get an udon or donburi, portions are small for rest of the items.  I ordered the Toyko roll (salmon, tuna, avocado) and the noodle salad. My friends ordered the chicken donburi and beef teriyaki/tuna sashimi combo. I loved the Tokyo roll! Noodle salad was good and refreshing. Tried some chicken donburi - it's sweet from the onions. Not really a big fan of savory food tasting sweet in general. Teriyaki beef entree was really small but not bad - I'd prefer the beef to be a little pink though. \n\nOverall it was a good meal and service was great! Lady was really nice, came out with plate of watermelon slices for us after we finished our meal.", "rating": 3, "date": "2014-07-24"}, {"excerpts": ["And the Tokyo roll was good even though it included "], "author": "Jessica L.", "review": "This is a 3.5 star review - the wimpy sushi rolls we got here were very good BUT the biggest turn off EVER in a restaurant is the awful STANK of fish. This place smelled like bad sushi - and I was scared at first.\n\nThe Heavenly roll was HEAVENLY - fantastic tuna. The Harmony roll was the perfect harmony of spicy and scallop. And the Tokyo roll was good even though it included salmon - yay score one for you Tanuki. \n\nOddly, Ali Gato R. and I felt the sushi rice here was strangely good...just something to note.\n\nThis place was good, fast, but SMELLY. Go to Chin's across the street for a less smelly experience, cheaper dishes and wider selection.", "rating": 3, "date": "2007-10-03"}, {"excerpts": ["The tokyo roll was also not bad. \n\n"], "author": "Amy B.", "review": "I'm always excited to find another great sushi place since, let's face it, I'm a sushi addict. Everything here was fantabulous: the fish was fresh and yummy, the staff was friendly, and it's always a good sign to see that most of the patrons are actually Japanese. \n\nMost notable was the hamachi kama, or grilled yellowtail collar. It was fatty and oily and delicious! Also really good were the dream roll, space roll, and tropical roll. The tokyo roll was also not bad. \n\nThere were 2 downfalls to this place. The first is obvious: the parking sucks! If I'm coming on a weekday from work by bus this downfall would dissappear. The other downfall is that it is expensive! The Chirachi (my favorite!) was $20 bucks whereas most other places it's no more than $13 to $15. And a negihama is $7--more than twice what it is in other good sushi places. The rainbow roll, which I'm happy to report is made with regular crab rather than that tempura crap, is $15!!!! \n\nThis place is really good, but with all of the options for sushi in this great city, I'll keep looking for something both good and affordable.", "rating": 4, "date": "2008-03-16"}, {"excerpts": ["The Tokyo roll (salmon, tuna & avocado) roll was average. ", "The sake, two bottles of Asahi, the veggie combo, the avocado roll and Tokyo roll totaled $40 which was definitely reasonable. \n\n"], "author": "Kelly R.", "review": "Good sushi option in the neighborhood. It was tough to decide which place to try since there's about 3 places within 10 ft. of each other on this block. Fish was ok, but the vegetable combo and veggie rolls were great. The chefs behind the bar looked like they were having a good time and had a couple shots of sake with the sushi bar dwellers which was fun. \n\nI like creative, non-traditional rolls, which they had a few of, but nothing too special. The Tokyo roll (salmon, tuna & avocado) roll was average. I did enjoy the straight avocado roll (simple, but very fresh) and the grilled eggplant nigiri - nice presentation and good flavor. \n\nOrdered a bottle of cold sake, not too sweet and not too dry, which was nice--they have a couple selections with a good range. The sake, two bottles of Asahi, the veggie combo, the avocado roll and Tokyo roll totaled $40 which was definitely reasonable. \n\nOverall wasn't incredibly wowed by anything here...would probably try the other two places on this block before returning.", "rating": 3, "date": "2007-09-16"}], "tropical roll": [{"excerpts": ["Positive: the tropical roll (mango & 2 types of tuna) is divine!"], "author": "Horace G.", "review": "Don't get me wrong, the food is good... but it's not good enough to compensate for the terrible service. Usually, if the food is great, I don't mind a bit slower service with a touch of negligence, but this is just another good sushi place. We couldn't bring ourselves to finish the fish or rolls because we were annoyed by the lack of service. Definitely not the best sushi I ever had, and they are overpriced. Pretty disappointed. Positive: the tropical roll (mango & 2 types of tuna) is divine!", "rating": 2, "date": "2015-05-20"}, {"excerpts": ["Sushi was fine, had the tropical roll, negi-hama roll and tuna nigiri.  ", "Tasted all right, tropical was good.  "], "author": "Ben E.", "review": "Pro: Sushi was fine, had the tropical roll, negi-hama roll and tuna nigiri.  Tasted all right, tropical was good.  Nothing that would rock your world though.\n\nCon:  What did rock our world was the sickness we both got about 30 minutes after eating.  I've never been more unhappy to have a 1 bedroom, 1 bathroom apartment after that night.  \n\nI dare say we will not be returning, better sushi can be had in the Richmond that does not make you sick.", "rating": 2, "date": "2011-10-01"}, {"excerpts": ["The tropical roll (mango & 2 types of tuna) is divine!  ", "Check out the chalkboard for the day's chef's specials.  ", "Fantastic service as well.  ", "We'll be back for sure!"], "author": "Dave C.", "review": "The tropical roll (mango & 2 types of tuna) is divine!  Check out the chalkboard for the day's chef's specials.  Fantastic service as well.  We'll be back for sure!", "rating": 5, "date": "2011-08-09"}, {"excerpts": ["Also really good were the dream roll, space roll, and tropical roll. "], "author": "Amy B.", "review": "I'm always excited to find another great sushi place since, let's face it, I'm a sushi addict. Everything here was fantabulous: the fish was fresh and yummy, the staff was friendly, and it's always a good sign to see that most of the patrons are actually Japanese. \n\nMost notable was the hamachi kama, or grilled yellowtail collar. It was fatty and oily and delicious! Also really good were the dream roll, space roll, and tropical roll. The tokyo roll was also not bad. \n\nThere were 2 downfalls to this place. The first is obvious: the parking sucks! If I'm coming on a weekday from work by bus this downfall would dissappear. The other downfall is that it is expensive! The Chirachi (my favorite!) was $20 bucks whereas most other places it's no more than $13 to $15. And a negihama is $7--more than twice what it is in other good sushi places. The rainbow roll, which I'm happy to report is made with regular crab rather than that tempura crap, is $15!!!! \n\nThis place is really good, but with all of the options for sushi in this great city, I'll keep looking for something both good and affordable.", "rating": 4, "date": "2008-03-16"}, {"excerpts": ["the space and tropical roll are amazing too."], "author": "Marcia O.", "review": "You know you're going to have a great dinner when you go to Tanuki. The fish is extremely fresh and the flavors in the large variety of rolls are soooo good. the servers are attentive and friendly. what more can you ask for? get the saba in any form, you won't regret it. the space and tropical roll are amazing too.", "rating": 5, "date": "2011-02-16"}, {"excerpts": ["My favorites - yes, the noodle salad that comes with dinner, the crab pumpkin tempura, tropical roll, anything sushi.  ", "There's two types of chicken dinners too - chicken karaage and chicken teriyaki.  ", "Choose wisely, as I found out one evening.  ", "It was good nonetheless.  ", "It never seems to be crowded, but that's the charm of the place. . . ", "service is always great, and better with a small crowd."], "author": "Julie C.", "review": "I grew up eating here at least once every two months. . .I come back here so often even after moving out of the neighborhood, the older sushi chef recognizes me.  That's how long this place has been open - the reason?  Awesome Japanese food - fresh fish, big dinner plates, and interesting specials.  My favorites - yes, the noodle salad that comes with dinner, the crab pumpkin tempura, tropical roll, anything sushi.  There's two types of chicken dinners too - chicken karaage and chicken teriyaki.  Choose wisely, as I found out one evening.  It was good nonetheless.  It never seems to be crowded, but that's the charm of the place. . . service is always great, and better with a small crowd.", "rating": 5, "date": "2009-10-06"}], "unakyu roll": [{"excerpts": ["The unakyu roll was excellent.  ", "If only it had been just a touch smaller, it would have been perfect.  ", "I admit that I often prefer value over authentic size, but in this case, it was an outside-in roll with rice on the outside.  ", "As such, it was too big to eat in one bite, yet a messy pain to eat in two bites because of the nori on the inside of the rice.  "], "author": "Roy N.", "review": "First time I came here was well over twenty years ago with my very first girlfriend.  Back then, it was a very reasonably priced, authentic Japanese restaurant that was okay, but nothing to write home about.  I quickly forgot about it. \n\nFast forward to the present day...I was able to jump a miraculous hurdle in the repair of one of my Corvettes and after some other good news, decided to go out to dinner.  Was going to go to Chou Chou, but had seen Tanuki on Yelp recently and decided to go there instead\n\nIt took some time after sitting down, but we finally got our menus.  Wow, what a difference the years make.  Was surprised at the high prices on the menu, but figured they went upscale and looked forward to some good food.  I ordered two large sakes, hamachi kama appetizer (grilled yellowtail collar...one of my Japanese faves), and a bunch of sushi.  My friend ordered Tempura with Prawns and as she ordered, asked the young waiter what kind of vegetables were in the tempura.\n\nThey were out of the large hamachi kama, so we got a small.  It was good, but not great.  Super salty in some spots and then no salt in others.  Personally, I like salty as that's authentic, but this one didn't impress.\n\nI was impressed with the freshness of the sushi there, especially the fresh salmon nigiri.  However, I was not impressed with the sake (smoked salmon) nigiri at all.  Not only was it multi-colored from reddish at the edges to an odd dull pale color in the center, it looked old and freezer burned.\n\nThe unakyu roll was excellent.  If only it had been just a touch smaller, it would have been perfect.  I admit that I often prefer value over authentic size, but in this case, it was an outside-in roll with rice on the outside.  As such, it was too big to eat in one bite, yet a messy pain to eat in two bites because of the nori on the inside of the rice.  Regardless, it was delicious.\n\nIt suddenly dawned on us that there were no prawns in her tempura.  We brought it to the attention of our waiter, a young guy who looked like he was waiting tables while in college.  He told us that no, Vegetable Tempura is what she ordered.  This obviously wasn't the case as there is no way in h#ll she would have ordered just vegetables, but we politely explained that she had ordered it with prawns so he went back to talk to the cook.\n\nAbout eight minutes later, he came out and told us that he could bring us an order of prawns, but would have to charge us for the separate order.  I nicely explained to him with a smile that she had not ordered Vegetable Tempura, but rather Tempura with Prawns (which includes vegetable).  My thought is why should we be penalized for HIS mistake?\n\nAfter that, he went back again.  This time, it felt like he was gone like fifteen minutes before he finally came back.  By then, I was pretty much through with my own meal yet we were still trying to get hers straightened out.  When he came back, he did not have an answer, but instead asked rather bluntly, \"So, what did you want to do?\"  I almost lost it and wanted to say, \"What do I want to do?...Hell, shouldn't that be what do YOU want to do?\"  Instead, I pulled out my rudimentary Japanese and told him that I can't understand what the problem is when she ordered Tempura with Prawns in the first place.  After that, he thought about it and then said Tempura with Prawns is $2.00 more than Vegetable Tempura.  I told him that's no problem since first of all, its only $2.00 and its what she ordered in the first place.  Grrrrrrrrrrrrr.\n\nFifteen to twenty minutes later (I'm not kidding, it seemed even longer), they finally brought out a small plate with two small, but perfectly fried prawns.  Not sure if that order usually comes with only two prawns (hard to imagine!), but at this point we were so tired of the whole ordeal that we didn't have the energy to say anything.\n\nObviously, there was a language issue, but I still feel like he was originally going to charge us not $2.00, but rather for a whole new order of tempura prawns to cover his mistake.  Also, I have to question the intelligence of the way the whole thing was handled.  A seasoned professional waiter would have instantly acknowledged that for whatever reason, the order had been miscommunicated and corrected it immediately.  The menu price difference should not even have been brought up as an issue nor should we have been told that they would have to charge us.  All they had to do was reflect the proper price of what we originally ordered on the final bill.  Regardless, I was generous and still tipped well.  Wondering why this morning.\n\nI was not impressed with the experience and felt that the place was also overpriced for a former family style restaurant with new upscale aspirations.  Way too many good Japanese restaurants in SF to suffer through this again.  At those prices, we should have just gone to Chou Chou for reasonable French like I originally intended.  Oh well.", "rating": 2, "date": "2008-12-04"}], "er roll": [], "swamp roll": [], "blue sea": [{"excerpts": ["We ordered a blue sea, harmony, northern, heavenly, bamboo, lobster hand roll & a crunchy roll on special. ", "All we would order again."], "author": "Lindsey D.", "review": "Excellent. Back a second time because we love it so much! Outstanding Fish, service & ambiance. We enjoyed an incredible 12 piece sake sashimi, some smoked salmon nigiri & a couple very fresh & hearty rolls. We bought two hot sakes & were treated with the third on the house. The chef was engaging & also treated us to two pieces of this aji sashimi that was on special. We were brought two very sweet oranges for dessert & will be back! We ordered a blue sea, harmony, northern, heavenly, bamboo, lobster hand roll & a crunchy roll on special. All we would order again.", "rating": 5, "date": "2016-09-09"}], "sake and avocado roll": [], "avocado and cucumber roll": [], "ume shiso roll": [], "vegetable tempura roll": [{"excerpts": ["I realized it wasn't enough and requested to get a vegetable tempura roll. ", "Told one of the girl waitress's and 10, 15, 20 min goes by and still no food. ", "The guy server came and asked if everything was ok ", "but I told him that I was waiting on my roll. ", "He seemed confused because apparently there was no order of vegetable tempura!! ", "Basically sat there waiting like a dumbass. ", "I was so irritated and ", "by the time the vegetable tempura actually came it tasted like shit. ", "Worst place ever...service is especially bad. ", "The pics were seriously deceiving...."], "author": "Colette P.", "review": "Not sure how this place got 4 stars....Came here with one of my good friends a few days ago and was excited to try this place out. When we came in...there was no server or host/waitress around so we seated ourselves in a table near the window. FYI not a big restaurant, its actually very small. Only 1 sushi chef. I ordered Sake sashimi and a salmon skin roll. My friend ordered uni and some other dish. Was starving since I had not eaten breakfast or lunch...so anyways the food took FOREVER to come. When my sake sashimi (salmon) came...my friend and I looked at it. It was the ugliest sake I have ever seen! half of it was brownish grey...didnt look fresh at all! He ate the uni and said it wasnt fresh either. The salmon skin roll was \"okay\" ,,,ive had better. The food took forever to come...which was REALLY annoying. I mean how could you have only one sushi chef?? Makes no sense. After eating the sake and salmon skin roll I realized it wasn't enough and requested to get a vegetable tempura roll. Told one of the girl waitress's and 10, 15, 20 min goes by and still no food. The guy server came and asked if everything was ok but I told him that I was waiting on my roll. He seemed confused because apparently there was no order of vegetable tempura!! Basically sat there waiting like a dumbass. I was so irritated and by the time the vegetable tempura actually came it tasted like shit. Worst place ever...service is especially bad. The pics were seriously deceiving....", "rating": 1, "date": "2012-06-14"}], "vibe roll": [], "veggie swamp": [], "fried chicken teriyaki": [{"excerpts": ["The fried chicken teriyaki is amazing, as is the unaju. ", "It's been at least four years, and it's just as good, if not better. ", "Just go!"], "author": "Michael D.", "review": "If you like Japanese food, you will love Tanuki! This  place reminds me of a couple of places I got to experience in Tokyo. It's small, it's unassuming, it gets a lot of neighborhood folks and regulars -- and the food rocks, from the tea and miso soup to the amazing noodle salad. Honest, fresh, well-executed food, from sashimi to the clever sushi rolls. The fried chicken teriyaki is amazing, as is the unaju. It's been at least four years, and it's just as good, if not better. Just go!", "rating": 5, "date": "2015-05-16"}, {"excerpts": ["This is my mother's FAVORITE Japanese restaurant; she absolutely LOVES their Fried Chicken Teriyaki and will order it each and every time she goes there.  "], "author": "P T.", "review": "This is my mother's FAVORITE Japanese restaurant; she absolutely LOVES their Fried Chicken Teriyaki and will order it each and every time she goes there.  She also ORDERS one to go.  \n\nI went there for the first time today and was happy with what I ordered: Unaju (eel) and a Salmon Skin roll.  The food was tasty.  I enjoyed the meal.  I don't know if I would say it's the best ever, but I was happy with the food and felt the prices were fair.\n\nThe service was fine...it wasn't bad service, but it wasn't over the top terrific either.  I did bring my son - who is less than a year old - and unfortunately, they didn't have any high chairs for him to sit in.  If you are bringing your family here, keep that in mind.  They have boosters but no high chairs, not that this is a kid restaurant though.  (I don't know many kids young enough to sit in high chairs and old enough to eat unaju or sashimi).\n\nAs far as the parking goes, I have to be honest.  While I know it's generally difficult to find parking anywhere in San Francisco, we were incredibly lucky and found a spot right away...right across the street.\n\nAll in all - happy with the meal and wouldn't mind going back.", "rating": 4, "date": "2007-02-02"}, {"excerpts": ["fried chicken teriyaki and tempura combination....", "little different....breaded and fried bone-in chicken...smothered in teriyaki...different style, but good....", "tempura battered lightly and equally good....", "$seventeen menu price printed for mentioned dinner....", "a peer's donburi mighty large in appearance....served rice heavy in large noodle bowl....", "generous layer of eggs, soysauce and tonkatsu....extra-large portion at $ten printed price", "....portions large at slightly higher pricing understandable....advantage in unique creative twists in menu items...roughly $twenty-five total per person for moderate dinner and drink...."], "author": "Hen A.", "review": "small-medium sushi bar restaurant....scattering of tables throughout...mix and match configurations to accommodate small to larger groups....fairly quick early weekend evening seating...browsing menu and selecting $nine chilled sake smaller 350ml sizing bottles...ample lower priced sake selection for casual dinner.....menu observing....typical roll selections...dragon, spider, spicy, etc....$four to roughly $ten sushi roll pricing....dinner combinations closer to $twenty total....fried chicken teriyaki and tempura combination....little different....breaded and fried bone-in chicken...smothered in teriyaki...different style, but good....tempura battered lightly and equally good....$seventeen menu price printed for mentioned dinner....a peer's donburi mighty large in appearance....served rice heavy in large noodle bowl....generous layer of eggs, soysauce and tonkatsu....extra-large portion at $ten printed price....portions large at slightly higher pricing understandable....advantage in unique creative twists in menu items...roughly $twenty-five total per person for moderate dinner and drink....", "rating": 4, "date": "2010-01-25"}], "grilled chicken teriyaki": [{"excerpts": ["Please note, the chicken teriyaki here is fried, not the usual grilled chicken though they do serve the grilled chicken teriyaki.  "], "author": "Anthony N.", "review": "If you want good Japanese food, come to Tanuki.  This place is owned and operated by a Japanese husband and wife (a rarity, am I right?)  The sushi chef is the husband , and in the kitchen the wife is cooking the food.  \n\nMy family has been coming here for years, and the wife always comes out of the kitchen to greet my parents when we eat here.  If you become regulars here, they'll definitely remember you and give you extra perks.\n\nMy favorite thing to eat at Tanuki is the noodle salad.  The noodle salad only comes with dinners, so if you don't order dinner, make sure to order it on the side.  That being said, I always order dinner, so I don't know too much about the sushi.  Although, my brother always orders sushi, so the raw fish must be good.  I usually stick to the chicken teriyaki.  Please note, the chicken teriyaki here is fried, not the usual grilled chicken though they do serve the grilled chicken teriyaki.  The Hamachi Kama is also exceptionally good; always nice and fatty.\n\nTanuki serves all your standard generic Japanese food, but they make it authentically, the right way.  I'd recommend ordering something off of the \"specials\" board, you won't be disappointed.\n\nThe prices are a little bit expensive, but the portions are large and the flavors are always on point.", "rating": 5, "date": "2012-02-20"}, {"excerpts": ["I ordered the grilled chicken teriyaki and the house special roll. ", "The chicken teriyaki was pretty good, but there wasn't much of it. ", "It was $16 and I could've made that myself for less than $16. "], "author": "Anthony V.", "review": "Hmmmm....\n\nI didn't have a bad experience at all, I just didn't think it was all that great. My friend told me this was one of the best sushi places in the area. Its the only sushi place I've been to in the area but, its not that amazing.\n\nFirst off- I expected it to be packed. It was Saturday around 8 and it was my group and a couple in the restaurant. My initial thought was, maybe this place isn't all that after all.\n\nI ordered the grilled chicken teriyaki and the house special roll. The chicken teriyaki was pretty good, but there wasn't much of it. It was $16 and I could've made that myself for less than $16. It was too much for what they gave. \n\nI asked the waiter what their most popular roll was and he said the house special. It was huge, but I had better. \n\nIf I were craving expensive sushi I would go here. If i wanted quality sushi I would go somewhere else. This place is good, dont' get my wrong, but Its not that great for the price.", "rating": 3, "date": "2013-08-04"}], "piece sashimi dinner": [], "sea bass": [{"excerpts": ["Don't order their grilled sea bass dinner, unless you're not hungry.  "], "author": "Kristen S.", "review": "Don't order their grilled sea bass dinner, unless you're not hungry.  The portion is exceptionally small.\n\nDO order their combination dinners.  Good food, well done.  The only thing is, I noticed the tuna sashimi left bloody puddles on the plate once I picked them up.  Not sure what that means.  They tasted fresh, though.", "rating": 4, "date": "2010-09-25"}, {"excerpts": ["In the non-sushi category, the sea bass is succulent and cooked perfectly.  ", "Lots of sake choices, which is great.  "], "author": "Hugh B.", "review": "Normally I can hardly contain myself to Yelp a restaurant that's either new to me or recently rediscovered.  But Tanuki, which I've frequented on and off for years, including just a few days ago, has just never pushed my \"this is so transplendently good that I'm making up idiotic words like 'transplendent'\" button, nor my \"this sucks worse than every single bad thing that happened between 1975 and 1982, including senior prom\" button.  It's a testament to the strength of my will to procrastinate from work right now that I'm breaking down and reviewing the place. \n\nOf course, none of this is Tanuki's fault, and hence the four stars.  It's a solid, authentic Japanese restaurant in the inner Richmond.  A great neighborhood restaurant that I wish were closer to my neighborhood.  For years they've consistently served great sushi at reasonable prices, surrounded by an extensive menu of traditional, if not particularly exotic dishes.\n\nA few recommendations:  Rolls are particularly good here, including the Tanuki (fried shrimp, eel, marinated eggplant, and avocado), the Bamboo (white tuna and cucumber, with salmon, green onion, and white tuna topping), and numerous vegetable rolls.  They also do a great hirame nigiri.  In the non-sushi category, the sea bass is succulent and cooked perfectly.  Lots of sake choices, which is great.  And best of all, it's all reasonably priced.\n\nI'll be back at Tanuki again soon, taking its quality and consistency for granted, as I have all along.", "rating": 4, "date": "2007-06-26"}, {"excerpts": ["I just had chilean sea bass last night and for some reason thought I'd order it again. ", "However, this time it was dry and had a texture similar to rice and not fish when chewing it....strange. ", "I'm guessing the fish was frozen...", "Yeah, definitely 100% frozen...not good. ", "Also, very small pieces of fish all around the table...", "Salmon, sea bass and yellowtail. ", "They all looked like half servings. ", "I guess this would have been ok if the fish was nice and fresh "], "author": "Con L.", "review": "I love sushi and eat at different Japanese place all over the city so I was willing to give this place a try. To sum it up - The sushi and sashimi were great but the dinner entrees we ordered were flat out terrible. I just had chilean sea bass last night and for some reason thought I'd order it again. However, this time it was dry and had a texture similar to rice and not fish when chewing it....strange. I'm guessing the fish was frozen...Yeah, definitely 100% frozen...not good. Also, very small pieces of fish all around the table...Salmon, sea bass and yellowtail. They all looked like half servings. I guess this would have been ok if the fish was nice and fresh but it clearly wasn't. \n\nService was slow. There were two waiters for the whole place and every table was filled. This meant no tea, long time for bill etc.\n\nOn another note, there was an interesting couple eating here tonight. He was probably a not so attractive 65+ and she was a more attractive 38-40...Pimpin at that age must be tough...cruzing in the Jag with a hottie...Looked like a mail order bride situation...o_O At least that made the evening more interesting than the hardly decent food. Wouldn't go back.", "rating": 2, "date": "2008-12-17"}, {"excerpts": ["I like their Sashimi Combination and Marinated grill Sea Bass."], "author": "Will T.", "review": "Whenever I feel like having Japanese food in the city.  I often headed to Tanuki's.  This place is clean, not too big, yet it is comfortable. The staff here are friendly and the service is excellent. Their sushi are fresh and other dishes are delicious as well.  I like their Sashimi Combination and Marinated grill Sea Bass.", "rating": 4, "date": "2005-11-14"}], "seafood tempura": [], "a sashimi and beef teriyaki combo": [], "b sashimi and tempura combo": [], "c sashimi and chicken teriyaki combo": [], "d sashimi and sukiyaki combo": [], "e sashimi and tonkatsu combo": [], "f tempura and beef teriyaki combo": [], "g tempura and sukiyaki combo": [], "h tempura and chicken teriyaki combo": [], "i tempura and tonkatsu combo": [], "niku udon": [], "okame udon": [{"excerpts": ["I usually order their Okame udon because it tastes so clean. ", "Some Japanese places that I go to, their vegetarian udon has too much stuff in it. ", "This place does it perfectly, with few slices of fish cake, mushrooms, beans and green onions. ", "My parents usually order their salmon teriyaki or the beef donburi. "], "author": "Selina T.", "review": "I love Tanuki. I've eaten here since I was like 7 or 8 years old and the food, for the most part, have tasted consistently good. When I come here, I always order the Noodle Salad. (To me, it's the tastier version of cole slaw, and I don't like eating cole slaw. Yeah I'm weird.) My mom is a big fan of their green salad, mainly because of the dressing that they use. Their salad bowl portion is decently sized too, usually to the point where my mom has to split it with my dad, who isn't a huge fan of salad. \n\nTheir sushi, for the most part, has never disappointed me. They use real ingredients to make their California roll, not imitation shrimp. I usually order their Okame udon because it tastes so clean. Some Japanese places that I go to, their vegetarian udon has too much stuff in it. This place does it perfectly, with few slices of fish cake, mushrooms, beans and green onions. My parents usually order their salmon teriyaki or the beef donburi. I will admit, the beef donburi tastes pretty good too.\n\nThey don't allow reservations unless you have a huge party (i.e. 6 or more). They get busy on weekend nights starting at 7pm. Parking can be a pain at times. Service in general is decent but the waiters/waitresses are pretty busy, so if you need something you'll need to flag them down. Their food is not cheap in comparison to other Japanese restaurants, but I think it's a nice place to go once in a while if you're in a mood for Japanese food. It's better than SF's J-Town's Japanese food.", "rating": 5, "date": "2011-05-26"}, {"excerpts": ["Our okame udon was not fancy but still very good, with perfectly-cooked noodles.\n\n"], "author": "S L.", "review": "Great little traditional Japanese restaurant, in terms of both food and decor.  I've been to a lot of gaudy Japanese places lately, and it was a breath of fresh air to sit down here to some quality food. \n\nAgedashi tofu was delicious, and even better and easier to eat than other places' tofu because they fry bite-sized cubes.  The Bamboo roll and sashimi that I sampled were very fresh.  Our okame udon was not fancy but still very good, with perfectly-cooked noodles.\n\nI was stuffed by the end of the meal but not feeling gross, since all the flavors were very light.  Highly recommended for a quiet meal out.", "rating": 4, "date": "2010-06-01"}], "tanin udon": [], "vegetables tempura udon": [], "katsu donburi": [{"excerpts": ["the Katsu Donburi and Tempura Udon both being great to share. ", "Tanuki is a winner in my account!"], "author": "Grace L.", "review": "Tanuki is one of my favorite sushi restaurants in the Inner Richmond! My husband and I typically resort here for dinner at least once a month when we're craving something light and fresh. It's a small restaurant but we usually get seated right away and the service is fairly quick. You can't go wrong with the sushi rolls- salmon being my favorite fish, I usually go with the Dream Roll and Tokyo Roll. However, if you're not a raw fish person, Tanuki has filling Donburi bowls (\"rice bowl dish\" typically consisting of fish, meat, or vegetables served over rice) and Udon; the Katsu Donburi and Tempura Udon both being great to share. Tanuki is a winner in my account!", "rating": 5, "date": "2016-11-24"}, {"excerpts": ["We ordered four udons, one katsu donburi and two rolls to share for an appetizer.  ", "Hot green tea was brought out immediately.  ", "I can't remember which rolls we ordered but they were pure fish, no extra fried or saucy components.  ", "Whatever it was, it was really fresh and really good.  ", "The udon came out and all conversation died, it was all slurp slurp slurp.  ", "I don't eat udon very often ", "but I would eat more if they all tasted like this.  ", "I ordered the nabeyaki udon.  ", "The broth is full of flavor but not too rich or heavy like ramen broth can be.  ", "The udon noodles were nicely chewy.  ", "There were tons of tempura pieces plus an egg.  ", "My friend did not enjoy his katsu donburi ", "but I wouldn't hold it against Tanuki.  "], "author": "Emmi D.", "review": "I came here with a party of 5 late in the evening on a weekday.  The place is tiny but we were seated after a couple minutes.  The menu and specials reflected very simple, home cooked Japanese food with no frills.\n\nWe ordered four udons, one katsu donburi and two rolls to share for an appetizer.  Hot green tea was brought out immediately.  I can't remember which rolls we ordered but they were pure fish, no extra fried or saucy components.  Whatever it was, it was really fresh and really good.  The udon came out and all conversation died, it was all slurp slurp slurp.  I don't eat udon very often but I would eat more if they all tasted like this.  I ordered the nabeyaki udon.  The broth is full of flavor but not too rich or heavy like ramen broth can be.  The udon noodles were nicely chewy.  There were tons of tempura pieces plus an egg.  My friend did not enjoy his katsu donburi but I wouldn't hold it against Tanuki.  He didn't know what it was before hand and didn't expect an egg cake on top of rice.\n\nThe service was good, udon was delicious an filling and I will definitely be back to have more of the sushi.", "rating": 4, "date": "2014-08-20"}, {"excerpts": ["I ended up getting the pork katsu donburi and my friend got some rolls. ", "My donburi was really filling and quite a large portion. ", "It's not terribly noisy too so you can have a conversation with your dining partner. ", "It's a good place to catch up."], "author": "Amy J.", "review": "If you're craving sushi or Japanese food, try Tanuki. The menu selection is quite impressive and the rolls aren't terribly expensive. I ended up getting the pork katsu donburi and my friend got some rolls. My donburi was really filling and quite a large portion. It's not terribly noisy too so you can have a conversation with your dining partner. It's a good place to catch up.", "rating": 4, "date": "2011-06-27"}], "oyako donburi": [], "teriyaki donburi": [], "vegetable tempura donburi": [], "tenzaru soba": [{"excerpts": ["I ordered the tenzaru soba ( i LOVE cold soba!), the seaweed salad. ", "The beau ordered tako nigiri and a combo of teriyaki and a side of tuna sashimi. ", "It was brought out very timely, so we were very pleased. ", "The tempura vegetables and prawn had a sweet crisp batter I dipped into the noodle sauce, since...", "i don't know if they provided tempura sauce. ", "It was great though! ", "The tako had a dip of wasabi in it, which freaked me out since I don't like wasabi............................."], "author": "Anna H.", "review": "for a spontaneous dinner, this place was a great choice! the sushi bar is lighted to over shine the main area, with decent seating, and a side area with a..pretty loud party table tonight.  It's a casual, romantic setting ready for some good food.\n\nI ordered the tenzaru soba ( i LOVE cold soba!), the seaweed salad. The beau ordered tako nigiri and a combo of teriyaki and a side of tuna sashimi. It was brought out very timely, so we were very pleased. The tempura vegetables and prawn had a sweet crisp batter I dipped into the noodle sauce, since...i don't know if they provided tempura sauce. It was great though! The tako had a dip of wasabi in it, which freaked me out since I don't like wasabi.............................(yea i know..)\n\nThe only thing off was that we ordered the Space Roll, sounded delightful, but it never came out. We looked on the bill, turns out the waiter never wrote it down. There was plenty on the table to fill us up so we didn't say anything, and as long as they didn't charge it for it, it's all good!\n\nWe didn't order drinks or anything. It was one of those meals that I truly enjoyed to even think about anything else to could be added to it, except tempura sauce? ahahah. Overall, meal was great, service was good, atmosphere was cheerful and friendly, and it wasn't too cold or too hot in the restaurant (which is oddly very important to me). I come here again, definitely.", "rating": 4, "date": "2012-12-07"}, {"excerpts": ["Everything was good, but I was especially happy to find tenzaru soba (cold buckwheat noodles with tempura). "], "author": "tom p.", "review": "My favorite sushi place is Murasaki, but I have become friends with the owner, so i'm sure i'm biased.  I don't really go anywhere else for sushi.  However, I came here with family after a Japanese friend recommended it.  \n\nThe great thing i found was a wide variety of choices!  Everything was good, but I was especially happy to find tenzaru soba (cold buckwheat noodles with tempura). i'm a noodle-slurping MF when i find good noodles.\n\nalso a nice healthy portion of karaage - japanese chicken nuggets...\n\nthe sushi was good too (sorry sasaki-san)", "rating": 4, "date": "2012-12-27"}, {"excerpts": ["Hot dishes were the oyako don, tempura tenzaru soba and tempura udon. ", "High praise for the udon texture and the all important broth...just right (not too salty or watery). ", "The tempura batter was good too (not too thick and heavy). ", "The oyaku don could've had more of a sweet flavor to it, but a very nice dish to have. ", "A big plus was the chawan mushi (egg custard flavored with shitake mushrooms, shrimp and other cool ingredients). "], "author": "Moses G.", "review": "A very nice semi hidden gem in the inner richmond. Small but not cramped place for a nice dinner among friends.  \n\nLet me start off by stating that this is a japanese owned establishment so I quickly look for certain entrees like futomaki which is the original roll usually consisting of japanese cucumber, egg, carrot, fish cake and kampyo. This one had crab too. Very nice! We also had negi hama as well. Equally good too.\n\nI had the uni (sea urchin) and ikura with azura (salmon roe and raw quail egg) because it's my fav. Not bad. The saba (mackeral) was excellent.\n\nHot dishes were the oyako don, tempura tenzaru soba and tempura udon. High praise for the udon texture and the all important broth...just right (not too salty or watery). The tempura batter was good too (not too thick and heavy). The oyaku don could've had more of a sweet flavor to it, but a very nice dish to have. A big plus was the chawan mushi (egg custard flavored with shitake mushrooms, shrimp and other cool ingredients). Excellent !\n\nAll in all, very good sushi/entrees with nice presentation as well as friendly japanese-english speaking wait service. The prices were very reasonable too with the portion size that you get as well! The only thing missing was the traditional vinegar rice flavor in the sushi rice which is something you don't see often anymore but is an expectation in a japanese owned sushi restaurant. Will be back again for more!", "rating": 4, "date": "2009-09-21"}, {"excerpts": ["and if they do have tenzaru soba, it tastes like crap.  ", "after a series of mishaps (aka-food poisoning from a few chinese and korean owned japanese restaurants), my friend suggested tanuki-as long as i dont get deathly sick and end up puking over a toilet bowl at the end of the night, ill take it.  ", "not only did i not get sick but the place was clean and delicious!  ", "their tenzaru was just like in japan, the noodle salad was something my aunt used to make during the summer, and i love that they have kabocha rolls!!  ", "my new fav is the kaboca crab roll-its to die for."], "author": "Renee S.", "review": "my new favorite japanese place. i had the hankering for ten-zaru soba one day and not many places have it considering most japanese food places are not actually run by japanese people and only have the super americanized japanese food like chicken and beef teriyaki.  and if they do have tenzaru soba, it tastes like crap.  after a series of mishaps (aka-food poisoning from a few chinese and korean owned japanese restaurants), my friend suggested tanuki-as long as i dont get deathly sick and end up puking over a toilet bowl at the end of the night, ill take it.  not only did i not get sick but the place was clean and delicious!  their tenzaru was just like in japan, the noodle salad was something my aunt used to make during the summer, and i love that they have kabocha rolls!!  my new fav is the kaboca crab roll-its to die for.", "rating": 4, "date": "2011-05-14"}], "vegetable tempura soba": [], "hamachi sashimi pc": [], "maguro sashimi  pc": [], "pieces shake sashimi": [], "shiromaguro sashimi  pc": [], "sashimi combo pc": [], "aji sushi": [], "anago sushi": [], "hamachi sushi": [{"excerpts": ["I LOVE their spicy scallop roll and fatty hamachi sushi that are definitely worth to try."], "author": "nicole t.", "review": "Everything is awesome here!!! I LOVE their spicy scallop roll and fatty hamachi sushi that are definitely worth to try.", "rating": 5, "date": "2008-10-23"}], "hamachi toro sushi": [], "hirame sushi": [], "kaibashira sushi": [], "kaki sushi": [], "katsuo sushi": [], "shake sushi": [], "shiromaguro sushi": [], "tai sushi": [], "unagi sushi": [{"excerpts": ["maki sushi, salmon, ebi, unagi sushi and one big bowl of udon (although I don't like a taste and smell snow pea left in the soup). ", "Everything taste fine in average level. ", "What else...? ", "I might need to go there again cos the chef said \"mata ne\", which means see you again, to try other menu and see if it's better than my first time."], "author": "Yanakon D.", "review": "I rate four stars because of the staffs' service here although the foods weren't really my taste. I ordered a sushi and hot meal with udon from a special lunch menu. It came in a really big portion; six-piece spicy salmon and spicy tuna maki sushi, salmon, ebi, unagi sushi and one big bowl of udon (although I don't like a taste and smell snow pea left in the soup). Everything taste fine in average level. What else...? I might need to go there again cos the chef said \"mata ne\", which means see you again, to try other menu and see if it's better than my first time.", "rating": 4, "date": "2013-09-27"}, {"excerpts": ["The most memorable dinner was the time he made tiny uni and unagi sushi for our then 2.5 yrs old son, and he gobbled that up! ", "We always have a blast there with the owner as we dine and sometimes watch the game that's on...be it baseball, football, etc!"], "author": "Yen B.", "review": "I've been to this place since I was a teen and had the pleasure to share it with friends and now my family. The owner even recognizes me after all these years! He's great! We love sitting at the bar so we can toast sake shots with him and his sous-chef. The most memorable dinner was the time he made tiny uni and unagi sushi for our then 2.5 yrs old son, and he gobbled that up! We always have a blast there with the owner as we dine and sometimes watch the game that's on...be it baseball, football, etc!", "rating": 5, "date": "2014-06-26"}], "nigiri combo sushi": [], "chirasi sushi": [], "inari sushi": [], "kabocha sushi": [], "nasu sushi": [], "shiitake sushi": [], "veggie combo sushi": [], "agedashi plate": [], "ankimo plate": [], "buta kakuni plate": [], "calamari plate": [], "chicken karage plate": [], "ebi fry plate pc": [], "gyoza plate": [], "hamachi kama plate medium": [], "ika sugata plate": [], "kaki fry plate": [], "katsuo tataki plate": [], "sea bass plate": [], "shiromaguro tataki plate": [], "soft shell crab plate": [], "tebashio plate": [], "tempura plate": [], "vegetable tempura plate": [], "yakitori plate": [], "asari soup lunch": [], "nameko soup lunch": [], "agedashi plate lunch": [], "calamari plate lunch": [], "ebi fry plate lunch": [], "gyoza plate lunch": [], "hamachi kama plate lunch": [], "kaki fry plate lunch": [], "grills black cod lunch": [], "shiromaguro tataki plate lunch": [], "soft shell crab plate lunch": [], "tempura plate lunch": [], "vegetable tempura plate lunch": [], "yakitori plate lunch": [], "chicken karaage plate lunch": [], "hamachi sashimi lunch": [], "maguro sashimi lunch": [], "shake sashimi lunch": [], "shiromaguro sashimi lunch": [], "sashimi combo lunch": [], "aji sushi lunch": [], "anago sushi lunch": [], "ebi sushi lunch": [], "hamachi sushi lunch": [], "hamachi toro sushi lunch": [], "hirame sushi lunch": [], "ika sushi lunch": [], "ikura sushi lunch": [], "kaibashira sushi lunch": [], "kaki sushi lunch": [], "kani sushi lunch": [], "katsuo sushi lunch": [], "maguro sushi lunch": [], "saba sushi lunch": [], "shake sushi lunch": [], "shiromaguro sushi lunch": [], "tai sushi lunch": [], "tako sushi lunch": [], "tamago sushi lunch": [], "tobiko sushi lunch": [], "unagi sushi lunch": [], "nigiri combo lunch": [], "chirasi sushi lunch": [], "inari sushi lunch": [], "kabocha sushi lunch": [], "nasu sushi lunch": [], "shiitake sushi lunch": [], "veggie combo sushi lunch": [], "avocado roll lunch": [], "avocado and cucumber roll lunch": [], "kappa roll lunch": [], "natto roll lunch": [], "oshinko roll lunch": [], "ume shiso roll lunch": [], "vegetable tempura roll lunch": [], "vibe roll lunch": [], "alaska sushi roll lunch": [], "bamboo sushi roll lunch": [], "blue sea sushi roll lunch": [], "butterfly sushi roll lunch": [], "california sushi roll lunch": [], "dragon sushi roll lunch": [], "dream sushi roll lunch": [], "fire sushi roll lunch": [], "futomaki sushi roll lunch": [], "harmony sushi roll lunch": [], "kamikaze sushi roll lunch": [], "miami sushi roll lunch": [], "negihama sushi roll lunch": [], "negitoro sushi roll lunch": [], "northern sushi roll lunch": [], "popeye sushi roll lunch": [], "rainbow sushi roll lunch": [], "rock and roll sushi lunch": [], "salmon skin sushi roll lunch": [], "spider sushi roll lunch": [], "tanuki sushi roll lunch": [], "tekka sushi roll lunch": [], "tokyo sushi roll lunch": [], "tropical sushi roll lunch": [], "unakyu sushi roll lunch": [], "swamp sushi roll lunch": [], "er sushi roll lunch": [], "caterpillar": [{"excerpts": ["I also ordered a caterpillar roll off the menu. ", "I took one bite and was in heaven.  ", "They were generous with the unagi, and it was moist and tender with just the perfect amount of fattiness. "], "author": "Jaching H.", "review": "Finally! A good udon place in the city!!  \n\nI got the nabeyaki udon, and it was exactly what I was hoping for. The broth was very flavorful; many other places in the city have what tastes like salty water. Not this one! The noodles were nice and chewy. It came with an egg, shrimp tempura, many other vegetable tempura pieces, shiitake mushrooms, two fishcakes, and fresh snow peas. There was no shortage of goodies in my bowl!\n\nI also ordered a caterpillar roll off the menu. I took one bite and was in heaven.  They were generous with the unagi, and it was moist and tender with just the perfect amount of fattiness. Great balance of how much avocado was used.  \n\nMy new go-to place, even if it is a bit out of the way!", "rating": 4, "date": "2015-04-29"}, {"excerpts": ["made me my favorite caterpillar roll. ", "I was blessed to see him again at Tanuki. ", "He is very top notched and highly gifted in sushi making. ", "The first thing I did once I bumped into this restaurant was ordering Tommy's signature caterpillar roll. ", "It remains as good as it once was when he made it for me as a little kid eating at Ebisu. ", "Tommy is very generous and kind to his customer. ", "I definitely bring my girlfriend and my mom there to eat on their birthdays!"], "author": "Lance W.", "review": "Although people have mentioned that there was a change in ownership, the quality and essence of sushi is up to par. I grew up eating at Ebisu, top Japanese restaurant in San Francisco, and former sushi chef Tommy made me my favorite caterpillar roll. I was blessed to see him again at Tanuki. He is very top notched and highly gifted in sushi making. The first thing I did once I bumped into this restaurant was ordering Tommy's signature caterpillar roll. It remains as good as it once was when he made it for me as a little kid eating at Ebisu. Tommy is very generous and kind to his customer. I definitely bring my girlfriend and my mom there to eat on their birthdays!", "rating": 5, "date": "2017-06-14"}], "fried onion garlic roll": [], "sabagiri sushi roll lunch": [], "sake and avocadoroll with tobiko": [], "beef teriyaki lunch": [], "sashimi lunch": [], "unaju lunch": [], "a sashimi and beef teriyaki combo lunch": [], "b sashimi and tempura combo lunch": [], "c sashimi and chicken teriyaki combo lunch": [], "d sashimi and sukiyaki combo lunch": [], "e sashimi and tonkatsu combo lunch": [], "f tempura and beef teriyaki combo lunch": [], "g tempura and sukiyaki combo lunch": [], "h tempura and chicken teriyaki combo lunch": [], "i tempura and tonkatsu combo lunch": [], "niku udon lunch": [], "okame udon lunch": [], "tanin udon lunch": [], "vegetable tempura udon lunch": [], "tempura soba lunch": [], "tenzaru soba lunch": [], "katsu donburi lunch": [], "oyako donburi lunch": [], "teriyaki donburi lunch": [], "tempura donburi lunch": [], "vegetable tempura donburi lunch": [], "spinach goma ae salad lunch": [], "green salad lunch small": [], "noodle salad lunch": [], "oshitashi salad lunch": [], "seafood salad lunch": [], "seaweed salad lunch": [], "shiitake mushroom salad lunch": [], "sunomono salad lunch": [], "seafood sunomono salad lunch": [], "crab salad lunch": [], "lunch box": []}