{"panuchos": [{"excerpts": ["I had the panuchos and every bite has so many different flavors and very colorful as well. "], "author": "Yenni H.", "review": "Recently opened this year and I can say I love this place! I had the panuchos and every bite has so many different flavors and very colorful as well. I can taste how fresh each item was made.\n\nThe staff is friendly and give you their personal favorite which is helpful when you're new to a restaurant. I came in and one of the staff was so kind to give our party a complimentary panucho so we could try an extra flavor of meat. Thank you!! \n\nBut the reason why I give it a 5 star is for their churro! Hands down BEST CHURROS EVER. I've been in search for a bomb churro and this is the place. Trust me, get the churros.", "rating": 5, "date": "2018-06-28"}, {"excerpts": ["I decided to order al pastor panuchos (Yucatan tacos) and a plantain burrito.  ", "Delicious!  ", "The menus has a mix of both recognizable and unfamiliar dishes.  ", "I had never had panuchos or a burrito with plantains and loved every bite of both dishes!  \n\n"], "author": "Cimma S.", "review": "I went to Taqueria Los Mayas on Cinco de Mayo for dinner.  I had never been there but heard it was very good through a mutual friend who works in the food industry.  \n\nIt was about 7PM on Cinco de Mayo Saturday, and Taqueria Los Mayas was (surprisingly) not busy.  Maybe everyone was eating out in the Mission rather than in Inner Richmond.   I walked straight to the counter to order dinner.  The menu is Mexican and Yucatan cuisine so I did not recognize many of the dishes.  The cashier (and I think owner?) noticed I hesitated at the counter.  He asked if I had ever been here, to which I replied no.  He gave me a hard copy of the menu then walked away before I could ask for his recommendation.  \n\nI decided to order al pastor panuchos (Yucatan tacos) and a plantain burrito.  Delicious!  The menus has a mix of both recognizable and unfamiliar dishes.  I had never had panuchos or a burrito with plantains and loved every bite of both dishes!  \n\nThere are some quirks with service and operations but I would definitely come back for the food.\n\nPROS: \n- Salsa and chips bar was on point (the green salsa is super spicy even for someone who loves spice!)\n- Tasty food\n\nCONS: \n- No alcohol\n- Sticky tables (gross) so I had to wipe them down myself\n- Not the most helpful staff but thankfully we picked out dishes that were satisfying\n- There was empty water jug and no glasses in sight by the bar for self-service.  Staff replenished the water jug and provided glasses (only to me but did not take the time to get more glasses for other customers who may want water) eventually after multiple requests.", "rating": 3, "date": "2018-05-19"}, {"excerpts": ["15 Taqueria el Buen Sabor\n16 Panuchos\n", "17 Taqueria Gudalajara\n", "18 La Palma Mexicatessen\n", "19 El Tonayense\n", "20 Tropisueno\n21 La Espiga de Oro\n", "22 Papito Hayes\n", "23 Tacos San Buena\n", "24 Los Compadres Taco Truck\n", "25 Cochinita Mayan Cuisine\n", "26 El Taco Loco\n"], "author": "Rod M.", "review": "Los Mayas is located in a busy section of Clement street. \n\nQuickly scooted in here and ordered a Cochinita Pibil Taco which is a favorite meat of mine and not served at all taquerias. \n\nWhat came out fairly quickly was a delicious taco. \n\nCochinita Pibil- Pulled pork braised in citrus and achiote \n\nTortilla , meat and toppings were are very savory.\n\nThe world needs a San Francisco Taco ranking...so I'm here to provide my humble list/rankings. \n\nRanking explained:  #1 (listed at the top) is my favorite/ #?  (listed at the bottom) is my least favorite. \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. If you're curious, I have rankings for Boba, Bakeries and Ramen , Chicken and Waffles as well (random right?)  Follow my profile to see my most recent reviews.  I hope I can be helpful since so many Yelpers have helped me discover new places.  \n\nRod's SF Taco Rankings:\n\n1 El Gallo Giro Taco truck\n2 Garajito\n3 Belmar La Gallinita Meat Market\n4 La Corneta\n5 Chisme\n6 El Norteno Taco Truck\n7 Taqueria Los Mayas \n8 Garaje\n9 Taqueria Vallarta\n10 Little Taqueria\n11 La Taqueria\n12 Taqueria Castillo\n13 El Farolito\n14 Pancho Villa Taqueria \n15 Taqueria el Buen Sabor\n16 Panuchos\n17 Taqueria Gudalajara\n18 La Palma Mexicatessen\n19 El Tonayense\n20 Tropisueno\n21 La Espiga de Oro\n22 Papito Hayes\n23 Tacos San Buena\n24 Los Compadres Taco Truck\n25 Cochinita Mayan Cuisine\n26 El Taco Loco\n27 Gordo Taqueria\n28 Nick's Crispy Tacos\n\nBelow is my top 10 for the Bay Area in case you were curious.\n1 El Gallo Giro Taco truck\n2 El Jaliciense\n3 Taqueria Sinaloa\n4 Garajito\n5 Belmar La Gallinita Meat Market\n6 Belly\n7 La Corneta\n8 Chisme\n9 El Norteno Taco Truck\n10 Taqueria Los Mayas", "rating": 4, "date": "2018-04-16"}, {"excerpts": ["Panuchos? ", "I never knew one thing could change your life completely in a matter of seconds. ", "Panuchos are like tacos but have a crunchy deep fried outer shell. "], "author": "Ada H.", "review": "Panuchos? I never knew one thing could change your life completely in a matter of seconds. Panuchos are like tacos but have a crunchy deep fried outer shell. It holds up a lot better than soft tacos. \n\nIt's rare to find a place that serves tender succulent pastor, but I think I finally found a place that is on par to my standards. The pastor has pineapple that compliments the juiciness of the meat. \n\nThe chicken mole here sadly was subpar. The sauce they drench it in doesn't mix well with the chicken. \n\nAll orders come with tortilla chips which you can pair with one of their many sauces. Their sauce bar has this tangy mango sauce which has a great tropical flavor. You can also get pickled jalapeños and onions to put on your tacos.", "rating": 4, "date": "2017-12-18"}, {"excerpts": ["Boyfriend got the Carne Asada Plato and I got two Al Pastor Panuchos. ", "Loved the presentation! ", "I had a bite of the carne asada and thought it was yummy. ", "But boyfriend said meh and that he likes Papalote better. ", "My panuchos were delicious overall, but it was a bit too greasy. ", "I understand it was deep fried, but my hands were almost covered in oil. ", "The al pastor tasted a little different too, perhaps because it's not a specialty from the Yucatán? ", "Not the best I've had but not bad either. ", "The pickled onions on my panuchos were awesome! ", "I'd usually get 3 tacos but the 2 panuchos were more than enough to fill my food baby.\n\n"], "author": "Nana L.", "review": "Tasty Mexican food with beautiful mural, nice chill vibe, and super friendly staff is pretty hard to find in my hood! I was very excited to finally check out Taqueria Los Mayas tonight, and was pleasantly surprised by how extensive the menu is!\n\nFree chips and salsa! The salsas were excellent! The spicy one we tried was not that spicy so don't be deterred.\n\nBoyfriend got the Carne Asada Plato and I got two Al Pastor Panuchos. Loved the presentation! I had a bite of the carne asada and thought it was yummy. But boyfriend said meh and that he likes Papalote better. Although I feel like they kind of have different styles.\n\nMy panuchos were delicious overall, but it was a bit too greasy. I understand it was deep fried, but my hands were almost covered in oil. The al pastor tasted a little different too, perhaps because it's not a specialty from the Yucatán? Not the best I've had but not bad either. The pickled onions on my panuchos were awesome! I'd usually get 3 tacos but the 2 panuchos were more than enough to fill my food baby.\n\nDefinitely recommend if you are in the area and craving Mexican. But maybe not trek-across-town-for-it worthy.", "rating": 4, "date": "2017-09-07"}, {"excerpts": ["Taqueria Los mayas is my go to spot for panuchos and empanadas in the city, they run daily specials that vary so definitely check the sigh outside on the sidewalk! ", "This taqueria definitely has a different spin on things especially when you order items most of the meats they use are very saucy and tender which can range from beef,pork, or chicken. ", "This is the type of taqueria you definitely have to visit more then once to explore the whole menu! ", "I'm glad they open up this establishment right in my backyard of the Richmond District!"], "author": "Timothy C.", "review": "Taqueria Los mayas is my go to spot for panuchos and empanadas in the city, they run daily specials that vary so definitely check the sigh outside on the sidewalk! This taqueria definitely has a different spin on things especially when you order items most of the meats they use are very saucy and tender which can range from beef,pork, or chicken. This is the type of taqueria you definitely have to visit more then once to explore the whole menu! I'm glad they open up this establishment right in my backyard of the Richmond District!", "rating": 4, "date": "2018-06-07"}, {"excerpts": ["Try the panuchos & the mango salsa!!!"], "author": "Niko P.", "review": "Best Mexican restaurant in San Francisco.\n\nAuthentic Mexican Yucatan food, great atmosphere & fast service.\n\nTry the panuchos & the mango salsa!!!", "rating": 5, "date": "2018-04-07"}, {"excerpts": ["I've only had the panuchos because I was a huge fan of Panucho's on Broadway before it closed. ", "I heard the chef is now here. ", "Really good, especially adding the various salsas from the salsa bar. ", "Not quite as good as Panucho's ", "(I think the food was more freshly made when you ordered vs. now maybe pre-made and warmed) but still really good. ", "Only a Panucho's fan would know the difference. ", "So glad this place opened."], "author": "Ruth C.", "review": "I've only had the panuchos because I was a huge fan of Panucho's on Broadway before it closed. I heard the chef is now here. Really good, especially adding the various salsas from the salsa bar. Not quite as good as Panucho's (I think the food was more freshly made when you ordered vs. now maybe pre-made and warmed) but still really good. Only a Panucho's fan would know the difference. So glad this place opened.", "rating": 5, "date": "2018-09-22"}, {"excerpts": ["panuchos, which is just a black bean stuffed flat taco with your choice of protein and lettuce is bomb dot com too.\n\n"], "author": "Aaron C.", "review": "Duuuuudes, ok, straight up...I'm Latino and I didn't have very high expectations for this place when I saw it was coming through. Figured it'd be a better than chipotle, but more expensive too, to capture the demographic out in SF. \n\nAnyway, the food is bomb. I love how most of the typical dishes are already set, you just pick your protein and your money! Best proteins (the only ones I've tried) were Conchita Pibil (pork) and Pollo Mole Poblano (chicken). Personally the chicken one is sooooo bomb, the poblano gives it a nice smoke and contrasts the sweet mole. Conchita Pibil is just a goddess of a tender pork, just try it.\n\nTortas (sandwiches) are decent size. I think it's called panuchos, which is just a black bean stuffed flat taco with your choice of protein and lettuce is bomb dot com too.\n\nAgua frescas are expensive, so no for me. Yes this place caters to the new market, but they compensate for it with great service, awesome Latino music, and great food. Orale Taqueria Los Mayas, buena suerte y bienvenido al Richmond Distrito!", "rating": 4, "date": "2017-07-08"}, {"excerpts": ["i got 4 panuchos aka tacos + ", "(^_^) Panuchos $4.25 ea ", "+ "], "author": "Dan B.", "review": "ever since game of thrizzones and 3rd season black mirror partially shaved head chicks are dope af. including the cashier* here when i showed up on TACO TUESDAY niñooo.\n\nmenu format is column a column b pick a shape for your food & pick a meat (or veggie f u) to go in it #twss. i got 4 panuchos aka tacos + a brek burrito por cena idgaf.\n\n(^_^) Breakfast Burrito Cochinita Pibil $ ()\nyes muhfuh\n\n(^_^) Panuchos $4.25 ea + $3 seafood ()\nal pastor troy, poc chuc, carne asada, camarones\ndidn't 100% know which was which but all good\n\nfunniest part was an actual mexican family (like not white ppl not asian foodies not hipster ig muhfuhs but irl no ingles familia) was there wonder wth they thought of the authenticity of the food.\n\n-1 star bc employee wearing a detroit tigers shirt wtf this is GO GIANTS territory!!\n\n*seemed shaven when i was close up then from afar looked not; w/e doesn't alter my opening statement bz.", "rating": 4, "date": "2017-05-23"}, {"excerpts": ["Try the panuchos, tostadas, and the pozole soup!!"], "author": "Gina R.", "review": "Delicious, fresh and good people! The owner used to be our favorite server at Bella Trattoria and has now opened his own venture. Customer service super on point and the food is amazing!\n\nTry the panuchos, tostadas, and the pozole soup!!", "rating": 5, "date": "2017-06-24"}, {"excerpts": ["Love their panuchos.  ", "Wish they had a  place closer to home - would go their often!!"], "author": "Shirley M.", "review": "Delicious food and great staff.  Love their panuchos.  Wish they had a  place closer to home - would go their often!!", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["The pork panuchos are my favorite as well as the super burrito which I also ordered with grilled chicken. ", "While waiting definitely try the sample of various dipping sauces with the free chips that are provided.  ", "In closing, a definite must if you are yearning for some quality Mexican food with attention to detail and food safety."], "author": "Richard H.", "review": "A pure diamond surrounded by all the Asian restaurants, bubble tea and dim sum places located in the Inner Richmond District between 4th and 5th on Clement Street. Chef Jose and his team are consistently kicking out some great freshly prepared ingredients from his roots in the Yucatan area of Mexico. Everything is prepared at the time of ordering hence there will be a slight wait but you will be truly rewarded once you take your first bite. The pork panuchos are my favorite as well as the super burrito which I also ordered with grilled chicken. While waiting definitely try the sample of various dipping sauces with the free chips that are provided.  In closing, a definite must if you are yearning for some quality Mexican food with attention to detail and food safety.", "rating": 5, "date": "2018-01-21"}, {"excerpts": ["If you haven't tried Yucatecan food (from Mayan region of Mexico), try the panuchos with cochinita pibil and with poc chuc."], "author": "Diego O.", "review": "Hidden gem in the Richmond District!! \n\nThis is one of my favorite restaurants in the city. This place beats any Mexican restaurant in the Mission District. I'm from Mexico, and I must say that the flavor here is very authentic. If you haven't tried Yucatecan food (from Mayan region of Mexico), try the panuchos with cochinita pibil and with poc chuc.", "rating": 5, "date": "2018-04-11"}, {"excerpts": ["Their Panuchos is very good as well. "], "author": "Anthony T.", "review": "The food is made to order, but the wait isn't too long. The food is reasonably priced and it very good. Service is very friendly. We met the co-owner of the place. You can tell he really cares about the quality of food and how he wants his restaurant to be represented. If there is a mistake with the food, I'm sure something would be done to correct it. \n\nMost burritos that I've tried at other places leave you super tried and groggy because it's so heavy. The Al Pastor burrito that I had left me very full, but I wasn't overwhelmed by a food coma. Would recommended! \n\nTheir Panuchos is very good as well. Super juicy and flavorful.\n\nThe Ensalada Yucatán was reported to be good by the girlfriend as well.\n\nI suggest you guys make a visit here!", "rating": 5, "date": "2017-05-30"}, {"excerpts": ["We ordered the panuchos with mole, chile verde, carne asada and al pastor. ", "These things are delicious, especially their pickled onions!  ", "I also tried the bean and cheese empanadas and they were ok. ", "But seriously people try the panuchos! ", "They also had good music so that was a plus for me!"], "author": "E U.", "review": "Came across this place and decided to try it! We ordered the panuchos with mole, chile verde, carne asada and al pastor. These things are delicious, especially their pickled onions!  I also tried the bean and cheese empanadas and they were ok. But seriously people try the panuchos! They also had good music so that was a plus for me!", "rating": 4, "date": "2017-07-27"}, {"excerpts": ["I recommend the Panuchos, Poc Chuc, Cochinita, and Ceviche- ", "all AMAZING. ", "While Los Mayas does a great job of offering all of your standard taqueria fare, it is these traditional Yucatecan dishes that should really put this place at the top of your \"to try\" lists. "], "author": "Nick D.", "review": "Besides being your only real option for Mexican food in the immediate area, Taqueria Los Mayas is one of the best casual Mexican restaurants in the city, and certainly the best Yucatecan food I've ever had.\n\nFirst of all, the ambiance is great and does a fantastic job of creating a casual dining experience, while still definitely being nice enough for a low key date night.\n\nThe food is the real attraction here; if you've never had Yucatecan food, you are in for a treat. I recommend the Panuchos, Poc Chuc, Cochinita, and Ceviche- all AMAZING. While Los Mayas does a great job of offering all of your standard taqueria fare, it is these traditional Yucatecan dishes that should really put this place at the top of your \"to try\" lists. If you're not sure what to order, just ask the staff; they are always very helpful and friendly.\n\nCan't wait for these guys to get a liquor license! :)", "rating": 5, "date": "2018-01-13"}, {"excerpts": ["Beyond words panuchos were amazing the torta deAchiote tofu was amazing! ", "Oh and did I mention the churros  so warm and delicious . ", "They also have like 4 salsa options which are all so good ! ", "Everything about this wonderful little gem is perfect ", "I fell in love . ", "I think I'm moving to the bay ", "thank you taqueria Los Mayas"], "author": "Orduno M.", "review": "The best Mexican food in the Bay ! Beyond words panuchos were amazing the torta deAchiote tofu was amazing! Oh and did I mention the churros  so warm and delicious . They also have like 4 salsa options which are all so good ! Everything about this wonderful little gem is perfect I fell in love . I think I'm moving to the bay thank you taqueria Los Mayas", "rating": 5, "date": "2017-08-20"}, {"excerpts": ["it seems like theu are known for their tacos and Panuchos. ", "They always give you a healthy portion of meat and it is always tender and their tortillas are fresh. ", "Definitely my go to spot in the area"], "author": "mackenzie e.", "review": "This place is great. The staff is friendly and the food is awesome! This neighborhood definitely got a new gem of a restaurant. it seems like theu are known for their tacos and Panuchos. They always give you a healthy portion of meat and it is always tender and their tortillas are fresh. Definitely my go to spot in the area", "rating": 5, "date": "2017-06-15"}, {"excerpts": ["Everything is made fresh and the panuchos are always great. ", "Plenty of seating, bathrooms are clean, salsa bar is excellent. ", "No beer yet ", "but I'm told \"it's coming\". ", "Will continue to visit from Berkeley where I live."], "author": "Joseph M.", "review": "My go-to for Mexican food. Everything is made fresh and the panuchos are always great. Plenty of seating, bathrooms are clean, salsa bar is excellent. No beer yet but I'm told \"it's coming\". Will continue to visit from Berkeley where I live.", "rating": 5, "date": "2017-12-01"}, {"excerpts": ["I ended up getting 2 panuchos - one with pollo con mole poblano and one with carne asada. ", "Both were delicious - kind of like open faced tacos, with generous portions of meat, plus avocado, lettuce, and pickled red onions. ", "I will definitely be back soon!"], "author": "J E.", "review": "Came in on a whim and the gentleman at the cashier was very friendly and helpful while I chose. I ended up getting 2 panuchos - one with pollo con mole poblano and one with carne asada. Both were delicious - kind of like open faced tacos, with generous portions of meat, plus avocado, lettuce, and pickled red onions. I will definitely be back soon!", "rating": 5, "date": "2017-05-30"}, {"excerpts": ["Among my favorites are the panuchos! ", "Great service, too!"], "author": "Bolivar P.", "review": "At last a great taquería in the Richmond District! And not only great tacos but a broad variety of Mexican dishes, with an emphasis on the cuisine of Yucatan. The food is fresh and delicious. Among my favorites are the panuchos! Great service, too!", "rating": 5, "date": "2017-11-18"}, {"excerpts": ["Get the panuchos and wait for your mind to explode. ", "The ceviche, tacos and platanos were all amazing as well.  ", "the new addition to the neighborhood!"], "author": "Pagely T.", "review": "Oh my. This place is amazing. Get the panuchos and wait for your mind to explode. The ceviche, tacos and platanos were all amazing as well.  the new addition to the neighborhood!", "rating": 5, "date": "2017-08-19"}, {"excerpts": ["We also enjoyed a couple of panuchos with cochinita pibil.  ", "The tortilla was slightly crispy the meat was well marinaded and tasty and perfectly spiced.  ", "We also had two fish tacos. ", "There were large chunks of fish cooked perfectly with bits of mango and tomato with a nice cabbage slaw below it, all on homemade soft tortilla.  ", "This is not fast food Mexican. ", "Every dish is made fresh, while you wait. ", "Nothing is prepared ahead of time.  ", "We can't wait to try more items on the menu, the next time we come back to this restaurant."], "author": "Rose V.", "review": "We have been waiting for a good Mexican restaurant to open in the Richmond district. Finally it is here. Taqueria Los Mayas was simply delicious this evening. Everything is made to order.The service was very good.  The presentation was well above expectations for a Taqueria. Their sauces are flavorful and spicy. We had the ceviche mix,  it was light and citrusy and full of perfectly marinated fish and shrimp. We also enjoyed a couple of panuchos with cochinita pibil.  The tortilla was slightly crispy the meat was well marinaded and tasty and perfectly spiced.  We also had two fish tacos. There were large chunks of fish cooked perfectly with bits of mango and tomato with a nice cabbage slaw below it, all on homemade soft tortilla.  This is not fast food Mexican. Every dish is made fresh, while you wait. Nothing is prepared ahead of time.  We can't wait to try more items on the menu, the next time we come back to this restaurant.", "rating": 5, "date": "2017-05-17"}, {"excerpts": ["Had the carne asada burritos, & the chicken panuchos. ", "Would eat here again and highly recommend! ", "Great service too"], "author": "Derrick D.", "review": "Amazing flavor on the dishes as well as salsa. Had the carne asada burritos, & the chicken panuchos. Would eat here again and highly recommend! Great service too", "rating": 5, "date": "2017-05-31"}, {"excerpts": ["I've had their tacos, the panuchos, a burrito and a quesadilla. ", "All have been excellent. ", "The options are interesting, the flavors complex; the service is top notch and the owner is so hard working and friendly. ", "I'm excited to go back!"], "author": "Liz O.", "review": "Love this place! I have eaten at Taqueria Los Mayas four times - I've had their tacos, the panuchos, a burrito and a quesadilla. All have been excellent. The options are interesting, the flavors complex; the service is top notch and the owner is so hard working and friendly. I'm excited to go back!", "rating": 5, "date": "2017-07-08"}], "tacos de la abuelita": [{"excerpts": ["Tacos de la Abuelita: pickled red onions, cabbage, salsa, cilantro ($3.75 each)\n", "*Al Pastor: ", "Mexico City-style barbecued pork\n", "*Pollo Con Mole Poblano: a fusion of pueblan and yucatecan moles combining sweet habanero with a dozen spices\n"], "author": "Elena N.", "review": "3.5 STARS\n\nThe roommate and I were shopping nearby. When looking for lunch spots, we decided to check out Taqueria Los Mayas. We arrived before the lunch rush on Monday, December 11th around 12:15pm. We placed our order for takeout.\n\nTacos de la Abuelita: pickled red onions, cabbage, salsa, cilantro ($3.75 each)\n*Al Pastor: Mexico City-style barbecued pork\n*Pollo Con Mole Poblano: a fusion of pueblan and yucatecan moles combining sweet habanero with a dozen spices\n*Bisteca a la Mexicana: steak marinated in orange and lime juices, cilantro, onion, salt and pepper\n\nI'm a taco girl, so I got the three tacos listed above. I love a nice smokey flavor in my meat, but most of these were more stewed, so a little mushy. Even the al pastor which was kind of weird. It did have a nice chew though. The taco tortillas were different. Not corn or flour, but more like masa. I didn't really eat the tortillas so I can't advise on the difference, but it did get soggy in transit and wouldn't stay together to eat as a taco.\n\n*Breakfast Burrito: eggs, beans, rice, potato ($8), add Al Pastor (+$2.50)\n*Elote Loco: street corn with mayo, cheese, chile ($4)\n*Churros ($4.50)\n*Chips (1st order free with purchase, additional order $2 each)\n\nThe roomie got the burrito, I got the elote, and we shared the churros. I adored the elote. The corn was cooked nicely. The kernels were plump and juicy. The mayo, cheese, chile, and lime added a nice contrast in flavor though I wish the mixture was thicker so it would stick to the corn more. The churros were amazing. Fresh out of the fryer, so a nice crispy exterior. The whipped cream did dissipate in transit, so there really wasn't any when we got home.\n\nSalsas\n*Salsa de Mango: mango, pineapple, orange juice, garlic, chipotle, salt & pepper\n*Salsa Verde: tomatillo, jalapeno, garlic, cilantro, salt & pepper\n*Salsa Ranchera: tomato, tomatillo, garlic and olive oil\n*Salsa Habanero: fiery smoked habanero, garlic, onion and touch of tomato\n\nThey have a great salsa bar of the variety listed above along with Pickled jalapenos and carrots, Cilantro, Onions, Limes, and Radishes. I love salsa, so I got a 2-3 containers of each. My favs were the ranchera and habanero. The habanero had a nice kick. For some reason, I adore mango habanero, so mixing the two salsas provided that spicy sweet kick that enjoyed with the free chips.\n\nThe tacos weren't really my thing. Maybe I'm more into traditional meats like carne asada, but I felt they were the weakest item. Rounding up to 4 stars due to the service. Everyone behind the counter really was sweet and accommodating.", "rating": 4, "date": "2017-12-30"}], "ensalada yucateca": [], "taco salad bowl": [{"excerpts": ["The tostadas are delicious and the taco salad bowl super yummy (and filling for a salad). ", "This has become a regular for us, and would recommend it every time."], "author": "Fiorella L.", "review": "Great addition to this neighborhood (which is famous for its amazing Asian/Asian-inspired food options) the service is great, the staff is friendly and courteous. And the food is even better, I have tried multiple items in the menu and I have LOVED them all. I inquired about a panucho once (didn't know what it was) and I was served one with my order as a courtesy!! My hubby now orders it every time. The tostadas are delicious and the taco salad bowl super yummy (and filling for a salad). This has become a regular for us, and would recommend it every time.", "rating": 5, "date": "2018-02-25"}], "whole black beans": [], "whole pinto beans": [], "grapefruit jarritos": []}