{"burrito mojado a big one": [], "one taco": [{"excerpts": ["and quesadillas are generally cheaper and less hurting emotionally if you don't like it, than burritos (San Franciscans take their burritos seriously).\nand cheaper than tacos (because you don't order just one taco).\n\n"], "author": "Rudy H.", "review": "when you're in doubt about a Taqueria, the safest bet for you is to order a Quesadilla.\nI had doubt about this place since I've been to the one on Market st and it wasn't a good burrito experience.\nwhy the safest bet is to order a quesadilla when you're not sure about a particular taqueria?\nbecause even bad taquerias at least makes decent quesadillas!\nit's grilled tortilla, cheese, carne asada.\nit's hard to mess up.\n\nand quesadillas are generally cheaper and less hurting emotionally if you don't like it, than burritos (San Franciscans take their burritos seriously).\nand cheaper than tacos (because you don't order just one taco).\n\nbut this place can't even make a decent quesadilla for $9.50 (tax).\nor at least be generous.\n\nI had doubt and I wasn't wrong.", "rating": 1, "date": "2018-01-19"}, {"excerpts": ["Sizes were big enough to divide the one taco into 2 (maybe 2.5). ", "I'm partial to the small street taco tortilla sizes, ", "so that's one thing I wish was an option here. ", "We would definitely come back!"], "author": "Edith Q.", "review": "Even though this place wasn't very busy, I still found the service to be faster than most other places we've been to. Unfortunately for my boyfriend, they were out of tripe and sesos (beef brains). Our order came with chips and salsa which was a plus! We ordered a lengua taco as well as one of carnitas. Lengua lacked some flavor, but nothing their delicious green salsa couldn't help with. I really loved the slight crisp and flavor of the carnitas! Sizes were big enough to divide the one taco into 2 (maybe 2.5). I'm partial to the small street taco tortilla sizes, so that's one thing I wish was an option here. We would definitely come back!", "rating": 4, "date": "2017-12-20"}, {"excerpts": ["Had to add a bunch of hot sauce to finish my one taco..."], "author": "Nathan W.", "review": "Had the beef lengua taco, wasn't all that impressed. Had to add a bunch of hot sauce to finish my one taco...", "rating": 2, "date": "2013-09-01"}, {"excerpts": ["Yes, El Farolito is better drunk food and their tasty grease of doom is amazing, yes La Taqueria has that one taco that's better than anything else, but for consistency in being very good across the board we have Cancun.  \n\n"], "author": "Scott S.", "review": "I've been to them all, and have the extra 20 or so pounds to prove it - but this is the king of the Mission taquerias for me.  It's not so much that it's all *perfect* but everything they do have is really good and in one place.  Yes, El Farolito is better drunk food and their tasty grease of doom is amazing, yes La Taqueria has that one taco that's better than anything else, but for consistency in being very good across the board we have Cancun.  \n\nI take out-of-towners and friends there, but really I'm doing it so I can have a guilt-free excuse to get a carne asada super burrito or some chorizo tacos.  Two bonuses - it's next to El Rio, and during the day parking is quick and easy nearby.  Not so easy further into the mission.", "rating": 4, "date": "2009-12-15"}, {"excerpts": ["One taco is really like 2. ", "The vegetables and cilantro are cut fresh right there. ", "It has the feeling of late night greasy spoon but doesn't leave you feeling sick. ", "The food for the price in the city! ", "Day or night!"], "author": "Melissa A.", "review": "New York has its pizza, we have burritos. I'm not a huge fan of burritos and usually order tacos. One taco is really like 2. The vegetables and cilantro are cut fresh right there. It has the feeling of late night greasy spoon but doesn't leave you feeling sick. The food for the price in the city! Day or night!", "rating": 4, "date": "2007-10-06"}], "pechuga suiza": [{"excerpts": ["The pechuga suiza (quesadilla with grilled chicken) caught my eye, and I knew that's what I needed to get me through the night.  ", "Well, that and some Mexican Coke.  ", "I've definitely had bigger in my travels--but the pechuga suiza was damn good nonetheless.  ", "The Mexican Coke was perfect to wash it down with, and I also helped my friend finish her horchata.  ", "It wasn't as smooth as the horchata at La Borinquena in Old Oakland, but at 12:15am \"any port in a storm\" becomes an all-encompassing philosophy."], "author": "Eric E.", "review": "The Negra Modelo I'd been drinking all evening needed some company, so I stopped here with a friend last night.  A quesadilla sounded like the most awesome thing on the planet.  Probably because it is!\n\nThe pechuga suiza (quesadilla with grilled chicken) caught my eye, and I knew that's what I needed to get me through the night.  Well, that and some Mexican Coke.  The cashier was very friendly and totally made me forget we were waiting a good ten mintues to place our order.  \n\nI had hoped it would be bigger--I've definitely had bigger in my travels--but the pechuga suiza was damn good nonetheless.  The Mexican Coke was perfect to wash it down with, and I also helped my friend finish her horchata.  It wasn't as smooth as the horchata at La Borinquena in Old Oakland, but at 12:15am \"any port in a storm\" becomes an all-encompassing philosophy.", "rating": 4, "date": "2008-02-17"}], "quesadilla flour": [], "eggs any style  a la mexicana": [], "eggs any style  con chorizo": [], "eggs any style  con jamon": [], "cocktel or camarones": [], "tostada or ceviche": [], "pollo  chicken": [], "sesos": [{"excerpts": ["Unfortunately for my boyfriend, they were out of tripe and sesos (beef brains). ", "Our order came with chips and salsa which was a plus! ", "We ordered a lengua taco as well as one of carnitas. ", "Lengua lacked some flavor, but nothing their delicious green salsa couldn't help with. ", "I really loved the slight crisp and flavor of the carnitas! "], "author": "Edith Q.", "review": "Even though this place wasn't very busy, I still found the service to be faster than most other places we've been to. Unfortunately for my boyfriend, they were out of tripe and sesos (beef brains). Our order came with chips and salsa which was a plus! We ordered a lengua taco as well as one of carnitas. Lengua lacked some flavor, but nothing their delicious green salsa couldn't help with. I really loved the slight crisp and flavor of the carnitas! Sizes were big enough to divide the one taco into 2 (maybe 2.5). I'm partial to the small street taco tortilla sizes, so that's one thing I wish was an option here. We would definitely come back!", "rating": 4, "date": "2017-12-20"}, {"excerpts": ["Cash only but decently priced (for 2017 SF) with the freshest sesos (pork brain) in the mission. ", "This is one of my go-to spots for a quick mexi meal. ", "(Crispy tacos or carnitas at El Buen Sabor, Cabeza tacos at La Oaxacaquena, Carnita Torta at Yucatasia being the others.) ", "I called in an order of a double meat (camarones and sesos) super burrito and had to wait another 5 minutes after paying before it was ready, which is perfectly fine and didn't influence this review in any way. ", "They were really busy that night. ", "My disappointment started when I got home and took about 4 bites before it was evident that they had only put shrimp and left out the sesos. ", "It sucked, but mistakes happen. ", "This in itself wouldn't have earned a negative review. ", "I called them up, explained my predicament and the guy begrudgingly told me to come back to grab a replacement burrito and to make sure I brought the other burrito with me. ", "Again, this was all fine enough. ", "The lightweight attitude was a bit off-putting ", "but, whatever, maybe they get scammed with this shit all the time. ", "What put it over the top was upon my return, the cashier/phone guy looks at my partially eaten burrito, disappointingly shakes his head and mutters something about \"you almost finished it\". ", "WTF? ", "I ate a quarter of it max and this fool thinks I really went all the way home and back to come up on a few extra bites of shrimp burrito? ", "They f'd up ", "and he tried to give me a guilt trip about it. ", "GTFO of here with that BS. ", "Last note: shrimp and sesos might sound gross to some of y'all but don't knock it before you try it. ", "Or don't try it and leave all the fresh sesos for me and all the folks I've put on to its deliciousness. ", "Also, the combo goes just as well in a quesadilla."], "author": "Carlo B.", "review": "First off, let me say that the food here is legit. Cash only but decently priced (for 2017 SF) with the freshest sesos (pork brain) in the mission. This is one of my go-to spots for a quick mexi meal. (Crispy tacos or carnitas at El Buen Sabor, Cabeza tacos at La Oaxacaquena, Carnita Torta at Yucatasia being the others.) If it's primetime, call ahead and your food might be ready by the time you get to the cashier.\n\nI'm giving them 2-stars in this review because of the subpar service I received the other night. I called in an order of a double meat (camarones and sesos) super burrito and had to wait another 5 minutes after paying before it was ready, which is perfectly fine and didn't influence this review in any way. They were really busy that night. My disappointment started when I got home and took about 4 bites before it was evident that they had only put shrimp and left out the sesos. It sucked, but mistakes happen. This in itself wouldn't have earned a negative review. I called them up, explained my predicament and the guy begrudgingly told me to come back to grab a replacement burrito and to make sure I brought the other burrito with me. Again, this was all fine enough. The lightweight attitude was a bit off-putting but, whatever, maybe they get scammed with this shit all the time. What put it over the top was upon my return, the cashier/phone guy looks at my partially eaten burrito, disappointingly shakes his head and mutters something about \"you almost finished it\". WTF? I ate a quarter of it max and this fool thinks I really went all the way home and back to come up on a few extra bites of shrimp burrito? They f'd up and he tried to give me a guilt trip about it. GTFO of here with that BS. 4 stars for the food (as always), 0 stars for the guilt trip and implicit scam accusations = 2 stars.\n\nIt's important to point out that this review is mainly about the late middle aged male cashier that was working there that night. The younger dude that usually works the cashier is cool as hell.\n\nLast note: shrimp and sesos might sound gross to some of y'all but don't knock it before you try it. Or don't try it and leave all the fresh sesos for me and all the folks I've put on to its deliciousness. Also, the combo goes just as well in a quesadilla.", "rating": 2, "date": "2017-06-15"}, {"excerpts": ["Highlights for us include:\n+ lengua (tongue)\n+ carnitas\n+ sesos (beef head, my favorite!)\n\n"], "author": "Claire S.", "review": "\"Everything's good,\" is what a friend said when we asked for recommendations on what to order. Realllly not helpful, and usually a biased, untrue statement, but we figured, why not?\n\nLet me tell you, this place is legit, amazing, and worth the effort it takes to find parking in the Mission.\n\nSUPER TACOS.\nGot a mess of these, and made a mess devouring them all. They come topped with fresh, sliced avocado, and sour cream, along with generous scoops of whatever meat you decide to order. Highlights for us include:\n+ lengua (tongue)\n+ carnitas\n+ sesos (beef head, my favorite!)\n\nLINES.\nJust brave them. They come and go, seemingly at random, and you may be hit with a 20 minute line, or a 5 minute one, but it's worth the wait.\n\nTABLES.\nYou have to have the eye of a hawk to spot a group leaving their table in this crowded place, and you need to act fast, as at any given time, you're competing with several other shrewd-eyed table-hunters as well. Be patient, though.\n\nDefinitely coming back again and again!\n\nNote-  CASH ONLY.", "rating": 5, "date": "2014-08-25"}, {"excerpts": ["There is also lengua (beef tongue), cabeza (beef head), and sesos (beef brains) for the more adventurous. ", "The super ($7.25) adds cheese, avocado, and sour cream. "], "author": "CJ G.", "review": "Smack in the middle of The Mission, Taqueria Cancun sports some of The City's best burritos.\n\nWith wooden tables and benches, faux brick walls, and adobe tiled floors, Taqueria Cancun screams \"burrito joint\" from the moment you enter. The menu holds no surprises, and none are missed. When you wander into this dive, you want a burrito, taco, or quesadilla, straight up with no frills.\n\nThe regular burrito ($6.25) features rice, beans, onion, cilantro, salsa, and your choice of meat. The standard meats are well represented: carne asada, pollo, carnitas, and veggie are on hand. There is also lengua (beef tongue), cabeza (beef head), and sesos (beef brains) for the more adventurous. The super ($7.25) adds cheese, avocado, and sour cream. Since it is included as a separate ingredient, the cilantro overtones may be too much for some diners, while others may find it pleasant. \n\nThe carne asada super burrito was sizable (not epic, but still large), and there was a good mix of ingredients throughout, making each bite a multi-taste pleasure. Taqueria Cancun burritos have a higher steak to filler ratio than El Farolito, and the tortillas are griddled rather than steamed, providing ample differentiation between the two big Kahunas of Mission burritos. \n\nThough the tortilla chips are complimentary, but there is no salsa bar. Rather salsa is doled out by the cashier in tiny, miserly plastic cups. As in any good Mission burrito joint, there is a myriad of well priced domestic and Mexican beers, Mexican and regular sodas, and aguas frescas.\n\nYes, the lines can be long, but they move quickly. Yes, it's cash only. Yes, it can be smokey at times.  What else would you expect from one of the quintessential burrito joints in The City.", "rating": 5, "date": "2014-06-13"}, {"excerpts": ["I've been though almost the entire menu except for sesos (brains). ", "The best item is the burrito Mojado, a  burrito covered in enchilada sauce and salsa. ", "It's enough for two people and under 10 bucks."], "author": "Alexander S.", "review": "Taqueria Cancun is always highly rated, for good reason. I've been though almost the entire menu except for sesos (brains). The best item is the burrito Mojado, a  burrito covered in enchilada sauce and salsa. It's enough for two people and under 10 bucks.", "rating": 5, "date": "2016-09-24"}, {"excerpts": ["burrito - delicious, big, juicy, flavorful steak - 4 stars\n\nSesos (brains) taco - deeee...sgusting. ", "Just stay off the sesos"], "author": "Mike K.", "review": "Came to Taqueria Cancun late on a Saturday night for some drunken munchies.  There was a long line of 20 people and plenty of commotion. But they have an efficient system that keeps thing moving quickly. Only waited 10 minutes to pay and pick up the food:\n\nRegular Carne Asada burrito - delicious, big, juicy, flavorful steak - 4 stars\n\nSesos (brains) taco - deeee...sgusting. my first time trying brain and I could only take on bite. It tasted really funky and creamy, with a mushy texture. \n\nOverall Taqueria Cancun is another example of great Mexican food in the mission. Just stay off the sesos", "rating": 4, "date": "2015-02-22"}, {"excerpts": ["These were the jam:\n\n- Sesos (steamed cow brain)\n- Cabeza(steamed cow head)\n- Lengua (steamed cow tongue)\n"], "author": "Grayson K.", "review": "Super Tacos. Must get. Reminds me of the famous Lilly's Taqueria in Santa Barbara. \n\nAuthentic Steamed Mexican Tacos. And I'm not talking about carnitas.\nSounds weird but you'll get it when you get it. Don't regret it. \n\nThese were the jam:\n\n- Sesos (steamed cow brain)\n- Cabeza(steamed cow head)\n- Lengua (steamed cow tongue)\n- Ojo (steamed cow eye)\n\nI wish they would carry:\n\n- Cachete (steamed cow cheek)\n- Labio (steamed cow lip)\n- Tripas (steamed cow intestines)\n- Buche (pork stomach cooked in lard)\n\nBest Taqueria in SF hands down. Check out El Norteno Taco Truck for more exotic meat options.", "rating": 5, "date": "2012-07-22"}, {"excerpts": ["Autentico enough que hay sesos (beef brain), but they do the nachos and burritos too.  ", "Friendly generous and attentive staff (who sometimes sing spontaneously at night), mostly Latin crowd except for some other people dressed like complete FREAKS, like rhinestones and cowboy hats and spandex.   ", "Plus a cab driver, and me.  ", "Somehow, every avocado they serve is perfectly ripe.  ", "Jukebox of mariachi music volume way up.  ", "A place where you can dine alone and still have a good time.\r\n\r\n", "Thet signature dish here is their tosdada de ceviche, chewy dark fish chopped small with onions and tomatoes, very acidic, with half an aguacate sliced on top.  ", "it's been consistently delicious for the near decade ", "I've been coming here.\r\n\r\n", "In fact, the food is reliable, like coming home to an old lover.  ", "Not high end even by taqueria standards, but well done, reliable, tasty.\r\n\r\n", "Prices are way inexpensive, we're talking $3.80 regular burritos.  ", "$6 cocktail de camarones and, though you can tell from the ingredients why it's so cheap, it's still a good value and enjoyable, served the right way with Tapatio sauce and fresh lime, avocados, onions, and saltine crackers.  ", "A little heavy on the ketchup taste but aren't we all?\r\n\r\n", "Festive decoration, looks a lot like Mexico -- fake brick arches (little tiles glued to wall), enough primary red and yellow thick latex paint to burn down a McDonald's from across the street in shame, cutout colored paper hanging from ceiling, sly mural on wall depicting natives gathered at oceanside to marvel at something in the sea, probably approaching Europeans, only there's notobody in the sea, just volcanoes on the peninsula.\r\n\r\n", "I wouldn't go here on a first date, not even a first trip to the Mission.  ", "But I would come back again and again when I need to feel better about life on a cold rainy night."], "author": "Gil S.", "review": "One of the best, open late, always happy.  Autentico enough que hay sesos (beef brain), but they do the nachos and burritos too.  Friendly generous and attentive staff (who sometimes sing spontaneously at night), mostly Latin crowd except for some other people dressed like complete FREAKS, like rhinestones and cowboy hats and spandex.   Plus a cab driver, and me.  Somehow, every avocado they serve is perfectly ripe.  Jukebox of mariachi music volume way up.  A place where you can dine alone and still have a good time.\r\n\r\nThet signature dish here is their tosdada de ceviche, chewy dark fish chopped small with onions and tomatoes, very acidic, with half an aguacate sliced on top.  it's been consistently delicious for the near decade I've been coming here.\r\n\r\nIn fact, the food is reliable, like coming home to an old lover.  Not high end even by taqueria standards, but well done, reliable, tasty.\r\n\r\nPrices are way inexpensive, we're talking $3.80 regular burritos.  $6 cocktail de camarones and, though you can tell from the ingredients why it's so cheap, it's still a good value and enjoyable, served the right way with Tapatio sauce and fresh lime, avocados, onions, and saltine crackers.  A little heavy on the ketchup taste but aren't we all?\r\n\r\nFestive decoration, looks a lot like Mexico -- fake brick arches (little tiles glued to wall), enough primary red and yellow thick latex paint to burn down a McDonald's from across the street in shame, cutout colored paper hanging from ceiling, sly mural on wall depicting natives gathered at oceanside to marvel at something in the sea, probably approaching Europeans, only there's notobody in the sea, just volcanoes on the peninsula.\r\n\r\nI wouldn't go here on a first date, not even a first trip to the Mission.  But I would come back again and again when I need to feel better about life on a cold rainy night.", "rating": 4, "date": "2006-03-06"}, {"excerpts": ["I have not tried the sesos. ", "I would stick to the super burrito. ", "It's got everything you want including what looks like a whole avocado. ", "You know you're in an above average taqueria when the salsa is great. ", "Here you get Salsa Verde and some Pico de Gallo with your fresh chips. ", "Each salsa is spicier than the average salsa you get at a taqueria, but in a \"I-know-this-is-hot-but-I-want-more\" kind of way. ", "Whether you just left a bar and need some late night grub or you just want to grab a quick lunch, Cancun is a great place to go."], "author": "Thomas L.", "review": "I've had burritos all over the West Coast. From the tip of Cabo all the way up to Oregon. Taqueria Cancun is one of the best bang for your buck taqueria's that I have been to. The carnitas, pollo, carne asada and cabeza are all excellent. Each is cooked and seasoned pretty well. The lenguas is only average and could use some more seasoning. I have not tried the sesos. I would stick to the super burrito. It's got everything you want including what looks like a whole avocado. You know you're in an above average taqueria when the salsa is great. Here you get Salsa Verde and some Pico de Gallo with your fresh chips. Each salsa is spicier than the average salsa you get at a taqueria, but in a \"I-know-this-is-hot-but-I-want-more\" kind of way. Whether you just left a bar and need some late night grub or you just want to grab a quick lunch, Cancun is a great place to go.", "rating": 4, "date": "2010-08-15"}, {"excerpts": ["Grilled tortillas, two kinds of homemade and extra spicy salsa, tender carnitas and \"alternative\" meats such as sesos, cabesa, fast, accurate service, Mexican kitsch galore. ", "No bullshit. ", "Have cash (it's the Mission after all), know what you want when you step up to the register, and enjoy!"], "author": "nathan l.", "review": "For a taqueria, as good as it gets. Street-style Mexican food is simple and Cancun does the little things right, which makes all the difference. Grilled tortillas, two kinds of homemade and extra spicy salsa, tender carnitas and \"alternative\" meats such as sesos, cabesa, fast, accurate service, Mexican kitsch galore. No bullshit. Have cash (it's the Mission after all), know what you want when you step up to the register, and enjoy!", "rating": 5, "date": "2012-09-10"}], "carne asada or carnitas or grilled chicken": [], "extra chips": [{"excerpts": ["Your burrito also comes with chips and a small amount of salsa, unless you're like me and didn't know that and ordered an extra chips and salsa. "], "author": "Danny P.", "review": "You know how New Yorkers like to say if it's not New York, it's crap? Well, I've learned after Taqueria Cancun that there are some things we just don't do as well as the rest of the country.*\n\nThe burrito here is the primary reason to go, and it's delicious and gigantic and everything that Chipotle** will never be. The tortilla is toasted just perfectly so that the first bite is crispy and crunchy, and by the time you're done the tortilla is the perfect amount of soggy from the juices from the meat. I'd suggest you cut it in half, or just cram the whole thing into your face like I did.\n\nYour burrito also comes with chips and a small amount of salsa, unless you're like me and didn't know that and ordered an extra chips and salsa. With a soda, I still got out for under $10 which is fantastic.\n\nFor out of towners, when you go into the store, walk past the first station and find the cash register -- they'll take your order there. It's cash only, but not too expensive so you should be fine there.\n\nAlso, seating is at communal tables, so if it looks crowded send everyone to go sit at a table and let one person order for everyone.\n\n* - The others are barbeque and free refills on soda.\n\n** - Don't worry, I still love you, Chipotle.", "rating": 5, "date": "2012-01-31"}, {"excerpts": ["They also give you free chips with salsa and spicy guac (extra chips costs $1.50).\n\n"], "author": "Veronica S.", "review": "Mmmm this place is muy bueno!! Delicious, authentic, and CHEAP. What more can you ask?\n\nThe burritos are solid and delicious. The tamales and dishes are huge and more affordable than other joints (no more than $7 for a combo dish? What!)\n\nThey also give you free chips with salsa and spicy guac (extra chips costs $1.50).\n\nGood solid joint...just be prepared for a hole in the wall type of place though, nothing fancy here!\n\nJust be aware: CASH ONLY!", "rating": 5, "date": "2011-02-06"}, {"excerpts": ["You also get chips and one small container each of mashed avocado and salsa, unless you get nachos - in which case you don't really need the extra chips, but you still get the two sauces!\n\n"], "author": "Dori S.", "review": "My favorite burrito place in the Mission!  Fast service, big portions, and absolutely delicious.  Get a super burrito - comes with all the fixings inside!  You also get chips and one small container each of mashed avocado and salsa, unless you get nachos - in which case you don't really need the extra chips, but you still get the two sauces!\n\nAtmosphere is pretty lively - always a lot of people coming in to order and eat in or get take out...  Music is rather loud, but adds character to the place.  Picnic table style seating.", "rating": 5, "date": "2010-08-25"}], "cebollitas": [{"excerpts": ["\"\n\nA tasty and awesome side dish if you're a lover of scallion like myself is the cebollitas, grilled green onion cooked on the stove till lightly browned and doused with lime. "], "author": "Len S.", "review": "This is my go-to place for a burrito. When I get the fever for the flavor of a burrito large enough to choke your burro then come to this place. The big wins here is the food is good. The Al Pastor (in my mind the measure of any taco or burrito joint) is damn tasty. The Carnitas is awesome and their Al Ambres is simply put \"the stuf.\"\n\nA tasty and awesome side dish if you're a lover of scallion like myself is the cebollitas, grilled green onion cooked on the stove till lightly browned and doused with lime. How can you go wrong with that? Hm?\n\nFor you nighthawks this place is open late but with great long hours come great long lines of half inebriated bar hoppers. Seating is a communal and can be a pain but overall a great experience. Be prepared for the occasional pan handler making his way in for a nibble or a swig of your negro modelo.", "rating": 4, "date": "2011-01-06"}, {"excerpts": ["gotta order the cebollitas side order with the burrito...grilled green onions with lime...mmm-good."], "author": "Roy N.", "review": "one of the true staples of a san francisco diet.  i usually crave it around 1-2am...so, have never really been there sober. \n\ngotta order the cebollitas side order with the burrito...grilled green onions with lime...mmm-good.", "rating": 5, "date": "2008-10-16"}, {"excerpts": ["cebollitas. ", "spanish for 'green onions,' and for a $1.85, you can grilled goodness of these things with salt and pepper. ", "it sounds so simple and i seriously tried to recreate this last night, but no dice. "], "author": "Jenz y.", "review": "cebollitas. spanish for 'green onions,' and for a $1.85, you can grilled goodness of these things with salt and pepper. it sounds so simple and i seriously tried to recreate this last night, but no dice. savory snack, indeed.\n\nmy mom and i always hit up cancun for their cocktel de camarones (shrimp cocktail) - the restaurant by my mom's work in san jose has this same dish for $9.50 and at cancun it's twice as big and only $6.50. these guys don't mess around when it comes to freshness. savory, giant shrimp, crack-like cocktail mix, and all the crackers you want - dear lord i want one right now. the burritos are also giant, and they're about the same level of price range as farolito.\n\nthe bernal heights one is slower but seemingly not as tasty, and the SOMA one will do in the pinch when you're coming out of the warfield after a show.", "rating": 5, "date": "2007-12-08"}], "mexican sodas": [{"excerpts": ["The mexican sodas here are the cheapest, and there is actually room to sit down. ", "Let's not forget that they are open super late for any of your late night snackers. "], "author": "Chris D.", "review": "Pros:\nAwesome, big burritos with great tasty chicken and spicy salsa. When I'm at home, and I have a craving for burritos, it's either TC or El Farrlito. The mexican sodas here are the cheapest, and there is actually room to sit down. Let's not forget that they are open super late for any of your late night snackers. The salsa they serve here is awesome.\n\nCons:\nThe chips are not quite as good as Poncho Villa, but they are free. They are very stingy on the salsa.", "rating": 4, "date": "2010-06-24"}], "mexican beer": [{"excerpts": ["Overall delicious  and they serve Mexican beer!!! ", "Cheers!!!"], "author": "Nathaly G.", "review": "Delicious kinda felt as if I was in Mexico due to the surroundings and the food. Great taco de lengua, nachos especiales not so good taco de carnitas. \nOverall delicious  and they serve Mexican beer!!! Cheers!!!", "rating": 4, "date": "2018-09-12"}, {"excerpts": ["American/Mexican beer and horchata are available, too."], "author": "Nicolette S.", "review": "This taqueria is my favorite in the mission! The ingredients are fresh and you can taste it. Every time I go inside, you can see someone chopping onions, tomatoes, cilantro etc. \n\nIt is known to have the 'best veggie burrito' and as a vegetarian, I can fully agree. I order the veggie burrito with black beans and extra avocado. Burritos come with complimentary chips and the most delicious green and red salsa (get extra green salsas, it is that good and you will run out).\n\nAND as a cherry on top, its inexpensive! My giant burrito + chips  only comes out to be six bucks and is waaay too much food. I'm always impressed with the fact that I can feel so nourished and full for so little money! If you don't mind hole in the wall dining, I recommend this as your go to for delicious Mexican food in the mission. Also, they juice oranges and carrots if you're into fresh juices. American/Mexican beer and horchata are available, too.", "rating": 5, "date": "2013-08-30"}, {"excerpts": ["$3.50 for bottled Mexican beer is a bit more expensive than similar places in the area but would never ever stop me from getting a few Pacificos.  "], "author": "Paul C.", "review": "Pretty delicious burritos, and the salsa & guac are a bit spicy.  $3.50 for bottled Mexican beer is a bit more expensive than similar places in the area but would never ever stop me from getting a few Pacificos.  The guys working the line are furiously fast.\n\nOne note: there was some gang hanging just outside the door trying to start altercations, but they disappeared while we were inside.  \n\nI was pretty surprised at what a mix of clientle there was as we approached the 10 o'clock hour... older chicks out on the town for a birthday, hipster douches, internet engineers, and hobos...\n\nThis is a good place.  Wish they had fish tacos.", "rating": 4, "date": "2008-02-09"}, {"excerpts": ["- I promise it is really, really good especially with a little mexican beer to wash it all down.  ", "Enjoy."], "author": "Annabel G.", "review": "I love a taco but Cancun also makes Ceviche tostadas!!!  Also be sure to order the grilled ceballitos (basically grilled sweet spring onions) - I promise it is really, really good especially with a little mexican beer to wash it all down.  Enjoy.", "rating": 4, "date": "2006-08-08"}, {"excerpts": ["My favorite thing to order is the Carnitas Super Burrito and either a Mexican beer or a soft drink - the coke in a bottle ", "is the kind you can get in Mexico (with real cane sugar, not corn syrup!) "], "author": "U U.", "review": "Awesome burritos? check.\nGreat chips & salsa with every order? check.\nLow prices? check.\n\"Authentic\" mexican? check.\nOpen late-night? double check.\n\nThis little hole in the wall has the best burritos you are likely to find in the city. They are the best I have ever had anywhere. My favorite thing to order is the Carnitas Super Burrito and either a Mexican beer or a soft drink - the coke in a bottle is the kind you can get in Mexico (with real cane sugar, not corn syrup!) and the Mexican lime or mandarin sodas are tangy and great to wash down the meal with...\n\nFor a couple of reasons I give this 4 stars and not higher. First, they don't take credit cards (although they do have an ATM next to the jukebox). And second, I have been in several times and on more than one occasion the staff has not seemed to mind when a panhandler (or random crazy person) has wandered in to harass the customers.  I know it's the Mission, but the diners should feel comfortable and safe or they won't come back.  \n\nOther than that, this place rocks.", "rating": 4, "date": "2009-04-22"}]}