{"pollo cocido": [], "beef head": [], "taco regular": [], "torta sandwich": [{"excerpts": ["Taqueria Guadalajara, were I Bought a carne asada Burrito and a Torta Sandwich for $14.84. ", "The service was fine, the salsa bar was good. ", "I took the food home and saw that the $7.50 (+ Tax) ", "Burrito was quite thin, even so I enthusiastically bit into my skinny burrito.  ", "Not a good experience. ", "The meat portion was miniscule and the meat itself was rubbery, grisly and excessively SALTY. ", "I was basically served a bean, salt and cilantro  Burrito. ", "The Burrito was so salty and had so much cilantro, that although I was very hungry I was unable to eat it. ", "My friend gave me part of his Torta Sandwich and although better than the burrito, it hardly had any cheese, the sandwich was not cut in half, and the same overly salty, grisly, precooked, rubbery meat was used. ", "Taqueria El Farolito down the street, charges $1.50 less,  $13.23 for a Super Burrito and a Torta, and their Burritos are twice the size of the anorexic  one I received at Taqueria Guadalajara, and the torta sandwiches are so much better, the Tortas sandwiches at EL Farolito are made with a couple of fresh cooked steaks, not with precooked, grisly, rubbery and salty chopped meat.\n", "As for that burrito, I had to throw it away. ", "I have been eating Burritos in the Mission district for 35+ years, and this is the first time I had to throw the food away in quite some years.  ", "I have eaten here before ", "and I  like their habanero salsa.  ", "Their longtime cook Miguel is gone ", "an so has the quality of the food of this taqueria.\n", "Conclusion:  although the service, the salsas and the ambiance were good, presently the food portion is miserly and tastes awful. ", "I like salt, I like cilantro, but their food had way to much of both drowning out all but the salsa and compared to the other Taquerias on 24th street , way too little in the meat department. ", "As of this 2012 writing I plan to eat elsewhere. ", "I was hungry and I had to throw my carne asada ", "burrito away. ", "Cannot recommend."], "author": "Charlie T.", "review": "The good: Clean. The salsas are quite good. Open nightly past midnight. Accepts ATM & credit cards. Clean bathrooms. Nice ambiance. Sweet murals. Good service.\nThe Bad: I was very  hungry and I couldn't 't eat more than a couple of bites of that horrendous Burrito. Can be problematic outside, in front of the place, I once saw a beer bottle thrown at lady near me by an unknown drunk late one evening,. She was scared and  traumatized. Poor woman.  The Neighborhood.\n\nExperience: Tonight at midnight, I was quite hungry, and went to  Taqueria Guadalajara, were I Bought a carne asada Burrito and a Torta Sandwich for $14.84. The service was fine, the salsa bar was good. I took the food home and saw that the $7.50 (+ Tax) Burrito was quite thin, even so I enthusiastically bit into my skinny burrito.  Not a good experience. The meat portion was miniscule and the meat itself was rubbery, grisly and excessively SALTY. I was basically served a bean, salt and cilantro  Burrito. The Burrito was so salty and had so much cilantro, that although I was very hungry I was unable to eat it. My friend gave me part of his Torta Sandwich and although better than the burrito, it hardly had any cheese, the sandwich was not cut in half, and the same overly salty, grisly, precooked, rubbery meat was used. Taqueria El Farolito down the street, charges $1.50 less,  $13.23 for a Super Burrito and a Torta, and their Burritos are twice the size of the anorexic  one I received at Taqueria Guadalajara, and the torta sandwiches are so much better, the Tortas sandwiches at EL Farolito are made with a couple of fresh cooked steaks, not with precooked, grisly, rubbery and salty chopped meat.\nAs for that burrito, I had to throw it away. I have been eating Burritos in the Mission district for 35+ years, and this is the first time I had to throw the food away in quite some years.  I have eaten here before and I  like their habanero salsa.  Their longtime cook Miguel is gone an so has the quality of the food of this taqueria.\nConclusion:  although the service, the salsas and the ambiance were good, presently the food portion is miserly and tastes awful. I like salt, I like cilantro, but their food had way to much of both drowning out all but the salsa and compared to the other Taquerias on 24th street , way too little in the meat department. As of this 2012 writing I plan to eat elsewhere. I was hungry and I had to throw my carne asada burrito away. Cannot recommend.", "rating": 1, "date": "2012-03-30"}], "burrito ranchero": [], "camarones diabla y plancha": [], "fried fish tilapia": [], "shrimp fajitas": []}