{"super quesadilla suiza": [{"excerpts": ["had a super quesadilla suiza which was almost as gross as they're attitude but not as bad. ", "first let's start with the food it was gross ", "I was hungry ", "I ate half my daughter was suppose to eat the other half. ", "she toke one bite and refuse. ", "the chicken was blah ", "no seasoning no nothing it was flavorless. ", "the guy that time my order was rude and didn't want to serve me at all I noticed he was a lot friendlier to the Latino couple that came in after me and the Latino elderly man after them. ", "i don't understand people like this if u don't want to serve a \"certain kind of person", "\" don't open a restaurant.", "THIS IS THE SECOND TIME AN INCIDENT ", "LIKE ", "THIS HAPPENED IN THE MISSION. ", "I had a kid with me at least be a little friendly. ", "this was my first and last time coming to this over priced place"], "author": "Sarai M.", "review": "had a super quesadilla suiza which was almost as gross as they're attitude but not as bad. first let's start with the food it was gross I was hungry I ate half my daughter was suppose to eat the other half. she toke one bite and refuse. the chicken was blah no seasoning no nothing it was flavorless. the guy that time my order was rude and didn't want to serve me at all I noticed he was a lot friendlier to the Latino couple that came in after me and the Latino elderly man after them. i don't understand people like this if u don't want to serve a \"certain kind of person\" don't open a restaurant.THIS IS THE SECOND TIME AN INCIDENT LIKE THIS HAPPENED IN THE MISSION. I had a kid with me at least be a little friendly. this was my first and last time coming to this over priced place", "rating": 1, "date": "2017-02-05"}, {"excerpts": ["My little sister couldn't stop raving about their Super Quesadilla Suiza, so I had to try it. ", "She warned me it was freakishly large and overflowing with \"extras\" not normally found in a quesadilla. "], "author": "Mariela D.", "review": "My little sister couldn't stop raving about their Super Quesadilla Suiza, so I had to try it. She warned me it was freakishly large and overflowing with \"extras\" not normally found in a quesadilla. So obviously, I was sold.\n\nI ordered the pollo asado super quesadilla suisa. It was roughly the size of my head. And with one bite, cheese, sour cream and guacamole oozed everywhere. In fact, I ended up using my chips to scoop up my spillover quesadilla fillings, which was kinda like eating nachos - bonus! \n\nI preferred turning my chips into makeshift nachos instead of dipping into the pico de gallo they had sitting in little jars on each table. I couldn't bare to dip my chips into it because much like Ben Stiller in \"Along Came Polly\", I imagined the scores of people who must have double-dipped in there. I prefer salsa bars, thanks. They're slightly more hygenic. But it's a nice thought.\n\nAn added bonus is that it's down the street from Humphrey's, so if this place fails to induce a food coma (which is unlikely), their ice cream should do the trick.\n\nAmbiance? Well, I guess if rickety benches and the sound of Univision blaring on a 15-inch tube TV counts as ambiance, this place has got it. But let's face it, who goes to taquerias for ambiance? I go to get my fullz on. Period. And this place delivered. I haven't tried their super burrito yet, but judging by the quesadilla I'm sure it would be equally filing and ridiculously full of gooey goodness.\n\nTraditionalists might say that adding so many fillings to a quesadilla makes it no longer a quesadilla, but more like a flat burrito, so it really shouldn't be called a quesadilla. To them I say....\"What, I can't understand you?! My mouth is full of this delicious quesadilla! Nom, nom, nom...\"", "rating": 4, "date": "2010-08-25"}, {"excerpts": ["Super Quesadilla Suiza con Chorizo. ", "Don't ask, just do it. ", "Do it right now. ", "I've tried every place on 24th street and it hands down "], "author": "Paul B.", "review": "Whoa wow. \n\nTaqueria San Francisco!!!!\n\nSuper Quesadilla Suiza con Chorizo. Don't ask, just do it. Do it right now. I've tried every place on 24th street and it hands down has THE BEST quesadilla suiza. \n\nThere chips and salsa aren't that great, but the mediocre start makes the climax all the better. This is on my list of the three food places I take every single person that visits me in SF", "rating": 5, "date": "2010-04-14"}, {"excerpts": ["I only go here for one thing on the menu - The \"Super quesadilla Suiza with carne asada\" and that's it. ", "Ordering the super versus the regular means that they add avocado, sour cream and pico ", "de gallo salsa. ", "It is an explosion of flavors and yummy greasiness.  "], "author": "Angelica F.", "review": "I only go here for one thing on the menu - The \"Super quesadilla Suiza with carne asada\" and that's it. Ordering the super versus the regular means that they add avocado, sour cream and pico de gallo salsa. It is an explosion of flavors and yummy greasiness.  It's cheap, yummy and a must!\n\nIt's a basic taqueria dive with not much atmosphere.\n\n$6.25  \n\n*Cash Only*", "rating": 4, "date": "2011-03-08"}], "quesadilla flour": [], "quesadilla corn": [], "regular nachos": [], "tostadas": [{"excerpts": ["2 carne asada tostadas, some bogus nachos covered in Velveeta cheese (no exaggeration) and 2 horchatas for $28.00??? ", "WOW! "], "author": "Vic F.", "review": "$7.50 for a regular burrito? $5.00 for a tostada? $12.00 for nachos? \n\nAre you kidding me? \nWho do you think you are Taqueria San Francisco? La Taqueria on Mission street? (which is also garbage) Are you trying to emulate them? Are you trying to get over while the gettin' is good? Jack the prices, lower the quality and increase the profit margins! Good times all the way around! \"Surge pricing\" while the techies are here? \n\n2 carne asada tostadas, some bogus nachos covered in Velveeta cheese (no exaggeration) and 2 horchatas for $28.00??? WOW! Straight robbery. \n\nIf you're going to charge me this much I expect the meat to be lean and without big globs of fat and without grissle. Screw that noise! And the chips are straight Costco! \n\nToo many other good Taqueria's in the Mission District for me to ever visit this place again.", "rating": 2, "date": "2015-09-21"}], "ceviche tostadas": [], "tamales": [{"excerpts": ["I look forward to coming back and trying their veggie tamales!"], "author": "Alicia F.", "review": "I've walked by this place numerous time, but I never had a chance to pop in. I was on my lunch break, and wanted to find something close by that was quick, and delicious. I found all of that here! I ordered a veggie taco. I was more than pleased. There was a generous helping of ingredients, including avacado! The veggie taco was only $3, wow. Other places charge you about $1.50 or $2 more for the same meal. You also get your own personal pico de gallo for your table. Super tasty and spicy. The staff was friendly and attentive, even bringing me utensils and napkins, although it's self serve. I look forward to coming back and trying their veggie tamales!", "rating": 4, "date": "2017-06-29"}, {"excerpts": ["My guy had the tamales dinner and he remarked the corn and meat were waaaay overcooked. ", "We were full, but not satisfied. ", "Doubt we'll be back--", "we're fans of La Corneta personally."], "author": "Genevieve R.", "review": "Gotta agree with some of the negative yelp reviewers. Came here for some post-happy hour grub (I'm actually kinda drunk writing this) tonight based on a rec from my co-worker and it disappointed. I got the carne asado burrito \"mojado\" with their fiery hot green salsa, sour cream and red sauce on top. Jesus it was freaking spicy! Too much tortilla, not enough meat and in my book, that's b.s. My guy had the tamales dinner and he remarked the corn and meat were waaaay overcooked. We were full, but not satisfied. Doubt we'll be back--we're fans of La Corneta personally.", "rating": 2, "date": "2006-09-22"}, {"excerpts": ["I tried a tamale, because I love tamales and I hadn't had one in a while.  ", "Unfortunately, it was super dry ", "and I don't know how common/normal this is, but it had potato in it.  ", "Which wasn't horrible, it was just weird to me.  ", "My apologies if tamales are supposed to have potatoes in them, I'm just a white girl, what do I know?  ", "Anyway, we were the last customers of the night and maybe that tamale had been sitting around all day ", "but I wouldn't try it again.  ", "Stick with the burritos and head somewhere else if you want good chips-- theirs pretty much suck."], "author": "Kristin P.", "review": "We must have been feeling adventurous when we strolled into the empty Taqueria San Francisco-- my bf ordered the carne adada super burrito meal/dinner with rice and beans.  It was like a burrito-enchilada hybrid, covered in cheese and salsa.  It was totally delicious and survived life in a Styrofoam box as we drove it home.  My risk-taking, however, didn't quite pay off.  I tried a tamale, because I love tamales and I hadn't had one in a while.  Unfortunately, it was super dry and I don't know how common/normal this is, but it had potato in it.  Which wasn't horrible, it was just weird to me.  My apologies if tamales are supposed to have potatoes in them, I'm just a white girl, what do I know?  Anyway, we were the last customers of the night and maybe that tamale had been sitting around all day but I wouldn't try it again.  Stick with the burritos and head somewhere else if you want good chips-- theirs pretty much suck.", "rating": 4, "date": "2008-08-28"}], "guacamole  chips": [], "grilled green onions cebollitas asadas": [], "regular shrimp or fish": [], "super fish": [], "super shrimp": [], "mojado": [{"excerpts": ["I wanted to go for the mojado (wet) burrito, but I'll try that next time and update y'all."], "author": "Shruti D.", "review": "As a vegetarian, I look for flavorful Mexican food. :p\n\nI ordered a veg taco. It hit the spot. The cheese is melty at the bottom and there's flavor to their pico that they put in the taco. Beans and rice were well done. Good amount of avocado on my taco too.\n\nThe pico and green chili salsa are different than other taquerias because they have a flavor zing to them, the pico is tangy and there's some spice in the green chili salsa that is different and wonderful, couldn't pick up on what it was though.\n\nI know meat eaters go to taquerias for the flavored meat, so I can't report on that unfortunately, but as a veg, we can't be having bland ass tacos and burritos, and the tacos here ain't that. \n\nI wanted to go for the mojado (wet) burrito, but I'll try that next time and update y'all.", "rating": 5, "date": "2017-06-04"}, {"excerpts": ["My brother and I split a chorizo mojado burrito. ", "The flavors were surprisingly weak. ", "We also got the nachos to split and the cheese was that bright yellow nacho sauce you can get at the movie theater. ", "At least use real cheese. ", "All around heavily disappointing."], "author": "Naina G.", "review": "Not really sure why or how this place is rated so well. I came here during my last visit to SF as I wanted to have a great burrito while in town. This was really basic and underwhelming. I've enjoyed burritos from Chipotle more than the one I had here. I came with my family, my parents who are vegetarian got the super veggie burrito, which they said was just ok. My brother and I split a chorizo mojado burrito. The flavors were surprisingly weak. We also got the nachos to split and the cheese was that bright yellow nacho sauce you can get at the movie theater. At least use real cheese. All around heavily disappointing.", "rating": 1, "date": "2018-08-04"}, {"excerpts": ["I also tried a chicken Mojado burrito. ", "It was very good. ", "They are generous with their portions. ", "Alot of avocado and cheese on everything. ", "The sauces are delicious and they include a home made pick de gallo and chile.\n", "Overall this place is great. \n", "Cash only."], "author": "Kevin S.", "review": "This place is awesome!\nThey serve real man portions of food and it's all delicious!\nTry the nachos with meat. They won't disappoint. Best $14 ever spent.\nI also tried a chicken Mojado burrito. It was very good. They are generous with their portions. Alot of avocado and cheese on everything. The sauces are delicious and they include a home made pick de gallo and chile.\nOverall this place is great. \nCash only.", "rating": 5, "date": "2017-06-10"}, {"excerpts": ["Mojado burrito is a super burrito on bath salt.  ", "Bath salt makes thing ridiculous and this really makes the burrito insane.  ", "Sauce all over the burrito. ", "Cheese melted on top.  ", "Salsa and guacamole and onions in small islands as they fight for dear life.  ", "My lord this is a good mission style burrito.  ", "I have been looking for you "], "author": "Gary K.", "review": "$14 for a legit set up of beer chips spicy salsa burrito and tip.  Salsa is actually pretty spicy and has a nice kick to it.  I have been used to seeing either salsa bars or places giving you small cups of salsa but Taqueria actually gives you a jar of salsa.  Such trust that this establishment has and as a huge salsa fiend, I was careful not to breach this trust and go ham on their amazing salsa.\n\nMojado burrito is a super burrito on bath salt.  Bath salt makes thing ridiculous and this really makes the burrito insane.  Sauce all over the burrito. Cheese melted on top.  Salsa and guacamole and onions in small islands as they fight for dear life.  My lord this is a good mission style burrito.  I have been looking for you and I definitely found it.\n\nSo not only is your burrito covered in this amazing sauce and cheese, the inside has layers of delicious meat, beans, and rice.  \n\nReally amazing burrito and if you want a true mission style burrito without breaking your bank, this is your place to go.\n\n5/5", "rating": 5, "date": "2014-06-07"}, {"excerpts": ["My compadre had their Mojado  carne asada burrito which is the wet burrito, slathered in enchilada sauce and topped with sour cream ,salsa, guacamole. "], "author": "Kathy K.", "review": "WOW.\nI have rolled my overly stuffed little body into the office after having a \"Super Carne Asada\" burrito from Taqueria SF and not only am I sporting that post lunch coma, I'm also sporting a big sh*t eating grin as my lunch totally hit the spot.\nI know, a good burrito in the Mission is like Angelina Jolie's lips--obvious.\nBut, it had been a while since I've had juicy carne asada deliciousness pass through my lips (cue dirty joke)and this place fulfilled my desire.\n\nMy compadre had their Mojado  carne asada burrito which is the wet burrito, slathered in enchilada sauce and topped with sour cream ,salsa, guacamole. Since it was my first time, I decided to play it safe and stick to the dry version and both of us were very pleased with our choices.\n\nCheap lunch for 2 with large burritos, drinks and chips under $18.\n\nIt seems to be a favorite with the local SF General crowd, a good sign.", "rating": 4, "date": "2009-06-09"}, {"excerpts": ["It was also pretty dry and I got the mojado.\n\n"], "author": "Chili B.", "review": "Ok.\n\nThe chicken burrito is extremely salty. That's all I can really taste.It was also pretty dry and I got the mojado.\n\nYou get chips with your order - they are straight from a bag. Not good. The salsa is on the tables and is alright - there are two types one is a fresh pico de gallo and one is a hot sauce.", "rating": 3, "date": "2011-01-14"}, {"excerpts": ["I recommend their al pastor or grilled chicken burritos, and the burrito mojado which isn't something that can be ordered at the comparable burritos places surrounding it."], "author": "Erik V.", "review": "I live about 5 mins away from sf taqueria and come here often. Their burritos aren't mind blowing, but definitely one of the best in the city. What really makes this restaurant stand out though is their salsa, both the pico and guacamole based. I recommend their al pastor or grilled chicken burritos, and the burrito mojado which isn't something that can be ordered at the comparable burritos places surrounding it.", "rating": 4, "date": "2014-02-16"}, {"excerpts": ["The Yelp-geist says to go for El Pastor, and that's exactly what I did, though in my rush to order the works I forgot that \"mojado\" means wet.  ", "Oh well--all the more goop to scoop up with tortilla chips after the fork-n-knife phase.  ", "Diagnosis: delicious, and plenty enough for two.  ", "And I'm digging that papaya Agua Fresca--finally something that's subtly (rather than sickly) sweetened, for maximum refreshment."], "author": "Wes M.", "review": "Maria D gives it 5 stars, who am I to argue?\n\nWell ok, for 5 stars they need to have a little more (than zero) ambiance--right now it's just a plain white room (tip: you could totally work that into some sort of colonial-era Mission-esque chic if you got some dark, rustic wood rafters and tables--or you could just put up some murals like everyone else).  The Yelp-geist says to go for El Pastor, and that's exactly what I did, though in my rush to order the works I forgot that \"mojado\" means wet.  Oh well--all the more goop to scoop up with tortilla chips after the fork-n-knife phase.  Diagnosis: delicious, and plenty enough for two.  And I'm digging that papaya Agua Fresca--finally something that's subtly (rather than sickly) sweetened, for maximum refreshment.", "rating": 4, "date": "2009-01-28"}, {"excerpts": ["Mojado.  ", "The burrito mojado is a sight to behold.  ", "Nice presentation, good ingredient mix, lots of meat, and overflowing with cheese, guac, and sauce (no sour cream for me).  "], "author": "Steve K.", "review": "Mojado.  That's the short story of my five-star review.\n\nTaq. SF always delivers the goods, as long as those goods are burrito-esque; Maria D. is right on that the nachos are not the secret to their success.\n\nHits:\n\n1) Burritos range from large to extra-large.  I have never seen one that was less than above-average in size.\n\n2) Al pastor -- even though I have not been around when the spit is spinning, they have one.   They sometimes chop the meat a little too finely, but that's about the worst I can say about it.  It's got flavor.\n\n3) Pico - they only have one kind in a jar on each table, but it's a one-hit wonder.  I rarely eat more than a few of the factory-made chips at any taqueria, but the pico here is simple, well balanced, and vinegary enough to cut through some grease without being overpowering.\n\n4) The burrito mojado is a sight to behold.  Nice presentation, good ingredient mix, lots of meat, and overflowing with cheese, guac, and sauce (no sour cream for me).  The only thing that would make it better would be extra cheese placed inside the burrito (in addition to the abundant cheese on it) to hold the ingredients together a little more.\n\nNo misses.  The employees are courteous, the bathroom is reasonably clean, and the kitchen is in full view to assuage any concerns about cleanliness (the kitchen floor was a little dirty, but gravity works like that, and the counters were all good).", "rating": 5, "date": "2007-07-01"}, {"excerpts": ["Had a mojado burrito with al pastor and was not disappointed. ", "The burrito was huge and came doused with cheese, sour cream, onions, and a couple different sauces/salsas. ", "I made a point of finishing all 4 lbs of it and was very content. ", "The chips/salsa verde they provide are a nice little compliment to the meal. ", "They also serve a slew of Mexican beers which I thought was cool (no taquerias in my neighborhood - boston - that serve beers). ", "TVs with futbol playing non stop are another plus. "], "author": "Sean P.", "review": "Legit - nuff said.\n\nHad a mojado burrito with al pastor and was not disappointed. The burrito was huge and came doused with cheese, sour cream, onions, and a couple different sauces/salsas. I made a point of finishing all 4 lbs of it and was very content. The chips/salsa verde they provide are a nice little compliment to the meal. They also serve a slew of Mexican beers which I thought was cool (no taquerias in my neighborhood - boston - that serve beers). TVs with futbol playing non stop are another plus. I am not Mexican but the place seemed like a pretty authentic joint to me.\n\nso happy with my meal that I purchased a T-shirt to bring home with me", "rating": 5, "date": "2011-06-27"}, {"excerpts": ["I got the carne asado burrito \"mojado\" with their fiery hot green salsa, sour cream and red sauce on top. ", "Jesus it was freaking spicy! ", "Too much tortilla, not enough meat and in my book", ", that's b.s. "], "author": "Genevieve R.", "review": "Gotta agree with some of the negative yelp reviewers. Came here for some post-happy hour grub (I'm actually kinda drunk writing this) tonight based on a rec from my co-worker and it disappointed. I got the carne asado burrito \"mojado\" with their fiery hot green salsa, sour cream and red sauce on top. Jesus it was freaking spicy! Too much tortilla, not enough meat and in my book, that's b.s. My guy had the tamales dinner and he remarked the corn and meat were waaaay overcooked. We were full, but not satisfied. Doubt we'll be back--we're fans of La Corneta personally.", "rating": 2, "date": "2006-09-22"}], "mini": [], "tomato spinach or wheat wraps": [], "avocado or guacamole": [], "lettuce": [], "super shrimp or fish": [], "alambres": [{"excerpts": ["Eggs and chorizo, carne asada plate, alambres or their over the top super nachos! ", "Deeelicioouss!"], "author": "Denny C.", "review": "Im a bit biased as this was/is my family's go to burrito/plate restaurant for as long as I can remember but i still eat here on the reg and enjoy everything they have to offer! I have grown into a voracious eater of all kinds of foods but the oldschool plates still give me that homestyle fill! Eggs and chorizo, carne asada plate, alambres or their over the top super nachos! Deeelicioouss!", "rating": 5, "date": "2012-04-28"}], "tortas": []}