{"huevos con jamon breakfast": [], "huevos con chorizo breakfast": [], "huevos a la mexican breakfast": [], "homemade juice": [], "mexican soda": [{"excerpts": ["*\n- Jarritos Mango Flavored Mexican Soda*\n\n"], "author": "Bennett W.", "review": "Near North Beach / Telegraph Hill, Russian Hill and Chinatown?\nLooking for a restaurant to satisfy Mexican Cuisine Cravings?\nTaqueria Zorro is here for you!\n\nHere are some of the items I ordered today:\n- Veggie Taco with Cheese, Beans, Rice, Guacamole, Lettuce, Sour Cream & Sauce*\n- Jarritos Mango Flavored Mexican Soda*\n\n*My first taco at a taqueria. I've been ordering Burritos and Quesadillas from my previous taqueria visits. Today, I digged in to ordering a Taco.\n*I am absolutely addicted to these Mexican sodas for some reason. This is probably the fourth or fifth flavor I have tried.\n\n- Nice staff members,\n- Good food and service,\n- Clean spacious facility\n\nOverall, positive first time experience here. I enjoyed the veggie taco I had, it was delicious and I am so craving for another one while writing this review. Burritos, Nachos and Quesadillas are something I will try next time I come.\n\nParking: Street / Metered Spots\n\nPublic Transportation is of convenience and a smarter alternative.\n\nThis taqueria is among one of the dining establishments in the area open till 1 or 2 in the morning. Perfect spot for those late night cravings. Their hours of operation may have changed and it is printed right on the menu. So feel free to take a look at the menu posted on the door before walking in.", "rating": 4, "date": "2014-04-18"}], "toasted mexican sandwich": [], "meat taco salad": [], "prawn taco salad": [], "vegetarian taco salad": [], "zorro burrito": [{"excerpts": ["Came here looking for carne asada fries (Zorro Nachos) and my boyfriend ordered the Zorro burrito. ", "I didn't have any of the issues with ordering the way everyone else did and our food came out without problems. ", "The Zorro burrito was excellent with the fries being extra crispy inside. ", "The Zorro Nachos were perfection and just what I wanted. ", "I didn't expect them to be super crispy with all the toppings ", "but they did try their best. ", "My boyfriend remarked that it was probably the best he's had at Zorro's (he's been here many times) ", "so I don't know how consistent the food is in quality and the fries in crispiness based on his comment ", "but I hope it'll continue to be so ", "so I can come back for more!\n", "The restaurant overall is like any Taqueria and it isn't super clean or dirty. ", "It's extremely casual and doesn't have much going for it, but it's the food that's on point."], "author": "Jenn T.", "review": "Came here looking for carne asada fries (Zorro Nachos) and my boyfriend ordered the Zorro burrito. I didn't have any of the issues with ordering the way everyone else did and our food came out without problems. The Zorro burrito was excellent with the fries being extra crispy inside. The Zorro Nachos were perfection and just what I wanted. I didn't expect them to be super crispy with all the toppings but they did try their best. My boyfriend remarked that it was probably the best he's had at Zorro's (he's been here many times) so I don't know how consistent the food is in quality and the fries in crispiness based on his comment but I hope it'll continue to be so so I can come back for more!\nThe restaurant overall is like any Taqueria and it isn't super clean or dirty. It's extremely casual and doesn't have much going for it, but it's the food that's on point.", "rating": 4, "date": "2017-02-12"}, {"excerpts": ["You need to try their Zorro Burrito. ", "¡", "It has guacamole and french fries! ", "Definitely good food. ", ":)"], "author": "Brigitte S.", "review": "You need to try their Zorro Burrito. ¡It has guacamole and french fries! Definitely good food. :)", "rating": 5, "date": "2018-05-08"}, {"excerpts": ["We typically get the veggie burrito & zorro burrito w carnitas or chicken. ", "They fill it with a ton of good stuff (fries in the zorro) & the meat isn't dry. ", "It's a good size burrito so there are always leftovers. "], "author": "danielle a.", "review": "This is our go to drunk/hungover food. We typically get the veggie burrito & zorro burrito w carnitas or chicken. They fill it with a ton of good stuff (fries in the zorro) & the meat isn't dry. It's a good size burrito so there are always leftovers. Nachos are also good. \n\nThe food comes out pretty quick and they give you a side of chips and salsa lids to get salsa from their salsa bar. Love their late night hours !", "rating": 4, "date": "2017-01-21"}, {"excerpts": ["Had the Zorro burrito--packed with beef and it was both good and filling.  ", "Had the Zorro Burrito again and a Beef Quesadilla today.  ", "The quesadilla was good and hit the spot but for the money,  the Zorro Burrito is the best deal.  ", "This has become a go to place for me."], "author": "Jim I.", "review": "Had the Zorro burrito--packed with beef and it was both good and filling.  The complimentary chips & salsa was good, too.\n\nCan't wait to go back.\n\n12/2017 update\nBeen back here twice now.  Had the Zorro Burrito again and a Beef Quesadilla today.  The quesadilla was good and hit the spot but for the money,  the Zorro Burrito is the best deal.  This has become a go to place for me.", "rating": 4, "date": "2017-04-11"}, {"excerpts": ["The California burrito (aka zorro burrito) is always delicious. ", "I LOVE their salsas! ", "I'm simply addicted to the green and red salsa they make and consume it in very unreasonable quantities. ", "This place is always the good choice for a quick and yummy Mexican food."], "author": "Justyna M.", "review": "Everything I personally expect from a taqueria. The California burrito (aka zorro burrito) is always delicious. I LOVE their salsas! I'm simply addicted to the green and red salsa they make and consume it in very unreasonable quantities. This place is always the good choice for a quick and yummy Mexican food.", "rating": 5, "date": "2017-08-15"}, {"excerpts": ["This may have been mostly my fault and the cashier didn't hear me clearly or something, but our orders came out as the Zorro burrito instead of the nachos (fries). "], "author": "Shanise M.", "review": "Looks like the friend I came here with already rated this place with our experience! But here's mine -\n\nWe were craving carne asada fries and Taqueria Zorro popped up on Yelp. This may have been mostly my fault and the cashier didn't hear me clearly or something, but our orders came out as the Zorro burrito instead of the nachos (fries). Not a big issue, but we were both craving mostly just the fries part, just not wrapped up in a burrito. \n\nI lived in San Diego for a few years due to school, so I am very familiar - maybe too familiar - with California burritos and carne asada fries. I didn't have high expectations, but the burritos we had were surprisingly flavorful! It was so flavorful that it kinda threw me off - just didn't seem to pull the burrito together that well. I wish mine had more fries and for them to be more crispy/fresh, and less sour cream, but now I know what to expect. The size was decent and filled me up. My friend had a problem with his burrito because it was poorly wrapped. I kept mine wrapped up within the foil, so make sure you eat it that way if you're having wrapping problems.\n\nThere's water available near the salsa bar, however... there seemed to be really old limes laying at the bottom of the cooler as 'flavor'. I noticed right away but was thirsty. Mistake. Definitely tasted like old stale lime water... but I sucked it up and drank it all because water is water. :\\\n\nThe place was busy for a late Thursday night, so that was welcoming. Definitely one of the cheaper options in the neighborhood.", "rating": 4, "date": "2015-07-01"}, {"excerpts": ["It's called the Zorro burrito, but it's a California. ", "Instead of rice and beans, you get fries inside of your burrito, and of course you're going to choose some spicy, tender al pastor, which drips from its marination juices. ", "Not the biggest or cheapest burrito you'll ever get, but they close at 1am, and everything comes out super quickly, even the burritos. ", "It'll hit the spot for sure. ", "Don't be surprised. ", "Just because it's on Columbus, next to all the fancy Italian restaurants (and strip clubs), this place is still a hole in the wall. ", "The tables are crooked, the seats are dirty, and the salsa bar is hopping."], "author": "Danny C.", "review": "The chips aren't great, and the prices are a little steep, but they've got a bomb California burrito. It's called the Zorro burrito, but it's a California. Instead of rice and beans, you get fries inside of your burrito, and of course you're going to choose some spicy, tender al pastor, which drips from its marination juices. Not the biggest or cheapest burrito you'll ever get, but they close at 1am, and everything comes out super quickly, even the burritos. It'll hit the spot for sure. Don't be surprised. Just because it's on Columbus, next to all the fancy Italian restaurants (and strip clubs), this place is still a hole in the wall. The tables are crooked, the seats are dirty, and the salsa bar is hopping.", "rating": 3, "date": "2016-09-03"}, {"excerpts": ["Instead of zorro nachos, they gave us a zorro burrito which is totally different. ", "oh well, we were hungry, and the carne asada fries were essentially the inner body mass of the zorro burrito. ", "I opened mine and found mine to be not well wrapped. ", "This caused my burrito to fall all of its bits out and into the plate and from there I finished it with a fork. ", "Not exactly an ideal situation if you were to order a burrito. ", "The burrito itself wasn't that at all, just a little strong in flavor to my taste. "], "author": "Tito G.", "review": "I found this place to be an ok place to go to. Prices are not that bad comparing to the stores around it and the food was good. Here was my visit.\n\nWhen a friend of mine and I arrived there after the night event at The Exploratorium (totally should go there, it's a fun an interactive and serves drinks if you are 21+) we were craving for carne asada fries which they had it under the name of \"zorro nachos.\" When my friend ordered for us we later found out that the lady misheard her. Instead of zorro nachos, they gave us a zorro burrito which is totally different. I understand that human error can happen and we could've looked at the receipt to make sure that she put in the order correctly, but regardless, when you expect to get one thing and get another, you get a little disappointed (even then, the title of the food just read \"2 Carne Asada Zorro Bur\" which by glancing at it, you would think that your ordered is right). \n\nMy friend and I said oh well, we were hungry, and the carne asada fries were essentially the inner body mass of the zorro burrito. I opened mine and found mine to be not well wrapped. This caused my burrito to fall all of its bits out and into the plate and from there I finished it with a fork. Not exactly an ideal situation if you were to order a burrito. The burrito itself wasn't that at all, just a little strong in flavor to my taste. I feel that maybe they added a little too much onions on mine. \n\nOverall, I would give this place another shot to see what the Zorro chips are like and see what is the difference. If it impresses me, I'll come back. If not, I'll try find another place to eat that's near to the Exploratorium.", "rating": 3, "date": "2015-06-27"}, {"excerpts": ["Their Zorro burrito is ok ", "but if they didn't use really cheap frozen fries and instead used really good quality house cut crunchy fries it would be a burrito that would make history."], "author": "Brandon D.", "review": "Solid taqueria. Love their huevos con chorizo and the staff is usually pretty nice. Sometimes they offer Milanesa torta which is really good. Their Zorro burrito is ok but if they didn't use really cheap frozen fries and instead used really good quality house cut crunchy fries it would be a burrito that would make history.", "rating": 4, "date": "2015-09-04"}, {"excerpts": ["Their super nachos with bbq pork and refried beans with everything on it, and their special Zorro burrito."], "author": "Johnny N.", "review": "Two things you must try if you come here. Their super nachos with bbq pork and refried beans with everything on it, and their special Zorro burrito.", "rating": 4, "date": "2016-09-05"}, {"excerpts": ["The Zorro burrito: instead of rice and beans, french fries! "], "author": "Wanugee N.", "review": "This is where wahoo drunks from across the bridges and tunnels stumble into after hours for a carb load to soak up the booze. \n\nThe Zorro burrito: instead of rice and beans, french fries! Pretty good!\n\nThey have a rear room with more tables and a TV, and serve cold mini buckets of Corona on ice. \n\nThey have a lot more than burritos here, pretty much everything you would find at any decent Taqueria. \n\nIf you are going to eat a lot of beans, get your lap dance next door at L'Il Darlings beforehand, so you don't stink up her tiny outfit afterwards.", "rating": 3, "date": "2013-05-12"}, {"excerpts": ["I love the Zorro Burrito here. ", "Conveniently located on Broadway and Columbus. ", "The ladies on the cash counter looks serious with little or no smiles. ", "The place is not so clean either. ", "Cleanliness and Burrito joint don't go hand in hand", ", that's only my observation. ", "Anyway, the food is great and the Chef is great. ", "Don't know his name though."], "author": "Anand S.", "review": "I love the Zorro Burrito here. Conveniently located on Broadway and Columbus. The ladies on the cash counter looks serious with little or no smiles. The place is not so clean either. Cleanliness and Burrito joint don't go hand in hand, that's only my observation. Anyway, the food is great and the Chef is great. Don't know his name though.", "rating": 4, "date": "2016-09-19"}, {"excerpts": ["After drunkenly scrutinizing the menu, I found the Zorro burrito with fries, sour cream and guacamole in it=JACKPOT! ", "Next time you're drunk in North Beach, get the Zorro burrito. ", "You won't regret it. ", "Even if you wake up with salsa-stained sheets. ", ";)"], "author": "Steffi L.", "review": "A few weeks ago, I was out drinking with friends and we turned to a usual North Beach drunchie staple, Golden Boy's. But another friend ventured down the street to Taqueria Zorro where he got a burrito which had fries in it. Fast forward a week later=me, drunk in a taxi by myself, telling myself \"I will not drunk eat. I will not drunk eat.\" But the image of the burrito with fries popped into my head and I became convinced I must try it. So I told the taxi driver to instead stop along Columbus where I hopped out at Taqueria Zorro. \n\nAfter drunkenly scrutinizing the menu, I found the Zorro burrito with fries, sour cream and guacamole in it=JACKPOT! I carried the warm foil-wrapped goodie home, barely containing my excitement, got into my pajamas, turned off my lights and got in bed where I drunkenly consumed the burrito by the glow of my computer screen. \n\nIt. Was. Delicious. Soft fries wrapped in a burrito with delicious meat, sour cream and guacamole. What's not to love? The meat is a tad too salty, but the rest of it makes up for it. One of those foods you can't help but close your eyes with pleasure while eating. Best burrito I've ever had, hands down. I'm pretty sure I was emitting moans and sighs of pleasure. If my roommates had been home, they probably would've thought I was engaging in inappropriate activities. But well, some girls bring home boys. I bring home burritos. \n\nI'm pretty sure this new discovery will be pretty hazardous to my waistline, especially with it being just a 5 minute walk from my apartment, but I wouldn't have it any either way! Next time you're drunk in North Beach, get the Zorro burrito. You won't regret it. Even if you wake up with salsa-stained sheets. ;)", "rating": 5, "date": "2012-04-04"}, {"excerpts": ["I got the California Burrito which doesn't appear on the online menu but was directly under the Zorro Burrito on the menu. \n\n"], "author": "Stephen S.", "review": "I came here late at night with a friend after drinking (considering the restaurant's location near strip clubs and bars this is the number one way to enjoy it because it is open so late). I got the California Burrito which doesn't appear on the online menu but was directly under the Zorro Burrito on the menu. \n\nThe burrito was very saucy which I generally enjoy even though it makes quite a mess. It was decently priced and not small but not particularly large (in a world of mega-sized burritos). I have gone other times and gotten other things but that is the best they serve and it is very good.", "rating": 4, "date": "2011-11-28"}, {"excerpts": ["$six zorro burrito....", "avocado, sour cream, al pastor for meat selection y fries...", "all rolled up in a large flour tortilla and foil wrapped burrito...super large and duper filling...", "a burrito with no rice y ", "no beans...perfect for a deep socal burrito lover at heart....please note that zorro goes heavy duty on the sour cream...on the side next time...also note that zorro also offers a typical norcal bean, rice and vegetable useless filler filled mega-burritos..."], "author": "Hen A.", "review": "$six zorro burrito....avocado, sour cream, al pastor for meat selection y fries...all rolled up in a large flour tortilla and foil wrapped burrito...super large and duper filling...a burrito with no rice y no beans...perfect for a deep socal burrito lover at heart....please note that zorro goes heavy duty on the sour cream...on the side next time...also note that zorro also offers a typical norcal bean, rice and vegetable useless filler filled mega-burritos...", "rating": 4, "date": "2010-07-14"}, {"excerpts": ["Came here for the Zorro burrito after my brother raved about french fries. ", "To be honest, I think I would have preferred rice and beans - french fries tend to get a bit wet in a burrito, I've noticed, though that could partly be because we walked up to Chinatown before we finally sat down to eat. ", "Still, they gave me carnitas and shrimp in the SAME BURRITO, so how can I really complain? ", "Salsas are great, too."], "author": "Amanda P.", "review": "Came here for the Zorro burrito after my brother raved about french fries. To be honest, I think I would have preferred rice and beans - french fries tend to get a bit wet in a burrito, I've noticed, though that could partly be because we walked up to Chinatown before we finally sat down to eat. Still, they gave me carnitas and shrimp in the SAME BURRITO, so how can I really complain? Salsas are great, too.", "rating": 4, "date": "2012-10-23"}, {"excerpts": ["Chime Taqueria Zorro and their delicious Zorro burrito!  "], "author": "Jeff G.", "review": "I have found the third burrito.\n\nEverything good comes in threes right?  Or is that everything bad?  Either way...\n\nIt started with the Papalote Soyrizo Burrito.  Mmm, so tasty.\n\nNext was the Little Chihuahua tofu burrito.  The real great thing about the LC are their salsa choices.  I recommend Chipotle!\n\nBut enough about those guys, they're old hat!  Chime Taqueria Zorro and their delicious Zorro burrito!  Gaucamole, sour cream, french fries, and all the other fixin's you'd expect make a stellar burrito.\n\nOddly, chips are free with to-go orders but not dine-in.\n\nOpen late!  Cash only!  Awesome burritos!", "rating": 4, "date": "2010-07-22"}, {"excerpts": ["The Zorro burrito too..fries instead of beans? ", "Yes please! I could go on and on. ", "One more: their salsa!! ", "Only a few kinds, but I practically drink it ", "it's so good and fresh. ", "As is their spicy carrots. ", "Can't wait for tomorrow:) ", "It's a quick and casual place, but clean and gets the job done."], "author": "Misty M.", "review": "Love this place. Their spicy chicken tacos are amazing. I look forward to Tuesdays just to take advantage of their taco Tuesday deals! Also, their grilled fish is so good (when they have it). The Zorro burrito too..fries instead of beans? Yes please! I could go on and on. One more: their salsa!! Only a few kinds, but I practically drink it it's so good and fresh. As is their spicy carrots. Can't wait for tomorrow:) It's a quick and casual place, but clean and gets the job done.", "rating": 5, "date": "2013-05-06"}, {"excerpts": ["Zorro burrito is the bomb. ", "Love the fries replacement of the beans and very thin ( not doughy ) tortilla which makes the burrito much less heavy.  ", "Great for the price. ", "Def a try! ", "The place does need some renovating and it can be kept cleaner."], "author": "Carrie T.", "review": "Zorro burrito is the bomb. Love the fries replacement of the beans and very thin ( not doughy ) tortilla which makes the burrito much less heavy.  Great for the price. Def a try! The place does need some renovating and it can be kept cleaner.", "rating": 4, "date": "2013-03-06"}, {"excerpts": ["Zorro burrito is akin to a California burrito and quite good if you are not being health conscious."], "author": "Andrew H.", "review": "I usually get the burritos here and they are pretty damn good. I like the various specials that they offer throughout the week. Zorro burrito is akin to a California burrito and quite good if you are not being health conscious.", "rating": 4, "date": "2013-08-13"}, {"excerpts": ["Four stars just for the Zorro burrito. "], "author": "Michael T.", "review": "Four stars just for the Zorro burrito. It's that good. \n\nI've sampled some of their other offerings -- tacos on Taco Tuesday, for example -- and found them middling. But the Zorro...avocado and french fries in a burrito? Yes, please. It's a little heavy and a touch on the greasy side, but if this is a problem for you, you're probably barking up the wrong tree going to a taqueria. \n\nThe food is cheap and the service is prompt. Go for the Zorro, stay for an additional Zorro.", "rating": 4, "date": "2012-02-24"}, {"excerpts": ["I've came here a few times solely to get the Zorro Burrito/California Burrito/SoCal Burrito. \n\n"], "author": "Terry M.", "review": "I've came here a few times solely to get the Zorro Burrito/California Burrito/SoCal Burrito. \n\nI always come to dine-in and the TV is usually pretty loud but the taste of those french friends inside the burrito more than makes up for it. Overall the place is 3.5-4 stars and I'll round up for them.", "rating": 4, "date": "2010-12-21"}, {"excerpts": ["I got the zorro nachos this time and the zorro burrito last time....", "so freaking delicious I am beginning to get addicted. ", "Highly recommend this place! ", "It's super easy to walk to, great location!"], "author": "Jamie S.", "review": "OMG this place is amazing!!! I got the zorro nachos this time and the zorro burrito last time....so freaking delicious I am beginning to get addicted. Highly recommend this place! It's super easy to walk to, great location!", "rating": 5, "date": "2013-11-20"}, {"excerpts": ["Got the Zorro burrito, which is basically a California burrito - carne asada/avocado/salsa/sour cream/fries.  ", "It's simple, no cheese/rice/beans.  ", "Total came out to $3.50 w/ tax, which was the first plus.  ", "Second plus - holy jeebus ", "it was delicious.  ", "They didn't skimp on the meat and ", "it was probably the best sized rice/bean-less burrito ", "I've ever seen.  ", "Touch of the fries was just right, didn't mask anything, but still could appreciate the contrast from beans/rice.  ", "Overall as a joint though, this place is still hit or miss.  ", "It could be a lot better given their prices, but if you ever happen to stumble into this place, voluntarily or not, try the Zorro burrito."], "author": "Jeff S.", "review": "Made a visit here recently b/c of a Scoutmob promo.  Walking up, I realized that this is the very spot where I had eaten multiple times completely faded.  Never remember it being anything more than mediocre at best, which is an egregious sign considering how the food palate stoops to much lower standards when inebriated.  The stars aligned and allowed me to return again, this time totally sober.  Got the Zorro burrito, which is basically a California burrito - carne asada/avocado/salsa/sour cream/fries.  It's simple, no cheese/rice/beans.  Total came out to $3.50 w/ tax, which was the first plus.  Second plus - holy jeebus it was delicious.  They didn't skimp on the meat and it was probably the best sized rice/bean-less burrito I've ever seen.  Touch of the fries was just right, didn't mask anything, but still could appreciate the contrast from beans/rice.  Overall as a joint though, this place is still hit or miss.  It could be a lot better given their prices, but if you ever happen to stumble into this place, voluntarily or not, try the Zorro burrito.", "rating": 3, "date": "2013-02-21"}, {"excerpts": ["I tried a Zorro Burrito and it was pretty good, but way too expensive.  ", "I used Scoutmob and would not go back here and pay full price for that burrito.  ", "I'd rather make my own fries and stick it in a burrito from another place, even Gordo, which I'm not that fond of.  ", "I would have loved to wash that burrito down with some horchata, but they were all out.  ", "The front of the place was drafty and the back was hella loud because there was a jukebox blasting music.  ", "I'm not that old, but it was even too loud for me."], "author": "k h.", "review": "I'm giving this place three stars.  I tried a Zorro Burrito and it was pretty good, but way too expensive.  I used Scoutmob and would not go back here and pay full price for that burrito.  I'd rather make my own fries and stick it in a burrito from another place, even Gordo, which I'm not that fond of.  I would have loved to wash that burrito down with some horchata, but they were all out.  The front of the place was drafty and the back was hella loud because there was a jukebox blasting music.  I'm not that old, but it was even too loud for me.", "rating": 3, "date": "2012-07-18"}, {"excerpts": ["their food is amazing..and at good price....zorro burrito all the way"], "author": "Amanda A.", "review": "their food is amazing..and at good price....zorro burrito all the way", "rating": 5, "date": "2013-09-25"}, {"excerpts": ["Zorro Burrito (with fries in it, soaking up all the delicious heart-stopping juices) was so good. ", "The guacamole was terrible, not worth dipping chips in."], "author": "Kyle S.", "review": "Zorro Burrito (with fries in it, soaking up all the delicious heart-stopping juices) was so good. The guacamole was terrible, not worth dipping chips in.", "rating": 4, "date": "2011-09-24"}], "veggie burrito": [{"excerpts": ["I got the veggie burrito (wasn't discounted even when all other burritos are cheaper). ", "It was kind of cold and wet. ", "The veggies in it seemed like frozen veggies (peas, corn). ", "There was basically no flavor ", "and I wasn't crazy about their salsas either. "], "author": "Hayley D.", "review": "Came here for lunch on a Wednesday. They had a burrito deal (all burritos $7.99)\n\nFood: I got the veggie burrito (wasn't discounted even when all other burritos are cheaper). It was kind of cold and wet. The veggies in it seemed like frozen veggies (peas, corn). There was basically no flavor and I wasn't crazy about their salsas either. I also got the mango juice which was way too sweet and tasted funky.\n\nService: No complaints on the service. Ordered and got the food within 10 minutes.\n\nAmbiance: Seems a little run down but has cute Mexican theme decor. Plenty of tables that can easily be moved to make bigger tables. \n\nOverall won't be back. -_-", "rating": 2, "date": "2017-03-15"}, {"excerpts": ["almost felt like I was just eating a veggie burrito. \n\n"], "author": "Bryan B.", "review": "The one time I go with my gut to give this place a try beside the reviews it has received. As previous reviews have stated \"mediocre\" burrito that just filled you up. The meat didn't have any flavor at all-- almost felt like I was just eating a veggie burrito. \n\nDon't come here--", "rating": 3, "date": "2017-11-27"}, {"excerpts": ["We typically get the veggie burrito & zorro burrito w carnitas or chicken. ", "They fill it with a ton of good stuff (fries in the zorro) & the meat isn't dry. ", "It's a good size burrito so there are always leftovers. "], "author": "danielle a.", "review": "This is our go to drunk/hungover food. We typically get the veggie burrito & zorro burrito w carnitas or chicken. They fill it with a ton of good stuff (fries in the zorro) & the meat isn't dry. It's a good size burrito so there are always leftovers. Nachos are also good. \n\nThe food comes out pretty quick and they give you a side of chips and salsa lids to get salsa from their salsa bar. Love their late night hours !", "rating": 4, "date": "2017-01-21"}, {"excerpts": ["Got a veggie burrito with extra picco de gallo. ", "I would say I didn't get any extra and was disappointed in the amount of veggies in my veggie burrito. ", "Not enough lettuce. ", "The rice was bland but everything else had a good smokey flavor to it.  ", "i wouldn't mind having it again."], "author": "Katie B.", "review": "Pretty yummy. Got a veggie burrito with extra picco de gallo. I would say I didn't get any extra and was disappointed in the amount of veggies in my veggie burrito. Not enough lettuce. The rice was bland but everything else had a good smokey flavor to it.  i wouldn't mind having it again.", "rating": 3, "date": "2015-02-09"}, {"excerpts": ["I had a few tacos and my girlfriend had a veggie burrito.  ", "Everything was actually pretty tasty!  "], "author": "John G.", "review": "I stopped here for a quick lunch. A few tacos and we'd be on our way.  I had a few tacos and my girlfriend had a veggie burrito.  Everything was actually pretty tasty!  The salsa selection was good and the ingredients were all fresh and well proportioned.  \n\nThis isn't high dining but it is really good, fast food.  Recommended if you're in the area and want to stop in and have a quick bite to eat.\n\nThe staff was very nice and the place was generally clean and pleasant.", "rating": 3, "date": "2014-12-15"}, {"excerpts": ["Not the best place for a veggie burrito.  ", "Small and expensive.  "], "author": "Bucky W.", "review": "Not the best place for a veggie burrito.  Small and expensive.  Better off waiting till you get to the Mission.\n\nBurritos are roughly $7.   \n\nThe salsa is good though.", "rating": 2, "date": "2012-09-21"}, {"excerpts": ["Got the veggie burrito. ", "Tortilla was cold (I like mine warm), and there was more lettuce than beans/cheese/rice. ", "I guess that's why it's \"veggie,\" but all the good stuff (beans/cheese/rice) were in smaller quantities. ", "Flavour was sort of lacking... because of all the lettuce, it tasted more watery and not savoury. ", "Not great for the price ($7 or so)."], "author": "Dan Y.", "review": "Got the veggie burrito. Tortilla was cold (I like mine warm), and there was more lettuce than beans/cheese/rice. I guess that's why it's \"veggie,\" but all the good stuff (beans/cheese/rice) were in smaller quantities. Flavour was sort of lacking... because of all the lettuce, it tasted more watery and not savoury. Not great for the price ($7 or so).", "rating": 2, "date": "2014-04-28"}, {"excerpts": ["I was surprised to find a decent veggie burrito joint here next to all the strip clubs...", "but I guess it makes sense. \n", "It was big, it was tasty and it was cheap.\n", "All you could want in a burrito.\n", "I am satisfied."], "author": "Kelley D.", "review": "I was surprised to find a decent veggie burrito joint here next to all the strip clubs...but I guess it makes sense. \nIt was big, it was tasty and it was cheap.\nAll you could want in a burrito.\nI am satisfied.", "rating": 4, "date": "2009-11-04"}, {"excerpts": ["I love their grillled veggie burrito, it's superb.  ", "My favorite burrito in the city.  ", "Salsa bar is also fantastic.  ", "However, the bathroom is gnarly."], "author": "Keegan R.", "review": "I love their grillled veggie burrito, it's superb.  My favorite burrito in the city.  Salsa bar is also fantastic.  However, the bathroom is gnarly.", "rating": 3, "date": "2013-02-10"}, {"excerpts": ["grilled veggie burrito was about $6, although I could have purchased a simpler one for $5 something...not too shabby at all. \n", "--I brought my own water and didn't feel tacky for drinking it there. "], "author": "Beth F.", "review": "I was on one of my North Beach jaunts, walking along past the girlie clubs and wondering if I could find something food-related rather than sex-related nearby. When I headed a bit further, I spotted Tacqueria Zorro on my right and headed over there. (How could I not try a Mexican food place in North Beach? The randomness just made it the perfect choice). \n\n  In any case, the pluses:\n\n--It was pleasantly quiet, a refuge from the construction outside, and seemingly tourist free\n--My grilled veggie burrito was about $6, although I could have purchased a simpler one for $5 something...not too shabby at all. \n--I brought my own water and didn't feel tacky for drinking it there. Thanks, Zorro's!\n\nAnd the minuses:\n\n--The burrito was delish, but nsomewhat heavy. If I'd had a way of transporting it home, I would have done so. I'd recommend splitting it with a friend.\n\nOtherwise, good times, really--I felt completely refreshed after going there.", "rating": 4, "date": "2008-08-24"}, {"excerpts": ["I had a super veggie burrito ", "and I got the spicy salsa... ", "WOW! ", "The salsa was probably the best part, it had this smoky flavor that I REALLY enjoyed... "], "author": "P A U L.", "review": "DAAAAAAMN THESE BURRITOS ARE SO FRESH! SNAP!\n\nSeriously though, it was pretty good... I had a super veggie burrito and I got the spicy salsa... WOW! The salsa was probably the best part, it had this smoky flavor that I REALLY enjoyed... I wondered if maybe they use MSG, because this shit was unnaturally tasty.\n\nOkay, and now the bad... After finishing off a little over half of my burrito, I found a thick, black hair interwoven with the lettuce. It turned my stomach, but being poor has taught me to see past things like this, so I picked it out and kept eating... Ugh.\n\nThis place is open late and about 4 blocks from where I live, so I'll definitely be eating here again...", "rating": 3, "date": "2007-08-12"}, {"excerpts": ["I can always tell how good a taqueria is by tasting their basics: a super veggie burrito. "], "author": "Kristina C.", "review": "SF Food Inspection Score: 90\n\nThank goodness that place got above an 80. I didn't get a shrimp burrito because I thought it had a low score...\n\nWhat a pleasant surprise! \n\nI can always tell how good a taqueria is by tasting their basics: a super veggie burrito. It was nice and wet, lots of good flavas, and inexpensive.\n\nThough no burrito will compare to Ocean Taqueria, this place satisfied my hunger after a long day a work and a long night at the clubs. \n\nThe next time I'm on Broadway and I am not craving Chinese food, I'll come back and try their tostadas!", "rating": 4, "date": "2008-08-26"}, {"excerpts": ["I'm partial to the Super Veggie Burrito, but don't let me limit you."], "author": "Kelly C.", "review": "Great cheap Mexican food open where you need it (North Beach) when you need it desperately (until 3am). I lived in San Diego for 6 years, and these burritos are comparable to the ones there. I'm partial to the Super Veggie Burrito, but don't let me limit you.", "rating": 5, "date": "2008-11-22"}, {"excerpts": ["El Zorro has a really yummy grilled veggie burrito. ", "It's stuffed with freshly grilled veggies, rice and salsa. ", "It's so filling. ", "They give you fresh chips and have a really good salsa bar too. ", "But peeps, it's definitely a no frills taqueria. ", "Think a little bit'o Mission in the heart of North Beach! ", "They are always really friendly, inexpensive, delicious and fast. ", ":) ", "Oh and it's cash only."], "author": "Christy L.", "review": "Yay! I'm a fan! El Zorro has a really yummy grilled veggie burrito. It's stuffed with freshly grilled veggies, rice and salsa. It's so filling. They give you fresh chips and have a really good salsa bar too. But peeps, it's definitely a no frills taqueria. Think a little bit'o Mission in the heart of North Beach! They are always really friendly, inexpensive, delicious and fast. :) Oh and it's cash only.", "rating": 4, "date": "2008-07-12"}, {"excerpts": ["Good Mexican food, their veggie burrito is a good choice when your feeling a little guilty about calories and their tortas look pretty good too. ", "Good salsa bar as well!!!"], "author": "Shirley E.", "review": "Finding good Mexican food by my job is hard. I'm near Chinatown and the financial  district so Chinese food and American food is easier to find. My bosses and co-worker were getting burritos from here one day and asked if I wanted one. I hesitated thinking the place might be Rubios or Green Salsa but I asked for a burrito and I was not disappointed. Good Mexican food, their veggie burrito is a good choice when your feeling a little guilty about calories and their tortas look pretty good too. Good salsa bar as well!!!", "rating": 4, "date": "2008-11-20"}], "grilled vegetables burrito": [], "regular burrito bowl": [], "zorro burrito bowl": [], "super burrito bowl": [], "fish burrito bowl": [], "prawn burrito bowl": [], "mojado burrito bowl": [], "veggie burrito bowl": [], "chile relleno burrito bowl": [], "grilled vegetables burrito bowl": [], "regular quesadilla": [], "prawn quesadilla": [], "zorro nacho": [], "super nacho": [{"excerpts": ["We also got the super nacho which was good. ", "The portions are huge so between the two of us we could have just ordered one or the other. ", "We will definitely be making trips into SF to get a quesadilla here often!"], "author": "Megan W.", "review": "Oh my WOW! The super quesadilla was absolutely amazing. The green salsa is also a must. We also got the super nacho which was good. The portions are huge so between the two of us we could have just ordered one or the other. We will definitely be making trips into SF to get a quesadilla here often!", "rating": 5, "date": "2017-11-19"}], "cebollitas": [], "basket of fries": []}