{"eggs and ham": [], "eggs and sausage": [], "huevos rancheros": [], "caldo de res": [{"excerpts": ["We went on a Saturday and the Caldo de Res (Beef soup) was really good full of flavor and they accommodated my request of ordering just half a bowl. ", "We also ordered the carnitas burrito which the meat was really good but the rest of the fixings where lacking taste. ", "Regardless it was really big, something to just share between two people for sure. ", "Highly recommend this place, much easier to order and less hassle than Taqueria. ", "Also the dinning area accommodates a bigger group with plenty of room to sit and enjoy your meal."], "author": "Frank C.", "review": "This place meets all expectations. The food was really good. We went on a Saturday and the Caldo de Res (Beef soup) was really good full of flavor and they accommodated my request of ordering just half a bowl. We also ordered the carnitas burrito which the meat was really good but the rest of the fixings where lacking taste. Regardless it was really big, something to just share between two people for sure. Highly recommend this place, much easier to order and less hassle than Taqueria. Also the dinning area accommodates a bigger group with plenty of room to sit and enjoy your meal.", "rating": 4, "date": "2015-03-08"}], "birria": [{"excerpts": ["The menudo is suitably spicy and the birria is through the roof.\n", "Foodie heaven. ", "But kept real. ", "Find out yourself. ", "This is it."], "author": "Bob R.", "review": "Best street taco joint in town. The carne asada is juicy and chock full of flavor.\nThr ultimate meal here is frijoles and rice and ensalada and al pastor tacos\nJalapeno pepper radishes spicy salsa verde grilled mexican green onions lime quarters and an icy tamarindo melon or\norchata and or pollo asada or carnitas on a plato with all of the above. No other tacqueria in the mission comes close to their al pastor. The menudo is suitably spicy and the birria is through the roof.\nFoodie heaven. But kept real. Find out yourself. This is it.", "rating": 4, "date": "2016-06-24"}, {"excerpts": ["They have menudo and birria on the weekends super yum. ", "A lot of choices and al pastor on trompo! ", "Definitely as much as I can"], "author": "Montserrat S.", "review": "Recently discovered this place and I was not disappointed. They have menudo and birria on the weekends super yum. A lot of choices and al pastor on trompo! Definitely as much as I can", "rating": 5, "date": "2016-09-02"}], "menudo": [{"excerpts": ["Menudo average. ", "Get number on your receipt and the server will bring to you."], "author": "Clifford W.", "review": "Ate here for cinco de mayo. Too crowded and tables packed after lunch about 130pm. Tacos not good today. Menudo average. Get number on your receipt and the server will bring to you.", "rating": 3, "date": "2018-05-05"}, {"excerpts": ["I am giving this restaurant a 5 stars because the menudo was so tasty and one of the best menudos I've ever had, service was also great and to my surprise the prices were reasonable, I also ordered 2steak tacos and the meat was tender and plentiful"], "author": "Paul n.", "review": "I am giving this restaurant a 5 stars because the menudo was so tasty and one of the best menudos I've ever had, service was also great and to my surprise the prices were reasonable, I also ordered 2steak tacos and the meat was tender and plentiful", "rating": 5, "date": "2018-07-29"}, {"excerpts": ["The menudo is suitably spicy and the birria is through the roof.\n", "Foodie heaven. ", "But kept real. ", "Find out yourself. ", "This is it."], "author": "Bob R.", "review": "Best street taco joint in town. The carne asada is juicy and chock full of flavor.\nThr ultimate meal here is frijoles and rice and ensalada and al pastor tacos\nJalapeno pepper radishes spicy salsa verde grilled mexican green onions lime quarters and an icy tamarindo melon or\norchata and or pollo asada or carnitas on a plato with all of the above. No other tacqueria in the mission comes close to their al pastor. The menudo is suitably spicy and the birria is through the roof.\nFoodie heaven. But kept real. Find out yourself. This is it.", "rating": 4, "date": "2016-06-24"}, {"excerpts": ["They have menudo and birria on the weekends super yum. ", "A lot of choices and al pastor on trompo! ", "Definitely as much as I can"], "author": "Montserrat S.", "review": "Recently discovered this place and I was not disappointed. They have menudo and birria on the weekends super yum. A lot of choices and al pastor on trompo! Definitely as much as I can", "rating": 5, "date": "2016-09-02"}], "super special plate": [], "super nachos": [{"excerpts": ["My wife had a veggie super burrito, and we split an order of carnitas super nachos.  ", "An excellent combination of foods that we somehow managed to eat all of.  ", "I was drawn to this place because they have a visible al pastor spit.  "], "author": "Delaware F.", "review": "Excellent!  I had 4 tacos (lengua, cabeza, al pastor, and carne asada.  My wife had a veggie super burrito, and we split an order of carnitas super nachos.  An excellent combination of foods that we somehow managed to eat all of.  I was drawn to this place because they have a visible al pastor spit.  Many of the Bay Area mexican spots purport to serve al pastor pork but don't seem to use the whole spit technique.  \n\nAll 4 tacos were great.  Three days earlier I'd eaten a lengua burrito at el farolito, and I'm not sure I could say one was definitively better.  But this one was quite tasty, and it certainly wasn't worse than farolito.  The cabeza was my favorite, very tender and delicate.  The al pastor was good too, although it seemed like it may have had an added sauce, which may have been a bit overpowering.  \n\nThe carnitas nachos were also good.  I would get the same combo again. \n\nThe place was not crowded at 6:30 on the Tuesday after Christmas.  A very change from throwing elbows at farolito.", "rating": 5, "date": "2017-12-26"}, {"excerpts": ["Taqueria San Jose came highly recommended for burritos, but I was jonesing for some super nachos last weekend when I was done hanging around the library, so ", "I thought I'd give it the old college try. ", "Well folks, if you get that same feeling, I'm ", "guna recommend you save your $11.50 for literally anything else. ", "The nachos were a huge let down. ", "The ingredients weren't good: carne asada was unseasoned and gristly, the beans, guac, and sour cream were used very sparingly, the chips were stale, and they threw on a couple shreds of iceberg lettuce to finish it off. "], "author": "Crystal C.", "review": "Nachos are one of my favorite foods. It's actually not difficult to please me when it comes to nachos either. Chips, beans, cheese, meat, guac, sour cream, pico de gallo, jalepenos. Done. \n\nTaqueria San Jose came highly recommended for burritos, but I was jonesing for some super nachos last weekend when I was done hanging around the library, so I thought I'd give it the old college try. Well folks, if you get that same feeling, I'm guna recommend you save your $11.50 for literally anything else. The nachos were a huge let down. The ingredients weren't good: carne asada was unseasoned and gristly, the beans, guac, and sour cream were used very sparingly, the chips were stale, and they threw on a couple shreds of iceberg lettuce to finish it off. This was nachos gone all wrong. \n\nThankfully my mama taught me to be creative with my food, so rather than toss them, I spruced these bad boys up at home, tossed them in the oven, added some cheese, cilantro, and fresh jalepenos, and viola! Edible nachos. But at the end of the day, when one spends almost $12 on a meal, they want it to taste good without having to go home and make it into something way better. This was a miss for me.", "rating": 2, "date": "2015-11-07"}, {"excerpts": ["The $12 super nachos are a key example. ", "Really nice staff, but unfortunately they're not edible."], "author": "Matt T.", "review": "Pretty overpriced for some basic ass food. The $12 super nachos are a key example. Really nice staff, but unfortunately they're not edible.", "rating": 2, "date": "2017-06-11"}, {"excerpts": ["We both shared the Super Nachos ($11) which adds guacamole, sour cream, and cheese onto the regular nachos. ", "Everything tasted mushed together, but we were craving Mexican food so it was still very satisfying. ", "In fact, for some reason it made me crave Taco Bell. ", "Anyways, there is plenty of seating here, so you don't have to worry about taking your food to-go on most occasions. ", "Props that they accept credit cards with no minimum and were open on NYE when nowhere else was."], "author": "Stefanie C.", "review": "My friend and I were frantically hunting for Mexican food on New Years Eve around our usual places at 24th/Mission. You know what cravings I'm talking about. Everything near the BART station was pretty much closed except for Taqueria San Jose. SCORE!!\n\nWe both shared the Super Nachos ($11) which adds guacamole, sour cream, and cheese onto the regular nachos. Everything tasted mushed together, but we were craving Mexican food so it was still very satisfying. In fact, for some reason it made me crave Taco Bell. Anyways, there is plenty of seating here, so you don't have to worry about taking your food to-go on most occasions. Props that they accept credit cards with no minimum and were open on NYE when nowhere else was.", "rating": 3, "date": "2015-01-04"}, {"excerpts": ["We shared an order of Super Nachos and it was decent, but ain't got nothing on El Farolitos. ", "They were generous with the amount of meat though and their pico was better. ", "The nachos themselves were mushed up but it was a great way to satisfy my cravings. ", "Props to being open on NYE!"], "author": "Winnie T.", "review": "New Year's Eve and the craving for Mexican food was strong. My friend and I walked around for so long trying to find a place that was open. We were both so excited when we finally saw the open doors at this place. \n\nWe shared an order of Super Nachos and it was decent, but ain't got nothing on El Farolitos. They were generous with the amount of meat though and their pico was better. The nachos themselves were mushed up but it was a great way to satisfy my cravings. Props to being open on NYE!", "rating": 3, "date": "2015-02-04"}, {"excerpts": ["A good example is that Nachos are $7.50 but Super Nachos are $12. ", "What kind of meat cost an extra $4.50 to add?? ", "Just another business trying to prosper on stupid white people that insist on hanging out on the mission. ", "FML..."], "author": "Santana T.", "review": "This place is the perfect example of a business based on fleecing the guest. Your a Mexican restaurant but you charge for chips and salsa, limes and even ice in your complimentary water. No salsa bar so you have to ask for it which is an extra charge. A good example is that Nachos are $7.50 but Super Nachos are $12. What kind of meat cost an extra $4.50 to add?? Just another business trying to prosper on stupid white people that insist on hanging out on the mission. FML...", "rating": 1, "date": "2016-06-30"}, {"excerpts": ["The chorizo in the super tacos was depressing and the only hearty topping on the super nachos was sticky malaise.\n\n"], "author": "Corbin C.", "review": "Visually appealing, with large, colorful murals of San Jose, but lacking yum yum.\n\nThe chorizo in the super tacos was depressing and the only hearty topping on the super nachos was sticky malaise.\n\nPlus, every menu item is about a buck or two more expensive than other Mexican joints in the area.\n\nI feel so empty.", "rating": 3, "date": "2011-02-21"}], "vegetarian nachos": [], "pieces enchiladas platillo": [], "carnitas roast pork platillo": [], "chile relleno flame roasted pepper platillo": [], "carne asada grilled steak platillo": [], "mojarrita fish platillo": [], "tilapia fish platillo": [], "fajita combination platillo": [], "pieces tacos dorados platillo": [], "pollo adobo grilled chicken platillo": [], "flour quesadilla": [], "suiza quesadilla": [], "tacos with cheese": [{"excerpts": ["I ordered 3 carne asada tacos with cheese and guacamole, and they were both great. ", "Not taco truck great, not ", "La Taqueria great, but \"it's 11pm ", "and I'm glad I'm eating these tacos instead of gnawing my fucking arm off from hunger\" great. "], "author": "Alexis C.", "review": "Looking to change things up a bit, my girlfriend and I decided to try a \"new\" (the last time I ate at Taqueria San Jose was when The Fugees were on tour with the Roots, which was a long time ago, as in 1996) taqueria in the Mission. Our choices: Taqueria Cancun (the one between 18th and 19th) and Taqueria San Jose. Since I didn't feel like driving through a goddamn hurricane for tacos, we settled on the one that is closest to my house.\n\nI hadn't been back to my stomping grounds for a while (Luna Park definitely does not count), and I quickly saw that it was the same as I had left it. There were roughly 5 or 6 police cars all over this stretch of Mission street, sirens blaring and a mass of cops walking around like one of them had lost their keys. As we crossed the street in the rain, we passed by two police offers, who quickly ran down the situation:\n\nCop 1: \"So we still don't have a victim?\"\nCop 2: \"That's right, Lieutenant.\"\n\nNothing like tacos and random gunfire to welcome you home.\n\nTaqueria San Jose, as you might of guessed, is a 3-star taqueria that doesn't really have anything to write home (or on Yelp) about. The food is a bit greasy, the salsa at the salsa bar is not fresh, and the place is cold as shit. However, sometimes you kind of want that, or dare I say need that. I ordered 3 carne asada tacos with cheese and guacamole, and they were both great. Not taco truck great, not La Taqueria great, but \"it's 11pm and I'm glad I'm eating these tacos instead of gnawing my fucking arm off from hunger\" great. And that's all you can really ask for.\n\nWith so many taquerias in the area, why chose Taqueria San Jose over any other taqueria? Well, if it's 1:30 AM and you want to a) eat your food sometime within the next hour, and b) avoid the drunk jackass scenesters at El Farolito, this place is just across the street.", "rating": 3, "date": "2008-01-29"}], "tacos with guacamole": [], "tacos with sour cream": [], "vegetarian tacos": [{"excerpts": ["Either way, the vegetarian tacos were hitting the spot!!\n\n"], "author": "Joshua C.", "review": "It could have been the post NYE drunkeness or that the food was really good. I can't remember. Either way, the vegetarian tacos were hitting the spot!!\n\nI wouldn't come all the way out here to try their food again, but if I was in the area and drunk, I might grab some tacos.\n\nMy only concern was the dead roach on the wall next to the table I was sitting. If I weren't drunk and busy stuffing tacos down my throat, I might have thought twice about eating there. My BF's response when I told him about the roach: \"Well, it is the Mission.\" Touché.", "rating": 3, "date": "2011-01-04"}], "super tacos": [{"excerpts": ["Their super tacos are delicious and they load them up heavily with all of the goodies. ", "That sour cream, though! ", "They give you SO much of it! ", "Never a dull moment with Taqueria San Jose. ", "Some people swear by their al pastor, but I love their chicken tacos. ", "An excellent choice for delicious super tacos in the Mission!"], "author": "Shayla B.", "review": "While everyone else on Mission street is running to El Farolito at 2 am, I come here. Never understood the hype around El Farolito anyways, but Taqueria San Jose can get it all day, everyday!\n\nTACOS! Get 'em! And super size them bad boys up if you really know how to get down. Their super tacos are delicious and they load them up heavily with all of the goodies. That sour cream, though! They give you SO much of it! Never a dull moment with Taqueria San Jose. Some people swear by their al pastor, but I love their chicken tacos. Call me boring, but that ish is so good. \n\nI love their salsa, especially their pico de gallo. Even at 2 am, they always seem to have the salsa bar stacked. Yes it gets crowded on the weekends, but not nearly as bad as El Farolito. The guys behind the counter work really hard and they are always super friendly! They'll remember you when you come in often, all the way down to what you like to order and how you like to prepared. \n\nThey keep it CLEAN! Hallelujah! Nothing is worse than coming from a party and then seeing all of the trash thrown around a restaurant from all of the lazy drunks nearby. They really try their best to keep it clean. I love that they're open until 3 am for all of the fat asses like myself that need a \"beyond midnight snack\" while out late in the city. It's on 24th and Mission, so super close to bart as well. \n\nIt's a hole in the wall, but the food is good and much better quality than many of the other Taquerias on the block. Because of this, they are priced a bit higher but trust me: for the portions, taste, and quality, it's worth it. An excellent choice for delicious super tacos in the Mission!", "rating": 4, "date": "2018-09-10"}, {"excerpts": ["I don't really care for their super tacos just because if you want a super taco, you may as well just get a burrito.  ", "But if you get their regular taco and throw some of their homemade pickled veggies and the green sauce on their... ", "Nom Nom Nom!"], "author": "Andrina H.", "review": "This place is bomb!  I don't really care for their super tacos just because if you want a super taco, you may as well just get a burrito.  But if you get their regular taco and throw some of their homemade pickled veggies and the green sauce on their... Nom Nom Nom!", "rating": 5, "date": "2018-10-25"}, {"excerpts": ["We had the super tacos con carne Asada.  ", "Really Spicy too.  ", "Yummy.  ", "The employees were very sweet and accommodating.   ", "Would definitely come back if in SF area."], "author": "Shelby F.", "review": "Really good authentic Mexican comida!  They also have delicious sweet agua frescas.   Watermelon was delicious!  We had the super tacos con carne Asada.  Really Spicy too.  Yummy.  The employees were very sweet and accommodating.   Would definitely come back if in SF area.", "rating": 5, "date": "2018-08-18"}, {"excerpts": ["The super tacos are so big, I like to use chips and treat it like nachos until it gets down to something I can handle. "], "author": "Rebekah T.", "review": "This is my Go-To Taco spot when I'm at 24th and Mission. Sure , there are a lot of places to go in the Mission, but if I'm headed home from Bart - you better believe that I'll be stopping off for a Super Taco. \n\nThe super tacos are so big, I like to use chips and treat it like nachos until it gets down to something I can handle. I usually just order one, not because I'm a cheap date, but because they are huge. \n\nYes you have to pay for chips now, but in these economic times ~ $1.50 for a huge order of chips is not going to break the bank. Get over it. I overheard this guy complaining about it, saying he was going back to Noe Valley where the chips are free. I laughed my a** off, Taco + Chips + Salsa + Free Comedy for under $6.00.", "rating": 4, "date": "2011-01-06"}, {"excerpts": ["Super tacos and burrito plates, you cannot go wrong"], "author": "andy s.", "review": "I love these guys. I will definitely go out on a limb and say that their quality of ingredients, service, and overall care beats El Farolito TEN FOLD.  Being that I work near by, 7 days a week, I feel that I am a fairly good judge. Don't believe the hype. San Jose all the way. Super tacos and burrito plates, you cannot go wrong", "rating": 4, "date": "2014-11-05"}, {"excerpts": ["The chorizo in the super tacos was depressing and the only hearty topping on the super nachos was sticky malaise.\n\n"], "author": "Corbin C.", "review": "Visually appealing, with large, colorful murals of San Jose, but lacking yum yum.\n\nThe chorizo in the super tacos was depressing and the only hearty topping on the super nachos was sticky malaise.\n\nPlus, every menu item is about a buck or two more expensive than other Mexican joints in the area.\n\nI feel so empty.", "rating": 3, "date": "2011-02-21"}, {"excerpts": ["What's practically unique about Taqueria San Jose's super tacos is what's included -- one of these is a meal in itself. ", "It starts with two soft corn tortillas. ", "Meat (of your choice), cheese, beans, rice, guacamole, sour cream, and salsa are layered on top (there's also a salsa bar, so you can add your own). ", "It's kind of like an open-faced burrito, but better because you can mix everything together, so every bite is enriched with guacamole, sour cream, and salsa! ", "There are separate bathrooms for men and women, and they're clean and modern."], "author": "Karen M.", "review": "Taqueria San Jose has delicious, reasonably priced food. The restaurant was recently renovated, and the newly colorful walls enhance the attractive murals. On our numerous visits for lunch and dinner, the service has always been extremely fast, even when we've been there with a group. My husband's all-time favorite is their huge al pastor super burrito. Mine is the carne asada super taco. What's practically unique about Taqueria San Jose's super tacos is what's included -- one of these is a meal in itself. It starts with two soft corn tortillas. Meat (of your choice), cheese, beans, rice, guacamole, sour cream, and salsa are layered on top (there's also a salsa bar, so you can add your own). It's kind of like an open-faced burrito, but better because you can mix everything together, so every bite is enriched with guacamole, sour cream, and salsa! There are separate bathrooms for men and women, and they're clean and modern.", "rating": 5, "date": "2013-02-14"}], "burrito with meat rice and beans": [], "burrito with cheese": [], "burrito with guacamole": [{"excerpts": ["I stopped by for lunch today and got a veggie burrito with guacamole. ", "The burrito was huge. ", "I split it with my boyfriend but still felt like I had a decent sized meal. ", "The ingredients were pretty straightforward: the standard rice, pinto beans, guac, lettuce, and cilantro. ", "The cilantro was the crowd pleaser. ", "I was sad that the guacamole wasn't more ", "flavorful- ", "I'm a lady who loves lime, and the beans left a lot to be desired. ", "That being said, the tortilla was thick and could've been made in house. ", "It was definitely fresh. ", "Theres a salsa bar available too (of course). ", "Definitely take advantage of it and find your fave. "], "author": "Kendall G.", "review": "Taqueria San Jose is steps away from the 24th and Mission BART station. \n\nI stopped by for lunch today and got a veggie burrito with guacamole. The burrito was huge. I split it with my boyfriend but still felt like I had a decent sized meal. The ingredients were pretty straightforward: the standard rice, pinto beans, guac, lettuce, and cilantro. The cilantro was the crowd pleaser. I was sad that the guacamole wasn't more flavorful- I'm a lady who loves lime, and the beans left a lot to be desired. That being said, the tortilla was thick and could've been made in house. It was definitely fresh. Theres a salsa bar available too (of course). Definitely take advantage of it and find your fave. The salsa will add a much needed kick to your dish.\n\nAll in all, I got a lot for my money and the food was decent. I'd be curious to try something else off the menu, but I don't know if or when I'll be back.", "rating": 3, "date": "2017-08-13"}, {"excerpts": ["My burrito with guacamole was the same. ", "Loaded with meat, cheese, beans, rice, sour cream and the watery guac. ", "Although the guac did not live up to my expectation the meal itself was still very satisfying. ", "The total spent for a taco, burrito and horchata came out to $14.00. ", "To be honest, the meal could've fed two people but being the overeating American I chose to devour everything in front of me. ", "It is fair to say I left the restaurant with a very happy tummy. ", "Only feedback I can give them is work on your guac and I will be back."], "author": "Frank L.", "review": "Wow. I ate a lengua taco with guacamole here this weekend and I can't believe how much meat they load these things with. The portion of meat is beyond generous. There was so much lengua on the taco I can't even pick it up. Just a few bites and the weigh of the meat totally made the taco fall apart. This taco require utensils. The meat was nicely seasoned and tender. I wasn't very fond of the so called guacamole. It was more of a salsa and watery based guacamole. I was expecting chunks of avocado or even a thicker based guacamole. \n\nMy burrito with guacamole was the same. Loaded with meat, cheese, beans, rice, sour cream and the watery guac. Although the guac did not live up to my expectation the meal itself was still very satisfying. The total spent for a taco, burrito and horchata came out to $14.00. To be honest, the meal could've fed two people but being the overeating American I chose to devour everything in front of me. It is fair to say I left the restaurant with a very happy tummy. Only feedback I can give them is work on your guac and I will be back.", "rating": 4, "date": "2017-07-24"}], "burrito with sour cream": [], "vegetarian burrito": [], "shrimp salad": [], "ceviche tostada red snapper": [], "tortas": [{"excerpts": ["We had milanese tortas and an al pastor super burrito. ", "One torta could easily feed 2 people. ", "One burrito could easily feed 2 people. ", "The flavors here are done right. ", "Good solid fare representing the Mission District very well. ", "I'd return here and be happy for it."], "author": "Nicci L.", "review": "Good solid taqueria in the Mission District. The prices are average but the sizes of each item are gigantic. We had milanese tortas and an al pastor super burrito. One torta could easily feed 2 people. One burrito could easily feed 2 people. The flavors here are done right. Good solid fare representing the Mission District very well. I'd return here and be happy for it.", "rating": 5, "date": "2018-11-01"}, {"excerpts": ["This restaurant has over 30 different platillos, featuring authentic Mexican cuisine such as tortas, mojarrita, carne adobada and several other dishes that are hard to find in other places. ", "If you are tired of the same Mexican food (tacos, burritos and enchiladas) then Taqueria San Jose is the place for you. ", "Five stars for this place not only because of the unique menu, but also because the restaurant stays open till late hours and has the best flan in town."], "author": "Jamie H.", "review": "Taqueria San Jose is different from any other taqueria you'll find in the Mission. This restaurant has over 30 different platillos, featuring authentic Mexican cuisine such as tortas, mojarrita, carne adobada and several other dishes that are hard to find in other places. If you are tired of the same Mexican food (tacos, burritos and enchiladas) then Taqueria San Jose is the place for you. Five stars for this place not only because of the unique menu, but also because the restaurant stays open till late hours and has the best flan in town.", "rating": 5, "date": "2017-07-18"}, {"excerpts": ["I went to 4 or 5 taquerias/tortas places, and no watermelon aguas frescas was to be found.  ", "Taqueria San Jose had cantaloupe, and I'd never been there before, so "], "author": "Joseph N.", "review": "It was Saturday morning and I was really craving watermelon aguas frescas, accompanied by a super burrito.  I went to 4 or 5 taquerias/tortas places, and no watermelon aguas frescas was to be found.  Taqueria San Jose had cantaloupe, and I'd never been there before, so I figured why not.\n\nThe decor has the requisite murals depicting life in the Mexican desert, and a jukebox was playing Mexican hits as you expect in the Mission.\n\nA large cantaloupe aguas frescas and an al pastor super burrito set me back around $13.  Chips are pretty standard, mass-produced but good.  The salsa bar was good and they have Tapatio on the tables.. nice!\n\nThe burrito was enormous, but not all that great.  I mean, it wasn't bad, the al pastor was decently marinated but doesn't compare to El Farolito across the street.  The rest of the ingredients were pretty standard.\n\nI enjoyed the cantaloupe aguas frescas, but I think the stuff at La Taqueria (also across the street) is better.\n\nOverall, this place is ok, but La Taqueria and El Farolito are better, giving you little to no incentive to eat here.", "rating": 3, "date": "2009-05-17"}, {"excerpts": ["For me, the only thing worth eating at Taqueria San Jose are the tortas. ", "When I'm craving a torta this is definitely my spot. ", "If you want a tasty burrito or taco, definitely look elsewhere in the neighborhood. ", "Like most places around here, they do a decent fresh orange & carrot juice and it's likely you'll never have to stand in line."], "author": "Nate R.", "review": "Some restaurants can be counted on to do one thing right and that's it. For me, the only thing worth eating at Taqueria San Jose are the tortas. When I'm craving a torta this is definitely my spot. If you want a tasty burrito or taco, definitely look elsewhere in the neighborhood. Like most places around here, they do a decent fresh orange & carrot juice and it's likely you'll never have to stand in line.", "rating": 3, "date": "2008-04-25"}], "shrimp cocktail": [{"excerpts": ["Best burritos in sf I been coming here for over 30 years I also enjoy the shrimp cocktail with a couple of tacos...and dinner plates are off the hook"], "author": "Otto N.", "review": "Best burritos in sf I been coming here for over 30 years I also enjoy the shrimp cocktail with a couple of tacos...and dinner plates are off the hook", "rating": 5, "date": "2017-02-26"}, {"excerpts": ["I've tried the al pastor, carnitas, and carne asada burritos and the shrimp cocktail. "], "author": "Richie L.", "review": "This is my favorite taqueria in SF. I've tried the al pastor, carnitas, and carne asada burritos and the shrimp cocktail. All were exceptional, way better than what I've had at la taqueria, la corneta, el farolito, etc nearby.\n\nNot sure why the ratings aren't better for this place, maybe because the prices are slightly higher than the other surrounding taquerias... but I'd rather pay more for the yummier food. \n\nPlus it's super clean. And I love that the self serve salsa bar is refrigerated and covered.", "rating": 5, "date": "2009-02-02"}], "sauce side": [], "avocado side": [], "cheese side": [], "guacamole side": [], "sour cream side": [], "chips side": [], "rice side": [], "black beans side": [], "refried beans side": [], "tortillas side": [], "aguas frescas": [{"excerpts": ["And the aguas frescas are pretty good. ", "My fave are the quesadillas. ", "Restrooms are fairly clean also. ", "Always gotta stop by if I'm in the neighborhood."], "author": "Georgina B.", "review": "My favorite spot in the whole 24th and Mission area. Tacos de lengua are delicious. Salsa is pretty fresh. And the aguas frescas are pretty good. My fave are the quesadillas. Restrooms are fairly clean also. Always gotta stop by if I'm in the neighborhood.", "rating": 4, "date": "2016-05-19"}, {"excerpts": ["and I was really craving watermelon aguas frescas, accompanied by a super burrito.  ", "I went to 4 or 5 taquerias/tortas places, and no watermelon aguas frescas was to be found.  ", "Taqueria San Jose had cantaloupe, and I'd never been there before, so ", "A large cantaloupe aguas frescas and an al pastor super burrito ", "set me back around $13.  ", "Chips are pretty standard, mass-produced but good.  ", "The salsa bar was good and they have Tapatio on the tables.. ", "I enjoyed the cantaloupe aguas frescas, but I think the stuff at La Taqueria (also across the street) is better.\n\n"], "author": "Joseph N.", "review": "It was Saturday morning and I was really craving watermelon aguas frescas, accompanied by a super burrito.  I went to 4 or 5 taquerias/tortas places, and no watermelon aguas frescas was to be found.  Taqueria San Jose had cantaloupe, and I'd never been there before, so I figured why not.\n\nThe decor has the requisite murals depicting life in the Mexican desert, and a jukebox was playing Mexican hits as you expect in the Mission.\n\nA large cantaloupe aguas frescas and an al pastor super burrito set me back around $13.  Chips are pretty standard, mass-produced but good.  The salsa bar was good and they have Tapatio on the tables.. nice!\n\nThe burrito was enormous, but not all that great.  I mean, it wasn't bad, the al pastor was decently marinated but doesn't compare to El Farolito across the street.  The rest of the ingredients were pretty standard.\n\nI enjoyed the cantaloupe aguas frescas, but I think the stuff at La Taqueria (also across the street) is better.\n\nOverall, this place is ok, but La Taqueria and El Farolito are better, giving you little to no incentive to eat here.", "rating": 3, "date": "2009-05-17"}], "strawberry beverage": [], "melon beverage": [], "tamarindo beverage": [], "orange soda": [], "milk": []}