{"vegetarian salad": [], "spaghetti bolognese": [], "linguini alfredo": [], "linguini chicken pesto": [], "tortellini mona lisa": [], "linguine clams": [], "meat tortellini": [], "extra large cheese pizza": [], "taravel pizza special": [], "california combo pizza": [], "superman pizza": [], "mexicana pizza": [{"excerpts": ["Mexicana pizza is my favorite pizza. ", "French fries are tasty and plentiful--way too much for one person. ", "Mozzarella sticks are really good too."], "author": "Lori M.", "review": "Highly recommend the Philly cheese steak and Chicken cheese steak sandwich. The salads are so good very fresh ingredients-- Caesar Salad is especially good. Mexicana pizza is my favorite pizza. French fries are tasty and plentiful--way too much for one person. Mozzarella sticks are really good too.", "rating": 5, "date": "2018-02-03"}], "combo classico pizza": [], " small cheese calzone": [], " medium cheese calzone": [], " large cheese calzone": [], "xlarge cheese calzone": [], "soda  oz cans": [], "lasagna della casa": [{"excerpts": ["Our order consisted of Gnocci with alfredo sauce, Lasagna Della Casa and garlic bread. ", "Lasagna Della Casa was just lasagna noodles tossed in a pan covered in sauce and cheese. "], "author": "Ashley W.", "review": "Today we decided to try something new since its our last night here. \n\nWe ordered from Taraval Pizza after coming back from a long day at the Zoo. \n\nOur order consisted of Gnocci with alfredo sauce, Lasagna Della Casa and garlic bread. A side of bolognese sauce to dip our bread in. \n\nWell, let's start with the alfredo. It was milk. There was no consistency to it, no flavor at all. The gnocchi was over cooked. 2 bites and it was tossed. Lasagna Della Casa was just lasagna noodles tossed in a pan covered in sauce and cheese. It was not built like lasagna, and no flavor there either. \n\nThe bolognese was a joke. It tastes like canned hot dog chili.  \nThe garlic bread was the best part of this meal and it wasn't that great.  Way to much rosemary seasoning. Hey, at least it was seasoned, right?! \n\nSo, our dinner is in the trash and we will be dining elsewhere tonight. \n\nUnless you want to be disappointed,  I wouldn't recommend this place for their pastas.", "rating": 1, "date": "2018-06-16"}, {"excerpts": ["We ordered the following items -- their menu price is listed after the item:\n\nLasagna della Casa (8.95)\nGarlic Bread (2.29)\n"], "author": "Jonathan M.", "review": "Living on the block, I tend to try most of the places to eat on Taraval. Some are great, some aren't. This one falls into the second category.\n\nIt was about 8PM, we were hungry, so I pulled a menu I had from this place, which I had not tried before, and thought, let's give it a shot. We ordered the following items -- their menu price is listed after the item:\n\nLasagna della Casa (8.95)\nGarlic Bread (2.29)\nAntipasto Salad (5.49)\nHot Wings (4.99)\nMedium Calzone + 3 toppings (11.99 + 1.25 x 3 = 15.74)\n\nOkay math wizards -- adding in the 9.5% sales tax means the grand total would come to 41.02, rounding up. I would note that on the phone I mentioned that I had a $5 off coupon (to which he replied, \"No problem, boss.\") -- so my grand total (at the most) should be $36.02. Remember this.\n\nThe food arrived in a reasonable period of time, but when the driver comes, I look at the receipt: $44.47. \"Hang on,\" I say, \"this is way to high, man.\"\n\n\"Did you get the new menu?\"\n\n\"Did you raise prices across the board by like $8? And there's no coupon on here.\"\n\n\"Did you get the new menu?\"\n\n\"Can I keep this itemized copy of my receipt?\"\n\n\"No - I need that. Did you get the new menu?\"\n\nI signed and went upstairs -- with no itemized receipt!! -- and checked out the grub.\n\n\"How's the lasagna?\" I ask. \"Mediocre. The salad isn't bad, but how can you screw up salad? How are the hot wings?\"\n\n\"It tastes like vinegar. Not spicy, not tasty -- just straight up vinegar in the sauce. The garlic bread is OK -- a little greasy and overcooked, but standard.\"\n\n\"And the calzone?\"\n\n\"It looks like they went to Pizza Hut once, bought one of those janky P'Zone pizzas, then tried to replicate it - even with the overuse of garlic powder / cheapo Kraft type Parmesan sprinkled on the outside. No sauce inside -- but at least they gave me a tiny cup of some tomato sauce that tastes like it was made in Chef Boy-R-Dee's cannery.\"\n\n\"So you didn't like it?\"\n\nIn a word -- no. I don't like crappy pizza places that try to make a quick buck with the \"the menu is expired\" (of note -- I got the menu about a week ago) BS, sell crap food, and play dumb when called on it. Even the greasiest pizza on Taraval (I'm talking to you, Pirro's) is better than putting up with that sort of scam, but when you pair it with some of the worst calzones / hot wings around, there's absolutely no point in coming to this place. \n\nThis goes beyond \"avoid\" to \"tell everyone you know not to ever go to\" level.\n\nSo, though we may not know each other, let me tell you about this place called Taraval Pizza...", "rating": 1, "date": "2010-12-23"}], "manicotti florentina vegetarian": [], "homemade cannelloni": [], "lasagna vegetariana": [], "penne chicken romano": [], "prawns": [], "combo platter": [], "pesto cheese bread": [{"excerpts": ["Pesto cheese bread was delicious. ", "The pasta was ok...not great. ", "The staff is not friendly. ", "I won't eat here again."], "author": "Stacey C.", "review": "Pesto cheese bread was delicious. The pasta was ok...not great. The staff is not friendly. I won't eat here again.", "rating": 3, "date": "2018-09-22"}], "philly cheese steak sandwich": [], "meatball with cheese sandwich": [], "ranch chicken sub": [], "bbq chicken sub": [], "bbq pulled pork sandwich": [], "chicken cheese steak sandwich": [{"excerpts": ["Highly recommend the Philly cheese steak and Chicken cheese steak sandwich. ", "The salads are so good very fresh ingredients-- Caesar Salad is especially good. "], "author": "Lori M.", "review": "Highly recommend the Philly cheese steak and Chicken cheese steak sandwich. The salads are so good very fresh ingredients-- Caesar Salad is especially good. Mexicana pizza is my favorite pizza. French fries are tasty and plentiful--way too much for one person. Mozzarella sticks are really good too.", "rating": 5, "date": "2018-02-03"}], "hot pastrami with cheese sandwich": [], "mesquite chicken sandwich": [], "roast beef with cheese sandwich": [], "chicken burger": [], "athena pesto veggie pizza": [], "veggie deluxe pizza": [], "pesto supreme pizza": [], "greekstyle pizza": [], "toscana pizza": [{"excerpts": ["I had the Toscana pizza with a thick crust, artichoke, pesto sauce, pine nuts, garlic, and cheese. ", "When I brought it home, it was very good! ", "All of it. \n"], "author": "Sally P.", "review": "This is my first time trying pizza from here. I had the Toscana pizza with a thick crust, artichoke, pesto sauce, pine nuts, garlic, and cheese. When I brought it home, it was very good! All of it. \nThe man of making the pizza was friendly and was very good at multi-tasking 1) making my pizza, 2) taking orders from other walk-ins, 3) talking on his blue tooth, and 4) running the register. \n\nI took a quick look at the menu and will definitely come back and try the other dishes.", "rating": 5, "date": "2012-09-30"}], "ranch chicken pizza": [], "garlic chicken pizza": [{"excerpts": ["Sure enough it came out quick, but was quickly feeling duped as the Garlic Chicken Pizza had barely any chicken on it!  ", "No other ingredients to speak of.  ", "Not amazingly fresh.  "], "author": "Stan L.", "review": "The line at the all you can eat spot two doors down was wicked long and i had to eat something.  Walked past this place a few times and it seemed to be busy with people coming in and out orders being delivered so the food must be good/great!  \n\ni was WRONG! The prices are significantly higher than what I am use to paying.  I was hungry and the guy promised that it would take 10 minutes.  Sure enough it came out quick, but was quickly feeling duped as the Garlic Chicken Pizza had barely any chicken on it!  No other ingredients to speak of.  Not amazingly fresh.  Ended up paying close to 25 for nothing more than bread and cheese!  \n\nThe pizza  does come out burning hot so that is nice for both delivery and instore meal.  Once the pizza cools its not that great and no better than store bought frozen pizza.  Crust was pretty good, but the low quality ingredients and atmosphere really hurt this place.", "rating": 1, "date": "2014-03-29"}], "irish taste pizza": [], "hawaiian bbq pizza": [], "pizza and wings special": [], "combo special": []}