{"boston clam chowder": [{"excerpts": ["We watched the sunset enjoying the Boston clam chowder in a sourdough bowl. ", "It doesn't get better than that.  ", "We also appreciated Robert coming by our table and sharing great hidden secrets of history. ", "Thank you Erick and Robert and all the staff at Tarantinos.  ", "We will be back!"], "author": "Helena V.", "review": "Beautiful views, great history, delicious food...but more than that, the hospitality was superb.  Erick, our bartender was fantastic.   He was so helpful, offering great ideas for touring the city. He is friendly and professional.  He pours the perfect drink. We had such a great experience and appreciated his help so much that we went back for dinner when we found out he was still there.  We watched the sunset enjoying the Boston clam chowder in a sourdough bowl. It doesn't get better than that.  We also appreciated Robert coming by our table and sharing great hidden secrets of history. Thank you Erick and Robert and all the staff at Tarantinos.  We will be back!", "rating": 5, "date": "2018-01-29"}, {"excerpts": ["Boston Clam Chowder ($8.50, or $8.75 in sourdough bowl)\n", "- Sourdough here was less crusty/hard than Boudin's. ", "Had a thinner, chewier crust.\n", "- The cap of the sourdough is not completely removed from the whole bun. ", "Combined with the chewy crust and bun-bowl full of chowder, this can make it tricky to tear off unless you do it carefully.\n", "- A more soupy/watery chowder, similar to Boudin's, but rich and... buttery? ", "I prefer thicker chowders like Fog Harbor's, but the taste here made up for it.\n", "- Definitely taste the chowder separately from any bread to get the full flavour experience. "], "author": "Simon S.", "review": "Large restaurant, bright and clean fine-dining area, and fairly spacious seating, which was a welcome change from many other restaurants, both in Vancouver and San Francisco.\n\nAfter sampling a tasty creamy-thick \"award winning\" clam chowder at Fog Harbor, I was mildly disappointed to hear that Tarantino's didn't have award winning chowder, though the server said they had won in the past.\n\nAfter my experience at Boudin with too much bread, I should have passed on the bread and instead gone to yet another clam chowder experience, but I was also curious to try out the chowder-with-bread eating strategy I came up with.\n\nBoston Clam Chowder ($8.50, or $8.75 in sourdough bowl)\n- Sourdough here was less crusty/hard than Boudin's. Had a thinner, chewier crust.\n- The cap of the sourdough is not completely removed from the whole bun. Combined with the chewy crust and bun-bowl full of chowder, this can make it tricky to tear off unless you do it carefully.\n- A more soupy/watery chowder, similar to Boudin's, but rich and... buttery? I prefer thicker chowders like Fog Harbor's, but the taste here made up for it.\n- Definitely taste the chowder separately from any bread to get the full flavour experience. It is very easily overshadowed by the sourdough, especially the crust.\n\nOnce again, having the sourdough turned out to be a net disadvantage -- too much bread, competing taste, and leftover bread cap.\nIf you are dining with someone, maybe two persons can share the one bread bowl. Not sure if you can get the bread bowl \"on the side\" but you can at least tear off portions between the two of you.\n\nVarious parts of the service were disappointing, so unfortunately I have to take points off for that. I am honestly tempted to rate them a 3/5 except that the chowder really was very decent and despite the service the servers were polite to an underdressed tourist at their fine dining establishment. Even if they deliberately understaffed the slow afternoons and it is not the server's fault, it is still the responsibility of the establishment.\n- At the time I dined at around 1 PM, the (very large) dining room was still quite empty. No idea then why they sat a large family right next to me, though it may possibly have been a special request on their part for a specific window seat -- though unlikely because there were numerous window tables with great views.\n- No water to start and it never appeared until after I asked for it, and basically AFTER I was nearly completely done with my meal (down to the last bites, pretty much).\n- When I asked for water, two servers were right next to me preparing a table. I honestly didn't think it would take very long for them to do it, so I told the server there was no hurry with the water. Turns out it took them several minutes to prepare the table. By then I was almost finished with my meal.\n- Maybe this is expecting too much, but I think the waiter should have noticed that I was almost finished with my clam chowder and been a bit more available or a busser should have come to clear the table. Instead I think I waited about five minutes before I was able to even spot someone to flag down and wrap up my time there.\n\nAlso annoying was the amazingly small men's bathroom. We're talking about barely being able to close the stall door and maybe a meter between the sink and the urinal. At least it was worth a laugh between me and the other gentleman in the bathroom that this had to be the smallest bathroom we'd ever been in.", "rating": 4, "date": "2015-04-18"}, {"excerpts": ["I also had a cup of Tarantino's famous Boston Clam Chowder and it did not disappoint.  ", "It was probably one of the best cups I've had.  ", "Also, the service was great.  ", "Will definitely come back!"], "author": "Liza V.", "review": "Great spot for lunch with amazing views!  My boyfriend and I had two lunch specials - the red snapper tacos for me and the fish and chips for him.  Both were amazing.  In fact, he said that the fish was one of the best he's had.  I also had a cup of Tarantino's famous Boston Clam Chowder and it did not disappoint.  It was probably one of the best cups I've had.  Also, the service was great.  Will definitely come back!", "rating": 4, "date": "2016-03-28"}, {"excerpts": ["Dungeness Crab and Boston clam chowder were both lovely. ", "Pretty view of the wharf too."], "author": "Louise G.", "review": "Delish!!  Dungeness Crab and Boston clam chowder were both lovely. Pretty view of the wharf too.", "rating": 5, "date": "2016-03-12"}, {"excerpts": ["The Boston Clam Chowder is very good. ", "The Steamed Clams Bordelaise is even better, absolutely delicious. ", "Make sure you save some bread for dipping. ", "Nice views overlooking the docks and a relaxing atmosphere make for an enjoyable experience."], "author": "Steve I.", "review": "Nice meal and an attractive view. The Boston Clam Chowder is very good. The Steamed Clams Bordelaise is even better, absolutely delicious. Make sure you save some bread for dipping. Nice views overlooking the docks and a relaxing atmosphere make for an enjoyable experience.", "rating": 4, "date": "2015-10-15"}, {"excerpts": ["Ordered the lunch Boston Clam Chowder and a side salad (around $8). ", "Have to say the clam chowder was pretty good, but not entirely the best that I've had. "], "author": "Jennifer K.", "review": "Decided to eat lunch inside the restaurant so we can sit and talk.  Rather than buying our food outside on the sidewalk, where there was so many people, and finding a place to sit.\n\nOrdered the lunch Boston Clam Chowder and a side salad (around $8). Have to say the clam chowder was pretty good, but not entirely the best that I've had. The side salad is the same anywhere.\n\nOn top of that, our server was not the best either.  He kept forgetting what we ordered, got the dressing messed up on our salad, and barely came to our table.  Our waters were empty and he didn't refill them till we asked.  This restaurant seems like they want to be classy, but its not quite there.  It's stuck in the limbo between being classy and inelegant.\n\nNot a great experience.  I would rather have just ordered the food outside on the sidewalk and enjoyed my SF experience there.", "rating": 2, "date": "2011-10-03"}, {"excerpts": ["The Boston Clam Chowder was amazing, for sure. "], "author": "Patty G.", "review": "Stopped at Tarantino's for lunch and did not leave disappointed. The Boston Clam Chowder was amazing, for sure. We also had the Crab Cakes and that was also very good. Service was good, our waitress was attentive. We sat on the second floor of the restaurant by the windows. There are great views of the bay from the second floor. My only critique is that the restaurant looks outdated. The bar area on the second floor was especially depressing to look at... needs some freshness. \n\nOverall, enjoyed the food and experience.", "rating": 4, "date": "2011-07-10"}, {"excerpts": ["The Boston Clam Chowder was very very very creamy. ", "Almost too creamy. ", "And it had a strong thyme flavor or something. "], "author": "Nancy L.", "review": "Came here with 4 adults, 2 kids, and a baby on Sunday around noon. They sat us almost immediately. The view is pretty nice on the 2nd floor. \n\nThe Boston Clam Chowder was very very very creamy. Almost too creamy. And it had a strong thyme flavor or something. Overall, it was a little strange...\n\nMy sister and I split the dungeness crab sandwich. There was no flavor whatsoever to it. The best part about the sandwich was the bread.\n\nThe shrimp cocktail was also a little off. I don't think the shrimp were fresh or they just weren't cooked properly. They were a little mushy.\n\nThe service, on the other hand, was great! The waitress was very friendly and smiley. \n\n2 hours validated free parking.", "rating": 1, "date": "2010-07-19"}, {"excerpts": ["Let me close by saying the boston clam chowder -- while not of the heartier consistency I affiliate with \"good\" chowder -- was freaking fantastic! ", "Only a ordered a cup and wish it'd been a bowl. ", "I ordered it in a non-bread bowl, too, which I guess is for the best given the other bread bowl reviews I've been reading. "], "author": "Mark P.", "review": "Well, we can have some concern when the Yelp profile only has three stars, but this didn't dissapoint. Was invited by friends for what ended up being a very tasty meal with a server who was fun, attentive and kept us good company (we just missed the dinner rush with a 9PM start). \n\nHighlights were the cioppino, which we are still was thinking about two days later. It came in a way yummy base and with seafood that was well-prepared to match (they were out of mussels, and the extra clams to compensate were just fine). Also, I had to try the calamari steak, which I can't remember how I ordered (server's recommendation, whatever it was). It had a great texture and flavor, served up with vegetables. A very good meal, all in all. Sure, it's Fisherman's Wharf, so expect to pay some money for this (I would say this is a \"3-$\" spot, not 2, and almost rated this a three based soley on the prices, but it's about the food for me, overall. Perhaps it's cheaper for lunch?)\n\nLet me close by saying the boston clam chowder -- while not of the heartier consistency I affiliate with \"good\" chowder -- was freaking fantastic! Only a ordered a cup and wish it'd been a bowl. I ordered it in a non-bread bowl, too, which I guess is for the best given the other bread bowl reviews I've been reading. Next time I'm in the hood, I plan to stop by for a bowl to go at the very least.\n\nWe also all shared this decadent chocolate-caramel cake dessert that was good and gooey. \n\nGood times.", "rating": 4, "date": "2008-05-26"}], "fourcheese ravioli": [], "fried monterey calamari": [], "bay shrimp cocktail": [], "mixed baby greens": [], "chopped chicken salad": [], "bay shrimp and avocado salad": [{"excerpts": ["I didn't love the heck out of my bay shrimp and avocado salad "], "author": "Joy G.", "review": "There are two kinds of people in this world: those that treat the sourdough bread bowl as a mere vestibule for the clam chowder and those that give the bowl the reverence it deserves by slurping down the chowder and then stuffing the soup-soaked bread hunks in their maws while showering their neighbors with chowder flecks. I don't trust people who refuse to even at least give the task of consuming the bowl a good old college try. The bread is honestly the best part. Whenever I see a waiter carrying back uneaten bowls from the table, a part of me always feels the same way that I do when leaving the pound - I want to give all the bread, I mean, dogs, a loving home. \n\nAnyway, the clam chowder here is excellent, made even more so by the healthy view of the Bush man terrorizing people down below. Tarantino's is one of the many restaurants dotting Fisherman's wharf, where a waiter parked outside tries to beckon in the stray tourist that had managed to escape the black hole of Boudin's sourdough crocodile. I didn't love the heck out of my bay shrimp and avocado salad but it was my fault for ordering a salad at a seafood restaurant. \n\nAlso ... I was with a dear family friend who I knew would create the world's largest scene if I paid for the meal, so I did that sneaky thing by trying to give my credit card to the waitress while he was in the bathroom. Only our waitress was nowhere to be found, so I flagged down the server who had pulled us in from the street. I saw him point out my table to the newly reappeared waitress, who rolled her eyes and threw up her hands. It's 90-10 that when a customer wants to speak to you, it's not good. But there's that 10% chance that I just want to pay for the order now. She hurried over, all sunshine and rainbows, and I turned back to my bread bowl. \n\nAnd all was right in the world but I think I'll try Boudin's next.", "rating": 3, "date": "2015-03-06"}, {"excerpts": ["I ordered the \"Bay Shrimp and Avocado Salad\". ", "The waiter came back informing me they were out of avocado. ", "He did not really offer me anything else, it was just more like ", "a \"hey just to let you know, there will not be any\". ", "I was a bit disappointed. ", "Let me make it clear that this was not a bay shrimp salad WITH avocado, it clearly said \"AND\". ", "It implied both equal parts shrimp and avocado. ", "I was looking forward to the avocado. ", "I love avocado. ", "I asked, nicely, if since my (16 dollar) bay shrimp and avocado salad does not have the avocado could I get beer? ", "I wasn't asking for a new meal, or a discount on what was surely to be a disappointment, just a beer. ", "The waiter told me and I quote \"uhh, hold on ", "let me ask the bartender, he's the boss\". "], "author": "Rebecca S.", "review": "Sex with a tourist is said to have (not that I know from experience) the potential to be the best sex there is. It's simple human nature to \"hold back\" in fear of judgment. BUT if you're never going to see that person again, one may go \"balls to the walls\" (not sure if I need the quotations) for that one night, and one night only. It may give a person a chance to try the wilder, more passionate, maybe even more hardcore elements that could amount to pleasure. It's like if you knew you only had one more night to live, you would do all the things that would cause you pure Ecstasy but never had the guts to try. \n\nOR.... (not that I know) the guy may just pass out 8 minutes later and your lucky if he will wake up again at all... and your left wondering if you have a dead body on your hands, trying to remember if he was on anything other than booze, wondering if women too get conjugal visits and whether or not his family would ship his body back to his home country or just have him cremated. \n\nTourist restaurants are like the latter. They are not trying to overly please a single person but themselves. I mean they don't want to go out of business or anything but they are really not trying too hard. They know you will never be back anyway. The hardest part (in both scenarios) is already over once you're hungry (or drunk) and in the door. Unfortunately, just like a man's looks, the view from a restaurant makes other things bearable, if not unnoticeable. A lot of the reviews for this place are tourists raving about the food. I get it but I don't trust it. You would have to be a major bitch to be sitting at a bay side restaurant on the coast of California, miles and miles away from the farm, and be complaining about the place. \n\nSo why, having lived in San Francisco for 5 years, would I come to a tourist restaurant knowing the food won't be that great? I'm not really at liberty to say, but I went. I will admit the view was quite enjoyable to look at; this place was definitely not a grenade. \n\nI ordered the \"Bay Shrimp and Avocado Salad\". The waiter came back informing me they were out of avocado. He did not really offer me anything else, it was just more like a \"hey just to let you know, there will not be any\". I was a bit disappointed. Let me make it clear that this was not a bay shrimp salad WITH avocado, it clearly said \"AND\". It implied both equal parts shrimp and avocado. I was looking forward to the avocado. I love avocado. I was still polite. \n\nWhen he came back I asked, nicely, if since my (16 dollar) bay shrimp and avocado salad does not have the avocado could I get beer? I wasn't asking for a new meal, or a discount on what was surely to be a disappointment, just a beer. The waiter told me and I quote \"uhh, hold on let me ask the bartender, he's the boss\". I smile politely. \n\nThe waiter came back after some time. Substantially longer than what it would take to ask the question during what appeared to be an extremely slow dining hour. \n\nWaiter: Yes. He said that would be fine.... a bottled beer. \n\nhmmm. A bottled beer. Sure. Cheap, but sure. One time my friend was at a bar and a guy asked to buy her a drink. She accepted and he ordered their drinks. Then he turned to her after fumbling with his money and asked her for 2 dollars... and still tried chatting her up. This bottled beer gesture was somehow worse. Maybe not as desperate, but definitely more pathetic.\n\nSo, I guess you can try your luck here if you're single and it's tourist season.", "rating": 2, "date": "2010-08-19"}], "shrimp louie": [{"excerpts": ["The Shrimp Louie was awesome.  "], "author": "David S.", "review": "We actually intended to eat at Joe's Crab Shack across the street, but they were packed with a long waiting list, so we left and decided to try Tarantino's across the street.  And I'm glad we did. \n\nWe were a party of 3 and upon walking in we were seated immediately upstairs.  Fantastic view and great food.  The Shrimp Louie was awesome.  My sister in law had the clams in broth which I got a taste of, and it was fantastic.  \n\nGreat panoramic views from upstairs.  We also were entertained by watching \"The Bushman\" who was on the sidewalk just below our window.", "rating": 4, "date": "2014-05-25"}, {"excerpts": ["As a party of 8, we had crab, fish and chips, shrimp louie, fried prawn salad, chowders, and (yes) chicken parmigiana sandwich (go figure?).  ", "Everything was good.  ", "Nothing was bad.  ", "We ate it all and we enjoyed it.  ", "Our waitress was good too with just enough spunky attitude to make it interesting.  ", "This is a three star that I would surely come back too.  ", "Even though it feels a little worn around the edges."], "author": "Lewis C.", "review": "The decor is a little tired, but the views are nice and the food is actually pretty good, even though you worry that it is a tourist trap.  As a party of 8, we had crab, fish and chips, shrimp louie, fried prawn salad, chowders, and (yes) chicken parmigiana sandwich (go figure?).  Everything was good.  Nothing was bad.  We ate it all and we enjoyed it.  Our waitress was good too with just enough spunky attitude to make it interesting.  This is a three star that I would surely come back too.  Even though it feels a little worn around the edges.", "rating": 3, "date": "2012-02-07"}], "bay shrimp scallops and clams with angel hair pasta": [], "gulf prawns manila clams prince edward island mussels and linguine": [], "tarantinos vegetarian linguine": [], "penne and chicken breast contadina": [], "ravioli": [{"excerpts": ["For my entree, I went with the beef ravioli in kind of meaty ", "(bolognese?", ") sauce ($15.95). ", "I don't like cheese, so ", "I appreciated that the ravioli didn't have cheese inside like a lot of places tend to make them. ", "If I remember correctly, this dish came with 6 giant pieces of ravioli. ", "It was really good, especially with the generous heaping of meat sauce piled on top, but I was so full ", "at this point I could only manage maybe half the dish. ", "I really enjoyed this dish as well, as the beef filling inside the ravioli was well flavored and didn't rely on the sauce to provide all the flavor.\n\n"], "author": "Dianna H.", "review": "Came here for dinner with two other friends (one visiting from out of town) on New Year's Day and there was zero wait. I was pleasantly surprised, as we had already been waiting at the nearby Alioto's for nearly 30 minutes and got fed up with the wait. I figured any seafood restaurant in the area would have similar quality, so we headed here instead and luckily there was no wait. In fact, there were quite empty, which lent to a quiet and more upscale atmosphere in the dining area. \n\nI loved our server, he was always very perceptive and came at the right time to take our order, bring us boxes and the check, etc. He also had a sense of humor and joked around with our table as we were ordering, which I appreciated.\n\nI started off with the clam chowder ($7.50 for a cup). As far as clam chowders go, this was a very thick and creamy one with really good flavor. The portion was much bigger than I expected too, especially for just a cup. By the time I finished my soup, I was already feeling kind of full. All the complimentary sourdough bread I ate with the soup didn't help either...I was initially disappointed they didn't offer the chowder in a bread bowl here, but in retrospect that was probably for the better as I would've been absolutely stuffed trying to finish the soup and bread.\n\nFor my entree, I went with the beef ravioli in kind of meaty (bolognese?) sauce ($15.95). I don't like cheese, so I appreciated that the ravioli didn't have cheese inside like a lot of places tend to make them. If I remember correctly, this dish came with 6 giant pieces of ravioli. It was really good, especially with the generous heaping of meat sauce piled on top, but I was so full at this point I could only manage maybe half the dish. I really enjoyed this dish as well, as the beef filling inside the ravioli was well flavored and didn't rely on the sauce to provide all the flavor.\n\nMy friend ordered one of their crab cakes, which I tried a piece of. I've had crab cakes many times before, but the ones here were extra garlicky (and hence delicious!). My friend liked it so much she said it was her favorite meal eaten throughout her whole trip to SF.\n\nI also liked the atmosphere of the restaurant. It felt very classic and almost a little bit old school, with plenty of space between the tables and two separate dining areas so you're never feeling cramped.", "rating": 4, "date": "2017-01-31"}, {"excerpts": ["Husband ordered the beef ravioli but got the cheese instead. ", "We did not tell the waiter. ", "Portions were small and food was plain. ", "Not what we were expecting being on the warf."], "author": "LaDona T.", "review": "We popped in here after a day of sightseeing. Most places were crowded and had long waits. Place was fairly empty and that should have been a sign. We were seated by the window overlooking a pier. Prices were high but not out of normal for the area. Clam chowder was just ok bread was cold. I ordered the seafood linguini. Shrimp was good but the scallops were tiny and rubbery. Husband ordered the beef ravioli but got the cheese instead. We did not tell the waiter. Portions were small and food was plain. Not what we were expecting being on the warf.", "rating": 1, "date": "2018-07-01"}, {"excerpts": ["I'm fairly certain they had only 3 chowders and a ravioli. ", "Estimated wait for them, approx 1 hour, 10 min.\n", "9. ", "The drink order for the table to our left coming out wrong, twice, 2 diet cokes, a tea and a Shirley Temple", ", even I knew their order. ", "Right after this, we received room temperature clam chowder resembling gravy with potatoes, I located one clam, and it may have been a potato.\n", "10. ", "85 minutes in, our food arrives. "], "author": "Lesleigh P.", "review": "As a previous General Manager for several restaurants, I saw no less than ten warning signs of a bad experience before we ordered and/or received our meal and chose to stay, so in reality, I can only blame myself for this train wreck. \n1. The seemingly harried and unkempt manager asking the bartender to take a party of twelve, they looked like they had been seated twenty minutes already, and had NO drinks, even water.\n2. No paper towels in the bathrooms.\n3. Being the only couple waiting, with five empty tables minimum, almost twenty minutes to be seated.\n4. Waiting twenty minutes for two waters and a glass of red zin, without ordering, not by choice.\n5. Seeing only 3 wait staff including the busser.\n6. Waiting 40 + minutes order, only to find out they were out of calamari, salmon, table bread and something else that I forget.\n7. Our waiter saying \" I'll be right back\" no less than six times, with twenty minutes in between.\n8.The table behind us waiting even longer to order-and receiving their food twenty minutes after us. I'm fairly certain they had only 3 chowders and a ravioli. Estimated wait for them, approx 1 hour, 10 min.\n9. The drink order for the table to our left coming out wrong, twice, 2 diet cokes, a tea and a Shirley Temple, even I knew their order. Right after this, we received room temperature clam chowder resembling gravy with potatoes, I located one clam, and it may have been a potato.\n10. 85 minutes in, our food arrives. All my food, crab cakes,  mixed vegetables and potatoes are cold. (Even on vacation, my HONEYMOON even, I don't have an hour to get my food replaced).\n\nIt only goes downhill from here if that's even possible. No manager ever came by, no one asked us how our food was, or to come back.\n\nAll in all, I'd give negative stars if I could. This is sad, because as a former manager and bartender, I am EXTREMELY forgiving with service and execution issues, when they're addressed head on. This place genuinely didn't seem to care, and the food was mediocre, at a generous best. Don't waste your $50 a head. There is a reason the wait list is small...", "rating": 1, "date": "2016-12-27"}, {"excerpts": ["We had Blackened Snapper Fish Tacos, Ravioli with pesto, chowder in bread bowl, and chicken Parm sandwich.  ", "All were great!"], "author": "Todd V.", "review": "We had lunch here and everything was fantastic!  Great service with a smile and excellent value.  Glad we stumbled upon this one!\n\nWe had Blackened Snapper Fish Tacos, Ravioli with pesto, chowder in bread bowl, and chicken Parm sandwich.  All were great!", "rating": 5, "date": "2016-06-01"}, {"excerpts": ["Ordered the calamari, chicken penne contadina, chicken chop salad, seafood pasta,  4 cheese ravioli, vegetarian linguini, and a draft beer. ", "Chicken was dry, pasta was overcooked, seafood was like rubber, and service was mediocre. ", "Sourdough bread was good. ", "$156 including $20 tip. ", "Way overpriced.  ", "We will never go back. ", "They're only still in business because they're located in a tourist trap area. ", "They wouldn't make it anywhere else. ", "Sorry ", "but that's the truth."], "author": "jesus p.", "review": "Ordered the calamari, chicken penne contadina, chicken chop salad, seafood pasta,  4 cheese ravioli, vegetarian linguini, and a draft beer. Chicken was dry, pasta was overcooked, seafood was like rubber, and service was mediocre. Sourdough bread was good. $156 including $20 tip. Way overpriced.  We will never go back. They're only still in business because they're located in a tourist trap area. They wouldn't make it anywhere else. Sorry but that's the truth.", "rating": 1, "date": "2017-06-04"}, {"excerpts": ["My wife had the beef ravioli's and said it was one of the best tasting ravioli's she's had in a long time.\n\n"], "author": "Tony C.", "review": "We arrived and were promptly seated...we had requested outdoor seating so not sure where that was because I sure didn't see it but at least we were seated with a window seat....nice view!  The only drawback was that it was pretty hot in there, not sure if it was the window but I'm thinking it was just the restaurant itself.  I recall seeing a lady fanning herself and she was sitting at the upper level away from the window.  \n\nWe started with the garlic bread for an appetizer...probably one of the best garlic breads I've ever had!  \n\nI read the reviews on how great the Clam Chowder Bread Bowl was but was really disappointed that they only serve that during lunch hours.....I was really looking forward to it. The waitress did bring some extra sourdough bread but still not the same thing...The chowder was thick and tasty...most excellent!  \n\nMy wife had the beef ravioli's and said it was one of the best tasting ravioli's she's had in a long time.\n\nOur service was right on, never had an empty glass but also wasn't pushy...I'm definitely putting it on my list of places to revisit.", "rating": 4, "date": "2015-10-05"}, {"excerpts": ["We also ordered the garlic bread, ravioli appetizer, and crab cakes lunch meal. ", "The bread tasted great and was a good size. ", "The ravioli were also great, with a pesto sauce (also great for dipping with bread). ", "I think we got 3 or 4 big raviolis as the appetizer portion. ", "The crab cakes (2 included in the lunch order)...", "well, they were the most pathetic seafood I've ever had in SF. ", "Those were some sorry ass crab cakes that you might get in Ohio, but not in SF. ", "They were the diameter of a soda can, which is fine, but FLAT as a pancake. ", "There were no chunks of crab. ", "I could literally eat each crab cake in one bite. ", "I paid $19 for this (and this is the lunch \"special\" price)! ", "The wharf stands downstairs had huge, thick crab cakes for $13 for 2. ", "If you want to hang out inside and enjoy the view, stop here, but don't order the crab cakes. ", "Stick with the clam chowder and free bread."], "author": "Olivia B.", "review": "The view was excellent and the service was decent. Food was ok, but WAY overpriced for what it was.\n\nThe free bread was great. We also ordered the garlic bread, ravioli appetizer, and crab cakes lunch meal. The bread tasted great and was a good size. The ravioli were also great, with a pesto sauce (also great for dipping with bread). I think we got 3 or 4 big raviolis as the appetizer portion. The crab cakes (2 included in the lunch order)...well, they were the most pathetic seafood I've ever had in SF. Those were some sorry ass crab cakes that you might get in Ohio, but not in SF. They were the diameter of a soda can, which is fine, but FLAT as a pancake. There were no chunks of crab. I could literally eat each crab cake in one bite. I paid $19 for this (and this is the lunch \"special\" price)! The wharf stands downstairs had huge, thick crab cakes for $13 for 2. The lunch did include a couple of tiny potatoes and a few veggies, but in SF, I'm expecting the seafood, especially at a nice restaurant, to be at least decent.\n\nIf you want good, well-priced seafood, stop at one of the wharf stands. Don't pay double the price for worse food. If you want to hang out inside and enjoy the view, stop here, but don't order the crab cakes. Stick with the clam chowder and free bread.", "rating": 2, "date": "2017-02-15"}, {"excerpts": ["My husband ordered the ravioli and he said it was alright, it was very expensive for the amount of food he got though. \n\n"], "author": "Christine P.", "review": "We came in very late around 9pm and it was empty (just two other tables). \n\nThe view was very nice and the restaurant looked very clean and pretty. \n\nThe waiter was prompt and brought us some bread and butter. \nI ordered the seafood salad and it was amazingly delicious. I also ordered a cup of the clam chowder and it was alright. My husband ordered the ravioli and he said it was alright, it was very expensive for the amount of food he got though. \n\nThis restaurant is near the piers and was walking distance from our hotel. I enjoyed this restaurant and loooooooved the seafood salad.", "rating": 5, "date": "2012-04-27"}, {"excerpts": ["I ordered Four Cheese Ravioli w/ Marinara and the rest of the family order crab with the chowder bowl."], "author": "Alma E.", "review": "It was alright. We took my mother-in-law to eat for her birthday and everyone was okay with their food, but it wasn't great. I ordered Four Cheese Ravioli w/ Marinara and the rest of the family order crab with the chowder bowl.", "rating": 2, "date": "2016-06-30"}, {"excerpts": ["My beef ravioli was blend.  ", "The four cheese ravioli had more flavor then the beef ravioli. ", "Olive garden has better food then this.  ", "One waiter had more tables then he could handle. ", "Their deserts are OK. ", "For the price i was expecting more taste and flavor.  ", "If you are craving italian i would go elsewhere."], "author": "Jake L.", "review": "For the price the food wasn't worth it. Service was ok. Waiter forgot the appetizer. It came after dinner. My beef ravioli was blend.  The four cheese ravioli had more flavor then the beef ravioli. Olive garden has better food then this.  One waiter had more tables then he could handle. Their deserts are OK. For the price i was expecting more taste and flavor.  If you are craving italian i would go elsewhere.", "rating": 2, "date": "2014-07-20"}, {"excerpts": ["Ravioli was a really small bowl. ", "Clam chowder was not good. "], "author": "Annette L.", "review": "There is an indoor restaurant and outdoor roadside store. Sit outside. We asked the guy outside whether the indoor seats are the same and he said yes. Technically, they're the same restaurant. But the outdoor seating had a totally different menu!!! With much cheaper prices. For eg the crab was $11 per pound for the outdoor menu, but in the restaurant it was $30 for a whole crab which was def smaller than usual. \n\nThe food was meh. Portions are way small. Bread was tough like a rock. Crab was below average - it tasted like crab, but there was no wow factor. Ravioli was a really small bowl. Clam chowder was not good. Fish and chips consisted of a handful of small fries and three small pieces of fish. \n\nIf you're looking for crab, don't come here. I've had way better crab at cheaper prices. There was a pretty okay view of the pier but that's about it.", "rating": 2, "date": "2014-01-03"}, {"excerpts": ["I ordered the Beef Ravioli and my father got what we called \"DInner in a can\" shrimp, scallops where the size of a finer nail or smaller and Bland! ", "Mine was bland", ", Sauce was crazy salty and service was awful. ", "Go to Fog Harbor fish house on Pier 39, much better. ", "90$ FOR CRAP!"], "author": "Ben C.", "review": "DONT COME HERE! I came for a Anniversary dinner and it is awful. I ordered the Beef Ravioli and my father got what we called \"DInner in a can\" shrimp, scallops where the size of a finer nail or smaller and Bland! Mine was bland, Sauce was crazy salty and service was awful. Go to Fog Harbor fish house on Pier 39, much better. 90$ FOR CRAP!", "rating": 1, "date": "2013-04-27"}, {"excerpts": ["my youngest daughter had the beef ravioli.  ", "i'm not a fan of ravioli, but kid totally plowed the plate.  "], "author": "Hung-wei L.", "review": "we came here on a recent visit, and the service really sucked.  \n\nfor app, we order the crab cakes and mango salsa.  no jumbo lump crab meat; it was all the shredded bits.  the cakes were flat as pancakes, and very bland.  on the plus side, mango salsa was yummy.  that's probably the only thing that saved the dish.  \n\ni ordered the 2 maine lobster tails entree.  one was great, and the other was salty as hell.  something must've distracted the chef because it tasted like he double-seasoned it.  \"oooh look, something shiny!  oh crap, did i season this piece already?  oh well, let's hit it again with seasonings\".  sauteed veggies were very well done.\n\nwifey ordered the shrimp scampi, and she said it was good.  i didn't have a bite, though.  \n\nmy son had the kids fried seafood platter- lots of calamari, 3 large shrimp, a piece of cod, and a large scallop.  the calamari, shrimp, and cod was good, but the scallop was...spit out.\n\nmy youngest daughter had the beef ravioli.  i'm not a fan of ravioli, but kid totally plowed the plate.  not sure if it was because of severe hunger, or if it truly was tasty.  \n\nfor dessert, i ordered the tiramisu, and it was unlike anything i've ever eaten before.  the marscapone was thick and heavenly.  is it supposed to be that way, or is it supposed to be light and airy?  nevertheless, it was....WOW.  that's all i gotta say.  \n\nin summary, 1 star for 1 good lobster tail.  1 star for the incredible tiramisu.  \n\ndid i mention the service sucked??  restaurant was 2/3 empty, yet our waiter was scarce.  and there was definitely NOT a lack of servers", "rating": 2, "date": "2012-04-08"}, {"excerpts": ["My son ate his whole bowl of ravioli but he was hungry!  ", "The waitress was kind of pushy and rude.  ", "She waited until we were finished eating ", "and I had left the table to ask if everything was ok, and it really wasn't.  ", "I would've told her that too."], "author": "Jenny E.", "review": "This place sucked!  The worst thing about this place is not that my fish and chips were horrible or that the ranch was thick, loaded with salt and unappealing but that their \"Italian\" food was terrible!!  The sauce was really substandard with hardly any love or flavor added.  My son ate his whole bowl of ravioli but he was hungry!  The waitress was kind of pushy and rude.  She waited until we were finished eating and I had left the table to ask if everything was ok, and it really wasn't.  I would've told her that too.", "rating": 2, "date": "2011-12-04"}, {"excerpts": ["Among our orders were 4 surf-and-turf dinners, 1 NY steak, 1 Ravioli, and two Rainbow Trout.  \n\n", "The ravioli was good.  "], "author": "John L.", "review": "We decided on Tarantino's for our Anniversary dinner while in San Francisco.  We were seated right away - it was a Tuesday night, and not very many diners.  We had a beautiful view of the wharf and a window seating area for our party of 8.\n\nThe service seemed a bit slow, but we ordered eventually.  Among our orders were 4 surf-and-turf dinners, 1 NY steak, 1 Ravioli, and two Rainbow Trout.  \n\nFor the 5 steaks, we ordered 4 medium and 1 medium rare.  When they arrived, they were all well done.  We told the waiter (who we had to call over as he never checked on us after the meals were served, nor did he ask about drink refills at all during our time there til nearly the end).\n\nThe steaks were sent back and replaced..... and while they were SOMEWHAT cooked more to order, they were still a bit over cooked and very bland.  We didn't eat them.\n\nThe trout was good.  The ravioli was good.  The lobster portion of the surf and turf meals was excellent.\n\nI spoke to the Manager about our experience, and the saving grace of the evening - so to speak - was that he comped us our surf-and-turf meals.  More than I anticipated in compensation for the steak fiasco.\n\nI'd be willing to give Tarantino's another chance just on the manager's actions alone.  Maybe it was a bad night for the chef?  I don't know.  Other tables we observed sent back items like cold soup and such.\n\nRecommendations - more attentive wait staff (especially when the dining area only is 1/3 full) and a chef who doesn't overcook a steak.\n\nMany thanks to the Manager for understanding and doing right by us on the bill.  Only 2 stars as this was a special night for us which, unfortunately, didn't give us the dinner memories we'd expected.", "rating": 2, "date": "2010-03-27"}, {"excerpts": ["The ravioli appetizer is delish with aldentae skin and a perfect cheese filling.  ", "The crab appetizer is to die for with big pieces of meat and a little lemon sprinkled over.  ", "The seafood feticini Tarantino is what my cousin and I both decided on with big succulent prawns, baby scallops, garlic, cream, and a little Parmesan over aldentae noodles.  ", "The three Heineken's were perfect accompaniments.  ", "So, for excellent seafood at reasonable prices with friendly service in a touristy, elegant, yet casual atmosphere, Tarantino's cannot be beat.  ", "Keep up the good work guys.!"], "author": "Brian S.", "review": "Knowing about this place for years, from my late father who use to service restaurants near and along the wharf, we finally came here last night with my cousins visiting from Minneapolis.  They were turning to me for help and like anything.  So, I said that sense we were by the wharf and there is a lot of good seafood, Tarantino's is a good place.  This was a first for all of us.  The service is friendly and not overly attentive.  The atmosphere is touristy, elegant, and casual.  I like the mix of classic rock, soft rock, and pop rock, mostly classics playing.  We got a table right by the window which we loved.  The bread is that fresh sour dough you have come to expect on the wharf and in the city, perfect with butter.  The ravioli appetizer is delish with aldentae skin and a perfect cheese filling.  The crab appetizer is to die for with big pieces of meat and a little lemon sprinkled over.  The seafood feticini Tarantino is what my cousin and I both decided on with big succulent prawns, baby scallops, garlic, cream, and a little Parmesan over aldentae noodles.  The three Heineken's were perfect accompaniments.  So, for excellent seafood at reasonable prices with friendly service in a touristy, elegant, yet casual atmosphere, Tarantino's cannot be beat.  Keep up the good work guys.!", "rating": 5, "date": "2012-08-02"}], "crab cakes": [{"excerpts": ["My friend ordered one of their crab cakes, which I tried a piece of. ", "I've had crab cakes many times before, but the ones here were extra garlicky (and hence delicious!). "], "author": "Dianna H.", "review": "Came here for dinner with two other friends (one visiting from out of town) on New Year's Day and there was zero wait. I was pleasantly surprised, as we had already been waiting at the nearby Alioto's for nearly 30 minutes and got fed up with the wait. I figured any seafood restaurant in the area would have similar quality, so we headed here instead and luckily there was no wait. In fact, there were quite empty, which lent to a quiet and more upscale atmosphere in the dining area. \n\nI loved our server, he was always very perceptive and came at the right time to take our order, bring us boxes and the check, etc. He also had a sense of humor and joked around with our table as we were ordering, which I appreciated.\n\nI started off with the clam chowder ($7.50 for a cup). As far as clam chowders go, this was a very thick and creamy one with really good flavor. The portion was much bigger than I expected too, especially for just a cup. By the time I finished my soup, I was already feeling kind of full. All the complimentary sourdough bread I ate with the soup didn't help either...I was initially disappointed they didn't offer the chowder in a bread bowl here, but in retrospect that was probably for the better as I would've been absolutely stuffed trying to finish the soup and bread.\n\nFor my entree, I went with the beef ravioli in kind of meaty (bolognese?) sauce ($15.95). I don't like cheese, so I appreciated that the ravioli didn't have cheese inside like a lot of places tend to make them. If I remember correctly, this dish came with 6 giant pieces of ravioli. It was really good, especially with the generous heaping of meat sauce piled on top, but I was so full at this point I could only manage maybe half the dish. I really enjoyed this dish as well, as the beef filling inside the ravioli was well flavored and didn't rely on the sauce to provide all the flavor.\n\nMy friend ordered one of their crab cakes, which I tried a piece of. I've had crab cakes many times before, but the ones here were extra garlicky (and hence delicious!). My friend liked it so much she said it was her favorite meal eaten throughout her whole trip to SF.\n\nI also liked the atmosphere of the restaurant. It felt very classic and almost a little bit old school, with plenty of space between the tables and two separate dining areas so you're never feeling cramped.", "rating": 4, "date": "2017-01-31"}, {"excerpts": ["Mother in Law got a salad and the crab cakes - she only got one down until she claimed she was full. ", "(doubt it)\n"], "author": "Nichole R.", "review": "Tarantino's was unfortunately both the first meal we had in San Francisco and the worst meal we had in San Francisco. \nNot a great first impression. \nIt was Friday evening and we had a table of 5 around 6:00 and the place was pretty dead. Despite this, service was VERY slow. Our waiter was nice enough, just, slow. Not the best way to start a meal - starving 5 people that just got off a plane but I digress. \nThe food was horrid and expensive.\nI got the Linguine di Casa and it was SO bland - I choked my way through it for the sole reason of starvation.\nMy husband got the Vegetarian Linguine and his was just as bland - aside from this, his meal came out about 5 minutes after the rest of ours and it was PIPING hot - like, burn your mouth hot, including the plate. Meaning it sat under heat lamps for QUITE awhile. Probably the first done, yet the last out? Gross, and not cool.\nMy Father in Law got the Bay Shrimp, Scallops and Clams with Angel Hair Pasta. The shrimps were so tiny it was laughable -  I can't comment on the flavor but he was not impressed.\nMother in Law got a salad and the crab cakes - she only got one down until she claimed she was full. (doubt it)\nOur 8 year old nephew got the chicken fingers and he didn't eat them because they were so overcooked that the chicken was tough - and him being a very \"textural eater\" couldn't manage to choke any of it down, except the french fries - which were fantastic. \n\nSo:\nCons? Expensive and Unimpressive. I would even go so far as to say gross.\nPros? Kick ass french fries.\n\nSo......go there for the french fries?", "rating": 1, "date": "2018-01-05"}, {"excerpts": ["From lobster rolls to fish & chips to crab cakes, the options besides the sacred chowder are plentiful and delicious. ", "I haven't tried the cioppino and have no say on its quality. ", "Overall, the food is moderate in quality, except for specialty meals that require more attention. ", "Don't come here for the vegetables.\n", "Sure, the Wharf's residents all serve the same style of food as Tarantino's, but this place does seafood better than the stands reminding you of their existence. \n", "Maybe I'm harsh to the competition. ", "Still, my fellow consumers deserve better than the struggle of scrutinizing in person. \n", "Hopefully this review can can save you some trouble. \n", "Enjoy, buen provecho, and treat yourself some chowder soon!"], "author": "Richard C.", "review": "Quick Notes: Tarantino's is classy but casual. Clam chowder is possibly its best dish. Good service and low wait time. Better than other Wharf eateries, yet lacks high quality.\n\nAn affair between clam chowder and a loaf sourdough bread can't get any more scandalous than at Tarantino's, where the first dish on the appetizer section of the menu is a MUST. Even a cup will suffice the dazed and confused. \nQuestioning fate and your place in the universe? Clam chowder can meet your fixings and desire to savor life in all forms, especially when whipped up at a restaurant overlooking the Bay of San Francisco and the Golden Gate. \nThe restaurant before restaurants on Fisherman's Wharf's left side, Tarantino's is perched above a first floor and provides large windows worthy of a face-press on the glass. What I will concede is that the whole building is in need of a major renovation due to decades of putting food before housekeeping. If you're a stickler for what your feet are on instead of what goes in your mouth, be careful.\nBesides location, the ambience in the restaurant is all San Francisco: classy, but not the extent of making one feel underdressed or without proper etiquette. Tarantino's is most definitely, in my personal opinion, a place for a family or couple seeking deep nourishment.\nFrom lobster rolls to fish & chips to crab cakes, the options besides the sacred chowder are plentiful and delicious. I haven't tried the cioppino and have no say on its quality. Overall, the food is moderate in quality, except for specialty meals that require more attention. Don't come here for the vegetables.\nSure, the Wharf's residents all serve the same style of food as Tarantino's, but this place does seafood better than the stands reminding you of their existence. \nMaybe I'm harsh to the competition. Still, my fellow consumers deserve better than the struggle of scrutinizing in person. \nHopefully this review can can save you some trouble. \nEnjoy, buen provecho, and treat yourself some chowder soon!", "rating": 5, "date": "2018-06-13"}, {"excerpts": ["We had crab cakes as an appetizer, which were as thick as a McDonald's cheeseburger, with about as much quality. \n\n"], "author": "Philip E.", "review": "The waitress was the nicest part about this restaurant. She was overworked, but did her job very well. \n\nWe came for lunch. Bloody Marys were on special and the only thing we could taste was the horseradish, neither of us could finish one. \n\nWe had crab cakes as an appetizer, which were as thick as a McDonald's cheeseburger, with about as much quality. \n\nI had fish tacos also on special. The bland shells took the flavor from the rest of the dish, which was otherwise fresh and not half bad once I ditched the shell. \n\nMy boyfriend had the chicken parmesan. He couldn't even finish half, tried to just eat the chicken, but ended up putting it all to the side and just eating his fries. \n\nVery surprised to have this experience based on the other reviews, but we do not recommend.", "rating": 2, "date": "2017-04-13"}, {"excerpts": ["I had the crab cakes which were interesting. ", "Tasted great, but they were flat with a mango chutney on top. "], "author": "Eric C.", "review": "We were looking for a run of the mill seafood restaurant on the Wharf so that we could go over to Ghirardelli's afterwards. Tarantino fit that picture. Much like it's cousin Allioto's next door, this place does their seafood as you would expect. There are no surprises here. Everything on the menu is as you would expect from a seafood restaurant from various fish options like fish and chips, salmon dishes to pasta with clams, appetizer oysters, clams in wine sauce etc etc. I had the crab cakes which were interesting. Tasted great, but they were flat with a mango chutney on top. The mango was unnecessary but the cakes were surprisingly flavorful, but I would prefer the plump cakes as it packs more taste and adds more delicate features to the dish. \n\nThey also have a short list of wine. I would have expected more but I don't get the impression that they are catering towards wine connoisseurs. They are mostly attracting the foot traffic of tourists that walk by. Will you get what you want? Sure, unless what you want is a new American restaurant that will startle your tastebuds and your mind that SF is known for. All in all a decent place, but look, there are so many other places in town to try!", "rating": 3, "date": "2016-10-23"}, {"excerpts": ["I ordered an iced tea and the crab cakes.  ", "I have to say my server was extremely nice - but - the service itself was very, very slow.  ", "Upon finishing my meal, which I had been done with for a very, very long time - I was trying in vain to find my server to get the check.  ", "It was pretty frustrating actually, especially after such a delicious meal.  ", "The food itself was really good.  ", "The crab cakes were really tasty and not chock full of filler.  ", "I would eat here again, if I wasn't in a rush."], "author": "Ashley K.", "review": "I was walking around Fisherman's Wharf, killing some time and looking for a place to eat lunch.  I stumbled upon Tarantino's and based on the menu and friendly greeting, gave it a go.  I was seated at a lovely table overlooking water, which was very nice.  I ordered an iced tea and the crab cakes.  I have to say my server was extremely nice - but - the service itself was very, very slow.  Upon finishing my meal, which I had been done with for a very, very long time - I was trying in vain to find my server to get the check.  It was pretty frustrating actually, especially after such a delicious meal.  The food itself was really good.  The crab cakes were really tasty and not chock full of filler.  I would eat here again, if I wasn't in a rush.", "rating": 3, "date": "2017-06-17"}, {"excerpts": ["After looking at the menu posted outside of the restaurant, I noticed they had crab cakes (my favorite!), so we decided to give this place a try. ", "We were seated next to the large picture windows, which had a nice view of the boats in the marina. ", "Food:\n- Crab Cakes - Served with remoulade, mango salsa, potatoes, and vegetables. ", "The mango salsa was slightly sweet and fruity. ", "It was a nice change of pace, since crab cakes are usually only served with savory sauces. ", "I liked that they still gave a cup of remoulade, in case you prefer the more traditional sauce to compliment the crab cakes. ", "The crab cakes themselves were not bad. ", "The crab was finely shredded with some breading.\n", "- Crab Sandwich - ", "On Italian country bread. ", "This was more of a crab salad sandwich, which I wish I would have known before ordering it. ", "They used quite a bit of mayo to get that crab salad consistency. ", "The sandwich is served with French fries. ", "Definitely pricey for what you are getting."], "author": "Lisa Y.", "review": "My boyfriend and I were looking for a nice place to eat in Fisherman's Wharf. After looking at the menu posted outside of the restaurant, I noticed they had crab cakes (my favorite!), so we decided to give this place a try. We were seated next to the large picture windows, which had a nice view of the boats in the marina. The restaurant was quiet and dimly-lit with a classy, romantic atmosphere.\n\nService:\nOur server was polite and attentive. He made himself available, yet did not seem intrusive at all.\n\nFood:\n- Crab Cakes - Served with remoulade, mango salsa, potatoes, and vegetables. The mango salsa was slightly sweet and fruity. It was a nice change of pace, since crab cakes are usually only served with savory sauces. I liked that they still gave a cup of remoulade, in case you prefer the more traditional sauce to compliment the crab cakes. The crab cakes themselves were not bad. The crab was finely shredded with some breading.\n- Crab Sandwich - On Italian country bread. This was more of a crab salad sandwich, which I wish I would have known before ordering it. They used quite a bit of mayo to get that crab salad consistency. The sandwich is served with French fries. Definitely pricey for what you are getting.", "rating": 3, "date": "2014-09-24"}, {"excerpts": ["All my food, crab cakes,  mixed vegetables and potatoes are cold. "], "author": "Lesleigh P.", "review": "As a previous General Manager for several restaurants, I saw no less than ten warning signs of a bad experience before we ordered and/or received our meal and chose to stay, so in reality, I can only blame myself for this train wreck. \n1. The seemingly harried and unkempt manager asking the bartender to take a party of twelve, they looked like they had been seated twenty minutes already, and had NO drinks, even water.\n2. No paper towels in the bathrooms.\n3. Being the only couple waiting, with five empty tables minimum, almost twenty minutes to be seated.\n4. Waiting twenty minutes for two waters and a glass of red zin, without ordering, not by choice.\n5. Seeing only 3 wait staff including the busser.\n6. Waiting 40 + minutes order, only to find out they were out of calamari, salmon, table bread and something else that I forget.\n7. Our waiter saying \" I'll be right back\" no less than six times, with twenty minutes in between.\n8.The table behind us waiting even longer to order-and receiving their food twenty minutes after us. I'm fairly certain they had only 3 chowders and a ravioli. Estimated wait for them, approx 1 hour, 10 min.\n9. The drink order for the table to our left coming out wrong, twice, 2 diet cokes, a tea and a Shirley Temple, even I knew their order. Right after this, we received room temperature clam chowder resembling gravy with potatoes, I located one clam, and it may have been a potato.\n10. 85 minutes in, our food arrives. All my food, crab cakes,  mixed vegetables and potatoes are cold. (Even on vacation, my HONEYMOON even, I don't have an hour to get my food replaced).\n\nIt only goes downhill from here if that's even possible. No manager ever came by, no one asked us how our food was, or to come back.\n\nAll in all, I'd give negative stars if I could. This is sad, because as a former manager and bartender, I am EXTREMELY forgiving with service and execution issues, when they're addressed head on. This place genuinely didn't seem to care, and the food was mediocre, at a generous best. Don't waste your $50 a head. There is a reason the wait list is small...", "rating": 1, "date": "2016-12-27"}, {"excerpts": ["Crab cakes weren't the best. \n", "I got a very nice spot. ", "I enjoyed the sunset. ", "I would recommend others to come here and enjoy the view and food."], "author": "Sandeep K.", "review": "I loved the clam chowder soup,  it's yum. I liked seafood platter too, it's quite filling. Crab cakes weren't the best. \nI got a very nice spot. I enjoyed the sunset. I would recommend others to come here and enjoy the view and food.", "rating": 4, "date": "2016-04-05"}, {"excerpts": ["The two of us had the blackened mahi, an order of crab cakes, and two coffees.  ", "Total price with tip was $65 and well worth it!  ", "Our service was great, the food was excellent, and the place was clean. ", "We would go back  without hesitation!"], "author": "Robert H.", "review": "The two of us had the blackened mahi, an order of crab cakes, and two coffees.  Total price with tip was $65 and well worth it!  Our service was great, the food was excellent, and the place was clean. We would go back  without hesitation!", "rating": 5, "date": "2016-06-27"}, {"excerpts": ["Fresh crab cakes, delicious calamari, and the bread is awesome.  ", "Great place to stop by and enjoy a beautiful view."], "author": "Robert A.", "review": "Fresh crab cakes, delicious calamari, and the bread is awesome.  Great place to stop by and enjoy a beautiful view.", "rating": 4, "date": "2017-04-08"}, {"excerpts": ["The crab cakes left a lot to be desired, and I don't recommend them. "], "author": "B A.", "review": "The fish tacos were excellent. They are made with snapper and you can order them grilled or fried. \n\nThe crab cakes left a lot to be desired, and I don't recommend them. Pretty bland for a seafood restaurant.\n\nThe staff are friendly and the music is laid back. I enjoyed the view! We even spotted a pair of seals.", "rating": 3, "date": "2015-10-19"}, {"excerpts": ["Also ordered the crab cakes and kids prawns.  ", "The crab cakes were not good and the kids \"prawns\" were terrible.  ", "Not only were they not large enough to call prawns, they were cooked without any seasonings at all.  ", "Bland, bland, bland."], "author": "Daryl C.", "review": "Chowder\n\nStill the best chowder in Fisherman's Wharf.  Also ordered the crab cakes and kids prawns.  The crab cakes were not good and the kids \"prawns\" were terrible.  Not only were they not large enough to call prawns, they were cooked without any seasonings at all.  Bland, bland, bland.", "rating": 3, "date": "2013-12-30"}, {"excerpts": ["We also ordered the garlic bread, ravioli appetizer, and crab cakes lunch meal. ", "The bread tasted great and was a good size. ", "The ravioli were also great, with a pesto sauce (also great for dipping with bread). ", "I think we got 3 or 4 big raviolis as the appetizer portion. ", "The crab cakes (2 included in the lunch order)...", "well, they were the most pathetic seafood I've ever had in SF. ", "Those were some sorry ass crab cakes that you might get in Ohio, but not in SF. ", "They were the diameter of a soda can, which is fine, but FLAT as a pancake. ", "There were no chunks of crab. ", "I could literally eat each crab cake in one bite. ", "I paid $19 for this (and this is the lunch \"special\" price)! ", "The wharf stands downstairs had huge, thick crab cakes for $13 for 2. ", "If you want to hang out inside and enjoy the view, stop here, but don't order the crab cakes. ", "Stick with the clam chowder and free bread."], "author": "Olivia B.", "review": "The view was excellent and the service was decent. Food was ok, but WAY overpriced for what it was.\n\nThe free bread was great. We also ordered the garlic bread, ravioli appetizer, and crab cakes lunch meal. The bread tasted great and was a good size. The ravioli were also great, with a pesto sauce (also great for dipping with bread). I think we got 3 or 4 big raviolis as the appetizer portion. The crab cakes (2 included in the lunch order)...well, they were the most pathetic seafood I've ever had in SF. Those were some sorry ass crab cakes that you might get in Ohio, but not in SF. They were the diameter of a soda can, which is fine, but FLAT as a pancake. There were no chunks of crab. I could literally eat each crab cake in one bite. I paid $19 for this (and this is the lunch \"special\" price)! The wharf stands downstairs had huge, thick crab cakes for $13 for 2. The lunch did include a couple of tiny potatoes and a few veggies, but in SF, I'm expecting the seafood, especially at a nice restaurant, to be at least decent.\n\nIf you want good, well-priced seafood, stop at one of the wharf stands. Don't pay double the price for worse food. If you want to hang out inside and enjoy the view, stop here, but don't order the crab cakes. Stick with the clam chowder and free bread.", "rating": 2, "date": "2017-02-15"}, {"excerpts": ["We went to order, looking for a bread bowl of chowder, some crab cakes, and the fresh dungeness advertised as in season downstairs. ", "They did not have crab cakes, and the crab that was $13.75 a pound downstairs was up charged to $32 upstairs. ", "We ordered the bread bowl only, intending to share. ", "The server brought it split into two cups- ", "I asked her to bring it back in a bread bowl. ", "She did. "], "author": "Kristin V.", "review": "This place is a mess. Despite the prime location, you walk in the ground floor and there is no one to greet you. So you walk upstairs to an open room where there are 30% of tables that the room can seat, and none of them are set with silverware, glassware, etc. There is a hostess stand sort of off to the side, and we were eventually greeted. We went to order, looking for a bread bowl of chowder, some crab cakes, and the fresh dungeness advertised as in season downstairs. They did not have crab cakes, and the crab that was $13.75 a pound downstairs was up charged to $32 upstairs. We ordered the bread bowl only, intending to share. The server brought it split into two cups- I asked her to bring it back in a bread bowl. She did. The chowder itself was fine- nothing to write home about but not bad. \n\nIn general, we found this place to be strange, with poor service, was over priced, and not worth the time. Stay away!", "rating": 1, "date": "2015-01-01"}, {"excerpts": ["I ordered the crab cakes for lunch and they were amazing. ", "Our waitress is a sweet, friendly, gal from Ireland who has been working there for over 20 years. \n", "We are in town (from LA) for our son's birthday. ", "This restaurant was a great reprieve from a long touristy day in this city. ", "Highly recommend."], "author": "Tessa G.", "review": "Had the nicest lunch here!! We had a table upstairs overlooking the boats. Ordered calamari and chowder in bread bowl to share. They were both delicious. I ordered the crab cakes for lunch and they were amazing. Our waitress is a sweet, friendly, gal from Ireland who has been working there for over 20 years. \nWe are in town (from LA) for our son's birthday. This restaurant was a great reprieve from a long touristy day in this city. Highly recommend.", "rating": 5, "date": "2016-01-09"}, {"excerpts": ["My husband got the crab cakes w/ mango Salsa he loved. ", "Our son wanted fettuccini Alfredo which wasn't on the menu but they accommodates him. ", "Our server Bella was AMAZING!  ", "I wish would have found this place a day earlier as we wasted our money at Neptune's on pier 39 that was not so great."], "author": "Christine J.", "review": "Very impressed! We got swayed I'm by someone outside on 4th of July. There were dozens of other restaurants doing the same but the kid doing it swayed us into to look at the menu. They had a 4th of July menu. I had the special of Clam Chowder in a Bread Bowl I also got a side salad which honestly I didn't need. My husband got the crab cakes w/ mango Salsa he loved. Our son wanted fettuccini Alfredo which wasn't on the menu but they accommodates him. Our server Bella was AMAZING!  I wish would have found this place a day earlier as we wasted our money at Neptune's on pier 39 that was not so great.", "rating": 4, "date": "2015-07-04"}, {"excerpts": ["We also had the Crab Cakes and that was also very good. ", "Service was good, our waitress was attentive. ", "We sat on the second floor of the restaurant by the windows. ", "There are great views of the bay from the second floor. ", "My only critique is that the restaurant looks outdated. "], "author": "Patty G.", "review": "Stopped at Tarantino's for lunch and did not leave disappointed. The Boston Clam Chowder was amazing, for sure. We also had the Crab Cakes and that was also very good. Service was good, our waitress was attentive. We sat on the second floor of the restaurant by the windows. There are great views of the bay from the second floor. My only critique is that the restaurant looks outdated. The bar area on the second floor was especially depressing to look at... needs some freshness. \n\nOverall, enjoyed the food and experience.", "rating": 4, "date": "2011-07-10"}, {"excerpts": ["First, the lunch:\n\nI was craving crab cakes, while my friend was craving a clam chowder bread bowl. ", "For $12.50 I got two crab cakes (maybe 2 oz each) with a mango salsa, a small salad with house dressing, and a cup of chowder.\n\n", "The crab cakes were scrumptious. ", "The sauce that they were served with was very complimentary. ", "The mango salsa was pretty good as well. ", "The house dressing on the mixed greens was very tasty. ", "The clam chowder was one of the best that I have had. ", "In all fairness, Im not a huge clam chowder fan, and dont normally order it, but I was glad I did this time. "], "author": "Chris G.", "review": "My experience at Tarantino's was incredible (which you can't spell without edible). My rating is based on a combination- lunch + entertainment. First, the lunch:\n\nI was craving crab cakes, while my friend was craving a clam chowder bread bowl. Tarantino's had both; each was on special this fine day. We wanted a view of the water, but most of the window seats were taken. We decided on a window seat that was above the sidewalk, but still offered a good view.\n\nWith your drinks the waiter give's you some cold bread, and even colder butter, which is virtually impossible to spread. But that was easily overlooked once the meal was served. For $12.50 I got two crab cakes (maybe 2 oz each) with a mango salsa, a small salad with house dressing, and a cup of chowder.\n\nThe crab cakes were scrumptious. The sauce that they were served with was very complimentary. The mango salsa was pretty good as well. The house dressing on the mixed greens was very tasty. The clam chowder was one of the best that I have had. In all fairness, Im not a huge clam chowder fan, and dont normally order it, but I was glad I did this time. For the price, this was an incredible deal.\n\nNow for the entertainment:\n\nI happened to stumble upon Tarantino's in passing by, I did not yelp it.  So I was unaware of the possibility of watching the bush man at work. We walked passed him from behind on the way to the restaurant. At first I thought he was making something out of the bushes?? I didn't know what his deal was, I had never heard of him.\n\nLucky for us we had constant amusement from this guy. It never got old. We forgot that there was also a beautiful view of the harbor and Alcatraz there as well. Who needs that, when you can witness masses of mid-westerners urinating their trousers in public? It was priceless. Unfortunately the Bush Man left just as we were getting our check, so I was unable to go down and tip him. This was one of my greatest restaurant experiences. \n\nJust a note, Karma got me later in the day. \n\nThe Bush Mans nemesis (a  former partner and fellow frightener, I learned after researching) scared me a few hours later. But in my defense, this guy kind of cheats. The brilliance of The Bush Man was that he just slightly thrusts the shrubbery at his targets to scare them. This knock-off, jumps up and yells right in your face, so of course you are going to be caught off guard. \n\nThats why I jumped and screamed like a little girl... And the fact that my parents were murdered by a bullying brier when I was a young lad. \n\nIf you see The Bush Man at work and you are hungry, rush to the second floor of Tarantino's and grab a window seat.", "rating": 5, "date": "2010-02-28"}, {"excerpts": ["My light lunch special had a cup of the chowder, and two small crab cakes served with a little salad and mango salsa for $16.95. ", "French fries and chicken tenders for our son were perfectly fried and very tasty. ", "We left after a relaxing hour, thoroughly pleased with our choice."], "author": "Deb R.", "review": "We love San Francisco,  and this has become my go-to lunch place on the Wharf. You can sit in the sidewalk seats and people watch in all the hub-bub, or go upstairs to the restaurant for great Marina views and quiet. ( I've done both depending on mood). Their prices are reasonable for a wharf restaurant ( which are expensive). We are foodies and my daughter, husband and I loved their clam chowder, served with free sourdough bread. My light lunch special had a cup of the chowder, and two small crab cakes served with a little salad and mango salsa for $16.95. French fries and chicken tenders for our son were perfectly fried and very tasty. We left after a relaxing hour, thoroughly pleased with our choice.", "rating": 4, "date": "2014-06-26"}, {"excerpts": ["The crab cakes had ok flavor, but nothing spectacular, and the vegetables on my plate were far from being cooked enough.  ", "To top it all off, the waiter forgot to bring me my drink and didn't get it till after the meal was served.  ", "The only great thing about this place is the quiet atmosphere and view.  ", "Very relaxing.  ", "For the food, I and all who were with me felt like we were getting ripped off.  ", "Don't know why so many other reviewers rave about this place.  "], "author": "Corey M.", "review": "In my opinion, the food was absolutely horrible at this place.  The clam chowder had some good flavor development, but it was lukewarm when served and had a noticeably floury taste.  (Like the flour had not been cooked out all the way.)  The crab cakes had ok flavor, but nothing spectacular, and the vegetables on my plate were far from being cooked enough.  To top it all off, the waiter forgot to bring me my drink and didn't get it till after the meal was served.  The only great thing about this place is the quiet atmosphere and view.  Very relaxing.  For the food, I and all who were with me felt like we were getting ripped off.  Don't know why so many other reviewers rave about this place.  I went on a Saturday night and it wasn't too busy when we arrived early in the evening.\n\nedit: I changed my review from 2 to 1 star because several hours after reviewing, I came down with a nasty case of food poisoning.  I suspect the lukewarm chowder or the crab.  Eating here was really the only thing I had eaten all day besides for coffee and and a biscuit in the morning before leaving for san francisco, otherwise I would be hesitant to assume anything.", "rating": 1, "date": "2013-02-24"}, {"excerpts": ["the cioppino was great, nice bread and the crab cakes were tasty.   ", "There is a nice view out the window of the wharf.  ", "the staff was helpful, friendly and well versed in the menu.  ", "The decor is a bit dated, but it has a nice vibe.  ", "The hardest part is finding the entrance.  ", "can be a little confusing if you are not familiar with it.  ", "So I would certainly recommend this place.  ", "Next time you are in San Francisco, definitely have a meal here.\n", "Enjoy!"], "author": "Jeff P.", "review": "Right off, the Food was fantastic.   the cioppino was great, nice bread and the crab cakes were tasty.   There is a nice view out the window of the wharf.  the staff was helpful, friendly and well versed in the menu.  The decor is a bit dated, but it has a nice vibe.  The hardest part is finding the entrance.  can be a little confusing if you are not familiar with it.  So I would certainly recommend this place.  Next time you are in San Francisco, definitely have a meal here.\nEnjoy!", "rating": 5, "date": "2011-06-01"}, {"excerpts": ["I had hangups about this place because I came in late once for drinks and dinner and got a really skimpy plate of crab cakes. ", "BUT, we came in for lunch and my mom ", "and I split the cup of clam chowder/small salad with bay shrimp \"light lunch\" option and an order of the fish and chips. ", "The cups of chowder were small but REALLY good, i loved the fresh thyme flavor, not too many potatoes and big tender chunks of clams. ", "The salad was good, nothing to write home about, wasn't crazy about the dressing it came with (an emulsified vinaigrette). ", "The fish portion was small, ", "3 small pieces ", "but they were good, light crispy coating, well seasoned. ", "These are my qualms: the coke was low on syrup ", "so it was mostly soda water ", "and there's no free refills, and secondly my stepdad got the bread bowl of chowder ", "and it was filled almost an inch shy of the top of the smallish bread bowl with soup. ", "I felt like telling the server to have another ladle put in. ", "I really wish I had actually. ", "Overall the prices are good especially for the atmosphere you get and the beautiful waterfront view and the food was great tasting, just wish the portions were a tad more generous."], "author": "Emma H.", "review": "I had hangups about this place because I came in late once for drinks and dinner and got a really skimpy plate of crab cakes. BUT, we came in for lunch and my mom and I split the cup of clam chowder/small salad with bay shrimp \"light lunch\" option and an order of the fish and chips. The cups of chowder were small but REALLY good, i loved the fresh thyme flavor, not too many potatoes and big tender chunks of clams. The salad was good, nothing to write home about, wasn't crazy about the dressing it came with (an emulsified vinaigrette). The fish portion was small, 3 small pieces but they were good, light crispy coating, well seasoned. These are my qualms: the coke was low on syrup so it was mostly soda water and there's no free refills, and secondly my stepdad got the bread bowl of chowder and it was filled almost an inch shy of the top of the smallish bread bowl with soup. I felt like telling the server to have another ladle put in. I really wish I had actually. Overall the prices are good especially for the atmosphere you get and the beautiful waterfront view and the food was great tasting, just wish the portions were a tad more generous.", "rating": 4, "date": "2013-02-18"}, {"excerpts": ["but he liked it) and crab cakes (he loved them too especially the mango salsa!). ", "One complaint though the women's bathroom was a mess!"], "author": "MaLissa Y.", "review": "Went for dinner and got a table that had a beautiful view of the GGB at sunset on a SATURDAY with no waiting!!! We both had one of the specials. I had cajun chicken pasta and my husband had the halibut (had a atom fish taste but he liked it) and crab cakes (he loved them too especially the mango salsa!). One complaint though the women's bathroom was a mess!", "rating": 4, "date": "2012-09-17"}, {"excerpts": ["we came here on a recent visit, and the service really sucked.  \n\nfor app, we order the crab cakes and mango salsa.  "], "author": "Hung-wei L.", "review": "we came here on a recent visit, and the service really sucked.  \n\nfor app, we order the crab cakes and mango salsa.  no jumbo lump crab meat; it was all the shredded bits.  the cakes were flat as pancakes, and very bland.  on the plus side, mango salsa was yummy.  that's probably the only thing that saved the dish.  \n\ni ordered the 2 maine lobster tails entree.  one was great, and the other was salty as hell.  something must've distracted the chef because it tasted like he double-seasoned it.  \"oooh look, something shiny!  oh crap, did i season this piece already?  oh well, let's hit it again with seasonings\".  sauteed veggies were very well done.\n\nwifey ordered the shrimp scampi, and she said it was good.  i didn't have a bite, though.  \n\nmy son had the kids fried seafood platter- lots of calamari, 3 large shrimp, a piece of cod, and a large scallop.  the calamari, shrimp, and cod was good, but the scallop was...spit out.\n\nmy youngest daughter had the beef ravioli.  i'm not a fan of ravioli, but kid totally plowed the plate.  not sure if it was because of severe hunger, or if it truly was tasty.  \n\nfor dessert, i ordered the tiramisu, and it was unlike anything i've ever eaten before.  the marscapone was thick and heavenly.  is it supposed to be that way, or is it supposed to be light and airy?  nevertheless, it was....WOW.  that's all i gotta say.  \n\nin summary, 1 star for 1 good lobster tail.  1 star for the incredible tiramisu.  \n\ndid i mention the service sucked??  restaurant was 2/3 empty, yet our waiter was scarce.  and there was definitely NOT a lack of servers", "rating": 2, "date": "2012-04-08"}, {"excerpts": ["Prawns were dried out, crab cakes were very bland. ", "Service was very attentive though. ", "In summary, a mediocre tourist trap.  ", "Would be surprised if any locals actually return to eat here."], "author": "Mark L.", "review": "The dining room was classy, the service very attentive, unfortunately the food wasn't nearly in the same caliber. The crab was the same as sold on the sidewalk outside. Ok, not good, not bad. Prawns were dried out, crab cakes were very bland. Service was very attentive though. In summary, a mediocre tourist trap.  Would be surprised if any locals actually return to eat here.", "rating": 2, "date": "2012-01-03"}, {"excerpts": ["I had a cup of the clam chowder and crab cakes. ", "We had a beautiful view of the marina. ", "The service was great and the food delicious. ", "The ingredients are fresh and simple and I enjoyed every bite. ", "I'd definitely go here again."], "author": "Jackie T.", "review": "I went here for lunch while in San Francisco for a conference. I expected it to be touristy - high prices but not high quality. I was pleasantly surprised. The food was great! I had a cup of the clam chowder and crab cakes. We had a beautiful view of the marina. The service was great and the food delicious. The ingredients are fresh and simple and I enjoyed every bite. I'd definitely go here again.", "rating": 4, "date": "2011-02-26"}, {"excerpts": ["Crab cakes were not. ", "They didn't even taste like crab cakes! ", "They were bland with a mushy consistency. "], "author": "Felicia H.", "review": "Had dinner here last night and was not impressed AT ALL.  \n\nFood scaled from okay to not good, like I could've cooked a better meal at home. Calimari and clam chowder were good.  Crab cakes were not. They didn't even taste like crab cakes! They were bland with a mushy consistency. Pasta with mussels were standard; not special. \n\nService was mediocre. Waitress was slow.\n\nAnd for some reason, the bathroom had a pile of broken Cheez-its all over the counter that gave the room a bad funk. And not your typical bathroom funk. \n\nThe view was nice. 90s soft rock = not cool\n\nWouldn't dine here again.", "rating": 2, "date": "2008-09-21"}, {"excerpts": ["I ordered clam chowder and crab cakes and my husband ordered the scallop and shrimp angel hair pasta. ", "The crab cakes were good, but not the best I've had... ", "they were bready. ", "The soup was typical of San Francisco clam chowder. ", "My husband's pasta was very bland for our taste, though the scallops were yummy. ", "It really wasn't good enough for us to go again."], "author": "Jessika R.", "review": "My husband and I went here for lunch... I ordered clam chowder and crab cakes and my husband ordered the scallop and shrimp angel hair pasta. The crab cakes were good, but not the best I've had... they were bready. The soup was typical of San Francisco clam chowder. My husband's pasta was very bland for our taste, though the scallops were yummy. It really wasn't good enough for us to go again.", "rating": 3, "date": "2011-05-31"}, {"excerpts": ["It had the best clam chowder and crab cakes. ", "The past three times we were here ", "the food was not good at all. ", "Chowder was tasteless and I dont think mine had any clams in it . ", "Full of potatoes. ", "They also don;t dig out much of the bread from the bread bowl so you get very little chowder. ", "The crab cakes tasted like they were full of fillers with no crab taste at all. ", "Very disappointed."], "author": "Tina B.", "review": "We used to eat at their sidewalk cafe every time we went to San Francisco, which is about 4 times a year. It had the best clam chowder and crab cakes. The past three times we were here the food was not good at all. Chowder was tasteless and I dont think mine had any clams in it . Full of potatoes. They also don;t dig out much of the bread from the bread bowl so you get very little chowder. The crab cakes tasted like they were full of fillers with no crab taste at all. Very disappointed.", "rating": 1, "date": "2013-03-30"}, {"excerpts": ["I had the crab cakes, they were identifiably crab cakes, but nothing better than I could have gotten from the frozen food section at my grocery store.  ", "The \"roasted\" potatoes and mixed vegetables that came with my meal were bland and drenched in butter.  ", "The fish & chips were actually very good, the one bright spot on the menu.  ", "Everything else, eh. ", "Our server was very polite, attentive and prompt.  ", "It's not BAD food, mind you, it's just that there are so many great restaurants in San Francisco", ", there's no reason to spend your money here.  ", "If you have to go, you'll find something decent on the menu, but if you have a choice, try someplace else."], "author": "Rebecca S.", "review": "I can't believe this place gets 3 1/2 stars.  I understand the crowdsourced restaurant review may skew high or low, but wow.  Food was completely predictable, almost universally deep-fried, served with what tasted like bottled sauces.  I had the crab cakes, they were identifiably crab cakes, but nothing better than I could have gotten from the frozen food section at my grocery store.  The \"roasted\" potatoes and mixed vegetables that came with my meal were bland and drenched in butter.  The fish & chips were actually very good, the one bright spot on the menu.  Everything else, eh. Our server was very polite, attentive and prompt.  It's not BAD food, mind you, it's just that there are so many great restaurants in San Francisco, there's no reason to spend your money here.  If you have to go, you'll find something decent on the menu, but if you have a choice, try someplace else.", "rating": 2, "date": "2012-03-20"}, {"excerpts": ["Dissapointing garlic fries (so don't order it) and i was quite dissapointed with the crab cakes...but good service!"], "author": "Jaimee T.", "review": "Dissapointing garlic fries (so don't order it) and i was quite dissapointed with the crab cakes...but good service!", "rating": 3, "date": "2007-10-21"}, {"excerpts": ["We always eat at the stand outside and not in the restaurant and our standing favorites are clam chowder in a bread bowl and crab cakes ", "Both are excellent. ", "Its nice that they offer tables on the street to sit and eat unllike the other stands where you have to stand and figure it out. ", "Will continue going here."], "author": "P From CA C.", "review": "Have been eating here for some time now. We always eat at the stand outside and not in the restaurant and our standing favorites are clam chowder in a bread bowl and crab cakes Both are excellent. Its nice that they offer tables on the street to sit and eat unllike the other stands where you have to stand and figure it out. Will continue going here.", "rating": 4, "date": "2010-02-15"}], "sopa di pesce": [{"excerpts": ["I ordered half of a Dungeness crab, and my fiance ordered the Sopa di Pesce. ", "I think that literally means \"fish soup\". ", "My crab came with a small cup of clam chowder, and it was SO TASTY! ", "It was so good that my fiance immediately ordered a cup for himself! ", "I only wish that for $8, they'd give you a bigger cup, ", "but oh well. ", "My fiance's Sopa di Pesce was enormous, though. ", "He is a big eater, but he couldn't finish it on his own. ", "I highly recommend it. ", "It's essentially fish and clams in marinara sauce, but god is it DELICIOUS!! ", "They're also REALLY gratuitous with the salmon in this soup. ", "Perfect for a salmon lover like me! "], "author": "Jaimie C.", "review": "tl;dr\nThis place is definitely worth going to if you want a reasonably priced, nice, sit down dinner with a view. It's romantic and cute. However, the service isn't the best.\n\nLong Review:\nI was visiting Fisherman's Wharf with my fiance, and this place came up as something that could fit our budget.\n\nThings were a bit weird, at first. We were looking at a menu downstairs before deciding whether or not to go upstairs to a table, and some dude in all black started talking to us. We couldn't hear anything he was saying, and he was just...weird and rude when we tried to tell him that we couldn't hear him. We eventually just ignored him and went upstairs. Turns out he works there as a waiter! Additionally, he was the only waiter that didn't have his shirt tucked in and had stains on his shirt. Just saying. Hope he shapes up or gets let go. \n\nAfter we were seated (by a different, nicer waiter), things got a lot better. We got a table by the big windows looking out onto the water, and the view was lovely. Each table also had flowers in little white vases, which was a nice touch.\n\nI ordered half of a Dungeness crab, and my fiance ordered the Sopa di Pesce. I think that literally means \"fish soup\". My crab came with a small cup of clam chowder, and it was SO TASTY! It was so good that my fiance immediately ordered a cup for himself! I only wish that for $8, they'd give you a bigger cup, but oh well. It would probably be better to pay a couple dollars more for a bread bowl if you want to get full off of this chowder.\n\nThe crab was very, very, very delicious, but smaller than I thought. The waiter wasn't helpful in letting me know how big my food would be when I asked before ordering, so I went with the half when I should have gotten a whole crab. Get a whole crab. DO IT--unless you eat like a bird.\n\nMy fiance's Sopa di Pesce was enormous, though. He is a big eater, but he couldn't finish it on his own. I highly recommend it. It's essentially fish and clams in marinara sauce, but god is it DELICIOUS!! They're also REALLY gratuitous with the salmon in this soup. Perfect for a salmon lover like me! :)\n\nAt this point, the service started to suffer. The waiter didn't really come around to refill our water for a good hour. The reason we hung around so long was due to our dessert--which took a while to bring out--and the fact that they took forever to bring us a check. We shared a key lime pie that was heavenly, but after getting so full, both of us just wanted to leave. It took the servers at least 30 minutes to get us our check, and I really wasn't a fan of that. This was especially disappointing, given the fact that the restaurant was fairly empty. I would be more understanding if the place was busy.\n\nWhile I am a fan of the food and the gorgeous view, the service here needs some improvement. However, it was an overall great experience! I would come back again.", "rating": 4, "date": "2015-08-15"}], "seafood platter": [{"excerpts": ["The seafood platter featured frozen fish fillet...", "Mrs. ", "Paul's? ", "I cannot belief ", "you can't get fresh fish at Fisherman's wharf. ", "The batter was bland and tasteless. ", "The calamari was rubber. \n", "With their prime location, it's time to reinvent themselves from top to bottom. \n", "They can easily become THE seafood restaurant on the wharf, but not in it's present state."], "author": "Stephen D.", "review": "Were it not for the spectacular views, I would have only given one star. The restaurant itself is stuck in the 70's and in serious need of renovations. The carpet is just plain disgusting with stains and wear. \nThe seafood platter featured frozen fish fillet...Mrs. Paul's? I cannot belief you can't get fresh fish at Fisherman's wharf. The batter was bland and tasteless. The calamari was rubber. \nWith their prime location, it's time to reinvent themselves from top to bottom. \nThey can easily become THE seafood restaurant on the wharf, but not in it's present state.", "rating": 2, "date": "2018-06-03"}, {"excerpts": ["My youngest got the fried seafood platter. ", "And wow... ", "This was not chips sized. ", "Huge basket of food. ", "Though she only got one scallop and prawn "], "author": "Sean G.", "review": "First visit to the wharf in over 20 years and I made a tourist mistake.... I ate at a restaurant and not the \"market\".\n\nWhen you crave seafood and you want fresh this seems like a decent place at first. It's more formal than most places and the prices are about equal in the area.   But what's wrong? I ate inside and not at the stand. \n\nFirst the upstairs dining area has almost a convention or wedding setting to it. Just large open area that seems it is better suited to be rented out for special occasions. \n\nNext was the food.... Now this was not all bad. The chowder was good. Not the best I have ever had but it was a solid 6.5 out of 10. For the main course I ordered the seafood fettuccini with baby shrimp and baby scallops. Some of the scallops were over cooked to the point of ruining their texture. The white sauce was bland and relied more on the seafood to give it flavor. \n\nWife ordered the mushroom and shrimp pasta that she enjoyed but could not finish. I complained to her that it had way to much mushroom kick to it but she liked it.  So if you love mushrooms that is the plate for you. \n\nMy youngest got the fried seafood platter. And wow... This was not chips sized. Huge basket of food. Though she only got one scallop and prawn it was huge among of calamari and fish. \n\nI know in the future I will not eat in the restaurant again... Unless for a wedding. But I will be visiting the stand for some chowder and crabs", "rating": 3, "date": "2016-01-01"}, {"excerpts": ["I liked seafood platter too, it's quite filling. "], "author": "Sandeep K.", "review": "I loved the clam chowder soup,  it's yum. I liked seafood platter too, it's quite filling. Crab cakes weren't the best. \nI got a very nice spot. I enjoyed the sunset. I would recommend others to come here and enjoy the view and food.", "rating": 4, "date": "2016-04-05"}, {"excerpts": ["I also tried the seafood platter which was good. ", "Props to the service for allowing us to change the tilapia for cod. ", "It was a great choice. ", "The garlicky vegetables on the side were surprisingly tasty. "], "author": "Augusto T.", "review": "Great cioppino.\n\nTarantino's is one of the many classic Italian seafood restaurants at Fisherman's Wharf. All of these restaurants walk the fine line between classic and tourist trap. One in doubt, stick to the basics. The San Francisco dish cioppino is great here. Awesome flavor, loaded with tons of seafood (including crab and tons of bay scallops), and accompanied by a very delicious sourdough garlic bread. Have no doubt, this is the dish to order here. \n\nI also tried the seafood platter which was good. Props to the service for allowing us to change the tilapia for cod. It was a great choice. The garlicky vegetables on the side were surprisingly tasty. Their clam chowder is not bad either. \n\nThe one disappointing dish was the pan-fried scallops. It just was not right. They didn't have a nice sear, were somewhat gummy, and the sauce did not help. We should have stuck with the basics. Props to the restaurant for taking them off our bill once we pointed out that the dish was disappointing (especially when compared to the other great dishes). \n\nService was good and the cioppino was great. I would definitely come back.", "rating": 4, "date": "2015-05-25"}, {"excerpts": ["We ordered the seafood platter for my daughter, and the seafood was fresher than mine with pieces of scallops, calamari, and shrimp."], "author": "Tinyee H.", "review": "Great views of the bay and marina, especially when you get a window seat. Service was slow on New Year's Day and the hostess seemed that she didn't want to be there. When she set the table, she threw the silverware on the table and gave us a dirty look. Where's the smile?\n\nThe clam chowder was creamy like everyone said, but mediocre in taste and quality. The rest of the food is typical of other seafood restaurants. I had the lunch special cod fish and chips, and it tasted like they were from the frozen aisle at the grocery store. Really?? We ordered the seafood platter for my daughter, and the seafood was fresher than mine with pieces of scallops, calamari, and shrimp.", "rating": 2, "date": "2013-01-05"}, {"excerpts": ["I ordered the Chicken Parm and my boyfriend ordered the Seafood Platter.  ", "So much food!!  "], "author": "Alissa A.", "review": "Came here last night for our New Years Eve dinner.  Everything was amazing!\n\nWe made reservations online since we were thinking this place would be packed on NYE.  The process to reserve a table was incredibly easy.\n\nThe place really wasn't crowded at all when we got there, which I still don't understand... The view is amazing - it's right on the water and you can watch the boats come in and out, as well as see people walking up and down the Wharf (we love to people watch!).  The food was delicious.  I ordered the Chicken Parm and my boyfriend ordered the Seafood Platter.  So much food!!  I also had a glass of wine and he had a Manhattan - he said it was strong but the best he's had.  \n\nThe service was also perfect.  They were polite and courteous, attentive and quick in taking our order, bringing the food out, and all that good stuff.  \n\nI would definitely recommend coming here for a date night.", "rating": 5, "date": "2015-01-01"}, {"excerpts": ["Other people in my party ordered the seafood platter (apparently the scallops were very good, but nothing else from this dish), fresh oysters on the half shell (very mediocre at best),  sandabs (good), trout (\"bland\"), and seafood pasta (shrimp was rubbery and overcooked).  ", "This place was also very expensive and not worth it at all.  ", "We were all very disappointed.  :-("], "author": "Nikolette C.", "review": "Do yourself a favor and skip this place.  Despite a few high notes, overall this place was pretty pathetic.  Yes, the setting was nice, as well as the server, but unfortunately the service was not up to par.  For example, we had to ask for refills (which took much longer than it should have) and ask for our check (after waiting at least 10 minutes when it was clear we were ready to leave).  I'm also fairly certain my fish 'n chips came from a frozen bag of salt.  Some of the worst fish I've ever had before.  The clam chowder was flavorful but too thick for my liking.  Other people in my party ordered the seafood platter (apparently the scallops were very good, but nothing else from this dish), fresh oysters on the half shell (very mediocre at best),  sandabs (good), trout (\"bland\"), and seafood pasta (shrimp was rubbery and overcooked).  This place was also very expensive and not worth it at all.  We were all very disappointed.  :-(", "rating": 1, "date": "2014-07-12"}], "combo saute": [], "hot fudge sundae": [], "new york style cheesecake": [], "florida key lime pie": [], "biscotti": []}