{"potsticker": [{"excerpts": ["The Potsticker in Chinatown is one to name.\n\n"], "author": "Phat Hippo L.", "review": "Let's talk about the food.  Its tasty here.  The chi fan -chinese dough nut with preserved vegetables and a dried pork product wrapped with rice,  is what I like about this place.  I'm not sure of any other joints that serve this product, except for the late and great \"Star Lunch\" which shut down.  There are also a handful of dishes that stand out. The apps and most of their dumplings are tasty, especially the scallion pancakes.  The pancakes were nice and chewy, with that eggy fried dough crisp on the outside.  \n\nMost of the noodle dishes were good, up to par with the very best of other noodle shops, but on the oily side.  Most of the stuff was good at best, and there wasn't anything exceptional.\n\nService lacks here, and prices you pay will dent your wallet.  This is overly priced Chinese food.  With the price you pay, you'd expect better service and bigger portions of food.  It's sad that you pay 7 bucks for 4 small chicken wings.  The accompanying dip is good, but hey, its just 4 dinky wings.  On top of that, the chicken isn't like organic or steroid free.  So what justifies the high price dishes? The service isn't high-end or professional, and the seating experience isn't armed tablecloth.   You can get the same quality tasting food in just about 3 other handfuls Chinese restaurants in the city. The Potsticker in Chinatown is one to name.\n\nI know, Taiwanese, and Pekingese dishes are different.  But really, its all identical dishes but finished differently with each Chef's style and touch.  I know the $80 dollar dinner -spent here between two people, could've done more good at another Chinese restaurant with better experiences.  If you plan to pay, I don't mind coming here, otherwise, money is well spent somewhere else.", "rating": 3, "date": "2008-03-26"}], "deep fried squid": [{"excerpts": ["So we got that, chive pocket, sticky rice with pork, crepe with oyster, and deep fried squid.\n\n"], "author": "Ari C.", "review": "If there's one thing I'm good at, it is being a third wheel. I went to the Yelp Prom (http://www.yelp.com/events/oakland-enchantment-by-the-sea-prom-to-benefit-hands-on-bay-area) with Kerrie and her 1HMF and I was being a complete darling by taking lots of pictures of them together, urging them to dance, and most importantly, leaving them alone when they wanted to make out. I'm good at picking out cues they gave out when they're trying to tell me to get lost.\n\nI'm kidding. They're nice people. 1HMF was so nice that when we went to Taste of Formosa for dinner before the prom, he paid for everything.\n\nTaste of Formosa is a Taiwanese restaurant that's apparently a rarity in SF. I don't know if it's authentic or not because I've only been to Taiwan once and the last Taiwanese restaurant I went to was in Singapore.\n\nSo we just picked some snack items that sounded good. 1HMF recommended the green onion pancake because according to him, Ed to the M swears by it. And who am I to question the great Ed to the M, the ultimate chink? So we got that, chive pocket, sticky rice with pork, crepe with oyster, and deep fried squid.\n\nThe green onion pancake was pretty good. Not something I'd swear by though *ducks rocks thrown by Ed's fans*. The crepe was a little weird. It looked like egg foo yung and tasted like gluten. I think I like the sticky rice and the calamari the best. The chive pocket was okay. I think it gave me bad breath for the rest of the night. Those of you who talked to me at the prom, I'm sorry if my breath offended you.\n\nFive snack plates were actually pretty fulfilling. No need to get full plates, and you get to taste a variety of dishes for reasonable price. I think the bill came to about $30 for everything. Service was fine, a little slow in the beginning, but nothing majorly irritating. \n\nOverall, that dinner was a nice opening for the prom night. Thanks, Kerrie and 1HMF, you guys are awesome. Next time just tell me directly if you guys want some room to make out and I'll go away.", "rating": 4, "date": "2008-02-19"}], "cold noodle with shredded chicken salad": [], "sweet corn soup with minced chicken": [], "homemade sweet soy bean milk": [], "salted soy bean milk": [{"excerpts": ["We were hungry so we ordered lots of snacks to eat:\n\nCold salted soy bean milk - this went well with the dishes - sometimes "], "author": "Nette T.", "review": "I had a great lunch here with my friend who is Taiwanese. I don't eat Taiwanese food that often so it was good to go with someone who can order for the both of us!\n\nWe were hungry so we ordered lots of snacks to eat:\n\nCold salted soy bean milk - this went well with the dishes - sometimes when things come out piping hot, you need something to cool it down. \n\nPopcorn chicken - a delightful snack food of perfectly fried pieces of chicken that was crunchy on the outside and yummy on the inside. \n\nMarinated cucumber - crunchy cucumber, pickled with chili sauce to add a kick. \n\nBraised Beef With Noodle Soup  - tender braised beef with spicy noodles, this is one of my favorite dishes. This is comfort food to me. \n\nStinky tofu - I used to be afraid of stinky tofu but I've grown to love it. And I love the stinky tofu at Taste of Formosa. Perfectly fried - crunchy on the outside and soft on the inside. \n\nSteamed sticky rice with pork - steamed in banana leaf with bits of pork. Lots of flavor and sticky rice is perfect texture - not too gummy.\n\nEverything was really good and I loved all the dishes my friend picked. The restaurant is a little small so it can get busy fast.", "rating": 5, "date": "2018-06-26"}], "sticky rice roll": [{"excerpts": ["Salted sticky rice roll, oyster and pork intestine vermicelli noodle soup, and fried squid balls are all yummy and close to what we had in Taiwan. ", "However, I give it 2 stars because of a health issue. ", "We found a white, fluffy mold on the cold marinated seaweed when we already finished 1/3 of it... ", "Also, the restaurant is not clean. ", "The wall is greasy and dirty. ", "I really want to like this restaurant because the food is good, but I think we will not go back again because of the health issue."], "author": "Tiffany C.", "review": "My husband and I are from Taiwan. We have been living in the US for a while and miss Taiwanese street food so much. We were very excited to try this restaurant when we found it. The food is delicious. Salted sticky rice roll, oyster and pork intestine vermicelli noodle soup, and fried squid balls are all yummy and close to what we had in Taiwan. However, I give it 2 stars because of a health issue. We found a white, fluffy mold on the cold marinated seaweed when we already finished 1/3 of it... Also, the restaurant is not clean. The wall is greasy and dirty. I really want to like this restaurant because the food is good, but I think we will not go back again because of the health issue.", "rating": 2, "date": "2018-03-03"}, {"excerpts": ["I love sticky rice roll but their rice is moist/wet and doesn't stick together. \n\n"], "author": "Sandy B.", "review": "I miss Taiwan therefore I was so happy that they have a taiwan restaurant in the city. It's nothing like taiwan but I still like coming here. This place is pretty pricey, especially for their portion size, isn't big. Can't come here everyday. Not everything is good, work close by so I have tired many things on the menu. I love sticky rice roll but their rice is moist/wet and doesn't stick together. \n\nMy favorite dish is the braised pork over rice, make sure you add an egg. Also I like their cold braised tofu. Since other things on the menu isn't great, I just get the same thing every time.", "rating": 3, "date": "2015-11-14"}, {"excerpts": ["For appetizers, we ordered Salty Sticky Rice Roll and the Pork and Chives Dumplings. ", "They were both delicious and pretty standard. "], "author": "Emily L.", "review": "It is pretty hard to come across Taiwanese restaurants in the city. Taste of Formosa, fulfills that craving. \nI came here on a cold night with my boyfriend. For appetizers, we ordered Salty Sticky Rice Roll and the Pork and Chives Dumplings. They were both delicious and pretty standard. I was feeling adventurous and ordered the Squid with Vegetable Soup and Rice Noodles. I felt pretty indifferent about my dish. The soup was very favorable and you can taste the XO sauce; not to mention, it was very thick. My boyfriend ordered the Braise Beef with Noodle Soup and that was the winning dish for the evening. It was not as spicy as I thought it would be; the beef was cooked perfectly and the flavors of the soup complimented the whole dish.\n\nOverall, this place definitely has a lot of potential. The only con is that parking around this neighborhood is a challenge. However, they do validate parking! :)", "rating": 3, "date": "2015-05-18"}, {"excerpts": ["I ordered the salted sticky rice roll, and fried sauce noodle  (similar to the korean black noodle), and my boyfriend ordered oyster vermicelli soup and satay beef. ", "I did not really like the oyster vermicelli, but that is because I don't really like cooked oysters. ", "My boyfriend enjoyed it a lot and said he likes how it has the consistency of shark fin soup. ", "My fried sauce noodle was okay, not as good as the korean black noodle though. ", "The satay beef was pretty good, a bit pricey for the few pieces of meat though... ", "but anyways... I LOVED the salted sticky rice roll!!! ", "It is soooo hard to find a place that makes sticky rice rolls and that actually have fresh crunchy oil sticks  in it. ", "So happy I finally found yummy salted sticky rice roll!"], "author": "Alicia W.", "review": "My new favorite place to eat! I have passed by this place many many times, but never actually tried this place. But ever since I went to Taiwan, I started to crave for Taiwanese food... and within one week, I came here twice.\n\nFor my first visit, I had the braise beef noodle soup , the minced pork over rice , and mapo tofu. I loved the beef noodle soup, the soup was flavorful and a bit peppery which was exactly what I wanted. The minced pork over rice was average, it was definitely nowhere near the one that I had in Taiwan, but it wasn't bad. The mapo tofu was cooked perfectly, but was not spicy at all... even though we asked them to make it as spicy as possible. Still, I was very very happy with my beef noodle soup, so I don't care about anything else.\n\nNow for my second visit. I ordered the salted sticky rice roll, and fried sauce noodle  (similar to the korean black noodle), and my boyfriend ordered oyster vermicelli soup and satay beef. I did not really like the oyster vermicelli, but that is because I don't really like cooked oysters. My boyfriend enjoyed it a lot and said he likes how it has the consistency of shark fin soup. My fried sauce noodle was okay, not as good as the korean black noodle though. The satay beef was pretty good, a bit pricey for the few pieces of meat though... but anyways... I LOVED the salted sticky rice roll!!! It is soooo hard to find a place that makes sticky rice rolls and that actually have fresh crunchy oil sticks  in it. So happy I finally found yummy salted sticky rice roll!", "rating": 4, "date": "2011-07-23"}, {"excerpts": ["Our Sticky Rice Roll was next. ", "The rice was fully cooked, a challenge for this stuff so that was good. "], "author": "M C.", "review": "Came here because a friend said they had a nice stinky tofu in the city so had to come and try. Sat down for awhile and finally decided on a few plates. Right after we ordered was when they started eating, opening at 11:30pm. They were more focused on lunch than us. \n\nWe had the Mao Po Tofu. The amount that was in that big bowl was equal to 2 rice bowls. The flavor was nothing special. No spices but salt and chili pepper oil.    \n\nOur Sticky Rice Roll was next. The rice was fully cooked, a challenge for this stuff so that was good. Had a crispy piece of Chinese donut in the center, but the lack of dried pork made the dish almost flavorless. \n\nOur Deep Fried Intestines was the best. It is very hard to screw this up other than them not cleaning it properly. Since we didn't get sick, I guess they did.\n\nThe last plate to come was the Stinky Tofu. The proper way of eating is with the pickled cabbage, but there wasn't enough of it. The tofu had a lite hint of smell and so was the taste.", "rating": 3, "date": "2011-08-08"}, {"excerpts": ["Salty sticky rice roll: only available on weekend; tastes okay, but a real lousy job at wrapping the roll, everything was just hanging out...\n2. ", "cold noodles: ", "meh\n3. ", "Taiwanese rice noodles: not exactly authentic, but not bad\n4. salt & pepper chicken: never again\n5. "], "author": "daphne w.", "review": "Came by on the weekend around 2 in the afternoon, and they're still fairly busy.  Service was good though.\n\nWe ordered - \n1. Salty sticky rice roll: only available on weekend; tastes okay, but a real lousy job at wrapping the roll, everything was just hanging out...\n2. cold noodles: meh\n3. Taiwanese rice noodles: not exactly authentic, but not bad\n4. salt & pepper chicken: never again\n5. stinky tofu: best dish of the bunch\n\nWithout any competition in the city for Taiwanese food, we'll stop by if a craving for stinky tofu strikes, in spite of their prices.", "rating": 3, "date": "2015-02-21"}], "beef pies": [{"excerpts": ["The beef pies were also not as tasty as I would have liked -- the texture of the meat was a little too loose and tasted like butter, which was really odd.\n\n"], "author": "Mitzi C.", "review": "Really tasty taiwanese snacks, but I do have to disagree with some of the other yelpers on certain items.  \n\nGreen onion pancake was just OK -- needed more flavor and green onions.  Also, wasn't exactly the authentic version, but I digress.  The beef pies were also not as tasty as I would have liked -- the texture of the meat was a little too loose and tasted like butter, which was really odd.\n\nI really enjoyed the \"tainam style bowl cake\" (ba wan), the \"sticky rice in pork chitterling\" (luo mi da tsang), the \"braised pork over rice\" (lu rou fan), and the \"oyster crepe with special sauce\" (o wa jian) -- really made me miss the food in taiwan.  And the items were wayyyyy less greasy than what you'd normally find in your taiwanese night market.  This is definitely a place I'd take my very very picky parents when they come visit -- and I think they'd actually enjoy it instead of ranting about how expensive and bad the chinese food in the bay area is...but again, I digress.\n\nI also came to the realization that \"Taiwan Beer\" is actually pretty good -- who knew?  That deserves an extra star in itself.", "rating": 4, "date": "2007-08-09"}], "taiwanese potstickers": [{"excerpts": ["I have been looking all over the city for Taiwanese potstickers and this place has them!  ", "Ok this place isn't the easiest to find.  ", "The only reason I lucked out in finding this place was because AK Subs was a block away!  ", "The parking situation is hellish day and night... the best time to come for dinner is around 7:45pm to snag at the VIP Bus Stop parking spaces.  ", "The scallion pancakes(OMG GOOD), the legendary Taiwanese potstickers, the crispy fried TOFU!, and the Savory Rice Roll! ", "just blew me away!!  ", "I mean everything I had on that day was super delicious!  ", "And I was for sure that I wasn't being lulled away by Jay Chou singing on the flat panel TV screen.  ", "The food was really really good.  ", "The only thing to remember is although the price range is moderate $11-30... its very easy to fall within the high $20s/per person on this bill.  "], "author": "Benny S.", "review": "I am in love with this place!  Let me just say.. Taste of Formosa was what I was looking for in the city.  I have been looking all over the city for Taiwanese potstickers and this place has them!  Ok this place isn't the easiest to find.  The only reason I lucked out in finding this place was because AK Subs was a block away!  The parking situation is hellish day and night... the best time to come for dinner is around 7:45pm to snag at the VIP Bus Stop parking spaces.  Ok enough with the foreplay..\n\nI walked in with a party of 4 and was greated nicely by the hostess.  We were seated in the spacious 2nd floor almost immediately after we passed the doors.  We were seated near the windows, which have a nice view of Clement and our cars.  We were offered water and tea and also a menu each.  As we sat down, I noticed the seats were very nice and the table was very sturdy.. not like the ones you find at other Chinese restaurants that seem like motorized bulls.  They even had a Plasma looping Chinese/Taiwanese music videos and concerts!\n\nEverything I ordered here was excellent!  I started with the Honey Green Tea drink(mmMm)  The scallion pancakes(OMG GOOD), the legendary Taiwanese potstickers, the crispy fried TOFU!, and the Savory Rice Roll! just blew me away!!  I mean everything I had on that day was super delicious!  And I was for sure that I wasn't being lulled away by Jay Chou singing on the flat panel TV screen.  The food was really really good.  The only thing to remember is although the price range is moderate $11-30... its very easy to fall within the high $20s/per person on this bill.  Everyone working here was very friendly, the owner even came up to serve us Taiwanese Pork Ball Soup!  She chatted with us about how the service was and how the food was.  I can definately say... this place is 5 stars in my book!\n\nOh remember to pick up a Take-Out Menu... They deliver in nice packaging!  The delivery guy is my favorite he is smiling rain or shine!", "rating": 5, "date": "2007-05-18"}, {"excerpts": ["I could hardly resist their onion pancakes, taiwanese potstickers, and the bird's nest made of taro and filled with vegetables (I fogot the name of the dish.) ", "The environment is nice and comfortable to hang out for a good chat. ", "Price range is geared towards the expensive side for such a small portioned plate. ", "I would only come to this place when I feel that I have extra cash in my pocket."], "author": "Pommie S.", "review": "I hardly see the restaurant filled up with customers and I had a hard time understanding why because their food is so delicious! I could hardly resist their onion pancakes, taiwanese potstickers, and the bird's nest made of taro and filled with vegetables (I fogot the name of the dish.) The environment is nice and comfortable to hang out for a good chat. Price range is geared towards the expensive side for such a small portioned plate. I would only come to this place when I feel that I have extra cash in my pocket.", "rating": 4, "date": "2009-08-13"}], "chives pocket": [], "pork dumpling": [{"excerpts": ["When you go the next time, try the Mushroom Soup w/ Pork Dumpling (hsiang gu rou geng), or the Taiwanese Bamboo Wrap (rou tsong), or the udong noodle, or the soymilk, which is absolutely delicious & housemade/homemade. ", "The owner, Katie is Taiwanese, mother of 2 cute little ones. ", "One conversation with her about her passion for Formosan food & quality of food will win you over. ", "She speaks quality. "], "author": "M L.", "review": "When I evaluate my experience with restaurants, I always consider the following:\n1. Service;\n2. Quality of Food;\n3. Ambiance, which attributes to dining pleasure\n\nFor Taste of Formosa, my every visit has always been:\n1. Service: 5\n2. Quality of Food: 5\nAmbiance: 4 After all, unless this is my own home/business, there's going to be style difference on the decor, right.\n\nI've also had them deliver food, and I noticed they use the high-end, quality paper container (not the cheapy paper painted red, nor plastic containers - when hot food gets in plastic, any kind of plastic regardless of the \"safety\" claim, it always produces chemical toxins released from the plastic), and the chopsticks they included run smooth on the fingers & are substantial - again says QUALITY & their WILLINGNESS to INVEST in food safety for customers & business presentation.\n\nMost of their dishes are Taiwanese, which has island flares. When you go the next time, try the Mushroom Soup w/ Pork Dumpling (hsiang gu rou geng), or the Taiwanese Bamboo Wrap (rou tsong), or the udong noodle, or the soymilk, which is absolutely delicious & housemade/homemade. The owner, Katie is Taiwanese, mother of 2 cute little ones. One conversation with her about her passion for Formosan food & quality of food will win you over. She speaks quality. If she's ever going to open more restaurants, I'll for sure be a loyal customers.\n\nI could go on & on. To sum up, if you're interested in SERVICE AND QUALITY of FOOD, not the superficial long line on the sidewalk/crowd scene, and you need a restaurant with clean, food safety conscious, trusted kitchen, Taste of Formosa is worth a visit, two visits & more.\nI've been going since 2005. They never failed me.", "rating": 5, "date": "2010-05-12"}], "chives shrimp dumpling": [{"excerpts": ["Chives Shrimp Dumpling $7.25.  ", "There were about a dozen of these little flavorful pillows.  "], "author": "Jerry W.", "review": "OK, it was date night with the wife.  After the movie, we head for a quick dinner before picking up the kids.  All the other restaurants in the area was full, except for this place...should have been a clue.\n\nThe menu had hand written changes to the prices, but when you walk into the dining room you are hit with a interesting scent...sort of sourish smell to best describe it.\n\nAppetizer:\nChives Shrimp Dumpling $7.25.  There were about a dozen of these little flavorful pillows.  This is really good with or without the white vinegar they served on the side for dipping.\n\nMain Courses:\nBraised Beef Noodle Soup $8.25.  A bowl of udon style noodles in a spicy soup.  The beef is pretty tender considering its braised.  You can take the noodles out and eat it away from the soup for a not so hot meal.\n\nBraised Beef over Rice $8.25.  Looks more like a beef stew with carrots & turnips.  The sauce has just a bit of heat.  The rice is more on the side then under the beef.  The beef could use a bit more braising...like another hour or so...it was bit chewy.  The turnip is very bland, did not pick up any flavor from the sauce.\n\nBathroom:\nThere are 2 single unisex rooms.  Both rooms only had 1 light.  The one closest to the wall had the light over the toilet...the other room had the light over the sink.  There is also a motion sensor that turns on the light...must be cutting cost on utilities.", "rating": 3, "date": "2012-05-19"}], "chinese tamale in bamboo leave": [], "taiwanese style dumpling": [{"excerpts": ["As is Taiwanese Style Dumpling (ba-wan), very yummy.  ", "Not sure why it's translated as dumpling, it is more of a giant meat pocket.  \n", "We always get Pork with Vegetable soup with added rice noodle, not too greasy ", "and it tastes better than the Southland Taste in Cupertino.\n", "Clams with basils reminds me of little seafood restaurants along the coast of Taiwan and it is tasty.  ", "Braised brown pork over rice, boy do I feel like I was back in Taiwan eating those tasty boxed lunch they serve on the train or in fast food restaurant.  "], "author": "MooMoo L.", "review": "There is a lack of good, authentic Taiwanese food north of LA.  Taste of Formosa is one of the better ones, and more authentic in taste compare to some in the Bay Area.  I'd give it 3.5 stars but they deliver and the restaurant is very clean so I decide to round up the stars.\n\nDishes that always bring us back:\nScallion pancake is definitely outstanding, here they make it close to the style of hand-grab pancake (soh-juah bin).  As is Taiwanese Style Dumpling (ba-wan), very yummy.  Not sure why it's translated as dumpling, it is more of a giant meat pocket.  \nWe always get Pork with Vegetable soup with added rice noodle, not too greasy and it tastes better than the Southland Taste in Cupertino.\nClams with basils reminds me of little seafood restaurants along the coast of Taiwan and it is tasty.  Braised brown pork over rice, boy do I feel like I was back in Taiwan eating those tasty boxed lunch they serve on the train or in fast food restaurant.  Quite authentic.\n\nDishes that are not too bad, but you could definitely find at other restaurants that do it much better within 50 miles radius are:\nTaste of Formosa's Spicy Wonton is good but I like the sauce from Joy in Foster City.\nI also love pork kidney and am grateful they actually have it on the menu, but the slices are few and it should be considered an appetizer rather than charging the price of a main dish.  So far, only Happy Cafe, Little Shanghai in San Mateo and Hong Fu in Cupertino have better and more delectable pork kidneys.\nBraised Beef noodle soup is good with a solid soup base and the noodles are ok.  I like the one at Grace Garden in Burlingame.\nThe cold dishes overall not bad, but nothing too unique.\n\nI love the taste of these dishes but unfortunately these were the lower ranked dishes:\nThe oyster pancake and the oyster vermicelli are very tasty, especially the pancake where they use Taiwanese bak-choy and they are not too heavy on the sauce.  Unfortunately the key ingredient (oysters) didn't taste fresh.  I think they use frozen oyster which is too bad as we live in the bay area, and have access to fresh oysters.\n\nWish list: stinking tofu, savory stuffed rice ball soup, grilled corn.\n\nOverall, it's a delight to find this place that can somewhat satisfy a craving for Taiwanese night market food, and obviously we've been back several times.", "rating": 4, "date": "2007-12-02"}], "tainam style bowl cake": [{"excerpts": ["I really enjoyed the \"tainam style bowl cake\" (ba wan), the \"sticky rice in pork chitterling\" (luo mi "], "author": "Mitzi C.", "review": "Really tasty taiwanese snacks, but I do have to disagree with some of the other yelpers on certain items.  \n\nGreen onion pancake was just OK -- needed more flavor and green onions.  Also, wasn't exactly the authentic version, but I digress.  The beef pies were also not as tasty as I would have liked -- the texture of the meat was a little too loose and tasted like butter, which was really odd.\n\nI really enjoyed the \"tainam style bowl cake\" (ba wan), the \"sticky rice in pork chitterling\" (luo mi da tsang), the \"braised pork over rice\" (lu rou fan), and the \"oyster crepe with special sauce\" (o wa jian) -- really made me miss the food in taiwan.  And the items were wayyyyy less greasy than what you'd normally find in your taiwanese night market.  This is definitely a place I'd take my very very picky parents when they come visit -- and I think they'd actually enjoy it instead of ranting about how expensive and bad the chinese food in the bay area is...but again, I digress.\n\nI also came to the realization that \"Taiwan Beer\" is actually pretty good -- who knew?  That deserves an extra star in itself.", "rating": 4, "date": "2007-08-09"}], "sticky rice cake with pork": [{"excerpts": ["We ordered the braised beef noodle soup, sticky rice cake with pork, and Hakka style sliced pork belly. ", "Everything was well-seasoned and flavored but not overpoweringly so--just the way I love my food. ", "It's not the best Taiwanese I've had ", "but it's still authentic and hits the spot. "], "author": "S L.", "review": "After a month of complaining about my Taiwanese food craving to anyone who would listen to me, I finally came here on a few recommendations. \n\nI expected more people here for a Sunday lunch on Clement, but we were the only customers, which was fine by me. The restaurant is clean, cute and contemporary, and could easily have been transplanted straight from Taipei. \n\nWe ordered the braised beef noodle soup, sticky rice cake with pork, and Hakka style sliced pork belly. Everything was well-seasoned and flavored but not overpoweringly so--just the way I love my food. It's not the best Taiwanese I've had but it's still authentic and hits the spot. There's a wide variety of snacks and dishes on the menu that I'm already itching to go back and try. \n\nOnly downside for me is that I live on the complete opposite side of SF in South Beach, so I'm out of their delivery range. :(", "rating": 4, "date": "2009-05-27"}], "sticky rice stuffed in pork chitterling": [], "crepe with special sauce": [{"excerpts": ["We did family style:\n\nOyster Crepe with Special Sauce - i didn't particularly like this very much because it had a weird slimy texture but the sauce was pretty good.\n"], "author": "Anna L.", "review": "Came here on a Thursday night and it wasn't too busy so we got seated right away. The interior of the restaurant was very nice and neat and apparently there's an upstairs as well. The service was very good; the waitresses were very approachable and patient! The food didn't take very long to come out and was just okay for me, nothing really stood out. We did family style:\n\nOyster Crepe with Special Sauce - i didn't particularly like this very much because it had a weird slimy texture but the sauce was pretty good.\nGreen Onion Pancake - this was pretty good; very crispy and savory. This was less doughy and more crispy than the Chinese green onion pancake I'm used to\nBraised Ground Pork over Rice - this was probably one of my favorites of the night; portion size is not very big if it's for one hungry person\nBacon with Taiwanese cabbage - this was a refreshing dish; I would've loved if they used crispy bacon instead of regular bacon that was still chewy and you can still see all the fat\nPork with Vegetable Soup (added noodles for 50 cents) - this was a good dish; the dish had chunks of pork, shitake mushrooms, napa cabbage, carrots in a very thick soup - reminded me of chinese hot and sour soup.", "rating": 3, "date": "2014-03-28"}, {"excerpts": ["-Very good \nOyster crepe with special sauce-sauce taste ", "good but too much powder in my opinion.\n", "Overall,their food is great and worth the drive."], "author": "Ru L.", "review": "We ordered \nTaiwanese pot stickers-very good.\nSalt &pepper chicken tender-very good.\nStinky tofu-the best I have tried so far around bay area but I wish they'd give more      pickled cabbage.\nBraise beef with noodle soup-very good\nTaiwanese fried rice noodle-Very good \nOyster crepe with special sauce-sauce taste good but too much powder in my opinion.\nOverall,their food is great and worth the drive.", "rating": 4, "date": "2013-05-05"}, {"excerpts": ["da tsang), the \"braised pork over rice\" (lu rou fan), and the \"oyster crepe with special sauce\" (o wa jian) -- really made me miss the food in taiwan.  ", "And the items were wayyyyy less greasy than what you'd normally find in your taiwanese night market.  ", "This is definitely a place I'd take my very very picky parents when they come visit -- and I think they'd actually enjoy it instead of ranting about how expensive and bad the chinese food in the bay area is..."], "author": "Mitzi C.", "review": "Really tasty taiwanese snacks, but I do have to disagree with some of the other yelpers on certain items.  \n\nGreen onion pancake was just OK -- needed more flavor and green onions.  Also, wasn't exactly the authentic version, but I digress.  The beef pies were also not as tasty as I would have liked -- the texture of the meat was a little too loose and tasted like butter, which was really odd.\n\nI really enjoyed the \"tainam style bowl cake\" (ba wan), the \"sticky rice in pork chitterling\" (luo mi da tsang), the \"braised pork over rice\" (lu rou fan), and the \"oyster crepe with special sauce\" (o wa jian) -- really made me miss the food in taiwan.  And the items were wayyyyy less greasy than what you'd normally find in your taiwanese night market.  This is definitely a place I'd take my very very picky parents when they come visit -- and I think they'd actually enjoy it instead of ranting about how expensive and bad the chinese food in the bay area is...but again, I digress.\n\nI also came to the realization that \"Taiwan Beer\" is actually pretty good -- who knew?  That deserves an extra star in itself.", "rating": 4, "date": "2007-08-09"}], "salt and pepper chicken tender": [{"excerpts": ["However, tonight I had the salt and pepper chicken tender appetizer, which came with a bee fried and breaded in one of the bits. ", "Oddly enough, fried bees are in fact something you can get in a little village called Wulai in Taiwan (check out http://www.travelchannel.com/TV_Shows/Bizarre_Foods/Episodes_Travel_Guides/ci.Taiwan_Episode.map), and they're actually pretty good once you get over what you're eating. "], "author": "monica d.", "review": "Ordinarily my rating for Taste of Formosa would be 4 out of 5, only because they're a bit pricey and keep raising their prices. Having been lucky enough to have lived in Taiwan for a short spell a couple of years ago, it's hard finding good Taiwanese food here, and this is normally our go-to for Taiwanese food. \n\nHowever, tonight I had the salt and pepper chicken tender appetizer, which came with a bee fried and breaded in one of the bits. Oddly enough, fried bees are in fact something you can get in a little village called Wulai in Taiwan (check out http://www.travelchannel.com/TV_Shows/Bizarre_Foods/Episodes_Travel_Guides/ci.Taiwan_Episode.map), and they're actually pretty good once you get over what you're eating. But I really like to know when I'm going to be eating a bee or a bug or any kind of animal that I didn't order. \n\nAs an aside, we eat out regularly, so maybe statistically speaking it's about time I found something in my food that wasn't supposed to be there. A bee's definitely the oddest thing to find and still better than a cockroach or anything like that. \n\nDear Taste of Formosa, pleeeease take more care next time. Your food is usually amazing!", "rating": 1, "date": "2011-09-11"}], "chicken roll": [], "chinese fried tofu": [], "homemade sausage": [{"excerpts": ["If only their homemade sausage fried rice and pork belly over rice weren't so good!"], "author": "Robert L.", "review": "I ordered to go. The sausage fried rice is off the hook. The pork belly over rice is pretty good, too. The  pieces of pork belly were so creamy and smooth. Just wish there were more of it, but worth $5.65. I can order two if I want more. The chicken hearts were disappointing; nothing special. The eggplant was average. The oyster pancake with special sauce was a bit of a let down. I kept trying to find the oysters but found this clear, gooey paste, instead. I will try them one more time because  many people rave about them.  Like many other restaurants, it's hit or miss at this place. However, I will keep ordering the fried rice and everything pork related until I find the perfect dishes for me. One thing does seriously concern me and keeps this place off my \"Frequently Called List\", the low Health Dept score. If only their homemade sausage fried rice and pork belly over rice weren't so good!", "rating": 4, "date": "2017-08-20"}, {"excerpts": ["Homemade sausage - pretty good\nOyster with special sauce - pretty good ", "but I don't like oysters (wife likes)\n"], "author": "D W.", "review": "This place has authentic Taiwanese pretty much down - it's that good !!!  \n\nSliced pork with garlic sauce - to die for \nHomemade sausage - pretty good\nOyster with special sauce - pretty good but I don't like oysters (wife likes)\nStinky tofu - decent \nPork with veg soup - damn good\nOyster vermicelli noodle soup - damn good\n\n\nYou can't go wrong coming here - we will be back for sure.", "rating": 5, "date": "2014-02-22"}], "preserved egg and tofu": [{"excerpts": ["I order the preserved egg and tofu with out the mayo. "], "author": "Jenn C.", "review": "I've been coming here on and off for the last 5 years , they re pretty consistent with their  food . \n\nMy friends usually order the beef noodle soup\nI order the preserved egg and tofu with out the mayo. Be warned their food does leave a strong garlicky after taste in your mouth for hours \n\nThe minced pork rice is good\n\nThe the cha cha mein is good also garlicky.\n\nThe only thing bad here is there's always a new server and usually just 1 . They are very amateurish .\n\nBut the truth is their service is consistently amateurish so I guess that's ok hahahahah", "rating": 4, "date": "2018-10-27"}, {"excerpts": ["we ended up preferring our small dishes vs. their specialty, the noodles.  \n-- Preserved Egg and Tofu ($6.95) - for those who are unaware, preserved egg is an acquired taste to some, though ", "luckily my date and ", "I are HUGE fans of the funky smelling and tasting egg.  ", "Tofu was firm enough to pick up without completely falling apart.  "], "author": "Audrey H.", "review": "3 stars only because my \"main course\" was ok, though the appetizers were quite good!  Came here on advice of my date's friend, since he liked the \"authenticity\" of this spot.\n\nVenue / Service: small and dimly lit, but not too crowded.  We sat on the first floor but there seems to be more spacious second floor, based on the large groups of families that were coming down after their meal.  The servers don't speak the best English but are able to understand it.  They were also quick in the kitchen since food came out quite quickly but perhaps it was because we came at an unusual time (late lunch on Sunday).  \n\nFood: we ended up preferring our small dishes vs. their specialty, the noodles.  \n-- Preserved Egg and Tofu ($6.95) - for those who are unaware, preserved egg is an acquired taste to some, though luckily my date and I are HUGE fans of the funky smelling and tasting egg.  Tofu was firm enough to pick up without completely falling apart.  The sweet sauce should help counteract the strong flavors of the egg, but again, the egg is an acquired taste and may not be great for some peeps.  \n\n-- Salt & Pepper Chicken Tender ($7.50) - almost reminds me of popcorn chicken with some added spices to it, and this was one dish that we quickly finished.  The chicken was surprisingly still moist after being fried and they are served in great bite-sizes for easy eating.  Would highly recommend!\n\n-- Squid with Vegetable Soup (with Noodles)($7.95) - since this place is famous for its noodle dishes, I ordered this one.  Unfortunately a miss for me- the noodles were overcooked to the point that they would break apart when I tried to pick it up.  Didn't help that they were in a somewhat goupy soup (guess I was looking for something less... viscous?).  Lots of vegetables but I had a hard time telling what was a veggie and what was a slice of squid- not that it matters but I couldn't tell how much squid there actually was in the dish.\n\nAll in all, perhaps I'd choose a different noodle dish, but the appetizers we got were good!", "rating": 3, "date": "2018-02-22"}, {"excerpts": ["a cold minced pork noodle dish\nStinky Tofu: not really stinky and great w/the sauce they provide\nPreserved Egg and Tofu: love the sauce\n", "Ma Po Tofu: spicy minced pork and tofu (fairly spicy if you can't handle Sriracha)\n", "Preserved Egg and Tofu: slices of preserved egg over a block of tofu surrounded by a pool of their sauce (another of our favorites)\nEggplant in Basil Garlic Sauce\nSweet Soybean Milk and Chinese Fried Donut: something I grew up eating, so ", "I love to drink/eat it for nostalgia\nSticky Rice in Pork Chitterling: slightly crispy skin w/flavorful sticky rice\n", "Sticky Rice Cake w/Pork: ", "Preserved Egg and Tofu: slices of preserved egg over a block of tofu surrounded by a pool of their sauce (another of our favorites)\nEggplant in Basil Garlic Sauce\nSweet Soybean Milk and Chinese Fried Donut: something I grew up eating, so ", "I love to drink/eat it for nostalgia\nSticky Rice in Pork Chitterling: slightly crispy skin w/flavorful sticky rice\n", "Sticky Rice Cake w/Pork: "], "author": "Kitty K.", "review": "When I start dreaming for Taiwanese food, I gotta come here. I like this place because it's not dingy, the food's not too oily and done well. It is on Clement though, so parking's the luck of the draw. There's two floors. I enjoy eating upstairs because it's not as dark as it is downstairs and they usually have a concert music video playing on the TV to watch/listen to while you eat.\n\nEach time we come here, they haven't disappointed. We always order a few dishes from the following:\n\nOyster Crepe: doesn't look appealing as it's covered in sauce, but extremely tasty (one of our favorite dishes)\nDeep Fried Pork Intestine: they drain it so it's not sitting on a bed of oil and it's nice and crunchy on the outside\nDan Dan Mien:  a cold minced pork noodle dish\nStinky Tofu: not really stinky and great w/the sauce they provide\nPreserved Egg and Tofu: love the sauce\nMa Po Tofu: spicy minced pork and tofu (fairly spicy if you can't handle Sriracha)\nPreserved Egg and Tofu: slices of preserved egg over a block of tofu surrounded by a pool of their sauce (another of our favorites)\nEggplant in Basil Garlic Sauce\nSweet Soybean Milk and Chinese Fried Donut: something I grew up eating, so I love to drink/eat it for nostalgia\nSticky Rice in Pork Chitterling: slightly crispy skin w/flavorful sticky rice\nSticky Rice Cake w/Pork: lots of flavor in the pork that infuses into the sticky rice\n\nHaven't ordered anything we didn't like. They always have me coming back.", "rating": 4, "date": "2013-10-18"}, {"excerpts": ["I got a hankering for their preserved egg and tofu (cold) and ordered it with a pork chop. ", "So much flavor my stomach hurt afterward, but it was worth it! ", "Next time I'm giving the stinky tofu a try."], "author": "Carol C.", "review": "This place is so Taiwanese, from its cute sign to attentive service to yummy food. The smell of stinky tofu hit me straightaway when I walked in. It smelled delicious. I got a hankering for their preserved egg and tofu (cold) and ordered it with a pork chop. So much flavor my stomach hurt afterward, but it was worth it! Next time I'm giving the stinky tofu a try.", "rating": 4, "date": "2014-01-16"}, {"excerpts": ["Preserved egg and tofu - cold dish - so good"], "author": "Lily S.", "review": "Ok, this place is as authentic as it gets. \n\n1. Asian people who seemingly have bad service because they're only comfortable speaking Chinese\n\n2. Amazing food (even my friend who is Taiwanese said this gave him a \"ratatouille\" flashback of when he was back in Taiwan) \n\nI only discovered this place two months ago and i can already say, \"i'm a regular\". The price is good (i almost always order the small dishes) and every dish so far has been a hit. \n\nSome of my favorites:\n\n1. Braised ground pork over rice - always a winner; flavorful and full of ingredients\n\n2. Preserved egg and tofu - cold dish - so good; the sauce makes the dish\n\n3. Bacon salad with taiwanese sauce - sounds weird, right? but trust me, the sauce is really tasty and light \n\n4. Spicy dumplings - its literally just dumplings dunked in a soup of hot sauce -  so delicious - i am usually very picky about my dumplings. i usually don't like dumplings with skin that's too doughy and the meat inside has to be flavorful and not too compact (like it's been in the freezer for a decade). These fit the bill of being perfect plus the added bonus of extreme spiciness. \n\n5. Braised pork belly over rice - get with an tea flavored egg - the belly is kinda fatty but i just eat everything except the fat. \n\nThe oyster pancakes are also fresh and tasty, if you're into that kinda stuff. \n\nHope you guys enjoy this place as much as i do!", "rating": 5, "date": "2011-02-19"}, {"excerpts": ["my 2 must-get staples each visit:\nfried egg with preserved greens\npreserved egg and tofu\n\ni do wish they had brown rice as an option.  "], "author": "s t.", "review": "this is my fav comfort food go-to place!  they're lucky i don't live next door.  haven't ordered delivery yet but it just feels better dining there...it'd be too long a wait for delivery anyway!  service is quick and good in the resto, so far extremely consistent.\n\nmy 2 must-get staples each visit:\nfried egg with preserved greens\npreserved egg and tofu\n\ni do wish they had brown rice as an option.  nevertheless, this place is so good.  home-cooked feeling.\n\na tad (wait, hugely) heavy on the garlic.  so i always ask for less or no garlic...i hope they're used to me by now and i like to imagine that the kitchen rings with \"ooooh, the less garlic lady is baaaaaaack!\"  seriously, it's so pungent that i just want to eat ice chips for the next 24 hours.", "rating": 5, "date": "2013-01-11"}], "deep fried pork intestine": [{"excerpts": ["Deep Fried Pork Intestine: they drain it so it's not sitting on a bed of oil ", "and it's nice and crunchy on the outside\nDan Dan Mien:  "], "author": "Kitty K.", "review": "When I start dreaming for Taiwanese food, I gotta come here. I like this place because it's not dingy, the food's not too oily and done well. It is on Clement though, so parking's the luck of the draw. There's two floors. I enjoy eating upstairs because it's not as dark as it is downstairs and they usually have a concert music video playing on the TV to watch/listen to while you eat.\n\nEach time we come here, they haven't disappointed. We always order a few dishes from the following:\n\nOyster Crepe: doesn't look appealing as it's covered in sauce, but extremely tasty (one of our favorite dishes)\nDeep Fried Pork Intestine: they drain it so it's not sitting on a bed of oil and it's nice and crunchy on the outside\nDan Dan Mien:  a cold minced pork noodle dish\nStinky Tofu: not really stinky and great w/the sauce they provide\nPreserved Egg and Tofu: love the sauce\nMa Po Tofu: spicy minced pork and tofu (fairly spicy if you can't handle Sriracha)\nPreserved Egg and Tofu: slices of preserved egg over a block of tofu surrounded by a pool of their sauce (another of our favorites)\nEggplant in Basil Garlic Sauce\nSweet Soybean Milk and Chinese Fried Donut: something I grew up eating, so I love to drink/eat it for nostalgia\nSticky Rice in Pork Chitterling: slightly crispy skin w/flavorful sticky rice\nSticky Rice Cake w/Pork: lots of flavor in the pork that infuses into the sticky rice\n\nHaven't ordered anything we didn't like. They always have me coming back.", "rating": 4, "date": "2013-10-18"}, {"excerpts": ["Deep fried pork intestine\n5. "], "author": "Asha H.", "review": "Okay, here's the thing...\n\nI know NOTHING about Taiwanese food, I have absolutely no reference to what this food is supposed to taste like or if it was prepared properly.  All I know is that everything I shoved in my mouth last night, was delicious.\n\nSeriously, the restaurant was pretty empty, so when we strolled in with our party of eight, and said our reservation, I looked around at the first floor of semi-occupied two and four tops wondering, \"How are they going to fit us all in here?\".  Then we were taken upstairs, and I was pleasantly surprised. \n\nWe sat down, and having researched the restaurant a little bit, I know some choice dishes I wanted to try, and so we ordered:\n\n1. Scallion pancake with egg *\n2. Drunken Chicken\n3. Fried Squid Balls \n4. Deep fried pork intestine\n5. Beef with hot special sauce \n6. Chicken in rice wine sauce *\n7. Shrimp with pineapple *\n8. Morning Glory\n9. Braised ground pork over rice **** (The whole reason why I went)\n10. Whole fish with spicy sauce (not sure what it's called on the menu)\n(* are my supa-favorites)\n\nThere weren't any hungry people left, and thanks to a combination of the little research I did and an actual Taiwanese person in our party, everyone actually enjoyed every dish.  And including tip it ended up being $16 a person for a whole lotta food.\n\nOur waitress was very helpful, service was great and presentation was beautiful.  Five stars for sure, and will definitely be back.", "rating": 5, "date": "2008-10-18"}], "wonton with hot sauce": [{"excerpts": ["Since eating Taiwanese food is somewhat new to me, I went with the basics and ordered warm soy bean milk ($2.25), scallion pancakes ($6) and wonton with hot sauce ($7). ", "The soy bean milk was awesome to match the cool weather outside and the pancakes were nice and crispy. "], "author": "Santi T.", "review": "It's hard to find Taiwanese restaurants back home so I decided to go exploring in the world of food. That's why I decided to try this place out while in the BA. \n\nLuckily, I wasn't too hungry when I entered this contemporary and clean restaurant and was able to skip the lunch rush. When seated, the waitress quickly brought out a plate of roasted peanuts and hot tea which was the perfect snacking food. Sorry to hear other reviewers didn't have great service but maybe they stepped it up because my waitress was very attentive and prompt. \n\nSince eating Taiwanese food is somewhat new to me, I went with the basics and ordered warm soy bean milk ($2.25), scallion pancakes ($6) and wonton with hot sauce ($7). The soy bean milk was awesome to match the cool weather outside and the pancakes were nice and crispy. Sad to say, the wontons were drowning in the chili oil with a lack of flavor. \n\nOverall, it was just okay and I will continue for my Taiwanese adventure somewhere else before I come back here. Zai jian!", "rating": 3, "date": "2009-06-19"}], "drunken chicken": [{"excerpts": ["some dishes that did not work that well - drunken chicken, House special ribs\nand service that did not seem to click this evening. ", "i was charged corkage and ended up opening the bottle myself because our server did not know how to work the corkscrew.\ngo figure!\n", "plus parking in this part of town sucks!\nwasn't worth the trip."], "author": "Jeff W.", "review": "some good dishes - green onion pancake, beef noodle soup, freshly made dumplings. deep fried yellowtail fish\nsome dishes that did not work that well - drunken chicken, House special ribs\nand service that did not seem to click this evening. i was charged corkage and ended up opening the bottle myself because our server did not know how to work the corkscrew.\ngo figure!\nplus parking in this part of town sucks!\nwasn't worth the trip.", "rating": 3, "date": "2007-05-13"}, {"excerpts": ["Drunken Chicken\n3. ", "Fried Squid Balls \n4. "], "author": "Asha H.", "review": "Okay, here's the thing...\n\nI know NOTHING about Taiwanese food, I have absolutely no reference to what this food is supposed to taste like or if it was prepared properly.  All I know is that everything I shoved in my mouth last night, was delicious.\n\nSeriously, the restaurant was pretty empty, so when we strolled in with our party of eight, and said our reservation, I looked around at the first floor of semi-occupied two and four tops wondering, \"How are they going to fit us all in here?\".  Then we were taken upstairs, and I was pleasantly surprised. \n\nWe sat down, and having researched the restaurant a little bit, I know some choice dishes I wanted to try, and so we ordered:\n\n1. Scallion pancake with egg *\n2. Drunken Chicken\n3. Fried Squid Balls \n4. Deep fried pork intestine\n5. Beef with hot special sauce \n6. Chicken in rice wine sauce *\n7. Shrimp with pineapple *\n8. Morning Glory\n9. Braised ground pork over rice **** (The whole reason why I went)\n10. Whole fish with spicy sauce (not sure what it's called on the menu)\n(* are my supa-favorites)\n\nThere weren't any hungry people left, and thanks to a combination of the little research I did and an actual Taiwanese person in our party, everyone actually enjoyed every dish.  And including tip it ended up being $16 a person for a whole lotta food.\n\nOur waitress was very helpful, service was great and presentation was beautiful.  Five stars for sure, and will definitely be back.", "rating": 5, "date": "2008-10-18"}, {"excerpts": ["Drunken chicken, scallion pancake and the braised beef noodles were all really good too. ", "I am definitely stoked that this gem exists just round the corner from where I live. ", "Service can be a lil slow as they seem short handed all the time. ", "I saw on the wall that they offer the stinky tofu too; when I brace myself enough, maybe I will order that next time!"], "author": "Topazskye L.", "review": "I definitely heart the pig intestine/oyster vermicelli here. It is soo tasty and the intestines were cooked really well. I love mine with a big serving of black vinegar. Drunken chicken, scallion pancake and the braised beef noodles were all really good too. I am definitely stoked that this gem exists just round the corner from where I live. Service can be a lil slow as they seem short handed all the time. I saw on the wall that they offer the stinky tofu too; when I brace myself enough, maybe I will order that next time!", "rating": 4, "date": "2010-05-01"}, {"excerpts": ["i left euphoric and happy (drunk from the drunken chicken, perhaps), and so ready to go back.\n\n"], "author": "monkey l.", "review": "two years ago, when i still lived in san francisco, i lamented that there was no good taiwanese food in the city. spices... eh, ok. but i wanted real taiwanese food -- the oyster noodles, the sound of taiwanese speak emanating from the kitchen, people who could understand my formosan utterances. \n\nno such luck. i had to drive down to cupertino to get my taiwanese food.\n\nthen today, driving by, bf (who is tuned into my crazy rabid taiwanese-food cravings) said, oh look! there's a taiwanese place. i scoffed. many a place calls themselves taiwanese. and many a place has failed to prove itself rightfully so. but i gave it a whirl.\n\nohhhhhh!!! the joy!\n\nthis place kicks major *ss. every mouthful was followed by an \"oh i am so happy\" or \"ahhh. this is how taiwanese food should be.\" bf just kept throwing food on my plate, probably to make me shut up and keep eating. i left euphoric and happy (drunk from the drunken chicken, perhaps), and so ready to go back.\n\nyes, the service is not but-kissingly stellar, admittedly. but the place is clean... and they're authentic. so that makes 5 stars in my book.\n\nformosans (and lovers of formosan food) unite!", "rating": 5, "date": "2007-04-21"}], "fried spicy chicken wings": [], "marinated jelly fish": [], "shredded chicken with clear bean skin": [], "marinated cucumber": [{"excerpts": ["Marinated cucumber - crunchy cucumber, pickled with chili sauce to add a kick. \n\n"], "author": "Nette T.", "review": "I had a great lunch here with my friend who is Taiwanese. I don't eat Taiwanese food that often so it was good to go with someone who can order for the both of us!\n\nWe were hungry so we ordered lots of snacks to eat:\n\nCold salted soy bean milk - this went well with the dishes - sometimes when things come out piping hot, you need something to cool it down. \n\nPopcorn chicken - a delightful snack food of perfectly fried pieces of chicken that was crunchy on the outside and yummy on the inside. \n\nMarinated cucumber - crunchy cucumber, pickled with chili sauce to add a kick. \n\nBraised Beef With Noodle Soup  - tender braised beef with spicy noodles, this is one of my favorite dishes. This is comfort food to me. \n\nStinky tofu - I used to be afraid of stinky tofu but I've grown to love it. And I love the stinky tofu at Taste of Formosa. Perfectly fried - crunchy on the outside and soft on the inside. \n\nSteamed sticky rice with pork - steamed in banana leaf with bits of pork. Lots of flavor and sticky rice is perfect texture - not too gummy.\n\nEverything was really good and I loved all the dishes my friend picked. The restaurant is a little small so it can get busy fast.", "rating": 5, "date": "2018-06-26"}, {"excerpts": ["We ordered potstickers (great dipping sauce!), marinated cucumber, sweet and sour pork, lemon chicken, garlic eggplant (perfectly spicy), and of course steamed rice. ", "Each dish was fresh, tasty, and not overly salty. ", "I didn't know this was possible, but even the rice was better than most places. ", "Really impressed! ", "We'll definitely be eating their food again."], "author": "Christina S.", "review": "Wow! This gem of a place is a block from home. Our tummies were hankering for Chinese/Taiwanese takeout, and Taste of Formosa did not disappoint! We ordered potstickers (great dipping sauce!), marinated cucumber, sweet and sour pork, lemon chicken, garlic eggplant (perfectly spicy), and of course steamed rice. Each dish was fresh, tasty, and not overly salty. I didn't know this was possible, but even the rice was better than most places. Really impressed! We'll definitely be eating their food again.", "rating": 5, "date": "2018-07-08"}], "braised marinated tripe": [], "braised marinated beef tendon": [], "braised marinated pig ears": [{"excerpts": ["With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\n"], "author": "Cindy L.", "review": "This place is sooo authentic\n\n\nFried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\nCombination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime i go, i pay like around 25 per person.. kind of expensive, we also overorder tho....", "rating": 5, "date": "2013-01-02"}], "braised marinated duck tongue": [], "braised marinated chicken heart": [], "braised marinated chicken kidney": [], "braised sliced pork intestines": [], "braised hard boiled eggs": [], "combination braised items": [{"excerpts": ["some times I get the combination braised items or the fermented tofu. ", "Prices are good and service is prompt."], "author": "Jerry Z.", "review": "Food here was pretty good. Always get the braised pork over rice with egg. some times I get the combination braised items or the fermented tofu. Prices are good and service is prompt.", "rating": 4, "date": "2016-11-11"}, {"excerpts": ["Combination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime "], "author": "Cindy L.", "review": "This place is sooo authentic\n\n\nFried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\nCombination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime i go, i pay like around 25 per person.. kind of expensive, we also overorder tho....", "rating": 5, "date": "2013-01-02"}], "spicy fried bean curd": [], "bamboo shoots in spicy sauce": [], "smeli tofu": [], "pork ball soup": [{"excerpts": ["Everyone working here was very friendly, the owner even came up to serve us Taiwanese Pork Ball Soup!  ", "She chatted with us about how the service was and how the food was.  "], "author": "Benny S.", "review": "I am in love with this place!  Let me just say.. Taste of Formosa was what I was looking for in the city.  I have been looking all over the city for Taiwanese potstickers and this place has them!  Ok this place isn't the easiest to find.  The only reason I lucked out in finding this place was because AK Subs was a block away!  The parking situation is hellish day and night... the best time to come for dinner is around 7:45pm to snag at the VIP Bus Stop parking spaces.  Ok enough with the foreplay..\n\nI walked in with a party of 4 and was greated nicely by the hostess.  We were seated in the spacious 2nd floor almost immediately after we passed the doors.  We were seated near the windows, which have a nice view of Clement and our cars.  We were offered water and tea and also a menu each.  As we sat down, I noticed the seats were very nice and the table was very sturdy.. not like the ones you find at other Chinese restaurants that seem like motorized bulls.  They even had a Plasma looping Chinese/Taiwanese music videos and concerts!\n\nEverything I ordered here was excellent!  I started with the Honey Green Tea drink(mmMm)  The scallion pancakes(OMG GOOD), the legendary Taiwanese potstickers, the crispy fried TOFU!, and the Savory Rice Roll! just blew me away!!  I mean everything I had on that day was super delicious!  And I was for sure that I wasn't being lulled away by Jay Chou singing on the flat panel TV screen.  The food was really really good.  The only thing to remember is although the price range is moderate $11-30... its very easy to fall within the high $20s/per person on this bill.  Everyone working here was very friendly, the owner even came up to serve us Taiwanese Pork Ball Soup!  She chatted with us about how the service was and how the food was.  I can definately say... this place is 5 stars in my book!\n\nOh remember to pick up a Take-Out Menu... They deliver in nice packaging!  The delivery guy is my favorite he is smiling rain or shine!", "rating": 5, "date": "2007-05-18"}], "pork tripe soup with sauerkraut": [], "pork intestines and pork blood soup": [], "turnip soup with ribs": [], "sesame oil chicken soup": [], "chicken in wine soup": [], "chinese squash with clams or oyster soup": [], "sour cabbage with fish fillet soup": [], "fish head clay pot": [], "preserved egg": [{"excerpts": ["I order the preserved egg and tofu with out the mayo. "], "author": "Jenn C.", "review": "I've been coming here on and off for the last 5 years , they re pretty consistent with their  food . \n\nMy friends usually order the beef noodle soup\nI order the preserved egg and tofu with out the mayo. Be warned their food does leave a strong garlicky after taste in your mouth for hours \n\nThe minced pork rice is good\n\nThe the cha cha mein is good also garlicky.\n\nThe only thing bad here is there's always a new server and usually just 1 . They are very amateurish .\n\nBut the truth is their service is consistently amateurish so I guess that's ok hahahahah", "rating": 4, "date": "2018-10-27"}, {"excerpts": ["we ended up preferring our small dishes vs. their specialty, the noodles.  \n-- Preserved Egg and Tofu ($6.95) - for those who are unaware, preserved egg is an acquired taste to some, though ", "luckily my date and ", "I are HUGE fans of the funky smelling and tasting egg.  ", "Tofu was firm enough to pick up without completely falling apart.  "], "author": "Audrey H.", "review": "3 stars only because my \"main course\" was ok, though the appetizers were quite good!  Came here on advice of my date's friend, since he liked the \"authenticity\" of this spot.\n\nVenue / Service: small and dimly lit, but not too crowded.  We sat on the first floor but there seems to be more spacious second floor, based on the large groups of families that were coming down after their meal.  The servers don't speak the best English but are able to understand it.  They were also quick in the kitchen since food came out quite quickly but perhaps it was because we came at an unusual time (late lunch on Sunday).  \n\nFood: we ended up preferring our small dishes vs. their specialty, the noodles.  \n-- Preserved Egg and Tofu ($6.95) - for those who are unaware, preserved egg is an acquired taste to some, though luckily my date and I are HUGE fans of the funky smelling and tasting egg.  Tofu was firm enough to pick up without completely falling apart.  The sweet sauce should help counteract the strong flavors of the egg, but again, the egg is an acquired taste and may not be great for some peeps.  \n\n-- Salt & Pepper Chicken Tender ($7.50) - almost reminds me of popcorn chicken with some added spices to it, and this was one dish that we quickly finished.  The chicken was surprisingly still moist after being fried and they are served in great bite-sizes for easy eating.  Would highly recommend!\n\n-- Squid with Vegetable Soup (with Noodles)($7.95) - since this place is famous for its noodle dishes, I ordered this one.  Unfortunately a miss for me- the noodles were overcooked to the point that they would break apart when I tried to pick it up.  Didn't help that they were in a somewhat goupy soup (guess I was looking for something less... viscous?).  Lots of vegetables but I had a hard time telling what was a veggie and what was a slice of squid- not that it matters but I couldn't tell how much squid there actually was in the dish.\n\nAll in all, perhaps I'd choose a different noodle dish, but the appetizers we got were good!", "rating": 3, "date": "2018-02-22"}, {"excerpts": ["a cold minced pork noodle dish\nStinky Tofu: not really stinky and great w/the sauce they provide\nPreserved Egg and Tofu: love the sauce\n", "Ma Po Tofu: spicy minced pork and tofu (fairly spicy if you can't handle Sriracha)\n", "Preserved Egg and Tofu: slices of preserved egg over a block of tofu surrounded by a pool of their sauce (another of our favorites)\nEggplant in Basil Garlic Sauce\nSweet Soybean Milk and Chinese Fried Donut: something I grew up eating, so ", "I love to drink/eat it for nostalgia\nSticky Rice in Pork Chitterling: slightly crispy skin w/flavorful sticky rice\n", "Sticky Rice Cake w/Pork: ", "Preserved Egg and Tofu: slices of preserved egg over a block of tofu surrounded by a pool of their sauce (another of our favorites)\nEggplant in Basil Garlic Sauce\nSweet Soybean Milk and Chinese Fried Donut: something I grew up eating, so ", "I love to drink/eat it for nostalgia\nSticky Rice in Pork Chitterling: slightly crispy skin w/flavorful sticky rice\n", "Sticky Rice Cake w/Pork: "], "author": "Kitty K.", "review": "When I start dreaming for Taiwanese food, I gotta come here. I like this place because it's not dingy, the food's not too oily and done well. It is on Clement though, so parking's the luck of the draw. There's two floors. I enjoy eating upstairs because it's not as dark as it is downstairs and they usually have a concert music video playing on the TV to watch/listen to while you eat.\n\nEach time we come here, they haven't disappointed. We always order a few dishes from the following:\n\nOyster Crepe: doesn't look appealing as it's covered in sauce, but extremely tasty (one of our favorite dishes)\nDeep Fried Pork Intestine: they drain it so it's not sitting on a bed of oil and it's nice and crunchy on the outside\nDan Dan Mien:  a cold minced pork noodle dish\nStinky Tofu: not really stinky and great w/the sauce they provide\nPreserved Egg and Tofu: love the sauce\nMa Po Tofu: spicy minced pork and tofu (fairly spicy if you can't handle Sriracha)\nPreserved Egg and Tofu: slices of preserved egg over a block of tofu surrounded by a pool of their sauce (another of our favorites)\nEggplant in Basil Garlic Sauce\nSweet Soybean Milk and Chinese Fried Donut: something I grew up eating, so I love to drink/eat it for nostalgia\nSticky Rice in Pork Chitterling: slightly crispy skin w/flavorful sticky rice\nSticky Rice Cake w/Pork: lots of flavor in the pork that infuses into the sticky rice\n\nHaven't ordered anything we didn't like. They always have me coming back.", "rating": 4, "date": "2013-10-18"}, {"excerpts": ["The preserved egg with pork congee and Chinese donut came out very hot, which assured me that, despite the hair I had the misfortune to find in not one, but both dishes, I would unlikely get sick over them. ", "The hairs were about 1 cm in length and black; I'm guessing beard, nose, or black rodent being possible sources. ", "Flavorful dishes, but off-putting enough for me to add this review to the existing three reviews of this establishment with the search term \"hair\" found in food."], "author": "Debbie Y.", "review": "The preserved egg with pork congee and Chinese donut came out very hot, which assured me that, despite the hair I had the misfortune to find in not one, but both dishes, I would unlikely get sick over them. The hairs were about 1 cm in length and black; I'm guessing beard, nose, or black rodent being possible sources. Flavorful dishes, but off-putting enough for me to add this review to the existing three reviews of this establishment with the search term \"hair\" found in food.", "rating": 1, "date": "2015-09-06"}, {"excerpts": ["The pork and preserved egg congee was also lacking; the pork just tasted like chicken strips, and the preserved eggs were difficult to spot.\n\n"], "author": "Crystal W.", "review": "Came here because I was in SF and my friends and I passed by the restaurant. Although I ordered Taiwanese-specific fare because I hadn't seen these dishes in a while, I was disappointed because of the portioning and taste. \n\nThe best part of the meal was the sauce for the fried chitterlings: absolutely delicious and perfect in terms of sweetness, spiciness, and flavor. The chitterlings themselves were a bit disappointing; no Taiwanese sausage inside the rice part, the outer skin was not crispy enough and just stuck to my teeth.\n\nThe oyster pancake also had pretty bomb sauce, but the pancake itself was not crispy enough on the outside and basically, was a small limp mess of pancake and a limited amount of oyster. It was also unexpectedly tiny for its $6.95 price-tag ( about 6 inches in diameter).\n\nMy friend and boyfriend both ordered the pork chop dish, which basically had pork chops that tasted like popcorn chicken with limp breading. The soy sauce eggs were so overboiled that they became small, hard, salty eggs.\n\nThe pork and preserved egg congee was also lacking; the pork just tasted like chicken strips, and the preserved eggs were difficult to spot.\n\nOverall, the sauces here were great; the other food not so much. Also, although the waitress diligently refilled our tea, she was also the quietest person I've ever met. She basically whispered to us when she took our order and whenever we asked her about anything.\n\nI've definitely experienced better, especially if I pay $20+ for a small meal.", "rating": 2, "date": "2013-02-17"}, {"excerpts": ["I got a hankering for their preserved egg and tofu (cold) and ordered it with a pork chop. ", "So much flavor my stomach hurt afterward, but it was worth it! ", "Next time I'm giving the stinky tofu a try."], "author": "Carol C.", "review": "This place is so Taiwanese, from its cute sign to attentive service to yummy food. The smell of stinky tofu hit me straightaway when I walked in. It smelled delicious. I got a hankering for their preserved egg and tofu (cold) and ordered it with a pork chop. So much flavor my stomach hurt afterward, but it was worth it! Next time I'm giving the stinky tofu a try.", "rating": 4, "date": "2014-01-16"}, {"excerpts": ["Better than most of the other places I tried, but I still prefer Mama Chen for that\n- Tofu and preserved egg is one of the favourite out of all the places I went\n- Ground pork rice is cute and decent\n- Ordered a rick stick to try, since I saw some review online that highly recommended it. "], "author": "Chloé N.", "review": "Passed by this place the other day and decided to give it a try. I like Taiwanese food, but didn't know any when I lived in the city, now I found it, here we go.\n\nThis place looks so small from outside, but it has a second floor which is pretty spacious!\n\nTwo of us order some snack dishes: \n- Oyster pancake is good. Better than most of the other places I tried, but I still prefer Mama Chen for that\n- Tofu and preserved egg is one of the favourite out of all the places I went\n- Ground pork rice is cute and decent\n- Ordered a rick stick to try, since I saw some review online that highly recommended it. The rice is very well cooked, but the chinese donut inside is a little too hard, I like it softer.\n\nOverall, it's pretty good with good price. I would go there again if i go to San Francisco and want Taiwanese food.", "rating": 4, "date": "2011-05-02"}, {"excerpts": ["Preserved egg and tofu - cold dish - so good"], "author": "Lily S.", "review": "Ok, this place is as authentic as it gets. \n\n1. Asian people who seemingly have bad service because they're only comfortable speaking Chinese\n\n2. Amazing food (even my friend who is Taiwanese said this gave him a \"ratatouille\" flashback of when he was back in Taiwan) \n\nI only discovered this place two months ago and i can already say, \"i'm a regular\". The price is good (i almost always order the small dishes) and every dish so far has been a hit. \n\nSome of my favorites:\n\n1. Braised ground pork over rice - always a winner; flavorful and full of ingredients\n\n2. Preserved egg and tofu - cold dish - so good; the sauce makes the dish\n\n3. Bacon salad with taiwanese sauce - sounds weird, right? but trust me, the sauce is really tasty and light \n\n4. Spicy dumplings - its literally just dumplings dunked in a soup of hot sauce -  so delicious - i am usually very picky about my dumplings. i usually don't like dumplings with skin that's too doughy and the meat inside has to be flavorful and not too compact (like it's been in the freezer for a decade). These fit the bill of being perfect plus the added bonus of extreme spiciness. \n\n5. Braised pork belly over rice - get with an tea flavored egg - the belly is kinda fatty but i just eat everything except the fat. \n\nThe oyster pancakes are also fresh and tasty, if you're into that kinda stuff. \n\nHope you guys enjoy this place as much as i do!", "rating": 5, "date": "2011-02-19"}, {"excerpts": ["my 2 must-get staples each visit:\nfried egg with preserved greens\npreserved egg and tofu\n\ni do wish they had brown rice as an option.  "], "author": "s t.", "review": "this is my fav comfort food go-to place!  they're lucky i don't live next door.  haven't ordered delivery yet but it just feels better dining there...it'd be too long a wait for delivery anyway!  service is quick and good in the resto, so far extremely consistent.\n\nmy 2 must-get staples each visit:\nfried egg with preserved greens\npreserved egg and tofu\n\ni do wish they had brown rice as an option.  nevertheless, this place is so good.  home-cooked feeling.\n\na tad (wait, hugely) heavy on the garlic.  so i always ask for less or no garlic...i hope they're used to me by now and i like to imagine that the kitchen rings with \"ooooh, the less garlic lady is baaaaaaack!\"  seriously, it's so pungent that i just want to eat ice chips for the next 24 hours.", "rating": 5, "date": "2013-01-11"}, {"excerpts": ["consistently great tofu with preserved egg. ", "also had cold platter appetizer (seaweed, tofu, etc) ", "it was excellent. ", "love the cucumbers."], "author": "Win H.", "review": "had the ma yo (sesame oil) chicken soup with noodles. it was DA BOMB. consistently great tofu with preserved egg. also had cold platter appetizer (seaweed, tofu, etc) it was excellent. love the cucumbers.", "rating": 4, "date": "2011-10-02"}], "deluxe fried rice": [], "deluxe chow mein": [], "homemade sausage fried rice": [{"excerpts": ["If only their homemade sausage fried rice and pork belly over rice weren't so good!"], "author": "Robert L.", "review": "I ordered to go. The sausage fried rice is off the hook. The pork belly over rice is pretty good, too. The  pieces of pork belly were so creamy and smooth. Just wish there were more of it, but worth $5.65. I can order two if I want more. The chicken hearts were disappointing; nothing special. The eggplant was average. The oyster pancake with special sauce was a bit of a let down. I kept trying to find the oysters but found this clear, gooey paste, instead. I will try them one more time because  many people rave about them.  Like many other restaurants, it's hit or miss at this place. However, I will keep ordering the fried rice and everything pork related until I find the perfect dishes for me. One thing does seriously concern me and keeps this place off my \"Frequently Called List\", the low Health Dept score. If only their homemade sausage fried rice and pork belly over rice weren't so good!", "rating": 4, "date": "2017-08-20"}], "braised ground pork over rice": [{"excerpts": ["I'm used to\nBraised Ground Pork over Rice - this was probably one of my favorites of the night; portion size is not very big if it's for one hungry person\nBacon with Taiwanese cabbage - this was a refreshing dish; I would've loved if they used crispy bacon instead of regular bacon that was still chewy and you can still see all the fat\nPork with Vegetable Soup (added noodles for 50 cents) - this was a good dish; the dish had chunks of pork, shitake mushrooms, napa cabbage, carrots in a very thick soup - reminded me of chinese hot and sour soup."], "author": "Anna L.", "review": "Came here on a Thursday night and it wasn't too busy so we got seated right away. The interior of the restaurant was very nice and neat and apparently there's an upstairs as well. The service was very good; the waitresses were very approachable and patient! The food didn't take very long to come out and was just okay for me, nothing really stood out. We did family style:\n\nOyster Crepe with Special Sauce - i didn't particularly like this very much because it had a weird slimy texture but the sauce was pretty good.\nGreen Onion Pancake - this was pretty good; very crispy and savory. This was less doughy and more crispy than the Chinese green onion pancake I'm used to\nBraised Ground Pork over Rice - this was probably one of my favorites of the night; portion size is not very big if it's for one hungry person\nBacon with Taiwanese cabbage - this was a refreshing dish; I would've loved if they used crispy bacon instead of regular bacon that was still chewy and you can still see all the fat\nPork with Vegetable Soup (added noodles for 50 cents) - this was a good dish; the dish had chunks of pork, shitake mushrooms, napa cabbage, carrots in a very thick soup - reminded me of chinese hot and sour soup.", "rating": 3, "date": "2014-03-28"}, {"excerpts": ["Braised ground pork over rice: Good balance of fatty/lean pork, good rice texture with sauce that really reminded me of other taiwanese meals I've had back home. "], "author": "Jackie C.", "review": "Pretty extensive menu, so I'm looking forward to trying a lot of other dishes. \n\nBraised ground pork over rice: Good balance of fatty/lean pork, good rice texture with sauce that really reminded me of other taiwanese meals I've had back home. Egg could have had better flavor. \n\nTaiwanese-style potstickers: Surprisingly impressed with the crispy skin and flavors (even though I had take out). The garlic-y sauce is authentically Taiwanese. Will order this again when I crave potstickers. \n\nMarinated seaweed: Not the best I've had, but they certainly give you a lot of seaweed for one portion. I personally enjoy thinner seaweed ribbons but these were great also.\n\nSalty soy bean milk: Quite authentic with all the ingredients like dried shrimp, pickled vegetables, even the soggy Chinese doughnut-y stuff. That said, I couldn't taste a lot of the \"soy bean\" flavor I was looking for. Happy that they make this themselves, but I would expect to taste a lot more soy milk.", "rating": 4, "date": "2014-03-25"}, {"excerpts": ["We got chinese squash with clam, basil with clam, stinky tofu, braised ground pork over rice, and a few others I can't remember now. ", "The two most popular were the two clam dishes. ", "For dessert we tried all the options - the bean curd, the rice balls, and the shaved ice. ", "The shaved ice was good, but I wasn't a big fan of the bean curd. ", "The peanut with the bean curd wasn't cooked enough."], "author": "James K.", "review": "The Taiwanese food here is pretty good and relatively authentic. I was not super impressed, but still I enjoyed the food at Taste of Formosa. We got chinese squash with clam, basil with clam, stinky tofu, braised ground pork over rice, and a few others I can't remember now. The two most popular were the two clam dishes. For dessert we tried all the options - the bean curd, the rice balls, and the shaved ice. The shaved ice was good, but I wasn't a big fan of the bean curd. The peanut with the bean curd wasn't cooked enough.", "rating": 4, "date": "2011-09-13"}, {"excerpts": ["With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\n"], "author": "Cindy L.", "review": "This place is sooo authentic\n\n\nFried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\nCombination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime i go, i pay like around 25 per person.. kind of expensive, we also overorder tho....", "rating": 5, "date": "2013-01-02"}, {"excerpts": ["Braised ground pork over rice - always a winner; flavorful and full of ingredients\n\n2. "], "author": "Lily S.", "review": "Ok, this place is as authentic as it gets. \n\n1. Asian people who seemingly have bad service because they're only comfortable speaking Chinese\n\n2. Amazing food (even my friend who is Taiwanese said this gave him a \"ratatouille\" flashback of when he was back in Taiwan) \n\nI only discovered this place two months ago and i can already say, \"i'm a regular\". The price is good (i almost always order the small dishes) and every dish so far has been a hit. \n\nSome of my favorites:\n\n1. Braised ground pork over rice - always a winner; flavorful and full of ingredients\n\n2. Preserved egg and tofu - cold dish - so good; the sauce makes the dish\n\n3. Bacon salad with taiwanese sauce - sounds weird, right? but trust me, the sauce is really tasty and light \n\n4. Spicy dumplings - its literally just dumplings dunked in a soup of hot sauce -  so delicious - i am usually very picky about my dumplings. i usually don't like dumplings with skin that's too doughy and the meat inside has to be flavorful and not too compact (like it's been in the freezer for a decade). These fit the bill of being perfect plus the added bonus of extreme spiciness. \n\n5. Braised pork belly over rice - get with an tea flavored egg - the belly is kinda fatty but i just eat everything except the fat. \n\nThe oyster pancakes are also fresh and tasty, if you're into that kinda stuff. \n\nHope you guys enjoy this place as much as i do!", "rating": 5, "date": "2011-02-19"}, {"excerpts": ["It is a bit pricey for the portion, but at long as it tastes good, I am willing to pay =)\nBraised Ground Pork over rice - very flavorful and rich rice dishes and great bargain too. ", "One of the must have.\n", "Oyster fried egg... hmmm..... not so much. ", "First of all, the oyster wasn't that fresh tasting. ", "And also, it wasn't mixed properly. ", "Oyster was all on one side, while egg misture on other. ", "Maybe I should fold it over like an omelet.  ", "Just a thought  "], "author": "Prascilla L.", "review": "Why there is so limited Taiwanese place in Bay Area?  Anyway, enough complaining, let's focus on my review.\n\nThis place is like a 3.5 stars for me. These are the dishes that I have:\nFried \"chicken nuggets\" - Good, love the fried basil what comes with the dish. It is a bit pricey for the portion, but at long as it tastes good, I am willing to pay =)\nBraised Ground Pork over rice - very flavorful and rich rice dishes and great bargain too. One of the must have.\nOyster fried egg... hmmm..... not so much. First of all, the oyster wasn't that fresh tasting. And also, it wasn't mixed properly. Oyster was all on one side, while egg misture on other. Maybe I should fold it over like an omelet.  Just a thought  :p\n\nParking of course on clement street can be a pain, but they have an hour validation on the nearby parking lot. Guess I might come back to try out more dishes next time.", "rating": 4, "date": "2009-06-11"}, {"excerpts": ["Their braised ground pork over rice (ru ro fan) is just like how my Dad would make it and the o-a mi sua (oyster vermicelli) is just yummy.  ", "I also like the xian fan tuan (salty rice ball/roll).  ", "Their noodle and sauteed dishes are delish too.  "], "author": "Pelle Y.", "review": "We need more Taiwanese restaurants in SF.  Taiwan restaurant is NOT Taiwanese food and when Taiwan Point closed up shop, I thought I'd have to make trips down to the South Bay for some food from the motherland.  Luckily, some friends told me about Taste of Formosa and we're back in business.  Their braised ground pork over rice (ru ro fan) is just like how my Dad would make it and the o-a mi sua (oyster vermicelli) is just yummy.  I also like the xian fan tuan (salty rice ball/roll).  Their noodle and sauteed dishes are delish too.  The o-a zen (oyster pancake) is a little off for me, which is a shame because that's my favorite dish, but I'm just happy to get some authentic Taiwanese food.\n\nC and I have always have a hard time remembering that they are closed on Tuesdays.  Twice we planned to go, saving up our appetites, and thinking about what we'd order all day, only to be sorely disappointed that the doors were shut and the lights were out.  We almost cried both times.  Waah!", "rating": 4, "date": "2007-03-31"}, {"excerpts": ["Braised ground pork over rice ", "*", "*** (The whole reason why I went)\n10. ", "Whole fish with spicy sauce (not sure what it's called on the menu)\n"], "author": "Asha H.", "review": "Okay, here's the thing...\n\nI know NOTHING about Taiwanese food, I have absolutely no reference to what this food is supposed to taste like or if it was prepared properly.  All I know is that everything I shoved in my mouth last night, was delicious.\n\nSeriously, the restaurant was pretty empty, so when we strolled in with our party of eight, and said our reservation, I looked around at the first floor of semi-occupied two and four tops wondering, \"How are they going to fit us all in here?\".  Then we were taken upstairs, and I was pleasantly surprised. \n\nWe sat down, and having researched the restaurant a little bit, I know some choice dishes I wanted to try, and so we ordered:\n\n1. Scallion pancake with egg *\n2. Drunken Chicken\n3. Fried Squid Balls \n4. Deep fried pork intestine\n5. Beef with hot special sauce \n6. Chicken in rice wine sauce *\n7. Shrimp with pineapple *\n8. Morning Glory\n9. Braised ground pork over rice **** (The whole reason why I went)\n10. Whole fish with spicy sauce (not sure what it's called on the menu)\n(* are my supa-favorites)\n\nThere weren't any hungry people left, and thanks to a combination of the little research I did and an actual Taiwanese person in our party, everyone actually enjoyed every dish.  And including tip it ended up being $16 a person for a whole lotta food.\n\nOur waitress was very helpful, service was great and presentation was beautiful.  Five stars for sure, and will definitely be back.", "rating": 5, "date": "2008-10-18"}, {"excerpts": ["the braised ground pork over rice is a star. ", "for $3.75, you get a bowl of rice topped with the stuff, mixed with some chopped up little pickled greens. "], "author": "jennifer y.", "review": "ever since taiwan point out in the sunset packed up its bags in the middle of the night and disappeared from our lives, my friends and i have been lamenting the loss of authentic taiwanese food, perfect for late nights. \n\nhowever, we've now found taste of formosa, out on clement & 25th, to fill that abyss in our hearts. \n\nthis place is much larger, with a cool upstairs dining room that features a flat screen tv looping chinese music videos. dining here, it kinda does feel like you're in a different place...specifically, in taiwan, at odd hours in the early morning with your friends.\n\nthe braised ground pork over rice is a star. for $3.75, you get a bowl of rice topped with the stuff, mixed with some chopped up little pickled greens. order some braised hardboiled eggs to go with it, and you're all set.\n\nthe green onion pancake--a classic--is just right. crispy and crunchy edges embrace soft and chewy tendrils of dough. \n\nthey also have green chive \"box\"! one of my favorite dishes ever, it's basically a pan fried contraption, like an empanada, but filled with tiny glass noodles, eggs, garlic, green chives, etc. so tasty.\n\nprice range is fairly good. they have other oldie but goodies, like liang mian (cold noodles), zhong zi (triangular bundles of sticky rice wrapped in leaves), soy milk, fried pork chop over rice, etc. \n\noh, when you're seated, they bring over a little dish of red skinned roasted and salted peanuts. very chinese.\n\ndefinitely worth a try. sadly, i went on a friday and saturday night (consecutively) and it wasn't a packed house. it is a fairly large place, but i wish it could attract the same crowds that its neighbor india oven does (which isn't nearly as charming as this place).", "rating": 4, "date": "2006-04-02"}, {"excerpts": ["If you are not Taiwanese, try the famous scallion pancakes, beef noodle soup, braised ground pork over rice, and Taiwanese fried rice noodles.  ", "Also, their Taiwanese style mini dumplings are very cute and super delicious.  ", "Top it off with a cool watermelon drink.  ", "Definitely go upstairs to their larger second floor.  ", "The Asian waitresses are cute and attentive.  ", "There is a large flat screen TV that will bring you up to date to the latest in Asian Pop video.  ", "It's fun to come in large groups and talk and linger.  ", "It's socially acceptable to talk on your cell phone here.  ", "The place is also kid-proof.  ", "I noticed other Asian guys bringing their cute Hangry Taiwanese girlfriends, who are noticeably calmer after a bowl of spicy Taiwanese noodle soup, tea eggs, and stinky tofu.  ", "Go figure!"], "author": "Terrence G.", "review": "I'm a Chinese ABC, born and raised in San Francisco.  I'm married to a Taiwanese girl, and when she gets Hangry, this is where I take her.  The Richmond district is the end of the universe, and parking is near impossible, but this place is the best cure for Taiwanese girl Hangriness.  I'm not sure about the stinky tofu.  I'm not Taiwanese but I'm told this food is the best Taiwanese food outside of Taiwan.  The dishes are small, and it's like Asian tapas.  I've grown to love it here, and you have to order lots of dishes.  If you are not Taiwanese, try the famous scallion pancakes, beef noodle soup, braised ground pork over rice, and Taiwanese fried rice noodles.  Also, their Taiwanese style mini dumplings are very cute and super delicious.  Top it off with a cool watermelon drink.  Definitely go upstairs to their larger second floor.  The Asian waitresses are cute and attentive.  There is a large flat screen TV that will bring you up to date to the latest in Asian Pop video.  It's fun to come in large groups and talk and linger.  It's socially acceptable to talk on your cell phone here.  The place is also kid-proof.  I noticed other Asian guys bringing their cute Hangry Taiwanese girlfriends, who are noticeably calmer after a bowl of spicy Taiwanese noodle soup, tea eggs, and stinky tofu.  Go figure!", "rating": 5, "date": "2009-05-03"}], "pork belly over rice": [{"excerpts": ["I enjoyed all the other dishes, such as the pork belly over rice, salt & pepper fish, really loved the beef noodle soup, popcorn chicken, & oyster omelette.\n\n"], "author": "Melanie N.", "review": "Authentic and delicious Taiwanese food! With the exception to the stinky tofu, pigs ear & intestine, I could not muster the courage to eat these let alone smell that stinky tofu.  But my friends loved it.  Prices are very reasonable.\n\nI enjoyed all the other dishes, such as the pork belly over rice, salt & pepper fish, really loved the beef noodle soup, popcorn chicken, & oyster omelette.\n\nIt's a small family business and I love supporting small local business.  If you're looking to expand your palette, definitely give Taiwanese food a try.  You won't be disappointed!", "rating": 5, "date": "2016-12-07"}, {"excerpts": ["The pork belly over rice is pretty good, too. ", "The  pieces of pork belly were so creamy and smooth. ", "Just wish there were more of it, but worth $5.65. ", "I can order two if I want more. ", "The chicken hearts were disappointing; nothing special. ", "The eggplant was average. ", "The oyster pancake with special sauce was a bit of a let down. ", "I kept trying to find the oysters but found this clear, gooey paste, instead. ", "I will try them one more time because  many people rave about them.  ", "Like many other restaurants, it's hit or miss at this place. ", "However, I will keep ordering the fried rice and everything pork related until I find the perfect dishes for me. ", "One thing does seriously concern me and keeps this place off my \"Frequently Called List\", the low Health Dept score. ", "If only their homemade sausage fried rice and pork belly over rice weren't so good!"], "author": "Robert L.", "review": "I ordered to go. The sausage fried rice is off the hook. The pork belly over rice is pretty good, too. The  pieces of pork belly were so creamy and smooth. Just wish there were more of it, but worth $5.65. I can order two if I want more. The chicken hearts were disappointing; nothing special. The eggplant was average. The oyster pancake with special sauce was a bit of a let down. I kept trying to find the oysters but found this clear, gooey paste, instead. I will try them one more time because  many people rave about them.  Like many other restaurants, it's hit or miss at this place. However, I will keep ordering the fried rice and everything pork related until I find the perfect dishes for me. One thing does seriously concern me and keeps this place off my \"Frequently Called List\", the low Health Dept score. If only their homemade sausage fried rice and pork belly over rice weren't so good!", "rating": 4, "date": "2017-08-20"}, {"excerpts": ["portions for the price\n\npork belly over rice \n- meh"], "author": "Tina A.", "review": "YUM!\n\ngreen onion pancake\n- crispy and perfectly fried\n\nsautee beef noodle soup\n- thick noodles perfectly cooked\n- yummy spices (surpising because i expected a chinese style beef soup)\n- rich broth\n\nmango beef\n- sweet mango\n- tender beef\n- plenty of onions\n- in a deep fried bowl that soaked up all the juices\n\nshrimp and chive dumplings\n- good but tiny and tiny portions for the price\n\npork belly over rice \n- meh, this is the only item we got that i dont recommend\n\nservice is on point as well", "rating": 4, "date": "2012-08-06"}, {"excerpts": ["Braised pork belly over rice - get with an tea flavored egg - the belly is kinda fatty "], "author": "Lily S.", "review": "Ok, this place is as authentic as it gets. \n\n1. Asian people who seemingly have bad service because they're only comfortable speaking Chinese\n\n2. Amazing food (even my friend who is Taiwanese said this gave him a \"ratatouille\" flashback of when he was back in Taiwan) \n\nI only discovered this place two months ago and i can already say, \"i'm a regular\". The price is good (i almost always order the small dishes) and every dish so far has been a hit. \n\nSome of my favorites:\n\n1. Braised ground pork over rice - always a winner; flavorful and full of ingredients\n\n2. Preserved egg and tofu - cold dish - so good; the sauce makes the dish\n\n3. Bacon salad with taiwanese sauce - sounds weird, right? but trust me, the sauce is really tasty and light \n\n4. Spicy dumplings - its literally just dumplings dunked in a soup of hot sauce -  so delicious - i am usually very picky about my dumplings. i usually don't like dumplings with skin that's too doughy and the meat inside has to be flavorful and not too compact (like it's been in the freezer for a decade). These fit the bill of being perfect plus the added bonus of extreme spiciness. \n\n5. Braised pork belly over rice - get with an tea flavored egg - the belly is kinda fatty but i just eat everything except the fat. \n\nThe oyster pancakes are also fresh and tasty, if you're into that kinda stuff. \n\nHope you guys enjoy this place as much as i do!", "rating": 5, "date": "2011-02-19"}], "pork chop over": [{"excerpts": ["I ordered pork chop over rice for my child. ", "They added spicy on the pork chop. ", "I called the waiter ", "he can't do any thing. ", "He just said I am sorry then I reordered pork chop only. ", "When I got the bill   ", "They charge me 2 times pork chop over rice $8.99 . ", "I asked the waiter again how come I only ordered pork chop why charge the same price....", ", I won't go there anymore...", "I will tell my friends not go there too."], "author": "Vinny L.", "review": "Today i am so angry. I ordered pork chop over rice for my child. They added spicy on the pork chop. I called the waiter he can't do any thing. He just said I am sorry then I reordered pork chop only. When I got the bill   They charge me 2 times pork chop over rice $8.99 . I asked the waiter again how come I only ordered pork chop why charge the same price...., I won't go there anymore...I will tell my friends not go there too.", "rating": 1, "date": "2016-11-23"}, {"excerpts": ["I ordered the pork chop over rice. "], "author": "Jade L.", "review": "It was ok. Nothing so great for me to come back and say \"OMG I have to try it again!\"\nI came here with 2 other peeps, they ordered ground pork with rice and beef noodle soup. I ordered the pork chop over rice. The fried pork chop tasted like the popcorn chicken you get from quicklys, thought that was funny, but prefer it not tasting like it.\n\nI also ordered a thai ice tea...can't go wrong with that, but their ice were the shape of lil mushrooms, very cute, until they melt and im sad.\n\nAll in all, it was ok, nothing bad and nothing great.", "rating": 3, "date": "2012-03-12"}, {"excerpts": ["Fried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork "], "author": "Cindy L.", "review": "This place is sooo authentic\n\n\nFried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\nCombination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime i go, i pay like around 25 per person.. kind of expensive, we also overorder tho....", "rating": 5, "date": "2013-01-02"}, {"excerpts": ["My favorite dishes in no order:\n- turnip and rib soup\n- xian fan tuan / salty rice roll\n- beef noodle soup\n- pork chop over rice\n\n"], "author": "Diana C.", "review": "My boyfriend and I are regulars here.  The main complaint (hardly one) I have about this place is that it's closed on Tuesdays.  And for whatever reason, Tuesdays are days I often crave their food.\n\nMy favorite dishes in no order:\n- turnip and rib soup\n- xian fan tuan / salty rice roll\n- beef noodle soup\n- pork chop over rice\n\nAnd they have the paper covered yogurt drink. And fresh watermelon juice. :d\n\nGetting the check/checking out can be slow, hence minus a star. But the food is always out in a timely manner.", "rating": 4, "date": "2010-12-21"}, {"excerpts": ["taiwanese pork chop over rice and clams With Fresh Basil ", "those are pretty aewsome.  ", "the price is knid of expensive, but i sitll go at least twice a month."], "author": "Jay C.", "review": "taiwanese pork chop over rice and clams With Fresh Basil those are pretty aewsome.  the price is knid of expensive, but i sitll go at least twice a month.", "rating": 4, "date": "2013-06-15"}, {"excerpts": ["I also liked the pork chop over rice here. \n\n"], "author": "Yvonne W.", "review": "I've been here twice, and both times I've really enjoyed the food here. The waitress, who has been the same person both times, is really sweet and attentive. Maybe it helps that I can speak Mandarin, but my brother (who doesn't speak that dialect of Chinese) can speak with her just fine in English. This waitress knew Taiwanese, so I don't know what some people are saying about the staff not being true Taiwanese. \n\nI think my two favorite things here are the niu rou mian (the beef noodle soup) and the cong you bing (scallion pancake). The scallion pancake is quite different from any other one that I've ever had, and I can't really vouch for \"authenticity\" since I've never been to Taiwan. The beef noodle soup that I had shared twice was super yummy -- a semi-spicy,  beefy broth with al dente noodles and a generous portion of beef. I also liked the pork chop over rice here. \n\nFor things I didn't like so much, the ou ah jian (oyster omelette) was pretty bad, almost scary, so I wouldn't recommend that. My party also had the chicken wings the second time we came here, and they're pretty underwhelming. \n\nA lot of people complain here that the food is pricier than what Taiwanese food \"should be sold at.\" Frankly, we're not in Taiwan, so you shouldn't expect to find this type of food or any type of food as cheap as it is back there. The cost of living isn't the same. \n\n I'm definitely coming back here when I come home. Yum, beef noodle soup and pork chop!", "rating": 4, "date": "2008-05-13"}, {"excerpts": ["i must say, the only thing that was good was the roasted salted peanuts and the fried pork chop over rice was average. ", "the beef noodle stew had too much of an star anise (or wahtever it is they put in it) ", "taste. ", "it didnt have that meaty, hearty taste. ", "the scallion pancake had too much flour and was so greasy.  "], "author": "Katherine C.", "review": "reading past reviews, i was SO excited to come and try this place. being taiwanese, i always crave beef noodle stew, scallion pancakes, and all the good stuff. \n\nwhat a disappointment! \n\ni must say, the only thing that was good was the roasted salted peanuts and the fried pork chop over rice was average. the beef noodle stew had too much of an star anise (or wahtever it is they put in it) taste. it didnt have that meaty, hearty taste. the scallion pancake had too much flour and was so greasy.  half of the oyster pancake was nothing but overcooked egg and the other half was undercooked oyster nd flour. \n\ni say, leave the taiwanese food to taiwan street markets and taiwanese mothers.", "rating": 2, "date": "2009-06-16"}, {"excerpts": ["they have other oldie but goodies, like liang mian (cold noodles), zhong zi (triangular bundles of sticky rice wrapped in leaves), soy milk, fried pork chop over rice, etc. \n\n"], "author": "jennifer y.", "review": "ever since taiwan point out in the sunset packed up its bags in the middle of the night and disappeared from our lives, my friends and i have been lamenting the loss of authentic taiwanese food, perfect for late nights. \n\nhowever, we've now found taste of formosa, out on clement & 25th, to fill that abyss in our hearts. \n\nthis place is much larger, with a cool upstairs dining room that features a flat screen tv looping chinese music videos. dining here, it kinda does feel like you're in a different place...specifically, in taiwan, at odd hours in the early morning with your friends.\n\nthe braised ground pork over rice is a star. for $3.75, you get a bowl of rice topped with the stuff, mixed with some chopped up little pickled greens. order some braised hardboiled eggs to go with it, and you're all set.\n\nthe green onion pancake--a classic--is just right. crispy and crunchy edges embrace soft and chewy tendrils of dough. \n\nthey also have green chive \"box\"! one of my favorite dishes ever, it's basically a pan fried contraption, like an empanada, but filled with tiny glass noodles, eggs, garlic, green chives, etc. so tasty.\n\nprice range is fairly good. they have other oldie but goodies, like liang mian (cold noodles), zhong zi (triangular bundles of sticky rice wrapped in leaves), soy milk, fried pork chop over rice, etc. \n\noh, when you're seated, they bring over a little dish of red skinned roasted and salted peanuts. very chinese.\n\ndefinitely worth a try. sadly, i went on a friday and saturday night (consecutively) and it wasn't a packed house. it is a fairly large place, but i wish it could attract the same crowds that its neighbor india oven does (which isn't nearly as charming as this place).", "rating": 4, "date": "2006-04-02"}], "fried chicken over rice": [{"excerpts": ["Also had the Taiwanese fried chicken over rice. ", "It was amazing!  ", "Thank you"], "author": "Jason G.", "review": "Two words. Tea egg. \n\nAlso had the Taiwanese fried chicken over rice. It was amazing!  Thank you", "rating": 5, "date": "2016-11-04"}, {"excerpts": ["With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\n"], "author": "Cindy L.", "review": "This place is sooo authentic\n\n\nFried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\nCombination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime i go, i pay like around 25 per person.. kind of expensive, we also overorder tho....", "rating": 5, "date": "2013-01-02"}], "braised beef over rice": [{"excerpts": ["Braised Beef over Rice $8.25.  ", "Looks more like a beef stew with carrots & turnips.  ", "The sauce has just a bit of heat.  ", "The rice is more on the side then under the beef.  ", "The beef could use a bit more braising...", "like another hour or so...it was bit chewy.  "], "author": "Jerry W.", "review": "OK, it was date night with the wife.  After the movie, we head for a quick dinner before picking up the kids.  All the other restaurants in the area was full, except for this place...should have been a clue.\n\nThe menu had hand written changes to the prices, but when you walk into the dining room you are hit with a interesting scent...sort of sourish smell to best describe it.\n\nAppetizer:\nChives Shrimp Dumpling $7.25.  There were about a dozen of these little flavorful pillows.  This is really good with or without the white vinegar they served on the side for dipping.\n\nMain Courses:\nBraised Beef Noodle Soup $8.25.  A bowl of udon style noodles in a spicy soup.  The beef is pretty tender considering its braised.  You can take the noodles out and eat it away from the soup for a not so hot meal.\n\nBraised Beef over Rice $8.25.  Looks more like a beef stew with carrots & turnips.  The sauce has just a bit of heat.  The rice is more on the side then under the beef.  The beef could use a bit more braising...like another hour or so...it was bit chewy.  The turnip is very bland, did not pick up any flavor from the sauce.\n\nBathroom:\nThere are 2 single unisex rooms.  Both rooms only had 1 light.  The one closest to the wall had the light over the toilet...the other room had the light over the sink.  There is also a motion sensor that turns on the light...must be cutting cost on utilities.", "rating": 3, "date": "2012-05-19"}, {"excerpts": ["As in all restaurants, some dishes are consistently good while some (like the braised beef over rice) are hit and miss."], "author": "Empress C.", "review": "Tasty Taiwanese style food. The entrees here taste better than the street style foods which are overpriced. Which is too bad as Taiwanese food is very hard to find in San Francisco (and even the Bay Area compared to Monterey Park/San Gabriel Valley in Los Angeles). \n\nMy favorite dishes there are the dry sauteed beef and the Hakka style stir fry. Wish their prices were either cheaper or they gave you full-sized entrees. Also charge steam rice by the bowl. They also play KTV or music videos on the flat screen (which I do not mind since I listen to Chinese music myself). \n\nOverall, decent place if you are hankering for Taiwanese food. They also have cute to-go containers, reminescent of Taiwan itself. As in all restaurants, some dishes are consistently good while some (like the braised beef over rice) are hit and miss.", "rating": 3, "date": "2007-01-07"}], "braised pork feet over": [{"excerpts": ["With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\n"], "author": "Cindy L.", "review": "This place is sooo authentic\n\n\nFried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\nCombination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime i go, i pay like around 25 per person.. kind of expensive, we also overorder tho....", "rating": 5, "date": "2013-01-02"}], "taiwanese fried rice noodle": [{"excerpts": ["Braise beef with noodle soup-very good\nTaiwanese fried rice noodle"], "author": "Ru L.", "review": "We ordered \nTaiwanese pot stickers-very good.\nSalt &pepper chicken tender-very good.\nStinky tofu-the best I have tried so far around bay area but I wish they'd give more      pickled cabbage.\nBraise beef with noodle soup-very good\nTaiwanese fried rice noodle-Very good \nOyster crepe with special sauce-sauce taste good but too much powder in my opinion.\nOverall,their food is great and worth the drive.", "rating": 4, "date": "2013-05-05"}], "pork with vegetables soup": [], "squid with vegetable soup": [{"excerpts": ["Squid with Vegetable Soup (with Noodles)($7.95) - since this place is famous for its noodle dishes, I ordered this one.  ", "Unfortunately a miss for me- ", "the noodles were overcooked to the point that they would break apart when I tried to pick it up.  ", "Didn't help that they were in a somewhat goupy soup ", "(guess I was looking for something less", "... viscous?).  ", "Lots of vegetables ", "but I had a hard time telling what was a veggie and what was a slice of squid- not that it matters "], "author": "Audrey H.", "review": "3 stars only because my \"main course\" was ok, though the appetizers were quite good!  Came here on advice of my date's friend, since he liked the \"authenticity\" of this spot.\n\nVenue / Service: small and dimly lit, but not too crowded.  We sat on the first floor but there seems to be more spacious second floor, based on the large groups of families that were coming down after their meal.  The servers don't speak the best English but are able to understand it.  They were also quick in the kitchen since food came out quite quickly but perhaps it was because we came at an unusual time (late lunch on Sunday).  \n\nFood: we ended up preferring our small dishes vs. their specialty, the noodles.  \n-- Preserved Egg and Tofu ($6.95) - for those who are unaware, preserved egg is an acquired taste to some, though luckily my date and I are HUGE fans of the funky smelling and tasting egg.  Tofu was firm enough to pick up without completely falling apart.  The sweet sauce should help counteract the strong flavors of the egg, but again, the egg is an acquired taste and may not be great for some peeps.  \n\n-- Salt & Pepper Chicken Tender ($7.50) - almost reminds me of popcorn chicken with some added spices to it, and this was one dish that we quickly finished.  The chicken was surprisingly still moist after being fried and they are served in great bite-sizes for easy eating.  Would highly recommend!\n\n-- Squid with Vegetable Soup (with Noodles)($7.95) - since this place is famous for its noodle dishes, I ordered this one.  Unfortunately a miss for me- the noodles were overcooked to the point that they would break apart when I tried to pick it up.  Didn't help that they were in a somewhat goupy soup (guess I was looking for something less... viscous?).  Lots of vegetables but I had a hard time telling what was a veggie and what was a slice of squid- not that it matters but I couldn't tell how much squid there actually was in the dish.\n\nAll in all, perhaps I'd choose a different noodle dish, but the appetizers we got were good!", "rating": 3, "date": "2018-02-22"}, {"excerpts": ["I was feeling adventurous and ordered the Squid with Vegetable Soup and Rice Noodles. ", "I felt pretty indifferent about my dish. ", "The soup was very favorable and you can taste the XO sauce; not to mention, it was very thick. ", "My boyfriend ordered the Braise Beef with Noodle Soup and that was the winning dish for the evening. "], "author": "Emily L.", "review": "It is pretty hard to come across Taiwanese restaurants in the city. Taste of Formosa, fulfills that craving. \nI came here on a cold night with my boyfriend. For appetizers, we ordered Salty Sticky Rice Roll and the Pork and Chives Dumplings. They were both delicious and pretty standard. I was feeling adventurous and ordered the Squid with Vegetable Soup and Rice Noodles. I felt pretty indifferent about my dish. The soup was very favorable and you can taste the XO sauce; not to mention, it was very thick. My boyfriend ordered the Braise Beef with Noodle Soup and that was the winning dish for the evening. It was not as spicy as I thought it would be; the beef was cooked perfectly and the flavors of the soup complimented the whole dish.\n\nOverall, this place definitely has a lot of potential. The only con is that parking around this neighborhood is a challenge. However, they do validate parking! :)", "rating": 3, "date": "2015-05-18"}], "oyster vermicelli noodle soup": [{"excerpts": ["Oyster Vermicelli Noodle Soup", ": I enjoyed it all except the oysters (but I don't care for cooked oysters, so that is not the restaurant's fault)\n", "Oyster Crepe: again, not an oyster fan, but the one accidental oyster that I ate ", "seemed like it wasn't dry and had \"good\" oyster flavor. "], "author": "Vicki T.", "review": "Went with some old friends and just had them order their usual since I've never really been to a Taiwanese restaurant before. \n\nHot and sour soup had a good amount of stuff in it and just the right amount of spicy. Really enjoyed it. Flavorful.\nScallion pancake with fried egg: my first time having a fried egg on a scallion pancake but this pancake is what I'm talking about. All the other scallion pancakes have not measured up like this one has.\nMa Po Tofu: was good but only had one helping of it. In hindsight, I wish I had more of it. Went so well with my rice.\nI had this chewy (rice) dumpling with beef(?) filling in it that was really good. The chewiness of the outer was so good and the beef filling was just the right amount (not too much and not too skimpy.)\nOyster Vermicelli Noodle Soup: I enjoyed it all except the oysters (but I don't care for cooked oysters, so that is not the restaurant's fault)\nOyster Crepe: again, not an oyster fan, but the one accidental oyster that I ate seemed like it wasn't dry and had \"good\" oyster flavor. I enjoyed the ketchup sauce on top of this crepe, so I think next time I'm going to get the Shrimp Crepe.\n\nGot another dish that was beef and veggies in a bowl of spicy sauce. Don't know what it was called but it was too salty for me. But my friends really liked it, but I thought the salt load was a bit more than I could tolerate. \n\nWill definitely come back here and bring friends. Oh, on the way downstairs and out, something smelled really bad and I just realized it might have been their stinky tofu...\n\nLastly, attentive waitresses. Loved how they were playing a Cantonese Kareoke DVD upstairs in a Taiwanese restaurant. Muahahaha.", "rating": 4, "date": "2013-07-27"}, {"excerpts": ["Stinky tofu - decent \nPork with veg soup - damn good\nOyster vermicelli noodle soup - damn good\n\n\n"], "author": "D W.", "review": "This place has authentic Taiwanese pretty much down - it's that good !!!  \n\nSliced pork with garlic sauce - to die for \nHomemade sausage - pretty good\nOyster with special sauce - pretty good but I don't like oysters (wife likes)\nStinky tofu - decent \nPork with veg soup - damn good\nOyster vermicelli noodle soup - damn good\n\n\nYou can't go wrong coming here - we will be back for sure.", "rating": 5, "date": "2014-02-22"}], "stir fried udon": [], "dan dan noodle": [], "fried minced pork noodle": [], "preserved pickle noodle soup": [], "braised beef with noodle soup": [{"excerpts": ["Braised Beef With Noodle Soup  - tender braised beef with spicy noodles", ", this is one of my favorite dishes. "], "author": "Nette T.", "review": "I had a great lunch here with my friend who is Taiwanese. I don't eat Taiwanese food that often so it was good to go with someone who can order for the both of us!\n\nWe were hungry so we ordered lots of snacks to eat:\n\nCold salted soy bean milk - this went well with the dishes - sometimes when things come out piping hot, you need something to cool it down. \n\nPopcorn chicken - a delightful snack food of perfectly fried pieces of chicken that was crunchy on the outside and yummy on the inside. \n\nMarinated cucumber - crunchy cucumber, pickled with chili sauce to add a kick. \n\nBraised Beef With Noodle Soup  - tender braised beef with spicy noodles, this is one of my favorite dishes. This is comfort food to me. \n\nStinky tofu - I used to be afraid of stinky tofu but I've grown to love it. And I love the stinky tofu at Taste of Formosa. Perfectly fried - crunchy on the outside and soft on the inside. \n\nSteamed sticky rice with pork - steamed in banana leaf with bits of pork. Lots of flavor and sticky rice is perfect texture - not too gummy.\n\nEverything was really good and I loved all the dishes my friend picked. The restaurant is a little small so it can get busy fast.", "rating": 5, "date": "2018-06-26"}, {"excerpts": ["The braised beef with noodle soup is ok", ", I was pretty thirsty afterwards and finished a pot of tea and a glass OJ to help quench my thirst.  "], "author": "B H.", "review": "This place puts a lot of love in its food, too bad it's in the form of salt and MSG.   \n\nThe braised beef with noodle soup is ok, I was pretty thirsty afterwards and finished a pot of tea and a glass OJ to help quench my thirst.  The beef and noodle, i would give 4 stars, the broth 2-\n\nThe onion pancake isn't that great, but worth a try.... I think the Korean version is better ( and I don't say that too often!)\n\nMy chick friend also thought it was ok, not worth raving about. I will give this place one more chance though.", "rating": 3, "date": "2012-05-10"}], "house special cold noodle": [{"excerpts": ["Combination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime "], "author": "Cindy L.", "review": "This place is sooo authentic\n\n\nFried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\nCombination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime i go, i pay like around 25 per person.. kind of expensive, we also overorder tho....", "rating": 5, "date": "2013-01-02"}, {"excerpts": ["I got the house 'spicy' sausages (which weren't spicy at all) and the house special cold noodle (which had strips of chicken, a slightly boring dish). \n\n"], "author": "Jae K.", "review": "I ordered delivery for two at 10:30pm on a lazy sunday night. I got the house 'spicy' sausages (which weren't spicy at all) and the house special cold noodle (which had strips of chicken, a slightly boring dish). \n\nAnd yet, it's hard to beat their 30 minute delivery service, and I'm left satisfied with terrible garlic breath and a large bottle of Taiwanese lager (named aptly, 'Tawian Beer') left over. \n\nBTW, they say they stop delivering at 10:00pm, but they'll take deliveries until later if you live close by. \n\nI'm definitely ordering again. Next time I might venture some of their stranger dishes that involve pork intestines.", "rating": 3, "date": "2008-07-06"}, {"excerpts": ["- you had me at hello\nhouse special cold noodle - you had me at hello\nbeef with green onion ", "- you had me at hello\nseafood kimchee noodle soup - I've loved you since we first met\npig ears - "], "author": "chris o.", "review": "Being a whitey, I must say I wouldn't have any idea how good this place is if it weren't for my best pal from Taiwan.  That being said, I know it is good and I know I am not the only one who feels that way.  \n\nFormosa is solid.  I am hooked on the chive pocket.  Try it and you may be too.  \n\nchives shrimp dumplings - you had me at hello\nbeef noodle soup - you had me at hello\nhouse special cold noodle - you had me at hello\nbeef with green onion - you had me at hello\nseafood kimchee noodle soup - I've loved you since we first met\npig ears - (norcal vegans look away)\nmustard green w/ shredded pork fried rice cake - I cherish the ground you walk upon.\n\nThe menu is eclectic and diverse.  I love picking new items randomly- they are never what I expect them to be and usually a nice surprise.  \n\nIf you don't speak mandarin and are ordering by phone, have a menu handy and just read the numbers, that's how this dummy does it...", "rating": 4, "date": "2007-04-16"}], "mustard green with shredded pork fried rice": [], "napa cabbage with shredded pork fried rice": [], "mustard green with seafood kimchi noodle soup": [], "napa cabbage with seafood kimchi noodle soup": [], "beef with satay sauce over noodle": [], "taiwanese noodle or rice noodle": [], "sauteed in wine sauce": [], "beef with satay sauce": [], "beef with hot special sauce": [{"excerpts": ["Beef with hot special sauce \n6. ", "Chicken in rice wine sauce *\n7. ", "Shrimp with pineapple *\n8. ", "Morning Glory\n9. "], "author": "Asha H.", "review": "Okay, here's the thing...\n\nI know NOTHING about Taiwanese food, I have absolutely no reference to what this food is supposed to taste like or if it was prepared properly.  All I know is that everything I shoved in my mouth last night, was delicious.\n\nSeriously, the restaurant was pretty empty, so when we strolled in with our party of eight, and said our reservation, I looked around at the first floor of semi-occupied two and four tops wondering, \"How are they going to fit us all in here?\".  Then we were taken upstairs, and I was pleasantly surprised. \n\nWe sat down, and having researched the restaurant a little bit, I know some choice dishes I wanted to try, and so we ordered:\n\n1. Scallion pancake with egg *\n2. Drunken Chicken\n3. Fried Squid Balls \n4. Deep fried pork intestine\n5. Beef with hot special sauce \n6. Chicken in rice wine sauce *\n7. Shrimp with pineapple *\n8. Morning Glory\n9. Braised ground pork over rice **** (The whole reason why I went)\n10. Whole fish with spicy sauce (not sure what it's called on the menu)\n(* are my supa-favorites)\n\nThere weren't any hungry people left, and thanks to a combination of the little research I did and an actual Taiwanese person in our party, everyone actually enjoyed every dish.  And including tip it ended up being $16 a person for a whole lotta food.\n\nOur waitress was very helpful, service was great and presentation was beautiful.  Five stars for sure, and will definitely be back.", "rating": 5, "date": "2008-10-18"}], "sauteed beef tendon": [{"excerpts": ["We also ordered the sauteed beef tendon . ", "It was pretty good, very flavorful . ", "The decor was very comforting and simple, yet unique . ", "I would definitely come back here for the braised beef noodle soup . ", "After the dinner, we ordered the assorted beans & rice balls sweet soup . ", "It was so good & good for you ;D"], "author": "Jenny Y.", "review": "Around 10:00 PM, what to eat in Richmond ? I ordered the Braised beef noodle soup-- DELICIOUS . Spicy, hot & yummy~ We also ordered the sauteed beef tendon . It was pretty good, very flavorful . The decor was very comforting and simple, yet unique . I would definitely come back here for the braised beef noodle soup . After the dinner, we ordered the assorted beans & rice balls sweet soup . It was so good & good for you ;D", "rating": 4, "date": "2008-07-14"}], "bbq beef short ribs": [], "house special ribs": [{"excerpts": ["some dishes that did not work that well - drunken chicken, House special ribs\nand service that did not seem to click this evening. ", "i was charged corkage and ended up opening the bottle myself because our server did not know how to work the corkscrew.\ngo figure!\n", "plus parking in this part of town sucks!\nwasn't worth the trip."], "author": "Jeff W.", "review": "some good dishes - green onion pancake, beef noodle soup, freshly made dumplings. deep fried yellowtail fish\nsome dishes that did not work that well - drunken chicken, House special ribs\nand service that did not seem to click this evening. i was charged corkage and ended up opening the bottle myself because our server did not know how to work the corkscrew.\ngo figure!\nplus parking in this part of town sucks!\nwasn't worth the trip.", "rating": 3, "date": "2007-05-13"}], "pork intestines pot": [], "ground pork with bamboo shoots": [], "stir fried bean curd with shredded pork": [], "twice cooked": [{"excerpts": ["- Hakka style sliced pork belly\n- Taiwanese fried noodles\n- Twice cooked pork\n- "], "author": "Dante B.", "review": "Excellent, excellent, excellent Taiwanese food in a nice, relaxing atmosphere.\n\nI'm a Taiwanese food expert and vouch for this place.  Their menu is ample and I have yet to find a bad dish.  On my most recent trip (Feb 18, 2009) I tried as many of the hot and cold dishes as I could cram into my and my friend's bellies .. absolutely fabulous and a trip back to the old country.\n\nI would highly recommend the following:\n\n- Scallion pancakes\n- Hakka style sliced pork belly\n- Taiwanese fried noodles\n- Twice cooked pork\n- Deep fried yellow fish\n- homemade sausages with garlic and ginger\n\n.. but the truth is I don't think you can go wrong anywhere on the menu.  Be sure and wash it all down with some nice green tea or a Taiwan pi-jou.\n\nLooking for some great food, even for the un-initiated?  You need to try this place.. you won't regret it.", "rating": 4, "date": "2009-02-21"}], "ground pork balls in clay pot": [], "sauteed sliced pork with kim chi": [], "sauteed vermicelli beef or chicken": [], "vermicelli with meat sauce": [], "hakka style food sauteed": [], "pork kidney simmered with sesame oil or pork liver": [], "stir fried squid with vegetable": [], "bean sauce": [], "fish fillet with hot special sauce": [{"excerpts": ["We found a long long hair in the dish: fish fillet with hot special sauce.\n", "I claimed for refund right after we found the hair.\n", "I ask to refund just for that dish, not for the entire bill.\n", "The owner came out, stared at me, and said:\n\"You ate all of the fish and ask for a refund?\"\n", "Since they already took the dish into the kitchen,\nI could not check how many pieces of fish I ate. \n", "However, who would expect hairs in their food and inspect the dish before they start eating?\n"], "author": "In-Sung L.", "review": "We liked the food; until today.\nWe found a long long hair in the dish: fish fillet with hot special sauce.\nI claimed for refund right after we found the hair.\nI ask to refund just for that dish, not for the entire bill.\nThe owner came out, stared at me, and said:\n\"You ate all of the fish and ask for a refund?\"\nSince they already took the dish into the kitchen,\nI could not check how many pieces of fish I ate. \nHowever, who would expect hairs in their food and inspect the dish before they start eating?\nThe owner never apologized until I left the restaurant.\n\nMe and my wife like the food and dined here at least once every other week, but I guess we won't eat here anymore.", "rating": 1, "date": "2011-12-17"}], "deep fried yellow fish": [{"excerpts": ["Deep fried yellow fish\n- homemade sausages with garlic and ginger\n\n.. but the truth is I don't think you can go wrong anywhere on the menu.  "], "author": "Dante B.", "review": "Excellent, excellent, excellent Taiwanese food in a nice, relaxing atmosphere.\n\nI'm a Taiwanese food expert and vouch for this place.  Their menu is ample and I have yet to find a bad dish.  On my most recent trip (Feb 18, 2009) I tried as many of the hot and cold dishes as I could cram into my and my friend's bellies .. absolutely fabulous and a trip back to the old country.\n\nI would highly recommend the following:\n\n- Scallion pancakes\n- Hakka style sliced pork belly\n- Taiwanese fried noodles\n- Twice cooked pork\n- Deep fried yellow fish\n- homemade sausages with garlic and ginger\n\n.. but the truth is I don't think you can go wrong anywhere on the menu.  Be sure and wash it all down with some nice green tea or a Taiwan pi-jou.\n\nLooking for some great food, even for the un-initiated?  You need to try this place.. you won't regret it.", "rating": 4, "date": "2009-02-21"}], "pineapple with shrimp": [], "stir fried chinese squash with clams": [], "clams with fresh basil": [{"excerpts": ["With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\n"], "author": "Cindy L.", "review": "This place is sooo authentic\n\n\nFried intestines are awesome 5/5\ntaiwanese pork chop over rice 5/5\nScallion Pancake 3/5\nCold Noodle With Shredded Chicken 3/5\nSliced Pork With Garlic Sauce 5/5\nBraised Ground Pork Over Rice 5/5\nFried Chicken Over Rice 5/5\nBraised Pork Feet Over Noodle 3.5/5\nClams With Fresh Basil 5/5\nMarinated Cucumbers 5/5\nBraised Marinated Pig Ears 5/5\nSpicy wontons 3/5\nCombination Braised Items 5/5\nHouse Special Cold Noodle 2/5\n\n\neverytime i go, i pay like around 25 per person.. kind of expensive, we also overorder tho....", "rating": 5, "date": "2013-01-02"}, {"excerpts": ["taiwanese pork chop over rice and clams With Fresh Basil ", "those are pretty aewsome.  ", "the price is knid of expensive, but i sitll go at least twice a month."], "author": "Jay C.", "review": "taiwanese pork chop over rice and clams With Fresh Basil those are pretty aewsome.  the price is knid of expensive, but i sitll go at least twice a month.", "rating": 4, "date": "2013-06-15"}], "fried egg with preserved turnip": [], "braised napa cabbage": [{"excerpts": ["Pork and sticky rice was great, braised napa cabbage tasted just like at home, and there was a chicken dish that was decent. \n\n"], "author": "Kathy Z.", "review": "Overall rating 3/5, but 4/5 for the beef noodle soup and scallion pancake!\n\nService is very decent. Most of the dishes were very home-style, not particularly unique but very tasty nonetheless. Pork and sticky rice was great, braised napa cabbage tasted just like at home, and there was a chicken dish that was decent. \n\nOrder the beef noodle soup and the scallion pancake for sure.", "rating": 3, "date": "2014-06-25"}], "eggplant with basil garlic sauce": [], "stir fried vegetables": [], "bacon with taiwanese cabbage": [{"excerpts": ["I'm used to\nBraised Ground Pork over Rice - this was probably one of my favorites of the night; portion size is not very big if it's for one hungry person\nBacon with Taiwanese cabbage - this was a refreshing dish; I would've loved if they used crispy bacon instead of regular bacon that was still chewy and you can still see all the fat\nPork with Vegetable Soup (added noodles for 50 cents) - this was a good dish; the dish had chunks of pork, shitake mushrooms, napa cabbage, carrots in a very thick soup - reminded me of chinese hot and sour soup."], "author": "Anna L.", "review": "Came here on a Thursday night and it wasn't too busy so we got seated right away. The interior of the restaurant was very nice and neat and apparently there's an upstairs as well. The service was very good; the waitresses were very approachable and patient! The food didn't take very long to come out and was just okay for me, nothing really stood out. We did family style:\n\nOyster Crepe with Special Sauce - i didn't particularly like this very much because it had a weird slimy texture but the sauce was pretty good.\nGreen Onion Pancake - this was pretty good; very crispy and savory. This was less doughy and more crispy than the Chinese green onion pancake I'm used to\nBraised Ground Pork over Rice - this was probably one of my favorites of the night; portion size is not very big if it's for one hungry person\nBacon with Taiwanese cabbage - this was a refreshing dish; I would've loved if they used crispy bacon instead of regular bacon that was still chewy and you can still see all the fat\nPork with Vegetable Soup (added noodles for 50 cents) - this was a good dish; the dish had chunks of pork, shitake mushrooms, napa cabbage, carrots in a very thick soup - reminded me of chinese hot and sour soup.", "rating": 3, "date": "2014-03-28"}], "sweet and sour pork or chicken": [], "mu shu": [], "mixed vegetables chicken": [], "black pepper": [], "mongolian": [{"excerpts": ["The service was excellent, and the mongolian beef was very good, the oyster pancake was good (but ask for the sauce on the side). ", "the steamed rice in a tube was very authentic. ", "We also loved the fresh soybean and the fresh watermelon drink. ", "The desserts were very good too. "], "author": "Margaret L.", "review": "We ate at Taste of Formosa. My parents are from Tainan, and they found the food to be very authentic, with most of the typical Taiwanese dishes from their childhood. The service was excellent, and the mongolian beef was very good, the oyster pancake was good (but ask for the sauce on the side). the steamed rice in a tube was very authentic. We also loved the fresh soybean and the fresh watermelon drink. The desserts were very good too. We are going back!\n\nTaste of Formosa also offers free 1 hour parking 1 block away. Highly recommended!", "rating": 4, "date": "2012-08-12"}], "szechuan shrimp": [], "fish fillet with black garlic sauce": [], "sauteed mixed vegetable": [], "sauteed kimchi with tofu": [], "sauteed vermicelli with vegetables": [], "red bean paste cake": [{"excerpts": ["- Red bean paste cake (http://www.yelp.com/biz_photos/hYH3XfUXFc09TjiuGfLiow?select=mkka8L4rrPGLVWhly5bm8g) - $3.50 "], "author": "Jannifer H.", "review": "An okay Taiwanese restaurant.\n\nVenue: Pretty big 2 story place. Semi trendy decorations.\n\nService: Okay.\n\nFood:\n- Three cup chicken (http://www.yelp.com/biz_photos/hYH3XfUXFc09TjiuGfLiow?select=XnLB4XVKlRcQSyvI4KgLuA) - $10.50 Tasted okay. Evenly coated sauce. Chicken was cooked well.\n\n- Mustard green shredded pork fried rice cake (http://www.yelp.com/biz_photos/hYH3XfUXFc09TjiuGfLiow?select=M3k4bsdz7GsxL_GiwmmCyw) - $8.95 Tasted okay. Like any other fried rice cake dishes you have anywhere else.\n\n- Stinky tofu (http://www.yelp.com/biz_photos/hYH3XfUXFc09TjiuGfLiow?select=phJ7TGUviqal-llV45Oi8A) - $6.95 Tasted decent. Not too stinky.\n\n- Oyster pancake (http://www.yelp.com/biz_photos/hYH3XfUXFc09TjiuGfLiow?select=EXOpztp9gi4Ip3KTyH9bdQ) - $6.95 This was good. oyster in chewy batter with the usual oyster pancake sauce.\n\n- Stir fried Chinese squash with clam (http://www.yelp.com/biz_photos/hYH3XfUXFc09TjiuGfLiow?select=m-BLyRjpvJO5TNMsexnYEQ) - $10.95 Very refreshing dish. Loved the clams.\n\n- Beef noodle soup (http://www.yelp.com/biz_photos/hYH3XfUXFc09TjiuGfLiow?select=Nm09UAcxQ5J5p0qk0RT6EA) - $7.95 Tasted okay but not great. Didnt exactly like their noodles and soup wasnt beefy enough.\n\n- Red bean paste cake (http://www.yelp.com/biz_photos/hYH3XfUXFc09TjiuGfLiow?select=mkka8L4rrPGLVWhly5bm8g) - $3.50 Not bad. \n\nPrice: Slight over priced for okay food.\n\nOverall: This place was all over an okay restaurant. This is probably the only decent Taiwanese place in the city so far. If you want good Taiwanese food, go to the south bay.", "rating": 3, "date": "2012-02-03"}], "peanut curd": [], "red bean curd": [], "shaved ice with red bean": [{"excerpts": ["The Good:\n+Passion-fruit Green Tea = very good\n+Shaved Ice with red bean = very good\n+Scallion pancake = one of the best appetizers I have ever had\n\n"], "author": "Benson T.", "review": "My friends surprised me here for my birthday lunch the other day. I immediately liked the place when I walked in because they were playing Jay Chou music.\n\nThe Good:\n+Passion-fruit Green Tea = very good\n+Shaved Ice with red bean = very good\n+Scallion pancake = one of the best appetizers I have ever had\n\nThe Bad:\n-Braised Beef over rice = the 'beef' was mostly just fat and barely had any meat. I should have tried other things but my friend said yelp reviews recommended to get this dish. I regret ordering it. Better to order one of the entrees and a separate bowl of rice.\n\nI will come again to try the other dishes that I should have gotten, such as Mango Beef and such. But, until then, 3 stars. \n\nI still don't know what 'Formosa' is though. I should have asked the workers lol.", "rating": 3, "date": "2010-09-03"}], "assorted beans and rice balls": [], "sesame sweet soup": [], "fresh watermelon juice": [{"excerpts": ["And fresh watermelon juice. "], "author": "Diana C.", "review": "My boyfriend and I are regulars here.  The main complaint (hardly one) I have about this place is that it's closed on Tuesdays.  And for whatever reason, Tuesdays are days I often crave their food.\n\nMy favorite dishes in no order:\n- turnip and rib soup\n- xian fan tuan / salty rice roll\n- beef noodle soup\n- pork chop over rice\n\nAnd they have the paper covered yogurt drink. And fresh watermelon juice. :d\n\nGetting the check/checking out can be slow, hence minus a star. But the food is always out in a timely manner.", "rating": 4, "date": "2010-12-21"}], "fresh lemon juice": []}