{"money bags": [{"excerpts": ["I tried the money bags (very fun presentation) and the green curry rice dish. "], "author": "Andrew H.", "review": "This is the best place for Thai in the Castro, and yes I've tried the others.\n\nI tried the money bags (very fun presentation) and the green curry rice dish. Both were delicious and filling. \n\nThe restaurant itself is somewhat trendy but still very casual and friendly. I look forward to some more meals there.", "rating": 4, "date": "2014-06-15"}, {"excerpts": ["Well, you can go all fancy on their \"Money Bags\" appetizer which I love. ", "Their soups, curries and noodle dishes have not disappointed, and they are nice for the low/no gluten folks with rice dishes and rice noodles ", ":) "], "author": "Sarah X.", "review": "This place is a great cheap eat. Don't go trying to be all fancy when you go here, this is not how they excel. Well, you can go all fancy on their \"Money Bags\" appetizer which I love. Their soups, curries and noodle dishes have not disappointed, and they are nice for the low/no gluten folks with rice dishes and rice noodles :) I've had no issues with to-go or take out, and had pleasant meals here with friends and solo. \n\nAlso, do you think you all are culturally aware when you speak badly about the servers? There's things that are a little off, but not out of lack of desire to serve you but language/cultural differences. In my opinion.", "rating": 4, "date": "2012-08-03"}, {"excerpts": ["They had me with the money bags and cucumber salad appetizer, but when they added the lunch special - YAY! ", "Soup, salad, appetizer, entree... so good, so reasonable, and just the right portions for lunch. ", "GO THERE TODAY!"], "author": "Jeffrey H.", "review": "I'm not sure why, but I adore this place. They had me with the money bags and cucumber salad appetizer, but when they added the lunch special - YAY! Soup, salad, appetizer, entree... so good, so reasonable, and just the right portions for lunch. GO THERE TODAY!", "rating": 4, "date": "2011-11-04"}, {"excerpts": ["The Money Bags appetizer is my favorite. "], "author": "Mike P.", "review": "I've eaten here more times than I can count. It's a good thing it is only 1.5 blocks away. The food here is really some great Thai. It's a rare event when I get something that's off, maybe salty, or maybe I shouldn't have tried to be so adventurous. Overall, the food is consistently great. The rice plates are enough for a satisfying meal, and are a great option at a great price for many of their dishes. If I'm feeling ravenous the entree + rice is satiating. The Money Bags appetizer is my favorite. All their curries are good....with exception to the Panang Curry w/ Beef. It breaks my heart that this dish isn't (in my opinion) good. I LOVE Panang Curry. The Thai House Beef dish is mouth watering, and that spicy green dipping sauce with citrus and garlic will stick with you as a constant reminder of how good it was. It's the best place for takeout, I just wish they would hop on board with online & app based ordering. I can order my food, walk out the door and by the time I'm there it's waiting for me.", "rating": 5, "date": "2012-04-15"}], "veggie egg rolls": [{"excerpts": ["well I chose to have the veggie egg rolls, chicken Pra Ram with peanut sauce, soup, and salad. ", "The server was very friendly and it was not busy at all when I arrived. ", "I was seated promptly and enjoyed my meal. ", "The portions were just perfect ", "and I was left feeling full and satisfied, such a better feeling that overfed and stuffed. ", "I recommend this place for sure!"], "author": "Alex T.", "review": "I recently had a job interview and decided to treat myself to some Thai food afterwards, I found this place in the Castro and was very happy to find that they had an amazing lunch special for $11. What do you get for $11, well I chose to have the veggie egg rolls, chicken Pra Ram with peanut sauce, soup, and salad. The server was very friendly and it was not busy at all when I arrived. I was seated promptly and enjoyed my meal. The portions were just perfect and I was left feeling full and satisfied, such a better feeling that overfed and stuffed. I recommend this place for sure!", "rating": 4, "date": "2014-01-23"}], "crispy tofu": [{"excerpts": ["and I got the Crispy Tofu with Peanut Sauce.  ", "I want to say it was because of the things we ordered, but I know it's not.  ", "Like most asian restaurants, they have a long list of menu items, but they all share either the same protein, veggies, or sauce just in different combinations for cooked differently. ", "Kevin's catfish dish was sooooo oily and the pieces of catfish were skimpy.  ", "My crispy tofu tasted like it came from the asian supermarket, in the section where they have pre-deep-fried tofu cubes in packages ready to take home. ", "I was expecting fresh super crispy tofu skin with a silky tofu center.  ", "The peanut sauce wasn't horrible but it was so heavy. ", "I think it may have been made with 90% peanut butter. ", "Sigh*"], "author": "Annie D.", "review": "I'm Asian and I grew up with a friend who was Thai.  I know good asian food and Thai Express did not deliver.  The restaurant is nice inside, service is prompt. We were there for a late lunch on Saturday.\n\nWith that said, Kevin got the Spicy Catfish with veggies and I got the Crispy Tofu with Peanut Sauce.  I want to say it was because of the things we ordered, but I know it's not.  Like most asian restaurants, they have a long list of menu items, but they all share either the same protein, veggies, or sauce just in different combinations for cooked differently. Kevin's catfish dish was sooooo oily and the pieces of catfish were skimpy.  My crispy tofu tasted like it came from the asian supermarket, in the section where they have pre-deep-fried tofu cubes in packages ready to take home. I was expecting fresh super crispy tofu skin with a silky tofu center.  The peanut sauce wasn't horrible but it was so heavy. I think it may have been made with 90% peanut butter. Sigh*", "rating": 3, "date": "2009-03-11"}, {"excerpts": ["The crispy tofu and mixed vegetable with peanut sauce was the only thing I've had there that's actually bad.  ", "It was lettuce with peanut butter and tofu  ", "I guess it's supposed to be similar to Gado Gado (Indonesian) "], "author": "Paul K.", "review": "A decent Thai restaurant with a large menu selection.  For the most part it's standard Thai food that's a bit better than the average and  the prices are reasonable.  Their fried rice with shrimp and tomatoes is outstanding and the red, green curries and the egg plant (Ma Kuer) dish are fairly good.  Tom Yum Goong is also good, nicely sour and spicy.  The crispy tofu and mixed vegetable with peanut sauce was the only thing I've had there that's actually bad.  It was lettuce with peanut butter and tofu  I guess it's supposed to be similar to Gado Gado (Indonesian) but just tasted wrong.  \n\nIt's a good place for a quick bite and take out orders when you don't feel like cooking.  Service is generally pretty average to below average.", "rating": 3, "date": "2009-10-12"}, {"excerpts": ["I had the crispy tofu and green beans with chilli sauce and my friend had the green curry veggies.  ", "Both were really good.  ", "I would def come back."], "author": "Julia H.", "review": "Just when I think I know all the great Thai restaurants in the City.  I was proved wrong.  The papaya salad is very delish and they made it spicy when I asked for it.    I had the crispy tofu and green beans with chilli sauce and my friend had the green curry veggies.  Both were really good.  I would def come back.", "rating": 4, "date": "2006-09-28"}], "beef jerky": [{"excerpts": ["They make a \"Neur Kem\" (Thai beef jerky) which is really delicious.  ", "they take the beef into little pieces raw, marinate it in this lime pepper sauce, and deep fry it.  "], "author": "E M.", "review": "Better than the other Thai House Express!\n\nThey make a \"Neur Kem\" (Thai beef jerky) which is really delicious.  they take the beef into little pieces raw, marinate it in this lime pepper sauce, and deep fry it.  then served with this spicy light dipping sauce, mmmm so good.\n\nNow, let's talk curry.  Curry should be neither sauce nor soup.  Curry should be fresh and have flavor in every bite, not just at the top or the bottom.  These guys do curry.  Green chicken curry rocks.  Fresh vegetables, served at a good hot temperature, and a nice kick of spice.  \n\nAlso, the service is pretty good.", "rating": 4, "date": "2011-08-29"}, {"excerpts": ["i really like the nuer kem which is their beef jerky for an appetizer. "], "author": "roger b.", "review": "i really like the nuer kem which is their beef jerky for an appetizer. never had or even heard of it before.\n\none of my regular orders is prig king or sometimes spelled prig khing, or pad pric khing and is made with chicken with string beans. that is my go to dish and judge of a thai place. they make it good here however it is spelled. i see here it is also made with pork. i have had other pork dishes and they were good. \n\ni haven't had a bad dish here except they lag on hotness when i ask for it hot and spicy. maybe thai places have trouble with folks who order it hot then want to send it back because it is too hot for them. too bad if you ask me.\n\nit is usually crowed so that tells me they do a good business with good turnover of food. unlike rasha near our place that is sure to close down if they don't get some business.\n\ni wish this place was closer to our home so i could walk there for takeout. we never feel like unparking the car and driving anywhere so when we crave thai we go right near our home. but i like this place so i should drive over every now and then.", "rating": 3, "date": "2007-03-01"}, {"excerpts": ["I get the hugest cravings for the Thai beef jerky.  ", "Great refreshing noodle soups (although sukiyaki was not really my fav, just a preference thing).  ", "Basically I've tried many of the dishes, I'm never disappointed and always leave happy and full.  ", "Fantastic addition to the 'stro."], "author": "Jason M.", "review": "I think this place used to be a dingy Chinese place with shady cabanas?  Redone not too long ago and i LOVE it!  I get the hugest cravings for the Thai beef jerky.  Great refreshing noodle soups (although sukiyaki was not really my fav, just a preference thing).  Basically I've tried many of the dishes, I'm never disappointed and always leave happy and full.  Fantastic addition to the 'stro.", "rating": 4, "date": "2006-08-28"}, {"excerpts": ["Particular favorites include the large Tom Yum soup (with sliced pork, ground pork, pork balls, and pork cracklings on top!), the homemade \"beef jerky,\" the kao soi yellow curry noodles, pork leg stew, ba mee pork noodles, and sukiyaki noodles. ", "Great flavors, generous portions. ", "For what more could you ask of your neighborhood Thai place? ", "How about flamingly homosexual Thai waiters? ", "Check."], "author": "Jon L.", "review": "I'm so pleased to report there is now somewhere worth eating in the Castro. Thai House Express in inexplicably better than its sister property at Market and Sanchez, and it's closer to my house, too. Fierce! Thai House Express is pretty charmless, but the service is generally good and the food better. As a general rule, I try to stray from the standards, and that's been a marvelously successful game plan as I've eaten my way from one end of the menu to the other. Particular favorites include the large Tom Yum soup (with sliced pork, ground pork, pork balls, and pork cracklings on top!), the homemade \"beef jerky,\" the kao soi yellow curry noodles, pork leg stew, ba mee pork noodles, and sukiyaki noodles. Great flavors, generous portions. For what more could you ask of your neighborhood Thai place? How about flamingly homosexual Thai waiters? Check.", "rating": 4, "date": "2006-05-05"}, {"excerpts": ["I enjoyed the beef jerky appetizer (house specialty) and there was a lot of it.  ", "You have to be in the mood for jerky though because it's a frustrating eat otherwise.  ", "The portions are big, and  this is a fact because two big eating guys could not finish two entrees and an appetizer.  ", "No problem though, take the rest home.  ", "I'd definitely come here again."], "author": "Avi H.", "review": "This spot is a block from my new place, so I rolled down the hill and got some dinner w/ a buddy.  They do spicy right.  They do fish right.  They pretty much did everything right. I enjoyed the beef jerky appetizer (house specialty) and there was a lot of it.  You have to be in the mood for jerky though because it's a frustrating eat otherwise.  The portions are big, and  this is a fact because two big eating guys could not finish two entrees and an appetizer.  No problem though, take the rest home.  I'd definitely come here again.", "rating": 4, "date": "2007-08-08"}, {"excerpts": ["The beef jerky sounds weird but is really delicious....and it doesn't hurt that I've been here 3 times and never paid!!  ", "And no, I did not \"dine and dash!", "\""], "author": "Johnnie T.", "review": "Always have good quality food here.  The beef jerky sounds weird but is really delicious....and it doesn't hurt that I've been here 3 times and never paid!!  And no, I did not \"dine and dash!\"", "rating": 4, "date": "2006-01-31"}], "fried calamari": [{"excerpts": ["Fried calamari had no flavor period. ", "Chicken with ginger was\ndecent. ", "My friends noodles he thought we extremely salty. ", "Nothing really bad, just dull, bland\nand lacking any excitement."], "author": "Peter F.", "review": "The coconut soup was top tier. Fried calamari had no flavor period. Chicken with ginger was\ndecent. My friends noodles he thought we extremely salty. Nothing really bad, just dull, bland\nand lacking any excitement.", "rating": 3, "date": "2017-08-13"}, {"excerpts": ["My partner and I ordered a Pad Se Ew and a Thai Fried Rice with Dungeness Crab as well as a Fried Tofu and a Fried Calamari. ", "The Pad Se Ew was pretty good. ", "It wasn't overly sweet. ", "The Fried Rice was also fairly standard. ", "The good part about the Fried Rice came from the generous helping of crab meat that came with it--a pretty good deal given that most Thai restaurants tend to skimp on the crab. ", "The Fried Tofu and Fried Calamari were lightly fried and crispy, not overly greasy. ", "Portion sizes for our entrees and our tofu were generous although the Fried Calamari was on the smaller-side.\n\n"], "author": "Jeffrey P.", "review": "I came here for the first time this passed Friday with my partner and a group of friends. The atmosphere was pretty nice. The restaurant itself is outfitted on the bottom floor of an older San Francisco home in the Castro, thus, it's a bit on the narrower side and the tables are small. Luckily there was a table big enough for our party of 5, but anything more than that would've been an issue. The restaurant itself is modern with beautiful hardwood floors and large windows that let in lots of natural light. Despite being located in the Castro, the ambience was on the quieter-end. Our group was able to hold dinner conversation with no problems with noise or volume.\n\nThe servers were friendly enough, although, they didn't seem particularly attentive. For example, when one of the servers came to refill water, he noticeably missed a few of the glasses despite the fact that they were half-empty. Also, it took several attempts for us to get their attention even though we were seated right in front of the register.\n\nI'm not an expert on the authenticity of Thai cuisine. My partner and I ordered a Pad Se Ew and a Thai Fried Rice with Dungeness Crab as well as a Fried Tofu and a Fried Calamari. The Pad Se Ew was pretty good. It wasn't overly sweet. The Fried Rice was also fairly standard. The good part about the Fried Rice came from the generous helping of crab meat that came with it--a pretty good deal given that most Thai restaurants tend to skimp on the crab. The Fried Tofu and Fried Calamari were lightly fried and crispy, not overly greasy. Portion sizes for our entrees and our tofu were generous although the Fried Calamari was on the smaller-side.\n\nOverall, Thai House Express was good, but it didn't stand out any more than the average Thai restaurant.", "rating": 4, "date": "2013-05-19"}], "corn cake": [{"excerpts": ["Last Saturday two of us shared a sumptuous meal of #10 Corn Cake (appetizers), "], "author": "Ted C.", "review": "The Thai House Express @ the Castro is a block south (19th Street) of the main shopping and club area, but well worth the extra steps. Last Saturday two of us shared a sumptuous meal of #10 Corn Cake (appetizers), #30 Tom Kah (coconut chicken soup), and #87 Panang (red curry beef) for $35 (plus tax and tip). The soup was especially good with a careful balance of hot spice and mild coconut milk. The beef was not as tender as I would have liked. The corn cakes are a delight every time. The waiter asked how spicy we'd like the dishes and the cook did a perfect job of adjusting the heat. I mention this because it shows how much they care about the diverse customer base in the area.", "rating": 4, "date": "2013-10-15"}, {"excerpts": ["The spring rolls were deliciously average, the corn cake was deliciously fried (and a refreshing change of pace!), and the curry held its own quite well.  ", "It was creamy with a little heat as I was anticipating, but I was a little disappointed by the amount of delightful chunky bits in my curry "], "author": "Becca S.", "review": "Having seen a movie at the Castro on a Friday night, I made the decision that I needed some tasty food in my belly to accompany the moving images still churning around in my head.  Someone suggested Thai food as it is both tasty and veggie-friendly, and so we made the minuscule mosey over to Thai House Express.\n\nThai House Express is a trendy looking place.  The decor is rather bare-bones, though the hip-looking people in their skinny-looking jeans and chunky-looking glasses tend to provide most of the visual stimulation.  And we had a lot of time to look around, as the wait for a table was surprisingly long.  We were given menus and were able to order ahead of time, which was nice.  But another group of the same size was seated first, even though they arrived after us, which was a little less nice.\n\nThe menu was extensive, and very vegetarian-friendly.  Pretty much anything can be made with tofu, and my friends ended up with piles of various vegetables on top of brown rice.  They looked (and, I'm told, were) super good.  We also got spring rolls and, perhaps to compensate for being so darn healthy, the corn cakes.  Not being one to pass up curry, I got the gang koor goong: shrimp in red curry, pineapples, tomatoes, and basil.  The spring rolls were deliciously average, the corn cake was deliciously fried (and a refreshing change of pace!), and the curry held its own quite well.  It was creamy with a little heat as I was anticipating, but I was a little disappointed by the amount of delightful chunky bits in my curry - it looked a bit more like soup, though it did taste excellent over the rice.\n\nThe service was really quite alright once we were seated, and I'm mostly content with the prices - Thai House Express could charge for ambiance if it wanted to, but they don't and I appreciate that very much.  If I'm in the Castro, I'll likely show up again and try some of the other dishes.  It's legit and it's tasty, but it's no reason to make a pilgrimage across the city.  Unless, of course, you just like taking pilgrimages.", "rating": 3, "date": "2011-02-13"}, {"excerpts": ["I enjoy the corn cake appetizer, the yellow mustardy chicken curry on egg noodles with red onion and a type of thai pickles...delicious.\n\n"], "author": "Johnny G.", "review": "we get to go food here at least once, sometimes twice per week. They know us by name and what we usually order. It's consistently delicous, fairly priced and the take good care of us.\n\nMy partner loves the green curry chicken (xtra spicy) with steamed brown rice. I enjoy the corn cake appetizer, the yellow mustardy chicken curry on egg noodles with red onion and a type of thai pickles...delicious.\n\nMy favorite dish there is their Pumpkin Chicken Curry. To die for.! Seriously over the top delicious....\n\nThanks for taking such good care of us guys. Steve and Johnny", "rating": 5, "date": "2010-03-08"}], "garden rolls": [{"excerpts": ["We ordered up Garden Rolls, Pad Thai, Basil Chicken and Sticky Rice. ", "When our Garden Rolls came to the table, they were carried by a different server-- this one completely listless. ", "He obviously didn't have the strength, or maybe just didn't have the desire, to place the platter all the way on our table. ", "Now, it's been many years since I've waited a table ", "but I'm pretty sure there's some unwritten rule about putting a platter all the way on the table, instead of letting half of it hang off the edge. ", "Because, wonder of wonders, as soon as he took his hand off the platter, gravity kicked in, and it went crashing down to the floor. ", "Not one of the other waiters came over to help clean it up. ", "I can't be sure if you just reused the same garden rolls that were on the floor ", "but I have a suspicion you did. ", "BTW- ", "the rolls were so dry we choked, and we're gay so choking is something we rarely do. ", "Thai House Express on Castro-- if you're going to pre-make \"fresh\" garden rolls, the least you can do is drape them with damp paper toweling ", "so they don't dry out. ", "That's my Martha Stewart Good Thing(tm) tip to you-- ", "And the Basil Chicken-- EESHK! ", "It was so salty even the other people in the restaurant who didn't eat it will be retaining water for the next month. ", "I will admit that the Sticky Rice came out alright-- which surprised me since you seemed to eff everything else up.\n\n"], "author": "Eric B.", "review": "It's rare I'll write a dissenting review on Yelp but this time I've just gotta.\n\n\nDear Thai House Express on Castro,\n\nOur \"relationship\" is OVER!\n\nAs you already know for the past six months I've wanted things to work out between us. But your food is lackluster and your service is downright dismal. Take for example last night when my friend and I came over to have a three-way with you. The front of the restaurant was already crowded and you refused to open up the back *ahem*. You sat us at a table for two right in front of the counter, in the thick of the dining orgy, than proceeded to treat us as if we were invisible for fifteen minutes. No water, no drink orders, not even a reach around. How rude!\n\nWhen one of your waiters finally came over he was surly-- like he was coming off a bender or had gotten a little too much abuse that evening. We ordered up Garden Rolls, Pad Thai, Basil Chicken and Sticky Rice. It surprised me that he could even take our order considering he barely listened to anything we said. \n\nWhen our Garden Rolls came to the table, they were carried by a different server-- this one completely listless. He obviously didn't have the strength, or maybe just didn't have the desire, to place the platter all the way on our table. Now, it's been many years since I've waited a table but I'm pretty sure there's some unwritten rule about putting a platter all the way on the table, instead of letting half of it hang off the edge. Because, wonder of wonders, as soon as he took his hand off the platter, gravity kicked in, and it went crashing down to the floor. Not one of the other waiters came over to help clean it up. So it took our listless server a good three minutes to get everything up off the floor-- with nary an apology mind you.\n\nImagine our surprise when a new platter came out only thirty-seconds after the broken platter had been taken away. This time it was placed three-quarters of the way on our table. I can't be sure if you just reused the same garden rolls that were on the floor but I have a suspicion you did. BTW- the rolls were so dry we choked, and we're gay so choking is something we rarely do. Thai House Express on Castro-- if you're going to pre-make \"fresh\" garden rolls, the least you can do is drape them with damp paper toweling so they don't dry out. That's my Martha Stewart Good Thing(tm) tip to you-- you're welcome in advance.\n\nCan you answer me a question? When did your Pad Thai become synonymous with fish flavored candy? After our first bite both my friend and I became diabetic. And the Basil Chicken-- EESHK! It was so salty even the other people in the restaurant who didn't eat it will be retaining water for the next month. I will admit that the Sticky Rice came out alright-- which surprised me since you seemed to eff everything else up.\n\nThai House Express on Castro-- we won't see each other any more. I am not going to mall dodge you, instead when I pass by your front or side I'll flip you off because I'm hurt and I don't feel the need to curtail any impulses.", "rating": 1, "date": "2007-08-09"}, {"excerpts": ["i also had spring rolls to start off with, but i think they called them garden rolls. ", "the peanut dipping sauce was nothing special, a little on th sweet side for me, i think it needed a kick, some hot sauce of some sort. ", "other than that, service was good. ", "and i like their cups, with town/city names or thailand in traditional thai design with bright colors. "], "author": "Pamela s.", "review": "3.5 stars.\n\nthe decor in this place is cute and modern. i had the tom yum noodle soup with what i thought i ordered was egg noodles, but the noodles looked different to me. you get a choice between flat rice noodles, egg noodles, and a sticky rice noddle, which i dunno what that is, but the lady said they were thin. nonetheless, still tasted good. i love thai flavors and spice, and this soup hit the spot! i also had spring rolls to start off with, but i think they called them garden rolls. the peanut dipping sauce was nothing special, a little on th sweet side for me, i think it needed a kick, some hot sauce of some sort. other than that, service was good. and i like their cups, with town/city names or thailand in traditional thai design with bright colors. i also tried my friends' pad thai, pineapple fried rice, and panang curry, and gai ga prow, all delish!\n\nafter this, we walked around and tried to digest our lovely meal. i just love strolling around castro area.", "rating": 3, "date": "2009-08-04"}], "sleepy shrimp": [{"excerpts": ["good food ..\n\n\n$25 for a cup of sprite, grilled pork egg noodle soup, & sleepy shrimp."], "author": "Mariana O.", "review": "good food ..\n\n\n$25 for a cup of sprite, grilled pork egg noodle soup, & sleepy shrimp.", "rating": 5, "date": "2018-11-06"}, {"excerpts": ["We had the \"Four-some Combination\" which is Egg rolls, minced chicken pouches, fish cakes, and sleepy shrimp.  ", "For me, I had (2!) "], "author": "Shaun W.", "review": "Popped in with my friend for the first time the other day.  The food was good and the service was ok.\n\nI had to flag down the waitresses for more napkins and they were preoccupied with the empty restaurant and taking their breaks.  It wasn't a big deal, but it was noticeable and enough to not get 5 stars from me.\n\nWe had the \"Four-some Combination\" which is Egg rolls, minced chicken pouches, fish cakes, and sleepy shrimp.  For me, I had (2!) orders of their spicy minced chicken, beef, or pork with chili, basil leaves and bell pepper (ga-prow) and it was a really good time.  I really love spicy food and this dish delivered.  I'll be getting this again for sure.\n\nIt was my first time going there and the interior is not a reflection of the exterior.  It's way nicer on the inside than the outside suggests.\n\nI enjoyed the food and will definitely go back for more or even take-out.", "rating": 4, "date": "2013-09-20"}, {"excerpts": ["Favorites of ours: pork gra pow, pad see-eww, crispy chicken with their spicy sauce, roast duck and sleepy shrimp!"], "author": "Sharon L.", "review": "We've been coming for years and although they have changed to a more limited menu recently, it's still a very great neighborhood place. Favorites of ours: pork gra pow, pad see-eww, crispy chicken with their spicy sauce, roast duck and sleepy shrimp!", "rating": 4, "date": "2015-09-23"}, {"excerpts": ["9.95\nEgg rolls, minced chicken pouches, fish cakes, and sleepy shrimp. ", "A great sampler! "], "author": "Thomas D.", "review": "Loved it!\nThe service couldn't have been any better.  They also gave me a Thai Iced Tea on the house after realizing that my mouth was on fire from the spicy dish that I ordered.\n(I went through 4 napkins blowing my nose and loved every bite of my dinner.)\n\nPAD KEE-MAO (DRUNKEN NOODLES)  $ 7.95\nPan-fried rice noodles with your choice of beef, pork or chicken, onions, chili, Chinese broccoli and basil leaves.\n\nI asked for this dish to be cooked medium spicy--next time I'll ask for it to be cooked mildly spicy.\n\nWe also tried the:\n PAD SEE-EW  $ 7.95\nPan-fried rice noodles with your choice of beef, pork or chicken, egg and Chinese broccoli.\n\nThis too was very flavorful and quite mild.  We really enjoyed the flat rice noodles in this dish.\n\nThe serving sizes were generous.\n We started off with the sampler platter:\nFOUR-SOME COMBINATION .$ 9.95\nEgg rolls, minced chicken pouches, fish cakes, and sleepy shrimp. A great sampler! (2 pieces each)\n\nWe'll skip this platter the next time --everything was fried and it was too much food when combined with our other dishes.\n\nThe SINGHA BEER -$ 4.50 was a nice beverage to wash everything down with.  It is a very mild and light, tasty beer,", "rating": 4, "date": "2012-03-30"}, {"excerpts": ["I'm specifically a fan of the silver noodle soup and the sleepy shrimp. ", "This place doesn't serve \"American\" size portions and can get a little pricey, but most of the food we've had is pretty dang good."], "author": "A.D. R.", "review": "I'm specifically a fan of the silver noodle soup and the sleepy shrimp. This place doesn't serve \"American\" size portions and can get a little pricey, but most of the food we've had is pretty dang good.", "rating": 4, "date": "2013-01-22"}], "some combination": [{"excerpts": ["We had the \"Four-some Combination\" which is Egg rolls, minced chicken pouches, fish cakes, and sleepy shrimp.  ", "For me, I had (2!) "], "author": "Shaun W.", "review": "Popped in with my friend for the first time the other day.  The food was good and the service was ok.\n\nI had to flag down the waitresses for more napkins and they were preoccupied with the empty restaurant and taking their breaks.  It wasn't a big deal, but it was noticeable and enough to not get 5 stars from me.\n\nWe had the \"Four-some Combination\" which is Egg rolls, minced chicken pouches, fish cakes, and sleepy shrimp.  For me, I had (2!) orders of their spicy minced chicken, beef, or pork with chili, basil leaves and bell pepper (ga-prow) and it was a really good time.  I really love spicy food and this dish delivered.  I'll be getting this again for sure.\n\nIt was my first time going there and the interior is not a reflection of the exterior.  It's way nicer on the inside than the outside suggests.\n\nI enjoyed the food and will definitely go back for more or even take-out.", "rating": 4, "date": "2013-09-20"}, {"excerpts": ["Everything on the Four-some Combination sampler appetizer plate tasted the same (tasteless). ", "In addition, you would expect the same sauce and condiments that are included when each item is ordered separately to be included. ", "Nope. ", "The only sauces/condiments included was a skimpy dollop of sweet and sour sauce slopped down in the middle of the plate.  ", "When I ordered the Tom Yum Goong Soup the server assured me I could get it mild to medium. ", "The soup I was served was so spicy that I literally gagged. ", "(I've been to Thailand and know spicy).  ", "I literally could not eat it and flagged down another server and asked for a replacement. ", "Oops. ", "I should have known better as this time I got a bowl of what tasted like dishwater with soggy shrimp and absolutely no flavor. ", "C'mon kitchen. ", "No one ever came back to the table to see if I was happy. ", "When the check was presented they cleared away my soup which was barely touched and acted as if that was normal. ", "The place was nearly empty so I guess the word is spreading. ", "Bye-bye THAI HOUSE EXPRESS."], "author": "Ron G.", "review": "The food and service at THAI HOUSE EXPRESS has been going downhill lately and last night was the worst and final experience. Service has become totally impersonal and cold and the food was close to inedible. Everything on the Four-some Combination sampler appetizer plate tasted the same (tasteless). In addition, you would expect the same sauce and condiments that are included when each item is ordered separately to be included. Nope. The only sauces/condiments included was a skimpy dollop of sweet and sour sauce slopped down in the middle of the plate.  When I ordered the Tom Yum Goong Soup the server assured me I could get it mild to medium. The soup I was served was so spicy that I literally gagged. (I've been to Thailand and know spicy).  I literally could not eat it and flagged down another server and asked for a replacement. Oops. I should have known better as this time I got a bowl of what tasted like dishwater with soggy shrimp and absolutely no flavor. C'mon kitchen. No one ever came back to the table to see if I was happy. When the check was presented they cleared away my soup which was barely touched and acted as if that was normal. The place was nearly empty so I guess the word is spreading. Bye-bye THAI HOUSE EXPRESS.", "rating": 1, "date": "2016-07-15"}, {"excerpts": ["We started off with the sampler platter:\nFOUR-SOME COMBINATION .$ "], "author": "Thomas D.", "review": "Loved it!\nThe service couldn't have been any better.  They also gave me a Thai Iced Tea on the house after realizing that my mouth was on fire from the spicy dish that I ordered.\n(I went through 4 napkins blowing my nose and loved every bite of my dinner.)\n\nPAD KEE-MAO (DRUNKEN NOODLES)  $ 7.95\nPan-fried rice noodles with your choice of beef, pork or chicken, onions, chili, Chinese broccoli and basil leaves.\n\nI asked for this dish to be cooked medium spicy--next time I'll ask for it to be cooked mildly spicy.\n\nWe also tried the:\n PAD SEE-EW  $ 7.95\nPan-fried rice noodles with your choice of beef, pork or chicken, egg and Chinese broccoli.\n\nThis too was very flavorful and quite mild.  We really enjoyed the flat rice noodles in this dish.\n\nThe serving sizes were generous.\n We started off with the sampler platter:\nFOUR-SOME COMBINATION .$ 9.95\nEgg rolls, minced chicken pouches, fish cakes, and sleepy shrimp. A great sampler! (2 pieces each)\n\nWe'll skip this platter the next time --everything was fried and it was too much food when combined with our other dishes.\n\nThe SINGHA BEER -$ 4.50 was a nice beverage to wash everything down with.  It is a very mild and light, tasty beer,", "rating": 4, "date": "2012-03-30"}], "chicken sate": [], "green papaya salad": [{"excerpts": ["My friends and I really love the Crispy Chicken, Corn Cakes, Sauteed String Beans, Pineapple Fried Rice, and Green Papaya Salad.\n\n"], "author": "Mike B.", "review": "Thai House Express is my favorite Thai in the city.  It's a regular go-to for take out.  My friends and I really love the Crispy Chicken, Corn Cakes, Sauteed String Beans, Pineapple Fried Rice, and Green Papaya Salad.\n\nThe service is quick and friendly.   Conveniently located at 19th and Castro, there's always something pleasing to eyes as well as the palate.", "rating": 5, "date": "2014-03-31"}, {"excerpts": ["The green papaya salad, we ordered spicy, was fresh and crisp.  "], "author": "Rox P.", "review": "Authentic and delicious Thai food.  I've not been able to find a good Thai restaurant where we live.  When I'm in San Francisco I always make sure I go to this Thai restaurant.  \n\nWe ordered the pumpkin curry with beef.  The curry was flavorful and had just enough sweetness and savory note that blended really well.  The Crab pad thai was cook just right.  The noodles were cooked perfectly, the meat was abundant and the sweetness and spice were just the right amount.  The green papaya salad, we ordered spicy, was fresh and crisp.  My favorite the basil chicken - it was cooked with just enough basil to taste and the spice level was just enough to taste but not to burn the tongue.", "rating": 4, "date": "2011-06-11"}, {"excerpts": ["- pad thai\n- som tum thai (green papaya salad)\n- pumpkin curry\n- ga prow (minced chicken w/ basil, chili, and bell peppers)\n\n"], "author": "Kristen C.", "review": "If you're in Castro and want Thai...this is the spot :) \n\nWhen i came in, the first thing i noticed was that I loved the decor. Especially the flower prints on the wall. Service was great and everyone was super friendly and helpful. We went around 7:30 on a Monday night, and it was surprisingly packed which is always a good sign. Their menu was extensive but definitely not overwhelming, and they have all the basics you want when you crave Thai food. Even better, they have a decent wine menu! \n\nfav dishes of the night:\n- tom yum goong soup\n- pad thai\n- som tum thai (green papaya salad)\n- pumpkin curry\n- ga prow (minced chicken w/ basil, chili, and bell peppers)\n\nThey get their 5th star because of their mango sticky rice dessert. I got some serious mango knowledge that night! Unlike other places who use semi-ripe or stringy fibrous mangoes during the winter season, these were SWEET and left no grossness in your mouth after biting into it. AMAZING FOR THE FREAKING MIDDLE OF WINTER! \n\nI was told that mangoes that taste stringy are mostly from Mexico, but the sweeter ones come from Guatemala or the Philippines. It obviously shows they know their stuff even down to the last details ...like where to purchase good mangoes :)", "rating": 5, "date": "2011-01-08"}, {"excerpts": ["\"  \n\nSom Tam - Green Papaya Salad (Limp, vaguely lime-flavored, no chilies at all, no dried shrimps, and generally lackluster)\n\nGarlic Eggplant with Beef (heavy dark plum sauce gravy and very salty)\n\nGreen Chicken Curry (too much coconut milk and not curry flavor to make it hot and memorable)\n\n"], "author": "tout le monde a.", "review": "I haven't been here in a few years.  I've been hearing how they've gone downhill, but I had to find out for myself.  \n\nMy four test dishes are things every Thai restaurant should do well.  It's not fair to rate a place on one dish, or on the mood of the server.\n\nUnfortunately, The Thai House Express on Castro managed to prepare all four dishes poorly, and nobody came back to say \"how's everything?\"  \n\nSom Tam - Green Papaya Salad (Limp, vaguely lime-flavored, no chilies at all, no dried shrimps, and generally lackluster)\n\nGarlic Eggplant with Beef (heavy dark plum sauce gravy and very salty)\n\nGreen Chicken Curry (too much coconut milk and not curry flavor to make it hot and memorable)\n\nPad Thai (unremarkable, soggy, bland flavor)\n\nOuch!  It really was painful to pay for an expensive meal that tasted so bad.  Thai food should always be interesting, and never bland!\n\nMaybe I should have asked for the dishes prepared Thai style?  But I thought that would go without saying in a Thai place.", "rating": 1, "date": "2011-01-12"}, {"excerpts": ["The green papaya salad was not overly fish saucy which is good. "], "author": "Rex D.", "review": "So far, this is my favorite Thai restaurant in SF! The food was just about as flavorful as I have been looking for in the city. The Pumpkin Curry was delicious and since this was my first time to ever have pumpkin curry, I'm excited to try it at some other Thai restaurants. My friend likes fried food, so we ordered crispy fried pork and it came out with a super thin and flakey crust and was just delish! The green papaya salad was not overly fish saucy which is good. And they serve STICKY RICE! I was so bummed that Marnee Thai doesn't serve it and sticky rice is usually my favorite part of eating thai food! For desert, we had taro balls in coconut milk. The balls were a lot like tiny mochi balls  and didn't have much flavor without the coconut milk. I did like it, but I doubt I will order it again. Besides, Hot Cookie is just down the street if you need something sweet after dinner. \n\nTry this place, it's really good!", "rating": 4, "date": "2010-03-06"}, {"excerpts": ["So my profile says for my last meal I want Green Papaya Salad. ", "I discovered this tastiest of tasty salads in Thailand years ago and I've never forgotten that first plate. ", "I have many a good papaya salad since, but Thai House Express has it nailed. "], "author": "Ennis O.", "review": "So my profile says for my last meal I want Green Papaya Salad. I discovered this tastiest of tasty salads in Thailand years ago and I've never forgotten that first plate. I have many a good papaya salad since, but Thai House Express has it nailed. They even have the extra spicy, \"I won't survive this meal\" version which I usually need to have them tone down a bit.\n\nPad Thai is the other perennial favorite of Thai lovers that must be done right or all the curry goodness in the world can't make up for it. This place has it! While I have enjoyed Osha Thai for years (long before their chain-like explosion) and our endless supply of others, Thai House Express still takes the bean cake for me. Properly sized noodles - not thin, round, or too flat and wide. Great sauce that doesn't have too much fish sauce or too little either. No piles of cauliflower for us vegetarians - just the same shrimp version without the shrimp.\n\nAnother favortie is the Tofu pad ga prow - onions, peppers, fried tofu, stir-fried with basil and a sweetly spiced garlic sauce over rice. This is one of my favorite meals. Get this and a glass of water and you're out the door for $9 after tip. Not a bad at all.\n\nAlso, try out the corn cakes to start - really more like a corn fritter - with a little  cucumber/onion/peanut in simply syrup for a topping. My favorite way to start a meal.\n\nThe fifth star is reserved for the day time staff. Come in after 6pm on a weekday or late evening on the weekends and you'll have a great time. Before that and the service seems a bit annoyed to be working. Considering how well they do everything, and one or two not-so-enthusiastic wait staff aside - this is one of my favorite Thai hang outs!", "rating": 4, "date": "2009-02-11"}, {"excerpts": ["I ordered a Green Papaya Salad ", "bc ", "I have to. ", "It is the way I know, is it Thai? "], "author": "Miel H.", "review": "I found the indifference of the wait staff amusing, it was in a way, very like Kao San Road, Bangkok. Believe you me, certainly not a standard for Thai food by any measure, but for service? Bemused ignoring peppered with a 'busy' after taste.\n\nThe food however stands up. I ordered a Green Papaya Salad bc I have to. It is the way I know, is it Thai? Happily, although the papaya was not macerated with the lime marinade, but rather bathed in it, it had a good range of spice and fish. \n\nMy tofu green curry at ~$8.50'ish was average, but they did have the wide rice noodles which are a personal favorite. Hey, Thai House, if you dip noodles into boiling water for just a sec or two, they will separate AND heat up. Just you know, a hint I saw on the streets of Thailand. \n\nMy dining companion ordered rice and veggies and it was a nice assortment of veggies although the brown 'sauce' was dangerously close to the ubiquitous 'brown sauce de Chinese'. So, I can't rave.\n\nThe Thai Iced Teas were creamy but not tangy, sort of weak tea, but I enjoyed it all the same. \n\nI would go back, it was reasonably priced and tasty enough. I can see if I lived nearby how it might become a standard, but that would be bc of proximity and not for outrageous, authentic flavor.", "rating": 4, "date": "2009-01-28"}, {"excerpts": ["One example: The Som Tam (green papaya salad) did not have any chilis, dried shrimp or garlic in it, and if it had lime, I certainly couldn't taste it - these are all essential, and approximately half of the, ingredients to som tam. ", "What it did have, and in large quantities, was undisolved sugar and fish sauce - without those ingredients and with the overabundance of sugar, it all just tasted like a sickeningly-sweet, syrupy, slightly rancid (from the fish sauce) ", "apple salad with fine sand in it."], "author": "Peter S.", "review": "I used to order from here fairly often. I like authentic Thai food a lot, and, occasionally, you'd get a good cook (or the cook was having a good day) and the food would be fantastic. Most of the time, it was okay. Unfortunately, the quality of the food has declined significantly. I've been eating there less and less frequently. However, last night was the first time I have ever actually returned take out food. Each of the five dishes we ordered was way below acceptable and two of the dishes were just flat-out disgusting; they had even forgotten several of the ingredients in some of the dishes. After a couple of bites, I was scared to eat any of it other than the sticky rice. \n\nWhen I called to complain, they explained that they were very busy that evening (I suppose the five Tuesday night diners must have all ordered at once), and that that could explain why the food was so poor. I guess that means that if they are busy, you take your chances... \n\nI, however, will not be taking any chances here again.\n\nFollow up - I've been asked for examples. One example: The Som Tam (green papaya salad) did not have any chilis, dried shrimp or garlic in it, and if it had lime, I certainly couldn't taste it - these are all essential, and approximately half of the, ingredients to som tam. What it did have, and in large quantities, was undisolved sugar and fish sauce - without those ingredients and with the overabundance of sugar, it all just tasted like a sickeningly-sweet, syrupy, slightly rancid (from the fish sauce) apple salad with fine sand in it.", "rating": 1, "date": "2009-12-03"}, {"excerpts": ["My friend and I shared three dishes: Tom Kah with tofu, Pad Thai and green papaya salad. ", "This was more than enough food for both us and came out to a little over twenty dollars- what a deal!! ", "The soup was amazing, the Pad Thai was good and the papaya salad was pretty good, as well, even though the portion was really small. ", "I will definitely eat here again!"], "author": "Daniela A.", "review": "From the outside Thai House Express does not look like much. It's interiors are pretty plain as well, with white walls and not much decoration. This retaurant is pretty nice though- spacious and very clean. Their menu is basic, the service is good... and as for the food? The food is awesome! Thai House Express is definitely one of the better Thai places I have been to in the city. My friend and I shared three dishes: Tom Kah with tofu, Pad Thai and green papaya salad. This was more than enough food for both us and came out to a little over twenty dollars- what a deal!! The soup was amazing, the Pad Thai was good and the papaya salad was pretty good, as well, even though the portion was really small. I will definitely eat here again!", "rating": 4, "date": "2009-01-28"}], "larb salad": [{"excerpts": ["We went into the Thai House Express because they had exactly what I wanted:\nLarb salad (marinated tofu with chili, served with onions, basil, and half a slab of cabbage) in their \"special lemon dressing.", "\" "], "author": "Adena B.", "review": "It was late, but I was hungry. I just wanted a big, fat dinner salad. That's all, something light, something tasty.\n\nWe went into the Thai House Express because they had exactly what I wanted:\nLarb salad (marinated tofu with chili, served with onions, basil, and half a slab of cabbage) in their \"special lemon dressing.\" Sounds pretty good, right?\n\nWrong.\n\nIt was served right after I had a bite of the shrimp garden roll (http://www.yelp.com/biz_photos/thai-house-express-san-francisco-2?userid=cqf8dqO5_QUxjfo6WiM7yg#qKwgeiY0SrgtF65m0ixYXg, which was good; tasty). The server placed the salad plate on our table, and immediately, my date and I looked at each other, like, \"what's that smell?\" The table next to us even gave us a sidelong glance.\n\nIt's not me, guys, I JUST showered!\n\nThe salad reeked of a combination of dehydrated-homeless-man-pee and vomit. I'm not kidding: go ahead and order that salad with tofu and smell it for yourself.\n\nI didn't make a fuss about it, but the server did notice that I'd barely touched the salad and didn't ask why. Speaking of servers, they were great; always kept the water glasses full and were prompt with the service. \n\nAt least they've got that going for them.", "rating": 2, "date": "2012-09-05"}, {"excerpts": ["also the wonderful larb salad hehehe yummy definitely ", "but yeah imust say good service and yummy food... and there has been an occasion when they ran out of a dish and luckily they've apologized for it... either way.. still yummy =-)"], "author": "Ryan M.", "review": "By far one of my favorite thai restaurant in SF... i think it's the ambiance that gets me goin' back to this place and also the wonderful larb salad hehehe yummy definitely but yeah imust say good service and yummy food... and there has been an occasion when they ran out of a dish and luckily they've apologized for it... either way.. still yummy =-)", "rating": 4, "date": "2006-11-24"}], "yum woonsen salad": [], "yum nuer beef salad": [], "calamari salad": [], "squid salad": [], "tom kha soup": [{"excerpts": ["My go to is always the tom kha soup with chicken. ", "Delicious coconut based soup, and ", "I always get to eat all the mushrooms because my bff hates mushrooms. ", "Perfectly lemony ", "and there's hardly ever any of that sediment debris at the bottom ruining the last sips of broth. ", "The som tom salad is also delightful. ", "They even add little shrimps to the top of the papaya slivers. ", "We asked for spicy, but I think they think we can't handle it ", "so it was more like medium. ", "The service was great and they were super attentive and the place is sparkling clean and everything is white. ", "The Pad Sew yew noodles were FUCKING COOKED PERFECT, but the sauce needed a little something extra. "], "author": "Vanessa B.", "review": "We get take out all the time from here, because we live just around the corner. It's always great. My go to is always the tom kha soup with chicken. Delicious coconut based soup, and I always get to eat all the mushrooms because my bff hates mushrooms. Perfectly lemony and there's hardly ever any of that sediment debris at the bottom ruining the last sips of broth. The som tom salad is also delightful. They even add little shrimps to the top of the papaya slivers. We asked for spicy, but I think they think we can't handle it so it was more like medium. The service was great and they were super attentive and the place is sparkling clean and everything is white. The Pad Sew yew noodles were FUCKING COOKED PERFECT, but the sauce needed a little something extra. Now for the fun part.\n\nI highly recommend this place to anyone who wants to break up with someone in a public place. For one, you'll enjoy your meal, and for two the soundtrack will be epic. They play the most horrendous music by female artists of the late 90's. And not the good kind, or even the popular run of the mill Shawn Colvin or Meredith Brooks variety either. It's just depressing as fuck one hit wonders that you forgot all about. Please take your partners here and break up with them and they'll never forget that one song they heard that one time when they were watching Vh-1's Pop Up video back in '99.  And they'll always think of you when they hear Kelly Clarkson's \"A moment Like This.\"", "rating": 5, "date": "2014-10-01"}, {"excerpts": ["Tom Kha soup, and a selection of entrees (shrimp, chicken, beef, vegetarian), along with salad, rice, and egg rolls. ", "You will definitely find yourself struggling to finish all that food because there is so much. "], "author": "Shreya G.", "review": "Not a bad place to stop by for lunch. \n\nWe were actually looking for a different restaurant to eat at for lunch, only to find they were closed and doing construction. Well, hungry as heck, we found this Thai place a few doors down. Glad that we stopped and ate here.\n\nThey have lunch specials for $10.95, which is a pretty good deal for the amount of food you get! You get Tom Kha soup, and a selection of entrees (shrimp, chicken, beef, vegetarian), along with salad, rice, and egg rolls. You will definitely find yourself struggling to finish all that food because there is so much. They give it to you on a skinny dish that makes it look much smaller than it really is, so don't let it fool you!\n\nI actually don't like coconut, but that soup was amazing. \n\nThe service was also good! Everyone was friendly and they didn't nag us. They also didn't take our food away before we finished eating (which has happened to us before). \n\nThey also have REALLY clean bathrooms for a public place/restaurant. \n\nDefinitely would come back here again.", "rating": 4, "date": "2011-08-04"}], "tom kha pak": [{"excerpts": ["I then had a bowl of the tom kha pak soup, which is basically a vegetarian verion of tom kha gai.  "], "author": "Laura R.", "review": "Walked in at 8:30 on a Friday night and was seated rather quickly (under 10 minutes).  Service was quick and pleasant, and the server was more than happy to take a minute to answer our many questions about the food (for the record, \"a la carte\" just means a bigger portion).  I got a glass of wine and was impressed by how healthy a pour they offered.  My friend and I started off with the som tum papaya salad, which was delicious -- the spiciness was tailored just to my specifications, which I really appreciated.  I then had a bowl of the tom kha pak soup, which is basically a vegetarian verion of tom kha gai.  The balance of flavors was perfect, and the size of the portion was ideal for a light dinner (or a rather large appetizer, depending on your appetite).\n\nWe will definitely go back soon!", "rating": 4, "date": "2010-06-14"}], "silver noodle soup": [{"excerpts": ["I'm specifically a fan of the silver noodle soup and the sleepy shrimp. ", "This place doesn't serve \"American\" size portions and can get a little pricey, but most of the food we've had is pretty dang good."], "author": "A.D. R.", "review": "I'm specifically a fan of the silver noodle soup and the sleepy shrimp. This place doesn't serve \"American\" size portions and can get a little pricey, but most of the food we've had is pretty dang good.", "rating": 4, "date": "2013-01-22"}, {"excerpts": ["I guess I could simply walk another half a block to widen my choices, but meeeh, I've found the silver noodle soup to my liking. \n\n", "Yes, about the soul-soothing silver noodle soup:  If you happen to be dealing with any sort of digestive issues, come to Thaihouse Express and try this soup. ", "For the love of everything holy, this soup does a better job a clearing up digestive problems than a room-ful of Kaiser physicians.  "], "author": "Daniel C.", "review": "This Thai place is so damn popular, most likely due to its location. Mediocre service and average Thai food wouldn't normally attract a big dinner crowd, but whatever, this is San Francisco! \n\nI hit this place at least twice per week, because it is the closest restaurant to my house. I guess I could simply walk another half a block to widen my choices, but meeeh, I've found the silver noodle soup to my liking. \n\nYes, about the soul-soothing silver noodle soup:  If you happen to be dealing with any sort of digestive issues, come to Thaihouse Express and try this soup. For the love of everything holy, this soup does a better job a clearing up digestive problems than a room-ful of Kaiser physicians.  Yeah I'm exaggerating a little, but therein lies the tonic to cure diarrhea and dysentery.\n\nFun activity: If you're ever walking past this restaurant, peer into the window at the 2-person table.  95% of the time, you'll see an Asian guy and an older white guy.  19 out of 20 times!  ;)", "rating": 3, "date": "2008-10-09"}], "special beef soup": [], "choochee salmon": [], "salmon wrapped in banana leaves": [{"excerpts": ["I especially enjoyed the Salmon wrapped in banana leaves served with a cilantro dipping sauce.\n\n"], "author": "Alysha K.", "review": "Delicious, affordable, authentic Thai cuisine. Great customer service. I especially enjoyed the Salmon wrapped in banana leaves served with a cilantro dipping sauce.\n\nGood to come with a larger party so you can try a lot of different dishes!", "rating": 5, "date": "2011-05-23"}, {"excerpts": ["Recently, I had the salmon wrapped in banana leaves, chicken green curry, pad thai, and pork with cabbage.  "], "author": "Carol L.", "review": "A solid, neighborhood Thai place! \n\nRecently, I had the salmon wrapped in banana leaves, chicken green curry, pad thai, and pork with cabbage.  All of it was very good, except for the pork dish.  \n\nDishes are served as either individual \"rice plates\" or \"a la carte\" to share.\n\nEnjoy :)", "rating": 3, "date": "2008-12-25"}], "flavored catfish": [], "pork leg stew": [{"excerpts": ["They also have traditional dishes like pork leg stew and \"Ko Soi\"---noodle in curry soup. ", "Worth a try if you're interested in real Thai fare."], "author": "Matt Y.", "review": "4/27/13 \n\nMost recent visit was last Saturday. This is where I go if I want Thai food in my neighborhood. They have more \"authentic\" flavor than Thai Chef on 18th Street, which has a overwhelming inclination on putting lots of sugar in their food.\n\n*Tom kha gai:  Coconut milk and lime juice seasoned with ginger root and cayenne pepper create a spicy broth for this Thai-inspired soup with strips of white chicken, cilantro and mushroom. Overall it's good but could be a bit less watery.\n\n*Yellow curry:  usually good, flavorful and spicy. My friend complained that his edition in that evening was bland and tasteless.\n\n*Thai beef: tender and barbequed to medium, beef was marinated well. Be aware of that green chili sauce, it's hotter than wasabi.\n\n*Gai ka prow:  Stir-fry chicken with basil. Along with Pad Thai, this is a staple of the Thai meal. Order it mild if your stomach doesn't agree with spicy food. I go for medium. Basil flavor is very opulent. Perfect to eat with jasmine rice. \n\nThe hot tea is the same herbal tea used in Thai iced tea minus the carnation milk and sugar. It's good for mitigating the flamey tongue!\n\nService is alright but could be more attentive. My gai ka prow didn't come with everyone else's food so I was poking at my friends' dishes. I heard Thai House in the Castro had recently divorced from Thai House on Geary in the Tenderloin. Food has got better here and regrettably, crazy spicy there. They also have traditional dishes like pork leg stew and \"Ko Soi\"---noodle in curry soup. Worth a try if you're interested in real Thai fare.", "rating": 4, "date": "2013-05-02"}, {"excerpts": ["This place does a couple of things exceptionally well: 1) Pork leg stew (kao kaa moo) 2)Basil chicken (pad ga prow)"], "author": "Thomas N.", "review": "This place does a couple of things exceptionally well: 1) Pork leg stew (kao kaa moo) 2)Basil chicken (pad ga prow)", "rating": 4, "date": "2016-03-14"}, {"excerpts": ["If you haven't already, try the:\n- Coconut Chicken Soup (Tom Kha Gai)\n- Pumpkin Curry\nand\n- Pork Leg Stew (Ka Moo)\n\n"], "author": "Trevor H.", "review": "Wonderful service. \n\nMy favorite server, Golf, is awesome. Always accommodating, always friendly, and always helpful in finding something new on the menu for me to try.\n\nGreat Food.\n\nIf you haven't already, try the:\n- Coconut Chicken Soup (Tom Kha Gai)\n- Pumpkin Curry\nand\n- Pork Leg Stew (Ka Moo)\n\nThey do these dishes up right. Especially the stewed pork leg. Melts in your mouth.\n\nNothing but good experiences here.", "rating": 5, "date": "2013-08-17"}, {"excerpts": ["They also make a great pork dish, Pork Leg Stew (ka Moo), this is really, really tasty. ", "When you are in the mood for thai and need a reliable place, Thai House Express is the way to go."], "author": "Natasha F.", "review": "This is the best Thai place in the Castro.  I love their Pumpkin curry and Catfish dish.  They also make a great pork dish, Pork Leg Stew (ka Moo), this is really, really tasty. When you are in the mood for thai and need a reliable place, Thai House Express is the way to go.", "rating": 4, "date": "2014-01-26"}, {"excerpts": ["Be sure to order the Kao Ka Moo (the inadequately described \"special pork leg stew\") over rice, which I never would have ordered if the guy next to me hadn't been eating it. ", "It's incredibly tender and flavorful pork that must be cooked with star anise, with tasty pickled greens on the side. "], "author": "Sharman G.", "review": "I love this place, and am a regular here after yoga class. Be sure to order the Kao Ka Moo (the inadequately described \"special pork leg stew\") over rice, which I never would have ordered if the guy next to me hadn't been eating it. It's incredibly tender and flavorful pork that must be cooked with star anise, with tasty pickled greens on the side. I don't recommend the sauce that comes with it, because it overpowers the pork's subtle flavor. \n\nOther solid choices are the Tom Yum Goong, Crispy Catfish, Pad Thai, Pad Se-Ew, and Kao Soy (I like it best with the wide rice noodles), but I've never had a dish here I didn't like. Arrive hungry!", "rating": 4, "date": "2008-08-04"}, {"excerpts": ["I tend to avoid meals in the Castro with a  few exceptions, but I was compelled to try Thai House Express for the rumored greatness of the kao ka moo, special pork leg stew. ", "As a girl that grew up enjoying Peking Duck, suckling pigs, things wrapped in bacon, and well marbled steaks, I knew I would love this dish the moment I laid eyes on the rich fatty bits, pork skin, and soft braised meat of the kao ka moo! ", "I wouldn't recommend powering through this on your own though, definitely a dish to share. ", "Loved the spicy tangy sauce that came on the side and the crisp emerald green gai lain (Chinese Broccoli) hiding underneath the tender pork soaking up the yumminess.\r\n", "Pad kee mao was also very good. "], "author": "Candice L.", "review": "I tend to avoid meals in the Castro with a  few exceptions, but I was compelled to try Thai House Express for the rumored greatness of the kao ka moo, special pork leg stew. As a girl that grew up enjoying Peking Duck, suckling pigs, things wrapped in bacon, and well marbled steaks, I knew I would love this dish the moment I laid eyes on the rich fatty bits, pork skin, and soft braised meat of the kao ka moo! I wouldn't recommend powering through this on your own though, definitely a dish to share. Loved the spicy tangy sauce that came on the side and the crisp emerald green gai lain (Chinese Broccoli) hiding underneath the tender pork soaking up the yumminess.\r\nPad kee mao was also very good. Crisp veggies, fresh basil, pan fried rice noodles, and a spice level (we requested it spicy, even though it already had the chili notation on the menu) that was kickin'! Yeah, this was right at the threshold of excellent spicy flavor and an intense, fiery burning. I think it may be more pleasant to stick to the regular spicy level at T.H.E. b/c they are not messing around with the heat. If you like it spicy, get over there soon.\r\nNice modern space, friendly servers, water refilled regularly, and, even if the food wasn't as savory as it was, I would still love them b/c they're open late, til midnight or 1am on the weekend and 10 or 1030 during the week. About $18 for 2 dishes before tip.\r\n\r\n*****************************************************************\r\nUpdate 2/28/06-Went back and ordered the same 2 dishes again. Found the pork to be less succulent and fatty. Still good though, just not ambrosial. I was there at the busier dinner hour, so maybe sneaking in earlier or later is the key to allowing the kitchen to take their time?", "rating": 5, "date": "2006-02-03"}, {"excerpts": ["Particular favorites include the large Tom Yum soup (with sliced pork, ground pork, pork balls, and pork cracklings on top!), the homemade \"beef jerky,\" the kao soi yellow curry noodles, pork leg stew, ba mee pork noodles, and sukiyaki noodles. ", "Great flavors, generous portions. ", "For what more could you ask of your neighborhood Thai place? ", "How about flamingly homosexual Thai waiters? ", "Check."], "author": "Jon L.", "review": "I'm so pleased to report there is now somewhere worth eating in the Castro. Thai House Express in inexplicably better than its sister property at Market and Sanchez, and it's closer to my house, too. Fierce! Thai House Express is pretty charmless, but the service is generally good and the food better. As a general rule, I try to stray from the standards, and that's been a marvelously successful game plan as I've eaten my way from one end of the menu to the other. Particular favorites include the large Tom Yum soup (with sliced pork, ground pork, pork balls, and pork cracklings on top!), the homemade \"beef jerky,\" the kao soi yellow curry noodles, pork leg stew, ba mee pork noodles, and sukiyaki noodles. Great flavors, generous portions. For what more could you ask of your neighborhood Thai place? How about flamingly homosexual Thai waiters? Check.", "rating": 4, "date": "2006-05-05"}, {"excerpts": ["I especially like Pork Leg Stew over rice.  ", "(It tastes better than it sounds).  "], "author": "Dan B.", "review": "This is my favorite Thai place in Castro.  We call it \"Thai on the Corner\" because we can't remember the name.  Prices are reasonable and some of the dishes delicious.  I especially like Pork Leg Stew over rice.  (It tastes better than it sounds).  I keep returning for the Panang Curry as well.  Some of the waiters are cute and sweet.  It doesn't have the cozy ambiance of some places but it is fast and reasonably efficient with fair prices. It is definitely on my list of regular places to eat.", "rating": 5, "date": "2009-04-24"}], "dungeness crab pad thai": [{"excerpts": ["I ordered the dungeness crab pad thai,  Minced chicken basil and fried chicken wings.  ", "Everything was good.  ", "The Pad Thai was okay", ", I've had better.  ", "Over all the food was good but not great.  ", "I don't know if I'd order from here again."], "author": "Lennie G.", "review": "Ordered delivery through Yelp and the food came hot and on time.  I ordered the dungeness crab pad thai,  Minced chicken basil and fried chicken wings.  Everything was good.  The Pad Thai was okay, I've had better.  Over all the food was good but not great.  I don't know if I'd order from here again.", "rating": 3, "date": "2018-05-09"}, {"excerpts": ["The gra-tiem was delicious, and paired nicely with the dungeness crab pad Thai. ", "Service was friendly and responsive."], "author": "Aaron M.", "review": "This is my favorite that place in the Castro. The gra-tiem was delicious, and paired nicely with the dungeness crab pad Thai. Service was friendly and responsive.", "rating": 5, "date": "2017-07-15"}, {"excerpts": ["Liked dungeness crab Pad Thai."], "author": "Edgar M.", "review": "Understand to the Thais....medium spice is actually SUPER spicy. Next time say \" mild\". Otherwise dinner was enjoyable... Liked dungeness crab Pad Thai.", "rating": 3, "date": "2015-03-20"}], "kao soy": [{"excerpts": ["Whenever I go to my BFF's place in the Castro, I insist on getting takeout kao soy from Thai House Express. ", "He swoons over the pad thai and swears it's the best he's ever had, but I love my curry noodles so much that I can't imagine ordering anything else.  ", "My finicky preschooler makes quick work of the vegetarian egg rolls. ", "I just wish they offered delivery. ", "I mean, come on...", "they even have the word \"express\" in their name; express that food to my doorstep, please!"], "author": "Valeria R.", "review": "Whenever I go to my BFF's place in the Castro, I insist on getting takeout kao soy from Thai House Express. He swoons over the pad thai and swears it's the best he's ever had, but I love my curry noodles so much that I can't imagine ordering anything else.  My finicky preschooler makes quick work of the vegetarian egg rolls. I just wish they offered delivery. I mean, come on...they even have the word \"express\" in their name; express that food to my doorstep, please!", "rating": 3, "date": "2008-06-12"}, {"excerpts": ["Other solid choices are the Tom Yum Goong, Crispy Catfish, Pad Thai, Pad Se-Ew, and Kao Soy ", "(I like it best with the wide rice noodles), but I've never had a dish here ", "I didn't like. ", "Arrive hungry!"], "author": "Sharman G.", "review": "I love this place, and am a regular here after yoga class. Be sure to order the Kao Ka Moo (the inadequately described \"special pork leg stew\") over rice, which I never would have ordered if the guy next to me hadn't been eating it. It's incredibly tender and flavorful pork that must be cooked with star anise, with tasty pickled greens on the side. I don't recommend the sauce that comes with it, because it overpowers the pork's subtle flavor. \n\nOther solid choices are the Tom Yum Goong, Crispy Catfish, Pad Thai, Pad Se-Ew, and Kao Soy (I like it best with the wide rice noodles), but I've never had a dish here I didn't like. Arrive hungry!", "rating": 4, "date": "2008-08-04"}], "crispy pork belly": [{"excerpts": ["Unfortunately, today they are out do the crispy pork belly I love. ", "So it's four stars because it's quite a disappointment today. ", "But this should not stop you from checking this place out."], "author": "Ray A.", "review": "This place is popular and consistent. Food is well prepared and staff is quick and attentive. I can say I frequent this place enough because there are so many options I can eat here. Unfortunately, today they are out do the crispy pork belly I love. So it's four stars because it's quite a disappointment today. But this should not stop you from checking this place out.", "rating": 4, "date": "2014-08-12"}], "beef noodle soup": [{"excerpts": ["The Beef noodle soup which I ordered to go had beef that was super tough.  ", "Not sure if they did that on purpose because we inquired about the  sausage charge. ", "Then they forgot to give us our leftovers. "], "author": "Flo H.", "review": "Something bad happened to this place. New waitresses, unfamiliar faces.  Our usual pineapple fried rice was not up to par. It was all pineapple and raisins and barely any rice. In the past we always got Chinese sausage as a substitute for the pork and tonight our waitress looked at us completely perplexed. We got charged an extra $2.00 when it should come with a meat. The Beef noodle soup which I ordered to go had beef that was super tough.  Not sure if they did that on purpose because we inquired about the  sausage charge. Then they forgot to give us our leftovers. Seriously? \n\nI'm so disappointed, we asked if there was new management and they said no, but so many unfamiliar faces. And their customer service is so poor when confronted with a question about the bill. They would rather lose a customer who has dined there for years. Bizarre and just sad.", "rating": 1, "date": "2014-04-19"}, {"excerpts": ["The beef balls in my beef noodle soup were hard and did not taste fresh either. \n      \n", "The person who greeted us at the door  tried to lead us to the table next to  the door.  ", "We asked to sit toward the back because it was cold, and he refused saying the back was closed...", "but there were other people there.      ", "I noticed that one of the reviews for this restaurant stated that the staff treated asians  poor compared to other patrons....  ", "I don't like to bring race into this .but ", "I'm asian and they wouldn't seat me where I asked...yet the worker seated a group of all white patrons in the back that came in after me.   \n       ", "There are plenty of  Thai restaurants that are good in the city....avoid this one!!!!    ", "I really wanted to like this restaurant since it's in my neighborhood."], "author": "Nile L.", "review": "Just went there tonight...it was awful.  Huge disappointment. I have been to the other location at Larkin and Geary and that one's great.    The Castro location had very slow, poor and rudeservice.    But worse of all, the food was incredibly bad.  \n      Don't order the chicken wing appetizer .  EAch  wing or drummette was half the size of what you would expect from a regular chicken and tasted old.   The chicken  in the yellow curry was the same...the meat was not fresh.......the sauce was good but didn't make up for the old tasting meat.\nThe beef balls in my beef noodle soup were hard and did not taste fresh either. \n      \nThe person who greeted us at the door  tried to lead us to the table next to  the door.  We asked to sit toward the back because it was cold, and he refused saying the back was closed...but there were other people there.      I noticed that one of the reviews for this restaurant stated that the staff treated asians  poor compared to other patrons....  I don't like to bring race into this .but I'm asian and they wouldn't seat me where I asked...yet the worker seated a group of all white patrons in the back that came in after me.   \n       There are plenty of  Thai restaurants that are good in the city....avoid this one!!!!    I really wanted to like this restaurant since it's in my neighborhood.", "rating": 1, "date": "2010-03-07"}], "tom yum noodle soup": [{"excerpts": ["I always order the tom yum noodle soup, but have tried all of their soups and they excel in it! ", "Their spicy is very spicy and sometimes intolerable(still love it!), depending on my day I choose very wisely, but hot is always a good bet. "], "author": "Crystal M.", "review": "I live in the Castro and this is my favorite favorite Thai place in San Francisco. I always order the tom yum noodle soup, but have tried all of their soups and they excel in it! Their spicy is very spicy and sometimes intolerable(still love it!), depending on my day I choose very wisely, but hot is always a good bet. I also love their green curry, it's just so flavorful. I usually have take out but the family that works there is always so nice and the people are quick.", "rating": 5, "date": "2017-06-17"}, {"excerpts": ["Tom yum noodle soup is also a great choice."], "author": "Emily L.", "review": "The green and yellow curry here is delicious. I order delivery and it always exceeds expectations. Tom yum noodle soup is also a great choice.", "rating": 5, "date": "2017-02-10"}, {"excerpts": ["I had the Tom Yum noodle soup at a level 5 spicy. ", "I can handle spicy food, but damn, that level 5 spicy burned my bowels. ", "Stick with a 2 or 3. ", "Is there a Thai version of Montezuma's revenge? ", "Maybe Sukhothai's Return "], "author": "Rocky K.", "review": "I think this place is great. Prices are good, and the taste is right.\n\nI had the Tom Yum noodle soup at a level 5 spicy. I can handle spicy food, but damn, that level 5 spicy burned my bowels. Stick with a 2 or 3. Is there a Thai version of Montezuma's revenge? Maybe Sukhothai's Return Mak Mak?\n\nService was attentive as I was hailing down the waiter for more water to douse the fire going on in my mouth.\n\nTry to get a corner table. Its a great place to people watch while eating some tasty Thai food.", "rating": 4, "date": "2008-07-07"}, {"excerpts": ["Duck laab is delicious, Tom yum noodle soup tastes too artificial lime juice to me. ", "I want to give this place more star but after many disappointment episodes from the staff here, I banned this place from now.  ", "What wrong with their attitude, if they don't want to work then don't! ", "They always make me feel like I'm begging them for everything, same experience for both dine-in and take-out."], "author": "Kong S.", "review": "Selection of food here is great, it reminds me of lovely simple meal we, thai people, usually eat in Thailand. Duck laab is delicious, Tom yum noodle soup tastes too artificial lime juice to me. I want to give this place more star but after many disappointment episodes from the staff here, I banned this place from now.  What wrong with their attitude, if they don't want to work then don't! They always make me feel like I'm begging them for everything, same experience for both dine-in and take-out.", "rating": 1, "date": "2010-04-12"}, {"excerpts": ["i had the tom yum noodle soup with what i thought i ordered was egg noodles, but the noodles looked different to me. "], "author": "Pamela s.", "review": "3.5 stars.\n\nthe decor in this place is cute and modern. i had the tom yum noodle soup with what i thought i ordered was egg noodles, but the noodles looked different to me. you get a choice between flat rice noodles, egg noodles, and a sticky rice noddle, which i dunno what that is, but the lady said they were thin. nonetheless, still tasted good. i love thai flavors and spice, and this soup hit the spot! i also had spring rolls to start off with, but i think they called them garden rolls. the peanut dipping sauce was nothing special, a little on th sweet side for me, i think it needed a kick, some hot sauce of some sort. other than that, service was good. and i like their cups, with town/city names or thailand in traditional thai design with bright colors. i also tried my friends' pad thai, pineapple fried rice, and panang curry, and gai ga prow, all delish!\n\nafter this, we walked around and tried to digest our lovely meal. i just love strolling around castro area.", "rating": 3, "date": "2009-08-04"}, {"excerpts": ["We enjoyed 2 order of tom yum noodle soup, something that not to many places do, 3 spice fish which was really good and the portion was large. ", "our last dish was some kai yang (grilled chicken) with sweet sauce. ", "The prices are alittle be more and the parking can suck at times ", "but I really liked this place. ", "We'll be back soon."], "author": "william w.", "review": "the food was really good. my gf , her friend and I had dinner here the other night. We enjoyed 2 order of tom yum noodle soup, something that not to many places do, 3 spice fish which was really good and the portion was large. our last dish was some kai yang (grilled chicken) with sweet sauce. The prices are alittle be more and the parking can suck at times but I really liked this place. We'll be back soon.", "rating": 4, "date": "2009-04-07"}], "homemade grilled pork": [], "pad seeew": [], "pad keemao": [], "pan fried flat rice noodle with yellow curry": [], "pad woon sen": [], "basil": [{"excerpts": ["I ordered the dungeness crab pad thai,  Minced chicken basil and fried chicken wings.  ", "Everything was good.  ", "The Pad Thai was okay", ", I've had better.  ", "Over all the food was good but not great.  ", "I don't know if I'd order from here again."], "author": "Lennie G.", "review": "Ordered delivery through Yelp and the food came hot and on time.  I ordered the dungeness crab pad thai,  Minced chicken basil and fried chicken wings.  Everything was good.  The Pad Thai was okay, I've had better.  Over all the food was good but not great.  I don't know if I'd order from here again.", "rating": 3, "date": "2018-05-09"}, {"excerpts": ["I also ordered the pao grao and pad king dishes which are naturally really flavorful dishes from all the garlic and chili and basil etc. ", "These were not nearly as bland as the pad seuw, but still less flavorful than I've had at other restaurants... :("], "author": "Rene C.", "review": "I used to go to this place and really enjoyed it. I just ordered takeout and the pad seuw was absolutely bland. Do not get it. I was so excited and craving a good saucey noodle dish. This was NOT it. I also ordered the pao grao and pad king dishes which are naturally really flavorful dishes from all the garlic and chili and basil etc. These were not nearly as bland as the pad seuw, but still less flavorful than I've had at other restaurants... :(", "rating": 2, "date": "2018-03-22"}, {"excerpts": ["We then shared Jamie's favorite Thai dish, the $7.95 Pad Mee Kao (Drunken Noodles) with chicken, onions, carrots, chili, Chinese broccoli and basil, and I have to admit it was rather on the soupy side. ", "No twine but no definable texture either, just a soppy affair that fell short of satisfying either of our palates (photo: http://bit.ly/1CA6b0E). "], "author": "Ed U.", "review": "It's been eight long years since Jamie W. and I have been to this popular Thai spot on the corner of Castro and 19th. In fact, I even referred to Jamie anonymously as \"my dining companion\" in that review, which shows you how long it's been. What may have caused the lengthy sabbatical was a piece of twine that he found in his dish. I was so nice back then that I still gave the proprietors four stars, even though I recounted the incident in painstaking detail. Nowadays I'm not so nice. I'm more interested in being fair which is why I felt a need to share our recent marginally disappointing experience.\n\nJamie was surprisingly the one who suggested our spontaneous return visit. Service felt rushed and indifferent the moment we arrived. We were seated near the window crowded between two tables for two, all four of whom were already quite settled into their meals. I tried to squeeze myself onto the banquette without incident, but it was a chore that only heightened the nervous energy of the server. Once settled in, we shared an appetizer, the $6.95 Corn Cakes which were OK but nothing more in flavor or texture with a dipping sauce of sorts made up of cucumber slices, ground peanuts and red onion (photo: http://bit.ly/1P1rMWf).\n\nWe then shared Jamie's favorite Thai dish, the $7.95 Pad Mee Kao (Drunken Noodles) with chicken, onions, carrots, chili, Chinese broccoli and basil, and I have to admit it was rather on the soupy side. No twine but no definable texture either, just a soppy affair that fell short of satisfying either of our palates (photo: http://bit.ly/1CA6b0E). Better was the $9.95 Pineapple Fried Rice just because it was comfort food of the lowest order as it was mixed with eggs, cashews, raisins, onions, carrots and chicken (photo: http://bit.ly/1CT6gOl). It was good but so was my dad's SPAM fried rice and he didn't charge me ten bucks for a heaping plate of it. There were no strings attached with this visit.\n\nFOOD - 3 stars...Thai food with little commitment for providing distinctive flavors\nAMBIANCE - 2.5 stars...crowding us in a corner didn't endear us to the surroundings\nSERVICE - 2 stars...quite hurried and below average when it came to being responsive\nTOTAL - 3 stars...close call but I'll leave it at three stars for a restaurant on a discernible decline", "rating": 3, "date": "2015-04-02"}, {"excerpts": ["It was a little spicy, but amazing, with hints of basil, lemongrass, vinegar... just perfect.\n\n"], "author": "Brian M.", "review": "Great find! Cozy location right off Castro. Authentic Thai food with a variety of selections. Service was speedy; food was excellent! I had the Thai House Beef, which came with the \"chef's special sauce.\" It was a little spicy, but amazing, with hints of basil, lemongrass, vinegar... just perfect.\n\nI'll be back.", "rating": 4, "date": "2014-08-21"}, {"excerpts": ["orders of their spicy minced chicken, beef, or pork with chili, basil leaves and bell pepper (ga-prow) and it was a really good time.  ", "I really love spicy food and this dish delivered.  "], "author": "Shaun W.", "review": "Popped in with my friend for the first time the other day.  The food was good and the service was ok.\n\nI had to flag down the waitresses for more napkins and they were preoccupied with the empty restaurant and taking their breaks.  It wasn't a big deal, but it was noticeable and enough to not get 5 stars from me.\n\nWe had the \"Four-some Combination\" which is Egg rolls, minced chicken pouches, fish cakes, and sleepy shrimp.  For me, I had (2!) orders of their spicy minced chicken, beef, or pork with chili, basil leaves and bell pepper (ga-prow) and it was a really good time.  I really love spicy food and this dish delivered.  I'll be getting this again for sure.\n\nIt was my first time going there and the interior is not a reflection of the exterior.  It's way nicer on the inside than the outside suggests.\n\nI enjoyed the food and will definitely go back for more or even take-out.", "rating": 4, "date": "2013-09-20"}, {"excerpts": ["Stir-fry chicken with basil. ", "Along with Pad Thai, this is a staple of the Thai meal. ", "Order it mild if your stomach doesn't agree with spicy food. ", "I go for medium. ", "Basil flavor is very opulent. "], "author": "Matt Y.", "review": "4/27/13 \n\nMost recent visit was last Saturday. This is where I go if I want Thai food in my neighborhood. They have more \"authentic\" flavor than Thai Chef on 18th Street, which has a overwhelming inclination on putting lots of sugar in their food.\n\n*Tom kha gai:  Coconut milk and lime juice seasoned with ginger root and cayenne pepper create a spicy broth for this Thai-inspired soup with strips of white chicken, cilantro and mushroom. Overall it's good but could be a bit less watery.\n\n*Yellow curry:  usually good, flavorful and spicy. My friend complained that his edition in that evening was bland and tasteless.\n\n*Thai beef: tender and barbequed to medium, beef was marinated well. Be aware of that green chili sauce, it's hotter than wasabi.\n\n*Gai ka prow:  Stir-fry chicken with basil. Along with Pad Thai, this is a staple of the Thai meal. Order it mild if your stomach doesn't agree with spicy food. I go for medium. Basil flavor is very opulent. Perfect to eat with jasmine rice. \n\nThe hot tea is the same herbal tea used in Thai iced tea minus the carnation milk and sugar. It's good for mitigating the flamey tongue!\n\nService is alright but could be more attentive. My gai ka prow didn't come with everyone else's food so I was poking at my friends' dishes. I heard Thai House in the Castro had recently divorced from Thai House on Geary in the Tenderloin. Food has got better here and regrettably, crazy spicy there. They also have traditional dishes like pork leg stew and \"Ko Soi\"---noodle in curry soup. Worth a try if you're interested in real Thai fare.", "rating": 4, "date": "2013-05-02"}, {"excerpts": ["The basil dishes are awesome and they don't hold back on the spice."], "author": "Morgan K.", "review": "Pretty good Thai food. The environment is clean and the service is good.\n\nThe basil dishes are awesome and they don't hold back on the spice.", "rating": 4, "date": "2015-02-18"}, {"excerpts": ["We went into the Thai House Express because they had exactly what I wanted:\nLarb salad (marinated tofu with chili, served with onions, basil, and half a slab of cabbage) in their \"special lemon dressing.", "\" "], "author": "Adena B.", "review": "It was late, but I was hungry. I just wanted a big, fat dinner salad. That's all, something light, something tasty.\n\nWe went into the Thai House Express because they had exactly what I wanted:\nLarb salad (marinated tofu with chili, served with onions, basil, and half a slab of cabbage) in their \"special lemon dressing.\" Sounds pretty good, right?\n\nWrong.\n\nIt was served right after I had a bite of the shrimp garden roll (http://www.yelp.com/biz_photos/thai-house-express-san-francisco-2?userid=cqf8dqO5_QUxjfo6WiM7yg#qKwgeiY0SrgtF65m0ixYXg, which was good; tasty). The server placed the salad plate on our table, and immediately, my date and I looked at each other, like, \"what's that smell?\" The table next to us even gave us a sidelong glance.\n\nIt's not me, guys, I JUST showered!\n\nThe salad reeked of a combination of dehydrated-homeless-man-pee and vomit. I'm not kidding: go ahead and order that salad with tofu and smell it for yourself.\n\nI didn't make a fuss about it, but the server did notice that I'd barely touched the salad and didn't ask why. Speaking of servers, they were great; always kept the water glasses full and were prompt with the service. \n\nAt least they've got that going for them.", "rating": 2, "date": "2012-09-05"}, {"excerpts": ["$ 7.95\nPan-fried rice noodles with your choice of beef, pork or chicken, onions, chili, Chinese broccoli and basil leaves.\n\n"], "author": "Thomas D.", "review": "Loved it!\nThe service couldn't have been any better.  They also gave me a Thai Iced Tea on the house after realizing that my mouth was on fire from the spicy dish that I ordered.\n(I went through 4 napkins blowing my nose and loved every bite of my dinner.)\n\nPAD KEE-MAO (DRUNKEN NOODLES)  $ 7.95\nPan-fried rice noodles with your choice of beef, pork or chicken, onions, chili, Chinese broccoli and basil leaves.\n\nI asked for this dish to be cooked medium spicy--next time I'll ask for it to be cooked mildly spicy.\n\nWe also tried the:\n PAD SEE-EW  $ 7.95\nPan-fried rice noodles with your choice of beef, pork or chicken, egg and Chinese broccoli.\n\nThis too was very flavorful and quite mild.  We really enjoyed the flat rice noodles in this dish.\n\nThe serving sizes were generous.\n We started off with the sampler platter:\nFOUR-SOME COMBINATION .$ 9.95\nEgg rolls, minced chicken pouches, fish cakes, and sleepy shrimp. A great sampler! (2 pieces each)\n\nWe'll skip this platter the next time --everything was fried and it was too much food when combined with our other dishes.\n\nThe SINGHA BEER -$ 4.50 was a nice beverage to wash everything down with.  It is a very mild and light, tasty beer,", "rating": 4, "date": "2012-03-30"}, {"excerpts": ["Chicken Basil (kai ka prow) is cooked in authentic way using ground chicken rather than sliced chicken breast. "], "author": "Saran R.", "review": "Food here at Thai House Express on my last visit was much better than the first time. The food is tasty. Chicken Basil (kai ka prow) is cooked in authentic way using ground chicken rather than sliced chicken breast. Crispy catfish fillet with green beans is pretty good if you feel like seafood. \n\nWe ordered mild for Som Tum (papaya salad) and thought we could have upped the spicy level one notch to medium. Mild is just too mild for us. \n\nFast and friendly service from the Thai staff. We're seated right away on a Friday night when Frameline festival is going on. Very lucky indeed!", "rating": 4, "date": "2013-06-22"}, {"excerpts": ["My favorite the basil chicken - it was cooked with just enough basil to taste and the spice level was just enough to taste but not to burn the tongue."], "author": "Rox P.", "review": "Authentic and delicious Thai food.  I've not been able to find a good Thai restaurant where we live.  When I'm in San Francisco I always make sure I go to this Thai restaurant.  \n\nWe ordered the pumpkin curry with beef.  The curry was flavorful and had just enough sweetness and savory note that blended really well.  The Crab pad thai was cook just right.  The noodles were cooked perfectly, the meat was abundant and the sweetness and spice were just the right amount.  The green papaya salad, we ordered spicy, was fresh and crisp.  My favorite the basil chicken - it was cooked with just enough basil to taste and the spice level was just enough to taste but not to burn the tongue.", "rating": 4, "date": "2011-06-11"}, {"excerpts": ["- pad thai\n- som tum thai (green papaya salad)\n- pumpkin curry\n- ga prow (minced chicken w/ basil, chili, and bell peppers)\n\n"], "author": "Kristen C.", "review": "If you're in Castro and want Thai...this is the spot :) \n\nWhen i came in, the first thing i noticed was that I loved the decor. Especially the flower prints on the wall. Service was great and everyone was super friendly and helpful. We went around 7:30 on a Monday night, and it was surprisingly packed which is always a good sign. Their menu was extensive but definitely not overwhelming, and they have all the basics you want when you crave Thai food. Even better, they have a decent wine menu! \n\nfav dishes of the night:\n- tom yum goong soup\n- pad thai\n- som tum thai (green papaya salad)\n- pumpkin curry\n- ga prow (minced chicken w/ basil, chili, and bell peppers)\n\nThey get their 5th star because of their mango sticky rice dessert. I got some serious mango knowledge that night! Unlike other places who use semi-ripe or stringy fibrous mangoes during the winter season, these were SWEET and left no grossness in your mouth after biting into it. AMAZING FOR THE FREAKING MIDDLE OF WINTER! \n\nI was told that mangoes that taste stringy are mostly from Mexico, but the sweeter ones come from Guatemala or the Philippines. It obviously shows they know their stuff even down to the last details ...like where to purchase good mangoes :)", "rating": 5, "date": "2011-01-08"}, {"excerpts": ["Veg curry doesn't just mean napa cabbage, but chock full of long beans, big chunks of pumpkin, broccoli, carrots, finely diced lemongrass, and whole leaves of Thai basil.\n\n"], "author": "Susan S.", "review": "Thai House Express has VASTLY improved in the past half year to year since it got slapped on the wrist for a health code violation (you read it right!). \n\nI live across the street, so had many opportunities to study the health inspector document that was taped to the their front door for many weeks. The slap on the wrist came because Thai House apparently set a pot of curry on the floor -- in all likelihood the commonest of occurrences in Asian, and non-Asian, restaurants -- and were caught red-handed. \n\nAnyway, I've never, ever gotten sick from eating at this restaurant, but for the past 4 years, it's been quite mediocre in terms of food yumminess, ingredients and service.\n\n2011 is definitely this restaurant's year to start over.\n\nSo far they've done a nice, 4+ star job:\n\nFood: \n\n+ Standard Thai restaurant items with better-than-average-quality ingredients. Veg curry doesn't just mean napa cabbage, but chock full of long beans, big chunks of pumpkin, broccoli, carrots, finely diced lemongrass, and whole leaves of Thai basil.\n\n+ Pad Thai is not flavored with ketchup (as some really lame \"Thai cooking at home!\" cookbooks advise), but actually fairly complex -- fishy, seared, sweet, and tangy -- for what started out in this world as a humble street food.\n\nAmbience:\n\n+ Patrons of this restaurant are always some of the LEAST annoying :) people in San Francisco, even when they're drunk, which they're usually not. Go Castro.\n\n+ Nice corner spot on the quietest end of the village, so a good place to chill out before or after the busier hangouts of this neighborhood.\n\nService:\n\n+ Staff have become sweeter since their wrist-slap. \n\n+ Always nice, and never condescending, about special requests like bringing my own containers for takeout, ingredient substitutions, etc.\n\nGive this place a first, or second, try -- it's one of the Castro businesses that's NOT resting on its laurels, and appears to be trying hard to change, and improve.", "rating": 4, "date": "2011-12-06"}, {"excerpts": ["We had the Curry chicken, Fried fish with peanut sauce, spicy ground pork with basil and peppers. ", "Every single dish was cooked perfectly. "], "author": "jason g.", "review": "I liked it. I would say it is very comparable to most of the good Thai restaurants in the City. Authentic, not afraid to add spices when requested for spicy, fast, and the service was fantastic. Jack, our server, made sure that we had enough food, water was refilled periodically, and served with a smile. \n\nIt probably helped that I dined with a few of his friends as well. As for the food..............it's good. If I lived in this neighborhood this would be my go to place for Thai. I probably wouldn't come here from where I live, but people who live around here should. \n\nWe had the Curry chicken, Fried fish with peanut sauce, spicy ground pork with basil and peppers. Every single dish was cooked perfectly. The food is flavorful, prepared well, and encaptures the true essence of Thai cuisine in my opinion. \n\n3 dishes with 3 orders of rice came out to around 32 dollars. If you like Osha on Geary, Chabaa, Marnee then you are going to like this place.", "rating": 4, "date": "2010-03-08"}, {"excerpts": ["Not being one to pass up curry, I got the gang koor goong: shrimp in red curry, pineapples, tomatoes, and basil.  "], "author": "Becca S.", "review": "Having seen a movie at the Castro on a Friday night, I made the decision that I needed some tasty food in my belly to accompany the moving images still churning around in my head.  Someone suggested Thai food as it is both tasty and veggie-friendly, and so we made the minuscule mosey over to Thai House Express.\n\nThai House Express is a trendy looking place.  The decor is rather bare-bones, though the hip-looking people in their skinny-looking jeans and chunky-looking glasses tend to provide most of the visual stimulation.  And we had a lot of time to look around, as the wait for a table was surprisingly long.  We were given menus and were able to order ahead of time, which was nice.  But another group of the same size was seated first, even though they arrived after us, which was a little less nice.\n\nThe menu was extensive, and very vegetarian-friendly.  Pretty much anything can be made with tofu, and my friends ended up with piles of various vegetables on top of brown rice.  They looked (and, I'm told, were) super good.  We also got spring rolls and, perhaps to compensate for being so darn healthy, the corn cakes.  Not being one to pass up curry, I got the gang koor goong: shrimp in red curry, pineapples, tomatoes, and basil.  The spring rolls were deliciously average, the corn cake was deliciously fried (and a refreshing change of pace!), and the curry held its own quite well.  It was creamy with a little heat as I was anticipating, but I was a little disappointed by the amount of delightful chunky bits in my curry - it looked a bit more like soup, though it did taste excellent over the rice.\n\nThe service was really quite alright once we were seated, and I'm mostly content with the prices - Thai House Express could charge for ambiance if it wanted to, but they don't and I appreciate that very much.  If I'm in the Castro, I'll likely show up again and try some of the other dishes.  It's legit and it's tasty, but it's no reason to make a pilgrimage across the city.  Unless, of course, you just like taking pilgrimages.", "rating": 3, "date": "2011-02-13"}, {"excerpts": ["The basil was done right (not black and overcooked like some places).  ", "However,  I didn't like how it was hardly spicy at all (and I asked the kind waitress to make it as spicy as possible!).  "], "author": "Dararith L.", "review": "I was chillin out here just last week!  It was fairly crowded, but my party got our table in no time.  I ordered the Pad Kee Mao, my traditional favorite for Thai dishes.  I know, I'm lame...I get the same damn thing every time I want to satisfy my Thai cravings.  This also means my palette is well adjusted to hone in on specific aromas and taste for Pad Kee Mao...whatever the hell that means.  \n\nAnyway, the Pad Kee Mao was very delicious!  Being left-handed, I ate with a spoon on my right hand and a fork on my left, as suggested to me by this Thai lady at another restaurant (seems to be the standard way of eating for the Thai folks, apparently).  Supposedly, you bring the spoon to the mount (or mouth, whatever) and never the fork...the spoon should have more droplets of Thai sauces/spices per area than a fork can ever have.  Ending result:  Not sure if it was the method, but damn the food was delicious!  Very flavorful.  The basil was done right (not black and overcooked like some places).  However,  I didn't like how it was hardly spicy at all (and I asked the kind waitress to make it as spicy as possible!).  I've tasted spicier things in...fish and grits than I do in this Pad Kee Mao dish...\n\nI snatched a few noodles from a Pad Thai dish my friend ordered when she wasn't looking, and I gotta say...that Pad Thai dish is as good as they say it is! ... or maybe it just taste better when you have to work for it. =P  \n\nRegardless, I recommend this place for a decent meal.  The price is very fair for the quality of the food they have.", "rating": 4, "date": "2009-12-13"}, {"excerpts": ["- Basil Chicken (Ga-Prow) - How do they make ground chicken taste so good!? ", "I normally find ground chicken to be pretty gross (well, more like tasteless), but the flavor of this dish blew my mind. ", "Strong basil influence, a little spicy, and an umami sauce. ", "Definitely try this dish, which also comes with beef or pork.\n", "- Seafood with Spicy Basil - ", "This dish was good, but not too memorable. ", "If you like seafood, I would recommend it.\n", "- Taro Balls in Creamy Coconut ", "(Bua Loi) - ", "Little pillow-y taro pieces of heaven. ", "A consistency somewhere between mochi and gnocchi, but with taro! ", "And you can't go wrong with coconut milk. ", "I was deciding whether to give this place 4 or 5 stars, but the Basil Chicken and the Taro dessert made me bump it up to 5."], "author": "Angel C.", "review": "Came here after watching Alton Brown at the Castro Theater (which was an amazing show!). This is some of the better Thai food I've had.\n\n- Fish Cakes (Tod Mun) - These were ok. I've had better. They lacked in flavor a little, but the consistency was just right - a little spongy (in a good way!).\n- Basil Chicken (Ga-Prow) - How do they make ground chicken taste so good!? I normally find ground chicken to be pretty gross (well, more like tasteless), but the flavor of this dish blew my mind. Strong basil influence, a little spicy, and an umami sauce. Definitely try this dish, which also comes with beef or pork.\n- Beef Green Curry - Very good green curry. At the end, we had some sauce and some rice left, so I dumped the rice in the sauce and finished it all!\n- Seafood with Spicy Basil - This dish was good, but not too memorable. If you like seafood, I would recommend it.\n- Taro Balls in Creamy Coconut (Bua Loi) - Little pillow-y taro pieces of heaven. A consistency somewhere between mochi and gnocchi, but with taro! And you can't go wrong with coconut milk. Delicious!!\n\nI was deciding whether to give this place 4 or 5 stars, but the Basil Chicken and the Taro dessert made me bump it up to 5.", "rating": 5, "date": "2012-11-07"}, {"excerpts": ["(Spicy minced port, or chicken with basil leaves and bell peppers).  ", "Super good.  "], "author": "Jason I.", "review": "Some of the best Thai in 'da hood.  And you know how you are when you want something and you want it to be good?  Consistent?  That is how I view Thai House Express.  This is probably my 10th time there....\n\nDinner last night was calling, and it wasn't going to be coming from my kitchen.  Went over to Thai House Express and wasn't disappointed.\n\nChicken Skewers with Peanut Sauce.  Always good.  Chicken is always fresh and never fatty.  I am not a peanut sauce fan, but my dining parter was and said it was great.\n\nThen it was TOm Kha Gai (hot and sour chicken soup).  A nice mix of coconut milk with lemon grass, plenty of chicken with mushrooms and onions.  This is something that is ALWAYS ordered.  ALWAYS, did I say?  Yes.\n\nPad Thai - now you can't really mess that up.  Well, you can, but not here.  Consistently good.  Nice big serving/portions, and good mix of noodles, chicken (or shrimp), and green onions.  May be a bit heavy on the tofu, so if you don't like tofu have them relax a bit on it.\n\nThen off to the Gai Ga Prow (Spicy minced port, or chicken with basil leaves and bell peppers).  Super good.  Not too spicy.\n\nI typically order ala carte if I can, only because you get a bigger serving.  With the leftovers (and there will be leftovers as the portions are healthy), I order a side of rice and take it to go for lunch the next day.  In fact, I'm devouring my leftovers right now!  The only thing to note is that there is a bit of oil that is used in their cooking - so if you have a sensitive stomach, this could pose a bit of a problem.", "rating": 4, "date": "2010-04-22"}, {"excerpts": ["As an example, I can always tell an Americanized Thai restaurant from an authentic Thai restaurant by their preparation of chicken kaprow, or stir-fried chicken with basil. ", "Good (or not so good) ", "Thai restaurants will use whole chicken breasts and cover them in basil and sauce. ", "Better Thai restaurants will grind the meat into small pieces, and then cook. ", "Rare is the restaurant that actually takes the time and effort at this extra step. "], "author": "P Z.", "review": "I am in very serious like with Thai House Express, but sadly have been held back from loving it by a number of issues. The food's preparation is authentic, but it often lacks spice and flavor.\n\nThe preparation is fairly authentic. As an example, I can always tell an Americanized Thai restaurant from an authentic Thai restaurant by their preparation of chicken kaprow, or stir-fried chicken with basil. Good (or not so good) Thai restaurants will use whole chicken breasts and cover them in basil and sauce. Better Thai restaurants will grind the meat into small pieces, and then cook. Rare is the restaurant that actually takes the time and effort at this extra step. Thai House Express is one of the few Thai restaurants in San Francisco that I've found that do this: so they automatically get some love.\n\nBut I cannot give this place many more accolades because I cannot, despite having eaten here at least 10 times, figure out how to ask them to make the food spicy. I have tried every trick in my spice-loving book. \"Thai spicy\" is met with an approving nod, yet bland results. \"Very, very, very spicy\" meets the same fate. Everything I have tried is met with the same bland response, and it is enervating. \n\nAlthough the food's preparation is right, I just want to know what I have to say to get flavorful food, and I'd gladly give this place five stars.", "rating": 4, "date": "2010-07-12"}, {"excerpts": ["Best basil dishes."], "author": "Jennifer V.", "review": "Delicious Thai food! Great for take-out since the sit-down service is kind of slow (even when they're not busy), but the food tastes authentic and fresh. Best basil dishes.", "rating": 4, "date": "2012-10-03"}, {"excerpts": ["We ordered up Garden Rolls, Pad Thai, Basil Chicken and Sticky Rice. ", "When our Garden Rolls came to the table, they were carried by a different server-- this one completely listless. ", "He obviously didn't have the strength, or maybe just didn't have the desire, to place the platter all the way on our table. ", "Now, it's been many years since I've waited a table ", "but I'm pretty sure there's some unwritten rule about putting a platter all the way on the table, instead of letting half of it hang off the edge. ", "Because, wonder of wonders, as soon as he took his hand off the platter, gravity kicked in, and it went crashing down to the floor. ", "Not one of the other waiters came over to help clean it up. ", "I can't be sure if you just reused the same garden rolls that were on the floor ", "but I have a suspicion you did. ", "BTW- ", "the rolls were so dry we choked, and we're gay so choking is something we rarely do. ", "Thai House Express on Castro-- if you're going to pre-make \"fresh\" garden rolls, the least you can do is drape them with damp paper toweling ", "so they don't dry out. ", "That's my Martha Stewart Good Thing(tm) tip to you-- ", "And the Basil Chicken-- EESHK! ", "It was so salty even the other people in the restaurant who didn't eat it will be retaining water for the next month. ", "I will admit that the Sticky Rice came out alright-- which surprised me since you seemed to eff everything else up.\n\n"], "author": "Eric B.", "review": "It's rare I'll write a dissenting review on Yelp but this time I've just gotta.\n\n\nDear Thai House Express on Castro,\n\nOur \"relationship\" is OVER!\n\nAs you already know for the past six months I've wanted things to work out between us. But your food is lackluster and your service is downright dismal. Take for example last night when my friend and I came over to have a three-way with you. The front of the restaurant was already crowded and you refused to open up the back *ahem*. You sat us at a table for two right in front of the counter, in the thick of the dining orgy, than proceeded to treat us as if we were invisible for fifteen minutes. No water, no drink orders, not even a reach around. How rude!\n\nWhen one of your waiters finally came over he was surly-- like he was coming off a bender or had gotten a little too much abuse that evening. We ordered up Garden Rolls, Pad Thai, Basil Chicken and Sticky Rice. It surprised me that he could even take our order considering he barely listened to anything we said. \n\nWhen our Garden Rolls came to the table, they were carried by a different server-- this one completely listless. He obviously didn't have the strength, or maybe just didn't have the desire, to place the platter all the way on our table. Now, it's been many years since I've waited a table but I'm pretty sure there's some unwritten rule about putting a platter all the way on the table, instead of letting half of it hang off the edge. Because, wonder of wonders, as soon as he took his hand off the platter, gravity kicked in, and it went crashing down to the floor. Not one of the other waiters came over to help clean it up. So it took our listless server a good three minutes to get everything up off the floor-- with nary an apology mind you.\n\nImagine our surprise when a new platter came out only thirty-seconds after the broken platter had been taken away. This time it was placed three-quarters of the way on our table. I can't be sure if you just reused the same garden rolls that were on the floor but I have a suspicion you did. BTW- the rolls were so dry we choked, and we're gay so choking is something we rarely do. Thai House Express on Castro-- if you're going to pre-make \"fresh\" garden rolls, the least you can do is drape them with damp paper toweling so they don't dry out. That's my Martha Stewart Good Thing(tm) tip to you-- you're welcome in advance.\n\nCan you answer me a question? When did your Pad Thai become synonymous with fish flavored candy? After our first bite both my friend and I became diabetic. And the Basil Chicken-- EESHK! It was so salty even the other people in the restaurant who didn't eat it will be retaining water for the next month. I will admit that the Sticky Rice came out alright-- which surprised me since you seemed to eff everything else up.\n\nThai House Express on Castro-- we won't see each other any more. I am not going to mall dodge you, instead when I pass by your front or side I'll flip you off because I'm hurt and I don't feel the need to curtail any impulses.", "rating": 1, "date": "2007-08-09"}, {"excerpts": ["After several attempts from our server we finally decided on \"Something-something Basil with Chicken\", \"Blah blah Blah Red Curry with Beef\", and brown rice. ", "Did I get the Thai Iced Tea? ", "Of course I had the ice tea. ", "It is the only thing I anticipate from a Thai eatery! ", "The \"Something-something Basil\" was good. ", "But Oh that \"Blah blah Blah Red Curry!", "\" ", "It was amazing ", "and I hate curry! ", "I had to stop myself from picking up the dish and drinking the sauce directly from the bowl. ", "Although I did pour the sauce all over my \"Something-something Basil\" which turned into a lovely combo in my mouth. \n", "I'll consider myself a fan of  THX especially when it comes to \"Blah blah Blah Red Curry\". ", "I mean, this stuff was really good and on top of that", ", my date ended well. \n", "I even got a little tongue action before heading to the Mission to meet the boys at the bar."], "author": "Tobias W.", "review": "I'm not a fan of Thai food. I don't like peanut oil, peanut sauce, coconut mixed or attached to any food, or curry. So when it comes to choosing a place to eat, Thai is never on my list.\n\nFortunate for me, 3 of the 5 most recent dinner dates have insisted on their favorite Thai restaurants. I know, I have the best luck. Last night was Thai House Express (THX) on Castro.\n\nSo I was standing on the corner of 19th & Castro waiting for my date to arrive and thinking of the nearest pizza slice, when a Yellow Cab arrived and the most amazing legs stepped out of the car and took my hand. I quickly went dumb and forgot everything I learned in fourth grade. The night chill had started to roll in so we retreated inside THX for warmth and food. We were seated immediately. I like that kind of service. \n\nThe decor was simple yet nice... the crowd was mostly men but not intimidating... and sitting across from me were a pair of beautiful blue eyes and a gorgeous smile... My overall impression, Warm and Safe.\n\nAfter several attempts from our server we finally decided on \"Something-something Basil with Chicken\", \"Blah blah Blah Red Curry with Beef\", and brown rice. Did I get the Thai Iced Tea? Of course I had the ice tea. It is the only thing I anticipate from a Thai eatery! I have a bit of a sweet tooth.\n\nOur food arrived in typical white bowls found in every contemporary Asian-Style restaurant. The presentation was great! I was all about it, even though I had to find my own chop sticks. The \"Something-something Basil\" was good. Through my recent Thai experiences, I've discovered the one Thai dish that won't make me vomit. \n\nBut Oh that \"Blah blah Blah Red Curry!\" It was amazing and I hate curry! I had to stop myself from picking up the dish and drinking the sauce directly from the bowl. Although I did pour the sauce all over my \"Something-something Basil\" which turned into a lovely combo in my mouth. \nI'll consider myself a fan of  THX especially when it comes to \"Blah blah Blah Red Curry\". I mean, this stuff was really good and on top of that, my date ended well. \nI even got a little tongue action before heading to the Mission to meet the boys at the bar.", "rating": 4, "date": "2009-07-01"}, {"excerpts": ["If you order the Basil Beef, be prepared for a pile of ground beef mixed with some basil. ", "Not terribly inspiring."], "author": "Don m.", "review": "My go-to place for Thai food in the Castro.  Good service, OK food. I always order too much so I have left overs the next day.\n\nIf you order the Basil Beef, be prepared for a pile of ground beef mixed with some basil. Not terribly inspiring.", "rating": 3, "date": "2012-07-16"}, {"excerpts": ["Another favortie is the Tofu pad ga prow - onions, peppers, fried tofu, stir-fried with basil and a sweetly spiced garlic sauce over rice. ", "This is one of my favorite meals. ", "Get this and a glass of water ", "and you're out the door for $9 after tip. "], "author": "Ennis O.", "review": "So my profile says for my last meal I want Green Papaya Salad. I discovered this tastiest of tasty salads in Thailand years ago and I've never forgotten that first plate. I have many a good papaya salad since, but Thai House Express has it nailed. They even have the extra spicy, \"I won't survive this meal\" version which I usually need to have them tone down a bit.\n\nPad Thai is the other perennial favorite of Thai lovers that must be done right or all the curry goodness in the world can't make up for it. This place has it! While I have enjoyed Osha Thai for years (long before their chain-like explosion) and our endless supply of others, Thai House Express still takes the bean cake for me. Properly sized noodles - not thin, round, or too flat and wide. Great sauce that doesn't have too much fish sauce or too little either. No piles of cauliflower for us vegetarians - just the same shrimp version without the shrimp.\n\nAnother favortie is the Tofu pad ga prow - onions, peppers, fried tofu, stir-fried with basil and a sweetly spiced garlic sauce over rice. This is one of my favorite meals. Get this and a glass of water and you're out the door for $9 after tip. Not a bad at all.\n\nAlso, try out the corn cakes to start - really more like a corn fritter - with a little  cucumber/onion/peanut in simply syrup for a topping. My favorite way to start a meal.\n\nThe fifth star is reserved for the day time staff. Come in after 6pm on a weekday or late evening on the weekends and you'll have a great time. Before that and the service seems a bit annoyed to be working. Considering how well they do everything, and one or two not-so-enthusiastic wait staff aside - this is one of my favorite Thai hang outs!", "rating": 4, "date": "2009-02-11"}, {"excerpts": ["Chicken with Basil and the Crab Pad Thai.  ", "YUMMY"], "author": "priscilla p.", "review": "The food is always great.  Chicken with Basil and the Crab Pad Thai.  YUMMY", "rating": 5, "date": "2013-08-21"}, {"excerpts": ["Crisp veggies, fresh basil, pan fried rice noodles, and a spice level (we requested it spicy, even though it already had the chili notation on the menu) that was kickin'! ", "Yeah, this was right at the threshold of excellent spicy flavor and an intense, fiery burning. ", "I think it may be more pleasant to stick to the regular spicy level at T.H.E. b/c they are not messing around with the heat. ", "If you like it spicy, get over there soon.\r\n", "Nice modern space, friendly servers, water refilled regularly, and, even if the food wasn't as savory as it was, I would still love them b/c ", "they're open late, til midnight or 1am on the weekend and 10 or 1030 during the week. ", "About $18 for 2 dishes before tip.\r\n\r\n", "*****************************************************************\r\nUpdate 2/28/06-Went back and ordered the same 2 dishes again. ", "Found the pork to be less succulent and fatty. ", "Still good though, just not ambrosial. ", "I was there at the busier dinner hour, so maybe sneaking in earlier or later is the key to allowing the kitchen to take their time?"], "author": "Candice L.", "review": "I tend to avoid meals in the Castro with a  few exceptions, but I was compelled to try Thai House Express for the rumored greatness of the kao ka moo, special pork leg stew. As a girl that grew up enjoying Peking Duck, suckling pigs, things wrapped in bacon, and well marbled steaks, I knew I would love this dish the moment I laid eyes on the rich fatty bits, pork skin, and soft braised meat of the kao ka moo! I wouldn't recommend powering through this on your own though, definitely a dish to share. Loved the spicy tangy sauce that came on the side and the crisp emerald green gai lain (Chinese Broccoli) hiding underneath the tender pork soaking up the yumminess.\r\nPad kee mao was also very good. Crisp veggies, fresh basil, pan fried rice noodles, and a spice level (we requested it spicy, even though it already had the chili notation on the menu) that was kickin'! Yeah, this was right at the threshold of excellent spicy flavor and an intense, fiery burning. I think it may be more pleasant to stick to the regular spicy level at T.H.E. b/c they are not messing around with the heat. If you like it spicy, get over there soon.\r\nNice modern space, friendly servers, water refilled regularly, and, even if the food wasn't as savory as it was, I would still love them b/c they're open late, til midnight or 1am on the weekend and 10 or 1030 during the week. About $18 for 2 dishes before tip.\r\n\r\n*****************************************************************\r\nUpdate 2/28/06-Went back and ordered the same 2 dishes again. Found the pork to be less succulent and fatty. Still good though, just not ambrosial. I was there at the busier dinner hour, so maybe sneaking in earlier or later is the key to allowing the kitchen to take their time?", "rating": 5, "date": "2006-02-03"}], "sauteed ginger": [], "sauteed garlic": [], "sauteed eggplant": [{"excerpts": ["We don't usually have to look at the Menu because we already have our favorites picked out, which are the Sauteed Eggplant and Red Curry with Chicken.\n\n"], "author": "Shannon A.", "review": "My roommate and I eat at Thai House Express once every couple of weeks but if it were up to us, it would be much more often. We don't usually have to look at the Menu because we already have our favorites picked out, which are the Sauteed Eggplant and Red Curry with Chicken.\n\nThe seating and service is quick and the quality is great for this price range.  Its hard for me to eat at any other Thai place and not compare the price vs. quality to Thai House. \n\nnote: They have brown rice and its delicious!", "rating": 5, "date": "2009-02-20"}, {"excerpts": ["My main course was Pad Ma Keur (sauteed eggplant and chicken).  ", "It was significantly overcooked, resulting in tough chicken and mushy eggplant.  "], "author": "Adam H.", "review": "Yuck.\n\nJust gave this place another chance and sadly things did not go well.  This *used* to be the best place for Thai in the neighborhood but lately things are on a definite downturn. \n\nFor example, the thick raw red onions in Tom Kha Gai soup were sharp and overpowering and should have either been more thinly sliced or left in the broth longer to cook and mellow.  It was an amateurish culinary error.\n\nThe cucumber salad, a staple of Thai cuisine had dressing that was overly sweet.  Somehow the kitchen got the balance between the sweet and the acid all wrong.  Again, this is a basic thing that any Thai kitchen worth its salt should nail.\n\nMy main course was Pad Ma Keur (sauteed eggplant and chicken).  It was significantly overcooked, resulting in tough chicken and mushy eggplant.  One of my favorite Thai dishes, I was only able to get half of it down.\n\nLunch came with an appetizer called \"Toons Gern Yueng\"  - diced chicken fried in a pocket of springroll dough.  It was bland and dry...lacking much flavor and sporting a \"fried wet sawdust\" texture.  I deemed this inedible and only downed one bite.\n\nThe underlying theme here is lack of consistency.  Over the years I've had great meals here and awful meals here.  More recently it's been quite bad.  Today, I suspect, was my last visit.", "rating": 1, "date": "2007-10-21"}], "prigking": [], "sauteed mixed vegetables": [], "sauteed chicken with cashew nuts": [], "crispy chicken": [{"excerpts": ["I ordered the crispy chicken, which came as a huge pile of fried chicken pieces on a plate. ", "The chicken was dry, indicating that it was probably fried earlier in the day and kept under heat until someone ordered it. ", "The coating on the chicken was very salty.  ", "I also ordered the fried rice (as recommended on the menu) which had the potential of being delicious, but it was doused in fish sauce which was all you could taste, along with more salt. ", "I dined with two other friends and one had the Crab Pad Thai.  ", "What arrived looked like red tuna salad with noodles and it was obvious the crab came from a can, sort of like ordering tuna tar tar and getting an opened can of Star Kist.  ", "The other friend had the steak which was actually good.  "], "author": "Patrick V.", "review": "Salt.  If you like heavily salted food, then this is your kind of place.  I think the salt had salt on it. My only conclusion is that the chef has a large quantity of stock in the Morton Salt Company.  \n\nI ordered the crispy chicken, which came as a huge pile of fried chicken pieces on a plate. The chicken was dry, indicating that it was probably fried earlier in the day and kept under heat until someone ordered it. The coating on the chicken was very salty.  I also ordered the fried rice (as recommended on the menu) which had the potential of being delicious, but it was doused in fish sauce which was all you could taste, along with more salt. I dined with two other friends and one had the Crab Pad Thai.  What arrived looked like red tuna salad with noodles and it was obvious the crab came from a can, sort of like ordering tuna tar tar and getting an opened can of Star Kist.  The other friend had the steak which was actually good.  The \"secret sauce\" for the steak was really tasty.\n\nI see all the complaints about the service, and my experience was fine.  The waitress was attentive and the food arrived quickly.  I dined there a few months ago and the food was quite good at that time.  Did they get a new chef, perhaps?", "rating": 2, "date": "2015-09-03"}, {"excerpts": ["Favorites of ours: pork gra pow, pad see-eww, crispy chicken with their spicy sauce, roast duck and sleepy shrimp!"], "author": "Sharon L.", "review": "We've been coming for years and although they have changed to a more limited menu recently, it's still a very great neighborhood place. Favorites of ours: pork gra pow, pad see-eww, crispy chicken with their spicy sauce, roast duck and sleepy shrimp!", "rating": 4, "date": "2015-09-23"}, {"excerpts": ["My friends and I really love the Crispy Chicken, Corn Cakes, Sauteed String Beans, Pineapple Fried Rice, and Green Papaya Salad.\n\n"], "author": "Mike B.", "review": "Thai House Express is my favorite Thai in the city.  It's a regular go-to for take out.  My friends and I really love the Crispy Chicken, Corn Cakes, Sauteed String Beans, Pineapple Fried Rice, and Green Papaya Salad.\n\nThe service is quick and friendly.   Conveniently located at 19th and Castro, there's always something pleasing to eyes as well as the palate.", "rating": 5, "date": "2014-03-31"}], "crispy pork": [{"excerpts": ["Unfortunately, today they are out do the crispy pork belly I love. ", "So it's four stars because it's quite a disappointment today. ", "But this should not stop you from checking this place out."], "author": "Ray A.", "review": "This place is popular and consistent. Food is well prepared and staff is quick and attentive. I can say I frequent this place enough because there are so many options I can eat here. Unfortunately, today they are out do the crispy pork belly I love. So it's four stars because it's quite a disappointment today. But this should not stop you from checking this place out.", "rating": 4, "date": "2014-08-12"}, {"excerpts": ["We ordered the crispy pork and were charged $8.25 for a small plate of crispy pork and another $1.25 for rice. ", "When I asked why the rice wasn't included I couldn't get an answer. ", "The 'waiter with an attitude' wouldn't wait on us and made a waitress finish out his service. ", "She didn't know what we ordered even though it was written on our check. "], "author": "Ty M.", "review": "I'm not a fan of rude waiters.\n\nWe ordered the cripsy pork with thai iced tea. The iced tea didn't come and I had to remind the 'waiter with an attitude'  that we ordered it. He glared at me and rolled his eyes. You're kidding right? Ok, hey, if you don't want a tip, go ahead and act like an ass. \n\nWe ordered the crispy pork and were charged $8.25 for a small plate of crispy pork and another $1.25 for rice. When I asked why the rice wasn't included I couldn't get an answer. The 'waiter with an attitude' wouldn't wait on us and made a waitress finish out his service. She didn't know what we ordered even though it was written on our check. (I couldn't read it)\n\nThe cripsy pork was 30% pork, 20% crispy and 50% grease. I could have lubed my car with what was left on my plate. \n\nThis passes for food and service? \nNever again.", "rating": 1, "date": "2009-05-10"}], "thai house steak": [], "krung pao beef": [{"excerpts": ["Pad Thai, Krung Pao Beef, & Yellow Curry Chicken are our go-tos & the versions served here, though not exceptional, are solid enough to be on our rotation. "], "author": "Fancypants X.", "review": "3.75 round up \n\nThai actually isn't my favorite Asian cuisine (put a Vietnamese menu in my hands & I'm a happy diner), but for us, Thai is easy & familiar & we agree on same three or four dishes. \n\nThai House Express is located at the end of the last commercial block on Castro before it turns into a long stretch of mostly residences. \n\nI like the vibe here, it's comfortable, the wait staff is kind & jovial, but leave you to your food after you've ordered. \n\nPad Thai, Krung Pao Beef, & Yellow Curry Chicken are our go-tos & the versions served here, though not exceptional, are solid enough to be on our rotation. I'll order Jasmine rice instead of sticky rice next time; my rice was so hard 15 minutes into dinner that it was impossible to eat even when moistened with curry or Krung Pao sauce. Do get the sweet & delicious Mint Lemonade. Everything on the menu is reasonably priced; most items are under $14.", "rating": 4, "date": "2017-07-02"}], "sauteed beef with chinese broccoli": [], "yellow curry with chicken": [{"excerpts": ["My favorite is the pad thai and yellow curry with chicken. ", "I usually don't really like chicken in my curries because I find the chicken to be hard and overcooked, but here the chicken is super soft because they actually cook it in the curry. ", "The other noodle dishes are also good, but I always end up getting the pad thai because it's a safe go to."], "author": "Steph V.", "review": "This is great go-to in the Castro. My friends and I get takeout a lot from here because it's close by, and the food is good (albeit not that consistent all the time). Sometimes the food is spicier than other days and/or is a little off, but it's still really good! My favorite is the pad thai and yellow curry with chicken. I usually don't really like chicken in my curries because I find the chicken to be hard and overcooked, but here the chicken is super soft because they actually cook it in the curry. The other noodle dishes are also good, but I always end up getting the pad thai because it's a safe go to.", "rating": 4, "date": "2017-05-25"}, {"excerpts": ["I'm into the ga prow and the yellow curry with chicken. ", "Attentive service every time I've eaten here. ", "Reliably tasty. ", "I'm happy it's so close by."], "author": "Kent L.", "review": "My neighborhood Thai joint. I'm into the ga prow and the yellow curry with chicken. Attentive service every time I've eaten here. Reliably tasty. I'm happy it's so close by.", "rating": 4, "date": "2014-02-08"}], "green curry": [{"excerpts": ["I also love their green curry, it's just so flavorful. ", "I usually have take out but the family that works there is always so nice and the people are quick."], "author": "Crystal M.", "review": "I live in the Castro and this is my favorite favorite Thai place in San Francisco. I always order the tom yum noodle soup, but have tried all of their soups and they excel in it! Their spicy is very spicy and sometimes intolerable(still love it!), depending on my day I choose very wisely, but hot is always a good bet. I also love their green curry, it's just so flavorful. I usually have take out but the family that works there is always so nice and the people are quick.", "rating": 5, "date": "2017-06-17"}, {"excerpts": ["And the green curry chicken was inedible.  ", "NEVER order from this place."], "author": "Jason F.", "review": "Ordered through grub hub.  Absolutely the worst delivery food ever.  The rice was a gelatinous glob wrapped in plastic wrap.  The beef smelled like soured meat and tasted spoiled.  And the green curry chicken was inedible.  NEVER order from this place.", "rating": 1, "date": "2017-06-21"}, {"excerpts": ["Have had pad thai, spring rolls, crisp noodle and green curry dishes."], "author": "Mark K.", "review": "Been here a few times now, good Thai food.\nThey know what they are doing and do it well\nHave had pad thai, spring rolls, crisp noodle and green curry dishes.", "rating": 5, "date": "2016-11-27"}, {"excerpts": ["Got the green curry it was super rich and the perfect level of spice. ", "Came alone and the staff was super friendly making me feel at home."], "author": "James S.", "review": "Good food good people. Quick and filling. Got the green curry it was super rich and the perfect level of spice. Came alone and the staff was super friendly making me feel at home.", "rating": 5, "date": "2016-08-20"}, {"excerpts": ["I tried the money bags (very fun presentation) and the green curry rice dish. "], "author": "Andrew H.", "review": "This is the best place for Thai in the Castro, and yes I've tried the others.\n\nI tried the money bags (very fun presentation) and the green curry rice dish. Both were delicious and filling. \n\nThe restaurant itself is somewhat trendy but still very casual and friendly. I look forward to some more meals there.", "rating": 4, "date": "2014-06-15"}, {"excerpts": ["I got the green curry rice plate with chicken and it was honestly enough to be satisfied but the portions were small. ", "The curry was warm and had a lot of fillings, but it tasted just like coconut milk and tom yum soup base. ", "It was good, but a little salty for me. ", "I wish it were spicier than it actually was, given it's \"1 chili\" rating. ", "Not a bad experience for a first visit, but the dim lights, the rainy day, and the salty food were big factors of the three star rating that I gave Thai Express."], "author": "Alex T.", "review": "Pros: accepts credit, fast service\nCons: $$ food, small portions\n\nNo one was in the restaurant when my friend and I came in around 1:00pm (probably due to the rainstorm). We were seated right away and the waitress gave us our menus and brought out waters. After our orders were taken, our food came out 5-10 minutes later. My friend got Tom Yum Kha?, and it looked like milky soup with toppings. I got the green curry rice plate with chicken and it was honestly enough to be satisfied but the portions were small. The curry was warm and had a lot of fillings, but it tasted just like coconut milk and tom yum soup base. It was good, but a little salty for me. I wish it were spicier than it actually was, given it's \"1 chili\" rating. Not a bad experience for a first visit, but the dim lights, the rainy day, and the salty food were big factors of the three star rating that I gave Thai Express.", "rating": 3, "date": "2014-12-11"}, {"excerpts": ["I had the green curry I had gotten there many times, but perhaps not for 9 months.  ", "Somethings changed - the chef and/or attempts at cost savings? ", "The manager saying there have been no changes was absurd;hence ", "I'm writing. ", "1 star might be unfair, but I used to love this place."], "author": "Rich S.", "review": "This rest. has really gone downhill. I could see from seeing plates served before getting my dish. The quality was not as good, while the overall portion and especially ratio of meat, were greatly reduced. I had the green curry I had gotten there many times, but perhaps not for 9 months.  Somethings changed - the chef and/or attempts at cost savings? The manager saying there have been no changes was absurd;hence I'm writing. 1 star might be unfair, but I used to love this place.", "rating": 1, "date": "2016-07-24"}, {"excerpts": ["My friend and I had the chicken pad tai and green curry pork.  \n", "To anyone who hasn't had a good experience, give them a another try."], "author": "Jose R.", "review": "First visit here and very pleased.  \nWe were greeted and sat promptly with menus.  The food we ordered was delivered in a timely manner and all of it was delicious.  Started with the coconut chicken soup - had a touch of lime which made it even better.  My friend and I had the chicken pad tai and green curry pork.  \nTo anyone who hasn't had a good experience, give them a another try.", "rating": 5, "date": "2011-11-13"}, {"excerpts": ["Had green curry with chicken, the crispy noodles with gravy, and the moneybags with cucumber salad. ", "The cucumber salad was my favorite thing."], "author": "Daniel A.", "review": "Disappointing.  Had green curry with chicken, the crispy noodles with gravy, and the moneybags with cucumber salad. The cucumber salad was my favorite thing.", "rating": 2, "date": "2014-04-12"}, {"excerpts": ["- Beef Green Curry - Very good green curry. ", "At the end, we had some sauce and some rice left, so I dumped the rice in the sauce and finished it all!\n"], "author": "Angel C.", "review": "Came here after watching Alton Brown at the Castro Theater (which was an amazing show!). This is some of the better Thai food I've had.\n\n- Fish Cakes (Tod Mun) - These were ok. I've had better. They lacked in flavor a little, but the consistency was just right - a little spongy (in a good way!).\n- Basil Chicken (Ga-Prow) - How do they make ground chicken taste so good!? I normally find ground chicken to be pretty gross (well, more like tasteless), but the flavor of this dish blew my mind. Strong basil influence, a little spicy, and an umami sauce. Definitely try this dish, which also comes with beef or pork.\n- Beef Green Curry - Very good green curry. At the end, we had some sauce and some rice left, so I dumped the rice in the sauce and finished it all!\n- Seafood with Spicy Basil - This dish was good, but not too memorable. If you like seafood, I would recommend it.\n- Taro Balls in Creamy Coconut (Bua Loi) - Little pillow-y taro pieces of heaven. A consistency somewhere between mochi and gnocchi, but with taro! And you can't go wrong with coconut milk. Delicious!!\n\nI was deciding whether to give this place 4 or 5 stars, but the Basil Chicken and the Taro dessert made me bump it up to 5.", "rating": 5, "date": "2012-11-07"}, {"excerpts": ["I devoured my pumpkin curry with chicken as my friends inhaled their chicken with cashews and green curry with tofu. ", "I can vouch for their dishes too- ", "everything was delish & cheap!"], "author": "Chrissy L.", "review": "I Love Love LOVE pumpkin curry and it was fabulous at Thai House Express! \n\nThis place was hoppin for a Sunday night and as a group of 3, we were seated promptly. I devoured my pumpkin curry with chicken as my friends inhaled their chicken with cashews and green curry with tofu. I can vouch for their dishes too- everything was delish & cheap!", "rating": 4, "date": "2009-10-27"}, {"excerpts": ["I was really hungry and got the Green Curry and the portion was a little bit too small for me ", "so I ordered a second plate, this time Pad Thai, and it was awesome ", "and I was super full."], "author": "Joel G.", "review": "Good Thai Food.  I was really hungry and got the Green Curry and the portion was a little bit too small for me so I ordered a second plate, this time Pad Thai, and it was awesome and I was super full.", "rating": 4, "date": "2011-12-20"}, {"excerpts": ["Gang Khew - Wan - the green curry, with tofu. "], "author": "Greg Q.", "review": "Thai House Express is our go-to spot for Thai when we need takeout. We used to dine in there all the time, but haven't been back since our son was born. The service is always fantastic, orders are ready in 10 minutes from our call. Portions are huge: we get three dishes & rice, and have enough for two or more meals for our family of three.\n\nStaples from their menu in our household: \n\nGai Ga Prow - the minced chicken. Everyone in our house loves this dish, including our 2.5 year old son.\n\nGang Khew - Wan - the green curry, with tofu. Crisp veggies, tasty curry.\n\nGang Panang Nuer - red curry & beef. Beef that is soft, and delicious.\n\nWe used to get their Pad Thai, and burned out on it. Either it got worse, or we simply got over it. We eat Thai House Express at least once every three weeks for the past three years, and have yet to have a bad experience with them.", "rating": 4, "date": "2007-11-02"}, {"excerpts": ["Green curry \n- Pad Kee Mao\n", "- Tom Kha Gai\n- Kao Pad Pak\n - ", "Pad See "], "author": "Maria C.", "review": "This is the only Thai place I've found in SF where I have an mmm-mmmm experience every time.  Everywhere else I've been in the city for Thai seems to be missing something - I'm not sure if it is a fear of fish sauce...it is probably something I probably just shouldn't ask too many questions about and just shut up and be grateful that I've found a place that takes care of my craving and not think too hard about it...\n\nFavorites here: \n - Chicken Satay\n- Green curry \n- Pad Kee Mao\n- Tom Kha Gai\n- Kao Pad Pak\n - Pad See Ew\n- Pumpkin Curry\n\nThis is the place when we are tired, want something good to eat and don't feel like cooking that we look at each other and simultaneously suggest and know that we're both interested...", "rating": 4, "date": "2009-03-16"}, {"excerpts": ["The green curry with tofu was very good.  ", "I asked the server to make it spicy and my dish actually had some heat!  ", "The pad thai was pretty standard.  "], "author": "Megan D.", "review": "I got lunch here one day while I was in the city and shared two meals with my friend.  The green curry with tofu was very good.  I asked the server to make it spicy and my dish actually had some heat!  The pad thai was pretty standard.  Good thai iced tea too. \n\nThe place has a clean, contemporary design and was a nice little place to grab lunch.", "rating": 4, "date": "2011-09-15"}, {"excerpts": ["My date ordered the green curry, spicy: she was in a mood to damage her tastebuds.\n\n", "Turns out, the green curry was milder. "], "author": "Zak N.", "review": "Ate here last night. It was technically a date, though I think we're quickly becoming just friends. Which is actually very nice.\n\nI got here before my date did, and had the pleasure of choosing between the table by the door (drafty, cold) or the table by the kitchen (clanging, bright). I chose the latter; at least it was a large booth.\n\nThe food was whelming. Not under- or over-; just whelming. They asked me how spicy I wanted my Cru Plaid Poo (or whatever the noodles with crab meat was called): I always take the middle ground on a first try, so I asked for the middle ground. My date ordered the green curry, spicy: she was in a mood to damage her tastebuds.\n\nTurns out, my dish had a creeping bite that made me break a sweat (OK, granted, not hard to do; I love spicy foods, but in truth I'm physically a spice-wuss). Turns out, the green curry was milder. We shared.\n\nThe rest was fairly standard Thai restuarant experience. The food was good. Nothing to write home about (I'm only writing this review because (a) the place is fresh in my memory, (b) I needed to write more reviews, (c) I wanted to demonstrate that I have a social life and go on real dates, and (d) I wanted to subtly hint that I am looking for new friends who will go to new restaurants with me).", "rating": 3, "date": "2007-03-01"}, {"excerpts": ["My partner loves the green curry chicken (xtra spicy) with steamed brown rice. "], "author": "Johnny G.", "review": "we get to go food here at least once, sometimes twice per week. They know us by name and what we usually order. It's consistently delicous, fairly priced and the take good care of us.\n\nMy partner loves the green curry chicken (xtra spicy) with steamed brown rice. I enjoy the corn cake appetizer, the yellow mustardy chicken curry on egg noodles with red onion and a type of thai pickles...delicious.\n\nMy favorite dish there is their Pumpkin Chicken Curry. To die for.! Seriously over the top delicious....\n\nThanks for taking such good care of us guys. Steve and Johnny", "rating": 5, "date": "2010-03-08"}, {"excerpts": ["the Chicken Green Curry is out of this world!!! "], "author": "Harry K.", "review": "I am from Sacramento and moved into San Francisco last year.  Friends of our Family own many Thai restaurants in Sacramento and they put out some pretty amazing food.  After browsing men at the local bars and a few rounds of Pear 7's a few friends reccomended eating at Thai House.  The food was amazing (BETTER THAN MY DAD'S FRIENDS RESTAURANT) hopefully he doesn't read this review, he will kill me :) haha the Chicken Green Curry is out of this world!!! the Moo Tawt is excellent.  \n\nThai House needs to work on their NOODLE dishes :)  other than that the food is amazing.", "rating": 4, "date": "2008-10-18"}, {"excerpts": ["Admittedly, we only got take out, but the size of the green curry tub (the a la carte option) must have been a full quart!  ", "Really quite absurd for only $9.  ", "$20 total got 2 people at least 2 LARGE meals.\n", "My flavor issue?  ", "Mostly with the green curry - it was fine, but didn't have the depth or richness of flavor that I've come to appreciate in truly amazing green curry.  ", "Nice amount of spice though."], "author": "Don H.", "review": "3 stars for flavor, 5 stars for value = 4 star average.\nAdmittedly, we only got take out, but the size of the green curry tub (the a la carte option) must have been a full quart!  Really quite absurd for only $9.  $20 total got 2 people at least 2 LARGE meals.\nMy flavor issue?  Mostly with the green curry - it was fine, but didn't have the depth or richness of flavor that I've come to appreciate in truly amazing green curry.  Nice amount of spice though.", "rating": 4, "date": "2006-06-21"}, {"excerpts": ["My friend had chicken green curry, which was also very tasty, and my other friend had duck, which he liked although i didn't try it (don't like duck).  ", "Our thai iced tea was good too.  ", "I had to wait so long for my tofu green curry that my friends were done before I got mine! ", "Bad service! "], "author": "Merredith L.", "review": "I went to thai house for a late lunch the other day...  i hadn't had thai in a bit (well not long for other people but long for me) so i was excited.  I had a tofu red curry dish that was so good!  The rice that came with it was delicious, i wish i had had enough apetite to eat it all.  My friend had chicken green curry, which was also very tasty, and my other friend had duck, which he liked although i didn't try it (don't like duck).  Our thai iced tea was good too.  There was a mango sticky rice dessert advertised all over which i really wanted to try (it sounded so good my friend was obsessing over it the day after) but will have to wait till i have more room in my tummy!\nthe decor was more restauranty looking than more authentic thai places, but it wasnt really more expensive.  i would go there again, although i still want to try more different ones first.\n\nPS - I did go there again!  I had to wait so long for my tofu green curry that my friends were done before I got mine! Bad service! The pineapple fried rice dish my friend ate had no meat or veggies in it as advertised, but the shrimp tomato pineapple dish my other friend had was good.  As was the hidden shrimp appetizer...", "rating": 3, "date": "2006-09-01"}, {"excerpts": ["My tofu green curry at ~$8.50'ish was average, but they did have the wide rice noodles which are a personal favorite. ", "Hey, Thai House, if you dip noodles into boiling water for just a sec or two, they will separate AND heat up. "], "author": "Miel H.", "review": "I found the indifference of the wait staff amusing, it was in a way, very like Kao San Road, Bangkok. Believe you me, certainly not a standard for Thai food by any measure, but for service? Bemused ignoring peppered with a 'busy' after taste.\n\nThe food however stands up. I ordered a Green Papaya Salad bc I have to. It is the way I know, is it Thai? Happily, although the papaya was not macerated with the lime marinade, but rather bathed in it, it had a good range of spice and fish. \n\nMy tofu green curry at ~$8.50'ish was average, but they did have the wide rice noodles which are a personal favorite. Hey, Thai House, if you dip noodles into boiling water for just a sec or two, they will separate AND heat up. Just you know, a hint I saw on the streets of Thailand. \n\nMy dining companion ordered rice and veggies and it was a nice assortment of veggies although the brown 'sauce' was dangerously close to the ubiquitous 'brown sauce de Chinese'. So, I can't rave.\n\nThe Thai Iced Teas were creamy but not tangy, sort of weak tea, but I enjoyed it all the same. \n\nI would go back, it was reasonably priced and tasty enough. I can see if I lived nearby how it might become a standard, but that would be bc of proximity and not for outrageous, authentic flavor.", "rating": 4, "date": "2009-01-28"}, {"excerpts": ["The green curry chicken, panang beef curry, those deep fried pouches of minced chicken...sooo good!\n\n"], "author": "Mike C.", "review": "I'm so addicted to this place!  Seriously, when I want Thai food this is one of two place I go to and have no desire to try anywhere else.  The green curry chicken, panang beef curry, those deep fried pouches of minced chicken...sooo good!\n\nThe only thing which stopped the 5 star rating was their customer service.  When they get busy the service can be painful (rude, slow and lacking).\n\nAs with all restaurants, I typically check the health department's website to see the food score on the restaurant.  You might want to check this one...they had some issues in the past.", "rating": 4, "date": "2007-05-24"}, {"excerpts": ["Recently, I had the salmon wrapped in banana leaves, chicken green curry, pad thai, and pork with cabbage.  "], "author": "Carol L.", "review": "A solid, neighborhood Thai place! \n\nRecently, I had the salmon wrapped in banana leaves, chicken green curry, pad thai, and pork with cabbage.  All of it was very good, except for the pork dish.  \n\nDishes are served as either individual \"rice plates\" or \"a la carte\" to share.\n\nEnjoy :)", "rating": 3, "date": "2008-12-25"}, {"excerpts": ["The Red Curry Beef is a favourite of mine, the Green Curry is upwardly mobile and Pad Thai lovers will not be disappointed! ", "Face the facts people - you need to eat there."], "author": "Chris K.", "review": "Insanely-great Thai. Best Thai I've had anywhere in the Bay Area and the prices are good too. The Red Curry Beef is a favourite of mine, the Green Curry is upwardly mobile and Pad Thai lovers will not be disappointed! Face the facts people - you need to eat there.", "rating": 5, "date": "2006-02-08"}, {"excerpts": ["I recently had a green curry there ", "and it was addictive.  ", "Definitely one of the better Thai places in Castro."], "author": "Philip D.", "review": "I've been coming here often for the past few years.  My experiences here are varied.  For the most part, the food and vibe are great.  It's a cute and fairly modern Thai restaurant in the heart of Castro.  It is often crowded and has a lively atmosphere.  That can also be a negative as sometimes the service SUCKS!  But even with that, I still keep coming back because it's fun and the food is always really good.  I recently had a green curry there and it was addictive.  Definitely one of the better Thai places in Castro.", "rating": 4, "date": "2009-09-14"}, {"excerpts": ["I had the crispy tofu and green beans with chilli sauce and my friend had the green curry veggies.  ", "Both were really good.  ", "I would def come back."], "author": "Julia H.", "review": "Just when I think I know all the great Thai restaurants in the City.  I was proved wrong.  The papaya salad is very delish and they made it spicy when I asked for it.    I had the crispy tofu and green beans with chilli sauce and my friend had the green curry veggies.  Both were really good.  I would def come back.", "rating": 4, "date": "2006-09-28"}, {"excerpts": ["Their Pad See Ew is incredible, and their green curry might be the best I've had.  ", "Try the Larb, too.  "], "author": "Sheila W.", "review": "Amazing, amazing, amazing.  One of the best, if not THE best, Thai restaurants in the city.  Whether you're strictly Pad Thai or experimental, you can't go wrong.  Their Pad See Ew is incredible, and their green curry might be the best I've had.  Try the Larb, too.  And don't forget to get Sticky Rice for dessert...oh, now I'm hungry,", "rating": 5, "date": "2005-11-08"}, {"excerpts": ["The pad thai is delicious if a little dry, but the green curry is fantastic, as are the spring rolls.  ", "Excellent, easy, and nice.  ", "Great combination of things."], "author": "Nate R.", "review": "This place is dangerous.  Fast, delicious, reasonable prices, and 10 seconds from my apartment, it's hard to go anywhere else.  The pad thai is delicious if a little dry, but the green curry is fantastic, as are the spring rolls.  Excellent, easy, and nice.  Great combination of things.", "rating": 4, "date": "2008-11-20"}, {"excerpts": ["Lots of things were tasty... chicken with vegetables in green curry sauce, deep-fried tofu, seafood salad, and my new-found favourite, traditional peanutty-flavoured pad thai.  "], "author": "Canadian A.", "review": "This was my first Thai food experience, and it was a good one.  Lots of things were tasty... chicken with vegetables in green curry sauce, deep-fried tofu, seafood salad, and my new-found favourite, traditional peanutty-flavoured pad thai.  The sweet-and-sour cucumber salad and sticky rice sides were also a nice complement.  As for the atmosphere, the place was decorated in a simple, modern style, and you can't beat a walk along Castro Street after your meal, the neighbourhood has such a personality!  Only word of advice: we ordered the foursome and sate appetizers, and were disappointed at the tiny amount of food they were for their $8 price tag.  Just order entrees straight away; for the same price range, you get a much larger amount of food.", "rating": 5, "date": "2006-04-20"}, {"excerpts": ["the green curry chicken and pad thai are the go to dishes...", "the cucumber salad is great, too.  "], "author": "Chris G.", "review": "i went a few years without eating thai...then i moved near the speediest little thai house this side of the pacific.  the green curry chicken and pad thai are the go to dishes...the cucumber salad is great, too.  make sure you go with the brown rice for that healthy finish.\n\nbtw, the thai iced tea is delicious!", "rating": 5, "date": "2007-12-24"}], "red curry": [{"excerpts": ["But my friend and I didn't like the red curry very much because we usually don't like one of them inside. \n", "The four stars are for the fired rice."], "author": "Yantong Z.", "review": "The design inside is different from the other Thai restaurants. Really simple and comfortable.\nThe fired rice was really good! The fired dumplings? were just okay. The chicken wings were good! But my friend and I didn't like the red curry very much because we usually don't like one of them inside. \nThe four stars are for the fired rice.", "rating": 4, "date": "2018-01-29"}, {"excerpts": ["Lol I love red curry ", "and it was good. ", "Tom Kah Gai soup is good... ", "Fresh and coco-nutty!"], "author": "L. M.", "review": "Nice vibe. Good food & good service. Lunch special trays too small, stressed out eating on them. Lol I love red curry and it was good. Tom Kah Gai soup is good... Fresh and coco-nutty!", "rating": 4, "date": "2016-07-17"}, {"excerpts": ["The Pineapple Shrimp Red Curry though is amazing, delicious combination of sweet and savory (with a touch of spice, of course). \n\n"], "author": "Reese W.", "review": "Really stellar Thai food, some of the best I've ever had! Everything I've tried here has been quite tasty. The Pineapple Shrimp Red Curry though is amazing, delicious combination of sweet and savory (with a touch of spice, of course). \n\nTheir lunch specials are especially awesome if you're there at the right time. You can get an entree alongside soup and an appetizer for around $11 (quite good for a full meal of Thai food!)", "rating": 5, "date": "2016-08-13"}, {"excerpts": ["Its too expensive and tonight I ordered red curry medium spicy ", "and It is so hot its inedible.  ", "I am starving and looking at a plate of food that is no fun to eat at all.  ", "Don't get me wrong, I like spicy.  ", "This is super mouth rapingly hot.  ", "So ya.  ", "I will try to remember to not go back for another 6 months."], "author": "J D.", "review": "I live very close to this restaurant and I rarely go there and now I remember why.  Its too expensive and tonight I ordered red curry medium spicy and It is so hot its inedible.  I am starving and looking at a plate of food that is no fun to eat at all.  Don't get me wrong, I like spicy.  This is super mouth rapingly hot.  So ya.  I will try to remember to not go back for another 6 months.", "rating": 2, "date": "2016-06-13"}, {"excerpts": ["Tonight I had the red curry with chicken, which was yummy. ", "Also tried one of my friend's fried chicken, which was delicious."], "author": "Kenson K.", "review": "I've been here so many times, I can't believe I didn't write a review.\n\nThe food here is always good. Flavorful. I like it. It's all the way at the top of the Castro. Tonight I had the red curry with chicken, which was yummy. Also tried one of my friend's fried chicken, which was delicious.", "rating": 3, "date": "2014-03-10"}, {"excerpts": ["I ordered Pad Thai Chicken and Red Curry Chicken, and I have to say, that of all the Thai restaurants I've visited, this may be my favorite. ", "The Pad Thai is the best I've ever had. ", "Service was great, food was delicious, and if there's only one concern I would say is that the chicken portion with the Red Curry was a little small. ", "I seem to have gotten more bamboo shoots than protein. ", "Other than that, I would recommend this place."], "author": "Tim C.", "review": "My first visit to this place was around 2009, and when I visited San Francisco again in 2015, I was hoping to check it out again because of how great my experience was the first time.\n\nThe second visit was just as good. I ordered Pad Thai Chicken and Red Curry Chicken, and I have to say, that of all the Thai restaurants I've visited, this may be my favorite. The Pad Thai is the best I've ever had. There's just something about the flavors of the dish that makes it unique.\n\nService was great, food was delicious, and if there's only one concern I would say is that the chicken portion with the Red Curry was a little small. I seem to have gotten more bamboo shoots than protein. Other than that, I would recommend this place.", "rating": 4, "date": "2015-10-18"}, {"excerpts": ["I ended up ordering the salmon dish with vegetables and red curry sauce. ", "I asked the waiter if the fish was grilled. ", "He assured me that it was. ", "He also said that he'd put less sauce on the fish. ", "I was a little disappointed when the dish came out and the salmon had some sort of fried batter on it and the dish was swimming in the sauce. ", "I tried to remove the some of the batter off and eat it - but ", "I wasn't all that impressed with the actual quality of the salmon. ", "Since I was in a rush, I decided it was a sign that I was supposed to eat light, and I just stuck to the vegetables. ", "I have to admit that the red curry sauce was very flavorful (though to tell you the truth  - I've never had a Thai curry sauce that I didn't like) "], "author": "Jessica T.", "review": "I enjoyed the laid-back vibe of this place, which worked out well, in my attempt to catch up on some work here in the early evening - before yoga.  The staff were also quick to seat me, as well as to take my order. Unfortunately I was more impressed with the mellow atmosphere than with my dish.\n\nI ended up ordering the salmon dish with vegetables and red curry sauce. I asked the waiter if the fish was grilled. He assured me that it was. He also said that he'd put less sauce on the fish. I was a little disappointed when the dish came out and the salmon had some sort of fried batter on it and the dish was swimming in the sauce. I tried to remove the some of the batter off and eat it - but I wasn't all that impressed with the actual quality of the salmon. Since I was in a rush, I decided it was a sign that I was supposed to eat light, and I just stuck to the vegetables. I have to admit that the red curry sauce was very flavorful (though to tell you the truth  - I've never had a Thai curry sauce that I didn't like) The staff were prompt at bringing the bill, but they didn't seem too concerned that the main portion of my dish was primarily left untouched. \n\nJudging by the sauce in my dish, and seeing what other tables' ordered looked like - I am sure that Thai House Express has some superb dishes. I would just avoid their salmon dish if you're looking for a lighter fish dish - and if you do have any specific allergies or food requests - I would definitely make sure that you really emphasize the importance of it - to their staff.\n\nTrust.", "rating": 3, "date": "2012-04-12"}, {"excerpts": ["We had the Papaya Salad, Tom Yum Soup, Seafood Combination Red Curry and Tofu Eggplant.\n\n"], "author": "Earlene C.", "review": "We came because the wait at Anchor Oyster was at least an hour. \n\nService at Thai House was great, the food however was just alright. \n\nWe had the Papaya Salad, Tom Yum Soup, Seafood Combination Red Curry and Tofu Eggplant.\n\nThe Salad and Curry would be most enjoyable. The soup was super salty and the tofu in the eggplant had a weird taste I've never had before.", "rating": 3, "date": "2012-01-09"}, {"excerpts": ["#30 Tom Kah (coconut chicken soup), and #87 Panang (red curry beef) for $35 (plus tax and tip). ", "The soup was especially good with a careful balance of hot spice and mild coconut milk. ", "The beef was not as tender as I would have liked. ", "The corn cakes are a delight every time. ", "The waiter asked how spicy we'd like the dishes and the cook did a perfect job of adjusting the heat. ", "I mention this because it shows how much they care about the diverse customer base in the area."], "author": "Ted C.", "review": "The Thai House Express @ the Castro is a block south (19th Street) of the main shopping and club area, but well worth the extra steps. Last Saturday two of us shared a sumptuous meal of #10 Corn Cake (appetizers), #30 Tom Kah (coconut chicken soup), and #87 Panang (red curry beef) for $35 (plus tax and tip). The soup was especially good with a careful balance of hot spice and mild coconut milk. The beef was not as tender as I would have liked. The corn cakes are a delight every time. The waiter asked how spicy we'd like the dishes and the cook did a perfect job of adjusting the heat. I mention this because it shows how much they care about the diverse customer base in the area.", "rating": 4, "date": "2013-10-15"}, {"excerpts": ["Their pad thai and red curry dishes are my favorites. ", "Their veggie eggrolls and these little fried pouch things stuffed with chicken are good too. ", "Their only downfall is the slow service or lack thereof."], "author": "Fallon P.", "review": "The best place to get Thai food in the Castro. Their pad thai and red curry dishes are my favorites. Their veggie eggrolls and these little fried pouch things stuffed with chicken are good too. Their only downfall is the slow service or lack thereof.", "rating": 3, "date": "2010-05-31"}, {"excerpts": ["The red curry with shrimp and pineapple was flavorful, mild, and the shrimp were cooked well."], "author": "Chibi K.", "review": "I just popped into this place for takeout. The wait was under 10 minutes from ordering, and the dish I ordered was good and still hot when I made it home about 25 minutes later. The red curry with shrimp and pineapple was flavorful, mild, and the shrimp were cooked well.", "rating": 4, "date": "2014-02-11"}, {"excerpts": ["Not being one to pass up curry, I got the gang koor goong: shrimp in red curry, pineapples, tomatoes, and basil.  "], "author": "Becca S.", "review": "Having seen a movie at the Castro on a Friday night, I made the decision that I needed some tasty food in my belly to accompany the moving images still churning around in my head.  Someone suggested Thai food as it is both tasty and veggie-friendly, and so we made the minuscule mosey over to Thai House Express.\n\nThai House Express is a trendy looking place.  The decor is rather bare-bones, though the hip-looking people in their skinny-looking jeans and chunky-looking glasses tend to provide most of the visual stimulation.  And we had a lot of time to look around, as the wait for a table was surprisingly long.  We were given menus and were able to order ahead of time, which was nice.  But another group of the same size was seated first, even though they arrived after us, which was a little less nice.\n\nThe menu was extensive, and very vegetarian-friendly.  Pretty much anything can be made with tofu, and my friends ended up with piles of various vegetables on top of brown rice.  They looked (and, I'm told, were) super good.  We also got spring rolls and, perhaps to compensate for being so darn healthy, the corn cakes.  Not being one to pass up curry, I got the gang koor goong: shrimp in red curry, pineapples, tomatoes, and basil.  The spring rolls were deliciously average, the corn cake was deliciously fried (and a refreshing change of pace!), and the curry held its own quite well.  It was creamy with a little heat as I was anticipating, but I was a little disappointed by the amount of delightful chunky bits in my curry - it looked a bit more like soup, though it did taste excellent over the rice.\n\nThe service was really quite alright once we were seated, and I'm mostly content with the prices - Thai House Express could charge for ambiance if it wanted to, but they don't and I appreciate that very much.  If I'm in the Castro, I'll likely show up again and try some of the other dishes.  It's legit and it's tasty, but it's no reason to make a pilgrimage across the city.  Unless, of course, you just like taking pilgrimages.", "rating": 3, "date": "2011-02-13"}, {"excerpts": ["After several attempts from our server we finally decided on \"Something-something Basil with Chicken\", \"Blah blah Blah Red Curry with Beef\", and brown rice. ", "Did I get the Thai Iced Tea? ", "Of course I had the ice tea. ", "It is the only thing I anticipate from a Thai eatery! ", "The \"Something-something Basil\" was good. ", "But Oh that \"Blah blah Blah Red Curry!", "\" ", "It was amazing ", "and I hate curry! ", "I had to stop myself from picking up the dish and drinking the sauce directly from the bowl. ", "Although I did pour the sauce all over my \"Something-something Basil\" which turned into a lovely combo in my mouth. \n", "I'll consider myself a fan of  THX especially when it comes to \"Blah blah Blah Red Curry\". ", "I mean, this stuff was really good and on top of that", ", my date ended well. \n", "I even got a little tongue action before heading to the Mission to meet the boys at the bar."], "author": "Tobias W.", "review": "I'm not a fan of Thai food. I don't like peanut oil, peanut sauce, coconut mixed or attached to any food, or curry. So when it comes to choosing a place to eat, Thai is never on my list.\n\nFortunate for me, 3 of the 5 most recent dinner dates have insisted on their favorite Thai restaurants. I know, I have the best luck. Last night was Thai House Express (THX) on Castro.\n\nSo I was standing on the corner of 19th & Castro waiting for my date to arrive and thinking of the nearest pizza slice, when a Yellow Cab arrived and the most amazing legs stepped out of the car and took my hand. I quickly went dumb and forgot everything I learned in fourth grade. The night chill had started to roll in so we retreated inside THX for warmth and food. We were seated immediately. I like that kind of service. \n\nThe decor was simple yet nice... the crowd was mostly men but not intimidating... and sitting across from me were a pair of beautiful blue eyes and a gorgeous smile... My overall impression, Warm and Safe.\n\nAfter several attempts from our server we finally decided on \"Something-something Basil with Chicken\", \"Blah blah Blah Red Curry with Beef\", and brown rice. Did I get the Thai Iced Tea? Of course I had the ice tea. It is the only thing I anticipate from a Thai eatery! I have a bit of a sweet tooth.\n\nOur food arrived in typical white bowls found in every contemporary Asian-Style restaurant. The presentation was great! I was all about it, even though I had to find my own chop sticks. The \"Something-something Basil\" was good. Through my recent Thai experiences, I've discovered the one Thai dish that won't make me vomit. \n\nBut Oh that \"Blah blah Blah Red Curry!\" It was amazing and I hate curry! I had to stop myself from picking up the dish and drinking the sauce directly from the bowl. Although I did pour the sauce all over my \"Something-something Basil\" which turned into a lovely combo in my mouth. \nI'll consider myself a fan of  THX especially when it comes to \"Blah blah Blah Red Curry\". I mean, this stuff was really good and on top of that, my date ended well. \nI even got a little tongue action before heading to the Mission to meet the boys at the bar.", "rating": 4, "date": "2009-07-01"}, {"excerpts": ["We don't usually have to look at the Menu because we already have our favorites picked out, which are the Sauteed Eggplant and Red Curry with Chicken.\n\n"], "author": "Shannon A.", "review": "My roommate and I eat at Thai House Express once every couple of weeks but if it were up to us, it would be much more often. We don't usually have to look at the Menu because we already have our favorites picked out, which are the Sauteed Eggplant and Red Curry with Chicken.\n\nThe seating and service is quick and the quality is great for this price range.  Its hard for me to eat at any other Thai place and not compare the price vs. quality to Thai House. \n\nnote: They have brown rice and its delicious!", "rating": 5, "date": "2009-02-20"}, {"excerpts": ["What you sacrifice in not being able to substitute (ie red curry is always beef), you gain in efficiency and TASTE.  ", "Having spent months in Thailand, this is certainly one of the most authentic restaurants in recent memory.  ", "The spicings are spot-on, the dishes well prepared and the staff nothing short of super friendly."], "author": "Aaron G.", "review": "I live a block away.  We have them on speed dial.  They say 15 minutes for takeout, they mean 10.\n\nThe food is great.  What you sacrifice in not being able to substitute (ie red curry is always beef), you gain in efficiency and TASTE.  Having spent months in Thailand, this is certainly one of the most authentic restaurants in recent memory.  The spicings are spot-on, the dishes well prepared and the staff nothing short of super friendly.", "rating": 4, "date": "2005-12-20"}, {"excerpts": ["I also ordered beef in a red curry sauce and it was bland bland bland.  \n\n"], "author": "Yelper H.", "review": "Horrific pad thai.  I picked some up last night 1/30/07 and was sooooooo dissappointed!  The pad thai looked and tasted like it was a day old.\n\nI also ordered beef in a red curry sauce and it was bland bland bland.  \n\nOnly thing good was the sticky rice.  \n\nMaybe cuz I am farang I got the bad stuff and thought I wouldn't notice???", "rating": 2, "date": "2007-01-31"}, {"excerpts": ["Gang Panang Nuer - red curry & beef. "], "author": "Greg Q.", "review": "Thai House Express is our go-to spot for Thai when we need takeout. We used to dine in there all the time, but haven't been back since our son was born. The service is always fantastic, orders are ready in 10 minutes from our call. Portions are huge: we get three dishes & rice, and have enough for two or more meals for our family of three.\n\nStaples from their menu in our household: \n\nGai Ga Prow - the minced chicken. Everyone in our house loves this dish, including our 2.5 year old son.\n\nGang Khew - Wan - the green curry, with tofu. Crisp veggies, tasty curry.\n\nGang Panang Nuer - red curry & beef. Beef that is soft, and delicious.\n\nWe used to get their Pad Thai, and burned out on it. Either it got worse, or we simply got over it. We eat Thai House Express at least once every three weeks for the past three years, and have yet to have a bad experience with them.", "rating": 4, "date": "2007-11-02"}, {"excerpts": ["I would have given it 4 stars but for the fact that the veggies in two of the dishes (string bean chicken and prawn red curry) were pretty much the same, string beans, expected in the first dish but thought there'd be something different in the second.   ", "The pad thai was very tasty and the dishes themselves were good, just too many string beans.  ", "Overall, definitely worth a try."], "author": "Andrew C.", "review": "I read many of the reviews for this place and it seemed that the biggest issue people had was the attitude of the staff as opposed to the food.  I needed to pick up some food to go and so gave this place a try.  I walked in, went to the counter and ordered.  The person who helped me was very nice and explained a couple of things I asked about.  No problem with the staff.  Got a smile and a laugh when I came back to pick up the food 20 minutes later.\n\nThe food itself was quite good.  I would have given it 4 stars but for the fact that the veggies in two of the dishes (string bean chicken and prawn red curry) were pretty much the same, string beans, expected in the first dish but thought there'd be something different in the second.   The pad thai was very tasty and the dishes themselves were good, just too many string beans.  Overall, definitely worth a try.", "rating": 3, "date": "2011-12-14"}, {"excerpts": ["I had a tofu red curry dish that was so good!  ", "The rice that came with it was delicious, i wish i had had enough apetite to eat it all.  "], "author": "Merredith L.", "review": "I went to thai house for a late lunch the other day...  i hadn't had thai in a bit (well not long for other people but long for me) so i was excited.  I had a tofu red curry dish that was so good!  The rice that came with it was delicious, i wish i had had enough apetite to eat it all.  My friend had chicken green curry, which was also very tasty, and my other friend had duck, which he liked although i didn't try it (don't like duck).  Our thai iced tea was good too.  There was a mango sticky rice dessert advertised all over which i really wanted to try (it sounded so good my friend was obsessing over it the day after) but will have to wait till i have more room in my tummy!\nthe decor was more restauranty looking than more authentic thai places, but it wasnt really more expensive.  i would go there again, although i still want to try more different ones first.\n\nPS - I did go there again!  I had to wait so long for my tofu green curry that my friends were done before I got mine! Bad service! The pineapple fried rice dish my friend ate had no meat or veggies in it as advertised, but the shrimp tomato pineapple dish my other friend had was good.  As was the hidden shrimp appetizer...", "rating": 3, "date": "2006-09-01"}, {"excerpts": ["My gang pak -- red curry with tofu and vegetables -- was very delicious and I scarfed down the whole thing. ", "It was also just mildly spicy, which I had requested from the helpful server.  "], "author": "Karen W.", "review": "Prompt, friendly service + fresh-tasting Thai + the Castro + family and friends = one fabulous summer evening. \n\nA family friend who lives in the neighborhood took us here last night, along with my aunt and my cousin. They promptly accomodated the five of us sans reservation and brought us water right away (big points from me on this small detail). \n\nThe atmosphere is very basic but pleasant, just don't go here for ambiance.  Our server was very efficient and nice. Beer was served with frosty mugs and the water kept coming -- key when contending with spicy food!  \n\nThe vegetarian menu section was much appreciated as were the notes about vegetarian items elsewhere on the menu, like apps and soups.  We shared the chive cakes, which were unique and quite tasty if a little bit mushy -- and the serving was very generous.  We also shared the fresh and perky cucumber salad with onion, with that unique slightly sweet Thai dressing. My gang pak -- red curry with tofu and vegetables -- was very delicious and I scarfed down the whole thing. It was also just mildly spicy, which I had requested from the helpful server.  I ordered the smaller \"over rice\" portion with brown rice, which was also generously served.  \n\nEveryone else seemed happy with their choices, as well -- definitely recommend it for Thai lovers and the Thai-curious (sorry, I couldn't resist...!).", "rating": 5, "date": "2006-08-31"}, {"excerpts": ["The Red Curry Beef is a favourite of mine, the Green Curry is upwardly mobile and Pad Thai lovers will not be disappointed! ", "Face the facts people - you need to eat there."], "author": "Chris K.", "review": "Insanely-great Thai. Best Thai I've had anywhere in the Bay Area and the prices are good too. The Red Curry Beef is a favourite of mine, the Green Curry is upwardly mobile and Pad Thai lovers will not be disappointed! Face the facts people - you need to eat there.", "rating": 5, "date": "2006-02-08"}, {"excerpts": ["We get the same thing every time - spring rolls, pad thai, and chicken red curry - and it's consistently good each and every time.   ", "And the service is good to boot!"], "author": "Julie P.", "review": "I really wish they delivered but after a gazillion years in the hood I just frickin realized that the Thai House Express on Larkin & Geary is the same as the one on 18th & Castro...and I'm not blonde.  Sooooo much closer to home and work means I will be going there a lot more often which is bad for my wallet and waistline but oh so exciting.  We get the same thing every time - spring rolls, pad thai, and chicken red curry - and it's consistently good each and every time.   And the service is good to boot!", "rating": 4, "date": "2009-09-05"}, {"excerpts": ["I look forward to trying all of my favorite dishes on subsequent visits, but for now, I can say with authority that the fried pouch appetizers, salmon with red curry sauce, pad see ew with chicken, and tofu with green beans were mighty tasty. ", "Yay!"], "author": "Tara M.", "review": "I've long been a fan of the Thai House restaurant on Market at Sanchez, and my first visit to this relatively new outpost pleased me greatly. The food and service are just as good as they are at the other location, and the ambience is even better. I look forward to trying all of my favorite dishes on subsequent visits, but for now, I can say with authority that the fried pouch appetizers, salmon with red curry sauce, pad see ew with chicken, and tofu with green beans were mighty tasty. Yay!", "rating": 4, "date": "2005-11-14"}], "panang curry": [{"excerpts": ["The flavors were so concentrated and just off... the panang curry flavor wasn't classic and the meat quality was not great. ", "Also overly greasy and overpriced. ", "I won't order again."], "author": "Piper W.", "review": "We eat Thai at least 3x a month and this was one of the least favorite in town so far. The flavors were so concentrated and just off... the panang curry flavor wasn't classic and the meat quality was not great. Also overly greasy and overpriced. I won't order again.", "rating": 3, "date": "2018-09-29"}, {"excerpts": ["My friend and I also ordered the Panang curry, which was really good actually, as was the jasmine rice. \n\n"], "author": "Ilana B.", "review": "I wanted to like this place more but it just wasn't all that great. I love pad thai and order it pretty frequently and i gotta say, this was just not very good pad thai. it definitely was not bad (I've also had bad pad thai), just not the best. They used angel hair pasta which was confusing to me...this made the dish kind of mushy and not very pad thai-like. My friend and I also ordered the Panang curry, which was really good actually, as was the jasmine rice. \n\nJust an OK meal. Not rushing back here anytime soon.", "rating": 3, "date": "2017-02-02"}, {"excerpts": ["The Panang curry was delicious. ", "I asked for hot and it was actually spicy enough (often places will only give mild or medium). ", "They just opened and the food was still fast and everyone was attentive."], "author": "Colin L.", "review": "The Panang curry was delicious. I asked for hot and it was actually spicy enough (often places will only give mild or medium). They just opened and the food was still fast and everyone was attentive.", "rating": 5, "date": "2016-03-14"}, {"excerpts": ["I had the Beef Panang Curry and it was actually pretty good - most spots in the Castro aren't great, but this is a decent option in the area.  "], "author": "Ken G.", "review": "I had the Beef Panang Curry and it was actually pretty good - most spots in the Castro aren't great, but this is a decent option in the area.  The portion size is good and the quality of the food is also good.\n\nThe service is friendly and attentive.", "rating": 3, "date": "2013-09-19"}, {"excerpts": ["Favorite dishes are panang curry and peanut sauce with vegetables. ", "There are multiple Thai restaurants nearby by this one is the best."], "author": "David T.", "review": "This is our go to Thai Restaurant. Great for takeout but also great for dining. Staff is courteous. Favorite dishes are panang curry and peanut sauce with vegetables. There are multiple Thai restaurants nearby by this one is the best.", "rating": 4, "date": "2015-11-19"}, {"excerpts": ["I particularly enjoy the fresh spring rolls, larb gai, beef panang curry, pad thai, and the fried whole fish with sweet sauce on their specials menu.  ", "The place can get busy during dinner, but they take to go orders.  ", "Yes!  "], "author": "Vicente G.", "review": "You gotta love a Thai restaurant where the hostess is named Tup Tim (like one of the wives in the King and I movie musical)!  I don't actually know if she still works there, but I know that was her name because she had a long chat with a friend of mine visiting from Thailand.  He confirmed that the food isn't authentic, but he really enjoyed the meal nonetheless.  It was the only place I took him to that he asked to go back to.  Now if that isn't a good recommendation for a Thai place, then I don't know what is!\n\nI've always enjoyed this place since it first opened (when the servers wore matching striped polos from American Eagle).  The food has been consistently outstanding, and they can make it as spicy as you want.  Not the lame American taste bud brand of spicy, but the rest of the world brand that makes the flavors dance in your mouth.  I particularly enjoy the fresh spring rolls, larb gai, beef panang curry, pad thai, and the fried whole fish with sweet sauce on their specials menu.  The place can get busy during dinner, but they take to go orders.  Yes!  The service can also be slow at times, but just be aggressive when flagging down your server.  \n\nNote:  My bf recently told me that the food was shockingly bad during his visit last week.  Bad enough for him to wonder if they've gotten new chefs or are under new management.  I hope this was just a fluke because there are not enough good Thai restaurants nearby.", "rating": 5, "date": "2007-03-21"}, {"excerpts": ["i also tried my friends' pad thai, pineapple fried rice, and panang curry, and gai ga prow, all delish!\n\n"], "author": "Pamela s.", "review": "3.5 stars.\n\nthe decor in this place is cute and modern. i had the tom yum noodle soup with what i thought i ordered was egg noodles, but the noodles looked different to me. you get a choice between flat rice noodles, egg noodles, and a sticky rice noddle, which i dunno what that is, but the lady said they were thin. nonetheless, still tasted good. i love thai flavors and spice, and this soup hit the spot! i also had spring rolls to start off with, but i think they called them garden rolls. the peanut dipping sauce was nothing special, a little on th sweet side for me, i think it needed a kick, some hot sauce of some sort. other than that, service was good. and i like their cups, with town/city names or thailand in traditional thai design with bright colors. i also tried my friends' pad thai, pineapple fried rice, and panang curry, and gai ga prow, all delish!\n\nafter this, we walked around and tried to digest our lovely meal. i just love strolling around castro area.", "rating": 3, "date": "2009-08-04"}, {"excerpts": ["All their curries are good....with exception to the Panang Curry w/ Beef. ", "It breaks my heart that this dish isn't (in my opinion) good. ", "I LOVE Panang Curry. ", "The Thai House Beef dish is mouth watering, and that spicy green dipping sauce with citrus and garlic will stick with you as a constant reminder of how good it was. ", "It's the best place for takeout, I just wish they would hop on board with online & app based ordering. ", "I can order my food, walk out the door and by the time I'm there ", "it's waiting for me."], "author": "Mike P.", "review": "I've eaten here more times than I can count. It's a good thing it is only 1.5 blocks away. The food here is really some great Thai. It's a rare event when I get something that's off, maybe salty, or maybe I shouldn't have tried to be so adventurous. Overall, the food is consistently great. The rice plates are enough for a satisfying meal, and are a great option at a great price for many of their dishes. If I'm feeling ravenous the entree + rice is satiating. The Money Bags appetizer is my favorite. All their curries are good....with exception to the Panang Curry w/ Beef. It breaks my heart that this dish isn't (in my opinion) good. I LOVE Panang Curry. The Thai House Beef dish is mouth watering, and that spicy green dipping sauce with citrus and garlic will stick with you as a constant reminder of how good it was. It's the best place for takeout, I just wish they would hop on board with online & app based ordering. I can order my food, walk out the door and by the time I'm there it's waiting for me.", "rating": 5, "date": "2012-04-15"}, {"excerpts": ["The beef seemed overcooked and dry, and the Panang curry was very oily. ", "I've been here in the past and remembered it being better... ", "but oh well, I was there late at night on a Sunday."], "author": "Ashley P.", "review": "Fast and friendly service, but I wasn't impressed with the food. The beef seemed overcooked and dry, and the Panang curry was very oily. I've been here in the past and remembered it being better... but oh well, I was there late at night on a Sunday.", "rating": 3, "date": "2010-03-07"}, {"excerpts": ["I keep returning for the Panang Curry as well.  ", "Some of the waiters are cute and sweet.  ", "It doesn't have the cozy ambiance of some places but it is fast and reasonably efficient with fair prices. ", "It is definitely on my list of regular places to eat."], "author": "Dan B.", "review": "This is my favorite Thai place in Castro.  We call it \"Thai on the Corner\" because we can't remember the name.  Prices are reasonable and some of the dishes delicious.  I especially like Pork Leg Stew over rice.  (It tastes better than it sounds).  I keep returning for the Panang Curry as well.  Some of the waiters are cute and sweet.  It doesn't have the cozy ambiance of some places but it is fast and reasonably efficient with fair prices. It is definitely on my list of regular places to eat.", "rating": 5, "date": "2009-04-24"}], "red curry with shrimp and pineapple": [{"excerpts": ["The red curry with shrimp and pineapple was flavorful, mild, and the shrimp were cooked well."], "author": "Chibi K.", "review": "I just popped into this place for takeout. The wait was under 10 minutes from ordering, and the dish I ordered was good and still hot when I made it home about 25 minutes later. The red curry with shrimp and pineapple was flavorful, mild, and the shrimp were cooked well.", "rating": 4, "date": "2014-02-11"}], "thai house fried rice": [], "pineapple fried rice": [{"excerpts": ["Better was the $9.95 Pineapple Fried Rice just because it was comfort food of the lowest order as it was mixed with eggs, cashews, raisins, onions, carrots and chicken (photo: http://bit.ly/1CT6gOl). ", "It was good ", "but so was ", "my dad's SPAM fried rice and he didn't charge me ten bucks for a heaping plate of it. "], "author": "Ed U.", "review": "It's been eight long years since Jamie W. and I have been to this popular Thai spot on the corner of Castro and 19th. In fact, I even referred to Jamie anonymously as \"my dining companion\" in that review, which shows you how long it's been. What may have caused the lengthy sabbatical was a piece of twine that he found in his dish. I was so nice back then that I still gave the proprietors four stars, even though I recounted the incident in painstaking detail. Nowadays I'm not so nice. I'm more interested in being fair which is why I felt a need to share our recent marginally disappointing experience.\n\nJamie was surprisingly the one who suggested our spontaneous return visit. Service felt rushed and indifferent the moment we arrived. We were seated near the window crowded between two tables for two, all four of whom were already quite settled into their meals. I tried to squeeze myself onto the banquette without incident, but it was a chore that only heightened the nervous energy of the server. Once settled in, we shared an appetizer, the $6.95 Corn Cakes which were OK but nothing more in flavor or texture with a dipping sauce of sorts made up of cucumber slices, ground peanuts and red onion (photo: http://bit.ly/1P1rMWf).\n\nWe then shared Jamie's favorite Thai dish, the $7.95 Pad Mee Kao (Drunken Noodles) with chicken, onions, carrots, chili, Chinese broccoli and basil, and I have to admit it was rather on the soupy side. No twine but no definable texture either, just a soppy affair that fell short of satisfying either of our palates (photo: http://bit.ly/1CA6b0E). Better was the $9.95 Pineapple Fried Rice just because it was comfort food of the lowest order as it was mixed with eggs, cashews, raisins, onions, carrots and chicken (photo: http://bit.ly/1CT6gOl). It was good but so was my dad's SPAM fried rice and he didn't charge me ten bucks for a heaping plate of it. There were no strings attached with this visit.\n\nFOOD - 3 stars...Thai food with little commitment for providing distinctive flavors\nAMBIANCE - 2.5 stars...crowding us in a corner didn't endear us to the surroundings\nSERVICE - 2 stars...quite hurried and below average when it came to being responsive\nTOTAL - 3 stars...close call but I'll leave it at three stars for a restaurant on a discernible decline", "rating": 3, "date": "2015-04-02"}, {"excerpts": ["Pineapple fried rice with beef was delicious! ", "Decor was nice and service was friendly and fast."], "author": "Laura T.", "review": "Pineapple fried rice with beef was delicious! Decor was nice and service was friendly and fast.", "rating": 5, "date": "2016-12-24"}, {"excerpts": ["First order of business, get the pineapple fried rice. "], "author": "Jacob D.", "review": "BooYah! This place is bomb. For real Thai food- get ready for some spicy lips bc this place knows how to make it hot! \n\nFirst order of business, get the pineapple fried rice. It's got all the right fixins and a whole lotta pineapple!\n\nThe pad Thai is also pretty tasty but so is everything else. You can't go wrong with this Thai spot. Happy eating!", "rating": 5, "date": "2016-08-29"}, {"excerpts": ["I ordered the pineapple fried rice, pad see ew, pad tai, and sticky rice.  ", "I will cut the point... ", "The food is overpriced and not worth it in my opinion. ", "I'm still burping the food and my stomach feels upset, I hope I don't get food poisoning or diarrhea. ", "This was a learning experience I'll leave it at that."], "author": "Ol Dirty B.", "review": "I ordered food from this restaurant through doordash. I ordered the pineapple fried rice, pad see ew, pad tai, and sticky rice.  I will cut the point... The food is overpriced and not worth it in my opinion. I'm still burping the food and my stomach feels upset, I hope I don't get food poisoning or diarrhea. This was a learning experience I'll leave it at that.", "rating": 1, "date": "2016-09-02"}, {"excerpts": ["My friends and I really love the Crispy Chicken, Corn Cakes, Sauteed String Beans, Pineapple Fried Rice, and Green Papaya Salad.\n\n"], "author": "Mike B.", "review": "Thai House Express is my favorite Thai in the city.  It's a regular go-to for take out.  My friends and I really love the Crispy Chicken, Corn Cakes, Sauteed String Beans, Pineapple Fried Rice, and Green Papaya Salad.\n\nThe service is quick and friendly.   Conveniently located at 19th and Castro, there's always something pleasing to eyes as well as the palate.", "rating": 5, "date": "2014-03-31"}, {"excerpts": ["Since this was our first time to Thai House, we stuck with the basics, Pad Thai and Pineapple Fried Rice and we were not disappointed.  \n\n"], "author": "Scott J.", "review": "My husband and I were in San Francisco and decided to head down to the Castro.  This was one of the few times that we didn't use Yelp to find a place to eat, but rather ask a friend what they might suggest.  First thing out of their mouth was Thai House on 19th and Castro.\n\nAs it turns out, our friends gave a great lead!  The restaurant is located on the corner and is easy to find.  Walked in and within 10 minutes of arriving, we had some delicious food on the table (which was a good thing, since it was past 2pm and neither of us had eaten yet!).  Since this was our first time to Thai House, we stuck with the basics, Pad Thai and Pineapple Fried Rice and we were not disappointed.  \n\nNext time we visit San Fran, I am sure we will be back and will now feel comfortable to explore the menu.  If a restaurant can deliver on the basics, then I have more confidence that they can live up to the standard on the rest of their menu!", "rating": 4, "date": "2012-05-18"}, {"excerpts": ["Our usual pineapple fried rice was not up to par. ", "It was all pineapple and raisins and barely any rice. ", "In the past we always got Chinese sausage as a substitute for the pork and tonight our waitress looked at us completely perplexed. ", "We got charged an extra $2.00 when it should come with a meat. "], "author": "Flo H.", "review": "Something bad happened to this place. New waitresses, unfamiliar faces.  Our usual pineapple fried rice was not up to par. It was all pineapple and raisins and barely any rice. In the past we always got Chinese sausage as a substitute for the pork and tonight our waitress looked at us completely perplexed. We got charged an extra $2.00 when it should come with a meat. The Beef noodle soup which I ordered to go had beef that was super tough.  Not sure if they did that on purpose because we inquired about the  sausage charge. Then they forgot to give us our leftovers. Seriously? \n\nI'm so disappointed, we asked if there was new management and they said no, but so many unfamiliar faces. And their customer service is so poor when confronted with a question about the bill. They would rather lose a customer who has dined there for years. Bizarre and just sad.", "rating": 1, "date": "2014-04-19"}, {"excerpts": ["Other than that, the pineapple fried rice was not good and lacked flavors, papaya salad and fried banana and ice cream was just okay"], "author": "Jenny N.", "review": "I swear to god i have never and probably never will have a better pad thai omfg. 5 stars literally only for this dish. Other than that, the pineapple fried rice was not good and lacked flavors, papaya salad and fried banana and ice cream was just okay", "rating": 5, "date": "2014-03-14"}, {"excerpts": ["Amazing dishes to order: pineapple fried rice, salmon in curry sauce, vegetarian pumpkin curry. "], "author": "Sandra And Mailee H.", "review": "We've eaten here on three occasions and have been blown away every time. Most recently we ate here with a group of friends and order 12 dishes, all which were amazing. \n\nThe customer service is hit or miss. Of the three visits, the customer service on was point most recently. \n\nAmazing dishes to order: pineapple fried rice, salmon in curry sauce, vegetarian pumpkin curry. These are my top three. \n\nThe food is so amazing, they might figure they don't need to stress customer service. The only thing holding me back from giving a 5 star is the customer service.\n\nand the prices are reasonable.", "rating": 4, "date": "2011-02-09"}, {"excerpts": ["Especially enjoyed the sautéed eggplant and pineapple fried rice tonight. ", "The food is pretty decent here overall. ", "Not the most personable wait staff, however. ", "I've come here a couple times for lunch to get food to go, and haven't been disappointed."], "author": "Len M.", "review": "Especially enjoyed the sautéed eggplant and pineapple fried rice tonight. The food is pretty decent here overall. Not the most personable wait staff, however. I've come here a couple times for lunch to get food to go, and haven't been disappointed.", "rating": 4, "date": "2012-02-08"}, {"excerpts": ["The pineapple fried rice dish my friend ate had no meat or veggies in it as advertised, but the shrimp tomato pineapple dish my other friend had was good.  ", "As was the hidden shrimp appetizer..."], "author": "Merredith L.", "review": "I went to thai house for a late lunch the other day...  i hadn't had thai in a bit (well not long for other people but long for me) so i was excited.  I had a tofu red curry dish that was so good!  The rice that came with it was delicious, i wish i had had enough apetite to eat it all.  My friend had chicken green curry, which was also very tasty, and my other friend had duck, which he liked although i didn't try it (don't like duck).  Our thai iced tea was good too.  There was a mango sticky rice dessert advertised all over which i really wanted to try (it sounded so good my friend was obsessing over it the day after) but will have to wait till i have more room in my tummy!\nthe decor was more restauranty looking than more authentic thai places, but it wasnt really more expensive.  i would go there again, although i still want to try more different ones first.\n\nPS - I did go there again!  I had to wait so long for my tofu green curry that my friends were done before I got mine! Bad service! The pineapple fried rice dish my friend ate had no meat or veggies in it as advertised, but the shrimp tomato pineapple dish my other friend had was good.  As was the hidden shrimp appetizer...", "rating": 3, "date": "2006-09-01"}, {"excerpts": ["When I'm there I usually have pineapple fried rice or pad thai with veggies but lately I've been trying some of the spicy stuff.  ", "You get plenty of food at very reasonable prices, what more do you want?"], "author": "Eric v.", "review": "For the price, location and quality this is a great place.  The waiters are nice and you get your food quickly.  When I'm there I usually have pineapple fried rice or pad thai with veggies but lately I've been trying some of the spicy stuff.  You get plenty of food at very reasonable prices, what more do you want?", "rating": 5, "date": "2009-10-13"}, {"excerpts": ["i also tried my friends' pad thai, pineapple fried rice, and panang curry, and gai ga prow, all delish!\n\n"], "author": "Pamela s.", "review": "3.5 stars.\n\nthe decor in this place is cute and modern. i had the tom yum noodle soup with what i thought i ordered was egg noodles, but the noodles looked different to me. you get a choice between flat rice noodles, egg noodles, and a sticky rice noddle, which i dunno what that is, but the lady said they were thin. nonetheless, still tasted good. i love thai flavors and spice, and this soup hit the spot! i also had spring rolls to start off with, but i think they called them garden rolls. the peanut dipping sauce was nothing special, a little on th sweet side for me, i think it needed a kick, some hot sauce of some sort. other than that, service was good. and i like their cups, with town/city names or thailand in traditional thai design with bright colors. i also tried my friends' pad thai, pineapple fried rice, and panang curry, and gai ga prow, all delish!\n\nafter this, we walked around and tried to digest our lovely meal. i just love strolling around castro area.", "rating": 3, "date": "2009-08-04"}, {"excerpts": ["The pineapple fried rice is addictive, and you should definitely check out the specials. ", "Nice atmosphere for eating in, though gets crowded on weekend nights (and sometimes during the week, especially if there are events in the castro)."], "author": "Carrie G.", "review": "This is my thai takeout of choice: fast, consistent, fresh, and yummy. This is not a mystery meat kind of place... even things that you might look skeptically at such as the \"naked ladies\" = raw shrimp salad, are quite good and not sketchy at all. The pineapple fried rice is addictive, and you should definitely check out the specials. Nice atmosphere for eating in, though gets crowded on weekend nights (and sometimes during the week, especially if there are events in the castro).", "rating": 4, "date": "2008-08-06"}, {"excerpts": ["their pineapple fried rice is mediocre and doesn't automatically come with shrimp as well as the meat of your choice.  ", "the shrimp should be a staple.  ", "plus, they don't use golden raisins in the recipe.  ", "brown raisins are mediocre by comparison.\n", "2. ", "palm juice is on the menu, but very rarely in supply.  ", "my advice is that they should remove it from the menu so that i don't go in there and get my hopes up only to have them dashed to smithereens.\n", "3. "], "author": "Lex E.", "review": "according to my three criteria thai food analysis, this place only get's 3 stars becase:\n1. their pineapple fried rice is mediocre and doesn't automatically come with shrimp as well as the meat of your choice.  the shrimp should be a staple.  plus, they don't use golden raisins in the recipe.  brown raisins are mediocre by comparison.\n2. palm juice is on the menu, but very rarely in supply.  my advice is that they should remove it from the menu so that i don't go in there and get my hopes up only to have them dashed to smithereens.\n3. the mango sticky rice is on point, but not enough to make up for the misses on points 1 and 2.\n\ni do give them cool points for being conveniently located in the castro.  honorable mention also for the television that plays tbs and spike tv movies and for the friendliness of the staff.\n\noverall great for pre and post drinking munchies when hanging out in the neighborhood.  get one of the tables by the window and watch the girlies (or boys) strolling down castro.", "rating": 3, "date": "2008-07-04"}], "fried egg": [{"excerpts": ["I also forgot to add a fried egg, but that wouldn't have made up for the bad quality rice. ", "I know I sound like I'm making a big deal about nothing, but seriously, RICE, that is like one of the most essential parts of Thai food, if you can't get ", "that right ", "then you've got serious problems."], "author": "Dennis C.", "review": "I ordered Pat Kapow and Som Tum, although I really wanted Kao Mun Gai, but they only had crappy regular rice, which even our server said wasn't good.\n\nThe Som Tum was pretty mild, I would've preferred much stronger flavors both sweet and sour and spicy. The Pat Kapow was good, but their rice is pretty awful. I also forgot to add a fried egg, but that wouldn't have made up for the bad quality rice. I know I sound like I'm making a big deal about nothing, but seriously, RICE, that is like one of the most essential parts of Thai food, if you can't get that right then you've got serious problems.", "rating": 3, "date": "2010-03-11"}, {"excerpts": ["Also fried egg rolls.  "], "author": "Denise B.", "review": "YUMMMY.\n\nPad thai with beef.  Not much beef but the flavor was soo damn yummy I forgot what I was missing.\n\nAlso fried egg rolls.  DEElicious, as my 2 year old goddaughter likes to say!  \n\nFast fast To Go service too so if you have a minute to call, you can be eating literally in 10 minutes.\n\nI am saving the menu on my desk.", "rating": 4, "date": "2007-10-01"}], "sticky rice": [{"excerpts": ["Mango sticky rice is my fave!"], "author": "James V.", "review": "Great food, better service! Overall great experience! Thanks Thai house!\n\nThis is my go to spot for years now. Always accommodating and the food is consistently good. Staff is friendly and attentive.\n\nMango sticky rice is my fave!", "rating": 5, "date": "2018-11-02"}, {"excerpts": ["I'll order Jasmine rice instead of sticky rice next time; my rice was so hard 15 minutes into dinner that it was impossible to eat even when moistened with curry or Krung Pao sauce. "], "author": "Fancypants X.", "review": "3.75 round up \n\nThai actually isn't my favorite Asian cuisine (put a Vietnamese menu in my hands & I'm a happy diner), but for us, Thai is easy & familiar & we agree on same three or four dishes. \n\nThai House Express is located at the end of the last commercial block on Castro before it turns into a long stretch of mostly residences. \n\nI like the vibe here, it's comfortable, the wait staff is kind & jovial, but leave you to your food after you've ordered. \n\nPad Thai, Krung Pao Beef, & Yellow Curry Chicken are our go-tos & the versions served here, though not exceptional, are solid enough to be on our rotation. I'll order Jasmine rice instead of sticky rice next time; my rice was so hard 15 minutes into dinner that it was impossible to eat even when moistened with curry or Krung Pao sauce. Do get the sweet & delicious Mint Lemonade. Everything on the menu is reasonably priced; most items are under $14.", "rating": 4, "date": "2017-07-02"}, {"excerpts": ["Mango sticky rice for dessert....a near perfect dining experience."], "author": "El B.", "review": "The beef salad was really good tonight-previous issues resolved. \nMango sticky rice for dessert....a near perfect dining experience.", "rating": 4, "date": "2014-04-16"}, {"excerpts": ["I ordered the pineapple fried rice, pad see ew, pad tai, and sticky rice.  ", "I will cut the point... ", "The food is overpriced and not worth it in my opinion. ", "I'm still burping the food and my stomach feels upset, I hope I don't get food poisoning or diarrhea. ", "This was a learning experience I'll leave it at that."], "author": "Ol Dirty B.", "review": "I ordered food from this restaurant through doordash. I ordered the pineapple fried rice, pad see ew, pad tai, and sticky rice.  I will cut the point... The food is overpriced and not worth it in my opinion. I'm still burping the food and my stomach feels upset, I hope I don't get food poisoning or diarrhea. This was a learning experience I'll leave it at that.", "rating": 1, "date": "2016-09-02"}, {"excerpts": ["Sticky rice was actually hard in the middle.  ", "Seriously bad wait staff.  ", "I wonder how they call themselves Thai Food ???,"], "author": "Jeannie C.", "review": "If I could give a lower than 1 star review I would!!!  Calamari was WAY over breaded, the jerky appetizer was disgusting.  Sticky rice was actually hard in the middle.  Seriously bad wait staff.  I wonder how they call themselves Thai Food ???,", "rating": 1, "date": "2015-08-29"}, {"excerpts": ["They get their 5th star because of their mango sticky rice dessert. ", "I got some serious mango knowledge that night! ", "Unlike other places who use semi-ripe or stringy fibrous mangoes during the winter season, these were SWEET and left no grossness in your mouth after biting into it. "], "author": "Kristen C.", "review": "If you're in Castro and want Thai...this is the spot :) \n\nWhen i came in, the first thing i noticed was that I loved the decor. Especially the flower prints on the wall. Service was great and everyone was super friendly and helpful. We went around 7:30 on a Monday night, and it was surprisingly packed which is always a good sign. Their menu was extensive but definitely not overwhelming, and they have all the basics you want when you crave Thai food. Even better, they have a decent wine menu! \n\nfav dishes of the night:\n- tom yum goong soup\n- pad thai\n- som tum thai (green papaya salad)\n- pumpkin curry\n- ga prow (minced chicken w/ basil, chili, and bell peppers)\n\nThey get their 5th star because of their mango sticky rice dessert. I got some serious mango knowledge that night! Unlike other places who use semi-ripe or stringy fibrous mangoes during the winter season, these were SWEET and left no grossness in your mouth after biting into it. AMAZING FOR THE FREAKING MIDDLE OF WINTER! \n\nI was told that mangoes that taste stringy are mostly from Mexico, but the sweeter ones come from Guatemala or the Philippines. It obviously shows they know their stuff even down to the last details ...like where to purchase good mangoes :)", "rating": 5, "date": "2011-01-08"}, {"excerpts": ["Usual orders: Neur Kem, Naked Ladies, Moo Tad ala carte, Crab Fried Rice, Spicy Beef Salad, Pad Kee Mao, steamed rice, Roti, Mango Sticky Rice (when in season), and of course, COCONUT JUICE!!!! \n\n"], "author": "Maureen B.", "review": "This is one of my biased reviews, only because my lovely Thai friends like Lek and Poo work here and they always make sure to take care of me and my guests. (I'm sure they're that way with everyone, but still.)\n\nThe food is SOOO good and hot and fast. Usual orders: Neur Kem, Naked Ladies, Moo Tad ala carte, Crab Fried Rice, Spicy Beef Salad, Pad Kee Mao, steamed rice, Roti, Mango Sticky Rice (when in season), and of course, COCONUT JUICE!!!! \n\nYes, I can easily just go to the Thai House that's a few blocks from my apartment, but there's something about eating Thai food and then looking at gay porn down the street that caps off my weekend.", "rating": 5, "date": "2008-11-27"}, {"excerpts": ["The fried banana and mango with sticky rice desserts are the stand out items. ", "The drinks aren't bad. ", "The lunch specials are great, so come here for that."], "author": "Jennifer W.", "review": "What I thought of this place was just another Thai restaurant. I like the contemporary decor and dishware, but it's not fully elegant and coupled with the menu, it all tells me that this is another medium-priced, medium-tasting, medium-impressiveness establishment. I could've easily walked into another restaurant as easily as I walked into this one. The service was nice and friendly. The pad thai was good. The noodles were not too soft or hard. The currys are pretty mild. The fried banana and mango with sticky rice desserts are the stand out items. The drinks aren't bad. The lunch specials are great, so come here for that.", "rating": 2, "date": "2011-09-07"}, {"excerpts": ["And they serve STICKY RICE! ", "I was so bummed that Marnee Thai doesn't serve it and sticky rice is usually my favorite part of eating thai food! ", "For desert, we had taro balls in coconut milk. ", "The balls were a lot like tiny mochi balls  and didn't have much flavor without the coconut milk. ", "I did like it, but I doubt I will order it again. "], "author": "Rex D.", "review": "So far, this is my favorite Thai restaurant in SF! The food was just about as flavorful as I have been looking for in the city. The Pumpkin Curry was delicious and since this was my first time to ever have pumpkin curry, I'm excited to try it at some other Thai restaurants. My friend likes fried food, so we ordered crispy fried pork and it came out with a super thin and flakey crust and was just delish! The green papaya salad was not overly fish saucy which is good. And they serve STICKY RICE! I was so bummed that Marnee Thai doesn't serve it and sticky rice is usually my favorite part of eating thai food! For desert, we had taro balls in coconut milk. The balls were a lot like tiny mochi balls  and didn't have much flavor without the coconut milk. I did like it, but I doubt I will order it again. Besides, Hot Cookie is just down the street if you need something sweet after dinner. \n\nTry this place, it's really good!", "rating": 4, "date": "2010-03-06"}, {"excerpts": ["Sticky rice came in large, exceptionally sticky quantities and as a harsh critic of sticky rice, I give this order a 4.5 out of 5 (5 is reserved for the sticky rice at SEA restaurant in Brooklyn, the sweetest and stickies of all).\n", "Everything was made veggie for us with none of the awkwardness that sometimes follows ordering a full veggie meal.  ", "There was a corn fritter appetizer on the menu which was of large proportions and quite tasty.\n", "The Tom Yum soup was good, not great.  ", "About average and not spicy enough.  ", "The Tofu and veggies were good and fresh, not too greasy, a definite plus.\n", "*", "*", "*READ ", "IF YOU ARE VEGGIE", "*", "** The curries are made with fish sauce, even the ones listed on the Vegetarian section of the menu.  ", "I don't know why they did this ", "The total bill for two entrees, an appetizer and two orders of sticky rice came out to about $25.00.  "], "author": "Valerie L.", "review": "Last night after a 2.5 hour Aikido class in Noe Valley (see previous reviews) Edward and I decided to try Thai House Express on 19th and Castro only if there happened to be parking near the restaurant.  I fully expected to drive by and end up eating in the inner Richmond but there were actually a few open spots on Castro.  Sweet.  \n\nAmbiance:\nFor a rather inexpensive restaurant, the place was very nicely decorated to look hip but also somewhat cozy.  In addition to views of Castro Street, there were tasteful paintings on the wall and low lighting.  \n\nFood:\nPortion sizes were good.  Sticky rice came in large, exceptionally sticky quantities and as a harsh critic of sticky rice, I give this order a 4.5 out of 5 (5 is reserved for the sticky rice at SEA restaurant in Brooklyn, the sweetest and stickies of all).\nEverything was made veggie for us with none of the awkwardness that sometimes follows ordering a full veggie meal.  There was a corn fritter appetizer on the menu which was of large proportions and quite tasty.\nThe Tom Yum soup was good, not great.  About average and not spicy enough.  The Tofu and veggies were good and fresh, not too greasy, a definite plus.\n***READ IF YOU ARE VEGGIE*** The curries are made with fish sauce, even the ones listed on the Vegetarian section of the menu.  I don't know why they did this but I am glad I asked.\n\nPrice:\nAverage for Thai in a cool neighborhood.  The total bill for two entrees, an appetizer and two orders of sticky rice came out to about $25.00.  And we were very full.\n\nPeople:\nLots of nice looking guys in their mid-twenties to early thirties.  A crazy guy came in screaming and making a huge scene...entertainment, I guess.  The staff responded by pumping the electronica version of Snow Patrol's Chasing Cars louder...good response.", "rating": 4, "date": "2007-06-28"}, {"excerpts": ["We ordered up Garden Rolls, Pad Thai, Basil Chicken and Sticky Rice. ", "When our Garden Rolls came to the table, they were carried by a different server-- this one completely listless. ", "He obviously didn't have the strength, or maybe just didn't have the desire, to place the platter all the way on our table. ", "Now, it's been many years since I've waited a table ", "but I'm pretty sure there's some unwritten rule about putting a platter all the way on the table, instead of letting half of it hang off the edge. ", "Because, wonder of wonders, as soon as he took his hand off the platter, gravity kicked in, and it went crashing down to the floor. ", "Not one of the other waiters came over to help clean it up. ", "I can't be sure if you just reused the same garden rolls that were on the floor ", "but I have a suspicion you did. ", "BTW- ", "the rolls were so dry we choked, and we're gay so choking is something we rarely do. ", "Thai House Express on Castro-- if you're going to pre-make \"fresh\" garden rolls, the least you can do is drape them with damp paper toweling ", "so they don't dry out. ", "That's my Martha Stewart Good Thing(tm) tip to you-- ", "And the Basil Chicken-- EESHK! ", "It was so salty even the other people in the restaurant who didn't eat it will be retaining water for the next month. ", "I will admit that the Sticky Rice came out alright-- which surprised me since you seemed to eff everything else up.\n\n"], "author": "Eric B.", "review": "It's rare I'll write a dissenting review on Yelp but this time I've just gotta.\n\n\nDear Thai House Express on Castro,\n\nOur \"relationship\" is OVER!\n\nAs you already know for the past six months I've wanted things to work out between us. But your food is lackluster and your service is downright dismal. Take for example last night when my friend and I came over to have a three-way with you. The front of the restaurant was already crowded and you refused to open up the back *ahem*. You sat us at a table for two right in front of the counter, in the thick of the dining orgy, than proceeded to treat us as if we were invisible for fifteen minutes. No water, no drink orders, not even a reach around. How rude!\n\nWhen one of your waiters finally came over he was surly-- like he was coming off a bender or had gotten a little too much abuse that evening. We ordered up Garden Rolls, Pad Thai, Basil Chicken and Sticky Rice. It surprised me that he could even take our order considering he barely listened to anything we said. \n\nWhen our Garden Rolls came to the table, they were carried by a different server-- this one completely listless. He obviously didn't have the strength, or maybe just didn't have the desire, to place the platter all the way on our table. Now, it's been many years since I've waited a table but I'm pretty sure there's some unwritten rule about putting a platter all the way on the table, instead of letting half of it hang off the edge. Because, wonder of wonders, as soon as he took his hand off the platter, gravity kicked in, and it went crashing down to the floor. Not one of the other waiters came over to help clean it up. So it took our listless server a good three minutes to get everything up off the floor-- with nary an apology mind you.\n\nImagine our surprise when a new platter came out only thirty-seconds after the broken platter had been taken away. This time it was placed three-quarters of the way on our table. I can't be sure if you just reused the same garden rolls that were on the floor but I have a suspicion you did. BTW- the rolls were so dry we choked, and we're gay so choking is something we rarely do. Thai House Express on Castro-- if you're going to pre-make \"fresh\" garden rolls, the least you can do is drape them with damp paper toweling so they don't dry out. That's my Martha Stewart Good Thing(tm) tip to you-- you're welcome in advance.\n\nCan you answer me a question? When did your Pad Thai become synonymous with fish flavored candy? After our first bite both my friend and I became diabetic. And the Basil Chicken-- EESHK! It was so salty even the other people in the restaurant who didn't eat it will be retaining water for the next month. I will admit that the Sticky Rice came out alright-- which surprised me since you seemed to eff everything else up.\n\nThai House Express on Castro-- we won't see each other any more. I am not going to mall dodge you, instead when I pass by your front or side I'll flip you off because I'm hurt and I don't feel the need to curtail any impulses.", "rating": 1, "date": "2007-08-09"}, {"excerpts": ["Not bad)\nDesert: Mango with sticky rice (standard.. ", "wished it was served warmer)"], "author": "Ervinna L.", "review": "I go to the Thai House on Larkin just because I am used to that one. I finally had the chance to try out this place today. The ambiance and decor are definitely MUCH better then the one on Larkin. However, they do charge $1-$2 more for the dishes  which I didn't mind too much since it was very comfortable dining there. Here's what my date and I ordered:\n\nAppetizer: Hot and sour soup with shrimp (ask for spicy if you are up for the challenge. It was very tasty and on a cold night like this it really hit the spot)\nEntree: Dungeness crab noodles (it reminds me of Pad Thai. Not bad)\nDesert: Mango with sticky rice (standard.. wished it was served warmer)", "rating": 4, "date": "2008-08-05"}, {"excerpts": ["Only thing good was the sticky rice.  \n\n"], "author": "Yelper H.", "review": "Horrific pad thai.  I picked some up last night 1/30/07 and was sooooooo dissappointed!  The pad thai looked and tasted like it was a day old.\n\nI also ordered beef in a red curry sauce and it was bland bland bland.  \n\nOnly thing good was the sticky rice.  \n\nMaybe cuz I am farang I got the bad stuff and thought I wouldn't notice???", "rating": 2, "date": "2007-01-31"}, {"excerpts": ["b/c its the ONLY one ( i swear to god) that has sticky rice. ", "i feel like i go to so many other thai places, even in other neighborhoods, and they don't have sticky rice! ", "wtf! ", "its like a tailor not selling suits. ", "also, EVERYONE that works here is FUKIN GAY, so i support that. ", "fully. werk."], "author": "Teal S.", "review": "this is pretty much the only thai place i go to in castro b/c its the ONLY one ( i swear to god) that has sticky rice. i feel like i go to so many other thai places, even in other neighborhoods, and they don't have sticky rice! wtf! its like a tailor not selling suits. also, EVERYONE that works here is FUKIN GAY, so i support that. fully. werk.", "rating": 5, "date": "2015-04-04"}, {"excerpts": ["There was a mango sticky rice dessert advertised all over which i really wanted to try (it sounded so good my friend was obsessing over it the day after) but will have to wait till i have more room in my tummy!\n", "the decor was more restauranty looking than more authentic thai places, but it wasnt really more expensive.  "], "author": "Merredith L.", "review": "I went to thai house for a late lunch the other day...  i hadn't had thai in a bit (well not long for other people but long for me) so i was excited.  I had a tofu red curry dish that was so good!  The rice that came with it was delicious, i wish i had had enough apetite to eat it all.  My friend had chicken green curry, which was also very tasty, and my other friend had duck, which he liked although i didn't try it (don't like duck).  Our thai iced tea was good too.  There was a mango sticky rice dessert advertised all over which i really wanted to try (it sounded so good my friend was obsessing over it the day after) but will have to wait till i have more room in my tummy!\nthe decor was more restauranty looking than more authentic thai places, but it wasnt really more expensive.  i would go there again, although i still want to try more different ones first.\n\nPS - I did go there again!  I had to wait so long for my tofu green curry that my friends were done before I got mine! Bad service! The pineapple fried rice dish my friend ate had no meat or veggies in it as advertised, but the shrimp tomato pineapple dish my other friend had was good.  As was the hidden shrimp appetizer...", "rating": 3, "date": "2006-09-01"}, {"excerpts": ["After a couple of bites, I was scared to eat any of it other than the sticky rice. \n\n"], "author": "Peter S.", "review": "I used to order from here fairly often. I like authentic Thai food a lot, and, occasionally, you'd get a good cook (or the cook was having a good day) and the food would be fantastic. Most of the time, it was okay. Unfortunately, the quality of the food has declined significantly. I've been eating there less and less frequently. However, last night was the first time I have ever actually returned take out food. Each of the five dishes we ordered was way below acceptable and two of the dishes were just flat-out disgusting; they had even forgotten several of the ingredients in some of the dishes. After a couple of bites, I was scared to eat any of it other than the sticky rice. \n\nWhen I called to complain, they explained that they were very busy that evening (I suppose the five Tuesday night diners must have all ordered at once), and that that could explain why the food was so poor. I guess that means that if they are busy, you take your chances... \n\nI, however, will not be taking any chances here again.\n\nFollow up - I've been asked for examples. One example: The Som Tam (green papaya salad) did not have any chilis, dried shrimp or garlic in it, and if it had lime, I certainly couldn't taste it - these are all essential, and approximately half of the, ingredients to som tam. What it did have, and in large quantities, was undisolved sugar and fish sauce - without those ingredients and with the overabundance of sugar, it all just tasted like a sickeningly-sweet, syrupy, slightly rancid (from the fish sauce) apple salad with fine sand in it.", "rating": 1, "date": "2009-12-03"}, {"excerpts": ["you get a choice between flat rice noodles, egg noodles, and a sticky rice noddle, which i dunno what that is, but the lady said they were thin. ", "nonetheless, still tasted good. ", "i love thai flavors and spice, and this soup hit the spot! "], "author": "Pamela s.", "review": "3.5 stars.\n\nthe decor in this place is cute and modern. i had the tom yum noodle soup with what i thought i ordered was egg noodles, but the noodles looked different to me. you get a choice between flat rice noodles, egg noodles, and a sticky rice noddle, which i dunno what that is, but the lady said they were thin. nonetheless, still tasted good. i love thai flavors and spice, and this soup hit the spot! i also had spring rolls to start off with, but i think they called them garden rolls. the peanut dipping sauce was nothing special, a little on th sweet side for me, i think it needed a kick, some hot sauce of some sort. other than that, service was good. and i like their cups, with town/city names or thailand in traditional thai design with bright colors. i also tried my friends' pad thai, pineapple fried rice, and panang curry, and gai ga prow, all delish!\n\nafter this, we walked around and tried to digest our lovely meal. i just love strolling around castro area.", "rating": 3, "date": "2009-08-04"}, {"excerpts": ["And don't forget to get Sticky Rice for dessert...", "oh, now I'm hungry,"], "author": "Sheila W.", "review": "Amazing, amazing, amazing.  One of the best, if not THE best, Thai restaurants in the city.  Whether you're strictly Pad Thai or experimental, you can't go wrong.  Their Pad See Ew is incredible, and their green curry might be the best I've had.  Try the Larb, too.  And don't forget to get Sticky Rice for dessert...oh, now I'm hungry,", "rating": 5, "date": "2005-11-08"}, {"excerpts": ["the mango sticky rice is on point, but not enough to make up for the misses on points 1 and 2.\n\n"], "author": "Lex E.", "review": "according to my three criteria thai food analysis, this place only get's 3 stars becase:\n1. their pineapple fried rice is mediocre and doesn't automatically come with shrimp as well as the meat of your choice.  the shrimp should be a staple.  plus, they don't use golden raisins in the recipe.  brown raisins are mediocre by comparison.\n2. palm juice is on the menu, but very rarely in supply.  my advice is that they should remove it from the menu so that i don't go in there and get my hopes up only to have them dashed to smithereens.\n3. the mango sticky rice is on point, but not enough to make up for the misses on points 1 and 2.\n\ni do give them cool points for being conveniently located in the castro.  honorable mention also for the television that plays tbs and spike tv movies and for the friendliness of the staff.\n\noverall great for pre and post drinking munchies when hanging out in the neighborhood.  get one of the tables by the window and watch the girlies (or boys) strolling down castro.", "rating": 3, "date": "2008-07-04"}, {"excerpts": ["The sweet-and-sour cucumber salad and sticky rice sides were also a nice complement.  ", "As for the atmosphere, the place was decorated in a simple, modern style, and you can't beat a walk along Castro Street after your meal, the neighbourhood has such a personality!  ", "Only word of advice: we ordered the foursome and sate appetizers, and were disappointed at the tiny amount of food they were for their $8 price tag.  ", "Just order entrees straight away; for the same price range, you get a much larger amount of food."], "author": "Canadian A.", "review": "This was my first Thai food experience, and it was a good one.  Lots of things were tasty... chicken with vegetables in green curry sauce, deep-fried tofu, seafood salad, and my new-found favourite, traditional peanutty-flavoured pad thai.  The sweet-and-sour cucumber salad and sticky rice sides were also a nice complement.  As for the atmosphere, the place was decorated in a simple, modern style, and you can't beat a walk along Castro Street after your meal, the neighbourhood has such a personality!  Only word of advice: we ordered the foursome and sate appetizers, and were disappointed at the tiny amount of food they were for their $8 price tag.  Just order entrees straight away; for the same price range, you get a much larger amount of food.", "rating": 5, "date": "2006-04-20"}], "steamed jasmine rice": [], "steamed brown rice": [{"excerpts": ["My partner loves the green curry chicken (xtra spicy) with steamed brown rice. "], "author": "Johnny G.", "review": "we get to go food here at least once, sometimes twice per week. They know us by name and what we usually order. It's consistently delicous, fairly priced and the take good care of us.\n\nMy partner loves the green curry chicken (xtra spicy) with steamed brown rice. I enjoy the corn cake appetizer, the yellow mustardy chicken curry on egg noodles with red onion and a type of thai pickles...delicious.\n\nMy favorite dish there is their Pumpkin Chicken Curry. To die for.! Seriously over the top delicious....\n\nThanks for taking such good care of us guys. Steve and Johnny", "rating": 5, "date": "2010-03-08"}], "egg fried rice": [], "regular iced tea": [{"excerpts": ["Small portions that account for the reasonable prices, unfriendly waitstaff, and NO REFILLS ON SODA \"OR\" REGULAR ICED TEA!! ", "I've never heard of such a thing with Iced Tea... thats why you order it, so you can quench your thirst again and again! ", "I can understand Thai Iced Tea without refills, and \"sometimes soda\" being a one time deal, but NOT Iced Tea. ", "The portions as I mentioned are small. ", "For $30 for two with no booze, you shouldn't still be hungry. \n", "What is with the staff there? ", "Don't they read these reviews? ", "Someone should print them out and leave them with the owner/manager. ", "It is such a waste to have a good place with decent food, and rude staff, and leave thirsty and hungry."], "author": "Mark T.", "review": "We've been here many times, and it's pretty consistent. Small portions that account for the reasonable prices, unfriendly waitstaff, and NO REFILLS ON SODA \"OR\" REGULAR ICED TEA!! I've never heard of such a thing with Iced Tea... thats why you order it, so you can quench your thirst again and again! I can understand Thai Iced Tea without refills, and \"sometimes soda\" being a one time deal, but NOT Iced Tea. The portions as I mentioned are small. For $30 for two with no booze, you shouldn't still be hungry. \nWhat is with the staff there? Don't they read these reviews? Someone should print them out and leave them with the owner/manager. It is such a waste to have a good place with decent food, and rude staff, and leave thirsty and hungry.", "rating": 2, "date": "2008-08-26"}], "thai iced coffee": [], "mint lemonade": [{"excerpts": ["Do get the sweet & delicious Mint Lemonade. ", "Everything on the menu is reasonably priced; most items are under $14."], "author": "Fancypants X.", "review": "3.75 round up \n\nThai actually isn't my favorite Asian cuisine (put a Vietnamese menu in my hands & I'm a happy diner), but for us, Thai is easy & familiar & we agree on same three or four dishes. \n\nThai House Express is located at the end of the last commercial block on Castro before it turns into a long stretch of mostly residences. \n\nI like the vibe here, it's comfortable, the wait staff is kind & jovial, but leave you to your food after you've ordered. \n\nPad Thai, Krung Pao Beef, & Yellow Curry Chicken are our go-tos & the versions served here, though not exceptional, are solid enough to be on our rotation. I'll order Jasmine rice instead of sticky rice next time; my rice was so hard 15 minutes into dinner that it was impossible to eat even when moistened with curry or Krung Pao sauce. Do get the sweet & delicious Mint Lemonade. Everything on the menu is reasonably priced; most items are under $14.", "rating": 4, "date": "2017-07-02"}, {"excerpts": ["I loved the mint lemonade and ", "the Tom Yum soup (be careful, its spicy).   ", "The Pad See Ew was very bland and very nutty tasting but a huge portion.  ", "We didnt' experience any problems with service but ", "the guys next to us were complaining about the menu changing and things not being the same as before."], "author": "Monica G.", "review": "Kind of an average Thai place with decent prices.  I loved the mint lemonade and the Tom Yum soup (be careful, its spicy).   The Pad See Ew was very bland and very nutty tasting but a huge portion.  We didnt' experience any problems with service but the guys next to us were complaining about the menu changing and things not being the same as before.", "rating": 3, "date": "2011-09-27"}, {"excerpts": ["Mint lemonade is pretty good too!"], "author": "Austin R.", "review": "My favorite Thai place in San Fran. Mint lemonade is pretty good too!", "rating": 5, "date": "2011-01-01"}], "hot tea": [{"excerpts": ["The hot tea is the same herbal tea used in Thai iced tea minus the carnation milk and sugar. "], "author": "Matt Y.", "review": "4/27/13 \n\nMost recent visit was last Saturday. This is where I go if I want Thai food in my neighborhood. They have more \"authentic\" flavor than Thai Chef on 18th Street, which has a overwhelming inclination on putting lots of sugar in their food.\n\n*Tom kha gai:  Coconut milk and lime juice seasoned with ginger root and cayenne pepper create a spicy broth for this Thai-inspired soup with strips of white chicken, cilantro and mushroom. Overall it's good but could be a bit less watery.\n\n*Yellow curry:  usually good, flavorful and spicy. My friend complained that his edition in that evening was bland and tasteless.\n\n*Thai beef: tender and barbequed to medium, beef was marinated well. Be aware of that green chili sauce, it's hotter than wasabi.\n\n*Gai ka prow:  Stir-fry chicken with basil. Along with Pad Thai, this is a staple of the Thai meal. Order it mild if your stomach doesn't agree with spicy food. I go for medium. Basil flavor is very opulent. Perfect to eat with jasmine rice. \n\nThe hot tea is the same herbal tea used in Thai iced tea minus the carnation milk and sugar. It's good for mitigating the flamey tongue!\n\nService is alright but could be more attentive. My gai ka prow didn't come with everyone else's food so I was poking at my friends' dishes. I heard Thai House in the Castro had recently divorced from Thai House on Geary in the Tenderloin. Food has got better here and regrettably, crazy spicy there. They also have traditional dishes like pork leg stew and \"Ko Soi\"---noodle in curry soup. Worth a try if you're interested in real Thai fare.", "rating": 4, "date": "2013-05-02"}], "ice cream": [{"excerpts": ["portions are kind of small but ok for a lunch special\nwe had ice cream for dessert total for 2 $ 38 \n", "it was ok ", "don't think I'd go out of my to go again"], "author": "lyn m.", "review": "Went here for a late lunch it's nice inside and clean \nwe ordered the lunch special soup , salad and rice and choice of appetizer and entree \nsoup was not very hot so we sent it back \nportions are kind of small but ok for a lunch special\nwe had ice cream for dessert total for 2 $ 38 \nit was ok don't think I'd go out of my to go again", "rating": 3, "date": "2012-07-23"}, {"excerpts": ["Other than that, the pineapple fried rice was not good and lacked flavors, papaya salad and fried banana and ice cream was just okay"], "author": "Jenny N.", "review": "I swear to god i have never and probably never will have a better pad thai omfg. 5 stars literally only for this dish. Other than that, the pineapple fried rice was not good and lacked flavors, papaya salad and fried banana and ice cream was just okay", "rating": 5, "date": "2014-03-14"}, {"excerpts": ["Awesome curry, quick service, we were too stuffed for dessert (for my part, i wasn't interested in seeing green tea ice cream go up anyone's nose).\n\n"], "author": "Irene F.", "review": "This was the first place we went to when we got to San Fran. I was with my darling adorable immigrant parents (yeah it's cool I'm a commie too) and my brother (the only american out of the bunch). We had just driven down from Sacramento via Napa and Sonoma, and were all rather tipsy on phenomenal amounts of wine samples. We were staying on Gold Mine Hill, and went down to the Castro to find some dinner. Thai always works well, and we got a seat near the windows, which was a nice plus. We order and wait.\n\nMy mother, looking out window: \"There are so many rainbow flags!\"\nMy father: \"What does the California flag look like? Maybe it's rainbow?\"\n(bear in mind we have lived in NYC for 17 years)\nMe (trying to keep straight face): \"It's the gay flag, guys.\"\nMy mother: 'There are gays in San Francisco?\"\n(my brother shoots his delicious tom kar gai out his nose)\nBrother: Um, Ma, this is where gay came from.\nMy mother: \"Wipe your face and don't be ridiculous. Gay came from everywhere.\"\nBrother: \"No, I mean like the gay rights movement and everything.\"\nMy dad, finally looking up and down Castro carefully: \"I had no idea the west coast had gay people too!\"\nand so on and so forth.\n\nBut I digress.\nThe food was wonderful, and we had a great meal. Awesome curry, quick service, we were too stuffed for dessert (for my part, i wasn't interested in seeing green tea ice cream go up anyone's nose).\n\nMy family is infinitely amusing, but mostly for me.", "rating": 5, "date": "2006-06-06"}], "fried banana with ice cream": []}