{"sunrise": [], "fried wonton": [], "fried combination balls": [], "fried corn cake": [], "thai chef spring rolls": [{"excerpts": ["The $6.95 Thai Chef Spring Rolls were first, they always are (photo: ). ", "Jamie W. had been here before, so he knew to get the flat noodles", ", the Thai chow fun if you will. "], "author": "Ed U.", "review": "Do you remember that Sally Struthers infomercial back in the nineties for the International Correspondence School? She would tell you that you could earn your degree without setting foot into a classroom to start your highly lucrative career in VCR Repair, PacMan Design, Handgun Repair, and the list went on and on and on. I must have missed the one for Osha Thai Wannabe Restaurant Management. Not that I think Osha Thai is all that, but there are sure a lot of darkly lit Thai spots that have the same vibe and serve basically the same plates of food with little distinction (photo: http://bit.ly/ON9XA2). That's how I barely remember Thai Chef on 18th near Castro, surely inspired by Sally's sound advice.\n\nFirst things first, the staff is very friendly. They're very helpful in pointing out the 116 items (...yes, 116) on their menu not including beverages (photo: http://bit.ly/Naz3aO). The $6.95 Thai Chef Spring Rolls were first, they always are (photo: ). Jamie W. had been here before, so he knew to get the flat noodles, the Thai chow fun if you will. He ordered the $9.95 Pad See Eiw with Chicken that included bamboo shoots, carrots, cabbage, onions and a mystery gravy (photo: http://bit.ly/1huBe3A). I went on a similar path and got the same priced Pad Thai with Pork and the usual suspects - tofu, egg, bean sprouts and green onion (photo: http://bit.ly/1crlPMQ). It was OK and just OK, nothing special and rather by-the numbers, although I won't go as far to say the cook went to correspondence school. But maybe...\n\nFOOD - 3 stars...middling Thai dishes have flavor but lack distinction\nAMBIANCE - 3 stars...presumably inspired by Osha Thai, all of them\nSERVICE - 4 stars...friendly and attentive\nTOTAL - 3 stars...Sally has a diploma she wants to send you", "rating": 3, "date": "2014-03-01"}, {"excerpts": ["Thai Chef Spring Rolls, these are the kind that are not fried and are very good. ", "I love the dipping sauce that comes with it.  "], "author": "Vanilla C.", "review": "For a casual (no need to dress up) and dimly lit place to eat, this place to yummy for the low prices that they charge.   I usually go there for lunch.  \n\nhey have daily Lunch specials that are really reasonable.  Plus that men that work their are very polite and most of them are very cute too.  I have eaten there about 6 times and  the service has always been consistent and attentive.  \n\nThai Chef Spring Rolls, these are the kind that are not fried and are very good. I love the dipping sauce that comes with it.  One day when I was not feeling well, I ordered the Tom Ka Soup  with coconut and lemon grass et. al.  Loved the texture and of course the lemon grass really gives it a kick.\n\nTry their  fried Angel Prawns (they are not greasy, and they are very crispy)\nthey are coated with a coconut & bread crumb mixture and served with a sweet  plum sauce.  I have had so many dishes here, that I can write a long list but I'll stop with that.\n\nThe bathrooms are nice and clean and a wheel chair can get in their as well as the restaurant.  The atmosphere is quiet is  is decorated with dark toned colors.", "rating": 3, "date": "2010-10-07"}], "thai chef fresh spring rolls": [], "fish cake": [], "chicken sa tay": [], "shrimp rolls": [{"excerpts": ["The shrimp rolls were very good and so were the corn cakes.  ", "We also tried the yellow curry with chicken, which was just okay. ", "Nice clean place, but not worthy of more than 3 stars.  ", "I was visiting from San  Diego, and would assume that SF would have even better Thai. ", "I'll keep looking."], "author": "Del P.", "review": "After our dining plans changed due to a nearby restaurant being closed, we strolled around the neighborhood to find Thai Chef.  I give this place 3 stars as the food was mediocre. The Tom Kah soup was bland, and the shrimp was tough. One plus, the veggies were fresh.  The shrimp rolls were very good and so were the corn cakes.  We also tried the yellow curry with chicken, which was just okay. Nice clean place, but not worthy of more than 3 stars.  I was visiting from San  Diego, and would assume that SF would have even better Thai. I'll keep looking.", "rating": 3, "date": "2014-01-01"}, {"excerpts": ["My favorite thing was the shrimp rolls. ", "The yellow curry was decent ", "but I felt like I needed to add salt."], "author": "Greg R.", "review": "The food was decent. I've has better Thai: I've had worse. My favorite thing was the shrimp rolls. The yellow curry was decent but I felt like I needed to add salt.", "rating": 3, "date": "2014-01-01"}, {"excerpts": ["The green papaya salad and shrimp rolls are fantastic, and I've never had a problem with service.  \n\n"], "author": "louda l.", "review": "Pretty damn good, if you ask me.\n\nI am completely obsessed with their Tom Ka soup, which is definitely some of the best I've had.  The green papaya salad and shrimp rolls are fantastic, and I've never had a problem with service.  \n\nIt is a bit difficult to order over the phone, but they deliver quickly when you do.\n\nJust as a side note to Eric M., food poisoning typically occurs 24 hours (or more) after you've eaten something.  Whatever you're sick from was probably the day before.  I'm not saying that it couldn't have occurred from what you ate at this restaurant, but is more common to react after a longer incubation period.", "rating": 4, "date": "2008-04-30"}], "calamari tempura": [], "heaven prawns": [{"excerpts": ["The pad thai, the HEAVEN PRAWNS, the chicken sate...all of it was absolutely delicious. ", "The food is HOT, presented in a pleasant fashion and deeeeelicious! ", "The only thing better there is the wonderfully friendly/informative waitstaff. ", "\"", "O\" can answer any questions you may have and is responsive and helpful if you are unsure. ", "GREAT food, friendly staff, convenient location and never a disappointment...this is the place to go for Thai food if you are anywhere near the Castro! ", "BRAVO!\n", "YUMMMMMM!"], "author": "Xenry W.", "review": "Although we are still learning about Thai food, this is the best we have had in SF! The pad thai, the HEAVEN PRAWNS, the chicken sate...all of it was absolutely delicious. The food is HOT, presented in a pleasant fashion and deeeeelicious! The only thing better there is the wonderfully friendly/informative waitstaff. \"O\" can answer any questions you may have and is responsive and helpful if you are unsure. GREAT food, friendly staff, convenient location and never a disappointment...this is the place to go for Thai food if you are anywhere near the Castro! BRAVO!\nYUMMMMMM!", "rating": 5, "date": "2011-08-15"}, {"excerpts": ["Heaven Prawns were ok.\n"], "author": "Matt V.", "review": "Ate here for my first time tonight.  I didn't have a bad experience but it was nothing to write home about...\n\nHeaven Prawns were ok.\nBeef salad...had better before\nCrispy fried duck loaded with grease (yes I know duck is fatty...but it was overly greasy)\n\nCompany was great though and service was superb.", "rating": 2, "date": "2008-06-30"}], "angel prawns": [{"excerpts": ["Angel Prawns\nCalamari salad\nBBQ beef salad\n"], "author": "Clifford L.", "review": "Gem of the Castro!\n\nAngel Wings\nAngel Prawns\nCalamari salad\nBBQ beef salad\nPad See Eiw (Pork Chow Fun)\nTamarind Fish\nJasmine rice\n\nThe cook has redeemed herself/ The previous 2 visits were disappointing & embarrassing.", "rating": 5, "date": "2012-03-08"}, {"excerpts": ["Try their  fried Angel Prawns (they are not greasy, and they are very crispy)\n", "they are coated with a coconut & bread crumb mixture and served with a sweet  plum sauce.  ", "I have had so many dishes here, that I can write a long list "], "author": "Vanilla C.", "review": "For a casual (no need to dress up) and dimly lit place to eat, this place to yummy for the low prices that they charge.   I usually go there for lunch.  \n\nhey have daily Lunch specials that are really reasonable.  Plus that men that work their are very polite and most of them are very cute too.  I have eaten there about 6 times and  the service has always been consistent and attentive.  \n\nThai Chef Spring Rolls, these are the kind that are not fried and are very good. I love the dipping sauce that comes with it.  One day when I was not feeling well, I ordered the Tom Ka Soup  with coconut and lemon grass et. al.  Loved the texture and of course the lemon grass really gives it a kick.\n\nTry their  fried Angel Prawns (they are not greasy, and they are very crispy)\nthey are coated with a coconut & bread crumb mixture and served with a sweet  plum sauce.  I have had so many dishes here, that I can write a long list but I'll stop with that.\n\nThe bathrooms are nice and clean and a wheel chair can get in their as well as the restaurant.  The atmosphere is quiet is  is decorated with dark toned colors.", "rating": 3, "date": "2010-10-07"}], "mango prawns": [], "prawns papaya salad": [{"excerpts": ["- Prawns Papaya Salad ($7.95) - nice tangy papaya salad. ", "But I think you only get 4 \"prawns\".\n", "- Chicken Sa-Tay ($7.95) - I'm typically ambivalent about satays, but this was suprisingly good. ", "Nutty curry flavor, very tender chicken. ", "About 6 skewers. \n- Sweet Sticky Rice with Mango ($4.50) ", "- I can easily make a meal out of this! ", "Yum! ", "warm sticky rice and fresh mango. ", "Great presentation with the mango slices too."], "author": "Cindy W.", "review": "This is a simple solid Thai restaurant. I didn't really get to try their main dishes but what I had was good.\n\n- Prawns Papaya Salad ($7.95) - nice tangy papaya salad. But I think you only get 4 \"prawns\".\n- Chicken Sa-Tay ($7.95) - I'm typically ambivalent about satays, but this was suprisingly good. Nutty curry flavor, very tender chicken. About 6 skewers. \n- Sweet Sticky Rice with Mango ($4.50) - I can easily make a meal out of this! Yum! warm sticky rice and fresh mango. Great presentation with the mango slices too.", "rating": 3, "date": "2008-05-18"}], "silver noodle salad": [], "beef salad": [{"excerpts": ["I've had a lot of their dishes, and those that I seem to go back to often are the tom yum soup, the beef salad (mercy, it's good), the red curry, and the pra ram (", "the curry and the pra ram usually with chicken).  ", "It's fast, it's pleasant, the waitstaff is lovely, the food is great (try the beef salad), and the prices are reasonable."], "author": "Earline A.", "review": "I've been going to Thai Chef for several years, and I'm quite happy with it.  Overall I've had excellent, friendly service, and I've never had a bad dish.  There have been a few small bumps when the place is very full and there's a new waitperson, but overall, they've been minor.  To the reviewer who claims that the food isn't authentic Thai--I don't have a clue about that.  I've never been to Thailand.  Thai Chef's food is authentically good to my taste buds, it's consistently good and fresh, and it's served quickly.\n\nFull disclosure:  there was a time a while back when I noticed that their DPH score was low, and I avoided it for a few months.  They've done a lot of work, and they've brought it up to a very satisfactory 96.\n\nI've had a lot of their dishes, and those that I seem to go back to often are the tom yum soup, the beef salad (mercy, it's good), the red curry, and the pra ram (the curry and the pra ram usually with chicken).  I tend to stay away from the duck dishes, as I do at many Thai and Chinese places, because there's never enough duck for my taste, and what there is tends to be too fatty for me.  \n\nIt's fast, it's pleasant, the waitstaff is lovely, the food is great (try the beef salad), and the prices are reasonable.", "rating": 5, "date": "2015-10-20"}, {"excerpts": ["My favorites: Beef Salad with its smokey grilled flavor; Duck Basil has the perfect sweet and sour combination. ", "More sweet than sour; Duck curry (I think it's panang) is heavenly too.   ", "And oh yes the crispy whole fish is nom nom nom."], "author": "Ed F.", "review": "By far one of my favorite Thai restaurants. Even when I travel I use Thai chef as the bar to compare other Thai foods. My favorites: Beef Salad with its smokey grilled flavor; Duck Basil has the perfect sweet and sour combination. More sweet than sour; Duck curry (I think it's panang) is heavenly too.   And oh yes the crispy whole fish is nom nom nom.", "rating": 5, "date": "2016-03-21"}, {"excerpts": ["The Beef salad appetizer is a winner. ", "Everything I've tried here is solid too... "], "author": "Aleyna S.", "review": "The Beef salad appetizer is a winner. Everything I've tried here is solid too... Thai iced tea, yellow curry, pad see yew, pumpkin curry. Service is friendly. I've got no complaints. Nothing fancy, but if you're looking for take out or something casual and affordable to eat, this is a good option in the Castro.\n\nOn a side note, I like the dinner ambience as well. It's warm and cozy. Definitely not romantic, but cozy.", "rating": 4, "date": "2013-06-06"}, {"excerpts": ["Angel Prawns\nCalamari salad\nBBQ beef salad\n"], "author": "Clifford L.", "review": "Gem of the Castro!\n\nAngel Wings\nAngel Prawns\nCalamari salad\nBBQ beef salad\nPad See Eiw (Pork Chow Fun)\nTamarind Fish\nJasmine rice\n\nThe cook has redeemed herself/ The previous 2 visits were disappointing & embarrassing.", "rating": 5, "date": "2012-03-08"}, {"excerpts": ["I've had the pad thai, pad se yew, chicken satay, deep fried soft shell crab, beef salad, and much more. ", "You not only get your food, but you get a presentation on your plate. "], "author": "Nancy T.", "review": "We love this place! Ever since I moved out of SF, I still crave the noodles here. I can't find another thai place as good as this place in SF. \n\nI've had the pad thai, pad se yew, chicken satay, deep fried soft shell crab, beef salad, and much more. You not only get your food, but you get a presentation on your plate. They make it look are pretty and colorful.\n\nI'd have to say, this place is good because the service is great. The waiters constantly go out of their way to make sure your cup is never empty and that you're enjoying your food. \n\nPrices here range from $10/lunch specials to full on meals for $15/person. I mean...isn't that great? The many years I have dined here, I don't believe I ever spent more than $20.", "rating": 5, "date": "2010-07-05"}, {"excerpts": ["Beef salad...had better before\nCrispy fried duck loaded with grease (yes I know duck is fatty..."], "author": "Matt V.", "review": "Ate here for my first time tonight.  I didn't have a bad experience but it was nothing to write home about...\n\nHeaven Prawns were ok.\nBeef salad...had better before\nCrispy fried duck loaded with grease (yes I know duck is fatty...but it was overly greasy)\n\nCompany was great though and service was superb.", "rating": 2, "date": "2008-06-30"}], "thai chef salad": [], "eggplant salad": [], "prawns salad": [], "silver noodle soup": [], "tom yum soup": [{"excerpts": ["Tom Yum soup -3 stars. ", "Flavorful, but pricey for what you get.\n", "Pad Thai - 0 stars. ", "This is the worst pad thai I've ever tasted. ", "No flavor, barely any meat, bland noodles. ", "It was terrible.\n", "Pad Si Ew - 0 stars. ", "This is the most bland thai dish I've ever tasted. ", "It's supposed to come with broccoli, and there were only a few chopped up pieces of bitter stalk that did not taste fresh. ", "Barely any egg or chicken. ", "A total rip off that tasted like boiled stale water. "], "author": "Jordan Q.", "review": "I hesitantly ordered delivery here because my go-to thai delivery in the neighborhood (Rin's) was closed. \n\nTom Yum soup -3 stars. Flavorful, but pricey for what you get.\nPad Thai - 0 stars. This is the worst pad thai I've ever tasted. No flavor, barely any meat, bland noodles. It was terrible.\nPad Si Ew - 0 stars. This is the most bland thai dish I've ever tasted. It's supposed to come with broccoli, and there were only a few chopped up pieces of bitter stalk that did not taste fresh. Barely any egg or chicken. A total rip off that tasted like boiled stale water. Also, there was a piece of burnt saran wrap or something in there I gagged on. \n\nI could not have been more disappointed with this meal. I'd have been better off squeezing sriracha sauce all over the money I paid for it with and eating the bills. I will NEVER order from here again. I have no idea how they are still in business.", "rating": 1, "date": "2015-11-28"}, {"excerpts": ["I've had a lot of their dishes, and those that I seem to go back to often are the tom yum soup, the beef salad (mercy, it's good), the red curry, and the pra ram (", "the curry and the pra ram usually with chicken).  ", "It's fast, it's pleasant, the waitstaff is lovely, the food is great (try the beef salad), and the prices are reasonable."], "author": "Earline A.", "review": "I've been going to Thai Chef for several years, and I'm quite happy with it.  Overall I've had excellent, friendly service, and I've never had a bad dish.  There have been a few small bumps when the place is very full and there's a new waitperson, but overall, they've been minor.  To the reviewer who claims that the food isn't authentic Thai--I don't have a clue about that.  I've never been to Thailand.  Thai Chef's food is authentically good to my taste buds, it's consistently good and fresh, and it's served quickly.\n\nFull disclosure:  there was a time a while back when I noticed that their DPH score was low, and I avoided it for a few months.  They've done a lot of work, and they've brought it up to a very satisfactory 96.\n\nI've had a lot of their dishes, and those that I seem to go back to often are the tom yum soup, the beef salad (mercy, it's good), the red curry, and the pra ram (the curry and the pra ram usually with chicken).  I tend to stay away from the duck dishes, as I do at many Thai and Chinese places, because there's never enough duck for my taste, and what there is tends to be too fatty for me.  \n\nIt's fast, it's pleasant, the waitstaff is lovely, the food is great (try the beef salad), and the prices are reasonable.", "rating": 5, "date": "2015-10-20"}, {"excerpts": ["I ordered the Tom Yum Soup. ", "It cost me $12, plus I gave $3 on a TO-GO order (too generous). ", "When I got the soup, it was HALF WAY full. ", "I asked if this was the large order (I ordered the large), and they said yes. ", "I asked if they could ask the kitchen to fill it up because it's awfully expensive for how much they give. ", "I was given a total attitude by one of the employees and an eye roll by another. ", "One actually said, \"well what do you want me to do; you keep complaining.", "\" ", "I handed it to him and asked that he have them fill it up. ", "The kitchen did, but I could tell there was animosity about it. ", "Never again will I ever return. "], "author": "David B.", "review": "DISCRIMINATION ALERT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n I walked in this place after playing at a club in the area and the owner took one look at me and shook his head! The place was nearly empty on a Friday night (which was a red flag), and I was in disbelief that an owner would be so rude to a potential customer! At first I didn't understand what he meant, but then in broken English he said that he would not serve me! It was obviously because of my long dreadlocks, because I was dressed very nice from my gig, and was clean and presentable. It was shocking to me because he is located in San Francisco,  in the middle of an area that has a history of winning the fight against discrimination.\n After I scrolled down the yelp list and read the latest review, I considered myself lucky not to give the jerk any of my money! Stay far far away from this rude meanie. I included another review of someone who actually ate this bigots food. Very bad karma awaits this horrible creature.\nThis is the review by my fellow Yelper who had the unfortunate experience of eating there:\nTwo words: rip off. I ordered the Tom Yum Soup. It cost me $12, plus I gave $3 on a TO-GO order (too generous). When I got the soup, it was HALF WAY full. I asked if this was the large order (I ordered the large), and they said yes. I asked if they could ask the kitchen to fill it up because it's awfully expensive for how much they give. I was given a total attitude by one of the employees and an eye roll by another. One actually said, \"well what do you want me to do; you keep complaining.\" I handed it to him and asked that he have them fill it up. The kitchen did, but I could tell there was animosity about it. Never again will I ever return. Learn some customer service skills and be more generous with your portions, Thai Chef, and maybe you will be a more successful restaurant.\n\nI will add that it was 6:30 pm and the ENTIRE PLACE WAS EMPTY. I know why. Bad ju-ju.", "rating": 1, "date": "2015-12-12"}, {"excerpts": ["We started off with the Tom Yum Soup. ", "It had great flavor and we finished every drop.  "], "author": "Bill L.", "review": "I can't believe I've never tried this place prior to now. A friend and I wanted to try someplace new in the neighborhood.  We started off with the Tom Yum Soup. It had great flavor and we finished every drop.  We also ordered the Basil Fried Rice, Duck Basil and a rice noodle dish that my friend says was Pad Woon Sen.  This was the only miss here due to the rice noodles were overcooked and soggy/watery.  I deducted a star for that. \n\nService was friendly.", "rating": 4, "date": "2016-01-06"}, {"excerpts": ["Tom Yum Soup, Tom Ka Soup, Pad Thai, Pram Ram Garlic Basil Eggplant all the food is delicious I havent had anything there that I didnt like. ", "Super friendly staff and great waiters. ", "This is my top choice for Thai food in the Castro."], "author": "Jake T.", "review": "I eat here about once a week. The food is wonderful. Tom Yum Soup, Tom Ka Soup, Pad Thai, Pram Ram Garlic Basil Eggplant all the food is delicious I havent had anything there that I didnt like. Super friendly staff and great waiters. This is my top choice for Thai food in the Castro.", "rating": 5, "date": "2012-03-10"}, {"excerpts": ["I ordered the Tom Yum soup with chicken and fresh garden rolls, my friend ordered the chicken friend rice.  ", "Thirty minutes later a chef in the kitchen only brought my friend's dish over and it was completely wrong!  ", "The guy who brought out the tray tried to make excuses for the wrong dish and then tried to get my friend to accept the wrong dish!  ", "But we insisted that he go back to the kitchen and bring what he ordered.  ", "Meanwhile my order was no where to be found and when I asked the chef he acted like he didnt know what I was talking about.  ", "About 15 minutes later another chef (I assume) finally brought out my friend's chicken fried rice while my order never appeared.  ", "I asked the guy where my food was and he said he would check.  ", "He never came back.   ", "Finally about 20 minutes later I asked the hostess where my food was and she ran to the kitchen and came back five minutes later and said they forgot to make it.  ", "Then she walked away.  ", "No apologies, nothing.  ", "So after waiting for about 15 more minutes I ate half of my friends dinner and as we were about to leave they finally brought out my dinner.  ", "When we told the guy we were leaving he looked at us like we were completely crazy.  ", "I told him we had been there for over an hour ", "and I never got my food ", "and we were leaving.  ", "I asked them to put my food in a To Go bag.  ", "About ten minutes later they came out with my food to go along with a complimentary iced tea.  ", "That's it?  ", "I sit in this restaurant for over an hour with no food ", "and they give me a free iced tea?  ", "When I asked if they would take my order off the bill the hostess looked away and asked an older guy (who I assume was the owner) to come over.  ", "He was incredibly rude and said we were to pay the bill in full.  ", "Are you kidding me?!  "], "author": "Robbie T.", "review": "So I've been here quite a few times and the ONLY reason I continue to go here is because it is a convenient location in the heart of the castro next to Badlands.  If this restaurant were anywhere else I would avoid it like the plague.  Every time the service is below average at best but the last time was the absolute worse.  Yes I admit this was a busy Sunday evening but the cheap owner should hire more staff on the weekends rather than subject the single waiter to run the entire restaurant.  After seating us the waiter never came over so about 15 mins later the hostess came over to our table to take our orders.  I ordered the Tom Yum soup with chicken and fresh garden rolls, my friend ordered the chicken friend rice.  Thirty minutes later a chef in the kitchen only brought my friend's dish over and it was completely wrong!  The guy who brought out the tray tried to make excuses for the wrong dish and then tried to get my friend to accept the wrong dish!  But we insisted that he go back to the kitchen and bring what he ordered.  Meanwhile my order was no where to be found and when I asked the chef he acted like he didnt know what I was talking about.  About 15 minutes later another chef (I assume) finally brought out my friend's chicken fried rice while my order never appeared.  I asked the guy where my food was and he said he would check.  He never came back.   Finally about 20 minutes later I asked the hostess where my food was and she ran to the kitchen and came back five minutes later and said they forgot to make it.  Then she walked away.  No apologies, nothing.  So after waiting for about 15 more minutes I ate half of my friends dinner and as we were about to leave they finally brought out my dinner.  When we told the guy we were leaving he looked at us like we were completely crazy.  I told him we had been there for over an hour and I never got my food and we were leaving.  I asked them to put my food in a To Go bag.  About ten minutes later they came out with my food to go along with a complimentary iced tea.  That's it?  I sit in this restaurant for over an hour with no food and they give me a free iced tea?  When I asked if they would take my order off the bill the hostess looked away and asked an older guy (who I assume was the owner) to come over.  He was incredibly rude and said we were to pay the bill in full.  Are you kidding me?!  This place is a total joke and I would not recommend it for anyone, no matter how drunk you are when you leave Badlands.  \n\nIf you want mediocre service with hateful staff who dont care at all about customers then I highly recommend this joke of a restaurant.  There are plenty of amazing restaurants in San Francisco and this is not one of them.  Go somewhere else.", "rating": 2, "date": "2012-03-25"}, {"excerpts": ["we ordered the tom yum soup, soft shell crab and fried rice, pad see iew, and green curry. ", "everything was super yummy and affordable! ", "i would definitely come back if i happen to be in the area."], "author": "Linda N.", "review": "yummy thai place! service was great. everyone was super nice. some friends and i came for dinner and were seated right away. there were so many things on the menu that looked good so we decided to just get a bunch of things and share. we ordered the tom yum soup, soft shell crab and fried rice, pad see iew, and green curry. everything was super yummy and affordable! i would definitely come back if i happen to be in the area.", "rating": 4, "date": "2011-07-18"}, {"excerpts": ["We had shrimp & chicken tom yum soup, "], "author": "Gladys C.", "review": "What a yummy place with a great decor and atmosphere. My boyfriend and I stopped by for a Thai ice-tea to go and picked up a menu. I saw so many good dishes on the menu that we decided to go back for dinner. The service was great and the prices are reasonable. We had shrimp & chicken tom yum soup, beef pad see eiw and the seafood claypot. Everything was presented nicely and delicious. The only complain I have is the pad see eiw - it wasn't as tasty as others that I've had. There wasn't enough sauce in it or something and it was a bit bland. The claypot had prawns, scallops, mussels, fish and zucchini and the curry sauce was really yummy! The portions are generous too. We're definitely coming back to try other things!", "rating": 4, "date": "2006-07-04"}], "tom ka soup": [{"excerpts": ["My partner had a cup of the Tom Ka soup which he liked very much.  ", "For an entree, he had Pad Thai and liked that, too.\n"], "author": "Philip C.", "review": "We had not been to Thai Chef in a couple of years, but my partner wanted Thai food so we took our visiting friend Charles on Wednesday.\nMy first impression was the decor had been upgraded very nicely.  The host gave us a nice table very quickly.\nMy partner had a cup of the Tom Ka soup which he liked very much.  For an entree, he had Pad Thai and liked that, too.\nI just had the veggie spicy fried rice which was also good but not spicy at all.  I added some chili paste but it still wasn't hot enough so I sprinkled on some chili powder and that did the trick.  The tofu was properly prepared and the veggies were al dente.  I didn't think I could finish it, but I liked it so much that I did finish it.\nOur server was a very nice lady who tended to us very well.\nIt was not the best, authentic Thai food I've ever had, but I would go back for a nice, inexpensive meal.", "rating": 3, "date": "2011-05-26"}, {"excerpts": ["I usually get the crispy chicken fried rice, pad thai, tom ka soup, or green curry fried rice. ", "All are money money moneyyyyy. ", "If it gets too crowded try Thailand Restaurant on Castro! ", "Has a great view from the second floor!"], "author": "Niran L.", "review": "Have eaten here for years and definitely enjoy all the offerings. Service and food is great. I usually get the crispy chicken fried rice, pad thai, tom ka soup, or green curry fried rice. All are money money moneyyyyy. If it gets too crowded try Thailand Restaurant on Castro! Has a great view from the second floor!", "rating": 5, "date": "2013-09-17"}, {"excerpts": ["Tom Yum Soup, Tom Ka Soup, Pad Thai, Pram Ram Garlic Basil Eggplant all the food is delicious I havent had anything there that I didnt like. ", "Super friendly staff and great waiters. ", "This is my top choice for Thai food in the Castro."], "author": "Jake T.", "review": "I eat here about once a week. The food is wonderful. Tom Yum Soup, Tom Ka Soup, Pad Thai, Pram Ram Garlic Basil Eggplant all the food is delicious I havent had anything there that I didnt like. Super friendly staff and great waiters. This is my top choice for Thai food in the Castro.", "rating": 5, "date": "2012-03-10"}, {"excerpts": ["One day when I was not feeling well, I ordered the Tom Ka Soup  with coconut and lemon grass et. ", "al.  "], "author": "Vanilla C.", "review": "For a casual (no need to dress up) and dimly lit place to eat, this place to yummy for the low prices that they charge.   I usually go there for lunch.  \n\nhey have daily Lunch specials that are really reasonable.  Plus that men that work their are very polite and most of them are very cute too.  I have eaten there about 6 times and  the service has always been consistent and attentive.  \n\nThai Chef Spring Rolls, these are the kind that are not fried and are very good. I love the dipping sauce that comes with it.  One day when I was not feeling well, I ordered the Tom Ka Soup  with coconut and lemon grass et. al.  Loved the texture and of course the lemon grass really gives it a kick.\n\nTry their  fried Angel Prawns (they are not greasy, and they are very crispy)\nthey are coated with a coconut & bread crumb mixture and served with a sweet  plum sauce.  I have had so many dishes here, that I can write a long list but I'll stop with that.\n\nThe bathrooms are nice and clean and a wheel chair can get in their as well as the restaurant.  The atmosphere is quiet is  is decorated with dark toned colors.", "rating": 3, "date": "2010-10-07"}, {"excerpts": ["I am completely obsessed with their Tom Ka soup, which is definitely some of the best I've had.  "], "author": "louda l.", "review": "Pretty damn good, if you ask me.\n\nI am completely obsessed with their Tom Ka soup, which is definitely some of the best I've had.  The green papaya salad and shrimp rolls are fantastic, and I've never had a problem with service.  \n\nIt is a bit difficult to order over the phone, but they deliver quickly when you do.\n\nJust as a side note to Eric M., food poisoning typically occurs 24 hours (or more) after you've eaten something.  Whatever you're sick from was probably the day before.  I'm not saying that it couldn't have occurred from what you ate at this restaurant, but is more common to react after a longer incubation period.", "rating": 4, "date": "2008-04-30"}, {"excerpts": ["I always order the Tom ka soup spicy and have fried bananas with honey for dessert. ", "The menu is priced right too."], "author": "Ryan M.", "review": "They only Thai place I eat at. Great service and awesome food. The BBQ beef on white rice is very filling and perfectly seasoned. I always order the Tom ka soup spicy and have fried bananas with honey for dessert. The menu is priced right too.", "rating": 5, "date": "2009-09-23"}, {"excerpts": ["Shame I can't remember, but I believe my friend had the pad kee mao, which he seemed to have enjoyed, as well as his order of tom ka soup with chicken. ", "I had not had pad thai in so long, and was happy to try Thai Chef 2's rendition of the dish. ", "The overarching flavor I got, even after generous squeezes of lemon, was mostly sweet. ", "I did run into one pocket of spicy (which I could have increased if I had asked for condiments, but decided against), but thought the traditional mix of spicy, sour, sweet, salty, and possibly even bitter could have been more present in the dish. ", "Beautiful presentation, and timely, friendly service. ", "So three-and-half stars for flavor, but four stars overall. ", "Did I mention the host was hot?"], "author": "Ryan T.", "review": "Very reasonable for standard Thai fare. I had the privilege of lunching here with a friend earlier today. Gorgeous host! Shame I can't remember, but I believe my friend had the pad kee mao, which he seemed to have enjoyed, as well as his order of tom ka soup with chicken. I had not had pad thai in so long, and was happy to try Thai Chef 2's rendition of the dish. The overarching flavor I got, even after generous squeezes of lemon, was mostly sweet. I did run into one pocket of spicy (which I could have increased if I had asked for condiments, but decided against), but thought the traditional mix of spicy, sour, sweet, salty, and possibly even bitter could have been more present in the dish. Beautiful presentation, and timely, friendly service. So three-and-half stars for flavor, but four stars overall. Did I mention the host was hot?", "rating": 4, "date": "2009-05-24"}], "po tak soup": [], "thai chef fried rice": [], "basil fried rice": [{"excerpts": ["We also ordered the Basil Fried Rice, Duck Basil and a rice noodle dish that my friend says was Pad Woon Sen.  ", "This was the only miss here due to the rice noodles were overcooked and soggy/watery.  "], "author": "Bill L.", "review": "I can't believe I've never tried this place prior to now. A friend and I wanted to try someplace new in the neighborhood.  We started off with the Tom Yum Soup. It had great flavor and we finished every drop.  We also ordered the Basil Fried Rice, Duck Basil and a rice noodle dish that my friend says was Pad Woon Sen.  This was the only miss here due to the rice noodles were overcooked and soggy/watery.  I deducted a star for that. \n\nService was friendly.", "rating": 4, "date": "2016-01-06"}], "green curry fried rice": [{"excerpts": ["I usually get the crispy chicken fried rice, pad thai, tom ka soup, or green curry fried rice. ", "All are money money moneyyyyy. ", "If it gets too crowded try Thailand Restaurant on Castro! ", "Has a great view from the second floor!"], "author": "Niran L.", "review": "Have eaten here for years and definitely enjoy all the offerings. Service and food is great. I usually get the crispy chicken fried rice, pad thai, tom ka soup, or green curry fried rice. All are money money moneyyyyy. If it gets too crowded try Thailand Restaurant on Castro! Has a great view from the second floor!", "rating": 5, "date": "2013-09-17"}, {"excerpts": ["I had the Green Curry Fried Rice with chicken; included were string beans, bamboo shoots included. ", "I was an almost generous portion and spicy, making it a great dish that I recommend to anyone. ", "I tried some of my friend's Garlic Rice and it was amazing. "], "author": "Phil H.", "review": "The atmosphere is very pleasant at Thai Chef where you can great Thai food for a moderate prices. The lighting is low and they put effort into making the place feel trendy and welcome at the same time. I went with two friends on a Saturday evening and we were seated right after we walked in. \n\nI had the Green Curry Fried Rice with chicken; included were string beans, bamboo shoots included. I was an almost generous portion and spicy, making it a great dish that I recommend to anyone. I tried some of my friend's Garlic Rice and it was amazing. It's something different and delicious! \n\nOverall, great Thai place, reasonably priced for the dishes and the atmosphere. And it's location only a half-block from Castro St. on 18th makes it a convenient Thai spot.", "rating": 4, "date": "2011-08-03"}, {"excerpts": ["The green curry fried rice is really good as a share plate.  ", "Even with chicken or beef, there are better options if it's the only thing you're ordering.  ", "The appetizers are very average, basically things that have been fried.  ", "Hard to mess that up, but nothing stands out.  ", "One thing I have to point out, they serve the absolute worst pad thai I've ever had.  ", "It's cloying, sweet and syrupy with overcooked starchy noodles.   ", "I asked for some lime to cut through the sweetness (isn't that normally served with Pad Thai anyway???) ", "and the server brought back lemon.  "], "author": "P J.", "review": "It's basically take-out Thai, but with tables if you want to eat there.   The beer and wine list is REALLY short and REALLY from aisle 3 at 7Eleven, so if you have a table at home and anything that's a step up from Bud Light (not kidding) or cooking sherry, I'd get your food to go.  I like the food and service at Thailand Restaurant better (plus it's family owned), but Thai Chef delivers.  Cold + Rain = Tolerance for Average.  Most of the food I've had at Thai Chef is ok - not great, not bad.  Haricot vert in the panang curry chicken is a little odd, but not a big deal and otherwise good.  The green curry fried rice is really good as a share plate.  Even with chicken or beef, there are better options if it's the only thing you're ordering.  The appetizers are very average, basically things that have been fried.  Hard to mess that up, but nothing stands out.  One thing I have to point out, they serve the absolute worst pad thai I've ever had.  It's cloying, sweet and syrupy with overcooked starchy noodles.   I asked for some lime to cut through the sweetness (isn't that normally served with Pad Thai anyway???) and the server brought back lemon.  I said, \"No, I meant lime\" and he walked away and returned with a bigger plate of lemons.\n\nService has been really hospitable on most occassions, but one night we were sitting at our table waiting to be served and they brought our food out in take-out containers bagged and ready to go because, well, it seems that they were ready to go.\n\nI'd rather give it 2.5 stars, but I know I'll keep eating here so I'm rounding up.  In short, if you're walking by and it's that time of day, there are worse places to stop.    Otherwise, it isn't any better than the 3 other Thai restaurants you could walk to in any neighborhood.", "rating": 3, "date": "2007-11-28"}, {"excerpts": ["my friend got the green curry fried rice ", "and it was sooo good! ", "i tried getting the same dish at another thai restaurant ", "but it was not the same! ", "i'd come back here to get it"], "author": "Priscilla W.", "review": "came here last night on pink saturday! wanted a place to eat that wasn't packed. it was my first time here, so i got my regular order of pad see ew bc you can't go wrong with that! it was ok. my friend got the green curry fried rice and it was sooo good! i tried getting the same dish at another thai restaurant but it was not the same! i'd come back here to get it", "rating": 4, "date": "2009-06-28"}], "crispy chicken fried rice": [{"excerpts": ["Their crispy chicken fried rice is a little too oily, but I can't stop eating it. \n\n"], "author": "Myk S.", "review": "I love getting their Tom Kha Gai there. Probably my favorite out of all the places I've been too. Perfect amount of sour, and I love the mushrooms that they use!\n\nTheir crispy chicken fried rice is a little too oily, but I can't stop eating it. \n\nIt's a bit pricey for The food there, but to me still better than the other two in the Castro.", "rating": 4, "date": "2017-02-15"}, {"excerpts": ["Best crispy chicken fried rice ", "I ever had and their prices are great. ", "It's definitely my favorite place for Thai food in a great area: Castro"], "author": "Eliana C.", "review": "Best crispy chicken fried rice I ever had and their prices are great. It's definitely my favorite place for Thai food in a great area: Castro", "rating": 5, "date": "2016-10-05"}, {"excerpts": ["I usually get the crispy chicken fried rice, pad thai, tom ka soup, or green curry fried rice. ", "All are money money moneyyyyy. ", "If it gets too crowded try Thailand Restaurant on Castro! ", "Has a great view from the second floor!"], "author": "Niran L.", "review": "Have eaten here for years and definitely enjoy all the offerings. Service and food is great. I usually get the crispy chicken fried rice, pad thai, tom ka soup, or green curry fried rice. All are money money moneyyyyy. If it gets too crowded try Thailand Restaurant on Castro! Has a great view from the second floor!", "rating": 5, "date": "2013-09-17"}], "crispy vermicelli noodles": [], "chicken noodles": [], "jan pad poo": [{"excerpts": ["I ordered:\nJan Pad Poo-there aren't many Thai restaurants that offer this dish.  ", "I love it.  ", "Thin noodles, crab, onions, veggies.  ", "Like the Pad Thai but spicier and with crab. "], "author": "Ting B.", "review": "It is hard for me to like Thai food that it's Krung Thai (first thai food that I've ever had).  This place is comparable, even better!\n\nI ordered:\nJan Pad Poo-there aren't many Thai restaurants that offer this dish.  I love it.  Thin noodles, crab, onions, veggies.  Like the Pad Thai but spicier and with crab. My ultimate favorite dish and this place did it justice. \n\nPad Thai-Chicken: Thin noodles. Check. Not too soggy. Check. Great consistency. Check.\n\nPapaya Salad-veggy: YUM.\n\nMy first time here and I already want to come back for more!", "rating": 4, "date": "2012-03-08"}], "duck pad kee mao": [], "pad see eiw": [{"excerpts": ["He ordered the $9.95 Pad See Eiw with Chicken that included bamboo shoots, carrots, cabbage, onions and a mystery gravy (photo: http://bit.ly/1huBe3A). ", "I went on a similar path and got the same priced Pad Thai with Pork and the usual suspects - tofu, egg, bean sprouts and green onion (photo: http://bit.ly/1crlPMQ). ", "It was OK and just OK, nothing special and rather by-the numbers, although I won't go as far to say the cook went to correspondence school. "], "author": "Ed U.", "review": "Do you remember that Sally Struthers infomercial back in the nineties for the International Correspondence School? She would tell you that you could earn your degree without setting foot into a classroom to start your highly lucrative career in VCR Repair, PacMan Design, Handgun Repair, and the list went on and on and on. I must have missed the one for Osha Thai Wannabe Restaurant Management. Not that I think Osha Thai is all that, but there are sure a lot of darkly lit Thai spots that have the same vibe and serve basically the same plates of food with little distinction (photo: http://bit.ly/ON9XA2). That's how I barely remember Thai Chef on 18th near Castro, surely inspired by Sally's sound advice.\n\nFirst things first, the staff is very friendly. They're very helpful in pointing out the 116 items (...yes, 116) on their menu not including beverages (photo: http://bit.ly/Naz3aO). The $6.95 Thai Chef Spring Rolls were first, they always are (photo: ). Jamie W. had been here before, so he knew to get the flat noodles, the Thai chow fun if you will. He ordered the $9.95 Pad See Eiw with Chicken that included bamboo shoots, carrots, cabbage, onions and a mystery gravy (photo: http://bit.ly/1huBe3A). I went on a similar path and got the same priced Pad Thai with Pork and the usual suspects - tofu, egg, bean sprouts and green onion (photo: http://bit.ly/1crlPMQ). It was OK and just OK, nothing special and rather by-the numbers, although I won't go as far to say the cook went to correspondence school. But maybe...\n\nFOOD - 3 stars...middling Thai dishes have flavor but lack distinction\nAMBIANCE - 3 stars...presumably inspired by Osha Thai, all of them\nSERVICE - 4 stars...friendly and attentive\nTOTAL - 3 stars...Sally has a diploma she wants to send you", "rating": 3, "date": "2014-03-01"}, {"excerpts": ["Pad See Eiw (Pork Chow Fun)\n"], "author": "Clifford L.", "review": "Gem of the Castro!\n\nAngel Wings\nAngel Prawns\nCalamari salad\nBBQ beef salad\nPad See Eiw (Pork Chow Fun)\nTamarind Fish\nJasmine rice\n\nThe cook has redeemed herself/ The previous 2 visits were disappointing & embarrassing.", "rating": 5, "date": "2012-03-08"}, {"excerpts": ["Examples: the claypot seafood will have your senses swimming as soon as the lid is uncovered and the fragrant, curried steam rises from the morsels of fish, shellfish and vegetables; even the simple pad see eiw with beef ", "is a perfect combination of soft wide noodles, tender marinated beef and crisp braised greens, with a light sauce that does not drown out the various components.  "], "author": "Yan L.", "review": "Thai Me Up... \n\n... and slap me silly with flat noodles!  In the heart of the Castro, a casual place for tasty food, nice service, and reasonable prices.   Dinner for two with drinks around $40.  Go back?  All the time.\n\nPlace/Service.  A simple box of a space with a modern edge and touches of asiatic accents.  Usually not a problem grabbing a table unless you come with a big party, but even then the tables are easily configured, and eating alone here is just fine too.  The reception is always friendly unless the host is distracted by too many takeout orders; the initial service is sometimes spotty, but once your order is in, the food comes quickly. \n\nFood/Beverage.  Of the many Thai restaurants in the City, I find the food here fresh and delicious.  Definitely a fun place to go with a group so that many dishes can be ordered and shared family-style.*  As with all ethnic cuisines, there are many styles, and I happen to like the offerings here.  Be it spicy or not, I find that the ingredients of every dish all pop with distinctive taste and texture.  Examples: the claypot seafood will have your senses swimming as soon as the lid is uncovered and the fragrant, curried steam rises from the morsels of fish, shellfish and vegetables; even the simple pad see eiw with beef is a perfect combination of soft wide noodles, tender marinated beef and crisp braised greens, with a light sauce that does not drown out the various components.  As for drinks, not much of a wine list, so stick to something simple like a glass of sauvignon blanc, or just order a Singha beer or hot tea.\n\n* Query: what's with diners in asian restaurants ordering individual \"entrees\" and not sharing?  come on, when in Rome... oops, wrong continent but you get the picture...", "rating": 3, "date": "2008-03-25"}, {"excerpts": ["beef pad see eiw and the seafood claypot. ", "Everything was presented nicely and delicious. ", "The only complain I have is the pad see ", "eiw ", "- it wasn't as tasty as others that I've had. ", "There wasn't enough sauce in it or something ", "and it was a bit bland. ", "The claypot had prawns, scallops, mussels, fish and zucchini and the curry sauce was really yummy! ", "The portions are generous too. ", "We're definitely coming back to try other things!"], "author": "Gladys C.", "review": "What a yummy place with a great decor and atmosphere. My boyfriend and I stopped by for a Thai ice-tea to go and picked up a menu. I saw so many good dishes on the menu that we decided to go back for dinner. The service was great and the prices are reasonable. We had shrimp & chicken tom yum soup, beef pad see eiw and the seafood claypot. Everything was presented nicely and delicious. The only complain I have is the pad see eiw - it wasn't as tasty as others that I've had. There wasn't enough sauce in it or something and it was a bit bland. The claypot had prawns, scallops, mussels, fish and zucchini and the curry sauce was really yummy! The portions are generous too. We're definitely coming back to try other things!", "rating": 4, "date": "2006-07-04"}], "crispy egg noodles": [], "panang curry": [{"excerpts": ["Wife had the tofu Panang Curry and loved every morsel. ", "There was a sweetness to it which was appreciated after the fiery salad. ", "I had the roasted Duck which was in a fabulous sweet and sour sauce. ", "Only problem was that I had to spend a lot of time cutting away the fat. ", "The meat was delicious and reminded me of the sauce used on Chinese spare ribs. ", "Skipped the wine and opted for lemon ginger tea which was perfect for the meal."], "author": "Joe M.", "review": "Walked by many times never dined here. Glad we did. Greeted very warmly by the hostess (owner?) From start to finish everyone was pleasant and accommodating. Had the green papaya salad as an app and it was terrific. Asked for medium spice and it was for sure. Wife had the tofu Panang Curry and loved every morsel. There was a sweetness to it which was appreciated after the fiery salad. I had the roasted Duck which was in a fabulous sweet and sour sauce. Only problem was that I had to spend a lot of time cutting away the fat. The meat was delicious and reminded me of the sauce used on Chinese spare ribs. Skipped the wine and opted for lemon ginger tea which was perfect for the meal.", "rating": 4, "date": "2016-07-04"}, {"excerpts": ["Had the three meat panang curry which was good, but all the meats were deep fried in thick breading and it was topped with fried basil.  "], "author": "Alan H.", "review": "Another 'just ok' Thai food restaurant in the castro.  Had the three meat panang curry which was good, but all the meats were deep fried in thick breading and it was topped with fried basil.  They should have called it the 'Three fried curry\" haha or fast food curry.\n\nI did enjoy that they had a few different options for rice (ginger, garlic, brown, coconut, etc).  Appetizers were standard, but were really over priced.\n\nIm going to stick with my favorite Thai in the castro  Thai House Express.", "rating": 3, "date": "2011-12-28"}, {"excerpts": ["Anyway... we started out with an appetizer which was the fried tofu with peanut sauce.. and for entrees we ordered the Panang Curry, Roasted Duck, and Sauteed Eggplant.  ", "I think the Panang Curry was one of the worst curries I have ever had.  ", "I'm not saying that it was horrible... ", "but the curry was very runny like water rather than a consistency of what curry should be.  "], "author": "Jasen L.", "review": "Met my friends for dinner in the Castro and we couldn't decide what to eat.  We all never tried this place so we decided to give it a go.  It was a little past 7pm and was pretty empty... I think there was 2 other tables seated.  \n\nAnyway... we started out with an appetizer which was the fried tofu with peanut sauce.. and for entrees we ordered the Panang Curry, Roasted Duck, and Sauteed Eggplant.  I think the Panang Curry was one of the worst curries I have ever had.  I'm not saying that it was horrible... but the curry was very runny like water rather than a consistency of what curry should be.  The eggplant was kind of forgettable... but we all agreed the roasted duck was very very good.. flavorful and tasty!\n\nThe food came out pretty quickly, the service was good, and the prices seem fair.  I cant say I would recommend this place or not recommend it.  The food was average.", "rating": 3, "date": "2010-02-11"}, {"excerpts": ["Also, the panang curry and pad gra prow are nothing to write home about.  "], "author": "Vicente G.", "review": "Watered down Thai food is not cool!\n\nOK, I've been to Thailand and loved it!  Not just to Bangkok, but to the Isan, the Mekong River border, Suphanburi, Loei, Ayuthaya, etc.  I know what Thai food is supposed to taste like.  Hell!  Thai people are convinced I'm actually Thai!  Even after showing my CA driver's license, one post office worker could still identify my origins to a specific Thai province.  Weird!\n\nAnyway, I understand that some restaurants adjust flavors to accommodate the American taste buds, but this is ridiculous!  Fresh spring rolls smothered in tamerind sauce should not taste slightly better than murky sewer water.  Also, the panang curry and pad gra prow are nothing to write home about.  You'll probably fall asleep before you finish the letter.\n\nOur waiter sucked!  The only words we heard were, \"You ready to order?\"  We didn't hear \"How is the food?\", \"Do you need more water?\", \"Are you done?\", \"Can I take your check?\", etc.  But he was unusually friendly when we were walking out!  He finally looked us in the eyes and smiled enthusiastically.  To think of it, this behavior has been consistent during all my visits.  Not good.\n\nThe one star is for the ultra-nice hostess and the woman who took our payment.  Yes I ate what I ordered, but would I ever got back?  Probably not.  I've eaten there maybe 5 times, and I've ordered \"to go\" maybe 3 times.  After that many tries, I've finally realized that this place just doesn't serve good Thai food.  Yes, it's edible, but so is dog food.  That doesn't necessarily mean that it tastes like Thai food.  We had our leftovers packaged to go, but we probably won't eat them.  (Now that's saying a lot because I was raised a poor-ass mofo!)\n\nIt's pretty ironic that their website says \"Kiss boring Thai goodbye!\"  Did they taste their food?!", "rating": 2, "date": "2007-02-04"}, {"excerpts": ["Haricot vert in the panang curry chicken is a little odd, but not a big deal and otherwise good.  "], "author": "P J.", "review": "It's basically take-out Thai, but with tables if you want to eat there.   The beer and wine list is REALLY short and REALLY from aisle 3 at 7Eleven, so if you have a table at home and anything that's a step up from Bud Light (not kidding) or cooking sherry, I'd get your food to go.  I like the food and service at Thailand Restaurant better (plus it's family owned), but Thai Chef delivers.  Cold + Rain = Tolerance for Average.  Most of the food I've had at Thai Chef is ok - not great, not bad.  Haricot vert in the panang curry chicken is a little odd, but not a big deal and otherwise good.  The green curry fried rice is really good as a share plate.  Even with chicken or beef, there are better options if it's the only thing you're ordering.  The appetizers are very average, basically things that have been fried.  Hard to mess that up, but nothing stands out.  One thing I have to point out, they serve the absolute worst pad thai I've ever had.  It's cloying, sweet and syrupy with overcooked starchy noodles.   I asked for some lime to cut through the sweetness (isn't that normally served with Pad Thai anyway???) and the server brought back lemon.  I said, \"No, I meant lime\" and he walked away and returned with a bigger plate of lemons.\n\nService has been really hospitable on most occassions, but one night we were sitting at our table waiting to be served and they brought our food out in take-out containers bagged and ready to go because, well, it seems that they were ready to go.\n\nI'd rather give it 2.5 stars, but I know I'll keep eating here so I'm rounding up.  In short, if you're walking by and it's that time of day, there are worse places to stop.    Otherwise, it isn't any better than the 3 other Thai restaurants you could walk to in any neighborhood.", "rating": 3, "date": "2007-11-28"}], "roasted duck curry": [{"excerpts": ["I had the deep fried wontons and roasted duck curry stew with rice, which were yummy ", "and I also had a bottle of Singha. ", "We had our fill plus a tinge of buzz that was just enough for the next bar."], "author": "Rey Q.", "review": "A friend who lives in the area did not actually recommend this place.  I'm guessing it's mainly due to poor service rather than the food. We were gastronomically pressed and this is one of the first few restaurants you'll see after getting off the subway, so we went ahead to see for ourselves why there's not a lotta love.\n\nWe were greeted by a relatively perky waitstaff and did not have to wait for a table. We got the menus and, for some reason, we were left alone for a long time.  Our drinks were finally ordered after probably reading through the menu 5 times, from cover to cover. \n\nIt's a good thing we were patient enough to wait for our orders because the food was actually good. I've been to several Thai restaurants and Thai Chef's food is not too shabby. I had the deep fried wontons and roasted duck curry stew with rice, which were yummy and I also had a bottle of Singha. We had our fill plus a tinge of buzz that was just enough for the next bar.", "rating": 3, "date": "2012-04-08"}], "spaghetti seafood green curry": [], "pumpkin curry": [{"excerpts": ["They also used to serve the pumpkin curry in a kabocha squash, which was very charming. ", "That was not the case during our last visit. ", "Service was attentive though and we will not give up on it just yet."], "author": "Audra S.", "review": "The quality has slipped a little bit here. This used to be our go to place for Thai in the Castro, but the last time we dined in, the Thom Kha soup was cold and not as flavorful as it was in the past. They also used to serve the pumpkin curry in a kabocha squash, which was very charming. That was not the case during our last visit. Service was attentive though and we will not give up on it just yet.", "rating": 3, "date": "2015-11-20"}, {"excerpts": ["The pumpkin curry is SO bomb! ", "It comes in a real pumpkin - too awesome! ", "The ambiance is very intimate & the service was exceptional. ", "A must go for THE best Thai food!"], "author": "Fahren F.", "review": "AMAZINGGGGG!!! The pumpkin curry is SO bomb! It comes in a real pumpkin - too awesome! The ambiance is very intimate & the service was exceptional. A must go for THE best Thai food!", "rating": 5, "date": "2012-08-26"}, {"excerpts": ["Thai iced tea, yellow curry, pad see yew, pumpkin curry. ", "Service is friendly. ", "I've got no complaints. "], "author": "Aleyna S.", "review": "The Beef salad appetizer is a winner. Everything I've tried here is solid too... Thai iced tea, yellow curry, pad see yew, pumpkin curry. Service is friendly. I've got no complaints. Nothing fancy, but if you're looking for take out or something casual and affordable to eat, this is a good option in the Castro.\n\nOn a side note, I like the dinner ambience as well. It's warm and cozy. Definitely not romantic, but cozy.", "rating": 4, "date": "2013-06-06"}, {"excerpts": ["The best thai in the Castro period - pumpkin curry comes in real pumpkin!\n", "love the thai iced tea too."], "author": "Randy S.", "review": "The best thai in the Castro period - pumpkin curry comes in real pumpkin!\nlove the thai iced tea too.", "rating": 5, "date": "2012-01-03"}, {"excerpts": ["Decent Thai food until I tried the pumpkin curry. ", "I'm now hooked on this place forever. ", "Run, don't walk. ", "Run to Thai Chef and try the pumpkin curry. ", "It's served in a half pumpkin and there are so many different layers to the flavors that my mouth is watering just thinking about it. ", "Other meals I enjoy there include Pad Thai and Yellow Curry and Veggies. ", "I wish they had more vegetarian appetizers without seafood, but the menu is otherwise pretty extensive.  ", "The ambience is peaceful. ", "It's quiet and the service is fast. ", "Prices are very reasonable too. ", "A great neighborhood Thai place!!"], "author": "John C.", "review": "Decent Thai food until I tried the pumpkin curry. I'm now hooked on this place forever. Run, don't walk. Run to Thai Chef and try the pumpkin curry. It's served in a half pumpkin and there are so many different layers to the flavors that my mouth is watering just thinking about it. Other meals I enjoy there include Pad Thai and Yellow Curry and Veggies. I wish they had more vegetarian appetizers without seafood, but the menu is otherwise pretty extensive.  The ambience is peaceful. It's quiet and the service is fast. Prices are very reasonable too. A great neighborhood Thai place!!", "rating": 5, "date": "2013-07-10"}, {"excerpts": ["But both dishes we had, the pumpkin curry with chicken and a broccoli dish with pork had very little meat. ", "The dishes were tasty but when you are paying $10+/dish I expect to see the meat and not have to dig around for it. ", "I also felt that a scoop of brown rice for $2.50 ($5 for 2) was way out of line."], "author": "Bill B.", "review": "Service was ok. But both dishes we had, the pumpkin curry with chicken and a broccoli dish with pork had very little meat. The dishes were tasty but when you are paying $10+/dish I expect to see the meat and not have to dig around for it. I also felt that a scoop of brown rice for $2.50 ($5 for 2) was way out of line.", "rating": 2, "date": "2012-04-09"}], "spicy basil": [{"excerpts": ["We got a tasty appetizer, and the spicy basil chicken and sauteed eggplant.  ", "It was all very tasty and the service was friendly and fast.  ", "We also had a beer and a glass of wine.  ", "The price was reasonable, and the food was very good.  ", "We will be back, and will recommend this place to others."], "author": "Corey H.", "review": "Went here on a Saturday night.  Only had to wait about five minutes for a table.  We got a tasty appetizer, and the spicy basil chicken and sauteed eggplant.  It was all very tasty and the service was friendly and fast.  We also had a beer and a glass of wine.  The price was reasonable, and the food was very good.  We will be back, and will recommend this place to others.", "rating": 4, "date": "2010-02-28"}], "pra ram": [{"excerpts": ["I've had a lot of their dishes, and those that I seem to go back to often are the tom yum soup, the beef salad (mercy, it's good), the red curry, and the pra ram (", "the curry and the pra ram usually with chicken).  ", "It's fast, it's pleasant, the waitstaff is lovely, the food is great (try the beef salad), and the prices are reasonable."], "author": "Earline A.", "review": "I've been going to Thai Chef for several years, and I'm quite happy with it.  Overall I've had excellent, friendly service, and I've never had a bad dish.  There have been a few small bumps when the place is very full and there's a new waitperson, but overall, they've been minor.  To the reviewer who claims that the food isn't authentic Thai--I don't have a clue about that.  I've never been to Thailand.  Thai Chef's food is authentically good to my taste buds, it's consistently good and fresh, and it's served quickly.\n\nFull disclosure:  there was a time a while back when I noticed that their DPH score was low, and I avoided it for a few months.  They've done a lot of work, and they've brought it up to a very satisfactory 96.\n\nI've had a lot of their dishes, and those that I seem to go back to often are the tom yum soup, the beef salad (mercy, it's good), the red curry, and the pra ram (the curry and the pra ram usually with chicken).  I tend to stay away from the duck dishes, as I do at many Thai and Chinese places, because there's never enough duck for my taste, and what there is tends to be too fatty for me.  \n\nIt's fast, it's pleasant, the waitstaff is lovely, the food is great (try the beef salad), and the prices are reasonable.", "rating": 5, "date": "2015-10-20"}], "sauteed eggplant": [{"excerpts": ["Anyway... we started out with an appetizer which was the fried tofu with peanut sauce.. and for entrees we ordered the Panang Curry, Roasted Duck, and Sauteed Eggplant.  ", "I think the Panang Curry was one of the worst curries I have ever had.  ", "I'm not saying that it was horrible... ", "but the curry was very runny like water rather than a consistency of what curry should be.  "], "author": "Jasen L.", "review": "Met my friends for dinner in the Castro and we couldn't decide what to eat.  We all never tried this place so we decided to give it a go.  It was a little past 7pm and was pretty empty... I think there was 2 other tables seated.  \n\nAnyway... we started out with an appetizer which was the fried tofu with peanut sauce.. and for entrees we ordered the Panang Curry, Roasted Duck, and Sauteed Eggplant.  I think the Panang Curry was one of the worst curries I have ever had.  I'm not saying that it was horrible... but the curry was very runny like water rather than a consistency of what curry should be.  The eggplant was kind of forgettable... but we all agreed the roasted duck was very very good.. flavorful and tasty!\n\nThe food came out pretty quickly, the service was good, and the prices seem fair.  I cant say I would recommend this place or not recommend it.  The food was average.", "rating": 3, "date": "2010-02-11"}, {"excerpts": ["We got a tasty appetizer, and the spicy basil chicken and sauteed eggplant.  ", "It was all very tasty and the service was friendly and fast.  ", "We also had a beer and a glass of wine.  ", "The price was reasonable, and the food was very good.  ", "We will be back, and will recommend this place to others."], "author": "Corey H.", "review": "Went here on a Saturday night.  Only had to wait about five minutes for a table.  We got a tasty appetizer, and the spicy basil chicken and sauteed eggplant.  It was all very tasty and the service was friendly and fast.  We also had a beer and a glass of wine.  The price was reasonable, and the food was very good.  We will be back, and will recommend this place to others.", "rating": 4, "date": "2010-02-28"}, {"excerpts": ["Cashew chicken nut is amazing and the sauteed eggplant is my second favorite. ", "However being a fan of curry I have to say that the duck curry is spectacular and is easily my number one."], "author": "J D.", "review": "Best Thai food for your dollar in SF hands down. I have tried a majority of the dishes and have yet to not like any of them. Coconut shrimp curry is great and is also served in a coconut. Cashew chicken nut is amazing and the sauteed eggplant is my second favorite. However being a fan of curry I have to say that the duck curry is spectacular and is easily my number one.", "rating": 5, "date": "2010-12-30"}], "spicy fresh ginger": [], "garlic pepper": [{"excerpts": ["We ordered garlic pepper seafood and beef. ", "My friend said oh it won't be spicy since she ordered it at other restaurants ", "and they're not ", "which is fine with me since I'm not a spicy kind of eater. ", "My cousin ordered the Pad Sieu(sp). ", "The wait for the food wasn't that bad. ", "Then we tasted the garlic pepper dishes and they were freaking spicy as hell. ", "We asked one of the waiters if it's usually spicy since other restaurants garlic pepper isn't. ", "He said yes they are usually spicy and instead of offering if we would like another dish or ask the chef to get another serving to be not as spicy ", "he just left."], "author": "Mike O.", "review": "I went to this place tonight after a basketball game around 9. The place was a lil empty since its Wednesday night. The lady in front said we'll sit you guys by the window so people can see people eating. Fine by me.\n\nWe ordered garlic pepper seafood and beef. My friend said oh it won't be spicy since she ordered it at other restaurants and they're not which is fine with me since I'm not a spicy kind of eater. My cousin ordered the Pad Sieu(sp). The wait for the food wasn't that bad. Then we tasted the garlic pepper dishes and they were freaking spicy as hell. We asked one of the waiters if it's usually spicy since other restaurants garlic pepper isn't. He said yes they are usually spicy and instead of offering if we would like another dish or ask the chef to get another serving to be not as spicy he just left.I should say the other dishes were good though.\n\nThen came the check. We were only a party of 4 but they charged us included in the total a 18% gratuity! We asked them why we were charged gratuity since it's usually for a party of 5 or more. What they said was it's not on the menu but their boss said they can charge it anytime they want. WTH! And she said to be honest a lot of people don't tip. Um lady how does that pertain to us? Ugh but I can understand why some people don't tip, their service sucks.\n\nNot going back to this place again. Ok food and bad customer service.", "rating": 2, "date": "2011-12-01"}, {"excerpts": ["the least favorite was the garlic pepper beef. \n\n"], "author": "Tofer M.", "review": "came back for dinner:\n\ni must say that it was a lot better then my lunch experience, though my lunch experience wasnt bad. the food overall was pretty good this time the dinner consisted of:\n\n-Salmon Salad\nSalmon with lemon grass, ginger, red & green onions, mint leaves and lemon dressing\n\n-Garlic Pepper Beef\nPan fried garlic & pepper with Beef\n\n-Sautéed Eggplant\nSautéed tofu eggplant w/bean sauce, garlic, chili & basil\n\n-Yellow Curry\nYellow curry w/coconut milk, carrots, potatoes, chicken & onions, served w/cucumber salad\n\nthe best dish this time was the sautéed Eggplant, excellent favors and just really well done. the curry was good, maybe just a little dry but not bad. the least favorite was the garlic pepper beef. \n\nanother added bonus was the carafe they brought for the iced tea we had ordered and the cute little tea pot for the hot tea. they still had those little added touches like the rose origami on the straw.", "rating": 4, "date": "2010-06-30"}], "sauteed baby corn": [], "mixed vegetables": [], "sauteed broccoli": [], "spicy fresh chili": [], "spicy string beans": [], "chicken cashew nuts": [], "bbq entree": [], "sauteed silver noodles": [], "kin na ree": [], "duck basil": [{"excerpts": ["My favorites: Beef Salad with its smokey grilled flavor; Duck Basil has the perfect sweet and sour combination. ", "More sweet than sour; Duck curry (I think it's panang) is heavenly too.   ", "And oh yes the crispy whole fish is nom nom nom."], "author": "Ed F.", "review": "By far one of my favorite Thai restaurants. Even when I travel I use Thai chef as the bar to compare other Thai foods. My favorites: Beef Salad with its smokey grilled flavor; Duck Basil has the perfect sweet and sour combination. More sweet than sour; Duck curry (I think it's panang) is heavenly too.   And oh yes the crispy whole fish is nom nom nom.", "rating": 5, "date": "2016-03-21"}, {"excerpts": ["We also ordered the Basil Fried Rice, Duck Basil and a rice noodle dish that my friend says was Pad Woon Sen.  ", "This was the only miss here due to the rice noodles were overcooked and soggy/watery.  "], "author": "Bill L.", "review": "I can't believe I've never tried this place prior to now. A friend and I wanted to try someplace new in the neighborhood.  We started off with the Tom Yum Soup. It had great flavor and we finished every drop.  We also ordered the Basil Fried Rice, Duck Basil and a rice noodle dish that my friend says was Pad Woon Sen.  This was the only miss here due to the rice noodles were overcooked and soggy/watery.  I deducted a star for that. \n\nService was friendly.", "rating": 4, "date": "2016-01-06"}], "song sa hai": [], "phuket skewer": [], "three taste panang": [{"excerpts": ["Their \"Three Taste Panang\" is amazing! ", "Seriously, one of the best Thai places in San Francisco!"], "author": "Jeremy C.", "review": "I love this place! Their \"Three Taste Panang\" is amazing! Seriously, one of the best Thai places in San Francisco!", "rating": 5, "date": "2015-03-29"}], "sam sa hai pad khing": [], "spicy prawns": [{"excerpts": ["The highlight of the meal was the spicy prawns topped with red curry paste. ", "But six prawns swimming in the curry are not worth $14 in my book. "], "author": "Matt Y.", "review": "August 11 Dinner\n\nNot so great. The corn fritters were overcooked and had thick batter. My usual staple at any Thai restaurant---Gai Kra Prow (sauteed chicken with basil and vegetables) is too sweet and not spicy, even I put in an request for spicy. The highlight of the meal was the spicy prawns topped with red curry paste. But six prawns swimming in the curry are not worth $14 in my book. They also charged $2.50 for a scoop of brown rice. \n\nOverall there are better Thai places in the city. Maybe it's just the Castro so they can get away with mediocre food. I should have known better when I overheard the huge party next to us ordering nothing but Pad Thai and Pad See Ew with peanut sauce. \n\nDinner for two $35", "rating": 2, "date": "2012-08-28"}], "spicy fish": [{"excerpts": ["I really like their garlic eggplant and spicy fish!  ", "Also, I love that they deliver up until 10PM and their portions are huge.  ", "The people who own the place are really nice too."], "author": "Christie F.", "review": "I really like their garlic eggplant and spicy fish!  Also, I love that they deliver up until 10PM and their portions are huge.  The people who own the place are really nice too.", "rating": 4, "date": "2008-11-05"}], "fried duck with crispy chinese broccoli": [], "soft shell crab lover": [], "clay pot seafood": [], "spicy trout fish": [], "prawn asparagus": [], "tamarind fish": [{"excerpts": ["Tamarind Fish\nJasmine rice\n\n"], "author": "Clifford L.", "review": "Gem of the Castro!\n\nAngel Wings\nAngel Prawns\nCalamari salad\nBBQ beef salad\nPad See Eiw (Pork Chow Fun)\nTamarind Fish\nJasmine rice\n\nThe cook has redeemed herself/ The previous 2 visits were disappointing & embarrassing.", "rating": 5, "date": "2012-03-08"}, {"excerpts": ["We also got the tamarind fish and that was really good also. "], "author": "Marco M.", "review": "Tried this spot after a film at the Jewish Film Festival @ the Castro Theater. We started with the corn cakes which my wife loved and I thought were a little too \"fried.\" They came with a cucumber relish. We also got the pineapple fried rice with shrimp and it was very good and not too sweet. My wife thought the shrimp were delicious and perfectly cooked. We also got the tamarind fish and that was really good also. A bit on the pricey - the rice was $12.95, the fish $13.95.\n\nThe very best thing though was this table of young queens next to us who kept saying stuff like, \"I'm not sharing anything with you, biiiitch, I don't want to catch your v.d.\" Or when someone dropped a plate at least two of them shrieked. They were darling. As was the scenery in general in the Castro.", "rating": 4, "date": "2009-07-27"}, {"excerpts": ["Try the tamarind fish!  ", "And the stuffed chicken wings!  "], "author": "Alex D.", "review": "It's overall a decent place to get a bite to eat.\n\nTry the tamarind fish!  And the stuffed chicken wings!  The more random stuff on the menu seems to be better than the typical pad thai, satay sticks options that many people seem to order.\n\nPrices ok. Service quick. And waitstaff nice... decent choice for castro (considering there really isn't anything really super to eat in the castro... sadly)", "rating": 3, "date": "2008-08-29"}], "ginger fish": [{"excerpts": ["The ginger fish is a delicious (but too well-hidden on the menu) dish, and the cashew chicken is wonderful.  "], "author": "Evan G.", "review": "Consistently good Thai food.  \n\nThe ginger fish is a delicious (but too well-hidden on the menu) dish, and the cashew chicken is wonderful.  The brown rice is tasty, and the service is uber-friendly (even though they're Thai, not German).\n\nAnd, if you need a good ol' standard, the pad Thai is also consistently good.\n\nBut somebody turn up the lights - it's always so dark in here, so you almost always walk by it 30 times before you know it's there.", "rating": 3, "date": "2008-02-20"}], "vegetarian fried tofu": [], "gai jay": [], "ka ree puff": [], "tofu satay": [{"excerpts": ["Just like most asian take out places, it takes a little while until you learn what you like off their menu, for me it's the veggie pra-ram and tofu satay."], "author": "Allyson S.", "review": "After a soggy mishap the first time  got take out here, Thai Chef has very quickly become one of my favorite neighborhood take out places. Just like most asian take out places, it takes a little while until you learn what you like off their menu, for me it's the veggie pra-ram and tofu satay.", "rating": 5, "date": "2009-08-03"}, {"excerpts": ["The tofu satay is amazing as well as the pineapple fried rice and red curry duck..", "hell I have not had anything bad there!! ", "hip hip hooray ", "and they are kid friendly in ", "he day time for sure"], "author": "Kitty L.", "review": "this is my new favorite Thai place! The tofu satay is amazing as well as the pineapple fried rice and red curry duck..hell I have not had anything bad there!! hip hip hooray and they are kid friendly in he day time for sure", "rating": 5, "date": "2008-12-17"}, {"excerpts": ["The one great thing on the menu is the tofu satay. ", "The pad thai and the pineapple fried rice are meh."], "author": "V R.", "review": "I have yet to find really good Thai food in the bay area. This place is ok, they are priced decently but the food isn't that great. The one great thing on the menu is the tofu satay. The pad thai and the pineapple fried rice are meh.", "rating": 3, "date": "2009-05-28"}], "vegetarian spring rolls": [], "vegetarian fresh spring rolls": [], "vegetarian papaya salad": [{"excerpts": ["We ordered vegetarian papaya salad and there was fish sauce in it. ", "I mentioned this to the waitress and she said you should have mentioned no fish sauce. ", "I told her that's not my job.. if it's advertised as vegetarian on the menu it needs to be vegetarian. "], "author": "Jimmy C.", "review": "WARNING!!! Do not come here if you're vegetarian. The wait staff has no concept of what that means. We ordered vegetarian papaya salad and there was fish sauce in it. I mentioned this to the waitress and she said you should have mentioned no fish sauce. I told her that's not my job.. if it's advertised as vegetarian on the menu it needs to be vegetarian. THEN THE VEGGIE PAD THAI CAME OUT AND IT HAD FISH SAUCE IN IT AS WELL!! And this is after we mentioned vegetarian means no fish sauce. I have not eaten meat in over seven months.. now I feel sick to my stomach and completely crippled.. Again do not come here if you are vegetarian. They have no respect nor basic professionalism for people like us. Go to Thai House Express instead.. please!", "rating": 1, "date": "2018-05-28"}], "peanut dressing salad": [], "vegetarian silver noodle soup": [], "veggie tom yum soup": [], "veggie tom kha soup": [], "veggie pra ram": [], "tofu basil": [], "crispy tofu basil": [], "sauteed mixed veggies": [], "spicy veggie fish": [], "veggie pad thai": [{"excerpts": ["THEN THE VEGGIE PAD THAI CAME OUT ", "AND IT HAD FISH SAUCE IN IT ", "AS ", "WELL!! ", "And this is after we mentioned vegetarian means no fish sauce. ", "I have not eaten meat in over seven months.. ", "now I feel sick to my stomach and completely crippled.. ", "Again do not come here if you are vegetarian. ", "They have no respect nor basic professionalism for people like us. ", "Go to Thai House Express instead.. please!"], "author": "Jimmy C.", "review": "WARNING!!! Do not come here if you're vegetarian. The wait staff has no concept of what that means. We ordered vegetarian papaya salad and there was fish sauce in it. I mentioned this to the waitress and she said you should have mentioned no fish sauce. I told her that's not my job.. if it's advertised as vegetarian on the menu it needs to be vegetarian. THEN THE VEGGIE PAD THAI CAME OUT AND IT HAD FISH SAUCE IN IT AS WELL!! And this is after we mentioned vegetarian means no fish sauce. I have not eaten meat in over seven months.. now I feel sick to my stomach and completely crippled.. Again do not come here if you are vegetarian. They have no respect nor basic professionalism for people like us. Go to Thai House Express instead.. please!", "rating": 1, "date": "2018-05-28"}], "veggie pad see eiw": [], "veggie kee mao": [], "veggie raad na": [], "veggie fried rice": [], "veggie spicy fried rice": [{"excerpts": ["I just had the veggie spicy fried rice which was also good but not spicy at all.  ", "I added some chili paste but it still wasn't hot enough ", "so I sprinkled on some chili powder and that did the trick.  ", "The tofu was properly prepared and the veggies were al dente.  ", "I didn't think I could finish it, but I liked it so much that I did finish it.\n", "Our server was a very nice lady who tended to us very well.\n", "It was not the best, authentic Thai food I've ever had, but I would go back for a nice, inexpensive meal."], "author": "Philip C.", "review": "We had not been to Thai Chef in a couple of years, but my partner wanted Thai food so we took our visiting friend Charles on Wednesday.\nMy first impression was the decor had been upgraded very nicely.  The host gave us a nice table very quickly.\nMy partner had a cup of the Tom Ka soup which he liked very much.  For an entree, he had Pad Thai and liked that, too.\nI just had the veggie spicy fried rice which was also good but not spicy at all.  I added some chili paste but it still wasn't hot enough so I sprinkled on some chili powder and that did the trick.  The tofu was properly prepared and the veggies were al dente.  I didn't think I could finish it, but I liked it so much that I did finish it.\nOur server was a very nice lady who tended to us very well.\nIt was not the best, authentic Thai food I've ever had, but I would go back for a nice, inexpensive meal.", "rating": 3, "date": "2011-05-26"}], "veggie yellow curry": [], "veggie green curry": [{"excerpts": ["A rough estimate of the dishes we had:  cucumber salad, chicken satay, fresh spring rolls, veggie green curry, chicken yellow curry, salmon red curry, pad thai, pad see ew, chicken cashew nut, something with prawns, ginger rice, coconut rice, garlic rice, and fried bananas at the end.  "], "author": "Jess k.", "review": "My friend recently had his birthday here about 6 pm on a Saturday night.  We had a group of about 10 people.  The waitstaff were very nice, however, they didn't come around enough to refill my water.  And they weren't very fast to bring the check, but that's my experience with most Thai restaurants.  The restaurant really began to fill up around 7:30.\n\nThe food was delicious, but the portions were average.  My friends and I shared about 10 dishes, including flavored rice, between 10 people.  It was enough to fill everyone up, but we only had a small taste of every dish.\n\nA rough estimate of the dishes we had:  cucumber salad, chicken satay, fresh spring rolls, veggie green curry, chicken yellow curry, salmon red curry, pad thai, pad see ew, chicken cashew nut, something with prawns, ginger rice, coconut rice, garlic rice, and fried bananas at the end.  I can't remember what else we had, but it was all pretty good.\n\nThe dishes I really enjoyed were:  pad see ew, pad thai with tofu, chicken cashew nut, and garlic rice.  The pad see ew was like every other one I've had, but delicious nonetheless.  The pad thai noodles were cooked perfectly and it didn't have the weird overly vinegary taste some pad thais have!  However, it needed more side veggies and tofu.  Everyone loved the garlic chicken!  The garlic rice had a really great flavor that wasn't overpowering. \n\nIn my opinion, there wasn't enough chicken in the yellow curry, nor enough salmon in the red curry.  They seem to be kinda skimpy on the meat and tofu here, except in the case of the chicken cashew nut.\n\nThe greatest thing about this restaurant is that I brought a birthday cake for my friend, and they were kind enough to serve it to us, birthday candle and all!\n\nFor ten people, including appetizers, two desserts, various drinks, we escaped out of there with a bill of about $165.  I'd definitely come back.", "rating": 4, "date": "2010-03-13"}], "veggie red curry": [], "veggie panang curry": [], "ice tea": [{"excerpts": ["They have very delicious thai ice tea. ", "They have plenty of flavor in their food. ", "They could maybe use a little more herbs though."], "author": "Brent N.", "review": "They have very delicious thai ice tea. They have plenty of flavor in their food. They could maybe use a little more herbs though.", "rating": 4, "date": "2013-08-08"}], "hot jasmine green tea": [], "fresh young coconut juice": [], "decaf herb tea": [], "steamed small noodle": [], "steamed spaghetti": [], "ginger rice": [{"excerpts": ["A rough estimate of the dishes we had:  cucumber salad, chicken satay, fresh spring rolls, veggie green curry, chicken yellow curry, salmon red curry, pad thai, pad see ew, chicken cashew nut, something with prawns, ginger rice, coconut rice, garlic rice, and fried bananas at the end.  "], "author": "Jess k.", "review": "My friend recently had his birthday here about 6 pm on a Saturday night.  We had a group of about 10 people.  The waitstaff were very nice, however, they didn't come around enough to refill my water.  And they weren't very fast to bring the check, but that's my experience with most Thai restaurants.  The restaurant really began to fill up around 7:30.\n\nThe food was delicious, but the portions were average.  My friends and I shared about 10 dishes, including flavored rice, between 10 people.  It was enough to fill everyone up, but we only had a small taste of every dish.\n\nA rough estimate of the dishes we had:  cucumber salad, chicken satay, fresh spring rolls, veggie green curry, chicken yellow curry, salmon red curry, pad thai, pad see ew, chicken cashew nut, something with prawns, ginger rice, coconut rice, garlic rice, and fried bananas at the end.  I can't remember what else we had, but it was all pretty good.\n\nThe dishes I really enjoyed were:  pad see ew, pad thai with tofu, chicken cashew nut, and garlic rice.  The pad see ew was like every other one I've had, but delicious nonetheless.  The pad thai noodles were cooked perfectly and it didn't have the weird overly vinegary taste some pad thais have!  However, it needed more side veggies and tofu.  Everyone loved the garlic chicken!  The garlic rice had a really great flavor that wasn't overpowering. \n\nIn my opinion, there wasn't enough chicken in the yellow curry, nor enough salmon in the red curry.  They seem to be kinda skimpy on the meat and tofu here, except in the case of the chicken cashew nut.\n\nThe greatest thing about this restaurant is that I brought a birthday cake for my friend, and they were kind enough to serve it to us, birthday candle and all!\n\nFor ten people, including appetizers, two desserts, various drinks, we escaped out of there with a bill of about $165.  I'd definitely come back.", "rating": 4, "date": "2010-03-13"}], "egg fried rice": [], "steamed flat noodle": [], "fried egg": [], "coconut ice cream": [], "fried banana with honey": [], "roti with sweet condensed milk": [], "thailand rolls": [], "thailand fresh rolls": [], "gari paab": [], "tao hoo tod": [], "tod man": [], "full moon": [], "goong gra bawg": [], "angel wings": [{"excerpts": ["Not because I don't want to try the rest of the menu, but I would feel guilty for foregoing the pineapple fried rice, angel wings, or signature Thai iced tea. "], "author": "Alex H.", "review": "Thai Chef has been my SF go-to-restaurant every time I am in the area - living abroad kills me when I am having a craving! Sydney is not shy of Thai restaurants, but they have nothing on this place. It is in a great area and always hits the spot.\n\nI must admit  that I don't often stray from my personal favourites. Not because I don't want to try the rest of the menu, but I would feel guilty for foregoing the pineapple fried rice, angel wings, or signature Thai iced tea. I have never left unsatisfied!\n\nThe portions are good, prices are fair, atmosphere is comfortable and the experience is memorable!\n\nLooking forward to my next trip home. yumm!", "rating": 5, "date": "2013-09-23"}, {"excerpts": ["Angel Wings\n"], "author": "Clifford L.", "review": "Gem of the Castro!\n\nAngel Wings\nAngel Prawns\nCalamari salad\nBBQ beef salad\nPad See Eiw (Pork Chow Fun)\nTamarind Fish\nJasmine rice\n\nThe cook has redeemed herself/ The previous 2 visits were disappointing & embarrassing.", "rating": 5, "date": "2012-03-08"}], "thailand ruam mit": [], "gang kiew wan": [], "pa nanang": [], "gang deng": [], "gang garee gai": [], "gang ped yang": [], "gang deng salmon": [], "gai song kreung": [], "gai him ma pan": [], "nuea yang": [], "ped yang nam peung": [], "pad kao pod": [], "pad khing": [], "pad prik khing": [], "pad broccoli": [], "pad ma keau": [], "pad prik": [], "pad ga praw": [], "gra tieam prik tai": [], "pla muk ga praw": [], "pla muk choop pang tod": [], "pla muk ga tieam": [], "goong ga tieam": [], "goong pea seau": [], "choo chee goong": [], "pra ram goong": [], "pad woon sen goong": [], "pla raad prik": [], "pla saam ros": [], "pad talay": [], "goong ga praw": [], "thailand duck": [], "spicy seafood curry in clay pot": [], "ga praw talay": [], "ga praw duck": [], "fish ball noodles soup": [], "seafood noodles soup": [], "pad thai woon sen": [], "raad na": [{"excerpts": ["While the curries are a hit & miss a few times I was there, their Pad Thai and Raad Na have been excellent for the most part.\n\n"], "author": "Andy P.", "review": "To be honest, Thai Chef has never disappointed nor pleasantly surprised me.\n\nThey offer the traditional dishes found in other Thai restaurants.  While the curries are a hit & miss a few times I was there, their Pad Thai and Raad Na have been excellent for the most part.\n\nPrices are reasonable considering they are in Castro district.  I am sure that you will find cheaper prices if you opt to walk around Tenderloin and other seedy parts of the city.  \n\nThe staff (waiters/waitresses, servers and bussers) are always very friendly.  They are very easy to talk to, and offer suggestions when asked.  I have always thought Thai people are nice and respectful and folks here do just that!  They cannot pass by your table without smiling!  \n\nThe place itself is very well-lighted, but dim enough so there's an air of romance should you decide to bring a date with you.  I have, at times, seen couples (straight and gay) holding hands or gazing at each other's eyes.  Now, I guess it depends on your marital status...that kind of PDA may either nauseate you, make you feel jealous, or make you feel all gooey inside with happy feelings!\n\nI have eaten at this place on a regular monthly basis and does not hesitate in recommending it when friends want to go to a rather inexpensive Thai restaurant with good ambiance.\n\nI would give it a 3.5...but since there are no half stars..I'm rounding it off to a 4!", "rating": 4, "date": "2008-03-18"}], "thailand fried rice": [], "soft shell crab fried rice": [], "som tum salad": [], "salad kak salad": [], "yum tao hoo salad": [], "yum sai roong salad": [], "tom ka pak soup": [], "gang jued woon sen soup": [], "pad sai roong": [], "pad pak spinach": [], "pak raum mit": [], "tao hoo ga graw": [], "pra ram pak": [], "pad thai jay": [], "kao pad kee mao tao hoo": [], "pad see eiw tao hoo": [], "raad na pak": [], "gluten pad khing": [], "tom yum pak soup": [], "yum yai salad": [], "yum woon sen salad": [], "yum saw meun salad": [], "labb gai salad": [], "labb ped salad": [], "yum nuea salad": [], "yum pla muk salad": [], "yum talay salad": [], "ang jued woon sen": [], "tom ka gai": [{"excerpts": ["Tom Ka Gai very well, too."], "author": "Ken B.", "review": "I like this place.  Unpretentious, tasty food, reasonable prices, no wait.  They do Tom Ka Gai very well, too.", "rating": 3, "date": "2007-05-20"}], "tom ka goong": [], "tom yum gai": [{"excerpts": ["I've only had the tom yum gai soup here, but it's one of my favorites in SF. ", "Perfect amount of spiciness, not too many leaves and stalks. ", "It's my go-to soup when I have a head cold."], "author": "Jade S.", "review": "I've only had the tom yum gai soup here, but it's one of my favorites in SF. Perfect amount of spiciness, not too many leaves and stalks. It's my go-to soup when I have a head cold.", "rating": 4, "date": "2013-08-23"}], "tom yum goong": [], "poh taag": [], "tom ka talay": []}