{"pieces garlic butter chicken wings": [], "pieces soft shell crab mango rice paper roll": [], "piece roasted duck rice paper roll": [], "piece quail": [], "piece tofu tod": [], "piece fish cake": [], "piece sticky rice ball": [], "pieces golden shrimp": [], "piece chicken satay": [], "piece shrimp roll": [], "piece veggie roll": [], "tom yam  sour and spicy soup": [], "tom kha sour and spicy coconut soup": [], "soft shell crab mango and papaya salad": [], "shrimp papaya salad": [], "squid red cabbage salad": [], "beef mix cabbage salad": [], "larb chicken": [], " half order of any sour and spicy soup": [], "special thai noodle soup": [], "woonsen noodle soup": [], "shrimp garlic noodle": [], "roasted duck yellow curry noodle": [], "shrimp pad thai": [{"excerpts": ["Had the shrimp pad Thai and can't complain that they load it with shrimp.. ", "That was a big plus... ", "Definitely would go back."], "author": "Keeks P.", "review": "Not bad for a local spot for lunch. Had the shrimp pad Thai and can't complain that they load it with shrimp.. That was a big plus... Definitely would go back.", "rating": 4, "date": "2016-03-31"}], "pad sew": [{"excerpts": ["I LOVE their duck pad sew ew and catfish GP. ", "I don't think duck pad sew ew is a common dish in Thai restaurants ", "so I have nothing to compare it to ", "but I crave this dish all the time. ", "The catfish GP is fried to perfection and the flavoring is amazing. "], "author": "Megan L.", "review": "This is one of my favorite Thai restaurants in SF! I LOVE their duck pad sew ew and catfish GP. I don't think duck pad sew ew is a common dish in Thai restaurants so I have nothing to compare it to but I crave this dish all the time. The catfish GP is fried to perfection and the flavoring is amazing. I'm salivating just writing about it. \n\nI've eaten other dishes but these 2 are def my top. Their fried tofu is also really good!! \n\nThe place is pretty clean and service is good. I'd recommend this place for sure!", "rating": 5, "date": "2017-05-25"}, {"excerpts": ["Your Pad Sew with BBQ pork is a full-blown addiction I can't do without.\n", "Your Spicy Peanut Sauce is so deliciously peanut-y ", "it's cause to shout. \n", "The Green Beans and Fungus? ", "The finest among us. \n", "And the curries - red, yellow and green - are what make my heart sing! \n", "The Papaya Salad is by far the best I've had, not to mention a certain \"Pad.", "\" \n", "The Pad Thai is tasty, without a doubt, but different than what other places tout. \n", "So enough of the rhymes, just let it be understood: Thai Cafe is unbelievably good."], "author": "Dana O.", "review": "Oh Thai Cafe, how I love thee! Let's count the ways... \nYour Pad Sew with BBQ pork is a full-blown addiction I can't do without.\nYour Spicy Peanut Sauce is so deliciously peanut-y it's cause to shout. \nThe Green Beans and Fungus? The finest among us. \nAnd the curries - red, yellow and green - are what make my heart sing! \nThe Papaya Salad is by far the best I've had, not to mention a certain \"Pad.\" \nThe Pad Thai is tasty, without a doubt, but different than what other places tout. \nSo enough of the rhymes, just let it be understood: Thai Cafe is unbelievably good.", "rating": 5, "date": "2012-12-07"}, {"excerpts": ["I got the Pad Sew Yew with chicken. ", "Their portions are a bit on the small side, given that the prices are a little more expensive compared to other Thai restaurants. ", "However, the flavor is distinct and you can tell the food is authentic. ", "My Pad Sew Yew wasn't over-the-top greasy for once, and the chicken was really tender and flavorful. ", "I'd definitely re-visit Thai Cafe again."], "author": "Linda T.", "review": "Thai Cafe is a small and cozy go-to place for Thai food. It doesn't seem to get too busy around dinner time, and it's a good place to have dinner for two. I wouldn't suggest going to Thai Cafe in large groups.\n\nThe menu is quite selective, but nothing too special. I got the Pad Sew Yew with chicken. Their portions are a bit on the small side, given that the prices are a little more expensive compared to other Thai restaurants. However, the flavor is distinct and you can tell the food is authentic. My Pad Sew Yew wasn't over-the-top greasy for once, and the chicken was really tender and flavorful. I'd definitely re-visit Thai Cafe again.", "rating": 4, "date": "2010-12-05"}, {"excerpts": ["I always have cravings for the Pad Sew (thin egg noodles with broccoli and gravy sauce).  ", "It is a little greasy ", "but sometimes that is OK especially when you have a hangover and do not have the brain power to cook for yourself.  ", "The prices are reasonable and it is within walking distance for me."], "author": "Micaela M.", "review": "I always have cravings for the Pad Sew (thin egg noodles with broccoli and gravy sauce).  It is a little greasy but sometimes that is OK especially when you have a hangover and do not have the brain power to cook for yourself.  The prices are reasonable and it is within walking distance for me.", "rating": 5, "date": "2007-09-30"}], "radna": [], "khao pad": [], "dungeness crabmeat fried rice": [], "special clay pot": [{"excerpts": ["I liked the Catfish GP (wish it was a little softer though), and the special clay pot was good. \n\n"], "author": "Paolo V.", "review": "This is my favorite Thai place at the moment. My previous favorite spot was a place called Racha Thai, which closed many many moons ago. I loved that place so much because of a hand full of dishes, the main one being the roast duck. They made it perfect, and the sauce they served with it was delish (sweet thai soy sauce with minced peppers). Since then I couldn't find another Thai place that came close.\n\nThis place is my favorite Thai place currently for one main reason....the roast duck. Nice big pieces that are juicy. It can be a miss at times, as I had the duck served to me slightly dry a couple of times. The other dishes here are at least average. I liked the Catfish GP (wish it was a little softer though), and the special clay pot was good. \n\nAll and all, a solid Thai restaurant. I give the roast duck four stars (three and a half minus the roast duck). Give this place a try!\n\nPaolo says: If any of you Yelpers know of a great spot for great Thai Roast Duck, please shoot me a message! If it's awesomely awesome...then beers on me!", "rating": 4, "date": "2012-01-02"}, {"excerpts": ["The Special Clay Pot is probably my favorite dish here at the restaurant. ", "All though it's not as Thai authentic as other dishes, it is still very flavorful and enjoyable. ", "It's a hodgepodge of chicken, Chinese sausage, pork, mushrooms and shrimp over rice in a clay pot. "], "author": "Jeff G.", "review": "I've been coming to Thai café for years, since my family first moved to San Francisco through my years I spent at USF. I have a set rotation of dishes that I enjoy and I keep coming back for. \n\nThe Special Clay Pot is probably my favorite dish here at the restaurant. All though it's not as Thai authentic as other dishes, it is still very flavorful and enjoyable. It's a hodgepodge of chicken, Chinese sausage, pork, mushrooms and shrimp over rice in a clay pot. The cooking juices from the cooked meat form a delicious sauce that lightly covers the white rice giving it a delicious taste.\n\nI also recommend:\n\nFried Calamari- The fish sauce makes it taste better.\n\nSea Food Combination- A little weird with the ground chicken but it works. \n\nCho Chee Seafood- A little more kick and sauce compared to the Combo. \n\nBasil Chicken- Equally good.\n\nI would give this place 5 stars, however I often find myself waiting a while before the server comes. Furthermore, they have remodeled the place quite a few times over the years and with each time the price goes up. This was once a ($) place.\n\n5 Stars for the food, -1 for the service and price.", "rating": 4, "date": "2009-09-30"}], "mix green": [], "mixed vegetable with tofu": [], "pad curry vegetable": [], "lemongrass tomatoes oxtails": [], "beef cube": [{"excerpts": ["My partner absolutely loves their Beef Cube. ", "Their lunch menu is also quite simple and affordable. ", "The service is also really nice. ", "Besides the mentioned three, there wasn't anything else on the menu that was really all that great for me. ", "I still go there regularly, but only for the big 3."], "author": "Sudha S.", "review": "Since this place is so close to where I live, this is one of my usual Thai craving area. My favorite thing in this restaurant has to be their Thai Fried Rice and Garlic Shrimp Noodle. My partner absolutely loves their Beef Cube. Their lunch menu is also quite simple and affordable. The service is also really nice. Besides the mentioned three, there wasn't anything else on the menu that was really all that great for me. I still go there regularly, but only for the big 3.", "rating": 4, "date": "2016-05-03"}], "prawns bacon": [], "prawns garlic pepper": [], "house red curry": [], "catfish gp": [{"excerpts": ["I LOVE their duck pad sew ew and catfish GP. ", "I don't think duck pad sew ew is a common dish in Thai restaurants ", "so I have nothing to compare it to ", "but I crave this dish all the time. ", "The catfish GP is fried to perfection and the flavoring is amazing. "], "author": "Megan L.", "review": "This is one of my favorite Thai restaurants in SF! I LOVE their duck pad sew ew and catfish GP. I don't think duck pad sew ew is a common dish in Thai restaurants so I have nothing to compare it to but I crave this dish all the time. The catfish GP is fried to perfection and the flavoring is amazing. I'm salivating just writing about it. \n\nI've eaten other dishes but these 2 are def my top. Their fried tofu is also really good!! \n\nThe place is pretty clean and service is good. I'd recommend this place for sure!", "rating": 5, "date": "2017-05-25"}, {"excerpts": ["I also can't get enough of the Catfish GP.  ", "Every time I go there, they already assume I'm getting the catfish because it's my default dish.  "], "author": "Bailey N.", "review": "If you care about what actual ethnicity is making your food, then I suggest you never patronize any Japanese restaurants in the city because they're all pretty much run by Chinese or Koreans.  Maybe the owners of Thai Cafe are ethnic Chinese who grew up in Thailand.  Whatever the case may be, I can overlook \"authenticity\" for taste because their duck fried rice is simply the best with generous amounts of meat. Granted, you may gnaw on pieces of bones and throw it to your dog, à la Asian fob style, but the sweetened MSG-like sauce that goes with the rice is superb.\n\nI also can't get enough of the Catfish GP.  Every time I go there, they already assume I'm getting the catfish because it's my default dish.  I've tried the soups, papaya salad, duck salad, and ground basil chicken lunch special which have all been excellent.\n\nPricey for \"Thai\" with my lunches there averaging about $17.  Small price to pay on days when I need comfort food to make me happy.", "rating": 4, "date": "2015-07-29"}, {"excerpts": ["I liked the Catfish GP (wish it was a little softer though), and the special clay pot was good. \n\n"], "author": "Paolo V.", "review": "This is my favorite Thai place at the moment. My previous favorite spot was a place called Racha Thai, which closed many many moons ago. I loved that place so much because of a hand full of dishes, the main one being the roast duck. They made it perfect, and the sauce they served with it was delish (sweet thai soy sauce with minced peppers). Since then I couldn't find another Thai place that came close.\n\nThis place is my favorite Thai place currently for one main reason....the roast duck. Nice big pieces that are juicy. It can be a miss at times, as I had the duck served to me slightly dry a couple of times. The other dishes here are at least average. I liked the Catfish GP (wish it was a little softer though), and the special clay pot was good. \n\nAll and all, a solid Thai restaurant. I give the roast duck four stars (three and a half minus the roast duck). Give this place a try!\n\nPaolo says: If any of you Yelpers know of a great spot for great Thai Roast Duck, please shoot me a message! If it's awesomely awesome...then beers on me!", "rating": 4, "date": "2012-01-02"}, {"excerpts": ["Other favorites are the duck fried rice and the catfish gp.\n\n"], "author": "Stan A.", "review": "Do not be turned off by the generic name. This place serves great Thai food. Or maybe they're just being modest. If that's the case, well played.\n\nMy favorite dish by far is the ground basil chicken. I've been ordering it since I was young, and trust me, even if you've been to a ton of Thai restaurants, you haven't had basil chicken like this. Bold statement, I know, but I stand by it. Make sure to ask them to make it spicier. Other favorites are the duck fried rice and the catfish gp.\n\nIt's easy to get to, parking is easy, and the place is rarely full, so you won't have to worry about any of that. My only (tiny) gripe is that it's a bit overpriced, but if this is what it takes for my favorite Thai place to stay open, then so be it! Feel free to go to King of Thai for a quick fix, but if you have a fever, and the only prescription is more Thai food, come here.", "rating": 4, "date": "2012-07-11"}, {"excerpts": ["I recommend the catfish GP and the dry pan fried string beans."], "author": "Hirokazu S.", "review": "A low-key Thai restaurant with great food! I get take out from there 2-3 times a month. I recommend the catfish GP and the dry pan fried string beans.", "rating": 4, "date": "2013-03-03"}], "catfish pot": [{"excerpts": ["He gets the seafood soup or sometimes the catfish pot.  ", "(If you get the catfish pot, ask them to add veggies -- they can and will add some veggies for a few extra bucks and it really adds depth to the dish.)\n\n"], "author": "Gary A.", "review": "OK, this place is a bit of a hole-in-the-wall.  More than a little bit of a hole-in-the wall.  The dining room is very small -- about 12 tables.  The décor is nothing to write home about.  It ain't bad but it is not \"breathtaking\" but more functional.\n\nIf you can get past the experience, the food is very solid.  I go with my dad.  He gets the seafood soup or sometimes the catfish pot.  (If you get the catfish pot, ask them to add veggies -- they can and will add some veggies for a few extra bucks and it really adds depth to the dish.)\n\nI usually get the larb, which is very solid.  I also enjoy the prawns with basil.\n\nThe ingredients are all fresh.  The dishes are well balanced and well prepared.\n\nThe service is friendly.  They are not super fast -- particularly if they are busy -- but the food comes out fast enough.\n\nIt can be a bit of a bear to park in that neighborhood -- so if you can walk or take the bus -- but go!", "rating": 4, "date": "2017-05-11"}, {"excerpts": ["Papaya salad, catfish pot, shrimp noodle bowl, followed up with sticky rice with coconut icecream. ", "Yummm!"], "author": "Uday W.", "review": "Spent a delightful evening here with my wife. No delay in seating, quick service, tasty and fresh food. Papaya salad, catfish pot, shrimp noodle bowl, followed up with sticky rice with coconut icecream. Yummm!", "rating": 5, "date": "2017-01-07"}], "tango catfish": [], "choochee seafood": [], "beef spicy basil": [], "ground chicken": [{"excerpts": ["My favorite dishes are the Kang Curry w/Duck and the Eggplant w/Ground Chicken. "], "author": "Jack D.", "review": "Delicious food, super-friendly service, great prices, and spotlessly clean. Thai Cafe has been rocking it on Geary for 35+ years... and frankly this is THE place to go for Thai food in San Francisco. \n\nMy favorite dishes are the Kang Curry w/Duck and the Eggplant w/Ground Chicken. For reals, these dishes are so good that you'll remember how awesome they taste. \n\nHighly recommended.", "rating": 5, "date": "2017-12-27"}, {"excerpts": ["The Pad Thai, Basil Ground Chicken, Praram Beef, and Soft Shell Crab dishes are awesome and an even greater bargain when part of a lunch combo."], "author": "Orlando J.", "review": "I've been going to this place since at least the turn of the century . So I'm surprised I haven't done a review all these years. There was a time when they had to close for some remodeling and then they had this weird business schedule which made it hard for me to figure out when they were open. Anyway, they're on a normal and regular schedule now and that's all that matters. In the 18 years I've been going to this place, their food has been always consistently good. The Fried Calamari they serve up at this place is truly.. one of a kind. The crunchy garlicky flavor of the Calamari combined with the salty sweet dipping sauce is a delicious treat. My wife and I always use it as a standard to compare other Calamari dishes and so far, nothing really equals it. Next, the Clay Pot rice. Mmm Mmm Mmm!!! Filled with Bbq Pork, Chinese Sausage, Chicken, and Mushrooms.. my mouth is watering just talking about it. The Pad Thai, Basil Ground Chicken, Praram Beef, and Soft Shell Crab dishes are awesome and an even greater bargain when part of a lunch combo.", "rating": 4, "date": "2018-09-15"}, {"excerpts": ["The eggplant with ground chicken had such a wonderful savory flavor and was accented with spicy chilis. "], "author": "Harper C.", "review": "This place was open for dinner on NYE, so yay. \n\nThe server was very kind and attentive, but not annoyingly so. \n\nWe had Pad Thai with chicken that was more moist than I've had before, but had a great flavor. The Thai Fried Rice with shrimp and bbq pork was excellent. The eggplant with ground chicken had such a wonderful savory flavor and was accented with spicy chilis. Lastly, we had the duck and spinach. The spinach was cooked well and had a lovely color. The dish comes with a special chef sauce that was slightly sweet and lovely. The duck was so-so. \n\nOverall, we had a very nice experience.", "rating": 4, "date": "2017-12-31"}, {"excerpts": ["They have a ground chicken and basil dish that I cherish (and no one else has), and their curries are sublime.  ", "The appetizer prawns are also always perfect.  ", "I put them on a par with Royal Thai in San Rafael, which is another reliable favorite."], "author": "Richard L.", "review": "I've been going here (eat in and take out) for over 20 years since I was introduced by an insurance agent.  They are authentic (I lived in Thailand for over a year) and the quality never waivers.  They have a ground chicken and basil dish that I cherish (and no one else has), and their curries are sublime.  The appetizer prawns are also always perfect.  I put them on a par with Royal Thai in San Rafael, which is another reliable favorite.", "rating": 5, "date": "2016-11-08"}, {"excerpts": ["My favorites: ground chicken, duck fried rice, eggplant with shrimp and calamari. ", "Better than OSHA which is over priced."], "author": "Dom P.", "review": "My favorites: ground chicken, duck fried rice, eggplant with shrimp and calamari. Better than OSHA which is over priced.", "rating": 4, "date": "2014-05-15"}, {"excerpts": ["I'm a huge fan of the ground chicken and green beans, and the red curry.  "], "author": "Christy L.", "review": "Another favorite lunch spot! \n\nIt's close by work, always seems to have parking close by and offers excellent lunch combo specials...served up fast and hot!\n\nI'm a huge fan of the ground chicken and green beans, and the red curry.  I also like the papaya salad.\n\nService is fast...in and out and back to work.", "rating": 4, "date": "2013-12-12"}, {"excerpts": ["I also really like the ground chicken with rice AND ", "the roast duck fried rice haha. ", "I swear ! ", "Ive been coming here for so many years now and they have so many good foooood!"], "author": "N S.", "review": "I lovee this placee! We go here often . We would always order either the \"tofu top\" or the \"fishcakes\" ITS SO GOOD. U could tell they made it themselves. And i love the hot and sour noodle soup! ITS SO GOOD! LIKE OMG I LOVE IT! Andd i love the thai ice tea . And the service is good too. Haha. I also really like the ground chicken with rice AND the roast duck fried rice haha. I swear ! Ive been coming here for so many years now and they have so many good foooood!", "rating": 5, "date": "2012-07-05"}, {"excerpts": ["We usually order the combination clay pot, ground chicken and squid with basil leaves, tofu pod, pork chop, garlic noodles with prawns and many more."], "author": "Monique N.", "review": "I love this place.  I have been coming to Thai Cafe for over a decade. The food is always good and consistent.  Great service and reasonable price.  I come with my family like once a week.  We usually order the combination clay pot, ground chicken and squid with basil leaves, tofu pod, pork chop, garlic noodles with prawns and many more.", "rating": 5, "date": "2013-04-28"}, {"excerpts": ["Ground chicken is good..."], "author": "Johnny C.", "review": "Lunch specials are great! Ground chicken is good...", "rating": 4, "date": "2013-02-09"}, {"excerpts": ["In the olden days, it used to be listed as Pad Ka Prow...ground chicken with basil and mint, but now it's listed as just Ground Chicken with a more detailed description beneath.  ", "I enjoyed the ground chicken, the sweet/spicy vegetable soup, and the two spring rolls.  ", "Not bad at all. "], "author": "Roy N.", "review": "Been coming here on and off for the last ten years.  Popped in with a friend for a late lunch noticed that the menu looked different from the last time I had been there which was a while ago.  The decor and menu looked a lot nicer than I remembered it being.  Anyway, I was happy to see that my favorite dish was still on there.  In the olden days, it used to be listed as Pad Ka Prow...ground chicken with basil and mint, but now it's listed as just Ground Chicken with a more detailed description beneath.  For some reason, this is the one dish that I have consistently craved and ordered every time I come here.\n\nI've had this dish elsewhere and there are other delicious versions out there, but everyone else makes it sweeter and more oily.  The version here is not very oily and is more dry than what you normally get in other Thai places...some might even say it's too dry.  However, taste is subjective and for me, I have always loved the way Thai Cafe makes it.\n\nI noticed that there is now a lunch special that they call a Set Meal for only $10.95 which includes entree, choice of soup, and vegetable or seafood spring roll (egg roll?).  When the food came out, I was happy...the presentation was nice, the portions ample, and the food was good.  I enjoyed the ground chicken, the sweet/spicy vegetable soup, and the two spring rolls.  Not bad at all. Although I didn't have any, the portions for the roast duck looked pretty good too.\n\nYears ago, there were always the same two ladies working the front desk there.  One was always happy, smiling, and nice, while the other was always the exact opposite.  I think she was the one that turned me off to this place over the years.  Not sure if it's true, but I was told by my friend that the owner changed a while ago.\n\nAnyway, I like this place again and will definitely be back to try some of the other dishes.  The waiter we had was really nice and cool too.  Nice balance of taste, portions, and service in a cute little place at a good price.", "rating": 4, "date": "2008-12-03"}, {"excerpts": ["Best ground chicken and basil. ", "I have been going for years. ", "Also, try ground chicken with calamari and bamboo shoots. ", "excellent. ", "nice clean and quite."], "author": "Dee B.", "review": "Best ground chicken and basil. I have been going for years. Also, try ground chicken with calamari and bamboo shoots. excellent. nice clean and quite.", "rating": 4, "date": "2014-05-14"}, {"excerpts": ["The ground chicken is delicious too! ", "I've also had their pad thai which was great! ", "Duck fried rice is pretty good too. ", "Honestly, try anything here, it's all good. "], "author": "upper d.", "review": "I love Thai Cafe!!!\n\nStaff is always always welcoming and greet you with smiles when you walk in. The food here is great. One thing I love about thai food is that every dish has it's own distinct flavor/taste (unlike chinese food where everything taste basically the same and very greasy. I love chinese food though don't get it twisted haha.) The atmosphere is nice, warm, and clean!\n\nThe appetizer fried fish cakes are so good! So tasty served with the special sauce that goes with it! The ground chicken is delicious too! I've also had their pad thai which was great! Duck fried rice is pretty good too. Honestly, try anything here, it's all good. Try their thai iced tea and thai iced coffee, too!\n\nPortions are good, prices are not too pricey, and I wold suggest you try this place out especially if you're so used to King of Thai all the time. It's nice to change it up once in a while and get some real authentic Thai food.", "rating": 5, "date": "2011-02-16"}, {"excerpts": ["A little weird with the ground chicken but it works. \n\n"], "author": "Jeff G.", "review": "I've been coming to Thai café for years, since my family first moved to San Francisco through my years I spent at USF. I have a set rotation of dishes that I enjoy and I keep coming back for. \n\nThe Special Clay Pot is probably my favorite dish here at the restaurant. All though it's not as Thai authentic as other dishes, it is still very flavorful and enjoyable. It's a hodgepodge of chicken, Chinese sausage, pork, mushrooms and shrimp over rice in a clay pot. The cooking juices from the cooked meat form a delicious sauce that lightly covers the white rice giving it a delicious taste.\n\nI also recommend:\n\nFried Calamari- The fish sauce makes it taste better.\n\nSea Food Combination- A little weird with the ground chicken but it works. \n\nCho Chee Seafood- A little more kick and sauce compared to the Combo. \n\nBasil Chicken- Equally good.\n\nI would give this place 5 stars, however I often find myself waiting a while before the server comes. Furthermore, they have remodeled the place quite a few times over the years and with each time the price goes up. This was once a ($) place.\n\n5 Stars for the food, -1 for the service and price.", "rating": 4, "date": "2009-09-30"}, {"excerpts": ["\"Stir fried eggplant with ground chicken and shrimp\" which gets its heat from jalapenos, garlic and thai basil.  ", "I usually don't stray from my favorites, but I have tried their various curries (yellow, green, red) for lunch ", "and they're yummy."], "author": "Bodhi D.", "review": "I've been coming here on and off for over 15 years.  There have been changes here and there, but thank goodness my favorites are still on the menu -- I eat around a lot at other Thai restaurants, but I have yet to find another place that makes the Tofu Tod appetizer which is deep-fried tofu stuffed with fish paste and served with a spicy sweet sauce. Another go-to item for me is their eggplant dish which is their spicy \"Stir fried eggplant with ground chicken and shrimp\" which gets its heat from jalapenos, garlic and thai basil.  I usually don't stray from my favorites, but I have tried their various curries (yellow, green, red) for lunch and they're yummy.", "rating": 4, "date": "2011-03-31"}, {"excerpts": ["Great food, especially the roast duck with spinach and ground chicken with basil leaves. ", "Have been eating in this restaurant for more than 20 yrs. ", "A little expensive but worth it."], "author": "Tommy B.", "review": "Great food, especially the roast duck with spinach and ground chicken with basil leaves. Have been eating in this restaurant for more than 20 yrs. A little expensive but worth it.", "rating": 5, "date": "2010-11-07"}, {"excerpts": ["I like their ground chicken with basil, though their curries are good also."], "author": "Timothy O.", "review": "This is what you want in a neighborhood restaurant - decent food at good prices. While the banner above the entrance pronounces it \"The Best Thai Food In Town,\" you should lower your expecations and simply enjoy the fast, attentive service. I like their ground chicken with basil, though their curries are good also.", "rating": 4, "date": "2005-09-27"}, {"excerpts": ["and the spicy ground chicken, you can always count on. ", "i know a few people who are in love with it. ", "tasty thai food", ", it's better to order a few dishes and share them for a rounded meal."], "author": "Faye P.", "review": "whoa. that eggplant red curry was amazing. i LOVE lemongrass, granted it stirs up fond childhood memories...there's nothing like that zesty flavor. and the spicy ground chicken, you can always count on. i know a few people who are in love with it. tasty thai food, it's better to order a few dishes and share them for a rounded meal.", "rating": 4, "date": "2008-03-19"}], "duck and spinach": [{"excerpts": ["Lastly, we had the duck and spinach. ", "The spinach was cooked well and had a lovely color. ", "The dish comes with a special chef sauce that was slightly sweet and lovely. "], "author": "Harper C.", "review": "This place was open for dinner on NYE, so yay. \n\nThe server was very kind and attentive, but not annoyingly so. \n\nWe had Pad Thai with chicken that was more moist than I've had before, but had a great flavor. The Thai Fried Rice with shrimp and bbq pork was excellent. The eggplant with ground chicken had such a wonderful savory flavor and was accented with spicy chilis. Lastly, we had the duck and spinach. The spinach was cooked well and had a lovely color. The dish comes with a special chef sauce that was slightly sweet and lovely. The duck was so-so. \n\nOverall, we had a very nice experience.", "rating": 4, "date": "2017-12-31"}], "wings garlic pepper": [], "five spices chicken": [], "crispy beef with yellow curry": [], "steam jasmine rice": [], "steam noodles": []}