{"chieftain hot wings": [], "steak cut pub fries": [], "spicy irish potato bites": [{"excerpts": ["Anyhow, I ordered the Spicy Irish Potato Bites since I wasn't too hungry.  ", "They're basically potato stuffed with cheese and some jalapeno remnants.  ", "It wasn't spicy at all.  ", "They have a sauce that comes with it and that IS spicy and that made it a good time.  ", "They were slightly awkward to eat because of their size.  ", "They were rather big ", "and I couldn't eat them with a fork, ", "so I just used my hands (not a big deal).  ", "I think the plate had 7 or 8 of them.  ", "I wish they were smaller in size like their name suggests.  "], "author": "Shaun W.", "review": "Popped in for a birthday brunch on a Sunday.  Surprisingly busy and packed for the area.  I would assume lunch/HH on a week day would be bangin', but even on a Sunday it was busy.\n\nAnyhow, I ordered the Spicy Irish Potato Bites since I wasn't too hungry.  They're basically potato stuffed with cheese and some jalapeno remnants.  It wasn't spicy at all.  They have a sauce that comes with it and that IS spicy and that made it a good time.  They were slightly awkward to eat because of their size.  They were rather big and I couldn't eat them with a fork, so I just used my hands (not a big deal).  I think the plate had 7 or 8 of them.  I wish they were smaller in size like their name suggests.  They hit the spot and I was satisfied.\n\nThe waitresses: The one with the dyed red hair was nice.  The short blonde not so much.  They were both hungover and struggling.  There was no warm \"hello\" or any kind of welcoming introduction.  A lady was asking questions about sauces on a plate and the short blonde flippantly responded with \"What sauce do you want?\"  I didn't say anything, but internally, I was like \"WOW!\"  I definitely took notice of her attitude and made sure I said \"please\" and \"thank you\" during every interaction so I wouldn't be on the receiving end of all that.\n\nI used to work across the street and have been here before - mainly HH.  The place was clean and looked the part.\n\nMy star rating:\n\n4 for the business - food is ok.  Not bad, but not worth traveling across town for.\n\n2 for the staff.  If you are the opening staff, it's best not to party and stay out late the night before.  C'mon ladies!  It's time for adulting!", "rating": 3, "date": "2018-01-30"}, {"excerpts": ["Four words: Spicy Irish Potato Bites.\n\n", "battered deep fried mashed potato bites from heaven. \n\n", "Yours truly,\nThe thristy Irish traveler\n\nP.S. Potato Bites.... seriously."], "author": "Rachel B.", "review": "Four words: Spicy Irish Potato Bites.\n\nI should just end the review right here because I've got to get back to planning my next visit to SF to return to these beer battered deep fried mashed potato bites from heaven. \n\nIt's your standard Irish pub, no bells or whistles with the Chieftain \n\nbut you ask:\n\n\n\nRachel,\nIs this really deserving of 4 stars if it's so ordinary?\n\nand I would reply:\n\n\n\nDear Reader,\n\nYes, maybe more. Because you see, Chieftain is serving up stellar bar food that is only to be chased down with some very well maintained taps and served with a smile from the barmaid who's infectious sunny disposition will melt your heart.\n\nSo, please, take a seat and try and soak up a little luck of the Irish.\n\nYours truly,\nThe thristy Irish traveler\n\nP.S. Potato Bites.... seriously.", "rating": 4, "date": "2015-03-24"}, {"excerpts": ["* Spicy irish potato bites: ", "Hell yes. "], "author": "Sylvia L.", "review": "I've been here quite a few times, each time for a watching a major sports event. I've tried the other bars around the area (Rumors: pretty good but service is slow, and Ted's Sports Bar: DON'T GO; very old crowd and the one overwhelmed bartender tries to avoid eye contact at all costs). Service here is great and it's somehow large enough that my husband and I have always managed to end up with seats, even for the Superbowl or the NBA Finals. \n\nI really like the relaxed \"vibe\" of Chieftain. They give you a large, pretty varied menu at your table and the waitresses are friendly. The spacing of the tables is also pretty nice - you're not knocking into each other. It's probably my favorite place to watch a game and get a nice draft beer; they have quite a large selection including cocktails and wine for the beer-nonenthusiasts out there (confession: sometimes I get wine or cocktails instead; cocktails are okay but they use smaller ice which sometimes melts too quickly for my liking - I want to sip and enjoy the game...). People are generally around the late 20s and early 30s crowd and typically pretty into the game, but it's never rowdy enough that you can't hold a conversation. Just occasional extremely loud cheers. \n\nOnto the food:\n* Turkey burger: Tastes relatively light but delicious. There's jalapeno salsa and melted cheese. Comes with a small side of thick fries. \n* Buffalo wings: Not overly buffalo-ed, which I love. Comes with a side of carrots and celery, so that you feel mildly healthy.\n* Spicy irish potato bites: Hell yes. Balls of spicy mashed potatoes and jalapeno that are fried. Genius.", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["Spicy Irish Potato Bites\n2) "], "author": "Marlon T.", "review": "These are my favorite types of places to get food and drink. I think I've decided that Irish/Scottish brews are my favorite. I'm not sure if it will ever replace Belgium as the best beer-producing country in my opinion, but breweries like Murphy's or Kilkenny are too good to me. Please order one or both of these beers. It will be easy to appreciate how it goes down your esophagus. The food here is good also so don't be shy to order a burger or an appetizer.\nI consumed these items:\n1) Spicy Irish Potato Bites\n2) The 'Original' Chieftain Burger (comes with fries)\n\nYou'll probably be satisfied with these 2 items in terms of taste and amount. You should get some curry sauce on the side for the fries. I thought the fries dipped in curry was alright--I wanted to try it since I haven't before. I guess french fries and curry is a thing in Ireland. I'd definitely come back for the beer and food. Don't hesitate checking this joint out. Lastly, if you're looking for a place to watch a sports game, this place has a decent amount of flat screens.", "rating": 4, "date": "2013-01-04"}, {"excerpts": ["try their spicy irish potato bites to start and lamb burger or fish and chips for your main. ", "DELICIOUS!! ", "You cant go wrong with any of their classics too! "], "author": "Laura W.", "review": "Love this neighborhood pub!\n\nThe Chieftain is great spot to unwind after work or check out on the weekends. They have a great beer selection and rotating guest beers for every season and month. \nps check out their wide-ranging whiskey menu and drink specials!\n\nThe pub itself is pretty awesome, its decor and atmosphere really catches the true irish pub feeling, which not a lot of other irish pubs have nailed here in the city. \n\ntry their spicy irish potato bites to start and lamb burger or fish and chips for your main. DELICIOUS!! You cant go wrong with any of their classics too! =huge portions for great prices. \n\nthe staff here are AWESOME! \nwaitresses are super friendly and attentive and the bartenders know their drinks!\n\nsee you guys this sunday for next 49ers WIN!! bottomless mimosas (for ME) and coors light pints (for him)\n\nTIP****\nthey are serving $3 coors light pints/$10 coors light pitchers for ALL football games plus a $6 appetizer special of wings, sliders or potato skins =go 49ers!", "rating": 5, "date": "2014-09-30"}, {"excerpts": ["He took our drink order and suggested an appetizer- his favorite, the Spicy Irish Potato Bites (beer-battered mashed potatoes with jalepeno and cheese.) ", "The boyfriend said they were his favorite dish, and I might have to agree. ", "For the entree, we ordered clam chowder and the Fish & Chips to share.. ", "Both were fantastic. ", "The best part though, in my opinion, was Dylan asking the kitchen to split our meal for us before it was served. ", "Absolutely unexpected and obviously not necessary, but so thoughtful! ", "Men tend not to be very proficient when it comes to \"sharing\" food, so this ensured I actually got to eat too "], "author": "Leigh F.", "review": "Our first night of the long weekend in San Francisco, and all my boyfriend and I had established was that we needed to find somewhere with amazing Fish & Chips (thanks, Lent!) After perusing Yelp reviews for a while, I settled on The Chieftain- an Irish pub with great reviews that was walking distance from our hotel.\n\nOur bartender, Dylan, was phenomenally friendly and attentive. He took our drink order and suggested an appetizer- his favorite, the Spicy Irish Potato Bites (beer-battered mashed potatoes with jalepeno and cheese.) The boyfriend said they were his favorite dish, and I might have to agree. For the entree, we ordered clam chowder and the Fish & Chips to share.. Both were fantastic. The best part though, in my opinion, was Dylan asking the kitchen to split our meal for us before it was served. Absolutely unexpected and obviously not necessary, but so thoughtful! Men tend not to be very proficient when it comes to \"sharing\" food, so this ensured I actually got to eat too :)\n\nInstead of a juke box or radio, there was an incredibly talented guy singing, while playing the guitar AND harmonica. I don't think it's an exaggeration to say that he knew every single song on the planet and played them all perfectly- so impressive. We loved it, and could have stayed all night to listen.\n\nNext time we are in town, this is definitely a go-to stop!", "rating": 5, "date": "2014-03-08"}, {"excerpts": ["I had takeout one night and while the spicy irish potato bites were really delicious, the fish was soggy and had a bit too much of a fishy odor to it.  ", "It is super convenient to where I live and the service was great, so I would definitely come back for drinks and pub fare."], "author": "T U.", "review": "I had takeout one night and while the spicy irish potato bites were really delicious, the fish was soggy and had a bit too much of a fishy odor to it.  It is super convenient to where I live and the service was great, so I would definitely come back for drinks and pub fare.", "rating": 4, "date": "2014-10-08"}, {"excerpts": ["The spicy Irish potato bites we ordered as an appetizer were fantastic. ", "However, the daily special ravioli the waitress recommended was wayyyyy too salty. ", "And It wasn't just my order. "], "author": "Jugal S.", "review": "Headed here on a Wednesday night after seeing the Yelp review to meet up with some friends. Unfortunately, I was pretty disappointed with both the food and the service. \n\nThe waitress was rather slow in noticing I had joined my friend before taking my order. The high tables were cramped and uncomfortable. \n\nThe cocktails were good. I ordered the Sazerac which was quite a refreshing Green Chartreuse twist on a Manhattan. The spicy Irish potato bites we ordered as an appetizer were fantastic. However, the daily special ravioli the waitress recommended was wayyyyy too salty. And It wasn't just my order. My friend ordered a buffalo chicken wrap that also turned out to be enigmatically salty. \n\nIn addition, getting the waitress's attention was a ordeal, whether it was to order another drink or to get our check.\n\nAdmittedly, my experience at the Chieftain may have been atypical (perhaps someone was adding salt twice in the kitchen due to miscommunication), but the poor service on a Wednesday night left much to be desired for both the food and the service.", "rating": 2, "date": "2012-07-27"}, {"excerpts": ["Their spicy irish potato bites have me coming back every time. ", "So Good! ", "Its also close to the Bay Bridge and shopping on Market."], "author": "Ria B.", "review": "i love a good irish pub. i have been going to this one for a couple of years. They always have the giants game playing, good whiskey, and great food. Their spicy irish potato bites have me coming back every time. So Good! Its also close to the Bay Bridge and shopping on Market.", "rating": 5, "date": "2014-05-22"}], "crispy fried calamari": [], "grilled marinated chicken quesadilla": [], "chieftain nachos": [{"excerpts": ["We ordered the Chieftain nachos and a dozen wings.  ", "Now, I'll admit that ordering nachos in an Irish pub is generally a poor idea, so I'll go easy on these.  ", "They were completely underwhelming, the cheese was melted but not hot.  ", "The serving size was smaller than expected.  "], "author": "Andrea H.", "review": "A group of 8 of us stopped in before we saw \"Once\" the musical.  Since the musical is set in Dublin, we went with an Irish theme for drinks and an early dinner at The Chieftain.  \n\nFirst of all, the atmosphere is just perfect and lovely for an Irish Pub.  However, I sadly knocked a few points off due to the lackluster food and drink.  \n\nTo their credit, the ordering system was down the day we visited.  Everything had to be done by hand.\n\nWe ordered the Chieftain nachos and a dozen wings.  Now, I'll admit that ordering nachos in an Irish pub is generally a poor idea, so I'll go easy on these.  They were completely underwhelming, the cheese was melted but not hot.  The serving size was smaller than expected.  The wings were ok-- nothing to notable here.  \n\nThe fish and chips were average, and got the job done.  Again, nothing to notable.  ***The star of the menu appears to be the shepherd's pie** Our table ordered two plates of this dish and tasted very satisfying.  The housemade bread added extra pizzazz.    The Chieftain Irish stew receives honorable mention.  Home-cooked goodness with tender chunks of beef and veggies was topped off with excellent housemade soda bread.  \n\nWord of caution:  there is a Yelp deal for a \"specialty\" drink when you check in here.  Go ahead and pass on that-- It's a bitter-sweet pink martini-like concoction that tastes something like cough syrup.  Go for a traditional whiskey drink or Irish beer instead!!!!", "rating": 3, "date": "2014-07-09"}], "brussel sprouts": [{"excerpts": ["Special of the night: oxtail with mashed potatoes and grilled brussel sprouts. ", "Tender oxtail, buttery potatoes and addicting crispy, basalmic drizzled sprouts.  "], "author": "Fannie S.", "review": "Calamari = good appetizer. $8.95.\n\nSpecial of the night: oxtail with mashed potatoes and grilled brussel sprouts. Tender oxtail, buttery potatoes and addicting crispy, basalmic drizzled sprouts.  $15.95. \n\nMy sister tried their cheeseburger, and it hit the spot, along with steak cut fries.  Once again, another good burger!  $10.95.\n\nService = friendly, albeit very busy. \n\nPrices = moderate. But I did get to take home leftover oxtail and potatoes.", "rating": 4, "date": "2016-01-20"}], "fried zucchini": [{"excerpts": ["deals- $6 cocktails (the Moscow mule was really decent which surprised me for a pub), and the fried zucchini was yummy. "], "author": "Elena K.", "review": "They have some pretty good happy hour deals- $6 cocktails (the Moscow mule was really decent which surprised me for a pub), and the fried zucchini was yummy. The staff was also really attentive which was nice.\n\nThe beef sliders were meh, so you can probably skip those, I am curious about the corned beef sliders though, so I'll probably have to go back to give those a try.", "rating": 3, "date": "2017-04-06"}], "chieftain caesar salad": [], "seasonal salad": [], "chieftain soup of the day": [], "chieftain lamb chili": [], "mashed potatoes": [{"excerpts": ["I had the NY Steak dinner and replaced the mashed potatoes with fries instead.  "], "author": "John M.", "review": "Great Irish vibe in here.  It's cozy inside with all the warm wooden atmosphere.  Plenty of room to chill, although it can fill up fast.  Several big screen tvs for your sports intake.\n\nThey're all friendly here and pretty attentive at making sure you're drinking when you want a drink.\n\nI usually come here for the Clam Chowder soup on Fridays for lunch.  It's tough to find a place with consistent and tasty offerings of my favorite soup for life. \n\nTheir Fish and Chips is another frequent plate of mine.  3 pieces of juicy and crispy cod!  Yes, it's crispy, greasy goodness. \n\nThe buffalo wings are tasty and fall off the bone.  I would order it every time I come here but the price is just a little higher than its value in my opinion.\n\nI've tried their burgers and I do not think it's their strong point.  I believe it's missing something that could make it awesome; maybe a special homemade spread or change the meat quality/seasoning.  I can't quite recommend how I would make it better.\n\nIf you have to eat a burger however, I'd recommend the Chieftain Burger.  The egg and bacon and all the fixings really tie together well.  Eat the egg separately if you want.\n\nI had the NY Steak dinner and replaced the mashed potatoes with fries instead.  The steak quality left me wondering whether I should order it again...probably not.  \n\nTheir daily lunch specials are sometimes awesome.  I had steak cubes and fries one time and it was delicious. \n\nCalimari is always good.\n\nOverall, a solid, fun place to hang out for eats and to get drinks on!", "rating": 4, "date": "2017-02-27"}, {"excerpts": ["Juicy flavored ground lamb is mixed with perfectly cooked peas, carrots, and onions, topped with lightly burned mashed potatoes crust. "], "author": "Julia G.", "review": "I used to think the best Shepherd's Pie is served on Valencia St, however the reality proved to be better than I thought: The Chieftain rises to be an absolute Shepherd's Pie champion!\n\nJuicy flavored ground lamb is mixed with perfectly cooked peas, carrots, and onions, topped with lightly burned mashed potatoes crust. This dish is accompanied by home baked soda bread and brown gravy.\n\nNow, the gravy deserves a word by itself. The tale has it, brown gravy is homemade on the basis of Guiness beer with spices and a secret ingredient. As a result, it gives the perfect balance to the Shepherd's Pie sweetness and brings your food experience to the whole new level. This is a truly great dish, you have to try it!\n\nChieftain's environment is cozy and homy. Barman Dany takes care of your comfort and makes sure you have everything you need. This is a good place to watch a game, stop by for the cup of beer, or lunch.\n\nGreat experience, I definitely will be back!", "rating": 5, "date": "2014-07-01"}, {"excerpts": ["Special of the night: oxtail with mashed potatoes and grilled brussel sprouts. ", "Tender oxtail, buttery potatoes and addicting crispy, basalmic drizzled sprouts.  "], "author": "Fannie S.", "review": "Calamari = good appetizer. $8.95.\n\nSpecial of the night: oxtail with mashed potatoes and grilled brussel sprouts. Tender oxtail, buttery potatoes and addicting crispy, basalmic drizzled sprouts.  $15.95. \n\nMy sister tried their cheeseburger, and it hit the spot, along with steak cut fries.  Once again, another good burger!  $10.95.\n\nService = friendly, albeit very busy. \n\nPrices = moderate. But I did get to take home leftover oxtail and potatoes.", "rating": 4, "date": "2016-01-20"}, {"excerpts": ["Balls of spicy mashed potatoes and jalapeno that are fried. ", "Genius."], "author": "Sylvia L.", "review": "I've been here quite a few times, each time for a watching a major sports event. I've tried the other bars around the area (Rumors: pretty good but service is slow, and Ted's Sports Bar: DON'T GO; very old crowd and the one overwhelmed bartender tries to avoid eye contact at all costs). Service here is great and it's somehow large enough that my husband and I have always managed to end up with seats, even for the Superbowl or the NBA Finals. \n\nI really like the relaxed \"vibe\" of Chieftain. They give you a large, pretty varied menu at your table and the waitresses are friendly. The spacing of the tables is also pretty nice - you're not knocking into each other. It's probably my favorite place to watch a game and get a nice draft beer; they have quite a large selection including cocktails and wine for the beer-nonenthusiasts out there (confession: sometimes I get wine or cocktails instead; cocktails are okay but they use smaller ice which sometimes melts too quickly for my liking - I want to sip and enjoy the game...). People are generally around the late 20s and early 30s crowd and typically pretty into the game, but it's never rowdy enough that you can't hold a conversation. Just occasional extremely loud cheers. \n\nOnto the food:\n* Turkey burger: Tastes relatively light but delicious. There's jalapeno salsa and melted cheese. Comes with a small side of thick fries. \n* Buffalo wings: Not overly buffalo-ed, which I love. Comes with a side of carrots and celery, so that you feel mildly healthy.\n* Spicy irish potato bites: Hell yes. Balls of spicy mashed potatoes and jalapeno that are fried. Genius.", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["Large plump sausages, an oniony gravy, and delicious mashed potatoes that weren't over salted.  ", "Hooray!"], "author": "Andreas H.", "review": "The Chieftain is a nice Irish pub a stone's throw from Yerba Buena Gardens that offered me a place to sit out a rain shower.  Since I was already wet and needed to dry off, why not order a beer and a snack?  Once I looked at the menu the snack idea turned into an early dinner, and the beer turned into 2 pints.  Strange how that happens.\n\nThe Great:\n+  The young man finishing up his day shift was cheerful and friendly.  I was amused by his conversation with another Irish woman sitting at the end of the bar.  It went something like this:\n\nBartender: \"What part of Ireland are you from?\"\nLady: \"County ____, and you?\"\nBartender: \"County ____. I've only been in the USA for a few months.\"\nLady: \"I came over for 6 months and have been here 20 years\"\nBartender:  \"That seems to happen.\"\n\nIt was funny, and little things like that make a pub endearing.  \n\n+  The Bangers & Mash were fantastic.  Large plump sausages, an oniony gravy, and delicious mashed potatoes that weren't over salted.  Hooray!", "rating": 4, "date": "2013-02-05"}, {"excerpts": ["He took our drink order and suggested an appetizer- his favorite, the Spicy Irish Potato Bites (beer-battered mashed potatoes with jalepeno and cheese.) ", "The boyfriend said they were his favorite dish, and I might have to agree. ", "For the entree, we ordered clam chowder and the Fish & Chips to share.. ", "Both were fantastic. ", "The best part though, in my opinion, was Dylan asking the kitchen to split our meal for us before it was served. ", "Absolutely unexpected and obviously not necessary, but so thoughtful! ", "Men tend not to be very proficient when it comes to \"sharing\" food, so this ensured I actually got to eat too "], "author": "Leigh F.", "review": "Our first night of the long weekend in San Francisco, and all my boyfriend and I had established was that we needed to find somewhere with amazing Fish & Chips (thanks, Lent!) After perusing Yelp reviews for a while, I settled on The Chieftain- an Irish pub with great reviews that was walking distance from our hotel.\n\nOur bartender, Dylan, was phenomenally friendly and attentive. He took our drink order and suggested an appetizer- his favorite, the Spicy Irish Potato Bites (beer-battered mashed potatoes with jalepeno and cheese.) The boyfriend said they were his favorite dish, and I might have to agree. For the entree, we ordered clam chowder and the Fish & Chips to share.. Both were fantastic. The best part though, in my opinion, was Dylan asking the kitchen to split our meal for us before it was served. Absolutely unexpected and obviously not necessary, but so thoughtful! Men tend not to be very proficient when it comes to \"sharing\" food, so this ensured I actually got to eat too :)\n\nInstead of a juke box or radio, there was an incredibly talented guy singing, while playing the guitar AND harmonica. I don't think it's an exaggeration to say that he knew every single song on the planet and played them all perfectly- so impressive. We loved it, and could have stayed all night to listen.\n\nNext time we are in town, this is definitely a go-to stop!", "rating": 5, "date": "2014-03-08"}, {"excerpts": ["I had fish and chips with mashed potatoes instead of the chips.  ", "The fish was very very good.  ", "I would definitely come here again.  ", "The bartender was friendly and there was a live Irish band playing traditional Irish music."], "author": "Ashraf L.", "review": "Pretty pretty pretty good.  I had fish and chips with mashed potatoes instead of the chips.  The fish was very very good.  I would definitely come here again.  The bartender was friendly and there was a live Irish band playing traditional Irish music.", "rating": 4, "date": "2013-09-01"}, {"excerpts": ["It was comprised of a breaded, pounded, chicken breast fillet, covered with a creamy white mushroom gravy; it was accompanied by baked beans (sugary and thin sauce), Cole slaw (tangy and a bit too creamy), and mashed potatoes (creamy and buttery good). ", "Don't get me wrong as I did enjoy the meal, but it was misnamed. ", "Fried Chicken Fillet or Chicken Fried Chicken are more appropriate descriptions for this dish. ", "Most chicken that I know come with bones with the following body parts: drumstick, thigh, wing, and breast. \n", "The soup came in two small containers, but, like the chicken, was a little disappointing as there were no mushroom chunks or slices.  ", "The mushroom puree was okay after I reheated it and dipped it with their \"housemate brown bread\". ", "I could only finish half (one container of the soup) as the chicken entree was very filling. \n", "I wanted to give them 4 stars as the food and soup was tasty, but I had to knock them 1 star for relieving the chicken of its skeletal structure without notice."], "author": "Mike C.", "review": "I've walked past this corner bar, reading their daily specials numerous times without ever trying it. Well, now I can say that I've tried it. I saw two items on their chalkboard that caught my eye and hooked my stomach: a) Cream of Mushroom soup ($6.00) and b) Southern Fried Chicken ($13.50). \nI asked the bartender how long it would take to put together my order and he quickly replied, \"Five minutes.\" I placed my order and grabbed a stool at the bar, watching the numerous TV's on various sport channels. In perusing the room, I noticed that it wasn't very big and lined with some tables for four, but mostly smaller bar tables. The food came as promised... probably closer to eight minutes, but not a big deal since this was my take-home dinner. \nWhen I got home, my first reaction was shock in staring at the Southern Fried Chicken. It was comprised of a breaded, pounded, chicken breast fillet, covered with a creamy white mushroom gravy; it was accompanied by baked beans (sugary and thin sauce), Cole slaw (tangy and a bit too creamy), and mashed potatoes (creamy and buttery good). Don't get me wrong as I did enjoy the meal, but it was misnamed. Fried Chicken Fillet or Chicken Fried Chicken are more appropriate descriptions for this dish. Most chicken that I know come with bones with the following body parts: drumstick, thigh, wing, and breast. \nThe soup came in two small containers, but, like the chicken, was a little disappointing as there were no mushroom chunks or slices.  The mushroom puree was okay after I reheated it and dipped it with their \"housemate brown bread\". I could only finish half (one container of the soup) as the chicken entree was very filling. \nI wanted to give them 4 stars as the food and soup was tasty, but I had to knock them 1 star for relieving the chicken of its skeletal structure without notice.", "rating": 3, "date": "2010-01-14"}, {"excerpts": ["Mashed potatoes, rolled into balls, dipped in hot sauce, then deep fried and served with ranch.  "], "author": "Lis W.", "review": "One of the best pints of Guinness in the city - woot!\n\nGreat food.  I wish they'd bring back the \"deep fried spuds of love\" - well, that's what we called the potato bites.  Mashed potatoes, rolled into balls, dipped in hot sauce, then deep fried and served with ranch.  Your health-food option.\n\nWas there once and a group was having a fun birthday party - you can order platters of food and drinks and bring all your friends - kewl.", "rating": 5, "date": "2007-03-25"}, {"excerpts": ["I ordered the sausage with a side of mashed potatoes and beans, and it was delicious. "], "author": "Michelle G.", "review": "Delicious Irish food with a laid back atmosphere. I ordered the sausage with a side of mashed potatoes and beans, and it was delicious. If you're looking for a no-frills place to get some comfort food, I would highly recommend the Chieftain. \n\nIf you're looking to have a drink with your meal, I wouldn't go for wine, since they have a limited selection. Stay with the beer and hard alcohol drinks.", "rating": 4, "date": "2008-09-08"}, {"excerpts": ["I did get my typical Murphy's Irish Stout (yummy) and had some Bangers and Mash - two sausages with mashed potatoes and backed beans. ", "Delicious. "], "author": "Samir P.", "review": "I had only been to this place for beers. It's a typical Irish Pub, and one of the few places to get Murphy's Irish Stout these days. But last night I went there and experienced something that made Chieftain truly Yelp-worthy - Trivia Night. Every Tuesday they have trivia night, and some of my friends are avid participants. In fact, they almost always win. Last night was my first trivia night. \n\nThe place was great. There were about 5 or 6 teams that were playing - people grouped around tables, discussing answers, drinking beer, eating pub-food. If only we could have taken the SAT in this manner. When it came to answer time, each group that got the answer right started cheering. It was nerdy, yes, but fun nonetheless.\n\nI did get my typical Murphy's Irish Stout (yummy) and had some Bangers and Mash - two sausages with mashed potatoes and backed beans. Delicious. Really good food...considering it is pub food. \n\nOverall, a great experience. I'm not one for trivia, so I don't think I'll be a frequent member, but the whole vibe is so chill and cool that I'm sure I'll go back again with my trivia-addict friends.", "rating": 4, "date": "2007-01-24"}, {"excerpts": ["Huge plate of big ass sausages, mashed potatoes, and beans!  ", "Delicious!  ", "I've never had bangers and mash before, so I have nothing to compare to.  "], "author": "Charlene R.", "review": "Started my St. Patrick's Day 2010 shenanigans here bright and early, at 10AM.  There's nothing like day drinking.\n\nI had the bangers and mash for breakfast.  I had no idea what I ordered, I just liked the name.  My order came in and WOW!  Huge plate of big ass sausages, mashed potatoes, and beans!  Delicious!  I've never had bangers and mash before, so I have nothing to compare to.  But it sure was filling, and a great way to start my day drinking extravaganza.\n\nI had an irish coffee here and then left because a) the bartender kept pushing me to take shots of Irish whisky and b) the bartender was giving me shit about my expired driver license (what am I supposed to do, the DMV hadn't sent me my new one yet).  \n\nWould love to come back and watch a sporting event here.  I can see things getting crazy and fun in there.", "rating": 4, "date": "2010-04-07"}], "green peas": [], "guacamole": [{"excerpts": ["The Irish nachos is basically loaded fries with tomatoes, peppers, sour cream and some guacamole. ", "Would have been slammin' with some ground lamb or sausage bits... ", "the shepherd's pie was sensational with layers of flavor and great soda bread and butter. "], "author": "Lu-Shien T.", "review": "Great vibe inside, good service and good food!\n\nThe Guinness Draft is pretty darn close to the stuff I got in the UK. \n\nThe Irish nachos is basically loaded fries with tomatoes, peppers, sour cream and some guacamole. Would have been slammin' with some ground lamb or sausage bits... the shepherd's pie was sensational with layers of flavor and great soda bread and butter. The Reuben Sandwich had pastrami that was less salty than most deli versions, yet had a deep beefy flavor. Awesome--it was served with crisp kraut that was probably brined then fermented. The lamb burger was juicy, and rich with crumbled blue. The fries were hot, fluffy and well seasoned. Heck, even the raw red onions were a bit sweet! The Corned Beef with Cabbage looked very plain... but the corned beef was really quite yummy!\n\nThrow in the $100 for $75 deal and this place is even more awesome!\n\nEveryone present was thrilled with the meal and eager to return.", "rating": 4, "date": "2017-02-03"}, {"excerpts": ["For those who dont know, irish nachos are french fries with guacamole and sour cream ..."], "author": "George B.", "review": "Its an authentic irish pub in the sf downtown... Its a chill spot to catch a game - it has several tvs....i tried their Irish Nachos... Wait, what!? For those who dont know, irish nachos are french fries with guacamole and sour cream ...the above are a little beyond my scope but the concept is cool... service is indifferent but what do you expect from a cool, acting like a tough guy ,dude ...\n\nHey, \nIts me again and i would like to update my previous review... This time i sat a table and ordered the Irish Nachos again(i guess i missed  it since my last visit), Harp beer (Delicious Irish pilsner beer)...in  my opinion, seating at a table is a better option due to a great, seamless, friendly service. Our server's name was Luke and he was awesome, fast, and efficient.  ...in addition , my sister, who is a regular, mentioned that their Shepard pie is to die for.\n To conclude, this place has great food,ambience,location and great service. I'll be back 100%", "rating": 5, "date": "2016-11-23"}], "sautéed spinach": [], "homemade coleslaw": [], "sautéed veggies": [{"excerpts": ["They top it with sautéed veggies. ", "So tasty! "], "author": "Shannon H.", "review": "Food: Great Irish bar with full liquor menu and decent, albeit small, selection of wines. Good sides, but the real reason I prefer this place to every other Irish bar in town: they have a vegan impossible burger on the menu (get it without the bun for a complete vegan option). YUM! So delicious. They top it with sautéed veggies. So tasty! My husband is a not-vegan, wing eating slob and he loves the wings here. \n\nService: Perfection. The bartenders are polite and chatty, and make mean mixed drinks. None of that trendy too-cool-for-you nonsense you'll find in hipster bars. The service at Chieftain make me with I lived close enough for this to be *my* neighborhood bar. \n\nAmbience: plenty of wood, comfortable seating, dim lighting. Traditional Irish-American bar aesthetic complete with awkward 70s disco hits soundtrack.\n\nOverall, definitely worth a try. I intend to come back.", "rating": 5, "date": "2018-07-29"}], "heinz baked beans": [{"excerpts": ["The heinz baked beans are a good touch as well and the potatoes were spot on.\n\n"], "author": "Britney K.", "review": "Wandered in here kind of by accident, hungry and in need of a bloody mary we entered curiously. \n\nSat at the bar, took a bit to get noticed but eventually ordered bloodys and the eggs benedict. \n\nThe bloodys were kinda eh, and lacking lime and garnish which is a big no no in my book! The food was great. Eggs were perfect, sauce was delish, irish bacon...yes plz! The heinz baked beans are a good touch as well and the potatoes were spot on.\n\nThis is definitely a cool little place, although the atmosphere and general vibe of the other patrons was a little off-putting..ill be back someday!", "rating": 4, "date": "2010-07-19"}], "grilled angus cheeseburger": [], "chieftain irish chicken": [], "the original chieftain burger": [{"excerpts": ["Fish and chips, buffalo chicken wrap, lamb burger, Cobb salad, and the original chieftain burger (it comes with a fried egg on it!) ", "all of the food is great ", "but these are the ones that stick out the most to me. ", "Their homemade tartar sauce is to die for! ", "I even dip my fries in it :/ ", "The beer selection is awesome- everything from water ", "(Coors light) to Guinness and all the good stuff in between. ", "Are you a fan of scotch and whiskey? ", "This place is calling you... ", "They have an extensive whiskey and scotch menu! ", "(Yes!!) ", "I'm usually there during the week nights ", "and I LOVE the waitresses ", ":) ", "they are friendly, efficient, and on it. ", "On Friday nights they have a one man band singing and playing acoustically. ", "He is beyond brilliant. ", "If your in to live music check him out. ", "He plays a variety of genres  and nails every song. ", "My favorite is when he plays the harmonica while playing the guitar AND singing (that is talent!)  if your not busy on paddys day you should definitely stop by the Chieftain! ", "This will be my 5th year celebrating Paddy's Day there ", "and I wouldn't have it any other way!"], "author": "Melyssah M.", "review": "I love the Chieftain! I am there very often and never get sick of this place... My favorite things on the menu? Fish and chips, buffalo chicken wrap, lamb burger, Cobb salad, and the original chieftain burger (it comes with a fried egg on it!) all of the food is great but these are the ones that stick out the most to me. Their homemade tartar sauce is to die for! I even dip my fries in it :/ The beer selection is awesome- everything from water (Coors light) to Guinness and all the good stuff in between. Are you a fan of scotch and whiskey? This place is calling you... They have an extensive whiskey and scotch menu! (Yes!!) I'm usually there during the week nights and I LOVE the waitresses :) they are friendly, efficient, and on it. On Friday nights they have a one man band singing and playing acoustically. He is beyond brilliant. If your in to live music check him out. He plays a variety of genres  and nails every song. My favorite is when he plays the harmonica while playing the guitar AND singing (that is talent!)  if your not busy on paddys day you should definitely stop by the Chieftain! This will be my 5th year celebrating Paddy's Day there and I wouldn't have it any other way!", "rating": 5, "date": "2014-03-12"}], "the  pound lamb burger": [], "southwest turkey burger": [{"excerpts": ["I had the quesadilla one time and the southwest turkey burger the last time. ", "It was DELICIOUS.  ", "Co-worker loved the tacos as well. ", "Quaint little pub with a great atmosphere!"], "author": "Rachel A.", "review": "Came here twice this week while in a business trip.. Food is so good! I had the quesadilla one time and the southwest turkey burger the last time. It was DELICIOUS.  Co-worker loved the tacos as well. Quaint little pub with a great atmosphere!", "rating": 5, "date": "2015-01-21"}], "the impossible burger   plant based": [], "buffalo chicken wrap": [{"excerpts": ["My friend had the buffalo chicken wrap and she obsessed with it that she comes back every Wednesday.\n\n"], "author": "Alex A.", "review": "Absolutely one of the best lunch places to visit. Mark the owner greated us talked a little about their 17th anniversary. I had their steak Irish nachos. Absolutely delicious. My friend had the buffalo chicken wrap and she obsessed with it that she comes back every Wednesday.\n\nI will be coming back soon to eventually try their steak sandwich.", "rating": 5, "date": "2018-05-02"}, {"excerpts": ["I go there pretty much exclusively for their excellent buffalo chicken wrap."], "author": "Josh S.", "review": "Pretty casual in a good way. At lunch they often have a little crowd watching soccer. I go there pretty much exclusively for their excellent buffalo chicken wrap.", "rating": 4, "date": "2017-10-11"}, {"excerpts": ["I got their fish and chips and the BF got the buffalo chicken wrap. ", "Both were excellent! ", "I loved my little crispy perfectly fried fish sticks. ", "I was confused that it came with blue cheese instead of tartar sauce but the combination was surprisingly tasty. ", "The chips were pretty standard but good. ", "I tried my boyfriend's buffalo chicken wrap as well and it was really good", ", I actually couldn't decide what one I liked more! "], "author": "Ashley R.", "review": "Cute little Irish Pub! Came here to escape the craziness after the Tree Lighting Ceremony in Union Square, and was not disappointed. It wasn't very busy that night which was perfect since we had been trapped in a crowd all evening. \n\nI got their fish and chips and the BF got the buffalo chicken wrap. Both were excellent! I loved my little crispy perfectly fried fish sticks. I was confused that it came with blue cheese instead of tartar sauce but the combination was surprisingly tasty. The chips were pretty standard but good. I tried my boyfriend's buffalo chicken wrap as well and it was really good, I actually couldn't decide what one I liked more! Being from Upstate NY originally I can sometimes be fussy about my buffalo sauce and was glad to have found a place that could fulfill that quota.\n\nI also ordered a Fresh Squeezed IPA by Deschutes Brewery and it was a solid IPA. My boyfriends whiskey sour was perfectly made. I think it was one of his favorites he has had so far!", "rating": 4, "date": "2014-12-02"}, {"excerpts": ["The Chieftain has a pretty amazing buffalo chicken wrap that satisfied my craving for something buffalo. ", "Combined with an Anchor Steam and it was almost as good as being home again. "], "author": "Abby S.", "review": "After eating crazy vacation food for almost a week, it was nice to find a cozy pub near our hotel and have some familiar cuisine. I could probably eat a buffalo chicken sandwich every day, but my tummy wouldn't like me (neither would the BF). \n\nThe Chieftain has a pretty amazing buffalo chicken wrap that satisfied my craving for something buffalo. Combined with an Anchor Steam and it was almost as good as being home again. Almost.\n\nHappy hour from 4-6 includes discounted beers... but not sure if a $3 PBR is a deal. Maybe it is in these parts, but not in my 'hood. But who would want a PBR in an Irish pub anyway?", "rating": 3, "date": "2010-02-07"}, {"excerpts": ["My friend ordered a buffalo chicken wrap that also turned out to be enigmatically salty. \n\n"], "author": "Jugal S.", "review": "Headed here on a Wednesday night after seeing the Yelp review to meet up with some friends. Unfortunately, I was pretty disappointed with both the food and the service. \n\nThe waitress was rather slow in noticing I had joined my friend before taking my order. The high tables were cramped and uncomfortable. \n\nThe cocktails were good. I ordered the Sazerac which was quite a refreshing Green Chartreuse twist on a Manhattan. The spicy Irish potato bites we ordered as an appetizer were fantastic. However, the daily special ravioli the waitress recommended was wayyyyy too salty. And It wasn't just my order. My friend ordered a buffalo chicken wrap that also turned out to be enigmatically salty. \n\nIn addition, getting the waitress's attention was a ordeal, whether it was to order another drink or to get our check.\n\nAdmittedly, my experience at the Chieftain may have been atypical (perhaps someone was adding salt twice in the kitchen due to miscommunication), but the poor service on a Wednesday night left much to be desired for both the food and the service.", "rating": 2, "date": "2012-07-27"}, {"excerpts": ["Fish and chips, buffalo chicken wrap, lamb burger, Cobb salad, and the original chieftain burger (it comes with a fried egg on it!) ", "all of the food is great ", "but these are the ones that stick out the most to me. ", "Their homemade tartar sauce is to die for! ", "I even dip my fries in it :/ ", "The beer selection is awesome- everything from water ", "(Coors light) to Guinness and all the good stuff in between. ", "Are you a fan of scotch and whiskey? ", "This place is calling you... ", "They have an extensive whiskey and scotch menu! ", "(Yes!!) ", "I'm usually there during the week nights ", "and I LOVE the waitresses ", ":) ", "they are friendly, efficient, and on it. ", "On Friday nights they have a one man band singing and playing acoustically. ", "He is beyond brilliant. ", "If your in to live music check him out. ", "He plays a variety of genres  and nails every song. ", "My favorite is when he plays the harmonica while playing the guitar AND singing (that is talent!)  if your not busy on paddys day you should definitely stop by the Chieftain! ", "This will be my 5th year celebrating Paddy's Day there ", "and I wouldn't have it any other way!"], "author": "Melyssah M.", "review": "I love the Chieftain! I am there very often and never get sick of this place... My favorite things on the menu? Fish and chips, buffalo chicken wrap, lamb burger, Cobb salad, and the original chieftain burger (it comes with a fried egg on it!) all of the food is great but these are the ones that stick out the most to me. Their homemade tartar sauce is to die for! I even dip my fries in it :/ The beer selection is awesome- everything from water (Coors light) to Guinness and all the good stuff in between. Are you a fan of scotch and whiskey? This place is calling you... They have an extensive whiskey and scotch menu! (Yes!!) I'm usually there during the week nights and I LOVE the waitresses :) they are friendly, efficient, and on it. On Friday nights they have a one man band singing and playing acoustically. He is beyond brilliant. If your in to live music check him out. He plays a variety of genres  and nails every song. My favorite is when he plays the harmonica while playing the guitar AND singing (that is talent!)  if your not busy on paddys day you should definitely stop by the Chieftain! This will be my 5th year celebrating Paddy's Day there and I wouldn't have it any other way!", "rating": 5, "date": "2014-03-12"}, {"excerpts": ["I went ahead with the Buffalo Chicken Wrap and eased into the comforting pace of the bar. ", "They have a few flat panels, and everyone seemed highly engaged in the live soccer match from Europe. "], "author": "Mike K.", "review": "I knew from the second I opened up the menu, this was my kind of place. \n\nSimple, straight forward and had all you would expect from the corner pub.\n\nStools are scattered in an organized chaos, and the dark wood has seen it's fair share of characters. Our waitress greeted us immediately, and we perused the pages to indulge our Monday lunch craving. Service from the beginning to the end was on point.\n\nI went ahead with the Buffalo Chicken Wrap and eased into the comforting pace of the bar. They have a few flat panels, and everyone seemed highly engaged in the live soccer match from Europe. I can imagine this place being a great stop for a 5 o'clock brew.\n\nMy wrap was delicious, with a tangy bbq sauce and the rich flavors of the red onions over the chicken strips. Thick steak cut fries and a solid helping of ketchup made the meal vanish within seconds.\n\nThe Chieftain is a corner institution, and it's easy to see why. Not pretentious, easy going, with one heck of a pub menu. The fish and chips my boss had looked phenomenal as well.\n\nLooking forward to coming back soon and enjoying a pint.", "rating": 4, "date": "2009-11-09"}, {"excerpts": ["The buffalo chicken wrap was bomb! "], "author": "Katie W.", "review": "Out of all the places I hung out while I was in San Francisco for Macworld, The Chieftain was by far my favorite. We came here for every excuse we could come up with.\n\nIt was a nice comfy place to sit and gossip, cause trouble via Twitter, watch the tube, hide from everybody else, etc, and had a great vibe. Staff here was awesome. I was never waiting long for my next Blue Moon.\n\nThe buffalo chicken wrap was bomb! So, so good. \n\nIf I lived anywhere near The Chieftain, it would totally be my \"home bar\".", "rating": 5, "date": "2010-02-22"}], "smoked turkey blt": [], "reuben": [{"excerpts": ["Wonderful service, great Scotch selection and The Reuben was AMAZING!!! ", "looking forward to coming back on our next trip"], "author": "Meg R.", "review": "Bartender Rob and crew are hilarious, kind and welcoming. Wonderful service, great Scotch selection and The Reuben was AMAZING!!! looking forward to coming back on our next trip", "rating": 5, "date": "2018-10-24"}, {"excerpts": ["The Reuben Sandwich had pastrami that was less salty than most deli versions, yet had a deep beefy flavor. ", "Awesome--it was served with crisp kraut that was probably brined then fermented. ", "The lamb burger was juicy, and rich with crumbled blue. ", "The fries were hot, fluffy and well seasoned. ", "Heck, even the raw red onions were a bit sweet! "], "author": "Lu-Shien T.", "review": "Great vibe inside, good service and good food!\n\nThe Guinness Draft is pretty darn close to the stuff I got in the UK. \n\nThe Irish nachos is basically loaded fries with tomatoes, peppers, sour cream and some guacamole. Would have been slammin' with some ground lamb or sausage bits... the shepherd's pie was sensational with layers of flavor and great soda bread and butter. The Reuben Sandwich had pastrami that was less salty than most deli versions, yet had a deep beefy flavor. Awesome--it was served with crisp kraut that was probably brined then fermented. The lamb burger was juicy, and rich with crumbled blue. The fries were hot, fluffy and well seasoned. Heck, even the raw red onions were a bit sweet! The Corned Beef with Cabbage looked very plain... but the corned beef was really quite yummy!\n\nThrow in the $100 for $75 deal and this place is even more awesome!\n\nEveryone present was thrilled with the meal and eager to return.", "rating": 4, "date": "2017-02-03"}, {"excerpts": ["I have not tried the burgers myself, but those with me said the burgers and the Reuben sandwich are both great. "], "author": "Kecia B.", "review": "One of my new favorite restaurants in SF! I first found this place while at the hotel next door looking for a close place for lunch. I had the fish and chips and loved it. I have been back twice since that first visit and brought a bunch of people with me. \n\nThis place has a nice, cozy pub ambience. Service was friendly and efficient during weekday lunchtime. For a late lunch on the weekend, the service was a bit slow, but friendly, which was fine. \n\nThe drinks are good and both the lamb burger and fish and chips are as good as all the reviews say! I have not tried the burgers myself, but those with me said the burgers and the Reuben sandwich are both great. I'd say the prices are average for SF.\n\nThis place is close to Moscone North / South，so I plan to stop by whenever I am in the area!", "rating": 5, "date": "2015-11-29"}, {"excerpts": ["THE REUBEN:  http://www.yelp.com/biz_photos/QkaSsRmSHnc7vlypsfNfyA?select=B3tLs6DTBxGSPE2fiTM_jA  ", "http://www.yelp.com/biz_photos/QkaSsRmSHnc7vlypsfNfyA?select=fHBwAO3vkS7IdPolGz-pfQ Corned Beef with melted swiss on marble rye and sauerkraut.   ", "BF said it was good ", "but he was hoping he'd get a big pile of meat like at the Carnegie's or Kats in NY! "], "author": "Leah E.", "review": "November 6, 2009, Saturday @ 6:40pm (3.5 Stars, Maybe 4)\n\nAMBIANCE: I could have let out an ear-shattering scream at this pub and nobody would have heard me.  This place was LOUD!!! Maybe because BF and I went during Happy Hour and a hot game was going on. \n\nSOCIAL SCENE: Well, it is a pub! And a happening one. Locals and tourists alike were having a good time.  I'm not complaining. Just sayin.....We came here for pre-movie dinner.\n\nSERVICE: But even when the Happy Hour ended at 7pm, the place emptied out but it was still loud!  We had to find our own table but the server was nice, on her toes and we got our food like clockwork despite the craziness of the place. \n\nDRINK FOR ME:  PANTY-DROPPER \"DON'T BE SHY\" :  (Square One Vodka, Midori, Pineapple Juice and Grenadine Sinker) http://www.yelp.com/biz_photos/QkaSsRmSHnc7vlypsfNfyA?select=YEK7Z_AXq_jgoAedquNkxA\nSweet and tasted like candy but not enough ETOH for me to drop the Victoria Secrets!\n\nDEVOURS:\nAppetizer:  SAMPLER PLATTER:  http://www.yelp.com/biz_photos/QkaSsRmSHnc7vlypsfNfyA?select=vIo_fI0yBnkCTRT44L_lPQ Jalapeno poppers, chicken wings, onion rings and quesadilla with 2 dipping sauces.   The jalapeno poppers were the freshest I've ever tasted. They were not the frozen type and they used real chiles. Very tasty. Even the chicken wings were cooked well and yummy!\n\nMe: GUINESS BEEF STEW: http://www.yelp.com/biz_photos/QkaSsRmSHnc7vlypsfNfyA?select=HgS-T3wPZ9dSkeN7CiKucQ Not much veggie/seafood selection and I didn't want to eat Fish N Chips.  The Beef Stew was a good choice. Very flavorful and comforting meal with big chunks of carrots and potatoes. The meat was tender.  Honestly, it tasted like what I cook at home although BF said mine stew was better.  (Trying to make me drop the VS, Babe? LOL!)\n\nBF:  THE REUBEN:  http://www.yelp.com/biz_photos/QkaSsRmSHnc7vlypsfNfyA?select=B3tLs6DTBxGSPE2fiTM_jA  http://www.yelp.com/biz_photos/QkaSsRmSHnc7vlypsfNfyA?select=fHBwAO3vkS7IdPolGz-pfQ Corned Beef with melted swiss on marble rye and sauerkraut.   BF said it was good but he was hoping he'd get a big pile of meat like at the Carnegie's or Kats in NY! He was slightly disappointed.\n\nTAB: $60 with Diet Coke, tax and tip.\n\nOVERALL: (3.5-4 Stars) \nChieftain Irish Pub offers delicious comfort food to warm those cold bones at very reasonable prices. The dishes were priced at about $10 on average. The most expensive item on our menu was the appetizer platter at $14 but I would say it was worth it!\n\nRECOMMEND: This pub is great to hangout to catch a game, share a pint with friend or nurse a cold with a plate of stick to your ribs but delicious pubfare. Portions were adequate and not gargantuan.  \n\nIMBIBE: For those who imbibe, they carry a nice selection of Scotch Single Malts and Irish Whiskeys.\n\nLOCATION: Perfect location on 5th Street, not far from BART and shopping!\n\nMOVIE:  \"THE BOX\" @ Century San Francisco at  Bloomies.  Trippy sci-fi. Totally unexpected plot!\n\nTOURIST TRAP:  NOT!!! If you're a European tourist and feeling homesicked, come here!  My friend said Chieftain Irish Pub reminds him of every pub he's been to in Ireland.  Probably much cheaper than what you'll pay for a meal in Motherland!", "rating": 3, "date": "2009-11-19"}, {"excerpts": ["No, the menu did not say it was a Reuben but who the heck eats corned beef on a bun with onion, lettuce, tomato, & pickles.  ", "Absolutely gross!"], "author": "Simone W.", "review": "The worst \"corned beef sandwich\" EVER! Then to top it off the air conditioning was out while it was over 95 degrees outside. It was such an uncomfortable experience.  I can't blame the waitress because she did her best to accommodate us but the food was well below average.  The sandwich was served like a burger on a bun without sauerkraut. No, the menu did not say it was a Reuben but who the heck eats corned beef on a bun with onion, lettuce, tomato, & pickles.  Absolutely gross!", "rating": 1, "date": "2014-05-02"}, {"excerpts": ["The Reuben sandos and Caesar salad were good as well.  "], "author": "Dee I.", "review": "I'd been here once before and decided I didn't like it as I often do for god knows what reason. I went back recently for dinner with the bf because I'd heard they have good fish' n' chips and I'm on a quest to find the best fish'n'chips outside of  Otani's in Oxnard, CA. \n\nOur server was great! The fish' n' chips were good. Not my favorite, but good nonetheless.   They didn't have cider on tap. WHAT?!?! But the size of the bottled Magner's cider available made up for it. The Reuben sandos and Caesar salad were good as well.  I think the only thing I was bothered by was the fact that my fish'n'chips weren't served with coleslaw. \n\nAnd yes, to agree with Jen D. they did have a super clean bathroom!", "rating": 4, "date": "2008-06-03"}], "beer battered fish  chips": [], "chieftain shepherds pie": [], "the chieftain irish stew": [{"excerpts": ["My favorite is the Chieftain Irish Stew with a Caesar Salad with anchovies. ", "The fish and chips are amazing and the wings yummmmmm. ", "The drinks are well poured and the service is DOPE. ", "The manager Kelly there is a great dude and always nice to chat with when he's not running around doing his thing. ", "Only one thing I would change is bartenders be a little more friendly, but then again they make it up in the good drinks. "], "author": "Roberto M.", "review": "Love this place. I lived down the street from this place and this was my go to for when I needed a good meal. My favorite is the Chieftain Irish Stew with a Caesar Salad with anchovies. The fish and chips are amazing and the wings yummmmmm. The drinks are well poured and the service is DOPE. The manager Kelly there is a great dude and always nice to chat with when he's not running around doing his thing. Only one thing I would change is bartenders be a little more friendly, but then again they make it up in the good drinks. They also have amazing live music. \n\nIf you're here visiting and are staying downtown this is a staple to visit!", "rating": 5, "date": "2017-10-10"}, {"excerpts": ["The Chieftain Irish stew receives honorable mention.  "], "author": "Andrea H.", "review": "A group of 8 of us stopped in before we saw \"Once\" the musical.  Since the musical is set in Dublin, we went with an Irish theme for drinks and an early dinner at The Chieftain.  \n\nFirst of all, the atmosphere is just perfect and lovely for an Irish Pub.  However, I sadly knocked a few points off due to the lackluster food and drink.  \n\nTo their credit, the ordering system was down the day we visited.  Everything had to be done by hand.\n\nWe ordered the Chieftain nachos and a dozen wings.  Now, I'll admit that ordering nachos in an Irish pub is generally a poor idea, so I'll go easy on these.  They were completely underwhelming, the cheese was melted but not hot.  The serving size was smaller than expected.  The wings were ok-- nothing to notable here.  \n\nThe fish and chips were average, and got the job done.  Again, nothing to notable.  ***The star of the menu appears to be the shepherd's pie** Our table ordered two plates of this dish and tasted very satisfying.  The housemade bread added extra pizzazz.    The Chieftain Irish stew receives honorable mention.  Home-cooked goodness with tender chunks of beef and veggies was topped off with excellent housemade soda bread.  \n\nWord of caution:  there is a Yelp deal for a \"specialty\" drink when you check in here.  Go ahead and pass on that-- It's a bitter-sweet pink martini-like concoction that tastes something like cough syrup.  Go for a traditional whiskey drink or Irish beer instead!!!!", "rating": 3, "date": "2014-07-09"}], "corned beef  cabbage": [], "irish bangers and mash": [{"excerpts": ["Can't beat Irish bangers and mash in a great atmosphere.  ", "Of course having a Guinness to go along with the food didn't hurt either."], "author": "Joseph C.", "review": "Looked for a nice neighborhood bar with good food a couple of blocks away from all the tourists and came across the Chieftain Irish Pub.  Can't beat Irish bangers and mash in a great atmosphere.  Of course having a Guinness to go along with the food didn't hurt either.", "rating": 5, "date": "2018-07-01"}, {"excerpts": ["However, the food was amazing, I had the Irish Bangers and Mash and loved every bite of it that I almost licked the plate clean.  ", "I also had a Prohibition Speakeasy which made the meal that much better.  "], "author": "Liliana P.", "review": "So I came here for a friend's birthday and the place was pretty crowded.  The servers were hardly able to squeeze between the chairs.  However, the food was amazing, I had the Irish Bangers and Mash and loved every bite of it that I almost licked the plate clean.  I also had a Prohibition Speakeasy which made the meal that much better.  Most of the party got Fish and Chips and I tried that, and the fish tasted so fresh and had clean flavors.\n\nBecause it was my friend's birthday, we asked if there were any special offers, and they gave her a slice of cake on the house, which was very nice of them.  I loved the staff.  I caught one of them photo-bombing another group's picture.  They are so sincere and fun.\n\nI would definitely recommend anyone who loves or even just likes pub food to go here.  I am definitely a fan and would love to go back!", "rating": 4, "date": "2013-08-15"}], "chieftain irish grill": [{"excerpts": ["Chieftain Irish Grill - a 4-ounce grilled steak, a banger (sausage), a lamb patty, baked beans, sauteed mushrooms, grilled tomatoes, fries, and country gravy. "], "author": "Ed U.", "review": "Before I do my one-man step-dance production in my sequin-infested headband and my emerald-green polyester shirt unbuttoned to my magic spot, I like to come here because I can hoist a few with my laddies. Then we all perform \"Riverdance\" for all the bedazzled tavern onlookers. Yes, it's true. OK, no, it's not. But I have actually passed by the Chieftain many, many times walking to the Yerba Buena Gardens. It just looked like a typical Irish-style bar. To my utter lack of surprise, I went in there last weekend with Jamie W...and guess what? It's a typical Irish-style bar. With food. \n\nYes, we ate there. They actually have quite a menu there that stretches beyond the standard definition of pub grub. But I have to say the quality doesn't rise much above pub grub either. Jamie W. had the $11.25 Battered Fish & Chips. They use Harp Irish lager for the batter and serve three generous fillets of cod. Good stuff...wish I ordered it. I went for the ambitious, everything-but-the-kitchen-sink $11.95 Chieftain Irish Grill - a 4-ounce grilled steak, a banger (sausage), a lamb patty, baked beans, sauteed mushrooms, grilled tomatoes, fries, and country gravy. Whew. \n\nWell, I was ready to be embarrassed by what came out, but it turned out to be a major glop-fest on a plate. Everything was covered with the gravy - so I couldn't tell what was what. I pointed out to the waitress that I didn't see my lamb \"slider\" since I was fully expecting a mini-burger on a bun. Well, she came back with a patty - and I later realized I already had a patty on the plate. Now I see on their online menu, they say \"lamb patty\". Did I cause that change? You can thank me later. \n\nNone of it was bad, but the combo of meat and gravy and whatever came across like a meal you'd see in the mess hall of a military base. I don't know if I'd come back to the Chieftain for their food, but I do need a place to practice my step-dancing now. Excuse me. \n\nFOOD - 3 stars...mess hall-level \nAMBIANCE - 3 stars...like a visit to Killarney...if you're drunk out of your mind, laddie \nSERVICE - 2.5 stars...bar-level, I'd say \nTOTAL - 3 stars...pub grub for pot-bellied leprechauns", "rating": 3, "date": "2009-06-13"}, {"excerpts": ["I had the Chieftain Irish Grill (Irish Breakfast) and it was delicious. ", "My friends had burger and especially liked the fish and chips!  ", "Good beverages and Great Irish Coffees. ", "We'll be back!! ", "Loved the country music. :-)"], "author": "John A.", "review": "Had lunch with a group of friends. Everyone enjoyed their food. I had the Chieftain Irish Grill (Irish Breakfast) and it was delicious. My friends had burger and especially liked the fish and chips!  Good beverages and Great Irish Coffees. We'll be back!! Loved the country music. :-)", "rating": 4, "date": "2015-05-16"}, {"excerpts": ["i ordered a dish called the chieftain irish grill, aka irish breakfast with sausage, irish bacon, baked beans, blood pudding, tomatoes, eggs, fries and toast - but i had it at dinner time, and i had it with an anchor steam.  "], "author": "Greg D.", "review": "i ordered a dish called the chieftain irish grill, aka irish breakfast with sausage, irish bacon, baked beans, blood pudding, tomatoes, eggs, fries and toast - but i had it at dinner time, and i had it with an anchor steam.  really good combination.  \n\nnice decor for a sports pub. not what you would expect given the location.\n\ni have to give this place only four stars though, because they only have one waitress during peak dinner hours.  maybe that was an anomaly.  \n\ni will be back to try the cabbage and if the service improves i'll have to adjust my review.", "rating": 4, "date": "2010-02-25"}], "grilled rib eye steak dinner": [], "cheesecake": [], "potato bites": [{"excerpts": ["Anyhow, I ordered the Spicy Irish Potato Bites since I wasn't too hungry.  ", "They're basically potato stuffed with cheese and some jalapeno remnants.  ", "It wasn't spicy at all.  ", "They have a sauce that comes with it and that IS spicy and that made it a good time.  ", "They were slightly awkward to eat because of their size.  ", "They were rather big ", "and I couldn't eat them with a fork, ", "so I just used my hands (not a big deal).  ", "I think the plate had 7 or 8 of them.  ", "I wish they were smaller in size like their name suggests.  "], "author": "Shaun W.", "review": "Popped in for a birthday brunch on a Sunday.  Surprisingly busy and packed for the area.  I would assume lunch/HH on a week day would be bangin', but even on a Sunday it was busy.\n\nAnyhow, I ordered the Spicy Irish Potato Bites since I wasn't too hungry.  They're basically potato stuffed with cheese and some jalapeno remnants.  It wasn't spicy at all.  They have a sauce that comes with it and that IS spicy and that made it a good time.  They were slightly awkward to eat because of their size.  They were rather big and I couldn't eat them with a fork, so I just used my hands (not a big deal).  I think the plate had 7 or 8 of them.  I wish they were smaller in size like their name suggests.  They hit the spot and I was satisfied.\n\nThe waitresses: The one with the dyed red hair was nice.  The short blonde not so much.  They were both hungover and struggling.  There was no warm \"hello\" or any kind of welcoming introduction.  A lady was asking questions about sauces on a plate and the short blonde flippantly responded with \"What sauce do you want?\"  I didn't say anything, but internally, I was like \"WOW!\"  I definitely took notice of her attitude and made sure I said \"please\" and \"thank you\" during every interaction so I wouldn't be on the receiving end of all that.\n\nI used to work across the street and have been here before - mainly HH.  The place was clean and looked the part.\n\nMy star rating:\n\n4 for the business - food is ok.  Not bad, but not worth traveling across town for.\n\n2 for the staff.  If you are the opening staff, it's best not to party and stay out late the night before.  C'mon ladies!  It's time for adulting!", "rating": 3, "date": "2018-01-30"}, {"excerpts": ["We shared the spicy potato bites and wings - both were excellent.  ", "The potato bites had a kick to them but weren't too spicy - they were unique as they were crunchy on the outside and hot creamy mashed potato goodness on the inside.  ", "We had the lamb burgers - they come with blue cheese and sauteed onions and they are DELICIOUS!   ", "My Martini was perfectly made and generous.  ", "Service great.  ", "Luckily we arrived just before the lunch crowd on a Friday because the place got packed."], "author": "Lisa B.", "review": "Amazing! Met two friends for lunch there yesterday.  We shared the spicy potato bites and wings - both were excellent.  The potato bites had a kick to them but weren't too spicy - they were unique as they were crunchy on the outside and hot creamy mashed potato goodness on the inside.  We had the lamb burgers - they come with blue cheese and sauteed onions and they are DELICIOUS!   My Martini was perfectly made and generous.  Service great.  Luckily we arrived just before the lunch crowd on a Friday because the place got packed.", "rating": 5, "date": "2016-05-15"}, {"excerpts": ["Four words: Spicy Irish Potato Bites.\n\n", "battered deep fried mashed potato bites from heaven. \n\n", "Yours truly,\nThe thristy Irish traveler\n\nP.S. Potato Bites.... seriously."], "author": "Rachel B.", "review": "Four words: Spicy Irish Potato Bites.\n\nI should just end the review right here because I've got to get back to planning my next visit to SF to return to these beer battered deep fried mashed potato bites from heaven. \n\nIt's your standard Irish pub, no bells or whistles with the Chieftain \n\nbut you ask:\n\n\n\nRachel,\nIs this really deserving of 4 stars if it's so ordinary?\n\nand I would reply:\n\n\n\nDear Reader,\n\nYes, maybe more. Because you see, Chieftain is serving up stellar bar food that is only to be chased down with some very well maintained taps and served with a smile from the barmaid who's infectious sunny disposition will melt your heart.\n\nSo, please, take a seat and try and soak up a little luck of the Irish.\n\nYours truly,\nThe thristy Irish traveler\n\nP.S. Potato Bites.... seriously.", "rating": 4, "date": "2015-03-24"}, {"excerpts": ["The Irish potato bites though were probably the best and most fattening aspect of this carb-filled meal.\n\n"], "author": "Ee Vonn Y.", "review": "The steak fries with curry sauce is good. The curry sauce tastes like actual curry. The shepherd's pie is a staple item in any Irish pub. The Irish potato bites though were probably the best and most fattening aspect of this carb-filled meal.\n\nI like the calming and relaxing atmosphere that is expected at any Irish Pub. The round tables are fun spot to have a group dinner at.", "rating": 4, "date": "2012-06-23"}, {"excerpts": ["By great yelp reviews we had to try the Potato Bites. ", "On to the food...\nSpicy Potato Bites - Mashed potato balls with chopped jalapeños, deep fried and served with a spicy dipping sauce. ", "You get 5 servings. ", "You bite into one and the outside is light & crunchy, while the inside is what you expect, creamy mashed potato with bits of jalapeno. ", "Just a little heat, but dip them in the sauce ", "& you'll get a little more spice. ", "Photo - Potato Bites: http://www.yelp.com/biz_photos/the-chieftain-irish-pub-and-restaurant-san-francisco?select=zIvLr0z2RVniJ7RxdEmT3g#hhoe4Wv2ee7gk6Br6YrsEw\n\nFish & Chips "], "author": "Joel R.", "review": "Found this place through yelp while we were at the Westfield SF Centre. It's just a couple blocks down 5th on the corner across from Burlington Coat Factory.\n\nFirst thing you notice walking in, is how small the place is. There's one booth, several low tables with chairs, a few high tables with chairs, a community bar table in the middle and the bar seating itself. It looks like when this place is packed it's very \"intimate\". Lighting was very dim. Typical bar lighting. Also, try to look up at the walls & columns, they've done a pretty good job making the walls & columns look like rock and the torch lighting on the columns.\n\nWe sat at a table and the waitress came up to us and asked us if we wanted menus. She took our beer orders right away and gave us time to look over their menu. We immediately went to the Traditional section of the menu. By great yelp reviews we had to try the Potato Bites. From there we ordered the Fish & Chips and the Shepherd's Pie, especially since it said it was made with ground lamb, NOT ground turkey or ground beef like many other places.\n\nOn to the food...\nSpicy Potato Bites - Mashed potato balls with chopped jalapeños, deep fried and served with a spicy dipping sauce. You get 5 servings. You bite into one and the outside is light & crunchy, while the inside is what you expect, creamy mashed potato with bits of jalapeno. Just a little heat, but dip them in the sauce & you'll get a little more spice. Not too overpowering, just right.\n\nPhoto - Potato Bites: http://www.yelp.com/biz_photos/the-chieftain-irish-pub-and-restaurant-san-francisco?select=zIvLr0z2RVniJ7RxdEmT3g#hhoe4Wv2ee7gk6Br6YrsEw\n\nFish & Chips - Some here have said their fish was soggy, I guess my first experience was better? My fish came out hot & crispy, very light crisp. The fish was flaky, cooked just right. And I consider myself lucky this time because I got 4 pieces instead of 3, like it says on the menu. The chips were your basic steak fries, I didn't find anything really wow about them.\n\nPhoto - Fish & Chips: http://www.yelp.com/biz_photos/the-chieftain-irish-pub-and-restaurant-san-francisco?select=zIvLr0z2RVniJ7RxdEmT3g#zVMBCqjlmctWfRitrxze5A\n\nShepherd's Pie - You can definitely taste the difference with this one. Came to us really hot. So hot we had to let it cool down a bit. You can actually taste the lamb, it had that light gamey taste that only lamb has. It wasn't ground turkey or ground beef. The spices were nothing we've tasted in any other Shepherd's Pie. Very flavorful.\n\nPhoto - Shepherd's Pie: http://www.yelp.com/biz_photos/the-chieftain-irish-pub-and-restaurant-san-francisco?select=zIvLr0z2RVniJ7RxdEmT3g#7A77tHtv-UF27D10eJX2xA\n\nThey have daily special's too. We'll be back at least for these 3 items when we crave it. Probably need to try the Banger's & Mash.", "rating": 4, "date": "2014-01-24"}, {"excerpts": ["* Spicy irish potato bites: ", "Hell yes. "], "author": "Sylvia L.", "review": "I've been here quite a few times, each time for a watching a major sports event. I've tried the other bars around the area (Rumors: pretty good but service is slow, and Ted's Sports Bar: DON'T GO; very old crowd and the one overwhelmed bartender tries to avoid eye contact at all costs). Service here is great and it's somehow large enough that my husband and I have always managed to end up with seats, even for the Superbowl or the NBA Finals. \n\nI really like the relaxed \"vibe\" of Chieftain. They give you a large, pretty varied menu at your table and the waitresses are friendly. The spacing of the tables is also pretty nice - you're not knocking into each other. It's probably my favorite place to watch a game and get a nice draft beer; they have quite a large selection including cocktails and wine for the beer-nonenthusiasts out there (confession: sometimes I get wine or cocktails instead; cocktails are okay but they use smaller ice which sometimes melts too quickly for my liking - I want to sip and enjoy the game...). People are generally around the late 20s and early 30s crowd and typically pretty into the game, but it's never rowdy enough that you can't hold a conversation. Just occasional extremely loud cheers. \n\nOnto the food:\n* Turkey burger: Tastes relatively light but delicious. There's jalapeno salsa and melted cheese. Comes with a small side of thick fries. \n* Buffalo wings: Not overly buffalo-ed, which I love. Comes with a side of carrots and celery, so that you feel mildly healthy.\n* Spicy irish potato bites: Hell yes. Balls of spicy mashed potatoes and jalapeno that are fried. Genius.", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["Spicy Irish Potato Bites\n2) "], "author": "Marlon T.", "review": "These are my favorite types of places to get food and drink. I think I've decided that Irish/Scottish brews are my favorite. I'm not sure if it will ever replace Belgium as the best beer-producing country in my opinion, but breweries like Murphy's or Kilkenny are too good to me. Please order one or both of these beers. It will be easy to appreciate how it goes down your esophagus. The food here is good also so don't be shy to order a burger or an appetizer.\nI consumed these items:\n1) Spicy Irish Potato Bites\n2) The 'Original' Chieftain Burger (comes with fries)\n\nYou'll probably be satisfied with these 2 items in terms of taste and amount. You should get some curry sauce on the side for the fries. I thought the fries dipped in curry was alright--I wanted to try it since I haven't before. I guess french fries and curry is a thing in Ireland. I'd definitely come back for the beer and food. Don't hesitate checking this joint out. Lastly, if you're looking for a place to watch a sports game, this place has a decent amount of flat screens.", "rating": 4, "date": "2013-01-04"}, {"excerpts": ["try their spicy irish potato bites to start and lamb burger or fish and chips for your main. ", "DELICIOUS!! ", "You cant go wrong with any of their classics too! "], "author": "Laura W.", "review": "Love this neighborhood pub!\n\nThe Chieftain is great spot to unwind after work or check out on the weekends. They have a great beer selection and rotating guest beers for every season and month. \nps check out their wide-ranging whiskey menu and drink specials!\n\nThe pub itself is pretty awesome, its decor and atmosphere really catches the true irish pub feeling, which not a lot of other irish pubs have nailed here in the city. \n\ntry their spicy irish potato bites to start and lamb burger or fish and chips for your main. DELICIOUS!! You cant go wrong with any of their classics too! =huge portions for great prices. \n\nthe staff here are AWESOME! \nwaitresses are super friendly and attentive and the bartenders know their drinks!\n\nsee you guys this sunday for next 49ers WIN!! bottomless mimosas (for ME) and coors light pints (for him)\n\nTIP****\nthey are serving $3 coors light pints/$10 coors light pitchers for ALL football games plus a $6 appetizer special of wings, sliders or potato skins =go 49ers!", "rating": 5, "date": "2014-09-30"}, {"excerpts": ["He took our drink order and suggested an appetizer- his favorite, the Spicy Irish Potato Bites (beer-battered mashed potatoes with jalepeno and cheese.) ", "The boyfriend said they were his favorite dish, and I might have to agree. ", "For the entree, we ordered clam chowder and the Fish & Chips to share.. ", "Both were fantastic. ", "The best part though, in my opinion, was Dylan asking the kitchen to split our meal for us before it was served. ", "Absolutely unexpected and obviously not necessary, but so thoughtful! ", "Men tend not to be very proficient when it comes to \"sharing\" food, so this ensured I actually got to eat too "], "author": "Leigh F.", "review": "Our first night of the long weekend in San Francisco, and all my boyfriend and I had established was that we needed to find somewhere with amazing Fish & Chips (thanks, Lent!) After perusing Yelp reviews for a while, I settled on The Chieftain- an Irish pub with great reviews that was walking distance from our hotel.\n\nOur bartender, Dylan, was phenomenally friendly and attentive. He took our drink order and suggested an appetizer- his favorite, the Spicy Irish Potato Bites (beer-battered mashed potatoes with jalepeno and cheese.) The boyfriend said they were his favorite dish, and I might have to agree. For the entree, we ordered clam chowder and the Fish & Chips to share.. Both were fantastic. The best part though, in my opinion, was Dylan asking the kitchen to split our meal for us before it was served. Absolutely unexpected and obviously not necessary, but so thoughtful! Men tend not to be very proficient when it comes to \"sharing\" food, so this ensured I actually got to eat too :)\n\nInstead of a juke box or radio, there was an incredibly talented guy singing, while playing the guitar AND harmonica. I don't think it's an exaggeration to say that he knew every single song on the planet and played them all perfectly- so impressive. We loved it, and could have stayed all night to listen.\n\nNext time we are in town, this is definitely a go-to stop!", "rating": 5, "date": "2014-03-08"}, {"excerpts": ["The potato bites are to die for.  ", "It's a little small and a lot crowded so wear comfy shoes in case you have to stand.  ", "Other than that it's a favorite spot of ours!"], "author": "Kristi B.", "review": "This place is perfect for an after work drink. The food is really good too.  The potato bites are to die for.  It's a little small and a lot crowded so wear comfy shoes in case you have to stand.  Other than that it's a favorite spot of ours!", "rating": 4, "date": "2015-09-10"}, {"excerpts": ["I had takeout one night and while the spicy irish potato bites were really delicious, the fish was soggy and had a bit too much of a fishy odor to it.  ", "It is super convenient to where I live and the service was great, so I would definitely come back for drinks and pub fare."], "author": "T U.", "review": "I had takeout one night and while the spicy irish potato bites were really delicious, the fish was soggy and had a bit too much of a fishy odor to it.  It is super convenient to where I live and the service was great, so I would definitely come back for drinks and pub fare.", "rating": 4, "date": "2014-10-08"}, {"excerpts": ["The spicy Irish potato bites we ordered as an appetizer were fantastic. ", "However, the daily special ravioli the waitress recommended was wayyyyy too salty. ", "And It wasn't just my order. "], "author": "Jugal S.", "review": "Headed here on a Wednesday night after seeing the Yelp review to meet up with some friends. Unfortunately, I was pretty disappointed with both the food and the service. \n\nThe waitress was rather slow in noticing I had joined my friend before taking my order. The high tables were cramped and uncomfortable. \n\nThe cocktails were good. I ordered the Sazerac which was quite a refreshing Green Chartreuse twist on a Manhattan. The spicy Irish potato bites we ordered as an appetizer were fantastic. However, the daily special ravioli the waitress recommended was wayyyyy too salty. And It wasn't just my order. My friend ordered a buffalo chicken wrap that also turned out to be enigmatically salty. \n\nIn addition, getting the waitress's attention was a ordeal, whether it was to order another drink or to get our check.\n\nAdmittedly, my experience at the Chieftain may have been atypical (perhaps someone was adding salt twice in the kitchen due to miscommunication), but the poor service on a Wednesday night left much to be desired for both the food and the service.", "rating": 2, "date": "2012-07-27"}, {"excerpts": ["Hot wings, the chieftain burger, hot Potato Bites, Quesadilla, Fish & Chips, Turkey & Avocado sandwich and the lamb burger. \n- Live Irish music on Sunday\n- Great place to watch games\n- Rewards card\n\n"], "author": "Carol S.", "review": "The Chieftain is our neighborhood bar and I we simply love it!\n\nThe things I love the most about Chieftain:\n\n- Super Friendly staff\n- Fun atmosphere (authentic Irish pub)\n- Great food, my favs: Hot wings, the chieftain burger, hot Potato Bites, Quesadilla, Fish & Chips, Turkey & Avocado sandwich and the lamb burger. \n- Live Irish music on Sunday\n- Great place to watch games\n- Rewards card\n\nIf you're around market & 5th, go grab a bite at Chieftain!", "rating": 5, "date": "2013-05-27"}, {"excerpts": ["Their spicy irish potato bites have me coming back every time. ", "So Good! ", "Its also close to the Bay Bridge and shopping on Market."], "author": "Ria B.", "review": "i love a good irish pub. i have been going to this one for a couple of years. They always have the giants game playing, good whiskey, and great food. Their spicy irish potato bites have me coming back every time. So Good! Its also close to the Bay Bridge and shopping on Market.", "rating": 5, "date": "2014-05-22"}, {"excerpts": ["Great Irish bar would recommend the potato bites and the lamb burger (with a side of curry sauce) -  good place to watch a game on the big screen"], "author": "Fiona R.", "review": "Great Irish bar would recommend the potato bites and the lamb burger (with a side of curry sauce) -  good place to watch a game on the big screen", "rating": 5, "date": "2012-08-01"}, {"excerpts": ["Enjoyed:\n\nPotato Bites (a delicious blend of mashed taters, cheese and jalapeno. comes with some kinda special spicy sauce)\nFish & Chips (not overcooked, fries were good)\nCorned Beef & Cabbage (the best i've had, and the cabbage was a nice compliment to each bite of beef)\n\n"], "author": "Sassy-and-Pablo D.", "review": "Enjoyed:\n\nPotato Bites (a delicious blend of mashed taters, cheese and jalapeno. comes with some kinda special spicy sauce)\nFish & Chips (not overcooked, fries were good)\nCorned Beef & Cabbage (the best i've had, and the cabbage was a nice compliment to each bite of beef)\n\nOur waitress was really nice & so was the bartender. The atmosphere was a nice blend of ages, complete with the classic lesbian make-out moment at the bar lol", "rating": 4, "date": "2010-09-18"}, {"excerpts": ["well, that's what we called the potato bites.  "], "author": "Lis W.", "review": "One of the best pints of Guinness in the city - woot!\n\nGreat food.  I wish they'd bring back the \"deep fried spuds of love\" - well, that's what we called the potato bites.  Mashed potatoes, rolled into balls, dipped in hot sauce, then deep fried and served with ranch.  Your health-food option.\n\nWas there once and a group was having a fun birthday party - you can order platters of food and drinks and bring all your friends - kewl.", "rating": 5, "date": "2007-03-25"}, {"excerpts": ["You have to have the spicy potato bites too! ", "Let me stress it again comfort food at its finest.  ", "Just swung by the other day ", "and they've got a chalkboard that lists they're weekly specials.  ", "And I've had the oxtail. ", "That oxtail is like melted butter!  ", "This is THE place to be at when you're local sports team are doing good too.  ", "Was here when the NINERS went thru they're playoff run and can I say that I sure felt like I was at the game!  ", "They also show rugby, soccer, and practically any sport you'd like to watch.  ", "All you gotta do is just ask.  ", "Seriously people, This is the place to be at when you wanna hang out and have a pint with friends, co-workers, and whoever.  ", "Chieftain Irish Pub, you guys get a thumbs up from me.  ", "Keep up the good hard work!  OOh, and did I mention the brunch menu?  ", "Sorry, you're just gonna have to check it out yourself."], "author": "Papa S.", "review": "The Chieftain Irish Pub is a great place to hang out.  The atmosphere is always live and direct especially after work hours.  The drinks menu is stacked with beers on tap and if you prefer beers bottled, they have that too.  I was also shocked to find out that they also sold cans of beer.  The food at The Chieftain is pretty damn good also.  Gotta recommend the lamb burger with the gooey blue cheese and the sauteed red onions and mushrooms.(insert Homer Simpson drool here)  And how could you go wrong with the fish and chips, it's comfort food at its finest for for christ's sake.  You have to have the spicy potato bites too! Let me stress it again comfort food at its finest.  Just swung by the other day and they've got a chalkboard that lists they're weekly specials.  And I've had the oxtail. That oxtail is like melted butter!  This is THE place to be at when you're local sports team are doing good too.  Was here when the NINERS went thru they're playoff run and can I say that I sure felt like I was at the game!  They also show rugby, soccer, and practically any sport you'd like to watch.  All you gotta do is just ask.  Seriously people, This is the place to be at when you wanna hang out and have a pint with friends, co-workers, and whoever.  Chieftain Irish Pub, you guys get a thumbs up from me.  Keep up the good hard work!  OOh, and did I mention the brunch menu?  Sorry, you're just gonna have to check it out yourself.", "rating": 5, "date": "2012-06-06"}], "popcorn chicken": [{"excerpts": ["5 drinks, fried calamari, popcorn chicken, shepherds pie, stew, and salmon was around 94.00 which wasn't too bad... \n\n"], "author": "Eugenia W.", "review": "I've driven by this place hundreds and hundreds of time but never stepped inside because of parking issues. But this time me and my 2 coworker mamas wanted to have happy hour dinner. I decided to yelp something that started happy hour at 3.... \n\nWe found this place and also has a deal, $50 for $75. We split the $50 between us girls. 5 drinks, fried calamari, popcorn chicken, shepherds pie, stew, and salmon was around 94.00 which wasn't too bad... \n\nBasically with dessert and tip came out to be $30 per person... not bad! \n\nWe were there around 3:45 and it was pretty empty so we were seated right away. It was nice to have tvs around playing baseball and  whatever sports and they do have a lot of seating. Towards the evening around 5ish, it started to get packed and it got really loud to the point where i couldn't hear my friends talk. But eventually it got better. \n\nWe parked in the parking lot across the street, it's pretty pricey. If you know the area, try to find parking on the streets!!!!!", "rating": 5, "date": "2015-08-21"}], "popcorn cod": [], "cajun fries": [], "irish nachos": [{"excerpts": ["I had their steak Irish nachos. ", "Absolutely delicious. "], "author": "Alex A.", "review": "Absolutely one of the best lunch places to visit. Mark the owner greated us talked a little about their 17th anniversary. I had their steak Irish nachos. Absolutely delicious. My friend had the buffalo chicken wrap and she obsessed with it that she comes back every Wednesday.\n\nI will be coming back soon to eventually try their steak sandwich.", "rating": 5, "date": "2018-05-02"}, {"excerpts": ["We had \"Irish nachos\" to start which was thick cut fried instead of corn chips. ", "They were really nice, and just nice to have proper steak fries again. \n"], "author": "Rowena B.", "review": "We had a great time here last night. Walked in, Saturday night about 7pm and there was a table right inside the door. And it seemed to be steady like that, no one ever waited for a table. \n\nThey had a limited menu because of st pattys day but that was fine. \nWe had \"Irish nachos\" to start which was thick cut fried instead of corn chips. They were really nice, and just nice to have proper steak fries again. \nWe had a shepherds pie and an Irish stew, both really nice, the shepherds pie was actually made with lamb!! \n\nThe live music was great entertainment too! All round, a really great place.", "rating": 5, "date": "2017-03-12"}, {"excerpts": ["The Irish nachos is basically loaded fries with tomatoes, peppers, sour cream and some guacamole. ", "Would have been slammin' with some ground lamb or sausage bits... ", "the shepherd's pie was sensational with layers of flavor and great soda bread and butter. "], "author": "Lu-Shien T.", "review": "Great vibe inside, good service and good food!\n\nThe Guinness Draft is pretty darn close to the stuff I got in the UK. \n\nThe Irish nachos is basically loaded fries with tomatoes, peppers, sour cream and some guacamole. Would have been slammin' with some ground lamb or sausage bits... the shepherd's pie was sensational with layers of flavor and great soda bread and butter. The Reuben Sandwich had pastrami that was less salty than most deli versions, yet had a deep beefy flavor. Awesome--it was served with crisp kraut that was probably brined then fermented. The lamb burger was juicy, and rich with crumbled blue. The fries were hot, fluffy and well seasoned. Heck, even the raw red onions were a bit sweet! The Corned Beef with Cabbage looked very plain... but the corned beef was really quite yummy!\n\nThrow in the $100 for $75 deal and this place is even more awesome!\n\nEveryone present was thrilled with the meal and eager to return.", "rating": 4, "date": "2017-02-03"}, {"excerpts": ["i tried their Irish Nachos... ", "Wait, what!? ", "For those who dont know, irish nachos are french fries with guacamole and sour cream ...", "This time i sat a table and ordered the Irish Nachos again(i guess i missed  it since my last visit), Harp beer (Delicious Irish pilsner ", "beer)", "...in  my opinion, seating at a table is a better option due to a great, seamless, friendly service. ", "Our server's name was Luke and he was awesome, fast, and efficient.  ", "...in addition , my sister, who is a regular, mentioned that their Shepard pie is to die for.\n ", "To conclude, this place has great food,ambience,location and great service. ", "I'll be back 100%"], "author": "George B.", "review": "Its an authentic irish pub in the sf downtown... Its a chill spot to catch a game - it has several tvs....i tried their Irish Nachos... Wait, what!? For those who dont know, irish nachos are french fries with guacamole and sour cream ...the above are a little beyond my scope but the concept is cool... service is indifferent but what do you expect from a cool, acting like a tough guy ,dude ...\n\nHey, \nIts me again and i would like to update my previous review... This time i sat a table and ordered the Irish Nachos again(i guess i missed  it since my last visit), Harp beer (Delicious Irish pilsner beer)...in  my opinion, seating at a table is a better option due to a great, seamless, friendly service. Our server's name was Luke and he was awesome, fast, and efficient.  ...in addition , my sister, who is a regular, mentioned that their Shepard pie is to die for.\n To conclude, this place has great food,ambience,location and great service. I'll be back 100%", "rating": 5, "date": "2016-11-23"}, {"excerpts": ["Who knew there were Irish Nachos?  ", "The quirky menu items are a blast.  ", "I'll be back soon."], "author": "Christian S.", "review": "I come here all the time with my best buds.  This week we came twice.  We actually had a deal a few years ago to try every pub in the Bay Area.  We learned that may not happen.   Once we find a spot we prefer to be regulars so our goal is shot.  This is one of those places we really enjoy since the vibe is friendly and the food is pretty good.  Live music sometimes.  The owner seems cool.   Who knew there were Irish Nachos?  The quirky menu items are a blast.  I'll be back soon.", "rating": 5, "date": "2018-07-30"}, {"excerpts": ["Also, the Irish Nachos are amazing"], "author": "Stuart B.", "review": "Great place to grab a bite, or drop in and grab a pint or two with some friends. Ive had the bangers and mash and Shepard pie in the past, and both were so good that I have decided to make this pub my go-to for an casual bite. Friendly staff, welcoming atmosphere... easy 5 stars from me.\n\nAlso, the Irish Nachos are amazing", "rating": 5, "date": "2017-07-09"}, {"excerpts": ["On our list tonight was corned beef, 2 different burgers, Rueben sandwich, Shepard pie and Irish nachos for an appetizer. ", "Seriously, it was all great and we will certainly return. ", "I also appreciated the great service from the two waitresses."], "author": "Monica T.", "review": "We had a larger group and all tried something different. We all enjoyed our choices and I had fun taking a little nibble from everyone's plate! On our list tonight was corned beef, 2 different burgers, Rueben sandwich, Shepard pie and Irish nachos for an appetizer. Seriously, it was all great and we will certainly return. I also appreciated the great service from the two waitresses.", "rating": 4, "date": "2017-02-12"}], "bite sized english bangers": [], "two sliders": [{"excerpts": ["Starting with the yelpers check-in special Dos Equies and Sliders / nice medium grill on the two sliders.\n\n"], "author": "Susan K.", "review": "Tonight we are in the city on an international treck..\nAfter driving into the city Togo to an English grocer for Shepards pie gravy we decided on an Irish pub for dinner.\n\nStarting with the yelpers check-in special Dos Equies and Sliders / nice medium grill on the two sliders.\n\nNext we have bangers and mash and fish and chips (substitute salad). Both very good.\n\nNow 5:37pm starting to fill Up as people come in for the music which starts at 6:00pm", "rating": 4, "date": "2015-05-24"}], "chicken tacos": [], "grilled asparagus": []}