{"antipasto salad": [], "party salad": [], "footlong meatball sandwich": [], "bbq pork ribs": [], "jalapeno cheese poppers": [{"excerpts": ["I also got jalapeno cheese poppers and which was large so I can share and turns out that only half the box was full with just a few and they tasted a little flavorless not like any others I have had. ", "Plus they took for ever, even my buzz went away"], "author": "Rosa A. F.", "review": "Believe it or not the only thing I liked about this place will have to be the fact that their dry pepper is actually CALIENTE. Other than that pizza was okay I got the slice supreme which could of been better if they actually heated up and not just gave it to me like that. I also got jalapeno cheese poppers and which was large so I can share and turns out that only half the box was full with just a few and they tasted a little flavorless not like any others I have had. Plus they took for ever, even my buzz went away", "rating": 2, "date": "2013-09-20"}], "giant calzone": [], "buffalo wings": [], "pizza bread": [], "house special pizza": [], "art and tom pizza": [], "the herb pizza": [], "weekend in mexico pizza": [], "combo pizza": [], "deluxe pizza": [], "chicken over green pizza": [], "the delight special pizza": [], "us omni pizza": [], "greek special pizza": [], "all meat pizza": [], "kitchen special pizza": [], "vegetarian pizza": [], "soma special pizza": [], "ashbury chicken pizza": [], "tomato and basil pizza": [{"excerpts": ["I got the tomato and basil pizza ", "and I'm pretty picky about the pizza I eat since its my favorite food. ", "The guys there were really nice and we struck up a conversation with them. ", "While we were eating, a man and his daughter, who seemed to be regulars, came in bragging about how great the pizza was and how often they come back. ", "Sorry about all the people who had bad experiences, must've gone on bad days. ", "I'll be back soon!"], "author": "Alyssa O.", "review": "This little hole-in-the-wall pizza place is amazing! Me and my friend happened upon it one random day and it was a cheap, and amazing slice of pizza. The pizza was hot and huge! Filled me up. I got the tomato and basil pizza and I'm pretty picky about the pizza I eat since its my favorite food. The guys there were really nice and we struck up a conversation with them. While we were eating, a man and his daughter, who seemed to be regulars, came in bragging about how great the pizza was and how often they come back. Sorry about all the people who had bad experiences, must've gone on bad days. I'll be back soon!", "rating": 5, "date": "2013-11-15"}], "chicken special pizza": []}