{"mt ventoux breakfast sandwich": [], "mcallister scramble sandwich": [{"excerpts": ["MCALLISTER SCRAMBLE SANDWICH - $6.95 : http://www.yelp.com/biz_photos/HjKRwtL3gZ2RL3KQULXKsA?userid=5jUlCtMCI9Z7poi1vHq6cQ#hPSVGZqGbJAWPjl0HACS0A\n"], "author": "Albert L.", "review": "The Golden Gate Park Pitstop!\n\nOn the prowl for a new breakfast joint within the Richmond district, I stumbled upon Velo Rouge Café. 4-Stars, one $ sign, and close to home -- Yep, I had to check it out. \n\nUpon entering VRC, at first glance, I thought my directions lead me to a Mike's Bikes or Citizen Chain since the exterior (and interior) was decked out with overwhelming bicycle memorabilia. I'm a foodie, but a bike enthusiasts, so I was ready to flip a 180 and search up a new place to chow down but actually saw that people were eating and being served food. What the hey, why not. \n\n\"Breakfast served All Day\"\nI like you guys already.\n\nMCALLISTER SCRAMBLE SANDWICH - $6.95 : http://www.yelp.com/biz_photos/HjKRwtL3gZ2RL3KQULXKsA?userid=5jUlCtMCI9Z7poi1vHq6cQ#hPSVGZqGbJAWPjl0HACS0A\nThis open-faced badboy consisted of 3 scrambled eggs, bacon, grilled onions, mushrooms, spinach, and feta cheese, all toppled over two toasted English muffins with a side of house potatoes. \n\nTHIS WAS SO MUCH FOOD (see picture). The scramble sandwich was PACKED with grilled onions, TONS of mushrooms, a GARDEN of spinach, and smokey BACON everywhere. The muffins were exceptionally nice too, with the tops crispy, and the insides warm and chewy, just like how I like em'. Hands down, one of the best and hearty $7 eats I've had in a LONG time. \n\nMT. VENTOUX BREAKFAST SANDWICH - $4.95 + $1.25 (AVOCADO) : http://www.yelp.com/biz_photos/HjKRwtL3gZ2RL3KQULXKsA?userid=5jUlCtMCI9Z7poi1vHq6cQ#A7PRkGDRyJ0R78M_R8VKeg\nThey begin with grilled egg, smokey bacon bites, and jack cheese and melt all that into your choice of a croissant, bagel, or English muffin. It's a small eat, but very portable and packed with your breakfast essentials. Don't forget to add the avocado! \n\nWhat makes VRC 5-stars is not because of the bomb breakfast nor how affordable the food can be, but it's the customer service.\n\nI came here today (8/16) and I had to write this review because of their outstanding service! \n\nPutting all the bicycle photos and wacky bike-inspired furniture and bike references, you have a small coffee shop with a few outdoor seating spots. Intentionally, my girlfriend and I wanted to dine-in since it would be more convenient but all of the tables and chairs were taken, so instead, we just got our order to go. (Why not take a walk into Golden Gate Park and have a little picnic, right?)\n\nThe staff acknowledged our request and changed our dine-in order to a to-go. Another one of the staff members rushed outside just to make sure there wasn't any open spaces or tables that needed to be bussed. Nope, still all full. No biggie.\n\nAfter about 10 minutes, our to-go order came out and was brought to us, along with 2 additional plates and utensils.The staff member asked if we would still like to dine-in since a table actually opened but since we already had everything in to-go containers, we said it wasn't necessary and didn't want to waste their container. He insisted and said it was perfectly fine, with the biggest smile I've seen at 1PM. With a smile like that, we decided to dine in with out to-go order. \n\nOf course, the food was excellent, but as I was washing it all down with the coffee I ordered, it had a really strong sour pungent taste to it, despite adding my usual dosage of sugar. Maybe it was just me but I asked one of the staff members if it was normal. With any no hesitation whatsoever, he said he would make me a new beverage immediately and noted that VRC's coffee is just like that and quite strong since it's Blue Bottle coffee and individually dripped (I'm a Blue Bottle virgin, I admit it). But within minutes, my new beverage was out and ready to go. \n\n\nVery affordable eats.\nFresh ingredients all made-to-order. \nLocal Richmond district hidden gem.\nBlue Bottle Coffee, if your a fan.\nand of course, the Amazing Phenomenal Service.", "rating": 5, "date": "2012-08-16"}, {"excerpts": ["I had the McAllister Scramble Sandwich, and it was seriously amazing, so flavorful, and a perfect portion. ", "I would definitely recommend this to anyone in the area. ", "Absolutely worth a visit!"], "author": "Diana U.", "review": "Visiting from out of town with friends and looking for a great brunch place. Well, we found it! This place is really cute and the food is fantastic. I had the McAllister Scramble Sandwich, and it was seriously amazing, so flavorful, and a perfect portion. I would definitely recommend this to anyone in the area. Absolutely worth a visit!", "rating": 5, "date": "2015-06-14"}], "arguello breakfast": [{"excerpts": ["We usually split the Arguello breakfast with avocado ", "and it's consistently good. ", "Space has a bike theme to it which brings in the cyclist crowd, but I've also seen families, friends and people just hanging out. ", "Its not on a major street, but there is neighborhood parking only so may take a few min to find a spot."], "author": "Anastasia S.", "review": "My boyfriend found this place while looking for a cafe close by that serves brunch a few months ago. We've been several times since & have enjoyed a nice breakfast before taking the dog for a walk in the presidio. \n\nYou order at the counter then find an open table. Space is on the smaller side but turnover is pretty quick and we've never had an issue not finding a table (there is seating outside too). We usually split the Arguello breakfast with avocado and it's consistently good. Space has a bike theme to it which brings in the cyclist crowd, but I've also seen families, friends and people just hanging out. Its not on a major street, but there is neighborhood parking only so may take a few min to find a spot.", "rating": 4, "date": "2017-07-17"}, {"excerpts": ["I ordered the Arguello Breakfast which is 2 eggs scrambled (but you can choose how you want your eggs), country style potatoes, and 2 slices of bread (wheat or sourdough). ", "It was very good. \n", "I noticed that this is the perfect place to grab coffee and catch up with your friends or bring your laptop and work to do. \n", "I will be back!"], "author": "Kelly O.", "review": "I came here on a weekend wanting some breakfast food. Luckily this place serves breakfast food until 4:30 PM. There weren't a lot of people in the restaurant, which was super nice. I ordered the Arguello Breakfast which is 2 eggs scrambled (but you can choose how you want your eggs), country style potatoes, and 2 slices of bread (wheat or sourdough). It was very good. \nI noticed that this is the perfect place to grab coffee and catch up with your friends or bring your laptop and work to do. \nI will be back!", "rating": 4, "date": "2016-07-13"}, {"excerpts": ["The Arguello Breakfast is a great value with potatoes, eggs, toast, and bacon; and all the lunch sandwiches taste great.\n\n"], "author": "Thomas J.", "review": "The Velo Rouge Cafe manages to be three great things in one very tiny, but charmingly so, package: neighborhood bar, coffee spot, and brunch locale.\n\nAt nights, Velo Rouge is home to a few neighborhood personalities, nice bottle selection, heavy wine pours, and a few great beers on tap.  In the morning, they're making exceptional Stumptown coffee drinks priced appropriately, and all day serving up great food.  The Breakfast Burrito is (or at least used to be) the star of the show: this thing is THICK and delicious.  The Arguello Breakfast is a great value with potatoes, eggs, toast, and bacon; and all the lunch sandwiches taste great.\n\nGranted, the place gets pretty crowded, but doesn't that just mean its good?  Don't go expecting to work on your laptop all day, instead, go expecting a great experience with the friendly and skilled staff, and maybe make a few friend you didn't know you had just around the corner.", "rating": 5, "date": "2017-07-14"}, {"excerpts": ["ARGUELLO BREAKFAST ($6.50) - 2 eggs any style, country style potatoes, two slices toast. ", "It was a yummy, simple brunch plate for myself. "], "author": "Jane A.", "review": "CAFE LATTE PERFECTION!!!!\n(4 stars)\n\nAs usual, my Sundays are dedicated to explore and cafe hobo-ing around my city. What a great cozy cafe near Golden Gate park and a great way to spend a rainy day in this cafe reading \"technical\" material with the itouch on blast.\n\n- food, tasty. cofffee/espresso lovers (two words: blue bottle)\n- price, affordable\n- ambiance, cozy, cute neighborhood cafe\n- service, pretty good\n\nHEFFER-STYLE STATUS.\n\n*** see pictures ***\n\nARGUELLO BREAKFAST ($6.50) - 2 eggs any style, country style potatoes, two slices toast. It was a yummy, simple brunch plate for myself. Enjoyed the country style potatoes and the portions were filling, i didn't finish everything.\n\nCAFE LATTE - they use blue bottle coffee. for the san franciscans, they know exactly what that means. the taste of my latte was silky smooth and i loved the little heart they made from the foam. \n\nThey have a variety on the menu: brunch, lunch, wine, beer, pastries, etc. Everyone here is either just hanging out, reading, or on their laptops. Hard to find parking in the neighborhood. Good luck trying to snag a seat (i was fortunate to grab a seat by the window). Also, it would be nice if people take their dirty dishes to the bins before they leave. Also would be nice if the waiters see dirty dishes holding up seats, to take them away.\n\nWill I be back? Yes i will be.\n\nJABA APPROVED. Until the next review...", "rating": 4, "date": "2011-03-13"}, {"excerpts": ["I had an Arguello breakfast. ", "Simply just ham, eggs, toast. ", "I guess you can't really mess up on this order. ", "Also had a glass of mimosa which turned me bright red in public in broad daylight. ", "-___- "], "author": "Rosanne L.", "review": "My boyfriend and I slept in too late and missed brunch at Red Door Cafe, so we just yelped for a nice outdoor seating lunch area since it was a beautiful day in the city. We found Velo Rouge and just decided to come here. \n\nIt's a small cafe, self-served tables and outdoor seating. The food was pretty good. I had an Arguello breakfast. Simply just ham, eggs, toast. I guess you can't really mess up on this order. Also had a glass of mimosa which turned me bright red in public in broad daylight. -___- Maybe I should have just stuck with a latte, which seems highly rated here.\n\nI loooved sitting outside and seeing all the doggies pass by!", "rating": 4, "date": "2011-03-10"}, {"excerpts": ["I ordered the Arguello Breakfast  and it was simple. \n"], "author": "Hannah A.", "review": "Velo Rouge is a neighborhood cafe. Pros include cleanliness, Blue Bottle Coffee and a comforting neighborhood feeling. It's located near Golden Gate Park and I will be pleased to share of it's existence next year during the Outside Lands Festival. \n\nI ordered the Arguello Breakfast  and it was simple. \n2 Eggs, Bacon, Toast & Potatoes. \n\nIt was a bit bland but it did the job. It wasn't greasy and there is always something to say about that. \n\nThe cafe was cramped but people were very polite. The music playing quietly in the background was a pleasant distraction from the swinging front door , kids laughing and tight spaces.\n\nCharming.", "rating": 3, "date": "2011-08-22"}, {"excerpts": ["(my boyfriend is a HUGE fan of the BALT [Bacon, Avocado, Lettuce, and Tomato]), the Arguello breakfast is good but nothing special, and the Mount Vontoux. ", "Best breakfast sandwich I've found yet."], "author": "Emily M.", "review": "Hard to find seating at times, but thats part of the charm. The Mochas... oh god, the mochas... they are so good. The McAllister scramble is the dish I am eternally chained to, I always try but never seem to be able to get anything else because of how good it is. I've been frequenting this cafe for the past four years though so I have tried the Oatmeal, their daily soups, (my boyfriend is a HUGE fan of the BALT [Bacon, Avocado, Lettuce, and Tomato]), the Arguello breakfast is good but nothing special, and the Mount Vontoux. Best breakfast sandwich I've found yet.", "rating": 5, "date": "2012-10-25"}], "leipheimer breakfast burrito": [{"excerpts": ["I ordered the Leipheimer Breakfast Burrito. ", "It includes: 2 Eggs scrambled, black beans, potatoes, cheddar cheese, avocado, salsa, & sour cream. ", "You also get a side of chips. "], "author": "Mollie C.", "review": "Yelp comes through! I needed a brunch spot around the inner richmond and at the last minute decided on Velo Rouge Cafe. Great choice! It's a small corner cafe and was exactly what my friend and I wanted. Although a little crowded when we arrived (around 11:15am), we quickly found a table.  \n\nI've only been here once, but I can tell you we loved our food!\n\nI ordered the Leipheimer Breakfast Burrito. It includes: 2 Eggs scrambled, black beans, potatoes, cheddar cheese, avocado, salsa, & sour cream. You also get a side of chips. Add a little hot sauce and you've got a delicious start to the day.\n\nMy friend ordered the McAllister Scramble (3 Eggs scrambled with bacon, mushrooms, onions, spinach, red bell peppers and cheese served on an english muffin).  She asked for only 2 eggs. She loved it.\n\nPrices are pretty reasonable. With both meals and juice we walked out in under $15 for two. It's a nice little cafe on the corner of Arguello and McAllister. You can sit inside or outside depending on the weather - and how busy it is.\n\nIf you don't like cold air, I advise sitting away from the front door (if you can). Each time people walk in you get a chilly breath of fresh air.\n\n2-Hour parking is available nearby. We didn't access the WiFi- but saw plenty of people working away.\n\nI will definitely return!", "rating": 4, "date": "2012-12-31"}], "home style oatmeal": [], "velo granola": [], "bowl of fruit": [], "jack johnson banana pancakes": [{"excerpts": ["We split the Jack Johnson banana pancakes which had chunks of banana and almond cooked in. "], "author": "Jon S.", "review": "So everyone knows brunch waits get ridiculous in this city. This place is a little different in that it's counter service, so you don't have to wait for a table... but you do have to wait a while for your food. There aren't a lot of tables inside, but you can grab your food to go and take it to the park. \n\nWe ordered the breakfast burrito with chicken apple sausage (and black beans, potatoes, eggs, avocado, and sour cream) served with chips and salsa. The burrito was large, definitely filling, and pretty delicious. That being said, I thought having to add $2.50 for meat was a bit of a high price for an add on. We split the Jack Johnson banana pancakes which had chunks of banana and almond cooked in. They were good, but could have been a little more banana-y. \n\nOverall the food was pretty good, and reasonably priced (for SF). We probably waited around a half hour for it, so I'm not sure it cut down significantly on the brunch wait. If I came back on a weekend, I'd probably call in a to-go order ahead of time.", "rating": 4, "date": "2015-04-12"}, {"excerpts": ["The Jack Johnson banana pancakes were incredible."], "author": "Amanda S.", "review": "The service was excellent, and the food was awesome. The Jack Johnson banana pancakes were incredible.", "rating": 5, "date": "2014-10-12"}, {"excerpts": ["I am excited to try other things on the menu, including the Jack Johnson Banana Pancakes!"], "author": "Jennie L.", "review": "In my neighborhood... so that's a plus.\nIf you're a PB&J Fan, try the Elvis!\n\nI am excited to try other things on the menu, including the Jack Johnson Banana Pancakes!", "rating": 4, "date": "2011-03-23"}, {"excerpts": ["I ordered the Jack Johnson Banana pancakes with almonds and syrup. ", "While I was waiting for my food at the nice outside tables - owner(s) if you're reading this, the tables are fairly unstable and could be better positioned - I had a spicy ginger cookie to curb my appetite. "], "author": "Reed L.", "review": "The four stars may be a little generous as I came here for brunch after having run just over 17 miles so - as you might imagine - I was pretty ravenous. \n\nThey say that hunger is the best sauce, but in this case hunger AND syrup are the best sauces. I ordered the Jack Johnson Banana pancakes with almonds and syrup. While I was waiting for my food at the nice outside tables - owner(s) if you're reading this, the tables are fairly unstable and could be better positioned - I had a spicy ginger cookie to curb my appetite. It was a delicious cookie.\n\nI washed it down with a few glasses of ice water from a large jug they had near the counter. I prefer this manner of watering customers to having to rely on an attentive waiter/waitress or nagging them constantly. There was also lemon in the water which I always enjoy.\n\nThe pancakes arrived shortly and were delicious. My only complaint was that there were only two of them and they weren't particularly large. For 7 dollars I'd expected a little more. Not a whole lot more, but a little more.\n\nI'll definitely go there again.", "rating": 3, "date": "2008-03-30"}, {"excerpts": ["(the Jack Johnson Banana Pancakes look great).  ", "Also, they serve breakfast until 2:30 p.m., and they have lunch after 10:30.  ", "They have items such as salads, soups, and sandwiches.  ", "Also, FREE wifi.  ", "I came here with my girlfriend, yelped (actually I am here right now), and drank a Pacifico.  ", "They do have beer and wine.  ", "Plus, the atmosphere is super cute."], "author": "Sarah F.", "review": "Super cute coffee shop.  They have weekend brunch too (the Jack Johnson Banana Pancakes look great).  Also, they serve breakfast until 2:30 p.m., and they have lunch after 10:30.  They have items such as salads, soups, and sandwiches.  Also, FREE wifi.  I came here with my girlfriend, yelped (actually I am here right now), and drank a Pacifico.  They do have beer and wine.  Plus, the atmosphere is super cute.", "rating": 4, "date": "2008-02-04"}], "lox bagel": [{"excerpts": ["Lox bagel is my #1. ", "Levi's burrito without potatoes, but sausage added is #2. ", "All of the breakfast sandwiches rock. ", "Rest of menu looks great as well."], "author": "Ask N.", "review": "This is our neighborhood go to spot for breakfast & brunch. Staff s friendly and accommodates all kinds of special requests. Lox bagel is my #1. Levi's burrito without potatoes, but sausage added is #2. All of the breakfast sandwiches rock. Rest of menu looks great as well.", "rating": 5, "date": "2016-09-02"}, {"excerpts": ["Though a bit undersized in comparision to a Manhattan variant, the cream cheese and lox bagel with capers makes a good noontime nosh.\n\n"], "author": "Be N.", "review": "Velo Rouge has everything you look for in a neighborhood cafe... good coffee, good variety of food, entertainment (as in movie nights and live music) and a casual sense of community. I particularly enjoyed the Mt. Ventoux breakfast sandwich which basically consists of baked eggs with jack cheese on a deliciously buttered croissant. Though a bit undersized in comparision to a Manhattan variant, the cream cheese and lox bagel with capers makes a good noontime nosh.\n\nAs it says on their $1 stickers, \"VRC\" avoids the pretentious pitfalls of so many urbanite cafes by catering to its Inner Richmond cliental with a good dose of friendly and fast service. And a cafe that serves up Bloody Mary's and beer is one that I will go to again. After all, one cannot live solely on coffee alone.\n\nDefinite 4-Yelp star status. =)", "rating": 4, "date": "2006-12-10"}, {"excerpts": ["My routine was grabbing a lox bagel ", "on sunday mornings- simple but delicious. ", "Oh, how I miss Velo Rouge. "], "author": "Navid N.", "review": "I love this place, and sadly, after my cousins moved out of the area, I haven't returned. It's a great addition to an otherwise boring neighborhood/area in San Francisco. Its a cozy, quaint little place w/ good coffee, good eats, and fat tire on tap. A delicious and fun thing to try here is their South African Savory Pies-- they're like Piroshkis but better.  \nMy routine was grabbing a lox bagel on sunday mornings- simple but delicious. Oh, how I miss Velo Rouge. And although I've never tried any of their prixe fixe dinners (they would bring in chefs from all over for small candle light meals), but it looked really good. \n\nGive Velo Rouge a try!", "rating": 5, "date": "2007-10-21"}], "toasted bagel": [{"excerpts": ["I have had a sliced avocado on a toasted bagel for breakfast before, but I am sure going to do it now!"], "author": "Jennifer W.", "review": "Great breakfast choices and the ambiance of the place was perfect for us. I have had a sliced avocado on a toasted bagel for breakfast before, but I am sure going to do it now!", "rating": 4, "date": "2016-07-26"}, {"excerpts": ["30-45 minutes for toasted bagel to go.  ", "Wow!  ", "The food is mediocre.  "], "author": "Nadine J.", "review": "You''d think it would be really cool to have a themed cafe a half block from home.\n\nI wish it were.  I've tried going in several times.  The service is insanely slow.  30-45 minutes for toasted bagel to go.  Wow!  The food is mediocre.  The menu just isn't interesting. \n\nOnly hipsters and those who love them are really welcome here.  Expect a dismissive attitude otherwise.\n\nThe positive reviews for Velo Rouge are probably accurate but if you're not a Mission District transplant trying to turn the Inner Richmond into the next hipster zone, this place may not be for you.\n\nBut, if that describes what you're looking for then, Voila!  C'est si bon!", "rating": 2, "date": "2014-09-26"}, {"excerpts": ["Took 30 minutes to get a plain, non-toasted bagel."], "author": "Matt H.", "review": "Breakfast Burrito is awful. Took 30 minutes to get a plain, non-toasted bagel.", "rating": 1, "date": "2013-06-08"}, {"excerpts": ["I went in here to get a small cup of coffee and plain toasted bagel with hummus for my boyfriend one morning. ", "Someone tell me why it took 25 minutes for this to happen? ", "As each minute ticked by, I was getting more and more upset since they were essentially taking time away from me being able to spend a few minutes in the morning with him before he went to work. ", "After 20 minutes, I really wanted to go into the kitchen, toast the damn bagel myself, spread some hummus on it, pour coffee into a cup and bolt out of there. ", "But OF COURSE there were only two staff members working a busy Saturday morning, who were both taking orders, no one was working the kitchen, there was a line going out the door and each customer had to tell their life story to the only two working staff members. ", "Oh god, someone point me to a Starbucks where I'd get my custom made-to-order coffee and toasted bagel with cream cheese in 4 1/2 minutes. ", "Don't get me wrong", ": I appreciate the quaint, cute little independent coffee shops for all their charm and avoid the big bad chains whenever possible. ", "I just think they need to hurry the hell up and realize that making people wait forever is not good business."], "author": "Christine Y.", "review": "This place only gets two stars because it was superclose to where I used to live and, fortunately for them, there are no other close cafes in the area. \n\nI went in here to get a small cup of coffee and plain toasted bagel with hummus for my boyfriend one morning. Someone tell me why it took 25 minutes for this to happen? As each minute ticked by, I was getting more and more upset since they were essentially taking time away from me being able to spend a few minutes in the morning with him before he went to work. After 20 minutes, I really wanted to go into the kitchen, toast the damn bagel myself, spread some hummus on it, pour coffee into a cup and bolt out of there. But OF COURSE there were only two staff members working a busy Saturday morning, who were both taking orders, no one was working the kitchen, there was a line going out the door and each customer had to tell their life story to the only two working staff members. Oh god, someone point me to a Starbucks where I'd get my custom made-to-order coffee and toasted bagel with cream cheese in 4 1/2 minutes. Don't get me wrong: I appreciate the quaint, cute little independent coffee shops for all their charm and avoid the big bad chains whenever possible. I just think they need to hurry the hell up and realize that making people wait forever is not good business.", "rating": 2, "date": "2007-10-18"}, {"excerpts": ["Usually, a breakfast sandwich like this isn't worth writing about, but I was suitably impressed (fresh, toasted bagel; a real fried egg rather than the microwaved stuff out of a carton; good cheese).  ", "I'm looking forward to get the chance to try other menu items.  ", "Unfortunately (or maybe fortunately if you're a local and like it quiet) there aren't any supporting businesses next to the cafe ", "-- I only see a laundromat and small market.  ", "I just hope there's enough neighborhood and bike transit traffic to keep this great place going.\n", "The only thing stopping me from giving it a full 5 stars is that I've been only a few times for tea and haven't had the coffee yet.  ", "Too bad I don't live in the area anymore; thank goodness a friend lives nearby ", "and I can stop in everytime ", "I visit.\n", "Happy 1-year anniversary!  ", "Hope it'll be around for a long time."], "author": "Tom W.", "review": "I didn't expect this cute little cafe to be tucked into this mostly residential corner of inner Richmond.  As its name implies, the cafe has a French, red, bicycle theme.  The small room is comfortable and clean with outdoor as indoor furniture (mostly wrought iron tables/chairs with a small couch/coffee table in a corner).  There are a few outdoor tables and a red helical bike rack with the requisite red bike.\nThere's a full and diverse menu, which I haven't tried.  But the first time I visited, I had a bagel with egg and cheese.  Usually, a breakfast sandwich like this isn't worth writing about, but I was suitably impressed (fresh, toasted bagel; a real fried egg rather than the microwaved stuff out of a carton; good cheese).  I'm looking forward to get the chance to try other menu items.  Unfortunately (or maybe fortunately if you're a local and like it quiet) there aren't any supporting businesses next to the cafe -- I only see a laundromat and small market.  I just hope there's enough neighborhood and bike transit traffic to keep this great place going.\nThe only thing stopping me from giving it a full 5 stars is that I've been only a few times for tea and haven't had the coffee yet.  Too bad I don't live in the area anymore; thank goodness a friend lives nearby and I can stop in everytime I visit.\nHappy 1-year anniversary!  Hope it'll be around for a long time.", "rating": 4, "date": "2006-08-25"}], "toasted bagel with butter": [], "toasted bagel with jam": [], "toasted bagel with cream cheese": [{"excerpts": ["Oh god, someone point me to a Starbucks where I'd get my custom made-to-order coffee and toasted bagel with cream cheese in 4 1/2 minutes. ", "Don't get me wrong", ": I appreciate the quaint, cute little independent coffee shops for all their charm and avoid the big bad chains whenever possible. ", "I just think they need to hurry the hell up and realize that making people wait forever is not good business."], "author": "Christine Y.", "review": "This place only gets two stars because it was superclose to where I used to live and, fortunately for them, there are no other close cafes in the area. \n\nI went in here to get a small cup of coffee and plain toasted bagel with hummus for my boyfriend one morning. Someone tell me why it took 25 minutes for this to happen? As each minute ticked by, I was getting more and more upset since they were essentially taking time away from me being able to spend a few minutes in the morning with him before he went to work. After 20 minutes, I really wanted to go into the kitchen, toast the damn bagel myself, spread some hummus on it, pour coffee into a cup and bolt out of there. But OF COURSE there were only two staff members working a busy Saturday morning, who were both taking orders, no one was working the kitchen, there was a line going out the door and each customer had to tell their life story to the only two working staff members. Oh god, someone point me to a Starbucks where I'd get my custom made-to-order coffee and toasted bagel with cream cheese in 4 1/2 minutes. Don't get me wrong: I appreciate the quaint, cute little independent coffee shops for all their charm and avoid the big bad chains whenever possible. I just think they need to hurry the hell up and realize that making people wait forever is not good business.", "rating": 2, "date": "2007-10-18"}], "toasted bagel with peanut butter": [], "toasted bagel with nutella": [], "toasted bagel with spicy hummus": [], "toasted bagel with tomato": [], "toasted bagel with red onion": [], "toasted bagel with cucumber": [], "toasted bagel with avocado": [], "the coppi grilled sandwich lunch": [], "the merckx grilled sandwich lunch": [], "the pantani grilled sandwich lunch": [], "the indurain grilled sandwich lunch": [], "ullrich tuna melt lunch": [], "fresh veggie sandwich lunch": [], "club sandwich lunch": [], "balt lunch": [], "the elvis lunch": [], "kids pbj lunch": [], "kids grilled cheese lunch": [], "hand made peasant pie lunch": [], "soup of the day with corn bread lunch": [], "spring mix green salad lunch": [], "velo burrito": [], "velo veggie burrito": [], "velo meat tacos": [], "velo veggie tacos": [], "side salad": [{"excerpts": ["The Pantani sandwich was delicious and came with a side salad. ", "I spent quite a while studying and no one bothered me, which I really appreciate."], "author": "Veronica L.", "review": "Had a great time studying at Velo Rouge this early afternoon. The latte was nice and strong with delicious foam. The Pantani sandwich was delicious and came with a side salad. I spent quite a while studying and no one bothered me, which I really appreciate.", "rating": 5, "date": "2018-02-13"}, {"excerpts": ["side salad:mixed greens, cucumbers, tomatos, carrots, white cheese? "], "author": "Victor G.", "review": "Velo Rouge Cafe is in a corner location. prime right? yes and no. not much seating so peak hours will be standing room only.\n\nmenu: breakfast, lunch, sammies, specials, expresso, happy hour\n\neats: great hornet veggie (9;.95)\n-\"cucumber,, tomato, red onions, mushrooms, avocado, sprouts, beets, greens, hummus, swiss, chedder, jack cheese on 9 grain bread.\n*not superfab, taste comes from hummus, cheeses, bread fab, just right, better than average, fulfilling.\nside salad:mixed greens, cucumbers, tomatos, carrots, white cheese? tasty!\n\nbrew: stumptown (m.3)\n-fab smooth sipping, not bold, not watery, a fav.-\n\ntake outs:\n-cashier pointed out Leipheime  Breakfast burrito (7.95) another good vegan choice. eggs, etc, .\n-HH (didn't note hours): pints (4)\n'-people in this area fortunate to have Velo Rouge. i'm envious. :)\n-fab, smiling, neighborhood service.....", "rating": 4, "date": "2016-06-10"}, {"excerpts": ["I ordered the Tuna Melt, comes with a side salad, while my friend ordered one of the breakfast options. "], "author": "Meiling W.", "review": "I came here with my friend on a rainy day for lunch and to catch up. I ordered the Tuna Melt, comes with a side salad, while my friend ordered one of the breakfast options. This cafe is pretty small and seating is limited but there are a few tables outside. \n\nWe paid before we sat down and then they brought our food out. I liked paying before-hand because we didn't have to pay tips. Our food was pretty good; my Tuna Melt was slightly more sour than I would like but probably due to the sourdough bread.", "rating": 4, "date": "2016-12-24"}, {"excerpts": ["The side salad was a bit salty but bonus points for having goat cheese. \n\n"], "author": "Sarah S.", "review": "I'd give it 3.5 stars if I could. Decent sandwich (I got the coppi) but not good enough for me to really want to come back. The sandwich would have benefitted from more cranberry sause. It ended up just tasting like the jack cheese. The side salad was a bit salty but bonus points for having goat cheese. \n\nThe decor is fun--a bunch of bicycle themed posters and even a funky bike bench, chair, and table. \n\nService was good. We liked the people who worked here. \n\nAll in all, meh.", "rating": 3, "date": "2016-02-28"}, {"excerpts": ["Both sandwiches come with a side salad. "], "author": "Alejandra I.", "review": "I came here on a Monday for lunch, and the food was pretty good. We had the Coppi sandwich, which has turkey, spinach, cheese, and cranberry jam and the Ullrich tuna melt, which has tuna, cheese, and mustard. Both sandwiches come with a side salad. I tasted both of the sandwiches and they were both tasty, but there was nothing particularly amazing about either one of them. \n\nThe cafe is cute but really small, granted we came at what I am guessing is their peak time right around noon and all the seats were taken. We almost had to take our food to go, but last minute someone left and we got a seat. I will say the staff is super friendly, one of the ladies behind the counter was keeping an eye out and as soon as she noticed someone leaving she asked if we wanted to stay, and immediately cleaned the table for us. \n\nI like that it is close to my job, so I will definitely come again to taste the breakfast items.", "rating": 4, "date": "2013-12-31"}, {"excerpts": ["So, I just ate the side salad that it came with and sadly put the rest of the sandwich in the compost.\n\n"], "author": "Grey Z.", "review": "Good espresso. Decent sandwiches. A bit overpriced and there is an extra charge for credit/debit. Clerks could also be a bit friendlier.\n\nUpdate: Unfortunately, I'm here to update my review and lower it to 2 stars, which I feel is actually generous. I recently got one of their vegetarian sandwiches and I have to say, it was terrible. \n\nIt may not be easy to make a great sandwich. But It's also probably not easy to make a sandwich this bad. And it certainly wasn't worth 10 bucks. To start, the bread tasted dry and stale.\n\nThe sandwich was meant to have hummus on it. However, there was no hummus. The big problem what that is that there are no other condiments in the sandwich. So, when you forget to add the hummus, or just don't care enough to put it in, the sandwich is basically a dry, unenjoyable mess that falls apart, since there's nothing to moisten it or hold it together.\n\nNext, the cheese. I didn't need cheese on a vegetable sandwich. But it came with it. So, what the heck, why not. The problem, however, is that there was literally a HALF INCH of cheese in this thing. To put that in perspective, that easily a 1/4 inch too much cheese to put in a grilled cheese sandwich. It's WAY too much cheese. The sandwich, which was fairly large, was basically 1/4 cheese. Imagine eating a 1/4 inch of cheddar cheese between two pieces of stale bread.\n\nSo, here I am trying to get the healthier sandwich option on the menu. But what I get is a really dry, stale sandwich with no condiments or hummus whatsoever, and which is filled with a seemingly random handful of dry vegetables. But on top of that, it has a whole brick of cheese in the middle! It was so bad. \n\nI should have returned the food and complained. But I honestly just wanted to forget about it as soon as possible. So, I just ate the side salad that it came with and sadly put the rest of the sandwich in the compost.\n\nI feel like these people owe me a meal.", "rating": 2, "date": "2016-03-02"}, {"excerpts": ["and it comes with a side salad with sweet corn and strawberries on top. \n\n"], "author": "Julia H.", "review": "I love this place! Blue bottle coffee and the best BLT with Avocado I've had-the sandwich is amazing and it comes with a side salad with sweet corn and strawberries on top. \n\nDownside-it gets really crowded and there's not a lot of seating inside and it can be hot and stuffy. There are a few seats outside the sidewalk, but on a hot day I wish there were a few more tables in the shade.", "rating": 4, "date": "2011-07-01"}, {"excerpts": ["The side salad was great, though. ", "Can't say it was worth the trek from nob hill."], "author": "Maleenee B.", "review": "I ordered the veggie sandwich looking for a fresh, healthy lunch. The sandwich seemed lik everything I would like, but it was just ok. There was too much going on and the veggies we're cut way to large. It came with hummus, tomatoes, cucumbers, beets, raw mushroom, and raw onions. I like all of those (except or raw mushrooms) but the large chunks of veggies just made it so every bit was just a different raw veggie rather than a sandwich.\n\nThe side salad was great, though. Can't say it was worth the trek from nob hill.", "rating": 3, "date": "2015-03-10"}, {"excerpts": ["It STUNS me to think that Velo Rouge would serve previously frozen strawberries in a granola bowl and soggy cucumbers in my side salad. "], "author": "Stephanie L.", "review": "I'm slightly stunned that this place got four stars. We came here yesterday and were excited to give it a try and the cafe was packed and buzzing. \n\nWe had the BALT (bacon, avocado, lettuce, tomato) sammie, Peasant Pie w/feta and spinach, Granola, Bagel with cream cheese. With the exception of the BALT, we found that our picks were mediocre and poorly prepared. \n\nFirst off, biggest complaint: FROZEN food. You can tell when veggies/fruit was previously frozen and defrosted. Maybe not in say a spinach Peasant Pie but, seriously I'll notice if my cucumber slices and strawberries are translucent, water logged and soggy. It STUNS me to think that Velo Rouge would serve previously frozen strawberries in a granola bowl and soggy cucumbers in my side salad. Instant no-no and careless. \n\nSecond off, the Peasant Pie? Sounded interesting and tasted interestingly bad. The filling at potential but, the dough ruined it for us. It was chewy and tasted stale and not the right pastry for a Peasant Pie. \n\nThird off and final straw was the bagel. Nobody even bother to spread the cream cheese. It was literally cut off the block they have and sandwiched in between the bagel. They didn't even think to give us a butter knife to spread it ourselves when our order came. \n\nHonestly, I am disappointed in this restaurant and largely because of the lack of attention to detail and bad quality ingredients they serve their customers. Not coming back again and wouldn't recommend it to anyone.", "rating": 2, "date": "2013-09-30"}, {"excerpts": ["The ordered a tuna melt with a house side salad. ", "The tuna melt literally melts in your mouth and ", "the side salad is very fresh and healthy. ", "The salad consists of corn, sliced apples, strawberries, cucumbers, and fresh greens with a olive oil and lemon vinegrette. ", "The hot cocoa here is to die for. ", "I have been searching all my life for a good rich hot cocoa and have never be successful until I came here. ", "Their hot cocoa is legit and not watered down like you would most likely find at other coffeeshops in the city. ", "I definitely recommend this place to study or for lunch dates with friends. ", "Warning: They turn off their internet during lunch to prevent people with laptops from staying too long."], "author": "Amy T.", "review": "One of the best coffee shops you'll find in the city. The service is top notch. Tables are cleaned the instant customers get up to leave. Floors are swept the instant a crumb falls on the floor. Customers are greeted with smiles. I know this because I couldnt help but watch as I studied here on a warm Sunday afternoon. The decor is really unique! They have this really cool couch which appears to be made from bicycles. There is also outdoor seating! The bathrooms are kept clean and even smelling nice. The food is Amazing!!!! The ordered a tuna melt with a house side salad. The tuna melt literally melts in your mouth and the side salad is very fresh and healthy. The salad consists of corn, sliced apples, strawberries, cucumbers, and fresh greens with a olive oil and lemon vinegrette. The hot cocoa here is to die for. I have been searching all my life for a good rich hot cocoa and have never be successful until I came here. Their hot cocoa is legit and not watered down like you would most likely find at other coffeeshops in the city. I definitely recommend this place to study or for lunch dates with friends. Warning: They turn off their internet during lunch to prevent people with laptops from staying too long.", "rating": 5, "date": "2013-12-23"}, {"excerpts": ["Both dishes came with a great side salad. ", "Unfortunately, I just don't think either were anything more than ordinary. ", "I definitely could have made the Coppi at home with my own panini press. ", "I also ended up adding quite a bit of Sriracha, which is another sign that a dish lacks flavor. ", "On the upside, I've never had a greasy meal here. "], "author": "Anna N.", "review": "Velo Rouge is good, but it's not exceptional. I've been here twice now. The first time, I ordered their vegetarian panini with cream cheese. The second time, I had the Coppi sandwich. Both dishes came with a great side salad. Unfortunately, I just don't think either were anything more than ordinary. I definitely could have made the Coppi at home with my own panini press. I also ended up adding quite a bit of Sriracha, which is another sign that a dish lacks flavor. On the upside, I've never had a greasy meal here. The food always tastes fresh\n\nThe best part about this little cafe is its decor. I love the little table and seats made from bicycle parts! Great theme but average food.", "rating": 3, "date": "2013-10-06"}, {"excerpts": ["Both tasted fresh, and I loved that my panini came with a side salad instead of chips/fries. "], "author": "Kate B.", "review": "This is a quaint little cafe near Golden Gate Park with a lot of vegetarian (and even vegan!) options. My boyfriend got a breakfast burrito (which was more like a breakfast burrito panini... still delicious) and I got a turkey panini with spinach & some sort of jam. Both tasted fresh, and I loved that my panini came with a side salad instead of chips/fries. The salad was very good (it wasn't just some old lettuce that they threw together) and I love the pepper-y vinaigrette that was on it.\n\nThe ambiance is a bit junky-chique, but it works for the cafe. We really enjoyed our meal here (you order at the counter and they give you a number kind of a deal), and we'll keep this place in mind when going to the park in the future!", "rating": 4, "date": "2013-04-21"}, {"excerpts": ["The house potatoes are delicious, but the side salad is also good.  ", "However, be aware that they only give you a lemon to dress your salad, but the fresh fruits are a nice replacement for that.  ", "Everything I've tried on the menu has been good.  ", "I would say that the actual dishes are more worth getting in comparison to the easy breakfast sandwich or bagel, because it's not that much food for barely less money.  ", "I've also had two soups of the day, and both have been very good.  "], "author": "My An V.", "review": "I adore this place.  My sister lives right down the street so it's an easy way to get breakfast in the morning here.  They offer a variety of coffee drinks which is nice, because they'll always have what you crave.\n\nMy absolute favorite dish is the McAllister Scramble.  You really get the bang for your buck here.  The house potatoes are delicious, but the side salad is also good.  However, be aware that they only give you a lemon to dress your salad, but the fresh fruits are a nice replacement for that.  Everything I've tried on the menu has been good.  I would say that the actual dishes are more worth getting in comparison to the easy breakfast sandwich or bagel, because it's not that much food for barely less money.  I've also had two soups of the day, and both have been very good.  Helps make me feel better when I'm feeling a little sickly.\n\nDefinitely recommend this place to the surrounding neighborhoods.  Such a cute place to come and dine and chat.", "rating": 5, "date": "2012-09-04"}, {"excerpts": ["Nice that it comes with a side salad."], "author": "Dilly M.", "review": "Always a favorite spot for either breakfast, lunch or even an afternoon snack.  \n\nLove their sandwiches, the BLTA is one of my favorites. Nice that it comes with a side salad.", "rating": 4, "date": "2012-06-07"}, {"excerpts": ["Their Club sandwich is a gigantic meal in itself, and the side salad it comes with is the best! "], "author": "Apurva P.", "review": "If there was one food wish I had, it was that Velo Rouge would be open more nights a week.  \n\nNow for the awesomeness - the breakfast burrito is terrific. The layers of egg goodness with creamy avocado, breakfast potatoes, black beans, and cheese makes for a filling brunch/breakfast. \n\nTheir Club sandwich is a gigantic meal in itself, and the side salad it comes with is the best! It's the perfect light summery salad with berries and veggies!\n\nThis place has me totally spoiled, especially being less than a block away.", "rating": 5, "date": "2012-12-15"}, {"excerpts": ["It was super delicious and was rather filling (it came with a side salad too).  ", "I also had a bite of my friend's tuna melt which was also delicious.  ", "I think both dishes were ~7 dollars "], "author": "Emily W.", "review": "This place is such a cute cafe and I'll definitely drop by again when I'm in the area.  The decorations are awesome--some of the seats are made out of bike parts!  I ended up ordering a pantani (sp?) which was an eggplant, bell peppers, garlic cream cheese etc. sandwich, not to be confused with a panini!  It was super delicious and was rather filling (it came with a side salad too).  I also had a bite of my friend's tuna melt which was also delicious.  I think both dishes were ~7 dollars so it wasn't bad at all.\n\nI only have a few complaints:  it's so freaking popular that it's hard to find seating, though my friends I lucked out.  The food does not come out at the same time, so I'd recommend not waiting for your friend's food otherwise you'll be eating your food cold.\n\nBottom line:  solid cafe and I would definitely go back...just expect it to be crowded", "rating": 4, "date": "2012-01-09"}, {"excerpts": ["Sandwiches are around 8.50-9.50 and come with a side salad that is very nice. ", "Overall a great pick with friendly and speedy service with a coffee-house feel."], "author": "Mike F.", "review": "Awesome club sandwich loaded with an incredible amount of toppings. Sandwiches are around 8.50-9.50 and come with a side salad that is very nice. Overall a great pick with friendly and speedy service with a coffee-house feel.", "rating": 4, "date": "2014-12-28"}, {"excerpts": ["One enormous side salad and ", "soughdough-y pizza later, it was onto a delightful evening.  ", "Very reasonable prices and generous portions."], "author": "Lynn M.", "review": "My friend and I were both on the verge of cranky-town after a cramped commute from the Tenderloin to Golden Gate Park on the 5 during rush hour.  One enormous side salad and soughdough-y pizza later, it was onto a delightful evening.  Very reasonable prices and generous portions.", "rating": 4, "date": "2012-01-13"}, {"excerpts": ["Each sandwich is grilled and comes with a side salad.  ", "The salad is pretty robust with feta, sliced apple, corn and blueberry - surprisingly tasty.  "], "author": "Janet H.", "review": "Been hearing about the Velo Rouge Cafe serving Blue Bottle Coffee in the Richmond District.  Funny, as I lived close by in the early 90s, I never knew about this place.  That is because it has been here for only a year or so.\n\nI've been here for both breakfast and lunch.  Both times I get the double espresso which is a mainstay from me.  The espresso has a nice foam on top and has a nice flavor going down.  Most excellent.  For breakfast, I get the Mt. Ventoux breakfast sandwich.  It's an egg sandwich w/ jack cheese on croissant.  I add bacon to the sandwich as an extra.  For lunch, we have had the Pantani (grilled veggie/jack cheese) and Merckx (ham & swiss) sandwiches.  Each sandwich is grilled and comes with a side salad.  The salad is pretty robust with feta, sliced apple, corn and blueberry - surprisingly tasty.  Everything here is very good.\n\nAdded perks in the front of the cafe are the 2 doggie water bowls and the tire pump with Presta/Schrader valve both in one.  The Velo Rouge cafe is a welcome and much needed addition to the Richmond District.  You guys rock!!", "rating": 5, "date": "2009-02-17"}, {"excerpts": ["My meal was extra delicious--I had a panini that came with a side salad, and the salad was absolutely amazing. ", "It was spring mix with sliced pear on top, but it also had goat cheese, blueberries, strawberries, blackberries, and corn! ", "Pretty lavish for a \"side salad\".\n\n"], "author": "Katie D.", "review": "I've only been to Velo Rouge once so far, but let me say that everything about my experience was wonderful!\n\nThe staff were super friendly, and the place is so cute inside. My meal was extra delicious--I had a panini that came with a side salad, and the salad was absolutely amazing. It was spring mix with sliced pear on top, but it also had goat cheese, blueberries, strawberries, blackberries, and corn! Pretty lavish for a \"side salad\".\n\nMy latte also didn't disappoint--everyone raves about Blue Bottle coffee for a reason!", "rating": 4, "date": "2010-01-10"}], "coleslaw": [], "cup of soup": [], "chips and salsa": [{"excerpts": ["We ordered the breakfast burrito with chicken apple sausage (and black beans, potatoes, eggs, avocado, and sour cream) served with chips and salsa. ", "The burrito was large, definitely filling, and pretty delicious. ", "That being said, I thought having to add $2.50 for meat was a bit of a high price for an add on. "], "author": "Jon S.", "review": "So everyone knows brunch waits get ridiculous in this city. This place is a little different in that it's counter service, so you don't have to wait for a table... but you do have to wait a while for your food. There aren't a lot of tables inside, but you can grab your food to go and take it to the park. \n\nWe ordered the breakfast burrito with chicken apple sausage (and black beans, potatoes, eggs, avocado, and sour cream) served with chips and salsa. The burrito was large, definitely filling, and pretty delicious. That being said, I thought having to add $2.50 for meat was a bit of a high price for an add on. We split the Jack Johnson banana pancakes which had chunks of banana and almond cooked in. They were good, but could have been a little more banana-y. \n\nOverall the food was pretty good, and reasonably priced (for SF). We probably waited around a half hour for it, so I'm not sure it cut down significantly on the brunch wait. If I came back on a weekend, I'd probably call in a to-go order ahead of time.", "rating": 4, "date": "2015-04-12"}, {"excerpts": ["The chips and salsa it came with were absolutely great, just wish they gave more salsa. ", "But it was good enough that my family ordered a side plate of just chips and salsa. ", "Very good small sit down and recommend it for anyone who's hungry, or maybe just wants a cup of coffee ", "(their iced coffee is really good too)."], "author": "Eddie S.", "review": "Amazing environment, amazing food, and amazing prices. First time in SF in a while and I found this place on yelp and saw a lot of recommendations for the breakfast burrito so I had to try it. If you're vegetarian you'll love it, if you're not, you'll still love it. If you need some meat in your burrito throw some bacon, ham, or sausage in there. The chips and salsa it came with were absolutely great, just wish they gave more salsa. But it was good enough that my family ordered a side plate of just chips and salsa. Very good small sit down and recommend it for anyone who's hungry, or maybe just wants a cup of coffee (their iced coffee is really good too).", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["Massive (I always share it), it is stuffed with eggs, cheese, black beans, avocado, sour cream, potatoes, and it comes with chips and salsa.\n\n"], "author": "D S.", "review": "I literally have spent more time at Velo Rouge than my own house. Yes, it's hard to get seating during certain times. However, I walk in and the entire staff says hi to me. They serve Blue Bottle Coffee which is my favorite, and they know how to make it well.\n\nBreakfast: The breakfast burrito. Massive (I always share it), it is stuffed with eggs, cheese, black beans, avocado, sour cream, potatoes, and it comes with chips and salsa.\n\nLunch: The soups and salad are always good, but sandwich-wise I would stick to the Coppi (turkey, cheese, spinach, jam) or the Pantani (grilled veggies and cheese done panini style). There is also live music here on certain nights, and free wifi.", "rating": 5, "date": "2011-08-18"}]}