{"lettuce cup": [], "shumai": [{"excerpts": ["We got the shumai, and it was moist and juicy! ", "Very similar to other places but high quality and very filling. "], "author": "Brian N.", "review": "One of the best Asian fusion I have had! We got the shumai, and it was moist and juicy! Very similar to other places but high quality and very filling. It comes with four for an order.\n\nThe calamari salad was the best thing I ever had there or anywhere else (I'm a sucker for fish sauce). There was a bunch of fried calamari on a bed of salad and silver noodles mixed with other herbs and a generous about of fish sauce. The calamari was still sizzling hot and perfectly fried. The portions are amazing for the price. \n\nThe Korean BBQ wraps were really good as well! I thought the wraps could have been better and not been cold tortillas. It was basically steak fajitas with Korean seasoning (lack of a better description). The cut of the meat was a little stringy but it was easy to get over the fact since it was really flavorful. \n\nI tried some of the Mongolian beef and that was really good! \n\nThe service was amazing. The servers were very attentive and took plates at the perfect time. It was a little loud but great for a date night. There was also outside sitting but not much. I will be coming back for the calamari salad!!", "rating": 4, "date": "2017-04-28"}, {"excerpts": ["Shumai - 3/5\nHar gau - 4/5\nKaraage - 4/5\n", "Pork bao - 3/5\n", "Portobello tempura - 4/5 - Unique. ", "Truffle salt.\n", "Fries - 2/5\nMongolian beef - 3/5\n", "Tonkotsu ramen - 3/5\n"], "author": "Mark O.", "review": "Shumai - 3/5\nHar gau - 4/5\nKaraage - 4/5\nPork bao - 3/5\nPortobello tempura - 4/5 - Unique. Truffle salt.\nFries - 2/5\nMongolian beef - 3/5\nTonkotsu ramen - 3/5\nSesame ramen - 4/5\n\nOverall, \"I'm a fan.\"", "rating": 4, "date": "2015-08-20"}, {"excerpts": ["Started with a mint tea, shumai and garlic green beans. ", "Tea and green beans were delicious! ", "Shumai was a bit flavorless "], "author": "Yin H.", "review": "3.5\n\nVery cute asian restaurant at the corner of 23rd and Bryant. When we arrived for lunch on a Fri afternoon, the restaurant (albeit very limited seating and space) was completely packed. We opted to sit outside and brave the wind. Unfortunately, they do not serve hot sake but have plenty of cold sake to choose from. \n\nStarted with a mint tea, shumai and garlic green beans. Tea and green beans were delicious! Shumai was a bit flavorless and I had to drench mine in a bit of soy sauce.\n\nNext came the entree - TONKOTSU-SHOYU RAMEN!!\nRamen and broth were delicious!! The egg was average. The pork sparerib was a huge portion and very tender, but not too much flavor. \n\nService was very good and prompt (except for forgetting to bring us some chili paste for the ramen when we first asked). \n\nWould love to come back and try some other dishes. I was pretty thirsty after the meal which usually indicates a lot of sodium and/or MSG in the meal :(\n\nLove that they store utensils and napkins at the table in empty tins of Cafe Du Monde coffee!!", "rating": 3, "date": "2016-04-29"}, {"excerpts": ["My favorite things were the Shumai and The Ramen ( which I pilfered from my friend's bowl LOL)."], "author": "Lydia V.", "review": "Well,  my experience here was a little funny. Spice Jar is located in a space that is NOT plus size friendly. So if you are a curvy person wait for a table by the door and sit with your back to window. IJS. Some of he dishes are almost served like Tapas, especially the 6 hour braised short rib, very short. the fries are crunchy, Meh. My favorite things were the Shumai and The Ramen ( which I pilfered from my friend's bowl LOL).", "rating": 2, "date": "2017-02-12"}, {"excerpts": ["Try the Shumai for a starter. "], "author": "Mike K.", "review": "WOW! This is really good Asian Fusion food that is prepared with care and tastes great! Prices are very fair and while it's a bit cramped, you'll find it is worth the wait. You are here for the food not the ambiance. Service is good. Nice selection of wine and beer to go with the delicious food. We were here for lunch. Try the Shumai for a starter. We had Tonkatsu Ramen, Laksa and spare rib bua- all were tasty! We were happy and full when we left.", "rating": 4, "date": "2015-11-24"}], "crispy spring roll": [{"excerpts": ["Same for the crispy spring roll, they were a bit pedestrian.  "], "author": "Saminda W.", "review": "Super rich, super tasty East Asian comfort food.  Nothing healthy about this joint but ingredients are fresh and the flavor is on fleek.\n\nThe menu is fairly compact but in a very good way, a diversity of choices but no decision anxiety from a multi-page menu.  We started with the pork Shu-Mai which were solid, very well prepared but not epic.  Same for the crispy spring roll, they were a bit pedestrian.  The mains and sides were the 4-star caliber dishes: we went with the Spinach and Roasted Garlic Fried Rice (strong in flavor, only for garlic lovers), the Mongolian Chicken which was super savory and a tad too rich but overall pretty epic in flavor, and the garlic green beans which had the right balance of garlic and sweetness and salt were also the bom dot com.  \n\nService was friendly but the dishes were staggered in an non-ideal way, apps came out together but then there was about a 20 min wait after we finished those before our first entree came out (the fried rice), and then another 10 mins before the other two dishes (chicken and green beans) came out.", "rating": 4, "date": "2015-10-10"}, {"excerpts": ["Crispy Spring Roll Fair  \n2.) ", "Edamame Hummus Tasty! \n", "3.) ", "Har Gow (pork dumpling) ", "Yum\n4.) ", "Shu Mai (shrimp dumpling) ", "Good!\n5.) ", "Spare Ribs Bao Good! ", "Should be called spare rib singular no \"s\") since you only get one.\n", "6.) ", "Spinach & Garlic Rice Unique\n7.) "], "author": "Geraldine R.", "review": "When I first drove by The Spice Jar, I really thought it was going to be a specialty spice shop! After a quick search on yelp, I was wrong! YAY! Nothing against spice shops, but I rather eat than cook! HA! We arrived a little before 5:30pm (on a Thursday), no wait & no need to write our name on the waiting list! It was even sweet how the owner took the time to talk to us before the place quickly filled up! :) \n\nOur Dinner:\n1.) Crispy Spring Roll Fair  \n2.) Edamame Hummus Tasty! \n3.) Har Gow (pork dumpling) Yum\n4.) Shu Mai (shrimp dumpling) Good!\n5.) Spare Ribs Bao Good! Should be called spare rib singular no \"s\") since you only get one.\n6.) Spinach & Garlic Rice Unique\n7.) Zen Noodle Soup (Coconut based sambal broth, calamari, shrimp & black mussel YUM\n\nOur complete meal for 2 people (before tax) was only $27 each! Not bad at all!! Staff was friendly, checked in on us & kept our waters full! Will return to try the tonkatsu ramen, portobello tempura with truffle salt & Mongolian beef! I hope to see more mission locals here because the owners is so nice!!", "rating": 4, "date": "2015-08-21"}], "braised spare rib bao": [], "seafood cast iron fondue": [], "portobello mushroom tempura": [{"excerpts": ["Highly recommend Portobello mushroom tempura as a starter. ", "It goes very well with the beers if just coming in for late night snacks along with drinks. "], "author": "Adel A.", "review": "Cozy restaurant with ~15-20 seatings space. Lighting and decoration look nice and modern. Started with some beers, decent price was a plus!  They have a variety of Japanese imported beers if you want to try. Highly recommend Portobello mushroom tempura as a starter. It goes very well with the beers if just coming in for late night snacks along with drinks. Laksa was good but basic. Hanger steak bbq was very interesting- steak was medium-rare cooked and the SAUCE, I believe, is a cilantro based. Grab a piece of mushu wrap, put a piece of hanger steak, some grilled veggies, and the green sauce, it is damn good! I would like to try other dishes on the menu as well.  Overall, I loved the food, service, vibes- it's perfect for a date night or casual hangout with a friend. This restaurant has a big table in the middle to sit along with other customers and smaller table seatings around the space. Better for smaller group!", "rating": 4, "date": "2018-09-09"}, {"excerpts": ["portobello mushroom tempura (YUM!), laska and green curry. ", "Great vibe, would highly recommend it."], "author": "Saira Z.", "review": "The food here was amazing!\n\nI came her with a group of six. There is limited seating so ended up having to wait 45 minutes, but was totally worth it!\n\nWe got a variety of dishes, I tried: portobello mushroom tempura (YUM!), laska and green curry. Great vibe, would highly recommend it.", "rating": 5, "date": "2016-10-04"}], "homemade tofu": [{"excerpts": ["We had: lettuce cups, homemade tofu, seaweed salad, octopus salad, fried rice, and green curry.  "], "author": "Michael E.", "review": "We had: lettuce cups, homemade tofu, seaweed salad, octopus salad, fried rice, and green curry.  I liked the beer selection.\n\nEverything was good. The lettuce cups stand out.  Place is pretty crowded.", "rating": 4, "date": "2018-01-18"}, {"excerpts": ["Homemade Tofu $7 (http://bit.ly/1EBSJZe)\nSilky. "], "author": "Dan B.", "review": "Heard about it last week but said #effthat after glancing at the menu and the #newrestosyndrome slew of high reviews by people with not many reviews. #fastforward Today I awoke from a nap and randomly decided to go. I expected a forgettable meal but was pleasantly surprised.\n\n(^_^) Hanger Steak BBQ Mushu Wraps $18 (http://bit.ly/1EBSFZF)\nCooked outer, less cooked inner. #simbaitstodiefor\n\n(^_^) Braised Spare Ribs Bao $5 (http://bit.ly/1hLXJFL)\nOther reviewers had dry ones. #thatswhatshesaid\nNot mine. Wish BBQ places did rib texture like this.\n\n(^_^) Chicken Karaage Namban $7 (http://bit.ly/1JhcVRn)\nTender, moist. Sauce not spicy, idc.\n\n(-_^) Homemade Tofu $7 (http://bit.ly/1EBSJZe)\nSilky. Very hot at first bc of the bowl.\n\n(-_^) Edamame Hummus Jar $7 (http://bit.ly/1MxIUSz)\nHeld back by its cracker & crudité selection.\n\nThe food, the owner's friendliness, and the sheer comicality of filling up a makeshift shelf with dishes (http://bit.ly/1foB6Wi) made me feel better about seating snafus. Namely, how 1) there was an empty 2 top when I arrived and only larger parties ahead of me on the clipboard, 2) another 2 top became then stayed empty, 3) I got seated at not an actual table but a shelf that they cleared of supplies & plants, 3.5) which, if that was the plan all along, could've happened right when I walked up and not after a near half hour wait, and 4) I later realized the thing in the middle is a communal table, which also had empty spots the whole time. #thingsthatmakeyougohmmmm\n\nBut yeah, #nottrippin.", "rating": 4, "date": "2015-08-19"}, {"excerpts": ["The homemade tofu, which we were very excited about came out very watery, and goo-like. ", "Obviously not cooked enough, and when tried it was hard to swallow. \n", "I don't know if it's just me, but I like my tofu cooked. \n", "But like I said, the service was amazing and that's why it gets 3-stars. ", "They refilled our waters often and actually took the tofu back when we told them. ", "Although when they brought it back it was still bad, at least they tried. \n", "If you come to The Spice Jar, just order something other than the tofu."], "author": "Francis A.", "review": "The atmosphere is great. The area is great. Service was even great. However the food was not, and isn't that the whole point? \nFood was mediocre at best, which is disappointing for an asian fusion joint in San Francisco. \nThe homemade tofu, which we were very excited about came out very watery, and goo-like. Obviously not cooked enough, and when tried it was hard to swallow. \nI don't know if it's just me, but I like my tofu cooked. \nBut like I said, the service was amazing and that's why it gets 3-stars. They refilled our waters often and actually took the tofu back when we told them. Although when they brought it back it was still bad, at least they tried. \nIf you come to The Spice Jar, just order something other than the tofu.", "rating": 3, "date": "2017-08-08"}, {"excerpts": ["Ordered: \nshu Mai, spare rib bao and homemade tofu. ", "Previous review I read saying the tofu was a must order. ", "It was just okay to me. ", "The wasabi salt was a nice touch though. ", "Really enjoyed the \"fall of the bone\" spare rib bao and the shu Mai. "], "author": "Erica M.", "review": "I have been here twice. For dinner and lunch service. When I first stumbled upon this place about two months ago via Yelp I couldn't be more excited to check out an Asian cuisine in the Mission. \n\nFirst time I came for dinner. Ordered: \nshu Mai, spare rib bao and homemade tofu. Previous review I read saying the tofu was a must order. It was just okay to me. The wasabi salt was a nice touch though. Really enjoyed the \"fall of the bone\" spare rib bao and the shu Mai. Don't forget to try the Buddha beer! \n\nAnother visit for lunch ordered the Zen noodle soup (order was split with a friend) and the har gow. The spices in the soup were on point! The serving was just right for a lunch portion not leaving us overly stuffed. And don't pass up the ginger mint lemonade. Im weary about anything ginger. That too much gingery taste but it was the perfect blend. So good! \n\nDon't expect your authentic Asian cuisine here. It's Asian fusion and my kind of Asian Comfort food especially because of all the spices and flavors.  (I am Asian, well Filipino.  Authentic Chinese is my least craved food. I'd rather have Panda Express lol)   Look forward to returning and trying more dishes.", "rating": 5, "date": "2015-10-12"}, {"excerpts": ["- Homemade tofu: it's not for everyone, and not what most people expect. ", "It's much silkier, and soft. "], "author": "Dimple B.", "review": "The place was super cute, the vibe is great. \n\nIt's starts out like this... a vegetarian, 2 vegans, and a normal guy enter a restaurant and order: \n\n- portobella mushroom tempura: one of my favorite dishes of the night, comes with a lime for a nice hit of acidity. well balanced, crispy and meaty. \n- vegetable gyoza: really good, but fried for those of you that care. They may have been the ones from Trader Joe's, but they're still good.\n- Homemade tofu: it's not for everyone, and not what most people expect. It's much silkier, and soft. The flavor's a bit deeper, almost like you might imagine plaster might taste (but in a good way?)\n\n- roti w/ curry (aka roti prata). delicious. I don't know anyone who's messed up this dish, given that it's flaky layers of butter + curry. \n\n- garlic noodles (I didn't try this)\n- veggie ramens. peanutty flavor and pretty good. the ramen itself is fresh and great, the broth is much better than most do with a veg broth. \n\nOverall, a good space, reasonably priced. I'd be open to going back, but I wouldn't initiate.", "rating": 4, "date": "2016-09-10"}, {"excerpts": ["For an app we had the homemade Tofu and vegetable gyoza.  ", "The Tofu was interesting almost comes out as a fondu, not what we were expecting but not bad, not great! ", "The vegetable Gyoza was good! ", "For my entree I had the Mongorian chicken.  ", "It was good not great.  ", "Overall a decent restaurant, cool atmosphere but tight and strange seating."], "author": "Brian S.", "review": "Definitely an interesting restaurant, first in an out of the way location, definitely an Uber ride if you are staying in downtown SF which I was.  The place is small and they have an open seating model meaning we were sat literally at a big table right next to others, always a strange dining experience.  We arrived at 7:30pm and the place was jammed! Had to wait about 15 for a table!  For an app we had the homemade Tofu and vegetable gyoza.  The Tofu was interesting almost comes out as a fondu, not what we were expecting but not bad, not great! The vegetable Gyoza was good! For my entree I had the Mongorian chicken.  It was good not great.  Overall a decent restaurant, cool atmosphere but tight and strange seating.", "rating": 3, "date": "2017-07-13"}, {"excerpts": ["Homemade Tofu ", "- This was not the silky kind we thought it would be.  ", "The texture was more dense and firm.  ", "This could be more of a personal preference thing.  "], "author": "Kay Y.", "review": "First official day of business for The Spice Jar yesterday...\n\nMr. J and I went to check them out last night.  We were lucky that our wait wasn't too long, 15-20 minutes top.  But, they were definitely busy for a first day.\n\nAfter some pick and choose, we got the followings:\n\nHar Gow - The skin texture was wrong.  It tasted like mochi or Korean rice cakes.\n\nBraised Spare Ribs Bao - The meat was a little dry and the bao itself was not great.\n\nHomemade Tofu - This was not the silky kind we thought it would be.  The texture was more dense and firm.  This could be more of a personal preference thing.  The wasabi salt that came with it was a good idea, but you can't really taste the wasabi part though.\n\nGarlic Green Beans - The beans were a little mushy.\n\nTonkotsu-Shoyu Ramen - Mr. J and I thought the ramen was not bad.  But, we both think a good ramen still need some good chashu to go with it.\n\nLaksa - I am always searching for a good laksa.  This is probably not your most authentic laksa, but it is so far my favorite in the Bay Area.  The soup was not as thick and heavy as most of them out there and it got a little kick to it.  I pretty much down the whole bowl.\n\nCoffee Panna Cotta/Jello - We were lucky to try this not on the menu yet dessert.  It was delicious!  A little less in portion size and add some fresh seasonal fruits on top would make it even better.\n\nI'd come back just for the Laksa!  And, maybe try some more items on the menu.  Will try to stay away from the more \"Chinese-ish\" dishes though.  We had better and probably have a higher standard since we are Chinese.", "rating": 3, "date": "2015-07-01"}, {"excerpts": ["Must try their homemade tofu.  ", "Homemade fresh mint ginger lemonade.  ", "For sure to come back with friends!"], "author": "Emiliy L.", "review": "Great service.  Good food.  Cute place! Totally satisfied! Must try their homemade tofu.  Homemade fresh mint ginger lemonade.  For sure to come back with friends!", "rating": 5, "date": "2015-08-01"}, {"excerpts": ["Don't miss the miso ramen and the homemade tofu."], "author": "John T.", "review": "This is our go-to restaurant in San Francisco. The owners created a menu of things they love to eat, and the love shines through their food. It's a place where people feel comfortable and leave satisfied. The prices are incredibly reasonable for the quality. It's all good. We'd eat here every week, and often do. Don't miss the miso ramen and the homemade tofu.", "rating": 5, "date": "2015-12-30"}], "spiced chicken salad": [{"excerpts": ["I've also gotten the spiced chicken salad which was good for when I wanted to feel like I was eating something healthier ", ":)"], "author": "Hyan P.", "review": "Solid neighborhood spot. It's not a place I would walk more than 5/10 minutes to or be super excited to bring my parents to but it is a good / dependable spot for casual dinner. It's not fancy and the food isn't mind blowing but it is tasty and prices are very reasonable. \n\nI liked the laksa- it's super hearty and yummy. The sesame miso ramen was a little more creamy than I expected but did enjoy during a cold night. I've also gotten the spiced chicken salad which was good for when I wanted to feel like I was eating something healthier :)", "rating": 4, "date": "2018-08-01"}], "crispy calamari salad": [{"excerpts": ["I decided to try a salad during a subsequent visit, and though the crispy calamari salad looked very appetizing, I felt underwhelmed by the mixture of flavors.  "], "author": "Keith H.", "review": "I'm always searching for new restaurants in the Mission, and the Spice Jar definitely seems like a popular place for lunch.  Now that I've tried it a few times, I think there are definitely pluses and minuses to the dining experience.  This restaurant offers a pan-Asian menu in a crisp and clean setting. \n\nDuring my first visit, I decided to sample their appetizers/sides.  While the shu-mai were overflowing with pork filling, the aonori garlic fries tasted under-seasoned and lacked a strong garlic flavor.  I decided to try a salad during a subsequent visit, and though the crispy calamari salad looked very appetizing, I felt underwhelmed by the mixture of flavors.  I thought the calamari was fried well but could have used some salt; the dressing gave it some kick, but given that one of the billed ingredients was red curry honey, I was expecting more spicy heat.  \n\nI thought the service was fine, though it took a while to get my waiter's attention due to the busy lunch crowd.  Given the variety of menu items, I'll probably give it another try to see if I find something truly spectacular.", "rating": 3, "date": "2016-10-23"}, {"excerpts": ["Crispy Calamari Salad w/ mixed greens, vermicelli, red onion, cilantro, red curry honey ($12): ", "http://bit.ly/1LUlGaS\n", "*", "Hanger Steak BBQ ", "Mushu Wraps ", "w/ Korean spices, sautéed veggies ($18): ", "http://bit.ly/1NNmzCD\n", "*", "The Crispy Calamari Salad was gigantic and good enough for 4 people. ", "The calamari was overfried so the batter was hard. ", "The greens were overdressed with the pungent, sour dressing (pool of dressing at the bottom of the bowl). "], "author": "Cherylynn N.", "review": "Some people say, \"variety is the spice of life\". To me, that just means quantity over quality--like buffets. They usually suck and give you bubble guts.\n\nThen, you have Pan Asian restaurants that serve popular dishes from various Asian countries. Usually, I'm not a fan of Pan Asian or Asian Fusion cuisine because they rarely come close to the dishes I had growing up, the flavors are watered down, and/or the fusion of flavor profiles are just a hot mess. \n\nAfter seeing some raving reviews for The Spice Jar and that they had outdoor seating so we can bring Tater Tot, we decided to give it a shot. The Spice Jar is a newish restaurant (opened in late June 2015) that took over Local's Corner which was ok but grossly overpriced. The Spice Jar's menu is Pan Asian with several Asian Fusion dishes. There's items ranging from Chinese Dim Sum items to Vietnamese Pho to Japanese Ramen to Malaysian Laksa. The prices were reasonable for the very generous portions: small bites ($5-$12), salads ($8-$12), soups, noodles & rice ($9-$14), and large plates ($11-$19). No desserts. No msg is used. Shochu, sake, wine, and beer only. \n\nWe ordered the following:\n*Braised Sparerib Bao w/ lettuce, pickled cucumber, hoisin sauce ($5): http://bit.ly/1NaltR6\n*Crispy Calamari Salad w/ mixed greens, vermicelli, red onion, cilantro, red curry honey ($12): http://bit.ly/1LUlGaS\n*Hanger Steak BBQ Mushu Wraps w/ Korean spices, sautéed veggies ($18): http://bit.ly/1NNmzCD\n*Mongolian Lamb w/ onions, scallions, sesame bread (not shown) ($19): http://bit.ly/1KI2tb0\n\nBased on the dishes we sampled, The Spice Jar is just not my cup of tea. Seems to be better suited for yipsters and techie transplants so they choose a great location. We were the only Asians there aside from the staff. \n\nThe Sparerib Bao had a huge hunk of meat but in order to eat it with the bao, you had to cut the meat off of the bone first so it became messy. The bao was light and fluffy but the meat was tepid and a bit tough. It tasted like a boiled rib from the am that was drizzled with hoisin sauce. \n\nThe Crispy Calamari Salad was gigantic and good enough for 4 people. The calamari was overfried so the batter was hard. The greens were overdressed with the pungent, sour dressing (pool of dressing at the bottom of the bowl). The dressing didn't taste like curry or honey but a lime-fish sauce dressing used in Cambodian and Laotian salads. \n\nThe Hanger Steak BBQ Mushu Wraps (Asian fajitas) looked delicious as they sizzled on the cast iron platter. The hanger steak was cooked medium rare as requested but it was very chewy. The marinade had a savory sweetness similar to hoisin sauce, not Korean spices. I liked the accompanying cilantro (?) aioli but not with the steak as the flavors didn't mesh well. This would have been better on the calamari salad. This was also another messy dish because you had to slice the steak into smaller pieces before placing them in the wrappers to eat. I recommend that they place the mushu wrappers in a tortilla warmer because they dried out quickly. \n\nThe Mongolian Lamb was the most traditional tasting of the dishes we tried but the only dish that I felt was overpriced by $2-$3. The lamb was super tender and flavorful. It's served with sesame bread to make a sammie but I recommend substituting with rice so it's easier to eat.\n\nService was very welcoming and gracious. There's no doubt the Japanese owners are super sweet so if I was rating service alone, it would be 5 stars. They were also very nice to Tater Tot who would wake up from his nap every time a dish arrived thinking it was for him. Poor guy. Food service is on the slower end so do come here when you're not in a rush. \n\nThe Spice Jar is a small restaurant best for parties 2-4 people. The homey, rustic space hasn't changed much from Local's Corner aside from the painted walls, and addition of spice jars lining the walls. \n\nParking in the area is much easier than the central mission area.\n\nThe Spice Jar may not be my cup of tea but I wish the owners well. I hope they don't suffer the same fate as Local's Corner.", "rating": 3, "date": "2015-09-02"}, {"excerpts": ["Crispy calamari salad - comes with a generous portion of calamari; The dressing is packed with flavor and out of this world!\n", "4. ", "Seafood cast-iron fondue - I can't even begin to describe to you the flavor of this dish, but it's soooo good; comes with bite-size square toast pieces that you can dip into the seafood fondue.\n", "*", "*", "*", "*BF ALWAYS orders the green curry with chicken -  ", "I don't get it ", "but ok."], "author": "Priscilla P.", "review": "This is one of my (and my boyfriend's) favorite restaurants in SF.  \nMuch of the dishes served here are comfort pan-Asian delights.  The prices are reasonable for the most part.  Hamada the owner oversees the whole operation and he even remembers our order by heart!!  This place has a cozy neighborhood feel.\nThere are a handful of dishes you simply must try, because it's packed with amazing distinctive flavor and deliciousness!!  You won't quite find these dishes in any other restaurant, because they are one of a kind creation by the chef/owner Hamada.\n1. Albacore carpaccio - comes with special ponzu sauce and topped w Deep-fried and pickled jalapeños.\n2. Laksa noodle soup - savory and deeply comforting & satisfying on a cold evening, made w variety of malay spices and a small amount of Japanese curry\n3. Crispy calamari salad - comes with a generous portion of calamari; The dressing is packed with flavor and out of this world!\n4. Seafood cast-iron fondue - I can't even begin to describe to you the flavor of this dish, but it's soooo good; comes with bite-size square toast pieces that you can dip into the seafood fondue.\n****BF ALWAYS orders the green curry with chicken -  I don't get it but ok.", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["Crispy calamari salad - judging from how crispy and delicious the chicken was", ", I thought it would be the same for the calamari.. ", "The calamari was soggy and didn't taste seasoned ", ":/ ", "The calamari ratio was about 3:1 with the greens, which would normally be a good thing, but it just wasn't GOOD. "], "author": "Emily C.", "review": "I'm not one for Asian food in hipster areas but this place was surprisingly good!\nLocated in an up and coming area on the less busy Bryant Street in the Mission District is this cute and intimate spot. It's a bit cramped in here so not the best place for a big group. Can look like it's filling up quickly but the turnaround seems fast. Also a lot of take-out orders too so the kitchen is a bit slow.. a good 6 workers or so for this restaurant which can only fit probably like 25-30 people.... but the wait for your food will be worth it, I promise.\n\nThe workers are all extremely friendly but service may be a bit absent as they ARE busy - responsive when called though.\n\nMe and my friend tried quite a few items between the two of us and the only dish I would NOT recommend is the calamari salad.\n\nSpare rib bao - as many have stated, it comes as just one meaty rib still on the bone. I was scared it was going to be a bit messy but it was literally fall off the bone tender. Definitely one of the most tender ribs I've had. It was flavored thoroughly! The pickled cucumbers were thickly and roughly chopped, I wish it was cut more thinly, slightly more acidic, and less sweet. Still a very good appetizer - I just wish it came with 2 ribs :(\n\nChicken kara age (not on the online menu) - YASSSSSSS. Crispy (and stayed crispy) and perfectly seasoned. Lightly battered and came with 8-10 decent sized pieces. Would be perfect with beer.\n\nCrispy calamari salad - judging from how crispy and delicious the chicken was, I thought it would be the same for the calamari.. The calamari was soggy and didn't taste seasoned :/ The calamari ratio was about 3:1 with the greens, which would normally be a good thing, but it just wasn't GOOD. The red curry honey dressing was pretty nonexistent - kind of like a really watery honey with some spice - I don't think it complimented the salad.\n\nZen noodle soup - I don't usually like noodle soups with seafood because I don't like sea-foody tasting broths - but this was delicious! Very light tasting broth, delicate coconut flavor and just very, very slightly sour and hot. So good! I could eat a million bowls of these. Came with a good portion of shrimp, mussels and calamari. I wish it came with more noodles!\n\nOverall, very solid Asian fusion place. Would love to return to try their ramens and would DEFINITELY get the bao and kara age again :)", "rating": 4, "date": "2016-03-28"}, {"excerpts": ["My favorite was the Crispy Calamari Salad, but I don't know if I loved it enough to go back just for that item. ", "I'd maybe return when I have more money to spare! ", ":P"], "author": "Vicky P.", "review": "The Mongolian Beef is what you'd expect and tasty, but I think overpriced compared to what you could get at other asian restaurants. The Spicy Sesame Ramen was decent. My favorite was the Crispy Calamari Salad, but I don't know if I loved it enough to go back just for that item. I'd maybe return when I have more money to spare! :P", "rating": 3, "date": "2016-02-19"}, {"excerpts": ["I started with the Crispy Calamari Salad--a generous portion of fresh greens, topped with delicious, lightly breaded calamari and red honey curry dressing. "], "author": "Nicole C.", "review": "I'm usually quite wary of Asian \"fusion\" restaurants, as it seems to cater towards a crowd unused to specific cuisines. The interior design is very cosy, country home; while adorable, it almost reinforced my expectation of an underwhelming experience, due to cognitive dissonance. That being said, The Spice Jar pleasantly surprised me. I sampled an assortment of dishes and enjoyed all of them.\n\nI started with the Crispy Calamari Salad--a generous portion of fresh greens, topped with delicious, lightly breaded calamari and red honey curry dressing. The little critters were crisped perfectly and didn't overpower or wilt the salad leaves.\n\nI ordered the Tonkotsu-Shoyu Ramen next, and also loved it. I'm used to eating delicious ramen at food trucks, but this was truly a treat. The rib was fall-off-the-bone tender, and the broth was flavorful and substantial without being too salty. The noodles were cooked just right, with a bit of bite to them. The hard boiled egg was done just right too. \n\nThe couple who owns the restaurant are truly charming and wonderful. I've eaten here a few different times, and in recognizing me, they brought some Aonori Garlic Fries on the house. Yum! I was happy to see, upon my more recent visit, that they'd hired some wait staff. I can't imagine how insane opening weeks must have been with just the two of them doing all of the work--from cooking, to waiting on tables, busing, etc. \n\nThe interior design is worth mentioning again, because it is so unexpectedly adorable. The bottom of tables are adorned with material that feels like mattress topper--it prevents you from bruising yourself while shifting your legs. I almost want all the restaurants I go to to adopt this methodology. I'm so clumsy, it definitely saved me on multiple occasions.\n\nDefinitely eat here.", "rating": 4, "date": "2015-09-10"}, {"excerpts": ["I would eat the crispy calamari salad every day if I could. ", "It's huge and delicious. ", "So so good. ", "You won't regret it. ", "The curry is also fantastic."], "author": "Amy Y.", "review": "This place is the best! It's an adorable hidden gem in a quiet spot in the mission. Super friendly staff, great ambiance in the tiny space. Get there early to get a table since there aren't many. \n\nI would eat the crispy calamari salad every day if I could. It's huge and delicious. So so good. You won't regret it. The curry is also fantastic.", "rating": 5, "date": "2015-12-20"}, {"excerpts": ["Also loved the Mongolian beef and the crispy calamari salad. ", "The ramen could have used more flavor and the seafood fondue had a strange taste I couldn't quite place. ", "Otherwise, all was really really good. ", "Go and check them out!"], "author": "Tera K.", "review": "I'm not an adventurous eater so I was a little worried when I saw the menu. Gotta say, I ate everything that came to the table and my favorite was the albacore carpaccio! Next favorite and it was a close tie, was the shrimp dumpling. So tasty! Also loved the Mongolian beef and the crispy calamari salad. The ramen could have used more flavor and the seafood fondue had a strange taste I couldn't quite place. Otherwise, all was really really good. Go and check them out!", "rating": 4, "date": "2015-06-27"}], "tonkotsushoyu ramen": [], "spicy sesame miso ramen": [{"excerpts": ["Mark got the Spicy Sesame Miso Ramen. "], "author": "Scott N.", "review": "YUM!\n\nWe came for lunch today (Saturday). We were there early, so we were the first customers when they opened. We were the only customers while we were there.\n\nThe woman who helped us was so very kind. \n\nWe started with plum wine and what?!?! Jalapeño Plum Wine? Yep! I didn't get it, but Mark did. I took a sip. It was good! Oh... my plum wine was SUPER sweet. Plum wine is supposed to be sweet, but this was almost shockingly sweet. I did enjoy it, but asked for a Chardonnay as a follow up.\n\nWe started with Albacore Carpaccio. What a stunning dish! The presentation was gorgeous and the taste was fantastic. The jalapeño was not too hot, the ponzu sauce complimented the fish so well. And I don't know what was served on top... something that looked fried... very small slivers of fried something? I should have asked; it didn't say on the menu. Anyway.. FANTASTIC. Get it!\n\nMark got the Spicy Sesame Miso Ramen. He really enjoyed it.\n\nI got the Tonkotsu-Shoyu Ramen with the braised spare rib. It was really quite good. People have commented on the egg and while I agree I'd expect the yellow to be runny, the description on the menu says boiled egg... and it is boiled. So that's the way they serve it. Works for me. I thought the noodles were delicious. The beef was tender. The broth had a wonderful, beef flavor. I thought it was very good.\n\nI'd like to try The Spice Jar for dinner because the dinner menu has more options. Plus it might be fun to check out the evening vibe. From the reviews it seems this place is hopping in the evening. For Saturday lunch... it was super slow. Go visit them... they deserve the business.", "rating": 4, "date": "2016-04-16"}, {"excerpts": ["My husband ordered the spicy sesame miso ramen which was very simple - just broth and ramen noodles. ", "The broth was great with the right amount of spiciness and the noodles were oh so good and extremely fresh. ", "I had the tonkotsu-shoyu ramen. "], "author": "Lisa D.", "review": "Some of the best ramen I've had in a long long time! We absolutely loved this place. Came here on a Saturday night at 6:45pm and only had to wait about 10 minutes. By the time we left there was quite a line. It's a small little place with excellent service and fanatic ramen. I ordered the mint tea which was light and refreshing. My husband ordered the spicy sesame miso ramen which was very simple - just broth and ramen noodles. The broth was great with the right amount of spiciness and the noodles were oh so good and extremely fresh. I had the tonkotsu-shoyu ramen. Again the broth was fantastic and I loved how it wasn't super oily like other places. \n\nThe service was great. They were very nice and quick with everything. The cost was great as well. Overall this place has everything - great food, great service all at a great cost.", "rating": 5, "date": "2016-04-10"}, {"excerpts": ["* Spicy Sesame Miso Ramen - "], "author": "Johnny W.", "review": "*** In Short ***\n\nOkay Asian food, seasoned and catered to an American (a.k.a. heavier) palate. \n\n*** In Depth ***\n\nWhat's a guy to do when he loves Asian food, has tried most of what Chinatown has to offer countless times, but is too lazy to trek out to Sunset or Richmond? Check out the Mission, of course! Coming with two other friends who weren't particularly hungry (and myself as a light eater), we only ordered a handful of dishes:\n\n* Shu Mai - Definitely not your traditional dim sum style shu mai. The ones at Spice Jar are much larger and sweeter, with wonton skin that was oddly papery/gritty in texture, none of which made for a super desirable dish.\n\n* Braised Short Rib Bao - If you're perplexed by why you only get one per order, it's because these are also likely to be larger than you expected. Super tender and flavorful short rib, but, be it the meat or the other sauces, the bao ended up also being too sweet. \n\n* Spicy Sesame Miso Ramen - Definitely the most solid and tasty dish of the three, with nice springy noodles, albeit a bit plain overall in terms of toppings and accoutrements. \n\nIf you're in the area and have a hankering for Asian, this certainly isn't terrible, but trekking a little into Chinatown goes a long way.\n\n***Accessibility Info***\n\nVenue - There's a large single step/platform to get into the restaurant, so we opted to sit outside instead, which was marginally more accessible, because the way the table legs were positioned made scooting under impossible. I didn't look closely enough at the accessibility of the inside, for those who feel like braving the step (it's really not that bad).\n\nBathroom - Didn't try.", "rating": 2, "date": "2015-12-06"}, {"excerpts": ["The Spinach & Roasted Garlic Fried Rice was extremely flavorful and so was the Spicy Sesame Miso Ramen, which we got the spicy version of. ", "Overall, great experience and "], "author": "Jardin M.", "review": "Went 100% vegetarian this time around and I was pleasantly. Limited menu, but I'm not complaining. The Spinach & Roasted Garlic Fried Rice was extremely flavorful and so was the Spicy Sesame Miso Ramen, which we got the spicy version of. Overall, great experience and I'll be back to try some of the meat offerings!\n\nAmbience is nice and cosy...went here on a Friday night around 8 and had a 20min wait, which is great for SF. \n\nCan't wait to be back!", "rating": 4, "date": "2017-02-20"}, {"excerpts": ["For the main courses we had the Spicy Sesame Miso Ramen. ", "It really wasn't that spicy even with spicy in the name. ", "It was decent. ", "You could probably afford to increase the spiciness across all dishes. "], "author": "Annette D.", "review": "I came here with a group of 4 on a Tuesday night. They do not take reservations, but we got there around 7:30pm and there weren't any names on the list yet (though the inside was already full). It was incredibly nice out so we asked to be sat outside. They have a few tables they placed on the sidewalk outside and it was perfect. They were able to sit all four of us immediately out there. \n\nThey only server wine, beer and sake here. They have a small selection but it's all decent. They were incredibly prompt and friendly with getting our drink and appetizer orders in.\n\nNone of us knew what to expect, but I can tell you the appetizers blew our socks off! We had the Albacore Carpaccio with Jalapeno sauce. That was so incredibly good- probably the best dish of the night. Highly recommend making a point to get that. We also got the Braised Spare Rib, which also was amazing. Lastly we had the garlic edamame. Not the best I've had, but still somewhat tasty. \n\nFor the main courses we had the Spicy Sesame Miso Ramen. It really wasn't that spicy even with spicy in the name. It was decent. You could probably afford to increase the spiciness across all dishes. We had the Spice Jar Fried rice. It was good, but again not that spicy at medium. \n\nOverall the experience was just lovely, the food was good and definitely a place I'd come back. They were all very nice!", "rating": 5, "date": "2016-02-18"}], "zen noodle soup": [{"excerpts": ["Between the two of us, we shared the Garlic Edamame ($5), Roti Bread with Curry Dipping ($5), Zen Noodle Soup ($15), Laksa ($14), and Ginger Ice Cream ($4). ", "I can't even decide what to talk about first because everything was delicious! ", "The edamame are piping hot and drenched in a spicy garlic dressing --a must order! ", "As for the roti, it was standard but loved the curry dipping sauce to go with it for a nice starter. ", "Between the two main soups, they were special in their own ways with the zen noodle more of a lighter Tom Yum seafood flavor while the Laksa is similar to a thicker curry noodle soup. ", "Even though we were stuffed, we decided to try the ginger ice cream which was amazing! ", "I was so pleasantly surprised with the flavor, which was not too strong and mixed in with some candied ginger bites. "], "author": "Cindy Z.", "review": "A friend brought me here raving about this place and one can easily agree after the first time eating here. We arrived on a Thursday at 6pm before the rush, so was easily seated. The restaurant is nice and cozy, so you can expect a line at normal hours although they work efficiently to get everyone in and out.\n\nBetween the two of us, we shared the Garlic Edamame ($5), Roti Bread with Curry Dipping ($5), Zen Noodle Soup ($15), Laksa ($14), and Ginger Ice Cream ($4). I can't even decide what to talk about first because everything was delicious! The edamame are piping hot and drenched in a spicy garlic dressing --a must order! As for the roti, it was standard but loved the curry dipping sauce to go with it for a nice starter. Between the two main soups, they were special in their own ways with the zen noodle more of a lighter Tom Yum seafood flavor while the Laksa is similar to a thicker curry noodle soup. Even though we were stuffed, we decided to try the ginger ice cream which was amazing! I was so pleasantly surprised with the flavor, which was not too strong and mixed in with some candied ginger bites. It was the perfect ending to the meal.\n\nThis place has easily become a new favorite from their delicious food, great price point, and wonderful service. I can't wait to come back and try the rest of the menu!", "rating": 5, "date": "2018-09-14"}, {"excerpts": ["The Zen Noodle soup was delicious. ", "It was a coconut/samal based broth with an assortment of seafood that was sweet and tangy. ", "The tonkatsu ramen was also amazing with the meat falling right off the bone. ", "Definitely a must try!"], "author": "Swan L.", "review": "Cute little pan-Asian restaurant on the corner of 23rd and Bryant that is a perfect place for a reasonably priced lunch. The place is little that can get pretty packed. Seating may also be communal.\n\nThe Zen Noodle soup was delicious. It was a coconut/samal based broth with an assortment of seafood that was sweet and tangy. The tonkatsu ramen was also amazing with the meat falling right off the bone. Definitely a must try!", "rating": 4, "date": "2016-05-07"}, {"excerpts": ["Zen noodle soup - I don't usually like noodle soups with seafood because I don't like sea-foody tasting broths - ", "but this was delicious! ", "Very light tasting broth, delicate coconut flavor and just very, very slightly sour and hot. ", "So good! ", "I could eat a million bowls of these. ", "Came with a good portion of shrimp, mussels and calamari. "], "author": "Emily C.", "review": "I'm not one for Asian food in hipster areas but this place was surprisingly good!\nLocated in an up and coming area on the less busy Bryant Street in the Mission District is this cute and intimate spot. It's a bit cramped in here so not the best place for a big group. Can look like it's filling up quickly but the turnaround seems fast. Also a lot of take-out orders too so the kitchen is a bit slow.. a good 6 workers or so for this restaurant which can only fit probably like 25-30 people.... but the wait for your food will be worth it, I promise.\n\nThe workers are all extremely friendly but service may be a bit absent as they ARE busy - responsive when called though.\n\nMe and my friend tried quite a few items between the two of us and the only dish I would NOT recommend is the calamari salad.\n\nSpare rib bao - as many have stated, it comes as just one meaty rib still on the bone. I was scared it was going to be a bit messy but it was literally fall off the bone tender. Definitely one of the most tender ribs I've had. It was flavored thoroughly! The pickled cucumbers were thickly and roughly chopped, I wish it was cut more thinly, slightly more acidic, and less sweet. Still a very good appetizer - I just wish it came with 2 ribs :(\n\nChicken kara age (not on the online menu) - YASSSSSSS. Crispy (and stayed crispy) and perfectly seasoned. Lightly battered and came with 8-10 decent sized pieces. Would be perfect with beer.\n\nCrispy calamari salad - judging from how crispy and delicious the chicken was, I thought it would be the same for the calamari.. The calamari was soggy and didn't taste seasoned :/ The calamari ratio was about 3:1 with the greens, which would normally be a good thing, but it just wasn't GOOD. The red curry honey dressing was pretty nonexistent - kind of like a really watery honey with some spice - I don't think it complimented the salad.\n\nZen noodle soup - I don't usually like noodle soups with seafood because I don't like sea-foody tasting broths - but this was delicious! Very light tasting broth, delicate coconut flavor and just very, very slightly sour and hot. So good! I could eat a million bowls of these. Came with a good portion of shrimp, mussels and calamari. I wish it came with more noodles!\n\nOverall, very solid Asian fusion place. Would love to return to try their ramens and would DEFINITELY get the bao and kara age again :)", "rating": 4, "date": "2016-03-28"}, {"excerpts": ["Another visit for lunch ordered the Zen noodle soup (order was split with a friend) and the har gow. ", "The spices in the soup were on point! ", "The serving was just right for a lunch portion not leaving us overly stuffed. ", "And don't pass up the ginger mint lemonade. ", "Im weary about anything ginger. ", "That too much gingery taste but it was the perfect blend. "], "author": "Erica M.", "review": "I have been here twice. For dinner and lunch service. When I first stumbled upon this place about two months ago via Yelp I couldn't be more excited to check out an Asian cuisine in the Mission. \n\nFirst time I came for dinner. Ordered: \nshu Mai, spare rib bao and homemade tofu. Previous review I read saying the tofu was a must order. It was just okay to me. The wasabi salt was a nice touch though. Really enjoyed the \"fall of the bone\" spare rib bao and the shu Mai. Don't forget to try the Buddha beer! \n\nAnother visit for lunch ordered the Zen noodle soup (order was split with a friend) and the har gow. The spices in the soup were on point! The serving was just right for a lunch portion not leaving us overly stuffed. And don't pass up the ginger mint lemonade. Im weary about anything ginger. That too much gingery taste but it was the perfect blend. So good! \n\nDon't expect your authentic Asian cuisine here. It's Asian fusion and my kind of Asian Comfort food especially because of all the spices and flavors.  (I am Asian, well Filipino.  Authentic Chinese is my least craved food. I'd rather have Panda Express lol)   Look forward to returning and trying more dishes.", "rating": 5, "date": "2015-10-12"}, {"excerpts": ["Zen Noodle Soup (Coconut based sambal broth, calamari, shrimp & black mussel "], "author": "Geraldine R.", "review": "When I first drove by The Spice Jar, I really thought it was going to be a specialty spice shop! After a quick search on yelp, I was wrong! YAY! Nothing against spice shops, but I rather eat than cook! HA! We arrived a little before 5:30pm (on a Thursday), no wait & no need to write our name on the waiting list! It was even sweet how the owner took the time to talk to us before the place quickly filled up! :) \n\nOur Dinner:\n1.) Crispy Spring Roll Fair  \n2.) Edamame Hummus Tasty! \n3.) Har Gow (pork dumpling) Yum\n4.) Shu Mai (shrimp dumpling) Good!\n5.) Spare Ribs Bao Good! Should be called spare rib singular no \"s\") since you only get one.\n6.) Spinach & Garlic Rice Unique\n7.) Zen Noodle Soup (Coconut based sambal broth, calamari, shrimp & black mussel YUM\n\nOur complete meal for 2 people (before tax) was only $27 each! Not bad at all!! Staff was friendly, checked in on us & kept our waters full! Will return to try the tonkatsu ramen, portobello tempura with truffle salt & Mongolian beef! I hope to see more mission locals here because the owners is so nice!!", "rating": 4, "date": "2015-08-21"}, {"excerpts": ["Zen Noodle Soup -- ", "The waitress said this dish is one of the few dishes that the owner bought over from the previous restaurant due to is popularity. ", "She had a lot of good things to say about it, so it felt wrong not to order it. ", "However, I am a wimp and cannot handle spicy foods, we asked them to tweak it a little bit and make it as mild as possible. ", "This was also the last dish to come out, so we were already pretty full by the time it go to us. ", "The soup had good flavor, but it was a little sour for my liking. ", "They use rounded rice noodles for the dish. ", "There was surprisingly a lot of seafood also. ", "The were only a few pieces of calamari, which were slightly chewy, but still tender enough for me to swallow. ", "The shrimp was a bit overcooked, but that's usually the case when you order shrimp with a soup. ", "They were very generous with the mussels, and it was probably the best part of the dish. "], "author": "Vivian L.", "review": "Came here on the the first day they opened and my friend and I were lucky enough to snag the last table before the rush came in. \n\nWe ordered:\n\nBraised Spare Ribs Bao -- The thing was HUGE! I was expecting a smaller bao, kind of like peiking duck style. But this thing was more like a cross between a bao and a taco if you will. The meat was really tender and came off the bone, just like the waitress said. Even though there was a bone in it, the amount of meat they gave us was still pretty generous. The bao was very thick and doughy. The combination of the two was a disaster in my mouth. Although the meat had a decent flavor to it, the bread completely overpowered the meat, and it was difficult to swallow because it was so dry. The pickled veggies helped, but not too much. After the first bite, I ended up eating the bao and the meat separately. Even though it wasn't intended to be served that way, it tasted much better in my opinion.\n\nHar Gow -- One order comes with four har gows, but they separate the har gows into two steamers so they don't stick together. There is also a piece of lettuce between the har gows and the steamer, maybe to keep it from sticking to the steamer or for sanitary reasons perhaps? I'm not quite sure. The skin of the har gow is really thick, unlike traditional har gows. It comes very close to tasting like bao to me. The skin is very sticky, so it sticks really well to the steamer and the lettuce, and I completely destroyed one of the har gows before I even got it onto my plate. :( The prawns were huge! But, the har gows soaked in the flavor of the lettuce in the steamer, which took away even more of the authenticity of the har gows. :(\n\nShu Mai -- The most authentic dish that we ordered, in my opinion.  They were slightly smaller than the har gows, but not by much. The texture of the skin was thin, and the filling had a good pork to mushroom ratio. The mushroom is subtly more noticeable than the pork, just how I like it.\n\nGarlic Aonori Fries -- They were surprisingly good! Most likely just frozen Sysco fries with garlic aonori powder. But I'm not complaining! I could sit in front of the TV and eat these all day!\n\nZen Noodle Soup -- The waitress said this dish is one of the few dishes that the owner bought over from the previous restaurant due to is popularity. She had a lot of good things to say about it, so it felt wrong not to order it. However, I am a wimp and cannot handle spicy foods, we asked them to tweak it a little bit and make it as mild as possible. This was also the last dish to come out, so we were already pretty full by the time it go to us. The soup had good flavor, but it was a little sour for my liking. They use rounded rice noodles for the dish. There was surprisingly a lot of seafood also. The were only a few pieces of calamari, which were slightly chewy, but still tender enough for me to swallow. The shrimp was a bit overcooked, but that's usually the case when you order shrimp with a soup. They were very generous with the mussels, and it was probably the best part of the dish. The mussels were on the smaller side, but I guess the amount they gave us made up for it.\n\nWasabi Ale -- Not my cup of ale. Very interesting taste. I thought the taste was similar to some sort of powder mix. I really wanted to like it because of how unique it was, but my taste buds said no. :( My friend enjoyed it, so I just let him drink all of it.\n\nThe place is pretty small. They could seat maybe 25-30 people or so. When we walked in, they were trying to fix the balance on one of the tables. The aisles were pretty narrow too, and it was difficult to not bump into other parties when we walked out. Decent food, but clearly, they have a few kinks to work out.", "rating": 3, "date": "2015-07-13"}, {"excerpts": ["Zen noodle soup is very tasty, ordered a side of jasmine rice and I couldn't finish it... ", "They put lots of mussels, shrimp, and oysters in it... ", "But even on top of all that the coconut broth was mesmerizing ... ", "Date night???  ", "simple dish lots of flavor"], "author": "Danny S.", "review": "Zen noodle soup is very tasty, ordered a side of jasmine rice and I couldn't finish it... They put lots of mussels, shrimp, and oysters in it... But even on top of all that the coconut broth was mesmerizing ... Date night???  simple dish lots of flavor", "rating": 5, "date": "2016-11-22"}, {"excerpts": ["Zen noodle soup was fine but nowhere near the spice or deliciousness of comparable noodle soups at Kitchen Story.   \n", "Also got some mongolian beef and fried rice to go, nothing special there.  ", "Next time, I would probably stick with the japanese menu items.  \n", "Matcha iced tea was delicious! \n", "Overall a very clean, hip place with decent food but nothing too special.  ", "The owners are very kind and caring ", "and I hope they work things out!"], "author": "T Y.", "review": "3.5 stars. \nThis new restaurant is still working out kinks.  \nFriday night dinner was very crowded, about 20 min wait to sit, and then another 20 minutes for food to arrive (2 bowls of noodles).  The owners should probably streamline the menu to account for the small kitchen and limited cooks. If you have to make 5 kinds of (very different) noodle broths, on top of all these other menu items, it's going to take forever to serve everyone.  \nTable next to me complained that their appetizer dumplings arrived 40 minutes into the dinner (after they were already full from everything else, and tried to send it back, but the server said something about how he is just the server and couldn't do anything about the speed of food).  \n\nPho ga was light and not strongly flavored; the chicken was rubbery and dry.  When the waitress asked how my food was, I showed her the rubber chicken and she immediately took it away to remake it (even though I insisted I didn't mind eating the noodles alone).  Although this was very nice, my eating companion was then left with the problem of eating alone or waiting for my food to be remade while his soup got cold.  \nZen noodle soup was fine but nowhere near the spice or deliciousness of comparable noodle soups at Kitchen Story.   \nAlso got some mongolian beef and fried rice to go, nothing special there.  Next time, I would probably stick with the japanese menu items.  \nMatcha iced tea was delicious! \nOverall a very clean, hip place with decent food but nothing too special.  The owners are very kind and caring and I hope they work things out!", "rating": 3, "date": "2015-07-27"}, {"excerpts": ["We got the green curry with chicken and the zen noodle soup. ", "Definitely coming back to try other items."], "author": "Jason S.", "review": "Friendly attentive waitress, cute decor, delicious food. We got the green curry with chicken and the zen noodle soup. Definitely coming back to try other items.", "rating": 4, "date": "2015-07-24"}], "laksa": [{"excerpts": ["Between the two of us, we shared the Garlic Edamame ($5), Roti Bread with Curry Dipping ($5), Zen Noodle Soup ($15), Laksa ($14), and Ginger Ice Cream ($4). ", "I can't even decide what to talk about first because everything was delicious! ", "The edamame are piping hot and drenched in a spicy garlic dressing --a must order! ", "As for the roti, it was standard but loved the curry dipping sauce to go with it for a nice starter. ", "Between the two main soups, they were special in their own ways with the zen noodle more of a lighter Tom Yum seafood flavor while the Laksa is similar to a thicker curry noodle soup. ", "Even though we were stuffed, we decided to try the ginger ice cream which was amazing! ", "I was so pleasantly surprised with the flavor, which was not too strong and mixed in with some candied ginger bites. "], "author": "Cindy Z.", "review": "A friend brought me here raving about this place and one can easily agree after the first time eating here. We arrived on a Thursday at 6pm before the rush, so was easily seated. The restaurant is nice and cozy, so you can expect a line at normal hours although they work efficiently to get everyone in and out.\n\nBetween the two of us, we shared the Garlic Edamame ($5), Roti Bread with Curry Dipping ($5), Zen Noodle Soup ($15), Laksa ($14), and Ginger Ice Cream ($4). I can't even decide what to talk about first because everything was delicious! The edamame are piping hot and drenched in a spicy garlic dressing --a must order! As for the roti, it was standard but loved the curry dipping sauce to go with it for a nice starter. Between the two main soups, they were special in their own ways with the zen noodle more of a lighter Tom Yum seafood flavor while the Laksa is similar to a thicker curry noodle soup. Even though we were stuffed, we decided to try the ginger ice cream which was amazing! I was so pleasantly surprised with the flavor, which was not too strong and mixed in with some candied ginger bites. It was the perfect ending to the meal.\n\nThis place has easily become a new favorite from their delicious food, great price point, and wonderful service. I can't wait to come back and try the rest of the menu!", "rating": 5, "date": "2018-09-14"}, {"excerpts": ["Laksa: ", "Good, but you have to be in the right mood for the super thick curry soup. "], "author": "Angela T.", "review": "So delicious! I'm usually weary of any Asian Fusion places that serve pho AND ramen, but I was pleasantly surprised by this place. I liked their smattering of Asian dishes--probably because they actually tasted good!  So rare \n\n- Calamari Salad: The best item by far. It was large, had vegetables, and I loved the dressing. Large pieces of delicious calamari. Would definitely recommend\n- Green Curry: Solid curry. Perfect spicy level and comes with rice\n- Takoyaki: Excellent. Would get again \n- Laksa: Good, but you have to be in the right mood for the super thick curry soup. Would order again on a cold day \n\nCan't wait to go back! Be prepared to wait 45+ minutes if you on a Saturday at 6:30PM", "rating": 4, "date": "2018-09-25"}, {"excerpts": ["My boyfriend got the laksa ", "Laksa: Really nice curry flavor, perfect consistency for the soup! \n", "Tonkotsu shoyu ramen: Big pieces of pork belly and rich soup, noodles were chewy, one whole marinated egg. "], "author": "Katy Y.", "review": "No wait on a Saturday around 1:40 pm :) My boyfriend got the laksa and I had the ramen. \n\nLaksa: Really nice curry flavor, perfect consistency for the soup! \nTonkotsu shoyu ramen: Big pieces of pork belly and rich soup, noodles were chewy, one whole marinated egg. The pork belly was a little too fatty and the broth didn't taste super authentic, but it was good overall. \n\nWould come back!", "rating": 4, "date": "2018-09-16"}, {"excerpts": ["-I got the laksa // ", "14.00 // really tasty and had an ice flavorful kick! ", "The coconut curry broth was super comforting and the shrimp, tofu and rice noodles were both filling and perfectly cooked!\n", "-my ", "friend got the tonkotsu ramen // ", "14.00 // ", "and she said it was delish! "], "author": "Emily T.", "review": "Really cute, hip corner restaurant that has tasty asian food! They have super yummy noodle soups! \n\nWhy I was here // My friend and I wanted to try a new restaurant and I heard from a couple of friends good things about this place! \n\nVibe // hip, chill, intimate, cozy with wooden benches and tables. They have specials on the back wall accompanied by their dessert options. \n\nFood // delicious! The perfect winter dinner spot! \n-I got the laksa // 14.00 // really tasty and had an ice flavorful kick! The coconut curry broth was super comforting and the shrimp, tofu and rice noodles were both filling and perfectly cooked!\n-my friend got the tonkotsu ramen // 14.00 // and she said it was delish! She ate it up so fast! \n\nOverall // service was excellent! They waiters came by to check on us every now and then and they filled our waters for us! I really enjoyed this experience!", "rating": 5, "date": "2017-12-14"}, {"excerpts": ["Laksa was good but basic. ", "Hanger steak bbq was ", "very interesting- steak was medium-rare cooked and the SAUCE, I believe, is a cilantro based. ", "Grab a piece of mushu wrap, put a piece of hanger steak, some grilled veggies, and the green sauce, it is damn good! ", "I would like to try other dishes on the menu as well.  ", "Overall, I loved the food, service, vibes- ", "it's perfect for a date night or casual hangout with a friend. ", "This restaurant has a big table in the middle to sit along with other customers and smaller table seatings around the space. ", "Better for smaller group!"], "author": "Adel A.", "review": "Cozy restaurant with ~15-20 seatings space. Lighting and decoration look nice and modern. Started with some beers, decent price was a plus!  They have a variety of Japanese imported beers if you want to try. Highly recommend Portobello mushroom tempura as a starter. It goes very well with the beers if just coming in for late night snacks along with drinks. Laksa was good but basic. Hanger steak bbq was very interesting- steak was medium-rare cooked and the SAUCE, I believe, is a cilantro based. Grab a piece of mushu wrap, put a piece of hanger steak, some grilled veggies, and the green sauce, it is damn good! I would like to try other dishes on the menu as well.  Overall, I loved the food, service, vibes- it's perfect for a date night or casual hangout with a friend. This restaurant has a big table in the middle to sit along with other customers and smaller table seatings around the space. Better for smaller group!", "rating": 4, "date": "2018-09-09"}, {"excerpts": ["The seaweed salad (massive!) and the laksa coconut curry soup stole my taste buds away. ", "Things were well seasoned and spiced. ", "That laksa soup was especially swoon-worthy... ", "My vegan dining partner likes the tofu steak, though I'm always a bit sad that there isn't a broader range of substantive vegan options on the menu. ", "(Most things can be made pescatarian but lots of the broths have fish or shrimp.) ", "Small but nice range of drink options. "], "author": "Anastasia Z.", "review": "We really enjoyed the Spice Jar each time we went!\n\nThe seaweed salad (massive!) and the laksa coconut curry soup stole my taste buds away. Things were well seasoned and spiced. That laksa soup was especially swoon-worthy... My vegan dining partner likes the tofu steak, though I'm always a bit sad that there isn't a broader range of substantive vegan options on the menu. (Most things can be made pescatarian but lots of the broths have fish or shrimp.) Small but nice range of drink options. Hitachino beers always hit the spot.\n\nCute decor and nice outdoor seating that doesn't feel too hustle and bustle like some spots' outdoor seating does.\n\nServers were friendly and even accommodated a massive party on short notice. \n\nA solid choice for flavorful food in an atmosphere that feels relaxed.", "rating": 4, "date": "2018-02-18"}, {"excerpts": ["Laksa - Tried a bit of this and loved the flavor as well. ", "The soup is veeeery heavy and hard to finish as it has more of a thick, curry consistency. ", "It would have been better if the \"soup\" was watered down ", "but this also wasn't a huge issue. "], "author": "Chelsea W.", "review": "Awesome spot for Asian comfort food of various cuisines paired with noticeably dedicated service. The Spice Jar appears like a hipster, almost more Westernized restaurant but don't let that fool you. I've passed by it all the time on my way back to work and after finally trying it, the flavor of the dishes definitely took me by surprise. \n\nThe menu has a section for small bites, salad, soup/noodles/rice, and \"hungry.\" Prices are pretty reasonable for the most part and entrees will run you about $11-14 except for some heavier protein outliers like the Mongolian Lamb ($19), Seven Spiced Salmon ($16), and Hangar Steak BBQ Mushu Wraps ($18). The choices vary by certain Asian cuisines, such as Thai or Vietnamese. Some also appear to be more Asian fusion as well.\n\nThe space is pretty limited and has a communal table. When I went it appeared like it was a good setup for dates. We sat at bar seating near the open kitchen area. \n\nThe staff is pretty nice and friendly. Even though the restaurant was quite busy, the waiter was really kind about coming to refill water and check up on us. The service definitely left a good impression on me.\n\nBased on the previous reviews, it seems like some of the dishes are a hit or miss, but luckily I had a pretty good experience.\n\nSeven Spiced Salmon - Portions were smaller than expected for the steep price of $17. I wish there was more to this dish, maybe more rice or a side of veggies. The fish did feel a bit overcooked, but it didn't bother me too much. With that said, I enjoyed the flavor and quality of the salmon.\n\nLaksa - Tried a bit of this and loved the flavor as well. The soup is veeeery heavy and hard to finish as it has more of a thick, curry consistency. It would have been better if the \"soup\" was watered down but this also wasn't a huge issue. We ended up not being able to finish and took it home to put on top of rice!  \n\nI'm curious to try other dishes, and given the the reasonable prices and proximity I will be back!", "rating": 4, "date": "2017-06-16"}, {"excerpts": ["Laksa ($14) - MMMMMMMM. ", "Is all I can say. ", "Haha ", "I love their laksa here. ", "Flavor punch throughout. ", "Thinnish just right noodles. ", "All with some delicious dry tofu and chicken. ", "Which I'm a fan of. "], "author": "Sara S.", "review": "My GO-TO in the neighborhood. Spice Jar is tucked away in a residential neighborhood b.w. the Mission & Potrero Hill but near the hustle and bustle of 24th Street. Making it a cute little destination to stop by while exploring the area or perhaps before grabbing ice cream at Humphry Slocombe or Dynamo Donuts.\n\nSpice Jar is quite the small restaurant with capacity for around 15-17 tables including indoor and outdoor seating. The indoors is quite lovely with interesting light arrangements above their wooden tree-emulating tables. The orangey yellow dim but not too dim lighting make it a romantic spot but also a nice place to come to with family or friends! I feel right at cozy home when I walk in. \n\nIt can get quite busy here even on a random weekday night so I would call ahead to see. The waiters and waitresses are super nice, just a little busy sometimes. They give a family like vibe *but I am unsure of their relations haha*\n\nAs for food, it is quite phenomenal here! I love love it. True to their name, Spice Jar dishes are packed with flavors and I lay there floored by their food . A few... maybe a lot... that I have tried are as follows:\n\nEdamame (~$6) - covered in garlic and spice, I'm IN LOVE. I would not skip out on this especially as the portion size is a bit ridiculously large. Our table of 3 had leftovers.. a rare occurrence with edamame haha.\n\nFries ($6) - delicious thin fries covered in herbs with a clean feeling. Def have had better but also these hit the spot and as a potato addict I wouldn't skip out on these either\n\nSpice Jar Fried Rice ($14) - so I for one never get fried rice at restaurants cus PFT I can make that at home. But honestly it is so good here! With shrimp and chicken woven throughout the veggie packed fried rice, the flavor can't be beat. And interestingly enough, it's not salty. I think it attests to how they create great dishes with their unique spices!\n\nLaksa ($14) - MMMMMMMM. Is all I can say. Haha I love their laksa here. Flavor punch throughout. Thinnish just right noodles. All with some delicious dry tofu and chicken. Which I'm a fan of. If you like meaty dishes tho, maybe get something else because I found myself digging for some chicken that was on the dryish side.\n\nTonkatsu Ramen ($14) - the most meh dish of them all. Packed with flavor but the noodles are just like my shin ramen noodles and they get very puffy pretty quickly. Comes with a good chunk of Pork Belly but the meat in this is pretty good not great! So if you're craving ramen like I was, maybe it's for you but it won't be amazing like some of their other dishes\n\nTL;DR @threelittlewhales (insta!)\nAmbiance 4/5\nService 4/5\nFood 5/5", "rating": 5, "date": "2017-10-18"}, {"excerpts": ["Our Ramen and Laksa definitely filled noodle craving - these dishes were stronger more for their broth and flavor, less so for the noodles' texture."], "author": "Ziyan C.", "review": "Always nice to find another local spot in East Mission! \n\nTHE WAIT: 10 minutes for two on a Thursday at 1:15pm. \n\nCOST: $35.89 before tips for 1 starter and 2 lunch entrees. \n\nMUST-HAVES: The Garlic String Beans are great - strong flavor, with that perfect crisp. \n\nOur Ramen and Laksa definitely filled noodle craving - these dishes were stronger more for their broth and flavor, less so for the noodles' texture.", "rating": 4, "date": "2017-03-05"}, {"excerpts": ["We then shared the Laksa which is Coconut Curry broth with shrimp, chicken, tofu, bean sprouts, cilantro and rice noodles. ", "Delicious! ", "Great flavors! ", "We also had a bowl of the Green Curry Chicken with tomatoes, broccoli and basil with a bowl of Jasmine Rice. "], "author": "Barbara n.", "review": "Great find for truly delicious Asian Fusion lunch! \nBusy neighborhood restaurant in the heart of the Mission District in San Francisco. Seating is limited so arrive before noon for lunch or the locals will beat you to the punch! \n\nThe lunch menu is full of great options that will leave you satisfied and full and wanting to come back to try more of their great dishes. For our appetizer we chose the Shu-Mai steamed pork dumplings which were delicious and cooked perfectly. We then shared the Laksa which is Coconut Curry broth with shrimp, chicken, tofu, bean sprouts, cilantro and rice noodles. Delicious! Great flavors! We also had a bowl of the Green Curry Chicken with tomatoes, broccoli and basil with a bowl of Jasmine Rice. All very fresh ingredients and full of flavor. \n\nThis was our first experience at the Spice Jar and for sure not our last.", "rating": 4, "date": "2017-03-23"}, {"excerpts": ["We had Laksa and the Tofu Portabello Steak. ", "I would highly recommend both! ", "They were both VERY flavorful and a decent portion. ", "The only sad part about leaving the Spice Jar was that I feel like I only scratched the surface. ", "So many yummy options to choose from! ", "If I lived closer I would totally be back!"], "author": "Kimberly G.", "review": "Disclaimer: Tourist review\n\nWOW! Spice Jar was delicious! While visiting San Francisco we searched on Yelp for \"Asian Fusion\" and the Spice Jar was the first restaurant that popped up. What a treat! \n\nThe restaurant is pretty tiny so we waited outside for about 25 minutes. The wait was 100% worth it! I loved the vibe and decor. It's a great place for a date night or dinner with close friends. \n\nWe had Laksa and the Tofu Portabello Steak. I would highly recommend both! They were both VERY flavorful and a decent portion. The only sad part about leaving the Spice Jar was that I feel like I only scratched the surface. So many yummy options to choose from! If I lived closer I would totally be back!", "rating": 5, "date": "2017-10-01"}, {"excerpts": ["Loved the Laksa, Fried rice and the green curry. ", "Very subtle flavors, that tasted delicious and comforting. ", "The fried rice had a nice kick to it that enhanced the taste! "], "author": "Shriya P.", "review": "What a cute little place! Great find for Asian Fusion food. Loved the Laksa, Fried rice and the green curry. Very subtle flavors, that tasted delicious and comforting. The fried rice had a nice kick to it that enhanced the taste! The spring rolls and Lettuce wraps were pretty good too! \n\nSeating is quite limited, so I would try to get here early. We waited about 15 mins on a weeknight for a table for 4.", "rating": 4, "date": "2017-03-28"}, {"excerpts": ["If you are indecisive and crave anything within the range of ramen, pho, laksa, Mongolian beef, dim sum, poke, and fries, Spice Jar has it all. \n\n"], "author": "Edna C.", "review": "Hmmm I hate to be negative, but sometimes it feels like the food scene has been downgrading to mason jars and moderately photogenic but overpriced, mediocre food. I was quite excited to try the Spice Jar given the glowing reviews and proximity to SFGH. \n\nA lot of fusion nowadays seems to be very hit-or-miss: either they have found the perfect balance and creatively synergized diverse cuisines, or it dilutes the wholesomeness of the original dish in a lackluster (though usually good-looking) concoction. \n\nThe Spice Jar features a menu of selected classics from Asian cuisine. If you are indecisive and crave anything within the range of ramen, pho, laksa, Mongolian beef, dim sum, poke, and fries, Spice Jar has it all. \n\nI tried the TONKOTSU-SHOYU RAMEN with braised spare rib, spinach, bean sprouts, soft boiled egg, and green onion. It turned out quite underwhelming from both a hard-core ramen enthusiast and an open-minded fusion enthusiast perspective. The tonkotsu broth was quite salty and lacked pork flavor, and its combination with shoyu made it even more diluted and rendered an indecisive, halfway-there profile. The braised spare rib had a nice fall-off-the-bone texture but not quite enough flavor. Perhaps the most anti-climactic was the hard-boiled egg. I guess my favorite part was the ample spinach. \n\nAmbiance is cozy and hip, with nice wooden tables in a cheerful, sunlit space. Something about the acoustics is off though; I was sitting across the table from friends and it was so noisy, we could hardly have a conversation. \n\nSpice Jar has a good concept as a homey, modern restaurant serving pan-Asian and fusion specialties, but the food isn't really quite there in my opinion. It may cater to those with different tastes than myself, and service was quite friendly. Unfortunately this was a lunch from which I left mildly dissatisfied and with $14 less... but with a pretty picture of ramen.", "rating": 2, "date": "2016-07-22"}, {"excerpts": ["Laksa - excellent!  "], "author": "Barnali D.", "review": "Great food (for the most part), excellent service, and an elegant, cozy setting.\n\nMy husband and I shared the following (be warned, this was too much food for the two of us, and we packed leftovers):\n\n1) Spare rib bao - disappointing - unfortunately, the meat was overcooked and tough\n2) Shiumai - good, though a bit dry\n3) Spicy miso ramen - flavorful!\n4) Laksa - excellent!  Our favorite dish.\n5) Mongolian beef - packed with flavor - another highlight!\n\nWe came around 7:30pm on a Thursday night, and waited only 10 minutes for a table.\n\nThe service was excellent.  Our waiter (we thought he might be the owner, but never asked) was very friendly, knowledgable, and efficient.  We felt well taken care of and never rushed, even though there was a crowd outside waiting to get in.\n\nThe setting is warm, cozy, and inviting.  The light fixtures were unique and lovely.\n\nOverall, a very good spot.  We'll be back!", "rating": 4, "date": "2016-08-04"}, {"excerpts": ["My favorites are the karaage fried chicken, the pan fried garlic noodles and the laksa soup ", ":)"], "author": "Lindsey T.", "review": "My favorite restaurant in SF, it's my neighborhood go to. Excellent vibes, a great spot for date night or catching up with friends. The wait is never too long no matter how many people are waiting and the staff is always so great and friendly. My favorites are the karaage fried chicken, the pan fried garlic noodles and the laksa soup :)", "rating": 5, "date": "2018-08-21"}, {"excerpts": ["The portions for ramen, laksa etc are quite generous so you could share one if you want to order a bunch of other dishes."], "author": "Christina A.", "review": "It can get really crowded for dinner but it's a great neighborhood spot for Asian food. Be prepared for a small, cozy space where you can enjoy a comforting bowl of noodle soup on a cold SF evening. I've tried many things on the menu including the garlic edamame, poke bowl, ramen, roti bread, shu mai etc and they've all been good. The only dish that left me disappointed was the hanger steak mushu wrap because the meat was too chewy the one time I ordered it. \nThe portions for ramen, laksa etc are quite generous so you could share one if you want to order a bunch of other dishes.", "rating": 5, "date": "2018-01-05"}, {"excerpts": ["Recommend: short rib baos, shrimp fried rice, and Laksa noodle soup."], "author": "Ella K.", "review": "This place offers creave blend between South East Asian and East Asian cuisines! Food is pretty solid, though you might find some dishes a bit overpriced. We did a family style and ordered 2 appetizers and 4 main dishes to share and that was plenty.\n\nRecommend: short rib baos, shrimp fried rice, and Laksa noodle soup.", "rating": 4, "date": "2017-10-14"}, {"excerpts": ["We shared the nori French fries (3/5) and each got a noodle dish- the laksa (3/5) and tonkatsu Shoyu ramen (2/5)\n\n", "The laksa was creamy and seafood portions were sufficient. \n\n"], "author": "Tiffany L.", "review": "My girlfriend and I had seen photos of this place in Instagram and were intrigued to try it out. With two kiddos in tow we hoped for a quick but delicious lunch.\n\nThey were extremely kid friendly. Although limited with space and rather packed for lunch, they accommodated us and allowed us space for a stroller. Service was very prompt.\n\nWe shared the nori French fries (3/5) and each got a noodle dish- the laksa (3/5) and tonkatsu Shoyu ramen (2/5)\n\nThe French fries were decent. Freshly fried but lacked garlic flavor.\n\nThe laksa was creamy and seafood portions were sufficient. \n\nThe tonkatsu ramen was flavorful and rich. The braised spare rib was a bit tough to eat and a bit chewy. The soft boiled egg was NOT a soft boiled egg. It was a boiled egg. \n\nDecent spot for a bite. Not sure if it was good enough for me to go back.", "rating": 3, "date": "2016-04-11"}, {"excerpts": ["What killed the entire meal for me was the less than stellar laksa dish. ", "There were some overpowering flavors in there in addition to chicken that seemed to have been cooked separately then added. ", "I really was far from impressed. "], "author": "Devashis R.", "review": "I couldn't decide between a 3 or 4. To me, it's 3.5. It's a cute place and the servers (owners maybe?) were very nice. Very busy, so you may have to wait. Got seated at the communal table, which was fun to meet a couple people while overhearing another couple on a terrible first (and likely last) date.\n\nThe Japanese styled fried chicken app was excellent. Nicely crispy and flavorful. What killed the entire meal for me was the less than stellar laksa dish. There were some overpowering flavors in there in addition to chicken that seemed to have been cooked separately then added. I really was far from impressed. Probably would give that alone a 2 star rating but the appetizer, ambiance (check out the cool branch light they made), and people made up for it.\n\nI would certainly give this place another shot. The tons of people lined up and stellar reviews can't all be wrong.", "rating": 4, "date": "2016-12-02"}, {"excerpts": ["We got Laksa and the calamari salad and both were delicious.  ", "Excellent service.  ", "We brought our stroller and they were very accommodating finding a space for us.  ", "Would definitely come back."], "author": "Reggie G.", "review": "4.5 stars really.  Very good Asian restaurant.  We got Laksa and the calamari salad and both were delicious.  Excellent service.  We brought our stroller and they were very accommodating finding a space for us.  Would definitely come back.", "rating": 4, "date": "2018-01-06"}, {"excerpts": ["I'm curious what their laksa or pho tastes like. ", "It might hold true that the place is too diverse to specialize in one type of thing."], "author": "Yad L.", "review": "It's a cute, hipster spot. Exactly the vibe you'd expect from a ramen place in the Mission. But I was expecting more from their ramen. I'm curious what their laksa or pho tastes like. It might hold true that the place is too diverse to specialize in one type of thing.", "rating": 3, "date": "2016-09-28"}, {"excerpts": ["There's items ranging from Chinese Dim Sum items to Vietnamese Pho to Japanese Ramen to Malaysian Laksa. ", "The prices were reasonable for the very generous portions: small bites ($5-$12), salads ($8-$12), soups, noodles & rice ($9-$14), and large plates ($11-$19). ", "No desserts. ", "No msg is used. "], "author": "Cherylynn N.", "review": "Some people say, \"variety is the spice of life\". To me, that just means quantity over quality--like buffets. They usually suck and give you bubble guts.\n\nThen, you have Pan Asian restaurants that serve popular dishes from various Asian countries. Usually, I'm not a fan of Pan Asian or Asian Fusion cuisine because they rarely come close to the dishes I had growing up, the flavors are watered down, and/or the fusion of flavor profiles are just a hot mess. \n\nAfter seeing some raving reviews for The Spice Jar and that they had outdoor seating so we can bring Tater Tot, we decided to give it a shot. The Spice Jar is a newish restaurant (opened in late June 2015) that took over Local's Corner which was ok but grossly overpriced. The Spice Jar's menu is Pan Asian with several Asian Fusion dishes. There's items ranging from Chinese Dim Sum items to Vietnamese Pho to Japanese Ramen to Malaysian Laksa. The prices were reasonable for the very generous portions: small bites ($5-$12), salads ($8-$12), soups, noodles & rice ($9-$14), and large plates ($11-$19). No desserts. No msg is used. Shochu, sake, wine, and beer only. \n\nWe ordered the following:\n*Braised Sparerib Bao w/ lettuce, pickled cucumber, hoisin sauce ($5): http://bit.ly/1NaltR6\n*Crispy Calamari Salad w/ mixed greens, vermicelli, red onion, cilantro, red curry honey ($12): http://bit.ly/1LUlGaS\n*Hanger Steak BBQ Mushu Wraps w/ Korean spices, sautéed veggies ($18): http://bit.ly/1NNmzCD\n*Mongolian Lamb w/ onions, scallions, sesame bread (not shown) ($19): http://bit.ly/1KI2tb0\n\nBased on the dishes we sampled, The Spice Jar is just not my cup of tea. Seems to be better suited for yipsters and techie transplants so they choose a great location. We were the only Asians there aside from the staff. \n\nThe Sparerib Bao had a huge hunk of meat but in order to eat it with the bao, you had to cut the meat off of the bone first so it became messy. The bao was light and fluffy but the meat was tepid and a bit tough. It tasted like a boiled rib from the am that was drizzled with hoisin sauce. \n\nThe Crispy Calamari Salad was gigantic and good enough for 4 people. The calamari was overfried so the batter was hard. The greens were overdressed with the pungent, sour dressing (pool of dressing at the bottom of the bowl). The dressing didn't taste like curry or honey but a lime-fish sauce dressing used in Cambodian and Laotian salads. \n\nThe Hanger Steak BBQ Mushu Wraps (Asian fajitas) looked delicious as they sizzled on the cast iron platter. The hanger steak was cooked medium rare as requested but it was very chewy. The marinade had a savory sweetness similar to hoisin sauce, not Korean spices. I liked the accompanying cilantro (?) aioli but not with the steak as the flavors didn't mesh well. This would have been better on the calamari salad. This was also another messy dish because you had to slice the steak into smaller pieces before placing them in the wrappers to eat. I recommend that they place the mushu wrappers in a tortilla warmer because they dried out quickly. \n\nThe Mongolian Lamb was the most traditional tasting of the dishes we tried but the only dish that I felt was overpriced by $2-$3. The lamb was super tender and flavorful. It's served with sesame bread to make a sammie but I recommend substituting with rice so it's easier to eat.\n\nService was very welcoming and gracious. There's no doubt the Japanese owners are super sweet so if I was rating service alone, it would be 5 stars. They were also very nice to Tater Tot who would wake up from his nap every time a dish arrived thinking it was for him. Poor guy. Food service is on the slower end so do come here when you're not in a rush. \n\nThe Spice Jar is a small restaurant best for parties 2-4 people. The homey, rustic space hasn't changed much from Local's Corner aside from the painted walls, and addition of spice jars lining the walls. \n\nParking in the area is much easier than the central mission area.\n\nThe Spice Jar may not be my cup of tea but I wish the owners well. I hope they don't suffer the same fate as Local's Corner.", "rating": 3, "date": "2015-09-02"}, {"excerpts": ["Laksa noodle soup - savory and deeply comforting & satisfying on a cold evening, made w variety of malay spices and a small amount of Japanese curry\n3. "], "author": "Priscilla P.", "review": "This is one of my (and my boyfriend's) favorite restaurants in SF.  \nMuch of the dishes served here are comfort pan-Asian delights.  The prices are reasonable for the most part.  Hamada the owner oversees the whole operation and he even remembers our order by heart!!  This place has a cozy neighborhood feel.\nThere are a handful of dishes you simply must try, because it's packed with amazing distinctive flavor and deliciousness!!  You won't quite find these dishes in any other restaurant, because they are one of a kind creation by the chef/owner Hamada.\n1. Albacore carpaccio - comes with special ponzu sauce and topped w Deep-fried and pickled jalapeños.\n2. Laksa noodle soup - savory and deeply comforting & satisfying on a cold evening, made w variety of malay spices and a small amount of Japanese curry\n3. Crispy calamari salad - comes with a generous portion of calamari; The dressing is packed with flavor and out of this world!\n4. Seafood cast-iron fondue - I can't even begin to describe to you the flavor of this dish, but it's soooo good; comes with bite-size square toast pieces that you can dip into the seafood fondue.\n****BF ALWAYS orders the green curry with chicken -  I don't get it but ok.", "rating": 5, "date": "2017-11-06"}, {"excerpts": ["It's close to my work and the pho ga and laksa are AMAZING! ", "Love the ambience and the staff are so nice :-) ", "I'm here once a month for sure (usually more!)"], "author": "Devika P.", "review": "I am a spice jar aficionado! It's close to my work and the pho ga and laksa are AMAZING! Love the ambience and the staff are so nice :-) I'm here once a month for sure (usually more!)", "rating": 5, "date": "2018-02-08"}, {"excerpts": ["The Laksa was okay, but the noodles were slightly soggy. ", "The mushroom tempura came out cold, so I know they don't fry it when you order it. ", "Also, there was no hint of the promised truffle salt. ", "The gyoza was deep-fried, like they do at milk tea shops. ", "The salmon was overcooked (not medium-rare), but otherwise seared well. "], "author": "Jefferey L.", "review": "Service was great. Like, really, really good. Michelin-star good. The waiter must have come by three or four times to top off my water. Plates and utensils were changed between meals, even though they were fairly clean. We were asked multiple times if everything was going well. Really, I haven't been to a restaurant with such great service in a long time.\n\nThat being said, the food was really, really mediocre, leaning on bad. The garlic noodles weren't chewy enough (maybe overcooked?), were too vinegary, and didn't really taste of much garlic. The Laksa was okay, but the noodles were slightly soggy. The mushroom tempura came out cold, so I know they don't fry it when you order it. Also, there was no hint of the promised truffle salt. The gyoza was deep-fried, like they do at milk tea shops. The salmon was overcooked (not medium-rare), but otherwise seared well. The green yogurt(?) sauce it came with was unsavory, but there was furikake somewhere in the dish that was a pleasant surprise. \n\nOverall, this is a restaurant I would actively avoid. I honestly feel terrible about giving them two stars because the restaurant is fairly new and service was so wonderful, but I honestly feel cheated at the price we paid for the food we received ($35/head). There wasn't a single dish I really loved, but many dishes I wish I hadn't ordered. At the end of dinner, neither of us wanted the leftovers.\n\nI was dining with a pescetarian friend of mine, so we weren't able to order any of the recommended dishes. That might have contributed to our poor experience, but I'm a firm believer that all food on a restaurant's menu should be delicious.", "rating": 2, "date": "2017-06-01"}, {"excerpts": ["Hands down for the Mongolian dishes and the Laksa dish with coconut milk noodles with shrimps & tofu, they were simply delicious and very flavorful! \n", "The roti bread with curry was a little bit too much on the oily side but the curry dip was very good.\n", "To finish our dinner we all shared a small jar of their coconut rice pudding, I can just say that it wasn't my last time eating this, I'll so get it again next time I eat there! \n", "I'll be back! ", "This place is heaven for foodies! ", "So many flavors in 1 dish! ", "Service is also very good, the lady took time to explain to us the different dishes and helped us chose our dish.\n", "Price is the best!!! ", "Very affordable!"], "author": "Rachida I.", "review": "This is a very unexpected amazing place for Asian fusion food! The food is very diversed: veggie, meat and seafood options. From egg noodle to (amazing) salmon. I went with a group of friends and we had the seafood fondue, veggie gioza, garlic edamame as appetizers, all were very tasty, the fondue lacked a little bit of spices but the olives inside were a great idea and brought some saltiness to the dish.\nHands down for the Mongolian dishes and the Laksa dish with coconut milk noodles with shrimps & tofu, they were simply delicious and very flavorful! \nThe roti bread with curry was a little bit too much on the oily side but the curry dip was very good.\nTo finish our dinner we all shared a small jar of their coconut rice pudding, I can just say that it wasn't my last time eating this, I'll so get it again next time I eat there! \nI'll be back! This place is heaven for foodies! So many flavors in 1 dish! Service is also very good, the lady took time to explain to us the different dishes and helped us chose our dish.\nPrice is the best!!! Very affordable!", "rating": 5, "date": "2016-11-12"}, {"excerpts": ["Get the laksa and the iced green tea!"], "author": "Chris C.", "review": "Such a great place! The decor and outside seating makes it a really charming spot for a date. The owners are friendly and the prices are reasonable. Get the laksa and the iced green tea!", "rating": 5, "date": "2017-07-06"}, {"excerpts": ["I tried the Kara Age, Seaweed Salad, Garlic aonori fries, and Laksa, all of which are fantastic. \n\n"], "author": "Susan L.", "review": "This is a gem a little out of the way of the core shenanigans in the Mission. \n\nThe restaurant is on the smaller side -- definitely recommend going towards the early end of dinner service to avoid the wait. Also dog friendly if outdoor seating is open!\n\nI tried the Kara Age, Seaweed Salad, Garlic aonori fries, and Laksa, all of which are fantastic. \n\nIt's like my life's purpose to identify chill, unpretentious places to eat where you can bring your friends, baes, whomever at any time and Spice Jar definitely fits the bill!!", "rating": 4, "date": "2016-06-13"}, {"excerpts": ["friend's favorite is the laksa. "], "author": "Denise L.", "review": "Cute wittle restaurant in the middle of the Mission neighborhood. Indoor and outdoor seating. Adorable, nature-y decor.\n\nI think the best thing about this place is the service. Everyone is so happy and helpful! One time I called in a togo order and didn't know that the haw gaw (shrimp dumpling) was only for dinner but before I could even say that it's ok, the lady immediately told me to hold on for a sec to see if the chef could make it for me. And of course being so kind, the chef said sure. To go out of their way like that was so appreciated. All the other times I have gone into The Spice Jar, the service is amazing. \n\nFOOD:\n-Aonori garlic fries are the best! Packed with flavor but not overly salty. Perfection.\n-The haw gaw skin is overwhelmingly thick and not thin like dimsum places. Probably wouldn't get again.\n-The shu mai is pretty good for not being a dimsum spot. Big pieces!\n-The chicken pho tastes clean and the self-added ingredients are fresh.\n-The tonkatsu ramen has a delicious broth, but the egg is a fully cooked hard boiled egg. Wish it was soft boiled like the menu reads.\n-If you enjoy the taste of mint, the Spice Jar fried rice would be your thang. It tastes pretty heavy on the mint side. The portion is huge, and they don't skimp out on the shrimp and chicken. A good dish to share!\n-My friend's favorite is the laksa. Heard it is a popular item, but I have yet to personally try it.\n\nThis place has been my new favorite place to go for lunch. Must try!", "rating": 4, "date": "2015-11-04"}, {"excerpts": ["I've been here 3 times now and some my favorites include the Laksa, miso ramen, and the seaweed salad (actually seaweed mixed with a giant bowl of greens). ", "Nothing that I've had here is conventional-- ", "the laksa is surprisingly thick, the calamari on the calamari salad is super thinly sliced/tough, and the shrimp dumplings (ha gow) have too much dough (which makes the dumplings bigger than usual and awkwardly sexual looking when you try to lift one up :). ) \n\n"], "author": "Jean L.", "review": "I've been here 3 times now and some my favorites include the Laksa, miso ramen, and the seaweed salad (actually seaweed mixed with a giant bowl of greens). Nothing that I've had here is conventional-- the laksa is surprisingly thick, the calamari on the calamari salad is super thinly sliced/tough, and the shrimp dumplings (ha gow) have too much dough (which makes the dumplings bigger than usual and awkwardly sexual looking when you try to lift one up :). ) \n\nDespite my reservations, though, I'll be back because I cannot help liking the couple that owns this spot. I feel like I'm eating at my aunt's house.. sometimes the food lacks precision but whatever! Your aunt made it, and how dare we criticize her cooking! It's more than tasty enough for me to revisit since I live nearby. This spot merits the title Locals Corner (the name of Spice Jar's predecessor) way more than that place ever did!", "rating": 4, "date": "2015-09-14"}, {"excerpts": ["we shared: hummus, pork rib bao, laksa, and mushroom tempura. ", "everything was pretty yum - my fave (as expected) was the pork rib bao!  ", "really good flavor and super tender - i just wish that the bao wasnt as huge (i prefer a high meat to carb ratio...", "my pseudo low carb diet!). ", "laksa was pretty nomsies - great flavor and good chewiness on the noodles.  ", "the mushroom tempura i probably could have done without - lacking saltiness ", "(my friend dipped them in laksa broth) and was a bit soggy.. and i didnt even get to try the hummus because my friend devoured the entire thing!\n\n"], "author": "Christina L.", "review": "ahh! i've had this spot bookmarked for a while now, and am really glad to try it last night! came in with a friend for small quick bites before seeing a show down the street - the place was really popular for a wednesday night!  pretty good location too! \n\nrestaurant is pretty small with a long communal table and maybe 5-6 surrounding 2-4 tops. we were seated at the end of the communal space, which was perfect.  we shared: hummus, pork rib bao, laksa, and mushroom tempura. everything was pretty yum - my fave (as expected) was the pork rib bao!  really good flavor and super tender - i just wish that the bao wasnt as huge (i prefer a high meat to carb ratio...my pseudo low carb diet!). laksa was pretty nomsies - great flavor and good chewiness on the noodles.  the mushroom tempura i probably could have done without - lacking saltiness (my friend dipped them in laksa broth) and was a bit soggy.. and i didnt even get to try the hummus because my friend devoured the entire thing!\n\ni would totally come back for the other items on the menu - notably the karaage and ramen! the service was super fast and friendly - you can tell its a family business and theyre very very courteous!", "rating": 4, "date": "2015-12-17"}, {"excerpts": ["We get the calamari salad, laksa and fries quite often and they never let us down. ", "Service is very kids friendly."], "author": "Dr. Cordula K.", "review": "We love this place for lunch. The food we tried so far tastes great. We get the calamari salad, laksa and fries quite often and they never let us down. Service is very kids friendly.", "rating": 5, "date": "2018-01-14"}, {"excerpts": ["Laksa - I am always searching for a good laksa.  ", "This is probably not your most authentic laksa, but it is so far my favorite in the Bay Area.  ", "The soup was not as thick and heavy as most of them out there and it got a little kick to it.  ", "I'd come back just for the Laksa!  ", "And, maybe try some more items on the menu.  ", "Will try to stay away from the more \"Chinese-ish\" dishes though.  ", "We had better and probably have a higher standard since we are Chinese."], "author": "Kay Y.", "review": "First official day of business for The Spice Jar yesterday...\n\nMr. J and I went to check them out last night.  We were lucky that our wait wasn't too long, 15-20 minutes top.  But, they were definitely busy for a first day.\n\nAfter some pick and choose, we got the followings:\n\nHar Gow - The skin texture was wrong.  It tasted like mochi or Korean rice cakes.\n\nBraised Spare Ribs Bao - The meat was a little dry and the bao itself was not great.\n\nHomemade Tofu - This was not the silky kind we thought it would be.  The texture was more dense and firm.  This could be more of a personal preference thing.  The wasabi salt that came with it was a good idea, but you can't really taste the wasabi part though.\n\nGarlic Green Beans - The beans were a little mushy.\n\nTonkotsu-Shoyu Ramen - Mr. J and I thought the ramen was not bad.  But, we both think a good ramen still need some good chashu to go with it.\n\nLaksa - I am always searching for a good laksa.  This is probably not your most authentic laksa, but it is so far my favorite in the Bay Area.  The soup was not as thick and heavy as most of them out there and it got a little kick to it.  I pretty much down the whole bowl.\n\nCoffee Panna Cotta/Jello - We were lucky to try this not on the menu yet dessert.  It was delicious!  A little less in portion size and add some fresh seasonal fruits on top would make it even better.\n\nI'd come back just for the Laksa!  And, maybe try some more items on the menu.  Will try to stay away from the more \"Chinese-ish\" dishes though.  We had better and probably have a higher standard since we are Chinese.", "rating": 3, "date": "2015-07-01"}, {"excerpts": ["Our favorite dishes are the Laksa and the Calamari salad. ", "I highly recommend this place!"], "author": "Evelyn J.", "review": "We stumbled into this gem one late night after watching a show from the Victoria Theatre 2 yrs ago. We've been hooked since then. We try to drop by whenever we're in San Francisco. Our favorite dishes are the Laksa and the Calamari salad. I highly recommend this place!", "rating": 5, "date": "2018-02-08"}, {"excerpts": ["I had the Laksa (a Chinese & Malay combo; this is not trendy \"Asian fusion\" it's diaspora food, people!) and really enjoyed it. ", "The space is small, but the decor is really nice and it fills a gap in the culinary offerings in this area. ", "Also, it's a short walk from my cousin's place, a great addition to the neighborhood. "], "author": "Cassidy P.", "review": "What can I say? This place is delicious and the people are super friendly. I had the Laksa (a Chinese & Malay combo; this is not trendy \"Asian fusion\" it's diaspora food, people!) and really enjoyed it. The space is small, but the decor is really nice and it fills a gap in the culinary offerings in this area. Also, it's a short walk from my cousin's place, a great addition to the neighborhood. I'm a fan.\n\nFyi, kitchen closes at 9:45pm", "rating": 4, "date": "2015-09-04"}, {"excerpts": ["Everything on their menu is a must try from the rice to the laksa to the beef. ", "You have to get their house made ginger lemonade, refreshing and delicious. ", "Even though it's small and takes no reservation. ", "The wait is never that long and the service is impeccable with a husband and wife running it together. ", "Both very pleasant and kind. ", "If you haven't been to this neighborhood gem , you have to go!"], "author": "N J.", "review": "Spice jar is the most quaint restaurant in a really cute part of town. Serving the most delicious food. Everything on their menu is a must try from the rice to the laksa to the beef. You have to get their house made ginger lemonade, refreshing and delicious. Even though it's small and takes no reservation. The wait is never that long and the service is impeccable with a husband and wife running it together. Both very pleasant and kind. If you haven't been to this neighborhood gem , you have to go!", "rating": 5, "date": "2017-05-01"}, {"excerpts": ["This, sir, is no laksa. ", "It tastes like little more than curry powder and coconut milk, some overcooked noodles, sad tofu (not tofu puffs, mind you, just the same dried out fried tofu cubes that come in the green curry tofu), sadder beansprouts, cilantro, and shrimp. ", "No sweetness, no sourness, no shrimp paste. ", "Where where other laksa accessories, like lime wedges, hardboiled eggs, more herb variety, fried shallots, fish balls, chili paste, or long beans? ", "Even one of those would have helped this beige bowl. "], "author": "Lauren G.", "review": "This, sir, is no laksa. It tastes like little more than curry powder and coconut milk, some overcooked noodles, sad tofu (not tofu puffs, mind you, just the same dried out fried tofu cubes that come in the green curry tofu), sadder beansprouts, cilantro, and shrimp. No sweetness, no sourness, no shrimp paste. Where where other laksa accessories, like lime wedges, hardboiled eggs, more herb variety, fried shallots, fish balls, chili paste, or long beans? Even one of those would have helped this beige bowl. If you only care about quantity, you'll be satisfied since it was a quart of it.\n\nThis was not the only disappointing dish we ordered, but it was the burden in my bowl.", "rating": 2, "date": "2016-01-08"}, {"excerpts": ["I am a vegetarian and requested the Laksa coconut curry soup without the shrimp or chicken. ", "I got to say, it's probably the tastiest Asian soup (ramen-esque) ", "I've ever had the pleasure of eating."], "author": "Melissa D.", "review": "This place is so delicious! It's only been open for a few months and is located in the Mission just a few blocks from where I live. Soups, noodles, rice dishes and more-- this place is fantastic! The food is spiced perfectly, full of flavor and prepared made to order. I am a vegetarian and requested the Laksa coconut curry soup without the shrimp or chicken. I got to say, it's probably the tastiest Asian soup (ramen-esque) I've ever had the pleasure of eating.", "rating": 5, "date": "2016-03-11"}, {"excerpts": ["I love laksa.  ", "If you've eaten here and thought this was laksa, please stop.   ", "Please.   ", "It tasted like curry powder in some store bought paste.  ", "And the wrong noodle people.  ", "Gah.  ", "The green curry was average.  ", "The dumplings non memorable.   ", "Even if the wait wasn't 1 hour I wouldn't be back.   "], "author": "A A.", "review": "They do many things,  and none of them well.   I love laksa.  If you've eaten here and thought this was laksa, please stop.   Please.   It tasted like curry powder in some store bought paste.  And the wrong noodle people.  Gah.  The green curry was average.  The dumplings non memorable.   Even if the wait wasn't 1 hour I wouldn't be back.   The staff was nice even though overwhelmed running their shop.  \n\nIf you want a green curry,  go to Basil Thai.  If you want a hybrid Asian place,  Noodle Theory is pretty much what this place is trying to mimic (and not doing it well).  You can probably make the food they're serving here at home with minimal effort.  Trust me.", "rating": 1, "date": "2015-12-06"}, {"excerpts": ["Had the vegetable rolls and laksa. ", "Both tasted amazing and came out piping hot. ", "They wider variety of beers "], "author": "Kyle K.", "review": "Went by myself on a Fri. Definitely more of a date spot, as I came to realize. Very small and intimate setting.\n\nHad the vegetable rolls and laksa. Both tasted amazing and came out piping hot. They wider variety of beers then I expected, which is always a plus from me.\n\nThe waiters/waitresses were incredibly nice and constantly checked in on me.", "rating": 4, "date": "2016-03-08"}, {"excerpts": ["The laksa is dense and flavorful. ", "The meat on the pork rib in the tonkotsu ramen falls right off of the bone. ", "So good! ", "Keep in mind that this is Asian fusion. ", "If you are looking for authentic laksa then it might throw you off. ", "But if you are looking for tasty comforting Asian flavors... this is it! ", "Side note - they serve the ginger beer with real ginger and it was real cool!"], "author": "Nana L.", "review": "A super adorable and cozy spot with beautiful bright light. Delicious food and great service. The laksa is dense and flavorful. The meat on the pork rib in the tonkotsu ramen falls right off of the bone. So good! Keep in mind that this is Asian fusion. If you are looking for authentic laksa then it might throw you off. But if you are looking for tasty comforting Asian flavors... this is it! Side note - they serve the ginger beer with real ginger and it was real cool!", "rating": 5, "date": "2015-09-24"}, {"excerpts": ["The laksa was a bit of a miss - not authentic, more Japanese curry like but still delicious. \n", "Overall a great place for a casual dinner - will be back to try the rest of the menu...."], "author": "Bhavnak K.", "review": "Cute little spot owned by a really sweet Japanese couple! \nFood was delicious - best chicken karage ever. The spare rib bao was spot on. The laksa was a bit of a miss - not authentic, more Japanese curry like but still delicious. \nOverall a great place for a casual dinner - will be back to try the rest of the menu....", "rating": 4, "date": "2015-09-21"}, {"excerpts": ["choices--- we had the laksa which was very tasty and the spice jar fried rice.  ", "Definitely recommend the laksa   ", "The fried rice was good but not incredible.  ", "Staff was really friendly and nice despite a busy evening    ", "I really liked the reataurant ambience: Small and cute with an open kitchen.  ", "We will definitely come back to try some other items on the menu!"], "author": "N S.", "review": "Great place! Good choices--- we had the laksa which was very tasty and the spice jar fried rice.  Definitely recommend the laksa   The fried rice was good but not incredible.  Staff was really friendly and nice despite a busy evening    I really liked the reataurant ambience: Small and cute with an open kitchen.  We will definitely come back to try some other items on the menu!", "rating": 4, "date": "2017-01-21"}, {"excerpts": ["For mains, we had the laksa and the salmon both of which were above average but nothing spectacular. \n\n"], "author": "Aditya J.", "review": "3.5 stars really, adding half start for the awesome service.\n\nThe asian fusion here is unique in a way that it brings cuisines from all parts of asia from japan to india and everything in between. There are definitely some unique items on the menu that would be hard to find elsewhere but somehow i left feeling slightly underwhelmed\n\nWe had the shrimp dumplings and cast iron seafood fondue which were probably the highlights. For mains, we had the laksa and the salmon both of which were above average but nothing spectacular. \n\nI'd definitely frequent this place if i lived in the area or happened to be in the neighborhood but I dont think i'll  make a plan to come back.\n\nThere is a LOT really good asian food in SF which makes competition really tough and while this place is a solid B+ it just falls short of an A for me", "rating": 4, "date": "2015-10-31"}, {"excerpts": ["My boyfriend got the Laksa(?). ", "It's a coconut based dish with your choice of ramen noodles or rice I believe. ", "It's good but has a kick to it. ", "It's like curry!"], "author": "Jessica L.", "review": "Workers are friendly and they make sure water is always on your table. The food was okay. The shu mai comes in 4 and it is extremely hot so let it cool. I got the tonkatsu ramen and it was okay. I don't know if I was really full from the shu mai but I couldn't finish it. My boyfriend got the Laksa(?). It's a coconut based dish with your choice of ramen noodles or rice I believe. It's good but has a kick to it. It's like curry!", "rating": 3, "date": "2016-06-15"}, {"excerpts": ["The menu featured some interesting items both familiar and new, so we chose to go with the shu mai pork dumplings and short rib bao as appetizers, followed by the Mongolian beef and laksa soup. ", "The shu mai were good but nothing too special. ", "The short rib bao is something I would definitely come back for, though. ", "The beef is so tender, and is perfect wrapped in the bun with all that sauce! ", "The Mongolian beef had good flavors, and the portion is adequate but not worth $14. ", "The Laksa soup was definitely worth every penny. ", "Super delicious!"], "author": "Gabriela M.", "review": "What an incredible meal! I've had this place bookmarked for some time now, and took my gf out on a night we were having a particularly hard time deciding what to eat. The wait was only about 10 minutes long on a Thursday night. The menu featured some interesting items both familiar and new, so we chose to go with the shu mai pork dumplings and short rib bao as appetizers, followed by the Mongolian beef and laksa soup. The shu mai were good but nothing too special. The short rib bao is something I would definitely come back for, though. The beef is so tender, and is perfect wrapped in the bun with all that sauce! The Mongolian beef had good flavors, and the portion is adequate but not worth $14. The Laksa soup was definitely worth every penny. Super delicious!", "rating": 5, "date": "2016-10-07"}, {"excerpts": ["It feels really nice in there\nI tried the laksa $11 ", "and it's just delicious. ", "The staff are great too.\n", "There's sometimes some queue, but it goes fast.\n", "Totally recommend it"], "author": "Sophie G.", "review": "I love the vibes of this place. It feels really nice in there\nI tried the laksa $11 and it's just delicious. The staff are great too.\nThere's sometimes some queue, but it goes fast.\nTotally recommend it", "rating": 5, "date": "2015-09-27"}, {"excerpts": ["Everything I've had there is flavorful, lots of impact, and I am craving the Laksa as I write this. ", "Calamari salad is A MUST TRY!"], "author": "Yuki A.", "review": "My favorite place to visit when I am in SF. I LOVE this place. Everything I've had there is flavorful, lots of impact, and I am craving the Laksa as I write this. Calamari salad is A MUST TRY!", "rating": 5, "date": "2016-03-15"}, {"excerpts": ["We had Tonkatsu Ramen, Laksa and spare rib bua- ", "all were tasty! ", "We were happy and full when we left."], "author": "Mike K.", "review": "WOW! This is really good Asian Fusion food that is prepared with care and tastes great! Prices are very fair and while it's a bit cramped, you'll find it is worth the wait. You are here for the food not the ambiance. Service is good. Nice selection of wine and beer to go with the delicious food. We were here for lunch. Try the Shumai for a starter. We had Tonkatsu Ramen, Laksa and spare rib bua- all were tasty! We were happy and full when we left.", "rating": 4, "date": "2015-11-24"}, {"excerpts": ["The Laksa Soup Noodle was also really good, generously portioned and packed with tons of flavor. ", "In addition to nice ambience, good food and friendly service the food was very well priced our bill was $ 44 in my opinion ", "you can't beat that. ", "We'd definitely come back."], "author": "Lumei M.", "review": "My husband and I had dinner at the Spice Jar based on other positive Yelp reviews and we were not disappointed. The food was good, flavorful, and fresh. I would suggest you don't come with a large party (anything more than 3) unless you have the time to wait and the right jackets to wait outside. On to the food the Braised Sparerib Bao was really good but small. The cucumbers really made a difference in the flavor of the Braised Sparerib.  The Calamari Salad which was a healthy sized portion had plenty of calamari and flavor to serve as a main dish. The Laksa Soup Noodle was also really good, generously portioned and packed with tons of flavor. In addition to nice ambience, good food and friendly service the food was very well priced our bill was $ 44 in my opinion you can't beat that. We'd definitely come back.", "rating": 4, "date": "2017-02-10"}], "spinach  roasted garlic fried rice": [], "spice jar fried rice": [{"excerpts": ["I wouldn't skip out on these either\n\nSpice Jar Fried Rice ($14) - "], "author": "Sara S.", "review": "My GO-TO in the neighborhood. Spice Jar is tucked away in a residential neighborhood b.w. the Mission & Potrero Hill but near the hustle and bustle of 24th Street. Making it a cute little destination to stop by while exploring the area or perhaps before grabbing ice cream at Humphry Slocombe or Dynamo Donuts.\n\nSpice Jar is quite the small restaurant with capacity for around 15-17 tables including indoor and outdoor seating. The indoors is quite lovely with interesting light arrangements above their wooden tree-emulating tables. The orangey yellow dim but not too dim lighting make it a romantic spot but also a nice place to come to with family or friends! I feel right at cozy home when I walk in. \n\nIt can get quite busy here even on a random weekday night so I would call ahead to see. The waiters and waitresses are super nice, just a little busy sometimes. They give a family like vibe *but I am unsure of their relations haha*\n\nAs for food, it is quite phenomenal here! I love love it. True to their name, Spice Jar dishes are packed with flavors and I lay there floored by their food . A few... maybe a lot... that I have tried are as follows:\n\nEdamame (~$6) - covered in garlic and spice, I'm IN LOVE. I would not skip out on this especially as the portion size is a bit ridiculously large. Our table of 3 had leftovers.. a rare occurrence with edamame haha.\n\nFries ($6) - delicious thin fries covered in herbs with a clean feeling. Def have had better but also these hit the spot and as a potato addict I wouldn't skip out on these either\n\nSpice Jar Fried Rice ($14) - so I for one never get fried rice at restaurants cus PFT I can make that at home. But honestly it is so good here! With shrimp and chicken woven throughout the veggie packed fried rice, the flavor can't be beat. And interestingly enough, it's not salty. I think it attests to how they create great dishes with their unique spices!\n\nLaksa ($14) - MMMMMMMM. Is all I can say. Haha I love their laksa here. Flavor punch throughout. Thinnish just right noodles. All with some delicious dry tofu and chicken. Which I'm a fan of. If you like meaty dishes tho, maybe get something else because I found myself digging for some chicken that was on the dryish side.\n\nTonkatsu Ramen ($14) - the most meh dish of them all. Packed with flavor but the noodles are just like my shin ramen noodles and they get very puffy pretty quickly. Comes with a good chunk of Pork Belly but the meat in this is pretty good not great! So if you're craving ramen like I was, maybe it's for you but it won't be amazing like some of their other dishes\n\nTL;DR @threelittlewhales (insta!)\nAmbiance 4/5\nService 4/5\nFood 5/5", "rating": 5, "date": "2017-10-18"}, {"excerpts": [", the Spice Jar fried rice would be your thang. ", "It tastes pretty heavy on the mint side. ", "The portion is huge, and they don't skimp out on the shrimp and chicken. ", "A good dish to share!\n", "-My "], "author": "Denise L.", "review": "Cute wittle restaurant in the middle of the Mission neighborhood. Indoor and outdoor seating. Adorable, nature-y decor.\n\nI think the best thing about this place is the service. Everyone is so happy and helpful! One time I called in a togo order and didn't know that the haw gaw (shrimp dumpling) was only for dinner but before I could even say that it's ok, the lady immediately told me to hold on for a sec to see if the chef could make it for me. And of course being so kind, the chef said sure. To go out of their way like that was so appreciated. All the other times I have gone into The Spice Jar, the service is amazing. \n\nFOOD:\n-Aonori garlic fries are the best! Packed with flavor but not overly salty. Perfection.\n-The haw gaw skin is overwhelmingly thick and not thin like dimsum places. Probably wouldn't get again.\n-The shu mai is pretty good for not being a dimsum spot. Big pieces!\n-The chicken pho tastes clean and the self-added ingredients are fresh.\n-The tonkatsu ramen has a delicious broth, but the egg is a fully cooked hard boiled egg. Wish it was soft boiled like the menu reads.\n-If you enjoy the taste of mint, the Spice Jar fried rice would be your thang. It tastes pretty heavy on the mint side. The portion is huge, and they don't skimp out on the shrimp and chicken. A good dish to share!\n-My friend's favorite is the laksa. Heard it is a popular item, but I have yet to personally try it.\n\nThis place has been my new favorite place to go for lunch. Must try!", "rating": 4, "date": "2015-11-04"}, {"excerpts": ["For entrees, we had the tonkatsu ramen and the Spice Jar fried rice. ", "The flavor of the ramen broth was amazing as it tasted like the pork had been stewing for hours. ", "The fried rice was generous in shrimp and chicken portions, but definitely a little too salty for me. ", "Overall, it tasted as close to home-cooked as you can get from a restaurant in the city!"], "author": "Ashley T.", "review": "The Spice Jar is a relatively new Asian spot in the Mission, bringing homey comfort food from all different Asian cuisines. I wouldn't exactly call it fusion because they somehow bring in distinct flavors from each culture in an authentic way. My boyfriend and I came in on a Tuesday, and ended up waiting almost half an hour for a table, which goes to show just how popular it is. We started with the chicken lettuce wraps, a simple dish but full of flavor. I loved the addition of the mushroom with the minced chicken, helping to cut the natural saltiness of the dish. We also tried the har gao, which was definitely on the doughier side but great in terms of portion size. \n\nFor entrees, we had the tonkatsu ramen and the Spice Jar fried rice. The flavor of the ramen broth was amazing as it tasted like the pork had been stewing for hours. The fried rice was generous in shrimp and chicken portions, but definitely a little too salty for me. Overall, it tasted as close to home-cooked as you can get from a restaurant in the city!", "rating": 4, "date": "2015-10-20"}, {"excerpts": ["We had the Spice Jar Fried rice. "], "author": "Annette D.", "review": "I came here with a group of 4 on a Tuesday night. They do not take reservations, but we got there around 7:30pm and there weren't any names on the list yet (though the inside was already full). It was incredibly nice out so we asked to be sat outside. They have a few tables they placed on the sidewalk outside and it was perfect. They were able to sit all four of us immediately out there. \n\nThey only server wine, beer and sake here. They have a small selection but it's all decent. They were incredibly prompt and friendly with getting our drink and appetizer orders in.\n\nNone of us knew what to expect, but I can tell you the appetizers blew our socks off! We had the Albacore Carpaccio with Jalapeno sauce. That was so incredibly good- probably the best dish of the night. Highly recommend making a point to get that. We also got the Braised Spare Rib, which also was amazing. Lastly we had the garlic edamame. Not the best I've had, but still somewhat tasty. \n\nFor the main courses we had the Spicy Sesame Miso Ramen. It really wasn't that spicy even with spicy in the name. It was decent. You could probably afford to increase the spiciness across all dishes. We had the Spice Jar Fried rice. It was good, but again not that spicy at medium. \n\nOverall the experience was just lovely, the food was good and definitely a place I'd come back. They were all very nice!", "rating": 5, "date": "2016-02-18"}, {"excerpts": ["choices--- we had the laksa which was very tasty and the spice jar fried rice.  ", "Definitely recommend the laksa   ", "The fried rice was good but not incredible.  ", "Staff was really friendly and nice despite a busy evening    ", "I really liked the reataurant ambience: Small and cute with an open kitchen.  ", "We will definitely come back to try some other items on the menu!"], "author": "N S.", "review": "Great place! Good choices--- we had the laksa which was very tasty and the spice jar fried rice.  Definitely recommend the laksa   The fried rice was good but not incredible.  Staff was really friendly and nice despite a busy evening    I really liked the reataurant ambience: Small and cute with an open kitchen.  We will definitely come back to try some other items on the menu!", "rating": 4, "date": "2017-01-21"}, {"excerpts": ["Also the Spice Jar Fried Rice,  which is a healthy portion to share amounts your table.\n\n"], "author": "Jax B.", "review": "Asian fusion restaurant that is a great new addition to this end of the Mission.  I have now been here a couple times.  The food is very good and very fresh.  Recommendations.....get the Hanger Steak BBQ Mushu Wraps.  It is kind of like super tasty asian fajitas.  Also the Crispy Spring rolls which are nice and crunchy.  Also the Spice Jar Fried Rice,  which is a healthy portion to share amounts your table.\n\nSelection of beer and wine.  I like that they do their wine by different carafe sizes so you can have more than a glass without committing to a bottle. Only downside is the place is a bit small and can get crowded especially on a weekend night.", "rating": 4, "date": "2015-12-25"}, {"excerpts": ["Spice Jar fried rice - must have! ", "You know something is delicious when you feel a slight sadness that with each delicious bite...less of it is left to eat...sigh. "], "author": "Candace D.", "review": "Cute, friendly with da bomb food! \n\nSpice Jar fried rice - must have! You know something is delicious when you feel a slight sadness that with each delicious bite...less of it is left to eat...sigh. I thought this was the star of the night \n\nSpring rolls - Yummy! \n\nLettuce cups - it was so good that we ended up ordering another round of them. \n\nCalamari Salad - Yummy!\n\nPortions are HUGE! We rarely have leftovers bc my hubs can eat volume, but we met our match here. \n\nService was so friendly and inviting. Highly recommend! Great date spot!", "rating": 5, "date": "2016-05-13"}, {"excerpts": ["And the spice jar fried rice.. it has a little bit of everything in it. ", "This was a pretty big portion.. enough to share.  ", "Everything was cooked to order and served promptly. ", "Highly recommend.  ", "I will be back.  ", "The only drawback is that is it's a tiny place, and you are super close to people you don't know... ", "But if you are friendly and social, the should be no problem."], "author": "Mindy Z.", "review": "What an amazing find!!  My husband has been wanting to check this place out, and we finally had the time to stop in. It was Valentine's day and there was no wait.  It's labeled Asian comfort food.. and it did not disappoint.  We started off with the fried chicken bites. Yum.  Crispy, perfect little nuggets of happiness!!  With a tasty remoulade dipping sauce.  We then got the chicken sesame ramen.  So tasty.  Not a traditional ramen in that there aren't a lot of veggies or egg in it, but you don't miss it.. so much flavor!!!!  And the spice jar fried rice.. it has a little bit of everything in it. This was a pretty big portion.. enough to share.  Everything was cooked to order and served promptly. Highly recommend.  I will be back.  The only drawback is that is it's a tiny place, and you are super close to people you don't know... But if you are friendly and social, the should be no problem.", "rating": 5, "date": "2017-02-14"}], "mongorian beef": [], "seven spiced salmon": [{"excerpts": ["Prices are pretty reasonable for the most part and entrees will run you about $11-14 except for some heavier protein outliers like the Mongolian Lamb ($19), Seven Spiced Salmon ($16), and Hangar Steak BBQ Mushu Wraps ($18). ", "The choices vary by certain Asian cuisines, such as Thai or Vietnamese. ", "Seven Spiced Salmon - Portions were smaller than expected for the steep price of $17. ", "I wish there was more to this dish, maybe more rice or a side of veggies. ", "The fish did feel a bit overcooked, but it didn't bother me too much. "], "author": "Chelsea W.", "review": "Awesome spot for Asian comfort food of various cuisines paired with noticeably dedicated service. The Spice Jar appears like a hipster, almost more Westernized restaurant but don't let that fool you. I've passed by it all the time on my way back to work and after finally trying it, the flavor of the dishes definitely took me by surprise. \n\nThe menu has a section for small bites, salad, soup/noodles/rice, and \"hungry.\" Prices are pretty reasonable for the most part and entrees will run you about $11-14 except for some heavier protein outliers like the Mongolian Lamb ($19), Seven Spiced Salmon ($16), and Hangar Steak BBQ Mushu Wraps ($18). The choices vary by certain Asian cuisines, such as Thai or Vietnamese. Some also appear to be more Asian fusion as well.\n\nThe space is pretty limited and has a communal table. When I went it appeared like it was a good setup for dates. We sat at bar seating near the open kitchen area. \n\nThe staff is pretty nice and friendly. Even though the restaurant was quite busy, the waiter was really kind about coming to refill water and check up on us. The service definitely left a good impression on me.\n\nBased on the previous reviews, it seems like some of the dishes are a hit or miss, but luckily I had a pretty good experience.\n\nSeven Spiced Salmon - Portions were smaller than expected for the steep price of $17. I wish there was more to this dish, maybe more rice or a side of veggies. The fish did feel a bit overcooked, but it didn't bother me too much. With that said, I enjoyed the flavor and quality of the salmon.\n\nLaksa - Tried a bit of this and loved the flavor as well. The soup is veeeery heavy and hard to finish as it has more of a thick, curry consistency. It would have been better if the \"soup\" was watered down but this also wasn't a huge issue. We ended up not being able to finish and took it home to put on top of rice!  \n\nI'm curious to try other dishes, and given the the reasonable prices and proximity I will be back!", "rating": 4, "date": "2017-06-16"}, {"excerpts": ["The seven spiced salmon is very tasty and fresh."], "author": "Elmar P.", "review": "Small but great. The seven spiced salmon is very tasty and fresh.", "rating": 4, "date": "2017-11-21"}], "hanger steak bbq mushu wraps": [{"excerpts": ["The Hanger Steak BBQ Mushu Wraps (Asian fajitas) looked delicious as they sizzled on the cast iron platter. ", "The hanger steak was cooked medium rare as requested but it was very chewy. ", "The marinade had a savory sweetness similar to hoisin sauce, not Korean spices. ", "I liked the accompanying cilantro (?) ", "aioli but not with the steak as the flavors didn't mesh well. ", "This would have been better on the calamari salad. ", "This was also another messy dish because you had to slice the steak into smaller pieces before placing them in the wrappers to eat. "], "author": "Cherylynn N.", "review": "Some people say, \"variety is the spice of life\". To me, that just means quantity over quality--like buffets. They usually suck and give you bubble guts.\n\nThen, you have Pan Asian restaurants that serve popular dishes from various Asian countries. Usually, I'm not a fan of Pan Asian or Asian Fusion cuisine because they rarely come close to the dishes I had growing up, the flavors are watered down, and/or the fusion of flavor profiles are just a hot mess. \n\nAfter seeing some raving reviews for The Spice Jar and that they had outdoor seating so we can bring Tater Tot, we decided to give it a shot. The Spice Jar is a newish restaurant (opened in late June 2015) that took over Local's Corner which was ok but grossly overpriced. The Spice Jar's menu is Pan Asian with several Asian Fusion dishes. There's items ranging from Chinese Dim Sum items to Vietnamese Pho to Japanese Ramen to Malaysian Laksa. The prices were reasonable for the very generous portions: small bites ($5-$12), salads ($8-$12), soups, noodles & rice ($9-$14), and large plates ($11-$19). No desserts. No msg is used. Shochu, sake, wine, and beer only. \n\nWe ordered the following:\n*Braised Sparerib Bao w/ lettuce, pickled cucumber, hoisin sauce ($5): http://bit.ly/1NaltR6\n*Crispy Calamari Salad w/ mixed greens, vermicelli, red onion, cilantro, red curry honey ($12): http://bit.ly/1LUlGaS\n*Hanger Steak BBQ Mushu Wraps w/ Korean spices, sautéed veggies ($18): http://bit.ly/1NNmzCD\n*Mongolian Lamb w/ onions, scallions, sesame bread (not shown) ($19): http://bit.ly/1KI2tb0\n\nBased on the dishes we sampled, The Spice Jar is just not my cup of tea. Seems to be better suited for yipsters and techie transplants so they choose a great location. We were the only Asians there aside from the staff. \n\nThe Sparerib Bao had a huge hunk of meat but in order to eat it with the bao, you had to cut the meat off of the bone first so it became messy. The bao was light and fluffy but the meat was tepid and a bit tough. It tasted like a boiled rib from the am that was drizzled with hoisin sauce. \n\nThe Crispy Calamari Salad was gigantic and good enough for 4 people. The calamari was overfried so the batter was hard. The greens were overdressed with the pungent, sour dressing (pool of dressing at the bottom of the bowl). The dressing didn't taste like curry or honey but a lime-fish sauce dressing used in Cambodian and Laotian salads. \n\nThe Hanger Steak BBQ Mushu Wraps (Asian fajitas) looked delicious as they sizzled on the cast iron platter. The hanger steak was cooked medium rare as requested but it was very chewy. The marinade had a savory sweetness similar to hoisin sauce, not Korean spices. I liked the accompanying cilantro (?) aioli but not with the steak as the flavors didn't mesh well. This would have been better on the calamari salad. This was also another messy dish because you had to slice the steak into smaller pieces before placing them in the wrappers to eat. I recommend that they place the mushu wrappers in a tortilla warmer because they dried out quickly. \n\nThe Mongolian Lamb was the most traditional tasting of the dishes we tried but the only dish that I felt was overpriced by $2-$3. The lamb was super tender and flavorful. It's served with sesame bread to make a sammie but I recommend substituting with rice so it's easier to eat.\n\nService was very welcoming and gracious. There's no doubt the Japanese owners are super sweet so if I was rating service alone, it would be 5 stars. They were also very nice to Tater Tot who would wake up from his nap every time a dish arrived thinking it was for him. Poor guy. Food service is on the slower end so do come here when you're not in a rush. \n\nThe Spice Jar is a small restaurant best for parties 2-4 people. The homey, rustic space hasn't changed much from Local's Corner aside from the painted walls, and addition of spice jars lining the walls. \n\nParking in the area is much easier than the central mission area.\n\nThe Spice Jar may not be my cup of tea but I wish the owners well. I hope they don't suffer the same fate as Local's Corner.", "rating": 3, "date": "2015-09-02"}, {"excerpts": ["Hanger Steak BBQ Mushu Wraps $18 (", "http://bit.ly/1EBSFZF)\nCooked outer, less cooked inner. "], "author": "Dan B.", "review": "Heard about it last week but said #effthat after glancing at the menu and the #newrestosyndrome slew of high reviews by people with not many reviews. #fastforward Today I awoke from a nap and randomly decided to go. I expected a forgettable meal but was pleasantly surprised.\n\n(^_^) Hanger Steak BBQ Mushu Wraps $18 (http://bit.ly/1EBSFZF)\nCooked outer, less cooked inner. #simbaitstodiefor\n\n(^_^) Braised Spare Ribs Bao $5 (http://bit.ly/1hLXJFL)\nOther reviewers had dry ones. #thatswhatshesaid\nNot mine. Wish BBQ places did rib texture like this.\n\n(^_^) Chicken Karaage Namban $7 (http://bit.ly/1JhcVRn)\nTender, moist. Sauce not spicy, idc.\n\n(-_^) Homemade Tofu $7 (http://bit.ly/1EBSJZe)\nSilky. Very hot at first bc of the bowl.\n\n(-_^) Edamame Hummus Jar $7 (http://bit.ly/1MxIUSz)\nHeld back by its cracker & crudité selection.\n\nThe food, the owner's friendliness, and the sheer comicality of filling up a makeshift shelf with dishes (http://bit.ly/1foB6Wi) made me feel better about seating snafus. Namely, how 1) there was an empty 2 top when I arrived and only larger parties ahead of me on the clipboard, 2) another 2 top became then stayed empty, 3) I got seated at not an actual table but a shelf that they cleared of supplies & plants, 3.5) which, if that was the plan all along, could've happened right when I walked up and not after a near half hour wait, and 4) I later realized the thing in the middle is a communal table, which also had empty spots the whole time. #thingsthatmakeyougohmmmm\n\nBut yeah, #nottrippin.", "rating": 4, "date": "2015-08-19"}, {"excerpts": ["Recommendations.....get the Hanger Steak BBQ Mushu Wraps.  ", "It is kind of like super tasty asian fajitas.  ", "Also the Crispy Spring rolls which are nice and crunchy.  "], "author": "Jax B.", "review": "Asian fusion restaurant that is a great new addition to this end of the Mission.  I have now been here a couple times.  The food is very good and very fresh.  Recommendations.....get the Hanger Steak BBQ Mushu Wraps.  It is kind of like super tasty asian fajitas.  Also the Crispy Spring rolls which are nice and crunchy.  Also the Spice Jar Fried Rice,  which is a healthy portion to share amounts your table.\n\nSelection of beer and wine.  I like that they do their wine by different carafe sizes so you can have more than a glass without committing to a bottle. Only downside is the place is a bit small and can get crowded especially on a weekend night.", "rating": 4, "date": "2015-12-25"}], "wok stir seasonal vegetables": [], "aonori garlic fries": [{"excerpts": ["While the shu-mai were overflowing with pork filling, the aonori garlic fries tasted under-seasoned and lacked a strong garlic flavor.  "], "author": "Keith H.", "review": "I'm always searching for new restaurants in the Mission, and the Spice Jar definitely seems like a popular place for lunch.  Now that I've tried it a few times, I think there are definitely pluses and minuses to the dining experience.  This restaurant offers a pan-Asian menu in a crisp and clean setting. \n\nDuring my first visit, I decided to sample their appetizers/sides.  While the shu-mai were overflowing with pork filling, the aonori garlic fries tasted under-seasoned and lacked a strong garlic flavor.  I decided to try a salad during a subsequent visit, and though the crispy calamari salad looked very appetizing, I felt underwhelmed by the mixture of flavors.  I thought the calamari was fried well but could have used some salt; the dressing gave it some kick, but given that one of the billed ingredients was red curry honey, I was expecting more spicy heat.  \n\nI thought the service was fine, though it took a while to get my waiter's attention due to the busy lunch crowd.  Given the variety of menu items, I'll probably give it another try to see if I find something truly spectacular.", "rating": 3, "date": "2016-10-23"}, {"excerpts": ["I've eaten here a few different times, and in recognizing me, they brought some Aonori Garlic Fries on the house. ", "Yum! ", "I was happy to see, upon my more recent visit, that they'd hired some wait staff. "], "author": "Nicole C.", "review": "I'm usually quite wary of Asian \"fusion\" restaurants, as it seems to cater towards a crowd unused to specific cuisines. The interior design is very cosy, country home; while adorable, it almost reinforced my expectation of an underwhelming experience, due to cognitive dissonance. That being said, The Spice Jar pleasantly surprised me. I sampled an assortment of dishes and enjoyed all of them.\n\nI started with the Crispy Calamari Salad--a generous portion of fresh greens, topped with delicious, lightly breaded calamari and red honey curry dressing. The little critters were crisped perfectly and didn't overpower or wilt the salad leaves.\n\nI ordered the Tonkotsu-Shoyu Ramen next, and also loved it. I'm used to eating delicious ramen at food trucks, but this was truly a treat. The rib was fall-off-the-bone tender, and the broth was flavorful and substantial without being too salty. The noodles were cooked just right, with a bit of bite to them. The hard boiled egg was done just right too. \n\nThe couple who owns the restaurant are truly charming and wonderful. I've eaten here a few different times, and in recognizing me, they brought some Aonori Garlic Fries on the house. Yum! I was happy to see, upon my more recent visit, that they'd hired some wait staff. I can't imagine how insane opening weeks must have been with just the two of them doing all of the work--from cooking, to waiting on tables, busing, etc. \n\nThe interior design is worth mentioning again, because it is so unexpectedly adorable. The bottom of tables are adorned with material that feels like mattress topper--it prevents you from bruising yourself while shifting your legs. I almost want all the restaurants I go to to adopt this methodology. I'm so clumsy, it definitely saved me on multiple occasions.\n\nDefinitely eat here.", "rating": 4, "date": "2015-09-10"}], "garlic green beans": [{"excerpts": ["They have amazing garlic green beans and my friend loves their tuna tartare. ", "The service is great and it is reasonably priced for the quality of food. ", "They do not take reservations, but you write your name down and wait since it is a small restaurant. ", "I would highly recommend it to those who like asian fusion and want something off the beaten path of the Mission!"], "author": "Paige L.", "review": "I have been here 2 times now and it is amazing! The location is quite small and quaint, so great for a date or meeting a friend. They have amazing garlic green beans and my friend loves their tuna tartare. The service is great and it is reasonably priced for the quality of food. They do not take reservations, but you write your name down and wait since it is a small restaurant. I would highly recommend it to those who like asian fusion and want something off the beaten path of the Mission!", "rating": 5, "date": "2017-08-23"}, {"excerpts": ["Started with a mint tea, shumai and garlic green beans. ", "Tea and green beans were delicious! ", "Shumai was a bit flavorless "], "author": "Yin H.", "review": "3.5\n\nVery cute asian restaurant at the corner of 23rd and Bryant. When we arrived for lunch on a Fri afternoon, the restaurant (albeit very limited seating and space) was completely packed. We opted to sit outside and brave the wind. Unfortunately, they do not serve hot sake but have plenty of cold sake to choose from. \n\nStarted with a mint tea, shumai and garlic green beans. Tea and green beans were delicious! Shumai was a bit flavorless and I had to drench mine in a bit of soy sauce.\n\nNext came the entree - TONKOTSU-SHOYU RAMEN!!\nRamen and broth were delicious!! The egg was average. The pork sparerib was a huge portion and very tender, but not too much flavor. \n\nService was very good and prompt (except for forgetting to bring us some chili paste for the ramen when we first asked). \n\nWould love to come back and try some other dishes. I was pretty thirsty after the meal which usually indicates a lot of sodium and/or MSG in the meal :(\n\nLove that they store utensils and napkins at the table in empty tins of Cafe Du Monde coffee!!", "rating": 3, "date": "2016-04-29"}, {"excerpts": ["The mains and sides were the 4-star caliber dishes: we went with the Spinach and Roasted Garlic Fried Rice (strong in flavor, only for garlic lovers), the Mongolian Chicken which was super savory and a tad too rich but overall pretty epic in flavor, and the garlic green beans which had the right balance of garlic and sweetness and salt were also the bom dot com.  \n\n"], "author": "Saminda W.", "review": "Super rich, super tasty East Asian comfort food.  Nothing healthy about this joint but ingredients are fresh and the flavor is on fleek.\n\nThe menu is fairly compact but in a very good way, a diversity of choices but no decision anxiety from a multi-page menu.  We started with the pork Shu-Mai which were solid, very well prepared but not epic.  Same for the crispy spring roll, they were a bit pedestrian.  The mains and sides were the 4-star caliber dishes: we went with the Spinach and Roasted Garlic Fried Rice (strong in flavor, only for garlic lovers), the Mongolian Chicken which was super savory and a tad too rich but overall pretty epic in flavor, and the garlic green beans which had the right balance of garlic and sweetness and salt were also the bom dot com.  \n\nService was friendly but the dishes were staggered in an non-ideal way, apps came out together but then there was about a 20 min wait after we finished those before our first entree came out (the fried rice), and then another 10 mins before the other two dishes (chicken and green beans) came out.", "rating": 4, "date": "2015-10-10"}, {"excerpts": ["Garlic Green Beans - The beans were a little mushy.\n\n"], "author": "Kay Y.", "review": "First official day of business for The Spice Jar yesterday...\n\nMr. J and I went to check them out last night.  We were lucky that our wait wasn't too long, 15-20 minutes top.  But, they were definitely busy for a first day.\n\nAfter some pick and choose, we got the followings:\n\nHar Gow - The skin texture was wrong.  It tasted like mochi or Korean rice cakes.\n\nBraised Spare Ribs Bao - The meat was a little dry and the bao itself was not great.\n\nHomemade Tofu - This was not the silky kind we thought it would be.  The texture was more dense and firm.  This could be more of a personal preference thing.  The wasabi salt that came with it was a good idea, but you can't really taste the wasabi part though.\n\nGarlic Green Beans - The beans were a little mushy.\n\nTonkotsu-Shoyu Ramen - Mr. J and I thought the ramen was not bad.  But, we both think a good ramen still need some good chashu to go with it.\n\nLaksa - I am always searching for a good laksa.  This is probably not your most authentic laksa, but it is so far my favorite in the Bay Area.  The soup was not as thick and heavy as most of them out there and it got a little kick to it.  I pretty much down the whole bowl.\n\nCoffee Panna Cotta/Jello - We were lucky to try this not on the menu yet dessert.  It was delicious!  A little less in portion size and add some fresh seasonal fruits on top would make it even better.\n\nI'd come back just for the Laksa!  And, maybe try some more items on the menu.  Will try to stay away from the more \"Chinese-ish\" dishes though.  We had better and probably have a higher standard since we are Chinese.", "rating": 3, "date": "2015-07-01"}, {"excerpts": ["The fish was good, but the garlic green beans are more filling. ", "The rice is undercooked. ", "Wasabi Ale tastes OK, but not worth chugging down, actually."], "author": "Kokoe J.", "review": "The fish was good, but the garlic green beans are more filling. The rice is undercooked. Wasabi Ale tastes OK, but not worth chugging down, actually.", "rating": 4, "date": "2016-01-29"}], "roti bread with curry dipping": [{"excerpts": ["Between the two of us, we shared the Garlic Edamame ($5), Roti Bread with Curry Dipping ($5), Zen Noodle Soup ($15), Laksa ($14), and Ginger Ice Cream ($4). ", "I can't even decide what to talk about first because everything was delicious! ", "The edamame are piping hot and drenched in a spicy garlic dressing --a must order! ", "As for the roti, it was standard but loved the curry dipping sauce to go with it for a nice starter. ", "Between the two main soups, they were special in their own ways with the zen noodle more of a lighter Tom Yum seafood flavor while the Laksa is similar to a thicker curry noodle soup. ", "Even though we were stuffed, we decided to try the ginger ice cream which was amazing! ", "I was so pleasantly surprised with the flavor, which was not too strong and mixed in with some candied ginger bites. "], "author": "Cindy Z.", "review": "A friend brought me here raving about this place and one can easily agree after the first time eating here. We arrived on a Thursday at 6pm before the rush, so was easily seated. The restaurant is nice and cozy, so you can expect a line at normal hours although they work efficiently to get everyone in and out.\n\nBetween the two of us, we shared the Garlic Edamame ($5), Roti Bread with Curry Dipping ($5), Zen Noodle Soup ($15), Laksa ($14), and Ginger Ice Cream ($4). I can't even decide what to talk about first because everything was delicious! The edamame are piping hot and drenched in a spicy garlic dressing --a must order! As for the roti, it was standard but loved the curry dipping sauce to go with it for a nice starter. Between the two main soups, they were special in their own ways with the zen noodle more of a lighter Tom Yum seafood flavor while the Laksa is similar to a thicker curry noodle soup. Even though we were stuffed, we decided to try the ginger ice cream which was amazing! I was so pleasantly surprised with the flavor, which was not too strong and mixed in with some candied ginger bites. It was the perfect ending to the meal.\n\nThis place has easily become a new favorite from their delicious food, great price point, and wonderful service. I can't wait to come back and try the rest of the menu!", "rating": 5, "date": "2018-09-14"}]}