{"flying falafel pita pocket": [{"excerpts": ["I got the full flying falafel pita pocket and asked for spicy. ", "Inside was spicy falafel, pickles, carrots, tomatoes, cabbage, onions, tahini, and hot sauce. ", "The combination was out of this world! ", "The fluffiness of the pita bread, the heartiness of the falafel, the acidity of the pickles, the creaminess of the tahini, the crunchiness of the cabbage, and the spiciness of the hot sauce was just unbelievable. ", "For $7, this is a steal. "], "author": "Hana K.", "review": "I'm drooling as I'm writing this review right now. Their falafels are THAT good. Granted, I've never had a falafel until trying it here at The Flying Falafel, but I don't think I need to. I would literally jump at any opportunity to come back here. \n\nWe found this place after the pride parade when we were dropped off near civic center. We danced like maniacs for three hours on our float and burned close to 3000 calories (as I'd like to think) and wanted to stuff our faces. As we walked down market street, anxiously looking for quick food options on Yelp, we found this place. As we approached The Flying Falafel, pita bread came flying from the joint to hungry customers. We saw this and in our minds and our stomachs, nothing sounded better. And you really can't go wrong with carbs no matter the occasion. We stood in line and as we waited looking like hungry hyenas, they threw us some pita bread. We shared a slice of the pita and we were sold. The pita was so soft and fluffy that I couldn't wait to have a whole pocket to myself.\n\nI got the full flying falafel pita pocket and asked for spicy. Inside was spicy falafel, pickles, carrots, tomatoes, cabbage, onions, tahini, and hot sauce. The combination was out of this world! The fluffiness of the pita bread, the heartiness of the falafel, the acidity of the pickles, the creaminess of the tahini, the crunchiness of the cabbage, and the spiciness of the hot sauce was just unbelievable. For $7, this is a steal. Especially for the portion as well!\n\nIf you are in the area, you absolutely need to stop by this place. This place is also vegan so it is a great option for those on that lifestyle!", "rating": 5, "date": "2015-07-07"}], "plate me a falafel": [{"excerpts": ["I order the plate me a falafel or the flying falafel pocket and never miss their cinnamon baklava. ", "The price is cheap for the quantity they give. "], "author": "Shivani R.", "review": "Stop by here everytime I'm in the city. I order the plate me a falafel or the flying falafel pocket and never miss their cinnamon baklava. The price is cheap for the quantity they give. If I want varities I go for the triple deluxe with shawarma, falafel and crispy chick's all in one for only $9.50 (What!?)\n\nTheir pitas are freshly made, soft and fluffy inside out. Their falafels are also fresh and are delightful balls of goodness.\n\nThey tend to get pretty packed and busy. You can always place an order via the Yelp app and just go pick it up. The only downside is that they are on the streets and you might have to park somewhere else and walk to the restaurant. There are a couple of tables outside, but I'd rather take it out and eat at home than sit on the streets of the city to enjoy the fresh food. Love this place and will definitely go back again.", "rating": 5, "date": "2018-10-27"}], "hummus frisbee": [{"excerpts": ["Additionally I was here Saturday and ordered the spiced kabob hummus frisbee but instead was presented with a pit pocket! ", "After I said that's not what I ordered they gave me what I thought was correct ", "yet it turned out to be hummus with falafel...again, not what I ordered. ", "If you want dirty fingers on your pita and employees that can't handle legitimate concerns from a customer then this is the place for you. ", "I'll be eating at the one in Berkeley where they won't rip you off and charge you for something then give you a cheaper meal."], "author": "Mycky E.", "review": "I love flying falafel...in Berkeley. The guys at this location handle money then touch food without wearing gloves. Additionally I was here Saturday and ordered the spiced kabob hummus frisbee but instead was presented with a pit pocket! After I said that's not what I ordered they gave me what I thought was correct yet it turned out to be hummus with falafel...again, not what I ordered. If you want dirty fingers on your pita and employees that can't handle legitimate concerns from a customer then this is the place for you. I'll be eating at the one in Berkeley where they won't rip you off and charge you for something then give you a cheaper meal.", "rating": 1, "date": "2018-08-05"}], "hummus saucer": [{"excerpts": ["We tried Plate Me (assortment of veggies, hummus and falafel) and Hummus Saucer (A bed of hummus dip with veggies and warm pita) along with the side of dolmas and warm pitas. ", "Both of them were absolutely delicious. \n", "The folks running the place were pretty good. ", "Don't expect much - just order and wait for it to be ready. \n", "The place is great for to go, not for eat ins as the space is very limited. ", "But if you're around the area, you must try. \n", "Great hummus, especially."], "author": "Jay M.", "review": "They serve really good Mediterranean. We tried Plate Me (assortment of veggies, hummus and falafel) and Hummus Saucer (A bed of hummus dip with veggies and warm pita) along with the side of dolmas and warm pitas. Both of them were absolutely delicious. \nThe folks running the place were pretty good. Don't expect much - just order and wait for it to be ready. \nThe place is great for to go, not for eat ins as the space is very limited. But if you're around the area, you must try. \nGreat hummus, especially.", "rating": 4, "date": "2016-06-18"}, {"excerpts": ["Somehow I just can't pass up hummus when I'm in a Mediterranean setting, so I decided to try the $5 Hummus Saucer.\n\n"], "author": "Ed U.", "review": "One potato, two potato, three potato four...hey, wait, where did he go? The French fry guy that served nothing but fries. I respect an operation who specializes, but offering one kind of item appeared a bit limiting even though he offered a variety of sauces as well as soup and chili as accompaniments. I wish the potato guy well, but the recent switch in ownership was probably for the best because you can now have a full-fledged Mediterranean meal from this closet of a space (photo: http://bit.ly/1D9DkxJ). I walked up and was immediately greeted by the perennially sunny Assaf, the new owner who was more than happy to give me a complimentary falafel ball, warm from the oven and with a kick of spice. There's no place to sit here, but what they hell?\n\nFortunately, I live close by, so I made an ambitious order to go. Hey, I skipped lunch at work, so stop judging me. First up was his house specialty, the $7 Flying Falafel Pocket Sandwich, quite an ample pita pocket, nicely warmed and spread wide open for at least a quartet of spicy falafel balls nesting atop a salad mix liberally dressed (photo: http://bit.ly/1AqQbhB). Quite delicious and the fresh warmth of the balls really made them taste like sugarless donut holes. And that's a good thing. I then tried the $5 Dolma Rice Wraps, a zesty appetizer of five dolmas wrapped in grape leaves and topped with a bit of shredded carrot (photo: http://bit.ly/1LF3ezT). Tasty though a tad too oily for my taste. Somehow I just can't pass up hummus when I'm in a Mediterranean setting, so I decided to try the $5 Hummus Saucer.\n\nIt turned out to be a generous serving of hummus topped with sauteed vegetables and accompanied by warm pita (photo: http://bit.ly/1DSG4Dv). Usually I'm fine with plain hummus, but the extra texture of the vegetable bits made it more of an entree than I expected. I really should have stopped there. That was plenty enough food, but $2 for Cinnamon Baklava seems too absurdly cheap not to have as a sweet tooth satisfier (photo: http://bit.ly/1DnPeqn). It was a sweetly crunchy slice of baklava with a multitude of pastry layers uniquely sprinkled with cinnamon. Yep, I went overboard, and if I was wiser, I should have just gone for a combo meal that would have given me a sampler of almost everything. But hey, it's soy-free, vegan and mostly gluten-free. So what's to complain? Especially with Assaf's friendly disposition. I mean the guy wears a T-shirt that says \"Official Baller\" (photo: http://bit.ly/1vxIAxq). How can you refuse service from a guy like that?\n\nFOOD - 4 stars...Mediterranean fast food, really well executed, especially the falafel balls and the hummus\nAMBIANCE - 2.5 stars...uhhh, it's a closet\nSERVICE - 4 stars...he's an official baller\nTOTAL - 4 stars...Assaf has a good thing going here, so check out his balls", "rating": 4, "date": "2015-02-24"}, {"excerpts": ["I also ordered a hummus saucer. "], "author": "Alex G.", "review": "You know you're a damn good restaurant when you completely mess up a persons order, and still get 5 stars. I've heard so much about this place, and knew I had to give it a try at some point. I had a completely random craving for hummus that took over my body, and before I knew it I was staring at the Eat24 receipt with an estimated delivery of 45 minutes. Yes, this review is for a delivery order. \n\nI guess you could say I'm addicted to delivery. I order delivery from Eat24 around 3-5 times a week, if not more. As an Eat24 VIP with over 300 orders under my belt (NO SHAME), I have high standards for my deliveries! Estimated delivery windows are useless, and I usually always allow an hour, and if it exceeds that I just give them a ring to check on it. I kid you not, I got a call at 47 minutes on the DOT that my food had arrived. As someone who does this a lot, I have to admit that's pretty awesome! \n\nRight as I got to my gate to get the food, I realized I forgot the cash tip, so I told him to wait a hot second as I ran up to grab cash. When I came back, he was so thankful. He said it was so unnecessary for me to go all the way back up, although he really appreciated it. He shook my hand, thanked me a million times, and was super nice. Major points for that. \n\nI ordered the Combo Meal #1, which comes with a whole spicy falafel pita pocket, 2 dolmas and a cinnamon baklava. I also ordered a hummus saucer. After I went down 2 flights of stairs to get my order, I came up to my apartment only to realize I had actually received a \"Plate Me\", an extra side of 10 falafel, and a cinnamon baklava. No dolma in sight, and certainly no pita pocket!\n\nStunned and devastated, I ran to computer to double check my order. Sure enough, my order was normal and had not changed. I immediately started formulating the 2 star review in my head, planning the wordage I would use to critique my failed order. All that negativity simply faded away into space the moment I actually tried the food. \n\nThe \"Plate Me\" was so delicious - the veggies were fresh, the hummus was so flavorful, and the falafel was hot and seemed like it had just got out of the fryer. The extra falafel was the perfect amount, and allowed me to finish the plate without running out of falafel. The baklava was a great treat, and seemed much higher quality than the baklava I've had at other Mediterranean restaurants.  \n\nI should THANK Flying Falafel for messing up my order. The pita bread wrapped around falafel would have probably been carb overload, and the plate was the best alternative to combat that. I plan on ordering from here very soon, and I will definitely be ordering what they sent me.", "rating": 5, "date": "2015-07-28"}, {"excerpts": ["I stupidly didn't take anything with falafels, but the hummus saucer was delicious and the cinnamon baklava was literally the best baklava I've ever had."], "author": "Kea M.", "review": "This place was delicious. I stupidly didn't take anything with falafels, but the hummus saucer was delicious and the cinnamon baklava was literally the best baklava I've ever had.", "rating": 5, "date": "2016-08-07"}], "chickn shawarma pocket": [], "spiced kebab pocket": [], "plate me a shawarma": [], "plate me a kebab": [], "crispy chickn pocket": [], "crispy chickn plate": [], "hummus bowl with falafel": [], "hummus bowl with chickn shawarma": [], "hummus bowl with crispy chickn": [], "triple deluxe": [{"excerpts": ["If I want varities I go for the triple deluxe with shawarma, falafel and crispy chick", "'s all in one for only $9.50 "], "author": "Shivani R.", "review": "Stop by here everytime I'm in the city. I order the plate me a falafel or the flying falafel pocket and never miss their cinnamon baklava. The price is cheap for the quantity they give. If I want varities I go for the triple deluxe with shawarma, falafel and crispy chick's all in one for only $9.50 (What!?)\n\nTheir pitas are freshly made, soft and fluffy inside out. Their falafels are also fresh and are delightful balls of goodness.\n\nThey tend to get pretty packed and busy. You can always place an order via the Yelp app and just go pick it up. The only downside is that they are on the streets and you might have to park somewhere else and walk to the restaurant. There are a couple of tables outside, but I'd rather take it out and eat at home than sit on the streets of the city to enjoy the fresh food. Love this place and will definitely go back again.", "rating": 5, "date": "2018-10-27"}], "super combo meal": [], "hummus togo": [], "dolma rice wraps": [{"excerpts": ["I then tried the $5 Dolma Rice Wraps, a zesty appetizer of five dolmas wrapped in grape leaves and topped with a bit of shredded carrot (photo: http://bit.ly/1LF3ezT). ", "Tasty though a tad too oily for my taste. "], "author": "Ed U.", "review": "One potato, two potato, three potato four...hey, wait, where did he go? The French fry guy that served nothing but fries. I respect an operation who specializes, but offering one kind of item appeared a bit limiting even though he offered a variety of sauces as well as soup and chili as accompaniments. I wish the potato guy well, but the recent switch in ownership was probably for the best because you can now have a full-fledged Mediterranean meal from this closet of a space (photo: http://bit.ly/1D9DkxJ). I walked up and was immediately greeted by the perennially sunny Assaf, the new owner who was more than happy to give me a complimentary falafel ball, warm from the oven and with a kick of spice. There's no place to sit here, but what they hell?\n\nFortunately, I live close by, so I made an ambitious order to go. Hey, I skipped lunch at work, so stop judging me. First up was his house specialty, the $7 Flying Falafel Pocket Sandwich, quite an ample pita pocket, nicely warmed and spread wide open for at least a quartet of spicy falafel balls nesting atop a salad mix liberally dressed (photo: http://bit.ly/1AqQbhB). Quite delicious and the fresh warmth of the balls really made them taste like sugarless donut holes. And that's a good thing. I then tried the $5 Dolma Rice Wraps, a zesty appetizer of five dolmas wrapped in grape leaves and topped with a bit of shredded carrot (photo: http://bit.ly/1LF3ezT). Tasty though a tad too oily for my taste. Somehow I just can't pass up hummus when I'm in a Mediterranean setting, so I decided to try the $5 Hummus Saucer.\n\nIt turned out to be a generous serving of hummus topped with sauteed vegetables and accompanied by warm pita (photo: http://bit.ly/1DSG4Dv). Usually I'm fine with plain hummus, but the extra texture of the vegetable bits made it more of an entree than I expected. I really should have stopped there. That was plenty enough food, but $2 for Cinnamon Baklava seems too absurdly cheap not to have as a sweet tooth satisfier (photo: http://bit.ly/1DnPeqn). It was a sweetly crunchy slice of baklava with a multitude of pastry layers uniquely sprinkled with cinnamon. Yep, I went overboard, and if I was wiser, I should have just gone for a combo meal that would have given me a sampler of almost everything. But hey, it's soy-free, vegan and mostly gluten-free. So what's to complain? Especially with Assaf's friendly disposition. I mean the guy wears a T-shirt that says \"Official Baller\" (photo: http://bit.ly/1vxIAxq). How can you refuse service from a guy like that?\n\nFOOD - 4 stars...Mediterranean fast food, really well executed, especially the falafel balls and the hummus\nAMBIANCE - 2.5 stars...uhhh, it's a closet\nSERVICE - 4 stars...he's an official baller\nTOTAL - 4 stars...Assaf has a good thing going here, so check out his balls", "rating": 4, "date": "2015-02-24"}], "freshly baked pita": [{"excerpts": ["The freshly baked pita, freshly fried falafel balls and the seasame sauce. ", "All items are vegan but this is not those hippie vegan place, completely normal, happen to be vegan, even meat lovers will stop by. ", "I tried everything on their menu. "], "author": "Shell J.", "review": "One of the best falafel places in Sf. Despite the low key outfront, the falafel pocket is amazing! The freshly baked pita, freshly fried falafel balls and the seasame sauce. All items are vegan but this is not those hippie vegan place, completely normal, happen to be vegan, even meat lovers will stop by. I tried everything on their menu. Vegan cheese cake, banana milkshake, bakalava.. Healthy food, happy people, good soul. Love the little gem in the big street! Sometimes I would make my way there to just get a falafel fix.", "rating": 5, "date": "2017-03-04"}, {"excerpts": ["- A freshly baked pita filled with veggies & spicy falafel balls! ", "I had it fully loaded with everything. "], "author": "Shane S.", "review": "Had a great experience at the Flying Falafel for lunch. \nI love that everything here is vegan including the shakes! \n\nI had The Flying Falafel Pocket Sandwich - A freshly baked pita filled with veggies & spicy falafel balls! I had it fully loaded with everything. It was $7 plus tax.\n\nIt was tasty & filling stuffed with falafels, lots of veggies, french fries, & with tahini sauce all in a pita. There is no seating indoors & just four chairs outside. Some people were eating standing up yet was lucky to get a seat. This is a highly popular place so expect a long line yet the line moved pretty quick as the cooks are efficient.", "rating": 5, "date": "2016-04-04"}, {"excerpts": ["This is the definition of a \"hole-in-the-wall\" - I wouldn't have even noticed this place if it weren't for the line outside and one of the \"official ballers\" (as they're called) tossing samples of their freshly baked pita into the crowd. "], "author": "Vikram N.", "review": "This is the definition of a \"hole-in-the-wall\" - I wouldn't have even noticed this place if it weren't for the line outside and one of the \"official ballers\" (as they're called) tossing samples of their freshly baked pita into the crowd. I got a piece thrown to me and loved the warm fluffiness of the bread, so I decided to wait it out in line (about 15 min).\n\nThe self-pay system is simple and quick as long as you know how to use it (no-one was manning it), and the guys working here are all amiable and fun to interact with (the guy giving out the samples was trying to get people to catch it with their mouths). Not to mention that they're fast but care about getting orders right - I watched one of the ballers restart an order because he made a small tear in the pita pocket.\n\nI got a spicy pocket with all ~6 toppings ($7 for a bursting pita pocket - great deal), and loved every bite of it. The pita did not disappoint, the falafel's were perfectly crisp, and it was full of flavor from the various sauces and toppings they added. It's not an understatement to say that this was probably the best falafel dish I've had in recent memory, and I'd definitely go back again or highly recommend it to anyone in the area.", "rating": 5, "date": "2015-06-28"}, {"excerpts": ["We were greeted by samples of the warm, freshly baked pita tossed in the air for us to catch. "], "author": "Joan P.", "review": "Thank you, Yelp reviewers, or I would never have thought to try this place. The food is fabulous, and it's all vegan, hurray! We were greeted by samples of the warm, freshly baked pita tossed in the air for us to catch. Although the place is tiny and had lines out the door, everyone was friendly about helping me learn how to use the ordering process. \n\nI had the sesame (non-spicy) pocket and the banana non-milk shake. Both were extraordinary. I'll be back!\n\nI couldn't believe that this place was just a short walk from the Orpheum theater, the reason I was in the city that day.", "rating": 5, "date": "2015-06-01"}, {"excerpts": ["Freshly baked pita (this ain't no grocery store bread), warm, soft falafel balls, and delicious, fresh ingredients.  ", "Also sweet guys working there.  ", "Can't wait to get back to try the baklava and banana shake."], "author": "Scott B.", "review": "Yum!  This place is worth the trip.  Freshly baked pita (this ain't no grocery store bread), warm, soft falafel balls, and delicious, fresh ingredients.  Also sweet guys working there.  Can't wait to get back to try the baklava and banana shake.", "rating": 5, "date": "2015-06-27"}, {"excerpts": ["The bad:\nThe pita: I've read that this place gets freshly baked Pita every morning. ", "This should've been a huge plus in my book. ", "Unfortunately, when I got the Pita in the evening, they used steaming to restore it's freshness. ", "The result is a chewy, unpleasant texture. ", "Which is a pity because it seems like it couldv'e been excellent Pita in the morning. "], "author": "Sela M.", "review": "First, a disclaimer: I grew up in Israel, so I am used to higher standard of Falafel than most Americans.\n\nI came to the Flying Falafel looking for a pre-theater dinner. Given the rave reviews and reading that an Israeli runs the place, I had high expectations, but was disappointed. This falafel fails to impress me even in American standards.\n\nThe good: the service was really friendly, the Banana milkshake was tasty, the price is great for SF, the portions are generous and I liked the spicing.\n\nThe bad:\nThe pita: I've read that this place gets freshly baked Pita every morning. This should've been a huge plus in my book. Unfortunately, when I got the Pita in the evening, they used steaming to restore it's freshness. The result is a chewy, unpleasant texture. Which is a pity because it seems like it couldv'e been excellent Pita in the morning. I get less chewy texture when I defrost frozen Pitas in the microwave at home ... \n\nThe falafel balls: the spicing is good, but I didn't like the texture. It was overly dense and very oily. This seems the oil was not hot enough. Making good falafel requires a fine control of frying oil temperature. If it's too hot, the balls get brown outside while underdone inside. If it's not hot enough (as in this case), it soaks oil and gets overcooked inside. When it's just right, the outside is crispy and the inside is moist and fluffy. They definitely didn't get it right, at least when I tried it.", "rating": 3, "date": "2015-06-25"}], "fresh veggie salad": [], "cinnamon baklava": [{"excerpts": ["I order the plate me a falafel or the flying falafel pocket and never miss their cinnamon baklava. ", "The price is cheap for the quantity they give. "], "author": "Shivani R.", "review": "Stop by here everytime I'm in the city. I order the plate me a falafel or the flying falafel pocket and never miss their cinnamon baklava. The price is cheap for the quantity they give. If I want varities I go for the triple deluxe with shawarma, falafel and crispy chick's all in one for only $9.50 (What!?)\n\nTheir pitas are freshly made, soft and fluffy inside out. Their falafels are also fresh and are delightful balls of goodness.\n\nThey tend to get pretty packed and busy. You can always place an order via the Yelp app and just go pick it up. The only downside is that they are on the streets and you might have to park somewhere else and walk to the restaurant. There are a couple of tables outside, but I'd rather take it out and eat at home than sit on the streets of the city to enjoy the fresh food. Love this place and will definitely go back again.", "rating": 5, "date": "2018-10-27"}, {"excerpts": ["I also ordered the cinnamon baklava.  ", "If you're already treating yourself to a pita, you should keep it going with the baklava!  "], "author": "Vira P.", "review": "I've passed by the Flying Falafel so many times, and I finally had the chance to eat here for lunch the other day.\n\nIt was my first time ordering here, so I didn't make any modifications.  I ordered the falafel pocket with everything, including all the veggies.  It was delicious, and so filling! I could only eat half, and saved the other half for dinner.  Though, I think next time I will just order it with lettuce, tomatoes, and carrots.  I don't mind pickles, but I prefer not to have them in this case.  Just my preference.  Bonus: they put some french fries on top of the pita!\n\nI also ordered the cinnamon baklava.  If you're already treating yourself to a pita, you should keep it going with the baklava!  It's been a few days, and I still think about how yummy it was!\n\nPrices are very reasonable, and service is fast.  It's near 6th Street, so it isn't a great area.  Seating is limited to 2 stools outside, so I got mine to go.\n\nI want to go back and try their spice falafels.", "rating": 5, "date": "2018-07-19"}, {"excerpts": ["Cinnamon baklava.   ", "Chicken (fried) in pita.  ", "Their pita bread is homemade, super fresh.  ", "Loved the slight rubbery taste,  keeping the filling from falling out.  ", "Some pita bread just doesn't hold well.  ", "Line was moving fast about 3 people ahead of me.  ", "People buying dinner.  ", "2 guys operating this small place, smiling away.  ", "Is this how work should be? ", "Having fun while you work or was it the latin fast beat of the salsa music?"], "author": "Helen L.", "review": "Little crunchy balls with lots of veggies inside the pocket with lettuce, cucumbers, tomatoes, chopped pickles.   Two kinds of sauces squirted into a regular pita  pocket topped with a few french fries in a paper sandwich bag for a total of $8.35.   Mediterranean meet french.  Eat outside on their 4 person stool to watch the busy urban market street.  A lady getting iff work walking by sprinkling bird seeds as she walks down the street. Lots of people buying a shopping bagful.  10 balls for 4.95.  Super pita.  Combo #1 and #2.  Banana shake under $5.  Smooth cheesecake $3.99.  Cinnamon baklava.   Chicken (fried) in pita.  Their pita bread is homemade, super fresh.  Loved the slight rubbery taste,  keeping the filling from falling out.  Some pita bread just doesn't hold well.  Line was moving fast about 3 people ahead of me.  People buying dinner.  2 guys operating this small place, smiling away.  Is this how work should be? Having fun while you work or was it the latin fast beat of the salsa music?", "rating": 4, "date": "2017-06-13"}, {"excerpts": ["Not knowing when I would ever get a chance to return, I went buckwild and ordered a Banana shake and a Cinnamon Baklava. ", "I never get to eat baklava since it's usually made with gobs of butter. ", "Not here, as everything is Vegan. "], "author": "John B.", "review": "I love me some falafel! In fact, my first ever Yelp list was dedicated to the search for the perfect deep fried chickpea ball. I had tried Flying Falafel a year or more ago at the Concord Farmer's Market. I was not impressed at all. I didn't even bother to review them since I hoped I received an \"off\" batch of balls that day.\n\nPerhaps I did because just a short while later, the Flying Falafel has it's own SF brick and mortar. Falafel's are flying from this minuscule, definition of \"hole in the wall\". I walked up and nearly passed by this place if it wasn't for the line of techie hipsters standing out front.\n\nThe ordering process was slightly intimidating. Most everyone in line was a regular it seemed. They all walked up to the self service Square machine where a cashier would normally be and ordered away. I'm usually technologically inclined but on this day I fumbled with the machine like grandpa trying to use an iPad to surf for porn for the first time. I wasn't even quite sure what I ordered.\n\nOnce you're done, just wait in the second line until your name is called. I suggest using something more unique if your name happens to be common as I wasn't the only \"John\" standing in line that day.\n\nIt turns out I ordered the full Falafel plate. The super friendly owner, perhaps recognizing my n00bness, jammed my plate full to the point I could barely close the lid. The included pita bread was so moist and soft, some of the best I've had. The hummus was good, but kinda skimpy portion. I'm sure you could ask for more but I didn't. Everything else was full of flavor. The falafel itself was perfectly fried goodness. I think I got \"spicy\" balls but they were not spicy at all. Still good but ask for extra hot sauce if you really need it to burn.\n\nNot knowing when I would ever get a chance to return, I went buckwild and ordered a Banana shake and a Cinnamon Baklava. I never get to eat baklava since it's usually made with gobs of butter. Not here, as everything is Vegan. This was so good that I would consider ordering party tray of this to last me a week! \n\nThe banana shake while tasty, was more smoothie than shake. Nothing wrong with that. Just not what I was expecting. It didn't really go with the Falafel but was good on it's own. \n\nEverything is to go as there are no seats. There's not really anywhere around here I could see myself eating. The prices are decent which would make me go out of my way to pick up food. Hope to see them expand back to The Mission one day. As it stands, this will be an out of the way treat to have every now 'n again.", "rating": 4, "date": "2015-06-12"}, {"excerpts": ["And of course the stand out: their Cinnamon Baklava.  ", "I do not know if cinnamon is a traditional ingredient or their brilliant invention, but every bite was a high-flying, flaky, flavor adventure sending me soaring as though I were Lois Lane herself.  ", "Get it.  "], "author": "James J.", "review": "I was all over the place while visiting San Francisco, from local must-tries to fancy-schmancy, multi-course meals.  The Flying Falafel was my last bite in downtown before I had to fly out and was, hands down, the most fortuitous whim I could have had.  Every single solitary bite of my meal was fresh and flavorful, so add to that impeccable customer appreciation and you can bet money I will be longing for an experience this remarkable in any other city I travel to!\n\nThe Space \n\nInjected into a small chunk of Market St., FF was a perfect choice for my location and the time window I had left.  When they get busy I imagine you will see the obligatory \"line out the door\" any great downtown biz in San Fran. gets, so that can be written off.  The interior was clean and the colors were super fun (super pun intended: their logo is a reworked spin on Superman's brand).  In the back two guys were hard at work cranking out takeout orders and flinging falafel.  \n\nThey have a tiny bit of table space outside that could be around should you wanna eat in a hurry, but more than likely this will be a grab-and-go experience.\n\nThe Service\n\nGiven only two guys were in the place making magic happen I was expecting I might get a little of that \"I'm in a hurry but forcing myself to be polite\" energy out of a downtown food spot.  Polar opposite.  I walked in and began to ask questions about the food (currently a vegetarian, I wanted to know more about the cooking process), the options (needed to insure I had hummus...because hummus), and share in my general visitor enthusiasm.  The guy fielded every question with a smile and I knew the passion of running a great business well was actively at work.  \n\nBy the time I left, I knew a bit about the background, the owner's story, and even got a sample of the banana shake just because he was excited that I was excited.  It was exemplary in every sense of the word.\n\nThe Food\n\nTheir falafel blew my previous understanding of the beloved food out of the fryer completely: how you can take something fried and starchy, keep it minimal on the oil and heavy on the freshness is beyond me, but, my oh my, how they have done it.  My meal was basically a sampler platter of their menu: fantastic falafel balls, lovely local veggies, fresh-baked pita with from-scratch hummus, dolmas, and baklava.  \n\nThe veggies were so crispy, cool, and full of life, pairing perfectly with the warm, crunchy falafel balls of bliss.  The entire serving was lightly coated with tzatziki sauce but the spice-lovers will want to get a bit extra of their other, hotter option too.  The hummus embodied the essence of \"fresh is best\": nothing at all like the pseudo-dips you find in chain markets that lean on add-ins to give it any hint of life.  Take that, spread generously on slices of warm, fluffy pita, and you might be tempted to get on one knee and propose then and there.\n\nI really appreciated the dolmas as well, because I am not big on grape leaves, but cannot undersell how incredible they were.  The filling was so creamy and rich with authenticity I gobbled them down despite typically not being a fan.  \n\nAnd of course the stand out: their Cinnamon Baklava.  I do not know if cinnamon is a traditional ingredient or their brilliant invention, but every bite was a high-flying, flaky, flavor adventure sending me soaring as though I were Lois Lane herself.  Get it.  Do not think about it, just let that perfectly-balanced blend of sweet, spice, and everything nice sweep you up into its arms and send you to the sky. \n\nFinal Thoughts\n\nEvery bite of this meal was memorable, even after the parade of places I went to while visiting for several days.  Coming here will set the bar for your experience of Mediterranean or, perhaps if you grew up with these foods, be the oasis you have been looking for in the Bay Area.  I may have to rely on a plane ticket to ever get this deliciousness again, but at least eating it I felt like I could fly.", "rating": 5, "date": "2015-03-29"}, {"excerpts": ["It's my weekly falafel fix and the delicious cinnamon baklava is an added bonus :D"], "author": "Anuya K.", "review": "Love this place and have been going to it ever since it opened! I usually get the pocket but have lately been trying to be gluten free so have been getting the falafel plate. It's my weekly falafel fix and the delicious cinnamon baklava is an added bonus :D", "rating": 5, "date": "2017-03-09"}, {"excerpts": ["That was plenty enough food, but $2 for Cinnamon Baklava seems too absurdly cheap not to have as a sweet tooth satisfier (photo: ", "http://bit.ly/1DnPeqn). ", "It was a sweetly crunchy slice of baklava with a multitude of pastry layers uniquely sprinkled with cinnamon. ", "Yep, I went overboard, and if I was wiser, I should have just gone for a combo meal that would have given me a sampler of almost everything. ", "But hey, it's soy-free, vegan and mostly gluten-free. ", "So what's to complain? ", "Especially with Assaf's friendly disposition. ", "I mean the guy wears a T-shirt that says \"Official Baller\" (photo: http://bit.ly/1vxIAxq). "], "author": "Ed U.", "review": "One potato, two potato, three potato four...hey, wait, where did he go? The French fry guy that served nothing but fries. I respect an operation who specializes, but offering one kind of item appeared a bit limiting even though he offered a variety of sauces as well as soup and chili as accompaniments. I wish the potato guy well, but the recent switch in ownership was probably for the best because you can now have a full-fledged Mediterranean meal from this closet of a space (photo: http://bit.ly/1D9DkxJ). I walked up and was immediately greeted by the perennially sunny Assaf, the new owner who was more than happy to give me a complimentary falafel ball, warm from the oven and with a kick of spice. There's no place to sit here, but what they hell?\n\nFortunately, I live close by, so I made an ambitious order to go. Hey, I skipped lunch at work, so stop judging me. First up was his house specialty, the $7 Flying Falafel Pocket Sandwich, quite an ample pita pocket, nicely warmed and spread wide open for at least a quartet of spicy falafel balls nesting atop a salad mix liberally dressed (photo: http://bit.ly/1AqQbhB). Quite delicious and the fresh warmth of the balls really made them taste like sugarless donut holes. And that's a good thing. I then tried the $5 Dolma Rice Wraps, a zesty appetizer of five dolmas wrapped in grape leaves and topped with a bit of shredded carrot (photo: http://bit.ly/1LF3ezT). Tasty though a tad too oily for my taste. Somehow I just can't pass up hummus when I'm in a Mediterranean setting, so I decided to try the $5 Hummus Saucer.\n\nIt turned out to be a generous serving of hummus topped with sauteed vegetables and accompanied by warm pita (photo: http://bit.ly/1DSG4Dv). Usually I'm fine with plain hummus, but the extra texture of the vegetable bits made it more of an entree than I expected. I really should have stopped there. That was plenty enough food, but $2 for Cinnamon Baklava seems too absurdly cheap not to have as a sweet tooth satisfier (photo: http://bit.ly/1DnPeqn). It was a sweetly crunchy slice of baklava with a multitude of pastry layers uniquely sprinkled with cinnamon. Yep, I went overboard, and if I was wiser, I should have just gone for a combo meal that would have given me a sampler of almost everything. But hey, it's soy-free, vegan and mostly gluten-free. So what's to complain? Especially with Assaf's friendly disposition. I mean the guy wears a T-shirt that says \"Official Baller\" (photo: http://bit.ly/1vxIAxq). How can you refuse service from a guy like that?\n\nFOOD - 4 stars...Mediterranean fast food, really well executed, especially the falafel balls and the hummus\nAMBIANCE - 2.5 stars...uhhh, it's a closet\nSERVICE - 4 stars...he's an official baller\nTOTAL - 4 stars...Assaf has a good thing going here, so check out his balls", "rating": 4, "date": "2015-02-24"}, {"excerpts": ["I also got the cinnamon baklava because it's a highlight on yelp ", "but I didn't like it very much because it was kind of hard and cold. ", "I don't know. ", "The cook/waiter/cashier man was very nice and friendly though. ", "He threw meatballs at us and told us to catch them with our mouths. ", "And he gave me a free pita bread once I walked in before I even bought anything which was very nice. ", "He also likes to speak Spanish to people. ", "He is very nice."], "author": "Amanda L.", "review": "When I saw this place online, I thought it was a sit in and eat restaurant, but it was just one where you order and you leave and eat outside while you walk or something. So my friends were pretty disappointed that there were no tables or seats and it was a tiny store. But the falafels made up for it because they were delicious. They could be a bit too spicy for some people's likings though. I also got the cinnamon baklava because it's a highlight on yelp but I didn't like it very much because it was kind of hard and cold. I don't know. The cook/waiter/cashier man was very nice and friendly though. He threw meatballs at us and told us to catch them with our mouths. And he gave me a free pita bread once I walked in before I even bought anything which was very nice. He also likes to speak Spanish to people. He is very nice.", "rating": 4, "date": "2015-08-09"}, {"excerpts": ["I might try the dolmas and cinnamon baklava next time."], "author": "Letitia L.", "review": "A decent food option on a Sunday night when it seems every other restaurant in my neighbourhood closes down.  The falafels are great, but the pita and toppings are not as good as Liba Falafel truck.  At least it's cheaper.  I might try the dolmas and cinnamon baklava next time.", "rating": 4, "date": "2015-09-13"}, {"excerpts": ["I ordered the Combo Meal #1, which comes with a whole spicy falafel pita pocket, 2 dolmas and a cinnamon baklava. ", "After I went down 2 flights of stairs to get my order, I came up to my apartment only to realize I had actually received a \"Plate Me\", an extra side of 10 falafel, and a cinnamon baklava. "], "author": "Alex G.", "review": "You know you're a damn good restaurant when you completely mess up a persons order, and still get 5 stars. I've heard so much about this place, and knew I had to give it a try at some point. I had a completely random craving for hummus that took over my body, and before I knew it I was staring at the Eat24 receipt with an estimated delivery of 45 minutes. Yes, this review is for a delivery order. \n\nI guess you could say I'm addicted to delivery. I order delivery from Eat24 around 3-5 times a week, if not more. As an Eat24 VIP with over 300 orders under my belt (NO SHAME), I have high standards for my deliveries! Estimated delivery windows are useless, and I usually always allow an hour, and if it exceeds that I just give them a ring to check on it. I kid you not, I got a call at 47 minutes on the DOT that my food had arrived. As someone who does this a lot, I have to admit that's pretty awesome! \n\nRight as I got to my gate to get the food, I realized I forgot the cash tip, so I told him to wait a hot second as I ran up to grab cash. When I came back, he was so thankful. He said it was so unnecessary for me to go all the way back up, although he really appreciated it. He shook my hand, thanked me a million times, and was super nice. Major points for that. \n\nI ordered the Combo Meal #1, which comes with a whole spicy falafel pita pocket, 2 dolmas and a cinnamon baklava. I also ordered a hummus saucer. After I went down 2 flights of stairs to get my order, I came up to my apartment only to realize I had actually received a \"Plate Me\", an extra side of 10 falafel, and a cinnamon baklava. No dolma in sight, and certainly no pita pocket!\n\nStunned and devastated, I ran to computer to double check my order. Sure enough, my order was normal and had not changed. I immediately started formulating the 2 star review in my head, planning the wordage I would use to critique my failed order. All that negativity simply faded away into space the moment I actually tried the food. \n\nThe \"Plate Me\" was so delicious - the veggies were fresh, the hummus was so flavorful, and the falafel was hot and seemed like it had just got out of the fryer. The extra falafel was the perfect amount, and allowed me to finish the plate without running out of falafel. The baklava was a great treat, and seemed much higher quality than the baklava I've had at other Mediterranean restaurants.  \n\nI should THANK Flying Falafel for messing up my order. The pita bread wrapped around falafel would have probably been carb overload, and the plate was the best alternative to combat that. I plan on ordering from here very soon, and I will definitely be ordering what they sent me.", "rating": 5, "date": "2015-07-28"}, {"excerpts": ["The cinnamon baklava. ", "The amazing employee who spoke Hindi with me "], "author": "Vaibhav V.", "review": "I don't eat a single post-breakfast meal without meat. It's just a rule. To me, life without meat is like life without oxygen. I need it. I am dependent on it. Without it, life just wouldn't be the same. \n\nBut the raving reviews of the Flying Falafel made me break that rule one Wednesday afternoon. I ate a completely vegan meal for the first time in recent memory. And my God, it was fantastic. \n\nThe vegetables loaded with flavor and freshness. The excellent spicy sauce and spicy falafel balls. The warm, fluffy pita bread that they threw (flying in the air), while we waited in line. The best (and admittedly only) dolma I have ever had. The cinnamon baklava. The amazing employee who spoke Hindi with me (there was not an ounce of Indian blood in him). \n\nIt was vegan. And it was perfect. I'll be back.", "rating": 5, "date": "2015-07-30"}, {"excerpts": ["And the vegan cinnamon baklava was so good,  too!  ", "Im salivating while I type this wishing I was stuffing my face with one right now."], "author": "Jenn S.", "review": "Delicious! And the staff is super sweet! \n\nGot the Pocket with Spicy Falafel with everything on it and it was yummmmy!  Lots of flavor, lots of yummy veggies, lots of yummy sauce and lots of falafel packed inside a soft, warm pita. That Spicy Falafel is a perfect amount of heat along with the hot sauce. \n\nThere was a little bit of a wait,  but that was expected cuz I went right around 12:30ish on a weekday lunch rush. But,  the great staff gave me extra bakalava with my order for the wait. Doesn't matter if you're vegan or not,  go get  some. And the vegan cinnamon baklava was so good,  too!  Im salivating while I type this wishing I was stuffing my face with one right now.", "rating": 5, "date": "2015-09-19"}, {"excerpts": ["Vegans rejoice, the cinnamon baklava is vegan. ", "Baklava is usually made with honey which is usually an ingredient most vegans avoid. ", "I wasn't in the mood for dessert "], "author": "S A.", "review": "Flying Falafel was one of the food vendors in VegFest. I had read stellar reviews on Yelp so I took the opportunity to check them out. \n\nAssaf was cracking jokes with the customers and volunteers. He demonstrated his great hand eye coordination skills, tossing a falafel in the air and catching it in a pita pocket with ease. He gave us samples of falafel and pita bread as we stood waiting in the long line. He also handed out business cards to anyone who wanted one. \n\nThe sandwich was a great way to start off the afternoon. You had the choices of sesame or spicy falafel or a mix of both. I went with both. The falafel were these delicious, crispy, and crunchy morsels. They came with sliced veggies and a generous amount of sauce. It was pretty good overall and filled me up. \n\nMy one gripe is one of the added veggies was too sour and bitter for my liking. I'm not exactly sure which one it was but I hope this was just a one time scenario. Vegans rejoice, the cinnamon baklava is vegan. Baklava is usually made with honey which is usually an ingredient most vegans avoid. I wasn't in the mood for dessert but I do plan on having some in the future. \n\nI will check out their brick and mortar place to try out their vegan banana milkshake (I hope it lives up to what I imagine) and plated falafel with a friend.", "rating": 4, "date": "2015-06-07"}, {"excerpts": ["My favorites are the pita pocket and the cinnamon baklava! ", "You must try it."], "author": "Nikki G.", "review": "This place is scary at first because it is literally a \"hole in the wall\" BUT do not be intimidated!! Flying falafel is SOOOOO yummy and I am so lucky it is so close to my apartment. Everyone who works here is super friendly and they always give a small piece of your pita to you while you wait! Love love love this place and definitely recommend to anyone in SF going over to union square or Powell-Market. PLUS it's vegan friendly :-)\n\nMy favorites are the pita pocket and the cinnamon baklava! You must try it.", "rating": 5, "date": "2015-06-10"}, {"excerpts": ["I ordered the cinnamon baklava but did not realize they forgot to give it to me until I got back to our hotel.\n\n"], "author": "Aaron D.", "review": "Hole in the wall, literally, but that just adds to the awesomeness.\n\nThis place is literally the bar setter for falafel. This place is a walkup counter where you place your own order on an ipad. Two guys behind the counter are slanging 1\" diameter falafel balls like crack, throwing them onto of dollops of hummus surrounded by an assortment of veggies, packed into fresh hot pockets of pita with all the fixings, or just throwing 10 of them in a bag for snacking. Plus, like any successful dealer, they often hand out bite-sized pieces of hot, steamy pita bread to get you hooked.\n\nI got a full pocket with spicy sauce and it was amazing. Soft, fresh pita, tons of veggies and hummus, and as many falafel balls that could be packed in. My wife got the falafel plate and it was a TON of veggies with hummus in the middle and falafel balls dropped all around it. The veggie ratio was overwhelming but better too much than not enough.\n\nI ordered the cinnamon baklava but did not realize they forgot to give it to me until I got back to our hotel.\n\nDownside: Its on a sketchy stretch of Market so stay alert when in the area. I witnessed a guy urinating in the middle of the sidewalk facing the street on the same block. Not cool, but Id go there again in a heartbeat the next time I am in town.", "rating": 5, "date": "2015-05-16"}, {"excerpts": ["I stupidly didn't take anything with falafels, but the hummus saucer was delicious and the cinnamon baklava was literally the best baklava I've ever had."], "author": "Kea M.", "review": "This place was delicious. I stupidly didn't take anything with falafels, but the hummus saucer was delicious and the cinnamon baklava was literally the best baklava I've ever had.", "rating": 5, "date": "2016-08-07"}, {"excerpts": ["their cinnamon baklava is delicious and their dolmas is pretty goof if you like sour things"], "author": "Natalie G.", "review": "ive never tasted anything like this  their vegan falafel pita pocket is a must!! their cinnamon baklava is delicious and their dolmas is pretty goof if you like sour things", "rating": 4, "date": "2016-03-31"}, {"excerpts": ["The falafel and cinnamon baklava were great.   ", "The line moved quickly and the food was really good.  ", "Will definitely go again."], "author": "Brian R.", "review": "Stumbled on this place from the great smell and line. Really glad I did. The falafel and cinnamon baklava were great.   The line moved quickly and the food was really good.  Will definitely go again.", "rating": 4, "date": "2016-03-25"}, {"excerpts": ["Also, a special mention to the Cinnamon Baklava, which was so awesome that we ordered 4 more. ", "Very friendly and patient staff. ", "5 stars is the least I can give."], "author": "Pranav B.", "review": "I went there with my family for lunch during the Long Weekend. We had the Flying Falafel Pocket and it was the best Falafel I`ve ever had. The portions are quite large and the best time to go is when you`re really, really hungry. Also, a special mention to the Cinnamon Baklava, which was so awesome that we ordered 4 more. Very friendly and patient staff. 5 stars is the least I can give.", "rating": 5, "date": "2015-07-09"}, {"excerpts": ["Not a big fan of the falafel balls themselves and the cinnamon baklava was alright."], "author": "Chinh T.", "review": "From the reviews and pictures we instantly recognized the guy working at the front and he gave us pita samples as soon as we entered. He probably knew it was our first time so he piled on the toppings for us. The falafel pocket was delicious but next time we'll definitely be asking for more sauce! Not a big fan of the falafel balls themselves and the cinnamon baklava was alright.", "rating": 5, "date": "2015-07-21"}, {"excerpts": ["The cinnamon baklava and dolmas were missing from order, which was disappointing. ", "Hopefully I will get refund, but the falafel was so good that I'm still thrilled with what I did receive."], "author": "Jen W.", "review": "Amazing spicy falafel. AMAZING. Eat24 app not at all amazing, since it was confusing on how to order a \"combo\" vs. regular falafel sandwich. The cinnamon baklava and dolmas were missing from order, which was disappointing. Hopefully I will get refund, but the falafel was so good that I'm still thrilled with what I did receive.", "rating": 5, "date": "2015-05-16"}, {"excerpts": ["I also recommend the cinnamon baklava is yummy too! ", "I'll be back soon :-)"], "author": "Elena D.", "review": "If you are on market street and hungry give  Flying Falafel a try! The warm fresh pita pocket with falafel and veggies is delish! I also recommend the cinnamon baklava is yummy too! I'll be back soon :-)", "rating": 5, "date": "2015-04-11"}], "creamy cheesecake": [], "banana milkshake": [{"excerpts": ["A must try for me next time is the organic banana milkshake and their cheesecake!"], "author": "Rachel C.", "review": "BEST Falafel I've ever had!!! TBH, I don't even have the right words to describe how mouthwatering this place is! Typing this is making me want it at this very moment. They flew their way to my heart :,,,) \n\nLocation: It's on Market street but don't expect an actual restaurant. It's a little easy to miss, so keep your eyes open! It's designed to be one of those grab and go kind of places. They do have one table outside with four stools, so if you're lucky, you can probably eat and sit. \n\nStaff & Service: Friendly, funny, and fast! I can tell this place can get pretty busy, because there were a few people waiting in line and waiting outside, but this one/two man band will get your order out quick!\n\nFood: Mouthwatering! Flying with flavor! Helllllllllla goooood! Portions are decent enough to share. Unless you want to be selfish, then go 'head. I ordered the Super Combo #1 - Pocket & a side of fries. The Pocket was packed with goodness and did not lack any \"meat\" (note: this is a vegetarian place), it was not massed with vegetables, or was it too saucy. The falafel balls inside the pocket was THEEE cherry on top for this meal. I think it was supposed to be spicy but I could not really tell. I did not even mind it though because I was too busy enjoying my lunch. The pita bread was soft and fresh, and it was strong enough to hold the contents. The fries ...oh laaaawdddd... were addicting!! Crisp and had the perfect amount of seasoning. Not too salty and had the right amount of spiciness to it.\n\nA must try for me next time is the organic banana milkshake and their cheesecake!", "rating": 5, "date": "2018-03-26"}, {"excerpts": ["It's completely vegan, and they also offer a homemade banana milkshake and baklava! ", "(Which is delicious by the way) ", "If you like middle eastern food or are vegan, this is the spot for you!"], "author": "Sami M.", "review": "I love eating here! The customer service is wonderful, with very kind people serving your food. I usually get the flying falafel plate or pocket, but recently I tried the chicken shawarma and fell in love with it. It's an ideal location as it's right next to the Berkeley bart station and Berkeley City College, and only one block from UC Berkeley campus! It's completely vegan, and they also offer a homemade banana milkshake and baklava! (Which is delicious by the way) If you like middle eastern food or are vegan, this is the spot for you!", "rating": 5, "date": "2018-08-22"}, {"excerpts": ["We ordered the Flying Falafel Pocket, one with the spicy falafel and the other with the seaseme falafel with all the veggies, fries, and the banana milkshake. ", "I personally do not like the taste of cinnamon ", "but I didn't even know the milkshake was made from cinnamon or else I wouldve requested it without it, ", "but  I'm glad I didn't know because it just tastes so good all together. "], "author": "Yinja L.", "review": "I am now a firm beliver of Vegan eating. Forget about everything you've heard about vegan eating and all the negative comments, and try out Flying Falafel and your tastebuds will do all the talking after. \n\nWe ordered the Flying Falafel Pocket, one with the spicy falafel and the other with the seaseme falafel with all the veggies, fries, and the banana milkshake. I personally do not like the taste of cinnamon but I didn't even know the milkshake was made from cinnamon or else I wouldve requested it without it, but  I'm glad I didn't know because it just tastes so good all together. They do make it with pecans also, so if you have nut allergies its not for you. \n\nI don't know what it is but green sauces are always the best in my opinion. So, I personally loved mine with extra green sauce. YUMMMMMMM! \n\nCarbs are great, and the pita bread here is so good and fresh and just so amazing. \n\nThe staff is super friendly. It's a small little place with a small table outside and a four barstools.", "rating": 5, "date": "2016-12-17"}, {"excerpts": ["We got the plate me, banana milkshake and seasoned fries.\n\n", "Banana milkshake: yum!!!! ", "Love the mixture with cinnamon and vanilla. "], "author": "Minati D.", "review": "We ordered takeout from this restaurant for lunch via ubereats. Food was delivered within 45 mins so that was great! \n\nWe got the plate me, banana milkshake and seasoned fries.\n\nPlate me: we debated getting the pita pocket vs this but ended up with the plate as we thought the pita may be soggy by the time it gets delivered. Luckily our order came with a side of pita :) the plate is nothing amazingly flavorful. It's standard salad, falafel, tomatoes, pickles, cucumber, hummus, side of hot sauce. Large quantity especially for lunch. I personally thought it has way too much hummus on the plate and it made everything too bland. Overall filling plate for lunch for $7-8. \n\nBanana milkshake: yum!!!! Love the mixture with cinnamon and vanilla. Not too happy with the $7 though\n\nSeasoned fries: loved these as well. $4\n\nLiked it but did not love it. Its a decent place for lunch but food is pretty standard.", "rating": 3, "date": "2017-12-14"}, {"excerpts": ["Vegan cheese cake, banana milkshake, bakalava.. ", "Healthy food, happy people, good soul. ", "Love the little gem in the big street! ", "Sometimes I would make my way there to just get a falafel fix."], "author": "Shell J.", "review": "One of the best falafel places in Sf. Despite the low key outfront, the falafel pocket is amazing! The freshly baked pita, freshly fried falafel balls and the seasame sauce. All items are vegan but this is not those hippie vegan place, completely normal, happen to be vegan, even meat lovers will stop by. I tried everything on their menu. Vegan cheese cake, banana milkshake, bakalava.. Healthy food, happy people, good soul. Love the little gem in the big street! Sometimes I would make my way there to just get a falafel fix.", "rating": 5, "date": "2017-03-04"}, {"excerpts": ["I also got the banana milkshake. ", "It was a bit hard to drink in my opinion, really smooth in the beginning then clumps and unable to go up my straw later. ", "Really good still. ", "I wish they still had the pita sandwich and milkshake combo meal. "], "author": "Valerie X.", "review": "I've been wanting to try this place for years. So glad I got to try it! I'm a huge fan of falafel pitas. This place is truly a gem. The best falafels I have ever had. Fillings were fresh and exactly what I like. I appreciate the small menu because sometimes it's hard to decide what to get. This place is very straight forward.\n\nI also got the banana milkshake. It was a bit hard to drink in my opinion, really smooth in the beginning then clumps and unable to go up my straw later. Really good still. I wish they still had the pita sandwich and milkshake combo meal. Such a good deal!\n\nA few things I didn't like: (1) There was only one person working there, so I had to wait about twenty minutes for my food. (2) Just about no seating space. There was just a small table for four with only three chairs. Super tiny location. (3) I was not a fan of the fries in a falafel sandwich. Not a good combo for me; would get without next time. The fries were just thrown into my sandwich and by the time I took it out to eat all the fries fell out. Not to mention, I watched a man wheel a cart of frozen fries that I believe were used by the restaurant.\n\nOtherwise 5 stars, would come again!", "rating": 5, "date": "2017-08-20"}, {"excerpts": ["Also, the only drink they sell is a banana milkshake so you'll need to stop by the smoke shop nearby to get a soda if you want.  ", "Not much space to eat it; only one measly table with one chair.  "], "author": "Adam B.", "review": "A very satisfying and cheap (for San Francisco) vegan sandwich at $7 (before tax).  The setup is a bit confusing since you order and pay on the right line and then get in the left line to dictate your toppings once your name is called.  Also, the only drink they sell is a banana milkshake so you'll need to stop by the smoke shop nearby to get a soda if you want.  Not much space to eat it; only one measly table with one chair.  But could totally loiter nearby and have at it standing with the pita in one hand and your drink in another (...but good luck if you also want to take a photo of your falafel).\n\nSpicy Falafel Sandwich: Two layers of crispy on the outside and soft on the inside falafels; a bunch on the bottom before the filling starts and some more on top of all the veggie filling.  The spicy falafel didn't feel particularly spicy.  The pita was thicker than store bought and quite fluffy.  So many veggies and sauces added when you ask for everything.  In aggregate, all that filling helped contrast the deep fried carbs with freshness and tanginess.  Pretty solid falafel offering.", "rating": 4, "date": "2015-10-06"}, {"excerpts": ["Can't wait to go back and have a banana milkshake. \n\n"], "author": "Elizabeth B.", "review": "Omggggggggg I can't stop thinking about this place!!!!!\n100% vegan down a dirty shady ass street. \nAfter seeing the Kubrick exhibit at the Jewish Museum we had planned to walk to Z-pizza.\nInstead I decided we should walk the extra blocks (pizza sounded nasty because they use Daiya) and come here...THANK GOODNESS WE DID!  \n\nNothing to mark it but a dirty crusty yellow painted/ homemade wood high tabletop and two chained on stools. \nTook a peek inside and there stands the tiny little but tasty ass kiosk.\n\nWhat goes on here? Mouth explosions. Super experiences.\n\nYou get in line and the SUPER LOUD music serves as a background to the chefin' rockin' skills of the guy behind the counter.\nA one man show and the guy behind the counter is a f'in machine! Asking people how they are, flipping falafel's into pita, asking current customers if they want to load up with all of his selection of condiments. Frying up fries. Serving up iced teas from a little fridge cooler.\n\nWhen you get up front he has you type in on the iPad/Square? screen to select what you want and then after pressing all your goodies, you slide your card, tip, email your receipt.\nDone! \nStand back and watch him complete the orders. \nHe was even filling food delivery service orders, several bike messengers were ready for action.\n\nI got the spicy falafel pita sando with alllllll the veggies, all the hot peppers and spicy sauce. Soooooo huge! \nSoft, warm, cool, spicy, messy...just like it should be.\nGreat value for the HUGE portion. I couldn't even eat half mine but wow did I try!\n\nHusband wanted fries and basically opposite what I got. He got non spicy, selected no hot peppers and a yummy different sauce. The few fries that I munched were good!\nOh I forgot...the iced tea is super sweet, like old school koolaide sweet lol.\n\nIf you go there be ready to eat, groove a little, get sloppy messy in a yum way...and eat a few bites for me.\n\nWow I love this place. Can't wait to go back and have a banana milkshake. \n\n#1 fan", "rating": 5, "date": "2016-10-01"}, {"excerpts": ["I ordered the spicy pocket falafel and a banana milkshake. ", "The pita pocket is pretty stuffed and can be a bit messy to eat so grab a fork. ", "The spicy falafel was good and had a bit of a kick but wasn't too spicy. ", "The banana shake was too thick and the color was unappetizingly brownish. ", "All in all, it's a good spot for a quick bite ", "yet I still prefer Falafel's Drive", "-In both for their falafel's and banana shakes."], "author": "Ruby C.", "review": "I've had this spot bookmarked for quite some time since I love Falafel's Drive-In in San Jose and was looking for something similar in SF. It's truly a hole-in-the-wall and easy to spot with the long line. During lunch the wait can take 5-10min and much longer if you don't read the signs and stand in the wrong line (order on the right & pick-up on the left).\n\nI ordered the spicy pocket falafel and a banana milkshake. The pita pocket is pretty stuffed and can be a bit messy to eat so grab a fork. The spicy falafel was good and had a bit of a kick but wasn't too spicy. The banana shake was too thick and the color was unappetizingly brownish. All in all, it's a good spot for a quick bite yet I still prefer Falafel's Drive-In both for their falafel's and banana shakes.", "rating": 3, "date": "2015-09-08"}, {"excerpts": ["I'll be back to try their falafels and banana milkshake.\n\n"], "author": "Ali F.", "review": "Keep in mind that this is a vegetarian food establishment. I ordered the Crispy Chick'n Pocket thinking it was real chicken, but it's not. There should be a description by the item, but there wasn't. The meat is imitation chicken and has a doughy texture. The pocket was not bad and the ingredients are fresh, but I was just expecting meat. I'll be back to try their falafels and banana milkshake.\n\nThere is no real seating/tables. Just some stools outside and a makeshift table. It's best to get the food to-go.", "rating": 3, "date": "2017-04-26"}, {"excerpts": ["I also got the banana milkshake, which is comprised of frozen bananas and cinnamon (I believe). "], "author": "Nicole A.", "review": "If you love falafel, you will LOVE this joint. As a hole in the wall eatery located on market street, this place is one of SOMAs many gems. They offer a handful of different options, but the go-to for many, including myself, is the Flying Falafel Pocket Sandwich. \n\nJust as it sounds, the sandwich is a pita pocket stuffed to the brim with whatever fillings you want. Falafel, veggies galore, tahini, and French fries (!!!), the sandwich is an explosion of flavors and textures in your mouth. They have two falafel options: spicy and sesame. I went with the sesame, but it did have a kick of heat. Super filling, very affordable, the sandwich was a delight. \n\nI also got the banana milkshake, which is comprised of frozen bananas and cinnamon (I believe). Extremely thick, sweet and rich-- this milkshake will satisfy any sweet tooth cravings you may have. \n\nOverall, The Flying Falafel impressed my tastebuds, thus is one of my favorite places in the City.", "rating": 5, "date": "2016-09-03"}, {"excerpts": ["I got the combo: Pita Pocket with the Vegan Banana Milkshake\n\n"], "author": "Lanie L.", "review": "Hmmm...No more 3 Potato 4? *Sad Face*\nIts closing was nothing surprising. They never had any business and the guy who ran that stand was a grumpy fart anyway.\n\nI'm not the biggest fan of falafels, *gasp..* I know I know...calm down everyone, but I do appreciate that it is vegan friendly!\n\nWhen The Flying Falafel first opened, it immediately got glowing reviews. I put it off of my \"to-try\" list since I don't enjoy falafels unless I'm in the mood for them.\nSo I decided to wait until I was in the mood for them.\n\n3 months later, I still never had any craving or want for falafels.\nSo I decided I would just go here when I was starving instead.\n\nI walk up to the tiny closet that is located on Market between 7th & 8th. Only 2 people in front of me. Nice. The owner wasn't in shop, but instead 2 guys who were cheerful and throwing falafels into steaming hot pita pockets.\nThey immediately greeted me and asked if it was my 1st time. I nodded.\nThey suggested the Spicy Falafel over the Sesame one.\nI got the combo: Pita Pocket with the Vegan Banana Milkshake\n\nYou order on the Ipad, pay with cash or credit, and then choose your toppings on the left.\n\nWith speed, delicacy, and skill, he grabbed a pita pocket and started scooping falafels in. *1, 2, 3, 4, 5* Then he scooped in an assortment of fresh veggies, hummus, and hot sauce.\nThen MORE falafel balls! *6. 7. 8.9.* OOPS! One goes Flying into the air! *PLOP* Right into my pocket! Falafels really DO fly here!\n\nIt was quite impressive how much can fit into one pita.\nWhen I received my order, the line was now straight out the door!\n\nI happily walked away, juggling my overflowing pita pocket and milkshake.\n\nBut how does this falafel taste to the girl who doesn't care for falafels?\n\nAmazing.\n\nThe pita so soft and fluffy pairs perfectly with the crispy falafel balls. They are slightly spicy, have a great crunch, but soften once it's in your mouth. The veggies are fresh and the hummus is creamy. Altogether this is one great sandwich.\nThe best part? You get so full off of this! A few times I thought I ate all the falafels, but another one would be buried at the bottom under all the sauce! They really pack it in there!\n\nAnd the milkshake? My yelper friends weren't lying. It was so delicious! It reminds me of a banana horchata. This milkshake is made with fresh bananas, rice milk, and cinnamon. Perfect on the sunny day and a great way to wash down those spicy falafel balls.\n\nWill I come back? Definitely. Maybe not soon, because I still never crave it, but much sooner than later.", "rating": 5, "date": "2015-05-13"}, {"excerpts": ["I ordered the pocket falafel, baklava and banana milkshake and all were quite good.  ", "My favorite was the baklava, which was a contrasting mixture of both crispy and soft textures.  ", "If you don't like cinnamon,  ", "I would skip this and the banana shake.  ", "I happen to love cinnamon.  ", "It is nice that it is also all vegan.  ", "Normally I can order a falafel at most Greek restaurants but the baklava often has products I cannot eat.  "], "author": "Teresa K.", "review": "I ordered the pocket falafel, baklava and banana milkshake and all were quite good.  My favorite was the baklava, which was a contrasting mixture of both crispy and soft textures.  If you don't like cinnamon,  I would skip this and the banana shake.  I happen to love cinnamon.  It is nice that it is also all vegan.  Normally I can order a falafel at most Greek restaurants but the baklava often has products I cannot eat.  I rarely can order a milkshake anywhere.  \n\nSomeone complained about the falafel balls being too scant but mine had plenty (most were placed on the bottom with tons of veggies on top).  If you move them out from the bottom it becomes more equally distributed.  Had there been more present, it would have been too much, so it was the right amount and certainly not scant.  I especially liked their unique mixture of crunchy veggies, and, as others have said, the pita is soft and moist rather than dry/rubbery.  \n\nIf you don't like the long lines, you might want to try ordering via Caviar, although sometimes the food/drinks are not as fresh (hot or cold, etc.) due to the delay. I have never ordered in person because I have noticed there is always a long line and there is nowhere to eat anyway.", "rating": 5, "date": "2017-03-04"}, {"excerpts": ["If your a bit health conscience or need something to wash down your meal, than order their banana milkshake. ", "Made with fresh bananas, rice milk, pecans, and cinnamon- "], "author": "Alice A.", "review": "If your in town, than get yo tush over here. These falafels are hawt.\n\nReally, they are hot, spicy, and fresh! Stop by and the gentleman by the counter will offer you a free sample. I've had many falafels before and these are by far one of the best. They might even rival a certain place in NYC~ If spicy isn't your thing, than don't worry and get the sesame version. \n\nThe combo meal is your best bet to try all of their delicious offerings. Your tummy will not be disappointed. If you order the plate, than you will get a plate of hummus, pickled carrots, picked cabbage, pickles, salad, tomatoes, pita, sauces and garish to go with whichever hot balls you decided. If you make it a combo, than you get a slice of baklava and 2 dolmas topped with pickled carrots. Let me tell you- ORDER THE BAKLAVA! It is the most delicious version I've tasted! The flavor...the melt in your mouth sweetness...ah... \n\nIf your a bit health conscience or need something to wash down your meal, than order their banana milkshake. Made with fresh bananas, rice milk, pecans, and cinnamon- it is pure deliciousness without any guilt!\n\nI almost missed this place when I first visited the area. But after searching for vegan restaurants nearby, I came across Flying Falafel and I knew be ordering something here :)", "rating": 5, "date": "2015-02-27"}, {"excerpts": ["I ordered a falafel frisbee and banana milkshake. ", "The frisbee is falafel on top of a bunch of hummus, with whatever veggies and sauce you want. ", "I opted for all veggies and also all the sauces (tahini, some kind of spiced mayo, and amba- pickled mango) except for hot sauce. ", "What makes the food good is that separately, each component is pretty good but the combination of everything together is truly fantastic. ", "The hearty hummus with crispy falafel and crunch and super fresh veggies was awesome. ", "The pita bread is pretty good as well, not my favorite ", "but I have never been a huge pita fan. ", "The banana milkshake was great too, honestly better than I expected. ", "I believe it is made with Rice Dream and possibly some nuts also, and it was very creamy and tasty. "], "author": "Seema U.", "review": "I have walked by this place a few times, and always see it rated highly on Yelp, so I decided to come give it a try. I came here on a cold and rainy Sunday, but it was still pretty busy- when I walked in, there was no line but within a couple of minutes, there were about 5-6 people in line. \n\nSimple menu- falafel, pita, veggies, hummus which you can order in different ways (platters, on bed of hummus, pita sandwiches, etc.) plus a few other things like dolmas, baklava, and some drinks. Everything is vegan. \n\nI ordered a falafel frisbee and banana milkshake. The frisbee is falafel on top of a bunch of hummus, with whatever veggies and sauce you want. I opted for all veggies and also all the sauces (tahini, some kind of spiced mayo, and amba- pickled mango) except for hot sauce. What makes the food good is that separately, each component is pretty good but the combination of everything together is truly fantastic. The hearty hummus with crispy falafel and crunch and super fresh veggies was awesome. The pita bread is pretty good as well, not my favorite but I have never been a huge pita fan. I really liked the amba also, the mango gave a nice touch of sweetness and since it was pickled, you get a bit of tartness too. \n\nThe banana milkshake was great too, honestly better than I expected. I believe it is made with Rice Dream and possibly some nuts also, and it was very creamy and tasty. It does cost $5 which I feel is maybe a bit too high, but I did like it a lot. \n\nThe store is super tiny and doesn't really have much place to even wait for your food or sit (there are a couple of outdoor tables). Definitely more of a grab and go place. I heard it gets pretty busy during the week, especially at lunch. The Flying Falafel is a great option for some filling but not ridiculously heavy food.", "rating": 4, "date": "2015-12-20"}, {"excerpts": ["I really want to try the banana milkshake and baklava next time.\n\n"], "author": "Semuteh F.", "review": "Really tasty and cheap lunch in mid-market. I had the snacker for $5 and it was definitely enough food for lunch. I went after the busy lunch hour and didn't have to wait in line BUT it did take 10 minutes + for the sandwich which I thought was sort of weird since there wasn't a line and it didn't seem like they were actively making orders. It looked like they were making small batches of falafel balls in the fryer so that was the bottleneck.\n\nMy barometer for greatness was Mamoun's Falafel in New Haven/NYC and I have to say it wasn't Mamoun's good but it was still delicious and you can't beat the price! Service was kind and they take credit cards! I really want to try the banana milkshake and baklava next time.\n\nI know they take online orders too so I will probably do that next time so I don't have to wait.", "rating": 4, "date": "2015-09-30"}, {"excerpts": ["Got the falafel of course and banana milkshake. ", "Both were good but nothing to write home about. ", "Given this is SF and steps from busier landmarks, it's good for a quick, relatively inexpensive bite to eat."], "author": "Julia C.", "review": "There seems to be a steady flow of people here but not a horrible wait. We didn't go during rush hour though. Got the falafel of course and banana milkshake. Both were good but nothing to write home about. Given this is SF and steps from busier landmarks, it's good for a quick, relatively inexpensive bite to eat.", "rating": 3, "date": "2017-06-25"}, {"excerpts": ["I also ordered a small banana milkshake. ", "The milkshake was good but nothing special. ", "I have made a very similar tasting milkshake before at home. ", "Overall the small milkshake was too expensive for being something I basically already made at home before. ", "The pockets too expensive as well. ", "The fries not worth 3.95! ", "I had their baklava and cheesecake before and also weren't anything special. ", "I don't recommend this place. ", "I suggest going somewhere else especially if it's for the falafel. ", "The falafel was so deeply fried it may have well been something from a fast food chain. ", "I came in thinking the food would be delicious and the falafel would taste like traditional falafel. ", "The falafel didn't taste anything like traditional falafel, it also felt as if it was just flour anf little bit of water deeply fried in some cheap vegetable oil."], "author": "Eli B.", "review": "The fries though they are \"seasoned\" tasted bland and like every other average fries. The pita bread tasted really well on the first bites I took of it only because it was fresh testing as they claim it is. I ate the other half later and the pita no longer tasted as good it didn't even taste like anything. The guy working the counter I'm not sure why he's working it as opposed to the other guy who clearly speaks English fluently. I've asked for a full pita pocket with half spicy half sesame falafel but got 1 of each instead. I didn't realize till after purchasing and having left the place like 30 minutes later that he entered in 2 orders for me. The regular sesame was again bland and flavorless. While the spicy one was a bit spicy on and off. I also ordered a small banana milkshake. The milkshake was good but nothing special. I have made a very similar tasting milkshake before at home. Overall the small milkshake was too expensive for being something I basically already made at home before. The pockets too expensive as well. The fries not worth 3.95! I had their baklava and cheesecake before and also weren't anything special. I don't recommend this place. I suggest going somewhere else especially if it's for the falafel. The falafel was so deeply fried it may have well been something from a fast food chain. I came in thinking the food would be delicious and the falafel would taste like traditional falafel. The falafel didn't taste anything like traditional falafel, it also felt as if it was just flour anf little bit of water deeply fried in some cheap vegetable oil.", "rating": 1, "date": "2018-04-06"}, {"excerpts": ["Oh and don't forgot to order the random yet delicious banana milkshake, made with fresh bananas, rice milk, cinnamon, and pecans. \n\n"], "author": "Juliana K.", "review": "Flying Falafel left me speechless. \n\nIt's a total bare-bones, hole-in-the-wall place, with no area to sit and only one guy running the shop.\n\nJust order the falafel pita pocket with all the fix-ins... And don't ask questions. \n\nOh and don't forgot to order the random yet delicious banana milkshake, made with fresh bananas, rice milk, cinnamon, and pecans. \n\nI wouldn't recommend ordering a falafel plate unless you are taking it back to work/home to eat because it's hard to eat a plate while standing up on Market street.\n\nJust thinking about the fluffy homemade pita and crispy falafel is making my mouth water. Can't wait to go back!", "rating": 5, "date": "2015-04-26"}, {"excerpts": ["On my second visit, I think I will opt for the Combo #2: a pita pocket + that infamous banana milkshake "], "author": "Brandi W.", "review": "Question of the day: What are your all-time, top ten favorite foods? \n\nFalafel is most definitely on my list, maybe even cracking the top five. Those tasty little balls are a simple yet satisfying savory taste sensation, especially at this location. \n\nFirst impressions: Assaf (the owner) is super sweet. He has that kind of warm smile that just makes you feel better; his kindness is infectious. He greeted me right away, and I felt the urge to hug him (don't worry, I held back). \n\nThis is a tiny little shop, a sort of falafel hut, with no real seating. It's basically a to-go window, but the food is SO delicious. \n\nI ordered the spicy falafel balls on a plate, but said \"sure\" when I was asked if I wanted bread. Reason number #47 I will never be gluten-free: when offered bread, I always say yes. \n\nThis is a 100% vegan, soy-free establishment with several gluten free options. The veggies taste crisp and fresh, and everything is very flavorful without being salty or greasy. Major props to this unassuming falafel shop. Make sure you get a sample (I wasn't offered one, and was too shy to ask). \n\nI will definitely become a regular here. On my second visit, I think I will opt for the Combo #2: a pita pocket + that infamous banana milkshake I've heard so much about ($11 pre-tax).\n\nI noticed that they had a stand at the Very Vegan Sunday event at SoMa StrEat Food Park (every 2nd Sunday of the month), so look for them there! Tell them Brandi W. says hi. \n\nPro-tip: make sure you get some of that hot sauce on the side, or have them throw it on top if you're feeling adventurous. Of course, next time I'm going to ask for more. I like it hot... real hot.", "rating": 5, "date": "2015-03-13"}, {"excerpts": ["That vegan banana milkshake is to die for and was perfect for my girlfriend who can't have dairy. \n\n"], "author": "Andres B.", "review": "The hype is real and Assaf is indeed the man. That vegan banana milkshake is to die for and was perfect for my girlfriend who can't have dairy. \n\nAssaf will very warmly dole out samples to anyone who can hear him, and even gave someones dog a pita treat. The falafel pocket was incredible though, definitely the best falafel I've had in the bay area so far (coming from Dearborn, MI the bar was set high.) \n\nOh, and it's super affordable. Highly recommend.", "rating": 5, "date": "2015-03-06"}, {"excerpts": ["The banana milkshake was just what I needed for a woman like me on the go... ", "Nutritious & delicious, Compliments to the worker who prepared it perfectly, also cheers to the owner- tip of a hat 2U!"], "author": "Jennifer M.", "review": "This place was SPOT ON!!! The banana milkshake was just what I needed for a woman like me on the go... Nutritious & delicious, Compliments to the worker who prepared it perfectly, also cheers to the owner- tip of a hat 2U!", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["Spicy falafel pocket and a banana milkshake. ", "The spicy falafel was incredible - so much so that I wish I had extra stomachs like a cow to be able to eat more of it - and the banana milkshake was also on point... "], "author": "Rachel F.", "review": "Spicy falafel pocket and a banana milkshake. Boom.\n\nI was craving some serious hummus and falafel hard, so I decided to \"go my own way\" a la Fleetwood Mac on Tuesday during CM week. Up Market I went to the Flying Falafel (located at 1051 Market). It took me a second and I had to backtrack because I'm not a local, but I eventually found this tiny, hole in the wall joint.\n\nDon't let the size fool you; this place is the jam, you guys.\n\nHow it works: Order on the right (get in line, buster) via a self-serve terminal, pickup on the left. Don't forget to give 'em a name for the order!\n\nThe spicy falafel was incredible - so much so that I wish I had extra stomachs like a cow to be able to eat more of it - and the banana milkshake was also on point... what was in there, garam masala? \n\nAnyways, go. It's great. Really great. I'd go back if I could.", "rating": 5, "date": "2015-07-28"}, {"excerpts": ["For only $11.96, I grabbed the combo #2 which consisted of a sizable Falafel pocket with a banana milkshake. "], "author": "Delante B.", "review": "I've been in San Francisco for a week for work and have eaten some of the most expensive food, but this was the best meal I have had, hands down! For only $11.96, I grabbed the combo #2 which consisted of a sizable Falafel pocket with a banana milkshake. The spices, vegetables, and sauces combined with the falafel on a warm and soft pita  was absolute heaven.\n\nCould my senses have been magnified because I was really hungry? Yes...but I know a good chemistry of spices and sauces when I get them. And, these people are chemist. Now, because of the Yelp reviews, I passed on eating inside their restaurant, so I took the liberty of getting it delivered to my hotel. Hence, why I am able to write this review directly after crushing this mouth watering food.\n\nThey will get my business again, every time I come back to the West coast.", "rating": 5, "date": "2015-08-13"}, {"excerpts": ["I will check out their brick and mortar place to try out their vegan banana milkshake (I hope it lives up to what I imagine) and plated falafel with a friend."], "author": "S A.", "review": "Flying Falafel was one of the food vendors in VegFest. I had read stellar reviews on Yelp so I took the opportunity to check them out. \n\nAssaf was cracking jokes with the customers and volunteers. He demonstrated his great hand eye coordination skills, tossing a falafel in the air and catching it in a pita pocket with ease. He gave us samples of falafel and pita bread as we stood waiting in the long line. He also handed out business cards to anyone who wanted one. \n\nThe sandwich was a great way to start off the afternoon. You had the choices of sesame or spicy falafel or a mix of both. I went with both. The falafel were these delicious, crispy, and crunchy morsels. They came with sliced veggies and a generous amount of sauce. It was pretty good overall and filled me up. \n\nMy one gripe is one of the added veggies was too sour and bitter for my liking. I'm not exactly sure which one it was but I hope this was just a one time scenario. Vegans rejoice, the cinnamon baklava is vegan. Baklava is usually made with honey which is usually an ingredient most vegans avoid. I wasn't in the mood for dessert but I do plan on having some in the future. \n\nI will check out their brick and mortar place to try out their vegan banana milkshake (I hope it lives up to what I imagine) and plated falafel with a friend.", "rating": 4, "date": "2015-06-07"}, {"excerpts": ["We each got the flying falafel meal combo with all the fixin's and also a banana milkshake to share (with tip, it came out to be about $30 total)\n\n"], "author": "Amelia T.", "review": "My partner and I were looking for a place to eat before seeing a show at the Warfield, and Yelp brought us to The Flying Falafel. With 200+ reviews and a 5-star rating, we figured we couldn't go wrong. This is literally a hole-in-the-wall place with a simple but DELICIOUS menu. We each got the flying falafel meal combo with all the fixin's and also a banana milkshake to share (with tip, it came out to be about $30 total)\n\nThe food was -fantastic-!! I highly recommend coming here if you're looking for a relatively cheap, fast, and DELICIOUS bite to eat. Everything is vegan and organic, and gluten-free options are available (though their pita is great if you can have it). The milkshake, made with soy milk, reminded us of a banana-y horchata and was fantastic. \n\nFYI, there's no seating, just a table to lean against as you eat. We had a good time chatting it up with other customers as we all leaned against the table together. All everyone was talking about was how tasty the food was. Seriously, it's amazing.\n\nKeep up the great work, guys! We plan on coming back next time we're on Market Street. ;)", "rating": 5, "date": "2015-06-21"}, {"excerpts": ["Try the banana milkshake....you won't regret it!"], "author": "Ben C.", "review": "Best falafel I've had in the city, with the friendliest staff!\n\nI had the pocket with a mix of spicy and sesame falafel.  Everything was freshly made. The pita was freshly baked and so good! The falafels were tasty and the perfect crisp texture. Also, the portion sizes are VERY generous.\n\nTry the banana milkshake....you won't regret it!", "rating": 5, "date": "2015-04-14"}, {"excerpts": ["I will say I didn't love the banana milkshake - overload of banana and cinnamon flavors, ", "didn't jive well with my falafel. ", "But that was my bad..", "it's craziness to order a banana milkshake at a falafel stand. ", "Stick with a straight up falafel order, it won't lead you astray!"], "author": "Kati B.", "review": "I am a falafel connoisseur and this place hit the mark! The falafel was extremely well seasoned -lots of cumin flavor and spice! It was crispy without being greasy and they loaded it up with hot sauce just like I requested. And like everyone says..the pitas here are heavenly. Soft warm chewy clouds of goodness..yum. I will say I didn't love the banana milkshake - overload of banana and cinnamon flavors, didn't jive well with my falafel. But that was my bad..it's craziness to order a banana milkshake at a falafel stand. Stick with a straight up falafel order, it won't lead you astray!", "rating": 4, "date": "2015-12-14"}, {"excerpts": ["Oh and don't forgot to order the random yet delicious banana milkshake. \n\n"], "author": "Mohammed G.", "review": "Just order the falafel pita pocket with all the fix-ins... And don't ask questions. \n\nOh and don't forgot to order the random yet delicious banana milkshake. \n\nI wouldn't recommend ordering a falafel plate unless you are taking it back to work/home to eat because it's hard to eat a plate while standing up on Market street.", "rating": 4, "date": "2015-04-26"}, {"excerpts": ["I had the combo with a pocket and banana milkshake and it was magnificent. ", "Fresh ingredients and very tasty. ", "The spicy sauce is quite spicy indeed but the banana milkshake is the perfect balance for it. ", "Staff is really nice and friendly too. ", "Ordering is made on the iPad on the counter."], "author": "Lenno L.", "review": "So good! I had the combo with a pocket and banana milkshake and it was magnificent. Fresh ingredients and very tasty. The spicy sauce is quite spicy indeed but the banana milkshake is the perfect balance for it. Staff is really nice and friendly too. Ordering is made on the iPad on the counter.", "rating": 5, "date": "2015-06-06"}, {"excerpts": ["Perhaps the best falafel I've ever had (go with spicy!), and the banana milkshake was an awesome surprise!"], "author": "Cody B.", "review": "Amazing food, friendly and humble service. Perhaps the best falafel I've ever had (go with spicy!), and the banana milkshake was an awesome surprise!", "rating": 5, "date": "2015-03-07"}, {"excerpts": ["I was handed a spicy falafel ball to sample, and soon after a little cup of banana milkshake. ", "I'll be back many times!"], "author": "Jami W.", "review": "Believe the hype! Totally amazing crunchy little falafel balls stuffed into soft, fluffy, warm pita along with delicious sauces and crunchy vegetables (not just sad anemic tomatoes and watery lettuce). Everything's vegan and as soon as I walked up I was handed a spicy falafel ball to sample, and soon after a little cup of banana milkshake. I'll be back many times!", "rating": 5, "date": "2015-04-22"}, {"excerpts": ["The good: the service was really friendly, the Banana milkshake was tasty, the price is great for SF, the portions are generous and I liked the spicing.\n\n"], "author": "Sela M.", "review": "First, a disclaimer: I grew up in Israel, so I am used to higher standard of Falafel than most Americans.\n\nI came to the Flying Falafel looking for a pre-theater dinner. Given the rave reviews and reading that an Israeli runs the place, I had high expectations, but was disappointed. This falafel fails to impress me even in American standards.\n\nThe good: the service was really friendly, the Banana milkshake was tasty, the price is great for SF, the portions are generous and I liked the spicing.\n\nThe bad:\nThe pita: I've read that this place gets freshly baked Pita every morning. This should've been a huge plus in my book. Unfortunately, when I got the Pita in the evening, they used steaming to restore it's freshness. The result is a chewy, unpleasant texture. Which is a pity because it seems like it couldv'e been excellent Pita in the morning. I get less chewy texture when I defrost frozen Pitas in the microwave at home ... \n\nThe falafel balls: the spicing is good, but I didn't like the texture. It was overly dense and very oily. This seems the oil was not hot enough. Making good falafel requires a fine control of frying oil temperature. If it's too hot, the balls get brown outside while underdone inside. If it's not hot enough (as in this case), it soaks oil and gets overcooked inside. When it's just right, the outside is crispy and the inside is moist and fluffy. They definitely didn't get it right, at least when I tried it.", "rating": 3, "date": "2015-06-25"}, {"excerpts": ["Banana milkshake the only disappointment. ", "It was tasty-- but warm!"], "author": "Pennan B.", "review": "Tiny place. \nShort wait for food. \nFriendly guys behind the counter. \nDelicious spicy falafel with lots of fresh toppings. \nBanana milkshake the only disappointment. It was tasty-- but warm!", "rating": 4, "date": "2015-03-30"}], "falafel platter": [], "veggie platter": [], "hummus platter": [{"excerpts": ["My friend got a hummus platter and the assembler person threw on about 10 oz of hummus and a huge heaping piles of veggies and pitas. ", "All for cheaper than most places I've found in the city. ", "Highly recommended, especially for those with vegan/gluten free friends."], "author": "Teddy B.", "review": "All I ever really wanted from a falafel place. A lot less fanfare and pseudo fancy dishes I find elsewhere, just a quick delicious and generous pocket of falafel. You order on the touch screen at the register, and the bare bones crew[one man the second time I went] slaps the orders together with grace and ease. He even caught a few extra falafel balls in impressive fashion. If he likes you he'll layer another few falafels on with more delicious sauce and veggies. My friend got a hummus platter and the assembler person threw on about 10 oz of hummus and a huge heaping piles of veggies and pitas. All for cheaper than most places I've found in the city. Highly recommended, especially for those with vegan/gluten free friends.", "rating": 5, "date": "2016-12-20"}, {"excerpts": ["In fact, if you're looking for the single biggest vegan food bargain of market street, their $5 hummus platter is really hard to beat.  ", "That's not really a side, it's a meal in itself."], "author": "Josh B.", "review": "Flying Felafel replaced 3 Potato 4 in this tiny space on Market in some kind of vegan swaparoo.  While I liked 3Potato4 more, apparently most people didn't, and I'm happy to see that Flying Felafel is doing well, and is open later than the other place was.  There aren't actually many options for fast, healthful takeout in this neighborhood, so I patronize them a fair amount.\n\nSF seems to have two different kinds of felafel joints: ones with really good felafel balls (Sunrise Deli) and ones with good sandwich stuff (Truly Med).  Flying Felafel is the latter sort; in fact, you can get so much vegetable matter (cabbage, onions, tomatoes, pickles, cucumbers, tahini, cilantro sauce, hot sauce, beets, etc.) in your pita that they could forget the felafel and you might not notice!  \n\nThis is a good thing, because their felafel \"nuggets\" are a bit meh; the best thing I can say about them is that they're fried to order.  Their pita, though, which is homemade somewhere, is fluffy and delicious.  And, importantly, doesn't immediately fall apart with that stuffed-full sandwich.  Still I can dream of Flying Felafel's sandwiches with Sunrise Deli's felafel balls.\n\nThe various sides (dolmas, hummus, etc.) are also good.  In fact, if you're looking for the single biggest vegan food bargain of market street, their $5 hummus platter is really hard to beat.  That's not really a side, it's a meal in itself.", "rating": 4, "date": "2015-08-16"}, {"excerpts": ["I will grab a hummus platter or a plate me on my way home ", "and it'll usually last me two healthy meals. ", "Note: the storefront is about 5 feet wide/deep, so get in, order, and get out until they call you. ", "I highly suggest you take food to go. "], "author": "Nora K.", "review": "Flying Falafel is one of my favorite quick meals in the city. Everything on the menu is fresh, delicious, and the portions are generous (and under $10 in SF??? amazing!). I will grab a hummus platter or a plate me on my way home and it'll usually last me two healthy meals. Note: the storefront is about 5 feet wide/deep, so get in, order, and get out until they call you. I highly suggest you take food to go. The guys who work there are also really nice, personable guys - be sure to say hi!\n\nOne sad thing is they've recently taken Tabbouli off the menu. So just falafel, hummus, and sandwiches here.", "rating": 5, "date": "2016-03-20"}], "dolma platter": [], "hot sauce oz": [], "tahini oz": [], "amba oz": []}