{"basket of french fries": [{"excerpts": ["We split a basket of French Fries, Fried Mac 'n' Cheese (with jalepeno and bacon), BLT Slider (bacon, butter lettuce, tomatoes and smoked paprika aioli), Lamb Slider (ground lamb, caramelized onions, romesco aioli and manchego cheese), and Fried Chicken Slider (chicken breast with pickled red onion, slaw and roasted garlic aioli). ", "It was the perfect amount of food. "], "author": "Theo T.", "review": "My boyfriends and I stumbled upon this little gem while we were in the area. We needed a little food and drinks before we went out for the night and we were so happy we found this place.\n\nWe split a basket of French Fries, Fried Mac 'n' Cheese (with jalepeno and bacon), BLT Slider (bacon, butter lettuce, tomatoes and smoked paprika aioli), Lamb Slider (ground lamb, caramelized onions, romesco aioli and manchego cheese), and Fried Chicken Slider (chicken breast with pickled red onion, slaw and roasted garlic aioli). It was the perfect amount of food. We didn't go too overboard, but I think we could have gotten one more slider without feeling overly full.\n\nThey also had a good variety of beers, but everyone was ordering cheap beers in a can. I guess that's their special. The only problem that I had was that you had to order the food at the bar, but it was hard to get there because everyone was trying to order drink and there was only 1 bartender. I think it would have been easier for everyone if they had a server.", "rating": 4, "date": "2015-11-23"}], "fried mac n cheese bites": [{"excerpts": ["After figuring out that everything needed to be ordered at the bar, we put in for an order of their fried mac n cheese bites, as well as their pork belly doughnuts. ", "Friend got a beer, while I got a glass of rose. ", "The latter? ", "Terrible idea, and not particularly enjoyable. ", "The former(s)? "], "author": "Johnny W.", "review": "*** In Short ***\n\nDive bar with tasty bites. Both food and drink must be ordered at the bar.\n\n*** In Depth ***\n\nI don't do dive bars: it's not really my thing. When I drink, I go out for fancy cocktails I can't, or am too lazy to make at home. So, you can probably guess that I wasn't at the Sycamore for the drinks - in fact, I had no idea it even was a dive! So yes, my friend and I came for their food. And yes, we may or may not have already eaten previously.\n\nAfter figuring out that everything needed to be ordered at the bar, we put in for an order of their fried mac n cheese bites, as well as their pork belly doughnuts. Friend got a beer, while I got a glass of rose. The latter? Terrible idea, and not particularly enjoyable. The former(s)? Fantastic idea, and both were super tasty.\n\n***Accessibility Info***\n\nVenue - The place was fairly crowded at the bar and beyond, so I can't speak for the venue beyond the little area up front, which accessible enough in that it had standard height tables. The bar is, of course, a high top bar, so that is what it is.\n\nBathroom - Didn't use.", "rating": 4, "date": "2015-10-28"}, {"excerpts": ["I asked for the fried mac n cheese bites and a pitcher of bottomless mimosas (they had a sign outside claiming there was bottomless mimosas as a happy hour special from 4pm-7pm. ", "We got to this establishment at 4:45pm). ", "The bartender had this dull look on his face and said, \"I am sorry we don't have bottomless mimosas today. ", "Bottomless mimosas are only for brunch and before 3pm.", "\" ", "When I told him about the sign outside stating different, he sluggishly says, \"Oh which sign? ", "I don't even know which sign you're talking about.", "\" ", "I told him, \"The one you guys have right outside the door.", "\" ", "And replies, \"Oh yeah. ", "I forgot to change the sign today.", "\" ", "This place is a joke and they need a new bartender that isn't as dumb."], "author": "Marcela S.", "review": "Right from the beginning, no one greeted us. The bartender was sloppy drunk && chatting it up with some girl. I had to reach over someone's drink to get a menu. I waited for 5 mins to finally get acknowledged by the bartender. I asked for the fried mac n cheese bites and a pitcher of bottomless mimosas (they had a sign outside claiming there was bottomless mimosas as a happy hour special from 4pm-7pm. We got to this establishment at 4:45pm). The bartender had this dull look on his face and said, \"I am sorry we don't have bottomless mimosas today. Bottomless mimosas are only for brunch and before 3pm.\" When I told him about the sign outside stating different, he sluggishly says, \"Oh which sign? I don't even know which sign you're talking about.\" I told him, \"The one you guys have right outside the door.\" And replies, \"Oh yeah. I forgot to change the sign today.\" This place is a joke and they need a new bartender that isn't as dumb.", "rating": 1, "date": "2015-11-29"}], "pan fried provolone with chimichurri and roasted garlic": [{"excerpts": ["Pan Fried Provolone with Chimichurri and Roasted Garlic ", "WHAT! ", "So great. ", "And, Housemade Seitan with Sweet and Spicy Barbeque Sauce and Pickled Slaw. ", "Fantastic."], "author": "William R.", "review": "Super service and super food. I finally got to the menu and hells yeah. Pan Fried Provolone with Chimichurri and Roasted Garlic WHAT! So great. And, Housemade Seitan with Sweet and Spicy Barbeque Sauce and Pickled Slaw. Fantastic.", "rating": 5, "date": "2012-09-04"}], "creamy queso dip": [], "creamy kale dip with housemade tortilla chips": [], "pork belly donuts with maple syrup": [], "chili roasted peanuts": [{"excerpts": ["Started off with some chili roasted peanuts, which were served hot.  ", "Nice touch! "], "author": "F. P.", "review": "This place is one of the new wave of gastropubs that have hit the city - a little divey, a little rough around the edges, a concrete patio, warped wooden floors.  But where it might skimp a bit on decor, it focuses its attention on its surprisingly good food.\n\nThe menu is simple - a couple of starters and salads but the focus is the mini sliders (beef, lamb, fried chicken or BLT) and the sandwiches (roast beef, pulled pork).\n\nStarted off with some chili roasted peanuts, which were served hot.  Nice touch! And like the little kick of (spicy) heat as well.\n\nThe roast beef was delicious with tender meat piled on a soft bread that soaked up the hearty juices.  The accompanying large cut fries were crispy but soft on the inside (just the way I like them).\n\nAlso tried the ground beef slider.  Omg, three bites of heaven, especially with the healthy pile of point reyes blue cheese.  I also heard the BLT was good.\n\nLove the unique beers on draft.  Had the rich Dog Fish Head 90 Minute IPA with its 9% alcohol content.", "rating": 4, "date": "2010-09-06"}], "brunch veggie benedict": [], "brunch smoked salmon benedict": [], "brunch country benedict": [], "brunch carnitas benedictos": [], "brunch veggie scramble": [], "brunch smoked salmon scramble": [], "brunch country scramble": [], "brunch biscuit and gravy": [], "brunch lamb burger sliders": [], "brunch ground beef sliders": [], "brunch fried egg sliders": [], "brunch breakfast chicken sliders": [], "b lite cobb": [], "hashbrown sandwich": [], "lamb burger sliders": [{"excerpts": ["oh and beer (insert silent female burp here)\n\nLamb burger sliders  - well seasoned ground lamb, caramelized onions, romesco aioli and manchego cheese - dangerously divine bites! "], "author": "Athena S.", "review": "The best $20 I spent in a very long time!\n\nA met up with a friend here after work last night- so happy we did too!\n\nWe tried the pork belly donuts, creative sliders, fries - with aioli, salad... oh and beer (insert silent female burp here)\n\nLamb burger sliders  - well seasoned ground lamb, caramelized onions, romesco aioli and manchego cheese - dangerously divine bites! I'm craving the flavor again as I type this.\n\nCozy place with character.  Local art decorates the walls.  It was pretty packed for a Tuesday night but not loud which is a plus when you're catching up with a friend.  Also noteworthy: a cool bartender who's a working owner, nice guy, super helpful when I was choosing my beer and asking him annoying customer questions :)  \n\nI'd return here soon, but please, no paparazzi or stalkers please.", "rating": 5, "date": "2010-12-01"}], "blt sliders": [{"excerpts": ["Had a chance to sample the others...burger, fried chicken breast, and yes blt sliders! ", "Just when you thought you couldn't improve a BLT sandwich, here comes the Sycamore with a BLT in miniature form.  ", "At $3 a slider, just try them all! "], "author": "Dave S.", "review": "Great new pub / gourmet sliders joint in the mission. Funky / arty atmosphere with a good selection of microbrew pints and bottles. The sliders are awesome! The other reviewers are spot on...definitely try the lamb sliders....soooo delicious. Had a chance to sample the others...burger, fried chicken breast, and yes blt sliders! Just when you thought you couldn't improve a BLT sandwich, here comes the Sycamore with a BLT in miniature form.  At $3 a slider, just try them all! Cool outdoor patio in the back too.\n\nWorth a visit! Just be careful with the neighborhood, this part of Mission street is dodgy at best. Got accosted by 2 not so friendly homeless people when leaving the pub.", "rating": 4, "date": "2010-09-09"}], "beer battered tilapia sliders": [], "chicken slider": [{"excerpts": ["The chicken slider was super decadent. ", "I loved the biscuit it was on, and I could have eaten one just on its own. ", "It was good, but I liked the ground beef better. ", "That aioli was yummy. ", "It packed a lot of flavor into that tiny burger. "], "author": "Kelsey S.", "review": "The Sycamore is fun. It's a different take on bottomless brunch. I'm used to it being a little boujee, but the Sycamore is super casual (and super affordable).\n\nOur glasses were frequently refilled, and the staff was fun and friendly. The ambiance was divey and welcoming. Great music. 80s hits. Whenever a new song came on, you'd go, \"Aw, I love this song!\"\n\nI liked not having to spend $50 on brunch. Bottomless mimosas were $12 with $10 minimum of food. We got the mix 'n match sliders: two breakfast chicken sliders, a lamb burger, and the ground beef. The chicken slider was super decadent. I loved the biscuit it was on, and I could have eaten one just on its own. It was good, but I liked the ground beef better. That aioli was yummy. It packed a lot of flavor into that tiny burger. My date preferred his lamb burger to the chicken.\n\nFries were yummy. Cheap(ish) meal was filling. I'd go back again.", "rating": 5, "date": "2017-11-28"}, {"excerpts": ["I also ordered the fried chicken slider which needed more sauce as it was over cooked and dry. ", "The only highlight of my visit was that the mac and cheese balls are still as tasty as I remember them, but with all of the other dishes I tried being lackluster there isn't a reason for me to go back anymore."], "author": "Christine L.", "review": "I used to love this place. Fast forward 4 years and this place is now kinda \"meh\". The sliders are small and dry. I ordered the battered fish which was so thickly battered the actual fish was under cooked. I also ordered the fried chicken slider which needed more sauce as it was over cooked and dry. The only highlight of my visit was that the mac and cheese balls are still as tasty as I remember them, but with all of the other dishes I tried being lackluster there isn't a reason for me to go back anymore.", "rating": 3, "date": "2017-04-25"}, {"excerpts": ["We split a basket of French Fries, Fried Mac 'n' Cheese (with jalepeno and bacon), BLT Slider (bacon, butter lettuce, tomatoes and smoked paprika aioli), Lamb Slider (ground lamb, caramelized onions, romesco aioli and manchego cheese), and Fried Chicken Slider (chicken breast with pickled red onion, slaw and roasted garlic aioli). ", "It was the perfect amount of food. "], "author": "Theo T.", "review": "My boyfriends and I stumbled upon this little gem while we were in the area. We needed a little food and drinks before we went out for the night and we were so happy we found this place.\n\nWe split a basket of French Fries, Fried Mac 'n' Cheese (with jalepeno and bacon), BLT Slider (bacon, butter lettuce, tomatoes and smoked paprika aioli), Lamb Slider (ground lamb, caramelized onions, romesco aioli and manchego cheese), and Fried Chicken Slider (chicken breast with pickled red onion, slaw and roasted garlic aioli). It was the perfect amount of food. We didn't go too overboard, but I think we could have gotten one more slider without feeling overly full.\n\nThey also had a good variety of beers, but everyone was ordering cheap beers in a can. I guess that's their special. The only problem that I had was that you had to order the food at the bar, but it was hard to get there because everyone was trying to order drink and there was only 1 bartender. I think it would have been easier for everyone if they had a server.", "rating": 4, "date": "2015-11-23"}, {"excerpts": ["Breakfast Chicken Slider - Chicken was nice and crispy, but my friends kept telling me how salty it was! ", "Maybe I was a tad buzzed, but I didn't believe them until I kept eating it. "], "author": "Matthew D.", "review": "Had the opportunity to drown myself with bottomless mimosas this weekend! \n\nThis place is tiny and always packed. In the front of the restaurant are a few tables, but there is an outdoor space that has much more seating. I would recommend coming with a part of 6 or less. I had 6 and it was more than difficult to find seating. One thing I liked about The Sycamore is that you order at the bar and just go find a seat, which means you don't have to worry about splitting the check with frands or family. \n\nBottomless Mimosas are 14 dollars (w/ purchase of an entree that is $8 or more). I would have to say that it was worth it since they were always quick to fill our cups. The food on the other hand was mediocre at best. Here are my thoughts! \n\nBreakfast Chicken Slider - Chicken was nice and crispy, but my friends kept telling me how salty it was! Maybe I was a tad buzzed, but I didn't believe them until I kept eating it. I am hoping it was just the batch they had made.\n\nFried Egg Slider - Same as the breakfast chicken, the biscuit for this was way too salty. The egg yolk was nice and runny though. If it weren't for the biscuit, they paired nicely with the mimosas. \n\nBiscuit & Gravy - Very heavy and thick! I think if you want something filling, this would be a good option to get as well. Nothing too special, but of course the mimosas made it decent.\n\nOverall, this place is a great option to get bottomless mimosas. Being in cramp spaces isn't the best feeling, but hey.. we are in SF, what do you expect? The waiters are fast with the mimosas and its a great place to just enjoy and catch up with friends. Definitely try it out!", "rating": 3, "date": "2017-01-16"}, {"excerpts": ["Pork belly donuts = little death bombs\nFried chicken slider = dry & tasteless (no, ", "the gobbly gook of mayo-looking gravy did not help)\nPulled pork sandwich = ", "finger-licking enough\n", "Lamb slider ", "= delicious & tasty\nBottomless mimosas = absolutely YES!"], "author": "Peg S.", "review": "BRUNCH RUNDOWN:\n\nPork belly donuts = little death bombs\nFried chicken slider = dry & tasteless (no, the gobbly gook of mayo-looking gravy did not help)\nPulled pork sandwich = finger-licking enough\nLamb slider = delicious & tasty\nBottomless mimosas = absolutely YES!", "rating": 3, "date": "2013-01-18"}, {"excerpts": ["All the food we got was fantastic, I can personally recommend the breakfast chicken slider, the fried egg slider, the potatoes, and the bottomless mimosas! ", "The service was excellent - from the ladies that took our orders inside to the gentleman that never let our bottomless mimosas hit the bottom. ", "Get there early, we got there around 11:30 on a Sunday and the place was already packed! "], "author": "Emily H.", "review": "Came in for brunch this last Sunday with a group of friends and had an excellent time. \n\nAll the food we got was fantastic, I can personally recommend the breakfast chicken slider, the fried egg slider, the potatoes, and the bottomless mimosas! The service was excellent - from the ladies that took our orders inside to the gentleman that never let our bottomless mimosas hit the bottom. Get there early, we got there around 11:30 on a Sunday and the place was already packed! They also have games you can play while you're eating and drinking, lots of fun! \n\nReally had an awesome time and will be going back sometime soon!", "rating": 5, "date": "2016-01-04"}, {"excerpts": ["Chicken slider was probably the best thing we had. "], "author": "Aren A.", "review": "Nutshell: Food is so-so. Service is lacking. \n\nChicken slider was probably the best thing we had. Fries were pretty tasty. \n\nPork belly donuts were laughable. \n\nBartenders don't have the greatest of attitudes. Sure, you have a line full of thirsty patrons, but that doesn't mean you have to be rude to clients because of it. \n\nIt's obvious the Sycamore couldn't care less about return customers. \n\nNo sweat off either of our backs, I suppose. \n\nMakes me want to wear a pair of Google Glasses just to visit the place.....if I could actually afford them.", "rating": 2, "date": "2014-03-28"}, {"excerpts": ["http://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=VaPWSfbhQor-t152CuJdCg\n\nFRIED CHICKEN SLIDER:\n"], "author": "Cin T.", "review": "You had me at \"Pork Belly Donuts\"..... with Makers Mark Glaze.\nI knew my stomach and I were gonna pay dearly for it later, but I didn't care. I wanted to try it, I made it a mission to check this place out before I left SF. \n\nThis local Mission bar is the perfect place for casual date nights, hanging out with friends or if you just want to come by to get some work done on your laptop. Whether you're an 8-5 office geek, hipster or a marathon biker (there were two dudes fully decked out in their gears & helmets dining)- the staff will warmly welcome you with a smile & a pint of beer. \n\nFRANZISKANER HEFE WEISSE ($5): \nNice citrusy finish (I didn't even have to use the lemon like I normally do with most hefes). You can taste the bananas & cloves in this pint of deliciousness!\nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=pS0P1y4KSDdy8qoS4mQH-w\n\nThe decor of this bar gives off a rocker-ish vibe with it's brightly painted red walls, black furnitures and black & white framed artworks. There's a classy, yet comfortable & unpretentious vibe to this place. \n\nTheir back patio is the area to be. There's a very cool framed artwork on their wall, complete with a flowing waterfall. The owners used picnic tables and tree stump stools to keep with the whole \"sycamore\" theme. \n\nI particularly like the mini private area, located on your left as you enter the back patio. Come early if you wanna snag this spot for your friends.\nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=NHn3S3epnO2XrugTVKa6dQ\n\nPORK BELLY DONUTS w/MAKERS MARK GLAZE ($4 for 3 donuts):\nIt sounded like a good idea, but the execution & flavors fell short.  \n\nThe beer-braised pork belly just tasted like plain pork belly, no seasonings and I'm missing the salt.\n\nThe beer batter donut was thin, yet it got soggy & greasy REALLY fast. The combination of the greasy batter combined with the melt-in-your mouth pork fat makes every bite heart-clogging & rich. After the first donut, I ate the rest sans the dough. \n\nI didn't get any bourbon taste from the glaze. Just tasted like plain maple syrup.\nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=VdfAmms0ZEqmjilgDWQjMw\n\nInside shot of the Pork Belly Donuts. Fat, fat & more fat!!\nThis one's for you, Cesar R!!\nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=-HqPnP3O0zIVjuYORKc_mA\n\nSLIDERS ($3.50 each slider, add fries for extra $1):\nThis was the best part of our meal. My only complaint was its choice of dinner rolls used for the buns. It wasn't toasted on the outside & was sort of dry.\n\nWe got one of each to sample: ground beef, lamb burger, fried chicken & fried catfish.\nSo stinkin' cute & tastes delicious! \nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=4qQHRWbH5CP3szyETuzSAQ\n\nBEEF SLIDER:\nThe ground beef is cooked to the right temperature. The roasted garlic aioli wasn't overpowering and provided the right amount of moisture to the bun. The sweet caramelized onions and blue cheese complimented each other really well, and helped bring out the sweetness in the beef. Very juicy, very flavorful.\n\nLAMB BURGER:\nJust as flavorful and juicy as the beef burger. \nThe manchego cheese compliments the lamb very well, there was a peppery bite to it, which I liked very much. The romesco sauce was rather weak & watery. I didn't get the nutty-garlicky tomato flavors much, even though there was a large chunk of tomato on my burger.\nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=RyqdcI-CfydcAoth5rFmKQ\n\nFRIED CHICKEN BREAST & FRIED COD FISH sliders ($3.50 each):\nOut of all the fried items, the Fried Chicken Breast Slider was my favorite and the Fried Cod Fish slider was a close 2nd. Yep, pork belly donuts was last....  \nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=VaPWSfbhQor-t152CuJdCg\n\nFRIED CHICKEN SLIDER:\nAt 1st glance, the chicken looks thin & dry but that all goes away when you bite into it. The chicken is crunchy (not at all greasy) and seasoned well. I could eat a few pieces of this without its other components. \n\nThe menu said there was pickled red onions & cole slaw. All we got on ours was a bunch of lettuce and a garlic aioli. Np, since i was willing to eat the tasty chicken all by itself.\nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=fzpEmD3AY9JScn_cfqKKbQ\n\nFRIED COD SLIDER:\nThe menu & bartender said \"catfish\" but it was cod. It looked & tasted like cod. I hate catfish, it tastes like dirt to me.... and this fish burger didn't taste like catfish. \n\nSame batter used for the pork donuts = soggy greasy mess. Served w/sriracha aioli & house pickles. I wouldn't order this again.\nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=04IjHZSVKbLfZ88ScE2VOw\n\nCAPRESE SALAD w/basil vinaigrette ($7): \nWe got one healthy item, lol. \nThe mild, soft Bocconcini mozzarella really absorbed the flavors of the tasty vinaigrette. YUM!\nhttp://www.yelp.com/biz_photos/wNcShx5YTSMvOxt6G0iA9w?select=po53QH5RYXfOe4i4Bj36Gw", "rating": 4, "date": "2011-10-30"}, {"excerpts": ["The servers made sure our glasses were always full..plus they use Odwalla orange juice (with lots of pulp!)  which made it better (in my opinion, at least)\n\nSince people have been raving about their pork belly donuts, we decided to get that, plus the breakfast chicken slider,  bacon/egg slider and the country omelet.\n", "The chicken slider was tasteless...", "even WITH the gravy. ", "There was nothing special about the bacon/egg slider and the country omelet.   ", "I was hoping for a bigger serving (or yummier food).  ", "The pork belly donuts (I didn't have this ", "but my husband did) were ok though.  "], "author": "Anj K.", "review": "Came here to have their bottomless mimosa during brunch...I guess I could say it was the best part of our meal.  At $12, it was a very good deal...  The servers made sure our glasses were always full..plus they use Odwalla orange juice (with lots of pulp!)  which made it better (in my opinion, at least)\n\nSince people have been raving about their pork belly donuts, we decided to get that, plus the breakfast chicken slider,  bacon/egg slider and the country omelet.\nI was a disappointed with the overall taste and food portions.  The chicken slider was tasteless...even WITH the gravy. There was nothing special about the bacon/egg slider and the country omelet.   I was hoping for a bigger serving (or yummier food).  The pork belly donuts (I didn't have this but my husband did) were ok though.  He found them nice and tender - but nothing to crow about.\n\nThis was a cozy little spot with comfortable bench seating (although the cushions were dirty), and a huge patio in the back. The staff was attentive and friendly.   However, I am not coming back here for brunch.", "rating": 2, "date": "2012-10-09"}, {"excerpts": ["My favorite dish\nPan fried provolone: interesting concept, like eating a miniature pizza\nCatfish slider, lamb slider: meh\nFried chicken slider: the best out of the 3! \n", "Grilled cheese: "], "author": "Vivian D.", "review": "Small dive bar with only a few tables inside. Food and drinks need to be ordered and paid for at the bar, but have no fear the one bartender they have literally does it all! They have some interesting beers, wines, and sangrias to choose from for whatever your heart desires. A plethora of boardgames are available for your pleasure, although majority of them look like they're at least 10 years old. \n\nWe ordered:\n\nPork belly donuts: i could have done without the thick sweet batter, not sure why everyone and their mamas raved about this\nFrench fries: nothing special, we were starving so we still gobbled them up\nFried mac n cheese: party in your mouth!! My favorite dish\nPan fried provolone: interesting concept, like eating a miniature pizza\nCatfish slider, lamb slider: meh\nFried chicken slider: the best out of the 3! \nGrilled cheese: nothing special, came with MORE fries, oops\n\nWe absentmindedly ordered tons of fried foods and In terms of gastropubs, this one fell short. Not sure if the lack of parking and seating warrants another trip.", "rating": 3, "date": "2013-05-28"}, {"excerpts": ["We also ordered the fried chicken slider, the fried egg slider and the beef slider. ", "The beef slider had a garlic aioli sauce which was the best of the three, although it might just be the mayo giving the slider flavor it wouldn't otherwise have. ", "The fried chicken slider was very bland and had no real flavor. ", "It was fried with no seasoning and finished off with 2 biscuits on either end. ", "If I can say it looked like reheated frozen food, well, that was it. ", "The biscuits tasted like cardboard - very dry, breaks after a bite. ", "Uneven. ", "Very greasy. ", "Very meh.  "], "author": "Jennifer N.", "review": "If you expect decent food, service and standards, steer clear of this place. \n\nThe Sycamore is literally a dump. This place reeks of filth, with dirty floors, no ventilation, and in a shoebox of a location. I wouldn't even go as far to say this is a restaurant because it looks and feels like the opposite of one. I felt like I was breathing in asbestos and mold. \n\nThe pork belly donuts are good but not great. Unfortunately, I ate salt balls in every. single. bite. The sweet maple (obviously) did not balance out the sodium clad balls . The pork was bland. The tempura batter is okay and has a chew but nothing impressive. The overall taste did not entice my taste buds. I felt that it was on the lower end of mediocre at best and not really creative in the realm of the Mission food scene.\n\nWe also ordered the fried chicken slider, the fried egg slider and the beef slider. The beef slider had a garlic aioli sauce which was the best of the three, although it might just be the mayo giving the slider flavor it wouldn't otherwise have. The fried chicken slider was very bland and had no real flavor. It was fried with no seasoning and finished off with 2 biscuits on either end. If I can say it looked like reheated frozen food, well, that was it. The biscuits tasted like cardboard - very dry, breaks after a bite. Uneven. Very greasy. Very meh.  The best part were the fries because you can't really mess that up.  \n\nThe worst thing was actually waiting for everything. We came at 11:04 on a Saturday morning. The place wasn't even half full yet. Food doesn't arrive until after 12:30. About 30 minutes in, I asked about my order and they said they were having problems with their oven and the biscuits were taking more time to be made. Ok fine. Wouldn't it be better practice to tell us that? She proceeded to ask if I wanted slider buns instead of the biscuits, so I said yes. It didn't come out any faster. At around 12, they shouted out to everyone in the dining room, \"the oven's working, woo hoo!\". Classy? No. To add more fuel to the fire, there were other people who came in later than us that received their food on time. It wasn't just eggs. It was the same things we ordered. It was just that ridiculous! We were about to leave but out comes our order and it was prepared in such a haste that the cheeses were still cold and not melted. \n\nService was decent. Mostly everything is self service so you get your own water, or coffee. You pay first after you order from the counter. Find your own seat. I think the waitress saw how upset we were and offered us both complimentary mimosas, which were good but not great. I've definitely had better. It's not worth the $12 price even for bottomless. The orange juice is all opened in the back counter and it looks  very unsanitary. The pitchers were also not covered. When our sliders finally came, the waitress came and comped our sliders for the wait. That was good customer service on her part and I appreciate the gesture.  \n\nTo sum it up, I would not recommend this place for the reasons above. I didn't feel like this place lives up to its ratings on Yelp.", "rating": 1, "date": "2014-02-17"}, {"excerpts": ["The Breakfast Chicken slider was my favorite, but the Fried Egg option was a good option for standard fare.\n\n"], "author": "Anand J.", "review": "Cannot express fully in words how perfect this brunch was given the circumstances. I was in SF for the Treasure Island music festival and we were hankering for a solid brunch option before heading to the 1st day of the festival.\n\nThe sliders were all tremendous. The Breakfast Chicken slider was my favorite, but the Fried Egg option was a good option for standard fare.\n\nThe Pork Belly \"Donuts\" were outstanding. As I sat basking in the sunshine on a rare October day, I took a bite out of said donuts. It was a revelation. A cosmic reaction was occurring in my mouth and I didn't give a damn what happened next. Seriously, these donuts were incredible. Never had anything like it before. A must order.\n\nTo top it off, the bottomless mimosa deal was as advertised. Not only was the orange juice fresh, the staff took \"bottomless\" to heart. Not once did I have an empty glass. It was glorious.", "rating": 5, "date": "2014-02-03"}, {"excerpts": ["The sliders here are delicious, especially the fried chicken slider and the lamb burger slider. ", "Each slider is packed with flavor and each comes with a reasonable portion of meat in addition to various condiments including different types of aioli sauces and cheese. ", "The beef and lamb patties are cooked medium so the meat literally melts in your mouth. ", "Additionally, you've got to try the pork belly doughnuts here! ", "They are literally what they sound like - slices of savory pork belly battered up and deep fried and then covered with a sweet maple and bourbon glaze that complements the savory meat incredibly. "], "author": "Cheston W.", "review": "Oh man, the food here is phenomenal. The Sycamore has some quality fried and savory goodness that will surely complement one of the many beers on tap that they offer here. I'd say the food is enough to make me come back! Aside from the food, the staff here is great and the place has a more divey/gastropub-isque feel to it with its crowd, beer and wine selection, and food selection, in addition to the presence of dogs. What's great is that there's also an outdoor patio (that I have yet to check out for myself).\n\nThe sliders here are delicious, especially the fried chicken slider and the lamb burger slider. Each slider is packed with flavor and each comes with a reasonable portion of meat in addition to various condiments including different types of aioli sauces and cheese. The beef and lamb patties are cooked medium so the meat literally melts in your mouth. Additionally, you've got to try the pork belly doughnuts here! They are literally what they sound like - slices of savory pork belly battered up and deep fried and then covered with a sweet maple and bourbon glaze that complements the savory meat incredibly. The doughnuts and the sliders are a must!\n\nAnyone with the drunchies here will not be disappointed. Perhaps this place will eventually lead me to giving it five stars once I've checked out the patio, brunch and lunch specials, in addition to board games available to customers. All in all, a great place with great food. I'll be back.", "rating": 4, "date": "2013-09-11"}, {"excerpts": ["- breakfast chicken slider: fried chicken with country gravy on buttermilk biscuits. ", "Are you drooling yet? ", "Perfect with mimosas as the \"brunch\" part of the meal.\n", "- lamb burger slider: this one was really strong and heavy. ", "I really like lamb! ", "Included caramelized onions, aioli, and cheese\n- ground beef slider: so good! ", "Had roasted garlic aioli, caramelized onions, blue cheese. ", "I think I liked this one ", "the best\n- side of potatoes: made breakfast style. ", "It tasted super good with the country gravy from the breakfast chicken slider! \n\n"], "author": "Erin H.", "review": "SF is where it's at for bottomless mimosa brunches!! The Sycamore is a nice little cafe/bar thang with tons of boardgames! bwahahhaha\n\nMy friend and I got a table right by the entrance, which was perfect to catch the breezes. So, you go up to the bar to order and they will bring your food to your table. There was a minimum order for the bottomless mimosas, so we indulged in:\n\n- pork belly \"donuts\": they were literally little glazed donuts with pieces of pork belly inside. They were fresh out of the oven or wtver, and they were freaking delicious! A perfect combination of sweet and salty!\n- breakfast chicken slider: fried chicken with country gravy on buttermilk biscuits. Are you drooling yet? Perfect with mimosas as the \"brunch\" part of the meal.\n- lamb burger slider: this one was really strong and heavy. I really like lamb! Included caramelized onions, aioli, and cheese\n- ground beef slider: so good! Had roasted garlic aioli, caramelized onions, blue cheese. I think I liked this one the best\n- side of potatoes: made breakfast style. It tasted super good with the country gravy from the breakfast chicken slider! \n\nWe must have had like at least 6 glasses each and played a couple board games. I'm never sure if mimosa brunches are a good idea cuz day drinking just results in really full tummies and mild headaches by the afternoon. Oh well! I had a great time here!", "rating": 5, "date": "2012-08-23"}, {"excerpts": ["I would definitely order this again, but share it - it can get a little on the greasy side for one person to handle\n\nBreakfast Chicken Slider - THIS "], "author": "Gelene V.", "review": "Sycamore is definitely a little different than your typical brunch sit-down. In the back is a really nice and relaxing outdoor seating area. We came in on a sunny San Francisco Sunday morning, and decided to sit outside. My friend and I weren't extremely hungry, and decided to order some of the more well known items from the brunch menu.  \n\nPork Belly Donuts - It was a mix between sweet and savory that hit my taste buds all a little too weirdly. However, I can't say I hated it because I really didn't. But I do wish that they put a little less sea salt on the top, since that definitely put my mouth on salt-overload. I would definitely order this again, but share it - it can get a little on the greasy side for one person to handle\n\nBreakfast Chicken Slider - THIS WAS DELICIOUS. I think what made this so good was the gravy they had on the slider to accompany the fried chicken and bread. If you come here, be sure to order this, the other yelper definitely didn't recommend wrongly!\n\nChicken & Waffle - I never settled on the idea of chicken & waffles before, but since my palette was already introduced to the sweet & savory experience from the pork belly donuts, I was not hesitant on trying the chicken & waffle. I don't regret trying it either, it was really good! But since I really have nothing to compare it to, I can't give it too much of a review except that it's tasty. Perhaps this will lead me towards trying more chicken and waffle restaurants.. \n\nThe waitresses are super friendly here, and they don't lie about bottomless mimosas. Your glass is NEVER empty. \n\nParking was a little of a pain, but if you're patient enough and willing to walk a few blocks, its not so bad.", "rating": 4, "date": "2012-08-23"}, {"excerpts": ["And the bottomless mimosas during weekend brunch don't hurt the experience either! =0)\n\nBREAKFAST CHICKEN SLIDER = OMG! "], "author": "Victor C.", "review": "Ate here Nov. 3, 2012.\n\nWhat makes this place really unique and cool is the ambiance and vibe! It's a true reflection of San Francisco hipster subculture! And the bottomless mimosas during weekend brunch don't hurt the experience either! =0)\n\nBREAKFAST CHICKEN SLIDER = OMG! I just died and went to heaven good!! 5 stars!! Think of this item as a variation of Chicken & Waffles! Must order this!\n\nCOUNTRY OMELETTE = Mediocre. Nothing special! 3.5 stars!!\n\nBOTTOMLESS MIMOSAS = The reason why I came here!!!  5 stars!!!\n\nThe wait staff gets 5 stars b/c they are attentive and cool as hell!\n\nThe only negative thing I have to say about this place and keeps this place from getting 5 stars in all is the flies buzzing around the back patio! I hate flies when I eat! It's not the most appetizing experience. Anytime else I don't mind but not when I'm sitting down and eating! Do you feel that way too about flies when you eat?", "rating": 4, "date": "2013-01-28"}, {"excerpts": ["The fried chicken slider was my favorite, although the BLT with heirloom tomato was nothing to scoff at either. "], "author": "Pants P.", "review": "Slid into a table out back with friends and then sent some sliders sliding into mah belly. \n\nThe fried chicken slider was my favorite, although the BLT with heirloom tomato was nothing to scoff at either. Thought the catfish slider was a bit greasy.\n\nLiked the vibe out back: no wait, super casual and they had The Good, The Bad, and The Ugly projecting onto the wall behind us.\n\nIf you find your self slip-sliding around the neighborhood with an empty tummy, you'll find heading here won't be a slip-up.", "rating": 4, "date": "2011-10-22"}, {"excerpts": ["- Fried Chicken Slider\n\n"], "author": "Christine C.", "review": "We came here yesterday after spending hours at Dolores Park. We were starving and went here upon recommendation.\n\nThere was hardly anyone when we arrived, which was great because we practically had the whole front room to ourselves:\n\nThe Sliders we ordered were (drum roll, please):\n\n- Catfish Slider\n- Beef Slider\n- Lamb Slider\n- Fried Chicken Slider\n\nI honestly can't tell you which one was my favorite, as they each were absolutely delicious. \n\nAdd these sliders in with a Crispin Cider and a game of Scrabble (courtesy of The Sycamore), and we had the perfect Labor Day! I'd definitely come here again with friends.", "rating": 5, "date": "2011-09-06"}, {"excerpts": ["We got the beer battered fish, beef, lamb, and the fried chicken slider.\n\n "], "author": "David L.", "review": "i thought it was alright bro, i got the pork belly donuts, and the four sliders. sliders 3:50 and i got 1dollar side of fries, pork belly 3 for 4 dollars. It was pretty expensive for the amount of food. I just wanted to try it so i ate with my cousin. I think half a slider you dont get the full amount of flavor. We got the beer battered fish, beef, lamb, and the fried chicken slider.\n\n I thought the lamb was the best, tasted really good, you can taste the meat, i like the burgers though, it was like oozing oil lol, i liked that. the fries were pretty good, really crispy. the fried chicken had sour cabbages i think masked the flavor. beef like had no sauce bro, was my least favorite. my cousin liked the beer batted fish the best. It was pretty cool, friendly pretty blonde waiter ^^, and there were board games on a shelf, like A LOT of games to play with lol. i lost to my cousin on Othello,\n\n The pork belly donuts, was alright, like the outer golden crisper sweetness was good, but i didn't know pork belly was just what i eat all the thing, cause i'm chinese i eat what we call 5 layer pork meat. tasted and looked exactly like it, but one of them had  way more meat. overall it was a good experience, like i wanna try new food in life, i thought it was alright. sliders too small for me bro", "rating": 3, "date": "2011-12-28"}, {"excerpts": ["We ordered the breakfast chicken slider, fried egg slider, lamb burger slider, chicken and waffles, and pork belly donuts. ", "The food was good for the price, the portions were somewhat small, but ok for the price. ", "You have to order everything at the bar, including food. ", "They were taking a long time to come around with more mimosas ", "so I went to the bar to get more, considering everything is ordered at the bar ", "I thought this would be ok. ", "The sever rudely said to me, \"you know what if you would just have a seat she'll come around ", "she has a lot of people to serve\". ", "I wish I could say this was the only person that was rude ", "but the entire staff were not friendly. ", "Maybe locals are use to this kind of service from this establishment. ", "The seating is also very awkward. ", "If you're visiting San Francisco choose another restaurant if you're looking for bottomless mimosas, it will be worth it to pay a little more."], "author": "Treva D.", "review": "I'm sure there are other places you can go in San Francisco that have bottomless mimosas with decent food and better service. My friends and I are visiting San Francisco and were told this place is good for bottomless mimosa brunch. While the price for bottomless mimosas is good, $14 with $8 food order, the rude service is just not worth it. We ordered the breakfast chicken slider, fried egg slider, lamb burger slider, chicken and waffles, and pork belly donuts. The food was good for the price, the portions were somewhat small, but ok for the price. You have to order everything at the bar, including food. They were taking a long time to come around with more mimosas so I went to the bar to get more, considering everything is ordered at the bar I thought this would be ok. The sever rudely said to me, \"you know what if you would just have a seat she'll come around she has a lot of people to serve\". I wish I could say this was the only person that was rude but the entire staff were not friendly. Maybe locals are use to this kind of service from this establishment. The seating is also very awkward. If you're visiting San Francisco choose another restaurant if you're looking for bottomless mimosas, it will be worth it to pay a little more.", "rating": 1, "date": "2016-11-05"}, {"excerpts": ["There's no rich mayo in the slaw in the fried chicken slider. ", "My favorite is the lamb slider. ", "Juicy, tender and full of flavor! ", "My coworker said the classic beef and the BLT were both great too. ", "Will definitely go back."], "author": "Cheryl X.", "review": "Went there for lunch with a coworker after reading the reviews. The sycamore have the best sliders with a very reasonable price. Each of us had 3 different sliders. The tilapia and the fried chicken ones I got were great. There's no rich mayo in the slaw in the fried chicken slider. My favorite is the lamb slider. Juicy, tender and full of flavor! My coworker said the classic beef and the BLT were both great too. Will definitely go back.", "rating": 5, "date": "2014-05-24"}, {"excerpts": ["I had the fried chicken slider and the beer-battered rock cod slider, each of which was a wondrous three bites. ", "The rock cod was unfortunately bland after the flavor-packed pork belly donuts and fried chicken--I'll make a note to devour this first next time. "], "author": "Liz T.", "review": "This bar claims to be \"Your new favorite bar in the Mission.\" This is a bold statement. Thank goodness it's true--for me, anyway.\n\nUntil now I've only BARTed to the Mission for Mexican food (http://www.yelp.com/bi...) and maple glazed bacon apple donuts (http://www.yelp.com/bi...). Now I have another reason and it's more than just a tree.\n\nAt the moment I'm writing this the Sycamore has 24 beers: 8 on tap, 12 bottled, and 4 canned. While the Sycamore has far fewer  beers than the Monk's Kettle (http://www.yelp.com/bi...), the beers are cheaper, food better, and wi-fi available. What more could a thirsty, hungry, e-mail-fixated person want?\n\nMy friend Amber L. and I had the pork belly donuts, which were greasy spoon turned into god's spoon with the maple Makers Mark glaze. Why are they so savory, sweet, and scrumptious, yet so small? I could eat about nine of these before my pores have an oil spill.\n\nThe sliders are also worth writing about. All four were winners. I had the fried chicken slider and the beer-battered rock cod slider, each of which was a wondrous three bites. The rock cod was unfortunately bland after the flavor-packed pork belly donuts and fried chicken--I'll make a note to devour this first next time. Amber L. really liked both the lamb and beef sliders. \n\nI'll be back for in the Mission soon for (Syca)more. Love gastropubs!", "rating": 4, "date": "2011-02-13"}, {"excerpts": ["I'm from the south, so chicken and waffles and my chicken slider tasted like home. ", "The bottomless deal is great also.  ", "You should come join the fun!"], "author": "Evan R.", "review": "The food was great! I'm from the south, so chicken and waffles and my chicken slider tasted like home. The bottomless deal is great also.  You should come join the fun!", "rating": 5, "date": "2013-09-17"}, {"excerpts": ["I had a fried chicken slider and lamb slider.  ", "The fried chicken slider was wonderful!  ", "I wasn't big on the lamb slider, but I think I just wasn't really in the mood for lamb meat.  ", "I don't remember anything distinct about the fries, but they were fine.  ", "I'll definitely be back to try more sliders and sandwiches."], "author": "Angela R.", "review": "First of all, I love the atmosphere - it's got a bit of a divey feel, they have board games and I'm looking forward to checking out trivia night.\n\nNow, for the food.  Sliders, mmmmmm...I had a fried chicken slider and lamb slider.  The fried chicken slider was wonderful!  I wasn't big on the lamb slider, but I think I just wasn't really in the mood for lamb meat.  I don't remember anything distinct about the fries, but they were fine.  I'll definitely be back to try more sliders and sandwiches.", "rating": 4, "date": "2011-12-20"}, {"excerpts": ["The fried chicken slider was good because just about any fried chicken is good, though again I wanted more acid (check out the sandwich with jalapeno coleslaw at Bakesale Betty's!!!).  "], "author": "Aimee B.", "review": "I was impressed with Sycamore weeks before ever setting foot inside, after reading about their pork belly donuts with maker's mark maple glaze.  \n\nWe were greeted by a friendly bartender/server----you're supposed to order at the bar, but it was a little slow and so it was very nice of her to come over.  Yay for a nice selection of beers---tap, bottle, and can!\n\nOf course we had to order the donuts.  They were divine---perfectly fried dough around a flavorful chunk of my favorite animal (to eat), topped with a sweet boozy drizzle.\n\nMister B and I both thought the fried provolone with chimichurri and roasted garlic was a great combo, though you need to have all three flavors for together in each bite for real balance.  I found myself wanting something to lighten the overall flavor up a little.\n\nThe butter lettuce with peaches and strawberries, goat cheese and chives with a tarragon vinaigrette was a perfect combo of creamy and tart, herbal and fruity.  \n\nThe fried chicken slider was good because just about any fried chicken is good, though again I wanted more acid (check out the sandwich with jalapeno coleslaw at Bakesale Betty's!!!).  Mister B really dug his spiced lamb slider, and we both thought the fries were aight.\n\nI also fell in love with the eclectic and really cool selections on the jukebox.  To top it all off, our bill was super-cheap and we were stuffed to the gills.  \n\nI can't wait to come back and play some music or hang out in the back patio on a sunny day.", "rating": 5, "date": "2010-09-07"}, {"excerpts": ["I occasionally daydream about their fried chicken slider.  ", "It is amazing.  ", "What is even more amazing is that they make a fried chicken and gravy slider with a biscuit on the weekends!!  ", "It is so  damn good ", "I can eat it when I am not hungry.  "], "author": "Liz R.", "review": "I thought I would update as this place has been there for a while and settled in.  So far, I have eaten lots of dinners a few lunches and a couple of stellar brunches at the Sycamore.  I occasionally daydream about their fried chicken slider.  It is amazing.  What is even more amazing is that they make a fried chicken and gravy slider with a biscuit on the weekends!!  It is so  damn good I can eat it when I am not hungry.  The brunch dishes are a pile of food, so its hard to get sides like the chicken biscuit slider, but you really have to do it.  \n\nThe scene there is chill and welcoming, whether its busy or not.  I particularly like that their clientele is interesting and varied.  I have had some great conversation in the place.  It can be very loud, but I don't mind a loud bar, especially when the music selection on the jukebox is so cool.  I love the fact that they obviously picked all the music, so it really reflects the tastes of the people who work there.   \n\nOh, and a secret patio in the heart of the Mission.  If they served cocktails, I would probably never leave.", "rating": 5, "date": "2011-02-04"}, {"excerpts": ["Had the super amazing mushroom appetizer, as well as the chicken slider and the fish slider. ", "Not my most shining moment as far as healthy food goes, but it was all very delicious ", "and I didn't regret it (for too long anyway) \n", "The delicious Poppy Jasper was on tap, and their entire beer selection rotates frequently. \n", "Love the ambiance too, felt warm and cozy and just punk enough. ", "Tonight is their first quiz night, so will have to check that out sometime!"], "author": "Lisa Marie G.", "review": "New favorite! We'll definitely become regulars soon enough, especially now that Monk's Kettle has doubled their prices and shrunken their portions. But I digress...\nHad the super amazing mushroom appetizer, as well as the chicken slider and the fish slider. Not my most shining moment as far as healthy food goes, but it was all very delicious and I didn't regret it (for too long anyway) \nThe delicious Poppy Jasper was on tap, and their entire beer selection rotates frequently. \nLove the ambiance too, felt warm and cozy and just punk enough. Tonight is their first quiz night, so will have to check that out sometime!", "rating": 5, "date": "2011-02-21"}, {"excerpts": ["The Fried Chicken slider was pretty good, and the Ground Beef slider was fairly unremarkable.  "], "author": "Jorf D.", "review": "This place is awesome.  You don't often see Pork Belly Donuts with Maple Marker's Mark Glaze on a menu, and when you do you order it.  And I did.  And it was amazing.  Highly recommended.\n\nThe sliders were a mixed bag.  The Fried Chicken slider was pretty good, and the Ground Beef slider was fairly unremarkable.  The Lamb sliders were the clear stand-outs; something very special is happening with that lamb.  \n\nThe fries are worth mentioning as well, as they were perfectly crispy and quite tasty.  The beer selection was small (about 8 on tap?) but quality.\n\nOverall this place is great.  It's completely unpretentious, fairly cheap, has a nice beer garden out back for sunny days, and lots of board games for those who enjoy such things.  Service was friendly and prompt.  And they're open during that 2pm to 6pm time range when it seems every other decent place in the Mission is closed.\n\nOh yeah, don't order a salad here.  If you want a salad go someplace else.  That's not what this place is for.", "rating": 4, "date": "2011-08-14"}, {"excerpts": ["The fried chicken slider I had was sooooo good! ", "The tilapia was pretty good too. ", "$3.50 each ", "and you buy a la carte. ", "Tons of beers, especially for a small spot. ", "They have board games on a shelf, and an add for ladies night on Tuesdays which I might have to come back for! ", "The staff wasn't super friendly ", "but then here I was in business casual in a dive-ish bar ", "(probably I looked way out of place!). ", "Overall a great accidental find for lunch. ", "I will absolutely come back."], "author": "Jessi T.", "review": "I came in during lunchtime on a random Thursday. Nice and quiet, cute patio out back. The fried chicken slider I had was sooooo good! The tilapia was pretty good too. $3.50 each and you buy a la carte. Tons of beers, especially for a small spot. They have board games on a shelf, and an add for ladies night on Tuesdays which I might have to come back for! The staff wasn't super friendly but then here I was in business casual in a dive-ish bar (probably I looked way out of place!). Overall a great accidental find for lunch. I will absolutely come back.", "rating": 4, "date": "2015-01-29"}, {"excerpts": ["The fried chicken slider comes on a hot biscuit with country gravy dripping off it. ", "The lamb burger is also seasoned perfectly. ", "I have never had something so sinful as the pork donut with sea salt and whisky glaze. ", "It is an orgasm in your mouth. \n", "Be warned, its all comfort food so be prepared to take a nap immediately after eating."], "author": "M K.", "review": "Seriously dont go here! NO.... just kidding.... I just dont want it to get so crowded that I cant get a seat. I love this place! I have been a few times and the food is consistently great. You can sit inside and play board games or outside in the backyard at the picnic benches. They have endless mimosas as well as a full bar for other treats like bloody mary's. The only drawback on the bloody is it had no veggies in it- which is my favorite part. \nIt feels like a mini zeitgeist but minus the crowds and asshole bartenders. The food is also WAY better and CHEAP! \nSliders are $3 and you can get sides of fries or potatoes or fruit for a few bucks.  Everyone who works there is super duper nice. \nI highly recommend the pork belly donuts and sliders. All of them are so good! The fried chicken slider comes on a hot biscuit with country gravy dripping off it. The lamb burger is also seasoned perfectly. I have never had something so sinful as the pork donut with sea salt and whisky glaze. It is an orgasm in your mouth. \nBe warned, its all comfort food so be prepared to take a nap immediately after eating.", "rating": 4, "date": "2011-07-20"}, {"excerpts": ["Fried Chicken Slider ", "- It sounds amazing in theory, and it might be in execution... but not always. ", "The biscuit was a bit dry. ", "I was also surprised since I had assumed the chicken would be southern-style fried chicken but was instead covered in what looked like panko crumbs. ", "It was good, but not as great as I wanted it to be.\n", "*Fried egg + Bacon Slider - ", "If you love the messiness of slicing into a fried egg over potatoes, and you want this messiness on your fingers, you should definitely get this slider.\n", "*", "Beef Slider - I didn't get this, but my friend Mark swears that it's the best thing he ate that day. ", "And we ate a lot that day.\n", "*", "Fries - They were perfect. ", "There was the perfect ratio of crispy to soft potato. ", "They were seasoned just right. "], "author": "Audrey K.", "review": "Food\n*Pork Belly Donuts - Sometimes you just want something that has the perfect combination of crispy, salty, and fatty. What you're craving is the pork belly donut from The Sycamore. The Sycamore provides the richness and tenderness of perfect pork surrounded by a crunchy fried hollow sphere.\n*Fried Chicken Slider - It sounds amazing in theory, and it might be in execution... but not always. The biscuit was a bit dry. I was also surprised since I had assumed the chicken would be southern-style fried chicken but was instead covered in what looked like panko crumbs. It was good, but not as great as I wanted it to be.\n*Fried egg + Bacon Slider - If you love the messiness of slicing into a fried egg over potatoes, and you want this messiness on your fingers, you should definitely get this slider.\n*Beef Slider - I didn't get this, but my friend Mark swears that it's the best thing he ate that day. And we ate a lot that day.\n*Fries - They were perfect. There was the perfect ratio of crispy to soft potato. They were seasoned just right. These fries were fantaaastic.\n\nAmbience\n*Board games - Uh, they have board games. We didn't play any, but I loved the fact that they had 'em.\n*Cozy/cramped - It's San Francisco, so what do you expect?\n\nService\n*One waitress? - We only had one server on a Saturday morning, and didn't see anyone else serving customers. The place was full. We got our food, but we weren't checked on and we got our own ketchup because we couldn't find the waitress. We also overheard her say \"Oh those people are about to leave\" to a few incoming customers, and were rushed out.\n\nBottom Line: The food was quite good, I was okay with the ambience, but the service was rushed at best.", "rating": 4, "date": "2011-01-26"}], "black bean slider": [], "sycamore cobb salad": [], "sycamores famous roast beef sandwich": [], "blackbean burger": []}