{"cacheesy": [], "el nino": [{"excerpts": ["My boyfriend got the El Nino grilled cheese and said it was the best grilled cheese he's ever had. ", "You can really tell they use high quality ingredients and you get good portion sizes. ", "The people working there were also really friendly and helpful! ", "I definitely plan on coming back!!"], "author": "Anna R.", "review": "I saw an ad for Grilled Cheez Guy in the paper so I decided to give it a try and I'm so glad I did! I got the grilled cheese nachos and they were amazing and a super cute idea. They weren't greasy at all. My boyfriend got the El Nino grilled cheese and said it was the best grilled cheese he's ever had. You can really tell they use high quality ingredients and you get good portion sizes. The people working there were also really friendly and helpful! I definitely plan on coming back!!", "rating": 5, "date": "2018-05-15"}], "mechanical turk": [{"excerpts": ["Most recently, we ordered:\nClassic GC -- delish\nMechanical Turk -- a meal of goodness\nBacon tomato -- can't stop\n\n"], "author": "Lanny B.", "review": "Excellent catered food and great service!!\n\nI've hired the Grilled Cheez Guy to serve their melty magic at two events -- a work cocktail party for 50+ and a family birthday party for 15 guests -- and both were big successes. \n\nThey set up in a bar's courtyard for the work event and continuously served up four different sandwich varieties over a 2 hr timeframe. \n\nThey set up just as handily in a driveway for the home event and supplied ample quantities of three different sandwiches, plus arugula salad and a couple appetizers. \n\nNo doubt...they are generous with the cheese and butter/oil, but you kinda know that going in. The salad call was one I worried about, and it was excellent. \n\nMost recently, we ordered:\nClassic GC -- delish\nMechanical Turk -- a meal of goodness\nBacon tomato -- can't stop\n\nI found their prices reasonable...probably something like $15-20 per head for three types of GC plus two apps and salad. \n\nThe cooker/servers have been very friendly and cleanly. Danny led the crew from Oakland and was fantastic. Michael and Ricky were easy to work with reserving and picking out the menu. \n\nDon't miss tip:  Their \"nachos\" of mini grilled cheese sandos on sliced baguette with salsa are off the hook good!!  Make sure you ask for summa that action.", "rating": 5, "date": "2017-05-31"}], "jammer": [], "english toasty": [], "crock mister": []}