{"philly salad": [], "italian salad": [], "pizza": [{"excerpts": ["I had mine with chilli and cheese and my daughter had hers pizza style.  ", "Both were very good.  ", "I would have given 5 stars except for mine didn't have as much meat as I expected.  ", "a sandwich should never have empty bread.  ", "I might not have cared as much except for my daughters while the same size had noticeably more steak.  ", "Still it was was very good for the price and when in the area I would considered coming again."], "author": "Karen G.", "review": "Very tasty sandwich, steak was tender and served on a soft roll.  I had mine with chilli and cheese and my daughter had hers pizza style.  Both were very good.  I would have given 5 stars except for mine didn't have as much meat as I expected.  a sandwich should never have empty bread.  I might not have cared as much except for my daughters while the same size had noticeably more steak.  Still it was was very good for the price and when in the area I would considered coming again.", "rating": 3, "date": "2014-11-10"}, {"excerpts": ["As much as I enjoy using forks and knives for dishes not meant for them (pizza), I prefer to eat a cheesesteak with the method it was intended to be eaten -- my hands. ", "My suggestion to help fix this would be for them to use a to-go box/container vs just wrapping the sandwich in foil."], "author": "Farhad M.", "review": "This place is legit. Good prices, good food, good people. What else could I ask for? I usually get the mushroom cheesesteak with curly fries. Haven't tried some of the other \"non-standard\" versions they do (why mess with the original?). This place is hella good for taking care of hangovers on Sunday when El Burrito Express down the street is closed.\n\nMy only grief is that sometimes the to-go orders aren't packaged very well and everything is a giant hot-mess by the time you make it back home. As much as I enjoy using forks and knives for dishes not meant for them (pizza), I prefer to eat a cheesesteak with the method it was intended to be eaten -- my hands. My suggestion to help fix this would be for them to use a to-go box/container vs just wrapping the sandwich in foil.", "rating": 4, "date": "2012-06-20"}, {"excerpts": ["Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  "], "author": "Lawrence L.", "review": "Melted cheese, grilled steak, hot peppers, whole roasted garlic cloves, on a buttery toasted hoagie roll...  Mmmmmmmm....  Stumbled on this while driving through SF.  Used the iPhone Yelp app to check what was nearby, and BAM!  Found this gem...\n\nThey come in 3 sizes: 7\" ($4ish), 10\" ($6ish), and a whopping 15\" ($10ish).  Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  We tried the original and garlic.  Both were delish.\n\nDefinitely a place to go for a Philly Cheese Steak.  I've been to Philly, but have not had the cheese steaks there (how could I do that you may be asking??? Too short of a business trip).  Well, if this is what a Philly Cheese Steak should taste like, I'm a fan...  It definitely beats the other franchised version: Great Steak Company - that's for sure!\n\nThey had steak fries, curly fries for sides.  We had the Fiesta Poppers (jalapeno poppers)...  Yummy.\n\nThis place was definitely a hole-in-the-wall, but those are the best places in my book.  Their motto is - \"Caution: may be habit forming\", and I am glad I do not live nearby; otherwise, there would not be enough trips to the gym that could help me.", "rating": 4, "date": "2009-10-10"}, {"excerpts": ["I got double meet with white American cheese and some pizza sauce on the side.   ", "Can you say yum?  "], "author": "Todd M.", "review": "Wow.  This place is da bomb.  Cheesesteaks with bread flown in from Philly each day.  Tasty cakes in the fridge.  Too bad I don't live closer.  Actually good thing I don't.  5 stars - even though the place is filthy!\n\nI got double meet with white American cheese and some pizza sauce on the side.   Can you say yum?  Add in some fiesta poppers and I had one very healthy meal.\n\nCan't wait to go back!", "rating": 5, "date": "2009-12-13"}, {"excerpts": ["They definitely have the Philly cheesesteak taste down, \nI recommend the Pizza Cheese 10\" with fried onions and hot peppers.\n", "This is a must stop for me when I get over to the city from Marin.\n", "They even have Tastykakes."], "author": "Robert B.", "review": "I love this place. They definitely have the Philly cheesesteak taste down, \nI recommend the Pizza Cheese 10\" with fried onions and hot peppers.\nThis is a must stop for me when I get over to the city from Marin.\nThey even have Tastykakes.", "rating": 5, "date": "2012-07-16"}, {"excerpts": ["I like the pizza steak sandwich that comes with pizza sauce and provolone. ", "The Philly cheese steak comes filled with sweet peppers, but sadly only American cheese. ", "Both are juicy, and the bun is toasted on the grill. ", "Try the onion rings. "], "author": "Monarch B.", "review": "Yum.\n\nThe sandwiches here are fresh-made. I like the pizza steak sandwich that comes with pizza sauce and provolone. The Philly cheese steak comes filled with sweet peppers, but sadly only American cheese. Both are juicy, and the bun is toasted on the grill. Try the onion rings. They have a good batter and don't come out dripping oil.\n\nThis is far better than a fast food brger.", "rating": 3, "date": "2012-04-16"}, {"excerpts": ["I recommend the PEPPERONI (with Pizza Sauce & Provolone) as well as the KING OF PHILLY (the classic with 50% extra meat & cheese). ", "I also recommend a nap after eating here!"], "author": "G C.", "review": "The place is a dump and the signage is faded but who cares, people come for the Cheese Steaks not the ambiance. Available in 7\", 10\" or 15\" these sandwiches boast an impressive stack of grilled meat & cheese as well as grilled onions and sweet/hot peppers if you desire (trust me you do). The sandwiches are great BUT (there is always a but), if you go at lunch, be prepared to wait, it was almost a 1/2 hour for us to get ours and some folks just don't have that kind of time to wait for a sandwich. So if you do have the time, then give the Cheese Steak Shop a chance! I recommend the PEPPERONI (with Pizza Sauce & Provolone) as well as the KING OF PHILLY (the classic with 50% extra meat & cheese). I also recommend a nap after eating here!", "rating": 3, "date": "2012-10-23"}, {"excerpts": ["I tried the mushroom cheesesteak and pizza cheesesteak with hot & sweet peppers, onion rings, and twister fries.  ", "For me, the sandwiches were missing that certain 'je ne sais quoi' to take them to the next level. ", "I mean, putting meat and cheese together is fool-proof...", "so the cheesesteaks were just ordinary to me. ", "The bf and I also did not like the sweet peppers because they overpowered the savoriness of the cheesesteaks. ", "Maybe we'll have better luck next time with just the hot peppers!"], "author": "Caralisa L.", "review": "Artery-clogging eats next to a hospital? Oh, the irony. And of course, that wasn't going to stop me. I tried the mushroom cheesesteak and pizza cheesesteak with hot & sweet peppers, onion rings, and twister fries.  For me, the sandwiches were missing that certain 'je ne sais quoi' to take them to the next level. I mean, putting meat and cheese together is fool-proof...so the cheesesteaks were just ordinary to me. The bf and I also did not like the sweet peppers because they overpowered the savoriness of the cheesesteaks. Maybe we'll have better luck next time with just the hot peppers!", "rating": 3, "date": "2012-03-19"}, {"excerpts": ["I ALWAYS order the 7 inch Pepperoni Pizza cheese steak, twisty fries, and a soda. ", "This place never disappoints. "], "author": "Jennifer L.", "review": "I'm 25 and I can honestly say that I've been eating at the Cheese Steak shop for over 10 years now. I love it! Back in high school we used to have competitions to see who could finish the 15 inch the fastest. \n\nThough my metabolism has slowed down considerably, I still try to hit up the Cheese Steak shop once a month. It is now my special treat after a visit to the doctor (I hate shots) or after a hard core Yoga workout (they have to balance each other out, right?) \n\nI'm not a Original Philly Cheese Steak kind of person - I just like tasty food. I ALWAYS order the 7 inch Pepperoni Pizza cheese steak, twisty fries, and a soda. This place never disappoints. I often bring my out of town friends here and never worry about what they might think - it is that money. \n\nIf I could give more stars, I would. For all of you new to the Cheese Steak shop, it is definitely habit forming. Make sure you pick up a stamp card. After so many stamps you get a free 10 inch. Tuesdays are double stamp days and Wednesdays are half off sides days.", "rating": 5, "date": "2009-09-25"}, {"excerpts": ["If you're willing to get messy or use a fork, get the pizza cheesesteak.  "], "author": "John H.", "review": "Very solid cheesesteaks, probably some of the best in the SF area.  Definitely go for the classic cheesesteak, maybe get it with mushrooms. If you're willing to get messy or use a fork, get the pizza cheesesteak.  Also, unless you live within 5 minutes, I'd eat them there or you risk them getting soggy.\n\nThe sides are tasty too, especially the poppers.\n\nSome interesting facts \n1. When you calculate cost per inch, the 10 inch cheesesteaks are the best deal, and the 15 inch ones are the worst. Really strange because you'd think that it'd be cheaper per inch as you got larger.\n2. Definitely go on Tuesdays and get the double stamps! They have cards that they'll stamp for purchases and every 12 stamps you get a free sandwich.", "rating": 4, "date": "2010-11-26"}, {"excerpts": ["I usually order the pizza sanwich which is just your basic cheesesteak with marinara sauce.  ", "I am sure everything there is good ", "but I've never deviated because I like this sandwich so much.  ", "I could easily eat here a few times a week, but then I would wiegh 647,916,846 pounds and no longer be able to transport myself to get a sandwich.  ", "The fries are also done very well which seems to be a lost art in this day and age. ", "Too many places make soggy or not cooked correctly fries, and it is really a downer.  ", "This place does it right.  ", "And the soda machine has free refills. "], "author": "Hanley B.", "review": "I'm a big time carnivore and I love my steak in every form and way.  My girlfriend brought me here and I have to admit that I was skeptical.  But, to her credit, she was absolutely right in her opinion that this place was top rate.  I live in the Marina and there are some philly cheese steak shops around my house and none of them come close to this place.\n\nI usually order the pizza sanwich which is just your basic cheesesteak with marinara sauce.  I am sure everything there is good but I've never deviated because I like this sandwich so much.  I could easily eat here a few times a week, but then I would wiegh 647,916,846 pounds and no longer be able to transport myself to get a sandwich.  The fries are also done very well which seems to be a lost art in this day and age. Too many places make soggy or not cooked correctly fries, and it is really a downer.  This place does it right.  And the soda machine has free refills. Winner, winner, chicken dinner.  \n\nFive stars and I look forward to my next visit there.", "rating": 5, "date": "2009-11-22"}, {"excerpts": ["3rd: I tried the pizza steak (mainly b/c ", "I knew a regular cheesesteak would disappoint me), it had some of the thinnest pizza sauce I've ever seen. "], "author": "Daniel A.", "review": "I'm actually really surprised this place received this many 5 stars. I can only imagine that the rest of the places here in SF are that much worst. I grew up in NJ eating at least one sandwiches every week so I've got my likes / dislikes but have also tried numerous places in and around Philly. \n\nBased on the quality of the steak and the bread (from Philly) it's a 3 but i had to detract a few points due to the following issues: \n1st - American Cheese is standard on the steaks...possibly the worst possible cheese choice. Provolone or Wiz...no exceptions. I'm a provolone fan \n2nd - My friend asked for Wiz o his and the guy responded, you must be from Philly? He offered wiz on his fries but not the sandwich. If you have a bucket o' wiz, why not offer it on the fries. \n3rd: I tried the pizza steak (mainly b/c I knew a regular cheesesteak would disappoint me), it had some of the thinnest pizza sauce I've ever seen. The bread was almost soaked through before i sat down. \n\nCustomer service wasn't very good, not horrible but nothing worth noting. Clean place with Root beer on tap...yummy. I would not return.", "rating": 2, "date": "2009-05-18"}, {"excerpts": ["This goes for cheese steak joints in Philly as much as it does for pizza joints in New York & wing joints in Buffalo. ", "Then he would sit at a filthy table (one chair only) & knaw on week-old pizza crusts for nourishment, keeping his gun within reach the entire time.\n\n"], "author": "Pete J.", "review": "First thing's first: Turn everything you think you may know about regional specialty restaurants on its head. The way it usually goes down in the northeast is that the dirtier & older the place looks, the bigger its capacity for greatness. This goes for cheese steak joints in Philly as much as it does for pizza joints in New York & wing joints in Buffalo. Establishments like these are so passionate about their particular craft that they skip right over things like spiffing up the place with flashy decorations, keeping matching/usable furniture & mopping.\n\nThe Cheese Steak Shop is like Sylvester Stallone in 'Cobra'. All they know how to do is build the perfect cheese steak, in the same way that Stallone's Lieutenant Cobretti only knew how to clean up the streets. Cobra would return home to an empty house & open the fridge to find only a beer & a jar of mustard in there...that's it. Then he would sit at a filthy table (one chair only) & knaw on week-old pizza crusts for nourishment, keeping his gun within reach the entire time.\n\nSide Note: Next time you watch '24' & wonder how Jack Bauer got to be such a badass, you can think about three things: Stallone, 'Cobra', & cheese steaks.\n\nThe Cheese Steak Shop's biggest strength is the same as their biggest weakness...they care *too* much about building the perfect cheese steak. But please, just accept that fact. Don't try to get too close to them...they're emotionally incapable of doing anything else, & are destined to be alone, with only the smell of sizzling ribeye, onions & sweet peppers to settle them.\n\nYou & I are safer & happier for their very existence.", "rating": 5, "date": "2007-05-30"}, {"excerpts": ["If you're using provolone, you're a fucking pizza shop that sells bad steaks on the side, not a cheesesteak place, so don't waste my time. \n\n"], "author": "Jay N.", "review": "As a boy, I was weaned on cheesesteaks by my grandmother in some of the best places in Philly. The ones here are the real deal and I almost had a tear in my when I bit into my first one (no shit!). \n\nThe key to their greatness lies in two ingredients - the Amoroso buns they fly in from the City of Brotherly Love and the white American cheese they use. \n\nThe latter is more important to me personally, as there is no cheese better on this earth and it is the only one that is used by the best cheesesteaks (I pissed off the cheese chef at Gary Danko once by asking her for some - true story!). \n\nYes whiners - I know Pat's King of Steaks put Cheese Whiz on the first one - but they've evolved since then and any self-respecting Philly cheesesteak person used white american cheese. If you're using provolone, you're a fucking pizza shop that sells bad steaks on the side, not a cheesesteak place, so don't waste my time. \n\nAnyhoo - if you want melted cheesy goodness on perfectly diced steak with onions and a classic roll - get your ass here pronto. Dig.", "rating": 5, "date": "2007-06-20"}, {"excerpts": ["but I've had their chicken steak and pizza steak too, and those are good.  \n", "I love those peppers.. can't get enough of em.  ", "You can ask them to cook the peppers on the grill with the meat if its not to busy..this is what I prefer.\n", "Get their curly fries.\n", "Make sure you're in close proximity to a nice comfy couch you can pass out on after wards..this meal will put you down for a few hours."], "author": "Ray S.", "review": "This place is a classic.  I don't think they can match up to the cheese steak carts in Philly who's sandwiches melt in your mouth, but I live in San Fran so I'm gonna pretend like I've never had those before.  \nI always tend to go for the hoagie just because I like all the toppings (lettuce, tomato, peppers, mayo) but I've had their chicken steak and pizza steak too, and those are good.  \nI love those peppers.. can't get enough of em.  You can ask them to cook the peppers on the grill with the meat if its not to busy..this is what I prefer.\nGet their curly fries.\nMake sure you're in close proximity to a nice comfy couch you can pass out on after wards..this meal will put you down for a few hours.", "rating": 5, "date": "2007-09-26"}, {"excerpts": ["there are a lot of options when it comes to dressing up your cheesesteak: mushrooms, garlic, peppers, bacon (even though i don't eat pork), pizza suace, etc...\n\n"], "author": "Lalo G.", "review": "I've been coming here as long as i can remember. my mom used to work at Mt Zion hospital across the street and used to take me there after work sometimes.  so this place holds a special place in my heart.  \n\nBesides that, their cheesesteaks are incredible.  even their chicken cheesesteaks are great too. there are a lot of options when it comes to dressing up your cheesesteak: mushrooms, garlic, peppers, bacon (even though i don't eat pork), pizza suace, etc...\n\nthis is by far the best place to get a cheesesteak in the city. don't bother going anywhere else. oh and be sure to go on tuesdays, it's double stamp day....you hard core heads know what im talking about", "rating": 5, "date": "2008-04-09"}, {"excerpts": ["Order on the phone and get the pizza cheese steak with light onions and peppers. ", "It's the best and only cheese steak in town.its been over 10 years and my mouth still waters at the thought of it."], "author": "savannah g.", "review": "Order on the phone and get the pizza cheese steak with light onions and peppers. It's the best and only cheese steak in town.its been over 10 years and my mouth still waters at the thought of it.", "rating": 5, "date": "2014-02-22"}, {"excerpts": ["I've tried the BBQ, pizza, and plain.  ", "All good.  ", "It doesn't matter which one you go to...they always taste great..."], "author": "Joey H.", "review": "I have like 5 fully stamped yellow cards...because of double Tuesdays!  When I used to live in the area, it was the place to go...for lunch, dinner, and rarely enough, breakfast.  *Looking for yellow cards*  I think I used them all.  \n\nBesides the actual Philly sammiches, this small chain portrays great and awesome employees...which ever one you go to.  The funny thing that I noticed was that the guy that takes your order looks the same at each one I go to.  Maybe they're twins.  \n\nAs for the sammiches, the meat is cooked meatly and the messy it is, the better it tastes.  I've tried the BBQ, pizza, and plain.  All good.  It doesn't matter which one you go to...they always taste great...no matter which one you go to.  \n\n*DROOL*", "rating": 5, "date": "2009-06-27"}, {"excerpts": ["Ignore those fools who tell you not to try the pizza steak -- it's all about the pizza steak, if you ask me.  ", "Flavorful meat, real Amoroso's rolls flown in from Philly, even the staff is authentically Philadelphian with that slightly rough edge.  "], "author": "Marco C.", "review": "I grew up just outside Philadelphia, I go back to Philly to visit quite frequently, and yet The Cheese Steak Shop in San Francisco still rates as the best cheese steak I've ever had.  Ignore those fools who tell you not to try the pizza steak -- it's all about the pizza steak, if you ask me.  Flavorful meat, real Amoroso's rolls flown in from Philly, even the staff is authentically Philadelphian with that slightly rough edge.  I've also tried the sister restaurants in Berkeley and Pleasanton, and both keep it real.\n\nThe Cheese Steak Shop has the best cheese steaks in the Bay Area, easily, and possibly even the best in the nation.", "rating": 5, "date": "2007-01-01"}, {"excerpts": ["Pats, Geno's, Pizza City, etc. ", "They're good. ", "Grilled onions and hot peppers on the side is my personal favorite, although the pizza steak and chicken steak are also winners. "], "author": "Jackson G.", "review": "I have family in Philadelphia, and I go back there about once a year. Each week-long visit entails several trips to various cheese steak shops: Pats, Geno's, Pizza City, etc. They're good. But they're not...\n\nThe Cheese Steak Shop\n\nThis grungy little place on Divisadaro serves the best cheese steak I have ever had, hands down. They import the Amoroso rolls (the mark of an authentic Philly steak), the meat (east coast cows have a different kind of fat than their west coast sisters), and the Tastykake snack cakes that you will be unable to eat after finishing your cheese steak. That's because you will not back down, and you will order the 15\". Grilled onions and hot peppers on the side is my personal favorite, although the pizza steak and chicken steak are also winners. Get some root beer in a bottle as well, its a good combo.\n\nOn another note, the atmosphere of the place is about on par with McDonalds. But you came for the heart-stopping greasy goodness that is San Francisco's greatest cheese steak. It's next to Mt. Zion hospital for a reason.", "rating": 5, "date": "2008-04-11"}, {"excerpts": ["the other thing i always order is the pizza cheese steak.  "], "author": "Bing D.", "review": "i've tried all there cheese steaks and i'm definitely a fan.\n\nthey have specials...i think it goes like this.  \n\nbuy three get on free on wednesdays.\n\non tuesdays and sundays, if you buy a cheesesteak you get a double stamp on your card towards a free cheese steak.\n\nits a bit greasy but thats how a real philly style cheese steak is supposed to be.\n\ni've fallen in love with their onion rings for some reason to go with the cheese steak...and of all the cheese steaks i'll always get the regular with the sweet peppers.  I never used to do the pepper thing but this place changed me FOREVER.\n\nthe other thing i always order is the pizza cheese steak.  i love the sauce the have for it and for dipping the onion rings.\n\nif you don't like greasy don't come here because when you walk in you can feel the grease in the air.  the thing is, i haven't gained a pound in here.  i don't feel bloated or feel my skin stretch as i eat.  this place FEELS 100% HEALTHY.  So what can i say?  If it doesn't make you feel bad, why not eat it?", "rating": 4, "date": "2010-08-25"}, {"excerpts": ["It's all about the Pizza Steak sandwich with extra cheese and mushrooms!!"], "author": "Juan C. T.", "review": "oh man! im a big guy who has never had a good steak sandwich...but after visiting this place, since i have had plenty of great steak sandwiches here!! great place and good service! It's all about the Pizza Steak sandwich with extra cheese and mushrooms!!", "rating": 5, "date": "2010-03-05"}, {"excerpts": ["but I always get the pizza steak (not the one w/ pepperoni though).  "], "author": "O'Shea J.", "review": "Been going here since I was a kid.  When Will Smith said in the 1st season of Fresh Prince that a real cheesesteak has enough grease to soak the paper bag, this is what he was talking about.  They don't do the Cheese Whiz stuff here (for that go to Jake's).  All of their varieties are good for the most part but I always get the pizza steak (not the one w/ pepperoni though).  The deluxe is essentially the same thing, only with mushrooms.  Tuesdays are double stamp days - fill up a whole card with them and you get a free cheesesteak.  Avoid this place during lunch time.  The wait gets long especially if there's an ignorant Kaiser/UCSF employee ordering for 10 without phoning in ahead of time.", "rating": 5, "date": "2007-06-28"}, {"excerpts": ["Stay away from anything that will be flavored predominantly by a sauce such as a pizza steak or bbq steak.  ", "You will be much happier tasting other ingrediants."], "author": "matthew w.", "review": "Best Cheesesteak in San Francisco by a long shot.  This place is so good, they have a sign up warning people not to counterfeit their frequent diner's cards for redemption on free sandwiches.  I highly reccommend one with hot peppers and whole roasted garlic cloves.  Stay away from anything that will be flavored predominantly by a sauce such as a pizza steak or bbq steak.  You will be much happier tasting other ingrediants.", "rating": 5, "date": "2005-05-25"}, {"excerpts": ["I come from the east coast so certain things are different out here , chicken wings , Pizza , and cheese steaks . ", "But these guys got it right . ", "Greasy meat , greasy cheese and cooked peppers ! ", "Doesn't get any better than that ."], "author": "Keyser S.", "review": "\"Caution may Be Habit Forming \"  (on  the awning ) Ya, no shit . I come from the east coast so certain things are different out here , chicken wings , Pizza , and cheese steaks . But these guys got it right . Greasy meat , greasy cheese and cooked peppers ! Doesn't get any better than that .", "rating": 5, "date": "2008-08-18"}, {"excerpts": ["Or the pizza cheese steak is good also.  ", "I would say that this is not an everyday place, but once a week for sure.  ", "Oh, and fries are a must.  ", "I know curly fries or regular fries, decisions, decisions.  ", "There's no right answer, it's just preference I guess.  "], "author": "Shane Y.", "review": "Should be a 4.5 stars, can't quite give it five, parking can be rough sometimes.  Now, with that being said, this place has an awesome cheese steak.  Is it greasy?  Yes, but it's a cheese steak, it's supposed to be.  If I eat there, I get a 10\", but if it's to go I'll go for the 15\".  My favorite is the bacon cheese steak with mayo (you have to ask for mayo on that one).  Or the pizza cheese steak is good also.  I would say that this is not an everyday place, but once a week for sure.  Oh, and fries are a must.  I know curly fries or regular fries, decisions, decisions.  There's no right answer, it's just preference I guess.  Me, I like the regular steak fries here.  And be sure to get the frequent buyers card, you'd be surprised how quick it can fill up to give you a free 10\".", "rating": 4, "date": "2008-11-24"}], "garlic": [{"excerpts": ["She convinced me to try the garlic philly and take out the peppers because your girl hates spice, super grateful. \n\n"], "author": "Nicole K.", "review": "I had a medium sub at about 1pm and I was full for HOURS like I didn't eat again until the next morning. These are huge and worth every. Single. Bite. Yum. \n\nOkay so the service, I came in for the first time and the very nice women at the counter was beyond helpful! She convinced me to try the garlic philly and take out the peppers because your girl hates spice, super grateful. \n\nWe got the corn nuts and fries per the kind lady's recommendation and they were soooo good! Heart eyes and drooling over the memory, it cures the homesickness for this southern bell. \n\nAll I'm saying is this, if you are sober this place is great, if you looking drunk munchies that will cure even the most enthusiastic drinker, this place the holy grail! It's cheesy, it's greasy, it's so flavorful, it's worth it.", "rating": 5, "date": "2018-05-31"}, {"excerpts": ["I gave been going here for years and when I am on that side of town I always get the spinach cheesesteak with garlic. ", "Oh my goodness the bomb!"], "author": "Prima M.", "review": "The best cheesesteaks in San Francisco,  I gave been going here for years and when I am on that side of town I always get the spinach cheesesteak with garlic. Oh my goodness the bomb!", "rating": 5, "date": "2018-09-04"}, {"excerpts": ["Whole garlic cloves added. ", "Curly fries, crispy on the outside, but not all the way through."], "author": "Nick L.", "review": "All the melted cheese and delicious steak. Whole garlic cloves added. Curly fries, crispy on the outside, but not all the way through.", "rating": 5, "date": "2018-07-28"}, {"excerpts": ["but it turned to be \"garlic\" with an accent. "], "author": "Aj C.", "review": "\"CAUTION: MIGHT BE HABIT FORMING!\"\n\nI read the sign outside as I walked in for the first time, I thought to myself what that sign meant.\n\nATMOSPHERE:\nThis is one of the hole-in-the-wall restaurants that I have passed by numerous times and not once did I notice them in the Divisadero! The interior was a bit tiny and could probably fit about 20 people. I could tell it's maintained a bit and that this place has been around for a while.\n\nFOOD:\nI ordered the 7\" Philly cheese steak with \"guylic\" chips. I also requested hot peppers in my chees steak. At first, I was confused what \"guylic\" was but it turned to be \"garlic\" with an accent. Note that the chips I ordered were literally chips and not french fries!\n\nThe Philly cheese steak was literally the best Philly cheese steak I've ever had! The meat mixed with the cheese and hot peppers complemented each other so well that the flavors were wrestling in my mouth! Not only was the Philly cheese steak amazing, but also their chips! It came out hot, fresh, and crispy. The seasoning on top was icing on the cake!\n\nCUSTOMER SERVICE:\nThere wasn't a lot of interaction with the employees because they're too busy making the best Philly cheese steak in the world, but the cashier was friendly to me and even gave me a rewards card.\n\nAfter devouring everything, I slowly left the restaurant stuffed.\n\nNow I know why they had a caution sign because I've been craving it every day after I had it...\n\nNOTE: I'm actually planning to go there already. I committed to it.", "rating": 5, "date": "2016-04-24"}, {"excerpts": ["I got the garlic fries and I felt like the garlic was not cooked well with with the fries, more thrown on top. "], "author": "Will H.", "review": "I'm willing to try the Cheese Steak Shop again, but my first trip here was just average. The meat in my cheesesteak was not as flavorful as I would have wanted and the green peppers were heavily greasy. The fries are thick cut which are good if you like steak fries, but I definitely prefer crispy. I got the garlic fries and I felt like the garlic was not cooked well with with the fries, more thrown on top. Pros: service was quick, relatively inexpensive, and comes with a frequent customer card.\n\nTheir slogan is \"habit forming.\" I can't say that after this visit as I was mostly unimpressed, but as mentioned, I'm willing to give it another taste.", "rating": 3, "date": "2015-10-21"}, {"excerpts": ["Fresh raw onions & mushrooms as well as wonderful garlicky roasted garlic cloves.  ", "Although pre-roasted, they're soft & delicious.  ", "Amoroso rolls from Philly & they sell a few varieties of TastyKake.  ", "For those who believe they're using less meat, see my pic!  ", "My 10\" steak couldn't have been better.  ", "Like that they do not heat the roll on the grill as this takes away from its cheweyness, not that there's such a word,!"], "author": "Joshua C.", "review": "Fabulous Cheesesteak.  I use one word to spell Cheesesteak, not two like their name.  Have spelled it this way since living in Philly pre-'75.  Went to their first original shop on Divisadero in SF before they moved up the street to this location!  Late '70's?  Fresh raw onions & mushrooms as well as wonderful garlicky roasted garlic cloves.  Although pre-roasted, they're soft & delicious.  Amoroso rolls from Philly & they sell a few varieties of TastyKake.  For those who believe they're using less meat, see my pic!  My 10\" steak couldn't have been better.  Like that they do not heat the roll on the grill as this takes away from its cheweyness, not that there's such a word,!", "rating": 5, "date": "2016-06-10"}, {"excerpts": ["I usually order the medium Philly Cheese Steak with twister fries or garlic chips and it compliments each other so well. "], "author": "Rick O.", "review": "One of my favorite places to eat in San Francisco!\n\nI've bee going here for months now and they're consistent with what they're selling. I usually order the medium Philly Cheese Steak with twister fries or garlic chips and it compliments each other so well. Since I love spicy, I also ask for extra hot peppers.\n\nThe space is tight and there's only like 8-10 tables but I've never had a problem. Staff is pretty friendly too!", "rating": 5, "date": "2016-10-27"}, {"excerpts": ["The garlic isn't overwhelming, despite the name, and the peppers were cooked just right "], "author": "Chris S.", "review": "Number one priority for a cheesesteak place - make delicious cheeseteak! And man, does this place deliver. I got the \"guylic\" cheesteak with mushrooms, and it exploded with delicious flavors. The garlic isn't overwhelming, despite the name, and the peppers were cooked just right so the flavor was present but not overwhelming.\n\nThe prices are pretty good for this neighborhood, too! You can get a full lunch for ~$7. It's only when you add sides that things get expensive. \n\nMy only complaint is that they really bombed the fried zucchini. I love fried zucchini, and to have it be disappointing is a little bit heartbreaking...or at least enough to take one star off the review. \n\nI'll definitely be back!", "rating": 4, "date": "2015-03-27"}, {"excerpts": ["1/2 of the king philly\ngarlic, cheese, and mushroom philly\nsides: onion rings, curly fries, d/"], "author": "Mary Ann B.", "review": "It was just ok, a bit disappointed. I have yet to find that ultimate Cheesteak. I am truely at a lost for words - neither in a good way or bad. Just not much to say about the place. \n1/2 of the king philly\ngarlic, cheese, and mushroom philly\nsides: onion rings, curly fries, d/f mushrooms\n2 IBC rootbeer\n\nEverything sounds so good on the menu, but once awaiting that first bite I was disappointed. Nothing stood out for me. It just tasted like a great steaks philly from the mall.", "rating": 3, "date": "2012-06-02"}, {"excerpts": ["They recently introduced some new sides like home made potato chips and garlic fires - but I have not tried them."], "author": "Amy W.", "review": "While Phat Philly in the Mission is the best cheesesteak in town - this is in my neighborhood and a \"go-to\" if I have a craving for cheesy/steaky goodness. Nope....there is not an ounce of healthiness here..but sometimes you just need one.\n\nI believe Tuesday/Sunday are double stamp days and Wednesday is 1/2 price sides (Monday is double coupon day - and Right now the Safeway on Fillmore has $2.50 of of a 10\" coupon on the back of their receipts - so that would be $5 off $8 sandwich - Now I haven't tried that coupon on a Monday so that may not work since it is such a steep discount, but if it does - that's a steal) \n\nI do love their steak fries ordered well done...I am not usually a fan of steak fries - but these are good. They recently introduced some new sides like home made potato chips and garlic fires - but I have not tried them.", "rating": 4, "date": "2014-07-20"}, {"excerpts": ["They've got a bunch of other steak options with grilled onions, peppers (hot-sweet), mushrooms, garlic and marinara sauce, all are ridiculously good and fattening...\n\n"], "author": "Ron W.", "review": "Ohhh, Cheese Steak Shop, how I miss you!  How do you count the ways?!  From their soft squishy sandwiches to the slightly chilled Tastykakes, I love thee!  But my heart and arteries are glad you're 3,000 miles away now.  As an ex-SF resident, I stumbled on the Cheese Steak shop years ago and it became a semi-regular part of my lunch runs.  I stopped in again yesterday and nothing has changed in this illicit love affair.  \n\nThis place is about as real as it gets: clanking spatulas chopping up the steak, soft Amoroso rolls imported from the east coast and American or Provolone (where's the cheese wiz?) melted on top.  The place can get uber busy at lunch but the line moves quick.  I knocked down a 10\" King Philly with extra meat, delicious!  And some butterscotch Tastykakes finished off the meal.  As a bonus, the Cheese Steak shop was giving out free sodas for the Phillies win in the World Series, go Phils!  They've got a bunch of other steak options with grilled onions, peppers (hot-sweet), mushrooms, garlic and marinara sauce, all are ridiculously good and fattening...\n\nOutside of a cross-country trip to the City of Brotherly Love, the Cheese Steak Shop is as good as it gets in SF.  With locations popping up throughout the city and East Bay, you should be able to find one nearby.  So enjoy their yummy cheesesteaks sometime soon, just give yourself some time between visits to clear your arteries out!", "rating": 4, "date": "2009-10-30"}, {"excerpts": ["You can order your cheesesteak with beef or chicken, and with or without onions, garlic, mushrooms, spinach, pepperoni, bacon, bbq sauce, and hot or sweet peppers.  ", "Veggie sandwiches, hoagies and salads also available for you more health minded folk -- but honestly, I wonder if they ever sell any of these other options?. ", "I highly recommend sealing the deal to your coronary bypass by ordering the fresh potato chips on the side -- they're hot, crisp, and good!"], "author": "Rachel V.", "review": "I'm not from Philly, and have no point of reference, so compared to the cheesesteaks I've consumed in California, I think this is place is pretty damn good. I must admit that I feel guilty every time I eat here because I can almost feel my arteries hardening with every bite of this greasy goodness.\n\nYou can order your cheesesteak with beef or chicken, and with or without onions, garlic, mushrooms, spinach, pepperoni, bacon, bbq sauce, and hot or sweet peppers.  Veggie sandwiches, hoagies and salads also available for you more health minded folk -- but honestly, I wonder if they ever sell any of these other options?. I highly recommend sealing the deal to your coronary bypass by ordering the fresh potato chips on the side -- they're hot, crisp, and good!", "rating": 3, "date": "2014-07-11"}, {"excerpts": ["I like garlic, but WOW, was the garlic cheesesteak garlicky! ", "Would not recommend ordering a steak with garlic unless you REALLY like garlic. ", "The spiral fries were good too. ", "There were also ample tables inside to eat your food."], "author": "Marc B.", "review": "Great meat, cheese, and steak! Probably the best cheesesteak I've had outside Philly. I like garlic, but WOW, was the garlic cheesesteak garlicky! Would not recommend ordering a steak with garlic unless you REALLY like garlic. The spiral fries were good too. There were also ample tables inside to eat your food.", "rating": 4, "date": "2013-12-08"}, {"excerpts": ["If you are darling try the roasted garlic cheesesteak for an amazing result. \n\n"], "author": "Adam V.", "review": "Hands down the best cheesesteaks in the bay area. They use the correct bread and actually chop up the onions and meat nice and small so it literally melts in your mouth along with the piping hot cheese. Chopped peppers on top and not the green bell peppers but the real hot and sweet peppers like it should be. If you are darling try the roasted garlic cheesesteak for an amazing result. \n\nWARNING! This place is addictive and you will be back for more gut busting good eats!", "rating": 5, "date": "2013-12-03"}, {"excerpts": ["My go-to is a chicken cheese steak, with garlic, onions, and cheese.  ", "A 10-inch steak does the job for me, and at less than $8, that a good value in my book.  ", "That said, my recent visit was my first in probably 3-4 years.  ", "And it will probably be 3-4 years before I return- ", "but it's not because the Cheese Steak Shop has done anything wrong. ", "This is a solid option on this stretch of Divisadero..."], "author": "Andy S.", "review": "The Cheese Steak Shop is good for what it is, and it has been that way for a while.  It's not amazing, but the product you will receive is a solid cheesesteak, prepared in a great number of styles.  My go-to is a chicken cheese steak, with garlic, onions, and cheese.  A 10-inch steak does the job for me, and at less than $8, that a good value in my book.  That said, my recent visit was my first in probably 3-4 years.  And it will probably be 3-4 years before I return- but it's not because the Cheese Steak Shop has done anything wrong. This is a solid option on this stretch of Divisadero...", "rating": 3, "date": "2013-01-30"}, {"excerpts": ["I particularly like the addition of roasted garlic and pepperoni to my cheesesteak.  ", "In addition, I like The Cheese Steak Shop's seasoned curly fries more than I like Jake's waffle fries.  ", "The atmosphere is pretty \"hole in the wall\", but I generally don't go looking for cheesesteaks and ambiance at the same time."], "author": "Scott E.", "review": "This is my second favorite cheesesteak in the City, after Jake's Steaks.  Really, it just depends on what I'm after.  Jake's is probably more authentic, from a purist standpoint; but The Cheese Steak Shop has more options.  I particularly like the addition of roasted garlic and pepperoni to my cheesesteak.  In addition, I like The Cheese Steak Shop's seasoned curly fries more than I like Jake's waffle fries.  The atmosphere is pretty \"hole in the wall\", but I generally don't go looking for cheesesteaks and ambiance at the same time.", "rating": 4, "date": "2014-08-03"}, {"excerpts": ["Melted cheese, grilled steak, hot peppers, whole roasted garlic cloves, on a buttery toasted hoagie roll...  ", "Mmmmmmmm", "....  Stumbled on this while driving through SF.  ", "Used the iPhone Yelp app to check what was nearby, and BAM!  ", "Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  ", "We tried the original and garlic.  "], "author": "Lawrence L.", "review": "Melted cheese, grilled steak, hot peppers, whole roasted garlic cloves, on a buttery toasted hoagie roll...  Mmmmmmmm....  Stumbled on this while driving through SF.  Used the iPhone Yelp app to check what was nearby, and BAM!  Found this gem...\n\nThey come in 3 sizes: 7\" ($4ish), 10\" ($6ish), and a whopping 15\" ($10ish).  Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  We tried the original and garlic.  Both were delish.\n\nDefinitely a place to go for a Philly Cheese Steak.  I've been to Philly, but have not had the cheese steaks there (how could I do that you may be asking??? Too short of a business trip).  Well, if this is what a Philly Cheese Steak should taste like, I'm a fan...  It definitely beats the other franchised version: Great Steak Company - that's for sure!\n\nThey had steak fries, curly fries for sides.  We had the Fiesta Poppers (jalapeno poppers)...  Yummy.\n\nThis place was definitely a hole-in-the-wall, but those are the best places in my book.  Their motto is - \"Caution: may be habit forming\", and I am glad I do not live nearby; otherwise, there would not be enough trips to the gym that could help me.", "rating": 4, "date": "2009-10-10"}, {"excerpts": ["Spicing was minimal, and despite the addition of garlic to my sandwich, underwhelming. "], "author": "Casey U.", "review": "This location offers cheap cheesesteaks, and sadly, you get what you pay for.\n\nComprising my Cheesesteak was a fluffy roll, containing tough meat (not a lot of it, I might add), cheese which had to be searched for and peppers, which added crunch, but not flavor. Spicing was minimal, and despite the addition of garlic to my sandwich, underwhelming. This may have been one of the most unsatisfying sandwiches I've eaten in my life.\n\nWhat saves The Cheese Steak Shop from the one-star maelstrom of my discontent were the curly fries (outstanding in every way) and the fast service.", "rating": 2, "date": "2011-10-29"}, {"excerpts": ["I love the cheesesteak with grilled onions and garlic cloves. ", "I need to remind myself next time to get the 15 inches, it's just too damn good to go 10 inches. ", "I get hot peppers on the side to put hair on my chest. ", "The curly fries are perfect, actually perfect. ", "Get them."], "author": "Miles G.", "review": "All time classic cheese steak that's beyond novelty... It's memorable. I love the cheesesteak with grilled onions and garlic cloves. I need to remind myself next time to get the 15 inches, it's just too damn good to go 10 inches. I get hot peppers on the side to put hair on my chest. The curly fries are perfect, actually perfect. Get them.", "rating": 5, "date": "2014-06-20"}, {"excerpts": ["So I'm like \"what the hell\" and change my order to just a 10\" plain garlic cheesesteak ", "The manager WOULD NOT listen to what I was telling him, he just kept pointing to my receipt and reiterating that I ordered a regular garlic cheesesteak and not the special. ", "After 3-4 repeated attempts to say \"I know, ", "BUT, I changed my order because it was going to be over $13 ", "and it's usually a bit over $10, and ", "that's what I'm asking about\" and him pointing to what I ordered ", "(I already KNOW what I ordered, dude) and saying it's different. ", "YEAH", ", I KNOW IT'S DIFFERENT. ", "I CHANGED IT. "], "author": "Brendan R.", "review": "I've been a regular here for well over a year. Their cheesesteaks are kinda good but not great, but it's a couple of blocks away so it was my go-to place if I was too lazy to make food. They also have this Philly Guylic sandwich that I really like, and if you order it you get 1/2 off any side and a fountain drink. I've been getting that a lot lately.\n\nI went in awhile ago and got my usual, that combo special I just mentioned. Instead of being $10 and some change like usual, it was $13 and some change. I mention that to the cashier and he told me \"oh you only get 1/2 off on Wednesdays\". The sign for that special mentioned nothing about that, it mentions that any side is 1/2 off ALSO on Wednesdays. So I'm like \"what the hell\" and change my order to just a 10\" plain garlic cheesesteak so I'm not paying almost $14 for lunch.\n\nWhen I get my order, I ask to talk to the manager so I can ask about why I was going to get charged so much for that thing I've ordered multiple times already. Now here's the part where I got pissed. The manager WOULD NOT listen to what I was telling him, he just kept pointing to my receipt and reiterating that I ordered a regular garlic cheesesteak and not the special. After 3-4 repeated attempts to say \"I know, BUT, I changed my order because it was going to be over $13 and it's usually a bit over $10, and that's what I'm asking about\" and him pointing to what I ordered (I already KNOW what I ordered, dude) and saying it's different. YEAH, I KNOW IT'S DIFFERENT. I CHANGED IT. I TOLD YOU THAT THREE TIMES ALREADY.\n\nAfter nearly 3 minutes of trying to get him to listen to what I was actually saying I just gave up and left. Definitely won't be spending money here anymore, I came there for food, not to get dicked around by some guy who refuses to listen to his customers. What a joke. I definitely won't miss the creepy, skid row looking employees and clientele here either.", "rating": 1, "date": "2013-12-27"}, {"excerpts": ["I like getting mine with garlic and sweet/spicy peppers. ", "And when they put garlic in it, it's not just minced up garlic, they put big garlic chunks! \n\n"], "author": "Chris K.", "review": "I live right up the street from this place. My parents know the owner of the shop and come here once in a while to buy lunch. Their philly cheese steaks are great. You can't go wrong with whatever you choose to buy.\n\nI like getting mine with garlic and sweet/spicy peppers. And when they put garlic in it, it's not just minced up garlic, they put big garlic chunks! \n\nIt can get pretty busy during lunch because there is a hospital and other stores nearby, but they are pretty quick at making the food.", "rating": 4, "date": "2012-03-30"}, {"excerpts": ["the meat and peppers both seem to be much higher quality and the option to add bacon or garlic is awesome. \n\n", "I order a lot of things look good, but I end up combining too many extras (garlic, bacon, extra meat) and the the sandwich doesn't taste noticeably different other than having some extra meat.\n\n"], "author": "Jeff L.", "review": "A Phili Fed day means it's time to get cheese steak for lunch! And probably that I should be spending an extra hour in the gym... But anyway, this place has better cheesesteak sandwiches than anywhere else in the marina. the meat and peppers both seem to be much higher quality and the option to add bacon or garlic is awesome. \n\nDownsides: \n\n-The salads don't seem to have very much meat compared to cheesesteak salads at other place.\n\n-When I order a lot of things look good, but I end up combining too many extras (garlic, bacon, extra meat) and the the sandwich doesn't taste noticeably different other than having some extra meat.\n\n-It takes about 30 minutes for them to process take out orders, which is decent but still slow relative to similar places in the area. When people have been up early and skipped breakfast even a little bit extra waiting time can be kind of painful.\n\n-Parking is usually pretty annoying in this area, even for our take out orders.\n\n-I really should eat fewer cheese steak sandwiches.", "rating": 4, "date": "2011-11-21"}, {"excerpts": ["You can pretty much customize your cheesesteak: with mushrooms, with garlic, etc. ", "The guys working here are really friendly. ", "I really don't have anything to complain about. ", "Why not five stars? ", "Because I'm convinced that there has to be some place out there that is less likely to clog my arteries. ", "Or maybe not. ", "On the down side, I think my stomach started rumbling a few hours later. ", "I don't want to blame the cheesesteak though. ", "And, it would be nice if they closed later than 10pm. "], "author": "Jonas T.", "review": "Why do good things have to be so unhealthy? This place is fast and cheap. You can pretty much customize your cheesesteak: with mushrooms, with garlic, etc. The guys working here are really friendly. I really don't have anything to complain about. Why not five stars? Because I'm convinced that there has to be some place out there that is less likely to clog my arteries. Or maybe not. On the down side, I think my stomach started rumbling a few hours later. I don't want to blame the cheesesteak though. And, it would be nice if they closed later than 10pm. My cheesesteak cravings don't usually hit until past 10.\n\nJONASAPPROVED!", "rating": 4, "date": "2007-04-28"}, {"excerpts": ["Get the KING SIZE Cheese Steak with garlic... ", "Heaven!"], "author": "Anna W.", "review": "Get the KING SIZE Cheese Steak with garlic... Heaven!", "rating": 5, "date": "2011-05-05"}, {"excerpts": ["I usually get the chicken Philly with garlic.  ", "They put whole roasted garlic cloves in the sandwich, and the garlic is all soft and caramelized.  ", "Definitely get your sandwich with peppers and onions.  ", "You also can't beat the self-serve soda fountain (i.e., unlimited soda)."], "author": "Karen W.", "review": "I think the only other time I've had cheese steak this good was when I was actually in Philly.  Greasy and satisfying.  I usually get the chicken Philly with garlic.  They put whole roasted garlic cloves in the sandwich, and the garlic is all soft and caramelized.  Definitely get your sandwich with peppers and onions.  You also can't beat the self-serve soda fountain (i.e., unlimited soda).", "rating": 5, "date": "2006-02-06"}, {"excerpts": ["I tend to order either the garlic cheesesteak or the BBQ cheesesteak, and I get it with provolone because Cheese Whiz sorta scares me.  "], "author": "Sus... B.", "review": "This is one of those spots I've been going to for years but never got around to reviewing.  The food is consistently good, the onion rings are the second best I've had in the city (I think Buffalo Burger has better ones) and the only time I've felt sick is if I ate way too much, which is way too easy since it's so good.  I tend to order either the garlic cheesesteak or the BBQ cheesesteak, and I get it with provolone because Cheese Whiz sorta scares me.  :/  \n\nThe only thing I don't like is the fact that their sweet peppers are almost never just sweet - I'm not sure if that's on purpose, or it just gets mixed in with all the hot peppers before they're served, but it gets annoying when it becomes difficult to eat the sandwich.  I love spicy food, but the hot peppers tend to overwhelm the flavor.  In any event, I'm about a sandwich or two away from filling up my card and getting a free one, so I think once my eyeglasses are ready, I know what I'll be having for dinner...\n\n4.5 stars.", "rating": 4, "date": "2009-09-23"}, {"excerpts": ["and I had a 10\" cheese steak with fried onions and my wife had a 7\" cheese steak with garlic, we shared zucchini sticks. ", "It was really tasty. ", "I grew up in South Jersey eating cheese steaks made with the famous Formica's deli bread and american cheese and I've eaten a ton cheese steaks after going to Philly games and hanging out in Philly at Pat's and ", "Gino's on there bread with there cheese whiz. ", "So I think I have a good opinion on cheese steaks and these were excellent. ", "The bite was so good I was thinking about it in the middle of the night while trying to sleep. ", "We went to the wharf and had clam chowder, shrimp cocktail, dungeness crab and swordfish ", "but I still couldn't stop thinking of that cheese steak, man was that good!!!"], "author": "Bucky J.", "review": "This place is right next to the University of California San Francisco Medical Center. My wife and I went there and I had a 10\" cheese steak with fried onions and my wife had a 7\" cheese steak with garlic, we shared zucchini sticks. It was really tasty. I grew up in South Jersey eating cheese steaks made with the famous Formica's deli bread and american cheese and I've eaten a ton cheese steaks after going to Philly games and hanging out in Philly at Pat's and Gino's on there bread with there cheese whiz. So I think I have a good opinion on cheese steaks and these were excellent. The bite was so good I was thinking about it in the middle of the night while trying to sleep. We went to the wharf and had clam chowder, shrimp cocktail, dungeness crab and swordfish but I still couldn't stop thinking of that cheese steak, man was that good!!!", "rating": 5, "date": "2013-08-12"}, {"excerpts": ["Chicken and garlic philly is on point!"], "author": "Rene L.", "review": "One of the best cheese steaks Ive had. I usually get the 10in bacon philly and I \"KING\" it for more meat and more cheese not bad. They also hook you up with a lil card and when you get enough stamps you get a free 7in Philly. Its pretty addicting If I do say so myself. Also there Chicken and garlic philly is on point!", "rating": 5, "date": "2012-05-27"}, {"excerpts": ["I ordered the garlic and cheese steak sandwich and it was good. ", "The taste of the peppers, cheese, and garlic mixed together was delicious! ", "The prices were incredibly reasonable. ", "I ordered a small sandwich with curly fries for under $10. ", "Love the newspaper clippings around the restaurant-- gives a nice historical perspective to things. ", "Will be returning!"], "author": "Lissette L.", "review": "The staff is absolutely wonderful. Very friendly and attentive-- made me feel at home. I ordered the garlic and cheese steak sandwich and it was good. The taste of the peppers, cheese, and garlic mixed together was delicious! The prices were incredibly reasonable. I ordered a small sandwich with curly fries for under $10. Love the newspaper clippings around the restaurant-- gives a nice historical perspective to things. Will be returning!", "rating": 4, "date": "2014-11-08"}, {"excerpts": ["(they've got everything from bacon, mushrooms, pepperoni, onions, garlic, hot and sweet peppers to chicken)\n\n"], "author": "Anna T.", "review": "I don't think I've crave for anything as much as I've craved for a cheesesteak from this place. \n\nIn high school, as my friends picked up smoking, I picked up cheesesteaks. ( they come in 7, 10 and 15 inch sandwiches -pick your size)\n\nIn college, as my friends dabbled with drugs, I dabbled with different combinations of cheesesteaks. (they've got everything from bacon, mushrooms, pepperoni, onions, garlic, hot and sweet peppers to chicken)\n\nThis is one of the first places I drove to when I first got my license. It's the first thing I think of when I wake up in the morning.  It's what I want at night after a long day. It's what I long for when I'm feeling down. It's what I want for Christmas... birthdays, Valentines day..... ... If I could marry it, I would.\n \n\nI admit, *stands up*\n\n \" I, Anna, am a cheesesteak-aholic, I am addicted to the mushroom cheesesteak with extra hot peppers and a side of steak fries with cheese sauce\"\n\n*sits down*", "rating": 5, "date": "2009-01-08"}, {"excerpts": ["Ive been sprung on these things for years you will be too\n\ncant ever decide between the bacon cheese or garlic chicken "], "author": "Scotty B.", "review": "This is The Spot\n\nBest Philly in The Bay No Doubt\n\nIve been sprung on these things for years you will be too\n\ncant ever decide between the bacon cheese or garlic chicken so i get both\nthey got spots in the east bay too and one in Reno that puts the cheese sauce like back east\n\nthink im gonna get one now", "rating": 5, "date": "2008-03-28"}, {"excerpts": ["You can find me there eating the garlic or spinach.."], "author": "Eugene G.", "review": "You don't need whiz!!! This place is definately habit forming and I do highly recommend any sandwich where you can clearly taste the meat.... think of it as looking death in the face.\n\nYou can find me there eating the garlic or spinach..", "rating": 5, "date": "2006-09-29"}, {"excerpts": ["there are a lot of options when it comes to dressing up your cheesesteak: mushrooms, garlic, peppers, bacon (even though i don't eat pork), pizza suace, etc...\n\n"], "author": "Lalo G.", "review": "I've been coming here as long as i can remember. my mom used to work at Mt Zion hospital across the street and used to take me there after work sometimes.  so this place holds a special place in my heart.  \n\nBesides that, their cheesesteaks are incredible.  even their chicken cheesesteaks are great too. there are a lot of options when it comes to dressing up your cheesesteak: mushrooms, garlic, peppers, bacon (even though i don't eat pork), pizza suace, etc...\n\nthis is by far the best place to get a cheesesteak in the city. don't bother going anywhere else. oh and be sure to go on tuesdays, it's double stamp day....you hard core heads know what im talking about", "rating": 5, "date": "2008-04-09"}, {"excerpts": ["I chose the garlic one.  ", "Supposedly these taste the best with all the peppers on it... ", "sooo ", "I hesitated, but got those just for the experience.  "], "author": "Michelle N.", "review": "You will just keep eating, and eating, and eating.  These sandwitches are ALLL deliciouso, and omg.  10 inches just gets clobbered in a second.  15, ehh maybe. \n\nSo you can choose your flavor of cheese steak-- I chose the garlic one.  Supposedly these taste the best with all the peppers on it... sooo I hesitated, but got those just for the experience.  Man, I ate the sandwitch like a t-rex dino would chomp on their food.  \n\nincredibly tired after.  food coma.\n\nlater that night, well my itty bitty stomach cannot handle too much caffeine or spicy foods...  \\poor me suffered all night long.  \n\nWas it worth it?  hmmm I'd have to say so!", "rating": 5, "date": "2007-05-27"}, {"excerpts": ["I got the one with lots of garlic ", "but it was just really bland.  ", "We went home and pulled out all the spices and seasonings in the cabinet.  ", "I am sorry to say it was a huge disappointment.  "], "author": "Kat L.", "review": "I went here one day craving some good eats and drove out just to get me some delicious Philly Cheese Steak Sandwich.  Maybe my expectations were too high and we were really let down.  \n\nFor pics and full review go to http://www.kats9lives.com/2008/05/let-down.html\n\nWe came and picked up a huge sub.  I got the one with lots of garlic but it was just really bland.  We went home and pulled out all the spices and seasonings in the cabinet.  I am sorry to say it was a huge disappointment.  Luckily my sister was with me and she was able to finish it because I just didn't want to waste the calories.\n\nMaybe I will eventually give it one more try, but I don't know if it will make a difference.", "rating": 2, "date": "2008-09-18"}, {"excerpts": ["I  got the 7 inch garlic steak with everything and twister fries ", "I'm a small girl, and it was a  perfect size for me.    ", "Since I live across town, of course I ate there.  ", "It was REALLY good.  ", "Everything was flavorful,.   ", "The meat was juicy, the mix of hot and sweet peppers was perfect.  ", "The mushrooms were to die for, but for some reason  were only distibuted on one side of the sandwich.  ", "I liked the cheese, but the next time i go (and there will be a next time time ) ", "I will get extra cheese.   ", "These are MINISCULE gripes though.  "], "author": "Sascha B.", "review": "Yummy.  I was in  the neighborhood yesterday, and had read the great reviews.  (As a side note, Divsadero seems to have many more cheaper good  options than Filmore)  I  got the 7 inch garlic steak with everything and twister fries I'm a small girl, and it was a  perfect size for me.    Since I live across town, of course I ate there.  It was REALLY good.  Everything was flavorful,.   The meat was juicy, the mix of hot and sweet peppers was perfect.  The mushrooms were to die for, but for some reason  were only distibuted on one side of the sandwich.  I liked the cheese, but the next time i go (and there will be a next time time ) I will get extra cheese.   These are MINISCULE gripes though.  It was ridiculously good overall. \n\nI happened to go at the height of lunch time, and it took about 15 minutes to get my food. (and the cashier told me how long when I was ordering, so that was nice to know.)  It was a small place, but I found a tablle where my chair wasn't blocking people.  Using  a chair or not, I definitely would not stay here with a group to eat.  Most people were taking their orders to go though. My cashier was great about bringing my order out, and even got me some water. (I was going someplace else for coffee after.) \nI'm actually glad I live across town because I would become blimp Sascha otherwise!", "rating": 5, "date": "2009-01-30"}, {"excerpts": ["The first time I went I tried the Chicken & Garlic Sandwich, which has the chicken chopped up into small pieces like ground beef, and the garlic left in whole cloves of roasted garlic.  ", "OH MY GOD.  "], "author": "Trigby P.", "review": "I'm a little embarrassed giving this place 5 stars, when I have never even had their Philly Cheese Steak here.  The first time I went I tried the Chicken & Garlic Sandwich, which has the chicken chopped up into small pieces like ground beef, and the garlic left in whole cloves of roasted garlic.  OH MY GOD.  (My mouth is watering just typing this.)\n\nThis sandwich, which I know is bad for me because the meat is in a lava flow of melted cheese, and on a roll that although as white bread as could be, is some kind of crazy bread that, as a west-coaster, I have never been exposed to.\n\nI go back and back and back.  Be warned before you eat here...  Most people who visit this place develop an addiction, and I don't think there is a 12-step program that will help.", "rating": 5, "date": "2006-08-06"}, {"excerpts": ["King is a must, garlic and mushrooms-great for hangovers and helping make me smile"], "author": "Schmitty G.", "review": "Delish! King is a must, garlic and mushrooms-great for hangovers and helping make me smile", "rating": 5, "date": "2011-11-27"}, {"excerpts": ["note: ask them to add the whole roasted garlic cloves. ", "delicious!"], "author": "Young P.", "review": "The Cheese Steak Shop is the best! You get a quality old-fashioned Philly cheese steak. It's greasy, oily, heart-clogging goodness that you won't feel bad about at the end of the day.  What the hell... why don't you order a side of curly fries as well. Just do it! It feels good! Don't think twice about it because you will one day be back for more.\n\nThis place is definitely habit-forming! \n\nnote: ask them to add the whole roasted garlic cloves. delicious!", "rating": 5, "date": "2008-06-30"}, {"excerpts": ["An excellent Philly Cheese steak spot:\r\nCheese Steak with Whole Garlic = ", "WOW + stank breath (", "oh well)!\r\n\r\n", "It is 2 steps above Jay's Cheese Steaks. ", "Do call ahead of time and order via telephone to avoid the long wait especially during the lunch time hours (11-1)."], "author": "ronzilla x.", "review": "An excellent Philly Cheese steak spot:\r\nCheese Steak with Whole Garlic = WOW + stank breath (oh well)!\r\n\r\nIt is 2 steps above Jay's Cheese Steaks. Do call ahead of time and order via telephone to avoid the long wait especially during the lunch time hours (11-1).", "rating": 4, "date": "2006-08-07"}, {"excerpts": ["The cheese steak with garlic is AMAZING...", "in fact...", "HEAVENLY! ", "The side of curly fries are fried just perfectly with a crispy outside and soft inside. ", "Their slogan is \" Caution: Might be habit forming\" and if I didn't have to watch my figure or arteries, I'd be eating here all the time. ", "I think I read that there are 1000 calories in the 15"], "author": "3beeskitchen ..", "review": "The cheese steak with garlic is AMAZING...in fact...HEAVENLY! The side of curly fries are fried just perfectly with a crispy outside and soft inside. Their slogan is \" Caution: Might be habit forming\" and if I didn't have to watch my figure or arteries, I'd be eating here all the time. I think I read that there are 1000 calories in the 15\" and although it's horrible for you, their cheese steaks melt in your mouth and somehow, never leave you wanting just one.\n\nTuesdays are double stamp days and if you fill up a whole card, I believe you get a free cheese steak.\n\nGO HERE if you live in SF.\n\nPS. Their hot and sweet peppers are a must!!!", "rating": 5, "date": "2010-03-07"}, {"excerpts": ["I go with a basic beef stacked with sweet/hot peppers, garlic and onions. ", "Any objection from a kissing partner is quelled when you give 'em the other half. ", "Habit-forming? ", "Who cares? ", "There's a hospital across the street!"], "author": "Andy R.", "review": "It's the real Philly deal. The only fusion here is this sammitch to my face until it's gone. I go with a basic beef stacked with sweet/hot peppers, garlic and onions. Any objection from a kissing partner is quelled when you give 'em the other half. Habit-forming? Who cares? There's a hospital across the street!", "rating": 5, "date": "2006-04-07"}, {"excerpts": ["The Chicken Garlic sandwich is my favorite.  ", "But, this place lacks consistency.  ", "One day my order may be correct, hot, perfectly made and really tasty.  "], "author": "Karla F.", "review": "I am not from Philly.  Nor have I ever been to Philly.  But, I just have to hope that a \"real\" Philly cheese steak is much better than the stuff they serve at \"The Cheese Steak Shop\".\n\nI don't touch the beef because the texture is gritty...much like sand in my mouth.  I don't like sand in my mouth.  The Chicken Garlic sandwich is my favorite.  But, this place lacks consistency.  One day my order may be correct, hot, perfectly made and really tasty.  The next, it may be all wrong, lukewarm and taste like crap.  \n\n\nSo, why do I keep going here?  Cuz when it's good, it's so, so, good and the place is usually filled with brothas.  I like brothas...and others!", "rating": 3, "date": "2008-08-19"}, {"excerpts": ["Especially the Garlic steak. ", "Awesome flavor, not greasy in the least (better than philly's in that regard), real provolone or cheese-it..", "my only complaint--no pickles. ", "Pickles = philadelphia folks. ", "Every single damn deli in that town has a huge barrel of dill pickles....so 1 point down. ", "Also could use more of a variety of tasty cakes though I was happy they had my favorite peanut butter snack cakes. ", "Sadly this place is like an hour from my house by bus ", "and I don't own a car...", "carpool, anyone?"], "author": "shanestar h.", "review": "I was born and raised outside of Philadelphia. I've had a lot of cheese-steaks. This is better than Philly! Especially the Garlic steak. Awesome flavor, not greasy in the least (better than philly's in that regard), real provolone or cheese-it..my only complaint--no pickles. Pickles = philadelphia folks. Every single damn deli in that town has a huge barrel of dill pickles....so 1 point down. Also could use more of a variety of tasty cakes though I was happy they had my favorite peanut butter snack cakes. Sadly this place is like an hour from my house by bus and I don't own a car...carpool, anyone?", "rating": 5, "date": "2009-01-24"}, {"excerpts": ["Note: Don't be afraid to bring a vegetarian friend along if they'll step a foot in the place, their veggie sandwich is an awesome mix of sauteed mushrooms, spinach and other veggies with garlic, etc,, topped over melted cheese, yum!"], "author": "Emily J.", "review": "OK, I woud normally not admit that I eat here every now and then except that they deserve the recognition.... Thy are officially my once-in-a-blue-moon indulgence.\nNo need to get too complicated 7\" (OK 10\" if hungry) philly cheese steak sandwich with peppers and onions (yes, get the peppers and onions, they make it!). Any one of their deep fried sides makes a great accompaniment depending on your preference. Wait anxiously till they call your name and grub on!\nNote: Don't be afraid to bring a vegetarian friend along if they'll step a foot in the place, their veggie sandwich is an awesome mix of sauteed mushrooms, spinach and other veggies with garlic, etc,, topped over melted cheese, yum!", "rating": 5, "date": "2010-01-22"}, {"excerpts": ["Seven inches of philly steak, cheese, onion, garlic, and all the bell peppers you want for roughly a dollar an inch was worth the fifteen minute cooking time, but once I was at my desk and eating ", "I almost regretted my purchase - \"where's the cheese\"? ", "I couldn't taste my cheese at all; however, just like a chick flick there was the predictable \"happiness\" to follow these lowly feelings, for within my seventh bite I finally had my cheese! ", "I suggest eating your sandwich as soon as you get it otherwise your cheese will melt and gather into one part of the bread. ", "Still, despite my hiding cheese, the overall taste of the philly sandwich was phenomenal ", "and I suggest coming after the lunch rush so you can sit and enjoy your meal!"], "author": "Selina L.", "review": "Seven inches of philly steak, cheese, onion, garlic, and all the bell peppers you want for roughly a dollar an inch was worth the fifteen minute cooking time, but once I was at my desk and eating I almost regretted my purchase - \"where's the cheese\"? I couldn't taste my cheese at all; however, just like a chick flick there was the predictable \"happiness\" to follow these lowly feelings, for within my seventh bite I finally had my cheese! I suggest eating your sandwich as soon as you get it otherwise your cheese will melt and gather into one part of the bread. Still, despite my hiding cheese, the overall taste of the philly sandwich was phenomenal and I suggest coming after the lunch rush so you can sit and enjoy your meal!", "rating": 4, "date": "2009-05-25"}, {"excerpts": ["We ordered the mushroom and  garlic ( so we ordered two and both with provolone cheese). ", "The order came pretty quick actually because it was only like 5:30 pm, so", ".. yoohoo! ", "then, we tried them with a great anticipation...  aaahhh!!!  ", "I'd rather go to Charley's!! ", "It is far more tastier than this place. ", "Sorry! ", "but, I love their pickled peppers though!"], "author": "Daisy S.", "review": "I like philly cheese steak.. and my hubby is crazy about it. So, one day when we were craving for one, we YELP it and found out that many people love this place. Since the place is very close by to my work, we went here for dinner.. We ordered the mushroom and  garlic ( so we ordered two and both with provolone cheese). The order came pretty quick actually because it was only like 5:30 pm, so.. yoohoo! then, we tried them with a great anticipation...  aaahhh!!!  I'd rather go to Charley's!! It is far more tastier than this place. Sorry! but, I love their pickled peppers though!", "rating": 3, "date": "2009-01-09"}, {"excerpts": ["The last time I had one was actually at the San Leandro/Bayfair Mall location - I had the one with the whole cloves of garlic. ", "You gotta get it with the onions and the peppers, too.  ", "Good stuff."], "author": "Alice C.", "review": "It's probably a good thing that these don't exist near Davis or closer to my SF home in the Excelsior.  I'd probably would've died from a heart attack a lot earlier. From looking at their website, one is supposedly opening soon in Vallejo. If I'm really craving it I'd probably make the drive.  Apparently they are a franchise - SOMEONE MAKE ONE in Davis/Sac/Vacaville and I'm there!  The last time I had one was actually at the San Leandro/Bayfair Mall location - I had the one with the whole cloves of garlic. You gotta get it with the onions and the peppers, too.  Good stuff.", "rating": 5, "date": "2008-01-19"}, {"excerpts": ["I discovered the Garlic Cheese Steak with both types of peppers and curly fries about a year ago ", "and I have not ordered anything else since."], "author": "Keith J.", "review": "I have never been to Phili, but after eating here a few years ago I have one less reason to go. They are definitely \"Habit Forming\". I have been going to these since 1999 and have been to at least 4 locations around the Bay. I discovered the Garlic Cheese Steak with both types of peppers and curly fries about a year ago and I have not ordered anything else since.", "rating": 5, "date": "2008-11-14"}, {"excerpts": ["I highly reccommend one with hot peppers and whole roasted garlic cloves.  "], "author": "matthew w.", "review": "Best Cheesesteak in San Francisco by a long shot.  This place is so good, they have a sign up warning people not to counterfeit their frequent diner's cards for redemption on free sandwiches.  I highly reccommend one with hot peppers and whole roasted garlic cloves.  Stay away from anything that will be flavored predominantly by a sauce such as a pizza steak or bbq steak.  You will be much happier tasting other ingrediants.", "rating": 5, "date": "2005-05-25"}, {"excerpts": ["Great Garlic Cheesesteak.  ", "Whole roasted cloves in with the peppers and meat.  ", "Not your traditional from Philly cheesesteak.  ", "No cheesewhiz.  ", "But before I knew what a real PhillyCheese was, I thought this was the best.  ", "I call these SuckaFreeCheese steaks.  ", "Why cause they are unique to SF", ", tha Sucka Free.  ", "They really should make one with the whiz though, just in case some Philadelphians ever drop by.  ", "Damn now Im getting hungry."], "author": "Hen A.", "review": "Great Garlic Cheesesteak.  Whole roasted cloves in with the peppers and meat.  Not your traditional from Philly cheesesteak.  No cheesewhiz.  But before I knew what a real PhillyCheese was, I thought this was the best.  I call these SuckaFreeCheese steaks.  Why cause they are unique to SF, tha Sucka Free.  They really should make one with the whiz though, just in case some Philadelphians ever drop by.  Damn now Im getting hungry.", "rating": 5, "date": "2006-05-23"}], "barbecue": [{"excerpts": ["Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  "], "author": "Lawrence L.", "review": "Melted cheese, grilled steak, hot peppers, whole roasted garlic cloves, on a buttery toasted hoagie roll...  Mmmmmmmm....  Stumbled on this while driving through SF.  Used the iPhone Yelp app to check what was nearby, and BAM!  Found this gem...\n\nThey come in 3 sizes: 7\" ($4ish), 10\" ($6ish), and a whopping 15\" ($10ish).  Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  We tried the original and garlic.  Both were delish.\n\nDefinitely a place to go for a Philly Cheese Steak.  I've been to Philly, but have not had the cheese steaks there (how could I do that you may be asking??? Too short of a business trip).  Well, if this is what a Philly Cheese Steak should taste like, I'm a fan...  It definitely beats the other franchised version: Great Steak Company - that's for sure!\n\nThey had steak fries, curly fries for sides.  We had the Fiesta Poppers (jalapeno poppers)...  Yummy.\n\nThis place was definitely a hole-in-the-wall, but those are the best places in my book.  Their motto is - \"Caution: may be habit forming\", and I am glad I do not live nearby; otherwise, there would not be enough trips to the gym that could help me.", "rating": 4, "date": "2009-10-10"}, {"excerpts": ["2.5* Classic Philly Cheese Steak\n2.5* Barbecue with Smokey BBQ Sauce and Provolone"], "author": "Aaron L.", "review": "2.5* Classic Philly Cheese Steak\n2.5* Barbecue with Smokey BBQ Sauce and Provolone", "rating": 2, "date": "2011-05-30"}], "deluxe": [{"excerpts": ["He ordered a 15 inch deluxe cheesesteak with almost everything in the kitchen on it. "], "author": "Michael P.", "review": "Phenomenal!  Came here on the recommendation of a friend who's been coming for years and I was NOT disappointed. \n\nHe ordered a 15 inch deluxe cheesesteak with almost everything in the kitchen on it. 2 people could easily share it. \n\nI got a 10 inch regular philly with onions and peppers and was sent to heaven. Easily the best cheesesteak outside of actual philly. And super cheap! Have to limit myself to maybe once a month now.", "rating": 5, "date": "2015-09-08"}, {"excerpts": ["I ordered the 10-inch deluxe which, according to the menu, had a few variety of cheese and mushroom.  ", "It was an enjoyable meal, especially with the peppers I requested for.  "], "author": "H K.", "review": "It's been a long time since I had a cheese steak sandwich, and such experiences were pretty much limited to visiting Great Steak & Potato places at mall food courts.  Some colleagues decided to call for a lunch gathering here and I agreed to join in.  I was told to be there by 11:30am because they said the lunch crowd can be overwhelming, but that was not the case yesterday.  It could be because of it being a holiday week but I understand why it could get busy because of two hospitals (Kaiser and UCSF Mount Zion) being within a few blocks, along with other medical offices.\n\nI ordered the 10-inch deluxe which, according to the menu, had a few variety of cheese and mushroom.  It was an enjoyable meal, especially with the peppers I requested for.  A colleague ordered some fries that we shared, which in my mind was nothing fancy.\n\nOverall, for under $7 before tax, I'd say if given a choice of this or a foot-long Subway sandwich this will be the choice most of the time.  Service was overall pretty friendly also.", "rating": 3, "date": "2011-12-30"}, {"excerpts": ["I've been having the Deluxe Cheesesteak, xtra sweet/hot peppers at this franchise around the bay area for 18 years. ", "I was very sad to hear that these places no longer sell jars of peppers, since I love using them at home for my own cheesesteaks and hot dogs. ", "I will always love grabbing a 10\" at the shop now and then, but admittedly the beef could be a little better quality for the price and the portions have dwindled since the good 'ol days."], "author": "George P.", "review": "I've been having the Deluxe Cheesesteak, xtra sweet/hot peppers at this franchise around the bay area for 18 years. I was very sad to hear that these places no longer sell jars of peppers, since I love using them at home for my own cheesesteaks and hot dogs. I will always love grabbing a 10\" at the shop now and then, but admittedly the beef could be a little better quality for the price and the portions have dwindled since the good 'ol days.", "rating": 4, "date": "2015-03-31"}, {"excerpts": ["While her personal favorite is the deluxe cheese steak, she mentions \"...", "my only real complaint is that sometimes the clientele parks in front of \nour business and plays their music a little too loud for our customers to relax and get their nails done."], "author": "matt m.", "review": "Upon entering the door under a bright yellow awning, painted with the Liberty Bell logo, a smell of fresh bread, grilled onions, and peppers permeates the restaurant. \n\n\"We import fresh Amoroso rolls from Philly [Philadelphia, PA] twice each week...\" says James Talley, a manager and 15-year veteran of the grill at the original store on Divisadero Street, \"...nobody else in the city does that.\"\n\nIt is San Francisco's first, oldest, and most genuine of its kind--The Cheese Steak Shop, a favorite for many Bay Area residents and visitors since 1982.\n\n\"I like all of them, but my favorite now is definitely the mushroom steak\", says Talley. The mushroom steak sounds like what it is; mushrooms, onions, peppers and steak. \"Fifteen years ago I would eat the sandwiches on a daily basis, but now it has started to catch up with me\", as he rubs his belly over the red manager apron.\n\nThe company's motto--\"it may be habit forming.\"\n\n\"This place is pretty addictive...I love it...but try not to come here too often\" says Cobalt Janssen, 43, who grew up on the east coast but moved to San Francisco in his early twenties. \"I remember when they opened sometime in the early 80's, I had been to Philadelphia when I lived back east and this sandwich matches up to any of those.\"\n\nJanssen mentioned he likes to watch his figure though, because he assumes the role of  'Tina Sparklene' a hypnotist who performs in drag.\n\n\"Many of our customers will visit The Cheese Steak Shop before or after they come to us,\" explains Allison Wahl, 25, who has worked as a receptionist at the nail salon next door since it opened last year. \n\nWhile her personal favorite is the deluxe cheese steak, she mentions \"...my only real complaint is that sometimes the clientele parks in front of \nour business and plays their music a little too loud for our customers to relax and get their nails done.\"\n\nThe Cheese Steak Shop currently operates 10 stores throughout the Bay Area, and is looking to expand its fresh and flavorful--albeit unhealthy habit, throughout the western United States.\n\n(Matt McKnight, 2009)", "rating": 5, "date": "2009-05-05"}, {"excerpts": ["The deluxe is essentially the same thing, only with mushrooms.  ", "Tuesdays are double stamp days - fill up a whole card with them ", "and you get a free cheesesteak.  ", "Avoid this place during lunch time.  ", "The wait gets long especially if there's an ignorant Kaiser/UCSF employee ordering for 10 without phoning in ahead of time."], "author": "O'Shea J.", "review": "Been going here since I was a kid.  When Will Smith said in the 1st season of Fresh Prince that a real cheesesteak has enough grease to soak the paper bag, this is what he was talking about.  They don't do the Cheese Whiz stuff here (for that go to Jake's).  All of their varieties are good for the most part but I always get the pizza steak (not the one w/ pepperoni though).  The deluxe is essentially the same thing, only with mushrooms.  Tuesdays are double stamp days - fill up a whole card with them and you get a free cheesesteak.  Avoid this place during lunch time.  The wait gets long especially if there's an ignorant Kaiser/UCSF employee ordering for 10 without phoning in ahead of time.", "rating": 5, "date": "2007-06-28"}, {"excerpts": ["OK listen, don't mess around, get a large Deluxe with sweet and hot peppers and grilled onions (\"with\"). ", "I cannot emphasize enough how important both the sweet and hot peppers are to the experience. ", "And for the love, no chicken or turkey or anything else. ", "BEEF STEAK. ", "After that, yes there are other tasty things here, but if it's your first time, start with this. ", "Eating hot off the grill is good, but they are also fantastic when taken home and giving the grease time to just slightly congeal, and the flavors to mix. "], "author": "Ben S.", "review": "OK listen, don't mess around, get a large Deluxe with sweet and hot peppers and grilled onions (\"with\"). I cannot emphasize enough how important both the sweet and hot peppers are to the experience. And for the love, no chicken or turkey or anything else. BEEF STEAK. After that, yes there are other tasty things here, but if it's your first time, start with this. Eating hot off the grill is good, but they are also fantastic when taken home and giving the grease time to just slightly congeal, and the flavors to mix. Plus, your car will smell amazing inside for a week.\n\nI've been going to this place for 20 years (University in Berkeley and more recently on Divisidero in SF) and it's remained remarkably consistent. They grill the meat the same way (chop it up on the grill with a pair of spatulas) and use the same authentic ingredients. I asked a woman who works there once about the meat and she said something about they got the meat from the east coast because they wanted yellow fat where I guess meat on the west coast tends to be marbled with white fat. No idea if that's still true but I do know they still get the bread (roll) from Philly, a critical component. I think maybe the cheese too.\n\nLoads of grease? Check. Calories equal to the recommended daily amount for a small village? Check. Gooey cheese and accompanying cholestorol? Check check. This stuff will kill you if you eat it everyday, but wow...so rarely have I gotten cravings so often in the middle of the night for a certain food (this along with Flint's and Zachary's). This is one of the best sandwiches you will ever have in your life and if you don't think so then I think you should just pack it in now.", "rating": 5, "date": "2007-10-07"}], "hoagie": [{"excerpts": ["My mom always used to bring home a hoagie for me and that's what I still get. ", "Sometimes I mess with the different fried sides ", "but it's all about that cheese steak or hoagie."], "author": "Randy B.", "review": "Been coming to this place for years. My mom always used to bring home a hoagie for me and that's what I still get. Sometimes I mess with the different fried sides but it's all about that cheese steak or hoagie.", "rating": 5, "date": "2017-10-31"}, {"excerpts": ["My favorite place to grab a chicken hoagie. ", "It's the bread that makes it all work together. ", "Add some sweet peppers and curly fries and you are good to go! ", "Parking can be tough. ", "Can't wait to come back"], "author": "Pravin L.", "review": "My favorite place to grab a chicken hoagie. It's the bread that makes it all work together. Add some sweet peppers and curly fries and you are good to go! Parking can be tough. Can't wait to come back", "rating": 4, "date": "2016-02-08"}, {"excerpts": ["Delicious hoagie! ", "Dale was such a nice guy. ", "Talking with him you could see where the Fonz got his coolness from. ", ":) definitely come here again when in town."], "author": "Sarah A.", "review": "Delicious hoagie! Dale was such a nice guy. Talking with him you could see where the Fonz got his coolness from. :) definitely come here again when in town.", "rating": 4, "date": "2016-09-23"}, {"excerpts": ["On our first trip to the register, we ordered a Philly Cheese Steak, Hoagie Cheese Steak, Zesty Veggie Sandwich, Steak Fries, and Onion Rings. ", "When we received our order, we got an Italian Hoagie, Zesty Veggie, Fries, and Rings. ", "So the first thing my bf noticed was that they made the wrong Hoagie ", "- he wanted a Hoagie Cheese Steak, but got the Italian Hoagie instead. ", "Then as we waited longer, there was ", "BF gets back in line for the second time - orders Philly Cheese Steak and Hoagie Cheese Steak cause he still wants to get what he planned to order in the first place. ", "This time, he gets the order and gets the Philly Cheese Steak only. ", "He checks the receipt again, the cashier never placed the order for the Hoagie. "], "author": "Tiffany K.", "review": "Food is pretty good here, but service was horrible when we visited yesterday. The boyfriend randomly thought about this place and craved it, so we went for a late Sunday lunch.\n\nOn our first trip to the register, we ordered a Philly Cheese Steak, Hoagie Cheese Steak, Zesty Veggie Sandwich, Steak Fries, and Onion Rings. When we received our order, we got an Italian Hoagie, Zesty Veggie, Fries, and Rings. So the first thing my bf noticed was that they made the wrong Hoagie - he wanted a Hoagie Cheese Steak, but got the Italian Hoagie instead. Then as we waited longer, there was no Philly Cheese Steak - went to the pickup counter, and they never placed the order.\n\nBF gets back in line for the second time - orders Philly Cheese Steak and Hoagie Cheese Steak cause he still wants to get what he planned to order in the first place. This time, he gets the order and gets the Philly Cheese Steak only. He checks the receipt again, the cashier never placed the order for the Hoagie. Granted, we should have checked the receipt before, but we gave the cashier the benefit of the doubt.\n\nNow, mistakes are okay - we all make them, but the cashier was rude about it. She started lecturing him on how he should have made it clear he wanted two separate sandwiches, cause all she kept hearing was cheese steak and assumed one. \n\nAlready the first time around, when they didnt get the order, I feel like the guys cooking or the cashier should have done something to speed up the process for us to get back in line. My bf had to get back in line, which was long, to re order. We pretty much spent the most of our time there waiting for the food to be right.\n\nOn top of it all, our onion rings were completely burnt and all the rings were stuck together and hard, couldn't even take them apart to eat them - why would you serve it out to your customers like that!\n\nOkay, so the food is pretty good, but after this experience, we're pretty scarred. Usually I'm not one to complain on Yelp, but we spent our entire time here pretty pissed. We noticed that the cashier took a few other customers' orders incorrectly too... Get it together woman! And don't be rude to your customers, PERIOD. \n\nSince I don't review solely on one thing, I'll give them 3 stars. Food is good, but the staff working at the time of our visit just didn't give a sh*t.", "rating": 3, "date": "2011-12-05"}, {"excerpts": ["Melted cheese, grilled steak, hot peppers, whole roasted garlic cloves, on a buttery toasted hoagie roll...  ", "Mmmmmmmm", "....  Stumbled on this while driving through SF.  ", "Used the iPhone Yelp app to check what was nearby, and BAM!  ", "Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  ", "We tried the original and garlic.  "], "author": "Lawrence L.", "review": "Melted cheese, grilled steak, hot peppers, whole roasted garlic cloves, on a buttery toasted hoagie roll...  Mmmmmmmm....  Stumbled on this while driving through SF.  Used the iPhone Yelp app to check what was nearby, and BAM!  Found this gem...\n\nThey come in 3 sizes: 7\" ($4ish), 10\" ($6ish), and a whopping 15\" ($10ish).  Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  We tried the original and garlic.  Both were delish.\n\nDefinitely a place to go for a Philly Cheese Steak.  I've been to Philly, but have not had the cheese steaks there (how could I do that you may be asking??? Too short of a business trip).  Well, if this is what a Philly Cheese Steak should taste like, I'm a fan...  It definitely beats the other franchised version: Great Steak Company - that's for sure!\n\nThey had steak fries, curly fries for sides.  We had the Fiesta Poppers (jalapeno poppers)...  Yummy.\n\nThis place was definitely a hole-in-the-wall, but those are the best places in my book.  Their motto is - \"Caution: may be habit forming\", and I am glad I do not live nearby; otherwise, there would not be enough trips to the gym that could help me.", "rating": 4, "date": "2009-10-10"}, {"excerpts": ["I always get the cheese steak hoagie with everything. ", "King size it for double meat and cheese for 2 bucks or so. ", "Get the curly fries and a drink and you have a best \"junk food\" meal ever. ", "Usually long lines but so worth it. ", "Just soak up the grease in the air !"], "author": "Bobby L.", "review": "The best cheesesteak I have ever had. And I've been around philly and tried cheese steaks all over the states. I always get the cheese steak hoagie with everything. King size it for double meat and cheese for 2 bucks or so. Get the curly fries and a drink and you have a best \"junk food\" meal ever. Usually long lines but so worth it. Just soak up the grease in the air !", "rating": 5, "date": "2014-12-15"}, {"excerpts": ["I would like to try the hoagie though, which comes with lettuce, and tomato.  ", "I'm not really into the side dishes they have.  "], "author": "Anthony N.", "review": "CHEEEESSEEESSSTEEEAAAKKKKSSS!!!!!! \n\nHands down the Cheese Steak Shop makes the best cheese steaks.  Nothing fancy here.  The meat is chopped up nice and fine with the cheese and onions mixed right in.  The bread is goldilocks too, not to soft, not to hard.  The hot and sweet peppers are also a must.  The peppers make the sandwich, to be honest.  There are 3 different sizes you can choose from; the 7 inch, 10 inch, and 15 inch.  I've only had the original and it's the bomb diggity ill nana.  I would like to try the hoagie though, which comes with lettuce, and tomato.  I'm not really into the side dishes they have.  Spiral fries are pretty standard.  \n\nAs for the Decor, it's pretty outdated.  There's all these pictures of famous Cheese Steak shops, which are framed and all hung crooked.  The place is a little bit dirty, but I don't mind because the sandwiches are so good; I always get my cheese steaks to go.  Oh, I forgot to mention the bad ass \"Hook\" poster they have, which is signed by Robin Williams.  If this shop cleaned up and remodeled a little bit, it would definitely be 5 stars.", "rating": 4, "date": "2012-04-18"}, {"excerpts": ["The hoagie was just bad. ", "Bologna instead of advertised mortadella. ", "No capicola. ", "Bland salami. ", "Place is cutting corners on the food."], "author": "Sub S.", "review": "The service is very nice. The food is not very good. The cheese steak meat is lacking and dry, might have been steakums. The bread was a bit stale and not bouncy like amoroso bread should be which negatively affects meat juice and cheese absorption. The hoagie was just bad. Bologna instead of advertised mortadella. No capicola. Bland salami. Place is cutting corners on the food.", "rating": 2, "date": "2013-09-28"}, {"excerpts": ["One hoagie style (with lettuce, tomato, and mayo) and one regular.  ", "Both ten inches.  ", "Oh my Goodness!  ", "We have been coming here for decades and they still have the Best Cheese Steaks in the entire Bay Area.  ", "The Steak was seasoned perfectly and the bread was soft and fresh.  ", "These sandos were the perfect Cheese Steaks.  "], "author": "D.c.g G.", "review": "We had to go here for lunch today.  We ordered two Cheese steaks.  One hoagie style (with lettuce, tomato, and mayo) and one regular.  Both ten inches.  Oh my Goodness!  We have been coming here for decades and they still have the Best Cheese Steaks in the entire Bay Area.  The Steak was seasoned perfectly and the bread was soft and fresh.  These sandos were the perfect Cheese Steaks.  The Steak fries were awesome and the New fried potato chips were excellent.  We have had Cheese Steaks from almost every place in the Entire Bay Area and everyone else seems to try and duplicate The Cheese Steak Shop's recipe.  They all Failed!!!  This is By Far the best!  If you have not been here yet, then you have not had a Real Authentic Cheese Steak.  We love this spot and all the other Cheese Steaks suck compared to this place.  \"Caution May Be Habit Forming\" is their motto for a good reason.", "rating": 5, "date": "2012-12-04"}, {"excerpts": ["Cheese steaks are pretty good - not enough meat but stay away from the hoagie so wrong - they have no clue what they are doing with the hoagie - very disappointing"], "author": "sherri s.", "review": "Cheese steaks are pretty good - not enough meat but stay away from the hoagie so wrong - they have no clue what they are doing with the hoagie - very disappointing", "rating": 3, "date": "2014-11-08"}, {"excerpts": ["Ryry loves getting their hoagie cheesesteak and use his frequent buyer card in which you get a free cheesesteak for every 10 you buy. ", "*", "*", "*"], "author": "Christine C.", "review": "CAUTION: May be habit forming (the message on their awning)\n\nAnd I believe their message is true. Ryry loves this place, I've only been once and I had a good time. \n\nRyry loves getting their hoagie cheesesteak and use his frequent buyer card in which you get a free cheesesteak for every 10 you buy. ***Tuesdays are DOUBLE STAMP DAYS!\n\nLots of sides to choose from but their curly fries are where it's at! They are awesome - not too greasy, very crispy! Other main ingredients available in their cheesesteaks- not just beef, but chicken, veggies, too. \n\nDecor, not so great, but food definitely makes up for it! + friendly, efficient staff + eco friendly environment where they promote the re-using of wicker baskets for food serving and utilizing recycling bins.\n\n(Ryry's only gripe: the hot peppers could be hotter!)\n\n(check out my food pics!)", "rating": 4, "date": "2009-01-24"}, {"excerpts": ["Believe it or not I don't come here for the cheesesteaks I usually get the Italian hoagie with extra sweet peppers. ", "OMG. ", "it's good!..."], "author": "Crystal P.", "review": "Believe it or not I don't come here for the cheesesteaks I usually get the Italian hoagie with extra sweet peppers. OMG. it's good!...", "rating": 5, "date": "2013-06-04"}, {"excerpts": ["I had the 7 inch hoagie with no mayo ", "and it was the perfect size.   ", "The meat was tasty and not overly salty or fatty.  ", "The fried zucchini were only ok because the breading to zucchini ratio was off.  "], "author": "Seong P.", "review": "I reviewed the wrong place!  This review should be for The Cheese Steak Shop, not Jay's.\n----------------\nThe first thing Tintin said when he woke up was that he wanted a cheesesteak so off we went.  I had the 7 inch hoagie with no mayo and it was the perfect size.   The meat was tasty and not overly salty or fatty.  The fried zucchini were only ok because the breading to zucchini ratio was off.  Too much breading.\n\nParking was easy, the cheesesteaks were good and I'm curious to try the other sides so I know we'll be back.  .", "rating": 4, "date": "2009-10-12"}, {"excerpts": ["If you want a rec for one I would suggest the Hoagie or the Bacon one."], "author": "Sonlay V.", "review": "This place is delicious-o! I went to this place after work yesterday with a few of my friends and instantly when I walked in I could tell this place was going to be good. The place is your typical downtown sandwich looking place, but the food they cook is delicious. Their cheese steak is probably one of the best I have ever had. \n\nThe thing I like about this place though is that the prices are actually good. They food is really good so I expected it to be expensive, but surprisingly a 7\", 10\", and even the 15\" was reasonably price. I would def. recommend this place to somebody. Their types of cheese steaks are very good. \n\nIf you want a rec for one I would suggest the Hoagie or the Bacon one.", "rating": 5, "date": "2010-07-14"}, {"excerpts": ["I usually get the Value meal which includes: A Hoagie w/cheese, lettuce and tomato,a soda and twister fries! ", "I love those peppers they use on the sandwich. ", "(where can I buy them?) "], "author": "Shanika M.", "review": "This place is the bomb! I go here at least once a month. If it was in my neighborhood I would go more often. \nI usually get the Value meal which includes: A Hoagie w/cheese, lettuce and tomato,a soda and twister fries! I love those peppers they use on the sandwich. (where can I buy them?) The wait can be awhile at times, the workers are nice and the prices are in my budget range.\n\nWriting this review makes me want one! NOW!", "rating": 5, "date": "2009-04-02"}, {"excerpts": ["Still a favorite to this day, they make solid Philly style grub thanks to using only Amoroso hoagie rolls, which is key. ", "Everything is served up just right, but they'll maybe forget your peppers, which technically should be grilled into the meat. \n", "I get my Philly on sitting next to the old photos and license plates of 'home' that adorn the walls."], "author": "Colleen B.", "review": "When I first moved to SF in 1993 I visited the East Bay briefly and had a cheesesteak at the sister location to this shop. Being wet behind the ears it took me a good 5 years before I realized they had a chain with one right up Divis from my house. D'oh!\nStill a favorite to this day, they make solid Philly style grub thanks to using only Amoroso hoagie rolls, which is key. Everything is served up just right, but they'll maybe forget your peppers, which technically should be grilled into the meat. \nI get my Philly on sitting next to the old photos and license plates of 'home' that adorn the walls.", "rating": 4, "date": "2009-03-09"}, {"excerpts": ["If you don't want steak/chicken, their Italian Hoagie is another good choice. "], "author": "Juliane N.", "review": "OK.. so I've been working next to this place for a little over a year.. When I first worked here, i use to eat here twice a week... until I gained weight... So I avoided this place until I lost the weight that I've gain.. So now i just eat it once every two weeks.. OK fine, maybe once a week.. Man I love this place but not what it does to me waist line. AnywhoOoo ...\nBacon cheesesteak with extra cheese \nSpinach/mushroom cheesesteak\nPhilly Cheesesteak (the regular one with just cheese and make sure to get grilled peppers and onions)\ntheir chicken cheesesteaks are awesome too!\nIf you don't want steak/chicken, their Italian Hoagie is another good choice. Loaded with Italian meat \nand side of LARGE twister fries or onion rings are a must. You're already eating 3,000 calories, might as well eat another 1,000.. \n\nI love how they have a frequent stamp card where you get it stamped every time you order a meal there and when it's filled you get a free 10\" cheesesteak of your choice! Mine gets filled fast since I'm such a fat ass eating it all the damn time but hey, at least I get some for free! Love the guys that work there, always cracking some jokes and laughing with me or at me..", "rating": 5, "date": "2007-11-04"}, {"excerpts": ["Ordering extra meat would make for a better hoagie. ", "Great value overall."], "author": "Judy K.", "review": "in college, I used to go to the version near Berkeley ALL THE TIME, stamping away at my frequent flier card like no other, collecting free sandwiches as a proud regular. I came to this one in SF for the first time after a 7+ year hiatus....  the same yummy meat w/ the same awesome sweet/hot peppers! One difference is they give less meat here than I remember (or am I just a bigger eater now? nah, I doubt it). Minus the peppers what is leftover is slightly lacking in size. Ordering extra meat would make for a better hoagie. Great value overall.", "rating": 4, "date": "2011-06-17"}, {"excerpts": ["I've ordered the same sando for years:\n\nChicken Hoagie, 10 inch, easy on the mayo, lettuce, tomato, and provolone.\n\n", "We just stopped in tonight (btw, Tuesday is double stamps day- fill a card get a free hoagie) and it was simply good.  ", "Stopping in and grabbing a table, listening to the R&B that plays on the radio, makes me miss living in the hood."], "author": "Valarie A.", "review": "I've never been to Philly for a real cheese steak, but the California version suits me just fine.  I've ordered the same sando for years:\n\nChicken Hoagie, 10 inch, easy on the mayo, lettuce, tomato, and provolone.\n\nWe just stopped in tonight (btw, Tuesday is double stamps day- fill a card get a free hoagie) and it was simply good.  Stopping in and grabbing a table, listening to the R&B that plays on the radio, makes me miss living in the hood.", "rating": 4, "date": "2008-02-26"}, {"excerpts": ["and I crave, CRAVE a 10\" hoagie cheesesteak with hot and sweet peppers.  ", "Extra mayo.  ", "I have dreams about you.  ", "I have 2 yellow stamp-cards: one in my car and one in my wallet.  ", "Just in case.  "], "author": "blackbird e.", "review": "Damn you, Cheese Steak Shop.\n\nThese are tears of longing.  I up and moved to LA a couple of years ago and I crave, CRAVE a 10\" hoagie cheesesteak with hot and sweet peppers.  Extra mayo.  I have dreams about you.  I have 2 yellow stamp-cards: one in my car and one in my wallet.  Just in case.  See you on my next trip.\n\nDamn you.", "rating": 5, "date": "2007-07-06"}, {"excerpts": ["Like many sandwiches--the muffalatta, hoagie, lobster roll, po'boy--the cheesestake absolutely requires the correct bread or the whole shebang is worthless! ", "The Cheesesteak Shop has it right as they use Amoroso rolls! "], "author": "Wendy G.", "review": "Like many sandwiches--the muffalatta, hoagie, lobster roll, po'boy--the cheesestake absolutely requires the correct bread or the whole shebang is worthless! The Cheesesteak Shop has it right as they use Amoroso rolls! Hot, yummy, cheesy goodness! \n\nAnd, this is the first time I'm actually glad a restaurant doesn't deliver! Too dangerous!\n\nNote to Whiz fans--nope, it's all about the white American or provolone cheese here\n\nNote to my Philly friends--I'll say this one is closer to a Jim's steak that Pat's or Geno's\n\nP.S. They also sell Tastykakes for those of you craving your Butterscotch Krimpets!", "rating": 5, "date": "2007-06-21"}, {"excerpts": ["Buy 3 Sandwiches and get a 7\" Sandwich FREE (Xtras Not Included)\n\nb) Buy any size Italian Hoagie and get 50% off second Italian Hoagie of the same size or smaller\n\nc) "], "author": "Mark W.", "review": "One of the better cheesesteaks I have had.  I really like the sweet peppers they put on them.  That really adds to it.  Haven't been here in a while but what I remember was that they take pretty long.  Not sure if things have changed but I know one of my friends told me that the best thing to do it phone in your order ahead of time.  \n\nI've had some cheesesteaks at some regular diners and I think the best suggestion is to NOT order cheesesteaks at places that do not specialize in them.  Then again, many people may already know this.  \n\nGotta say though, I think they are better than Geno's in Philly.  When I was in Philly, I had a choice of the 2 Cheesesteak landmarks in this Country and it was between Pat's and Geno's, which are right across the street from each other, and I pretty much chose the wrong place.  \n\nI made the mistake of going to the cleaner place with no line (Geno's) when I probably should have went to Pat's (dirtier looking place WITH a line).  \n\nBut that's probably a conversation for another day...  \n\nI guess the topic was cheesesteaks and it brought me back to daydreaming about my Philly trip a few years back......  \n\nWell, let's get back to business.  Let's just say if I was in San Francisco and I had the urge for a CheeseSteak, this is probably the place I would go....\n\nDAILY SPECIALS:\nBe sure to get a Frequent Buyer's Card (1 stamp for every $7 purchase; 12 Stamps = 1 FREE 10\" Sandwich)\n\nTUESDAYS are Double Stamp Days\n\nWACKY WEDNESDAYS: \na) Buy 3 Sandwiches and get a 7\" Sandwich FREE (Xtras Not Included)\n\nb) Buy any size Italian Hoagie and get 50% off second Italian Hoagie of the same size or smaller\n\nc) Half off these sides - ALL DAY Wednesday, Every Wednesday: Fries, Twister Fries, Onion Rings, Chips, Tastykakes", "rating": 5, "date": "2007-10-23"}, {"excerpts": ["I went with the 7\" hoagie because I always get the hoagie at whichever cheesesteak institute I visit. ", "There's something so unbelievably amazing about having the regular cheesesteak combo served with lettuce, tomatoes, mayo, provolone cheese, sans onions. ", "Mmm. ", "But that \"mmm\" turned into a \"hmm\" the second we received our cheesesteaks. ", "While the lover ordered the classic Philly and I ordered the hoagie, I strangely could not differentiate which cheesesteak was which. ", "They looked mundanely the same. ", "Little roll filled with shriveled up meat covered by a medley of colorful yet unappetizing peppers. ", "The lover obviously figured which was his, being that he actually likes this place, whereas me on the other hand had to figure out my lettuce, tomatoes and mayo were covered under that shriveled meat blanket. ", "All that hot meat that laid on top of my veggies left them pathetically wilted and greasy. ", "There wasn't enough mayo ", "and I barely recall any cheese to that hoagie. ", "The meat was not even close to being considered seasoned, it was as if I were chewing tasteless rubber that was sloppily lodged in between bread. ", "*sigh. ", "I sat there in despair, munching away that poor excuse for a cheesesteak. "], "author": "Ally C.", "review": "With the name of Cheese Steak Shop, you'd think cheesesteaks are their specialities, that they've mastered this simple concoction of buttery roll, seasoned meat, grilled onions and melted cheese over their years of establishment. And with people writing high reviews and the lover stating that it beats (my fave) Fat Philly's, how could I not resist?\n\nI went with the 7\" hoagie because I always get the hoagie at whichever cheesesteak institute I visit. There's something so unbelievably amazing about having the regular cheesesteak combo served with lettuce, tomatoes, mayo, provolone cheese, sans onions. Mmm. But that \"mmm\" turned into a \"hmm\" the second we received our cheesesteaks. While the lover ordered the classic Philly and I ordered the hoagie, I strangely could not differentiate which cheesesteak was which. They looked mundanely the same. Little roll filled with shriveled up meat covered by a medley of colorful yet unappetizing peppers. The lover obviously figured which was his, being that he actually likes this place, whereas me on the other hand had to figure out my lettuce, tomatoes and mayo were covered under that shriveled meat blanket. All that hot meat that laid on top of my veggies left them pathetically wilted and greasy. There wasn't enough mayo and I barely recall any cheese to that hoagie. The meat was not even close to being considered seasoned, it was as if I were chewing tasteless rubber that was sloppily lodged in between bread. *sigh. I sat there in despair, munching away that poor excuse for a cheesesteak. The only bright side to my meal was the twister fries drenched in cheese sauce.\n\nNever again Cheese Steak Shop, never again.", "rating": 2, "date": "2011-07-13"}, {"excerpts": ["The Cheesesteak Hoagie (steak, cheese, lettuce, tomatos, and mayo) topped with sweet and spicy peppers is my personal favorite on the board. "], "author": "jeff c.", "review": "Best Cheesesteaks in town! Seriously you will not be disappointed. I've been coming to this place for years and each time I grub here, the sandwiches still taste as good as when I first tried them. The joint is a little dirty and smells like a big ol' grease market, but hey you knew that already right? It's a cheesesteak shop. What did you expect?\n\nThe Cheesesteak Hoagie (steak, cheese, lettuce, tomatos, and mayo) topped with sweet and spicy peppers is my personal favorite on the board. Paired with an order of their twister fries, it's a meal fit for a king. My only small complaint about this place is orders do take entirely too long to come out. Don't know if the bread is baked to order  or what, but 15 -20 minutes from order to arrival can get a little irritating. Oh well though, still totally worth it.\n\nFor those of you who've only sampled cheesesteaks at your local Subway or Great Steak & Fry,  stop by The Cheesesteak Shop. You will seriously be blown away.", "rating": 5, "date": "2008-07-27"}, {"excerpts": ["I always tend to go for the hoagie just because I like all the toppings (lettuce, tomato, peppers, mayo) "], "author": "Ray S.", "review": "This place is a classic.  I don't think they can match up to the cheese steak carts in Philly who's sandwiches melt in your mouth, but I live in San Fran so I'm gonna pretend like I've never had those before.  \nI always tend to go for the hoagie just because I like all the toppings (lettuce, tomato, peppers, mayo) but I've had their chicken steak and pizza steak too, and those are good.  \nI love those peppers.. can't get enough of em.  You can ask them to cook the peppers on the grill with the meat if its not to busy..this is what I prefer.\nGet their curly fries.\nMake sure you're in close proximity to a nice comfy couch you can pass out on after wards..this meal will put you down for a few hours.", "rating": 5, "date": "2007-09-26"}, {"excerpts": ["Had a hoagie style steak sandwich the other day and yup, still 5 stars, still down and dirty comfort food. \n\n"], "author": "Yee-Shing W.", "review": "Had a hoagie style steak sandwich the other day and yup, still 5 stars, still down and dirty comfort food. \n\nOh and learned that you can get frequent buyer cards. On Tuesdays and Sundays, you get double stamps. And they have some other specials posted on the walls too. Once you fill up your card, you'll get a free 10in sandwich. Shouldn't be too hard to do at my rate...", "rating": 5, "date": "2010-07-23"}, {"excerpts": ["Cheese Steak Hoagie with onions and sweet peppers. ", "Definitely habit forming."], "author": "K L.", "review": "Cheese Steak Hoagie with onions and sweet peppers. Definitely habit forming.", "rating": 5, "date": "2013-06-12"}, {"excerpts": ["If you're gonna serve a 7\" cheesesteak, get a full size hoagie roll and slice it in half.  "], "author": "Danielle I.", "review": "Pathetic. With a capital P.\nGranted- I'm from Philly, and we transplants can be kind of picky about our cheesesteaks.  And I've definately had much worse. That being said-\nPathetic.\n\nThe meat was good- chopped up nice, decent amount of cheese and onions.  But not nearly enough of it.  I shouldn't be left with empty bun at the end.  \nAnd about that bun- are you kidding me?  Really?  I don't care if it's authentic Amoroso's- it was miniture like a hot dog bun.  Seriously.  Really?\nIf you're gonna serve a 7\" cheesesteak, get a full size hoagie roll and slice it in half.  And put some more meat in it for god's sake.\n\nI've been here before and wasn't impressed, but I was in the neighborhood and starving.  Quite frankly, I should have walked the 20 blocks to Jake's.", "rating": 2, "date": "2009-01-10"}, {"excerpts": ["i actually didn't get the cheesesteak and opted for the warm italian hoagie instead (more \"stuff\" on it :", "P).  ", "the twisty fries smell fabulous too, but i haven't tried them.  ", "tuesdays are double stamp days (for their stamp card).  ", "although you technically only get stamps for purchases of $6 or more (and that's a big ass sandwich you get for $6), laides be sure to bat your lashes a lot.  ", "i got ", "quadruple stamps two tuesdays in a row just for smiling :)  ", "(yeah i'm a sucker for special treatment).  "], "author": "Roshni R.", "review": "working in some of the polished medical/research buildings along this stretch of divis, it's easy to forget that you're smack dab in the ghetto...until you walk into the cheesesteak shop, that is.  the first time i walked in here (broad daylight, peak lunch time, tuesday afternoon), i actually thought i might get mugged.  \n\ninstead, i had one of the most fantastic sandwiches i've had since srini and i got baked and had ib hoagies (from berkeley).  i actually didn't get the cheesesteak and opted for the warm italian hoagie instead (more \"stuff\" on it :P).  the twisty fries smell fabulous too, but i haven't tried them.  tuesdays are double stamp days (for their stamp card).  although you technically only get stamps for purchases of $6 or more (and that's a big ass sandwich you get for $6), laides be sure to bat your lashes a lot.  i got quadruple stamps two tuesdays in a row just for smiling :)  (yeah i'm a sucker for special treatment).  oh, and wednesdays you get three sandwiches for the price of two.\n\ncome here for fantastic food, and to emerge from whatever ivory towers you and i live in to rub elbows with the rest of the cityfolk, but of course be forewarned, that as threatened by any good cheesesteak, your order is of course instant heart disease!", "rating": 4, "date": "2006-09-04"}, {"excerpts": ["The only exception to the no mayo rule: the cheesesteak hoagie.  ", "Oh my God, this thing melts in your mouth.  ", "My friends--this is a totally true story, I swear-- went here after work to pick up a huge sandwich to split at a bar.  ", "They picked up the sandwich, went to the bar, and as they were unwrapping it, dropped the thing on the floor.  ", "They looked at each other, mouthed something about the five second rule, picked it up, and ate it.  ", "Seriously.  ", "It's that good."], "author": "Tangerine L.", "review": "The only exception to the no mayo rule: the cheesesteak hoagie.  Oh my God, this thing melts in your mouth.  My friends--this is a totally true story, I swear-- went here after work to pick up a huge sandwich to split at a bar.  They picked up the sandwich, went to the bar, and as they were unwrapping it, dropped the thing on the floor.  They looked at each other, mouthed something about the five second rule, picked it up, and ate it.  Seriously.  It's that good.", "rating": 5, "date": "2006-04-08"}, {"excerpts": ["Hands Down the best Philly in town--I order the chicken cheese hoagie with grilled onions ", "so I can kid myself that it truly is the healthy option. ", "I know that others will argue over who has the best--similar to the Geno's and Pat's rivalry in South Philly--but I love this place. ", "Word of advice, call in your order and save yourself some time."], "author": "Deborah S.", "review": "Hands Down the best Philly in town--I order the chicken cheese hoagie with grilled onions so I can kid myself that it truly is the healthy option. I know that others will argue over who has the best--similar to the Geno's and Pat's rivalry in South Philly--but I love this place. Word of advice, call in your order and save yourself some time.", "rating": 5, "date": "2007-05-07"}, {"excerpts": ["I was hoping to find a great hoagie shop in the city ", "and I finally found it!  ", "It is what it is.  ", "Mouth-watering juicy bites of sandwich heaven.  ", "It compares with the Philly's Best franchise in southern california."], "author": "Louie N.", "review": "Cheese steaks are my specialty.  This is what keeps me going.  I was hoping to find a great hoagie shop in the city and I finally found it!  It is what it is.  Mouth-watering juicy bites of sandwich heaven.  It compares with the Philly's Best franchise in southern california.", "rating": 5, "date": "2006-10-09"}, {"excerpts": ["Just glue the hoagie to my thighs ", "and we'll call it a day."], "author": "Inbal R.", "review": "Its hard to walk passed this place, even after lunch.  Just glue the hoagie to my thighs and we'll call it a day.", "rating": 5, "date": "2007-03-27"}, {"excerpts": ["If I'm in Atlantic City I'll go to the White House and have a hoagie. ", "But every once in a while I need to git my Philly on, or I'm having cancer treatment at UCSF down the street and need a bit of pick me up ", "I'll stop in and check this place out. ", "It's pretty good. ", "I give it an extra star because the people who work there are really good. ", "(full this disclosure- ", "I used to hoop with some of these guys. ", "Rick ((aka Rico, the manager, I think, gave me one of my ", "you're getting old and soft moments when I blocked his shot, but ended up going higher, with my hand still on the ball then ended up on my ass, and his shot went ", "in- ", "I subsequently moved on to the geezer court)) ", "Wow, my first Yelp use of double parentheses! ", "I must be in digression mode! ", "Good food, hoagies with oil vinegar oregano stuff. ", "Yeah!"], "author": "James T.", "review": "I'm not really a cheesesteak eater. When I'm in Philly I go to Tony Luke's and have the pork with broccoli rabe. If I'm in Atlantic City I'll go to the White House and have a hoagie. But every once in a while I need to git my Philly on, or I'm having cancer treatment at UCSF down the street and need a bit of pick me up I'll stop in and check this place out. It's pretty good. I give it an extra star because the people who work there are really good. (full this disclosure- I used to hoop with some of these guys. Rick ((aka Rico, the manager, I think, gave me one of my you're getting old and soft moments when I blocked his shot, but ended up going higher, with my hand still on the ball then ended up on my ass, and his shot went in- I subsequently moved on to the geezer court)) Wow, my first Yelp use of double parentheses! I must be in digression mode! Good food, hoagies with oil vinegar oregano stuff. Yeah!", "rating": 5, "date": "2011-01-20"}, {"excerpts": ["If you don't feel like cheese steak they have an insane italian hoagie, but you must ask for it hot (else its mediocore at best). ", "I always take people here when we want something filling but cheap. ", "You can't beat a 15 inch sandwich for $10 bucks ^^"], "author": "Mike W.", "review": "MY favorite cheese steak shop in the city. Based on me and my friends nothing compares when you have the urge for something hot, greasy and super tasty. They offer some other great delicacies such as stuffed mushrooms, steak fries (which are like butter, but better), onion rings and curly fries. The people working there are all local and super friendly. They have random specials depending on the day of the week. If you don't feel like cheese steak they have an insane italian hoagie, but you must ask for it hot (else its mediocore at best). I always take people here when we want something filling but cheap. You can't beat a 15 inch sandwich for $10 bucks ^^", "rating": 5, "date": "2007-11-27"}, {"excerpts": ["Even summer break can't stop me from coming to this place to order my favorite cheesesteak (the cheesesteak hoagie). ", "Prices are pretty reasonable, service is pretty good. ", "Though I recommend calling in or ordering online through this website called waiter.com, as you can get your cheesesteak faster without waiting as much as those ordering when they get there."], "author": "Ethan T.", "review": "Their slogan \"Caution: may be habit forming\" doesn't stop me from coming here. This place is awesome, going to school nearby introduces me to a fine establishment such as this one. Even summer break can't stop me from coming to this place to order my favorite cheesesteak (the cheesesteak hoagie). Prices are pretty reasonable, service is pretty good. Though I recommend calling in or ordering online through this website called waiter.com, as you can get your cheesesteak faster without waiting as much as those ordering when they get there.", "rating": 5, "date": "2008-08-12"}], "chili pepper": [], "our orignal vegetarian sandwich": [], "zesty veggie sandwich": [{"excerpts": ["On our first trip to the register, we ordered a Philly Cheese Steak, Hoagie Cheese Steak, Zesty Veggie Sandwich, Steak Fries, and Onion Rings. ", "When we received our order, we got an Italian Hoagie, Zesty Veggie, Fries, and Rings. ", "So the first thing my bf noticed was that they made the wrong Hoagie ", "- he wanted a Hoagie Cheese Steak, but got the Italian Hoagie instead. ", "Then as we waited longer, there was ", "BF gets back in line for the second time - orders Philly Cheese Steak and Hoagie Cheese Steak cause he still wants to get what he planned to order in the first place. ", "This time, he gets the order and gets the Philly Cheese Steak only. ", "He checks the receipt again, the cashier never placed the order for the Hoagie. "], "author": "Tiffany K.", "review": "Food is pretty good here, but service was horrible when we visited yesterday. The boyfriend randomly thought about this place and craved it, so we went for a late Sunday lunch.\n\nOn our first trip to the register, we ordered a Philly Cheese Steak, Hoagie Cheese Steak, Zesty Veggie Sandwich, Steak Fries, and Onion Rings. When we received our order, we got an Italian Hoagie, Zesty Veggie, Fries, and Rings. So the first thing my bf noticed was that they made the wrong Hoagie - he wanted a Hoagie Cheese Steak, but got the Italian Hoagie instead. Then as we waited longer, there was no Philly Cheese Steak - went to the pickup counter, and they never placed the order.\n\nBF gets back in line for the second time - orders Philly Cheese Steak and Hoagie Cheese Steak cause he still wants to get what he planned to order in the first place. This time, he gets the order and gets the Philly Cheese Steak only. He checks the receipt again, the cashier never placed the order for the Hoagie. Granted, we should have checked the receipt before, but we gave the cashier the benefit of the doubt.\n\nNow, mistakes are okay - we all make them, but the cashier was rude about it. She started lecturing him on how he should have made it clear he wanted two separate sandwiches, cause all she kept hearing was cheese steak and assumed one. \n\nAlready the first time around, when they didnt get the order, I feel like the guys cooking or the cashier should have done something to speed up the process for us to get back in line. My bf had to get back in line, which was long, to re order. We pretty much spent the most of our time there waiting for the food to be right.\n\nOn top of it all, our onion rings were completely burnt and all the rings were stuck together and hard, couldn't even take them apart to eat them - why would you serve it out to your customers like that!\n\nOkay, so the food is pretty good, but after this experience, we're pretty scarred. Usually I'm not one to complain on Yelp, but we spent our entire time here pretty pissed. We noticed that the cashier took a few other customers' orders incorrectly too... Get it together woman! And don't be rude to your customers, PERIOD. \n\nSince I don't review solely on one thing, I'll give them 3 stars. Food is good, but the staff working at the time of our visit just didn't give a sh*t.", "rating": 3, "date": "2011-12-05"}], "italians hoagie our banquet on a bun": [], "steak fries": [{"excerpts": ["I love that they have steak fries too! ", "Steak fries are my fav fries and best shape for fries IMO. ", "I just noticed they had sweet potato fries too. "], "author": "Lindsay C.", "review": "What makes this place stand out from the others... I'd have to say the sweet peppers... insert drool! You have your savory meats, gooey cheese and a hint of heat and sweetness from the peppers. I love that they have steak fries too! Steak fries are my fav fries and best shape for fries IMO. I just noticed they had sweet potato fries too. Too many options. \n\n Service can be a little slow but I saw there was an option to place an order online which I might try next time to beat the lunch rush. Signage is terrible as its a yellow awning that reads \"may become habit forming\". Which I feel is just terrible signage. \n\nParking is tough but there is plenty of seating here", "rating": 5, "date": "2018-10-18"}, {"excerpts": ["Healthy sandwich sizes plus great-tasting steak fries. ", "Homesickness-soothing Tastykakes top off the meal."], "author": "Laurie S.", "review": "If you're a Philly native and either traveling out here for business or stuck out here for work, the cheese steaks here are as close as you'll get to the real thing. (Each California franchise functions as sort of a \"mini-shrine\" to the cheese steak concept; walls are adorned with photos of Philly-area cheese steak \"temples.\") Although the quality of the actual sandwich can vary from franchise op to franchise op in the SF Bay Area, the store at Divis gets it right every time, regardless of whether you're sans or pro-pepper. Healthy sandwich sizes plus great-tasting steak fries. Homesickness-soothing Tastykakes top off the meal.", "rating": 4, "date": "2018-10-23"}, {"excerpts": ["We both got the small meal with steak fries and a drink. ", "Great meal overall! ", "The food came up quick and the fries were hot & crispy. ", "The chicken philly was good - the chicken might have been slightly on the drier side but with the cheese, peppers and onions, it tasted really great. ", "Would go again!"], "author": "Alexa S.", "review": "Stopped by here after Toe-Asis for a bite to eat. I got the chicken philly and my friend got the philly hoggie. We both got the small meal with steak fries and a drink. Great meal overall! The food came up quick and the fries were hot & crispy. The chicken philly was good - the chicken might have been slightly on the drier side but with the cheese, peppers and onions, it tasted really great. Would go again!", "rating": 4, "date": "2018-06-17"}, {"excerpts": ["My recommendation is to get the \"Guylic\" Cheese Steak with all the topping (onions, green peppers, and red peppers), with a side of steak fries. ", "The cheesesteak is juicy, tasty, and very well seasoned. ", "It's a party for your taste buds. "], "author": "Andréia S.", "review": "The Cheese Steak Shop has the best cheese steak I have ever had. It's the kind of food that if you eat it once, you will crave it often. \n\nThe shop works as a fast-food place in which you place your order at the cashier and wait for your name to be called to get your delicious food. \n\nMy recommendation is to get the \"Guylic\" Cheese Steak with all the topping (onions, green peppers, and red peppers), with a side of steak fries. The cheesesteak is juicy, tasty, and very well seasoned. It's a party for your taste buds. The cheese is really good and the beef is just perfect, all that enveloped by a soft bun. \n\nThey have amazing sides, so if you come with someone else, try as many as you can.\n\nPortions are super big. They have a loyalty stamp card. Remember to bring it. Tuesdays and Sundays you get double stamps. They also have other deals in other days of the week. \n\nLunch hour is bit full here. The wait is not super long and it is really worth it.", "rating": 5, "date": "2016-09-19"}, {"excerpts": ["The fries are thick cut which are good if you like steak fries, but I definitely prefer crispy. "], "author": "Will H.", "review": "I'm willing to try the Cheese Steak Shop again, but my first trip here was just average. The meat in my cheesesteak was not as flavorful as I would have wanted and the green peppers were heavily greasy. The fries are thick cut which are good if you like steak fries, but I definitely prefer crispy. I got the garlic fries and I felt like the garlic was not cooked well with with the fries, more thrown on top. Pros: service was quick, relatively inexpensive, and comes with a frequent customer card.\n\nTheir slogan is \"habit forming.\" I can't say that after this visit as I was mostly unimpressed, but as mentioned, I'm willing to give it another taste.", "rating": 3, "date": "2015-10-21"}, {"excerpts": ["Steak fries were kind of tasteless. "], "author": "Steven G.", "review": "Nothing special. An average cheesesteak (by Phila. standards). I think some pepper was accidentally poured on mine because it was spicy and it shouldn't have been. American or provolone cheese. Traditional Cheese Whiz was not an option. Authentic Philadelphia style roll. \n\nSteak fries were kind of tasteless. Had to put ketchup on them to give them any taste. \n\nFree refills on soft drinks. \n\nAppreciate the tribute on the walls with pictures of the great cheesesteak places such as Pat's, Gino'a and Jim's Steaks, all in South Philly. \n\nLike that they take all credit cards.\n\nNext time I will go elsewhere. Glad I have cheesesteak options (alternatives) in San Francisco.", "rating": 3, "date": "2014-09-21"}, {"excerpts": ["I do love their steak fries ordered well done...", "I am not usually a fan of steak fries - but these are good. "], "author": "Amy W.", "review": "While Phat Philly in the Mission is the best cheesesteak in town - this is in my neighborhood and a \"go-to\" if I have a craving for cheesy/steaky goodness. Nope....there is not an ounce of healthiness here..but sometimes you just need one.\n\nI believe Tuesday/Sunday are double stamp days and Wednesday is 1/2 price sides (Monday is double coupon day - and Right now the Safeway on Fillmore has $2.50 of of a 10\" coupon on the back of their receipts - so that would be $5 off $8 sandwich - Now I haven't tried that coupon on a Monday so that may not work since it is such a steep discount, but if it does - that's a steal) \n\nI do love their steak fries ordered well done...I am not usually a fan of steak fries - but these are good. They recently introduced some new sides like home made potato chips and garlic fires - but I have not tried them.", "rating": 4, "date": "2014-07-20"}, {"excerpts": ["\" \n\n10\" philly with sweet & hot peppers, steak fries and a coke is all you need for a little piece of heaven. "], "author": "Caye Q.", "review": "This place is the reason why I gained 15 pounds freshman year of college. I seriously remember coming here at least twice a week way back when. Now that I'm older and can't afford to have all that greasy goodness I come back to visit the guys every few months. This place is THE BEST!! Their phillies are straight out \"In West Philadelphia born & raised, on the playground where I spent most of my days, chilling out, maxing out, relaxing all cool.....\" \n\n10\" philly with sweet & hot peppers, steak fries and a coke is all you need for a little piece of heaven. Come on a Tuesday, its double stamp!!!", "rating": 5, "date": "2012-02-15"}, {"excerpts": ["Came here for lunch with my sister and ordered the regular Philly Cheesesteak with peppers on top and steak fries. ", "The fries were nothing special, so I will definitely order a different tyep of fries next time, but the meat in the Philly Cheesesteak is... simply..AMAZING!!!!!  ", "It tastes soooooo good cooked with the cheese! ", "The peppers were a bit too spicy for me ", "so I ended up taking them off, but I recommend coming here to eat. ", "The 15 minutes wait for your food after you placed the order was so worth it! ", "Will definitely be back seeing that I live so closeby :P"], "author": "Amanda C.", "review": "Came here for lunch with my sister and ordered the regular Philly Cheesesteak with peppers on top and steak fries. The fries were nothing special, so I will definitely order a different tyep of fries next time, but the meat in the Philly Cheesesteak is... simply..AMAZING!!!!!  It tastes soooooo good cooked with the cheese! The peppers were a bit too spicy for me so I ended up taking them off, but I recommend coming here to eat. The 15 minutes wait for your food after you placed the order was so worth it! Will definitely be back seeing that I live so closeby :P", "rating": 4, "date": "2014-04-20"}, {"excerpts": ["Fast, sort of friendly service \nYou can call ahead\nLoyalty card - get the 11th free \n\nCons:\nSteak fries - under-cooked\nI personally don't dine in because it feels grimy"], "author": "Marina S.", "review": "Over all great sandwiches! \n\nPros:\nSandwiches are bomb\nFast, sort of friendly service \nYou can call ahead\nLoyalty card - get the 11th free \n\nCons:\nSteak fries - under-cooked\nI personally don't dine in because it feels grimy", "rating": 4, "date": "2014-09-02"}, {"excerpts": ["Load up on corn fritters and zucchini sticks, steak fries and onion rings, etc."], "author": "Brandon L.", "review": "A great, no-frills, just deliverin' the good stuff kind of place!\n\nTheir cheesesteaks are really good, but don't forget their cheeseburgers; the old-fashioned, sloppy kind before burgers went all up-scale.\n\nBut the big draw for me are the sides, which are HALF OFF on Wednesdays!  Load up on corn fritters and zucchini sticks, steak fries and onion rings, etc.", "rating": 4, "date": "2013-08-29"}, {"excerpts": ["Oh, and do not forget the steak fries! ", "The steak fries are delicious and there are a variety of Cheesesteak choices other than the original to try from.\n\n"], "author": "Jesus A.", "review": "The Cheesesteak, the grand daddy of all steak based sandwiches. The Cheesesteak Shop takes it another level. \n\nDuring my lunch breaks from school, I would travel on foot to arrive at this location whenever I crave that Cheesesteak feeling. Freshman year of college, I experienced my first 7\" Sandwich from here and it was AMAZING. Next thing you know, you and a bunch of homies are chilling here eating away at 15\" sandwiches! \n\nYour taste buds are just overwhelmed with the freshly made steak, the peppers giving it that nice added spice, plus the soft bread with cheese melted to make it one savory delicious meal. Oh, and do not forget the steak fries! They are the BOMB! \n\nThe great thing is, this place is not expensive. A 7\" goes for around $5, the 10\" for around $6.50 and the ever so huge 15\" for a good $10. The steak fries are delicious and there are a variety of Cheesesteak choices other than the original to try from.\n\nHighly recommend this spot if your craving that feeling for some steak sandwiches, you won't be disappointed. If your a college student, YOU NEED TO GO HERE ONCE IN YOUR LIFETIME. It's right next to UCSF on divisadero so it's in a fantastic area, easily accessible. Now don't hesitate and just go and order an original Philly Cheesesteak. The only disappointment you'll realize is that when you finish your sandwich, you'll be craving even more!\n\nCheck it out for yourself and you be the judge.", "rating": 5, "date": "2010-09-25"}, {"excerpts": ["Update: I tried their curly fries, but prefer their regular steak fries.  "], "author": "Dan C.", "review": "Great place to get a cheese steak made with rolls that actually are from Philly.  It's a great value too.  The 7\" is a bit small, but if paired with an order of fries, it's makes for a good lunch.  The interior has character -- you see photos of famous cheese steak places from Philly, and restaurant reviews from Patricia Unterman and Bill Mandel that date from when the shop opened many years ago. (Note: Mandel is from Pennsylvania, so his review probably carries weight).  They don't use Cheez Whiz, which may disappoint purists, but that's OK with me.   The menu is quite large with hamburgers, many sides, but I would say most people order the cheese steak.\n\nUpdate: I tried their curly fries, but prefer their regular steak fries.  Both are good.\n\nThey have specials, a \"frequency card\", and deals depending on the day you go, so check those out.\n\nInterior for updated a bit, with seats from old Candlestick park and a SF Giants tribute wall with photos.  The menu is pretty much the same.\n\nWhen it's crowded, it can take 10 min to get an order in, and another 15 to get served.  The sandwich is worth it, but if you're in a hurry, set aside extra time.", "rating": 4, "date": "2015-03-23"}, {"excerpts": ["On our first trip to the register, we ordered a Philly Cheese Steak, Hoagie Cheese Steak, Zesty Veggie Sandwich, Steak Fries, and Onion Rings. ", "When we received our order, we got an Italian Hoagie, Zesty Veggie, Fries, and Rings. ", "So the first thing my bf noticed was that they made the wrong Hoagie ", "- he wanted a Hoagie Cheese Steak, but got the Italian Hoagie instead. ", "Then as we waited longer, there was ", "BF gets back in line for the second time - orders Philly Cheese Steak and Hoagie Cheese Steak cause he still wants to get what he planned to order in the first place. ", "This time, he gets the order and gets the Philly Cheese Steak only. ", "He checks the receipt again, the cashier never placed the order for the Hoagie. "], "author": "Tiffany K.", "review": "Food is pretty good here, but service was horrible when we visited yesterday. The boyfriend randomly thought about this place and craved it, so we went for a late Sunday lunch.\n\nOn our first trip to the register, we ordered a Philly Cheese Steak, Hoagie Cheese Steak, Zesty Veggie Sandwich, Steak Fries, and Onion Rings. When we received our order, we got an Italian Hoagie, Zesty Veggie, Fries, and Rings. So the first thing my bf noticed was that they made the wrong Hoagie - he wanted a Hoagie Cheese Steak, but got the Italian Hoagie instead. Then as we waited longer, there was no Philly Cheese Steak - went to the pickup counter, and they never placed the order.\n\nBF gets back in line for the second time - orders Philly Cheese Steak and Hoagie Cheese Steak cause he still wants to get what he planned to order in the first place. This time, he gets the order and gets the Philly Cheese Steak only. He checks the receipt again, the cashier never placed the order for the Hoagie. Granted, we should have checked the receipt before, but we gave the cashier the benefit of the doubt.\n\nNow, mistakes are okay - we all make them, but the cashier was rude about it. She started lecturing him on how he should have made it clear he wanted two separate sandwiches, cause all she kept hearing was cheese steak and assumed one. \n\nAlready the first time around, when they didnt get the order, I feel like the guys cooking or the cashier should have done something to speed up the process for us to get back in line. My bf had to get back in line, which was long, to re order. We pretty much spent the most of our time there waiting for the food to be right.\n\nOn top of it all, our onion rings were completely burnt and all the rings were stuck together and hard, couldn't even take them apart to eat them - why would you serve it out to your customers like that!\n\nOkay, so the food is pretty good, but after this experience, we're pretty scarred. Usually I'm not one to complain on Yelp, but we spent our entire time here pretty pissed. We noticed that the cashier took a few other customers' orders incorrectly too... Get it together woman! And don't be rude to your customers, PERIOD. \n\nSince I don't review solely on one thing, I'll give them 3 stars. Food is good, but the staff working at the time of our visit just didn't give a sh*t.", "rating": 3, "date": "2011-12-05"}, {"excerpts": ["They had steak fries, curly fries for sides.  ", "We had the Fiesta Poppers (jalapeno poppers)...  "], "author": "Lawrence L.", "review": "Melted cheese, grilled steak, hot peppers, whole roasted garlic cloves, on a buttery toasted hoagie roll...  Mmmmmmmm....  Stumbled on this while driving through SF.  Used the iPhone Yelp app to check what was nearby, and BAM!  Found this gem...\n\nThey come in 3 sizes: 7\" ($4ish), 10\" ($6ish), and a whopping 15\" ($10ish).  Plenty of versions to try: Original, Pizza sauce and Provolone, Barbecue, Mushroom, Whole Roasted Garlic Cloves, Pepperoni to name a few.  We tried the original and garlic.  Both were delish.\n\nDefinitely a place to go for a Philly Cheese Steak.  I've been to Philly, but have not had the cheese steaks there (how could I do that you may be asking??? Too short of a business trip).  Well, if this is what a Philly Cheese Steak should taste like, I'm a fan...  It definitely beats the other franchised version: Great Steak Company - that's for sure!\n\nThey had steak fries, curly fries for sides.  We had the Fiesta Poppers (jalapeno poppers)...  Yummy.\n\nThis place was definitely a hole-in-the-wall, but those are the best places in my book.  Their motto is - \"Caution: may be habit forming\", and I am glad I do not live nearby; otherwise, there would not be enough trips to the gym that could help me.", "rating": 4, "date": "2009-10-10"}, {"excerpts": ["Love the cheese steak and steak fries!! ", "The place needs to be a little cleaner though :)"], "author": "SF Lady G.", "review": "I've been coming to this place for many years and I love it!! Love the cheese steak and steak fries!! The place needs to be a little cleaner though :)", "rating": 4, "date": "2013-08-31"}, {"excerpts": ["Not much for cheese steaks, but I picked a 10 inch regualar cheese steak, steak fries, fried zucchini and curly fries.\n\n"], "author": "Jennifer H.", "review": "Trying to figure out a healhy eating option this past Sunday, we gave up and decided to give this palce a try.  I'd never been there but my bf had.  Lots of people waiting in line so it must be good.\n\nNot much for cheese steaks, but I picked a 10 inch regualar cheese steak, steak fries, fried zucchini and curly fries.\n\nI actually really enjoyed the sandwich.  The peppers were firm and yummy, and the bread was soft so that I didn't have to participate in a tug-of-war with my sandwich at every bite.  Some reviewers suggest ordering double meat.  If you want a heartier sandwich def. order double.  My bf (a regular for many years here), ordered the 15 inch and the last inch, inch 1/2 on either side was meatless.  No bueno.\n\nThe fried stuff was good.  Except the zucchini was a little bland.  Oh, and what's with charging you for ranch or bbq dressing?  I can see being charged for an extra one, but for the first one?  Doesn't that come with the zucchini?\n\nAnyway, I'll be back and this time EXTRA hot peepers for me.  YUM!", "rating": 4, "date": "2011-03-28"}, {"excerpts": ["The steak fries were excellent.\n", "The bathroom was spotless.  ", "Always nice to see a clean bathroom.\n", "A nice place to sit and chat with a friend while waiting for her doctor's appointment."], "author": "Amy P.", "review": "I wasn't sure what to expect when walking into The Cheese Steak Shop.  I was pleasantly surprised.  The staff were all very nice and helpful.  A man recommended we try the #1 so we did.  It was great.  The meat was chopped up so tiny it reminded me of cat food, strange, but it tasted great!  The sweet peppers added a little something special to the mix.  The steak fries were excellent.\nThe bathroom was spotless.  Always nice to see a clean bathroom.\nA nice place to sit and chat with a friend while waiting for her doctor's appointment.", "rating": 4, "date": "2012-04-20"}, {"excerpts": ["The steak fries were also good and waiting time was not to bad even at 12:15 lunch crowd from the near by medical center."], "author": "Wolfy W.", "review": "Being that I've never been in Philly for a authentic cheese steak, I'm going to guess this is as close I could get. I try many other cheese steak in the city and this is a very good one compare to others. The bread was awesome with the grilled beef, white American cheese and sweet peppers. The steak fries were also good and waiting time was not to bad even at 12:15 lunch crowd from the near by medical center.", "rating": 4, "date": "2011-08-20"}, {"excerpts": ["The Steak fries were awesome and the New fried potato chips were excellent.  ", "We have had Cheese Steaks from almost every place in the Entire Bay Area and everyone else seems to try and duplicate The Cheese Steak Shop's recipe.  ", "They all Failed!!!  ", "This is By Far the best!  ", "If you have not been here yet, then you have not had a Real Authentic Cheese Steak.  ", "We love this spot and all the other Cheese Steaks suck compared to this place.  ", "\"", "Caution May Be Habit Forming\" is their motto for a good reason."], "author": "D.c.g G.", "review": "We had to go here for lunch today.  We ordered two Cheese steaks.  One hoagie style (with lettuce, tomato, and mayo) and one regular.  Both ten inches.  Oh my Goodness!  We have been coming here for decades and they still have the Best Cheese Steaks in the entire Bay Area.  The Steak was seasoned perfectly and the bread was soft and fresh.  These sandos were the perfect Cheese Steaks.  The Steak fries were awesome and the New fried potato chips were excellent.  We have had Cheese Steaks from almost every place in the Entire Bay Area and everyone else seems to try and duplicate The Cheese Steak Shop's recipe.  They all Failed!!!  This is By Far the best!  If you have not been here yet, then you have not had a Real Authentic Cheese Steak.  We love this spot and all the other Cheese Steaks suck compared to this place.  \"Caution May Be Habit Forming\" is their motto for a good reason.", "rating": 5, "date": "2012-12-04"}, {"excerpts": ["Ordered a few cheesesteaks, steak fries, and corn fritters during our lunch hour at the hospital. ", "We received over cooked fritters, and over cooked steak fries, literally. ", "Perhaps it's only worth spending money with the Cheesesteak Shop if you can pick up the food on your own, so that you can check it. ", "We've never come across any issues when we pick up or dine in with them. ", "It's a tad bit disappointing that this time was the complete opposite."], "author": "S. F.", "review": "This review is only regarding our order placed via doordash.com. The delivery service is great, but the food we ordered is another story. Ordered a few cheesesteaks, steak fries, and corn fritters during our lunch hour at the hospital. We received over cooked fritters, and over cooked steak fries, literally. Perhaps it's only worth spending money with the Cheesesteak Shop if you can pick up the food on your own, so that you can check it. We've never come across any issues when we pick up or dine in with them. It's a tad bit disappointing that this time was the complete opposite.", "rating": 2, "date": "2015-04-10"}, {"excerpts": ["And to top it all off THEY HAD PERFECT STEAK FRIES. ", "I'm obsessed with fries. ", "If you shipped me off to a desert island and left me with only one food item, it'd be french fries ok. ", "And if they were the Cheesesteak shop's steak fries, I'd be chill with being stranded for a minute. \n\n"], "author": "Anita A.", "review": "The best cheesesteak I ever had was here! Granted, I haven't been to Pat's or Geno's in Philly yet, but so far in my cali born-n-raised vida loca, I must say this place takes the cake when it comes to cheesesteak!\n\nI was planning to cook a beef stew dinner from scratch, but glad I opted to try a new place instead. I def got my meat on tho, with these sandwiches stuffed to the max with thinly sliced, perfectly cooked strips of steak, american cheese and sweet peppers and onions. I'm drooling just writing about it! The roll was perfectly soft and crisp at the same time and soaked up the juices of the yummy goodies inside. And to top it all off THEY HAD PERFECT STEAK FRIES. I'm obsessed with fries. If you shipped me off to a desert island and left me with only one food item, it'd be french fries ok. And if they were the Cheesesteak shop's steak fries, I'd be chill with being stranded for a minute. \n\nMaria who works there is cool as hell too. I call her Maria Pastora.", "rating": 5, "date": "2010-12-14"}, {"excerpts": ["Steak fries - very lightly salted, if at all - but "], "author": "N Y.", "review": "Phoned in the order - picked up within 15 minutes.\n\nFunky smell in the shop, so don't plan on eating here.  \n\nTheir sandwiches are pretty tasty although the bread was a bit chewier than it could've been.  \n\nFor whatever reason, I felt like the sides portions were kind of small - which is good, in a sense, but still felt thrown off because other places have ginormous portions and i've gotten used to that.\n\nSteak fries - very lightly salted, if at all - but all the while still yummy.\n\nFiesta poppers - will definitely opt out of these next time around.  and this is the first time I've had jalapeno poppers at a place that didn't have ranch dressing. hahaha\n\nOverall, quick eats.  Good quality.  It'll definitely satisfy a cheesesteak craving.", "rating": 3, "date": "2009-12-05"}, {"excerpts": ["* No worries, I just swiped some steak fries from my boss.  \n\n", "Well, the steak fries were exactly how I like them..."], "author": "sue l.", "review": "On the lunch menu for work today: The Cheesteak Shop.\n\nMy coworkers have been wanting to try this place, so we decided to place an order today.  After reading through some of the Yelp reviews, I decided to go with the 7' Mushroom Philly (4.69) w/ 3oz. extra meat (1.59), grilled onions, hot and sweet peppers, and a side of onion rings(2.39)....just under $10.\n\nI was a little upset to find out that my onion rings werent included in the order (go figure...Why is it always ME...the pickiest of the bunch?!?!) *sigh* No worries, I just swiped some steak fries from my boss.  \n\nUpon unwrapping the foil, the bread looked kind of like a soggy hotdog bun, and I thought to myself, ugh I made a mistake for ordering this...However, I was pleasantly suprised to see that the bread didnt fall apart. The flavor of the philly was pretty tasty.  The mushrooms were a nice addition and the cheese was perfect...not too much where it overwhelmed the sandwich.  It was DEFINITELY great with the peppers...a perfect balance of sweet and spicy for me. I loved that the hot peppers were just spicy enough for a little zing and not overly spicy, where I couldnt tasted my food.  \n\nThe 7\" was perfect for lunch...and I probably could've done without the extra meat, because everyone else's didn't look skimpy, like some of the other yelpers commented about.  The onion rings were..oh wait, THAT's RIIIIIIIGHT...I DIDNT GET ANY!!! Well, the steak fries were exactly how I like them...dry on the inside, with a little bit of crisp on the outside.\n\nOverall, pretty good place. Tasty sandwich, reasonable prices, and a satisfied belly.  Definitely worth a try. Now please excuse me, i need to wipe my face before this food coma kicks into full gear =p", "rating": 3, "date": "2010-05-25"}, {"excerpts": ["The steak fries are also really good. \n\n"], "author": "Sam K.", "review": "Delicious but cleanliness definitely concerns me. If this place delivered or if you didn't have to actually step foot inside their place to get the food, than it would be A LOT better. \n\nThe cheesesteaks are awesome, I would regularly call in and pick one up during the halftime of football games. The steak fries are also really good. \n\nAs I mentioned above, the only thing holding this place back in my opinion is there actual storefront, it is sloppy, kind of gross looking, and at times a little ghetto. I guess if you really like authenticity it doesn't matter, but I would prefer they cleaned the joint up a little bit because the food is really good.", "rating": 3, "date": "2010-11-19"}, {"excerpts": ["I admit, *stands up*\n\n \" I, Anna, am a cheesesteak-aholic, I am addicted to the mushroom cheesesteak with extra hot peppers and a side of steak fries with cheese sauce\"\n\n*sits down*"], "author": "Anna T.", "review": "I don't think I've crave for anything as much as I've craved for a cheesesteak from this place. \n\nIn high school, as my friends picked up smoking, I picked up cheesesteaks. ( they come in 7, 10 and 15 inch sandwiches -pick your size)\n\nIn college, as my friends dabbled with drugs, I dabbled with different combinations of cheesesteaks. (they've got everything from bacon, mushrooms, pepperoni, onions, garlic, hot and sweet peppers to chicken)\n\nThis is one of the first places I drove to when I first got my license. It's the first thing I think of when I wake up in the morning.  It's what I want at night after a long day. It's what I long for when I'm feeling down. It's what I want for Christmas... birthdays, Valentines day..... ... If I could marry it, I would.\n \n\nI admit, *stands up*\n\n \" I, Anna, am a cheesesteak-aholic, I am addicted to the mushroom cheesesteak with extra hot peppers and a side of steak fries with cheese sauce\"\n\n*sits down*", "rating": 5, "date": "2009-01-08"}, {"excerpts": ["\" Mushroom Cheese Steak and add hot sauce and jalapeno peppers with a side of Steak Fries.\n\n"], "author": "Thömas F.", "review": "I've been going to this greasy gem for decades.\n\nThe sign out front say's \"Caution: May be habit forming\" because I believe (and correct me if I'm wrong), they sprinkle crack rock on top.\n\nI'm sure that this place is going to be responsible for at least 22% of my first heart attack (although that math is not a perfect science)\n\nI always order the 10\" or 15\" Mushroom Cheese Steak and add hot sauce and jalapeno peppers with a side of Steak Fries.\n\nI also strongly recommend eating THERE rather than TO GO as cheese steaks do not travel well and get soggy.", "rating": 4, "date": "2008-02-03"}, {"excerpts": ["I am a sucker for steak fries and this place never has disappointed me. ", "I have never been to Philly but with this establishment in SF, who needs to travel East. ", "The help is friendly and always have a smile. ", "If you haven't been here yet---WHY?"], "author": "Mark S.", "review": "I have been going here for years and will drive across town at break time to get one. Today I had the Spinach and Mushroom---maybe the best ever. I am a sucker for steak fries and this place never has disappointed me. I have never been to Philly but with this establishment in SF, who needs to travel East. The help is friendly and always have a smile. If you haven't been here yet---WHY?", "rating": 5, "date": "2011-06-15"}, {"excerpts": ["YES, the steak fries are not so good. ", "Order the curly fries and eat 'em while they're hot. ", "Do a little happy dance. ", "Get tossed out of the place."], "author": "ChickCaesar S.", "review": "Arterioliscious!\n\nI have introduced several people to this greasy hole and nobody has been disappointed. FYI, the chicken cheese steaks are about as good as steak 'cause as we know it's all about the group orgy of meat PLUS cheese, onions, mushrooms, and the hot 'n sweet peppers. \n\nI usually don't get the peppers 'cause they burn twice, if you know what I'm sayin'.  But I digest...\n\nYES, service takes way too long. Order ahead but still be prepared to wait: too many peeps have figured out the phone order maneuver. \n\nYES, parking sucks. Go with a friend and wait in the car at the bus stop while he gets the food. Chances are he'll come back before the 24 bus shows up to menace you.\n\nYES, this food is probably bad for you, so leave the car at home and walk your fat ass over to Diviz. Then you can reward yourself with a 10\" with extra meat.\n\nYES, the steak fries are not so good. Order the curly fries and eat 'em while they're hot. Do a little happy dance. Get tossed out of the place.", "rating": 5, "date": "2009-02-09"}, {"excerpts": ["I like the steak fries best but the twister ones are good when you feel like going cuckoo-crazy. ", "Don't bother making your combo a \"large", "\" I've found that the size of fries is no different if you just say you want a small side. \r\n\r\n", "Don't forget to pick up a stamp card which will get you a free steak after you collect 10. ", "Sometimes the person behind the counter is feelin' generous and might give you an extra stamp or two for no apparent reason...", "Don't forget that Tuesday's are always \"Double Stamp Tuesdays\" without fail. ", "My favorite of the locations is the one on Divisadero...", "but they're all the cat's pajamas!\r\n\r\n", "You WILL be Satisfied!", "\""], "author": "NaN K.", "review": "\"I, myself, have run through Philly many many times and have been to all the \"famous\" steak shops: Pat's, Jim's, Geno's, Tony Lukes, Ishkabibbles(my favorite name BTW), etc... and I can sum them all up in one word...BLAND! The Cheesesteak Shop, however, is anything but bland. The only thing they owe to The City of Brotherly Love is a \"thank-you\" to the bakery that supplies their bread which is flown in daily from PA. I like that they pay respect to all the old-skool steak shops in Philly by hanging photos of them on the walls but in my humble opinion they really don't owe them anything. \r\n\r\nThe sandwiches are a greasy godsend that everyone should try at least once...I don't care if you're a Vegan...try one! They have so many styles of steak here I won't even attempt to list them all. I will tell you my favorite and highly suggested model that doesn't even include beefsteak. I pretty much always go for the 7\" Chicken Cheesesteak combo with onions, bacon, hot cherry peppers, and the secret ingredient...MAYO! The combo comes complete with a drink of your choice and side of fries, and is a great price...I like the steak fries best but the twister ones are good when you feel like going cuckoo-crazy. Don't bother making your combo a \"large\" I've found that the size of fries is no different if you just say you want a small side. \r\n\r\nDon't forget to pick up a stamp card which will get you a free steak after you collect 10. Sometimes the person behind the counter is feelin' generous and might give you an extra stamp or two for no apparent reason...Don't forget that Tuesday's are always \"Double Stamp Tuesdays\" without fail. My favorite of the locations is the one on Divisadero...but they're all the cat's pajamas!\r\n\r\nYou WILL be Satisfied!\"", "rating": 5, "date": "2005-10-10"}, {"excerpts": ["They're not that big....\"\n\nNot to be outdone, I got the 15 incher myself and an order of steak fries.  "], "author": "Tadd L.", "review": "My friend told me about this place...declaring it as the best cheese steak he's ever had.  I don't know what kind of qualifications he's ever had in judging cheesesteaks....he grew up in San Carlos....and has never been to Philly.\n\nAnyways....I ran out of ideas for dinner last night.  My usual bowl of breadcrumbs and cereal mixed with apple juice just wasn't appealing to me anymore, I needed something to fatten me and up and grease my mouth and hands.\n\nTo The Cheese Steak Shop I headed!!  oh....actually, I called in my order first...which saved me some time of waiting.\n\nGot the 15\" mushroom cheese steak .  Ok...i had asked my friend (who's about 5\"4 and weighs a buck 25) if he usually orders the 10\"....\n\n\"For lunch...sure\"\n\"And for dinner?\"\n\"15\"\n\"!!!!\"\n\"They're not that big....\"\n\nNot to be outdone, I got the 15 incher myself and an order of steak fries.  I was going to put him to shame!!  (I'm 6\"1 and weigh a good 200lbs).  I arrived at the destination and picked up the package.\n\nWaitaminute...something must be wrong....my cheesesteak....the thing....it's....it's poking out of their bag.  The thing's almost TWICE as long as the plastic that's carrying it.....\n\noh dear god!!\n\nhalf an hour later....my hands smell like cheese and beef...there's still a good quarter of the cheese steak left......and half uneaten fries.\n\nDo i concede defeat??   NO!!!  At midnight....right before I went to bed.....I finished every last bite of the greasy goodness!", "rating": 4, "date": "2007-09-14"}, {"excerpts": ["Also ordered steak fries. ", "Ehh. "], "author": "Rich H.", "review": "As I am about to fall asleep from rigorous last mintue midterm studying, my cousin Ed calls, seeing if I want to go grab a cheesesteak with our other cousin Alex.  Seeing that I was starving my brains out, I obliged. \n\nI had been here before a while back and the sandwich as I had remembered was decent, borderline good. I was more amused with their wacky promotions that they advertise inside. (Wild Wednesdays - buy 3 get one 3, Double Stamp Thursdays)\n\nI get inside and there are quite a few people inside, despite it raining and freezing outside. Good sign. A quick glance to my left and I see the fountain on the outside of the registers, signaling free refills. Plus 2 for unlimited Dr. Pepper. \n\nI ordered the standard Philly with Provolone instead of American. When I first got the sandwich, I was surprised at how little meat there was. But all that changed when I had my first bite, which was full of steak and cheese. Delicious. Also ordered steak fries. Ehh. They were ok.\n\nAs I was eating my sandwich, couldn't help but notice the other patrons in the shop. There was a family of 4 to my left and another family of 4 behind us. And then there were individuals scattered throughout the tables, all while people came in and out doing pick-ups. All in the pouring rain. All for cheesesteaks.\n\nGreat place for cheesesteaks. I would stick with the 10 incher unless extremely hungry, then aim for 15.", "rating": 4, "date": "2008-11-04"}, {"excerpts": ["I ordered a 10\" and split a large order of Steak Fries, with the notion that I'd eat half of my sandwich and have the other half for morning/lunch nutritional needs.  ", "Wrong!  ", "I devoured the whole thing in it's steak-filled goodness in about 10-15 minutes.  ", "The duration of my evening was spent in a food coma as I tried to figure out how I allowed myself to live up to the American stereotype of overindulging."], "author": "Michael G.", "review": "My sandwich could have used more cheese and my bread could have been less soggy, other than that I was pleased with my selection.  I ordered a 10\" and split a large order of Steak Fries, with the notion that I'd eat half of my sandwich and have the other half for morning/lunch nutritional needs.  Wrong!  I devoured the whole thing in it's steak-filled goodness in about 10-15 minutes.  The duration of my evening was spent in a food coma as I tried to figure out how I allowed myself to live up to the American stereotype of overindulging.", "rating": 3, "date": "2011-02-04"}, {"excerpts": ["steak fries... ", "i'm happy when i have steak fries. \n\n"], "author": "Alice C.", "review": "Meat, cheese, bread, hot peppers... what else could you ask for?  steak fries... i'm happy when i have steak fries. \n\nforget about your diet when you come here.", "rating": 4, "date": "2008-05-14"}, {"excerpts": ["\"Steak Fries\" were totally mushy, yucky generic mushy ground potatoes. ", "Nothing to recommend them. "], "author": "Chris F.", "review": "Wow, what a disappointment. \n\n\"Steak Fries\" were totally mushy, yucky generic mushy ground potatoes. Nothing to recommend them. Minus one star.\n\nTook over 20 minutes to get a sandwich, and they were not even busy. I've gone to plenty of \"made to order\" fresh places, and it was nowhere near this long. I had to change from \"here\" to \"to-go\" because my parking meter was going to expire. Minus a star.\n\nThe sandwich? Well, it was supposed to be a \"zesty vegetarian\" and it was not zesty, it was just.... warm.. and.... moist... that's about it. No flavor, no zest, no nothing. Minus two stars.\n\nI really wanted to like this place, and maybe this should only be a review for vegetarians, but I can't recommend it. If I had walked in, and there were no vegetarian options on the menu, I would have totally understood, as it was a cheesesteak shop, so I'll give them one star back.\n\n But if you are going to offer a vegetarian cheesy sandwich, do it correctly. Plenty of places in the world do veggie sandwiches with flavor and effort. This was an also-ran.", "rating": 2, "date": "2010-08-27"}, {"excerpts": ["I got the steak fries. ", "Twist my arm, but if it's a choice between fat potato fries and extra tasty curly fries, I'll take the taste of potato over the taste of delicious batter. ", "Good fries, but I wish I had some ranch. "], "author": "Tray I.", "review": "3.5 stars (when will yelp do a half star system?)\n\n$6.81. I do believe I am having the cheapest meal in SF ever. \n\nI even said this to the cashier. He laughed. \n\nWhat does this meager amount of money get you? \n1. one small (7\") mushroom cheesesteak\n2. one small order of fries\n\nWas I full? Yes. Could I eat more? Yes, but I'm a piggy. I wasn't stuffed full. I didn't feel like I ate a brick of meat and would regret it in the morning (sorry cube mates). \n\nFood: (4) Very good. The bread was a soft, gooey mixture with the cheese and the soft meat. Yes, that's two \"softs\", but it wasn't like I was an  old man eating wet food. The bread was soft and the meat was tender and tasty. The cheese was the salty bridge to melt the two together. Very good. I got the steak fries. Twist my arm, but if it's a choice between fat potato fries and extra tasty curly fries, I'll take the taste of potato over the taste of delicious batter. Good fries, but I wish I had some ranch. That would have made it perfect. \n\nSorry I didn't take pictures of my food. I'm not quite sure how you people have the will power to not devour good food instantly. But I did take out. This allowed time for the cheese and bread and steak to melt together a little longer. Yum. My dog agrees - time and eating in front of her allows her to have some food and allowed the flavors to mix better (she told me this in a sequence of barks and whimpers). \n\nOne complaint, it was messy. Not sure what produced the wetness - I guess the steak - but it became quite messy in it's foil clothing. \n\nAtmosphere: (2) This is a cheese steak place. It has tables and chairs and I think that's all you can ask for. The cashier was nice and if you stand in the right place you can see them grilling up your sandwich. It took them a bit of time to make my small-ish cheesesteak and I felt a bit bad for my pooch that was waiting outside. \n\nPrice: (4) Did I mention my meal was $6.81? I'm still in shock over this. I guess if you add a drink you might get to 8 bucks. \n\nOver all 3.5. I would like a little more in my cheesesteak. I guess I could be a major pig and be the only girl ordering the large size. Hm....", "rating": 3, "date": "2008-04-22"}, {"excerpts": ["The steak fries are good but the curly fries are better.  ", "Make sure you get a frequent buyer card (it's free!) ", "to hasten your slide into addiction.  ", "That reminds me...", "I have a full card which means I've earned a free philly!  ", "So please excuse me for cutting this review short and leaving now...", "I've got a date with a really hot...sandwich. ", ";)"], "author": "Helen T.", "review": "The first Philly cheesesteak I can remember eating was at The Cheesesteak Shop.  Despite never having had one before, I knew the moment I bit into the oozing gooey sandwich that I had fallen in love for life.  And I don't even like cheese that much!  Since then I've eaten quite a few phillies at other restaurants but I always come back to this place because they are simply the best.  In my case, the first one was definitely the right one. ;)\n\nThe bread is buttery soft and fresh and just right.  I always get the mushroom cheesesteak and the meat/cheese/mushroom combo is the perfect combination of salty/creamy/fatty goodness.  On regular days I get the 7\", hungry days the 10\" is required.  The 15\" is appropriate for large construction workers, sharing, or another delicious meal later in the day.  The steak fries are good but the curly fries are better.  Make sure you get a frequent buyer card (it's free!) to hasten your slide into addiction.  That reminds me...I have a full card which means I've earned a free philly!  So please excuse me for cutting this review short and leaving now...I've got a date with a really hot...sandwich. ;)", "rating": 5, "date": "2008-11-04"}, {"excerpts": ["I : Just grilled onions, no peppers...add an order of large steak fries with that!\n\n"], "author": "Eric W.", "review": "CSS Employee : What can I get you?\n\nI : Lemme get a philly cheesesteak, a 10 incher.\n\nCSS Employee : Grilled onions? Hot and/or Sweet Peppers?\n\nI : Just grilled onions, no peppers...add an order of large steak fries with that!\n\nCSS Employee : Blah Blah Blah....*gives receipt*\n\n\nHoly shit.  This was good.  Not best in the world good, but good enough that after having my first one here 3 days ago, I've had one everyday since.  I've never had what some call an authentic philly steak using cheese wiz, but why would I? Real cheese or cheese wiz, hmmm give me a minute to think about it. \n\n00m:59s\n\n00m:58s\n\nUhh...real cheese pleese!\nThe cheesesteaks here have a great balance of bread to meat to melty cheesey ratio.  The queso is a warm ooey & gooey goodness bringing the whole artery-clogging choleterol-filling experience together. The onions are in nice little slivers cooked down nice and mixed in with the RrRReeEeDddeadD MeeEeaAttTt.  Don't be fooled by the length of the sandwiches you have to choose from... they're on the smaller side diameter wise but still super filling.  I'm just glad I have to go out of my way to come here otherwise Cheesesteak shop's going to post my picture as customer of the year on the wall.\n\nThey have this slogan in big print in front of the store...wise guys.\n\n\"CAUTION : MAY BE HABIT FORMING!\"\n\nI guess they gave me a fair warning...\n\nBTW the fries were perfect too.", "rating": 4, "date": "2007-08-15"}, {"excerpts": ["I was the only one that got curly fries, and I thought they were much better than the regular steak fries.\n\n"], "author": "Wade Y.", "review": "Some of us at work were hungry for something \"different\" than the usual places we frequent.  I did a little searching on Yelp, and finally settled on The Cheese Steak Shop.  \n\nAll of us except one got the 10 incher....I personally got the 10 incher with mushrooms, American cheese, grilled onions, and the sweet/hot pepper mix.  It took about 5 minutes to get my order, and it was served up piping hot in a tasty roll (which I hear they bring in from Philly).  \n\nI thought the pepper mix was a unique taste and went well with the meat.  The meat itself was tender and suprisingly not overbearingly greasy.\n\nI was the only one that got curly fries, and I thought they were much better than the regular steak fries.\n\nOverall, I very much liked the sandwich, but didn't LOOOOVE it.  All of us thought the sandwich could have come with a little more meat, and a quick survey revealed we all could have easily polished off the 15 incher.  Maybe we are just fat asses, I am not sure.  =)\n\nI would definitely come back, but I don't know if I would crave this.  I am going to try other cheese steak places and compare them.", "rating": 4, "date": "2008-01-28"}, {"excerpts": ["The steak fries are a must have when eating any sandwich from here. ", "The service here is fast and friendly."], "author": "Marty M.", "review": "This is a good place to go if you like to eat greasy cheese steak sandwiches. The mushroom philly is my favorite. The steak fries are a must have when eating any sandwich from here. The service here is fast and friendly.", "rating": 4, "date": "2010-12-06"}, {"excerpts": ["And steak fries are a great idea, you just have to cook them all the way."], "author": "Rick H.", "review": "The awning above the entrance reads: \"Caution: May be habit forming\".  Yeah, if your habit is waiting for your sandwich.  Didn't anybody else notice the 33 minute delivery time on their order?  Sure, the cheesesteak is awesome, but not worth the loooooong time it takes to get your order.  And steak fries are a great idea, you just have to cook them all the way.", "rating": 3, "date": "2006-01-26"}, {"excerpts": ["15\" mushroom & spinach cheesesteak with regular steak fries and a diet coke...\n\n"], "author": "Ray R.", "review": "15\" mushroom & spinach cheesesteak with regular steak fries and a diet coke...\n\neff my diet.", "rating": 5, "date": "2008-04-27"}, {"excerpts": ["The steak fries are great too.  ", "I'm kinda pissed ", "I found this place and that it's only 5 mins from my house because now I'm going to become a fatty."], "author": "Jen S.", "review": "Holy friggers!  This place is the bomb.  Soft bread like clouds, creamy gooey and melty cheese, greazzy steak, with the perfect grilled onion and sweet/hot peppers to top it all off.  The steak fries are great too.  I'm kinda pissed I found this place and that it's only 5 mins from my house because now I'm going to become a fatty.", "rating": 5, "date": "2007-06-26"}, {"excerpts": ["They also have really good steak fries!  ", "Fortunately for my arteries I no longer live just around the corner from here."], "author": "Derek D.", "review": "I must agree with most of the other reviewers that this place is the best for authentic cheese steaks in this city.  They also have really good steak fries!  Fortunately for my arteries I no longer live just around the corner from here.", "rating": 4, "date": "2006-02-15"}, {"excerpts": ["They offer some other great delicacies such as stuffed mushrooms, steak fries (which are like butter, but better), onion rings and curly fries. ", "The people working there are all local and super friendly. ", "They have random specials depending on the day of the week. "], "author": "Mike W.", "review": "MY favorite cheese steak shop in the city. Based on me and my friends nothing compares when you have the urge for something hot, greasy and super tasty. They offer some other great delicacies such as stuffed mushrooms, steak fries (which are like butter, but better), onion rings and curly fries. The people working there are all local and super friendly. They have random specials depending on the day of the week. If you don't feel like cheese steak they have an insane italian hoagie, but you must ask for it hot (else its mediocore at best). I always take people here when we want something filling but cheap. You can't beat a 15 inch sandwich for $10 bucks ^^", "rating": 5, "date": "2007-11-27"}, {"excerpts": ["Me, I like the regular steak fries here.  ", "And be sure to get the frequent buyers card, you'd be surprised how quick it can fill up to give you a free 10\"."], "author": "Shane Y.", "review": "Should be a 4.5 stars, can't quite give it five, parking can be rough sometimes.  Now, with that being said, this place has an awesome cheese steak.  Is it greasy?  Yes, but it's a cheese steak, it's supposed to be.  If I eat there, I get a 10\", but if it's to go I'll go for the 15\".  My favorite is the bacon cheese steak with mayo (you have to ask for mayo on that one).  Or the pizza cheese steak is good also.  I would say that this is not an everyday place, but once a week for sure.  Oh, and fries are a must.  I know curly fries or regular fries, decisions, decisions.  There's no right answer, it's just preference I guess.  Me, I like the regular steak fries here.  And be sure to get the frequent buyers card, you'd be surprised how quick it can fill up to give you a free 10\".", "rating": 4, "date": "2008-11-24"}, {"excerpts": ["I also had a side dish of steak fries, good not great ", "but did the job a side dish is supposed to do. ", "I will admit the only thing I have to compare cheesesteak to is the crap they give you at the malls ", "a la Great Steak Escape or whatever ", "but I came away satisfied. ", "The 4 star rating Yelp gives you sums it up nicely ", "\"Yay! ", "I'm a fan. ", "\""], "author": "Carlo R.", "review": "I checked out this place because it was pretty hyped up by one of my friends. She hyped it up really good so upon coming here my initial impression was kind of below expectations..was kind of expecting something fancy but it kinda looks like a run down fast food joint. I ordered the steak and mushroom and I'll admit, it didn't look that good at first but then I took a bite and.....DAAAMNNN!! Like, shit is bomb. I didn't even go in there really hungry at first so I just got the 10\" but at the end of my meal I really regretted not getting a 15\" that my friend across from me had ordered. I also had a side dish of steak fries, good not great but did the job a side dish is supposed to do. I will admit the only thing I have to compare cheesesteak to is the crap they give you at the malls a la Great Steak Escape or whatever but I came away satisfied. The 4 star rating Yelp gives you sums it up nicely \"Yay! I'm a fan. \"", "rating": 4, "date": "2010-10-04"}, {"excerpts": ["Their fries are actually steak fries which are thick and meaty and go well with the sandwich.  ", "Not the cheapest sandwich shop in town, but unique and good enough that the price you pay seems to be worth it.  ", "This place is in a decent part of town, but the past couple times I've been there I noticed a strong smell of urine, probably from some bum who likes to venture in there a lot , so dining in in not an option unless you like the smell of urine and beef mixed into one.  ", "I now order to go and visit the Starbucks ", "a few doors down to chomp on my jewel of a sandwich.  ", "Good Eats!!"], "author": "Adam G.", "review": "Been here a bunch of times in my life.  This was the first place I had a cheesesteak at and so far still the best after many other attempts trying other places throughout the years.  Cherry peppers add a great texture and sweetness to this fine sandwich and to me is a must.  I always order my cheesesteak sandwich with provalone and mushrooms. Yummy!  Their fries are actually steak fries which are thick and meaty and go well with the sandwich.  Not the cheapest sandwich shop in town, but unique and good enough that the price you pay seems to be worth it.  This place is in a decent part of town, but the past couple times I've been there I noticed a strong smell of urine, probably from some bum who likes to venture in there a lot , so dining in in not an option unless you like the smell of urine and beef mixed into one.  I now order to go and visit the Starbucks a few doors down to chomp on my jewel of a sandwich.  Good Eats!!", "rating": 4, "date": "2008-08-17"}], "twister fries": [{"excerpts": ["I usually order the medium Philly Cheese Steak with twister fries or garlic chips and it compliments each other so well. "], "author": "Rick O.", "review": "One of my favorite places to eat in San Francisco!\n\nI've bee going here for months now and they're consistent with what they're selling. I usually order the medium Philly Cheese Steak with twister fries or garlic chips and it compliments each other so well. Since I love spicy, I also ask for extra hot peppers.\n\nThe space is tight and there's only like 8-10 tables but I've never had a problem. Staff is pretty friendly too!", "rating": 5, "date": "2016-10-27"}, {"excerpts": ["I tried the mushroom cheesesteak and pizza cheesesteak with hot & sweet peppers, onion rings, and twister fries.  ", "For me, the sandwiches were missing that certain 'je ne sais quoi' to take them to the next level. ", "I mean, putting meat and cheese together is fool-proof...", "so the cheesesteaks were just ordinary to me. ", "The bf and I also did not like the sweet peppers because they overpowered the savoriness of the cheesesteaks. ", "Maybe we'll have better luck next time with just the hot peppers!"], "author": "Caralisa L.", "review": "Artery-clogging eats next to a hospital? Oh, the irony. And of course, that wasn't going to stop me. I tried the mushroom cheesesteak and pizza cheesesteak with hot & sweet peppers, onion rings, and twister fries.  For me, the sandwiches were missing that certain 'je ne sais quoi' to take them to the next level. I mean, putting meat and cheese together is fool-proof...so the cheesesteaks were just ordinary to me. The bf and I also did not like the sweet peppers because they overpowered the savoriness of the cheesesteaks. Maybe we'll have better luck next time with just the hot peppers!", "rating": 3, "date": "2012-03-19"}, {"excerpts": ["a side of twister fries were good, (but dare i say i kind of prefer the ones they have at jack in the box?).   ", "but oh man, that sandwich.  ", "i could feel my arteries turning into butter.  "], "author": "Anne Marie B.", "review": "i've never had an \"authentic\" cheesesteak.  I don't think i'd like the cheez whiz.  i've never even been to philly, minus a stop in their airport a couple years back.  but i like meat.  i like big, greasy sandwiches and fried food.  i'm a carb-loading, grease-loving, over-indulging carnivore and i'm not afraid to admit it.  \n\nmy first taste of this place involved a 10\" bacon cheesesteak.  bacon! with beefy, cheesy, oniony, greasy goodness.  it was such a divine amalgam of flavors.  a side of twister fries were good, (but dare i say i kind of prefer the ones they have at jack in the box?).   but oh man, that sandwich.  i could feel my arteries turning into butter.  plus bacon!\n\non wednesday's they offer 1/2 off sides.  i got myself a stamped card (10 stamps = free 10\" cheesesteak), a coupon flyer, and an appetite for more of these sandwiches pronto.", "rating": 4, "date": "2010-06-18"}, {"excerpts": ["Two 10-inch cheeseteaks, a 32oz soda, and a large twister fries came out to about $17. ", "I'd probably go back, but I'm not in any particular rush to do so."], "author": "Kimberly S.", "review": "I thought I was being ambitious by ordering the 10-inch mushroom and cheese steak but it was just right. In terms of food quantity, the 10-inch felt to me like it was half of a $5 footlong. I had it with the twisty (curly) fries and a soda. Maybe I had high expectations, but I was a bit underwhelmed.... it was a bit on the greasy side without a lot of meat packed into the bun; I liked the cheesiness though and the combination of sweet and spicy peppers is great. My companion had been many times before and said the sandwiches and order of fries both seemed smaller than usual. Two 10-inch cheeseteaks, a 32oz soda, and a large twister fries came out to about $17. I'd probably go back, but I'm not in any particular rush to do so.", "rating": 3, "date": "2010-02-23"}, {"excerpts": ["- 2 King O Philly Cheesesteak Sandwich Meals\n   One with Twister Fries\n   "], "author": "Limzer L.", "review": "- 2 King O Philly Cheesesteak Sandwich Meals\n   One with Twister Fries\n   One with Battered Mushrooms\n- Order of Jalapeno Poppers\n- Order of Large Ranch\n\n*** The Sandwich was really good and tasty!  Along with all of the sides!  Do order a large side of ranch to go with the fries, mushrooms and poppers!  It's really thick and creamy!  Perfect! ***\n\nReminds me of a small mom and pop shop.  Decor is egh, but it's nice to see the photos of respectable cheese steak shops from around the United States.  \n\nThis is a place you have to try once and then if you're feeling like a hefty meal, then make that choice to come back...   Otherwise, I'm am trying everything once and when I think about it, I don't have enough time to try it again unless I've given a 5 star rating to an establishment.", "rating": 4, "date": "2009-04-01"}, {"excerpts": ["I usually get the Value meal which includes: A Hoagie w/cheese, lettuce and tomato,a soda and twister fries! ", "I love those peppers they use on the sandwich. ", "(where can I buy them?) "], "author": "Shanika M.", "review": "This place is the bomb! I go here at least once a month. If it was in my neighborhood I would go more often. \nI usually get the Value meal which includes: A Hoagie w/cheese, lettuce and tomato,a soda and twister fries! I love those peppers they use on the sandwich. (where can I buy them?) The wait can be awhile at times, the workers are nice and the prices are in my budget range.\n\nWriting this review makes me want one! NOW!", "rating": 5, "date": "2009-04-02"}, {"excerpts": ["Loaded with Italian meat \nand side of LARGE twister fries or onion rings are a must. "], "author": "Juliane N.", "review": "OK.. so I've been working next to this place for a little over a year.. When I first worked here, i use to eat here twice a week... until I gained weight... So I avoided this place until I lost the weight that I've gain.. So now i just eat it once every two weeks.. OK fine, maybe once a week.. Man I love this place but not what it does to me waist line. AnywhoOoo ...\nBacon cheesesteak with extra cheese \nSpinach/mushroom cheesesteak\nPhilly Cheesesteak (the regular one with just cheese and make sure to get grilled peppers and onions)\ntheir chicken cheesesteaks are awesome too!\nIf you don't want steak/chicken, their Italian Hoagie is another good choice. Loaded with Italian meat \nand side of LARGE twister fries or onion rings are a must. You're already eating 3,000 calories, might as well eat another 1,000.. \n\nI love how they have a frequent stamp card where you get it stamped every time you order a meal there and when it's filled you get a free 10\" cheesesteak of your choice! Mine gets filled fast since I'm such a fat ass eating it all the damn time but hey, at least I get some for free! Love the guys that work there, always cracking some jokes and laughing with me or at me..", "rating": 5, "date": "2007-11-04"}, {"excerpts": ["Half off these sides - ALL DAY Wednesday, Every Wednesday: Fries, Twister Fries, Onion Rings, Chips, Tastykakes"], "author": "Mark W.", "review": "One of the better cheesesteaks I have had.  I really like the sweet peppers they put on them.  That really adds to it.  Haven't been here in a while but what I remember was that they take pretty long.  Not sure if things have changed but I know one of my friends told me that the best thing to do it phone in your order ahead of time.  \n\nI've had some cheesesteaks at some regular diners and I think the best suggestion is to NOT order cheesesteaks at places that do not specialize in them.  Then again, many people may already know this.  \n\nGotta say though, I think they are better than Geno's in Philly.  When I was in Philly, I had a choice of the 2 Cheesesteak landmarks in this Country and it was between Pat's and Geno's, which are right across the street from each other, and I pretty much chose the wrong place.  \n\nI made the mistake of going to the cleaner place with no line (Geno's) when I probably should have went to Pat's (dirtier looking place WITH a line).  \n\nBut that's probably a conversation for another day...  \n\nI guess the topic was cheesesteaks and it brought me back to daydreaming about my Philly trip a few years back......  \n\nWell, let's get back to business.  Let's just say if I was in San Francisco and I had the urge for a CheeseSteak, this is probably the place I would go....\n\nDAILY SPECIALS:\nBe sure to get a Frequent Buyer's Card (1 stamp for every $7 purchase; 12 Stamps = 1 FREE 10\" Sandwich)\n\nTUESDAYS are Double Stamp Days\n\nWACKY WEDNESDAYS: \na) Buy 3 Sandwiches and get a 7\" Sandwich FREE (Xtras Not Included)\n\nb) Buy any size Italian Hoagie and get 50% off second Italian Hoagie of the same size or smaller\n\nc) Half off these sides - ALL DAY Wednesday, Every Wednesday: Fries, Twister Fries, Onion Rings, Chips, Tastykakes", "rating": 5, "date": "2007-10-23"}, {"excerpts": ["The only bright side to my meal was the twister fries drenched in cheese sauce.\n\n"], "author": "Ally C.", "review": "With the name of Cheese Steak Shop, you'd think cheesesteaks are their specialities, that they've mastered this simple concoction of buttery roll, seasoned meat, grilled onions and melted cheese over their years of establishment. And with people writing high reviews and the lover stating that it beats (my fave) Fat Philly's, how could I not resist?\n\nI went with the 7\" hoagie because I always get the hoagie at whichever cheesesteak institute I visit. There's something so unbelievably amazing about having the regular cheesesteak combo served with lettuce, tomatoes, mayo, provolone cheese, sans onions. Mmm. But that \"mmm\" turned into a \"hmm\" the second we received our cheesesteaks. While the lover ordered the classic Philly and I ordered the hoagie, I strangely could not differentiate which cheesesteak was which. They looked mundanely the same. Little roll filled with shriveled up meat covered by a medley of colorful yet unappetizing peppers. The lover obviously figured which was his, being that he actually likes this place, whereas me on the other hand had to figure out my lettuce, tomatoes and mayo were covered under that shriveled meat blanket. All that hot meat that laid on top of my veggies left them pathetically wilted and greasy. There wasn't enough mayo and I barely recall any cheese to that hoagie. The meat was not even close to being considered seasoned, it was as if I were chewing tasteless rubber that was sloppily lodged in between bread. *sigh. I sat there in despair, munching away that poor excuse for a cheesesteak. The only bright side to my meal was the twister fries drenched in cheese sauce.\n\nNever again Cheese Steak Shop, never again.", "rating": 2, "date": "2011-07-13"}, {"excerpts": ["Paired with an order of their twister fries, it's a meal fit for a king. ", "My only small complaint about this place is orders do take entirely too long to come out. ", "Don't know if the bread is baked to order  or what, but 15 -20 minutes from order to arrival can get a little irritating. "], "author": "jeff c.", "review": "Best Cheesesteaks in town! Seriously you will not be disappointed. I've been coming to this place for years and each time I grub here, the sandwiches still taste as good as when I first tried them. The joint is a little dirty and smells like a big ol' grease market, but hey you knew that already right? It's a cheesesteak shop. What did you expect?\n\nThe Cheesesteak Hoagie (steak, cheese, lettuce, tomatos, and mayo) topped with sweet and spicy peppers is my personal favorite on the board. Paired with an order of their twister fries, it's a meal fit for a king. My only small complaint about this place is orders do take entirely too long to come out. Don't know if the bread is baked to order  or what, but 15 -20 minutes from order to arrival can get a little irritating. Oh well though, still totally worth it.\n\nFor those of you who've only sampled cheesesteaks at your local Subway or Great Steak & Fry,  stop by The Cheesesteak Shop. You will seriously be blown away.", "rating": 5, "date": "2008-07-27"}, {"excerpts": ["I  got the 7 inch garlic steak with everything and twister fries ", "I'm a small girl, and it was a  perfect size for me.    ", "Since I live across town, of course I ate there.  ", "It was REALLY good.  ", "Everything was flavorful,.   ", "The meat was juicy, the mix of hot and sweet peppers was perfect.  ", "The mushrooms were to die for, but for some reason  were only distibuted on one side of the sandwich.  ", "I liked the cheese, but the next time i go (and there will be a next time time ) ", "I will get extra cheese.   ", "These are MINISCULE gripes though.  "], "author": "Sascha B.", "review": "Yummy.  I was in  the neighborhood yesterday, and had read the great reviews.  (As a side note, Divsadero seems to have many more cheaper good  options than Filmore)  I  got the 7 inch garlic steak with everything and twister fries I'm a small girl, and it was a  perfect size for me.    Since I live across town, of course I ate there.  It was REALLY good.  Everything was flavorful,.   The meat was juicy, the mix of hot and sweet peppers was perfect.  The mushrooms were to die for, but for some reason  were only distibuted on one side of the sandwich.  I liked the cheese, but the next time i go (and there will be a next time time ) I will get extra cheese.   These are MINISCULE gripes though.  It was ridiculously good overall. \n\nI happened to go at the height of lunch time, and it took about 15 minutes to get my food. (and the cashier told me how long when I was ordering, so that was nice to know.)  It was a small place, but I found a tablle where my chair wasn't blocking people.  Using  a chair or not, I definitely would not stay here with a group to eat.  Most people were taking their orders to go though. My cashier was great about bringing my order out, and even got me some water. (I was going someplace else for coffee after.) \nI'm actually glad I live across town because I would become blimp Sascha otherwise!", "rating": 5, "date": "2009-01-30"}, {"excerpts": ["Try the twister fries with cheese sauce! ", "totally rockin!!!!!!!!!!!! ", "Try the tasty cakes for your sweet fix!!!! ", "The place is filled with pic of philly and different cheese steak places there. ", "You get a good size sandwich with lots of meat and cheese,I always get extra cheese,however you get it you will like it.", "Also deli type sandwiches as well!!"], "author": "Bill J.", "review": "Freakin Great!!!!!   Terrific  food!!!! The king of cheese steaks in sf !  great service,friendly, authentic philly style !   Try the twister fries with cheese sauce! totally rockin!!!!!!!!!!!! Try the tasty cakes for your sweet fix!!!! The place is filled with pic of philly and different cheese steak places there. You get a good size sandwich with lots of meat and cheese,I always get extra cheese,however you get it you will like it.Also deli type sandwiches as well!!", "rating": 5, "date": "2011-10-16"}, {"excerpts": ["I also order a side of twister fries and 2 sides of cheese whiz for good luck. \n\n"], "author": "Robert M.", "review": "Never been to Philly so I don't know what a real cheese steak taste's like. As far as this place I like the original Philly Cheese Steak with peppers which comes with your choice of  7, 10 or 15 inch size depending on how hungry you are.  They are very generous with the peppers and kinda skimpy on the steak. I also order a side of twister fries and 2 sides of cheese whiz for good luck. \n\nFor under 10 bucks you can get a little piece of Philly. I'm getting hungry writing this", "rating": 4, "date": "2008-02-06"}, {"excerpts": ["side of twister fries, please."], "author": "Kumar D.", "review": "I like these cheesesteaks better than most of the ones I've had in Philly, including ones from Pat's and Geno's.  Maybe I just prefer chopped steak to steak-ums.  I'm not a whiz guy either so I guess I'm not a purist.  The Philly Cheese Steak Shop is hands down the best cheesesteak joint I've been to in the bay area.\n\n10\" spinach and mushroom cheesesteak w/ onions, ketchup, and mayo.  side of twister fries, please.", "rating": 5, "date": "2006-11-04"}, {"excerpts": ["( in SF at least ) The curly fries ( aka twister fries ) taste alright . ", "They have a frequent buyer card . ", "Tuesdays are double stamp days & they have special deals on Wednesdays . ", "The cashier that I ordered from was super friendly . ", "Btw , get at least a 10 inch because the 7 inch won't fill you up .. ", "it's really small & more like a snack ."], "author": "Eileen L.", "review": "I never knew there was one in SF . Hm .. now that I know that there's one closer to my house , I might be eating philly cheese steak sandwiches everyday for the next two weeks haha ! I love their philly cheese steak sandwiches .. they're the best !! ( in SF at least ) The curly fries ( aka twister fries ) taste alright . They have a frequent buyer card . Tuesdays are double stamp days & they have special deals on Wednesdays . The cashier that I ordered from was super friendly . Btw , get at least a 10 inch because the 7 inch won't fill you up .. it's really small & more like a snack .", "rating": 5, "date": "2008-11-24"}, {"excerpts": ["Get the 10\" sammy with chicken, spinach and mushrooms, hot and sweet peppers, twister fries, piles of catsup.. and dig in! ", "It's most def the best cheese steak I've ever had, unfortunately the people that work there are rude or maybe it's because I was high..."], "author": "Janice K.", "review": "Get the 10\" sammy with chicken, spinach and mushrooms, hot and sweet peppers, twister fries, piles of catsup.. and dig in! It's most def the best cheese steak I've ever had, unfortunately the people that work there are rude or maybe it's because I was high...", "rating": 4, "date": "2008-01-09"}, {"excerpts": ["Oh, the twister fries are pretty good, and don't forget to get your frequent card."], "author": "Michael G.", "review": "If you're looking for a real Philly cheesesteak, this is not your place. Those places are about 2900 miles away. If you're looking for an OK sandwich that happens to have shredded beef, a little cheese, peppers, and onions, then this is your place. Oh, the twister fries are pretty good, and don't forget to get your frequent card.", "rating": 3, "date": "2008-12-11"}], "steak chicken or deli meat": [], "cheese bacon garlic mushrooms or pepperoni": [], "tomato spinach or lettuce": [], "cheese sauce": [{"excerpts": ["I ordered a 10\" steak, the side of \"cheese sauce\" ", "(they admitted it was whiz) and put it all over my steak. ", "It was much better. ", "give it a shot."], "author": "Adam F.", "review": "This place does decent cheese steaks if you like american cheese on them, but otherwise there are better ones in the city. I typically order with provolone, and the quantity of meat/cheese in the 7\" is pretty small. Order a 10\" if you're looking for a meal out of it. I lived in Philly for 4 years and these aren't as close to an authentic cheese steak as Phat Philly (probably my favorite in SF) or Jake's (fantastic with hot peppers). \n\nInteresting hint for those looking for a more realistic  cheesesteak: this place DOES have whiz. they refuse to put it on a steak, but it is on their \"sides\" menu and comes in a little plastic cup. It's even heated. Last time I was here I ordered a 10\" steak, the side of \"cheese sauce\" (they admitted it was whiz) and put it all over my steak. It was much better. give it a shot.", "rating": 3, "date": "2012-03-26"}, {"excerpts": ["I admit, *stands up*\n\n \" I, Anna, am a cheesesteak-aholic, I am addicted to the mushroom cheesesteak with extra hot peppers and a side of steak fries with cheese sauce\"\n\n*sits down*"], "author": "Anna T.", "review": "I don't think I've crave for anything as much as I've craved for a cheesesteak from this place. \n\nIn high school, as my friends picked up smoking, I picked up cheesesteaks. ( they come in 7, 10 and 15 inch sandwiches -pick your size)\n\nIn college, as my friends dabbled with drugs, I dabbled with different combinations of cheesesteaks. (they've got everything from bacon, mushrooms, pepperoni, onions, garlic, hot and sweet peppers to chicken)\n\nThis is one of the first places I drove to when I first got my license. It's the first thing I think of when I wake up in the morning.  It's what I want at night after a long day. It's what I long for when I'm feeling down. It's what I want for Christmas... birthdays, Valentines day..... ... If I could marry it, I would.\n \n\nI admit, *stands up*\n\n \" I, Anna, am a cheesesteak-aholic, I am addicted to the mushroom cheesesteak with extra hot peppers and a side of steak fries with cheese sauce\"\n\n*sits down*", "rating": 5, "date": "2009-01-08"}, {"excerpts": ["they got spots in the east bay too and one in Reno that puts the cheese sauce like back east\n\nthink im gonna get one now"], "author": "Scotty B.", "review": "This is The Spot\n\nBest Philly in The Bay No Doubt\n\nIve been sprung on these things for years you will be too\n\ncant ever decide between the bacon cheese or garlic chicken so i get both\nthey got spots in the east bay too and one in Reno that puts the cheese sauce like back east\n\nthink im gonna get one now", "rating": 5, "date": "2008-03-28"}, {"excerpts": ["The only bright side to my meal was the twister fries drenched in cheese sauce.\n\n"], "author": "Ally C.", "review": "With the name of Cheese Steak Shop, you'd think cheesesteaks are their specialities, that they've mastered this simple concoction of buttery roll, seasoned meat, grilled onions and melted cheese over their years of establishment. And with people writing high reviews and the lover stating that it beats (my fave) Fat Philly's, how could I not resist?\n\nI went with the 7\" hoagie because I always get the hoagie at whichever cheesesteak institute I visit. There's something so unbelievably amazing about having the regular cheesesteak combo served with lettuce, tomatoes, mayo, provolone cheese, sans onions. Mmm. But that \"mmm\" turned into a \"hmm\" the second we received our cheesesteaks. While the lover ordered the classic Philly and I ordered the hoagie, I strangely could not differentiate which cheesesteak was which. They looked mundanely the same. Little roll filled with shriveled up meat covered by a medley of colorful yet unappetizing peppers. The lover obviously figured which was his, being that he actually likes this place, whereas me on the other hand had to figure out my lettuce, tomatoes and mayo were covered under that shriveled meat blanket. All that hot meat that laid on top of my veggies left them pathetically wilted and greasy. There wasn't enough mayo and I barely recall any cheese to that hoagie. The meat was not even close to being considered seasoned, it was as if I were chewing tasteless rubber that was sloppily lodged in between bread. *sigh. I sat there in despair, munching away that poor excuse for a cheesesteak. The only bright side to my meal was the twister fries drenched in cheese sauce.\n\nNever again Cheese Steak Shop, never again.", "rating": 2, "date": "2011-07-13"}, {"excerpts": ["Try the twister fries with cheese sauce! ", "totally rockin!!!!!!!!!!!! ", "Try the tasty cakes for your sweet fix!!!! ", "The place is filled with pic of philly and different cheese steak places there. ", "You get a good size sandwich with lots of meat and cheese,I always get extra cheese,however you get it you will like it.", "Also deli type sandwiches as well!!"], "author": "Bill J.", "review": "Freakin Great!!!!!   Terrific  food!!!! The king of cheese steaks in sf !  great service,friendly, authentic philly style !   Try the twister fries with cheese sauce! totally rockin!!!!!!!!!!!! Try the tasty cakes for your sweet fix!!!! The place is filled with pic of philly and different cheese steak places there. You get a good size sandwich with lots of meat and cheese,I always get extra cheese,however you get it you will like it.Also deli type sandwiches as well!!", "rating": 5, "date": "2011-10-16"}, {"excerpts": ["++ fries and cheese sauce+++++++++ must have cheese sauce. ", "Love the fact that its just so simple there - order (must not order while you are on the phone, check the sign- ", "its funny but so true), eat and go!"], "author": "Trisha C.", "review": "This place is CRAAAACKIN!!! Greasy goodness. I mean what more can you ask for, you got your protein, carbs and veggies LOL. 10 inch cheese steak with mushrooms +++++ fries and cheese sauce+++++++++ must have cheese sauce. Love the fact that its just so simple there - order (must not order while you are on the phone, check the sign- its funny but so true), eat and go!", "rating": 4, "date": "2009-03-20"}, {"excerpts": ["Had my usual 15\"  mushroom cheese steak and after a painstakingly long wait when they weren't even that busy, received my two plates of heart clogging grease including curly fries, going with the side of cheese sauce also wasn't the best idea in hindsight. ", "Like Andy R. says at least the hospital is across the street."], "author": "Rob H.", "review": "After working in the east  bay for a while the Pleasanton location became one of my weekly lunch haunts. Today I visited the Divis one, and after circling a few times found a spot to park for a late lunch. Note to self: next time just walk there and avoid the post cheese steak food coma. Had my usual 15\"  mushroom cheese steak and after a painstakingly long wait when they weren't even that busy, received my two plates of heart clogging grease including curly fries, going with the side of cheese sauce also wasn't the best idea in hindsight. Like Andy R. says at least the hospital is across the street.", "rating": 4, "date": "2006-08-14"}, {"excerpts": ["and if im feelin gluttonous.. side of curly fries w/ cheese sauce.  "], "author": "Lady K.", "review": "hands down the best cheesesteak EVER!  \n\na repeat customer of the lakeshore location, this divis locale is the next best bet living on this side of the bay.  same set up, same YUMMY philly. \n\n10 inch philly, onions, sweet and hot peppers (extra on the hot)...  and if im feelin gluttonous.. side of curly fries w/ cheese sauce.  YUM!\n\nno other cheesesteak compares.  NONE.", "rating": 5, "date": "2007-07-23"}]}