{"raspberry sorbet sundae": [], "family favorite": [{"excerpts": ["Our family favorite for ice cream sundaes.  ", "Love their chocolate mix (mini semi-sweet chocolate drops) too!"], "author": "Jonathan Y.", "review": "Our family favorite for ice cream sundaes.  Love their chocolate mix (mini semi-sweet chocolate drops) too!", "rating": 5, "date": "2015-06-04"}], "cake cone": [{"excerpts": ["... when I got my single scoop of mint chip ice cream in a plain cake cone, everything just made sense."], "author": "Nenette Y.", "review": "OK, this is embarrassing... it was 11:30PM on Friday nite and I had just finished baby sitting for my co-worker in SOMA... when I had the most intense craving for mint chip ice cream! But not just any mint chip ice cream (I could easily have gone to Safeway) it had to be Ghirardelli with their larger than average size chocolate chip chunks.\n\nSee, I've been a devoted fan of mint chip since the 3rd grade, so the size of the chips REALLY does matter. :)\n\nAnyway, it was 11:30PM on a balmy Friday nite... I had to have my fix but had zero clue if Ghirardelli was still open. Thank goodness for Verizon 411, cuz they connected me in no time pronto. AND as fortune would have it GHIRARDELLI IS OPEN TIL MIDNIGHT ON WEEKENDS!\n\nI zipped over and arrived at 11:50PM and there was STILL a line, but I didn't care... not even when I freaked some tourists out cuz I was in my PJ's (what else do you wear when you're babysitting?) ... when I got my single scoop of mint chip ice cream in a plain cake cone, everything just made sense.", "rating": 5, "date": "2006-09-09"}], "handmade chocolatedipped waffle cone": [], "vanilla  no sugar added": [], "ghirardelli caramel sauce": [], "ghirardelli chocolate sauce": [], "crushed pineapple": [{"excerpts": ["It had vanilla, strawberry, Ghiradelli chocolate ice cream topped with crushed pineapple, strawberry topping and handmade hot fudge served with a banana, whipped cream, diced almonds and a cherry! "], "author": "Jenn G.", "review": "Started the day seeing the Golden Gate Bridge  and wrapping up the afternoon with a Golden Gate Ghiradelli Banana Split from the Original Ghirardelli Ice Cream & Chocolate Shop\n\nWhen I was in San Francisco, one of the places I had in mine to visit was the Original Ghirardelli Ice Cream & Chocolate Shop. I've had Ghirardelli through the years and I thought it would be really sweet (both literally and figuratively) to check out where it all started.\n\nLocated at Ghirardelli Square at Pier 39, this place was not hard to miss. There's a big arch right at the front with the name. (It's perfect for photo ops by the way). The place is split into two sections- the chocolate shop where you can get chocolates to go and the restaurant itself.\n\nAt the chocolate shop, every one gets a free sample! They also have a variety of deals.\n\nThe restaurant is cool! They take your orders up front and then you can sit where you want. What I really enjoyed was they had a live display showing how their chocolate is made from start to finish. Along with the machines making the chocolate, they had signs showing the process. It's like having a lesson in chocolate making. \n\nFor my visit to the restaurant I got their Golden Gate Ghiradelli Banana Split. Now the Golden Gate bridge is phenomenal and this banana split named after the famous red bridge is as well. It had vanilla, strawberry, Ghiradelli chocolate ice cream topped with crushed pineapple, strawberry topping and handmade hot fudge served with a banana, whipped cream, diced almonds and a cherry! It was intense and definitely a treat.\n\nIt was truly a sweet day in San Francisco that day.", "rating": 5, "date": "2017-11-13"}, {"excerpts": ["I can't describe it any better than the menu which describes this treat as, \"A trio of vanilla, strawberry and chocolate ice cream each paired with perfect toppings - crushed pineapple, sliced strawberries and homemade chocolate syrup.  ", "All finished with fresh bananas, whipped cream, chopped almonds and a cherry.", "\"  Was it everything described?  ", "You betcha!  ", "Was it good?  "], "author": "Wilhelm Y.", "review": "My friend Eleanor came visiting from Oregon, and even on a cold rainy night she really wanted ice cream.  We dropped into the ice cream soda fountain at Ghirardelli Square to take care of her ice cream fixation.  I'm lactose intolerant so I really take it easy on dairy products, even frozen ones, as often as I can.  I've said it before, and I'll say it again ... Thank goodness for the makers of Lactaid tablets.\n\nEleanor had the Butterscotch Hot Fudge Sundae, but since I was paying I wasn't about to just sit there and watch her eat.  I ordered the Golden Gate Banana Split for myself.  It had been ages since I've had a banana split so I was really looking forward to this.\n\nYou enter the fountain at Ghirardelli, you study the menu, you place your order and pay for it then you take your numbered sign with you to grab a table somewhere.  The soda fountain was pretty empty on the night that we went, and before we could settle into our seats our dessert treats arrived.  They gave us extra spoons I guess so we could try each other's dessert.  That wasn't going to happen though.  I hate butter pecan ice cream, and my friend said she hated bananas.  \n\nMy Golden Gate (http://www.yelp.com/biz_photos/vzBSlQezq2GJkDeqBQxdtw?select=wF8NALOOlPtbUsOrsGPVjA) looked delicious.  I can't describe it any better than the menu which describes this treat as, \"A trio of vanilla, strawberry and chocolate ice cream each paired with perfect toppings - crushed pineapple, sliced strawberries and homemade chocolate syrup.  All finished with fresh bananas, whipped cream, chopped almonds and a cherry.\"  Was it everything described?  You betcha!  Was it good?  It was incredible!\n\nPrices are a bit on the high side, but I was there to enjoy good company so I really didn't care.  Friendly staff.  Fast service.  Real ice cream with real chocolate.  Lactose intolerance?  Bite me!", "rating": 5, "date": "2009-01-24"}, {"excerpts": ["Chocolate, vanilla, and strawberry ice cream sandwiched between two banana halves, topped with crushed pineapple, sliced strawberries, chocolate sauce, whipped cream, crushed almonds, and a maraschino cherry! ", "It's a classic! "], "author": "Leana L.", "review": "What place is open super late on a weeknight and isn't a bar or club? This place! We were in the area after visiting the Palace of Fine Arts and decided to grab a delicious treat before heading home.\n\nWalking in, we had a short line at the counter, ordered a \"Golden Gate,\" aka a banana split. Chocolate, vanilla, and strawberry ice cream sandwiched between two banana halves, topped with crushed pineapple, sliced strawberries, chocolate sauce, whipped cream, crushed almonds, and a maraschino cherry! It's a classic! I didn't feel like eating something heavy so late at night like a brownie sundae or a cookie sundae, so this was perfect!\n\nAfter ordering at the counter and finding a seat (this place was crowded for a Thursday night!), we waited about 10 minutes for our ice cream... Yes, it was busy, but really? 10 minuets for ice cream? Oh well, we dove in and it was the perfect way to end a nice evening. The ice cream was creamy, the fruit toppings were refreshing, and the banana was perfectly ripe!\n\nIt's overpriced ice cream in a touristy area, but you just can't go wrong with this place! Between the two of us, it was the perfect amount without feeling too guilty.", "rating": 4, "date": "2011-07-08"}], "diced almonds": [{"excerpts": ["I had the Treasure Island - Warm Brownie Sundae that comes with vanilla ice cream, a warmed Ghirardelli Chocolate Brownie half, handmade hot fudge topped with whipped cream, diced almonds and a cherry. "], "author": "Paul V.", "review": "Ghirardelli Ice Cream & Chocolate Shop is located and easily found in iconic Ghirardelli Square along the Beach & Larking Street side. There is plenty of metered street parking and private parking lots in the area. \n\nIf you check out the Chocolate Shop there is plenty of flavor options, and packages to choose from. You can even make your own bag. Also when you walk in there is usually a sales person that greets you with a free chocolate sample of the current promoted flavor.\n\nDepending on the time of year or day of the week Ghirardelli can get crowded quick because it is an hour with high traffic especially from tourist. I been here on busier and quiet times but do not let the line discourage you because they are efficient and the wait time for the order wont be too long.\n\nAt the Ice Cream shop there is plenty of dessert options between ice cream and drink variations. Inside of the Ice Cream shop there is plenty of tables and a restroom located in the back. After you place your order take your order tag and find a seat. The wait isn't that long to find a table or receive your order since people are usually rotating in and out of the shop.\n\nI had the Treasure Island - Warm Brownie Sundae that comes with vanilla ice cream, a warmed Ghirardelli Chocolate Brownie half, handmade hot fudge topped with whipped cream, diced almonds and a cherry. I modified my order without almonds due to allergies. \n\nThis is my favorite sundae and what I usually order whenever I come by. The portion size is pretty big and more than enough to share with others. They are very generous with the toppings which can get a little messy once you dig in but the sundae is served with a small plate to help manage any type of mess. The flavors of the toppings compliment each other well which nothing overpowers each other. \n\nIf you're in the area looking for chocolate, ice cream or drinks then come by and give Ghirardelli a try. Ghirardelli also has Ice Cream and Chocolate Shops located throughout the San Francisco Bay Area.", "rating": 4, "date": "2018-04-14"}, {"excerpts": ["It had vanilla, strawberry, Ghiradelli chocolate ice cream topped with crushed pineapple, strawberry topping and handmade hot fudge served with a banana, whipped cream, diced almonds and a cherry! "], "author": "Jenn G.", "review": "Started the day seeing the Golden Gate Bridge  and wrapping up the afternoon with a Golden Gate Ghiradelli Banana Split from the Original Ghirardelli Ice Cream & Chocolate Shop\n\nWhen I was in San Francisco, one of the places I had in mine to visit was the Original Ghirardelli Ice Cream & Chocolate Shop. I've had Ghirardelli through the years and I thought it would be really sweet (both literally and figuratively) to check out where it all started.\n\nLocated at Ghirardelli Square at Pier 39, this place was not hard to miss. There's a big arch right at the front with the name. (It's perfect for photo ops by the way). The place is split into two sections- the chocolate shop where you can get chocolates to go and the restaurant itself.\n\nAt the chocolate shop, every one gets a free sample! They also have a variety of deals.\n\nThe restaurant is cool! They take your orders up front and then you can sit where you want. What I really enjoyed was they had a live display showing how their chocolate is made from start to finish. Along with the machines making the chocolate, they had signs showing the process. It's like having a lesson in chocolate making. \n\nFor my visit to the restaurant I got their Golden Gate Ghiradelli Banana Split. Now the Golden Gate bridge is phenomenal and this banana split named after the famous red bridge is as well. It had vanilla, strawberry, Ghiradelli chocolate ice cream topped with crushed pineapple, strawberry topping and handmade hot fudge served with a banana, whipped cream, diced almonds and a cherry! It was intense and definitely a treat.\n\nIt was truly a sweet day in San Francisco that day.", "rating": 5, "date": "2017-11-13"}], "vanilla latte": []}