{"bottled beer": [], "beer on tap": [{"excerpts": ["They have beer on tap and serve mixed drinks. ", "We didn't order wine, but I'm pretty sure they have it. ", "The bartenders are very courteous and attentive! ", "Make sure to tip them! "], "author": "Maki K.", "review": "** CASH ONLY **\n\nThis place is great if you want a place to hang out with friends in a casual (but kind of loud) atmosphere, sipping on a few drinks, and either sing karaoke or people watch people singing karaoke!\n\nThey have beer on tap and serve mixed drinks. We didn't order wine, but I'm pretty sure they have it. The bartenders are very courteous and attentive! Make sure to tip them! We paid about $5-6 per drink.\n\nDon't be afraid to karaoke. People of all ages from all walks of life go up to sing, I love it! They have a HUGE binder full of songs too. They have songs in Spanish as well.\n\nConveniently located within walking distance from Muni stops. Not sure about the parking situation since we took public transportation.", "rating": 4, "date": "2014-02-28"}, {"excerpts": ["The beer on tap here is reasonably priced and it's a great way to wail away a Sunday afternoon. ", "The KJs are super helpful with finding a song that's not listed in their songbook and the barstaff are super hospitable, mixing up whatever strikes your fancy. "], "author": "Dena R.", "review": "The Mint made my girlfriend's birthday a great success. Not only did they reserve tables for our party, but they got the entire bar to sing \"Happy Birthday\" to her and gave her a drink on the house with a sparkler on it, garnished with a cherry. The beer on tap here is reasonably priced and it's a great way to wail away a Sunday afternoon. The KJs are super helpful with finding a song that's not listed in their songbook and the barstaff are super hospitable, mixing up whatever strikes your fancy. Seriously, they made an extra dirty martini for my friend when it was a packed Thursday night and made sure it was perfect, despite the crowd. \n\nIt can get seriously crowded here on a weekend, so that you can submit a song request at the beginning of the night and not sing it until you're about ready to leave. But that's the nature of karaoke bars, so the Mint isn't unique in that regard. \n\nOne serious fact that shouldn't be overlooked: it's connected to a sushi bar that will deliver sushi to your table while your drunk ass is screaming out Spice Girl lyrics.", "rating": 4, "date": "2011-08-22"}], "pbr": [{"excerpts": ["(I spent $4 for a pint of PBR).\n\n"], "author": "Emily D.", "review": "I came here with a group for a friend's birthday. This place was a blast!\n\nI keep seeing reviews saying that the KJ was rude, but I didn't get that from this guy. He seemed rather nice. Maybe he was a different guy.\n\nAlso, the sign posts a 2 drink minimum to sing, but that rule was definitely not enforced that night. I only had one drink and was able to sing.\n\nAlso drink prices were more than what I would like to have spent, but from what I've been experiencing in San Francisco, they are reasonable. (I spent $4 for a pint of PBR).\n\nGive this place a try!", "rating": 4, "date": "2013-07-26"}, {"excerpts": ["We got some pitchers of PBR and a round of Fernet, which came with complimentary ginger ale backs complete with ice, fancy that.\n\n"], "author": "Ashley S.", "review": "I don't even like karaoke, but I like this place. Most of the people who sang could carry a tune and put on a bit of a show for us; one guy even took off his shirt. People were loving it, and sang, drank and at one point even danced the Sunday night away in to the wee hours. \n\nThey had fatty books of what must have been thousands of songs to choose from all over the place, and the DJ seems to truly love his job. We got some pitchers of PBR and a round of Fernet, which came with complimentary ginger ale backs complete with ice, fancy that.\n\nIf I ever do sing karaoke, I'd be willing to bet it will be at The Mint.", "rating": 3, "date": "2010-10-13"}, {"excerpts": ["(I have no idea how much the beer costs, but they have Newcastle, PBR, Bud, etc. on tap) "], "author": "Janice C.", "review": "The Mint has a little piece of my heart. \n\nFrom the glittering Christmas lights draped around the stage, the lively DJ, the fantabulous song selection (there must be 5000 songs here with genres ranging from Top 40, broadway, gospel, classic artists like the Beatles, etc)  how can you not like this place?\n\nThere is a 2 drink minimum (probably more enforced during Fri and Sat nights)  since we came in on a Sunday, everybody was just chillin.  My friend had to wait awhile for her turn but it was fun watching all the other performers.  Drinks are affordable, about $6.50 for a cocktail. (I have no idea how much the beer costs, but they have Newcastle, PBR, Bud, etc. on tap) Not the best cocktails ever, but it'll do.  You'll need some liquid courage when you get up on that stage. \n\nI didn't even entertain the thought of going up there to sing, these singers are seriously talented and definitely American Idol worthy.\n\nAs Janis Joplin puts it:\n\n\"so come on, come on, come on....\n\nlet The Mint have another little piece of your heart now baby....\"", "rating": 4, "date": "2009-09-22"}, {"excerpts": ["Too much PBR deflates the eventual climax of such adventure.  ", "But thanks for that rendition of \"All Night Long."], "author": "Jeremy G.", "review": "-Large groups of white people like to belt out their favorite tunes from the 90s.  There is usually a ringleader of moderate levels of attractiveness who appears in all his friends' songs because he can sing and they can't.\n\n-Don't Stop Believing.  Everyone joins in.  And ignores the fact that this song jumped the Shark.\n\n-An older gay man sips on vodka.  Straight.  He waits in excess of an hour to sing his favorite Broadway ditty.  He's partner would rather be watching Matlock on Netflix.\n\n-Couples sing together, or more mumble the lyrics, because they have lost the heat in the bedroom.  Too much PBR deflates the eventual climax of such adventure.  But thanks for that rendition of \"All Night Long.\"  Sorry for the irony.\n\n-A 45 year woman cuts loose with her husband.  Or maybe secret boyfriend.  They might be role playing.  She drinks a cosmo.  She's out to prove brunettes do have just as much fun.\n\n-Now I am just making shit up.\n\nForget karaoke.  This the best people watching this side of a Denny's at 2am in rural Mississippi.", "rating": 4, "date": "2011-07-11"}, {"excerpts": ["PBR's are 3.75, meh.  \n\n"], "author": "Adam C.", "review": "I've been to The Mint twice now and both nights were filled with booze, songs and general bedlam.  I like the setup of Karaoke here, I have always preferred getting up on stage in front of the crowd, rather than renting out a booth for just you and your amigos.\n\nThe Mint always seems to be packed with people, even at 5 pm on Saturday.  \n\nPBR's are 3.75, meh.  \n\nPut your song in queue when you arrive, and spend the 5 bucks for a few well drinks, you will have about an hour + time to get your booze balls on before performing on stage.", "rating": 3, "date": "2010-02-21"}, {"excerpts": ["Nothing better than karaoke in front of random strangers cheering you on and singing along....not to mention the cheap beers (don't judge me because I love my pitchers of PBR) on tap and the cute bouncers."], "author": "Ben T.", "review": "Whether it's \"I Want It That Way\" on a Saturday night in front of a full bar, \"She Will Be Loved\" on a Sunday night with some regulars, or \"Dancing Queen\" on a Monday night for a friend's birthday get together, I cannot get enough of the mint.  Nothing better than karaoke in front of random strangers cheering you on and singing along....not to mention the cheap beers (don't judge me because I love my pitchers of PBR) on tap and the cute bouncers.", "rating": 4, "date": "2010-12-13"}], "ipa": [], "cocktails": [{"excerpts": ["Not the best cocktails ever, but it'll do.  "], "author": "Janice C.", "review": "The Mint has a little piece of my heart. \n\nFrom the glittering Christmas lights draped around the stage, the lively DJ, the fantabulous song selection (there must be 5000 songs here with genres ranging from Top 40, broadway, gospel, classic artists like the Beatles, etc)  how can you not like this place?\n\nThere is a 2 drink minimum (probably more enforced during Fri and Sat nights)  since we came in on a Sunday, everybody was just chillin.  My friend had to wait awhile for her turn but it was fun watching all the other performers.  Drinks are affordable, about $6.50 for a cocktail. (I have no idea how much the beer costs, but they have Newcastle, PBR, Bud, etc. on tap) Not the best cocktails ever, but it'll do.  You'll need some liquid courage when you get up on that stage. \n\nI didn't even entertain the thought of going up there to sing, these singers are seriously talented and definitely American Idol worthy.\n\nAs Janis Joplin puts it:\n\n\"so come on, come on, come on....\n\nlet The Mint have another little piece of your heart now baby....\"", "rating": 4, "date": "2009-09-22"}, {"excerpts": ["My original review of this place was less a business review, and more a reflection on the fact that I have zero self-control when there are cocktails in me. ", "Now that I know this and have accepted the fact "], "author": "Polly Enmity P.", "review": "My original review of this place was less a business review, and more a reflection on the fact that I have zero self-control when there are cocktails in me. Now that I know this and have accepted the fact I'm a lush and an attention whore, I can admit to my unabiding love of The Mint.\n\nI've come here for work happy hours, parties for my volunteer job, my birthday at least twice, random Friday afternoons when I just need to get out some frustrations, after bad dates, and my annual \"Happiest Little Jewish Xmas Ever.\" My friends and I Jew it up with some dim sum and a movie, then head here to start singing as soon as the place opens. We're usually the only people in the place for a few hours, which means we have plenty of time to sing without being shitfaced drunk to remedy the humiliation of singing in front of dozens of strangers. \n\nIf you are in town on Christmas, this is pretty much the only place to be. Tiffany was amazing. AH-MAZE-ING. She just made our night last night. Also, if you are in town on Christmas, please wait until, like, after dark to show up. My friends and I have some important monopolization of this joint to do.", "rating": 5, "date": "2009-12-26"}, {"excerpts": ["The cocktails aren't made with much detail, too me this is more of a casual beer place rather than a cocktail bar.  ", "Pick your favorite in-the-shower power ballad, get loose, and have a musically-banging time."], "author": "Kyle H.", "review": "The Mint so legit.  Go here with a big group of friends, and you will have a blast.  I've had so many good memories here, a great way to truly enjoy your friends. The cocktails aren't made with much detail, too me this is more of a casual beer place rather than a cocktail bar.  Pick your favorite in-the-shower power ballad, get loose, and have a musically-banging time.", "rating": 5, "date": "2012-10-06"}, {"excerpts": ["The drinks were a little expensive for cocktails. ", "Handed the tender a 20 for my friends alabama slamma and a coke, and got 7 bucks back. "], "author": "Warren H.", "review": "I'll hit the good first: The song selection was really good. Broad range and more than just a singer's hits. The atmosphere was good, especially for a saturday night.\n\n\nThe not so good:The drinks were a little expensive for cocktails. Handed the tender a 20 for my friends alabama slamma and a coke, and got 7 bucks back. The sound system is rather subpar for a place that focuses on karaoke (and doesn't have it on just one night like other bars). \n\nKJ clearly played with the lineup favoring a group of girls up in the front giving him goo-goo eyes. Four hours and of the three friends I was with only one of us got up for our first song.\n\nI would go here again for one or two songs with friends and then leave, wouldn't make a night of it again.", "rating": 3, "date": "2010-07-18"}, {"excerpts": ["But, thanks to a few sugary cocktails at the Mint, I was able to overcome my fear of public humiliation.  \n\n"], "author": "Jane A.", "review": "I used to be scared to death of karaoke, which my friends probably appreciated.  I'm completely clueless when it comes to things like \"pitch\" and \"singing.\"  But, thanks to a few sugary cocktails at the Mint, I was able to overcome my fear of public humiliation.  \n\nWe were there for a friend's birthday, and we had made a reservation, so there was no problem with seating.  There are plenty of songbooks around, so everyone gets a chance to flip through the catalog and pick out the perfect song (Beastie Boys, in my case... I figured I'd be better off if I didn't try to carry a tune).  \n\nAnd then there's the host (DJ?, KJ? MC? I don't know what to call him) -- I know people have a love-hate relationship with him, but I think he's AMAZING.  He keeps things running smoothly all night, which is something akin to herding kittens.   And, if you're lucky, you'll get to see him perform a karaoke song himself, and he's excellent.   He must secretly (or not-so-secretly) hate all of the terrible singers like me.\n\nI was lucky enough to be there on Valentine's Day this year, and got to see a bunch of really wonderful singers perform cheesy love songs for their partners.  My husband popped his karaoke cherry & sang \"You Shook Me All Night Long\" quite terribly, which was just about the best V-day present a girl could ask for.", "rating": 5, "date": "2009-02-26"}, {"excerpts": ["I also dug the Japanese restaurant next door, although after a couple cocktails sushi was not the easiest thing for me to stomach. ", ":", "-\\"], "author": "Renee W.", "review": "Had a blast here! Lots of songs to choose from, cool, supportive, diverse crowd, and there's nothing better than a bunch of gay men consulting me to help choose their next showtune extravaganza. I know about 4 showtunes off the top of my head, but I went with it.\n\nI also dug the Japanese restaurant next door, although after a couple cocktails sushi was not the easiest thing for me to stomach. :-\\", "rating": 5, "date": "2008-04-18"}, {"excerpts": ["Great location, fun atmousphere, especially for large groups...good beer  and a nice strong pour on cocktails...", "the wait to sing is long on the weekends, extensive music list, but 4 stars cause they don't have MY song \"fuck her gently\" by Tenacious D.  ", ":)"], "author": "regina k.", "review": "Great location, fun atmousphere, especially for large groups...good beer  and a nice strong pour on cocktails...the wait to sing is long on the weekends, extensive music list, but 4 stars cause they don't have MY song \"fuck her gently\" by Tenacious D.  :)", "rating": 4, "date": "2007-11-28"}, {"excerpts": ["They gave us charms for our cocktails - a monkey for me & a demon for her...so very appropriate. ", "We wanted to make tshirts out of the following pick up line we overheard: \"I'm only a $5 cab ride from here\".\r\n", "There was a time years & years ago when Hot & Hunky was still next door & my entire street seemed to hang out here. ", "There was a tall fellow there with seriously feathered blonde hair, tighter than tight jeans and a pink shirt tucked in. ", "He proceeded to sing Dancin Queen with such elan and such a lisp that it's forever engrained in memory. ", "I still cannot hear that song without thinking of that guy."], "author": "Colleen B.", "review": "This is the location of some of the best party nights I've had. One time I was there with my friend on her birthday and we were just trying to get a few stiff ones on the way home so we popped in for a laugh. They gave us charms for our cocktails - a monkey for me & a demon for her...so very appropriate. We wanted to make tshirts out of the following pick up line we overheard: \"I'm only a $5 cab ride from here\".\r\nThere was a time years & years ago when Hot & Hunky was still next door & my entire street seemed to hang out here. There was a tall fellow there with seriously feathered blonde hair, tighter than tight jeans and a pink shirt tucked in. He proceeded to sing Dancin Queen with such elan and such a lisp that it's forever engrained in memory. I still cannot hear that song without thinking of that guy.", "rating": 5, "date": "2005-09-21"}, {"excerpts": ["i loved the cocktails and endless song titles to choose from."], "author": "Tatiana D.", "review": "man i love the mint. i don't care what you haters say, this place rocks! the only time it doesn't rock is when it's a friday or a saturday because that's when you hear drunkards attempting eminem or vanilla ice. i'm getting chills just thinking about it. \n\non a non-busy night, you usually get the professionals and they're supportive of your performance no matter how bad it is.\n\nif you sing \"total eclipse of the heart\" the dj will shine a special light on you.\n\ni loved the cocktails and endless song titles to choose from.", "rating": 4, "date": "2007-01-13"}, {"excerpts": ["well, ok.... entertaining... add cocktails and it becomes 'highly'.  ", "My favorite part, the woman that looked like she just crawled out from her refridgerator box down the sidewalk and ripped, and I mean truly ripped, a version of Bill Withers' ", "\"Ain't No Sunshine ", "When She's Gone\"  - brought down the house."], "author": "David R.", "review": "Highly entertaining.... well, ok.... entertaining... add cocktails and it becomes 'highly'.  My favorite part, the woman that looked like she just crawled out from her refridgerator box down the sidewalk and ripped, and I mean truly ripped, a version of Bill Withers' \"Ain't No Sunshine When She's Gone\"  - brought down the house.", "rating": 4, "date": "2006-05-12"}, {"excerpts": ["Other than that, fabulously awful karaoke and decent cocktails."], "author": "K K.", "review": "This place is great, IF you have slept with the KJ.  Otherwise, you will never get to sing.  We were there for 2 hours and nobody from our party ever got called up.  Other than that, fabulously awful karaoke and decent cocktails.", "rating": 2, "date": "2010-01-13"}, {"excerpts": ["(oh yeah, and have a few cocktails while you're there...) ", "Joie de vivre!"], "author": "Risa F.", "review": "I love the Mint. Could it be because you always hear some incredible singers, mixed in with some truly memorable characters, and the occassional drag queen? Could it be because the energy of the room is a mix of crass supportive cheezy wild hilarity, with a mock-seriousness in the spotlight? Perhaps it's because the crowd is great, the song selection is broad, the DJ keeps things fresh, and I always have a good time. It makes that other place in the Marina (\"The Silver Cloud\") seem like it's for drunk sorority girls; and that the Mint is a bastion of culture. Well, it IS in a way! The Mint is San Francisco nightlife culture the way it's MEANT to be---fun, talented, self-effacing, intimate, kitschy and colorful with \"no-holds barred\". Live, love, laugh, SING! (oh yeah, and have a few cocktails while you're there...) Joie de vivre!", "rating": 4, "date": "2006-01-02"}], "nonalcoholic drinks": []}