{"extra large eggs breakfast": [], "biscuits and sausage gravy with eggs breakfast": [], "eggs benedict breakfast": [], "cheese omelette breakfast": [], "western omelette breakfast": [], "greek omelette breakfast": [], "vegetarian omelette breakfast": [], "pumping ironman special breakfast": [], "south beach special breakfast": [], "buckwheat pancakes breakfast": [], "short stack breakfast": [], "brioche french toast breakfast": [], "fruit salad breakfast": [], "yogi breakfast": [], "steelcut irish oatmeal breakfast": [], "egg breakfast": [], "eggs breakfast": [], "toast breakfast": [], "bagel breakfast": [], "english muffin breakfast": [], "piece bacon breakfast": [], "piece sausage breakfast": [], "ham breakfast": [], "burger patty breakfast": [], "avocado breakfast": [], "baked potato breakfast": [], "mashed potato breakfast": [], "hash browns breakfast": [], "sweet potato fries breakfast": [], "onion rings breakfast": [], "curly fries breakfast": [], "tater tots breakfast": [], "vegetables breakfast": [], "yogurt breakfast": [], "cottage cheese breakfast": [], "fresh squeezed oj breakfast": [], "fresh squeezed grapefruit breakfast": [], "peerless coffee breakfast": [], "peerless decaf breakfast": [], "hot tea breakfast": [], "herbal tea breakfast": [], "soda breakfast": [], "marinated chicken breast hot sandwich": [], "sourdough special hot sandwich": [], "club hot sandwich": [], "blt hot sandwich": [], "pastrami reuben hot sandwich": [], "french dip hot sandwich": [], "black forest ham and cheese cold sandwich": [], "cove meatloaf cold sandwich": [], "fresh roasted turkey breast cold sandwich": [], "roast beef with horseradish cold sandwich": [], "light chunk tuna salad cold sandwich": [], "south beach lunch": [{"excerpts": ["Since we eat gluten free the south beach lunch was the way to go.  ", "Pretty yummy.  ", "They were very accommodating about gluten free and double checked ingredients for us.  ", "Plus...they have rootbeer barrel candy at the cash register.  ", "Score."], "author": "Kim K.", "review": "Cute little place.  Here during Pride in the Castro so it was a little crazy.  The Cove seemed like a bastion of happy queerness.  Everyone was in great spirits and the service was quick and helpful.  Since we eat gluten free the south beach lunch was the way to go.  Pretty yummy.  They were very accommodating about gluten free and double checked ingredients for us.  Plus...they have rootbeer barrel candy at the cash register.  Score.", "rating": 4, "date": "2009-07-05"}], "turkey open faced sandwich": [], "meatloaf open faced sandwich": [], "macncheese": [], "vegetarian cove curry": [{"excerpts": ["Vegetarian Cove Curry (you can pick between brown rice or basmati rice)\n\n"], "author": "Hiral P.", "review": "I went to this hidden gem for the first time on 11/11/16. I loved everything about it and wondered why I hadn't tried it out before. \n\nRecommendations:\n1. Tomato Bisque Soup (comes with two wheat bread toasts)\n2. Chicken Marsala (does not come with pasta)\n3. Vegetarian Cove Curry (you can pick between brown rice or basmati rice)\n\nI loved the food and the service. The staff is very friendly and they come by often to check if you need anything. \n\nI love their menu. It's big and lots of variety. I love that they have so many choices for the soup too. \n\nThe food tasted really fresh and they were able to adjust the spice level for me upon request. \n\nI would go there again in a heartbeat. \n\nGreat for vegetarians! \n\nGreat spot for Breakfast/Brunch/Lunch/Dinner :)\n\nEasy to get a table. \n\nEasy for a big group meal too as well as kid-friendly.", "rating": 4, "date": "2016-11-12"}], "beans over brown rice": [], "black bean over brown rice": [], "open faced falafel": [], "cove veggie": [], "veggie reuben": [], "tomato bisque": [{"excerpts": ["I had the turkey sandwich with the tomato bisque which was excellent, btw. ", "My friend had a cheeseburger with fries. ", "We cleaned our plates!  ", "would definitely return!"], "author": "Charles B.", "review": "Excellent service! Everyone that worked there who walked by us checked on us, not just our waiter. The atmosphere is calm (at least during the early afternoon while we were there), with people reading newspapers and books, enjoying their lunch. I had the turkey sandwich with the tomato bisque which was excellent, btw. My friend had a cheeseburger with fries. We cleaned our plates!  would definitely return!", "rating": 5, "date": "2018-09-13"}, {"excerpts": ["Tomato Bisque Soup (comes with two wheat bread toasts)\n2. ", "Chicken Marsala (does not come with pasta)\n3. "], "author": "Hiral P.", "review": "I went to this hidden gem for the first time on 11/11/16. I loved everything about it and wondered why I hadn't tried it out before. \n\nRecommendations:\n1. Tomato Bisque Soup (comes with two wheat bread toasts)\n2. Chicken Marsala (does not come with pasta)\n3. Vegetarian Cove Curry (you can pick between brown rice or basmati rice)\n\nI loved the food and the service. The staff is very friendly and they come by often to check if you need anything. \n\nI love their menu. It's big and lots of variety. I love that they have so many choices for the soup too. \n\nThe food tasted really fresh and they were able to adjust the spice level for me upon request. \n\nI would go there again in a heartbeat. \n\nGreat for vegetarians! \n\nGreat spot for Breakfast/Brunch/Lunch/Dinner :)\n\nEasy to get a table. \n\nEasy for a big group meal too as well as kid-friendly.", "rating": 4, "date": "2016-11-12"}, {"excerpts": ["Tomato Bisque, a main and it is damn good.\n", "3. "], "author": "Troy C.", "review": "It isn't elegant, but it is good stick to your ribs fare. I love this place, I had to rate them down because quality has slipped, but some sure hits...\n\n1. Fresh Turkey Sandwich, old school and good.\n2. Tomato Bisque, a main and it is damn good.\n3. Fish & Chips, they are always really tasty.  \n\nThe Cove is a classic diner, the staff are attentive and good.  I appreicate this place for being a little slice of home.", "rating": 3, "date": "2011-03-21"}], "vegan lentil soup": [], "cream of corn": [], "chicken bow tie": [], "meatball": [], "soup  house salad duet": [], "chinese salad": [], "cream of mushroom": [], "clam chowder": [{"excerpts": ["The food (fish and chip with coleslaw & Cove club with Clam Chowder....YUM!)  came pretty quickly and they were very good about checking back in and making sure things were ok.  ", "They called us \"sweethearts and baby\" which were cute..."], "author": "judy l.", "review": "It was my first time going to the Cove and I must say I was impressed with the service and most of the food.  They messed up one small thing since I ordered the salad with dressing on the side but it came with the dressing on top...oh well.  \n\nLots of people were already in and eating when I stopped in.  We sat ourselves and were given menus within 1 minute and asked what we wanted for drinks.  I ordered Coke and he ordered OJ.  Wow....service was fast... next time I looked up from the menu, the OJ was on the table and the Coke (glass + carafe) was there too.  The wait staff waited just long enough and took our orders.  The food (fish and chip with coleslaw & Cove club with Clam Chowder....YUM!)  came pretty quickly and they were very good about checking back in and making sure things were ok.  They called us \"sweethearts and baby\" which were cute...I love it when people really enjoy their jobs.  \n\nWe finished up and the bill was brought to us.  We paid and left a nice tip on the table.  I will likely to be back to try their breakfast!", "rating": 4, "date": "2009-08-29"}, {"excerpts": ["On Friday's, the clam chowder is especially good.\n\n"], "author": "Karl W.", "review": "The Cove Cafe is your basic neighborhood diner -- if your neighborhood happens to have video montages of their past gay clientele.   Gay or Straight, you'll be cheerfully greeted by the friendly staff.\n\nAgain, the food is basic diner cuisine, but well made and served hot from the kitchen.  On Friday's, the clam chowder is especially good.\n\nWhat makes this place we keep going back to -- other than the good food -- is the friendly staff who make you feel at home.\n\nIf you are in the Castro, and looking for a quick bite to eat, I highly recommend the Cove Cafe to get your bodily fuel so you can hit the neighborhood running.", "rating": 4, "date": "2009-01-23"}], "potato leek": [], "pork pozole": [], "split pea": [], "albondigas": [], "spicy chickpea": [], "cream of spinach": [], "chicken tortilla": [], "white bean": [{"excerpts": ["I ordered a black forest ham & cheddar sandwich with white bean soup & it was perfect. ", "Why 4 instead of 5 stars?  ", "They should offer a soup & half-sandwich plate which we thought we ordered. ", "Still a great classic lunch spot in the Castro & we love that they are here."], "author": "Scott F.", "review": "I had a craving for soup & sandwich. I ordered a black forest ham & cheddar sandwich with white bean soup & it was perfect. Why 4 instead of 5 stars?  They should offer a soup & half-sandwich plate which we thought we ordered. Still a great classic lunch spot in the Castro & we love that they are here.", "rating": 4, "date": "2017-06-29"}, {"excerpts": ["We had the white bean soup, salmon salad, meatloaf and hamburger with the NEST fries!!! ", "The price was very reasonable for the quality and quantity. ", "Definitely a great place to eat!!!"], "author": "Phyllis N.", "review": "This was my first visit, but won't be my last. The staff was very attentive and friendly without being intrusive. The food was WONDERFUL!!! We had the white bean soup, salmon salad, meatloaf and hamburger with the NEST fries!!! The price was very reasonable for the quality and quantity. Definitely a great place to eat!!!", "rating": 5, "date": "2018-06-10"}], "vegan white bean": [], "sweet potato": [{"excerpts": ["Brie burger with onions and sweet potato fries. ", "Server was extra friendly and quick! ", "The restaurant was modern and colorful. ", "Parking was not easy but we got our exercise."], "author": "Debbie v.", "review": "I had the best burger here! Brie burger with onions and sweet potato fries. Server was extra friendly and quick! The restaurant was modern and colorful. Parking was not easy but we got our exercise.", "rating": 4, "date": "2018-07-25"}], "lentil": [{"excerpts": ["VEGAN LENTIL ", "SOUP- not enough hearty lentils! ", "I've made much better at home. ", "It came with a slice of their \"house made\" irish soda bread, but if you ask me that bread was store bought yesterday and sliced too thin. ", "Ever have soda bread at The Phoenix?!!? "], "author": "Raquel C.", "review": "So you want a reasonably priced meal at a joint with a low-key vibe? Well, I can recommend quite a few others far better than the Cove. \n\nIt seems most review The Cove for breakfast or lunch, so perhaps I made the mistake in going there for dinner. I paid $20 (including tip- and it was a less than $2 tip, yes...you'll see why) for a bowl of soup, a slice of bread, two glasses of wine and a plate of veggies. Ok, so for $20 that's not bad. However the food and service were mediocre.\n\nVEGAN LENTIL SOUP- not enough hearty lentils! I've made much better at home. It came with a slice of their \"house made\" irish soda bread, but if you ask me that bread was store bought yesterday and sliced too thin. Ever have soda bread at The Phoenix?!!? I was expecting it to be more like that....or at least warmed up.\n\nVEGETABLES- thankfully it was a large portion of broccoli, cauliflower, and carrots (as most places skimp on side orders of veggies), but they were cooked with just a bit too much butter. If they'd buttered it up by even 1/4 a teaspoon more I would think I was having Denny's diner style veggies (Or Lucky Penny, anyone?). Hmm...yeah.\n\nAnd as for the service... I was eyeing the corner table next to the window, as it seemed more cozy and is semi blocked off by the entry drapes. When the patron sitting there left, I looked to the waiter to make sure it was okay to move. He didn't seem too enthusiastic about having to clean up the table so quickly, so I gave him a few minutes to clear it and started to move my things. As I was doing so, he brought food to my old table and my suspicion was confirmed as he didn't even offer to help me relocate my utensils, beverage, or either of the two plates and bowl with me. Might I add, I was one of about 6 people there. \n\nNo need to try it again.", "rating": 2, "date": "2009-12-09"}, {"excerpts": ["They enthusiastically told us about the history of the place, the people who frequent there, the lentil soup, and they invited us to bring our photos for their digital walls.   "], "author": "yelposity o.", "review": "What is the number one thing you want in a diner?  Love.  Yep.  You got it. Good ole' downhome unabashed love. The Cove Cafe is full of it.   \n\nWe just left there from a Saturday lunch, and felt absolutely welcomed by both the wait staff and the fellow patrons.  They enthusiastically told us about the history of the place, the people who frequent there, the lentil soup, and they invited us to bring our photos for their digital walls.   We're a straight couple (not always so popular in the Castro), and we greatly appreciated feeling a vibe that was both relaxing and accepting.\n\nWe loved the warmth and neighborhood-feel so much that we're sure to be back.  Diner food is diner food, but diner love is finer love.  Stop in and get yourself some.", "rating": 4, "date": "2006-10-28"}], "the cove burger": [{"excerpts": ["For lunch I had the Cove Burger a Brie cheeseburger that comes with fries.  ", "It was really good.  ", "I'm sure I'll be back."], "author": "Mark B.", "review": "This may not be one of those memorable meal kind of places but the food is solid and the service warm.   In fact the place is designed to be comfortable.\n\nI lucked into having one of two window tables.  With great views since two sides of the table are glass and the Castro Theater across the street.\n\nEven if you don't get a window there are monitors all over showing pictures old and new of the neighborhood  and its people.\n\nFor lunch I had the Cove Burger a Brie cheeseburger that comes with fries.  It was really good.  I'm sure I'll be back.", "rating": 4, "date": "2016-05-07"}], "the mexican burger": [], "the french burger": [], "patty melt": [{"excerpts": ["Their club sandwich, patty melt, onion rings, cobb salad, tomato soup, and fish and chips can't be beat.\n\n"], "author": "Mark K.", "review": "Our default spot to grab lunch or dinner if we don't want to cook.\n\nThe longstanding staff are wonderful and I never fail to be charmed by Solange. Their club sandwich, patty melt, onion rings, cobb salad, tomato soup, and fish and chips can't be beat.\n\nHowever, recently we've noticed some problems with both food and service during evening hours when we see less-familiar staff in the dining room (and I assume kitchen). Over the past few months we've had a few minor misfires that we've chalked up to new staff needing training. I assume this is the case and Solange and company will get things back to their usual wonderful experience.", "rating": 4, "date": "2015-05-09"}, {"excerpts": ["Because they serve a good patty melt and their fry cook knows how to get the onion rings and fries crispy. ", "Not only that, but they have the perfect breakfast combo: ", "The Cove Combo - 2 eggs, bacon or sausage, and half a belgian waffle. ", "Add strawberries to the waffle and hash browns on the the side for the perfect breakfast. "], "author": "Amy S.", "review": "I love The Cove. Why? Because they serve a good patty melt and their fry cook knows how to get the onion rings and fries crispy. Not only that, but they have the perfect breakfast combo: The Cove Combo - 2 eggs, bacon or sausage, and half a belgian waffle. Add strawberries to the waffle and hash browns on the the side for the perfect breakfast. A little bit of everything.\n\nUpside: love the neighborhood feel, lots of regulars and the staff is friendly\nDownside: gets busy on the weekends, so sometimes you have to wait a few - but that's to be expected.", "rating": 4, "date": "2012-10-23"}], "housemade turkey burger": [], "housemade garden burger": [], "cove turkey dinner": [], "baconwrapped stuffed pork loin": [], "cove meatloaf dinner": [], "chicken piccata dinner": [], "flank steak": [], "angus new york steak": [], "chicken cordon bleu": [], "turkey pot pie": [{"excerpts": ["Tomato soup to die for, good comfort food menu  but avoid the turkey pot pie - it totally sucks."], "author": "TIM E.", "review": "Tomato soup to die for, good comfort food menu  but avoid the turkey pot pie - it totally sucks.", "rating": 3, "date": "2007-11-10"}], "fishnchips": [], "roasted half chicken": [], "pan fried tilapia": [], "organic chicken sausage ravioli": [], "chipotle roasted  chicken": [], "bbq beef brisket": [], "italian sausage penne": [], "thai curry over rice  vegetarian chicken or beef": [], "pan fried red snapper": [], "chicken fettuccini": [], "italian sausage lasagna": [], "chicken ala lorenzo": [], "liver with bacon  onions": [], "blackened halibut cajun style": [], "teriyaki pork loin": [], "pan fried dover sole": [], " chicken enchiladas": [], "wild sockeye salmon": [], "pork in salsa verde with corn tortillas": [], "pan fried salmon": [], "slow cooked beef brisket": [], "pan fried sea of cortez corvina": [], "homemade meatloaf dinner special": [], "fresh sea of cortez corvina": [], "pork tamales": [], "mexican carnitas": [], "pan fried lingcod": [], "mediterranean pappardelle": [], "orange dijon mustard pork loin": [], "chicken saltimbocca": [], "marinated london broil": [], "cherry pie": [{"excerpts": ["And so many nice suprises like homemade soda bread and awesome cherry pie. ", "Throw is some good classic oldies and I'm all set. ", "Though it doesn't look like a typical diner inside, it's still cosy, and the food is better than most diners I've been to. ", "Great meatloaf and patty melts. ", "Our server was not only a sweetheart, but had great suggestions throughout our meal. ", "And another nice man working at the time brought sneezing patrons napkins and stopped me from leaving without my umbrella. ", "I am happy to have a nice cosy comfort food spot in a neighborhood I like to visit."], "author": "Isabel L.", "review": "What a wondeful spot! Great service and delicious food. And so many nice suprises like homemade soda bread and awesome cherry pie. Throw is some good classic oldies and I'm all set. Though it doesn't look like a typical diner inside, it's still cosy, and the food is better than most diners I've been to. Great meatloaf and patty melts. Our server was not only a sweetheart, but had great suggestions throughout our meal. And another nice man working at the time brought sneezing patrons napkins and stopped me from leaving without my umbrella. I am happy to have a nice cosy comfort food spot in a neighborhood I like to visit.", "rating": 5, "date": "2011-02-24"}], "tuxedo chocolate cake": [], "key lime pie": [{"excerpts": ["Coffee and key lime pie also fantastic. ", "Great service and really comfortable environment."], "author": "Katie S.", "review": "The hot chocolate is amazing! Coffee and key lime pie also fantastic. Great service and really comfortable environment.", "rating": 5, "date": "2018-09-03"}], "chocolate panettone bread pudding": [], "mango cheesecake": [], "strawberry shortcake": [], "pork loin  eggs": [], "austin scramble": [], "pork sausage omelette": [], "irish scramble": [], "pork loin and eggs brunch special": [], "fiesta casserole  eggs": [], "mexican benedict brunch special": []}