{"two eggs any style": [], "three eggs any style": [], "veggie scram": [{"excerpts": ["I've only been for breakfast as it is around the corner from my place, but have had the Veggie Scram and the Haight Scram, both of which are excellent and come with great potatoes and some toast. ", "The breakfast burrito is great also, abeit a little spicy ", "but that is probably just me. ", "Definitely big portions and very fast service. ", "And I like that they have little packets of blackberry jam, "], "author": "Alissa C.", "review": "I've only been for breakfast as it is around the corner from my place, but have had the Veggie Scram and the Haight Scram, both of which are excellent and come with great potatoes and some toast. The breakfast burrito is great also, abeit a little spicy but that is probably just me. Definitely big portions and very fast service. And I like that they have little packets of blackberry jam, not just strawberry, because blackberry is my favorite!\n\nCoffee is okay...not sure what kind they brew here, not my favorite, but they have a large assortment of other drinks. I really appreciate the always full water pitchers they have available, its nice not to have to ask for refills all the time.\n\nLove the outside patio area and the ample room between tables, I never feel like I am intruding in people's personal space as I am walking around the place.", "rating": 3, "date": "2010-12-15"}], "mediterranean scram": [{"excerpts": ["I ordered the Mediterranean scram which consisted of scrambled eggs mixed with spinach, mushrooms, onions, tomatoes and feta cheese. ", "My girlfriend ordered Nutella pancakes with bananas and that tastes exactly how good it sounds! ", "You won't get disappointed."], "author": "Melissa C.", "review": "Chill atmosphere and nice location in the heart of SF! The food tasted homemade. I ordered the Mediterranean scram which consisted of scrambled eggs mixed with spinach, mushrooms, onions, tomatoes and feta cheese. My girlfriend ordered Nutella pancakes with bananas and that tastes exactly how good it sounds! You won't get disappointed.", "rating": 5, "date": "2015-08-20"}], "haight scram": [{"excerpts": ["I love the Haight Scram. ", "The egg sandwich is surprisingly good too (choose the english muffin as your bread and see). "], "author": "Eli P.", "review": "I will begin this review by stating that I think the issues some people have with this place could be alleviated if everyone bussed their own table after they finish eating - the bins are over by the cooking area - do the next person after you a favor and clean up after yourself!\n\nThe Grind is an excellent breakfast spot in the Haight. Some items are better than others. For example, you get a potato option with a few items, always get the home fries (otherwise you get french fries or unimpressive hash browns). The homefries are real chopped potatoes with some veggies! The omelets and scram dishes are yummy! I love the Haight Scram. The egg sandwich is surprisingly good too (choose the english muffin as your bread and see). If you like a sweet breakfast, treat yourself with the croissant french toast!\n\nCoffee is basic and good - they also have great smoothies. Overall, a nice place. It can get super busy, with a line going out the door. I always have a moment where I freak out and think I won't get a seat by the time I order, but that's yet to happen. Sometimes I come alone and bring a book to read while I finish my coffee, great place to do this :)\n\nI think you  may be able to fit up to a group of 6 here, if you squish some tables together - just keep in mind you order at the counter.", "rating": 4, "date": "2013-11-12"}, {"excerpts": ["The coffee was great, and we tried many items off of the breakfast menu, including the Haight Scram, the breakfast burrito, and the chicken fried steak to name a few. ", "We'd definitely recommend this place to a friend."], "author": "Breylan D.", "review": "We loved this place! My boyfriend and I stayed in an AirBNB not too far from here and wound up quickly becoming regulars. We ate here every day because of the convenience, and how good the food actually was. The coffee was great, and we tried many items off of the breakfast menu, including the Haight Scram, the breakfast burrito, and the chicken fried steak to name a few. We'd definitely recommend this place to a friend.", "rating": 5, "date": "2015-02-09"}, {"excerpts": ["I ordered the Haight Scram (avocado, bacon, green onions) and a fruit cup. ", "Both were exceptional! ", "I would definitely go back if I lived nearby!"], "author": "Karina H.", "review": "This was another recommendation by one of the desk clerks at our hotel (The Metro Hotel). I am SO glad we were given this recommendation!!! The food here was AMAZING!!\n\nI ordered the Haight Scram (avocado, bacon, green onions) and a fruit cup. Both were exceptional! I would definitely go back if I lived nearby!", "rating": 5, "date": "2013-07-02"}, {"excerpts": ["The Haight scram is a favorite, also the croissant french toast, and the amazing orange juice! \n\n"], "author": "Jennifer H.", "review": "This is a regular stop for me (once or twice a week) for a quiet place to sit and read, while eating some tasty food stuffs. \nThe Haight scram is a favorite, also the croissant french toast, and the amazing orange juice! \n\nPrices are good for the portion sizes, and the staff is always very nice and accommodating. \nDefinitely will continue to be my \"go-to\" until I move out of the lower Haight.", "rating": 4, "date": "2013-07-16"}, {"excerpts": ["Coffee is just fair, while the Haight Scram was a mess of goodness. ", "Check it out; cool vibe."], "author": "Michael S.", "review": "Young lady at the counter was charming and pleasant at 7 am, so no problem there. Coffee is just fair, while the Haight Scram was a mess of goodness. Check it out; cool vibe.", "rating": 3, "date": "2012-05-20"}, {"excerpts": ["I had the Haight scram which is scrambled eggs with avocado, bacon and cheddar cheese. ", "Outrageous! ", "There coffee and multigrain bread was delicious also. ", "A great little find in the area."], "author": "Mrs. M.", "review": "When you wake up at 5am San Francisco time, which is actually 8am NY time you start to think about breakfast. My husband and I found The Grind Cafe opened at 7am with rave reviews. I can only add to the rave reviews. I had the Haight scram which is scrambled eggs with avocado, bacon and cheddar cheese. Outrageous! There coffee and multigrain bread was delicious also. A great little find in the area.", "rating": 4, "date": "2013-10-09"}, {"excerpts": ["I've only been for breakfast as it is around the corner from my place, but have had the Veggie Scram and the Haight Scram, both of which are excellent and come with great potatoes and some toast. ", "The breakfast burrito is great also, abeit a little spicy ", "but that is probably just me. ", "Definitely big portions and very fast service. ", "And I like that they have little packets of blackberry jam, "], "author": "Alissa C.", "review": "I've only been for breakfast as it is around the corner from my place, but have had the Veggie Scram and the Haight Scram, both of which are excellent and come with great potatoes and some toast. The breakfast burrito is great also, abeit a little spicy but that is probably just me. Definitely big portions and very fast service. And I like that they have little packets of blackberry jam, not just strawberry, because blackberry is my favorite!\n\nCoffee is okay...not sure what kind they brew here, not my favorite, but they have a large assortment of other drinks. I really appreciate the always full water pitchers they have available, its nice not to have to ask for refills all the time.\n\nLove the outside patio area and the ample room between tables, I never feel like I am intruding in people's personal space as I am walking around the place.", "rating": 3, "date": "2010-12-15"}, {"excerpts": ["The food is delicious with fun creative names; the Haight Scram is my favorite. ", "I LOVE that they have rye toast! ", "I always see the same wonderful smiling ladies working the cash register and coffee bar. ", "They are always so nice and cheerful. ", "It is definitely a great treat seeing attentive help with smiles as this place is PACKED on the weekends. ", "Although, I have stopped by on my bus ride to work during the week and they are still there, smiling and ready to help out. "], "author": "Misty G.", "review": "YUM! The food is delicious with fun creative names; the Haight Scram is my favorite. I LOVE that they have rye toast! I always see the same wonderful smiling ladies working the cash register and coffee bar. They are always so nice and cheerful. It is definitely a great treat seeing attentive help with smiles as this place is PACKED on the weekends. Although, I have stopped by on my bus ride to work during the week and they are still there, smiling and ready to help out. It is so nice to be greeted with that kind of service.\n\nFor me the weekends are a toss up, if it is a nice day I will stick out the wait to sit on the patio area, but on those lazy rainy weekends I enjoy calling in my order, picking it up and enjoying food from bed or the couch with a blanket and movie. Either way, it is quick happy service.", "rating": 4, "date": "2010-02-16"}, {"excerpts": ["The food in general doesn't particularly stand out, but I can always count on the Haight scram with wheat toast and fruit instead of potatoes for a good start to the day, and I'm quite fond of the chicken pesto sandwich.\n\n"], "author": "Brian M.", "review": "The food in general doesn't particularly stand out, but I can always count on the Haight scram with wheat toast and fruit instead of potatoes for a good start to the day, and I'm quite fond of the chicken pesto sandwich.\n\nThe staff are what earn the place a fourth star. I'm a local regular, and I eat at the place 5-8 times a week. The cute girls and pleasant guys know my coffee order and often begin preparing it before I make it to the counter. They go out of their way to be nice to me, and they've earned my loyalty.", "rating": 4, "date": "2007-04-16"}, {"excerpts": ["I could eat the Haight Scram with tofu instead of eggs everyday! ", "Their toast is perfect with it- big slices of sourdough."], "author": "Heidi J.", "review": "I like to call this \"MTV's The Grind with Eric Nies\". \n\nI could eat the Haight Scram with tofu instead of eggs everyday! Their toast is perfect with it- big slices of sourdough.", "rating": 5, "date": "2009-02-07"}, {"excerpts": ["For me that prize is the Haight Scram. ", "All the scrambles hit the spot. ", "You can get it with just about anything and ranging from bacon, apple sausage, lox, Niemen ranch beef, or veggies (for the health conscious). ", "I'm sure lunch is delightful, but why ruin a good thing when breakfast is what I want."], "author": "Adam S.", "review": "What is there to say about The Grind Cafe...besides that it is absolutely delicious! You know that feeling you get when you wake up late Saturday morning and you want that ultimate meal? It's the time where it's to late for breakfast but your just not ready for lunch. That is what I call \"The Grind Time.\" The fellas and I typically roll into here like a scene out of Entourage (Aw Yeah!) with our eyes on the prize. For me that prize is the Haight Scram. All the scrambles hit the spot. You can get it with just about anything and ranging from bacon, apple sausage, lox, Niemen ranch beef, or veggies (for the health conscious). I'm sure lunch is delightful, but why ruin a good thing when breakfast is what I want.", "rating": 4, "date": "2010-02-24"}], "grind scram": [{"excerpts": ["Had breakfast here yesterday, I'm always weary about scrambled eggs but decided to get The Grind Scram. ", "I really liked the way they make their scramble, lots of filling ", "and I like the way it's all packed in this rectangle shape with cheese on top ", "holding it together. ", "I like dense tasting texture and that's what this scramble was! ", "Very happy. ", "The Hashbrown I got was ok not the best I've had. ", "They need to make it more crispy on the outside, but it was good. ", "Coffee, eh, kinda watery."], "author": "Karen T.", "review": "Had breakfast here yesterday, I'm always weary about scrambled eggs but decided to get The Grind Scram. I really liked the way they make their scramble, lots of filling and I like the way it's all packed in this rectangle shape with cheese on top holding it together. I like dense tasting texture and that's what this scramble was! Very happy. The Hashbrown I got was ok not the best I've had. They need to make it more crispy on the outside, but it was good. Coffee, eh, kinda watery.", "rating": 4, "date": "2010-04-05"}, {"excerpts": ["I like the Grind Scram. "], "author": "Christine P.", "review": "I love The Grind Cafe. I live really close by and it's so nice to be able to walk over within a minute or two. The folks are always friendly and if you're a regular coffee drinker, they'll remember and offer you recommendations on what you might like to try. The Sister and I loved the granola with yogurt and fresh fruit. Ask for a little bit more yogurt when you order though. It comes with strawberries, blueberries and bananas and at the very end I like to mix in some honey (when all of the fruit except the bananas is gone). The coffee is mediocre but the scramblers are yummy. I like the Grind Scram. Get it with the hash browns and sourdough toast and then eat the latter with a little butter and a lot of blackberry jam and you're all set! Viva la breakfast!", "rating": 3, "date": "2009-07-21"}], "ham scram": [{"excerpts": ["I ordered the ham scram with avocado, toast and hash browns. ", "Let me tell you, I inhaled everything. ", "I'd put some of the scram on my toast and it'd taste even better. ", "As always, staff was friendly and nice, atmosphere was chill, food was awesome."], "author": "Laura F.", "review": "I liked this place... another cool breakfast place within walking distance. I ordered the ham scram with avocado, toast and hash browns. Let me tell you, I inhaled everything. I'd put some of the scram on my toast and it'd taste even better. As always, staff was friendly and nice, atmosphere was chill, food was awesome.", "rating": 5, "date": "2011-04-13"}], "link sausage scram": [], "italian scram": [], "hot links scram": [], "lox scram": [], "joes scram": [], "chorizo scram": [], "garden scram": [], "tofu scram vegan": [], "denver": [{"excerpts": ["Their Denver omelet is quite good!\n\n"], "author": "Daniel P.", "review": "I come here once a week or so for breakfast and coffee when I work from home.\n\nThe espresso drinks are pretty good here, as is their hot drop coffee. However I was disappointed with the iced coffee when I ordered it; it didn't seem very fresh.\n\nThe food can be pretty hit or miss. I am a huge fan of eggs benedict, and theirs is certainly passable, albeit not spectacular. They poach eggs pretty well, but their hollandaise sauce is sometimes on the tangy side for me, and they don't use very much. Their Denver omelet is quite good!\n\nThe staff are always down to earth and friendly.", "rating": 3, "date": "2014-05-14"}, {"excerpts": ["I usually got a Denver omelette or something similar, with hash browns and a bagel, and this breakfast was spot-on for me!\n\n"], "author": "Rick B.", "review": "Holy omelette, Batman, I'm absolutely crazy about this place.\n\nSeriously, one of my biggest disappointments in leaving SF is that I won't have this place around the block anymore. Their menu is enormous, and the lunch and dinner sandwiches are pretty good, but breakfast at The Grind is really where it's at. The omelettes are totally delicious, and I take my eggs very seriously. Excellent toast and I love the hash browns, too (but not so much the home fries). Great bagels, smoothies, they have beer...the list goes on and on and on. Oh, and the staff is really friendly, too.\n\nI should temper my enthusiasm with a disclaimer that I'm very biased; their breakfast is perfect for me, for the way that I like breakfast, which is very very hearty. If you're way into baked goods, then you can do a lot better, and i didn't eat enough eggs cooked any other way but scrambled or in omelette form to have a strong opinion on different preparations. I usually got a Denver omelette or something similar, with hash browns and a bagel, and this breakfast was spot-on for me!\n\nIt would merit five stars if it had better lunch which, again, is perfectly fine but not exceptional. Other than that, I'm not huge on their coffee, and I got totally spoiled on fresh-squeezed orange juice in SF so I wish they had that, too. Overall, though, 5+++ stars for breakfast, especially on warm days with the big windows open. It can be very crowded and loud on such days, though, especially on the weekends, something to keep in mind.", "rating": 4, "date": "2012-10-11"}, {"excerpts": ["I had an Denver omelette, with english muffin and fruit cup.  ", "The omelette was pretty full... complete with egg shell.  ", "The fruit cup was large cereal bowl large but cost a $1.50 more to substitute for potatoes. ", "The ice tea was a little bitter but at least they had lemon.   ", "I wouldn't make a special trip to there ", "but if you are in the neighborhood not a bad choice."], "author": "Kevin C.", "review": "I have only had breakfast there but it was OK. I had an Denver omelette, with english muffin and fruit cup.  The omelette was pretty full... complete with egg shell.  The fruit cup was large cereal bowl large but cost a $1.50 more to substitute for potatoes. The ice tea was a little bitter but at least they had lemon.   I wouldn't make a special trip to there but if you are in the neighborhood not a bad choice.", "rating": 3, "date": "2007-10-07"}], "scott street": [{"excerpts": ["My aunt had the Scott Street Omlett and they did not skimp on the filling. ", "My mom had a Belgium waffel with strawberries/bananas drizzled with Nutella which was presented beautifully. "], "author": "Donna P.", "review": "We were looking for a place to eat near CPMC (hospital). We were pleasantly surprised with this place. My aunt had the Scott Street Omlett and they did not skimp on the filling. My mom had a Belgium waffel with strawberries/bananas drizzled with Nutella which was presented beautifully. I had the BLTA on toasted sourdough with fries which really hit the spot. The food was great and the employees we're very friendly. I checked out the food that other people had sitting around us. It all looked very appetizing;  burgers, salads, bagels, breakfast, gormet coffees, teas. I have no idea why anybody would give this place less than 3 stars even if they were having a bad day.", "rating": 5, "date": "2018-06-13"}, {"excerpts": ["I got the Scott Street omelette. ", "It was a good size and it tasted good. ", "It's counter service which I wasn't a fan of and they charge if you want any dressings."], "author": "Tania C.", "review": "This was an ok spot. I felt it was overpriced for the quality of the food, but it wasn't horrible. I got the Scott Street omelette. It was a good size and it tasted good. It's counter service which I wasn't a fan of and they charge if you want any dressings.", "rating": 3, "date": "2017-03-12"}, {"excerpts": ["He picked up Scott Street omelette (his name is Scott, har-har) and a bagel on the side. ", "I was fully expecting to have some of the omelette, but the bagel with sun-dried tomato cream cheese was too tasty to resist. ", "The omelette platter was a lot more food than we were bargaining for, and I was mainly glad that I didn't order a second one. ", "The cider was okay, but man, that bagel and cream cheese...", "I really, really, really want another one. "], "author": "Robbin A.", "review": "Came in while house sitting with the boyfriend before heading out for a drive to Sacramento. He was on another non-caffeine run, so I decided to follow up. I got a hot apple cider, which came in a fancy glass...and a paper cup sleeve with David Tennant on it. SCORE. (Of course, he ended up getting some caffeinated beverage by \"accident\", I'm sure.)\n\nHe picked up Scott Street omelette (his name is Scott, har-har) and a bagel on the side. I was fully expecting to have some of the omelette, but the bagel with sun-dried tomato cream cheese was too tasty to resist. The omelette platter was a lot more food than we were bargaining for, and I was mainly glad that I didn't order a second one. The cider was okay, but man, that bagel and cream cheese...I really, really, really want another one. Soon.\n\nAnd honestly, with David Tennant staring at me from my cup, it is pretty much impossible for me to associate this place with anything bad. Soon, bagel and David Tennant...I will be back.", "rating": 4, "date": "2014-09-16"}, {"excerpts": ["Beautiful day helped as I sat on the patio working, drinking great coffee, and destroying the tasty Scott Street omelet (standard avocado, bacon, and assorted veggies) that was cheerily brought out to me. \n", "Great cafe is you're looking for something in the area."], "author": "Dan C.", "review": "In town for a few days, and The Grind was recommended by our friends who live right around the corner. Described as having \"everything you need\", from wifi to a great food selection, it did not disappoint in the least. Beautiful day helped as I sat on the patio working, drinking great coffee, and destroying the tasty Scott Street omelet (standard avocado, bacon, and assorted veggies) that was cheerily brought out to me. \nGreat cafe is you're looking for something in the area.", "rating": 5, "date": "2012-10-19"}, {"excerpts": ["the Scott Street Omelette----pretty darn good and huge. "], "author": "Sherie R.", "review": "Nothing to be upset about here. The staff is friendly and very kind. We had breakfast here this morning on the patio...with doggies too and it was super fun! I had the Scott Street Omelette----pretty darn good and huge. I had a bite of my friend's croissant french toast and if I was walking 50 miles a week like she does I would have eaten the entire plate! The food here is solid. Great atmosphere...especially on a 420 weekend!", "rating": 4, "date": "2013-04-21"}], "lower haight": [{"excerpts": ["The Grind is a long-standing institution of Lower Haight. "], "author": "Jon T.", "review": "The Grind is a long-standing institution of Lower Haight. Even today, with the influx of some new businesses further east on Haight St, the Grind is still one of the only places that is reliable for all your coffee, tea, and breakfast needs. \n\nAs a vegan, there is unfortunately not a whole lot of options at your disposal. However, you can find a tofu scramble, some hummus and bagel type offerings, as well as soy and almond milk on the menu. I believe they also occasionally have some vegan baked good selections, although I didn't see any last time I was there.\n\nAlthough the vegan options aren't stellar, it's about on par with most of the rest of the neighborhood (or even SF, for that matter.) But I personally really appreciate that they have a large selection of teas. For some reason, it's rather difficult to find hot tea offerings in the area. Most of the cafes in the neighborhood tend to be very coffee centric. The Grind carries Mighty Leaf and have all of your staple varieties (plus a little more.)\n\nFinally, the Grind is a place you actually want to hang out at and spend a little bit of your morning and afternoon. The staff is friendly and they have a good amount of seating both indoors and out. If outdoors, you get the bonus of people/bike watching on Haight St.", "rating": 4, "date": "2018-01-01"}, {"excerpts": ["A modern cafe in the midst of an old town Lower Haight. ", "I had the peanut butter and banana waffles with fruit and OJ ", "and my boyfriend had a combo with toast eggs and potatoes. ", "Both of our meals were delicious and was prepared quickly. ", "The service was good and I'd happily return on my next visit to SF."], "author": "Andrea M.", "review": "A modern cafe in the midst of an old town Lower Haight. I had the peanut butter and banana waffles with fruit and OJ and my boyfriend had a combo with toast eggs and potatoes. Both of our meals were delicious and was prepared quickly. The service was good and I'd happily return on my next visit to SF.", "rating": 5, "date": "2017-07-31"}, {"excerpts": ["Oh, bring blue bottle to the lower haight :)"], "author": "Karley A.", "review": "Wow. What a joke this place is. Stood in line for 40 minutes. Right when we got to the front, one register broke. How convenient. Now we wait longer because only one person manning the second register. At this point we decided to just get the food to go. I order a pear salad, honey mustard dressing on side. Husband orders veggie melt. More waiting. I see our take out food just sitting on the counter and wait some more. No one gave it us until I asked. Phew, get me out of here already. Go to the car. Open up the food...salad, no honey mustard dressing. Veggie melt...let's just say it looked worse than jail food. They wouldn't even serve this at the fyre festival. The cheese came out of a cheese wiz can. Biggest joke of a place and waste of money. Oh, bring blue bottle to the lower haight :)", "rating": 1, "date": "2017-04-29"}, {"excerpts": ["It's my neighborhood fave in Lower Haight. ", "Great / good coffee, like actual Lattes, etc. ", "(very hard to find around here, I've tried almost everywhere). ", "Mimosas and beer when you want it. ", "Consistently awesome omlettes, my personal fave - scrambles, and a filling breakfast burrito with avocado and salsa. ", "All this plus a covered patio and free wifi ", "- Yes please!"], "author": "L A.", "review": "I love the grind so much. It's my neighborhood fave in Lower Haight. Great / good coffee, like actual Lattes, etc. (very hard to find around here, I've tried almost everywhere). Mimosas and beer when you want it. Consistently awesome omlettes, my personal fave - scrambles, and a filling breakfast burrito with avocado and salsa. All this plus a covered patio and free wifi - Yes please!", "rating": 5, "date": "2017-04-10"}, {"excerpts": ["Each morning we woke up in the Lower Haight with a singular thought.  ", "How fast can we move our legs to carry us down the street to The Grind.  ", "Banana pancakes?  ", "Check.  ", "Breakfast croissant? ", "Check Check.  ", "French Toast?  ", "Check. ", "Check. ", "Check.  ", "Strong, robust coffee?  ", "Check cubed.  ", "So worth it.  ", "Pay no mind to the less the four star naysayers.  ", "Cinco Estrellas, facilemente!"], "author": "Spider W.", "review": "Each morning we woke up in the Lower Haight with a singular thought.  How fast can we move our legs to carry us down the street to The Grind.  Banana pancakes?  Check.  Breakfast croissant? Check Check.  French Toast?  Check. Check. Check.  Strong, robust coffee?  Check cubed.  So worth it.  Pay no mind to the less the four star naysayers.  Cinco Estrellas, facilemente!", "rating": 5, "date": "2016-01-02"}, {"excerpts": ["I got a the lower haight omelet with hashbroowns which I asked if they could burn a tiny bit ", "and they said yes.  ", "Food came quickly & was tasty. "], "author": "Augustine W.", "review": "this is a great start to a fun filled trek down to HA district and if you're really feeling full you can trek all the way to golden gate park and only stop for a bite on your way back home..\n\nI went here on two separate occasions and had breakfast and then had a lunch item. \n\n   First time was lunch. I ate in their tiny dining area inside. I got a cheeseburger asked for it t medium well although when it came out it was pretty red. Ate it anyway. The bun grilled was nice and this was a big ass burger took half of it home..\n\n Also got a smoothie. For $4 though I would not get it again.  \nIt was tiny and not very exciting. ( I got pineapple  coconut).  \n\nThe next time I went I ordered breakfast w/ a friend. We sat outside in their cute little dining set up.  \n\n  He got the southwestern omelet as well as a side of corned beef hash which I do not like but he loooooved it and said it was homemade.   I got a the lower haight omelet with hashbroowns which I asked if they could burn a tiny bit and they said yes.  Food came quickly & was tasty. The portions were large (as seen in pictures)\n\nI also got a coconut macaroon to go and it was so big it was heavy like a baseball and half dipped in chocolate.\n\nAnother plus here is they have a restroom while many establishments on Haight do not offer one to customers.", "rating": 4, "date": "2011-01-05"}, {"excerpts": ["Definitely will continue to be my \"go-to\" until I move out of the lower Haight."], "author": "Jennifer H.", "review": "This is a regular stop for me (once or twice a week) for a quiet place to sit and read, while eating some tasty food stuffs. \nThe Haight scram is a favorite, also the croissant french toast, and the amazing orange juice! \n\nPrices are good for the portion sizes, and the staff is always very nice and accommodating. \nDefinitely will continue to be my \"go-to\" until I move out of the lower Haight.", "rating": 4, "date": "2013-07-16"}, {"excerpts": ["Let's start with the premise that you want some good food close by in the Lower Haight - lunch, brunch, or an early dinner - or just a coffee, tea, or smoothie. ", "This is a place that does all of them well, in a neighborhood where most people want them sometimes, and sometimes many people want them at the same time. ", "The result is: not enough space during peak times. ", "Just remember that all the tables close together, inside and out, are necessary. ", "You'll appreciate them more if you have to wait. "], "author": "Mike H.", "review": "Let's start with the premise that you want some good food close by in the Lower Haight - lunch, brunch, or an early dinner - or just a coffee, tea, or smoothie. This is a place that does all of them well, in a neighborhood where most people want them sometimes, and sometimes many people want them at the same time. The result is: not enough space during peak times. Just remember that all the tables close together, inside and out, are necessary. You'll appreciate them more if you have to wait. In general though, people don't dawdle too much after they've finished and it's really busy. \n\nJust so you know: Order at the register, go up your drinks from the counter, and eventually bus your table...*but* you'll have food brought to the table thanks to the little numbered sign. \n\nTheir breakfast burrito is big and darn good. Really enjoyed the omelette too. Good-sized portions for all plates, whether or not you're hung over. Good coffee and DIY water. OJ was fine. I've also had the jungle juice smoothie, which is a solid green but has a fruity-banana flavor - it's excellent. \n\nIf you need wireless, be warned that it can be slow with several users at once. Just play nicely (be considerate of your usage) and everyone should get along fine.", "rating": 4, "date": "2012-02-09"}, {"excerpts": ["To me, it's kinda like the People's Cafe (RIP) of the Lower Haight. \n\n"], "author": "Stephanie C.", "review": "The Grind offers many different options for breakfast, lunch, and dinner. Whatever you're in the mood for they probably have. To me, it's kinda like the People's Cafe (RIP) of the Lower Haight. \n\nThe boyfriend and I came in for brunch and were greeted with kind service. After a few minutes looking over the huge menu, we went for breakfast dishes. He had the corned beef hash with hash browns and I had the veggie scramble with home fries. The veggie scramble was made with mushrooms, onions, and tomatoes and covered in melted cheddar cheese. I thought it was pretty average, but it was nothing special -  did the job though! The boy liked his corned beef hash but wished that he had gone with the home fries, which were really delicious! \n\nOverall, I would definitely come here again. There's tons of options and I like the whole casual, neighborhood kinda vibe that it has. However, with tons of other options in the area and in the city, The Grind isn't at the top of my list.", "rating": 3, "date": "2011-11-27"}, {"excerpts": ["Lower Haight's terrible cell reception."], "author": "kat g.", "review": "Love a lil place with outdoor seating on the four sunny days/year here in SF. No, but really, it's a cute place, it's not claustrophobic like so many other cafes, great selection, nice servers. Food looked good, though I didn't eat. I'll go back, though, it's nice to have another great meeting place in my arsenal.\n\nMore plusses: Decent kids menu, location.\nMinus: Lower Haight's terrible cell reception.", "rating": 4, "date": "2011-08-20"}, {"excerpts": ["There aren't that many brunch places in Lower Haight (Kate's Kitchen and Squat and Gobble might be the only other options), so you'll probably find yourself at The Grind at some point...\n\n\n\n"], "author": "Elaine C.", "review": "The Grind reminds me of Squat and Gobble, The Grove, and Crepeville. These are the Cheesecake Factories* of brunch places-- You go not because the food is particularly good, but because you're sure that everyone in your group will at least find something tolerable to eat. There aren't that many brunch places in Lower Haight (Kate's Kitchen and Squat and Gobble might be the only other options), so you'll probably find yourself at The Grind at some point...\n\n\n\n*Key differences b/t these places and Cheesecake Factory: the 100+ option menu is written on a chalkboard above the cash register, you order at counter and seat yourself at a table, and crepes instead of cheesecake.", "rating": 2, "date": "2011-05-30"}, {"excerpts": ["Nice brunch place in Lower Haight with a huge menu. ", "It can be really crowded in the morning. ", "The service is pretty slow though"], "author": "Igor P.", "review": "Nice brunch place in Lower Haight with a huge menu. It can be really crowded in the morning. The service is pretty slow though", "rating": 3, "date": "2014-06-17"}, {"excerpts": ["Lower Haight. "], "author": "Michael S.", "review": "Lower Haight. A great neighborhood, and a great café.\n\nThe staff are uniformly friendly and welcoming, the food is great - try the BLTA - and filling, and the coffee, chai, and the spiced cider are just wonderful and inexpensive!\n\nPlentiful and fast Wi-Fi.\n\nThe only downside is it's on the wrong side of the street, so it never gets warmed by the sunlight. I guess this is a plus on sweltering days, but somewhat daunting on those frosty ones. Or don't be dumb (like I am) and stop sitting outside. But I like sitting outside, watching the parade of humanity march by...", "rating": 4, "date": "2009-11-12"}, {"excerpts": ["The Lower Haight omelet\n10. "], "author": "Joshua K.", "review": "Let me count the ways I love The Grind:\n1. Great breakfast/lunch menu with something for everyone\n2. The perfect balance of price and quality\n3. Outdoor seating!\n4. A glass front that provides great lighting and can be opened on warmer days\n5. Great coffee, tea and fresh squeezed OJ\n6. I've been here many many times and not once have they gotten my order wrong\n7. Even when it's crowded they get orders out relatively quickly\n8. Friendly cashiers\n9. The Lower Haight omelet\n10. It's two blocks from my apartment\n\nI could go on but you get the point. I love this place, and I'll miss it dearly when I'm no longer in the neighborhood.", "rating": 5, "date": "2010-07-17"}, {"excerpts": ["The Grind Cafe has been delightful for my lazy mornings in Lower Haight. ", "The Barista always manages to make a great latte, and the people that work there look like they enjoy working there (why is that hard to come by these days?). ", "My boyfriend ordered some gnarly nutella waffle, and I ordered french toast. "], "author": "Shel Z.", "review": "Good food, good environment, good neighborhood.\n\n\nThe Grind Cafe has been delightful for my lazy mornings in Lower Haight. The Barista always manages to make a great latte, and the people that work there look like they enjoy working there (why is that hard to come by these days?). My boyfriend ordered some gnarly nutella waffle, and I ordered french toast. THE FRENCH TOAST is amazing!!! \n\nI went back again and tried the egg sandwich and it was perfect. The portions aren't too big, like most breakfast restaurants, and the prices are reasonable. \n\nI'll be back again. and again.", "rating": 4, "date": "2011-01-09"}, {"excerpts": ["I used to live in Lower Haight, and let's just say that The Grind has gotten a LOT of business from me over the past three years.  ", "My other half insisted that the group of 6 of us walk 1+ mile several hours into Bay to Breakers so he could get his Grind fix.  "], "author": "Kathleen H.", "review": "If 3.5 stars was an option, I'd choose that, but I'm feeling generous and rounded up to 4 stars since The Grind serves breakfast all day!\n\nI used to live in Lower Haight, and let's just say that The Grind has gotten a LOT of business from me over the past three years.  My other half insisted that the group of 6 of us walk 1+ mile several hours into Bay to Breakers so he could get his Grind fix.  I'm not sure it's THAT good, but it did help with our impending Bay to Breakers mid-afternoon hangover that comes with starting to celebrate at 7:30 am.\n\nRun-down:\n- large portions\n- large variety of both breakfast and lunch/dinner options\n- prices low enough that it doesn't feel like breaking the bank to eat here often\n- I like the breakfast offerings more than the lunch/dinner ones\n- although it gets crowded on the weekend for brunch, I've never had problems getting a table by the time my food is ready\n- every once in a while, the kitchen gets really backed up and takes a while to get food to the table\n- one food-related gripe is I don't like how the egg scrambles just have the cheese melted on top rather than mixed into the scramble, but that's more my preference than something \"wrong\" with the dish.\n\nMy go-to dish here: french toast with mixed fresh fruit OR breakfast burrito if I'm in a savory food kind of mood", "rating": 4, "date": "2013-10-29"}, {"excerpts": ["We had the breakfast burrito, lower haight omelet and strawberry banana waffle, and they were all amazing. "], "author": "Regina B.", "review": "This place has overall amazing food. Is quick, fresh and the portions are huge, good enough to share. I'm so glad our local friends decided to take us here.\n\nWe had the breakfast burrito, lower haight omelet and strawberry banana waffle, and they were all amazing. I must say I was most impressed about the breakfast burrito of all, one of the best I've had.\n\nWe got pretty lucky on the table situation, since the place is pretty crowded on the weekends. So that worked out well thankfully.", "rating": 4, "date": "2010-05-03"}, {"excerpts": ["This is a solid breakfast spot in the lower Haight. ", "It's inexpensive and they cook your food properly. ", "If you order a poached egg you'll get a perfectly cooked poached egg. ", "Their coffee drinks are prepared well and not overly sweet. ", "The crowd and atmosphere are both unpretentious. ", "I think this place gives you the most bang for your buck. ", "One of my favorite breaky spots."], "author": "Amybeth O.", "review": "This is a solid breakfast spot in the lower Haight. It's inexpensive and they cook your food properly. If you order a poached egg you'll get a perfectly cooked poached egg. Their coffee drinks are prepared well and not overly sweet. The crowd and atmosphere are both unpretentious. I think this place gives you the most bang for your buck. One of my favorite breaky spots.", "rating": 4, "date": "2013-06-18"}, {"excerpts": ["The Grind is my home office and favored Lower Haight eatery.  ", "Good food, good pricing and a comfortable place make it a must for me everyday.  "], "author": "Naeem N.", "review": "The Grind is my home office and favored Lower Haight eatery.  Good food, good pricing and a comfortable place make it a must for me everyday.  The staff is uber friendly and they are always smiling (Andrea and C-Sha and Smashly are da best).  \n\nFree and reliable wi-fi, well placed power outlets, breakfast and burgers, chili and smoothies, home made iced tea and lemonade and coffee make it even better.  Busiest times are lunchtime and weekend brunch (damn you Kaiser!)\n\nOpen until 8PM during the week.  Current new discovery has been the chili oddly enough.  Ole Reliable dish:  Grind Combo with French Toast (holla for the Challah) and home fries.", "rating": 4, "date": "2009-11-11"}, {"excerpts": ["But if you are in the lower haight check it out."], "author": "Kierstan G.", "review": "Walking distance from my place, sunday brunch, tasty chai, outdoor seating that is dog friendly what more could I ask for?  I wouldn't drive all the way to the grind from another neighborhood just for their brunch.  But if you are in the lower haight check it out.", "rating": 4, "date": "2012-08-12"}, {"excerpts": ["Great to place to stop in and grab a bite to eat, especially if you are perusing around Lower Haight. "], "author": "Nick C.", "review": "Great to place to stop in and grab a bite to eat, especially if you are perusing around Lower Haight. They serve up good portions, and have a wide variety of different things to choose from.\n\nBreakfast + Lunch stuff mainly. They have a good amount of Scrambles to choose from, pancakes, omelets, etc...more importantly they have quality sour dough toast...not that cheap stuff. Their Burgers looked good, made with Niman Ranch Beef. \n\nBeverages: They have a wide variety. Everything from Gatorade to  Soda's to Smoothies to Ice Tea/Lemonade to Beers\n\nRECOMMENDATION: Try an Arnold Palmer with their Ginger Ice Tea...stuff is really good.\n\nThe spacing is open, and they have good ventilation. There is plenty of sun and a good amount of seating.", "rating": 4, "date": "2010-08-13"}, {"excerpts": ["I like the layout and outdoor seating (although does the sun ever come out in lower haight?)  "], "author": "Sonia S.", "review": "Why can't there be a similar place in good ol' SOMA?  Came in for breakfast early on a saturday morning when it was quiet and I could take my time reading the extensive menu.\n\nThe breakfast choices are great-- had the egg white mediterreanean scramble with hash browns and a latte and it was out of this world.  So much food that I had to take some home for later.  I like the layout and outdoor seating (although does the sun ever come out in lower haight?)  Next time I'm going for the breakfast burrito and french toast because they looked quite awesome. \n\nstaff is friendly as well. I'm a fan.", "rating": 5, "date": "2009-03-14"}, {"excerpts": ["There is nothing particularly offensive or unusually good about this Lower Haight neighborhood breakfast spot.  ", "Decent coffee. ", "Usually buzzing with people who live near by. ", "You won't be disappointed if it's an ordinary sort of day."], "author": "Luke M.", "review": "There is nothing particularly offensive or unusually good about this Lower Haight neighborhood breakfast spot.  Decent coffee. Usually buzzing with people who live near by. You won't be disappointed if it's an ordinary sort of day.", "rating": 3, "date": "2011-07-25"}, {"excerpts": ["There's not many brunch spots in Lower Haight. ", "The only other one I can think of is Kate's Kitchen and maybe Katz (but not really). ", "Luckily with the limited number of real brunch spots in Lower Haight, The Grind is pretty good. "], "author": "David C.", "review": "There's not many brunch spots in Lower Haight. The only other one I can think of is Kate's Kitchen and maybe Katz (but not really). Luckily with the limited number of real brunch spots in Lower Haight, The Grind is pretty good. It can get busy and open seats are hard to come by but the food is better than average, coffee is good, and there's definitely some good people watching, especially if you can get a spot outside in their front patio area. \n\nSome items I would recommend:\n-chicken fried steak and eggs\n-croissant sandwich with egg and bacon\n-pancakes and eggs\n\n...as you can tell i'm not the type to order fruit and oatmeal. I like my brunch food to be hearty and unhealthy.", "rating": 4, "date": "2010-03-24"}, {"excerpts": ["I walked an energetic pooch down to the Lower Haight to go ", "let him let off some steam, and for me to grab a bite to eat.  ", "30 minutes to closing time....for dinner.  ", "I was the only one on the patio.  ", "One coffee drinker inside.  ", "The friendly lady at the counter let me in the cafe with the dog to order my food, and then delivered my food to me in adequate time.  ", "There isn't anything super fancy about it...except its one of the only places to eat outside in Lower Haight, looks like it has a decent breakfast menu, and has a friendly staff.  ", "I look forward to updating my review with my take on brunch service....", "but my dinner was delightful.  ", "Especially now that I'm eating."], "author": "Lauren F.", "review": "I will say straight away that this review may not appeal to the masses who are probably yelping The Grind as a go-to place for brunch.  I didn't eat brunch here.  No sirree bob.  I walked an energetic pooch down to the Lower Haight to go let him let off some steam, and for me to grab a bite to eat.  30 minutes to closing time....for dinner.  I was the only one on the patio.  One coffee drinker inside.  The friendly lady at the counter let me in the cafe with the dog to order my food, and then delivered my food to me in adequate time.  I guess it helped that i was the only food the kitchen was cooking...or assembling as it were, seeing as though i got a sandwich with salad. \n\nIts a stark cafe.  There isn't anything super fancy about it...except its one of the only places to eat outside in Lower Haight, looks like it has a decent breakfast menu, and has a friendly staff.  I look forward to updating my review with my take on brunch service....but my dinner was delightful.  Especially now that I'm eating.", "rating": 4, "date": "2007-06-11"}, {"excerpts": ["while I mourn the loss of the last cheap and uncrowded brunch spot in the Lower Haight, I bet I'll still find myself here most weekend mornings. "], "author": "Tom H.", "review": "Yup, they remodeled. It looks like the place might have changed hands, too, since none of the same people work there anymore. Menu is similar, with a few new additions and a bump up of about a dollar per item. It is now very much a clone of Squat and Gobble. Meh. I liked it when it had terrible art on the walls instead of a wide-screen TV leaking sports-flavored light all over the place, but while I mourn the loss of the last cheap and uncrowded brunch spot in the Lower Haight, I bet I'll still find myself here most weekend mornings. Where else am I going to go?\n\nUpdate: actually, i was wrong about the place changing hands, they just have some new faces working the counter.", "rating": 3, "date": "2007-01-15"}, {"excerpts": ["I was down in Lower Haight to watch the Seahawks game at Danny Coyle's (see that review in my profile). ", "It occurred to me that I was about to consume a great amount of alcohol, scream my ass off at my home team, and then walk/bus back to Cow Hollow/Marina area to my bro's apt. ", "A man needs to power up for that kind of abuse. ", "I hadn't eaten breakfast, I hadn't had my morning coffee, and I had already had a beer. ", "\"", "Warrior needs food... "], "author": "Will L.", "review": "I was down in Lower Haight to watch the Seahawks game at Danny Coyle's (see that review in my profile). It occurred to me that I was about to consume a great amount of alcohol, scream my ass off at my home team, and then walk/bus back to Cow Hollow/Marina area to my bro's apt. A man needs to power up for that kind of abuse. I hadn't eaten breakfast, I hadn't had my morning coffee, and I had already had a beer. \"Warrior needs food... Badly!\"\n\nBryan B. directed me up to The Grind for a sandwich. I stood in line, then tried to joke and be friendly with the gals behind the counter, who were cute but maybe having a bad day, I dunno. They didn't crack a smile, just took my order and took my money. Whatevah.\n\nIt took a while for the order to get made. There were open tables, so it didn't seem that busy, but on the other hand I was in a hurry to get back to Danny Coyle's to see the kick off. (Which fortunately I did see, as the first 5 minutes of that Seahawks@Packers game were, as a Seahawks fan, the best part of the game. Argh. Next year.) So... I stood and watched poker on their flat screen (yeah, no playoff game. It's THAT kind of place).\n\nthe sandwich was pretty tasty. The fries were ok, but they stuck a pickle into the box which dripped all over the fries. I gotta say, pickle juice on french fries is fucking gross. It makes the fries taste like they were rotten. I wound up spitting up into my water which really sucked. I like to conserve water. At least it wasn't into my beer, as I like to conserve beer more.\n\nSo... I drop a star for the unfriendliness of the lady behind the counter, and for mixing pickle juice with french fries, and another for cost. But the sandwich was pretty good.", "rating": 3, "date": "2008-01-13"}, {"excerpts": ["we ended up in the lower haight and happened upon this place.  \n\n"], "author": "Matt S.", "review": "My wife and I decided to take off on our scooter and find a new spot in the city that we had never been.  we ended up in the lower haight and happened upon this place.  \n\nit's a happening little spot with lots of light, big sliding windows allowing for lots of air, and outside seating which was a plus.  we had lunch (i had the crispy chicken sandwich and fries) which was very tasty and she had the chicken cheesesteak (even better!)  it was a very enjoyable, relaxing lunch with plenty of great people watching.", "rating": 4, "date": "2009-08-09"}, {"excerpts": ["Cafe nestled in the heart of the Lower Haight. ", "Had their Lox sandwich and a double Cappuccino. ", "Neither was particularly noteworthy. ", "Space wasn't very nice and the featured local art was bad. ", "If I were in the area again, I'd stick to my old standby: Squat & Gobble."], "author": "Jeremy S.", "review": "Cafe nestled in the heart of the Lower Haight. Had their Lox sandwich and a double Cappuccino. Neither was particularly noteworthy. Space wasn't very nice and the featured local art was bad. If I were in the area again, I'd stick to my old standby: Squat & Gobble.", "rating": 2, "date": "2005-03-19"}, {"excerpts": ["People complaining about how it is too \"clean\" for the neighborhood should perhaps acquaint themselves with Craigslist apartment ads for this neighborhood and see just how \"cheap\" it is to live in this part of the Lower Haight."], "author": "Maria D.", "review": "Okay coffee - nice to pick up when you are so hungover you want to bury yourself alive.  Like right now.\n\nEDIT April 2007:\n\nI hate The Grind for personal reasons. Getting coffee there was basically one of those weird \"this is the first day of the rest of your life\" kind of moments and I will forever associate it with kicking off the shittiest two months of my very short life.  However, they are the closest place to my apt that take credit cards, serve food and have wi-fi that is not Squat & Gobble (a place I've vowed to never give another fucking dime to), so I've returned a few times to abuse the wi-fi and have my solitary weekend brunches w/ my macbook. And what do you know? the cooked food is totally decent.  3 stars.\n\nPeople complaining about how it is too \"clean\" for the neighborhood should perhaps acquaint themselves with Craigslist apartment ads for this neighborhood and see just how \"cheap\" it is to live in this part of the Lower Haight.", "rating": 3, "date": "2006-10-26"}, {"excerpts": ["I ordered the Lower Haight omelet since the ingredients caught my eyes (chicken apple sausage, spinach, sun dried tomatoes, and feta... YUMMMM) and I can't remember what my friend had "], "author": "Marie G.", "review": "I totally forgot about yelping here since I came here in June and it was worth the random drive my friend and i took.\n\nMy friend and I happen to spot this place after finding out the Joe's pot o' Soul was supposed to be open but they weren't. We drove around to find a good breakfast/brunch spot to dine at and my friend passes by a couple places then says \"Hey, what about there?\" and points to the Grind Cafe. I said sure why not. We easily found parking and walked over. \n\nWhen we walked in i looked up and noticed the huge chalkboard menu. LOTS of food and snacks and drinks to choose from, definite worth 2 stars. For the variety they had everything was very well-priced (under $10 a pop except for the steak and eggs, duh) I ordered the Lower Haight omelet since the ingredients caught my eyes (chicken apple sausage, spinach, sun dried tomatoes, and feta... YUMMMM) and I can't remember what my friend had but he did have a fresh squeezed orange juice. \n\nThe atmosphere was real nice; busy in the kitchen but very casual in the dining area. The cashier was friendly and made sure she had got our orders right. I'd like to come back here again for sure. I only give it 4 stars since I am a fan now but would like to come here more often to experience the full force of their menu :)", "rating": 4, "date": "2009-07-24"}, {"excerpts": ["The atmosphere is even pleasant, and this is an accomplishment in the Lower Haight.  ", "But the food is just so bland.  "], "author": "John S.", "review": "I really really really want to love this place.  I kind of do.  OK, that's not true.  \n\nHave you ever dated a girl who was absolutely beautiful but who annoyed you nonetheless?  No, her beauty didn't annoy you, and it was natural, not a put-on or an example of masterful makeup artistry or a figment of your own delusionally hopeful imagination, but there just wasn't much else going on.  She could be smart and maybe even intelligent, but she wasn't quick on the uptake, or at least she didn't pick up on all the little cues that she should pick up on.  Those cues that you picked up on with her.  And maybe you enjoyed each other's company, but when you weren't physically together, you wondered whether you were just wasting your time with her?  And you had your breakup speech all planned out and maybe even rehearsed; you had chosen a coffeehouse or a park that you had never been to together so that neither of your memories or daily routines would be ruined by this ultimately trivial but nonetheless life-changing event?  But then when you saw her crossing the street in her cheap pink flip-flops or leaning down to pick a dandelion from the grass--and her hair would fall just so--you couldn't go through with it.  You just had to continue to be with this girl because she was beautiful, right?  Just really naturally pretty.  Someone no one in his right mind would give up.  Not without good reason?\n\nWell, that girlfriend is The Grind Cafe.  It's gorgeous, and the menu is really promising.  The atmosphere is even pleasant, and this is an accomplishment in the Lower Haight.  But the food is just so bland.  It's not bad, and it's presented really beautifully, but on your walk home, you always find yourself wondering whether you should start spending less time here and more time at a grungier-looking restaurant that understands your needs better.\n\nBut hell, I'm a sucker for a pretty face, so I'll keep enjoying The Grind's mound of hash browns and a sunny-side-up egg.  Wouldn't you?", "rating": 3, "date": "2010-01-14"}, {"excerpts": ["The Grind is not exactly what I expected when a friend of mine suggested we have brunch in the Lower Haight. "], "author": "Aiden B.", "review": "The Grind is not exactly what I expected when a friend of mine suggested we have brunch in the Lower Haight. I was stoked for the idea of a divey, nasty, greasy spoon with an assertive, short-tempered wait staff that had been working there for a decade.\n\nSo I approach the place from the west, slowly, sizing it up; looks alright, so far. I see hipsters and students and art kids smoking on the patio. This is usually a good sign, at least for my tastes and general comfort level.\n\nOnce inside, however, surprise! Exposed duct work, track lighting and the ubiquitous gigantic fucking chalk board menu. The offerings looked good, though, so I chose to forgive them and let bygones be bygones while some coked out dude started yammering at my friend.\n\nI ordered the two eggs, scram, with hash and subbed an English muffin  for the toast. I also split a short stack with my friend. For a drink, \"Orange juice, and lots of it, please.\" The wait staff was perky, chipper and did not at all look amused... or hungover. This was a problem.\n\nBut the food was good. Really good, actually, and the short stack reminded me of home, so damn that's gotta be worth at least one star... and the eggs were yummy and there was ample hot sauce at the table (although just Tabasco... when will people get it right? ANYTHING but Tabasco!), and pretty soon I was happy and full, and I didn't have to give up 30 minutes sitting on the curb waiting for a table (that's you, Porkstore... that's what you sound like).\n\nSo, damnit, a reluctant 3... but well earned. Even if it did feel like Hayes Valley in there.", "rating": 3, "date": "2007-02-25"}, {"excerpts": ["If you are into \"chalkboard restaurants\" and live in the lower haight head on down to the Squat and Gobble. ", "The house potatoes are at least edible and the Gobble knows a thing or two about tofu scramble."], "author": "AmanDave H.", "review": "Amanda Says: \nHere's what I am wondering: How is it possible for food to taste like nothing? \n\nDavid Says: \nWell, the hash browns were edible--after I covered them in ketchup\n\nConsensus: The Grind is The Gross. The food was cold and the tofu scramble was a sorry mess. If you are into \"chalkboard restaurants\" and live in the lower haight head on down to the Squat and Gobble. The house potatoes are at least edible and the Gobble knows a thing or two about tofu scramble.", "rating": 1, "date": "2006-08-16"}, {"excerpts": ["Having been here too many times to count, I have to say it's got to be the most consistent place in the Lower Haight. ", "Can't wait to go back again!"], "author": "Paul Z.", "review": "I'm reading some of these reviews and they are ridiculous. I live down the street and come to the Grind at least once or twice a week. The breakfast items are great. The breakfast burrito and grind combo are my favorites. So good I have to stop myself from going there more. Here's the deal, it's a very good place to grab food, be it brunch, a burger, a salad...whatever. Since the remodel, it appears that their kitchen capacity has improved dramatically too. The complaints I'm seeing on here about \"poor service\" and \"inefficiencies\" are baffling to me. Common Sense. If there is a line out the door, all the tables look full, and there are people waiting for to go orders....It's gonna take a while to get your food on a Saturday or Sunday morning. You are talking about a very clean place with above average, fairly priced food in very popular part of SF. There are too many bad ones to count. This isn't the place you go \"to brunch.\" It's where you go because you don't want to deal with the bs that is \"brunching\"  but want the same or similar quality food. Having been here too many times to count, I have to say it's got to be the most consistent place in the Lower Haight. Can't wait to go back again!", "rating": 5, "date": "2014-08-11"}, {"excerpts": ["I just moved to this neighborhood and intrigued that food costs less in the Lower Haight."], "author": "Wakako U.", "review": "Veggie salad is great!  Spring mix, romaine, garbanzo beans, avocado, tomatoes, sprouts and cucumber.  $7.25.  Brett's Niman ranch beef steak and egg with hash brown was $10.25.  I just moved to this neighborhood and intrigued that food costs less in the Lower Haight.", "rating": 4, "date": "2009-08-26"}, {"excerpts": ["I started coming to The Grind shortly after moving to Lower Haight, and it has become my absolute favorite - I come here several times a week. ", "Consistently great service, friendly staff and an awesome menu. ", "I can't recommend it enough!"], "author": "Molly E.", "review": "I started coming to The Grind shortly after moving to Lower Haight, and it has become my absolute favorite - I come here several times a week. Consistently great service, friendly staff and an awesome menu. I can't recommend it enough!", "rating": 5, "date": "2012-01-28"}, {"excerpts": ["A lot of variety and its all yummy...hot sandwiches, fresh salads, awesome omelettes, and the best burger in lower haight. ", "Great go to spot"], "author": "Shazia A.", "review": "Great spot for breakfast or lunch...or if you're like me and like breakfast for dinner sometimes :) A lot of variety and its all yummy...hot sandwiches, fresh salads, awesome omelettes, and the best burger in lower haight. Great go to spot", "rating": 5, "date": "2011-04-10"}, {"excerpts": ["This place is an extra block further from Fillmore than some of the other breakfast options in the lower haight, which is maybe why I had forgotten about it for awhile, but not anymore! ", "I went yesterday and won't forget it again. ", "I got the oatmeal with mixed fruit and it was great. ", "My boyfriend got some platter of french toast, eggs, and home fries and he was delighted with the portion. ", "Great spot, definitely worth checking out. ", "It's an order-at-the-counter type place. ", "They do have a nice little patio, and a huge assortment of fresh baked goodies! ", "can't wait to go back and try one (or more)"], "author": "Caitlin B.", "review": "This place is an extra block further from Fillmore than some of the other breakfast options in the lower haight, which is maybe why I had forgotten about it for awhile, but not anymore! I went yesterday and won't forget it again. I got the oatmeal with mixed fruit and it was great. My boyfriend got some platter of french toast, eggs, and home fries and he was delighted with the portion. Great spot, definitely worth checking out. It's an order-at-the-counter type place. They do have a nice little patio, and a huge assortment of fresh baked goodies! can't wait to go back and try one (or more)", "rating": 4, "date": "2011-07-18"}, {"excerpts": ["Great little spot in Lower Haight.  ", "I had the garden burger and it was good, very good.  ", "I could tell they select good quality products.  ", "On top of this, I thought the place was reasonably priced. ", "Also, must mention they have a patio.  ", "Go on a nice sunny day and sit on the patio."], "author": "Eduardo A.", "review": "Great little spot in Lower Haight.  I had the garden burger and it was good, very good.  I could tell they select good quality products.  On top of this, I thought the place was reasonably priced. Also, must mention they have a patio.  Go on a nice sunny day and sit on the patio.", "rating": 4, "date": "2008-09-01"}, {"excerpts": ["The best Chai in the lower Haight, except for maybe Cafe International. ", "Also a nice spot to watch people doing the walk of shame on weekend mornings. ", "Food is just ok - I try to stick to the baked goods. ", "Thems the goods!"], "author": "Colleen B.", "review": "The best Chai in the lower Haight, except for maybe Cafe International. Also a nice spot to watch people doing the walk of shame on weekend mornings. Food is just ok - I try to stick to the baked goods. Thems the goods!", "rating": 5, "date": "2006-08-30"}, {"excerpts": ["My husband and I had brunch there today and he enjoyed the lower haight omelet ", "and I the tofu scram.  ", "My husband commented that his omelet was \"awesome\" and completely cleaned off his plate.  ", "The tofu scram was great, the first time I've tried it actually, and I think it's a great vegan-friendly dish, which is definitely hard to find.  "], "author": "Beenish K.", "review": "I love this place.  It has such a vast menu - something to please even the most picky eaters (which I know from personal experience, so trust me).  The vanilla latte is very good here, and I've been twice already for breakfast.  The veggie bagel with hummus and sprouts is positively delicious.  My husband and I had brunch there today and he enjoyed the lower haight omelet and I the tofu scram.  My husband commented that his omelet was \"awesome\" and completely cleaned off his plate.  The tofu scram was great, the first time I've tried it actually, and I think it's a great vegan-friendly dish, which is definitely hard to find.  Both dishes come on a big plate, with a side of toast or muffin, and hash browns, salad, or fries.  We had the hash browns and they were great.  Service is friendly and in addition to the great menu, this place also is loaded with fine pastries, cookies, and more.  A great place for lunch or breakfast or just a quick cup of coffee!", "rating": 4, "date": "2010-07-31"}, {"excerpts": ["seems weird to close so early, esp on lower haight.  ", "when i've been there lately, i've seen a ton of people come around 6pm only to be told they're closed.  "], "author": "Suzanne A.", "review": "i miss the old Grind.  the grimy grind.  i do like the orange mosaic counters, but overall, i miss the old grime.  this place is too bright now, too sterile, and doesn't really fit the lower-haight vibe. i do like the free wifi tho, since now i am DSL-less and a wifi nomad (see Oakside Cafe review), but i don't like the fact that they close at 6pm.  seems weird to close so early, esp on lower haight.  when i've been there lately, i've seen a ton of people come around 6pm only to be told they're closed.  seems like they're losing out on some key biz, but whatever....\n\nanother thing i don't like about the new grind is that it seems like they put in a crappier ventilation system w/ the remodel - it flatout stinks in there, a collage of fried/burnt food stink, and i always come out smelling like the stink.  yuk.  maybe once the weather gets warmer and they can open up the windows, it'll get better...one can only hope...or they'll be calling me Pepe Le Sue...", "rating": 3, "date": "2007-01-30"}, {"excerpts": ["i dont frequent this end of the Haight that much, the 400-500 blocks are really where 80% of Lower Haight businesses are.\n\nat any rate, been here only a few times over the last several years. "], "author": "Sha A.", "review": "i dont frequent this end of the Haight that much, the 400-500 blocks are really where 80% of Lower Haight businesses are.\n\nat any rate, been here only a few times over the last several years. the front patio is nice. you can drink your beverage, grab a bite to eat (decent sandwiches) and people watch.\n\nthe odd thing is, all the hundreds of time i have driven in front of the place, i always glance over and feel like i need to pull up grab sumfin' -but then again, im always on a mission racing up the street to go do an errand. on the way back when racing down, i only have tunnel vision, i.e., to find freekin' parking close to my place. so basically, i dont really give rats ass on stopping here............................................*sorry*", "rating": 3, "date": "2008-10-20"}, {"excerpts": ["There is no reason a coffee and small breakfast should cost over $10, especially in the lower haight."], "author": "Eli Z.", "review": "Wow.  After hearing great things about this place I was seriously disappointed.  I went there for breakfast to find that the prices and quality of the food left much to be desired.  First of all, a breakfast sandwich, egg, meat and cheese will run you $8.  Yes, $8.  You can get a cheap one at Lee's for $2.85 or just about any other place in the city for less than $5.  There is nothing special about the food, average at best, and about 50% overpriced.  There is no reason a coffee and small breakfast should cost over $10, especially in the lower haight.", "rating": 2, "date": "2007-06-29"}, {"excerpts": ["if you're looking for breakfast in the lower haight this is the place. ", "sure beats waiting in line for an hour at other spots (except the porkstore which i will gladly wait in line for). ", "the outdoor seating is a very nice touch on a sunny day also."], "author": "Andrew D.", "review": "ive never had a bad breakfast at the grind. always pleasant and comfortable. i never have to wait too long and its very well priced. they got all the usual stuff you might find at any normal breakfast spot but this place always comes through. if you're looking for breakfast in the lower haight this is the place. sure beats waiting in line for an hour at other spots (except the porkstore which i will gladly wait in line for). the outdoor seating is a very nice touch on a sunny day also.", "rating": 4, "date": "2009-06-04"}], "turkey swiss": [], "acropolis": [{"excerpts": ["Had Acropolis omelette with home fries and sourdough. "], "author": "JC M.", "review": "Delicious, worth the price!\n\nHouse blend Coffee was so good and the price was very reasonable.\n\nHad Acropolis omelette with home fries and sourdough. Highly recommended for any vegetarian. \n\nHubby had breakfast sandwich with bacon and eggs and French fries and said it was delicious.\n\nOur friend had steak and eggs and was also delicious according to him.\n\nWill be coming back for sure!!!", "rating": 5, "date": "2016-11-02"}, {"excerpts": ["I ordered the Acropolis omelet and it was amazing! "], "author": "A M.", "review": "My favorite meal is breakfast/brunch and this was an awesome place to have it! I ordered the Acropolis omelet and it was amazing! It came with a large portion of PERFECT hash browns. My son had the kids pancakes and they added strawberries upon request, he also had a side of bacon (he ate every last bite-and so did I!). The restaurant has a great atmosphere, we made conversation with the table next to us throughout the meal and throughly enjoyed the atmosphere. The prices were FANTASTIC for SF and just in general. Highly recommend!\n\nThe only drawback that I could see is that there was no table service or waiters so I had to get up a couple of times to get a couple of items (not a big deal and this is probably what keeps the prices so low). \n\nA+", "rating": 5, "date": "2015-08-31"}], "south western": [{"excerpts": ["Other items that I'm really fond of are the Haight Street, Sicilian or the South Western omelet. ", "You can't miss great food at a fair price with a solid coffee house vibe in a very tradition manner. ", "The romance continue for some time to come!"], "author": "Billy B.", "review": "The Grind was my first San Francisco love. The girls at the counter are delightful, friendly and sweet. The food is hearty and healthy. The place is mostly a breakfast and lunch local hang. The coffee is perfect and rich. The food is always well prepared with the tastiest ingredients . A regular for me is a bagel sandwiches. I usually have a everything bagel with chicken apple sausage, swiss, scrambled eggs and tomato. Sometime I switch the cheeses around to keep it fresh. Other items that I'm really fond of are the Haight Street, Sicilian or the South Western omelet. You can't miss great food at a fair price with a solid coffee house vibe in a very tradition manner. The romance continue for some time to come!", "rating": 5, "date": "2011-02-21"}], "de lox": [{"excerpts": ["I opted for the De Lox Omelet (fresh lox, tomato, green onion and cream cheese topped with capers--from the menu), $13.50 plus tax.\n\n"], "author": "Steve M.", "review": "Wow, this place has reviews all over the place, from 1 star to 5 stars. I've walked by this place many times, figured I'd give it a try.  Was 9 am on a Sunday morning, only a few folks here, could easily pick your table.  Menu on the wall, order from the cashier, food brought to your table. There's plenty of outdoor seating as well.\n\nI opted for the De Lox Omelet (fresh lox, tomato, green onion and cream cheese topped with capers--from the menu), $13.50 plus tax.\n\nSee attached piks. Omelet was chock full of lox. Those capers it was suppose to be \"topped with\" were absent. Would have liked to have seen more cream cheese, but all in all, made for a decent rendition, did miss the capers. The potatoes were good, not the best I've ever had, but decent. From ordering to receiving my food, took no more than 10 minutes.   \n\nGot much busier by the end of my meal, a line started to form, including families with children.\n\nBased on what I ordered, and didn't try anything else, was a solid breakfast.", "rating": 3, "date": "2017-08-06"}], "one egg any style": [], "hash browns": [{"excerpts": ["The omelette and hash browns are well portioned. ", "Love the breakfast sandwich and the lox -- hard to find hearty breakfasts like this in the city!"], "author": "Stephanie S.", "review": "Tasty, unpretentious, solidly good breakfast/brunch/lunch spot. The omelette and hash browns are well portioned. Love the breakfast sandwich and the lox -- hard to find hearty breakfasts like this in the city!", "rating": 5, "date": "2018-08-12"}, {"excerpts": ["Hash browns cooked to perfection! ", "Also have a section with a lot of baked goodies. ", "Yum! ", "May have to hit this spot again before we leave."], "author": "Diana E.", "review": "LOVED this place!!! Very friendly service! \nGreat menu selection! Full on coffee selection as well! Had a delicious latte and  the most amazing scrambled spinach and feta egg! Hash browns cooked to perfection! Also have a section with a lot of baked goodies. Yum! May have to hit this spot again before we leave.", "rating": 5, "date": "2015-10-19"}, {"excerpts": ["Last time I was here, I got the Sicilian omelette (pesto, sundries tomatoes, fresh tomatoes, and feta cheese) with a side of hash browns and sourdough.\n\n"], "author": "Andrew C.", "review": "I stop in here regularly after morning rides up Hawk Hill. There's usually only a few people in the cafe around 7:30 am on weekdays, so we bring our bicycles up on the front porch area outside instead of locking them up.\n\nLast time I was here, I got the Sicilian omelette (pesto, sundries tomatoes, fresh tomatoes, and feta cheese) with a side of hash browns and sourdough.\n\nThe coffee is decent and served in either a mug or a pint glass (kind of novel).", "rating": 3, "date": "2015-10-13"}, {"excerpts": ["Had the Grind Scramble with hash browns and sourdough toast...really good! "], "author": "Ed N.", "review": "Good place for a hearty breakfast and a good cup of coffee. Had the Grind Scramble with hash browns and sourdough toast...really good! Looks like it gets crowded fast and seating can be a little tough to find when it does.\n\nHas a good vibe, staff is cool. Also, in case it matters to you, the restroom is pretty clean!\n\nI'll definitely be back to try something else on the menu.", "rating": 4, "date": "2016-01-31"}, {"excerpts": ["Came up on the french toast topped off with blueberries and the hash browns didn't suck either!\n\n"], "author": "Paolo V.", "review": "Just came back from lunch, or should I say brunch? Came up on the french toast topped off with blueberries and the hash browns didn't suck either!\n\nOther things that were neat: tall ceilings, skylights, outdoor seating, outlets along the wall, and I hear they make coffee too. I'll have to try the brew next time I'm out this way.", "rating": 4, "date": "2015-04-02"}, {"excerpts": ["The eggs were dry (ala Mc Donalds breakfast) and the hash browns lacked any salt (might or might not be a bonus for you). ", "The omelette was good, though. "], "author": "Dario R.", "review": "My order took 40 minutes (40!) to come (20 minutes after I first asked, plus 20 for the actual food). I understand that a mistake can happen, but the fact that no one even apologized grinds my nerves.\n\nOn the food: I ordered Benedict eggs, my partner an Scott St omelette. The eggs were dry (ala Mc Donalds breakfast) and the hash browns lacked any salt (might or might not be a bonus for you). The omelette was good, though. The orange juice didn't taste fresh.\n\nGiving it 2 stars instead of 1 just for the fact that the food actually came, and it looked like no one spitted on it, which is nice.", "rating": 2, "date": "2015-09-13"}, {"excerpts": ["It came with a large portion of PERFECT hash browns. ", "My son had the kids pancakes and they added strawberries upon request, he also had a side of bacon (he ate every last bite-and so did I!). ", "The restaurant has a great atmosphere, we made conversation with the table next to us throughout the meal and throughly enjoyed the atmosphere. ", "The prices were FANTASTIC for SF and just in general. "], "author": "A M.", "review": "My favorite meal is breakfast/brunch and this was an awesome place to have it! I ordered the Acropolis omelet and it was amazing! It came with a large portion of PERFECT hash browns. My son had the kids pancakes and they added strawberries upon request, he also had a side of bacon (he ate every last bite-and so did I!). The restaurant has a great atmosphere, we made conversation with the table next to us throughout the meal and throughly enjoyed the atmosphere. The prices were FANTASTIC for SF and just in general. Highly recommend!\n\nThe only drawback that I could see is that there was no table service or waiters so I had to get up a couple of times to get a couple of items (not a big deal and this is probably what keeps the prices so low). \n\nA+", "rating": 5, "date": "2015-08-31"}, {"excerpts": ["I was recommended to add hash browns inside of the burrito and it was awesome. ", "I told myself only to eat half.....that didn't happen. ", "I recommend this place and have to say it's one of my top places for breakfast."], "author": "Sean B.", "review": "Was able to order right away, breakfast burrito came fast and hot. Was not expecting the breakfast burrito to be as big as it was. I was recommended to add hash browns inside of the burrito and it was awesome. I told myself only to eat half.....that didn't happen. I recommend this place and have to say it's one of my top places for breakfast.", "rating": 5, "date": "2016-02-25"}, {"excerpts": ["The  breakfast burrito with the hash browns inside vs. on the side is perfection. ", "The sandwiches are fresh and filling: club sandwich, tuna melt, and burger, ", "all yummy! ", "Have them with the curly fries if you're into that sort of thing. ", "My friend favors the garlic fries. "], "author": "Trish B.", "review": "I really enjoy the food here, and have never had one thing I didn't like.\n\nThe  breakfast burrito with the hash browns inside vs. on the side is perfection. The sandwiches are fresh and filling: club sandwich, tuna melt, and burger, all yummy! Have them with the curly fries if you're into that sort of thing. My friend favors the garlic fries. And I am ordinarily not a salad-person, but the Oriental chicken salad or the beet salad with a soup on the side makes for a filling (but light) lunch.\n\nI would go more often, but the service is consistently very slow. I understand the restaurant does not have waiter service, so by slow I mean the lines always seem to be long, and it takes a longer time for food to come out than most places I am used to. This is especially true during weekends and lunch time, obviously (I have never been here in the morning).\n\nI get it; they are always super busy. And there are very few brunch options in the area. Is it worth the wait? The food is really really good, so I would say it's worth it only if you are not prone to getting hangry. The fact that it takes so long is a testament to the freshness of the food, I think.\n\nI get takeout more often than I dine in. They usually quote my pick up time as 20-30 minutes (except for one New Years Day, where takeout order wait time was estimated at over an hour! The busyness they experience is no joke). The service is not super friendly, nor have I ever experienced them being outright rude as other reviews have said. I think they just do their extremely busy job and aren't here to make friends. With the lines they get, I don't blame them.", "rating": 4, "date": "2016-01-27"}, {"excerpts": ["They serve actual hash browns! ", "Its just a chill local place."], "author": "Shana A.", "review": "I really like this place. The price for quality is great, indoor/outdoor seating.  It can get crowded on the weekends, but only at peak hours as expected. They serve breakfast all day, so good. The quality is higher than other dinners too. The menu is what you want when you want comfort food, but it's not a greasy spoon. They serve actual hash browns! Its just a chill local place.", "rating": 5, "date": "2016-08-21"}, {"excerpts": ["Instead of a \"mound of hash browns\" as promised, it was two connected pieces of flat pre-made style hash browns topped with cheese, with a portion of avocado and sour cream. ", "To do the dish right you need to grate your own potatoes or at least buy the frozen shredded potatoes and then cook the hash browns griddle style so they come out loose and crispy, not like a flat, might-have-been-a-potatoe-but-is-now-just-a-sad-example-of-factory-produced-food dish."], "author": "Peter H.", "review": "This place is clean and fast and the coffee is decent and comes in nice big cups. Atmosphere is OK, you go up to the register to give your order and then they bring it to your table. \n\nI ordered Hash Brown Hill from their \"House Favorites\" and it was a significant disappointment. Instead of a \"mound of hash browns\" as promised, it was two connected pieces of flat pre-made style hash browns topped with cheese, with a portion of avocado and sour cream. To do the dish right you need to grate your own potatoes or at least buy the frozen shredded potatoes and then cook the hash browns griddle style so they come out loose and crispy, not like a flat, might-have-been-a-potatoe-but-is-now-just-a-sad-example-of-factory-produced-food dish.", "rating": 2, "date": "2013-10-12"}, {"excerpts": ["When we got home fries instead of hash browns,  when up to get it corrected. ", "Again with the home fries.  ", "The guy's response ", "\"I asked you if you wanted home fries or hash browns, you said home fries\"  \nFood is okay, nothing special for San Francisco.  ", "I think Crepevine on Church has much better food, Squat and Gobble about the same. ", "Service at either place is heads above this.  "], "author": "Dennis N.", "review": "Service is horrible,  staff is rude.  Waited forever for food, no apology, no nothing. When they finally did bring it, the order came out in very strange sequence-- first out three breakfast sausages, then the French toast, then the eggs.  When we got home fries instead of hash browns,  when up to get it corrected. Again with the home fries.  The guy's response \"I asked you if you wanted home fries or hash browns, you said home fries\"  \nFood is okay, nothing special for San Francisco.  I think Crepevine on Church has much better food, Squat and Gobble about the same. Service at either place is heads above this.  I can't remember when I've seen such bad service and I eat out a lot. \n\nNo brewed decafe, if that's your thing.     Add insult to injury when I asked for a refill after all this they still had the nerve to charge 50 cents\n\n. \nGets a star cause they do have a nice outdoor area.", "rating": 2, "date": "2014-12-03"}, {"excerpts": ["Rectangle omelette, rectangle serving of hash browns, english muffin. ", "No sprig of parsley or anything to visually enhance the plate. ", "Hash browns were standard greasy fare. \n\n"], "author": "Matt S.", "review": "The Grind Cafe looked inviting. People eating in the patio area, and a decent waiting line for food. We thought the popularity of this place was an attestant to the quality of food, but we were wrong. \n\nAfter a long wait and an order, we got our coffees and found an empty table. We waited... and waited... and waited, until we finally got our food. By then, our normal ceramic cups of coffee were almost gone. Free refills? Nope. $.50 cent refills. What breakfast spots charges $.50 cent refills on coffee? Apparently this one. \n\nThe food presentation is as bland as it gets. Rectangle omelette, rectangle serving of hash browns, english muffin. No sprig of parsley or anything to visually enhance the plate. Pancakes, fried eggs, home fries, and again, no thought to presentation.\n\nOk, now to the food, because hey, it's brunch, and we are too tired to really care much about the wait and presentation. Omelette was ok, nothing spectacular. Had avocado and bacon, and a hint of cheese. Overpowered by avocado, but if you love avocado, then you'll like this omelette. English muffin was barely toasted. More like warmed up. Hash browns were standard greasy fare. \n\nEggs were ordered over-medium, but came out soft. Fine. Ham was actually good, so no complaints there. Home fries were hard and bland. Pancakes were the worst pancakes I've ever had at a restaurant. Do NOT order the pancakes. They are like rubber frisbees, but probably taste worse than an actual frisbee. Bland, rubbery, generic bulk instant pancake crap. \n\nI contemplated paying $.50 cents for a coffee refill, but couldn't bring myself to give them any more of my money.", "rating": 1, "date": "2014-05-26"}, {"excerpts": ["They have many breakfast options (only have been for breakfast): from yummy hash browns, bacon, waffles , French toast and breakfast sandwiches to the healthier choices of fruit bowls to oatmeal. "], "author": "Melanie D.", "review": "Sunday morning destination spot!\n\nAlthough finding parking in this area on the weekends requires patience, and the long line of hungover people outside waiting to get inside on a sunday morning never fails to be there, it's menu is worth the struggle.\n\nThey have many breakfast options (only have been for breakfast): from yummy hash browns, bacon, waffles , French toast and breakfast sandwiches to the healthier choices of fruit bowls to oatmeal. Literally their are so many choices ! \n\nThe portions are actual decent size portions compared to other breakfast places in the area that have you craving another meal an hour later. \n\nService : always friendly.", "rating": 5, "date": "2014-06-04"}, {"excerpts": ["(otherwise you get french fries or unimpressive hash browns). ", "The homefries are real chopped potatoes with some veggies! ", "The omelets and scram dishes are yummy! "], "author": "Eli P.", "review": "I will begin this review by stating that I think the issues some people have with this place could be alleviated if everyone bussed their own table after they finish eating - the bins are over by the cooking area - do the next person after you a favor and clean up after yourself!\n\nThe Grind is an excellent breakfast spot in the Haight. Some items are better than others. For example, you get a potato option with a few items, always get the home fries (otherwise you get french fries or unimpressive hash browns). The homefries are real chopped potatoes with some veggies! The omelets and scram dishes are yummy! I love the Haight Scram. The egg sandwich is surprisingly good too (choose the english muffin as your bread and see). If you like a sweet breakfast, treat yourself with the croissant french toast!\n\nCoffee is basic and good - they also have great smoothies. Overall, a nice place. It can get super busy, with a line going out the door. I always have a moment where I freak out and think I won't get a seat by the time I order, but that's yet to happen. Sometimes I come alone and bring a book to read while I finish my coffee, great place to do this :)\n\nI think you  may be able to fit up to a group of 6 here, if you squish some tables together - just keep in mind you order at the counter.", "rating": 4, "date": "2013-11-12"}, {"excerpts": ["Hash browns and sourdough toast were good but they did not provide enough butter."], "author": "Caitlin H.", "review": "The tofu scramble here is pretty much the worst I've ever had but a lot of that was just the poor description. For one, tofu scrambles usually consist of crumbled tofu while this dish at The Grind is strips of fried tofu. Also, the description claimed peanut sauce - instead the sauce was watery and soy-like with absolutely no peanut flavor. I basically love peanut sauce and only ordered this dish for that reason. Massively disappointing. Hash browns and sourdough toast were good but they did not provide enough butter.", "rating": 3, "date": "2015-01-25"}, {"excerpts": ["and I love the hash browns, too (but not so much the home fries). ", "Great bagels, smoothies, they have beer...", "the list goes on and on and on. ", "I usually got a Denver omelette or something similar, with hash browns and a bagel, and this breakfast was spot-on for me!\n\n"], "author": "Rick B.", "review": "Holy omelette, Batman, I'm absolutely crazy about this place.\n\nSeriously, one of my biggest disappointments in leaving SF is that I won't have this place around the block anymore. Their menu is enormous, and the lunch and dinner sandwiches are pretty good, but breakfast at The Grind is really where it's at. The omelettes are totally delicious, and I take my eggs very seriously. Excellent toast and I love the hash browns, too (but not so much the home fries). Great bagels, smoothies, they have beer...the list goes on and on and on. Oh, and the staff is really friendly, too.\n\nI should temper my enthusiasm with a disclaimer that I'm very biased; their breakfast is perfect for me, for the way that I like breakfast, which is very very hearty. If you're way into baked goods, then you can do a lot better, and i didn't eat enough eggs cooked any other way but scrambled or in omelette form to have a strong opinion on different preparations. I usually got a Denver omelette or something similar, with hash browns and a bagel, and this breakfast was spot-on for me!\n\nIt would merit five stars if it had better lunch which, again, is perfectly fine but not exceptional. Other than that, I'm not huge on their coffee, and I got totally spoiled on fresh-squeezed orange juice in SF so I wish they had that, too. Overall, though, 5+++ stars for breakfast, especially on warm days with the big windows open. It can be very crowded and loud on such days, though, especially on the weekends, something to keep in mind.", "rating": 4, "date": "2012-10-11"}, {"excerpts": ["ask them to put the hash browns inside the burrito and pick your choice of meat...", "I chose the chicken apple sausage. "], "author": "Philip H.", "review": "Was craving a breakfast burrito and this place came up on yelp and it was only a few blocks away...it was awesome! ask them to put the hash browns inside the burrito and pick your choice of meat...I chose the chicken apple sausage. Yum! \n\nI've actually split the burrito with someone and it was plenty for breakfast! \n\nUs Americans eat too much some times! \n\nShame on me, I can't believe I just said that.", "rating": 5, "date": "2012-02-27"}, {"excerpts": ["The service is just ok -- for some reason every time I order their home fries (or whatever those little potatos are called), I end up getting hash browns. ", "Never fails and always lets me down."], "author": "Lee L.", "review": "I stop in at The Grind from time to time to usually grab a coffee and a quick bite to eat before heading somewhere. The service is just ok -- for some reason every time I order their home fries (or whatever those little potatos are called), I end up getting hash browns. Never fails and always lets me down.", "rating": 3, "date": "2015-04-12"}, {"excerpts": ["My sunny side up eggs were just right and the hash browns crispy. ", "Would come back."], "author": "Ted B.", "review": "Wanted eggs for breakfast and the hotel pointed us here. Ice counter service and clean bright eating area. My sunny side up eggs were just right and the hash browns crispy. Would come back.", "rating": 4, "date": "2015-03-19"}, {"excerpts": ["We both ordered the Sicilian omelet, which was served with wheat toast and hash browns. \n\n"], "author": "Ashley G.", "review": "Took my mom for a quick breakfast bite and thought the food was P-R-I-M-E.\nWe both ordered the Sicilian omelet, which was served with wheat toast and hash browns. \n\nI was happy because they serve mimosas!\n\nStaff was friendly, patient, and made a great recommendation!", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["He had the corned beef hash with hash browns ", "and I had the veggie scramble with home fries. ", "The veggie scramble was made with mushrooms, onions, and tomatoes and covered in melted cheddar cheese. ", "I thought it was pretty average, but it was nothing special -  did the job though! "], "author": "Stephanie C.", "review": "The Grind offers many different options for breakfast, lunch, and dinner. Whatever you're in the mood for they probably have. To me, it's kinda like the People's Cafe (RIP) of the Lower Haight. \n\nThe boyfriend and I came in for brunch and were greeted with kind service. After a few minutes looking over the huge menu, we went for breakfast dishes. He had the corned beef hash with hash browns and I had the veggie scramble with home fries. The veggie scramble was made with mushrooms, onions, and tomatoes and covered in melted cheddar cheese. I thought it was pretty average, but it was nothing special -  did the job though! The boy liked his corned beef hash but wished that he had gone with the home fries, which were really delicious! \n\nOverall, I would definitely come here again. There's tons of options and I like the whole casual, neighborhood kinda vibe that it has. However, with tons of other options in the area and in the city, The Grind isn't at the top of my list.", "rating": 3, "date": "2011-11-27"}, {"excerpts": ["Hash browns are delicious, pancakes ", "so so. ", "I've loved all the bagel options! ", "They have a coffee punch card, and a great place to sit outside and people watch or gab on the phone."], "author": "Kira M.", "review": "Neighborhood casual- just like squat and gobble or crepe vine. Good food, fast service. Hash browns are delicious, pancakes so so. I've loved all the bagel options! They have a coffee punch card, and a great place to sit outside and people watch or gab on the phone.", "rating": 4, "date": "2012-11-15"}, {"excerpts": ["The breakfast burrito -- with veggie sausage and hash browns and avocado, sans egg -- is the best one in the city. "], "author": "Elinor M.", "review": "The Grind is our weekend ritual. The breakfast burrito -- with veggie sausage and hash browns and avocado, sans egg -- is the best one in the city. Their sandwiches are delicious, great French Toast and the Hash Brown Hill is to die for. And they are always so sweet to us at the counter. This place is solid.", "rating": 5, "date": "2014-03-22"}, {"excerpts": ["The hash browns and homestyle potatoes leave a bit to be desired though. ", "There wasn't even bell peppers in the homestyle potatoes! "], "author": "David A.", "review": "Had an amazing Feta/spinach/sun-dried tomato omelette here. The hash browns and homestyle potatoes leave a bit to be desired though. There wasn't even bell peppers in the homestyle potatoes! With how good the omelette was, however, I can forgive this flaw. \n\nThe menu had several options. I had trouble figuring out exactly what I wanted because a lot of it sounded good.\n\nThe place itself is right on Haight. There a patio area right next to the street or you can eat inside. Eating outside is a nice relaxing way to start the morning. We walked from our hotel our last day in San Francisco.\n\nThe service was a little odd, but I think that was mostly one worker who didn't want to be there.", "rating": 4, "date": "2012-10-21"}, {"excerpts": ["I ended up getting the classic two eggs, toast and hash browns deal. ", "My friend got French Toast which looked super tasty. ", "There was a lot on her plate too. ", "Portions are generous so plan accordingly. ", "Service is fast and seating can be tricky depending on how busy they get. ", "I would definitely stop in here again."], "author": "Amy J.", "review": "The prices are really decent here and the selection of brunch items is overwhelming. I ended up getting the classic two eggs, toast and hash browns deal. My friend got French Toast which looked super tasty. There was a lot on her plate too. Portions are generous so plan accordingly. Service is fast and seating can be tricky depending on how busy they get. I would definitely stop in here again.", "rating": 3, "date": "2011-08-15"}, {"excerpts": ["I had the tofu scramble ($8.75) which came with hash browns and toast. ", "I also got a glass of orange juice ($2.95). ", "All of the food was great and I will definitely hit this place up for breakfast again sometime soon!"], "author": "Anthony H.", "review": "I had breakfast here with a friend a few days ago and it was definitely the perfect place to go after a wild sunday funday. There is indoor and outdoor seating with large windows. You order your food at the counter and then they will bring the food to your table. I had the tofu scramble ($8.75) which came with hash browns and toast. I also got a glass of orange juice ($2.95). All of the food was great and I will definitely hit this place up for breakfast again sometime soon!", "rating": 4, "date": "2012-03-13"}, {"excerpts": ["I enjoyed this scramble with my perfectly toasted buttered wheat bread and hash browns. ", "The portions are huge. ", "The food is delicious. ", "Can't wait to come back!"], "author": "Caroline N.", "review": "The Grind is definitely a place to go to when you want a leisurely breakfast or lunch. Today was my second time coming to the Grind. The last time I went, my baby and I just had tea and pumpkin bread(which is good). This time I had the lox scramble. If you love lox, you must come here. You know how on some breakfast scrambles, the goodies are mixed quickly so the tomatoes(or whatever goodies you order) are mostly in one side? Well this scramble had omelet, lox, cream cheese, tomatoes, green onions and capers in every bite. It was cut up and mixed thoroughly. Each forkful was paradise. I enjoyed this scramble with my perfectly toasted buttered wheat bread and hash browns. The portions are huge. The food is delicious. Can't wait to come back!", "rating": 4, "date": "2011-04-15"}, {"excerpts": ["Love the scramblers and hash browns."], "author": "Louis D.", "review": "Great coffee and great food.  There's a reason why the lines can sometimes be a little long on the weekends.  Love the scramblers and hash browns.", "rating": 5, "date": "2014-05-10"}, {"excerpts": ["The hash browns are also quite yummy.\n\n"], "author": "Edgar S.", "review": "First of all, lemme preface this with my \"I don't drink coffee\" disclaimer and tell you right now, I have NO idea if the coffee here is worth your time because... well... I don't drink coffee. \n\nNow, moving on to what's important... FOOD.\n\nI ate breakfast here twice in the two days I was in town. Day one, I got the breakfast sandwich (egg, sausage & cheese on a croissant) which you can pretty much customize to have whatever you want. That's pretty hard to mess up since it's got exactly what you want on it but it was quite tasty. The hash browns are also quite yummy.\n\nSecond day, I had the Grind Combo (I believe that's what it's called), and although it wasn't a fancy order at all, everything was quite tasty. The french toast was quite good, which is impressive because I think most places overdo it with the egg then cover them in powdered sugar like we're at Cafe du Monde or something. This place did them quite nicely. The country potatoes were also good. \n\nI also must say this about the staff; they are really nice. They may be granola-crunching hippies (let's face it, they're everywhere around here) but they were super sweet and very quick with the drinks and the food.", "rating": 4, "date": "2010-09-19"}, {"excerpts": ["I chose to get their homestyle fries instead of the hash browns. ", "The homestyle fries were decent.\n", "I also went with their lattes. ", "Coffee is made fairly quick, before your food is brought out to you. ", "Food is made fairly quickly and brought out to you by friendly staff.\n", "Overall the staff is friendly and are quick to serve you.\n", "The atmosphere is somewhat quiet to average noise levels.\n", "The place also has large windows which brings in great ambient light.\n", "It's a great place to sit down and eat so you can enjoy your morning.\n", "There is free wi-fi but limited on the weekends.\n", "This place is very convenient if you're staying at the Metro Hotel. ", "Just a short walk away.\n"], "author": "John S.", "review": "First time experience.\n\nThis is my favorite breakfast spot to eat at when I'm staying at the Metro Hotel.\nMy girlfriend and I visited this place a few times during our stay in San Francisco.\nI fell in love with their croissant french toast. Adding fresh strawberries to it made it really delicious. I chose to get their homestyle fries instead of the hash browns. The homestyle fries were decent.\nI also went with their lattes. Coffee is made fairly quick, before your food is brought out to you. Food is made fairly quickly and brought out to you by friendly staff.\nOverall the staff is friendly and are quick to serve you.\nThe atmosphere is somewhat quiet to average noise levels.\nThe place also has large windows which brings in great ambient light.\nIt's a great place to sit down and eat so you can enjoy your morning.\nThere is free wi-fi but limited on the weekends.\nThis place is very convenient if you're staying at the Metro Hotel. Just a short walk away.\nPrices are fair for what you receive.\n\nThe Grind Cafe is our favorite new place for breakfast.\nBut will also continue to come back to try their lunch menu.", "rating": 4, "date": "2013-08-26"}, {"excerpts": ["The hash browns on the side were lovely as well. \n", "Ok ", "but really, this scramble was amazing. ", "I wanna go again. ", "Now. \n", "Oh ", "but question: are the coffee refills free? ", "I was afraid to ask."], "author": "Emilia S.", "review": "Two fork-fuls in, and I announced to the bf that I was in love with my breakfast. Not even joking.\nI ordered the fresh lox scramble and have never, ever had something so amazing. I asked for no onions or anchovies and the request was honored, so my dish was eggs with salmon, tomatoes, avocado, and cream cheese. Yes, cream cheese sounds weird but it was sooo freakin goooood!!! The hash browns on the side were lovely as well. \nOk but really, this scramble was amazing. I wanna go again. Now. \nOh but question: are the coffee refills free? I was afraid to ask.", "rating": 5, "date": "2009-08-12"}, {"excerpts": ["The breakfast choices are great-- had the egg white mediterreanean scramble with hash browns and a latte ", "and it was out of this world.  ", "So much food that I had to take some home for later.  "], "author": "Sonia S.", "review": "Why can't there be a similar place in good ol' SOMA?  Came in for breakfast early on a saturday morning when it was quiet and I could take my time reading the extensive menu.\n\nThe breakfast choices are great-- had the egg white mediterreanean scramble with hash browns and a latte and it was out of this world.  So much food that I had to take some home for later.  I like the layout and outdoor seating (although does the sun ever come out in lower haight?)  Next time I'm going for the breakfast burrito and french toast because they looked quite awesome. \n\nstaff is friendly as well. I'm a fan.", "rating": 5, "date": "2009-03-14"}, {"excerpts": ["I ordered the breakfast sandwich with a side of hash browns.\n\n", "I sure hit up the salt and paper shakers to spice up my hash browns. ", "They had run out of croissants, so my breakfast sandwich was scrambled eggs and bacon between to slices of toast. ", "I suppose I was hoping for something tasty and surprising, but all I got was a sandwich that I could have made at home. ", "Even the smoothie was a disappointment. "], "author": "Hugo C.", "review": "We were walking back from Haight-Ashbury and had to go -- really, really bad. We were at the point where we couldn't hold it any longer and The Grind Cafe was the closest restroom, so we decided to stop by and have a drink. We glanced over their menu and decided we might as well stop for lunch here.\n\nI've become such a Yelp snob that I regularly don't eat at a place that I haven't at least read a couple of reviews on. Today was different though, I really had some bladder presser that needed relieving. The other half ordered a standard burger and a banana smoothie. I ordered the breakfast sandwich with a side of hash browns.\n\nWe found the food to be flavorless and uninspiring. I sure hit up the salt and paper shakers to spice up my hash browns. They had run out of croissants, so my breakfast sandwich was scrambled eggs and bacon between to slices of toast. I suppose I was hoping for something tasty and surprising, but all I got was a sandwich that I could have made at home. Even the smoothie was a disappointment. From the first sip you could tell that the banana was still unripened. \n\nIt was a disappointing meal from start to finish.", "rating": 2, "date": "2009-05-27"}, {"excerpts": ["I ordered the ham scram with avocado, toast and hash browns. ", "Let me tell you, I inhaled everything. ", "I'd put some of the scram on my toast and it'd taste even better. ", "As always, staff was friendly and nice, atmosphere was chill, food was awesome."], "author": "Laura F.", "review": "I liked this place... another cool breakfast place within walking distance. I ordered the ham scram with avocado, toast and hash browns. Let me tell you, I inhaled everything. I'd put some of the scram on my toast and it'd taste even better. As always, staff was friendly and nice, atmosphere was chill, food was awesome.", "rating": 5, "date": "2011-04-13"}, {"excerpts": ["But the hash browns were meeh, the eggs were meah, the toast was a bit burn, but the vegi-sausage was AWESOME!!  ", "But...."], "author": "Jessi K.", "review": "very torn between 2 and 3 stars...this place is not bad, the price is just about right for what it is, I was just not impressed.  \n\nWe came here on a Saturday, which might explain why it was so freaking busy.  After we ordered, we had to wait for a table to clear up, and we ended up bussing it ourselves.\n\nI got a basic breakfast of eggs, toast, hashbrowns, and vegi-sausage patties.  I have to say, it's really nice that they have the meat alternatives...I'm not vegi or vegan or anything, I just really like certain vegi-patties (like the morning star ones...mmm...so good!) But the hash browns were meeh, the eggs were meah, the toast was a bit burn, but the vegi-sausage was AWESOME!!  But....BUT....lots of points because although it wasn't an impressive breakfast, it was EXACTLY what I wanted.  \n\nWe had gotten coffee earlier for the walk there, so we didn't order any at The Grind, and it seemed that everyone was more about beer drinking at 11:30 am on a Saturday, as opposed to coffee drinking.  We did get smoothies, and compared to other smoothies, I was disappointed.  (Check out the Mango Smoothie at the Moonlight Cafe in Bernal Heights...they cannot be beat!)   Also, extra points for the Grind for the fact that they offer a protein additive for the smoothies.  \n\nAll in all, I wouldn't make a point of coming back here, unless I were broke and wanting to go somewhere within walking distance from home to get breakfast.  It's also walking distance from a lot of neat places, and I believe there's probably cheap beer here.", "rating": 3, "date": "2011-04-17"}, {"excerpts": ["the french toast is huge and came with 6 pieces and your choice of home fries or hash browns ($6+change).  ", "the corned beef hash is also pretty big and comes with two eggs your way..."], "author": "Sally T.", "review": "cute place with a decent patio for outdoor seating.\n\nit's pretty much a coffee shop that serves meh food for cheap.  the french toast is huge and came with 6 pieces and your choice of home fries or hash browns ($6+change).  the corned beef hash is also pretty big and comes with two eggs your way...i'm not sure how much this was.\n\nfind your own seat, bus your own table.\n\nnot in a hurry to come back here unless every other breakfast place in town has a ridiculous wait time...", "rating": 2, "date": "2012-01-11"}, {"excerpts": ["All the breakfasts are really good and they have hash browns which seems more and more rare in this era of breakfast potatoes.  ", "The spud variety is pretty great, they  even have curly fries.  ", "Yay.  ", "I also really like the poppy seed dressing with the side salad which is really fresh and crisp.  ", "Oh and I love that there ", "juice and smoothies come in a big pint glass.   ", "I just had their crispy chicken sandwich w avocado bacon and cheddar which was kind of blew me away.  ", "My only complaint is they use chicken strips instead of a whole crispy chicken breast ", "but they got the flavor spot on."], "author": "Ian S.", "review": "This place Is my favorite cafe within miles.  The price is fair, the portions are pretty large and the food is delicious.  The variety is great too for lunch and breakfast which is available all day.  The French dip is awesome and I have a hard time wanting to get anything else but every time I get something different I love that too.  All the breakfasts are really good and they have hash browns which seems more and more rare in this era of breakfast potatoes.  The spud variety is pretty great, they  even have curly fries.  Yay.  I also really like the poppy seed dressing with the side salad which is really fresh and crisp.  Oh and I love that there juice and smoothies come in a big pint glass.   I just had their crispy chicken sandwich w avocado bacon and cheddar which was kind of blew me away.  My only complaint is they use chicken strips instead of a whole crispy chicken breast but they got the flavor spot on.", "rating": 4, "date": "2014-05-03"}, {"excerpts": ["For instance, their hash browns, scrambled eggs and toast are so-so, but their waffles and pancakes are delicious. ", "I've had just about everything on the breakfast menu and most of it is pretty decent. ", "This is a very typical breakfast place. ", "You can't really order veggie-meat products here as in other breakfast joints. ", "It has a nice front patio for warm days but it doesn't get much sunlight. ", "There is never a line out the door and the food is prepared pretty quickly. "], "author": "L. L.", "review": "I love the makeover! It's so nice and clean now. I don't have to feel ashamed to bring my mother-in-law here anymore. Some of the food is great and some is mediocre. For instance, their hash browns, scrambled eggs and toast are so-so, but their waffles and pancakes are delicious. I've had just about everything on the breakfast menu and most of it is pretty decent. This is a very typical breakfast place. You can't really order veggie-meat products here as in other breakfast joints. It has a nice front patio for warm days but it doesn't get much sunlight. There is never a line out the door and the food is prepared pretty quickly. This is a good place to bring a laptop and sit around for hours while sipping coffee.\n\nLet me describe some of the best food I've had there:\n\nStrawberry Waffle: \nOne large waffle the size of a dinner plate, that was about 1\" thick, with tons of fresh strawberries all over and sprinkled with powdered sugar. \n\nHome-fry Mound (I think they changed it to the Hash Mound): \nA large mound of potatoes smothered in melted cheddar, green onions, black olives, huge slabs of avocado and a dollop of sour cream. Very filling.\n\nI think that with the makeover they made some changes I don't necessarily like all that much. I used to get fresh-squeezed grapefruit juice and they would squeeze it in front of me but now they serve it from a pitcher. The last time I had it it tasted pretty bad... like it was fermented.\n\nOverall though, I give it a four because it's clean, has a patio, is close to home, the food is pretty good, they prepare it quickly, there is no line, and they offer many meal choices but most of all, their coffee doesn't suck.", "rating": 4, "date": "2007-03-02"}, {"excerpts": ["The hash browns are also good. \n\n"], "author": "Abhi S.", "review": "I don't think I expect much from brunch places - decent eggs, good hot sauce, great coffee and a relaxed atmosphere to start off a Saturday morning. \n\nDiscovered the Grind and it didn't quite make the cut. The staff is friendly enough however the coffee is uninspired. I also seem destined to never get a croissant when I want a breakfast sandwish - interestingly, they are never, and I mean never, out of english muffins (how many times can you use the word never in a sentence?). This was also true at the Grind but a worthwhile substiution to sourdough was made.  The hash browns are also good. \n\nSadly, the grind, like many brunch locations feels the need to optimize their space by seating 40 odd people in a space that should only take about 30-35. Bottom line: you're going to be very close to your neighboring table. As much as I like other people, I don't like them that much.,", "rating": 3, "date": "2008-03-08"}, {"excerpts": ["I'll keep enjoying The Grind's mound of hash browns and a sunny-side-up egg.  ", "Wouldn't you?"], "author": "John S.", "review": "I really really really want to love this place.  I kind of do.  OK, that's not true.  \n\nHave you ever dated a girl who was absolutely beautiful but who annoyed you nonetheless?  No, her beauty didn't annoy you, and it was natural, not a put-on or an example of masterful makeup artistry or a figment of your own delusionally hopeful imagination, but there just wasn't much else going on.  She could be smart and maybe even intelligent, but she wasn't quick on the uptake, or at least she didn't pick up on all the little cues that she should pick up on.  Those cues that you picked up on with her.  And maybe you enjoyed each other's company, but when you weren't physically together, you wondered whether you were just wasting your time with her?  And you had your breakup speech all planned out and maybe even rehearsed; you had chosen a coffeehouse or a park that you had never been to together so that neither of your memories or daily routines would be ruined by this ultimately trivial but nonetheless life-changing event?  But then when you saw her crossing the street in her cheap pink flip-flops or leaning down to pick a dandelion from the grass--and her hair would fall just so--you couldn't go through with it.  You just had to continue to be with this girl because she was beautiful, right?  Just really naturally pretty.  Someone no one in his right mind would give up.  Not without good reason?\n\nWell, that girlfriend is The Grind Cafe.  It's gorgeous, and the menu is really promising.  The atmosphere is even pleasant, and this is an accomplishment in the Lower Haight.  But the food is just so bland.  It's not bad, and it's presented really beautifully, but on your walk home, you always find yourself wondering whether you should start spending less time here and more time at a grungier-looking restaurant that understands your needs better.\n\nBut hell, I'm a sucker for a pretty face, so I'll keep enjoying The Grind's mound of hash browns and a sunny-side-up egg.  Wouldn't you?", "rating": 3, "date": "2010-01-14"}, {"excerpts": ["David Says: \nWell, the hash browns were edible--after I covered them in ketchup\n\n"], "author": "AmanDave H.", "review": "Amanda Says: \nHere's what I am wondering: How is it possible for food to taste like nothing? \n\nDavid Says: \nWell, the hash browns were edible--after I covered them in ketchup\n\nConsensus: The Grind is The Gross. The food was cold and the tofu scramble was a sorry mess. If you are into \"chalkboard restaurants\" and live in the lower haight head on down to the Squat and Gobble. The house potatoes are at least edible and the Gobble knows a thing or two about tofu scramble.", "rating": 1, "date": "2006-08-16"}, {"excerpts": ["Came here on a Sunday morning for some breakfast and it was so damn tasty (can't go wrong with the breakfast burrito with a side of hash browns).  ", "The service was friendly, the coffee was delicious, and its a very relaxed atmosphere.  ", "Will certainly be back soon."], "author": "Jeremy R.", "review": "Came here on a Sunday morning for some breakfast and it was so damn tasty (can't go wrong with the breakfast burrito with a side of hash browns).  The service was friendly, the coffee was delicious, and its a very relaxed atmosphere.  Will certainly be back soon.", "rating": 5, "date": "2009-12-13"}, {"excerpts": ["The don't mess up simple things like an omelet and hash browns, but its not out of this world. ", "In such a foodie town, this is an okay place. ", "Since the prices aren't any cheaper than anywhere else Im surprised its so popular. ", "Last summer I did see Laura Linney and Ben Harper eating here, so thats a plus. ", "If you are really hung over it will do."], "author": "Dana H.", "review": "Yelp says that three starts is \"A-OK\", and that is exactly right. The Grind is okay. The don't mess up simple things like an omelet and hash browns, but its not out of this world. In such a foodie town, this is an okay place. Since the prices aren't any cheaper than anywhere else Im surprised its so popular. Last summer I did see Laura Linney and Ben Harper eating here, so thats a plus. If you are really hung over it will do.", "rating": 3, "date": "2009-08-07"}, {"excerpts": ["Get it with the hash browns and sourdough toast and then eat the latter with a little butter and a lot of blackberry jam ", "and you're all set! ", "Viva la breakfast!"], "author": "Christine P.", "review": "I love The Grind Cafe. I live really close by and it's so nice to be able to walk over within a minute or two. The folks are always friendly and if you're a regular coffee drinker, they'll remember and offer you recommendations on what you might like to try. The Sister and I loved the granola with yogurt and fresh fruit. Ask for a little bit more yogurt when you order though. It comes with strawberries, blueberries and bananas and at the very end I like to mix in some honey (when all of the fruit except the bananas is gone). The coffee is mediocre but the scramblers are yummy. I like the Grind Scram. Get it with the hash browns and sourdough toast and then eat the latter with a little butter and a lot of blackberry jam and you're all set! Viva la breakfast!", "rating": 3, "date": "2009-07-21"}, {"excerpts": ["Both dishes come on a big plate, with a side of toast or muffin, and hash browns, salad, or fries.  ", "We had the hash browns and they were great.  ", "Service is friendly and in addition to the great menu, this place also is loaded with fine pastries, cookies, and more.  ", "A great place for lunch or breakfast or just a quick cup of coffee!"], "author": "Beenish K.", "review": "I love this place.  It has such a vast menu - something to please even the most picky eaters (which I know from personal experience, so trust me).  The vanilla latte is very good here, and I've been twice already for breakfast.  The veggie bagel with hummus and sprouts is positively delicious.  My husband and I had brunch there today and he enjoyed the lower haight omelet and I the tofu scram.  My husband commented that his omelet was \"awesome\" and completely cleaned off his plate.  The tofu scram was great, the first time I've tried it actually, and I think it's a great vegan-friendly dish, which is definitely hard to find.  Both dishes come on a big plate, with a side of toast or muffin, and hash browns, salad, or fries.  We had the hash browns and they were great.  Service is friendly and in addition to the great menu, this place also is loaded with fine pastries, cookies, and more.  A great place for lunch or breakfast or just a quick cup of coffee!", "rating": 4, "date": "2010-07-31"}, {"excerpts": ["Hash browns were insitutional fries (the kind you buy at Costco in 3-ton boxes), eggs were undercooked and watery, bread was lousy and under-butterred, cappucino was strange, and my stomach is in pain 2 hours later. ", "I would not return."], "author": "Eater S.", "review": "Just had breakfast there. Very disappointing. Hash browns were insitutional fries (the kind you buy at Costco in 3-ton boxes), eggs were undercooked and watery, bread was lousy and under-butterred, cappucino was strange, and my stomach is in pain 2 hours later. I would not return.", "rating": 2, "date": "2007-07-05"}, {"excerpts": ["I had the French Toast with Hash Browns and a side of scrambled egg, my man had the Corned Beef Hash on Toast. ", "I don't know how long it took altogether about an hour and a half, but for average food this was a really annoying experience. \n", "The people were all nice and even fellow customers, it is tiny and it was new years, but come on guys pick up the pace a little!"], "author": "Sydney C.", "review": "I was here on new years day, my birthday! \nHad slept late at the hotel I will review on another page and needed food. This was my first time back in SF in almost 10 years and I was very excited to head for the Height section of the city, everyone is so creative and fun.\nWe were driving up towards Ashbury and this place looked so cute and friendly we just had to stop.\nYou go up to the counter and order then find a table on your own and sit. This is normally cool except there were no tables to sit at, for a half an hour. Which didn't matter I guess because we still hadn't been served by then. So we finally find one that has just been abandoned out on the patio and continue to wait another half hour or so for our food. \nI had the French Toast with Hash Browns and a side of scrambled egg, my man had the Corned Beef Hash on Toast. I don't know how long it took altogether about an hour and a half, but for average food this was a really annoying experience. \nThe people were all nice and even fellow customers, it is tiny and it was new years, but come on guys pick up the pace a little!", "rating": 2, "date": "2008-01-03"}], "sausage patty or link": [], "hot links": [], "vegetarian sausage patty": [], "new york steak  eggs": [], "hash brown hill": [{"excerpts": ["I ordered Hash Brown Hill from their \"House Favorites\" and it was a significant disappointment. "], "author": "Peter H.", "review": "This place is clean and fast and the coffee is decent and comes in nice big cups. Atmosphere is OK, you go up to the register to give your order and then they bring it to your table. \n\nI ordered Hash Brown Hill from their \"House Favorites\" and it was a significant disappointment. Instead of a \"mound of hash browns\" as promised, it was two connected pieces of flat pre-made style hash browns topped with cheese, with a portion of avocado and sour cream. To do the dish right you need to grate your own potatoes or at least buy the frozen shredded potatoes and then cook the hash browns griddle style so they come out loose and crispy, not like a flat, might-have-been-a-potatoe-but-is-now-just-a-sad-example-of-factory-produced-food dish.", "rating": 2, "date": "2013-10-12"}, {"excerpts": ["Their sandwiches are delicious, great French Toast and the Hash Brown Hill is to die for. ", "And they are always so sweet to us at the counter. ", "This place is solid."], "author": "Elinor M.", "review": "The Grind is our weekend ritual. The breakfast burrito -- with veggie sausage and hash browns and avocado, sans egg -- is the best one in the city. Their sandwiches are delicious, great French Toast and the Hash Brown Hill is to die for. And they are always so sweet to us at the counter. This place is solid.", "rating": 5, "date": "2014-03-22"}], "grind combo": [{"excerpts": ["I went with the Grind Combo (Pancakes, hashbrowns, scrambled eggs, bacon). "], "author": "Brian S.", "review": "Not sure how I haven't reviewed the Grind before, seeing as how I grew up quite literally ACROSS THE STREET, but it's not like reviewing restaurants was the cool thing to do in middle school, so here we go. Better late than never.\n\nI'll always been happy eating at The Grind if its convenient, because the menu is big, the food is solid, and you'll rarely, if ever, leave disappointed. But even after all these years, its still far from being one of my \"favorite places\". \n\nI went with the Grind Combo (Pancakes, hashbrowns, scrambled eggs, bacon). It was definitely satisfying, as you get your money's worth, but it was far from life-changing. \n\nHashbrowns are dope. Crunchy, crispy, tasty and delicious. \n\nPancakes are good, although they're a little heavy (as opposed to being light & fluffy), especially once you throw syrup on them. \n\nIn short breakfast was as breakfast always is here, good, but not the best. Definitely think you can do better with Kate Kitchen or Eddie's Cafe, nearby options which are both slightly better. If I could give 3.5 stars I would in a heartbeat, but as it is 3 stars will have to do.", "rating": 3, "date": "2014-08-06"}, {"excerpts": ["\" ( The Grind Combo, if you're wondering)\n\n"], "author": "Alyssa G.", "review": "Anytime I go out to breakfast, I consistently have the dilemma that I want French toast, but I also want the traditional breakfast of eggs, toast, and bacon. \n\nThis place has that on one plate!\n\nWhen my food arrived, my boyfriend took one look and said \"Umm, next time I'm getting THAT.\" ( The Grind Combo, if you're wondering)\n\nMy latte was very good, and seriously their menu is huge and everything sounds really good. Plus the outdoor seating is where it's at.\n\nOh and the staff is actually FRIENDLY. A smile while taking your order goes a long way.", "rating": 5, "date": "2011-07-17"}, {"excerpts": ["Second day, I had the Grind Combo (I believe that's what it's called), ", "and although it wasn't a fancy order at all, everything was quite tasty. ", "The french toast was quite good, which is impressive because I think most places overdo it with the egg then cover them in powdered sugar like we're at Cafe du Monde or something. ", "This place did them quite nicely. "], "author": "Edgar S.", "review": "First of all, lemme preface this with my \"I don't drink coffee\" disclaimer and tell you right now, I have NO idea if the coffee here is worth your time because... well... I don't drink coffee. \n\nNow, moving on to what's important... FOOD.\n\nI ate breakfast here twice in the two days I was in town. Day one, I got the breakfast sandwich (egg, sausage & cheese on a croissant) which you can pretty much customize to have whatever you want. That's pretty hard to mess up since it's got exactly what you want on it but it was quite tasty. The hash browns are also quite yummy.\n\nSecond day, I had the Grind Combo (I believe that's what it's called), and although it wasn't a fancy order at all, everything was quite tasty. The french toast was quite good, which is impressive because I think most places overdo it with the egg then cover them in powdered sugar like we're at Cafe du Monde or something. This place did them quite nicely. The country potatoes were also good. \n\nI also must say this about the staff; they are really nice. They may be granola-crunching hippies (let's face it, they're everywhere around here) but they were super sweet and very quick with the drinks and the food.", "rating": 4, "date": "2010-09-19"}, {"excerpts": ["Grind Combo with French Toast (holla for the Challah) and home fries."], "author": "Naeem N.", "review": "The Grind is my home office and favored Lower Haight eatery.  Good food, good pricing and a comfortable place make it a must for me everyday.  The staff is uber friendly and they are always smiling (Andrea and C-Sha and Smashly are da best).  \n\nFree and reliable wi-fi, well placed power outlets, breakfast and burgers, chili and smoothies, home made iced tea and lemonade and coffee make it even better.  Busiest times are lunchtime and weekend brunch (damn you Kaiser!)\n\nOpen until 8PM during the week.  Current new discovery has been the chili oddly enough.  Ole Reliable dish:  Grind Combo with French Toast (holla for the Challah) and home fries.", "rating": 4, "date": "2009-11-11"}, {"excerpts": ["The GRIND Combo: 2 eggs, hash, sausage or bacon, french toast or pancakes\n\nBoy: "], "author": "Oanh N.", "review": "The GRIND Combo: 2 eggs, hash, sausage or bacon, french toast or pancakes\n\nBoy: Can I have your sausage\nGirl: Can I have some of your corn beef hash\nBoy: Mmm my corn beef hash is good\nGirl: best french toast ever\nBoy: this breakfast is good. the hash isn't greasy \nGirl: I can't believe I just finished my plate\n\nExpect a long wait for the food. \nPatio seating is available and is dog friendly :)", "rating": 4, "date": "2008-02-17"}, {"excerpts": ["Try the grind combo for the big man in all of us.  ", "If you give them a bad review because you don't like the hamburger you got then try something else before giving them 2 stars.  ", "Also the grind is about a million times better than any Crepeville baloney."], "author": "Mister L.", "review": "This place is awesome.  If you have a bad experience then go back again and try something else.  They are so fast even when the line is out the door which is a tell tale sign that this place is doing things right.   I typically go here for breakfast which is always cooked to perfection.  I look for consistency in the places I eat and The Grind never fails.  Try the grind combo for the big man in all of us.  If you give them a bad review because you don't like the hamburger you got then try something else before giving them 2 stars.  Also the grind is about a million times better than any Crepeville baloney.", "rating": 5, "date": "2012-07-08"}, {"excerpts": ["The breakfast burrito and grind combo are my favorites. ", "So good ", "I have to stop myself from going there more. ", "Here's the deal, it's a very good place to grab food, be it brunch, a burger, ", "a salad...whatever. ", "Since the remodel, it appears that their kitchen capacity has improved dramatically too. ", "The complaints I'm seeing on here about \"poor service\" and \"inefficiencies\" are baffling to me. ", "Common Sense. ", "If there is a line out the door, all the tables look full, and there are people waiting for to go orders....", "It's gonna take a while to get your food on a Saturday or Sunday morning. ", "You are talking about a very clean place with above average, fairly priced food in very popular part of SF. ", "There are too many bad ones to count. ", "This isn't the place you go \"to brunch.", "\" ", "It's where you go because you don't want to deal with the bs that is \"brunching\"  but want the same or similar quality food. "], "author": "Paul Z.", "review": "I'm reading some of these reviews and they are ridiculous. I live down the street and come to the Grind at least once or twice a week. The breakfast items are great. The breakfast burrito and grind combo are my favorites. So good I have to stop myself from going there more. Here's the deal, it's a very good place to grab food, be it brunch, a burger, a salad...whatever. Since the remodel, it appears that their kitchen capacity has improved dramatically too. The complaints I'm seeing on here about \"poor service\" and \"inefficiencies\" are baffling to me. Common Sense. If there is a line out the door, all the tables look full, and there are people waiting for to go orders....It's gonna take a while to get your food on a Saturday or Sunday morning. You are talking about a very clean place with above average, fairly priced food in very popular part of SF. There are too many bad ones to count. This isn't the place you go \"to brunch.\" It's where you go because you don't want to deal with the bs that is \"brunching\"  but want the same or similar quality food. Having been here too many times to count, I have to say it's got to be the most consistent place in the Lower Haight. Can't wait to go back again!", "rating": 5, "date": "2014-08-11"}, {"excerpts": ["They do a solid burger and the Grind Combo is a hangover cure from heaven - eggs, sausage or bacon, pancakes or French toast, what's not to like. ", "So the omelets are a bit rubbery but dude this ain't Paris and the portions are grand. ", "And it's big enough that you have a chance of getting breakfast without waiting a lifetime at the weekends."], "author": "mefloquine x.", "review": "God bless you, The Grind. You're 50 meters from my house and you never let me down. The staff are lovely, the food is not out of this world but it does the job and sometimes a bit more. I've eaten here a hundred times and maybe only once been disappointed. They do a solid burger and the Grind Combo is a hangover cure from heaven - eggs, sausage or bacon, pancakes or French toast, what's not to like. So the omelets are a bit rubbery but dude this ain't Paris and the portions are grand. And it's big enough that you have a chance of getting breakfast without waiting a lifetime at the weekends.", "rating": 4, "date": "2011-03-02"}], "short stack": [{"excerpts": ["I also split a short stack with my friend. ", "For a drink, \"Orange juice, and lots of it, please.", "\" ", "The wait staff was perky, chipper and did not at all look amused... or hungover. ", "Really good, actually, and the short stack reminded me of home, so damn that's gotta be worth at least one star... and the eggs were yummy and there was ample hot sauce at the table (although just Tabasco... ", "when will people get it ", "right? ", "ANYTHING but Tabasco!), and ", "pretty soon I was happy and full, and I didn't have to give up 30 minutes sitting on the curb waiting for a table (that's you, Porkstore... "], "author": "Aiden B.", "review": "The Grind is not exactly what I expected when a friend of mine suggested we have brunch in the Lower Haight. I was stoked for the idea of a divey, nasty, greasy spoon with an assertive, short-tempered wait staff that had been working there for a decade.\n\nSo I approach the place from the west, slowly, sizing it up; looks alright, so far. I see hipsters and students and art kids smoking on the patio. This is usually a good sign, at least for my tastes and general comfort level.\n\nOnce inside, however, surprise! Exposed duct work, track lighting and the ubiquitous gigantic fucking chalk board menu. The offerings looked good, though, so I chose to forgive them and let bygones be bygones while some coked out dude started yammering at my friend.\n\nI ordered the two eggs, scram, with hash and subbed an English muffin  for the toast. I also split a short stack with my friend. For a drink, \"Orange juice, and lots of it, please.\" The wait staff was perky, chipper and did not at all look amused... or hungover. This was a problem.\n\nBut the food was good. Really good, actually, and the short stack reminded me of home, so damn that's gotta be worth at least one star... and the eggs were yummy and there was ample hot sauce at the table (although just Tabasco... when will people get it right? ANYTHING but Tabasco!), and pretty soon I was happy and full, and I didn't have to give up 30 minutes sitting on the curb waiting for a table (that's you, Porkstore... that's what you sound like).\n\nSo, damnit, a reluctant 3... but well earned. Even if it did feel like Hayes Valley in there.", "rating": 3, "date": "2007-02-25"}], "full stack": [], "blueberry stack": [], "strawberry stack": [], "banana walnut": [{"excerpts": ["The banana walnut pancakes are yummy.  ", "Nice and friendly cashier.  ", "It is a nice place to hang out over coffee and/or beers and read.  ", "I like the outdoor seating."], "author": "J M.", "review": "The banana walnut pancakes are yummy.  Nice and friendly cashier.  It is a nice place to hang out over coffee and/or beers and read.  I like the outdoor seating.", "rating": 4, "date": "2010-09-21"}], "chocolate chips": [], "nutella madness": [{"excerpts": ["Although next time I'm getting the Nutella Madness - buttermilk pancakes with bananas and nutella, YUM!"], "author": "Meghan C.", "review": "Great spot for a laid-back weekend brunch. It was fairly busy (a good sign, I always say) but we were able to snag a table on the patio and people watch while we waited for our food. I had the Haight scramble (bacon, avacado, green onion, cheddar) with home fries and my husband had a Belgian waffle with a side of bacon, and everything was delicious. Will definitely be back. Although next time I'm getting the Nutella Madness - buttermilk pancakes with bananas and nutella, YUM!", "rating": 4, "date": "2010-07-11"}], "croissant french toast": [{"excerpts": ["Killer croissant french toast.  ", "Desserts yo die for, try the lemon bread (cake).   ", "Staff is cool, I'm a fan - just do it."], "author": "Christian C.", "review": "Cool place to chill and have brunch.  Killer croissant french toast.  Desserts yo die for, try the lemon bread (cake).   Staff is cool, I'm a fan - just do it.", "rating": 4, "date": "2018-07-25"}, {"excerpts": ["The coffee is decent, as is the croissant french toast, but their scrambles are greasy and their regular french toast is bland and soggy. ", "Eat here if you're starving and need a quick fix ", "but if you want a good breakfast/brunch you're better off finding another spot in the city. ", "Maven, Kate's Kitchen, and NOPA are all within walking distance and offer far superior brunches."], "author": "Chriselle B.", "review": "This place used to serve food that was worth the price but the quality has declined significantly in the last few months. The coffee is decent, as is the croissant french toast, but their scrambles are greasy and their regular french toast is bland and soggy. Eat here if you're starving and need a quick fix but if you want a good breakfast/brunch you're better off finding another spot in the city. Maven, Kate's Kitchen, and NOPA are all within walking distance and offer far superior brunches.", "rating": 2, "date": "2016-06-25"}, {"excerpts": ["If you like a sweet breakfast, treat yourself with the croissant french toast!\n\n"], "author": "Eli P.", "review": "I will begin this review by stating that I think the issues some people have with this place could be alleviated if everyone bussed their own table after they finish eating - the bins are over by the cooking area - do the next person after you a favor and clean up after yourself!\n\nThe Grind is an excellent breakfast spot in the Haight. Some items are better than others. For example, you get a potato option with a few items, always get the home fries (otherwise you get french fries or unimpressive hash browns). The homefries are real chopped potatoes with some veggies! The omelets and scram dishes are yummy! I love the Haight Scram. The egg sandwich is surprisingly good too (choose the english muffin as your bread and see). If you like a sweet breakfast, treat yourself with the croissant french toast!\n\nCoffee is basic and good - they also have great smoothies. Overall, a nice place. It can get super busy, with a line going out the door. I always have a moment where I freak out and think I won't get a seat by the time I order, but that's yet to happen. Sometimes I come alone and bring a book to read while I finish my coffee, great place to do this :)\n\nI think you  may be able to fit up to a group of 6 here, if you squish some tables together - just keep in mind you order at the counter.", "rating": 4, "date": "2013-11-12"}, {"excerpts": ["The Haight scram is a favorite, also the croissant french toast, and the amazing orange juice! \n\n"], "author": "Jennifer H.", "review": "This is a regular stop for me (once or twice a week) for a quiet place to sit and read, while eating some tasty food stuffs. \nThe Haight scram is a favorite, also the croissant french toast, and the amazing orange juice! \n\nPrices are good for the portion sizes, and the staff is always very nice and accommodating. \nDefinitely will continue to be my \"go-to\" until I move out of the lower Haight.", "rating": 4, "date": "2013-07-16"}, {"excerpts": ["I went with the croissant french toast, a couple of scrambled eggs and a glass of apple juice.  ", "The juice seemed natural with that darker, cloudier look rather than that pretty almost clear stuff you get in a bottle at Safeway.  ", "Eggs cooked to perfection, though I could have used some shredded cheese on top.  ", "French toast was a couple of big croissants sliced in two and cooked in the classic batter.  ", "All very good.  "], "author": "Bennett L.", "review": "Sundays are my Fridays and working the overnight shift, Sunday mornings are my Friday nights.  (Are you following?)  So what else to do on a \"Friday night\" but go grab a bite on the town.  By town I mean an emerging from slumber, cloudy San Francisco.  By bite I mean breakfast, naturally.\n\nThere was a sports bar I wanted to check out for some NFL action in the area, so luckily I also came across The Grind Cafe to get my fill ahead of time.  This place is a hub of activity on a Sunday morning.  Families with their kids, students with their notebooks, young adults knocking out the cobwebs, SFPD officers on their break and guys like me just looking for something new.  A patchwork of people coexisting in a big city.\n\nThis is one of those places where you pay in advance and then they bring you your food.  You might want to study the menu ahead of time.  It's vast and you can feel rushed trying to decide what to get at the counter with a steady line of folks behind you.\n\nI went with the croissant french toast, a couple of scrambled eggs and a glass of apple juice.  The juice seemed natural with that darker, cloudier look rather than that pretty almost clear stuff you get in a bottle at Safeway.  Eggs cooked to perfection, though I could have used some shredded cheese on top.  French toast was a couple of big croissants sliced in two and cooked in the classic batter.  All very good.  It's not too cheap but you can get what you need with less than $20 in your pocket.\n\nI'd definitely come back here and try some other stuff on the menu.  Friendly service and a definite neighborhood feel.  Plenty of tv's tuned to NFL pre-game show too, so that's always a plus.", "rating": 4, "date": "2010-10-19"}, {"excerpts": ["Huge amazing delicious menu full of scrumptious options from omelets and scrambles to all types of sandwiches and salads, croissant French Toast and peanut butter and banana bagel.\n\n"], "author": "Uriah B.", "review": "This place is indeed, As good as it gets! Huge amazing delicious menu full of scrumptious options from omelets and scrambles to all types of sandwiches and salads, croissant French Toast and peanut butter and banana bagel.\n\nThe portions are generous and everything is properly made. The sandwiches are loaded with meat and fixings (nothing worse the a skimpy sandwich) as is everything else. They have great coffee, drinks and amazing looking pastries and snacks. \n\nThis is a perfect place for a great breakfast or lunch with friends and everything is reasonably priced (nothing over $10)", "rating": 5, "date": "2011-08-07"}, {"excerpts": ["My favorite is the croissant french toast. ", "Yes, you read that right. "], "author": "Jenny J.", "review": "I really like this place. It may be that it's so close to my house, but I absolutely love it. The food isn't going to knock your socks off, but it's pretty good. My favorite is the croissant french toast. Yes, you read that right. I'll give you a second to ponder and recover.\n\nEven though this place is usually pretty crowded, wait it out and be like a panther - You can find a spot.", "rating": 4, "date": "2012-04-02"}, {"excerpts": ["I had a bite of my friend's croissant french toast and if I was walking 50 miles a week ", "like she does I would have eaten the entire plate! ", "The food here is solid. ", "Great atmosphere...especially on a 420 weekend!"], "author": "Sherie R.", "review": "Nothing to be upset about here. The staff is friendly and very kind. We had breakfast here this morning on the patio...with doggies too and it was super fun! I had the Scott Street Omelette----pretty darn good and huge. I had a bite of my friend's croissant french toast and if I was walking 50 miles a week like she does I would have eaten the entire plate! The food here is solid. Great atmosphere...especially on a 420 weekend!", "rating": 4, "date": "2013-04-21"}, {"excerpts": ["I fell in love with their croissant french toast. ", "Adding fresh strawberries to it made it really delicious. "], "author": "John S.", "review": "First time experience.\n\nThis is my favorite breakfast spot to eat at when I'm staying at the Metro Hotel.\nMy girlfriend and I visited this place a few times during our stay in San Francisco.\nI fell in love with their croissant french toast. Adding fresh strawberries to it made it really delicious. I chose to get their homestyle fries instead of the hash browns. The homestyle fries were decent.\nI also went with their lattes. Coffee is made fairly quick, before your food is brought out to you. Food is made fairly quickly and brought out to you by friendly staff.\nOverall the staff is friendly and are quick to serve you.\nThe atmosphere is somewhat quiet to average noise levels.\nThe place also has large windows which brings in great ambient light.\nIt's a great place to sit down and eat so you can enjoy your morning.\nThere is free wi-fi but limited on the weekends.\nThis place is very convenient if you're staying at the Metro Hotel. Just a short walk away.\nPrices are fair for what you receive.\n\nThe Grind Cafe is our favorite new place for breakfast.\nBut will also continue to come back to try their lunch menu.", "rating": 4, "date": "2013-08-26"}, {"excerpts": ["Cinnamon and nutmeg and vanilla drenched croissant French toast!  ", "To die for.  ", "Sat next to some really annoying kids though, one of the girls was such a down-and-out aspiring actress who couldn't get a break (boo-hoo).  ", "The trio made repeated loud pronouncements about the merits or demerits of LA vs San Francisco and Franklin Village and...argh...ruined my digestion.  ", "But that's not The Grind Cafe's fault is it?  ", "Moral of the story: order that f'in croissant french toast...now."], "author": "Delan B.", "review": "Cinnamon and nutmeg and vanilla drenched croissant French toast!  To die for.  Sat next to some really annoying kids though, one of the girls was such a down-and-out aspiring actress who couldn't get a break (boo-hoo).  The trio made repeated loud pronouncements about the merits or demerits of LA vs San Francisco and Franklin Village and...argh...ruined my digestion.  But that's not The Grind Cafe's fault is it?  Moral of the story: order that f'in croissant french toast...now.", "rating": 4, "date": "2013-02-18"}, {"excerpts": ["Croissant French toast and breakfast burritos rock. ", "The cooks are rad too!!"], "author": "Gabriel N.", "review": "Valicia and Ashley rock. Croissant French toast and breakfast burritos rock. The cooks are rad too!!", "rating": 5, "date": "2013-01-22"}, {"excerpts": ["It has a standard brunch menu that includes croissant french toast.  ", "Lots of people sit in the outdoor area with there ", "dogs ", "so I like taking my golden retriever here for brunches.  ", "Sometimes the food comes out a little slowly or they mess up your order a little or the line is a little long but nothing too dramatic has ever happened to me.  ", "Good standard brunch place."], "author": "barbara b.", "review": "This is my go-to local brunch place.  It has a standard brunch menu that includes croissant french toast.  Lots of people sit in the outdoor area with there dogs so I like taking my golden retriever here for brunches.  Sometimes the food comes out a little slowly or they mess up your order a little or the line is a little long but nothing too dramatic has ever happened to me.  Good standard brunch place.", "rating": 4, "date": "2011-01-03"}], "granola with fresh fruit and yogurt": [], "cream cheese sprouts tomato  red onion": [], "peanut butter  banana": [], "tuna sprouts tomato  red onion": [], "lox cream cheese tomato red onion  capers": [], "hummus avocado tomato sprouts  red onion": [], "hummus only": [], "turkey mustard mayo lettuce tomato": [], "cucumber avocado tomato red onion sprouts  cream cheese": [], "chicken salad sprouts tomato  red onion": [], "classic beef burger": [], "french burger": [{"excerpts": ["The French burger with skinny fries lightly toasted on a French bread.......yum!!! ", "Pair that with a sweet chai latte ", "and I'm then ready for my post grind nap....", "best burger eva!!!"], "author": "Kirsty E.", "review": "Aaaaaah the grind, one of my favorite neighborhood haunts. The French burger with skinny fries lightly toasted on a French bread.......yum!!! Pair that with a sweet chai latte and I'm then ready for my post grind nap....best burger eva!!!", "rating": 5, "date": "2010-06-21"}, {"excerpts": ["I ordered the French Burger with fries and found it to be okay ", "but nothing noteworthy.  ", "The french fries were decent ", "but I think it was a poor choice to order this variation of a hamburger as the addition of french bread makes for a heavier meal.  ", "I couldn't finish the other half of my sandwich.\n", "My friends who brought me here both days highly endorse the French Dip as being the best in the city.  ", "I'll have to give this place another go-round and find out if that's true."], "author": "Jill D.", "review": "This was a tough weekend.  By \"tough\" I mean mostly sleepless.  I did every debaucherous thing I possibly could and took bodily abuse to new levels.  It was fabulous!  At several points, however, I realized that my body needed nourishment.  As different groups of friends suggested eating here, I had the opportunity to dine two days in a row.  Day one saw me and a hot Austrian trying to force our e-xhausted bodies to consume nourishment.  He managed an orange banana smoothie while I was able to choke down the Pear Salad and some coffee.  I have to say that this was a super tasty salad and largely proportioned with a generous side of fresh sourdough.  Best of all, I survived to roll on to the Polk Street Fair!\nDay two saw me roll in after a terribly strung out night after the Polk Street Festival which saw me greet the day at 7:30am before calling it a night.  I ordered the French Burger with fries and found it to be okay but nothing noteworthy.  The french fries were decent but I think it was a poor choice to order this variation of a hamburger as the addition of french bread makes for a heavier meal.  I couldn't finish the other half of my sandwich.\nMy friends who brought me here both days highly endorse the French Dip as being the best in the city.  I'll have to give this place another go-round and find out if that's true.", "rating": 4, "date": "2007-09-16"}], "bbq bacon burger": [{"excerpts": ["I had the BBQ Bacon Burger and it was OK and not very big.  ", "My wife had the Turkey Burger and I would say the same thing.  ", "Neither were very juicy or had great flavor either.  ", "I got mine with the Garlic Fries, while my wife had the Spicy Curly Fries.  ", "I think the Spicy Curly Fries are much better.  ", "The Garlic Fries are small, matchstick fries which aren't bad, just nothing very special.  "], "author": "Scott L.", "review": "My wife and I went here for lunch and I was torn as to what rating to give them.  Based solely on the food I would only give them a two or three star rating.  I had the BBQ Bacon Burger and it was OK and not very big.  My wife had the Turkey Burger and I would say the same thing.  Neither were very juicy or had great flavor either.  I got mine with the Garlic Fries, while my wife had the Spicy Curly Fries.  I think the Spicy Curly Fries are much better.  The Garlic Fries are small, matchstick fries which aren't bad, just nothing very special.  Because the fries are so small they don't do a very good job or holding the garlic seasoning.\n\nSo, why did I give them three stars?  The people who work here are all very nice and it was one of the few places in the area where you can sit outside.  I was great to sit outside on a nice day and eat with our dog.  All the deserts look wonderful too.", "rating": 3, "date": "2011-07-03"}], "chicken bacon avocado  cheddar": [], "bbq bacon chicken": [], "chicken strips  fries": [], "choice of cheese": [], "grilled onion": [], "house green": [], "pear salad": [{"excerpts": ["I'd recommend the pear salad. \n", "Fries are separate from the burger. ", "I was disappointed with the fry portion. ", "I ate them in probably two bites :( .\n", "They have wifi here. \n", "Nice spot. ", "I've had luck with parking here.\n", "I would recommend it. ", "It's a bit pricey though. ", "$12 for a sandwich. ", "$12 for a salad"], "author": "Kevin S.", "review": "The food here is pretty tasty. Everything has great flavor. I had the chicken pesto sandwich and really liked it. Their salads are good too. I'd recommend the pear salad. \nFries are separate from the burger. I was disappointed with the fry portion. I ate them in probably two bites :( .\nThey have wifi here. \nNice spot. I've had luck with parking here.\nI would recommend it. It's a bit pricey though. $12 for a sandwich. $12 for a salad", "rating": 4, "date": "2017-04-19"}, {"excerpts": ["There was a LIVE cockroach, having a field day in the pear salad. ", "Do order in nor to go. ", "This place doesn't deserve people's hard earned money."], "author": "Connie C.", "review": "This place is disgusting! There was a LIVE cockroach, having a field day in the pear salad. Do order in nor to go. This place doesn't deserve people's hard earned money.", "rating": 1, "date": "2017-07-19"}, {"excerpts": ["I order a pear salad, honey mustard dressing on side. "], "author": "Karley A.", "review": "Wow. What a joke this place is. Stood in line for 40 minutes. Right when we got to the front, one register broke. How convenient. Now we wait longer because only one person manning the second register. At this point we decided to just get the food to go. I order a pear salad, honey mustard dressing on side. Husband orders veggie melt. More waiting. I see our take out food just sitting on the counter and wait some more. No one gave it us until I asked. Phew, get me out of here already. Go to the car. Open up the food...salad, no honey mustard dressing. Veggie melt...let's just say it looked worse than jail food. They wouldn't even serve this at the fyre festival. The cheese came out of a cheese wiz can. Biggest joke of a place and waste of money. Oh, bring blue bottle to the lower haight :)", "rating": 1, "date": "2017-04-29"}, {"excerpts": ["(though I usually end up with a scram), the pear salad with tuna, the eggplant sandwich, the Reuben. "], "author": "Shahrzad K.", "review": "How I haven't written a review yet is beyond me.  The Grind has been my reliable, go-to spot for the last 5 years since moving to SF (it certainly helps practically living upstairs).  When I was working, I'd stop in more frequently for coffee on my way out. It's usually the first meal I eat after returning from any vacation and not having food in the fridge.  I even find myself coming here after I've gone grocery shopping and unpacked the massive load of food (in efforts to reduce my eating out habits) and not having the energy to cook. \n\nFaves on the menu --  all breakfast items (though I usually end up with a scram), the pear salad with tuna, the eggplant sandwich, the Reuben. One roommate loves the bfast burritos. \n\nLines can get a bit long on the weekends, but if you order to go or just want a quick coffee/drink, they now have a 2nd register closer to the kitchen where you can bypass the line.", "rating": 5, "date": "2014-05-15"}, {"excerpts": ["Sure the chicken-pesto sandwich and the pear salad are spectacular.  ", "The coffee is good, the choice of chai options is refreshing.\n"], "author": "Ravena F.", "review": "Sure the chicken-pesto sandwich and the pear salad are spectacular.  The coffee is good, the choice of chai options is refreshing.\nBut the real prize here are the staff.\n\nBecause of its close proximity to the hospital, we bring rehab patients here on a regular basis to practice speech, swallowing, calculation, walking with a cane, wheelchair mobility . . . and much more.  Rather than being impatient, awkward or otherwise inappropriate, the staff here are pleasant, normal and manage to do their part to make every interaction as seamless as possible.  They act like it's the most natural thing in the world to watch someone write down their order or point to it on the paper menu simply because the person can't verbalize the order. \n\nNow, perhaps your thinking c'mon, who would be rude to someone with obvious speech difficulties?  Or mobility issues?  Or pragmatics and weird eye movement problems?  Sadly, the answer is: plenty of people!  You might be amazed to observe how completely wrapped up in their own days people can be to ignore or even despise the struggles of a fellow human.  Fortunately, those people do not work at The Grind.  Instead, this has become the perfect trial run destination for our patients tentatively emerging from the protective environment of the hospital.\n\nThanks for that people.  And thanks for the fresh, healthy food - a divinity inspired meal for someone who's been eating hospital food for weeks on end.  And a better-than-average breakfast/lunch for the rest of us.", "rating": 4, "date": "2010-01-22"}, {"excerpts": ["The staff are very friendly, the salads are excellent (try the pear salad with cranberries and blue cheese!).\n\n"], "author": "Corey C.", "review": "Finally went to The Grind Cafe for a day of work, and I was happy!  The staff are very friendly, the salads are excellent (try the pear salad with cranberries and blue cheese!).\n\nIt straddles the line between cafe and restaurant pretty well.  The wifi is kind of sketchy, but there are a few outlets you can nab for your laptop.", "rating": 4, "date": "2009-03-05"}, {"excerpts": ["He managed an orange banana smoothie while I was able to choke down the Pear Salad and some coffee.  ", "I have to say that this was a super tasty salad and largely proportioned with a generous side of fresh sourdough.  ", "Best of all, I survived to roll on to the Polk Street Fair!\n", "Day two saw me roll in after a terribly strung out night after the Polk Street Festival which saw me greet the day at 7:30am before calling it a night.  "], "author": "Jill D.", "review": "This was a tough weekend.  By \"tough\" I mean mostly sleepless.  I did every debaucherous thing I possibly could and took bodily abuse to new levels.  It was fabulous!  At several points, however, I realized that my body needed nourishment.  As different groups of friends suggested eating here, I had the opportunity to dine two days in a row.  Day one saw me and a hot Austrian trying to force our e-xhausted bodies to consume nourishment.  He managed an orange banana smoothie while I was able to choke down the Pear Salad and some coffee.  I have to say that this was a super tasty salad and largely proportioned with a generous side of fresh sourdough.  Best of all, I survived to roll on to the Polk Street Fair!\nDay two saw me roll in after a terribly strung out night after the Polk Street Festival which saw me greet the day at 7:30am before calling it a night.  I ordered the French Burger with fries and found it to be okay but nothing noteworthy.  The french fries were decent but I think it was a poor choice to order this variation of a hamburger as the addition of french bread makes for a heavier meal.  I couldn't finish the other half of my sandwich.\nMy friends who brought me here both days highly endorse the French Dip as being the best in the city.  I'll have to give this place another go-round and find out if that's true.", "rating": 4, "date": "2007-09-16"}, {"excerpts": ["my favorites are the pear salad or the veggie (kind of a redundant name ", "but you know..", ") salad. "], "author": "gina s.", "review": "i see that most people who have reviewed the grind talk about the coffee and breakfasts but i'm here to tell all of you that the salads are amazing.\n\nseriously, unless you go to a sit down place, i think it is hard to find a reseasonably priced salads that use super fresh ingrediants. look no more, the grind has come to the rescue. my favorites are the pear salad or the veggie (kind of a redundant name but you know..) salad. and of course i add grilled chicken which is always tender and cooked to order.\n\non top of this, i've found the staff to be outgoing and friendly. thank you, the grind!", "rating": 4, "date": "2008-04-18"}, {"excerpts": ["The food is solid and I especially enjoy the Pear Salad when I want to feel a little healthier than I normally am. ", "This is the spot that I enjoy thoroughly because it is so close to my house. ", "There are certainly better spots for breakfast in the city but The Grind holds a special place in my heart."], "author": "N S.", "review": "This place is reliable. I love the chicks who work there. They are cute and funny. The food is solid and I especially enjoy the Pear Salad when I want to feel a little healthier than I normally am. This is the spot that I enjoy thoroughly because it is so close to my house. There are certainly better spots for breakfast in the city but The Grind holds a special place in my heart.", "rating": 3, "date": "2008-07-07"}], "honey baked ham": [], "beef or chicken cheese steak": [], "blta": [{"excerpts": ["I had the BLTA on toasted sourdough with fries which really hit the spot. ", "The food was great and the employees we're very friendly. ", "I checked out the food that other people had sitting around us. ", "It all looked very appetizing;  burgers, salads, bagels, breakfast, gormet coffees, teas. ", "I have no idea why anybody would give this place less than 3 stars even if they were having a bad day."], "author": "Donna P.", "review": "We were looking for a place to eat near CPMC (hospital). We were pleasantly surprised with this place. My aunt had the Scott Street Omlett and they did not skimp on the filling. My mom had a Belgium waffel with strawberries/bananas drizzled with Nutella which was presented beautifully. I had the BLTA on toasted sourdough with fries which really hit the spot. The food was great and the employees we're very friendly. I checked out the food that other people had sitting around us. It all looked very appetizing;  burgers, salads, bagels, breakfast, gormet coffees, teas. I have no idea why anybody would give this place less than 3 stars even if they were having a bad day.", "rating": 5, "date": "2018-06-13"}, {"excerpts": ["Wow had a BLTA on sourdough yummy! ", "The fries are incredible. ", "Courteous staff and clean restaurant."], "author": "Jill L.", "review": "Wow had a BLTA on sourdough yummy! The fries are incredible. Courteous staff and clean restaurant.", "rating": 5, "date": "2018-02-21"}, {"excerpts": ["The staff are uniformly friendly and welcoming, the food is great - try the BLTA - and filling, and the coffee, chai, and the spiced cider are just wonderful and inexpensive!\n\n"], "author": "Michael S.", "review": "Lower Haight. A great neighborhood, and a great café.\n\nThe staff are uniformly friendly and welcoming, the food is great - try the BLTA - and filling, and the coffee, chai, and the spiced cider are just wonderful and inexpensive!\n\nPlentiful and fast Wi-Fi.\n\nThe only downside is it's on the wrong side of the street, so it never gets warmed by the sunlight. I guess this is a plus on sweltering days, but somewhat daunting on those frosty ones. Or don't be dumb (like I am) and stop sitting outside. But I like sitting outside, watching the parade of humanity march by...", "rating": 4, "date": "2009-11-12"}, {"excerpts": ["I always get the BLTA (a basic blt with avavado) on a bageutte...with a side salad...", "mmm....mmmm...mmmm...", "So...if you eat at the Grind and want something safe and DELICIOUS get the BLTA sandwich!!"], "author": "Keila E.", "review": "I know people have had some not so great expieriences at this place.\nHowever, EVERYTIME i have eaten here its been great!\n\nI always get the BLTA (a basic blt with avavado) on a bageutte...with a side salad...mmm....mmmm...mmmm...its so good!!\n\nAnd the iced tea is refreshing and a good size! \n\nSo...if you eat at the Grind and want something safe and DELICIOUS get the BLTA sandwich!!", "rating": 4, "date": "2007-11-05"}, {"excerpts": ["The BLTA. \n", "BLTA = ", "$8.25? "], "author": "Ayy C.", "review": "I've been going here for years. Why? The BLTA. \nSadly, I've watched the price of this beautiful sandwich (work-of-art) rise drastically over the years. \n\nBLTA = $8.25? Ouch! \n\nBut I just love it. Gotta spoil myself once in a while.", "rating": 4, "date": "2008-11-07"}, {"excerpts": ["and that i can always take two butters from the counter and no one cares. \nand that i always order the same three things and i love them.\nthe chicken ceaser, the breakfast sandwich, and the blta. ", "i mean. ", "its just gorgeous. \n", "i'll be seeing you on my mondays off. ", "i;ll be the super hungover one on the OUTDOOR patio smoking and eating hella greasy eggs, looking over at the wak and being completely content that i dont have to go there anymore ", "but i can come to the grind any ol' time."], "author": "Gabrielle k.", "review": "oh you, you little gem you. i never would have found you if it werent for my loooong days at the wak shack. you have fed me, nourished me, given me an excuse to leave work for twenty minutes and mostly just made my day too many times to count.\ni love andrea. \ni like the boy with the blue eyes. \nand that i can always take two butters from the counter and no one cares. \nand that i always order the same three things and i love them.\nthe chicken ceaser, the breakfast sandwich, and the blta. i mean. its just gorgeous. \ni'll be seeing you on my mondays off. i;ll be the super hungover one on the OUTDOOR patio smoking and eating hella greasy eggs, looking over at the wak and being completely content that i dont have to go there anymore but i can come to the grind any ol' time.", "rating": 5, "date": "2008-06-09"}], "veggie melt": [{"excerpts": ["Husband orders veggie melt. ", "More waiting. ", "I see our take out food just sitting on the counter and wait some more. ", "No one gave it us until I asked. ", "Phew, get me out of here already. ", "Go to the car. ", "Open up the food...", "salad, no honey mustard dressing. ", "Veggie melt", "...let's just say it looked worse than jail food. ", "They wouldn't even serve this at the fyre festival. ", "The cheese came out of a cheese wiz can. ", "Biggest joke of a place and waste of money. "], "author": "Karley A.", "review": "Wow. What a joke this place is. Stood in line for 40 minutes. Right when we got to the front, one register broke. How convenient. Now we wait longer because only one person manning the second register. At this point we decided to just get the food to go. I order a pear salad, honey mustard dressing on side. Husband orders veggie melt. More waiting. I see our take out food just sitting on the counter and wait some more. No one gave it us until I asked. Phew, get me out of here already. Go to the car. Open up the food...salad, no honey mustard dressing. Veggie melt...let's just say it looked worse than jail food. They wouldn't even serve this at the fyre festival. The cheese came out of a cheese wiz can. Biggest joke of a place and waste of money. Oh, bring blue bottle to the lower haight :)", "rating": 1, "date": "2017-04-29"}], "portabella mushroom": [], "ham  cheddar": [], "turkey bacon  swiss": [], "cup of soup or chili": [], "bowl of soup or chili": [], "silver dollar pancakes": [], "peanut butter  jelly": [], "house blend": [{"excerpts": ["House blend Coffee was so good and the price was very reasonable.\n\n"], "author": "JC M.", "review": "Delicious, worth the price!\n\nHouse blend Coffee was so good and the price was very reasonable.\n\nHad Acropolis omelette with home fries and sourdough. Highly recommended for any vegetarian. \n\nHubby had breakfast sandwich with bacon and eggs and French fries and said it was delicious.\n\nOur friend had steak and eggs and was also delicious according to him.\n\nWill be coming back for sure!!!", "rating": 5, "date": "2016-11-02"}], "white choc mocha": [], "caramel latte": [{"excerpts": ["The coffee is fantastic, and the caramel latte deserves 5 stars. ", "Unfortunately, I had two bad experiences with the service here ", "5 star visit my first time when I had a caramel latte and the Haight scramble with bacon, avocado, and green onions; both were delicious. \n\n"], "author": "Meg R.", "review": "While in SF, I stayed right around the corner from this little café. Due to its convenient location, I visited a handful of times. The coffee is fantastic, and the caramel latte deserves 5 stars. Unfortunately, I had two bad experiences with the service here so I have to say it's a 3 star spot. \n\n5 star visit my first time when I had a caramel latte and the Haight scramble with bacon, avocado, and green onions; both were delicious. \n\n1 star visit the next time I came when I ordered an egg and cheese sandwich on an English muffin, was given an egg and cheese sandwich on a croissant, and the staff would not revise my order for some reason when I asked. I ended up scraping off the egg and cheese because I hate croissants and confrontation. \n\n2 stars on the third visit because I ordered a bagel with cream cheese to go and ended up waiting 15 minutes for it.", "rating": 3, "date": "2015-03-01"}, {"excerpts": ["But to provide my yummy bagel with company, I usually pair it with a caramel latte.  ", "OMFG.  ", "I'll say it again: ", "OMFG!!!!!  ", "BEST CARAMEL LATTE EVER!!!!!!!!!  ", "Starbucks, who?  ", "Coffee Bean, what?!  ", "No longer.  ", "It is ALL about the caramel latte.  ", "It's nice and sweet, but not too sweet.  ", "Very creamy.  ", "Sure my stomach is rumbling an hour after I finish it, but chalk that up to my lactose intolerance.  ", "Yes.  ", "I will suffer the effects of bloating and stomach gurgling to indulge in this latte.  ", "Soooo worth it.  ", "But one day I switched it up and ordered their mango smoothie.  ", "I just KNEW ", "it was gonna be good since it took them, like, 5 minutes to make.  ", "And there's nothing more annoying then getting a smoothie that melts while it's in your hands or you can drink in its entirety in 3 minutes.  ", "My first suck from the straw produced a frown and various veins bulging from my forehead.  ", "This smoothie was THICK and JUICY and SWEET and good!  ", "I'm big on drink-to-food ratio ", "so this accompanied my bagel perfectly.  ", "I don't know why I've never had lunch there.  ", "I mean I actually go during lunch and just opt for my bagel.  ", "But if it's any consolation, I've gone with friends who have the audacity to order lunch during lunchtime and it always looks scrumptious.  ", "I feel like I should give 5 stars alone for just the damn bagel, latte, and smoothie.  ", "I mean if a restaurant is making me convulse with those random things then how much more for an actual meal?!  ", "Contrary to other yelpers, I've never had a run in with a snooty cashier or anything like that, thank God.  ", "I'm not one to hold my tongue if someone is giving me attitude for no damn reason.  ", "The service has always been great, albeit a tad slow.  ", "But other than that, I love this place.  ", "It also seems like a great neighborhood hangout with locals."], "author": "Andrea B.", "review": "So I ALMOST gave this place 5 stars because they have the BEST peanut butter and banana bagel in the entire universe.  Seriously.  That's what I get every time I go there.  A damn peanut butter and banana bagel.  On a wheat bagel.  Or when they're out of wheat bagels, then a cinnamon one.  They toast the bagel, glob HUGE amounts of peanut butter on that bad boy, and then place thinly sliced bananas on there.  Yes, people.  It's a work of art!  Actually I don't care how it looks just as long as it makes the happy place in my tummy dance.  And that it does, every time!  But to provide my yummy bagel with company, I usually pair it with a caramel latte.  OMFG.  I'll say it again: OMFG!!!!!  BEST CARAMEL LATTE EVER!!!!!!!!!  Starbucks, who?  Coffee Bean, what?!  No longer.  It is ALL about the caramel latte.  It's nice and sweet, but not too sweet.  Very creamy.  Sure my stomach is rumbling an hour after I finish it, but chalk that up to my lactose intolerance.  Yes.  I will suffer the effects of bloating and stomach gurgling to indulge in this latte.  Soooo worth it.  But one day I switched it up and ordered their mango smoothie.  I just KNEW it was gonna be good since it took them, like, 5 minutes to make.  And there's nothing more annoying then getting a smoothie that melts while it's in your hands or you can drink in its entirety in 3 minutes.  My first suck from the straw produced a frown and various veins bulging from my forehead.  This smoothie was THICK and JUICY and SWEET and good!  I'm big on drink-to-food ratio so this accompanied my bagel perfectly.  I don't know why I've never had lunch there.  I mean I actually go during lunch and just opt for my bagel.  But if it's any consolation, I've gone with friends who have the audacity to order lunch during lunchtime and it always looks scrumptious.  I feel like I should give 5 stars alone for just the damn bagel, latte, and smoothie.  I mean if a restaurant is making me convulse with those random things then how much more for an actual meal?!  Contrary to other yelpers, I've never had a run in with a snooty cashier or anything like that, thank God.  I'm not one to hold my tongue if someone is giving me attitude for no damn reason.  The service has always been great, albeit a tad slow.  But other than that, I love this place.  It also seems like a great neighborhood hangout with locals.", "rating": 4, "date": "2012-04-24"}], "iced": [{"excerpts": ["I just stopped here for a quick bite of a pastry and some iced tea. ", "The ginger peach iced tea was especially refreshing, and I had free refills too. ", "I had a good couple of pastries: a raspberry bar and a lemon cake. "], "author": "Molly M.", "review": "I just stopped here for a quick bite of a pastry and some iced tea. The ginger peach iced tea was especially refreshing, and I had free refills too. I had a good couple of pastries: a raspberry bar and a lemon cake. I can't vouch for any of their other food, but what I tried was pretty good. \n\nI also like the vibe of the place. It was very open, with lots of light, and it had almost a cafeteria feel. There were several people there working on their laptops or having coffee in the mid-afternoon.", "rating": 4, "date": "2016-03-24"}, {"excerpts": ["Iced coffee and regular coffee- not bad! ", "However if you want whipped cream they do not have the proper lids for them!"], "author": "Rox N.", "review": "My new favorite spot for lunch! They have a little bit of everything for everyone. I've been here now a handful of times. You have the option to sit inside or outside patio which is great. Service is awesome always quick. \n\n\nCobb salad- generous portion and taste amazing! (However ask for the dressing on the side)\n\nChinese chicken salad- two thumbs up! \n\nChicken Ceasar- good but a bit over dressed. \n\nPatty melt- delish \n\nGarlic fries- they're ok, nothing like the ball park. \n\nBlueberry crumb cake- fresh and to die for.\n\nSmoothies- Meh, a tab bit over priced. \n\nIced coffee and regular coffee- not bad! However if you want whipped cream they do not have the proper lids for them!", "rating": 4, "date": "2016-04-29"}, {"excerpts": ["However I was disappointed with the iced coffee when I ordered it; it didn't seem very fresh.\n\n"], "author": "Daniel P.", "review": "I come here once a week or so for breakfast and coffee when I work from home.\n\nThe espresso drinks are pretty good here, as is their hot drop coffee. However I was disappointed with the iced coffee when I ordered it; it didn't seem very fresh.\n\nThe food can be pretty hit or miss. I am a huge fan of eggs benedict, and theirs is certainly passable, albeit not spectacular. They poach eggs pretty well, but their hollandaise sauce is sometimes on the tangy side for me, and they don't use very much. Their Denver omelet is quite good!\n\nThe staff are always down to earth and friendly.", "rating": 3, "date": "2014-05-14"}, {"excerpts": ["I went here today and got an iced coffee.  ", "I ordered a large and I thought it was on the small side.  ", "But for $2 I thought it was a fair price (and the cup was really cool).  ", "It was super delicious ", "and I want to go back already.  ", "Cool spot, stoners and SFPD officers sippin coffee together in peace and harmony.  ", "Haight Street... gotta love it."], "author": "Cynthia B.", "review": "I went here today and got an iced coffee.  I ordered a large and I thought it was on the small side.  But for $2 I thought it was a fair price (and the cup was really cool).  It was super delicious and I want to go back already.  Cool spot, stoners and SFPD officers sippin coffee together in peace and harmony.  Haight Street... gotta love it.", "rating": 5, "date": "2011-02-03"}, {"excerpts": ["Free and reliable wi-fi, well placed power outlets, breakfast and burgers, chili and smoothies, home made iced tea and lemonade and coffee make it even better.  "], "author": "Naeem N.", "review": "The Grind is my home office and favored Lower Haight eatery.  Good food, good pricing and a comfortable place make it a must for me everyday.  The staff is uber friendly and they are always smiling (Andrea and C-Sha and Smashly are da best).  \n\nFree and reliable wi-fi, well placed power outlets, breakfast and burgers, chili and smoothies, home made iced tea and lemonade and coffee make it even better.  Busiest times are lunchtime and weekend brunch (damn you Kaiser!)\n\nOpen until 8PM during the week.  Current new discovery has been the chili oddly enough.  Ole Reliable dish:  Grind Combo with French Toast (holla for the Challah) and home fries.", "rating": 4, "date": "2009-11-11"}, {"excerpts": ["Great iced tea.  ", "It is a good place to go for a quick bite, although the inside seats fill up with people on their computers who never leave..."], "author": "Chelsea S.", "review": "I love this place for lunch.  Great iced tea.  It is a good place to go for a quick bite, although the inside seats fill up with people on their computers who never leave...", "rating": 3, "date": "2011-07-28"}, {"excerpts": ["And the iced tea is refreshing and a good size! \n\n"], "author": "Keila E.", "review": "I know people have had some not so great expieriences at this place.\nHowever, EVERYTIME i have eaten here its been great!\n\nI always get the BLTA (a basic blt with avavado) on a bageutte...with a side salad...mmm....mmmm...mmmm...its so good!!\n\nAnd the iced tea is refreshing and a good size! \n\nSo...if you eat at the Grind and want something safe and DELICIOUS get the BLTA sandwich!!", "rating": 4, "date": "2007-11-05"}, {"excerpts": ["But, Im trying to think up the ways to fuck up an iced chai. ", "I ordered a large coffee, and my friend ordered an iced chai. ", "What she got was a HOT chai, with a shot of espresso. o.0 ", "Neither one of us noticed that she put the espresso in, but it was obviously hot. ", "\"", "Excuse me, she ordered an iced chai.", "\" ", "The nice girl says, \"No she didnt, she ordered a chai with a shot of espresso.", "\" ", "I was like...", "\"I ", "dont know how, but i think you heard her wrong.", "\" ", "Shes all snottily \"", "No, i didnt, but ill make another.", "\" ", "I was like \"Dude, she doesnt even drink coffee, and why would you put a shot of espress..", "urgh...fine.", "\" ", "She flipped her hair, and said \"Well, you wanna make sure she doesnt want espresso?", "\" ", "So i turn 3 degrees to the left. ", "She shakes her head no. ", "Turn back to girl. ", "\"", "No she doesnt.", "\" ", "Yikes. ", "Coffee girl rolls eyes and sighs like a teenager at family game night. ", "Sweet coffee girl, i can appreciate mishearing someone like anyone's bidness, and thats no big. ", "But dont make us feel like dicks. ", "If youre coming into my hood, check your tude at Lombard."], "author": "Mick F.", "review": "This place reminds me of a Southern Louisiana Victorian bordello. Really cool looking on the outside, unsavoriness on the inside. Coffee is average coffeeshop fare, baked goods are REALLY good. But, Im trying to think up the ways to fuck up an iced chai. I ordered a large coffee, and my friend ordered an iced chai. What she got was a HOT chai, with a shot of espresso. o.0 Neither one of us noticed that she put the espresso in, but it was obviously hot. \"Excuse me, she ordered an iced chai.\" The nice girl says, \"No she didnt, she ordered a chai with a shot of espresso.\" I was like...\"I dont know how, but i think you heard her wrong.\" Shes all snottily \"No, i didnt, but ill make another.\" I was like \"Dude, she doesnt even drink coffee, and why would you put a shot of espress..urgh...fine.\" She flipped her hair, and said \"Well, you wanna make sure she doesnt want espresso?\" So i turn 3 degrees to the left. She shakes her head no. Turn back to girl. \"No she doesnt.\" Yikes. Coffee girl rolls eyes and sighs like a teenager at family game night. Sweet coffee girl, i can appreciate mishearing someone like anyone's bidness, and thats no big. But dont make us feel like dicks. If youre coming into my hood, check your tude at Lombard.", "rating": 2, "date": "2005-07-07"}], "extra shot": [], "almond milk": [{"excerpts": ["However, you can find a tofu scramble, some hummus and bagel type offerings, as well as soy and almond milk on the menu. "], "author": "Jon T.", "review": "The Grind is a long-standing institution of Lower Haight. Even today, with the influx of some new businesses further east on Haight St, the Grind is still one of the only places that is reliable for all your coffee, tea, and breakfast needs. \n\nAs a vegan, there is unfortunately not a whole lot of options at your disposal. However, you can find a tofu scramble, some hummus and bagel type offerings, as well as soy and almond milk on the menu. I believe they also occasionally have some vegan baked good selections, although I didn't see any last time I was there.\n\nAlthough the vegan options aren't stellar, it's about on par with most of the rest of the neighborhood (or even SF, for that matter.) But I personally really appreciate that they have a large selection of teas. For some reason, it's rather difficult to find hot tea offerings in the area. Most of the cafes in the neighborhood tend to be very coffee centric. The Grind carries Mighty Leaf and have all of your staple varieties (plus a little more.)\n\nFinally, the Grind is a place you actually want to hang out at and spend a little bit of your morning and afternoon. The staff is friendly and they have a good amount of seating both indoors and out. If outdoors, you get the bonus of people/bike watching on Haight St.", "rating": 4, "date": "2018-01-01"}, {"excerpts": ["I am a daily soy/almond milk latte drinker and the final straw came when I ordered my usual large soy latte and was given a regular milk latte. ", "I wanted to make sure it was a soy latte since the super cool barista only said \"latte.", "\" ", "She said no its a regular latte and that I need to specify next time what it is ", "I want before it is made. ", "Oh really?? ", "(sarcasm) ", "And then she proceeded to charge me an extra 50 cents for a mistake they made, which is fine. ", "I just dont need barista hipster attitude especially since I am a regular. ", "If you love lots of morning tude and snooty high horse service, this is your place!"], "author": "Cai W.", "review": "I wish I could love this place since it is my neighborhood cafe (and I adore my neighborhood) but they are terribly rude, on several occasions. The Baristas for some reason think they are a gift to the world and act accordingly. I am a daily soy/almond milk latte drinker and the final straw came when I ordered my usual large soy latte and was given a regular milk latte. I wanted to make sure it was a soy latte since the super cool barista only said \"latte.\" She said no its a regular latte and that I need to specify next time what it is I want before it is made. Oh really?? (sarcasm) And then she proceeded to charge me an extra 50 cents for a mistake they made, which is fine. I just dont need barista hipster attitude especially since I am a regular. If you love lots of morning tude and snooty high horse service, this is your place!", "rating": 1, "date": "2016-01-27"}], "orange banana": [{"excerpts": ["He managed an orange banana smoothie while I was able to choke down the Pear Salad and some coffee.  ", "I have to say that this was a super tasty salad and largely proportioned with a generous side of fresh sourdough.  ", "Best of all, I survived to roll on to the Polk Street Fair!\n", "Day two saw me roll in after a terribly strung out night after the Polk Street Festival which saw me greet the day at 7:30am before calling it a night.  "], "author": "Jill D.", "review": "This was a tough weekend.  By \"tough\" I mean mostly sleepless.  I did every debaucherous thing I possibly could and took bodily abuse to new levels.  It was fabulous!  At several points, however, I realized that my body needed nourishment.  As different groups of friends suggested eating here, I had the opportunity to dine two days in a row.  Day one saw me and a hot Austrian trying to force our e-xhausted bodies to consume nourishment.  He managed an orange banana smoothie while I was able to choke down the Pear Salad and some coffee.  I have to say that this was a super tasty salad and largely proportioned with a generous side of fresh sourdough.  Best of all, I survived to roll on to the Polk Street Fair!\nDay two saw me roll in after a terribly strung out night after the Polk Street Festival which saw me greet the day at 7:30am before calling it a night.  I ordered the French Burger with fries and found it to be okay but nothing noteworthy.  The french fries were decent but I think it was a poor choice to order this variation of a hamburger as the addition of french bread makes for a heavier meal.  I couldn't finish the other half of my sandwich.\nMy friends who brought me here both days highly endorse the French Dip as being the best in the city.  I'll have to give this place another go-round and find out if that's true.", "rating": 4, "date": "2007-09-16"}], "pineapple coconut": [{"excerpts": ["I've also gotten the Mocha Smoothie and Pineapple Coconut Smoothie and they're both really yummy. ", "I think they are pretty pricey for the size of the cup. ", "I wish they had bigger cups because I slurp them down so quickly!!"], "author": "Carmina D.", "review": "I usually like to order Chicken Fried Steak or the Asian Chicken Salad. Both are very good and satisfying. \n\nAsian Chicken Salad has shredded chicken and mandarin oranges in them. Dressing is usually mixed in which I appreciate. \n\nChicken Fried Steak is really filling and yummy. \n\nI've also gotten the Mocha Smoothie and Pineapple Coconut Smoothie and they're both really yummy. I think they are pretty pricey for the size of the cup. I wish they had bigger cups because I slurp them down so quickly!!", "rating": 4, "date": "2017-10-14"}, {"excerpts": ["The Pineapple Coconut smoothie here is amazing. "], "author": "Maximilian R.", "review": "The Pineapple Coconut smoothie here is amazing. I was super refreshed after having one, \n\nThe Sicilian Omelette is really good too. Now how come I didn't give this review more stars...\n\nBecause I found a small 'screw' in my smoothie. I couldn't believe it, tasted great, but finding the screw inside was troublesome. \n\nI would recommend anybody to try a smoothie here, just beware. You've been warned.", "rating": 3, "date": "2013-01-25"}], "jungle juice": [{"excerpts": ["I've also had the jungle juice smoothie, which is a solid green but has a fruity-banana flavor - it's excellent. \n\n"], "author": "Mike H.", "review": "Let's start with the premise that you want some good food close by in the Lower Haight - lunch, brunch, or an early dinner - or just a coffee, tea, or smoothie. This is a place that does all of them well, in a neighborhood where most people want them sometimes, and sometimes many people want them at the same time. The result is: not enough space during peak times. Just remember that all the tables close together, inside and out, are necessary. You'll appreciate them more if you have to wait. In general though, people don't dawdle too much after they've finished and it's really busy. \n\nJust so you know: Order at the register, go up your drinks from the counter, and eventually bus your table...*but* you'll have food brought to the table thanks to the little numbered sign. \n\nTheir breakfast burrito is big and darn good. Really enjoyed the omelette too. Good-sized portions for all plates, whether or not you're hung over. Good coffee and DIY water. OJ was fine. I've also had the jungle juice smoothie, which is a solid green but has a fruity-banana flavor - it's excellent. \n\nIf you need wireless, be warned that it can be slow with several users at once. Just play nicely (be considerate of your usage) and everyone should get along fine.", "rating": 4, "date": "2012-02-09"}], "black swan": []}