{"full english breakfast": [{"excerpts": ["And, if you want one helluva good Bloody Mary that doesn't break the bank-- head over on Sunday around brunch time, get yourself a full English Breakfast and a Bloody.  ", "You won't be disappointed.   ", "If you're out in the evening-- get the jalapenos poppers-- ", "this place is one of the few bars I've been to in the city that actually does them right."], "author": "Ami L.", "review": "This is definitely my favorite laid-back, neighborhood niche.  The beer is good (and happy hour is probably the best I've seen in the city $$-wise), it's a typical pub, so don't expect to go in minks and heels, in the very least you'll get a crooked eye, and at worst the patrons might just toss you out for being ridiculous. :)  That said, the atmosphere is friendly/ jibe-humor.  Trivia night is a can't miss.  And, if you want one helluva good Bloody Mary that doesn't break the bank-- head over on Sunday around brunch time, get yourself a full English Breakfast and a Bloody.  You won't be disappointed.   If you're out in the evening-- get the jalapenos poppers-- this place is one of the few bars I've been to in the city that actually does them right.", "rating": 4, "date": "2012-07-27"}, {"excerpts": ["Lots of pub food including full English Breakfast, Steak and Ale pie (with beans and chips...so authentic!!)"], "author": "Sarah F.", "review": "I absolutely love this place. After moving to SF three years ago from the UK, I was searching for ages for a decent pub that had nice pub food and good atmosphere. I found exactly this in the Pig and Whistle. They have a lovely selection of British/Irish/European beers -- including Old Speckled Hen ale (yum yum). Lots of pub food including full English Breakfast, Steak and Ale pie (with beans and chips...so authentic!!), Fish and Chips (the best I've had in SF) and bar snacks like curry chips and breaded mushrooms. And well stocked in HP sauce and British malt vinegar (yum yum).\n\nAlso, the atmosphere is really great. Lots of regulars go, it has a pool table and darts, and there are often themed nights that quiz night (lots of fun...pretty challenging questions!) and things like that. The dukebox has loads of British classics...The Beatles, Oasis, Blur, Maniacs, Pulp, you name it....\n\nBasically, it's a top home-from-home for expats, and a little British experience for Americans! I've spent many a happy hour reminiscing with Brits about nights out in Sheffield as well as sharing tips like where to find orange squash in the Bay Area. As us Yorkshire lasses say \"It's really brilliant!!!\"", "rating": 5, "date": "2009-12-31"}], "fish and chips": [{"excerpts": ["Great English style pub, home cooked food with the usual suspects, Fish and Chips, steak and Ale pie (which I had and was delicious), cottage Pie etc.\n\n"], "author": "Justin R.", "review": "Great English style pub, home cooked food with the usual suspects, Fish and Chips, steak and Ale pie (which I had and was delicious), cottage Pie etc.\n\nSeveral pints of Boddington's were consumed, and to 'tap' the evening off my friends and I joined in on the trivia night that os held every Sunday evening.  \n\nAll in all a great time In a cozy pub with friends.", "rating": 4, "date": "2018-09-27"}, {"excerpts": ["Fish and chips, burgers, fried calamari and etc., are the bar homely bites here. \n\n"], "author": "Tiffany D.", "review": "Dropped by here for a drink and I like the casual pub atmosphere!\n\nChill and cozy pub place when the fog comes in, it's quite nice to stay in here and linger about it. \n\nFish and chips, burgers, fried calamari and etc., are the bar homely bites here. \n\nNom and cheers!", "rating": 4, "date": "2018-07-16"}, {"excerpts": ["Very inpressed with the fish and chips. ", "Think they use a cod - two large pieces very generous!!  ", "We will be back to try all the other food!  ", "Mushrooms were plentiful and excellent too!!  ", "Like Shepard's pie!!!"], "author": "Donna L.", "review": "Came here for lunch out of our friends recommendation. Got there when it opened. Menus are on the table. Order from the bartender. First thing I noticed was how reasonable the prices are for a full lunch. Next we ordered the highly recommended fish and crispy fries and a basket of fried mushrooms. Last I noticed how much food they gave us. We could\nHave fed 3 people!  Everything was hot, crispy and delicious.  Very inpressed with the fish and chips. Think they use a cod - two large pieces very generous!!  We will be back to try all the other food!  Mushrooms were plentiful and excellent too!!  Like Shepard's pie!!!", "rating": 4, "date": "2018-04-18"}, {"excerpts": ["The fish and chips looked good (and HUGE) also the Shepard's pie)"], "author": "Amy W.", "review": "We came here on Thursday night around 7pm - not too crowded, but not empty. There was a couple of football games on that people were interested in.\n\nMy impedes for coming here was the review on the onion rings, people seemed to love them.\n\nWe ordered the NY steak to split - it was good but a little thin so more cooked than we might have liked (we ordered medium rare - but came Medium. Served with (almost Mashed potatoes, not really \"mashed\" enough to call them that - some Huge chunks of tender potatoes with gravy and some sad mixed (overcooked) veggies.\n\nThe onion rings were good - but greasy. They are the batter kind - not the breadcrumb kind.\n\nWe left full just ordering that. The fish and chips looked good (and HUGE) also the Shepard's pie)", "rating": 3, "date": "2017-09-15"}, {"excerpts": ["However, my friend got the fish and chips and it was extremely bland. ", "While the fish is a huge portion, there was no seasoning, but also no fish flavor even with we added salt. ", "Maybe skip the entrees here but grab a beer and stay for trivia/sports playing on the large screens."], "author": "Clarissa C.", "review": "TRIVIA NIGHT! \n\nIf I went to USF, I would definitely hit this place up on Wednesday nights for trivia on a regular basis. Came last week for trivia, and it was very fun. The questions (ranging from categories such as Current Events to Song Artists to Picture Rounds) were not too difficult. Some questions were challenging, but I think everyone can answer at least some of the questions which makes it a good time. They also have a lot of seating all the way into the building. \n\nI ordered a Moscow Mule and a cider for the night; they make decent drinks to accompany your trivia. However, my friend got the fish and chips and it was extremely bland. While the fish is a huge portion, there was no seasoning, but also no fish flavor even with we added salt. Maybe skip the entrees here but grab a beer and stay for trivia/sports playing on the large screens.", "rating": 4, "date": "2017-10-18"}, {"excerpts": ["A decent British-themed neighborhood pub with lots of familiar items like fish and chips, bangers and mash, shepherd's pie, and even chicken curry - as well as more familiar and ubiquitous bar bites like burgers, chicken nuggets, onion rings, and calamari. "], "author": "Vincent L.", "review": "A decent British-themed neighborhood pub with lots of familiar items like fish and chips, bangers and mash, shepherd's pie, and even chicken curry - as well as more familiar and ubiquitous bar bites like burgers, chicken nuggets, onion rings, and calamari. There's a decent selection of beers, although these are generally more pan-European than specifically British.\n\nThe vibe is casual and unassuming, and the bartenders are friendly and professional. A nice place to have in the neighborhood.", "rating": 3, "date": "2017-09-19"}, {"excerpts": ["Yesterday we were in the mood for pub food and decided to stop in for lunch - yummy fish and chips and a tasty pint to wash it down. ", "Portions were huge, and I love that the Pig and Whistle has food service at lunchtime. "], "author": "E. G.", "review": "All right, I admit it: I'm a sucker for pubs. Yesterday we were in the mood for pub food and decided to stop in for lunch - yummy fish and chips and a tasty pint to wash it down. Portions were huge, and I love that the Pig and Whistle has food service at lunchtime. Our meals were spot on (yum! fried food!), and the bartender provided excellent and very efficient service.\n\nEven though our lunch was great, the main reason for the five-star review is for Chris, the bartender. Turned out I'd left my phone there, got busy, and didn't notice it was missing until much later. When I called my phone (hoping it was in the house somewhere and I would hear it ringing), Chris answered right away and confirmed that he did indeed have it. I went to pick it up this morning and tried to offer him a reward for his kindness and honesty, but he wouldn't hear of it. I hope the owner reads this and appreciates what a wonderful employee he has.\n\nThank you, Chris, for saving the day!", "rating": 5, "date": "2017-06-21"}, {"excerpts": ["The fish and chips were delicious!! ", "The crust/fry on the fish was so flaky! ", "Definitely above average fish and chips! ", "5/5"], "author": "Josie W.", "review": "Great food, good service. It's a nice place to get some good food, plus some cheap hearty eats! The bartender was nice and attentive, told us to sit wherever and told us to order our food at the bar. \n\nI would say 4.5 stars, but will round up! I definitely loved this place, but it wouldn't be my favorite, but I would definitely recommend it since it was an overall good experience.\n\nIt was a nice quiet and chill location. The food was not fancy, but very good hearty British food. We got:\n\n-Sausage Rolls - These were pretty good, I could've gotten full off just these, but we shared. :) They tasted like flaky rolls stuffed with homemade sausage meat. 4/5\n- Shepherd's Pie - Very yummy. Got it with the veggies, also delicious. Didn't use any of the gravy. I liked how the mashed potatoes were also baked to the point of dry/crispy on top. Good ol' shepherd's pie! 4.5/5\n-Mushroom and Steak Pie - The steaks and sauce were good. Way too much mashed potato ratio. Veggies were delicious. For me, I personally didn't like this as much, but my friends liked it. (It's okay, since I didn't order it). The flaky pastry on top ended up turning into a soggy mess really quick. It was hard to cut into. Flavor wise, it was good. 3/5\n-Fish and Chips - The fish and chips were delicious!! The crust/fry on the fish was so flaky! Definitely above average fish and chips! 5/5", "rating": 5, "date": "2015-08-03"}, {"excerpts": ["(I ordered beef and mushroom pie and also tried fish and chips) ", "Overall, it's not an awful place and it is pretty cheap as well."], "author": "Marina O.", "review": "Well, if I haven't tried very good British food, maybe I would give this place 4 stars. (I ordered beef and mushroom pie and also tried fish and chips) Overall, it's not an awful place and it is pretty cheap as well.", "rating": 3, "date": "2018-01-16"}, {"excerpts": ["This is a great place to go if you want to get violently ill shortly after having their fish and chips!  ", "If spending a quality hour in the bathroom is your thing, then go for it!  ", "The meal looked good; didn't take too long to get, but the fish was definitely not right!  ", "Plus, the bartender was alone and after waiting about 10 minutes to have our order taken, and then going up and asking him to take our order he finally came over.  ", "He clearly saw my friend was handicapped and when she lifted her hand for help he just waved his fingers at her.  ", "Plus, it was incredibly noisy in the early afternoon on a Friday.  ", "I know pubs are noisy ", "but this was pretty intense.  ", "That is great if you want to yell at the person who brought you to have what she thought would be a good lunch.  ", "Good it definitely was NOT!"], "author": "Norah M.", "review": "This is a great place to go if you want to get violently ill shortly after having their fish and chips!  If spending a quality hour in the bathroom is your thing, then go for it!  The meal looked good; didn't take too long to get, but the fish was definitely not right!  Plus, the bartender was alone and after waiting about 10 minutes to have our order taken, and then going up and asking him to take our order he finally came over.  He clearly saw my friend was handicapped and when she lifted her hand for help he just waved his fingers at her.  Plus, it was incredibly noisy in the early afternoon on a Friday.  I know pubs are noisy but this was pretty intense.  That is great if you want to yell at the person who brought you to have what she thought would be a good lunch.  Good it definitely was NOT!", "rating": 1, "date": "2017-09-16"}, {"excerpts": ["Among the things my party tried, we actually enjoyed everything, but we really digged the Fried Calamari and Fish and Chips.\n\n"], "author": "Mark C.", "review": "The Pig & Whistle is a ridiculously awesome pub that serves British food. The staff is uber-friendly, the beer selection is great, and the food is superb. Among the things my party tried, we actually enjoyed everything, but we really digged the Fried Calamari and Fish and Chips.\n\nAnd a nice plus is that even though it's in the city, you shouldn't have a hard time finding parking in the area!", "rating": 4, "date": "2014-09-05"}, {"excerpts": ["This place has a great service, a wonderful bartender and great fish and chips. ", "Really cozy place with good drinks and better bar food. ", "Great for lunch with the coworkers."], "author": "Sal S.", "review": "This place has a great service, a wonderful bartender and great fish and chips. Really cozy place with good drinks and better bar food. Great for lunch with the coworkers.", "rating": 4, "date": "2017-04-05"}, {"excerpts": ["Their fish and chips are amazing! ", "Love coming here after class with my fellow classmates. ", "It's a great casual spot for some good grub and beer."], "author": "Manpreet B.", "review": "Their fish and chips are amazing! Love coming here after class with my fellow classmates. It's a great casual spot for some good grub and beer.", "rating": 4, "date": "2016-09-02"}, {"excerpts": ["Had the most flavorless fish and chips today. ", "I mean nothing, nada, zilch on flavor. ", "What happened? "], "author": "B K.", "review": "Had the most flavorless fish and chips today. I mean nothing, nada, zilch on flavor. What happened? Plus, no sausage rolls? Ack! -2 Stars for the decline.", "rating": 3, "date": "2016-07-24"}, {"excerpts": ["Nice staff, cozy bar, great fish and chips."], "author": "Alex R.", "review": "Grabbed lunch here after having my car tire repaired across the street. What a great find! Nice staff, cozy bar, great fish and chips.", "rating": 5, "date": "2017-05-20"}, {"excerpts": ["So, I didn't exactly stop in for the Trivia Night (though I wish I lived closer so I could), but I did have a hankering for fish and chips and a lot of greasy food after working a long festival day where food happened to be scarce. \n\n", "The fish and chips were gigantic, ", "two big pieces (fried to perfection). ", "All that was needed was a sprinkle of sea salt and a hearty sprinkle of malt vinegar "], "author": "Siobhan F.", "review": "So, I didn't exactly stop in for the Trivia Night (though I wish I lived closer so I could), but I did have a hankering for fish and chips and a lot of greasy food after working a long festival day where food happened to be scarce. \n\nBae & I are big fans of sharing with one another, so we split an order of the Fish & Chips and an order of the Buffalo wings. \n\nThe Buffalo Wings were not by any means traditional wings. They were in some crunchy/crispy batter and sauces came on the side (bbq + buffalo). We tossed the suckers in the buffalo sauce and they stayed happily crispy as we worked our way through the order. The fish and chips were gigantic, two big pieces (fried to perfection). All that was needed was a sprinkle of sea salt and a hearty sprinkle of malt vinegar and I was in fried food heaven. \n\nI also happened to grab a pint of beer and my man got a Diet Coke and the entire thing came out to like $22.50, which for SF seemed like the best deal on the planet considering the quality and quantity of food.", "rating": 4, "date": "2015-04-26"}, {"excerpts": ["My favorite is the fish and chips, large portions of food! ", "Good pricing! and friendly staff!"], "author": "Alexander M.", "review": "Love this place! Nice neighborhood bar, good food! My favorite is the fish and chips, large portions of food! Good pricing! and friendly staff!", "rating": 4, "date": "2017-06-03"}, {"excerpts": ["Last night l was in this pub with a friend of mine who was constantly pushing me to eat fish and chips in this pub and said \"Have you ever met with any one from Ireland ? ", "You probably haven't and today we will go and meet with some irish people in this beautiful pub\". ", "We went there and ordered fish and chips and my favorite dark Guinness beer. ", "When we were waiting, my friend suddenly got so upset and started to cry so hard. ", "l didn't understand what was happening to her and asked why she is crying. ", "She said that she very upset because there is no one from Ireland in the pub and couldn't introduce me to anyone. ", "l looked at her eyes with full of emotions and couldn't say anything but ", "a song was playing, then we heard the lyrics ; \"Don't you worry, don't you worry child,see heaven's got a plan for you...", "\" ", "THEN,\nWe got our fish and chips ", ":o) ", "It was really delicious and french fries were REALLY amazing. ", "l have listened the owner's interview on a podcast before l go there and l agreed with everything he said after experiencing a very nice and pretty quality food (normally, eating in a pub/bar like eating rotten carrot from a trash can). ", "This place is really nice. ", "Very cosy and felt like being in a close friend's house. ", "Staffs were very friendly and caring. "], "author": "Arthur W.", "review": "What can l say ? WOW !\n\nLast night l was in this pub with a friend of mine who was constantly pushing me to eat fish and chips in this pub and said \"Have you ever met with any one from Ireland ? You probably haven't and today we will go and meet with some irish people in this beautiful pub\". We went there and ordered fish and chips and my favorite dark Guinness beer. When we were waiting, my friend suddenly got so upset and started to cry so hard. l didn't understand what was happening to her and asked why she is crying. She said that she very upset because there is no one from Ireland in the pub and couldn't introduce me to anyone. l looked at her eyes with full of emotions and couldn't say anything but a song was playing, then we heard the lyrics ; \"Don't you worry, don't you worry child,see heaven's got a plan for you...\" With her red lipstick and red Chanel dress, she felt like it is a sign from universe and stopped crying...\n\nTHEN,\nWe got our fish and chips :o) It was really delicious and french fries were REALLY amazing. l have listened the owner's interview on a podcast before l go there and l agreed with everything he said after experiencing a very nice and pretty quality food (normally, eating in a pub/bar like eating rotten carrot from a trash can). This place is really nice. Very cosy and felt like being in a close friend's house. Staffs were very friendly and caring. They really value you as a customer.\n\nGo there, have their fish & chips and Guinness. You will love this place...\nAnd you don't need to wear Chanel dress or Tom Ford tuxedo like me. You can go there with shorts and slippers :o)", "rating": 5, "date": "2016-02-17"}, {"excerpts": ["Food is really good (fish and chips are perfectly crisp without being greasy) and not entirely greasy for a pub. ", "You can even state into the back to see the cooks working. ", "The clientele is also pretty friendly without being too rowdy for a bunch of drunkards. ", "Seating is also easy because of how much space there is, and there's so much parking around because you're in between two districts. ", "Pints are $5, but during happy hour, draught beers are $3.50. ", "Fish and chips come with 2 large pieces of fish and a fairly large serving of fries. ", "They even give you brown sauce to go with it (I tried it, and brown sauce doesn't work with this dish despite its deliciousness, so don't do that). ", "The fish is just perfectly fried and has no briny flavor. ", "It's good enough on its own without any lemon or tartar sauce. ", "Their tartar sauce is also good as it's a little more tart than other ", "I've tried, which works perfectly for me. "], "author": "Danny C.", "review": "There's nothing bad I want to say about this place. Food is really good (fish and chips are perfectly crisp without being greasy) and not entirely greasy for a pub. You can even state into the back to see the cooks working. The clientele is also pretty friendly without being too rowdy for a bunch of drunkards. Seating is also easy because of how much space there is, and there's so much parking around because you're in between two districts. Pints are $5, but during happy hour, draught beers are $3.50. Can't argue with that, and the bartenders are very nice.\n\nFood is pretty solid. Fish and chips come with 2 large pieces of fish and a fairly large serving of fries. They even give you brown sauce to go with it (I tried it, and brown sauce doesn't work with this dish despite its deliciousness, so don't do that). The fish is just perfectly fried and has no briny flavor. It's good enough on its own without any lemon or tartar sauce. Their tartar sauce is also good as it's a little more tart than other I've tried, which works perfectly for me. The curry fries are tasty, but definitely need more curry on top of those bad boys.", "rating": 5, "date": "2013-10-19"}, {"excerpts": ["Upon ordering, a burger for me and fish and chips for my husband both of which were amazing! ", "The bartender started asking us about our visit(we had asked about meter time). ", "She gave us some great advice about parking, walking at night, and bus info. ", "She was so kind and genuinely caring as she told us to watch out for certain areas around town. ", "Great food and local vibe."], "author": "Denise S.", "review": "Came in for a quick bite and could not have had a better experience! They'd just opened for the day at 11:30 when we came in but there was already a group of local ladies having a meeting in the back room. They seemed well aquatinted with the bartender and the owner which gave this place the local feel you don't see often in a large city. These women were all English and seemed to have a great time gabbing and eating. Now this isn't a review for them, back to my visit. Upon ordering, a burger for me and fish and chips for my husband both of which were amazing! The bartender started asking us about our visit(we had asked about meter time). She gave us some great advice about parking, walking at night, and bus info. She was so kind and genuinely caring as she told us to watch out for certain areas around town. Great food and local vibe.", "rating": 5, "date": "2016-06-04"}, {"excerpts": ["Took my English relatives for fish and chips and they were throughly impressed.  ", "It was like being in an English pub.  ", "Best English food I have had in the states.  ", "And the best part of all.  ", "The whole menu is under 10.00. ", "WOW"], "author": "Steve N.", "review": "This place is amazing. Food was excellent and authentic. Took my English relatives for fish and chips and they were throughly impressed.  It was like being in an English pub.  Best English food I have had in the states.  And the best part of all.  The whole menu is under 10.00. WOW", "rating": 5, "date": "2015-05-22"}, {"excerpts": ["Came in during the day ordered fish and chips they were pretty good size and were very good. ", "It had a good vibe and definitely will come back. ", "Service was awesome."], "author": "Bryan P.", "review": "Came in during the day ordered fish and chips they were pretty good size and were very good. It had a good vibe and definitely will come back. Service was awesome.", "rating": 4, "date": "2015-04-11"}, {"excerpts": ["Some of the best fish and chips I've had in a while. ", "Large portions and reasonably priced."], "author": "J. K.", "review": "Sticky tables and floors. Drinks seemed watered down. Some of the best fish and chips I've had in a while. Large portions and reasonably priced.", "rating": 3, "date": "2016-05-24"}, {"excerpts": ["Such a shame too since I had some high hopes for their Fish and Chips - while the pieces of fish were big", ", the batter was weak and I didn't care much for the flavor.  "], "author": "Mike L.", "review": "Came back a few weeks after my first trip when a couple of my friends rented out the back area of the bar for their joint birthday party.  The $300 minimum bar tab to get it wasn't terrible, but at the same time, I don't think the bar lost much business due to us taking up the space either since the front of the bar never seemed to get that busy.  In any case, we ended up ordering more than the minimum anyways, so it didn't make a difference.  The workers were all pretty friendly, but the best part are the drink prices - so cheap!  We ended up getting more rounds than we would have at other bars, so can't complain about getting more bang for your buck!  \n\nSadly, despite how great I think the bar itself is, the food here really fell short.  Such a shame too since I had some high hopes for their Fish and Chips - while the pieces of fish were big, the batter was weak and I didn't care much for the flavor.  My friend's Bangers and Mash that I tried was mediocre - sausage was generic (like what you can get at a store) and the mash was bland.  Similarly, the mashed potatoes on my other friend's Shepherd's Pie was the same, but at least she had the meat underneath to give it some taste.  I haven't had many Shepherd's Pies in my life, but she said it reminded her of a frozen version in a way.  The Pork Loin Chop that my other friend got was probably the best of the bunch, but even then it was just average.\n\nSince I know people mostly come here for the drinks first and food second, I only took off a star instead of averaging them like how I usually do.  Plus, they still have my Carlsberg!", "rating": 4, "date": "2011-06-05"}, {"excerpts": ["We ordered their Shepard pie and fish and chips and their wings. ", "Fish n chips less ", "than10 dollars in SF! "], "author": "B K.", "review": "I wanted to eat some British pub food and this place was open late. We got there at 9pm and asked if they still serve food. They were doing trivia night and it was pretty packed. They have a room in the back with tables and a tv which was empty when I got there but 2 seats at the bar just opened up so we oarked our behinds there. The bartender informed that their kitchen closes at 10pm. We ordered their Shepard pie and fish and chips and their wings. Fish n chips less than10 dollars in SF! Shepherds pie was like 9 dollars and their wings were like 6.50. Cheap and great value at a bar. I mean who cares if some of their foods are frozen and canned gravy when they have like 10 beers on tap at like 5.50 a pint. We ate and had a beer each and the total came to 38 something. I left happy getting my fried food fix and told myself I will return with my guy friends at some time and spend hours there drinking and eating.", "rating": 5, "date": "2016-11-21"}, {"excerpts": ["I was underage for about 15 of those years as I went with my family to enjoy fish and chips or bangers and mash for lunch. \n", "Ita not the high end sports bar or the gastro pub style food. \n", "Its simple..I local neighborhood restaurant \"where\neverybody knows your name (at least a few bartenders)\". ", "Come here few times a month for food or to grab a cold Guiness. ", "..\n", "Decent food, good variety of draft beers, affordable price..the decor hasnt changed..since I could remember...fantastic bar with familiar faces as I will always prefer as our watering hole!"], "author": "Satish P.", "review": "I have been going here for over 25 years. I was underage for about 15 of those years as I went with my family to enjoy fish and chips or bangers and mash for lunch. \nIta not the high end sports bar or the gastro pub style food. \nIts simple..I local neighborhood restaurant \"where\neverybody knows your name (at least a few bartenders)\". Come here few times a month for food or to grab a cold Guiness. ..\nDecent food, good variety of draft beers, affordable price..the decor hasnt changed..since I could remember...fantastic bar with familiar faces as I will always prefer as our watering hole!", "rating": 5, "date": "2014-02-03"}, {"excerpts": ["Ok, the fish and chips weren't quite so good", ", I had fish and chips in Northern Ireland ", "and so I know what they are supposed to taste like.  ", "Anyway, those couple suggestions and people will be raving about the fish and chips and since the beer selection was good, the staff very friendly and all that, the place would be five stars and always crowded with beautiful coeds, and that, my friend, sells some beer.\n\n"], "author": "Michael B.", "review": "So one of my highlights of my recent road trip up to the city.  I enjoyed the atmosphere (of course being walking distance from where I was staying helped) but I really did enjoy the place enough to have made it a regular stop if I was a local.\n\nI once went to New Zealand and visited a local pub (back before my \"Christian\" wife dumped me like the scum bag piece of trash no good atheist monster that I am, that Jesus guy sure has hateful followers, but I digress, f, this is a bar review, oh, well, it's relevant now that the Christians have disowned me, I spent more time with decent people drinking in pubs)....\n\nAnyway, the New Zealand pub had this thing called \"The Quiz\" it was cool as can be and so I showed up, I guess randomly, on the night they do the trivia thing here at The Pig & Whistle.\n\nSide bar:  I opened Sound Hound and cheated like crazy on the \"name that tune round\".....my team mates missed a couple on purpose just to disguise the fact that we sucked, no worries, we had no chance to win.\n\nAnyway, in New Zealand the picture round had a bunch of cows and you had to identify the type of cow, yeah, like \"that's a Jersey\" and so forth, here in the city they had pictures of Hollywood people and a couple politicos, so it was a bit easier.\n\nGood fun all around.\n\nOk, the fish and chips weren't quite so good, I had fish and chips in Northern Ireland and so I know what they are supposed to taste like.  Oh, I had them in New Zealand too, but they sucked, everything there tastes like it was fried in sheep.\n\nSo my suggestion is that the oil probably needs to be hotter (too greasy) and for the chips, here's the deal:  read Anthony Bourdain's book on how to cook fries, it has to do with tempering them first I think, or something like that, um, cooking them before you cook them.\n\nAnyway, those couple suggestions and people will be raving about the fish and chips and since the beer selection was good, the staff very friendly and all that, the place would be five stars and always crowded with beautiful coeds, and that, my friend, sells some beer.\n\nUnless you're in England, where they don't like chicks in the pub, but this ain't the case.", "rating": 4, "date": "2012-12-21"}, {"excerpts": ["I had shepherd's pie, my bf had fish and chips. ", "We both didn't finish our meals. \n", "The atmosphere is good though."], "author": "Maria O.", "review": "I had shepherd's pie, my bf had fish and chips. We both didn't finish our meals. \nThe atmosphere is good though.", "rating": 2, "date": "2013-08-24"}, {"excerpts": ["We ordered a burger and fries, and fish and chips. ", "Both were great for the price and we will visit again!"], "author": "Brigette A.", "review": "For a down-home bar experience and good food is recommend this place. The bar tenders were friendly, and I enjoyed the atmosphere - very casual and comfortable. We ordered a burger and fries, and fish and chips. Both were great for the price and we will visit again!", "rating": 5, "date": "2015-06-22"}, {"excerpts": ["My girlfriend and I specifically went here for the fish and chips but the fish was extremely mushy and soggy so much that I couldn't tell if it was old fish or overcooked. ", "Great service!"], "author": "Devin W.", "review": "I'm specifically relating this post to the food because our bartender was awesome and the beef and vegetable pie was great. My girlfriend and I specifically went here for the fish and chips but the fish was extremely mushy and soggy so much that I couldn't tell if it was old fish or overcooked. Great service!", "rating": 2, "date": "2015-09-06"}, {"excerpts": ["We all ordered the fish and chips which were two good sized pieces of cod with light batter and a good amount of chips.  ", "No mushy peas though.  "], "author": "Luisa T.", "review": "We stopped in to have lunch based on our son's recommendation.  Really nice choice!  It's not a huge place, but there are many tables to choose from during lunch time.  Very quiet with perhaps a handful of other patrons either dining or enjoying drinks at the bar.  Bartender was friendly, the food orders were prepared efficiently, and best of all they were quite good and excellent value.  Honestly the prices are really excellent.  I do hope they keep them like this for a while!  \n\nWe really miss the pubs we used to frequent on our UK visits so this one helped to fill the void.  We all ordered the fish and chips which were two good sized pieces of cod with light batter and a good amount of chips.  No mushy peas though.  Must say the batter was not that greasy stuff one gets at other establishments.\n\nAlso we ordered the calamari rings which was a nice portion to share, very fresh and lovely.  Went well as an appetizer.\n\nHad some half and whole pints of Carlsberg to complement our meals.\n\nI know there are other British pubs in SF, but Pig & Whistle is great.  Only slight negative is that the unisex toilets are a bit gross, but it's probably due to patrons' use not neglect on management's part.\n\nWill be back for sure.", "rating": 4, "date": "2015-08-01"}, {"excerpts": ["Fish and chips were ok - not that flavorful, but felt very heavy on the grease.\n"], "author": "Jeanne L.", "review": "I am so impressed by their great food & drink service even during the World Series.  Way to stay on top of things!\n\nGuinness on tap and well poured!\nDelicious shepherds pie!  \nGreat chicken nuggets!  \nFish and chips were ok - not that flavorful, but felt very heavy on the grease.\nFrench fries were ok - could use more salt, maybe a little bit more of a crispy shell.\n\nOverall a great pub experience!!", "rating": 4, "date": "2012-10-26"}, {"excerpts": ["My friend who ordered the fish and chips also seemed to enjoy it.  ", "It almost looked like they took an entire fish, deboned it, fried up both sides of fish meat, and served it up.  "], "author": "Vivian C.", "review": "3.5 stars rounded up.\n\nDefinitely a neighborhood bar, a spot for the locals.  We came here on a Thursday evening and stuck out like sore thumbs compared to the regulars here.  It's a largely older white man pub, made me feel like a baby, especially when the bartender confirmed that we looked like we were 18 years old. \n\nBut self-infantilizing aside, I like this place.  During happy hour, all beers on tap are $3.  Appetizer plates are around $4-5.  Larger meals are around $8-10.  Portions are elephantine.  Yes, you get bang for your buck!  I ordered a plate of chicken nuggets ($5 only!), and I swear about 30 nuggets appeared on a huge plate.  With ranch, ketchup, and something spicy (tabasco maybe?).  Ate the whole thing.  \n\nMy friend who ordered the fish and chips also seemed to enjoy it.  It almost looked like they took an entire fish, deboned it, fried up both sides of fish meat, and served it up.  I swear, they give you like an entire fish.  \n\nOh, and there's also darts, and I noticed there's free pool on Sundays from 11am-8pm.  This place also seems like a great place for you to watch the World Cup these next few weeks.  I'm sure you'll have a great time with your elephant-sized fried foods, good beer, and endless soccer.", "rating": 4, "date": "2010-06-10"}, {"excerpts": ["We ordered the Shepherd's Pie and Fish and Chips. ", "Both were excellent.  ", "The Fried Mushrooms are the Bomb.  ", "To top it off they have Boddington's Bitter on tap.  ", "We definitely will be back"], "author": "John S.", "review": "This place really captures the essence of \"No Frills\" english pub grub. We ordered the Shepherd's Pie and Fish and Chips. Both were excellent.  The Fried Mushrooms are the Bomb.  To top it off they have Boddington's Bitter on tap.  We definitely will be back", "rating": 4, "date": "2015-04-15"}, {"excerpts": ["Genuine fish and chips, bangers, British breakfast, cornish pasties better than I tasted in the UK.  ", "No kidding!\n", "Happy hours and food plates are great deals!  ", "There are TVs showing soccer, golf, rugby and other sports but be careful, it can get packed during big matches.\n", "If you're looking for a place to meet, P-Dub is a great place to start!\n", "Street parking gets tougher as it gets later."], "author": "Pablo R.", "review": "If you're looking for a British Pub in America.  The Pig & Whistle is what you're looking for.  Genuine fish and chips, bangers, British breakfast, cornish pasties better than I tasted in the UK.  No kidding!\nHappy hours and food plates are great deals!  There are TVs showing soccer, golf, rugby and other sports but be careful, it can get packed during big matches.\nIf you're looking for a place to meet, P-Dub is a great place to start!\nStreet parking gets tougher as it gets later.", "rating": 5, "date": "2012-04-01"}, {"excerpts": ["I hadn't been there for a while and returned for fish and chips. ", "Inconsistent food quality. ", "The fish had a hard, crusty batter that wasn't good, the chips were cold and soggy and the sickly white tartar sauce had no flavor. ", "Tables and chairs were sticky, in need of a good cleaning. ", "All food prices were increased, but menus with the old prices were still on the tables. ", "Not a welcoming atmosphere, with foul-mouthed older men at the bar and the usual assortment of unfriendly USF students."], "author": "Pam J.", "review": "I hadn't been there for a while and returned for fish and chips. Inconsistent food quality. The fish had a hard, crusty batter that wasn't good, the chips were cold and soggy and the sickly white tartar sauce had no flavor. Tables and chairs were sticky, in need of a good cleaning. All food prices were increased, but menus with the old prices were still on the tables. Not a welcoming atmosphere, with foul-mouthed older men at the bar and the usual assortment of unfriendly USF students.", "rating": 2, "date": "2016-05-28"}, {"excerpts": ["My husband got the pork chops and a Boont Amber, and our friend got the fish and chips with an Anchor Steam. ", "We all scarfed our food. ", "I couldn't quite finish mine because it was a really decent size. ", "It's finishable though", ", I could've if I was paying attention to whether I was full or not. ", "You order at the bar and they bring the food out to you. ", "Prices are great, for all that for the three of us it came to $40. ", "The ambience was great, it's just the perfect kind of comfortable pub. ", "We arrived at about 7:15 on a Saturday and it wasn't busy. ", "We had our choice of tables.\n", "Oh, and they have this awesomely convenient door around the side of the building that opens right into their back hallway where the bathrooms are, so when you leave and walk around the corner and then go, ", "\"oh man, I should've gone to the bathroom,\" - voila! ", "There's an easy access door right there! ", "Way to go, guys."], "author": "Erin A.", "review": "We were here last night and I loved it so much. It's totally one of my new favorite SF places. I got the shepherd's pie, which was am-ah-zing, and a Strongbow. My husband got the pork chops and a Boont Amber, and our friend got the fish and chips with an Anchor Steam. We all scarfed our food. I couldn't quite finish mine because it was a really decent size. It's finishable though, I could've if I was paying attention to whether I was full or not. You order at the bar and they bring the food out to you. Prices are great, for all that for the three of us it came to $40. The ambience was great, it's just the perfect kind of comfortable pub. We arrived at about 7:15 on a Saturday and it wasn't busy. We had our choice of tables.\nOh, and they have this awesomely convenient door around the side of the building that opens right into their back hallway where the bathrooms are, so when you leave and walk around the corner and then go, \"oh man, I should've gone to the bathroom,\" - voila! There's an easy access door right there! Way to go, guys.", "rating": 5, "date": "2013-12-08"}, {"excerpts": ["For a great price, you can get your fill of a huge selection of beer on tap AND fish and chips or shepherd's pie.\n", "3.  ", "Can I just reiterate how affordable you are?  ", "I think for 5 people who drank and ate our fill, we only knocked back like $80 with a nice tip?"], "author": "Christine K.", "review": "Top 3 reasons I love this place...\n\n1.  You are not a bar full of indie hipsters!  \n2.  For a great price, you can get your fill of a huge selection of beer on tap AND fish and chips or shepherd's pie.\n3.  Can I just reiterate how affordable you are?  I think for 5 people who drank and ate our fill, we only knocked back like $80 with a nice tip?", "rating": 4, "date": "2011-07-07"}, {"excerpts": ["I recommend the fish and chips, with extra chips and malt vinegar.  ", "Some damn good eatin'.  ", "The bartender made me a Long Island ", "and I was knocked on my keester.  "], "author": "Tamar D.", "review": "The perfect neighborhood pub, with pretty good food.  I recommend the fish and chips, with extra chips and malt vinegar.  Some damn good eatin'.  The bartender made me a Long Island and I was knocked on my keester.  Ah, the power of not enough food in my belly before a stiff pour.\n\nThe trivia night is just okay.  Some bars you go to and people are not only totally into it, there's serious competition between regulars.  The trivia at P&W is more like a sidebar to drinking.  \n\nAlthough I liked the old pool table, I'm glad they now have more seating in the back.  It was small, anyway, and you'd practically hit the cue on the wall for some shots.", "rating": 5, "date": "2011-02-25"}, {"excerpts": ["This place reminded me of many of the pubs back in the UK and the Fish and Chips along with the curry do the UK justice."], "author": "Graham H.", "review": "My mum's from the UK so I have visited frequently. This place reminded me of many of the pubs back in the UK and the Fish and Chips along with the curry do the UK justice.", "rating": 5, "date": "2013-01-31"}, {"excerpts": ["Erica got the Fish and chips (which was a HUGE serving on a bed of chips)\n", "I got the chicken wings (which appeared on their \"lighter fare and appetizers menu\" for $4.59 but was a large a serving as the fish and chips.\n", "Beers all around except for me, who had a mickey slipped into my drink by my own beloved.  "], "author": "Christina C.", "review": "I outsmarted my BF, yes I did.  I tricked him in to taking me out on a school night.  Yes, I did.  And, then he tricked me with a drink that was alcoholic, yes he did.  \n\nWe came here as a mini-celebration.  Mini-celebutant celebration.  It was around 7pm and though I had secretly indulged in Happy Hour downtown near school before I took the bus home, I ordered and ate some more.  This bollywood dance and sculpting class is burning calories!\n\nBF go the Cornish Pastie (which ironically came with a green salad that was tasty and delicious)\nErica got the Fish and chips (which was a HUGE serving on a bed of chips)\nI got the chicken wings (which appeared on their \"lighter fare and appetizers menu\" for $4.59 but was a large a serving as the fish and chips.\nBeers all around except for me, who had a mickey slipped into my drink by my own beloved.  I'm writing this through a hangover the size of your mom.\n\nThe crowd was very chill.  They liked being here, but it wasn't \"who they were.\"  They were pub and beer people but being a patron of the Pig did not make them feel like superior human beings.  They engaged in conversations without making it appear as though they were blessing you with the pearls of wisdom that fell from their mouths.  Chill.\n\nThe \"booth\" we sat in was terrific.  The side against the wall was cushioned with green velvet.  And there were little arm rests that delineated where the next section was.  I had my own little throne, that I had to share with Erica.  \n\nThe food came and was pretty good.  The fried stuff was all about the same color of well done.  I think it's a british thing because every pub I've been to has done the same violence to fried foods.  It's like the time was set to \"make sure there's nothing left alive.\"\n\nMy wings were seasoned to perfection and fried to a crisp.  It came with 3 dipping sauces.  I like dipping.  And I like sauces.  And it came with the same salad that was oddly delicious.  \n\nErica's fish was good.  It's fish.  I don't know how else to describe it.  I would have eaten it.\n\nBF's pastie was surprisingly tasty.  It had ground meat, peas, seasoning and a flaky pasty all around.  LIke a messy, non-hand-held pie that you eat with a knife and fork.  \n\nCHECK: another one off my list that my BF never thought I would take him to.  Because he thinks I have something up my sleeve.  And I do.  It's armpit hair.", "rating": 5, "date": "2010-03-03"}, {"excerpts": [", Fish and Chips (the best I've had in SF) and bar snacks like curry chips and breaded mushrooms. "], "author": "Sarah F.", "review": "I absolutely love this place. After moving to SF three years ago from the UK, I was searching for ages for a decent pub that had nice pub food and good atmosphere. I found exactly this in the Pig and Whistle. They have a lovely selection of British/Irish/European beers -- including Old Speckled Hen ale (yum yum). Lots of pub food including full English Breakfast, Steak and Ale pie (with beans and chips...so authentic!!), Fish and Chips (the best I've had in SF) and bar snacks like curry chips and breaded mushrooms. And well stocked in HP sauce and British malt vinegar (yum yum).\n\nAlso, the atmosphere is really great. Lots of regulars go, it has a pool table and darts, and there are often themed nights that quiz night (lots of fun...pretty challenging questions!) and things like that. The dukebox has loads of British classics...The Beatles, Oasis, Blur, Maniacs, Pulp, you name it....\n\nBasically, it's a top home-from-home for expats, and a little British experience for Americans! I've spent many a happy hour reminiscing with Brits about nights out in Sheffield as well as sharing tips like where to find orange squash in the Bay Area. As us Yorkshire lasses say \"It's really brilliant!!!\"", "rating": 5, "date": "2009-12-31"}, {"excerpts": ["The fish and chips are very very bland, but the fries are massive ", "so I guess it evens out. "], "author": "Evey G.", "review": "Only went here once, but it was a good time!  Granted half the great time is the company you're with, but still, this was a solid little bar.\n\nGood vibe, good drinks. The pub food is nothing to write home about. The fish and chips are very very bland, but the fries are massive so I guess it evens out. I heard from others at the table that the Banger Rolls are to die for. \n\nWe had an easy time getting a table for 7 on a Saturday evening and spent several hours having drinks and conversation. The staff were hard working and friendly, and I just loved the pub vibe. I would love to come back for trivia night, too. \n\nDefinitely worth a look!", "rating": 4, "date": "2010-08-29"}, {"excerpts": ["I've also come for breakfast pretty good bangers and mash, I've had better fish and chips but not bad at all. ", "The beer selection is not huge but it has a bit of something for everyone, which is a hard thing to pull off ", "but they do ti with ease", ", additionally they make a good fuckin' cocktail just the way i like em good and strong, yet delicious. ", "Again a tip of the hat to Jerry. ", "Its a great spot to get a bite relax and drink. ", "Needless to say i'll be back soon."], "author": "Sean MC E.", "review": "The Pig has a special place in my heart. Let me start with Jerry you're the coolest cat in town with out a doubt. Me and my buddy only come in when Jerry is around so this is more a review on him, and quite frankly the dudes the tits! More on the food and drink. typical bar food, cheap greasy, exactly why you need. I've also come for breakfast pretty good bangers and mash, I've had better fish and chips but not bad at all. The beer selection is not huge but it has a bit of something for everyone, which is a hard thing to pull off but they do ti with ease, additionally they make a good fuckin' cocktail just the way i like em good and strong, yet delicious. Again a tip of the hat to Jerry. Its a great spot to get a bite relax and drink. Needless to say i'll be back soon.", "rating": 5, "date": "2012-07-17"}, {"excerpts": ["Drinking buddy ordered the fish and chips. ", "He said the fish tasted kind of \"off\". ", "We'll see what happens to him in 48 hours "], "author": "Sun T.", "review": "I love the bar food. Expect to pay about $10\n\nOrdered the bangers and mash.\nDrinking buddy ordered the fish and chips. He said the fish tasted kind of \"off\". We'll see what happens to him in 48 hours *LOL*\nLibations: Boddingtons\n\nIt was packed and very loud but it was a Friday night so... \n\nWe made a rookie mistake and thought someone would take our order. After 20 minutes we decided to flag down a staff member who was on his way out the door.  He told us we had to order at the front and pointed to the directions ON THE MENU!  How embarrassing for the both of us. I'm not afraid to admit my mistake. =P\n\nWe didnt hang out too long due to the noise and wanted to catch up so we headed up to Abbey Tavern.\n\nThis place looks fun and I will definitely return with a few more people.", "rating": 4, "date": "2011-03-20"}, {"excerpts": ["I have never had an order of fish and chips bigger than the one I got here at the Pig and Whistle. \n\n", "The old wood chairs, wood bar, lots of pints, fish and chips. ", "You get the idea."], "author": "Andy A.", "review": "Due to certain machinations of my personal life as of late, I've found myself in the Pig and Whistle quite often, and as far as SF \"pubs\" go, it's a keeper. It's one of those bars you can be drinking in at 2:30 in the afternoon and you feel like you're accomplishing something. I need to make a category for that; \"Nice-day-out-mid-afternoon-drinking-bar.\"\n\nOver in this area there are a few English / Irish style pubs and this is one of the nicer ones. Not only do they have a pretty decent selection of beers, they have some pretty decent pub food. I have never had an order of fish and chips bigger than the one I got here at the Pig and Whistle. \n\nYou can tell that the place is a fairly consistent regular's bar. They've typically got sports (most often the 'footy') up on the TVs, there's pool in the back and, oh yeah, there's trivia there at least one night a week I think. \n\nI've spoken to a few real, authentic, British people who have told be that they enjoy the place so that's got to tell you something. The old wood chairs, wood bar, lots of pints, fish and chips. You get the idea.", "rating": 4, "date": "2009-09-18"}, {"excerpts": ["I came here with some work chums and had ourselves some fish and chips.  ", "The portions are large and we barely finished our lunch.  ", "The fried mushrooms were very good and so are the fries.  ", "I got the veggie burger, what can i say, it was a veggie burger.  ", "Oh, and they serve non alcoholic beer.  ", "Interesting."], "author": "Rosalind S.", "review": "I went here years ago for a first date.  We had a couple of drinks and played pool in the back room.  \n\nFast forward to present time.  Hey, they serve food here!  I came here with some work chums and had ourselves some fish and chips.  The portions are large and we barely finished our lunch.  The fried mushrooms were very good and so are the fries.  I got the veggie burger, what can i say, it was a veggie burger.  Oh, and they serve non alcoholic beer.  Interesting.", "rating": 4, "date": "2010-10-01"}, {"excerpts": ["Last but not least, the fish and chips are some of the best I've had. ", "Fresh huge slabs of fishies, lightly fried with all the fixins. ", "I can imagine there being a better fish & chip ", "but I've yet to find it"], "author": "Victor B.", "review": "A jolly fine pub if I do say so myself.\n\nThe bartenders are delightfully nice and somehow seem to be quick even when the bar is packed.\n\nA decent selection of whiskey if it's not a beer night coupled with some super comfortable seating to rest that tired buttocks of yours.\n\nAnd if the conversation of friends gets stale, you can always enjoy some darts, pool, or video touch games.\n\nLast but not least, the fish and chips are some of the best I've had. Fresh huge slabs of fishies, lightly fried with all the fixins. I can imagine there being a better fish & chip but I've yet to find it", "rating": 5, "date": "2010-06-27"}, {"excerpts": ["[Edit: Had the fish and chips &thought it was a little pricey, but when it actually came out, i knew it was totally worth the 9 dollars. ", "They weren't little fish sticks, they were really big fish fillets! "], "author": "Lisa D.", "review": "[Edit: Had the fish and chips &thought it was a little pricey, but when it actually came out, i knew it was totally worth the 9 dollars. They weren't little fish sticks, they were really big fish fillets! Fries were nothing special, didn't even finish them 'cause I was too focused on the fish!]\n\nWent here last night with a bunch of my classmates after a big event. I love how it's only a short walk from school. I had a blast, and the staff was definitely really cool. Didn't have a chance to try their food, but when I asked them about it (my friend really, really needed something to eat), they kindly told me they had food right next door that I could bring back in. AND they made sure they checked on my friend who was having a really, REALLY good time.\n\nNice staff. Typical bar ambiance. Good folks. Good night! Definitely coming back!", "rating": 4, "date": "2010-09-17"}, {"excerpts": ["Also, the guy next to me got a half order of fish and chips for $5 and the food filled the entire plate. ", "Looking forward to returning."], "author": "Maximillian M.", "review": "$4.50 for a pint of Boddington's??? SWEET. Also, the guy next to me got a half order of fish and chips for $5 and the food filled the entire plate. Looking forward to returning.", "rating": 4, "date": "2012-06-28"}, {"excerpts": ["A friend swears by the fish and chips: they do look fresh.\r\n\r\n", "Clean and dim inside. ", "It's TEEMING with hot Irish construction workers grabbing a pint on their lunch hour. ", "HELLO!! ", "Service is a little slow ", "but maybe that's ", "just cuz I have an hour. \r\n\r\n", "They're honest about the desserts, too. ", "If they're not fresh, they don't recomend them. ", "I admire their honesty."], "author": "Molly E.", "review": "This place must be handing out the BJs cuz it's VERY popular. I've been here for lunch a couple times: that's right, LUNCH. And it's pretty good. They've got a tasty-ass shepherd's pie with baked beans. A friend swears by the fish and chips: they do look fresh.\r\n\r\nClean and dim inside. It's TEEMING with hot Irish construction workers grabbing a pint on their lunch hour. HELLO!! Service is a little slow but maybe that's just cuz I have an hour. \r\n\r\nThey're honest about the desserts, too. If they're not fresh, they don't recomend them. I admire their honesty.", "rating": 3, "date": "2005-11-11"}, {"excerpts": ["I ordered a Carlsberg and the fish and chips and within a moment of my ordering to the trashy Rene Zellweger lookalike, I was asked to pay in cash before my food was given to me.  ", "Bizzare.  "], "author": "Rich J.", "review": "eThe Pig and Whistle seems to be an English bar that tries very dilligently to be otherwise.\n \nI ordered a Carlsberg and the fish and chips and within a moment of my ordering to the trashy Rene Zellweger lookalike, I was asked to pay in cash before my food was given to me.  Bizzare.  Unfortunately, the food was severely sub-par (compared to Ireland 32). \n\nThe food service was glacial and the reaction to my being upset about it was peculiar.\n\n\"I ordered my food close to 50 minutes ago.\"\n\"Oh well sometimes food takes a bit longer when things are busy.\"\n \nIt was Wednesday and there were 5 people here.\n\nThe decor is bland and the staff is nauseatingly apathetic.  The clientele is severely yuppie (as is expected) and a drastic exaggeration to all things incorrect about neighborhood SF bars.  \n\nGo elsewhere.", "rating": 1, "date": "2011-12-28"}, {"excerpts": ["Next time, I'll try the fish and chips."], "author": "Jamie T.", "review": "Came here for trivia on a Sunday night, and this place was so much fun! \n\nFeels like a very authentic British pub in the middle of San Francisco. Nice bartenders. Friendly crowd. Competent trivia announcer. Strongbow cider on tap. Yum.\n\nEasy parking for my friends who drove, and easy access to transit.\n\nFood was ok; it's pub food.  Long wait because the place was packed. Next time, I'll try the fish and chips.", "rating": 4, "date": "2010-02-19"}, {"excerpts": ["For our first time to a place like this, we had to order the fish and chips. ", "Out comes this plate with HUGE pieces of fried fish and chips=fries. ", "This had to be the biggest (and cheapest) order of fish and chips I have ever seen! ", "We also ordered the buffalo wings, which were different than what I'm used to. ", "Instead of the sauce being on the wings, you get the cooked wings served with 3 types of sauces. "], "author": "Kimberly S.", "review": "Let me preface this review by saying that I am not a bar/pub person, so I cannot comment on Pig and Whistle's beer selection. \n\nI went here on a Sunday night for Quiz Night with co-workers and significant others, including mine. The inside looks like what I expected from a pub - wood interior, including the furniture, paintings/pictures all over the wall, a bar, and tv's. Some of the staff even complemented the ambiance of the pub with their British accent.  \n\nFor our first time to a place like this, we had to order the fish and chips. Out comes this plate with HUGE pieces of fried fish and chips=fries. This had to be the biggest (and cheapest) order of fish and chips I have ever seen! We also ordered the buffalo wings, which were different than what I'm used to. Instead of the sauce being on the wings, you get the cooked wings served with 3 types of sauces. Others in my group also ordered food and were happy with their selections.\n\nThere was a good crowd there for Quiz Night. Some had to be regulars! What you do is get into groups of however many people you want, and form teams. There are many different rounds which involve a variety of topics such as current events, geography, a celebrity picture round, or music. It was fun to see what kinds of random facts people know! Basically which ever group can answer the most questions correctly wins a prize. That night it was $30 cash. Although I don't drink, the rest of my group surely does, so the pitchers kept coming. Good food + beer = good fun and happy people!", "rating": 4, "date": "2009-03-04"}, {"excerpts": ["The food is typical bar food of burgers, fries, chicken fingers, and fish and chips. ", "The Tipsy Pig is a great place to stop for a beer and fries."], "author": "Rebecca D.", "review": "A good neighborhood bar with plenty of beers on tap, tv to watch, and some food to order if your hungry. They have about 10 beers on tap, which is great for someone who prefers their beer that way and it gives you plenty of selection from Anchor Steam Liberty to Guinness. The food is typical bar food of burgers, fries, chicken fingers, and fish and chips. The Tipsy Pig is a great place to stop for a beer and fries.", "rating": 3, "date": "2011-12-05"}, {"excerpts": ["The prices are great: 3 orders of fish and chips, 1 order of shepard's pie, and 2 pitchers of beer was around $60."], "author": "Justen P.", "review": "The P&W offers a college-bar like atmosphere and is a great place to kick back and relax while you're enjoying a good brew. The crowd here is lively and the staff is pretty good too. The prices are great: 3 orders of fish and chips, 1 order of shepard's pie, and 2 pitchers of beer was around $60.", "rating": 4, "date": "2012-02-19"}, {"excerpts": ["Fish and Chips! "], "author": "Judy L.", "review": "Happy Hour! $3.50 Bottingtons $2.75 other beers.\n\nHoly, this place serves REAL food. Mashed potatoes and meat! Fish and Chips! Great place for a late night meal!\n\nSoccer on the tube all the time. Free pool on Sundays from noon until 8pm. Darts too!", "rating": 4, "date": "2008-07-11"}, {"excerpts": ["It's quite a cute little pub, with good beer and good snack foods (beer batter mushrooms and stuff jalapenos were delish...the fish and chips looked good too) at a reasonable price.\n\n"], "author": "Fontane L.", "review": "I have been going to the Pig & Whistle to see my friend play pool for a tournament.  I can't believe I've lived in the area so long and never been.  It's quite a cute little pub, with good beer and good snack foods (beer batter mushrooms and stuff jalapenos were delish...the fish and chips looked good too) at a reasonable price.\n\nIt's a good place for chillin' with a small group of friends (5-6 people at most), but not really for anything larger than that.", "rating": 4, "date": "2009-12-10"}, {"excerpts": ["Everyone except Andrea and me got the fish and chips. ", "I ventured forth and grabbed a shepherd's pie (anything topped with luscious mash potatoes is always a goodie). ", "The ground beef were moist and juicy with lots of peas and onions to flavor it out. ", "The dish came with yummy veggies, then  ", "I ordered fish chowder for the first time....", "ummm...", "it was really fishy, but watery. ", "the flavor and the watering of my eyes pretty much told me that I wasn't pouring that over my sample of fish and chips...hehe...", "Everyone's fish fry was tongue-burning hot. ", "And the fries were thick cut and crispy. ", "I really liked the calamari...", "wow..."], "author": "Pauline L.", "review": "My teeth are going crooked, there's a wee bit of a hair growing betwixt my eyebrows, and a got a banging faux Brit accent...yup! My foodie gang hit upon the British coast of pub grub.\n\nEveryone except Andrea and me got the fish and chips. I ventured forth and grabbed a shepherd's pie (anything topped with luscious mash potatoes is always a goodie). The ground beef were moist and juicy with lots of peas and onions to flavor it out. The dish came with yummy veggies, then  I ordered fish chowder for the first time....ummm...it was really fishy, but watery. I'm used to chowder being thick and creamy...sigh....but the soft giant pieces of bread were carb heaven.\n\nAs a pub virgin, I've never heard of malt vinegar...the flavor and the watering of my eyes pretty much told me that I wasn't pouring that over my sample of fish and chips...hehe...Everyone's fish fry was tongue-burning hot. And the fries were thick cut and crispy. I really liked the calamari...wow...it was nice big pieces.\n\nThe pub has nice wooden tables for groups, a dart board area for times where you wanna stab needles into something, and the back area had pool tables.  One thing everyone should never do, is grab your hands on the tables edges...I had what must have been a decades worth of goop under those tables smeared on my fingers. \n\nThe food is very reasonable, not expensive, and if they'd despackle the grime under the table...not a bad place to hang out in.", "rating": 4, "date": "2009-05-31"}, {"excerpts": ["Tried their fish and chips (~$10) and few beers ($3 per pint, except Guinness $3.5) during happy hour. \n\n", "The fish and chips was so bland that I added plenty of salt and pepper just to finish one piece of fish. ", "The other piece was untouched. ", "The chips/fries were even worse; I only ate one piece. ", "SAVE YOUR ", "$10 and SKIP THIS "], "author": "Ed W.", "review": "Tried their fish and chips (~$10) and few beers ($3 per pint, except Guinness $3.5) during happy hour. \n\nThe fish and chips was so bland that I added plenty of salt and pepper just to finish one piece of fish. The other piece was untouched. The chips/fries were even worse; I only ate one piece. SAVE YOUR $10 and SKIP THIS GARBAGE.\n\nP&W has a good beer selection. That is the only thing positive about this place. I would only go back on Sunday for the free pool.", "rating": 1, "date": "2010-08-28"}, {"excerpts": ["Add in real fish and chips (a whole filet - with malt vinegar, and HP sauce for the chips) "], "author": "Adam B.", "review": "The Pig and Whistle is a place that I have wasted time, talent and brain cells many, many times.\n\nI love it.\n\nThe bartenders are great, and a $2.50 pint of Newcastle just can't be beat.  Add in real fish and chips (a whole filet - with malt vinegar, and HP sauce for the chips) and you've got the perfect place to drink away a weekday.\n\nTrivia nights on Wednesday are also great.  Nothing boosts flagging self-esteem more surely or less justly like being the one to remember that the B-52s sang \"Roam.\"*\n\n(Unfortunately, I did not remember that - and my team lost.  Sorry guys)", "rating": 5, "date": "2008-01-25"}, {"excerpts": ["The fish and chips are the best I've ever had and talk about reasonably priced.  ", "The beer selection is excellent.  ", "I'm mad about the Fuller's on tap.  ", "The interior is just what one would expect of a pub and the parking in the area is pretty decent.  ", "The young gentleman witht he mustache who works there has treated me kindly ever since I've been going there and considering all the rude bartenders in this town that's a jewel in the crown ", "all of its own.  ", "This place is fabulous!"], "author": "Sin F.", "review": "This place is a find.  The fish and chips are the best I've ever had and talk about reasonably priced.  The beer selection is excellent.  I'm mad about the Fuller's on tap.  The interior is just what one would expect of a pub and the parking in the area is pretty decent.  The young gentleman witht he mustache who works there has treated me kindly ever since I've been going there and considering all the rude bartenders in this town that's a jewel in the crown all of its own.  This place is fabulous!", "rating": 5, "date": "2011-10-03"}, {"excerpts": ["The fish and chips were outstanding.  ", "The chips, or French fries to us in the USA , were Fresh, not frozen.\n"], "author": "Chad M.", "review": "My family and I dined at the pig and whistle last night.  Although the place was quite noisy, the food was great.  You go to the bar to order, and after just a short wait, we were served.  The fish and chips were outstanding.  The chips, or French fries to us in the USA , were Fresh, not frozen.\nThe burgers and shepherds pie were also good.  The beer was top notch as well.  The bill for 4 was less than $50.  You can not do that very often in SF.", "rating": 5, "date": "2009-04-12"}, {"excerpts": ["A bunch of co-workers got the fish and chips -- they raved about the fish, but felt the fries were a little weak.\n\n"], "author": "Tim G.", "review": "For lunch, there is ample parking all around Geary -- which is key.\n\nThis is what I thought Liverpool Lil's would be like -- an authentic British pub.\n\nTheir shepherd's pie is fantastic.  In the bay area, perhaps only the Mayflower approaches the quality.  A bunch of co-workers got the fish and chips -- they raved about the fish, but felt the fries were a little weak.\n\nI'll be heading here regularly for lunch.  If you see me, I'm the guy drinking Bass in the corner not wearing the painter's frock or the caltrans uni.", "rating": 4, "date": "2005-11-15"}, {"excerpts": ["I didn't try the food but it looked good, especially the fish and chips, which was a huge portion.\n\n"], "author": "Courtney D.", "review": "Very authentic pub. I really liked the feel of the place. Kinda small, but definitely a good vibe -- felt like a neighborhood bar back in Philly. Great beer selection and good prices. I didn't try the food but it looked good, especially the fish and chips, which was a huge portion.\n\nI went on a Wednesday night and played trivia with friends. Interesting questions, great turnout and a lot of fun.", "rating": 3, "date": "2008-07-15"}, {"excerpts": ["The best Fish and Chips I ever had believe it or not was at the IVY in Beverly Hills--", "I dont know why in fuck they made it ", "but they did ", "and it was amazing. ", "BUT, a close second would have to be Pig & Whistle's Fish and CHips ", "no diggity ,no doubt. ", "Great atmosphere. ", "Amazing jukebox(THEY HAD JOY DIVISION WTF!!!).  ", "My best friend Gabe had a shephards pie that could bring down an international superpower. ", "Their wine sucks there though, but who goes to pubs to drink wine...", "oh ya snobs like me."], "author": "Lauren V.", "review": "The best Fish and Chips I ever had believe it or not was at the IVY in Beverly Hills--I dont know why in fuck they made it but they did and it was amazing. BUT, a close second would have to be Pig & Whistle's Fish and CHips no diggity ,no doubt. Great atmosphere. Amazing jukebox(THEY HAD JOY DIVISION WTF!!!).  My best friend Gabe had a shephards pie that could bring down an international superpower. Their wine sucks there though, but who goes to pubs to drink wine...oh ya snobs like me.", "rating": 3, "date": "2005-06-30"}, {"excerpts": ["my fish and chips were battered to perfection.  ", "crunchy and buttery, but not so greasy that i felt ill (frequently a problem with fried food).  "], "author": "Roshni R.", "review": "i came here for dinner last night with some good friends, and it was absolutely perfect.  the decor was right out of many an english pub i'd ventured into in london, but it was pleasantly quiet on that random tuesday evening.  service was excellent (you have to go up to the bar to order your food), and the bartender was this kind but gruff irishman.\n\nthe food was *excellent*.  for an appetizer, we had the curry fries (which i've never had before, anywhere) and they were simply scrumptious.  my fish and chips were battered to perfection.  crunchy and buttery, but not so greasy that i felt ill (frequently a problem with fried food).  my friends ordered the shepherd's pie and the chicken curry masala, and both enjoyed their meals thoroughly.\n\nin fact, my only problem with this place was the slightly frenetic music selection.  hip-hop, george michael, rap????  no no no....i'm still giving it 5 stars though for the ambience and the food, since that's all i went there for!", "rating": 5, "date": "2006-03-22"}, {"excerpts": ["The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. ", "Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. ", "The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. ", "British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. ", "There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. ", "Calling all Anglophiles!"], "author": "Gourmet G.", "review": "Its name is derived from the Old English words 'Piggin,' a large lead cup used to serve spiced wine, and 'Wassail,' the wine itself, and it's as authentic a British pub as you can find outside Henley-on-Thames or some such similar riverside town in the UK. The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. Calling all Anglophiles!", "rating": 5, "date": "2005-08-02"}, {"excerpts": ["Great fish and chips, and when they have it, fried chicken."], "author": "Noelle Q.", "review": "Trivia night every Wednesday has become a key facet of my social calendar. When else will you be considered brilliant because you know the name of Eddie Murphy's alter ego in the Nutty Professor? (Its Buddy Love btw). Great fish and chips, and when they have it, fried chicken.", "rating": 4, "date": "2005-12-21"}, {"excerpts": ["Great food (fish and chips can be a bit bland "], "author": "Tyler W.", "review": "This place is literally 700 feet from my house, needless to say I frequent it.  Now I essentially live @ work and school, so i don't come as often as I'd like, and I don't have as good a grasp on this bar as say the Dogpatch or Mission Bars. But let me tell you about this little gem.\n \nGreat food (fish and chips can be a bit bland but shepherds pie = god)\nAmple free pool & less ample free darts (save your quarters for laundry!)\nPitchers of plentiful beer selection.\nNeat mixed crowd, lots of folk. Make no mistake, this is a scots bar!\n\nSo as you can see, this is a great freaking bar. Now let me regale you with why I decided to yelp it now, after attending quite a few times.  With Bars I like to have a real story before I yelp them, unless they really stand out or I might be the first to yelp em.  Often also I go home and drunk yelp the place only to find that i never actually submitted my review and just forgot about it entirely. This was not the case with PNW, this was...\n\nSo I had just gotten off a long shoot (where we totally nailed the product shot, only to see that the Heineken bottle was out of focus, so much for an A on that film project). Rode the bus home, showered, and ba-dum-sum-cha my buddy Dave is at my door with a 12-pack of Newcastle.  We crack em open, let the dogs run out back and start talking about school.  Shortly after my friend (and now yelp friend) George M. shows up as well.  A few more beers later we mosey to the Pig and Whistle to meet an actor from our school + girlfriend, Dave's girlfriend Jill and her two co-workers, Later to be met by friend Kent. This is where the night turned bad.  Now Dave is as solid as a brick wall, but he acts crazy. Most people would think him pulling his knife on me three times was why it went bad, you'd be wrong (and if you thought that, you wouldn't be friends with Dave). Now Jill is always a hoot-n-a-half so no problems there. Kent is an awesome guy and George has quite a few markings of \"coolest mother on the planet.\" So we've eliminated them, which leaves us with, Jill's co-workers.  OK, they were really nice for awhile - kinda dull, but that's more than ignorable with pitcher after pitcher of beer and a group of 9 people. But it all goes downhill when you start proclaiming that this is such a nice Irish bar. It's Scottish, I don't expect you to know that, but I'm Irish and I'm sensitive about that stuff. Of course it's a small mistake, all is forgiven. Then the new tidbit of insight from a blonde's head was that my friend \"looked like marina boys.\"  That's a bad move, he doesn't like the Marina, and he lives close enough to catch shit for it regularly.\n\nHere's the similarities between my group and yours, we don't live in the Marina.\nHere's the differences, my group doesn't think it's a compliment to be called Marina-esqe. \n\nSo please young woman, if you are so hateful about living in the Sunset (understandable) then move out, go to the Marina! If there's anything more sad than a Marina mom it's a Marina wannabe. But that was really just more funny than anything else as my friend decided to push the issue, \"What about me makes you think Marina, seriously I'm not going to hold it against you, I want to know so I can rid myself of it, what makes you think Marina?\" Her back peddle and eventual excuse was hilarious. More importantly the other friend (after a solid four hours of drinking), pulls a half eaten burrito from her purse and begins munching on it. It wasn't wrapped well in the foil, I'm sure there are rice and beans all over her purse. I proceed to ask her with awe \"where'd you get that?!\" I'm meaning, why was it in your purse, she's a bit more literal and states some place in union sqaure. She didn't know the name. She goes there twice a week. What, is wrong, with her?\n\nShe should know the place's name, she shouldn't have left it in her purse, and for god sakes \"real San Franciscans don't eat Mexican food anywhere but the mission. Not even in Mexico!\" (Sally K.)\n\nanyway, called em a cab and went to bed -- just another night in laurel heights -- and a vote for why you met girls at the bar, and don't bring them with you.\n\nProximity to the Bridge Theater (currently playing Grindhouse) is a huge plus and bumps it up to the 5th star!", "rating": 5, "date": "2007-04-07"}, {"excerpts": ["Place smells incredibly of fish and chips. ", "That's not a value judgement, but consider yourself warned if you don't like that type of thing."], "author": "Kris E.", "review": "Came here for pre-movie drinks on a Saturday. Great happy hour specials of $3 pints. Awesome beer selection and an authentic atmosphere, which you don't get a lot in SF. \n\nPlace smells incredibly of fish and chips. That's not a value judgement, but consider yourself warned if you don't like that type of thing.", "rating": 4, "date": "2009-01-26"}, {"excerpts": ["We got the fish and chips, jalapeno poppers, onion rings, and some other fried food I can't remember.  ", "Nice place to go if you just want to relax and get some grub.  ", "There's a pool table in the back as well as darts to keep you occupied."], "author": "Sarah F.", "review": "Nice pub, good fried food.  My date and I ordered WAY too much food, though.  We got the fish and chips, jalapeno poppers, onion rings, and some other fried food I can't remember.  Nice place to go if you just want to relax and get some grub.  There's a pool table in the back as well as darts to keep you occupied.", "rating": 3, "date": "2008-01-25"}, {"excerpts": ["I enjoy the fish and chips here as well as the boddington's...good place to  spend a lazy afternoon."], "author": "Charlene L.", "review": "This is the place for a meeting after the meeting, if you know what I mean. I enjoy the fish and chips here as well as the boddington's...good place to  spend a lazy afternoon.", "rating": 5, "date": "2006-07-04"}, {"excerpts": ["It's got a nice relaxed vibe and the fish and chips are yummy. ", "I wish they had a fooseball table but they don't. ", "Sigh. ", "So only three stars."], "author": "Cathy T.", "review": "I live a block away from the Pig & Whistle and it's the closest thing I have to a neighborhood bar. It's got a nice relaxed vibe and the fish and chips are yummy. I wish they had a fooseball table but they don't. Sigh. So only three stars.", "rating": 3, "date": "2006-05-28"}, {"excerpts": ["Bangin' bangers and mash, gravy-licious steak and mushroom pie and fresh fish and chips.  ", "I've been back to eat every week for the past three weeks.  ", "Very nice staff.  ", "They even call me lad... and I'm asian!"], "author": "Ed G.", "review": "After living in the neighborhood for nearly 8 years, I've ventured into the P&W only a handful of times.  Never to eat, always to drink.  As far as drinking goes, pretty standard.  What got me writing this review is the food.  A very pleasant surprise.  Bangin' bangers and mash, gravy-licious steak and mushroom pie and fresh fish and chips.  I've been back to eat every week for the past three weeks.  Very nice staff.  They even call me lad... and I'm asian!", "rating": 3, "date": "2007-10-10"}, {"excerpts": ["Good burgers and the Fish and Chips is huge.  ", "Big thing to hit is the Pub Quiz on Weds. ", "nights.  ", "Local drunks are very friendly."], "author": "Michael M.", "review": "Great place to have a drink in the neighborhood.  Good burgers and the Fish and Chips is huge.  Big thing to hit is the Pub Quiz on Weds. nights.  Local drunks are very friendly.", "rating": 4, "date": "2009-03-16"}, {"excerpts": ["Good fish and chips, good atmosphere, good pub!"], "author": "chris m.", "review": "Good fish and chips, good atmosphere, good pub!", "rating": 4, "date": "2007-04-16"}, {"excerpts": ["Fish and chips are acceptable ", "but I'm not there to have dinner.  ", "The drink prices are very reasonable and the bartenders (thank goodness!) know how to make a Black Velvet."], "author": "Eileen Q.", "review": "One of my favorite places to go for pub trivia.  Fish and chips are acceptable but I'm not there to have dinner.  The drink prices are very reasonable and the bartenders (thank goodness!) know how to make a Black Velvet.", "rating": 4, "date": "2007-02-08"}, {"excerpts": ["Great fish and chips, except that every once in a while, the chips come out like half-raw potatoes or greasy little clumps.  ", "They are a major disappointment; I'm sure made with bargain-basement beef and served with the same take-what-you-get fried potatoes as come with the fish and chips.\n\n"], "author": "Richard C.", "review": "Great fish and chips, except that every once in a while, the chips come out like half-raw potatoes or greasy little clumps.  I'm not sure why the fries are so inconsistent when the fish is almost always great.\n\nDon't bother with the burgers.  They are a major disappointment; I'm sure made with bargain-basement beef and served with the same take-what-you-get fried potatoes as come with the fish and chips.\n\nBeer!  The Pig and Whistle excels in both the variety of beers and how they serve them.  If nothing else, I'd probably return to this place for the fish and beer--to hell with the chips.", "rating": 4, "date": "2006-10-11"}, {"excerpts": ["Whether I have the best fish and chips in town or the sausage rolls, the fare while not haute cuisine is exactly what one expects in a traditional British pub and they deliver ten times out of ten. ", "They also keep an excellent selection of draught beers on tap. ", "Plus, they now have a full bar and live music most weekends (usually no cover)."], "author": "D Scott D.", "review": "I've been going to the Pig and Whistle for going on ten years and I am never disappointed. Whether I have the best fish and chips in town or the sausage rolls, the fare while not haute cuisine is exactly what one expects in a traditional British pub and they deliver ten times out of ten. They also keep an excellent selection of draught beers on tap. Plus, they now have a full bar and live music most weekends (usually no cover).", "rating": 4, "date": "2007-10-05"}, {"excerpts": ["Fish and chips rule! ", "Prices are great.  ", "But the best thing about the Pig and Whistle is that they will let you play Risk for hours as long as you keep buying drinks."], "author": "Erin L.", "review": "Love this place! Best English Pub in town.  Fish and chips rule! Prices are great.  But the best thing about the Pig and Whistle is that they will let you play Risk for hours as long as you keep buying drinks.", "rating": 5, "date": "2010-04-13"}, {"excerpts": ["when asab was closed on sunday night, my roomies and i stumbled upon pig and whistle for gargantuan portions of beer battered fish and chips.  ", "beers were dangerously cheap and  sundays you'll find free pool until 8.  ", "they ended up hosting us for trivia, which included a picture sheet of famous people (including a young john wayne- which we guessed correctly, thank you!) and songs (featuring tori amos and the bangles)!"], "author": "Emily J.", "review": "when asab was closed on sunday night, my roomies and i stumbled upon pig and whistle for gargantuan portions of beer battered fish and chips.  beers were dangerously cheap and  sundays you'll find free pool until 8.  they ended up hosting us for trivia, which included a picture sheet of famous people (including a young john wayne- which we guessed correctly, thank you!) and songs (featuring tori amos and the bangles)!", "rating": 4, "date": "2008-09-14"}, {"excerpts": ["though, i will definitely recommend their fish and chips.\n\n"], "author": "Dayman D.", "review": "big fan of the whistlin' pig. great staff all the way around. good vibe, mellow crowd. jukebox has a good selection. decent but small pool table in the back, and a dart board. \n\ntwo bathrooms! \n\nside exit for easy smoke breaks and make-out sessions. \n\nthey even have a pinball machine. parking is usually very easy. i would say good selection of beer, not great. but, they have somewhere around 20 on tap, not too shabby. \n\nthe food is definitely bar food, none of it very special. though, i will definitely recommend their fish and chips.\n\nthey do have a trivia night, but its pretty much the same as the ten thousand other places in the city.\n\nunderberg shots for $3!", "rating": 4, "date": "2009-08-13"}, {"excerpts": ["best fish and chips in the city- hands down, no contest!"], "author": "Beth M.", "review": "best fish and chips in the city- hands down, no contest!", "rating": 4, "date": "2007-12-18"}, {"excerpts": ["Healthy sized shots and possibly the best fish and chips in the city!  ", "They also sponsor a cool softball team."], "author": "Marko C.", "review": "Great place!  Very comfortable environment!  Great beer selection!  Healthy sized shots and possibly the best fish and chips in the city!  They also sponsor a cool softball team.", "rating": 4, "date": "2008-07-22"}], "burger and fries": [{"excerpts": ["First off, burger and fries are superb. ", "Exactly what one would expect from a bar. ", "Love the thick cut potatoes. ", "Patty was a perfect med rare. ", "Add a pint if you're feeling frisky. "], "author": "Abby S.", "review": "Not too bad for a burger 'n' fries lunch. \n\nBy chance, was in the neighborhood for a few hours and needed a place to eat and have a quick conference call. Rather than sit in a noisy coffee shop or risk talking and driving, figured this quaint pub would be a proper Plan B.\n\nI wouldn't encourage turning Pig and Whistle into your next coworking space, but it got the job done quite literally for a few hours. \n\nFirst off, burger and fries are superb. Exactly what one would expect from a bar. Love the thick cut potatoes. Patty was a perfect med rare. Add a pint if you're feeling frisky. Sprite for me since I was driving.\n\nSince it was still early there weren't too many patrons to mind that I was on a laptop with earbuds. I found a quiet corner in the back and chatted it up as non-obtrusively as possible. \n\nReally nice bartender. Appreciate him leaving me be. Paid and left without any fuss.\n\nI want to come back for a burger, beer and trivia.", "rating": 4, "date": "2015-09-09"}, {"excerpts": ["Instead you get hearty grub like meat pies, bangers n mash, burger and fries or what we all ordered: THE Breakfast: scrambled eggs, bacon, potatoes, toast and sausage and beans for less than $10. \n\n"], "author": "Janice C.", "review": "Why does Sunday brunch have to be a waiting nightmare?\n\n* I'm looking at you Corner Store, uh, right around the corner from this pub! *\n\nIt doesn't have to be! Starving (but not stoned) is not a good feeling to have. For casual, no wait, brunch food with big portions, Pig & Whistle is the answer. Don't look for traditional pancakes and french toast during weekend brunch. Instead you get hearty grub like meat pies, bangers n mash, burger and fries or what we all ordered: THE Breakfast: scrambled eggs, bacon, potatoes, toast and sausage and beans for less than $10. \n\nWednesday night is trivia night with $3.50 beers. With a traditional pub atmosphere that's cozy and welcoming, no doubt I'll be back.", "rating": 4, "date": "2014-08-24"}, {"excerpts": ["We decided to order the Shepherd's Pie and a burger and fries for dinner. ", "I didn't have the Shepherd's Pie but it looked absolutely delicious if you are into savory food. "], "author": "Stephanie C.", "review": "3.5 STARS\n\nThe boyfriend and I were looking for some comfort food and a place to watch the Giants game for a bit before going out. The Pig & Whistle was close by so we decided to stop in.\n\nIt was pretty busy for a Friday night, which I'm sure was mostly due to the fact that the Giants were playing, but I have a feeling that it's not the only reason. Pig & Whistle is definitely a cozy, neighborhood bar and I can see why it attracts many patrons.\n\nThey have the usual bar food and many beers on tap. We decided to order the Shepherd's Pie and a burger and fries for dinner. I didn't have the Shepherd's Pie but it looked absolutely delicious if you are into savory food. My burger was juicy and the fries were great - I love wedge cut fries! \n\nThis is definitely a solid spot to watch a game and grab some food but I wish they had more tv's! I was stuck watching a Phillies (ew!) game the whole time because the Giants game was on the tv way in back of me. Other than that, I will definitely consider Pig & Whistle when I need a quick bite to eat and want to catch a game.", "rating": 3, "date": "2012-05-07"}, {"excerpts": ["We ordered a burger and fries, and fish and chips. ", "Both were great for the price and we will visit again!"], "author": "Brigette A.", "review": "For a down-home bar experience and good food is recommend this place. The bar tenders were friendly, and I enjoyed the atmosphere - very casual and comfortable. We ordered a burger and fries, and fish and chips. Both were great for the price and we will visit again!", "rating": 5, "date": "2015-06-22"}], "grilled chicken breast": [], "banger roll": [], "bangers and mash": [{"excerpts": ["A decent British-themed neighborhood pub with lots of familiar items like fish and chips, bangers and mash, shepherd's pie, and even chicken curry - as well as more familiar and ubiquitous bar bites like burgers, chicken nuggets, onion rings, and calamari. "], "author": "Vincent L.", "review": "A decent British-themed neighborhood pub with lots of familiar items like fish and chips, bangers and mash, shepherd's pie, and even chicken curry - as well as more familiar and ubiquitous bar bites like burgers, chicken nuggets, onion rings, and calamari. There's a decent selection of beers, although these are generally more pan-European than specifically British.\n\nThe vibe is casual and unassuming, and the bartenders are friendly and professional. A nice place to have in the neighborhood.", "rating": 3, "date": "2017-09-19"}, {"excerpts": ["Highly recommend the bangers and mash with baked beans. ", "Great beers and ciders on tap and perfect place to catch your favorite sports team. ", "Large room in back for parties of 6+ people. ", "Helpful tip for first-timers: food AND drink orders are placed at the bar."], "author": "Sarah N.", "review": "Lovely little pub with a great happy hour and wonderful service! Highly recommend the bangers and mash with baked beans. Great beers and ciders on tap and perfect place to catch your favorite sports team. Large room in back for parties of 6+ people. Helpful tip for first-timers: food AND drink orders are placed at the bar.", "rating": 4, "date": "2017-09-28"}, {"excerpts": ["I also tried their Bangers and Mash, it was good. ", "It was tasty and filling.  ", "The ambiance of the place was very good, not too crowded or loud.  "], "author": "Hiroshi K.", "review": "This is a nice pub.  The staff is friendly and the service is very good. The quality of the food is good.  Based on my previous visits.  I really like their Apple Cider and Shandy.  I also enjoyed their Cornish Pasty.  It was big, flaky, and stuffed with mashed potatoes and meat.  It also came with a side salad.  Their Sausage Rolls and Calamari Rings were Okay.  Their Onions Rings were good. It was big and appeared to be beer battered. I also tried their Bangers and Mash, it was good. It was tasty and filling.  The ambiance of the place was very good, not too crowded or loud.  I would definitely come to this place again.\n\nAlso, when you order food and drinks you need to order at the bar and pay first.", "rating": 4, "date": "2016-01-20"}, {"excerpts": ["Great bangers and mash! ", "The sausages were perfect and the mashed potatoes and gravy were wonderful. \n", "Good atmosphere, good prices and service was very quick."], "author": "Carly R.", "review": "Great bangers and mash! The sausages were perfect and the mashed potatoes and gravy were wonderful. \nGood atmosphere, good prices and service was very quick.", "rating": 5, "date": "2017-04-23"}, {"excerpts": ["I came back this past Sunday because the girl was craving some bangers and mash (she's Scottish who was born in the UK).  ", "I had the wings and fried calamari.  ", "The wings were breaded, which is not my preference.  ", "The fried calamari was also overly breaded, but the flavors were nice.  ", "In the past, I've had the bangers and mash, Sheppard's pie, and jalepeno poppers, all of of which were good.\n\n"], "author": "Ronald T.", "review": "Good brews, good food, and Trivia Night.  Needless to say, I've been back a few times.\n\nI used to live around the corner while in law school at USF and frequented this place on a few occasions.  I came back this past Sunday because the girl was craving some bangers and mash (she's Scottish who was born in the UK).  I had the wings and fried calamari.  The wings were breaded, which is not my preference.  The fried calamari was also overly breaded, but the flavors were nice.  In the past, I've had the bangers and mash, Sheppard's pie, and jalepeno poppers, all of of which were good.\n\nThe 4-star review is mostly for the service and bar, but the food deserves a solid 3-3.5.", "rating": 4, "date": "2015-09-08"}, {"excerpts": ["Anyways, let's talk about the food, we ordered the shepards pie, buffalo wings, bangers and mash, sausage rolls. ", "like 8 pieces \nbangers and mash: I don't know what to say about it...", "it was good. ", "TRUST.\n", "sausage rolls: like meat in a blanket? ", "surrounded by puff pastry. ", "Comes with 5 pieces! great to share"], "author": "Priscilla W.", "review": "Why haven't I discovered you sooner!??!! \n\nCame here last night for trivia night (wednesdays!) Get there early (~6/7) to snag a good seat (especially if you're coming with a group of +4) \n\nTrivia starts at 8:30pm and runs to 11pm. 1st place gets $30! \n\nAnyways, let's talk about the food, we ordered the shepards pie, buffalo wings, bangers and mash, sausage rolls. all: NOMMMM\n\nShepards pie, what's not to love: beef, gravy, peas under a bed of mashed potatoes neatly designed. comes with a side of beans or veggies \nBuffalo wings: crispy and brown...fried....comes with 3 dipping sauces: BBQ, buffalo ?__? and ranch or blue cheese....one of those.... like 8 pieces \nbangers and mash: I don't know what to say about it...it was good. TRUST.\nsausage rolls: like meat in a blanket? surrounded by puff pastry. Comes with 5 pieces! great to share", "rating": 5, "date": "2013-08-29"}, {"excerpts": ["I had the bangers and mash which was tasty and a great value price wise. ", "Most of the dinners are less than $10 for a pretty decent sized plate (unlike the \"small plates\" common at restaurants in SF nowadways). ", "We also had some appetizers including curry chips, calamari and hot wings. ", "I would probably not get calamari in the future but the hot wings were pretty good."], "author": "J L.", "review": "Solid pub with good selection of beers, TVs for watching sports, and plenty of sitting room. We came here on a weeknight in search of dinner, so the review is mostly about the food. It's self-seating and you have to order food at the counter. The food took a bit of time to arrive but was overall a solid meal. I had the bangers and mash which was tasty and a great value price wise. Most of the dinners are less than $10 for a pretty decent sized plate (unlike the \"small plates\" common at restaurants in SF nowadways). We also had some appetizers including curry chips, calamari and hot wings. I would probably not get calamari in the future but the hot wings were pretty good.", "rating": 4, "date": "2017-03-20"}, {"excerpts": ["My friend's Bangers and Mash that I tried was ", "mediocre - sausage was generic (like what you can get at a store) and the mash was bland.  ", "Similarly, the mashed potatoes on my other friend's Shepherd's Pie was the same, but at least she had the meat underneath to give it some taste.  ", "I haven't had many Shepherd's Pies in my life, but she said it reminded her of a frozen version in a way.  "], "author": "Mike L.", "review": "Came back a few weeks after my first trip when a couple of my friends rented out the back area of the bar for their joint birthday party.  The $300 minimum bar tab to get it wasn't terrible, but at the same time, I don't think the bar lost much business due to us taking up the space either since the front of the bar never seemed to get that busy.  In any case, we ended up ordering more than the minimum anyways, so it didn't make a difference.  The workers were all pretty friendly, but the best part are the drink prices - so cheap!  We ended up getting more rounds than we would have at other bars, so can't complain about getting more bang for your buck!  \n\nSadly, despite how great I think the bar itself is, the food here really fell short.  Such a shame too since I had some high hopes for their Fish and Chips - while the pieces of fish were big, the batter was weak and I didn't care much for the flavor.  My friend's Bangers and Mash that I tried was mediocre - sausage was generic (like what you can get at a store) and the mash was bland.  Similarly, the mashed potatoes on my other friend's Shepherd's Pie was the same, but at least she had the meat underneath to give it some taste.  I haven't had many Shepherd's Pies in my life, but she said it reminded her of a frozen version in a way.  The Pork Loin Chop that my other friend got was probably the best of the bunch, but even then it was just average.\n\nSince I know people mostly come here for the drinks first and food second, I only took off a star instead of averaging them like how I usually do.  Plus, they still have my Carlsberg!", "rating": 4, "date": "2011-06-05"}, {"excerpts": ["I was underage for about 15 of those years as I went with my family to enjoy fish and chips or bangers and mash for lunch. \n", "Ita not the high end sports bar or the gastro pub style food. \n", "Its simple..I local neighborhood restaurant \"where\neverybody knows your name (at least a few bartenders)\". ", "Come here few times a month for food or to grab a cold Guiness. ", "..\n", "Decent food, good variety of draft beers, affordable price..the decor hasnt changed..since I could remember...fantastic bar with familiar faces as I will always prefer as our watering hole!"], "author": "Satish P.", "review": "I have been going here for over 25 years. I was underage for about 15 of those years as I went with my family to enjoy fish and chips or bangers and mash for lunch. \nIta not the high end sports bar or the gastro pub style food. \nIts simple..I local neighborhood restaurant \"where\neverybody knows your name (at least a few bartenders)\". Come here few times a month for food or to grab a cold Guiness. ..\nDecent food, good variety of draft beers, affordable price..the decor hasnt changed..since I could remember...fantastic bar with familiar faces as I will always prefer as our watering hole!", "rating": 5, "date": "2014-02-03"}, {"excerpts": ["Bangers and Mash were spot on - the bangers had a good snap to the skin, and the flavors were aplenty.\n\n"], "author": "Jason J.", "review": "It's a pub.  The beer is good.\n\nBangers and Mash were spot on - the bangers had a good snap to the skin, and the flavors were aplenty.\n\nCurry fries were decent.   Food service was fast considering you're at a bar.  Bar service was equally fast, but that should be standard considering . . . you're at a bar.\n\nNot much more to say here that hasn't been said.", "rating": 4, "date": "2013-02-13"}, {"excerpts": ["Bangers and mash\n2. ", "Fish & chips\n3. "], "author": "suzanne l.", "review": "Love this neighborhood joint.  Awesome beer selection, but what I come here for is the no-frills Irish/English bar food.  My faves, in order:\n\n1. Bangers and mash\n2. Fish & chips\n3. Shepherd's pie\n\nThe crowd is a mix of true SF locals, old Irish dudes, and USF students.  A good place to watch sports, eat bar food and drink beer.  \n\nOh, and be sure to come here with your group of friends for trivia night!", "rating": 4, "date": "2012-11-03"}, {"excerpts": ["I ordered the bangers and mash, the mash wasn't so good but the bangers were pretty spot-on.  ", "Maybe next time I'll try the sheapards pie, it seemed to be popular dish at the time."], "author": "Brett D.", "review": "The Service was good, the beer selection was great but the food was just okay.  I ordered the bangers and mash, the mash wasn't so good but the bangers were pretty spot-on.  Maybe next time I'll try the sheapards pie, it seemed to be popular dish at the time.", "rating": 3, "date": "2015-06-23"}, {"excerpts": ["My friend's bangers and mash was good also,  really tasty sausage.  "], "author": "Dave S.", "review": "A solid pub, with a good variety of reasonably priced drinks and food, and a trivia guy you can't understand for the life of you.\n\nI had the shepherd's pie, which was cooked nicely, and had pretty good flavor.  My friend's bangers and mash was good also,  really tasty sausage.  The trivia was eccentric and fast paced, which was entertaining. \n\n I really wish they had a different guy reading the trivia though.  He's your typical old English bloke who you can't understand 2 words out of every sentence he says.  More than once I just wanted to yell at him \"Speak English!\"  \n\nOn top of that he had at least one trivia question that was just wrong: \"Which vowel isn't an element in the periodic table.\"  He couldn't name an element that started with A, then just said the answer was E.  When I asked him what element was A he said, \"look it up\" \"I did, there isn't one\"....then he walks away.  Pretty lame.  All in all though, trivia was fun.\n\nI had a good time here, and I would come back any time.", "rating": 4, "date": "2012-03-24"}, {"excerpts": ["Bangers and Mash baby!\n"], "author": "Kelson H.", "review": "Large selection of beers on tap, TV's a plenty for the inner and outer Bay Area sports fan.  Walls full of photos and interesting nick nacks.  Time to get your eats on with British pub food.\n\nBangers and Mash baby!\nSo come on down and wet your whistle here.\n\nDecor:5\nFood:4\nService:4\n\nWould I go back? You bet your pastrami I would!", "rating": 4, "date": "2011-07-08"}, {"excerpts": ["I've also come for breakfast pretty good bangers and mash, I've had better fish and chips but not bad at all. ", "The beer selection is not huge but it has a bit of something for everyone, which is a hard thing to pull off ", "but they do ti with ease", ", additionally they make a good fuckin' cocktail just the way i like em good and strong, yet delicious. ", "Again a tip of the hat to Jerry. ", "Its a great spot to get a bite relax and drink. ", "Needless to say i'll be back soon."], "author": "Sean MC E.", "review": "The Pig has a special place in my heart. Let me start with Jerry you're the coolest cat in town with out a doubt. Me and my buddy only come in when Jerry is around so this is more a review on him, and quite frankly the dudes the tits! More on the food and drink. typical bar food, cheap greasy, exactly why you need. I've also come for breakfast pretty good bangers and mash, I've had better fish and chips but not bad at all. The beer selection is not huge but it has a bit of something for everyone, which is a hard thing to pull off but they do ti with ease, additionally they make a good fuckin' cocktail just the way i like em good and strong, yet delicious. Again a tip of the hat to Jerry. Its a great spot to get a bite relax and drink. Needless to say i'll be back soon.", "rating": 5, "date": "2012-07-17"}, {"excerpts": ["Expect to pay about $10\n\nOrdered the bangers and mash.\n"], "author": "Sun T.", "review": "I love the bar food. Expect to pay about $10\n\nOrdered the bangers and mash.\nDrinking buddy ordered the fish and chips. He said the fish tasted kind of \"off\". We'll see what happens to him in 48 hours *LOL*\nLibations: Boddingtons\n\nIt was packed and very loud but it was a Friday night so... \n\nWe made a rookie mistake and thought someone would take our order. After 20 minutes we decided to flag down a staff member who was on his way out the door.  He told us we had to order at the front and pointed to the directions ON THE MENU!  How embarrassing for the both of us. I'm not afraid to admit my mistake. =P\n\nWe didnt hang out too long due to the noise and wanted to catch up so we headed up to Abbey Tavern.\n\nThis place looks fun and I will definitely return with a few more people.", "rating": 4, "date": "2011-03-20"}, {"excerpts": ["The one time I had the bangers and mash it was slightly subpar, it seemed like the bangers were not cooked enough. "], "author": "Dan R.", "review": "Pretty much the best all-around bar in the city. No pretense. No \"crowd\". Just well-priced drinks, attentive and friendly service, and delicious authentic British pub food. Tremendous jukebox selection as well. They have flat screens for viewing sports and a large projection screen for major sports events.\n\nUndoubtedly the best part of the P&W, are the trivia nights on Wednesdays and Sundays. Wednesday draws the largest crowds, probably because of the Sierra drink specials. There is a different host for Wednesdays and Sundays and they are both very good, except I've caught the Wednesday host repeating rounds from previous weeks.\n\nI'm only giving four stars, because the food certainly isn't gourmet. I don't think five-star British pub food exists, but this is as close as you'll get to it in SF. The burger, chicken nuggets, and sausage rolls are outstanding. The one time I had the bangers and mash it was slightly subpar, it seemed like the bangers were not cooked enough. Probably just a fluke.\n\nThe staff here is really incredible too. They are friendly and relaxed.\n\nThis is an all-around great little place to sit down and enjoy some food and drink with friends.", "rating": 4, "date": "2010-10-22"}, {"excerpts": ["Great to be able to get \"Bangers and Mash\" here; I love the fact that they have the same baked beans that they have back home in Ireland.\n", "The mash potatoes were a little soggy but all in all this was a surprisingly good bar", "; I sad I never went here when I lived relatively close by for four years.\n", "Pint of Guinness was pretty good also :)"], "author": "Bryan B.", "review": "Great to be able to get \"Bangers and Mash\" here; I love the fact that they have the same baked beans that they have back home in Ireland.\nThe mash potatoes were a little soggy but all in all this was a surprisingly good bar; I sad I never went here when I lived relatively close by for four years.\nPint of Guinness was pretty good also :)", "rating": 4, "date": "2007-04-28"}, {"excerpts": ["The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. ", "Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. ", "The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. ", "British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. ", "There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. ", "Calling all Anglophiles!"], "author": "Gourmet G.", "review": "Its name is derived from the Old English words 'Piggin,' a large lead cup used to serve spiced wine, and 'Wassail,' the wine itself, and it's as authentic a British pub as you can find outside Henley-on-Thames or some such similar riverside town in the UK. The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. Calling all Anglophiles!", "rating": 5, "date": "2005-08-02"}, {"excerpts": ["Food ain't bad either, where else are u gonna find \"Bangers and Mash\".  ", "That ", "and I've never had a bad time here... knock on wood."], "author": "Chris F.", "review": "In need to get your drink on? Don't want the hassle and crowds of clubs? Hate the pretentiousness of lounges and wine bars? This is your place. Its about as family a bar you can get, that is if your family consists of beer Ydrinkers. Like any pub the main focus here is beer. I've personally never had a mixed drink here but they do make them, just dont order no cosmo.  There's about 20 beers on tap with a good selection of domestic micro-brews and imports. Food ain't bad either, where else are u gonna find \"Bangers and Mash\".  That and I've never had a bad time here... knock on wood.", "rating": 5, "date": "2006-09-14"}, {"excerpts": ["Get yourself some Bangers and Mash or some Curry Fries, a pint, and an entry form...but get there early if you want a table!"], "author": "Pele N.", "review": "Wed night is trivia night and that is when you gotta go!  So much fun.  Great bartenders and a fun atmosphere make this a fun place for both Americans and for people who have moved from the other side of the pond.  Get yourself some Bangers and Mash or some Curry Fries, a pint, and an entry form...but get there early if you want a table!", "rating": 3, "date": "2006-07-10"}, {"excerpts": ["It's never loud or obnoxiously crowded in there which makes it a good place to grab some beer, grub on some Bangers and Mash, and catch up on the latest with your chicas.  ", "The post 9-5 crowd tends to be heavily middle-aged male.  ", "They tend to not bother you - they're far too enamored by whatever game is on.  ", "The bartenders are great though they can be difficult to get a hold of during happy hour.  ", "The food service though is pretty quick."], "author": "Jean A.", "review": "I heart the Pig, for sentimental reasons.  I used to come here quite often for happy hour (5-6) when I worked in the area.  It's never loud or obnoxiously crowded in there which makes it a good place to grab some beer, grub on some Bangers and Mash, and catch up on the latest with your chicas.  The post 9-5 crowd tends to be heavily middle-aged male.  They tend to not bother you - they're far too enamored by whatever game is on.  The bartenders are great though they can be difficult to get a hold of during happy hour.  The food service though is pretty quick.", "rating": 5, "date": "2008-03-17"}, {"excerpts": ["I ordered bangers and mash, which I usually like to get at pub places. ", "They were good. ", "The beer and other drinks seemed reasonably priced as well. ", "I would like to come back and try their English breakfast."], "author": "Helena H.", "review": "Good prices for decent food. I ordered bangers and mash, which I usually like to get at pub places. They were good. The beer and other drinks seemed reasonably priced as well. I would like to come back and try their English breakfast.", "rating": 3, "date": "2009-03-06"}, {"excerpts": ["Bangin' bangers and mash, gravy-licious steak and mushroom pie and fresh fish and chips.  ", "I've been back to eat every week for the past three weeks.  ", "Very nice staff.  ", "They even call me lad... and I'm asian!"], "author": "Ed G.", "review": "After living in the neighborhood for nearly 8 years, I've ventured into the P&W only a handful of times.  Never to eat, always to drink.  As far as drinking goes, pretty standard.  What got me writing this review is the food.  A very pleasant surprise.  Bangin' bangers and mash, gravy-licious steak and mushroom pie and fresh fish and chips.  I've been back to eat every week for the past three weeks.  Very nice staff.  They even call me lad... and I'm asian!", "rating": 3, "date": "2007-10-10"}, {"excerpts": ["so I spun over to have some bangers and mash or maybe the shepards pie. ", "Oh shit! ", "they must have changed ownership! ", "The food had no lard content and was somewhat flavorfull. ", "Look,... basic British (or welsh irish or scotch) food has little or no flavor. ", "Thats the rules. ", "Those folks either boil things in sheeps blood or alcohol, and fry or bake eveything else to tastless bland death. ", "The food is being made by someone else now and it tastes ok even when sober. ", "I love beer that could pass for liquified bread, boddingtons, newcastle, guiness,... bring it on. ", "Good jukebox still, (anyone remember 'lost in the supermarket' by the clash?) ", "and I threw some darts too. ", "I also got a couple a free ones simply by virtue of my pasty complexion and the hue of my hair. ", "Sorry ", "but I dont have a lick of Irish in me. ", "Ok so I had to abandond my newly aquired car until the next day, it was worth it."], "author": "dave p.", "review": "Been here lots. Basically these are my people and this is my jam. I just got a car again so I spun over to have some bangers and mash or maybe the shepards pie. Oh shit! they must have changed ownership! The food had no lard content and was somewhat flavorfull. Look,... basic British (or welsh irish or scotch) food has little or no flavor. Thats the rules. Those folks either boil things in sheeps blood or alcohol, and fry or bake eveything else to tastless bland death. The food is being made by someone else now and it tastes ok even when sober. I love beer that could pass for liquified bread, boddingtons, newcastle, guiness,... bring it on. Good jukebox still, (anyone remember 'lost in the supermarket' by the clash?) and I threw some darts too. I also got a couple a free ones simply by virtue of my pasty complexion and the hue of my hair. Sorry but I dont have a lick of Irish in me. Ok so I had to abandond my newly aquired car until the next day, it was worth it.", "rating": 4, "date": "2007-02-01"}], "steak and mushroom pie": [{"excerpts": ["We ordered the shepherds pie, steak and mushroom pie, and cornish pasty and they were all flavorful and good. ", "Even the vegetables were flavorful if not slightly overcooked."], "author": "LeTran B.", "review": "This is a nice place for some simple and tasty meat, gravy, and potatoes. The portions are pretty large and will fill you up. The general atmosphere is really laid back. \n\nWe ordered the shepherds pie, steak and mushroom pie, and cornish pasty and they were all flavorful and good. Even the vegetables were flavorful if not slightly overcooked.", "rating": 4, "date": "2013-06-07"}, {"excerpts": ["Bangin' bangers and mash, gravy-licious steak and mushroom pie and fresh fish and chips.  ", "I've been back to eat every week for the past three weeks.  ", "Very nice staff.  ", "They even call me lad... and I'm asian!"], "author": "Ed G.", "review": "After living in the neighborhood for nearly 8 years, I've ventured into the P&W only a handful of times.  Never to eat, always to drink.  As far as drinking goes, pretty standard.  What got me writing this review is the food.  A very pleasant surprise.  Bangin' bangers and mash, gravy-licious steak and mushroom pie and fresh fish and chips.  I've been back to eat every week for the past three weeks.  Very nice staff.  They even call me lad... and I'm asian!", "rating": 3, "date": "2007-10-10"}, {"excerpts": ["I'll go back for a pint and a nice hearty steak and mushroom pie any day."], "author": "Caitlin H.", "review": "Good place. I had a weekend lunch here with a friend. It was mostly empty, but I assume it gets more buisiness at other times. I lived in England for a year and miss the pub grub. This place does a worthy rendition and has the right feel - only thing missing is the haze of cigarette smoke, which, though gross and totally non-California, does make for a  complete pub experience. Other than that though, this place is pretty authentic. The guy behind the bar was nice too. I'll go back for a pint and a nice hearty steak and mushroom pie any day.", "rating": 5, "date": "2006-09-04"}], "pork loin chops": [], "shepherds pie": [{"excerpts": ["Who wants to eat at a place with an 87/100 score and serves shepherds pie that gives you the shits? ", "Not to mention the owner is a racist piece of shit who pours drinks on customers who he dislikes. ", "Heads up, he'll try to lie and say it didn't happen and have other people back him up on Yelp. ", "Try a decent, genuine pub than this crappy, outdated pathetic excuse for a bar."], "author": "Mary Ellen C.", "review": "I wouldn't eat here. Who wants to eat at a place with an 87/100 score and serves shepherds pie that gives you the shits? Not to mention the owner is a racist piece of shit who pours drinks on customers who he dislikes. Heads up, he'll try to lie and say it didn't happen and have other people back him up on Yelp. Try a decent, genuine pub than this crappy, outdated pathetic excuse for a bar.", "rating": 1, "date": "2017-11-28"}, {"excerpts": ["I ordered curry fries and a shepherds pie. ", "The curry fries were just average. ", "The curry lacked flavor ", "so I ended up just dipping the fries in ketchup. ", "The shepherds pie was amazing though. ", "It was a mix of beef, carrots, mushrooms, and peas. ", "I loved it! "], "author": "Ray W.", "review": "The service was great. Both the bartenders were super friendly and helpful. They brought out the food super fast too and thanked us for coming right when they brought out the food instead of after we paid he bill. \n\nI ordered curry fries and a shepherds pie. The curry fries were just average. The curry lacked flavor so I ended up just dipping the fries in ketchup. The shepherds pie was amazing though. It was a mix of beef, carrots, mushrooms, and peas. I loved it! Definitely recommend it. \n\nMy girlfriend had the burger, which was pretty delicious as well. The patty had a heavy meat flavor which I loved. \n\nMy only complain is that there isn't much seating but it's a pub so you can't expect too many tables. Overall it was a great experience. I would definitely recommend coming here.", "rating": 4, "date": "2014-04-12"}, {"excerpts": ["Shepherds pie was like 9 dollars and their wings were like 6.50. ", "Cheap and great value at a bar. ", "I mean who cares if some of their foods are frozen and canned gravy when they have like 10 beers on tap at like 5.50 a pint. ", "We ate and had a beer each and the total came to 38 something. ", "I left happy getting my fried food fix and told myself I will return with my guy friends at some time and spend hours there drinking and eating."], "author": "B K.", "review": "I wanted to eat some British pub food and this place was open late. We got there at 9pm and asked if they still serve food. They were doing trivia night and it was pretty packed. They have a room in the back with tables and a tv which was empty when I got there but 2 seats at the bar just opened up so we oarked our behinds there. The bartender informed that their kitchen closes at 10pm. We ordered their Shepard pie and fish and chips and their wings. Fish n chips less than10 dollars in SF! Shepherds pie was like 9 dollars and their wings were like 6.50. Cheap and great value at a bar. I mean who cares if some of their foods are frozen and canned gravy when they have like 10 beers on tap at like 5.50 a pint. We ate and had a beer each and the total came to 38 something. I left happy getting my fried food fix and told myself I will return with my guy friends at some time and spend hours there drinking and eating.", "rating": 5, "date": "2016-11-21"}, {"excerpts": ["We ordered the shepherds pie, steak and mushroom pie, and cornish pasty and they were all flavorful and good. ", "Even the vegetables were flavorful if not slightly overcooked."], "author": "LeTran B.", "review": "This is a nice place for some simple and tasty meat, gravy, and potatoes. The portions are pretty large and will fill you up. The general atmosphere is really laid back. \n\nWe ordered the shepherds pie, steak and mushroom pie, and cornish pasty and they were all flavorful and good. Even the vegetables were flavorful if not slightly overcooked.", "rating": 4, "date": "2013-06-07"}, {"excerpts": ["Delicious shepherds pie!  \n", "Great chicken nuggets!  \n"], "author": "Jeanne L.", "review": "I am so impressed by their great food & drink service even during the World Series.  Way to stay on top of things!\n\nGuinness on tap and well poured!\nDelicious shepherds pie!  \nGreat chicken nuggets!  \nFish and chips were ok - not that flavorful, but felt very heavy on the grease.\nFrench fries were ok - could use more salt, maybe a little bit more of a crispy shell.\n\nOverall a great pub experience!!", "rating": 4, "date": "2012-10-26"}, {"excerpts": ["Oh and their shepherds pie is really goddamn delicious. \n\n"], "author": "Jake R.", "review": "This place is a real pub. I spent a summer in london, and my roomate spent a summer in Ireland and we both agree this is a fantastic Pub. They have darts,\nthey have pool, \nlots of good beer on tap, \nand the bartenders have accents.\nBangin'.\n\nOh and their shepherds pie is really goddamn delicious. \n\nJust go. I hear the trivia night on wednesdays are fun, I haven't been but want to check it out tonight.", "rating": 4, "date": "2007-06-27"}, {"excerpts": ["The burgers and shepherds pie were also good.  ", "The beer was top notch as well.  ", "The bill for 4 was less than $50.  ", "You can not do that very often in SF."], "author": "Chad M.", "review": "My family and I dined at the pig and whistle last night.  Although the place was quite noisy, the food was great.  You go to the bar to order, and after just a short wait, we were served.  The fish and chips were outstanding.  The chips, or French fries to us in the USA , were Fresh, not frozen.\nThe burgers and shepherds pie were also good.  The beer was top notch as well.  The bill for 4 was less than $50.  You can not do that very often in SF.", "rating": 5, "date": "2009-04-12"}, {"excerpts": ["Shepherds Pie and a pint of Stella...yumm"], "author": "Starla D.", "review": "MMMM...Shepherds Pie and a pint of Stella...yumm", "rating": 5, "date": "2006-01-18"}, {"excerpts": ["The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. ", "Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. ", "The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. ", "British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. ", "There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. ", "Calling all Anglophiles!"], "author": "Gourmet G.", "review": "Its name is derived from the Old English words 'Piggin,' a large lead cup used to serve spiced wine, and 'Wassail,' the wine itself, and it's as authentic a British pub as you can find outside Henley-on-Thames or some such similar riverside town in the UK. The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. Calling all Anglophiles!", "rating": 5, "date": "2005-08-02"}, {"excerpts": ["but shepherds pie = god)\nAmple free pool & less ample free darts (save your quarters for laundry!)\n", "Pitchers of plentiful beer selection.\n", "Neat mixed crowd, lots of folk. "], "author": "Tyler W.", "review": "This place is literally 700 feet from my house, needless to say I frequent it.  Now I essentially live @ work and school, so i don't come as often as I'd like, and I don't have as good a grasp on this bar as say the Dogpatch or Mission Bars. But let me tell you about this little gem.\n \nGreat food (fish and chips can be a bit bland but shepherds pie = god)\nAmple free pool & less ample free darts (save your quarters for laundry!)\nPitchers of plentiful beer selection.\nNeat mixed crowd, lots of folk. Make no mistake, this is a scots bar!\n\nSo as you can see, this is a great freaking bar. Now let me regale you with why I decided to yelp it now, after attending quite a few times.  With Bars I like to have a real story before I yelp them, unless they really stand out or I might be the first to yelp em.  Often also I go home and drunk yelp the place only to find that i never actually submitted my review and just forgot about it entirely. This was not the case with PNW, this was...\n\nSo I had just gotten off a long shoot (where we totally nailed the product shot, only to see that the Heineken bottle was out of focus, so much for an A on that film project). Rode the bus home, showered, and ba-dum-sum-cha my buddy Dave is at my door with a 12-pack of Newcastle.  We crack em open, let the dogs run out back and start talking about school.  Shortly after my friend (and now yelp friend) George M. shows up as well.  A few more beers later we mosey to the Pig and Whistle to meet an actor from our school + girlfriend, Dave's girlfriend Jill and her two co-workers, Later to be met by friend Kent. This is where the night turned bad.  Now Dave is as solid as a brick wall, but he acts crazy. Most people would think him pulling his knife on me three times was why it went bad, you'd be wrong (and if you thought that, you wouldn't be friends with Dave). Now Jill is always a hoot-n-a-half so no problems there. Kent is an awesome guy and George has quite a few markings of \"coolest mother on the planet.\" So we've eliminated them, which leaves us with, Jill's co-workers.  OK, they were really nice for awhile - kinda dull, but that's more than ignorable with pitcher after pitcher of beer and a group of 9 people. But it all goes downhill when you start proclaiming that this is such a nice Irish bar. It's Scottish, I don't expect you to know that, but I'm Irish and I'm sensitive about that stuff. Of course it's a small mistake, all is forgiven. Then the new tidbit of insight from a blonde's head was that my friend \"looked like marina boys.\"  That's a bad move, he doesn't like the Marina, and he lives close enough to catch shit for it regularly.\n\nHere's the similarities between my group and yours, we don't live in the Marina.\nHere's the differences, my group doesn't think it's a compliment to be called Marina-esqe. \n\nSo please young woman, if you are so hateful about living in the Sunset (understandable) then move out, go to the Marina! If there's anything more sad than a Marina mom it's a Marina wannabe. But that was really just more funny than anything else as my friend decided to push the issue, \"What about me makes you think Marina, seriously I'm not going to hold it against you, I want to know so I can rid myself of it, what makes you think Marina?\" Her back peddle and eventual excuse was hilarious. More importantly the other friend (after a solid four hours of drinking), pulls a half eaten burrito from her purse and begins munching on it. It wasn't wrapped well in the foil, I'm sure there are rice and beans all over her purse. I proceed to ask her with awe \"where'd you get that?!\" I'm meaning, why was it in your purse, she's a bit more literal and states some place in union sqaure. She didn't know the name. She goes there twice a week. What, is wrong, with her?\n\nShe should know the place's name, she shouldn't have left it in her purse, and for god sakes \"real San Franciscans don't eat Mexican food anywhere but the mission. Not even in Mexico!\" (Sally K.)\n\nanyway, called em a cab and went to bed -- just another night in laurel heights -- and a vote for why you met girls at the bar, and don't bring them with you.\n\nProximity to the Bridge Theater (currently playing Grindhouse) is a huge plus and bumps it up to the 5th star!", "rating": 5, "date": "2007-04-07"}], "deli sandwich": [], "chicken marsala curry": [], "garden burger": [{"excerpts": ["Love the garden burger! ", "Staff are very friendly too! ", "Will definitely be going back!"], "author": "Rebecca O.", "review": "Great food, very cheap too! Love the garden burger! Staff are very friendly too! Will definitely be going back!", "rating": 5, "date": "2016-01-23"}], "new york steak": [], "hot chicken nuggets": [], "calamari rings": [{"excerpts": ["Their Sausage Rolls and Calamari Rings were Okay.  ", "Their Onions Rings were good. ", "It was big and appeared to be beer battered. "], "author": "Hiroshi K.", "review": "This is a nice pub.  The staff is friendly and the service is very good. The quality of the food is good.  Based on my previous visits.  I really like their Apple Cider and Shandy.  I also enjoyed their Cornish Pasty.  It was big, flaky, and stuffed with mashed potatoes and meat.  It also came with a side salad.  Their Sausage Rolls and Calamari Rings were Okay.  Their Onions Rings were good. It was big and appeared to be beer battered. I also tried their Bangers and Mash, it was good. It was tasty and filling.  The ambiance of the place was very good, not too crowded or loud.  I would definitely come to this place again.\n\nAlso, when you order food and drinks you need to order at the bar and pay first.", "rating": 4, "date": "2016-01-20"}, {"excerpts": ["Also we ordered the calamari rings which was a nice portion to share, very fresh and lovely.  "], "author": "Luisa T.", "review": "We stopped in to have lunch based on our son's recommendation.  Really nice choice!  It's not a huge place, but there are many tables to choose from during lunch time.  Very quiet with perhaps a handful of other patrons either dining or enjoying drinks at the bar.  Bartender was friendly, the food orders were prepared efficiently, and best of all they were quite good and excellent value.  Honestly the prices are really excellent.  I do hope they keep them like this for a while!  \n\nWe really miss the pubs we used to frequent on our UK visits so this one helped to fill the void.  We all ordered the fish and chips which were two good sized pieces of cod with light batter and a good amount of chips.  No mushy peas though.  Must say the batter was not that greasy stuff one gets at other establishments.\n\nAlso we ordered the calamari rings which was a nice portion to share, very fresh and lovely.  Went well as an appetizer.\n\nHad some half and whole pints of Carlsberg to complement our meals.\n\nI know there are other British pubs in SF, but Pig & Whistle is great.  Only slight negative is that the unisex toilets are a bit gross, but it's probably due to patrons' use not neglect on management's part.\n\nWill be back for sure.", "rating": 4, "date": "2015-08-01"}, {"excerpts": ["Our fried calamari rings and French fries were on the dark brown side.... ", "Need a bigger tv too."], "author": "Joe K.", "review": "Nice quaint bar to hang out with the locals to socialize or catch a game. It is spacious inside which is deceiving because it looks small from the exterior. Bar food wasn't bad but I think they should have changed the frying oil sooner. Our fried calamari rings and French fries were on the dark brown side.... Need a bigger tv too.", "rating": 3, "date": "2010-10-05"}, {"excerpts": ["Don't get the calamari rings, everyone at your table will ask to try your \"onion rings\" and get a disturbing look on their face when you inform them ", "it's calamari. ", "The heavy batter overwhelms the taste of the squid."], "author": "Dan X.", "review": "Don't get the calamari rings, everyone at your table will ask to try your \"onion rings\" and get a disturbing look on their face when you inform them it's calamari. The heavy batter overwhelms the taste of the squid.", "rating": 3, "date": "2007-08-04"}], "beer battered mushrooms": [], "soup of the day": [], "cornish pasty": [{"excerpts": ["I also enjoyed their Cornish Pasty.  ", "It was big, flaky, and stuffed with mashed potatoes and meat.  ", "It also came with a side salad.  "], "author": "Hiroshi K.", "review": "This is a nice pub.  The staff is friendly and the service is very good. The quality of the food is good.  Based on my previous visits.  I really like their Apple Cider and Shandy.  I also enjoyed their Cornish Pasty.  It was big, flaky, and stuffed with mashed potatoes and meat.  It also came with a side salad.  Their Sausage Rolls and Calamari Rings were Okay.  Their Onions Rings were good. It was big and appeared to be beer battered. I also tried their Bangers and Mash, it was good. It was tasty and filling.  The ambiance of the place was very good, not too crowded or loud.  I would definitely come to this place again.\n\nAlso, when you order food and drinks you need to order at the bar and pay first.", "rating": 4, "date": "2016-01-20"}, {"excerpts": ["There is no resemblance of what I\nbought as compared to a real Cornish Pasty,  My Mother and\nFather were both born in Cornwall England and we were \nraised on Cornish Pasty.  ", "What you sell has no resemblance \nwhatsoever except for the crust."], "author": "William N.", "review": "I bought some Pastys here.  There is no resemblance of what I\nbought as compared to a real Cornish Pasty,  My Mother and\nFather were both born in Cornwall England and we were \nraised on Cornish Pasty.  What you sell has no resemblance \nwhatsoever except for the crust.", "rating": 1, "date": "2016-08-24"}, {"excerpts": ["We ordered the shepherds pie, steak and mushroom pie, and cornish pasty and they were all flavorful and good. ", "Even the vegetables were flavorful if not slightly overcooked."], "author": "LeTran B.", "review": "This is a nice place for some simple and tasty meat, gravy, and potatoes. The portions are pretty large and will fill you up. The general atmosphere is really laid back. \n\nWe ordered the shepherds pie, steak and mushroom pie, and cornish pasty and they were all flavorful and good. Even the vegetables were flavorful if not slightly overcooked.", "rating": 4, "date": "2013-06-07"}, {"excerpts": ["The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. ", "Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. ", "The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. ", "British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. ", "There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. ", "Calling all Anglophiles!"], "author": "Gourmet G.", "review": "Its name is derived from the Old English words 'Piggin,' a large lead cup used to serve spiced wine, and 'Wassail,' the wine itself, and it's as authentic a British pub as you can find outside Henley-on-Thames or some such similar riverside town in the UK. The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. Calling all Anglophiles!", "rating": 5, "date": "2005-08-02"}], "sausage rolls": [{"excerpts": ["Sausage rolls: 2.5 \nJalapeño poppers: 4  \nFish & chips: 5 \n\nDRINKS\nTap beers and barcardis. "], "author": "Julie H.", "review": "The Trifecta:\nService: 5 \nFood: 4 \nDrinks: 4 \n\nSERVICE\nGreat corner bar. Sat at the bar and received service immediately. No wait service. Different (for my experience) but it works. Bartender even texted his wife to find me a good dinner spot close to my hotel. And to top it off, he hooked me up with a Sambuca shot. Two thumbs up.\n\nFOOD\nSausage rolls: 2.5 \nJalapeño poppers: 4  \nFish & chips: 5 \n\nDRINKS\nTap beers and barcardis. Can't really mess this up but still a high-five. \n\nFor a $ establishment, you more than get what you pay for.", "rating": 4, "date": "2018-04-16"}, {"excerpts": ["Their Sausage Rolls and Calamari Rings were Okay.  ", "Their Onions Rings were good. ", "It was big and appeared to be beer battered. "], "author": "Hiroshi K.", "review": "This is a nice pub.  The staff is friendly and the service is very good. The quality of the food is good.  Based on my previous visits.  I really like their Apple Cider and Shandy.  I also enjoyed their Cornish Pasty.  It was big, flaky, and stuffed with mashed potatoes and meat.  It also came with a side salad.  Their Sausage Rolls and Calamari Rings were Okay.  Their Onions Rings were good. It was big and appeared to be beer battered. I also tried their Bangers and Mash, it was good. It was tasty and filling.  The ambiance of the place was very good, not too crowded or loud.  I would definitely come to this place again.\n\nAlso, when you order food and drinks you need to order at the bar and pay first.", "rating": 4, "date": "2016-01-20"}, {"excerpts": ["We had sausage rolls, Cornish pasties and English breakfast. ", "The price is very reasonable. ", "The Cornish pasties and sausage rolls plates cost about $6 dollars each, and the breakfast plate cost about $9 dollars. ", "I will definitely come back if I want British food again ", ":)"], "author": "erik b.", "review": "This place is amazing. I did not try the drinks, and I was on there for the food. We had sausage rolls, Cornish pasties and English breakfast. The price is very reasonable. The Cornish pasties and sausage rolls plates cost about $6 dollars each, and the breakfast plate cost about $9 dollars. I will definitely come back if I want British food again :)", "rating": 5, "date": "2016-10-04"}, {"excerpts": ["Plus, no sausage rolls? ", "Ack! ", "-2 ", "Stars for the decline."], "author": "B K.", "review": "Had the most flavorless fish and chips today. I mean nothing, nada, zilch on flavor. What happened? Plus, no sausage rolls? Ack! -2 Stars for the decline.", "rating": 3, "date": "2016-07-24"}, {"excerpts": ["My boyfriend ordered the fish & chips & I got the sausage rolls w/ garden salad. \n", "Both were really good & pretty unique. \n", "The service was friendly.\n"], "author": "Sylvia N.", "review": "Holy moly - \nPig & Whistle gives some hefty portions!\n\nCame here for a late dinner with the boyfriend. \nSooo happy to find that the kitchen doesn't close until 10pm. \nMy boyfriend ordered the fish & chips & I got the sausage rolls w/ garden salad. \nBoth were really good & pretty unique. \nThe service was friendly.\nWe came on a random Thursday night, so it wasn't crowded - nice, chill place for some grub & a beer.\n\nI'm definitely coming back to try their bangers & mash next!", "rating": 4, "date": "2014-07-06"}, {"excerpts": ["Anyways, let's talk about the food, we ordered the shepards pie, buffalo wings, bangers and mash, sausage rolls. ", "like 8 pieces \nbangers and mash: I don't know what to say about it...", "it was good. ", "TRUST.\n", "sausage rolls: like meat in a blanket? ", "surrounded by puff pastry. ", "Comes with 5 pieces! great to share"], "author": "Priscilla W.", "review": "Why haven't I discovered you sooner!??!! \n\nCame here last night for trivia night (wednesdays!) Get there early (~6/7) to snag a good seat (especially if you're coming with a group of +4) \n\nTrivia starts at 8:30pm and runs to 11pm. 1st place gets $30! \n\nAnyways, let's talk about the food, we ordered the shepards pie, buffalo wings, bangers and mash, sausage rolls. all: NOMMMM\n\nShepards pie, what's not to love: beef, gravy, peas under a bed of mashed potatoes neatly designed. comes with a side of beans or veggies \nBuffalo wings: crispy and brown...fried....comes with 3 dipping sauces: BBQ, buffalo ?__? and ranch or blue cheese....one of those.... like 8 pieces \nbangers and mash: I don't know what to say about it...it was good. TRUST.\nsausage rolls: like meat in a blanket? surrounded by puff pastry. Comes with 5 pieces! great to share", "rating": 5, "date": "2013-08-29"}, {"excerpts": ["They were out of the sausage rolls, so I will have to be back to try that!\n\n"], "author": "Selina W.", "review": "Food is well priced ( $5-$8)  and yes most of it's fried, but I love fried food...so I'm not sorry :P\n\nThey were out of the sausage rolls, so I will have to be back to try that!\n\nOrdered the chicken nuggets and fried mushrooms. Nuggets reminded me of my childhood and the fried mushrooms were not bad! Light battered and good mushroom taste.\n\nMy friend ordered the food and he asked what I wanted to drink. I figured a Moscow Mule was a pretty basic drink, but apparently the bartender (male) asked my friend what was in it. He made it though and it tasted horrible. \n\nI let the bartender know and he told me \" well that's what you ordered\". I should have asked him to taste it himself, but it was so bad I didn't want him to have to... Yes I understand this is not a high end cocktail place...but Moscow Mules are pretty basic. \n\nAnyways...all in all, the experience was not amazing, but I will be back to try the food!", "rating": 3, "date": "2014-05-09"}, {"excerpts": ["I had sausage rolls and Shepherd;s pie, both were so good, transported me back to Fiji. \n\n", "The didn't The woman at the bar gave me tip on re-heating the sausage rolls, which I took home. "], "author": "Sunny E.", "review": "I accidentally discovered this place, and it is a food heaven. Being from Fiji, an ex-British colony, I missed authentic British food. Well, until I came here. I had sausage rolls and Shepherd;s pie, both were so good, transported me back to Fiji. \n\nThe ambience is nice, it is a bar scene. The staff were so friendly and excellent service. The guy who served me was nice, knowledgeable with the menu items, and super friendly chap. The didn't The woman at the bar gave me tip on re-heating the sausage rolls, which I took home. The beer was served chilled. \n\nI can't wait to come back here, the only downside for me is that it is far away from Bart! \n\nOverall 10 out 10 from me, I love these guys!", "rating": 5, "date": "2014-05-18"}, {"excerpts": ["had the curry fries, sausage rolls, and chicken curry with mango chutney.\n\n", "the curry fries were inedible (even though I ate it all anyway).  ", "the curry sauce could not even be called curry in any sense.  ", "after having curry from many other southeast asian, japanese, indian, bengali, and pakistani cuisines, I could not let this tasteless, spiceless yellow muck be considered curry.  ", "all it did was sog the fries with no benefits to the flavor department.  ", "no spice at all, absolutely none.  ", "we ended up drenching the batch in the malt vinger, salt, and ketchup (which were all provided on the table).  ", "the sausage rolls were very good.  ", "i was expecting something like whole sausage in a bun, but this was more like minced sausage meatballs inside a tasty, flaky roll.  ", "very reminiscent of pate chaud.  ", "6 rolls lined the perimeter of the dish while a nice mixed salad with a light dressing complemented the inner center.  ", "was foamed up nicely and went down really well with the sausage rolls.\n\n"], "author": "Christopher N.", "review": "british food and i do not go well together.\nthe beer, however, is a much different story.\n\nhad the curry fries, sausage rolls, and chicken curry with mango chutney.\n\nthe curry fries were inedible (even though I ate it all anyway).  the curry sauce could not even be called curry in any sense.  after having curry from many other southeast asian, japanese, indian, bengali, and pakistani cuisines, I could not let this tasteless, spiceless yellow muck be considered curry.  all it did was sog the fries with no benefits to the flavor department.  no spice at all, absolutely none.  we ended up drenching the batch in the malt vinger, salt, and ketchup (which were all provided on the table).  i dont even like salt and was forced to use quite a bit to make this dish taste like anything other than pasty, soggy potatoes.\n\nthe sausage rolls were very good.  i was expecting something like whole sausage in a bun, but this was more like minced sausage meatballs inside a tasty, flaky roll.  very reminiscent of pate chaud.  6 rolls lined the perimeter of the dish while a nice mixed salad with a light dressing complemented the inner center.  a nice, tasty dish, an impeccable addition to the tasty beer we had.\n\nThe chicken curry with mango chutney was uninspiring.  first off, we had the same exact sauce that came with the fries, so you already know how that story goes.  we hoped as chicken, it would at least give out a taste, ANY taste, but guess what? it was just...soggy tasteless chicken.  they successfully replaced the fries with chicken, added some poorly cooked rice (ricecooker anyone?), cold naan, and a tiny paper saucecup of mango chutney, slapped on a higher price tag and called it another dish.  it tasted just as bland.\n\nmango chutney was great though.  we redistributed it to every other dish because it add a lot of flavor.  I believe we found ginger, chili, and mango pulp.  a delicious spread.\n\nthe beer was awesome, and the beer menu was very nice with generous prices.  we had two 20oz boddingtons on tap.  was foamed up nicely and went down really well with the sausage rolls.\n\nthe service was excellent, and the nice pub feel made the experience enjoyable.  there is no waiter service, you just order from the bar and bring your food back to the table if that's where you're sitting.\n\ni would like to say that i really want to come back and try the other dishes to give this place a second chance but....with so so many good restaurants out in the area alone, let alone the rest of san francisco, i dont think i can make any promises.", "rating": 3, "date": "2011-09-16"}, {"excerpts": ["The burger, chicken nuggets, and sausage rolls are outstanding. "], "author": "Dan R.", "review": "Pretty much the best all-around bar in the city. No pretense. No \"crowd\". Just well-priced drinks, attentive and friendly service, and delicious authentic British pub food. Tremendous jukebox selection as well. They have flat screens for viewing sports and a large projection screen for major sports events.\n\nUndoubtedly the best part of the P&W, are the trivia nights on Wednesdays and Sundays. Wednesday draws the largest crowds, probably because of the Sierra drink specials. There is a different host for Wednesdays and Sundays and they are both very good, except I've caught the Wednesday host repeating rounds from previous weeks.\n\nI'm only giving four stars, because the food certainly isn't gourmet. I don't think five-star British pub food exists, but this is as close as you'll get to it in SF. The burger, chicken nuggets, and sausage rolls are outstanding. The one time I had the bangers and mash it was slightly subpar, it seemed like the bangers were not cooked enough. Probably just a fluke.\n\nThe staff here is really incredible too. They are friendly and relaxed.\n\nThis is an all-around great little place to sit down and enjoy some food and drink with friends.", "rating": 4, "date": "2010-10-22"}, {"excerpts": ["Black & tan's were the beverage of choice while we enjoyed sumptuous amounts of pub grub including flaky sausage rolls with mustard and rings of onion dipped in batter and fried in oil to a greasy perfection. ", "The pub quiz was a really good one and laughs were had by all except for one sad sad little man who had just lost his favorite aunt in a horrible cheer-leading accident. ", "Who would have thought that being in the middle tier of the pyramid wold prove to be the most fatal position. ", "Well I suppose there are more fatal positions like top tier to close to a low flying flock of African flamingos. ", "But I digress. ", "Oh wait ", "PELICANS would be much more dangerous!!  "], "author": "Njon W.", "review": "Shatangi dedicates this review to the yelp 'yatches that cry about my reviews being too short.\n\nthe last time i went to the P&W was a rainy Sunday in 05. We found parking about a block and a half away. We enjoyed several hours of free billiards. The decor was tres Irlandais. Black & tan's were the beverage of choice while we enjoyed sumptuous amounts of pub grub including flaky sausage rolls with mustard and rings of onion dipped in batter and fried in oil to a greasy perfection. The pub quiz was a really good one and laughs were had by all except for one sad sad little man who had just lost his favorite aunt in a horrible cheer-leading accident. Who would have thought that being in the middle tier of the pyramid wold prove to be the most fatal position. Well I suppose there are more fatal positions like top tier to close to a low flying flock of African flamingos. But I digress. Oh wait PELICANS would be much more dangerous!!  Any-hoo\n\nProper pub fare, no attitude, fun crowd including pub quiz and free pool early Sunday.\n\nShatangi told you", "rating": 4, "date": "2006-03-09"}, {"excerpts": ["The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. ", "Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. ", "The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. ", "British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. ", "There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. ", "Calling all Anglophiles!"], "author": "Gourmet G.", "review": "Its name is derived from the Old English words 'Piggin,' a large lead cup used to serve spiced wine, and 'Wassail,' the wine itself, and it's as authentic a British pub as you can find outside Henley-on-Thames or some such similar riverside town in the UK. The food is the real deal - Cornish Pasty, Sausage Rolls, Bangers and Mash, Steak and Mushroom or Shepherds Pie, and outstanding Fish and Chips, two lightly battered filets of Icelandic cod served with wedge cut fries and a salad. Breakfast, served until 3:00pm, is exactly what my London friend Gerald has served on many a Sunday morning - scrambled eggs, bangers, Irish bacon, black pudding, baked beans, home fries, and toast, a meal that generally sticks to my ribs until Monday afternoon. The bartenders have been taught the fine art of pouring a Guinness - fill a 20-ounce glass two-thirds, allow the stout to sit, then top it with a white creamy head that floats just above the rim. British ales on tap include Bass, Boddingtons, and Newcastle Brown, and they also stock Blackthorn Premium Cider. There's pool, pinball, and darts for recreation, and it's easy to find willing competitors among the very sociable crowd. Calling all Anglophiles!", "rating": 5, "date": "2005-08-02"}, {"excerpts": ["Whether I have the best fish and chips in town or the sausage rolls, the fare while not haute cuisine is exactly what one expects in a traditional British pub and they deliver ten times out of ten. ", "They also keep an excellent selection of draught beers on tap. ", "Plus, they now have a full bar and live music most weekends (usually no cover)."], "author": "D Scott D.", "review": "I've been going to the Pig and Whistle for going on ten years and I am never disappointed. Whether I have the best fish and chips in town or the sausage rolls, the fare while not haute cuisine is exactly what one expects in a traditional British pub and they deliver ten times out of ten. They also keep an excellent selection of draught beers on tap. Plus, they now have a full bar and live music most weekends (usually no cover).", "rating": 4, "date": "2007-10-05"}], "spicy buffalo wings": [], "curry fries": [{"excerpts": ["I appreciated the healthy grilled chicken with veg option, but the sauce for curry fries was weak, mild and drippy.\n\n"], "author": "J. M.", "review": "Come for a pint, but eat elsewhere.\n\nIt's a pub with a better than average selection of British brews on tap and average food. It seems to pull a fair number of professor-type patrons from nearby USF.\n\nI appreciated the healthy grilled chicken with veg option, but the sauce for curry fries was weak, mild and drippy.\n\nThe bartender was friendly, not much more to say.\n\nMeh.", "rating": 3, "date": "2016-02-19"}, {"excerpts": ["I ordered curry fries and a shepherds pie. ", "The curry fries were just average. ", "The curry lacked flavor ", "so I ended up just dipping the fries in ketchup. ", "The shepherds pie was amazing though. ", "It was a mix of beef, carrots, mushrooms, and peas. ", "I loved it! "], "author": "Ray W.", "review": "The service was great. Both the bartenders were super friendly and helpful. They brought out the food super fast too and thanked us for coming right when they brought out the food instead of after we paid he bill. \n\nI ordered curry fries and a shepherds pie. The curry fries were just average. The curry lacked flavor so I ended up just dipping the fries in ketchup. The shepherds pie was amazing though. It was a mix of beef, carrots, mushrooms, and peas. I loved it! Definitely recommend it. \n\nMy girlfriend had the burger, which was pretty delicious as well. The patty had a heavy meat flavor which I loved. \n\nMy only complain is that there isn't much seating but it's a pub so you can't expect too many tables. Overall it was a great experience. I would definitely recommend coming here.", "rating": 4, "date": "2014-04-12"}, {"excerpts": ["The curry fries are tasty, but definitely need more curry on top of those bad boys."], "author": "Danny C.", "review": "There's nothing bad I want to say about this place. Food is really good (fish and chips are perfectly crisp without being greasy) and not entirely greasy for a pub. You can even state into the back to see the cooks working. The clientele is also pretty friendly without being too rowdy for a bunch of drunkards. Seating is also easy because of how much space there is, and there's so much parking around because you're in between two districts. Pints are $5, but during happy hour, draught beers are $3.50. Can't argue with that, and the bartenders are very nice.\n\nFood is pretty solid. Fish and chips come with 2 large pieces of fish and a fairly large serving of fries. They even give you brown sauce to go with it (I tried it, and brown sauce doesn't work with this dish despite its deliciousness, so don't do that). The fish is just perfectly fried and has no briny flavor. It's good enough on its own without any lemon or tartar sauce. Their tartar sauce is also good as it's a little more tart than other I've tried, which works perfectly for me. The curry fries are tasty, but definitely need more curry on top of those bad boys.", "rating": 5, "date": "2013-10-19"}, {"excerpts": ["Ordered Curry Fries with our drinks. ", "Curry was good and the fries where made fresh. "], "author": "Madhusudhan R.", "review": "Busy place at 6pm and the Bartender was the only one serving food and drinks... So slow service.\n\nOrdered Curry Fries with our drinks. Curry was good and the fries where made fresh. Excellent combo\n\nThe place has a distinct stale smell to it! Too bad as it could be a fun place to hang around...", "rating": 3, "date": "2013-11-22"}, {"excerpts": ["Curry fries were decent.   ", "Food service was fast considering you're at a bar.  ", "Bar service was equally fast, but that should be standard considering . . . "], "author": "Jason J.", "review": "It's a pub.  The beer is good.\n\nBangers and Mash were spot on - the bangers had a good snap to the skin, and the flavors were aplenty.\n\nCurry fries were decent.   Food service was fast considering you're at a bar.  Bar service was equally fast, but that should be standard considering . . . you're at a bar.\n\nNot much more to say here that hasn't been said.", "rating": 4, "date": "2013-02-13"}, {"excerpts": ["We had the following:\n\nCalamari - good, nothing to write home about\nCurry fries - awesome fries! "], "author": "Bixby D.", "review": "The Pig & Whistle is reason #72 why I should taste the rainbow and move to SF.  Awesome place to hang, grab a drink, grab bite to eat, or party.  I made a visit during the day and it looked like a local only men's club but then a few ladies dropped by.  The food is delicious home cooked Irish and bar food.  We had the following:\n\nCalamari - good, nothing to write home about\nCurry fries - awesome fries! Thick cooked perfectly, and great with curry.  \nFish & chips - AMD (Aye Dios Mio) perfect. 3 fish pieces as long as my forearm.\nCornish Pastie - Shepard's pie in a puff pasty.  The best tasting thing ever.room pie- great for a cold day\n\nAll this food for $36.  \n\nI heard there is one in LA but this is not from the same chain.  I will be back.", "rating": 4, "date": "2011-09-29"}, {"excerpts": ["My one negative: the curry fries were not for me.  "], "author": "Kimya P.", "review": "I love pub atmospheres and this place fits the comfy, homey, hide-out-from-the-rain-and-wind-down craving. \n\nHighly recommend showing up for happy hour from 4-6pm, pints are $3 (Guinness $3.5).  You place all orders at the bar; there's a lot of seating throughout the pub; and three TVs for the sports fans. \n\nMy one negative: the curry fries were not for me.  It's thick cut fries (which were really satisfying) drenched in a paste-like sauce that has curry powder, turmeric maybe?, and other spices mixed in (not so satisfying).  \n\nBesides that Pig & Whistle wins if you are in the area and need a little bit of pub-lovin in your life.", "rating": 4, "date": "2012-03-14"}, {"excerpts": ["so I didn't get to enjoy too many of their beer selection and authentic english bar food, but for the purpose we visited this place--which was for friends who hadn't seen each other in a few years to reconnect and catch up over a pitcher of beer and some curry fries--this place was more than adequate.\n\n"], "author": "Scott S.", "review": "I came here with two friends around the time their happy hour was closing up and the atmosphere here is fantastic!\n\nThe dimly lit yet not romantic lights, the cedar wood floors, the appropriate amount of big screen tvs (unlike most sports bars nowadays whose walls are literally innundated with them) and the modest yet well-thought out selection of draft beers makes this little pub stand out from the others you'll find in this area.\n\nTheir Happy Hour deals are pretty reasonable: $3 for any pint of beer from the tap. There aren't any food deals during Happy Hour, but the bar food here is priced reasonably enough ($4-$6) that you really don't need a discount to enjoy them better.\n\nMy friends and I didn't stay long so I didn't get to enjoy too many of their beer selection and authentic english bar food, but for the purpose we visited this place--which was for friends who hadn't seen each other in a few years to reconnect and catch up over a pitcher of beer and some curry fries--this place was more than adequate.\n\nI'm definitely coming back here again next time I'm in the mood for some good bar food and carlsberg on tap!", "rating": 4, "date": "2011-01-12"}, {"excerpts": ["I rather enjoy the the jalapeno poppers, Shepard's pie, and curry fries on the appetizer menu. "], "author": "Jason C.", "review": "Over the past few years, The Pig has become my Cheers. I come here for a Kronenburg or Old Speckled Hen and a lovely chat about the economy or Manchester United game. I rather enjoy the the jalapeno poppers, Shepard's pie, and curry fries on the appetizer menu. I love the pour sizes http://static.px.yelp.com/bphoto/4kMOqgs0Uw-lva507RiWJg/l, Paul, Jenny, Liza, Chris, Steve, and crew. \n\nAnd I love it that despite the fact that they try to inebriate me enough so I super model diet all over the curb, I still want to come back.", "rating": 5, "date": "2008-12-08"}, {"excerpts": ["Fullers London Pride on tap, curry fries, Chris behind the bar and soccer on TV, what more can you want?  ", "Oh, trivia, then go on a Tuesday or Sunday, but your keep your whispers down to a shout.  ", "But I wouldn't order the calamari..."], "author": "OhTheRogue S.", "review": "Fullers London Pride on tap, curry fries, Chris behind the bar and soccer on TV, what more can you want?  Oh, trivia, then go on a Tuesday or Sunday, but your keep your whispers down to a shout.  But I wouldn't order the calamari...", "rating": 4, "date": "2012-03-03"}, {"excerpts": ["had the curry fries, sausage rolls, and chicken curry with mango chutney.\n\n", "the curry fries were inedible (even though I ate it all anyway).  ", "the curry sauce could not even be called curry in any sense.  ", "after having curry from many other southeast asian, japanese, indian, bengali, and pakistani cuisines, I could not let this tasteless, spiceless yellow muck be considered curry.  ", "all it did was sog the fries with no benefits to the flavor department.  ", "no spice at all, absolutely none.  ", "we ended up drenching the batch in the malt vinger, salt, and ketchup (which were all provided on the table).  ", "the sausage rolls were very good.  ", "i was expecting something like whole sausage in a bun, but this was more like minced sausage meatballs inside a tasty, flaky roll.  ", "very reminiscent of pate chaud.  ", "6 rolls lined the perimeter of the dish while a nice mixed salad with a light dressing complemented the inner center.  ", "was foamed up nicely and went down really well with the sausage rolls.\n\n"], "author": "Christopher N.", "review": "british food and i do not go well together.\nthe beer, however, is a much different story.\n\nhad the curry fries, sausage rolls, and chicken curry with mango chutney.\n\nthe curry fries were inedible (even though I ate it all anyway).  the curry sauce could not even be called curry in any sense.  after having curry from many other southeast asian, japanese, indian, bengali, and pakistani cuisines, I could not let this tasteless, spiceless yellow muck be considered curry.  all it did was sog the fries with no benefits to the flavor department.  no spice at all, absolutely none.  we ended up drenching the batch in the malt vinger, salt, and ketchup (which were all provided on the table).  i dont even like salt and was forced to use quite a bit to make this dish taste like anything other than pasty, soggy potatoes.\n\nthe sausage rolls were very good.  i was expecting something like whole sausage in a bun, but this was more like minced sausage meatballs inside a tasty, flaky roll.  very reminiscent of pate chaud.  6 rolls lined the perimeter of the dish while a nice mixed salad with a light dressing complemented the inner center.  a nice, tasty dish, an impeccable addition to the tasty beer we had.\n\nThe chicken curry with mango chutney was uninspiring.  first off, we had the same exact sauce that came with the fries, so you already know how that story goes.  we hoped as chicken, it would at least give out a taste, ANY taste, but guess what? it was just...soggy tasteless chicken.  they successfully replaced the fries with chicken, added some poorly cooked rice (ricecooker anyone?), cold naan, and a tiny paper saucecup of mango chutney, slapped on a higher price tag and called it another dish.  it tasted just as bland.\n\nmango chutney was great though.  we redistributed it to every other dish because it add a lot of flavor.  I believe we found ginger, chili, and mango pulp.  a delicious spread.\n\nthe beer was awesome, and the beer menu was very nice with generous prices.  we had two 20oz boddingtons on tap.  was foamed up nicely and went down really well with the sausage rolls.\n\nthe service was excellent, and the nice pub feel made the experience enjoyable.  there is no waiter service, you just order from the bar and bring your food back to the table if that's where you're sitting.\n\ni would like to say that i really want to come back and try the other dishes to give this place a second chance but....with so so many good restaurants out in the area alone, let alone the rest of san francisco, i dont think i can make any promises.", "rating": 3, "date": "2011-09-16"}, {"excerpts": ["Curry fries.  ", "Real people.  ", "Honest bartenders who know how to pour a Guinness!  ", "Trivia.  ", "Fish & chips.  "], "author": "Liz S.", "review": "Great beer.  Curry fries.  Real people.  Honest bartenders who know how to pour a Guinness!  Trivia.  Fish & chips.  Great beer.  \n\nIt's what a pub is supposed to be - casual, local, dependable.  It'll wet your whistle and satisfy your inner pig.\n\nCareful, it can be a bit of a time trap....", "rating": 4, "date": "2006-05-22"}, {"excerpts": ["We tried the chicken wings and curry fries and both items I wish I hadn't eaten."], "author": "Anna J.", "review": "The pub quiz night is fun and the staff are really helpful and nice. Having said that, the food is really not that good. We tried the chicken wings and curry fries and both items I wish I hadn't eaten.", "rating": 2, "date": "2012-03-26"}, {"excerpts": ["Curry fries (gross but delicious)\n\n"], "author": "Kevin L.", "review": "Sunday night pub quiz is terrific end-of-weekend activity.  It's relaxing and slow-paced; you have plenty of time to socialize.  Good selection of beers (though I wish they had Smithwicks).  \n\nPeter's the best question-reader, as he's got panache, deadpan sarcasm, and true enthusiasm for the game.  Gotta love his music choices for the music round.\n\nWinning team banks $30, while 2nd place and best small team (4 or fewer) get free drink coupons (pig bucks!).\n\nSteve's at the bar on Sundays, and remembers your name after just a few visits.  \n\nTip the wait staff well, and they just might sneak you an answer :)\n\nYay: Curry fries (gross but delicious)\n\nBoo: People cheating at trivia on their mobile devices.", "rating": 5, "date": "2006-02-07"}, {"excerpts": ["*excellent*.  for an appetizer, we had the curry fries (which i've never had before, anywhere) and they were simply scrumptious.  "], "author": "Roshni R.", "review": "i came here for dinner last night with some good friends, and it was absolutely perfect.  the decor was right out of many an english pub i'd ventured into in london, but it was pleasantly quiet on that random tuesday evening.  service was excellent (you have to go up to the bar to order your food), and the bartender was this kind but gruff irishman.\n\nthe food was *excellent*.  for an appetizer, we had the curry fries (which i've never had before, anywhere) and they were simply scrumptious.  my fish and chips were battered to perfection.  crunchy and buttery, but not so greasy that i felt ill (frequently a problem with fried food).  my friends ordered the shepherd's pie and the chicken curry masala, and both enjoyed their meals thoroughly.\n\nin fact, my only problem with this place was the slightly frenetic music selection.  hip-hop, george michael, rap????  no no no....i'm still giving it 5 stars though for the ambience and the food, since that's all i went there for!", "rating": 5, "date": "2006-03-22"}, {"excerpts": ["The food was reasonably priced and the curry fries came with the mango chutney at our request, very yummy.  ", "It's so British ", "I was surprised no one busted out a drinking song while I was there, ", "but hey, it was only a Monday and the Trader Joe's after work crowd had taken over much of the bar."], "author": "Cara J.", "review": "I came here with a friend because it's a great pub within walking distance of my house.  The food was reasonably priced and the curry fries came with the mango chutney at our request, very yummy.  It's so British I was surprised no one busted out a drinking song while I was there, but hey, it was only a Monday and the Trader Joe's after work crowd had taken over much of the bar.", "rating": 4, "date": "2009-04-23"}, {"excerpts": ["The curry fries are definitely worth a try.\n\n"], "author": "Kristin C.", "review": "Nice Place, mellow environment, (except when the games on!). \n\nLove that they have Strongbow Cider, my absolute favorite. The curry fries are definitely worth a try.\n\nIts nice to find a place with a pool table and darts as well.", "rating": 4, "date": "2010-02-10"}, {"excerpts": ["Get yourself some Bangers and Mash or some Curry Fries, a pint, and an entry form...but get there early if you want a table!"], "author": "Pele N.", "review": "Wed night is trivia night and that is when you gotta go!  So much fun.  Great bartenders and a fun atmosphere make this a fun place for both Americans and for people who have moved from the other side of the pond.  Get yourself some Bangers and Mash or some Curry Fries, a pint, and an entry form...but get there early if you want a table!", "rating": 3, "date": "2006-07-10"}, {"excerpts": ["If you're in the neighborhood hop in and try the curry fries!"], "author": "Andrea S.", "review": "This is my neighborhood pub, which I have gone to 2-4 times a month for the last 3 years, usually for trivia night. Good beer selection, decent pub food, and the staff is incredibly friendly. If you're in the neighborhood hop in and try the curry fries!", "rating": 4, "date": "2011-10-10"}, {"excerpts": ["There's a good mix of people and everyone seems very chill, and if that's not incentive enough, the curry fries were AMAZING. ", "Definitely worth checking out."], "author": "Monica M.", "review": "I've only been here twice since moving to the neighborhood but I can already tell it's going to be an awesome place to grab a drink with friends. There's a good mix of people and everyone seems very chill, and if that's not incentive enough, the curry fries were AMAZING. Definitely worth checking out.", "rating": 4, "date": "2009-01-01"}], "basket of fries": [], "jalapeno poppers": [{"excerpts": ["I rather enjoy the the jalapeno poppers, Shepard's pie, and curry fries on the appetizer menu. "], "author": "Jason C.", "review": "Over the past few years, The Pig has become my Cheers. I come here for a Kronenburg or Old Speckled Hen and a lovely chat about the economy or Manchester United game. I rather enjoy the the jalapeno poppers, Shepard's pie, and curry fries on the appetizer menu. I love the pour sizes http://static.px.yelp.com/bphoto/4kMOqgs0Uw-lva507RiWJg/l, Paul, Jenny, Liza, Chris, Steve, and crew. \n\nAnd I love it that despite the fact that they try to inebriate me enough so I super model diet all over the curb, I still want to come back.", "rating": 5, "date": "2008-12-08"}, {"excerpts": ["We got the fish and chips, jalapeno poppers, onion rings, and some other fried food I can't remember.  ", "Nice place to go if you just want to relax and get some grub.  ", "There's a pool table in the back as well as darts to keep you occupied."], "author": "Sarah F.", "review": "Nice pub, good fried food.  My date and I ordered WAY too much food, though.  We got the fish and chips, jalapeno poppers, onion rings, and some other fried food I can't remember.  Nice place to go if you just want to relax and get some grub.  There's a pool table in the back as well as darts to keep you occupied.", "rating": 3, "date": "2008-01-25"}]}