{"side of baby kale lunch salad": [], "side of gumbo": [{"excerpts": ["The shrimp and grits with a side of gumbo (hell yea!), the bucket of fried chicken (UH-MAZING), the collared greens, fried okra, the crawfish hushpuppies, baked mac n' cheese, the HAMBURGER--omg, it just don't stop! "], "author": "DJ P.", "review": "I can't get enough of this place. The shrimp and grits with a side of gumbo (hell yea!), the bucket of fried chicken (UH-MAZING), the collared greens, fried okra, the crawfish hushpuppies, baked mac n' cheese, the HAMBURGER--omg, it just don't stop! Even the nice little cornbread bites they give you with jalepeno butter to kick off the meal, EVERYTHING here is ridiculously tasty.\n\nSit out (literally) on their front porch and turn on the heat lamp if it's cold for a fun dining experience. It's cozy and the service is top notch. Or, hang inside for the semi-dive bar vibe; get a drink, score a table and get ready for one helluva food coma.", "rating": 5, "date": "2015-08-03"}], "veggie collard greens": [], "red beans and rice": [{"excerpts": ["Front Porch's  version of red beans and rice with sausage is also pretty lip smacking good", ": Beans are perfectly cooked, rice is light and fluffy with a great flavorful sauce ( not too spicy). "], "author": "David G.", "review": "While opposites might attract....they don't always make for great dinning partners per say....me I love Bourbon and Southern comfort food. My girlfriend prefers Soylent ( like can you mix Tito's with that stuff?). I've wanted to come here for years.....and finally convinced everyone to try it!!!!\n\nFront Porch can turn the pickiest eater into a fried chicken junkie...it's that good.\n\nAs a matter of fact their apps are pretty delicious too: take the fried Okra and Pickles: each is fried to perfection (okra is hard to pull off) and served with a very tasty aioli.\n\nFront Porch's  version of red beans and rice with sausage is also pretty lip smacking good: Beans are perfectly cooked, rice is light and fluffy with a great flavorful sauce ( not too spicy). The sausage is perfectly smoked...great snap to the casing.\n\nAll four of us split a bucket of their famous Chicken....get it. Their chicken is crispy, moist, and not greasy. Is it the best? No way but it's very good.\n\nCreative drink menu with plenty of cocktails, wines, and beers to choose from. I especially liked my Front porch swing cocktail. A lovely bourbon cocktail with essences of fruit.... delicious. We also had spicy ( Donkey D's) and regular Margaritas.... they're strong and flavorful.\n\nFinally I'd pass on the desserts: Beignets we're totally forgettable as was the pineapple upside down cake.", "rating": 4, "date": "2018-01-22"}, {"excerpts": ["We ordered some red beans and rice also and they were very good. \n", "They have a full bar and I ordered a basic margarita which had way too much triple sec or something of the like in it. ", "Unfortunately I ended up leaving more than half of it there ", "(this is so unlike me). \n", "I really wanted to like this place....", "we might try it again but just not sure."], "author": "Michelle F.", "review": "We were excited to try this place...appeared to be a little hole in the wall with what appeared to be really authentic style of decor, etc. How much better would their food be. We ordered the gumbo as an appetizer.  I ordered the 4 pc fried chicken with garlic mashed potatoes and greens. The bf ordered the 1/2 rack of beef ribs which came with a side of beans and coleslaw. \nWe were served 2 tiny cornbread muffins along with some herbed butter. Not sure if this came with our gumbo or always comes to the table at the beginning of your meal. Either way, it was good. \nThe gumbo was so good but we should have ordered two appetizers. I definitely wanted more food once we were done sharing the cornbread and gumbo. I thought that this was OK though so we would have room for what was to come. \nOur food arrived and the breading on my fried chicken was...well no other way to describe it than burnt. I had read reviews about the golden breading of the fried chicken so I was really looking forward to this. I had to peel mine off because I'm not into burnt breading. It really turned me off but I proceeded in eating some plain chicken. I went after the greens as I was looking forward to those as well but they was so much vinegar in them that I just couldn't. The mashed potatoes and gravy were the best part of my dinner... though they didn't taste like they had much garlic in them. \nThe BF's ribs that he ordered were cooked nicely but had a lot of dry rub on them for sure. Beans that came with the plate were very rich. We ordered some red beans and rice also and they were very good. \nThey have a full bar and I ordered a basic margarita which had way too much triple sec or something of the like in it. Unfortunately I ended up leaving more than half of it there (this is so unlike me). \nI really wanted to like this place....we might try it again but just not sure.", "rating": 2, "date": "2018-08-02"}, {"excerpts": ["The portions were very small e.g. vegan red beans and rice, to be so expensive. ", "I've heard and read good things about the front porch; however, this was my first and last time trying them."], "author": "Tyree R.", "review": "When my order arrived the fries were hard and cold, as if they were old. Garlic mashed potatoes had way too much garlic in them. The portions were very small e.g. vegan red beans and rice, to be so expensive. I've heard and read good things about the front porch; however, this was my first and last time trying them.", "rating": 2, "date": "2018-07-23"}, {"excerpts": ["I grew up in New Orleans, so I was excited to see some of my favorite foods on the menu - gumbo, red beans and rice, and even poboys using Gambino's French bread!  ", "For two of us, we ordered biscuits and gravy, red beans and rice with sausage, and file gumbo as starters.  ", "We then ordered chicken and waffles and a fried shrimp poboy as our main course.  ", "A lot of food - way too much for two people - but "], "author": "Tay H.", "review": "Really disappointing brunch experience here last weekend.  I'm just not feeling their food or their vibe.\n\nA few months ago, I had a piece of their fried chicken, fresh out of the fryer, and really enjoyed it.  It had perhaps a few too many herbs and such that weren't necessary, but the chicken was juicy and the batter was well-salted.  So, when we were looking for a brunch spot that offered chicken & waffles and biscuits & gravy, The Front Porch came to mind.\n\nI grew up in New Orleans, so I was excited to see some of my favorite foods on the menu - gumbo, red beans and rice, and even poboys using Gambino's French bread!  For two of us, we ordered biscuits and gravy, red beans and rice with sausage, and file gumbo as starters.  We then ordered chicken and waffles and a fried shrimp poboy as our main course.  A lot of food - way too much for two people - but I wanted to try it all.\n\nWe got the read beans and the gumbo very quickly...though it took us much longer, like halfway through our meal, to get water (we had to ask three times).  The red beans were awful.  Gummy and thick, sort of sweet and tomato-y....they tasted like old baked beans over rice.  The ratio of beans to rice was also way off.  There was much too much rice...  The gumbo was lukewarm and flavorless.  It needed a LOT more salt.  The meat was mealy and overcooked - plus, there was hardly any of it.  The okra was also overcooked and slimy.  I generally don't understand putting okra in a chicken/sausage gumbo...  The biscuits and gravy - arguably the fastest item to slap together - did not come out.\n\nNext, my poboy arrived - not with my boyfriend's meal as we had requested.  The bread would have been good if not stale.  There was little to no remoulade. The shrimp were fried using the same batter as the chicken, which has too many herbs that just aren't thematically appropriate.  Plus, the batter is too thick and overwhelming for shrimp.\n\nThe chicken and waffles came out next.  Still no biscuits and gravy...  The chicken was very disappointing relative to my first experience.  It had hardly any flavor.  The quality of the chicken was still good, but it was just so meh tasting.\n\nThe biscuits and gravy finally arrived - last.  They were TERRIBLE.  The Front Porch biscuits are actually scones.  They are so hard and dense, you nearly need a knife to cut through them.  They're basically the type of \"biscuits\" that colonial settlers used to carry with them on journeys from England to the \"New World\" because they were rock-like enough to stand up to seawater for months...  The gravy tasted awful.  It didn't have any sausage in it, it was very under-salted, and it had this weird acidic flavor.  We couldn't place it - but this was not biscuit gravy.\n\nAcross the board, everything was bland and under-seasoned.  To make matters worse, the service is scatterbrained and the restaurant is oppressively dark and gloomy.  I won't be returning...", "rating": 2, "date": "2016-04-26"}, {"excerpts": ["Let's try the red beans and rice as a starter! ", "You can't go wrong with RB & R, they're virtually impossible to mess up.... unless you just open a can and warm them up and top then with white rice and sprinkle green onions on them, which is EXACTLY ", "WHAT THEY FREAKING ", "Red beans and rice is a dish that LITERALLY costs $7 to make! ", "$.99 for the beans, $3 for a smoked hock or shank, & $4 for the rice! ", "Put it in a freaking crock pot and walk away! ", "You mean to tell me you're too trifling to crock pot cook some red beans and rice? ", "I'm not talking grandma's cast iron pot with onions, bell pepper, and garlic ham hock and beans- ", "just a friggin set it and forget it crock pot! ", "Dry beans? ", "I've never in the history of being a Cuban Creole had DRY \"SOUTHERN\" Red Beans and rice! ", "You are just mean and evil at this point! ", "I'm not exaggerating, (see the picture!). ", "Chicken was over browned and red beans and rice were DRY!!!!!!!!!!!!!   ", "I want to go back so you can repair our relationship, I don't want to Yelp this way about you, can we start over? ", "Please?"], "author": "Milan F.", "review": "I'm sad. Like really sad. Like playing the blues, picking my guitar, my baby done left me sad. I wanted to be in love with you FP. I tried so hard. But from the start when I ordered chicory (my fam is from Louisiana, I know chicory) and when I asked the waitress why she brought me coffee instead of chicory she says \"Oh it's in there. Each batch might taste different with stronger and weaker brews.\" (Is this code for we use the same filter at least two times before we change it?) Because she was right! My last just actually rated like tree bark-chicory!\n\nThen of course being of sound mind I ordered the one thing that they're supposed to cook amazingly with their hands tied behind their backs and aprons over their faces - the fried chicken and waffles. \"Well, sure no problem, but that chicken is going to take about 20 mins wouldn't you like something to start with while you're waiting?\"-cood my server.  I wanted to scream \"Why didn't you tell me that when I sat down?\" But no, I'm cool because I'm a cook also and I know that this is a cool upsell technique, so you know what? Let's try the red beans and rice as a starter! You can't go wrong with RB & R, they're virtually impossible to mess up.... unless you just open a can and warm them up and top then with white rice and sprinkle green onions on them, which is EXACTLY WHAT THEY FREAKING DID! \n\nAre you serious? Like, really?\nRed beans and rice is a dish that LITERALLY costs $7 to make! $.99 for the beans, $3 for a smoked hock or shank, & $4 for the rice! Put it in a freaking crock pot and walk away! You mean to tell me you're too trifling to crock pot cook some red beans and rice? I'm not talking grandma's cast iron pot with onions, bell pepper, and garlic ham hock and beans- just a friggin set it and forget it crock pot! Dry beans? I've never in the history of being a Cuban Creole had DRY \"SOUTHERN\" Red Beans and rice! You are just mean and evil at this point! I'm not exaggerating, (see the picture!). I looked at the waitress with contempt and pushed the bowl to the end of the table.\n\nThen came the chicken. The very dark. Bitter skinned chicken. You almost burned my fricken fried chicken! What in tarnation, the skin is supposed to be the culmination of everything that is good and juicy in this world and you ruined it for me, not just because it was so dark and bitter but because I am dearly afraid of sending food back to the kitchen. I don't want them upset- just leave it. But the waitress saw the same thing and says \"awwe, too bad... you want me to take it back?\" Noooo, so I can wait another 30 minutes? No, I'm good thanks.\n\nThe waffle is the best in town. That batter is the business! Cold or hot that was a bomb waffle!  Excellent waffle!  Music was bumpin'! Chicken was over browned and red beans and rice were DRY!!!!!!!!!!!!!   I want to go back so you can repair our relationship, I don't want to Yelp this way about you, can we start over? Please?", "rating": 2, "date": "2014-02-02"}, {"excerpts": ["We had mac and cheese and red beans and rice to start; then po-boy and chicken and waffles for entrees. ", "My husband and I also had the porch swing drinks. ", "We enjoyed it all!"], "author": "L. W.", "review": "Thoroughly enjoyed our meal here. We brought our two kids with us and were pleasantly surprised to see they had crayons and a kids menu considering how dark and loud and \"bar-like\" it was. We had mac and cheese and red beans and rice to start; then po-boy and chicken and waffles for entrees. My husband and I also had the porch swing drinks. We enjoyed it all!", "rating": 4, "date": "2017-03-19"}, {"excerpts": ["Gumbo and red beans and rice as good as New Orleans. ", "Fried chicken as good as anywhere in the south. \n", "I'm so thankful to find great down home cooking in the heart of a quaint part of San Francisco. \n", "Don't miss the bloody mary's!!!!!!"], "author": "Dwayne G.", "review": "Came here with my family on Christmas Eve for brunch.  This place is absolutely amazing. Simple food done perfectly. Gumbo and red beans and rice as good as New Orleans. Fried chicken as good as anywhere in the south. \nI'm so thankful to find great down home cooking in the heart of a quaint part of San Francisco. \nDon't miss the bloody mary's!!!!!!", "rating": 5, "date": "2016-12-24"}, {"excerpts": ["We also got fried okra (same batter as the oysters and catfish), red beans and rice (sadly I like popeyes more), and the beignets (very disappointing because they were heavy and not light and fluffy like  "], "author": "vanessa t.", "review": "I thought this place was ok.  Not great, but it was decent.  Is it the best creole food I have had?  Well, it doesn't compare to Louisiana/New Orleans, I will tell you that, but comeon now, we're in California.  I wasn't expecting to be transported to New Orleans.  \n\nThe people there were nice and funny, the atmosphere and decor were casual/cool/chill.  There was a live jazz band that took up a lot of the walking space, but it was cool to see some little kids dancing by them.\n\nSo my friend and I decided to share a bunch of things.  they have 5 inch poboys, so we decided to get 3: oyster. pulled pork, and catfish.  I was disappointed when they told me the 5 inch could not be cut in half because it was too small and would fall apart.  I know it would have looked messier than they would have liked, but we had a hell of a time with that butter knife and it was a pain in the butt.  So taste wise, the oyster was the best and was fried really well.  The catfish came in second, fried well, but a little dry.  The pork one  i wasn't really feeling.  I just ate it coz we got it.\n\nWe also got fried okra (same batter as the oysters and catfish), red beans and rice (sadly I like popeyes more), and the beignets (very disappointing because they were heavy and not light and fluffy like  i was expecting).\n\nOverall, I am glad I tried it.  If  I were in the area again, I might consider it, but for the price (and it was a bit pricey), I think I would try something else.", "rating": 3, "date": "2011-10-13"}, {"excerpts": ["Pepper beef braised short ribs, Mac and cheese, red beans and rice, fried chicken and corn bread. \n", "The Dr. Pepper braised short ribs melts in your mouth. ", "The beef pulled apart so gently and the collard greens with the mashed potatoes were a great pairing.\n", "The Mac and cheese was the best I'd ever had. ", "I loved the crispy top. ", "I loved the cheesiness of how when you pulled the noodles apart the cheese spread into this oooey gooey ness! \n", "The fried chicken was so crispy and moist. ", "Definitely the best I'd ever had! ", "We got the 4 piece meal and substituted the collared greens for the Mac and cheese and it was a 2 dollar difference and it was the full side if Mac and cheese. ", "So instead of spending 8 dollars I spent 2 dollars! \n", "The complimentary corn bread and herbed butter was moist and the perfect size!\n", "The red beans and rice with andouille was okay. ", "I would of been fine with out it.\n", "I will definitely be back again the next time I visit SF from LA! \n", "Thank you Guy Fieri  for coming here!"], "author": "Cathy D.", "review": "Discovered this through TripleD. The food was amazing! We had the dr. Pepper beef braised short ribs, Mac and cheese, red beans and rice, fried chicken and corn bread. \nThe Dr. Pepper braised short ribs melts in your mouth. The beef pulled apart so gently and the collard greens with the mashed potatoes were a great pairing.\nThe Mac and cheese was the best I'd ever had. I loved the crispy top. I loved the cheesiness of how when you pulled the noodles apart the cheese spread into this oooey gooey ness! \nThe fried chicken was so crispy and moist. Definitely the best I'd ever had! We got the 4 piece meal and substituted the collared greens for the Mac and cheese and it was a 2 dollar difference and it was the full side if Mac and cheese. So instead of spending 8 dollars I spent 2 dollars! \nThe complimentary corn bread and herbed butter was moist and the perfect size!\nThe red beans and rice with andouille was okay. I would of been fine with out it.\nI will definitely be back again the next time I visit SF from LA! \nThank you Guy Fieri  for coming here!", "rating": 5, "date": "2014-07-07"}, {"excerpts": ["The only dish we didn't particularly care for was the red beans and rice, which I thought lacked flavor and contained a lot of red kidney beans, where I prefer pinto beans.  \n\n"], "author": "Pete V.", "review": "Brunch at the Front Porch in Bernal Heights was simply outstanding. We stopped in on a rainy Saturday morning, took a couple of seats at the bar and put down a pint of Anchor IPA while we perused the menu.  Everything sounded so good we ordered practically one of everything...\n\nBy far the best dish was the fried chicken and waffles. Juicy and brined fried chicken, the thigh was my favorite and the waffles were so soft and melt-in-your-mouth good.  We loved the dish so much we ordered a second order of waffles!\n\nThe  fried okra was excellent, it was lightly battered and fried crispy, the sauce it was served with added a nice creamy dimension to the dish.\n\nMy friend Dan ordered the shrimp and grits, which were excellent.  It was served in a dark, brown gravy like sauce, kind of like a grits meets etouffee recipe.\n\nThe muffaletta sandwich was good, but not quite what I'm accustomed to from New Orleans.  Although the ham and cured meats were great and their homemade giardiniera was awesome, the bread was too light and flaky to absorb the vinegar and oils from the pickled vegetables and melted cheese.  If they served it on a thicker bread, this sandwich would be amazing.\n \nThe only dish we didn't particularly care for was the red beans and rice, which I thought lacked flavor and contained a lot of red kidney beans, where I prefer pinto beans.  \n\nThe other great part about our meal was the southern band playing.  Band playing southern. Ghost pepper hot sauce was amazing...nice \n\nFinally, a good tip for the non-tasters/hot sauce fiends out there...they have a secret super hot sauce that they serve only upon request called the \"Ghost Pepper Sauce.\"  This sauce was potent, but the flavor and complexity in it are rare. If you are glutten for punishment, but want a special treat, then this sauce is for you.", "rating": 5, "date": "2010-10-29"}, {"excerpts": ["My husband ordered red beans and rice - it was good, but a little over spiced--- hot does not make it Cajun!  ", "I had the hangover helper, it was also way too spicy. ", "The sandwiches and french fries were very good though. ", "Service was pretty slow, but it's the only place we went to that offered sweet tea!!!"], "author": "Vicki C.", "review": "Ate here on Sunday afternoon.... Having been born and raised in the South we went based on a recommendation from a local I met on the street. My husband ordered red beans and rice - it was good, but a little over spiced--- hot does not make it Cajun!  I had the hangover helper, it was also way too spicy. The sandwiches and french fries were very good though. Service was pretty slow, but it's the only place we went to that offered sweet tea!!!", "rating": 3, "date": "2014-09-30"}, {"excerpts": ["The burgers are good, the salads are interesting and tasty, and the red beans and rice is flavorful, particularly with pork. ", "Of course, what is not made better by pork fat? ", "Nothing, that's what.\n", "Oh ", "yeah, drinks are good ", "so sit at the bar if you can't get a table. ", "And it gets crowded fast so make a reservation. ", "The last time I was there ", "it sounded as if they had my iTunes collection on shuffle, ", "so if you also like My Bloody Valentine, the Pixies, early Adam and the Ants, and mid-90s brit pop, this should be your new go-to place for comfort food and a homey vibe."], "author": "Kely G.", "review": "ok, I've been here about a dozen times now over the years and it is quite good. I love the atmosphere. It is dark and cozy with low ceilings that make you feel like you're on a date no matter who you're with. The food is excellent, and has a decent range for people who have dietary restrictions (vegans, gluten-free, low-carbers) and all of it is good. I've even had the vegan plate of grilled veggies which was incredibly flavorful -- and I am a hardcore meat-eater. The desserts are great, if you can stuff them down your gullet after eating the main course. I have never tried the fried chicken so I have no idea if it is good or not. The burgers are good, the salads are interesting and tasty, and the red beans and rice is flavorful, particularly with pork. Of course, what is not made better by pork fat? Nothing, that's what.\nOh yeah, drinks are good so sit at the bar if you can't get a table. And it gets crowded fast so make a reservation. The last time I was there it sounded as if they had my iTunes collection on shuffle, so if you also like My Bloody Valentine, the Pixies, early Adam and the Ants, and mid-90s brit pop, this should be your new go-to place for comfort food and a homey vibe.", "rating": 4, "date": "2012-11-23"}, {"excerpts": ["I replaced mashed potatoes with red beans and rice for a minimal upgrade in price. ", "The wait staff helps each other out, so no issues there. ", "Pricing is decent, but not affordable if you are on a tight budget. ", "Parking can be challenging, I was able to find a spot two blocks away. ", "It is also very close to Mitchell's Ice Cream for an after dinner dessert. ", "Only complaint, the cornbread was not the best I ever had. ", "But the chicken, amazing! ", "If you love biting into a drumstick and have juices dribble down your chin, it is the perfect order."], "author": "Neville B.", "review": "The night I went to The Front Porch, we had a happy hour at work, but I avoided all snacks because I was aiming for the infamous fried chicken! I wanted to make sure I did not miss out. We were a group of 11 and the space it tight. It is also very dim in there and lively (aka loud). The food looked and tasted great! Since we were a group of 11, I was able to see a variety of plates. The deep fried okra and pickles were great.  Portion was enough for the table. The fried chicken plate comes with 4 pieces and two sides. Standard is mashers and collard greens. I replaced mashed potatoes with red beans and rice for a minimal upgrade in price. The wait staff helps each other out, so no issues there. Pricing is decent, but not affordable if you are on a tight budget. Parking can be challenging, I was able to find a spot two blocks away. It is also very close to Mitchell's Ice Cream for an after dinner dessert. Only complaint, the cornbread was not the best I ever had. But the chicken, amazing! If you love biting into a drumstick and have juices dribble down your chin, it is the perfect order.", "rating": 4, "date": "2015-03-14"}, {"excerpts": ["The red beans and rice with andouille sausage was a shade too smokey for my tastes. ", "The crab flavor really shone through on the crab fritters. "], "author": "Saunders C.", "review": "I've always wanted a front porch. Except that on my front porch, I've dragged an old comfy couch onto it and I sit there with my beer and heckle the people walking by. \n\nI guess it's a good thing this isn't my front porch. This Front Porch has excellent service, delicious food, and interesting decor. Good southern food is somewhat hard to find in SF, so I'm glad I'd stumbled into this place a few times. The servers have always been wonderful. There's also a chandelier constructed out of old silverware. \n\nThe food is rich as so much of the southern food is. The collared greens are cooked with the bits of ham (bacon?) and served in a mound of deep green leafy tenderness. The fried chicken is some of the best I've had in the city. I thought it was better than Hard Knox, Farmer Brown's, Little Skillet, and KFC. Nice and crispy skin outside, tender, flavorful and juicy inside. The shrimp with spicy grits was ok, as was the jambalaya. The red beans and rice with andouille sausage was a shade too smokey for my tastes. The crab flavor really shone through on the crab fritters. Their in-house hot sauces are WHOOOO!!!! \n\nThey feature a full bar with plenty of interesting beer options, including a Speakeasy cask Prohibition Ale, recently. \n\nStill have things on the menu to try, so see you next time.", "rating": 4, "date": "2011-05-23"}, {"excerpts": ["Mac and cheese, fried catfish, red beans and rice, etc. ", "For mains, we had the fried chicken, the fried fish, some dish with shrimp, pork belly sandwich, red beans and rice with andouille, a salad, and gumbo. ", "Fried chicken was moist and flavorful with a spicy taste to the chicken itself and not greasy. ", "The fried fish was too mushy for my tastes. ", "The shrimp dish was served on grits and was mildly tasty. ", "The pork belly was like eating little chunks of flat fat on a big bun. ", "I had one bite and couldn't eat anymore. ", "It came with fries. ", "The red beans and rice were tasty but not stand out. ", "Salad was fine. ", "Gumbo was a bit slimy with okra and not particularly flavorful, though not bad. ", "Overall, I came away with the impression that the food did not have much flavor, which is weird given its creole-like foundation. ", "They do give you two hot sauces, one of which is very hot, to heat things up which I generally poured on everything after trying it and finding it so blah. "], "author": "Vivek V.", "review": "Our friends liked this place a lot but for us so/so....will not be back on our own.  More of a neighborhood place. If it was not for the fun company that night this would be a 2-star review.\n\nContext: group of seven for dinner on a Sunday night at 6:30\n\nAtmosphere: front porch, despite its name, might better be called basement. It's in this cave like, almost windowless space but it does have a few outside tables.  It also smells a bit like a basement, musty and airless. It's very small with maybe seven or eight tables and a long bar. It's also very dark. We had a table at the front that required some maneuvering to fit seven and moving around to let people in and put. It was right by the cash register and i was regularly bumped as staff passed including knocking my purse on the floor enough i decided to hold it. They were steady but not packed\n\nService: we were seated promptly upon arrival and they were fairly patient with our dithering and indecisiveness.  Wen we finally ordered, food and drinks came kind of willy nilly.  The server returned repeatedly to see if we needed anything.\n\nFood: I would call this kind of creoleish comfort food- fried chicken, gumbo. Mac and cheese, fried catfish, red beans and rice, etc. we ordered quite an array of choices. \n\nThe menu is medium sized but not very friendly for those looking for something light.  We started with fried pickles with an aioli and crawfish étouffée French fries. The servings are medium sized but the two rich dishes were plenty for the seven of us. The pickles are like good fried food but they feel greasy, maybe because pickles are moisture filled? The étouffée was just way too rich for my tastes with a pile of fries, smothered in a creole tomato sauce and tiny little shrimp. For mains, we had the fried chicken, the fried fish, some dish with shrimp, pork belly sandwich, red beans and rice with andouille, a salad, and gumbo. Fried chicken was moist and flavorful with a spicy taste to the chicken itself and not greasy. The fried fish was too mushy for my tastes. The shrimp dish was served on grits and was mildly tasty. The pork belly was like eating little chunks of flat fat on a big bun. I had one bite and couldn't eat anymore. It came with fries. The red beans and rice were tasty but not stand out. Salad was fine. Gumbo was a bit slimy with okra and not particularly flavorful, though not bad. Overall, I came away with the impression that the food did not have much flavor, which is weird given its creole-like foundation. They do give you two hot sauces, one of which is very hot, to heat things up which I generally poured on everything after trying it and finding it so blah. The chicken I think was the best dish.\n\nDrinks: beer, wine and cocktails are offered. Cocktails tend to be new orleanish including a sazerac. I had a cream style dark beer but didn't find it very creamy. The server described it as a thicker dark beer,  which was certainly not the case. But it was good.", "rating": 3, "date": "2013-06-30"}, {"excerpts": ["If they aren't BIG, then you are doing something wrong, and by wrong I mean, lay off the salads and have some red beans and rice for godsake.\n\n"], "author": "Rachel G.", "review": "My father is from the Charleston, SC which makes me a southern girl by birth.\n\nSouthern people know good food and they aren't ever afraid to eat it.  Why do you think everything is bigger in the south?  And I'm not talking about peaches, son.  I'm talking about thighs, cankles and spare tires.  If they aren't BIG, then you are doing something wrong, and by wrong I mean, lay off the salads and have some red beans and rice for godsake.\n\nThe Front Porch has embraced the bigger is better philosophy, and is working really hard to make me fat (fatter?).\n\nOut to dinner with six of the hottest ladies I know, we shocked and awed the other patrons by ordering a round of tall boy Red Stripes and taking them down like it was not our job, but our god given duty.\n\nFeeling buzzed, we then proceeded to dive into the eating portion of the event.  \n\nWaldorf Salad (walnuts on the side -- Hi Nance), Corn and White Fish Fritters, two Buckets of Fried Chicken, Crab and Grits, Macaroni Pie, Black Eyed Peas, Collards and Mustard Greens all done up Family Style, cause the girls that share together, get nice and fat together and live together with their 7 cats later in life when no one wants them and they can eat frosting out of the can free of judgment together.\n\nWe finished everything -- save four pieces of AMAZING fried chicken.  And if you looked real hard, you could see me and my Texan friend sopping up the leftover grits with pieces of chicken skin.  \n\nUmmm, yeah.  That's how we roll.\n\nThe price tag for added back fat was relatively moderate as well.  Back fat, if done right, can be pretty pricey.  \n\nNot only was adding a layer for the winter cheap, but the waiter and host at my new favorite restaurant were super complimentary and told us that the booth we were sitting in had never looked better.\n\nI have to agree.  I have never seen anything prettier than seven skinny to average girls who eat like fat girls, drink beer like frat boys and swear like sailors, either. \n\nIt's magic.", "rating": 5, "date": "2007-11-19"}, {"excerpts": ["The chicken came with red beans and rice, both of which were also quite satisfying.  ", "Our companions were in the midst of an argument, so I can't say whether they enjoyed their meals, per se, but they did get doggie bags.  "], "author": "Bitter J.", "review": "The Front Porch's biggest sin is that, like too many hip Mission places, it doesn't accept reservations for parties smaller than five, which can be a real pain if you're hungry.  In this case, however, it turned out to be a blessing in disguise, since the other two members of my party besides my wife and me arrived quite late, and the hostess, who was absolutely delightful and accommodating, made sure we were well cared for.  My wife and I had the salt cod fritters, which were hot, delicious, soft, and moist, along with a large bottle of Duvel, the combination of which quickly eased our initial annoyance at the 45-minute wait to be seated (the hostess' estimate; our actual wait would have been shorter but for our friends' tardiness).  We were able to have our appetizer and beer on the patio, which allowed us to avoid having to crowd at the bar.\n\nThe Front Porch's other sin, revealed once we were seated, was that they had allowed a mariachi player to infest the restaurant.  Mariachi is my least favorite form of music on Earth, so not everyone may find this as much of a disadvantage.  Fortunately, he only played one or two songs, asked for money (which I might have given him in order to prevent him from playing), and then left before we started eating.\n\nMy wife and I split the bucket of chicken, which was enough not only for dinner but for subsequent lunches as well.  I can't recall the wine we ordered, but it was fruity and well-suited to the nouveau soul food.  The chicken came with red beans and rice, both of which were also quite satisfying.  Our companions were in the midst of an argument, so I can't say whether they enjoyed their meals, per se, but they did get doggie bags.  We were all too full for dessert, unfortunately.\n\nOverall, the experience was very pleasant and just the thing for a chilly night.", "rating": 4, "date": "2009-02-10"}, {"excerpts": ["3) Coconut red beans and rice: yum. ", "Definitely a departure from traditional red beans and rice, lighter even with the use of coconut milk. ", "This saved my tongue from falling off when I made the mistake of using the habanero (I think, it was yellow) hot-sauce on my chicken...holy crap, I almost asked for a glass of milk. "], "author": "Steph P.", "review": "Sigh. Another place that makes me feel like \"I don't get it.\" A feature in 7x7 several months ago, 2 Yelp ROTDs, and many more glowing Yelper reviews led me to believe that the Front Porch had reinvented fried chicken the way that XXX reinvented XXX (you can probably come up with something wittier than I can). Admittedly, the chicken wasn't BAD. The meat did have quite a punchy tang to it, though a little too much in my opinion, thus detracting from the joy of eating the crispy cornmeal (albeit overseasoned) crust/skin. It was also d-r-y, which to me is b-a-d. Moreover, I am a dark meat kind of gal and was very upset to find nary a succulent thigh in the paper bucket. $30 freakin' dollars for fried chicken and you can't give me any juicy thigh-action?!?! Eating fried chicken has never made me so sad!\n\nThe rest of the meal echoed my ambivalent sentiments of the chicken. \n- Cornbread served w/ honey chili butter: the cute ear of corn shape tricks you into liking these more than is warranted. A bit dry, but one of my friends liked them enough to get a second order - which we were not informed was an extra charge. :-/\n\n- Conch-Habanero fritters: I had to convince my gastronomically-conservative friends to try these out by telling them that \"it tastes like shrimp.\" Truth is that I totally forgot what they tasted like. If they taste like shrimp, I couldn't really tell because the spices that they use overpower any conch flavor. They were a little chewy, which suggests being overdone. Accompanying aoli was pretty good though and cut into the too-intense flavor of the breading.\n\n- Jerk entree of the day was steak tips: isn't it customary to ask for how well you want steak done?  Well, we weren't asked. Luckily it came out medium done, which was acceptable to me. The potato salad served with the dish did not seem to match up with the steak in flavor or texture; too bland and undercooked potatoes.\n\n- Sides: \n1) Fries Three Ways (home, sweet, and french): the concept induces more excitement than actually eating them. Though it was kind of fun to try and guess which was the sweet. Maybe we got a bad batch - oily and limp. Sad fries! Must say that their homemade ketchup and mayo that comes with the fries were excellent.\n2) Sauteed greens: first off, we thought we had ordered the black-eyed peas with collard greens, not the sauteed mustard greens. Oh well, we ate them anyway. Bitter, as expected, and nothing special about the flavor.\n3) Coconut red beans and rice: yum. Definitely a departure from traditional red beans and rice, lighter even with the use of coconut milk. This saved my tongue from falling off when I made the mistake of using the habanero (I think, it was yellow) hot-sauce on my chicken...holy crap, I almost asked for a glass of milk. Be warned!\n\n- Libations: an  interesting, extensive drink menu. Happy that there was $3.50 Pacifico. And get this...they serve malt liquor. Some Yelpers will appreciate this more than I can.\n\nIt might sound like I didn't enjoy my meal, but that's not really the case. Perhaps that is the danger in doing too much research before eating somewhere...there is a much greater chance of disappointment. Foodwise, yeah it was a'ight. Quite a pricy meal for what I considered 3 star tastiness. In my opinion, what makes the Front Porch a destination location is more for the atmosphere of refined Southern comfort. From the wooden porch and rocking chairs out front to the comfortable booths to the gorgeous tin roof to the charming, ethereal waitstaff, I felt like I was in another city - one smaller, homier, friendlier than San Francisco. In the future, I would welcome a trip back to see if the food can match up with Front Porch's aesthetic.", "rating": 3, "date": "2007-05-07"}, {"excerpts": ["The special fish of the day was an amazingly awesome swordfish with a gauc and severed over red beans and rice.\n\n"], "author": "A P.", "review": "Kitchy but cute.\n\nYour typical Marina meets Hipster and having an affair in the dirty (well not so dirty) Mission.\n\nThe service is quick and attentive and they offer only beer and wine, which is fairly extensive and quite affordable.\n\nThey have the best ceviche deal in the city at only 5 bucks a serving (which happens to be pretty generous).  My fav ceviche aside from making it myself iS Cafe Arguello's just down the block on 24th street.\n\nThe hubby had this fried oyster and a soft egg salad, not my cup o tea, but he loved it!  \n\nThe treo of fries and the home-made ketsup were a great appeteaser.\n\nThe special fish of the day was an amazingly awesome swordfish with a gauc and severed over red beans and rice.\n\nCome here for the chicken, deep fried and battered outside and succulent and juicy inside.  MOVE OVER finger lickin good, this is GET your MF fingers OFF that piece of chicken before I stab you, GOOD!  The black-eyed peas (not the singin kind) over collard greens were fabulous but it was the spicy crab grits that had me slidin off my bar stool!  HOLY mother of GAWD - can I get a bath-tub of that and spoon, I'll eat my way out!", "rating": 4, "date": "2007-03-08"}, {"excerpts": ["Reminded me more of red beans and rice (as the dominant ingredients), a bit too thick\n\nOyster Beignets: "], "author": "Kevin S.", "review": "(I would have given this place 3.5 stars ... but have to round down in this case without that option)\n\nGiven that I live right down the street from this place and had gone way too long before actually eating here, I really WANTED to love this place and make it a new neighborhood favorite. However, after finally crossing it off my list of places I've been meaning to go, I have to say it was just OK in terms of food.\n\nI tried several of the smaller plates on the menu, including the Oyster Beignets, BBQ Shrimp, Gumbo, the Mac n Cheese, and of course, the Fried Chicken. I understand from the waitress that the chef has recently switched, so perhaps that accounts for it not being as good as the hype ... but she also mentioned that the new chef was from New Orleans (where I spent a lot of time after the hurricanes and LOVED the food), so I was hopeful.\n\nGumbo: Reminded me more of red beans and rice (as the dominant ingredients), a bit too thick\n\nOyster Beignets: Interesting ... liked the bread pudding touch ... but ultimately not overly impressive\n\nBBQ Shrimp: Much smaller shrimp than I'm used to getting in NOLA, though the sauce was good\n\nMac n Cheese: Actually enjoyed this one the best of the starters/sides - just the right amount of breadcrumbs in the mix for some texture\n\nFried Chicken: I have to say that I think I enjoyed the fried chicken from the previous chef better (I had it once in a takeout order)\n\nOne final disappointment was the bread pudding for dessert. I've walked by this restaurant about 400 times and have heard people rave about the bread pudding, so I was anxious to compare it to what I've had around the South in the past. Unfortunately, it fell flat. The yam ice cream from Mitchell's (across the street) was a nice touch, but it came in a small casserole bowl that was warm on the outside, but not all the way through. Plus, it came out so fast that it seemed like it was just sitting somewhere warming, ready to go.\n\nOn a positive note, I'll say that I really dig the beers they have available at this place ... from some Abita (Louisiana) beers on draft, to tall cans of Tecate, to tall bottles of red stripe (a rarity), and even King Cobra malt liquor ;-)\n\nOverall, the food was decent, but just not what I was hoping for. Still a very cool spot, and a cool place to hang on \"the front porch\" when warmer outside ... but I think next time I'll just be hanging at the bar with some beers and Mac n Cheese.", "rating": 3, "date": "2009-04-24"}, {"excerpts": ["The red beans and rice (we chose with pork) was fantastic.  "], "author": "Stephen L.", "review": "I went to school in Atlanta and have really missed good Southern and Carribean cooking which is almost impossible to find in San Francsco - The Front Porch being one of the exceptions.\n\nMy wife and I stumbled on this place by a recommendation from a patron sitting outside the restaurant as we walked by - with an explicit recommendation for the spicy crab and grits so we spontaneously popped in after checking out their menu. \n\nThe place is funky - small and cozy - and dimly lit.  We ordered the red bean and rice as a starter (although typically a side dish).  Prior to our order they brought out sweet potato chips and cornbread.  The corn bread was just OK and came out lukewarm so it was nothing special (one of the few things as everything else was far above expectation).\n\nThe red beans and rice (we chose with pork) was fantastic.  It was just a little spicy with a slight sweetness from coconut and the pork was tender.\n\nMy wife had the spicy crab and grits which was also wonderful.  I had the jerk poussin with collard greens and turnips and cornbread stuffing.  I asked whether it was spicy and was told it was more sweet (bc of cinammon and cardamom).  I was a little disappointed as I really like spicy jerk chicken. \n\nHowever, I was surprised to find that it was sufficiently spicy (made my nose run slightly), but you could also taste the sweet spices - it is some of the best jerk chicken I've had since a recent trip to Belize...SO GOOD!  And the collard greens, turnips and cornbread stuffing were also EXCELLENT!\n\nWe would have loved to try dessert, but the two entrees and starters were very filling.  However, I'm very interested in trying the chocolate bread pudding on another visit to see if it is as good as my friend's mother's version - she's from Western South Carolina.  Also, can't wait to come back and try the fried chicken!\n\nForgot to mention that the service was excellent and very attentive - from the hostess, table busser to our server.  We never found our water glasses less than 1/2 full, the server was sincere and helped with suggestions and our food came out very timely.\n\nAll in all, a wonderful find in our neighborhood and we'll definitely be back and give it a really high recommendation!", "rating": 5, "date": "2008-12-28"}, {"excerpts": ["Red beans and rice, one of my favorites. ", "Each side dish screamed independence but went together so well, it felt like a Thanksgiving fest...and mom messed up the turkey. ", "Life goes on. ", "We'll be back again and again and pray the chicken is reincarnated to yesteryear. ", "We figured why we were seated in the back as they began to clean the front room that was near empty. ", "Next time, I'll make the request for a better table. ", "Maybe I won't be able to see how soggy the chicken is in the darkness."], "author": "Penne P.", "review": "Despite the sign across the street that says \"Good Frick'n Chick'n\", I would defend to the end the Front Porch's frick'n chick'n...until last night. \n\nFriends in town gave my partner and I reason to splurge.  We power-walked across Guerrero and got there to see there wasn't a wait, that there were some tables, a booth even, open. Yessss, we've never had the booth before! Yay for us. Maybe the look of excitement on our faces was mistaken for something else because without a hello or good evening or a yo or a hay, the hipster host wisked us away to the back of the joint where our table bordered the kitchen and the toilets. \"But...those...tables, those up front...\" as I blocked the light of the kitchen from my face. I've hosted, I've waited, I've cooked...I get the restaurant thing and not slamming a server, so I let it go. Anyway, it was all about the chicken. Wow, such a great ambiance. Kitchen, there's a kitchen? I didn't even remember that it was three feet behind me. \"The bucket of chicken takes a little longer...\" said the always friendly server.  \"Not a problem AT ALL,\" we smiled. They held us over with a finger-sized pieces of cornbread portioned perfectly for our table. Ah ha! The bucket has arrived, along with the 5 sides we ordered to go with it. Wait. No. This isn't right. This isn't the good frick'n chick'n I'M used to paying $33 for. This is Safeway worthy at best. Sog City.  Green beans and mashed potatoes? Was I at KFC? Come to find out they come with the bucket. \"&*^$! I wish they'd stop yelling at each other in the kitchen, they're messing with my ambiance!\" We tasted and moved on to the pay as you go delectables: the mac and cheese, hello lover! The collards, deliciously average. Red beans and rice, one of my favorites. Each side dish screamed independence but went together so well, it felt like a Thanksgiving fest...and mom messed up the turkey. Life goes on. We'll be back again and again and pray the chicken is reincarnated to yesteryear. We figured why we were seated in the back as they began to clean the front room that was near empty. Next time, I'll make the request for a better table. Maybe I won't be able to see how soggy the chicken is in the darkness.", "rating": 3, "date": "2009-09-28"}, {"excerpts": ["We started out with Red Beans and Rice and Fried Okra with a Jalapeno Aioli sauce. ", "They were both good and perfectly sized for appetizers and priced well at $5 bucks each. ", "There were theree of us, so they went quickly but it was enough. ", "We also shared the bucket of chicken with garlic mashers and cornbread. ", "It was MORE than enough and the chicken was SO good. ", "Our service was good and the food came pretty quickly. ", "I felt bad at the end of the night because a guy came in to play the guitar and came around after to ask for tips. ", "We didn't have any cash or change on us because we weren't expecting that, so that made us feel weird and kind of crummy. ", "It was a good meal. ", "The parking is a beast and the place is small, but it would be worth it to go back again. ", "And Mitchells Ice Cream is pretty much right across the street. ", "=)"], "author": "danae k.", "review": "I went here last weekend for dinner. I heard that there was usually a line, but we got there begore 6 so we were seated right away. The decor is pretty funky. Not at all what I expected for a place called \"The Front Porch.\" (sounds a little more country). Our chair was actually a leather seat from a car or van, so that was pretty funny. There were windows hung up all over the walls, which was pretty cool and all in all it had a nice vibe. \nWe started out with Red Beans and Rice and Fried Okra with a Jalapeno Aioli sauce. They were both good and perfectly sized for appetizers and priced well at $5 bucks each. There were theree of us, so they went quickly but it was enough. We also shared the bucket of chicken with garlic mashers and cornbread. It was MORE than enough and the chicken was SO good. Our service was good and the food came pretty quickly. I felt bad at the end of the night because a guy came in to play the guitar and came around after to ask for tips. We didn't have any cash or change on us because we weren't expecting that, so that made us feel weird and kind of crummy. It was a good meal. The parking is a beast and the place is small, but it would be worth it to go back again. And Mitchells Ice Cream is pretty much right across the street. =)", "rating": 4, "date": "2009-03-17"}, {"excerpts": ["They have vegan dishes which was nice - you can even get vegan red beans and rice as a nice option.  ", "New chief, but we never went prior, so have nothing to compare it to.   ", "Gumbo - super tasty, bathrooms clean, it was a great experience all around.  ", "Including they have a kids menu, with great mac and cheese."], "author": "B C.", "review": "Super place - we went tonight - there were 4 adults and a 2 1/2 year old.  got there around 6 - so no wait - and the waitstaff was superb.  It was a women - she is really knowledgeable, and she just got it, really really helpful.\nFood was great, service great - yes it was loud, but with a 2 1/2 year old that was cool.  They have vegan dishes which was nice - you can even get vegan red beans and rice as a nice option.  New chief, but we never went prior, so have nothing to compare it to.   Gumbo - super tasty, bathrooms clean, it was a great experience all around.  Including they have a kids menu, with great mac and cheese.", "rating": 5, "date": "2009-03-22"}, {"excerpts": ["I myself had chicken gumbo and red beans and rice and i couldn't have been happier. ", "A couple people ordered the fried yucca which was not my favorite, not a huge fried food fan. ", "And to top it all off i had bread pudding with yam ice cream for dessert. ", "It was fantastic. ", "I highly recommend this place to anyone with a craving for southern food and an affinity for quirky, off beat restaurants."], "author": "Megs k.", "review": "This place is great! We enjoyed wine and beer while sitting in rocking chairs on the front patio area while we waited for the rest of our party (we had no reservation and the waitress was very accommodating and didn't make us feel bad at all).  Once we were sat the service was great and every single person we dealt with was super friendly. The food was delicious, two people ordered the fired chicken which was amazing! I myself had chicken gumbo and red beans and rice and i couldn't have been happier. A couple people ordered the fried yucca which was not my favorite, not a huge fried food fan. And to top it all off i had bread pudding with yam ice cream for dessert. It was fantastic. I highly recommend this place to anyone with a craving for southern food and an affinity for quirky, off beat restaurants.", "rating": 5, "date": "2009-04-07"}, {"excerpts": ["we ordered that, and a bunch of sides (fried okra, mac and cheese, red beans and rice).  ", "the fried chicken was good; it was nice, basic, fried chicken, no spice in the batter; the meat was juicy.  ", "but it didn't blow me away.  ", "someone actually mentioned they like popeye's better.  ", "i prefer hard knox cafe fried ", "chicken- "], "author": "Ramon C.", "review": "i had higher expectations for this place.  went last night with a bunch of people, and we were really looking forward to the fried chicken, which we'd heard so much about.  we ordered that, and a bunch of sides (fried okra, mac and cheese, red beans and rice).  the fried chicken was good; it was nice, basic, fried chicken, no spice in the batter; the meat was juicy.  but it didn't blow me away.  someone actually mentioned they like popeye's better.  i prefer hard knox cafe fried chicken- now that's really tasty.\n\nnow a bucket cost 32 bucks!  for like eight pieces.  that's a lot of mullah for eight pieces of fried chicken (4 bucks a piece).  is it worth that?  not really.  again, someone mentioned we shoulda just gone to popeyes.\n\nthe sides are alright, nothing special.  now everyone loved the jalapeno corn bread sticks that were free.  we got like four servings of that.\n\nthe space is funky; it's dark, and the ceilings are low.  used to be a garage is why.\n\ni'll go back and try other things on the menu, but it's not a place that i'll be running back to.", "rating": 3, "date": "2009-06-07"}, {"excerpts": ["Being a lover of New Orleans cuisine I ordered the staples - some gumbo and some red beans and rice. ", "The gumbo was really thick and heavily seasoned, no flavor from the ingredients make it through the mess. ", "Barely detected the one oyster I could recognize. ", "As it cooled to lukewarm it was honestly inedible. ", "Nobody at the table wanted it, we made it through about half of it. ", "I would guess they spilled the spice jar into the red beans. ", "They were just a total disaster, even while still warm. ", "Noticeable powdery taste, and (EEEK!) ", "even a little undercooked! ", "We didn't even eat a third of it. ", "No amount of rice could bury the weird flavor here, but the sausage was reaaallly good. ", "So I didn't strike out entirely, especially with bites of what my buddies ordered. ", "One got the fish of the day with jambalaya, and it was good. ", "The fish was tasty but unfortunately overcooked. ", "Jambalaya was good. ", "And ONE hush puppy. ", "ONE. ", "Why? ", "Other friend got Shrimp and Grits. ", "This was the win! ", "Really delicious gravy, nice juicy shrimps, flavorful grits. ", "This saved the deal for all three of us, and the tasty fried pickles helped. ", "We also got fried green tomatoes with shrimp remoulade - Green tomatoes were good but needed help from some sauce, and the shrimp remoulade wasn't it. ", "Pretty bland for a remoulade, more like a shrimp salad. ", "They get props for a cool atmosphere, good drinks, and a few friendly servers (though ours was pretty snobby and slow). ", "The verdict: I ain't going back. ", "If you're in this neighborhood and in the mood for American food go to the Blue Plate, or get in the car and go to Queen's down in the Portola for real New Orleans food done proper with no wait."], "author": "Tyler H.", "review": "This hip and popular little spot is seriously hit or miss, leaning hard toward the miss the night we tried it. Being a lover of New Orleans cuisine I ordered the staples - some gumbo and some red beans and rice. The gumbo was really thick and heavily seasoned, no flavor from the ingredients make it through the mess. Barely detected the one oyster I could recognize. As it cooled to lukewarm it was honestly inedible. Nobody at the table wanted it, we made it through about half of it. I would guess they spilled the spice jar into the red beans. They were just a total disaster, even while still warm. Noticeable powdery taste, and (EEEK!) even a little undercooked! We didn't even eat a third of it. No amount of rice could bury the weird flavor here, but the sausage was reaaallly good. So I didn't strike out entirely, especially with bites of what my buddies ordered. One got the fish of the day with jambalaya, and it was good. The fish was tasty but unfortunately overcooked. Jambalaya was good. And ONE hush puppy. ONE. Why? Other friend got Shrimp and Grits. This was the win! Really delicious gravy, nice juicy shrimps, flavorful grits. This saved the deal for all three of us, and the tasty fried pickles helped. We also got fried green tomatoes with shrimp remoulade - Green tomatoes were good but needed help from some sauce, and the shrimp remoulade wasn't it. Pretty bland for a remoulade, more like a shrimp salad. They get props for a cool atmosphere, good drinks, and a few friendly servers (though ours was pretty snobby and slow). The verdict: I ain't going back. If you're in this neighborhood and in the mood for American food go to the Blue Plate, or get in the car and go to Queen's down in the Portola for real New Orleans food done proper with no wait.", "rating": 2, "date": "2011-07-28"}, {"excerpts": ["Red beans and rice with a side of plantains hit the spot. ", "Our stomachs were near exploding by the time the lovely waitress handed us the dessert menus, but I'm so glad that we ordered the chocolate bread pudding! "], "author": "R R.", "review": "The short of it - \nFood: 4 - generally well-prepared and flavorful Southern/Caribbean cuisine\nService: 4 - kind, attentive and knowledgeable wait staff\nAmbiance: 3 - strange (but fun!) décor and cozy feel, lively but not overwhelming\nPrice: 2 - waaaaay overpriced\n\nThe long of it -\nDisclaimer: I'm from the South, born and raised, and I'm a bit of a skeptic whenever I find \"soul food restaurants\" - especially upscale ones - in a place that is not the South. Cooking for many seems to spoil things, unless you're at church with some old ladies who been cookin' their collards in their special way for 50 sum-odd years. So yes, I admit I walked into the Front Porch with a tongue that was prepared to be under whelmed.\n\nMy friend and I started with spicy crab and grits. The grits were buttery delicious, and the subtly spiced crab complimented them well. The little corncob cornbread was cute, and the maple-y butter hit the spot. We were subsequently presented with a bucket that was overflowing with fried chicken. (Shit, it BETTA be overflowing if you gonna charge me $32 dollars for seven pieces of chicken! What does it cost at Popeye's ... 'bout $10 for a bucket of 20??? But I digress.) I didn't actually like cornmeal breading. I found it dry and lacking flavor, though the chicken was extremely moist and tender. They've clearly got the frying down to a science. Red beans and rice with a side of plantains hit the spot. Our stomachs were near exploding by the time the lovely waitress handed us the dessert menus, but I'm so glad that we ordered the chocolate bread pudding! It was near perfect - by far the best part of the meal.\n\nOther notes: \n\nI found the décor a little weird in an intriguing way. The ceiling tiles were crazy and reminded me of my grandmama's friend's house. As much as I like Santogold, I found that her sound somehow clashed with my meal. I would have preferred some Delta blues or at least some rhythm and blues to complement the décor and the delicacies.\n\nPeople, if you are going to go to a soul food restaurant, you SHOULD NOT try to be cute by eating your fried chicken with a fork and knife! Are you out 'cho gotdamm minds? You betta grab the chicken with your fingers and attack it like you mean it, no matter how much it costs or how nicely you've got your cloth napkin folded on your lap. Get it together and end this bougie nonsense!", "rating": 3, "date": "2009-01-02"}, {"excerpts": ["the macaroni pie, red beans and rice.  ", "Hmm ", "ok where is our main dishes, 7 minutes later the main dishes... isnt that bassackwards, at least give me the main stuff first.  ", "The chicken was good, but not even the best ive ever had, like some have claimed, actually it wasnt very seasoned, same with the fish.  ", "Good but not great or screaming (like the homies say).  ", "The mac and red beans and rice were ok.. but not screaming.  ", "I can say though they were prepared a lil different, the plantains were good.  ", "All in all the meal is nice, but all the sides stood out not the main dishes they were kinda bland to my soul food palette."], "author": "Wes H.", "review": "Im a hard brotha to please, with that said... imma have to give you the rundown.  Called trying to book a reservation for a special bday night on a friday... \"We only do reservations for parties of 5 or more\", what? ok first strike.. being that when we got there it was an hour wait.  ugggh.. and before i go further - wait is the theme to this place..  I dont mind being patient but maan, too much waiting isnt too much fun. The setup is chill, nice, i even dig the front porch part, though it doesnt remind me of a soul bros front porch.. lol.  The bar is only wine and beer, hmmm ok had to order something foofy, no cognac  :(  After about an hour and some change we got seated.  By this time we knew what we wanted to eat, so we ordered as soon as we sat down.  During that time they brought out some great cornbread, this was the highlight of the night , with some jamming , honey butter with peppers.. man that was good.  After more waiting they brought out some fried okra to tiddy us over.. my lady liked it with the spicy ketchup. Ok 25 to 30 minutes later, they brought our sides... the macaroni pie, red beans and rice.  Hmm ok where is our main dishes, 7 minutes later the main dishes... isnt that bassackwards, at least give me the main stuff first.  The chicken was good, but not even the best ive ever had, like some have claimed, actually it wasnt very seasoned, same with the fish.  Good but not great or screaming (like the homies say).  The mac and red beans and rice were ok.. but not screaming.  I can say though they were prepared a lil different, the plantains were good.  All in all the meal is nice, but all the sides stood out not the main dishes they were kinda bland to my soul food palette.", "rating": 3, "date": "2008-04-12"}, {"excerpts": ["But I went along willingly - with an open heart and an open mind probably brought on by the fact that I was seriously Jones'n for some really good red beans and rice and a bowl of real Louisiana style gumbo. ", "Cute place - pretty good service - cold beer - comfy booths and tables - nice crowd of people - all good so far. ", "So we order all the really southern items on the menu - ", "If you bill yourself as a southern food joint - and you serve inedible gumbo, lousy red beans and rice, mediocre greens, OK shrimp and grits and hush puppies like none I have ever eaten before (and not in a good way) - well then you deserve to get some not so nice things said about your place. ", "This food was not OK or mediocre or \"maybe I'll try it again\" kinda food - it was just bad. ", "Really bad. ", "Yet I felt bad when we left - I liked the way the joint felt - someone has put their heart and soul into it and created a place with a great feeling and a cool crew. ", "But the food we had was terrible and I will never be able to return there again. ", "So - thanks again Yelpers! ", "You've kept your track record in tact - another highly rated Yelper joint that was just about as bad as bad can be. ", "Congrats to all you unqualified critic wannabe Yelper clowns."], "author": "stephanie d.", "review": "I have avoided Yelper favorites for months now after the many lousy experiences I've had at these \"incredible favs\" of the Yelper (morons) crowd. But I got dragged to this place the other night because I am a former French Quarter resident and LSU grad - so pals of mine always want to take me to southern/cajun/creole places. Why? I don't know why...because I always tell them that I have NEVER had good Louisiana cooking outside of Louisiana - simple as that. But I went along willingly - with an open heart and an open mind probably brought on by the fact that I was seriously Jones'n for some really good red beans and rice and a bowl of real Louisiana style gumbo. Cute place - pretty good service - cold beer - comfy booths and tables - nice crowd of people - all good so far. So we order all the really southern items on the menu - that's why we went there - who goes to a place like this and orders a burger? Yelpers do - that's who - because they are bozo's and don't know any better - then they write about it because they think they are qualified to do so and that somebody out there cares. Listen up Yelpers - they don't. If it weren't for your Mom and your \"friends\" that tell you how funny you are - no one would read the uninformed crap that you write. This place was such a bust it is hard to know where to begin? Where they found the recipes for some of this food is a real mystery? The food was so bad it's almost like you would have to intentionally try to cook it that poorly. If you bill yourself as a southern food joint - and you serve inedible gumbo, lousy red beans and rice, mediocre greens, OK shrimp and grits and hush puppies like none I have ever eaten before (and not in a good way) - well then you deserve to get some not so nice things said about your place. This food was not OK or mediocre or \"maybe I'll try it again\" kinda food - it was just bad. Really bad. Yet I felt bad when we left - I liked the way the joint felt - someone has put their heart and soul into it and created a place with a great feeling and a cool crew. But the food we had was terrible and I will never be able to return there again. So - thanks again Yelpers! You've kept your track record in tact - another highly rated Yelper joint that was just about as bad as bad can be. Congrats to all you unqualified critic wannabe Yelper clowns.", "rating": 1, "date": "2010-01-20"}], "bag of zapps chips": [], "side of coleslaw": [{"excerpts": ["Between the three of us we got a bucket of chicken with sweet corn and black eyed peas and collared greens as our side with an additional side of coleslaw for Les, cause he's a fan.\n\n"], "author": "Biggie M.", "review": "Just got back from a halloween dinner at The Front Porch.  I'd been wanting to try this place since they opened.\n\nI have to preface this review though.  I went to The Front Porch with two friends, one of whom is friends with the chef.  While I believe I would still have given The Front Porch 5 stars if my friend didn't know the chef, her personal touch--which I believe she probably bestows on all customers in one way or another--made our experience all the more extraordinary.\n\nSo we sat down and got water right away.  The restaurant's got a great ambiance and I admired their shelves by the table with salt and pepper, candle and flower.  \"Real Cute,\" as my friend C-Diddy would say.  \n\nImmediately the chef, who is quite attractive--not that it matters, but she is, brought us fried okra with a great sauce.  It. Was. So. Good.  I am now an Okra fan because of Sarah!  She also brought over cocktails that had rose petals and champagne as main ingredients and those were wonderful as well.\n\nA little later we got cornbread, in the shape of corn on the cob, with sweet butter.  Also so good, and I for one, appreciate the details.  \n\nWe ordered an Heirloom Tomato Salad and it was plated beautifully and tasted even better.  I was eating the sauce after it was all gone.  Really simple, and really friggin good.\n\nBetween the three of us we got a bucket of chicken with sweet corn and black eyed peas and collared greens as our side with an additional side of coleslaw for Les, cause he's a fan.\n\nI    Have    Never   Had  Chicken   So   Delicious!  \n\nShe knows how to use that spice rack.  Seriously, genius with the spices.  The corn was the same deal and the black eyed peas were great too.\n\nWe didn't get dessert because it was halloween and we wanted to be home to give out candy, but they looked great too.  \n\nI will be back for sure!\n\nThanks for an awesome and UNIQUE meal.  Such a special place.", "rating": 5, "date": "2006-11-01"}], "baked mac  cheese": [], "rocky jr chicken lunch box": [], "gulf shrimp lunch box": [], "local rock cod lunch box": [], "roasted portobello mushroom lunch box": [], "rocky jr chicken a la carte": [], "gulf shrimp a la carte": [], "local rock cod a la carte": [], "roasted portobello mushroom a la carte": [], "pieces fried chicken": [{"excerpts": ["We got the four pieces fried chicken $18.50. ", "Knowing that we skipped the appetizer, our waiter told us it would take 30 min to cook the chicken. ", "We didn't mind waiting. "], "author": "YJ L.", "review": "The restaurant was very easy to find. Plenty street parking on San Jose Ave. Saturday nights are very busy. Make sure to make a reservation.\n\nWe got the four pieces fried chicken $18.50. Knowing that we skipped the appetizer, our waiter told us it would take 30 min to cook the chicken. We didn't mind waiting. The chicken was absolutely fresh, hot, crispy outside and tender inside. \n\nWe also got the shrimp grits ($24) and mac and cheese ($8). Both were very delicious.", "rating": 4, "date": "2015-03-21"}, {"excerpts": ["We ordered the bucket of 10 pieces fried chicken, fried pickle, mac and cheese, beef short ribs. ", "The chicken was juice inside and crispy outside with perfect seasoning. ", "Mac and cheese was great. ", "The waitress was very attentive. ", "The only thing I didn't like about this place was that the light was too dim.."], "author": "grace k.", "review": "One of the best fried chicken I ever had ! We ordered the bucket of 10 pieces fried chicken, fried pickle, mac and cheese, beef short ribs. The chicken was juice inside and crispy outside with perfect seasoning. Mac and cheese was great. The waitress was very attentive. The only thing I didn't like about this place was that the light was too dim..", "rating": 5, "date": "2014-03-29"}], "spicy shrimp  grits": [], "burger": [{"excerpts": ["* Burger ($14.50, +1 Cheddar, +$2.50 Bacon) - 4.5 stars\nVery delicious. ", "Soft bun, juicy moist patty, definitely very oily but worth it. ", "However, the fries were terrible. "], "author": "Ziyan C.", "review": "OVERALL: Another delicious dinner at the Front Porch! I'm glad I finally brought the bf here, and he and our out-of-town friend thoroughly enjoyed it. We definitely ate too much but it's hard not to with so much good food on the menu.\n\nRESERVATIONS: We had dinner at 7:30 on a Thursday. I made the reservation online day in advance, plenty of openings. There would've been no wait on the porch (no reservations, dog-friendly seating).\n\nTHE COST: $60 total per person, including tax/tip. We got several drinks, 2 starters, 1 side, 3 entrées, and 1 dessert.\n\nTHE FOOD:\n* Free cornbread - 3 stars\nNot great, not terrible. On the dry side, definitely need that butter. \n\n* Gumbo w/ Chicken, Andouille ($8) - 2.5 stars\nToo much soup, very little rice & chicken. \n\n* Crawfish Hush Puppies ($11.50) - 2.5  stars\nToo much of the bread, which was dry, not enough crawfish filling.\n\n* Tea Brined Pork Chop ($24) - 4 stars\nPretty delicious. The pork was moist and had great flavor. I loved the brown butter yam puree also.\n\n* Burger ($14.50, +1 Cheddar, +$2.50 Bacon) - 4.5 stars\nVery delicious. Soft bun, juicy moist patty, definitely very oily but worth it. However, the fries were terrible. They looked like the type I like (thick, almost wedge-like, with a light crisp and soft filling), but they were incredibly dry, all bad crisp with no filling, and clearly had been frozen.\n\n* Fried Chicken, 4 piece ($19.50) - 3.5 stars\nDepending on the cut, some of the meat was dry, some more moist. The breading was nice & crunchy.\n\nSIDES\n* Baked Mac & Cheese ($8.50) - 4 stars\nYum, loved this, tons of great cheese & soft, well-cooked macaroni.\n\nDESSERT\n* Bourbon Pecan Pie ($9) - 3.5 stars\nVery rich, with buttery crust and nice filling that wasn't just compacted puree but had a lightly crumbly texture.", "rating": 4, "date": "2018-05-21"}, {"excerpts": ["I ordered a burger with bacon and their homemade cheese and it comes with their creole fries. ", "My burger was... ", "FANTASTIC. ", "It was medium well, my personal preference, the cheese was oozing off the patty, and the bacon was super crispy! ", "It was visually and texturally appealing. ", "Don't even get me started on the fries. "], "author": "Jonathan A.", "review": "This place is definitely worth coming back to. I have made reservations using Yelp for 7:45pm on a Friday night. We came about 30 minutes early and decided to check in and surprisingly they got us seated right away! \n\nIt was a full house, we got seated in the middle tables in between the booths and the bar. It's pretty dark in there but assuming they're going with the whole \"front porch\" theme it was a nice type of ambience. \n\nThe service was great! Our host was super friendly, and our waiter (didn't catch his name :[ ) was so attentive. \n\nI went with my partner, Jeffrey, and he ordered the 4 piece fried chicken with collared greens and garlic mashed potatoes, which takes 30-45minutes to make btw. I ordered a burger with bacon and their homemade cheese and it comes with their creole fries. I also ordered their baked Mac and cheese. \n\nWe did wait awhile for our food since Jeffrey ordered the fried chicken, but we didn't mind at all since they told us before we ordered that it would take awhile. They did give us some complimentary cornbread which was buttery and soft. After 40 minutes of waiting, the food came! I was happy they brought both our dishes at the same time and it all looked so good!\n\nMy burger was... FANTASTIC. It was medium well, my personal preference, the cheese was oozing off the patty, and the bacon was super crispy! It was visually and texturally appealing. Don't even get me started on the fries. I loved the seasoning they used, it definitely had a kick to them.\n\nHowever the baked Mac and cheese was a bit bland. Nothing exciting about it besides the skillet and the cheesy ness of it. \n\nI did try Jeff's fried chicken which was crispy and very flavorful. I didn't like the collard greens too much (I don't really like vegetables so take my opinion with a grain of salt) and the garlic mash definitely had garlic. \n\nAll in all, this place has personality, a hipster personality, and tasty good. Would come back again.", "rating": 4, "date": "2018-08-09"}, {"excerpts": ["and so did my daughter's burger.  \n\n"], "author": "Erika B.", "review": "This place was great from start to finish. I loved the cozy atmosphere and all the quirky things to look at. When I told the waitress how cute it was, she told me that our kids were sitting on a Ford van seat!  \n\nService was very friendly and welcoming.\n\nThe menu was just what we were looking for, which was some southern comfort food. When I told the waitress I was unsure about ordering the fried chicken because it came with 4 pieces, she told me I could just order two. That was a great solution for me. The chicken was so good and crispy, just perfect. I also ordered mashed potatoes and gravy. The portion was generous and it was also 5 star. \n\nMy husband had the spicy shrimp and grits, which were really tasty. I didn't try my son's short ribs but they looked so good l and so did my daughter's burger.  \n\nSomeone there even has good taste when it comes to music. The playlist was 70s and 80s, which can be really bad or really good. But in this case, I was into it and it kind of fit the whole atmosphere.\n\nFor dessert we all had beignets, something you rarely see on any menu. My daughter was excited to see them, since we haven't had them since our last trip to New Orleans. Other dessert options I'd try if I went back a few times are pecan pie and peach cobbler. \n\nThis place is a southern food paradise right in the city!", "rating": 5, "date": "2018-07-24"}, {"excerpts": ["What we ordered:\nCollard greens\nMac and cheese\nRibs with mashed potatoes\nBurger \nBucket of chicken \nLibations \n=$150 \n\n\nFinal thoughts: \nLet's just say, I thought this place was just ok, but not \"knock my socks off\" kinda good. "], "author": "Briana H.", "review": "For a 4 star rating and at 2300+ review count, I was expecting a solid dining experience. Well, I was mistaken because this place wasn't as good as I had thought it would be. \n\nRating:\nFood-3/5\nValue-2/5\nService-4/5\n\nWhat we ordered:\nCollard greens\nMac and cheese\nRibs with mashed potatoes\nBurger \nBucket of chicken \nLibations \n=$150 \n\n\nFinal thoughts: \nLet's just say, I thought this place was just ok, but not \"knock my socks off\" kinda good. I've had better southern food elsewhere and for half the price. Therefore, the dinner just didn't cut it for me and I'd probably wouldn't recommend going here as a first choice.", "rating": 3, "date": "2018-04-21"}, {"excerpts": ["We ordered the burger, and the bucket of fried chicken, which comes with 10 pieces of chicken. ", "We also got the asparagus and the baked Mac n cheese. ", "They were all so delicious! ", "Only thing is that I wish the chicken was a tad bit more cooked! ", "Not saying that it was raw or anything. ", "Just had a little bit of smell to it. "], "author": "Do P.", "review": "Great vibe. It looks like a cafe from the outside.\n\nWe ordered the burger, and the bucket of fried chicken, which comes with 10 pieces of chicken. We also got the asparagus and the baked Mac n cheese. They were all so delicious! Only thing is that I wish the chicken was a tad bit more cooked! Not saying that it was raw or anything. Just had a little bit of smell to it. But really, it was still good.\n\nThe service was great. The servers were a pleasure to speak to. Overall, had a great time!", "rating": 4, "date": "2018-04-09"}, {"excerpts": ["Got mashed potatoes, Mac and cheese, burger, all the southern comfort foods and it was glorious!\n\n"], "author": "Maansi D.", "review": "Omg loved this place. My husband and I are from the south so we were really missing some southern comfort when we stumbled upon this place. Got mashed potatoes, Mac and cheese, burger, all the southern comfort foods and it was glorious!\n\nAlso loved the vibe, cozy little nook of a place really gives the feeling of being home in a neighborhood spot.\n\nCan't wait to go back!", "rating": 5, "date": "2017-10-10"}, {"excerpts": ["My friend got the po' boy fried chicken (burger) and was very tasted. ", "I feel like the fried chicken here is very breaded but the batter that it is fried in is a bit different from other places. ", "I think it has more of a cajun spice to it which I really like. ", "I do normally prefer my fried chicken to have a decent amount of crunch ", "but it was a little more than I was use to ", "but it wasn't a bad thing. ", "I would definitely be back at this place and probably try the shrimp and grits along with the hush puppies which they have later in the day. "], "author": "Andrew T.", "review": "This is probably the best place to get chicken fried steak. I've never had such a good, flavorful piece of chicken with gravy along with cheese grits before. Everything was for sure on point. \n\nI originally came here for the crawfish hush puppies but was disappoint to not see it on the brunch menu when we arrived, so for only that reason I'm docking off a star. Aside from that not a single thing was bad. I also got the hangover helper which was good but I think I should have stuck to the baked mac and cheese. \n\nMy friend got the po' boy fried chicken (burger) and was very tasted. I feel like the fried chicken here is very breaded but the batter that it is fried in is a bit different from other places. I think it has more of a cajun spice to it which I really like. I do normally prefer my fried chicken to have a decent amount of crunch but it was a little more than I was use to but it wasn't a bad thing. I would definitely be back at this place and probably try the shrimp and grits along with the hush puppies which they have later in the day. A neighboring table got the shrimp and grits and I literally drooled on myself as they brought it out.\n\nTIP: You should make a reservation online so you don't have to wait super long.\n\nVIBE: It's pretty much a house that was converted into a restaurant/bar. Very cool but I wish there was a bit more lighting inside the joint.", "rating": 4, "date": "2017-05-22"}, {"excerpts": ["I just ordered onions and mushrooms on my burger and it was SOOOO good. ", "Ty for making it happen"], "author": "Darryl V.", "review": "Omg. I just ordered onions and mushrooms on my burger and it was SOOOO good. Ty for making it happen", "rating": 5, "date": "2018-09-19"}, {"excerpts": ["The burger was off.  ", "I think they used ground short rib ", "but when you do that you should mix it with some prime ground chuck.  ", "It was really hard to eat and it had so much char from the grill I could taste it for a whole day later.  ", "Hubby had the Dr Pepper short ribs way to sweet.  ", "You need insulin after eating that.  ", "Service was slow and lack lustre.  ", "They had lights turned down way low.  ", "The front porch needs a scrub down and a little mini renovation.  ", "I know that is a kind of hipster place but at least try not to look so left over including the kitchen staff SMH!!"], "author": "Pam P.", "review": "Well I have been here before and times have changed:  The burger was off.  I think they used ground short rib but when you do that you should mix it with some prime ground chuck.  It was really hard to eat and it had so much char from the grill I could taste it for a whole day later.  Hubby had the Dr Pepper short ribs way to sweet.  You need insulin after eating that.  Service was slow and lack lustre.  They had lights turned down way low.  The front porch needs a scrub down and a little mini renovation.  I know that is a kind of hipster place but at least try not to look so left over including the kitchen staff SMH!!", "rating": 2, "date": "2018-07-27"}, {"excerpts": ["Husband had the burger, which he thoroughly enjoyed. \n\n"], "author": "Stephanie M.", "review": "Great spot!\n\nWe really enjoyed front porch's food. I had the chicken po boy, which i didn't know was a thing, but I liked it very much. Only challenge was that what seemed like 90% the mayo-sauce was all on one half of the sandwich -- so i really felt it was lacking for the first 50% of the meal, and was making a real mess once I hit the sauce for the second 50% of the meal. Husband had the burger, which he thoroughly enjoyed. \n\nThe place is pretty grungy, and feels very much like a dive bar -- may or may not be your scene. We were the yuppiest folks in there for sure.", "rating": 4, "date": "2018-05-13"}, {"excerpts": ["As for the food itself, I thought the burger that I got was pretty good although not particularly memorable. ", "The entrees are all fairly expensive as well ($15+). ", "All in all, I don't think the food is bad but there isn't much about it that would make me want to go back."], "author": "Stephany L.", "review": "I've been here twice, incidentally for my boyfriend's birthday both times. I really like that it's easy to get reservations for large parties- something rare for sf. The downside, however, is that the service was pretty slow. It could be because we had a large group, but I felt like the time it took between us ordering and actually getting our food was a little unreasonably long- especially for a weeknight (the restaurant was probably 50-75% full?). As for the food itself, I thought the burger that I got was pretty good although not particularly memorable. The entrees are all fairly expensive as well ($15+). All in all, I don't think the food is bad but there isn't much about it that would make me want to go back.", "rating": 3, "date": "2018-03-11"}, {"excerpts": ["Had a cheat day and had a small bite of my friends burger. ", "Quality meat! ", "Juicy & tender. ", "Like how its deconstructed so you can do what you want with your burger. ", "Creole fries were decent but nothing to write home about. \n", "My friend kept asking for more ketchup cuz they give you a tiny saucecup. "], "author": "Angela C.", "review": "Had a cheat day and had a small bite of my friends burger. Quality meat! Juicy & tender. Like how its deconstructed so you can do what you want with your burger. Creole fries were decent but nothing to write home about. \nMy friend kept asking for more ketchup cuz they give you a tiny saucecup. Finally our server got the point and gave our table the whole bottle.\n\nWe came in here for dinner and it was so dimly lit. We had to use our phones to read the menu.. Then they came by halfway thru our meal to light the candle at our table..\n\nService was courteous but a bit slow. Slightly expensive but worth it if you enjoy the food. \n\nSkip the sparkling lemonade. Tasted like lemonade with club soda. They also add alot of ice to their drinks so ask for no ice or less.", "rating": 4, "date": "2017-05-25"}, {"excerpts": ["On my second trip, I wanted to get back to my burger roots ", "so I tried the Porch Burger with Pt. ", "Reyes Blue and Bacon + cajun fries. ", "This meal hit the spot while being highlighted by their amazing house made hot sauce, buy a bottle! ", "All in all, it's a great spot in a city lacking the laid back creative food explosion LA is currently experiencing - that I personally wish SF could mimic."], "author": "Ryan M.", "review": "In a city full of an unnecessary amount of \"high-end\" restaurants, The Front Porch is a breath of laid back fresh air. There's nothing confusing about the menu and there's nothing pretentious about the place. You can expect to have a delicious relaxing meal, which for me, takes me back to dinner on my parents front porch in the Midwest. On my first trip, I enjoyed the fried chicken - it was tender, crispy, salty, and delicious. On my second trip, I wanted to get back to my burger roots so I tried the Porch Burger with Pt. Reyes Blue and Bacon + cajun fries. This meal hit the spot while being highlighted by their amazing house made hot sauce, buy a bottle! All in all, it's a great spot in a city lacking the laid back creative food explosion LA is currently experiencing - that I personally wish SF could mimic.", "rating": 4, "date": "2018-03-13"}, {"excerpts": ["Burger with house made American:  5000 stars.  ", "Wowza.  ", "Now, that's what I call a burger!  ", "The meat was cooked perfectly to my requested medium rare.  ", "The cheese was absolutely ridonkulous and melted perfectly.  ", "The fries were also the perfect balance between chewy and crispy.  ", "I'd come back for the burger alone.  "], "author": "Jen W.", "review": "So I have very mixed reviews about this spot.  \n\nLet's break it down...dish by dish!  Haha.\n\nDeviled eggs with bacon and bourbon jam:  3 stars.  The name of the item sounds so much better than it actually tastes.  I felt that it was a little too sweet for my liking but it was decent.  \n\nFried chicken, 4 pieces:  3 stars.  The chicken was crispy and tender...but the sides were meh.  The collard greens were way too large and chewy.  No seasoning whatsoever.  Mashed potatoes?  Definitely not a highlight.  Also served with popcorn which was soggy.  I'd order a bucket of chicken and leave the sides behind instead.\n\nBurger with house made American:  5000 stars.  Wowza.  Now, that's what I call a burger!  The meat was cooked perfectly to my requested medium rare.  The cheese was absolutely ridonkulous and melted perfectly.  The fries were also the perfect balance between chewy and crispy.  Fantastic.\n\nOur bourbon and ginger was stiff.  Perfect on a warm, sunny day.  \n\nOur food took a very long to come out.  There was a huge gap between the appetizer and the main courses.  We're talking a sitting uncomfortably twiddling our thumbs kinda gap.  \n\nService was friendly though and we weren't ignored at the bar.  I'd come back for the burger alone.  3 stars.  \n\nOur bill came out to around $60?", "rating": 3, "date": "2016-06-26"}, {"excerpts": ["We had Chicken and fries also blue cheese burger and fries ", "soooooooo good ", "the Owner was VERY nice and helpful.", "We suggested to him to put pictures on the menu.", "So many good choices went for lunch WiLL return for Dinner"], "author": "Rose U.", "review": "Omg me and my guy saw this place on diners and dives months ago and finally made it here. We had Chicken and fries also blue cheese burger and fries soooooooo good the Owner was VERY nice and helpful.We suggested to him to put pictures on the menu.So many good choices went for lunch WiLL return for Dinner", "rating": 5, "date": "2018-07-20"}, {"excerpts": ["We got fried pickles, fried chicken, the burger, braised beef and a salad but holly cow ", "was that food great. ", "I can easily say it was probably in the top 5 for me. \n", "The service is phenomenal, the place is cool, and the food is great. ", "What's not to love?"], "author": "Kristina G.", "review": "I can't be happier when yelp comes through. It wasn't even me yelping this time around. It was my not so yelper of a significant other. He converted for me! Anyway we were looking to cheat hard on our diets when the front porch appeared on our radar. It was serendipitous, I am convinced. We meant to go for ice cream rather than food but saw The Front Porch wondered what it was. Only the smallest restaurant with the biggest personality. \nWe got sat right away and ordered right away as well. We got fried pickles, fried chicken, the burger, braised beef and a salad but holly cow was that food great. I can easily say it was probably in the top 5 for me. \nThe service is phenomenal, the place is cool, and the food is great. What's not to love?", "rating": 5, "date": "2015-11-25"}, {"excerpts": ["My boyfriend ordered the burger with fries and a side of mac and cheese ", "and I ordered the Dr Pepper braised shorts ribs with a side of mashed potatoes ", ":) Everything was delicious! ", "The mac and cheese was cheesy and saucy! \n", "Oh and my drink I ordered was on another level I had the Midnight Sun-ll and one of the ingredients was butterfly flower infused rum!  ", "It was interesting in a good way ", ":) \n", "Overall my experience was 10/10! ", "Thank you for everyone's great service  ", "I can't wait to come back and try the spicy shrimp and grits!"], "author": "Brandi R.", "review": "First of all the front porch literally the front of the restaurant is adorable! There's a few tables outside to enjoy San Francisco's beautiful weather surrounded by sparkly lights, green plants and a cute rocking horse. \nMy boyfriend and I walk in and notice it's very small which is completely fine as I love small restaurants, to me there's better food and service. Inside is dark and cozy with an awesome bar! This is around 840pm so it's a completely different atmosphere than the day time hours. \nBefore we were sat I didn't know we needed reservations (not required but recommended) because it gets crazy busy as told by the hostess and our waitress ( I'll put her name once I find it out). Anyway luckily for us they had open tables so we were sat right away, we had an option to sit at the table in the middle of the restaurant which is noisier or at the bar which is more intimate. We chose the table because we don't mind the noise.\nRight away I notice the service is on point! Everyone who works there, bartender, hostess, waitresses, manager, bus boy, etc all helped out. They were all very nice and made sure everyone was taken care of.  \nLiterally right when we sat down a man brought us complimentary mini corn bread which was delicious then seconds later our waitress brings our water which was in a cool glass bottle. \nOur waitress was super cool and friendly! She went over the menu with us and recommended her favorites. \nMy boyfriend ordered the burger with fries and a side of mac and cheese and I ordered the Dr Pepper braised shorts ribs with a side of mashed potatoes :) Everything was delicious! The mac and cheese was cheesy and saucy! \nOh and my drink I ordered was on another level I had the Midnight Sun-ll and one of the ingredients was butterfly flower infused rum!  It was interesting in a good way :) \nOverall my experience was 10/10! Thank you for everyone's great service  I can't wait to come back and try the spicy shrimp and grits!", "rating": 5, "date": "2017-07-26"}, {"excerpts": ["I had a burger with American cheese, bacon, and a fried egg. ", "Honestly it was really good ", "i was sad ", "I couldn't finish it because I was so full. ", "Now the chicken was good ", "it was crispy ", "but the flavor was ok. ", "We found some parts of chicken that were a little under cooked. ", "The mashed potatoes were really good (I love mashed potatoes).  ", "The braised short ribs were very soft which allowed it to kind of melt in your mouth with the mashed potatoes. ", "Besides the chicken everything was amazing. ", "I would definitely come here again."], "author": "Denice Arielle M.", "review": "I loved all of the appetizers. The fried okra was really good and I don't usually like okra but I really liked this appetizer most. I had a burger with American cheese, bacon, and a fried egg. Honestly it was really good i was sad I couldn't finish it because I was so full. Now the chicken was good it was crispy but the flavor was ok. We found some parts of chicken that were a little under cooked. The mashed potatoes were really good (I love mashed potatoes).  The braised short ribs were very soft which allowed it to kind of melt in your mouth with the mashed potatoes. Besides the chicken everything was amazing. I would definitely come here again.", "rating": 4, "date": "2017-04-10"}, {"excerpts": ["Our elder son, had the burger (he was polite enough to accept it, he'd ordered the flank steak but it became confused somehow) ", "he ate 3/4 of it and was done; he also ate three fries and was equally over the fries too. ", "My wife is a lover of mac 'n cheese and yet most of it remained in her dish; she described it as simply a cheddar sauce and a lot dry. "], "author": "Drew R.", "review": "This was a late night vacation dinner but one well worth the wait. Our reservation was for nine o'clock and while we were on time we ended up being plus one, upon arrival. Probably not a big deal, but this is a small place; only worth mentioning because it resulted in a lengthy wait outside (probably to the tune of 30-45 minutes). They tried to make it right, with a free app, and bringing us drinks; the app however was slightly different (boiled peanuts) drinks were basically okay, sans the wine, which had turned (tasting of vinegar). They promptly replaced the wine with an appropriate substitution that was on par. \n\nIn any event, we were eventually seated and this place was busy! I mentioned it was late but still it was loud (at this hour on a weekday I believe that's a testament to a well enjoyed restaurant). It is also a bit eclectic and bohemian but definitely in line with the City and what I've come to expect (in a good way). In any event let me close this portion by saying they were all very polite, eager to please, and happy to go the extra mile in homage to their customers. \n\nI ordered the spicy shrimp and grits. First bite, grits, buttery, decadent, perfect consistency, almost mashed potato like and oh so savory. It came with a sauce that was very complimentary and offered incredible layers of appeal. The spicy was absent but that is typical for me, that said the sausage offered significant flavor to the dish and the shrimp was perfectly cooked. They served a bread snack small muffin, as a warmup, but it was a little disjointed for me; not as sweet as cornbread and tasted of sourdough without that consistency. The spread offered with the bread was okay, but did little to enhance the flavor of the bread, or stand on its own. \n\nAs for our other diners and guests: our younger son had the Dr. Pepper ham, which I didn't taste, but those that did raved. Our elder son, had the burger (he was polite enough to accept it, he'd ordered the flank steak but it became confused somehow) he ate 3/4 of it and was done; he also ate three fries and was equally over the fries too. My wife is a lover of mac 'n cheese and yet most of it remained in her dish; she described it as simply a cheddar sauce and a lot dry. I'd have went with a creamier cheese; though I love cheddar, it doesn't typically make a great sauce as it gets grainy when melting. \n\nHey, we often joke I do better at ordering, so perhaps I should've ordered for my lovely wife. Overall, I was happy with the dining experience, but I think she had the lesser experience, as did the elder son. I'd still come back, especially were I local.\n\nOn a brief side note: we could've easily passed by this place and missed it so know the address or destination, but it's worth the trip.", "rating": 4, "date": "2015-04-09"}, {"excerpts": ["Waited almost an hour for a salad and a burger. ", "Finally had to ask the manager where the food was and suddenly it appeared. ", "The burger was incredibly overcooked ", "but I didn't feel like sitting there any longer for them to make a new one. ", "A burger, a salad, and 2 glasses of wine between 2 people came to about $100. ", "The manager noticed the burger was overcooked and gave us a free glass of wine but frankly we shouldn't have paid for that burger period. ", "I can't justify coming back here after multiple bad experiences."], "author": "Erica G.", "review": "They make good cocktails and the staff is very friendly but the service is pretty subpar. The first time we went we waited about 30 mins for simple bar food. We thought it was an anomaly so we went back again a few weeks ago. Waited almost an hour for a salad and a burger. Finally had to ask the manager where the food was and suddenly it appeared. The burger was incredibly overcooked but I didn't feel like sitting there any longer for them to make a new one. A burger, a salad, and 2 glasses of wine between 2 people came to about $100. The manager noticed the burger was overcooked and gave us a free glass of wine but frankly we shouldn't have paid for that burger period. I can't justify coming back here after multiple bad experiences.", "rating": 2, "date": "2017-11-13"}, {"excerpts": ["Then I was pleasantly surprised by a veggie burger on the menu, along with many vegetarian options for the menu staples! ", "Also, no request is ever denied, only configured to work for you, MY FAVORITE PHRASE IN THE CULINARY WORLD. ", "First out vegan red beans & rice... hands down best I've had, and yes I used to live in the south. ", "Next the veggie burger, Cajun fries, baked Mac were enough to set up the night! ", "The seasoning makes up for any meat withdrawals you may have from the veggie options. ", "That is amazing cooking. ", "My party had the famous fried chicken with garlic mash, veggie collards, and of course the ever so clever kettle corn that resembled an improved version of chicken & waffles. ", "Lastly, cast-iron upside down cake completed a perfect night. ", "Cheers to my favorite pub and *publican in South Mission! ", "I will be back for more ;) ", "BTW come with an open mind and be ready to feel comfortable and ready for a great time."], "author": "Mahdiah A.", "review": "This establishment is truly something unique and special. Literally when I walked through the door, I was greeted, seated, and served as a family guest! Kevin, Kenny, Mundo, and of course Xtina, the most gracious hostess in town. I have no filter for patronizing but that is not what you are going to get here. You are going to get a family of staff who care more about you hearing your table conversation clearly on Thirsty Thursdays instead of being sat in a preset spot. This was amazing! Memorable moments with the staff are just the introduction. The food! Wow. Ok so this Thursday they had one of the newest featured U.S. manufactured gins' (Blue Coat Gin) on special in three different ways. Mine featured an amazing pineapple slush along with a lovely edible flowers. Then I was pleasantly surprised by a veggie burger on the menu, along with many vegetarian options for the menu staples! Also, no request is ever denied, only configured to work for you, MY FAVORITE PHRASE IN THE CULINARY WORLD. First out vegan red beans & rice... hands down best I've had, and yes I used to live in the south. Next the veggie burger, Cajun fries, baked Mac were enough to set up the night! The seasoning makes up for any meat withdrawals you may have from the veggie options. That is amazing cooking. My party had the famous fried chicken with garlic mash, veggie collards, and of course the ever so clever kettle corn that resembled an improved version of chicken & waffles. Lastly, cast-iron upside down cake completed a perfect night. Cheers to my favorite pub and *publican in South Mission! I will be back for more ;) BTW come with an open mind and be ready to feel comfortable and ready for a great time.", "rating": 5, "date": "2018-02-22"}, {"excerpts": ["My friend and I both got the burger, as it was pretty much the cheapest thing on the menu. ", "No complaints about the food though; the burger was very well made and had a lot of nice flavors going on. ", "Pretty sizeable too, and I could barely finish my fries after devouring the burger. "], "author": "Gautam G.", "review": "Dropped in for a meal during Game 4 and the place was definitely popping. Perhaps too loud for some, but not overly bothersome. Small-ish TV but good enough for watching the game.\nWait staff was incredibly friendly and attentive!\nMy friend and I both got the burger, as it was pretty much the cheapest thing on the menu. I don't know if this place is actually expensive or if the other entrees are just huge, but we weren't really down to spend ~$25 on each entree. \n\nNo complaints about the food though; the burger was very well made and had a lot of nice flavors going on. Pretty sizeable too, and I could barely finish my fries after devouring the burger. (Fries are awesome too--try it with their ketchup and hot sauce for a great kick)\n\nDidn't try any drinks, but they had a very well stocked bar and it seemed like their cocktails were pretty popular with the crowd.", "rating": 4, "date": "2016-06-18"}, {"excerpts": ["People come here for the chicken but the burger is the best I've had in SF, and I ain't easy to please. ", "Cocktails are a stand-out and always served with the right mix of expertise and sass."], "author": "Malachi H.", "review": "This place is fantastic. Favorite restaurant in my hood. People come here for the chicken but the burger is the best I've had in SF, and I ain't easy to please. Cocktails are a stand-out and always served with the right mix of expertise and sass.", "rating": 4, "date": "2017-09-08"}, {"excerpts": ["But I don't know why they would order a burger when you can get it anywhere. "], "author": "Lynn C.", "review": "Came here for cousins birthday party. We had a table of 12 and another of 4. We made a reservation before hand and I kinda wish they made it in such a way that we were sitting on the same side and sitting close to each other. But this place is very small to accommodate large parties. \n\nWe ordered pretty much everything on their menu. The hush puppies and the sauce were to die for! And so were the fried okras. They suggested to double up on the apps but we didn't because we all had a chance to try everyone's. We also ordered the wings. \n\nI had to try their fried chicken, surprisingly there wasn't that much kick that the apps had. Also, it was a bit soggy not crispy. Maybe they were rushing or something for a huge party like ours. I really liked the mash and collard greens. Overall, very good. \n\nMy bf ordered the braised beef. Everything went together so well! The only criticism is too salty. But I'm used to not having too much salt I my food. It was really good though. Tender and juicy. \n\nMy cousins ordered The burgers and they thought it was alright. But I don't know why they would order a burger when you can get it anywhere. They really should have gone with the southern food since that's what they're known for. \n\nMy cousin said the Mac was good and so was the shrimp and grits. \n\nThis is really a good place to try. I think it's really weird though how the food comes out on different plates. It's confusing as to if this place is casual or fancy. The prices, decor are definitely for a fancy place. But the attire isn't. They need to make up their mind an decide on one plate to use. This is a good place to try once.", "rating": 4, "date": "2015-02-28"}, {"excerpts": ["My bf and I split a burger, the chicken mashers and greens and both got the lovely bunch of coconuts drink. ", "We couldn't finish the meal but hot damn ", "it was delicious. ", "We would come back ", "I'm a heart beat, but would need to hit the gym first!"], "author": "Maria X.", "review": "The food and drinks were so yummy at The Front Porch. My bf and I split a burger, the chicken mashers and greens and both got the lovely bunch of coconuts drink. We couldn't finish the meal but hot damn it was delicious. We would come back I'm a heart beat, but would need to hit the gym first!", "rating": 5, "date": "2017-02-19"}, {"excerpts": ["My friend who got the burger said it was nothing special but the fries were awful (undercooked and over flavored), and he was not impressed by the homemade ketchup. ", "The star of the evening, foodwise? ", "The mashers...yum! "], "author": "JD G.", "review": "When will I learn? I am a native of the south so I came here expecting some authentic Southern cuisine but was greeted with a very hipster interpretation of my favorite dishes that really fell flat...I should have known by the menu that this place was too cool for school when I saw the fried pickles with Tabasco aioli, but the reviews were great AND they were featured on DD&D, so I figured, why the hell not?\n\nWe made reservations for 7:30 but got there about half an hour early on Sunday night and said we'd wait but the hostess was very nice and offered to seat us immediately if we wanted to sit outside, which we did. Our server promptly greeted us, but she absolutely zero personality and seemed to be very cold...definitely a sign for things to come. They had sweet tea, to my delight, which tasted awesome, and I decided to split a bucket of chicken, with mashers and biscuits. My other friend got a cheeseburger and fries.\n\nSo how'd it all taste? In short, I was not impressed. The bucket of fried chicken was served with chicken and popcorn...clever? Maybe the popcorn was just for show because it was STALE. As far as the chicken, it tasted like it was over marinated before it was fried and the batter has zero flavor, so all I could taste was the over marinated chicken which didn't taste good at all. The biscuits weren't burnt, but they were pretty darn close. They were very hard and just crumbled when you tried to eat them. I will say, though, that the jam that came with them was amazing. My friend who got the burger said it was nothing special but the fries were awful (undercooked and over flavored), and he was not impressed by the homemade ketchup. The star of the evening, foodwise? The mashers...yum! I originally asked for the without gravy but they put it on there anyways, which was no big deal, but they were sooooo good!\n\nAfter we were done, we had half of the chicken left...my friend and I were arguing over who didn't have to take it home with us...I won that battle.\n\nNeedless to say, I don't think I'll be back. The service wasn't great, the food wasn't great, and I'll stick with KFC if I want some good fried chicken in the future.", "rating": 2, "date": "2016-02-22"}, {"excerpts": ["I could have eaten myself sick, but fortunately...or unfortunately...the portions aren't crazy in either direction...meaning that it is so much food you have to take home leftovers...or those pansy ass French portions which mean a stop through a burger joint is happening immediately after leaving the restaurant. "], "author": "Richard J.", "review": "I went here with my daughter with a serious appetite and a huge craving for Cajun/Creole food! Comfort and fire...and some  \"laissez les bons temps rouler\"! However what we got was not what I was expecting. \n\nFirst, walking into the place is was seriously dark...dive-y looking. All eyes turned as my daughter and I waited for someone to seat us. This is clearly a locals joint with a somewhat Hipster-ish patronage.\n\nAnyway...the wait staff turned out to be super friendly...and when I mentioned it was our first visit there...our waitress quickly changed her demeanor and settled in to tell us everything about everything! Not for a second did I feel that nervous energy many wait staff get when having to spend extra time explaining the menu! \n\nSo, while I was very disappointed that there was no Etouffee or Jambalaya on the menu...we were told it does make an appearance from time to time as their menu changes frequently. Disappointment set aside,we took our waitress's suggestion of having the fried chicken and Dr Pepper braised short ribs.\n\nDid I mention I was hungry? I also spotted crawfish hush puppies on the appetizer list as well as deviled eggs with a bourbon jam. \n\nHere's the short of what could be a long drawn out foodie orgasm of excited gesticulation...\n\nCrawfish hush puppies...F#%king awesome. Made the 9.00 price for 4 suddenly seem a bargain.\n\nDeviled eggs...my daughter doesn't like eggs, hates them in fact...but she downed half the order after I insisted she at least try them. She took one bite and I expected her to make a face and tell me the rest were mine. Not the case...she bit into one...her eyes sparkled a bit and a half smile crossed her mouth. We almost asked for a second order...I will be heading back here simply to get these again!\n\nDr. Pepper Short Ribs...amazing, spoon tender, deliciousness squared. Served with very good mashed potatoes...and a sauce/gravy made from the short rib braising liquid. This also came with perfectly cooked broccolitini. Any restaurant that can actually put out flavorful and completely cooked through veg while maintaining its Al-dente texture...just means you've got chefs in the kitchen who really give a shiznit about putting out good food.\n\nLast...the Fried Chicken was great...we had to wait a bit for this order as its made scratch...which is something that automatically impresses the hell out of me because most restaurants as a rule won't do this because its a wait.  Anyway...if I had one complaint t it was the fried chicken...but wait!...as a complaint this really doesn't count. So, my complaint? The chicken was too crunchy! So, you're thinking burnt, right? Nope...the chicken was cooked to perfection...the coating was delicious, flavorful, crunchy skin, yet for me...just a bit too crunchy...but its purely a texture thing for me. I think 95% of people would have to say its perfect...but I'm telling you my one miniscule issue...which isn't an issue as I'd order their fried chicken again and again.\n\nI could have eaten myself sick, but fortunately...or unfortunately...the portions aren't crazy in either direction...meaning that it is so much food you have to take home leftovers...or those pansy ass French portions which mean a stop through a burger joint is happening immediately after leaving the restaurant. The portions were a good balance...which initially in my starving state made them seem small...not true at all.\n\nThis place has easily provided my most flavorful and satisfying meal I've ever had in San Francisco...\n\nTo all the staff and chefs...OH and even the bus staff...you guys and gals are awesome! Thank you, each!", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["The bacon wrapped dates are good and the burger is delicious. ", "The oxtail poutine is ok "], "author": "Marlene T.", "review": "You just have to be in the mood for getting your fingers dirty, eating in the dark, and greasy food. It's better KFC and really good boiled peanuts. Prices are decent for a good date place. The shrimp and grits are ok; flavor was wonderful but shrimps weren't the size I would have preferred. The mac and cheese is a bit on the dense side and I prefer my mac and cheese a bit more sharp. The bacon wrapped dates are good and the burger is delicious. The oxtail poutine is ok but there is just not quite enough meat. \n\nStick to the basics and get a bucket of chicken and some boiled peanuts.", "rating": 4, "date": "2014-02-26"}, {"excerpts": ["The burger was ok, nothing special, but they're specialty isn't burgers. \n\n"], "author": "Cheeky S.", "review": "Chill environment with dim lighting because you can't look sexy while devouring their delicious fried chicken!!!! We sat at the bar as the wait was long and we didn't make reservations. The bucket of chicken was perfectly crispy and had a spicy kick. The fried okra was tasty. The burger was ok, nothing special, but they're specialty isn't burgers. \n\nI ordered the spicy margarita which was quite tasty, but I will get it slightly spicier next time.", "rating": 4, "date": "2014-05-25"}, {"excerpts": ["I ordered the fried chicken, beignets, and my boyfriend had the burger.\n\n", "My boyfriend's burger was pretty good. ", "The BEST part of the meal was the beignets. ", "A donut like dessert with lots of powdered sugar. ", "Babe kept eating them tho "], "author": "Mabel Y.", "review": "Saw lots of great reviews for Front Porch so I stopped by for some take out. I ordered the fried chicken, beignets, and my boyfriend had the burger.\n\nThe fried chicken was alright, the most flavorful part was just the breading but the chicken was a bit dry and flavorless. The fried chicken came with mashed potatoes and collard greens. Thumbs up for heavy carbs mashed potatoes and thumbs down for the collard greens. My boyfriend's burger was pretty good. The BEST part of the meal was the beignets. A donut like dessert with lots of powdered sugar. Babe kept eating them tho he claimed he was full.\n\nDecor at Front Porch really does look like... well, a front porch.", "rating": 3, "date": "2012-07-18"}, {"excerpts": ["Best burger ever! ", "Had it with the American cheese. ", "Fried pickles were a must too."], "author": "Cynthia H.", "review": "Everything was delicious! Best burger ever! Had it with the American cheese. Fried pickles were a must too.", "rating": 5, "date": "2016-09-05"}, {"excerpts": ["I also tried the burger which was properly cooked to order, medium rare, but I wouldn't say it's a ", "must get item here.  "], "author": "Shannon L.", "review": "I love that a lot of families bring their young kids to eat dinner here and that the servers are so warm towards them.  \n\nI made a reservation on Saturday night for 5:30pm, right when they open, and the restaurant filled up shortly after we were seated.  \n\nThe fried chicken really is the bomb diggity.  I don't know what exactly is in the seasoning but it the right balance.  You have to ask for their two hot sauces on the side--the orange bottle (habanero) is so darn tasty you'll want to drizzle it on everything.  Sides for this dish are collard greens (good) and mashed potatoes (good but not special).\n\nI also tried the burger which was properly cooked to order, medium rare, but I wouldn't say it's a must get item here.  The fries that come with it are thick and seasoned spicy, just the way I like it!!  \n\nGreat service.  Our server came by to fill up our water TONS of times even though we had a bottle at our table, which I usually assume means its our responsibility.  I would definitely come back for an intimate dinner with 1-3 people; it's not big enough for groups.", "rating": 4, "date": "2013-11-30"}, {"excerpts": ["I got the burger and it was quite perfect. ", "It was perfectly cooked, juicy and flavorful. ", "The fries were made fresh and even the pickles and ketchup seemed to have been made in house as they had a unique, different flavor to them. ", "Everyone I was with loved their meals as well and most importantly we all left absolutely stuffed. ", "I really wish I could've gone here for brunch because the brunch menu looks even better the dinner menu. ", "I'm not from San Francisco but I might have to make the trip back just to come back to here. ", "Yes, it was that good. "], "author": "Waldo M.", "review": "When I asked everyone that I was with what their biggest complaint about this place was, one of my friends answered \"that it's not closer to my house\" and I couldn't agree more. The atmosphere is really chill and our waitress was very sweet and very helpful. I got the burger and it was quite perfect. It was perfectly cooked, juicy and flavorful. The fries were made fresh and even the pickles and ketchup seemed to have been made in house as they had a unique, different flavor to them. Everyone I was with loved their meals as well and most importantly we all left absolutely stuffed. I really wish I could've gone here for brunch because the brunch menu looks even better the dinner menu. I'm not from San Francisco but I might have to make the trip back just to come back to here. Yes, it was that good. No brainer 5 star review. \n\n\nThe front porch rocks, for sure.", "rating": 5, "date": "2015-09-27"}, {"excerpts": ["I have tried the fried chicken, the greens, the holy shit burger (or whatever it's called), ", "the french fries, the bacon-wrapped dates, and probably 8 other things- ", "all yummy\n5. ", "Portions are big...", "you will leave full.\n", "6. ", "The decor is really cozy, but the place is small, so make reservations\n7. ", "Staff is friendly\n8.  "], "author": "Brooke M.", "review": "I hate when people say \"let me preface this review by saying....\", but let me preface this review by saying I was born and raised in South Carolina, my dad grew up on a farm, and my grandma would fry the hell out of some chicken and okra.  So, I'm not teling you that I am an expert in the field of southern cookin' (but I'm an expert in the field of southern cookin').\n\n1.The mac and cheese is the closest thing to real southern mac n' cheese that I have found (aside from the dinner table during thanksgiving)\n2. The fried okra is DELICIOUS (it just happens to be my favorite food).\n3.  I don't order a meal, just the mac n cheese and fried okra, because who wouldn't want just that???\n4. I have tried the fried chicken, the greens, the holy shit burger (or whatever it's called), the french fries, the bacon-wrapped dates, and probably 8 other things- all yummy\n5. Portions are big...you will leave full.\n6. The decor is really cozy, but the place is small, so make reservations\n7. Staff is friendly\n8.  While you're being fat, Mithcell's ice cream is conveniently a block away, and still tasty enough to enjoy after stuffing your face at the Front Porch\n\nEnjoy!", "rating": 5, "date": "2013-06-19"}, {"excerpts": ["I really did not like much of ANYTHING about The Front Porch and neither did the rest of my party, although one of them ordered the burger and said it was pretty good.  ", "And the jalapeno aioli that came with the fried okra was good, not the fried okra though.  "], "author": "Emma H.", "review": "I really did not like much of ANYTHING about The Front Porch and neither did the rest of my party, although one of them ordered the burger and said it was pretty good.  And the jalapeno aioli that came with the fried okra was good, not the fried okra though.  OK so let me start at the beginning.  \n\nWe show up on Sunday afternoon around 12:45.  I tell the host that we had 3 and he asked me in a semi-horrified manner if we had a reservation.  I told him no and he said \"Ok well I'll be able to get you in in about 20-30 minutes.  *looks around* actually probably sooner, is your whole party here?\"  (I was totally confused as to why he acted like I was inside for showing up with no reservation then said it would be 20 minutes, I digress) I told him yes and went out front to wait with my girlfriends.  About 30-40 minutes later I checked in with him and he looked at me like it had been 30 seconds and shrugged and said \"uhh Idunno maybe like 20 minutes or so?\" um. what?  20 minutes later my pregnant friend (hungry, uncomfortable, swollen feet, read: watch out) went in to ask again and he told her with a great deal of snide attitude that we were next and it would be a few minutes.  About 10 minutes later we were called in.  Note that everybody waiting for a table was extremely pissed off and were in the same boat as us, INCLUDING people who had made reservations.     \n\nWe sat down and you know that kind of server who comes over and doesn't introduce themselves and just like puts waters down and just kind of acts like you come in 3 times a day and no greeting is even necessary?  i don't know if I described that correctly but its not like a familiar friendly attitude its like an obnoxious lazy can't be bothered way too cool attitude.  So she does that.  I don't know her name but I think she had an English accent.  Hard to say since she barely talked to us.  She barely ever came to the table and when she did she rushed us and was not friendly.  I ordered a Bloody Mary and it was the worst one I have ever had, it just had a really strange flavor I can't even really describe what it was, it was bitter and just strange.  Later I got a Lovely Day cocktail and it was pretty gross too, really cheap gin and really abrasive other flavors, do not recommend.  My girlfriend ordered a lemonade and she had to add sugar to it at the table, I totally didn't think I would agree but I tasted it pre-sugar and it was just lemon water (and they charge $3.50 each with no refills, really steep for lemon water).  \n\nThe fried okra tasted like it used those breadcrumbs from a canister and a lot of seasoning packet.  The jalapeño aioli was awesome and I'd eat a shoe dipped in that.  If I were to go again I would get an order of fries and a side of that aioli and call it a day.  The chicken and waffles was gross- the chicken was overly salty and I assume it is brined and whatever was in the brine just made the meat taste really strange, again I'm sorry that is not descriptive, it was just weird.  The worst part was the waffle, it was soggy and had gross chewy pieces of bacon studded in it just creating more saltiness.  It was a quite small portion and I hardly finished half.  Oh and its $18!! Where do these people get off?!?!?! The prices are INSANE!!! $50 per person for brunch.  \n\nMy friend got the shrimp and grits and it was OFF THE HOOK,  I only had one bite and maybe I was extremely hungry and disappointed by my own food but my memory is that it was awesome.  Recommend.  BUT, then again, shrimp and grits is sorta hard to fuck up.  Well maybe its not hard to fuck up but its also easy to get right.  \n\nThe server never came by to see how we were or ask if we wanted anything else, which we did, we wanted more cocktails the whole time.  She finally came by and put the check on the table and I had to ask if we could add to it and get more drinks.  Find a new line of work lady.  \n\nIf you want mediocre at best food, a rude host who is either lying to keep business or is just also really bad at his job, overpriced bad drinks using cheap well liquor all served to you by a person who is bothered by you and took cool for serving tables, come to Front Porch.  You can listed to gangster rap and use mismatched mugs, AKA hipster heaven.", "rating": 2, "date": "2015-03-04"}, {"excerpts": ["I would definitely come back for the burger."], "author": "Guisela L.", "review": "I liked the front porch. However with so much hype to the place it really made it difficult for me to have my own true opinion. With that said...lets start this review. It's a Saturday afternoon on a busy pride weekend. We have had a lot to drink and are now hungry and realize hey we're close to the front porch let's call and see if we could maybeeee get in. Luckily it wasn't so busy yet because it was early, they said sure come in we'll get you seated right away and sure enough we showed up 30 mins later and were seated at the bar. We gander the menu and make a couple of decisions. I ordered a bourbon ginger beer and my partner got a water. The drink was made stiff-perfect. Now on to the food. I ordered the 4 piece fried chicken with collard greens and mashed potatoes. My wifey got a hamburger with their own homemade American cheese, now normally I'd be like Hunnie...American cheese? Lol but she seemed pretty dead set on that decision so we went with it. My food came out on a tray with a line of popcorn on the side. I would've throughly enjoyed that but I have braces so I had to refrain, a bit odd to be there but I think my wife thought they were good. The collard greens were not my favorite, they weren't chopped up like I'm used to and they simply tasted a little funny to me. The mashed potatoes came with a scoop full of gravy which always pleases me so brownie points there and the friend chicken was crisp on the outside and tender on the inside which was great. BUT the big winner for us was the hamburger. The fries were just ok as they seemed to be a bit soggy but the hamburger itself was on a semi sweet soft bun and it was juicy, but what made it really special was that darn cheese! My goodness! I would definitely come back for the burger.", "rating": 4, "date": "2016-06-26"}, {"excerpts": ["We decided to try the Mac and Cheese, the Holy Shit Burger, the pork chops, and the chicken.  ", "The Holy Shit Burger is HUUUUUUGE!  ", "I took two bites and was done!  ", "It looked like it was made for 10!  ", "Ok I'm exaggerating......", "but there was no way I could conquer eating that burger by myself.  ", "The Mac and Cheese was extremely creamy and hot out of the oven.  ", "I didn't try the pork chop as I don't eat a lot of pork, but my boyfriend loved it.  ", "The fried chicken wasn't bad, but it was a bit dry.  ", "This place can get pretty loud and pretty packed ", "so try and make a reservation ahead of time."], "author": "Christine D.", "review": "I learned about The Front Porch through Groupon.  Upon arriving we were seated immediately.  The place is pretty dim....dimmer than other restaurants for sure.  We decided to try the Mac and Cheese, the Holy Shit Burger, the pork chops, and the chicken.  The Holy Shit Burger is HUUUUUUGE!  I took two bites and was done!  It looked like it was made for 10!  Ok I'm exaggerating......but there was no way I could conquer eating that burger by myself.  The Mac and Cheese was extremely creamy and hot out of the oven.  I didn't try the pork chop as I don't eat a lot of pork, but my boyfriend loved it.  The fried chicken wasn't bad, but it was a bit dry.  This place can get pretty loud and pretty packed so try and make a reservation ahead of time.", "rating": 4, "date": "2015-01-20"}, {"excerpts": ["I actually had the burger based on Yelpers and it was good .. ", "Just ridiculously large. ", "Had the other half for breakfast. \n", "We all had the spicy margarita -- it was just ok too.  ", "I'm super bummed.  ", "I wanted to give my friend a taste of real southern and he felt it fell painfully short.  \n", "Also.. I didn't feel very tended to by our waitress.  ", "The food runner did more for me than the waitress ever did.  ", "She was very pleasant, but didn't seem to feel like working too hard. \n", "The neighborhood IS sketch randomly.  ", "Just waiting outside briefly I had an encounter with a homeless woman trying to grab at my purse then proceeded to get into cars.  ", "Just a random aside ", "but it was a little sketch."], "author": "Kelly C.", "review": "This is really closer to 3.5 stars, but just couldn't give 4. \nHighlights?  Crawfish hush puppies and the fried chicken.  (My petite girlfriend cleaned her plate!! 3 huge pieces of chicken, mashed potatoes and some greens that she devoured before I had a chance to see much!)\nLow-lights:\nSkip the deep fried pickles.  All batter-- disappointing because I think they make their own pickles.. So it's perplexing they slice thin little strips and then drench in batter.  Why not a healthy circular slice with a more meaty pickle?  Hmpf. \nMy friends ordered the shrimp and grits .. Wasn't terrible wasn't memorable (I had brought one of them here because he was raised in Louisiana..\nAnd he said it wasn't worth returning to have again)\nI actually had the burger based on Yelpers and it was good .. Just ridiculously large. Had the other half for breakfast. \nWe all had the spicy margarita -- it was just ok too.  I'm super bummed.  I wanted to give my friend a taste of real southern and he felt it fell painfully short.  \nAlso.. I didn't feel very tended to by our waitress.  The food runner did more for me than the waitress ever did.  She was very pleasant, but didn't seem to feel like working too hard. \nThe neighborhood IS sketch randomly.  Just waiting outside briefly I had an encounter with a homeless woman trying to grab at my purse then proceeded to get into cars.  Just a random aside but it was a little sketch.", "rating": 3, "date": "2016-07-25"}, {"excerpts": ["Had the deviled eggs and fried pickles to start, the poke and burger for entrees. ", "Satisfaction taste buds all around. ", "Staff is friendly and down to earth, and I have to mention, the bathroom was super cute! ", "Next time we hope the weather is good so we can sit on the porch ", ":)"], "author": "Kaylene B.", "review": "Went there for date night, had a great time. They own the bar across the street so you can enjoy a drink there while you wait for a table. Had the deviled eggs and fried pickles to start, the poke and burger for entrees. Satisfaction taste buds all around. Staff is friendly and down to earth, and I have to mention, the bathroom was super cute! Next time we hope the weather is good so we can sit on the porch :)", "rating": 5, "date": "2016-07-03"}, {"excerpts": ["My schnitzel was perfect, rommate's burger was good as well."], "author": "Natasha R.", "review": "Me and my roommate decided to check this place out Friday evening. We drove by the place and realized that we already love the place. We asked for the table inside, since we really liked the interior design of the place. Food was delicious as well. My schnitzel was perfect, rommate's burger was good as well.", "rating": 5, "date": "2016-06-21"}, {"excerpts": ["This place has the absolute best burger I have ever had in my life. ", "They make a homemade American cheese that is absolutely amazing. ", "If you go here you MUST get a burger with their American cheese. ", "I also had it with bacon. ", "This is hands-down the best burger I've ever eaten, which encompasses New York, Los Angeles, Philadelphia, and San Francisco."], "author": "Mike S.", "review": "This place has the absolute best burger I have ever had in my life. They make a homemade American cheese that is absolutely amazing. If you go here you MUST get a burger with their American cheese. I also had it with bacon. This is hands-down the best burger I've ever eaten, which encompasses New York, Los Angeles, Philadelphia, and San Francisco.", "rating": 5, "date": "2016-05-21"}, {"excerpts": ["I had the burger, that came with a nice helping of veggies and fries. ", "The fries were so warm and hot -- they also had a special spicy powder on them that made it extra flavorful. ", "The burger was very juicy, tender, and the veggies basically augmented the size of the whole burger 2x. "], "author": "Hurnan V.", "review": "I came here with a large party for dinner on a weekend night. Given the size of our group, we called in ahead of time (1 hour), and the staff was so nice to set aside our table. Warning: it may have been the largest table they had -- anything over a party of 10 would have difficulty fitting in the restaurant around one single table.\n\nThe server was extremely friendly, and brought out more cornbread starters upon request. The dishes came out all at once, albeit it was more than a 25 min wait (approx. cook time for the fried chicken). The portions here are enormous (!!!), perfect if you are ravenous and craving some southern comfort food. I had the burger, that came with a nice helping of veggies and fries. The fries were so warm and hot -- they also had a special spicy powder on them that made it extra flavorful. The burger was very juicy, tender, and the veggies basically augmented the size of the whole burger 2x. (I was super hungry when I received my dish -- very piping hot, so watching out for minor scalding roof of the mouth if eating too quickly...)\n\nAll in all, would come back again for awesome food with good company!!", "rating": 5, "date": "2014-07-10"}, {"excerpts": ["Burger with Fried Egg & Bacon\nVeggielicious: Seasonal Scramble\n\nBig fan! "], "author": "Ge O.", "review": "The Front Porch is one of those places that I have come to adore. I am not the biggest fan of Southern Food so I was feeling a little meh after a few dinners. Then we discovered their brunch.\n\nNo matter what I am in the mood for at brunch time, Front Porch can satisfy. \n\nMore Lunch than Brunch: Caesar Salad with Shrimp\nHungover Eating is Hard Edition: Hangover Helper\nHungover but Feed Me Edition: Stoner Stack\nI Need Boring: Eggs Benedict with Spinach and Goat Cheese\nStarving: Burger with Fried Egg & Bacon\nVeggielicious: Seasonal Scramble\n\nBig fan! Be warned that their coffee is Chicory coffee. I stick to Sweet Teas or Bloody Mary's instead.", "rating": 5, "date": "2015-01-19"}, {"excerpts": ["Also my date had the burger and fries and the burger had no flavor at all.....", "I say these guys get better recipes or better cooks"], "author": "Char B.", "review": "The ambience is nice and that's about it....this is NOT southern creole food....I ordered Greens and Mac and Cheese, and the greens tasted like they had been doused in vinegar....the Mac and Cheese was very bland. Also my date had the burger and fries and the burger had no flavor at all.....I say these guys get better recipes or better cooks", "rating": 1, "date": "2015-12-28"}, {"excerpts": ["Burger was A+, very minimal \"plain\" burger - but that was what made it great, you could just taste the quality of the meat so well without any disguise. ", "Fried Chicken was a on the salty side, but moist."], "author": "Trini L.", "review": "Great! I wanted to say just how accommodating the service is. I had some last minute additions to my reservations and they made it happen so we could be seated near each other, for which I was very grateful. Food was great - Mac and Cheese was delicious. Mashed Potatoes and Gravy Especially. Burger was A+, very minimal \"plain\" burger - but that was what made it great, you could just taste the quality of the meat so well without any disguise. Fried Chicken was a on the salty side, but moist.", "rating": 5, "date": "2015-10-03"}, {"excerpts": ["If anything, I'll say without any reservation - best burger I have had on the west coast. "], "author": "Jane E.", "review": "You know that place you go to when you need some comfort food that hits the spot, just so perfectly? This is it. Best place ever. All the details that are outlined in their menu - from the special buns that are ordered to the sauce that they put into their food - it's absolutely spectacular. And that's an understatement. \n\nA review really can't do this justice. If anything, I'll say without any reservation - best burger I have had on the west coast. That's a tall order in itself.\n\nThe servers are amazing and so friendly. \n\nI will be coming back here... a lot. Also, let your diet rest for a day... or two. You can burn it off later. \n\n:)", "rating": 5, "date": "2014-01-30"}, {"excerpts": ["Everything else I've had there is also solid, with particular high marks for their mac n cheese, grits and burger.\n\n"], "author": "Baron C.", "review": "Pretty much everything that it's cracked up to be. It's expensive for comfort food but I've never left feeling disappointed and I've been frequenting this place for about 5 years now. \n\nThe fried chicken is one of the best in the city, with a nice crispy batter and juicy meat without feeling greasy.  Everything else I've had there is also solid, with particular high marks for their mac n cheese, grits and burger.\n\nThe rocking chairs outside are a lot of fun if the weather permits and if there's a long wait, I recommend spending your time getting a drink at either the rock bar across the street or the 3300 club at the corner (it's not quite as scary as it would appear from the outside).", "rating": 5, "date": "2013-10-07"}, {"excerpts": ["The burger was OK as well. ", "Pearls burger is a lot better for cheaper price. \n\n"], "author": "Paul V.", "review": "We came here because of all of the rave reviews about this place. We came in without a reservation when it first opened, so we were lucky to be able to grab a table. Looking over the menu, we decided to try a few things other yelpers recommended.\n\nLets go over the items that I didn't like so much...\n\nMac and cheese is OK. If it was crispier on the edges, I feel it could have tasted better.\n\nFor all the rave reviews we read about the fried chicken, we were hoping for more. Roscoes has better fried chicken in my opinion. For the price that they were charging to make fried chicken, I expected the meat to be more moist and flavorful.\n\nThe biscuits they served were really dry. I took a bite, and put it down.\n\nThe burger was OK as well. Pearls burger is a lot better for cheaper price. \n\nThe two dishes that I really did like was the devil eggs and the shrimp and grits. The devil eggs had the right amount of seasoning to make it taste really good. The shrimp and grits was also quite delicious.\n\nThis place really suffers from overhype. The food is fine, but for the price that we wer charged, I really expected better food.", "rating": 3, "date": "2013-12-10"}, {"excerpts": ["3 of us split a bucket of fried chicken, 2 other people got the burger & the steak. ", "we all loved our food. ", "The bucket of fried chicken consists of 9 pieces and popcorn (i know, random...). ", "The order of fried chicken also comes with mashed potatoes & collard greens. ", "Both of the sides were really good. "], "author": "Terry C.", "review": "I've been wanting to try The Front Porch for a while now.\n\n3 of us split a bucket of fried chicken, 2 other people got the burger & the steak. we all loved our food. The bucket of fried chicken consists of 9 pieces and popcorn (i know, random...). The order of fried chicken also comes with mashed potatoes & collard greens. Both of the sides were really good. The skin of the fried chicken was crispy and not oily, the meat was tender and juicy, even the big pieces of white meat. \n\nWe also ordered a side of the mac & cheese and it was good. The mac & cheese was topped of with a layer of cheesiness. I liked it, but i wish they'd add a cheese that has a a more unique taste like pepper jack or goat cheese.\n\nFront Porch has 2 special hot sauces and they were great with the fried chicken and sides. They also have a full liquor license now, the rose sangria was nice & refreshing.", "rating": 4, "date": "2011-10-02"}, {"excerpts": ["The burger melts in your mouth. ", "They're known for the fried chicken and just as I had expected, it was delicious. ", "Also had the crawfish hush puppies which I recommend. ", "Our waiter was very friendly too! ", "We called ahead to make a reservation but they take walk ins, although you might have to wait for a bit."], "author": "Elizabeth K.", "review": "The burger melts in your mouth. They're known for the fried chicken and just as I had expected, it was delicious. Also had the crawfish hush puppies which I recommend. Our waiter was very friendly too! We called ahead to make a reservation but they take walk ins, although you might have to wait for a bit.", "rating": 5, "date": "2015-09-05"}, {"excerpts": ["The burger was solid. ", "Friends were very satisfied with the arugula salad. "], "author": "Joel A.", "review": "Wonderful, classic meal. The mac & cheese was excellent - smoldering in a cast iron pan with a crusted top. The burger was solid. Friends were very satisfied with the arugula salad. There is something for everyone here!\n\nThe service was a bit slow but the atmosphere is great! They also give everyone a tasty cornbread muffin. Try the okra appetizer!", "rating": 4, "date": "2014-04-27"}, {"excerpts": ["My family on the other hand decided to order, Dr.pepper braised short ribs and the 8oz Bacon Burger. ", "Both of which I tried and were excellent. ", "The atmosphere was great very laid back and casual. ", "Loved this place and the food. ", "I would definitely recommend it."], "author": "Gabriella M.", "review": "This place was lovely. I went in for my birthday having never been there before, they were very accommodating as to what was great on the menu. I ended up ordering the fried chicken which was my god so delicious. My family on the other hand decided to order, Dr.pepper braised short ribs and the 8oz Bacon Burger. Both of which I tried and were excellent. The atmosphere was great very laid back and casual. Loved this place and the food. I would definitely recommend it.", "rating": 4, "date": "2015-09-03"}, {"excerpts": ["4 people had chicken, my friend had the holy shit burger, and I had the crab and andouille sausage. ", "For dessert, we had the beignets, apple cobbler, brioche bread pudding, and pecan pie. ", "No complaints there. ", ":) ", "All the food was good and we had a great time."], "author": "Melissa A.", "review": "My last night in San Francisco some of my family members and friends met here for dinner. We made reservations. We had a few appetizers, although for the life of me, I can't remember them all. Frito pie (got a lil spice to it), étouffée (pretty tasty), and bacon wrapped dates with goat cheese (sweet and salty and very cheesy). 4 people had chicken, my friend had the holy shit burger, and I had the crab and andouille sausage. For dessert, we had the beignets, apple cobbler, brioche bread pudding, and pecan pie. No complaints there. :) All the food was good and we had a great time.", "rating": 4, "date": "2013-04-20"}, {"excerpts": ["On Saturday night a friend told us about this incredible burger he had from The Front Porch. ", "He showed us pictures and described it in detail. ", "My mouth watered, CP drooled on me ", "and I knew we had to stop here on our way out of town Sunday afternoon. ", "The place is so cute ", "and I love the rocking chairs out front. ", "No burger for us. ", "But don't worry about me. ", "I was dedicated to having a huge freaking meal here. ", "CP had the breakfast sandwich. ", "I had the fried chicken and waffle. ", "We shared some sausage and grits. ", "and I hope I can try that heart attack inducing burger sometime!"], "author": "Tai F.", "review": "On Saturday night a friend told us about this incredible burger he had from The Front Porch. He showed us pictures and described it in detail. My mouth watered, CP drooled on me and I knew we had to stop here on our way out of town Sunday afternoon. The place is so cute and I love the rocking chairs out front. It's a little dark inside but we managed. \n\nSunday means brunch so it's a whole different menu. I realized this after we sat down. No burger for us. But don't worry about me. I was dedicated to having a huge freaking meal here. CP had the breakfast sandwich. I had the fried chicken and waffle. We shared some sausage and grits. We drank the coffee as fast as it was coming.\n\nThe food took a little while but they had given us a proper heads up in the menu (fried chicken is at least 25 minutes). Everything was very tasty. CP's sandwich was so good. The biscuit holding it together was saturated with the eggy goodness and falling apart. It was mostly a fork and knife situation. The sausage was less breakfast sausage and more kielbasa or something but it was very good. Grits are one of my favorite foods and these were winners. I just poured the whole bowl into my mouth (not really true). Fried chicken and waffles is a great meal. And I've had some great versions at many awesome restaurants. This one was pretty good but I've definitely had better. I think the sticking point was the waffle. It was missing something. Still great! Don't get me wrong. Just not the best. \n\nThis place is groovy and it looks like it becomes quite the spot at night. I can see the draw for sure and I hope I can try that heart attack inducing burger sometime!", "rating": 4, "date": "2012-07-17"}, {"excerpts": ["Burger was great. ", "Fried chicken on other tables looked good enough to steal. "], "author": "Jaime M.", "review": "Heirloom and watermelon salad was perfect. Burger was great. Fried chicken on other tables looked good enough to steal. And there's Bourbon Pecan Pie.\n\nI love it here.", "rating": 5, "date": "2014-10-14"}, {"excerpts": ["The Burger is pricey but good (I still make a better burger than anyone). ", "I had the Ox tail dish on my first visit. ", "It was decent ", "but I barely remember it "], "author": "Manny F.", "review": "There are things I really like about Front Porch and things that just aren't quite right. \n\n\nLet's start with the food! \n\nThe mediocre:\n\nThe pear salad and the creamed spinach are just OK in my opinion. Maybe it's just personal preference but I don't care for sweet salads and Creamed spinach shouldn't be chewy. The French Fries are nothing special.\n\nThe Good:\n\nThe fried Okra was everything it should be. The Burger is pricey but good (I still make a better burger than anyone). I had the Ox tail dish on my first visit. It was decent but I barely remember it so it couldn't have been that exciting.\n\nThe mouth wateringly good:\n\nThe shrimp and grits dish was so good it almost made me cry because my friend ordered it and all I got was a taste. I will definitely order this the next time I go in.\n\nThe things I don't like about Front Porch:\n\nIt's way too dark. This is a casual restaurant not a romantic one. people come here for a social meal, not to get close in a dark booth. The lights were so low that I had to turn on my phone flashlight to see my food and then they turned them down lower.\n\nOn my last visit the waitress was a little too surly for my taste. I think we won her over in the end but to be honest that just isn't good enough. Even though the atmosphere is extremely homey Front Porch is not a cheap restaurant. If they want my hard earned money I'd like friendly and helpful service; I don't expect to be treated like I ordered a cosmo at a dive bar.", "rating": 4, "date": "2011-11-29"}, {"excerpts": ["I ordered the burger for myself and tried some of the pulled pork sandwiches. ", "All the food was really good-- the standouts were the fried pickles and the mac & cheese. ", "My burger was good as well, but nothing special.\n\n"], "author": "Erica W.", "review": "I came here the other day with some family from out of town. I recommended it based on what I'd heard of it, so I was reallyyyyyy hoping it would impress.\n\nParking in the neighborhood was really difficult, so we ended up being a bit late for our reservation. It was no problem though, they seated us right away. Everyone I was with ordered drinks, and they all really enjoyed the mixed drinks.\n\nWe ordered:\nFried Pickles\nBaked Mac & Cheese\nand dates wrapped in bacon filled with goat cheese.\n\nI ordered the burger for myself and tried some of the pulled pork sandwiches. All the food was really good-- the standouts were the fried pickles and the mac & cheese. My burger was good as well, but nothing special.\n\nI just looked on their website at the updated menu, and I will DEFINITELY be back to try the soft pretzels, french onion soup, and lobster mac & cheese.\n\nOther than the parking and the noise level being a little too high for my taste, it was a great experience. Good food, good ambience, and overall a restaurant I will definitely be back to again.", "rating": 4, "date": "2013-01-03"}, {"excerpts": ["I've been here several times since my first review and will continue to keep coming in for 1) seriously good burgers that are juicy and taste like the best backyard bbq burger from a hot summer evening, 2) well-seasoned fried chicken that seems to have gotten the hint, 3) velvety mac n cheese that I'd like to marry and have mac babies with and 4) more celebrity sightings!\n\n"], "author": "Amanda R.", "review": "I've been here several times since my first review and will continue to keep coming in for 1) seriously good burgers that are juicy and taste like the best backyard bbq burger from a hot summer evening, 2) well-seasoned fried chicken that seems to have gotten the hint, 3) velvety mac n cheese that I'd like to marry and have mac babies with and 4) more celebrity sightings!\n\nThat's right, folks. I saw John Waters here last week, enjoying a meal with a table full of friends.\n\nIf it's good enough for John Waters, well then it's good enough for me.", "rating": 4, "date": "2012-01-20"}, {"excerpts": ["He loved his burger and the fries were perfectly seasoned. ", "My chicken was to die for, it was fried but didn't taste heavy or greasy, it was seriously so good. ", "The habanero hot sauce was also great. ", "I would definitely come back :)"], "author": "Homa K.", "review": "The reason why I'm giving this place 5 stars is because of the great service, delicious fried chicken, and cute outside eating area. I came here on a date with my boyfriend and we sat outside, it was so cute. After being greeted by our blonde waitress with a cute European accent, I decided to get the fried chicken, and my boyfriend got a bacon cheeseburger. He loved his burger and the fries were perfectly seasoned. My chicken was to die for, it was fried but didn't taste heavy or greasy, it was seriously so good. The habanero hot sauce was also great. I would definitely come back :)", "rating": 5, "date": "2015-01-20"}, {"excerpts": ["We had the mac n cheese, burger with fries, and 3 pcs of chicken (with mashed potatoes and some greens). \n\n", "Burger also was okay, nothing special with the taste, but the burger patty was pretty big!\n\n"], "author": "V B.", "review": "We had the mac n cheese, burger with fries, and 3 pcs of chicken (with mashed potatoes and some greens). \n\nThe mac and cheese was okay, a couple blocks from the place is a great mac and cheese place. \n\nBurger also was okay, nothing special with the taste, but the burger patty was pretty big!\n\nBut the chicken, it's juicy inside and crispy on the outside. order their chicken! the gravy was okay too, I'd prefer to eat their chicken with some gravy from Popeye's tho.\n\nThey serve dinner menu on the bar, but the bar is not really ideal for eating because, for me, the top was too high, maybe they could get higher chairs?\n\nThe place is close to Mitchell's Ice cream, so that's a good thing when you want to get some ice cream after, but I was stuffed with what we had.\n\nParking is a challenge in the area.", "rating": 3, "date": "2012-12-08"}, {"excerpts": ["I had the burger and fries.  ", "The burger was good and juicy and perfectly charred.  ", "The \"ketchup\" was kind of weird (maybe homemade??)~ a little too runny and kind of just disappeared into the bun.  ", "It tasted ", "okay though.  ", "He housemade hot sauce was yummy!  "], "author": "S. Y.", "review": "What a cute, fun place.  I loved the feel of it!!  The couple next to us had a cute baby that started to get a little fussy.  They packed up everything and ended up taking all the food to go.  That was awfully nice of them, but not entirely necessary.  The kid wasn't  really that bad.  It was kind of entertaining.  \n\nI've been on a diet for the last few weeks and this is the first meal I've had where I felt I was being naughty!!  I had the burger and fries.  The burger was good and juicy and perfectly charred.  The \"ketchup\" was kind of weird (maybe homemade??)~ a little too runny and kind of just disappeared into the bun.  It tasted okay though.  He housemade hot sauce was yummy!  I really like the habanero one!!  \n\nMy friend had the fried chicken, mashed potatoes and a side of mac and cheese all of which she let me sample!  She's a good friend.  The fried chicken was really good.  In general, neither one of us likes white meat, but it was juicy and delicious.   The $17 price tag is a bit much, but this is San Francisco.   I think we've gotten used to it!  The mac and cheese was tasty.  My friend commented that it had a slightly burned taste.  I don't know ~ I kinda liked it.  I will say, however, that the place where I work has the best mac and cheese I've EVER HAD!!!  I love our lunch lady!!!", "rating": 4, "date": "2012-02-06"}, {"excerpts": ["The onions for your burger were pickled and you can order a jar of their homemade pickles.\n ", "- The fries were seasoned good and the ketchup tasted homemade as well.\n ", "They staff was attentive and the atmoshpere was laid back until a very loud group of dudes came in ", "then I started to feel like I was in a bar - at least were were headed out.\n", "*", "*", "Parking sucked though - we ended up parking at Safeway even though you aren't supposed to (you'll get towed) but there was no parking ", "and we were hungry*", "*\n", "Yup another yummy place in the city ", "- On my next visit I'll be back to try other stuff...."], "author": "Ursula U.", "review": "Total Trendy Southern Charm equipped with rocking chairs on the floor as well as a mini chair hanging from the outside porch ceiling. There is just the right amount of light in the evening and there are a few large tables to accomidate parties of 5 or 6. (Good to know for families as most places in SF are tiny)\n  -The Sweet Tea was one of the best sweet teas that I've had - like ever!!!\n - The complimentary cornbread sticks sprinkled with rock salt (soft  butter as well) were so yummy that we asked for another order...\n - The Spicy Shrimp with Grits were so hit the spot yummers with just the right amount of spiceiness....\n - The Cheeseburgers were yummy as well- The onions for your burger were pickled and you can order a jar of their homemade pickles.\n - The fries were seasoned good and the ketchup tasted homemade as well.\n They staff was attentive and the atmoshpere was laid back until a very loud group of dudes came in then I started to feel like I was in a bar - at least were were headed out.\n**Parking sucked though - we ended up parking at Safeway even though you aren't supposed to (you'll get towed) but there was no parking and we were hungry**\nYup another yummy place in the city - On my next visit I'll be back to try other stuff....", "rating": 4, "date": "2011-12-22"}, {"excerpts": ["I'll have to come back for pickles and to try the burger. ", "Oh, and to have more drinks. ", "BTW the unpretentiousness of it all is very refreshing, especially cool were the old car seats, complete with seat-belts, disguised as a booth. ", "Cheers!"], "author": "Vittorio L.", "review": "Came here with a friend before a show. Res for 5:30, finished by 7:15. Overall not a bad experience, but felt like a few kinks needed to be worked out. The service in unobtrusive, yet once the place was full, it was harder to get someone's attention.\n\nThe fried pickles were good, as was the fried chicken, yet for some reason i could not wrap my head around the grits. I've had good southern style grits before (Lois the Pie Queen? Brown Sugar Kitchen?) but these, for a lack of a better word, were gritty. Maybe they were a little undercooked  - no matter, i wont order them again. The chicken, however, was juicy and well seasoned. The shrimp? good, but small. The mashed potatoes were just 'ok', the greens were good, but not 'wow'. Overall not a bad experience, but i felt like i've had better elsewhere. \n\nI'll have to come back for pickles and to try the burger. Oh, and to have more drinks. BTW the unpretentiousness of it all is very refreshing, especially cool were the old car seats, complete with seat-belts, disguised as a booth. Cheers!", "rating": 3, "date": "2012-08-19"}, {"excerpts": ["Hoppin' John - delicious melange of black eyed peas, onions etc\n\nthe burger - which was quite good\n\nthe pork chop - this was a slight disappointment, a little too much meat without enough sauce to flavor things. "], "author": "Sam P.", "review": "I liked the Front Porch quite a bit. Some very good and innovative cocktails and an interesting menu. Nice dining experience as well, with good service.\n\nWe had Devils on Horseback - bacon wrapped fried oysters on top of savory bread pudding with a tomato based sauce. I thought the sauce was a bit underwhelming and would have liked something with a bit more spice. I added hot sauce.\n\nHoppin' John - delicious melange of black eyed peas, onions etc\n\nthe burger - which was quite good\n\nthe pork chop - this was a slight disappointment, a little too much meat without enough sauce to flavor things. The mashed sweet potatoes and greens with it were great though.\n\ndesserts were very good - bread pudding to die for and a root beer float\n\nI'd go back and skip the pork chop and try other things on the menu.", "rating": 4, "date": "2012-01-31"}, {"excerpts": ["Blue cheese and bacon burger was best I've ever had! ", "Wanted to try fried chicken but opted for arugula salad and Mac and cheese instead! ", "Very yum and friendly service. ", "Loved the decor especially the water bottles!"], "author": "Monica L.", "review": "So delicious! Blue cheese and bacon burger was best I've ever had! Wanted to try fried chicken but opted for arugula salad and Mac and cheese instead! Very yum and friendly service. Loved the decor especially the water bottles!", "rating": 4, "date": "2014-08-28"}, {"excerpts": ["My 8 year old ordered a cheese burger from the kids menu.  ", "She ate at least half of her burger and ate some of our food too.  ", "The short ribs is fork tender and very tasty, the kids loved it, my 4 year-old son devoured half of the short ribs.  ", "The shrimp and grits was ok, not spicy at all.  ", "The fried chicken is delish, both of my kids devoured the chicken down to the bones.  ", "The beignet was so good, kids ate them all.  ", "Overall there is nothing bad about this place, just a little dark.  ", "Def would come back again!"], "author": "L L.", "review": "We started with fried pickles, delish! My 8 year old ordered a cheese burger from the kids menu.  She ate at least half of her burger and ate some of our food too.  The short ribs is fork tender and very tasty, the kids loved it, my 4 year-old son devoured half of the short ribs.  The shrimp and grits was ok, not spicy at all.  The fried chicken is delish, both of my kids devoured the chicken down to the bones.  The beignet was so good, kids ate them all.  Overall there is nothing bad about this place, just a little dark.  Def would come back again!", "rating": 4, "date": "2014-08-10"}, {"excerpts": ["I've been here before and ordered the burger, which is my opinion is one of the best in SF.  ", "Of course we ordered the frickels, which are also the best in SF, and the deviled eggs (yes, please!). ", "For dessert, we ordered the cheesecake (too much chocolate for my taste), the bread pudding and the pecan pie.  ", "The break pudding and pecan pie were absolutely delicious.  ", "And this is coming from someone who typically likes neither of those."], "author": "Matthew S.", "review": "This place is so tasty and fun.  I went with 5 other people and decided to eat family style.  We ordered almost every entree not named \"meat loaf\".  And that's only because we thought it was just absurd to order any more.  We had the bucket of chicken, shrimp and grits, flounder, and ham entrees.  We ordered the mac n' cheese on the side. The chicken is really good, and the grits are amazing.  But we didn't expect the flounder to be the most flavorful out of the bunch! I've been here before and ordered the burger, which is my opinion is one of the best in SF.  Of course we ordered the frickels, which are also the best in SF, and the deviled eggs (yes, please!). For dessert, we ordered the cheesecake (too much chocolate for my taste), the bread pudding and the pecan pie.  The break pudding and pecan pie were absolutely delicious.  And this is coming from someone who typically likes neither of those.", "rating": 5, "date": "2015-07-14"}, {"excerpts": ["As my entree I went with a burger.. ", "Couldn't finish it.  ", "I was full from the wine and our appetizers.. "], "author": "Christina S.", "review": "10+ STARS! My friend brought us to her little favorite spot where apparently they have amazing fried chicken. Well, I am not one for fried chicken.. Gotta keep slim which is impossible to do when you are in a city yielding so many great restaurants.   \n\nCAUTION YOU WILL LEAVE IN A FOOD COMA AND FEEL LIKE A FAT ASS AFTER..\n\nSo, we started out with appetizers Shrimp and grits. The waitress brought out comp. brussel sprouts which were the best.. My friends here enough so she gets the preferital treatment! Brussel  sprouts made with Molasses and butter.. Try them they are amazing..  I also had for the very first time mulled wine! FELL IN LOVE.. Two glasses and I was feeling tipsy.. As my entree I went with a burger.. Couldn't finish it.  I was full from the wine and our appetizers.. I love this place.. \n\nSuper crowded so you may have a wait..", "rating": 5, "date": "2011-01-26"}, {"excerpts": ["The fried chicken was good, as was the fried okra, burger, catfish with sweet potato fries. ", "Oh! ", "And the seats in the back are made of van seats. "], "author": "Hanan H.", "review": "I don't even like brussel sprouts but these brussel sprouts are bomb! The decor is really adorable: really quirky, down-home and fun. The fried chicken was good, as was the fried okra, burger, catfish with sweet potato fries. Oh! And the seats in the back are made of van seats. Way cute.\n\nWill definitely be back.", "rating": 4, "date": "2011-03-30"}, {"excerpts": ["Great gazpacho, cornbread (comes before the meal), and apps; entree (holy shit burger) was intense (deep fried bacon, pulled pork, homemade American cheese)- definitely couldn't even finish half of it. ", "Each individual part was delicious but all together a bit overwhelming. ", "Great vibe and super nice servers."], "author": "Kristen B.", "review": "Great gazpacho, cornbread (comes before the meal), and apps; entree (holy shit burger) was intense (deep fried bacon, pulled pork, homemade American cheese)- definitely couldn't even finish half of it. Each individual part was delicious but all together a bit overwhelming. Great vibe and super nice servers.", "rating": 4, "date": "2014-08-23"}, {"excerpts": ["Stale popcorn, tasteless jambalaya, super burnt burger.  "], "author": "Anna W.", "review": "I'm disappointed on the food.  Stale popcorn, tasteless jambalaya, super burnt burger.  no buenos\n\nService was awesome though.\n\none dish that was yummy, can't quite remember the name but it was a seafood dish with rice.  Very rich and flavorful.", "rating": 3, "date": "2012-02-08"}, {"excerpts": ["Main courses were \"whatever\" - raw meat in the burger and the pork chop was dry (not to be the worst ", "but I cook better pork at home)\n", "3. "], "author": "Anaheli D.", "review": "Not impressed! AT ALL by The Front Porch other than for the bill.\nI decided to give it a try but h onestly, not too much to say... Ill keep it short:\n\nPros:\n1. Neighborhood vibe, casual and \"cool\"\n2. Next door from Bernal Heights Collective\n3. Awesome Mussles, OMG Giant ones and pretty yummi!!\n\nCons:\n1. Very expensive for the overall dining experience you get\n2. Main courses were \"whatever\" - raw meat in the burger and the pork chop was dry (not to be the worst but I cook better pork at home)\n3. They took forever to serve the food... FOREVER! \n\nThat said, I can only think of Emmys Spaghetti Shack. Best value in Bernal :)", "rating": 3, "date": "2011-10-07"}, {"excerpts": ["She had a burger and I had friend green tomatoes and gumbo as a main dish. ", "Gumbo was really good, nice and flavorful but on too spicy (how I like it). ", "I'm telling you we left this place feeling stuffed and happy! ", "Wanna come back to try their brunch soon."], "author": "Alexis W.", "review": "Came here for dinner last week with a friend and we loved everything we had, and we has a a lot of food! We started with the mixed green salad and fried pickles which we amazing, probably the best I've ever had. She had a burger and I had friend green tomatoes and gumbo as a main dish. Gumbo was really good, nice and flavorful but on too spicy (how I like it). I'm telling you we left this place feeling stuffed and happy! Wanna come back to try their brunch soon.", "rating": 5, "date": "2014-07-23"}, {"excerpts": ["Burger was solid, fried chicken - juicy and not overly greasy and HALLELUJAH....."], "author": "S K.", "review": "Definitely make a reservation for a weekend visit.\nDefinitely get the spicy shrimp and grits, either as an app or a main dish - holy, holy!  So good! Can't leave without trying this!\nBurger was solid, fried chicken - juicy and not overly greasy and HALLELUJAH.....buttery mashed potatoes and collard greens!\n\nRestaurant was small, clean and casual and the waitstaff was friendly.\nI will definitely be back!", "rating": 4, "date": "2011-04-30"}, {"excerpts": ["My boyfriend ordered a burger medium well w/ a side of fries. ", "I ordered the warm spinach salad asked for no bacon & requested shrimp instead. \n", "When the order came, my sweetie's burger was well done, not to his medium well request and my salad had the shrimp I requested AND the bacon that I asked not be in there! ", "Needless to say we were disappointed. ", "It was late etc., etc.", ", ", "but we also wanted our meals as ordered....again the drinks saved the day! ", "My boyfriend had his Prohibition Ale ", "and I had my Sauvignon Blanc & we moved on in the world after our overpriced incorrectly served meals..."], "author": "Jasmine A.", "review": "I love the concept of this place, very \"I'm eating in my friends garage,\" feel. I've been in the day for brunch & at night for dinner so I will summarize for both & give an overall review.\nFor brunch I joined friends and had the Flounder which was ok, not spectacular, not the worst...just ok. The mimosas were the highlight that day, oh and the fries w/ the aioli sauce on the side, off of my friends plate. Those were nice & crispy w/ the right amount of salt! Service that time was great and food ok.\nNow fast forward to date night w/ my honey. Granted we arrived at night & were informed the kitchen was closing in 15 minutes, but being that it's also a bar, we figured no biggie, I think that's where WE were mistaken. \nWe were rushed to order, but we were hungry so in this case it was ok. My boyfriend ordered a burger medium well w/ a side of fries. I ordered the warm spinach salad asked for no bacon & requested shrimp instead. \nWhen the order came, my sweetie's burger was well done, not to his medium well request and my salad had the shrimp I requested AND the bacon that I asked not be in there! Needless to say we were disappointed. It was late etc., etc., but we also wanted our meals as ordered....again the drinks saved the day! My boyfriend had his Prohibition Ale and I had my Sauvignon Blanc & we moved on in the world after our overpriced incorrectly served meals...", "rating": 2, "date": "2014-04-05"}, {"excerpts": ["We started with the deviled eggs, I got the shrimp and grits and my friend got the burger.\n\n", "Burger: ", "My friend's burger came with the standard accompaniments of veggies and it came with fries. ", "I stole a couple of fries from my friend and they were done well", ", they were well seasoned "], "author": "Richard C.", "review": "Came here with a good friend of mine on a (somewhat) late night and didn't have to wait to get seated.\n\nWe started with the deviled eggs, I got the shrimp and grits and my friend got the burger.\n\nDeviled Eggs: Nice and creamy and the jalapeno added a nice crunch but there wasn't any serious heat (which is good). The bacon didn't seem to add anything to the eggs but it did give it a bit of a chew so maybe that's a good thing?\n\nShrimp and Grits: The grits were very creamy, almost like a mash potato type of creamy. The shrimp were huge but I'm one of those people who really don't see the point in having the tails on shrimps and these came with them, it just made it a bit harder to eat; they were cooked perfectly though and they were big enough that I could overlook the tails =). The one issue I had with this dish was the sausage; they tasted way overcooked, they were hard and felt dry. The sausage added the heat to the dish which I could have done without but some may like it. All in all, I felt like this dish would have been perfect if it wasn't for the sausage.\n\nBurger: My friend's burger came with the standard accompaniments of veggies and it came with fries. I stole a couple of fries from my friend and they were done well, they were well seasoned so they didn't taste plain.\n\nOur waitress was attentive and the place had nice taste in music. I definitely see myself coming back at one point or another. I know a lot of people say to get the fried chicken but I really dislike having to use my hands to eat, particularly greasy things. So if you're anything like me, the shrimp and grits is a pretty good choice.", "rating": 4, "date": "2014-02-23"}, {"excerpts": ["Please stop catering to the unadventurous crowd - there's no reason to have a boring steak and a more boring burger on your menu.\n\n"], "author": "Lauren G.", "review": "Ah, Front Porch. Hipsters be dammed. You are my go-to neighborhood restaurant, when I can get a table that is. One day I will learn to make a reservation, until then I will rely on my lucky timing (showing up at 6:55 on Tuesdays helps). I probably would only like you 3 stars if you weren't so close to home though.\n\nI love the new version of your grits and shrimp (adding bacon made it better, huh, go figure), and your other dishes are often good (though not always). Please stop catering to the unadventurous crowd - there's no reason to have a boring steak and a more boring burger on your menu.\n\nYou're 60% Cajun/Creole, I'd like you better at 100%.", "rating": 4, "date": "2010-06-21"}, {"excerpts": ["Other friends have loved the burger and the fried chicken though as a vegetarian "], "author": "Maggie J.", "review": "This is my favorite \"date night\" restaurant!\n\nMy boyfriend and I have been on several occasions and we each get the same entrees: I get the vegan plate and he gets the cajun catfish. The vegan plate is different everyday and my favorite has been a carrot-puree based vegetable concoction. He just adores the catfish, which comes with delicious sides of sweet potato fries and coleslaw (even though I'm not generally a cole slaw lover!). Other friends have loved the burger and the fried chicken though as a vegetarian I can't vouch for them. \n\nI would likely give the restaurant four stars on the food alone; however, the atmosphere warrants the fifth star. The decorating is perfect - hip but not pretentious. The lighting is great for a group of friends or a date.\n\nThe drinks (only beer/wine) are standard to good. My favorite has been a local IPA that they serve on tap. \n\nPrices are on the expensive side but reasonable for the quality of the food. I like to save it for special occasions.\n\nI recommend that you make a reservation if you can - it gets busy!", "rating": 5, "date": "2011-03-29"}, {"excerpts": ["I had the holy sh!t burger, whilst my girlfriend had the mac n cheese and a ranch salad. ", "All of it was excellent. ", "Dropped a star as it could have been marginally cheaper given the area. ", "Would go again."], "author": "Tom K.", "review": "I had the holy sh!t burger, whilst my girlfriend had the mac n cheese and a ranch salad. All of it was excellent. Dropped a star as it could have been marginally cheaper given the area. Would go again.", "rating": 4, "date": "2012-08-31"}, {"excerpts": ["Food: upscale soul food - had the burger and the pickles, ", "Ty had the shrimps and grits which I normally do not like and it was DAMN addictive!!! ", "They were awesome to bring out wine samples so I could choose a killer Zin with my burger. ", "Friend had a yummer fried chicken. ", "Not the best fried chicken "], "author": "Andrea S.", "review": "This place is three stars plus four for the company and ambiance and ease. \n\nFood: upscale soul food - had the burger and the pickles, Ty had the shrimps and grits which I normally do not like and it was DAMN addictive!!! Tricked his girlfriend into ordering a second round of it.\n\nDrinks: nice wines and beers and ginger beer for those who are abstaining. They were awesome to bring out wine samples so I could choose a killer Zin with my burger. Friend had a yummer fried chicken. Not the best fried chicken I've ever had but good.\n\nAmbiance: it's simple inside, navigable, small and intimate, and AH SAY GODDAMN....they were playing Joy Division. Why don't you just make a perfection sauce and drizzle it all over my naked body?  There is a bar inside that I feel like I could easily belly up to.\n\nService: Did I already tell you about the wine samples? Everyone here is cool and nonpretentious and they strike my fave balance - attentive yet unobtrusive. \n\nFront porch is not a destination but definitely head there with one or two close friends for a damn great meal.", "rating": 4, "date": "2010-04-15"}, {"excerpts": ["One ordered the Shrimp and Grits dish and said it was really good and the other 2 ordered the Holy Shit Burger which they thought was AWESOME! \n\n"], "author": "M H.", "review": "Had been wanting to go here for a while after finding it while searching for a nice restaurant to go to for my husband and my anniversary last year. Decided to make a group thing out of it and had 2 other couples come with us in August 2012. We were highly anticipating it because the menu looked really good and we love Cajun/Creole food. I also previously worked at a Creole restaurant for a year as a cook and fell in love with the cuisine.\n\nWe arrived and the place was tiny, which is ok but we had 2 babies with us so it was a little awkward on placing the strollers and our seats without being in the way. Also one of the couples was a bit late, and so when they did show up the server seemed to be rushing us a bit to order. We ordered the Oysters Rockefeller, Hushpuppies and Fried Pickles. The Hushpuppies were good but I did not taste the supposed pork that was in it. They make their own BBQ sauce so that was cool but I didn't really care for it. The sauce that came with the pickles was awesome and who doesn't like Fried Pickles? :) I didn't have the Oysters because I don't like them, I think everyone enjoyed them but it was not something memorable. \n\nI also ordered a bowl of the Gumbo and I really did not like it, it was bland...just lacking flavor. 3 of us shared a bucket of Fried Chicken, which was fantastic, really moist and good flavor. The potatoes were good too but the collard greens were not so good, it seemed like they weren't seasoned or whatever they were seasoned with did not compliment it's flavor. One ordered the Shrimp and Grits dish and said it was really good and the other 2 ordered the Holy Shit Burger which they thought was AWESOME! \n\nMe and one other person finished with Bread pudding, that was good but again not really memorable. \n\nWhat we do remember however, is that one ordered coffee and the cream they brought with the coffee was lumpy and curdled...It is pretty normal for restaurants to pre pour cream into whatever they serve it to the table the day of service so that it is ready to go and saves time, but because this one was bad and there was a ring around the inside of the container, it told us that this cream had been sitting in the container for QUITE SOME TIME and no one was checking them to make sure if they were still good before serving to customers. That pretty much ruined the experience right there. It made me think if they don't check the cream for their coffee, what else is sitting in their fridge/walk in that goes unchecked and for how long, etc.\n\nI wouldn't come back, and I don't think I'd recommend it to anyone either.", "rating": 2, "date": "2012-09-14"}, {"excerpts": ["Burger and fries - Didn't try the burger, but the fries were crispy on the outside and perfectly seasoned\n\nPork and beans - "], "author": "Katherine P.", "review": "Ambiance? Check\n\nFood? Check\n\nEclectic Decorations? Check\n\nThis place has so much personality in its presentation, its food, staff, everything. I love the bar, the silver ceiling, the overstuffed booths, the rocking chairs outside, everything. The southern comfort food is the best part - served piping hot and inexpensive!\n\nFour girls consumed:\n\nBucket of fried chicken with garlic mashed potatoes and collared greens - the chicken was so moist, the mashed potatoes were creamy and delicious, and the collared greens a welcome healthy contrast to all the other creaminess.\n\nPlate of pickles - super tangy, not for the faint of heart!\n\nBurger and fries - Didn't try the burger, but the fries were crispy on the outside and perfectly seasoned\n\nPork and beans - Perfectly junky with giant beans and thick pieces of fatty pork belly\n\nSpicy grits - I didn't try this, but my meal companions loved it\n\nFried okra - So good! Lightly deep fried, not oily, and firm okra inside\n\nSuch a great place, can't wait to come back", "rating": 5, "date": "2009-12-03"}, {"excerpts": ["The fried chicken is the best ever, the Holy Sh@t burger is a God sent miracle to burger lovers......and the bacon covered dates were better than any other appetizer in this world!  ", "The staff from the minute we walked in the door, was a friendly, helpful group.  ", "The chef even came out and met with us!!  ", "What a wonderful place to go when we come in town!!  ", "Love it, Love it, Love it!!"], "author": "Jennifer K.", "review": "Amazing food and staff!  The fried chicken is the best ever, the Holy Sh@t burger is a God sent miracle to burger lovers......and the bacon covered dates were better than any other appetizer in this world!  The staff from the minute we walked in the door, was a friendly, helpful group.  The chef even came out and met with us!!  What a wonderful place to go when we come in town!!  Love it, Love it, Love it!!", "rating": 5, "date": "2013-04-20"}, {"excerpts": ["I took a bite of burger as well. ", "It came with a dipping sauce which also was necessary since the burger was also a little salty.  "], "author": "Donna H.", "review": "They took the crab n grits off the menu.. Sorry that's a star right there.. please see previous review regarding the crab n grits\n\nYour other stars will remain since the food was still delicious.. I had the gumbo, and mashed potatoes -- apparently these go reallly well together. Otherwise, the gumbo was a tad salty. I took a bite of burger as well. It came with a dipping sauce which also was necessary since the burger was also a little salty.  I'm slightly distraught over the crab n grits still.. \n\nbut.. I was hiding under your porch because i love you.. :(", "rating": 4, "date": "2009-06-03"}, {"excerpts": ["The burger was not as stellar, and why-oh-why are the crab grits gone??  ", "Shrimp grits? ", "Not the same. "], "author": "J Liberty S.", "review": "I still love you Front Porch, but I must admit that the new chef is not killing it the way your old one did.  \n\nThe burger was not as stellar, and why-oh-why are the crab grits gone??  Shrimp grits? Not the same. Bring back the crab grits!\n\nFear not, I'll be back. I'm a big fan of second and third chances. Especially when the food is so good that I want to go back for senconds and thirds!", "rating": 4, "date": "2009-10-12"}, {"excerpts": ["For mains we ordered their burger, short ribs, blacked fish, and, of course, their fried chicken, which is why we came there. ", "Everyone enjoyed their dishes, and the fried chicken was very good. ", "Worth the trip. \n", "We shared the pecan pie and the beignets. ", "Both very good. ", "Only thing bad I can say, was the restaurant was a little dark so hard to read the menu, but we managed. ", "Btw the service was excellent. ", "I recommend."], "author": "andy w.", "review": "Five of us went to dinner last night to celebrate a birthday. One of the concerns is parking although a found a spot on the street about 1/4 mile away. The restaurant is small and they had a good crowd for a Sunday night. We had reservations and they seated us immediately. For a small restaurant their drink list was impressive. Good whiskey list and they had some nice tequilas as well. We ordered the gumbo, fried pickles, and salad for appetizer. These were good. We wished the gumbo was spicier, but they gave us hot sauce to heat it up (their own brand). \nFor mains we ordered their burger, short ribs, blacked fish, and, of course, their fried chicken, which is why we came there. Everyone enjoyed their dishes, and the fried chicken was very good. Worth the trip. \nWe shared the pecan pie and the beignets. Both very good. Only thing bad I can say, was the restaurant was a little dark so hard to read the menu, but we managed. Btw the service was excellent. I recommend.", "rating": 4, "date": "2015-01-05"}, {"excerpts": ["The burger is so on point too!! ", "I'm surprised there aren't more reviews on the burger - seasoned perfectly and cooked perfectly. ", "I'm not usually a fries person, but the fries that came with the burger are maybe the best I've ever had. ", "Shrimp and grits were delicious! ", "I've never had grits but OMG - the buttery cheesy goodness and texture was amazing. ", "The shrimp were also delicious. ", "Although, the dish was so rich I probably would never be able to eat a whole order by myself. ", "The biscuits are SO GOOD. ", "And the Rosemary butter they come with is crazy delicious too. ", "I literally would only give my bf one bite of them ", "bc ", "they were so good! ", "The fried chicken was good ", "but I'm not really a fried chicken person ", "so I'd probably stick with the burger next time. ", "My bf loved the greens they came with and he ate all of the mashed potatoes. ", "The Mac and cheese was also good, but very cheesy and not too many noodles. ", "Not the best I've ever had but still good. ", "We ordered deep fried bacon on it too, but I ended up peeling off the fried portion to put some normal bacon on my Mac and cheese - deep fried was just too much.,Was seated fast and the staff was so nice! ", "I did get pretty hot in the back of the restaurant ", "but that may just be a side effect of ordering the entire menu ", ";-)"], "author": "Jenna L.", "review": "Crawfish hush puppies are so delicious. Crispy and flavorful and the sauce they come with is amazing. The burger is so on point too!! I'm surprised there aren't more reviews on the burger - seasoned perfectly and cooked perfectly. I'm not usually a fries person, but the fries that came with the burger are maybe the best I've ever had. Shrimp and grits were delicious! I've never had grits but OMG - the buttery cheesy goodness and texture was amazing. The shrimp were also delicious. Although, the dish was so rich I probably would never be able to eat a whole order by myself. The biscuits are SO GOOD. And the Rosemary butter they come with is crazy delicious too. I literally would only give my bf one bite of them bc they were so good! The fried chicken was good but I'm not really a fried chicken person so I'd probably stick with the burger next time. My bf loved the greens they came with and he ate all of the mashed potatoes. The Mac and cheese was also good, but very cheesy and not too many noodles. Not the best I've ever had but still good. We ordered deep fried bacon on it too, but I ended up peeling off the fried portion to put some normal bacon on my Mac and cheese - deep fried was just too much.,Was seated fast and the staff was so nice! I did get pretty hot in the back of the restaurant but that may just be a side effect of ordering the entire menu ;-)", "rating": 5, "date": "2014-10-24"}, {"excerpts": ["I've tried both the fried chicken and the burger - both were above average but didn't blow me away.  "], "author": "Chad H.", "review": "Pretty tasty restaurant, but very small, cramped, and loud.  You usually have to wait for a little bit, but you can make your wait a bit shorter by agreeing to eat at the bar.  I've been here twice, and this is what I did both times.\n\nOverall, I found the food to be tasty.  I've tried both the fried chicken and the burger - both were above average but didn't blow me away.  The prices are a little high but fairly reasonable, because you get pretty large portions.\n\nA nice little out-of-the-way place that delivers a pleasant surprise.  Recommended.", "rating": 4, "date": "2009-12-05"}, {"excerpts": ["Local ground beef burger, bacon, cheddar, house made pickles, porch fries. ", "$16.75 \n", "Your average burger. "], "author": "Diana D.", "review": "1.17.10, 8:00pm\n\nNeeded a reservation. Parking is horrible, but that is nothing new in SF.\nLove, love, love the atmosphere! Very fun; hodgepodge of garbage all over the walls! Dark with highlights of red bulbs and that sort, very vintage look even though this place has only been there for 3 years. It's so in and new to look so old. My favorite part of the atmosphere? All the facial hair in that place! Man, the side burns and handlebar mustachios on the guys that were in that restaurant were off the chart! \n\n+ Cornbread (complimentary)\nIt's in the shape of corn on the cob!!! Warm, soft, AND it had coarse kosher salt on top. Yum. It's really worth asking/begging them to bring another plate over.\n\n- Sauteed shrimp, bacon, mushrooms and garlic over grits, $11 for app, $18 for entree\nNo no no no no! The shrimp was cooked well, and the grits was creamy and well done but all of it was ruined under a 1/4\" layer of red grease. I thought, maybe I'm not fancy or southern enough to appreciate this dish but I had everyone else at the table try it and everyone was awkwardly silent afterward (as in, no oohs and ahhs) until Marc was basically like \"dude, that's gross and greasy\". When I asked the waitress, she looked confused and said that there's a sauce on it. Oh dear. Anyway, she graciously took it off the tab, which I am grateful for. \n\n- Fried Catfish with hush puppies, coleslaw, and sweet potato fries $16.50\nRubbery fish. Dry, stale hush puppies. Soggy sweet potato fries. :(\n\n- Fried oyster salad $?\nSomeone ordered this and it was so gross. The tangy dressing did not match the oyster and the oysters tainted everything in that dish with its hotness and oiliness, leaving anything fresh in its path in a wilted, oily, lukewarm mess.\n\n+ Fried chicken $16.75 for a couple pieces or $33.33 for 9 pcs\nThe batter was greasy, yet coarsely crunchy without any tasty spices. BUT the actual chicken meat was awesomely moist. The meat must have been rubbed (under the skin) with crushed processed/canned garlic because it had that fragrant bite of garlic yet a little duller than the fresh stuff. I liked it. In terms of uniqueness or value, I dunno...the fast food joints are tasty, yet definitely not the quality ingredients and natural meat as the Front Porch.\n\n+/- Local ground beef burger, bacon, cheddar, house made pickles, porch fries. $16.75 \nYour average burger. What I would expect, although the bun was soft, moist and fluffy and the fries, fried and seasoned to perfection.\n\n+ Fried okra with jalapeno aioli $4\nI really liked this. Got it as a starter for everyone to share. Not greasy at all, but fried with a tasty cornmealy batter and the aioli was smooth with just a little kick.", "rating": 3, "date": "2010-01-18"}, {"excerpts": ["Other entrees that have me salivating just writing this review are: the side of mac and cheese served in a cute cast iron skillet, the flounder (oh yes yes yes!), the burger. ", "You can't go wrong. ", "Go here. ", "Oh, and, order a cocktail."], "author": "Cute N.", "review": "I can't think of a reason not to give this place 5 stars. I moved to the city a year ago and this is one of the few restaurants that are in my rotation (it's generally my rule to try new places unless a spot is outstanding... and the Front Porch is indeed outstanding!). The folks who work there are hip, pleasant and down to earth. We've been squeezed in at the bar without a reservation and treated well without pretenses. The service gets 5 stars... the food gets 6. The fried chicken and collards are amazing, the bacon wrapped dates and fried pickles have me wanting to make them at home. Other entrees that have me salivating just writing this review are: the side of mac and cheese served in a cute cast iron skillet, the flounder (oh yes yes yes!), the burger. You can't go wrong. Go here. Oh, and, order a cocktail.", "rating": 5, "date": "2013-09-04"}, {"excerpts": ["Their burger is amazing AND they deliver. ", "Highly recommend you giving it a shot."], "author": "Emma C.", "review": "Their burger is amazing AND they deliver. Highly recommend you giving it a shot.", "rating": 4, "date": "2011-08-29"}, {"excerpts": ["Last night I had the burger with fries.  "], "author": "Carol S.", "review": "Pretty darn good!!  I've gone twice and would definitely go back.  Why I love this place:\n\n1) You put your rezi in, and if you decide to go to Club 3300 up the street to get a beer while waiting, the guy will either call the bar OR walk up himself to say your table is ready.  How awesome is that?\n\n2) Food is pretty good.  Last night I had the burger with fries.  Other people in our group had chicken fried steak (maybe the best I've ever had?) and someone else had fried chicken.  \n\n3) Prices are okay.  I love that they offer $1.50 beer (I think it's Michelob).  Hey, a buck fifty is a buck fifty - good deal.\n\n4) The cornbread they give you is a nice touch.  I wish it was warmed up though.", "rating": 4, "date": "2009-09-12"}, {"excerpts": ["Maybe I'd sit at the bar and split an order with a buddy - or try their Porch Burger -over a bottle or two of St. Peter's Ale or something...\n\n"], "author": "Nish N.", "review": "So I really wanted to like The Front Porch, and probably will go back for another shot, but on first attempt it just wasn't all that.\n\nWhile waiting for our table at the bar (30-45 minute wait at 6:30 on a Friday night!), we had a few drinks and took in the atmosphere. There is a down home and local sort of feel, and what I liked was the surprising dearth of hipsters. Just a lot of people from the neighborhood, ourselves excluded. Our bartender was cool if a little lackadaisical, but that seemed to go fine with the laid back vibe.\n\nWhen our table was ready, we were seated in a somewhat tight booth, but still pretty comfortable.Our waiter arrived, seemingly breathless, just to tell us that five other tables were also sitting down now and that it would be a bit before he got back to us. Um, what?\n\nSo this became the theme of the night: \n\"You want water, no problem.\" It arrives fifteen minutes later.\n\"It's so busy, but I'll be right back. I have five tables to serve!\"\n\"Don't try this dish, not that good, and we might be out of it.\"\n\nItems arrived sporadically, and in the case of our potatoes, not at all. The corn bread was pretty good, but not salted enough. The Bucket of Fried Chicken was my favorite thing on the menu, but just not enough of a reason to frequent the place (A bucket comes with 2 sides, although for $29, this ain't no Popeyes!). Maybe I'd sit at the bar and split an order with a buddy - or try their Porch Burger -over a bottle or two of St. Peter's Ale or something...\n\nSo while the food could be improved here and there, and I'm sure they'll get into their stride (the grilled steak with roasted fresno chilies seems worth a return trip), it was our service that really brought down our experience. I hate to say it but our waiter needs to be kicked off the porch.", "rating": 3, "date": "2006-11-09"}, {"excerpts": ["Therefore, if there's anything more than, like, a grilled cheese, some sort of crappy pasta or a veggie burger on a menu, then I get really overwhelmed and flustered.  ", "Hang ups, shmang ups, shut the fuck up."], "author": "Chloe S.", "review": "I got pretty drunk here on a combination of tall bottles of Red Stripe, tall cans of Budweiser, and numerous pints of beautiful Stella.  I also ate a lot food, including brussel sprouts, fries served  three different ways, and the vegan special of the night, which was, if I remember correctly, a bunch of coconut milk and fried things and other stuff.  It was better than it sounds -- not the best, mind you --  but better than how I care to describe it.  \n\nJust having a vegan special is pretty sweet, although I always prefer more options.**  Call me selfish, but so what? A man's gotta eat! \n\nEveryone had a great time, and I think the beer +  the company was the best part.  The host and other employees were absolute sweethearts, making the experience way more fun. Plus, the actual establishment is pretty dang cute.  Awww.\n\n**Actually, I sort of don't like too many options because of my Midwestern, vegetarian roots. Therefore, if there's anything more than, like, a grilled cheese, some sort of crappy pasta or a veggie burger on a menu, then I get really overwhelmed and flustered.  Hang ups, shmang ups, shut the fuck up.", "rating": 4, "date": "2007-02-08"}, {"excerpts": ["I ended up ordering the burger. ", "Yes, you have read right...", "I ordered a burger...at a soul food restaurant. ", "I was craving a nice juicy piece of ground up cow that day...", "okay? ", "The burger was delicious--quite possibly amongst one of the best I've tasted. "], "author": "Sue L.", "review": "I envisioned myself somewhere in the South lounging on the front porch swinging on a wooden porch swing with the hot sun beating down on my tanned skin--with a piece of delicious fried chicken in one hand and with the other hand waving to the neighborhood kiddies playing on the street. However, my reality was just a tad different. My front porch consisted of a few tables and chairs. I had the San Francisco fog seeping into my \"not so tanned anymore\" skin. I had a delicious piece of fried chicken on one hand and my other hand was waving to cars speeding down 29th Ave (between San Jose and Tiffany). \n\nThis Front Porch may not be the front porch complete with the wooden swing and rocking chair you envision, but I bet you the fried chicken they serve here would be exactly what they serve in the south. I came here on a Tuesday and the place was packed - I repeat...PACKED...on a TUESDAY! The fried chicken is awesome - perfectly crisp on the outside, moist and juicy on the inside. My friends and I ordered a bucket of fried chicken which came in a popcorn container complete with the popcorn. I ended up ordering the burger. Yes, you have read right...I ordered a burger...at a soul food restaurant. I was craving a nice juicy piece of ground up cow that day...okay? The burger was delicious--quite possibly amongst one of the best I've tasted. The meat was thick and juicy and the bun was nicely toasted. \n\nI came out of the Front Porch feeling rather much like a front porch myself. The food was so good I ate a tad too much that night.", "rating": 4, "date": "2008-10-13"}, {"excerpts": ["They've also got the fried chicken, bacon cheddar burger, vegan green curry,  fish n chips, tartare with plantain chips, collards and black-eyed peas, ", "etc.. \r\n\r\n", "Cool drinks, with a focus on wines that come in boxes, jugs, or other usually scary formats.  ", "(I did have a headache this morning.)\r\n\r\n", "UNcool flavor all in all.  ", "Bummer.  ", "Like, sounds great on the menu, but then when you eat it, it's like hmm, interesting.  ", "It's good, but it's not wow delicious.  ", "Maybe it just needs salt. ", "(The crab grits was wow delicious tho.) \r\n\r\n", "They do really have a front porch, so that's cool."], "author": "Melanie C.", "review": "3+/4-\r\nCool funky vibe a la Emmy's.  Definite similarities between the two -- those aprons, grungey hip, dark lighting, cool music that makes you bop in your seat.\r\n\r\nCool menu with a range of interesting things. Salt cod two ways with cod fritters next to cod sashimi.  Chicken liver and Mount Gay rum pate with mango on crostinis.  Dungeness crab and corn grits soup (polenta) with scallions and chili oil.  Old school apple crisp.  They've also got the fried chicken, bacon cheddar burger, vegan green curry,  fish n chips, tartare with plantain chips, collards and black-eyed peas, etc.. \r\n\r\nCool drinks, with a focus on wines that come in boxes, jugs, or other usually scary formats.  (I did have a headache this morning.)\r\n\r\nUNcool flavor all in all.  Bummer.  Like, sounds great on the menu, but then when you eat it, it's like hmm, interesting.  It's good, but it's not wow delicious.  Maybe it just needs salt. (The crab grits was wow delicious tho.) \r\n\r\nThey do really have a front porch, so that's cool.", "rating": 3, "date": "2006-08-18"}, {"excerpts": ["I crazy love their burger; it comes with the crispiest mix of regular and sweet potato fries.  ", "The crab grits are loaded with chunks of crab; very tasty, but I must mention I am bizarrely impressed by the peas that are mixed into the grits.  ", "They are fresh and flavorful and perfectly cooked.  "], "author": "Diana Y.", "review": "I want to get a bucket of their fried chicken and only eat the skins.  I want to fill my arteries with crispy seasoned deep-fried cornmeal covered fat.  Wash it down with a big tall glass of their Persephone.  Yum.  \n\nEverything at the Front Porch is pretty decent.  The butter leaf salad is okay--the dressing s a little too reminiscent of sweet and sour sauce.  But their grilled asparagus/ sweet potato with curry aioli is spectacular.  I crazy love their burger; it comes with the crispiest mix of regular and sweet potato fries.  The crab grits are loaded with chunks of crab; very tasty, but I must mention I am bizarrely impressed by the peas that are mixed into the grits.  They are fresh and flavorful and perfectly cooked.  I picked them out and ate them one by one.  \n\nNo introduction necessary, of course, for the fried chicken.  The plate comes with some black-eyed peas and grits (neither of which was super great).  But the fried chicken.  It is Cracked Out.  Last time I ate until my stomache hurt.  Cause technically I had already eaten dinner and the Front Porch was supposed to be a \"snack\".  Or second dinner, which I'm assuming shouldn't be an even larger portion than first dinner.  Someone familiar with Hobbit culture should let me know.", "rating": 4, "date": "2007-04-28"}, {"excerpts": ["The burger was one of legends, the mac and cheese was like nothing i'd seen before, even their ketchup was god-like.\n", "Just go."], "author": "Kiya B.", "review": "I waited a long time to try this place only because i'd heard horror stories of the wait time to get seated..\nWell, i toughed it out last week and i can firmly say that i'd wait another hour any night to eat here again.\nThe burger was one of legends, the mac and cheese was like nothing i'd seen before, even their ketchup was god-like.\nJust go.", "rating": 5, "date": "2008-02-09"}, {"excerpts": ["Then each ordered according to his or her level of adventerousness - liver, burger, gumbo, catfish and chicken (which was the winner).\n\n"], "author": "Dan M.", "review": "I have to give proper compliments to the staff at The Front Porch. We've been here a few times since it opened (we live in Glen Park and it's a short walk to get there). The food is always good, especially if you're familiar with delta-style cooking. If you're up the stairs in the back, you get to see the preparation goin' on in the highly efficient kitchen.\n\nI took my family for dinner a couple of nights ago. Like most Saturdays, the place was very crowded and noisy (that's something else to consider). Each person ordered a specialty cocktail (made with beer or wine - no spirits). Then each ordered according to his or her level of adventerousness - liver, burger, gumbo, catfish and chicken (which was the winner).\n\nTo my taste (and my daughter's) the catfish had a slightly off taste (I've since read that it is pretty common among even fresh catfish, which most aficionado's don't mind at all). I mentioned it to the waitress, just by way of information, and she took it back and offered us another dish or credit! That's amazing! It was really our mistake to order it... But anyway. Just want to make this public \"thank-you\" and give a recommendation to a restaurant with good food and great spirit (even without a license to sell spirits)", "rating": 4, "date": "2009-08-03"}, {"excerpts": ["I'll definitely come back, but I'll have the burger or something else next time, and I'll recommend that everyone have the burger or something else ", "good because I'm unselfish ", "and I want my friends to enjoy their meal as much as I do when I find something special. ", "Just sayin'."], "author": "matthew r.", "review": "You guys have been holding out on me.\n\nIt seems like no one ever mentions The Front Porch without going on about the fried chicken and how wonderful it is. So when I found out that we were eating out there my mind was made up; I barely even looked at the menu. \n\nAnd looking back, I can't say I was completely disappointed; The chicken was moist and tender, even the breast meat. The dry crumbly batter on it was unique and kind of tasty, and I enjoyed the creamed collards and grits (no mashed potatoes that night.) I have to give them some credit for putting their own spin on a traditional dish, but my expectations were set really high and it didn't quite meet the mark. I think I prefer the orthodox fried chicken that I get at places like powells. \n\nAK, a front porch veteran, knew better. She ordered what turned out to be one of the best burgers I've ever been able to eat off of someone else's plate; Uruguayan beef, bacon and cheddar with perfectly done fries and some tangy, slightly spicy homemade ketchup. If you ran a restaurant would it even occur to you to make your own ketchup? Small details can go a long way. \n\nWhich is what is bothering me. Has all the talk about the fried chicken there been some kind of misdirection? Have you all been steering the suckers towards the chicken so they don't run out of hamburger or ingredients for some other fantastic dish that's only for those in the know? I wouldn't do something like that to any of you.\n\nOh, and the cornbread starter with the spicy butter was as good as any cornbread I've ever had. \n\nI usually start off reviews with the decor and service, but I'm all out of sorts now and my review is backwards. See what you've done? I hope you're happy.\n\nThere are tile floors like you'd find in your grandparents' basement and tin stamped ceilings like you'd find in a victorian mansion. There is no carpet, no tapestries, no fabric anywhere in the dining room. So the Front Porch is NOISY. I can't recommend the place for a first date unless conversation makes you uncomfortable. The tables are basic wood squares on legs, and some of the seats in the back have been salvaged from a passenger van, complete with seatbelts and fold down armrests.  \n\nThe hipster wait staff was friendly, but a little slow. AK said the service was worse than usual so I imagine it's generally very good. \n\nI'll definitely come back, but I'll have the burger or something else next time, and I'll recommend that everyone have the burger or something else good because I'm unselfish and I want my friends to enjoy their meal as much as I do when I find something special. Just sayin'.", "rating": 4, "date": "2007-09-18"}, {"excerpts": ["During the couple of times we have eaten there, I have tried the burger, ceviche, brussel sprouts, fried okra, chicken livers, fries, and bites of my girlfriend's fried chicken when she was not looking. ", "I am a dedicated patron and will eventually try everything on the menu, but favorites some times just get in the way! ", "Yes I am selfish; I want variety, but with that said, when I am in the mood for a burger, chicken, fried anything, or a glass of Sancerre, I walk across the street and get myself some. ", "Worth the wait for sure!"], "author": "Deborah S.", "review": "Before we even moved into our new condo, friends told us we were so lucky to have Front Porch in our Hood; then when we finally moved in, I looked out the front Bay window and just to the right of the Bernal Heights Pot Club was a neon sign: Front Porch. I thought, \"How frickin' wonderful is that?! We need to check it out.\" So we did--on a couple of occassions. \n\nFirst of all, the best thing about the place for me is the Bartenders: cute and friendly; they also pour a generous glass of wine--try the Sancerre it is the best on the menu. \n\nDuring the couple of times we have eaten there, I have tried the burger, ceviche, brussel sprouts, fried okra, chicken livers, fries, and bites of my girlfriend's fried chicken when she was not looking. I am a dedicated patron and will eventually try everything on the menu, but favorites some times just get in the way! So far the dishes have been delicious, but I must say the fried okra did visit me later, but sure was good while I was chowing down on it. \n\nMy only gripe is not the wait--go have a beer at the 3300 Club; nor the noise--turn up your hearing aid; it is that the menu does not change that much so I cannot go there as often as I like. Yes I am selfish; I want variety, but with that said, when I am in the mood for a burger, chicken, fried anything, or a glass of Sancerre, I walk across the street and get myself some. Worth the wait for sure!", "rating": 4, "date": "2007-04-10"}, {"excerpts": ["and I got a burger. ", "Turns out the burger was very flavorful and cooked perfectly -- crispy on the outside and very juicy inside. \n\n"], "author": "Scott K.", "review": "We were so excited that a new restaurant was going to be opening up down the street from us. And we couldn't be happier with how The Front Porch turned out. We went on opening night and while the wait was long, we can tell that it's going to be a great place and we'll probably go back regularly.\n\nThe cornbread with spicy butter was a unique and appropriate combination. My wife had the steak, which was a little spicy for her but I thought it was great. Her steak came with a really good potato salad and grilled corn on the cob. I had built up a hankerin' for the fried chicken after seeing it posted on their menu a few days earlier, but sadly they were out of it and I got a burger. Turns out the burger was very flavorful and cooked perfectly -- crispy on the outside and very juicy inside. \n\nWe were as impressed by the service as we were by the food. It was opening night and things were pretty crazy, but both of the owners found time to stop and chat with us. The staff was very apologetic about the long wait (which was totally understandable -- opening night!) and made sure that we were happy.\n\nWe'll definitely go back to The Front Porch. Not just because it's about 20 steps from our house, but because we now feel like we don't need to go very far at all to get excellent food and service.", "rating": 5, "date": "2006-08-15"}, {"excerpts": ["The grits are so creamy and comforting, the burger is tasty, as are the brussels sprouts and  the bistro salad. ", "Vegan entrees can be delicious, but they can also seem like someone cleaned out the veggie bin in the fridge. ", "Mostly, though, find an excuse to use the house-made ketchup and hot sauce. "], "author": "pizzazz g.", "review": "Is it bad if I have a crush on Kevin? He's so welcoming every time we come in, it's like Cheers. I'm reluctant to give 5 stars because I don't want to see any more hipsters in there, I already see waaay too many. But I happen to love The Front Porch, and not just for Kevin. \n\nTo be honest, the food can be hit or miss. I have had dishes that lacked sparkle. Still, there is something about the atmosphere (dark, eclectic, rockin') that kind of makes me not care about that. They have a nice little menu that usually has something new to try, along with some more permanent items that are definitely worth revisiting. The pickled veggies are a good pre-starter. Watch out though, sometimes they are super-vinegarized, you might pickle your face-hole. The grits are so creamy and comforting, the burger is tasty, as are the brussels sprouts and  the bistro salad. Vegan entrees can be delicious, but they can also seem like someone cleaned out the veggie bin in the fridge. Mostly, though, find an excuse to use the house-made ketchup and hot sauce. The boy says he would eat through a mountain of babies just to get his share of those tasty condiments. \n\nMy only real beef with TFP is that I have had some BAD service there. If you are a person who gets really bunched up about your table service, maybe go somewhere else. There is one girl in particular who just should not be waiting tables, and it seems like she is always there.\n\nOverall, the food is good, the prices are excellent, and the atmosphere is exactly what I look for in a neighborhood joint. And the little peccadilloes are kind of irrelevant in the end because i always leave with the warm fuzzies.", "rating": 5, "date": "2007-02-13"}, {"excerpts": ["Fried Chicken, Spicey Crab and Grits, and Burger and Fries. ", "The food was good, however, Gary did get an upset stomach afterwards. ", "I had one later in the evening. "], "author": "Benjamin B.", "review": "Decided this was a good place to try out with our friend, Andy, while he visited from L.A. \n\nWell, as the name goes, it is literally walking in from someones front porch. \n\nOverall, the staff was extremely friendly and helpful with the menu items. They even were well-versed in wine. \n\nFried Chicken, Spicey Crab and Grits, and Burger and Fries. The food was good, however, Gary did get an upset stomach afterwards. I had one later in the evening. Not sure if these were related, but ya know... \n\nHowever, we did enjoy the ambiance, and it is loud and crowded on the inside, but was a good place to bring Andy to dine before hanging out during the rest of the evening. He enjoyed it very much and would like to go again when he is up in S.F.", "rating": 3, "date": "2009-01-19"}, {"excerpts": ["And the burger was phenomenal. ", "And the steak...mmmh.\n", "Ok, and now to the fried chicken: I could not resist. ", "It was marvelous. ", "I try not to have too many fried items but this was made to perfection. \n", "The lighting is a little dark but that makes it even more cosy."], "author": "Alexandra D.", "review": "We came recently with a group of friends. And we ordered everything on the main course menu (except the vegan plate). \nI am more the healthy type but there were enough options on the menu. The daily fish special was amazing! And the burger was phenomenal. And the steak...mmmh.\nOk, and now to the fried chicken: I could not resist. It was marvelous. I try not to have too many fried items but this was made to perfection. \nThe lighting is a little dark but that makes it even more cosy.", "rating": 5, "date": "2009-07-10"}, {"excerpts": ["The burger was good though but for the money, it wasn't anything special. ", "I would've rather gone to big mouth burger and save a little money or drink another beer.\n\n"], "author": "Andy L.", "review": "Folks who say this place is southern cooking haven't been to the south. The corn bread was dry though cleverly shaped like a corn cob. The fried chicken was coated with corn meal instead of a proper batter and was flavorless and dry. The best part about good fried chicken is the crispy skin and a salty/spicy batter which this joint chooses to bypass. \n\nThe burger was good though but for the money, it wasn't anything special. I would've rather gone to big mouth burger and save a little money or drink another beer.\n\nHowever, I thought the service and presentation were good.", "rating": 2, "date": "2008-10-14"}, {"excerpts": ["My friend was pleased with his burger. "], "author": "Topazskye L.", "review": "I am still a fan! We came back in a group of 4 the other day and had a dizzying array of choices. Our table was packed to the max. Our appetites were raving but just not enough table space. Of cos we had to havea  bucket of fried chicken and that is still sooo blardy awesome tasty. Wooweeee...the juice of the chicken drips out as you uncover the crispy skin. Absolutely loved the spicy shrimp with grits. it was sooo tasty. I think I prefer this to the crab with grits cos the shrimp is much sweeter. The flanksteak was done really well too and it was tender and yummy with all their sides. My friend was pleased with his burger. We were in love with the sides - fried okra, the maduros, and brussel sprouts...mmmmm....\n\nIt is really comfort food at its best. Be sure to make a reservation!", "rating": 4, "date": "2009-06-16"}, {"excerpts": ["Friggin GREAT Kobe burger and crispy fries... ", "Same with the fish fritters (yum)... "], "author": "beth l.", "review": "Finally tried this place last night, and was delighted!! \nCool, kinda seedy, dark atmosphere... You can sip your drink and rock in rocking chairs on the front porch while you wait (if you don't have a rez)... It was loud in a fun way (not too loud)... Very old (cool) bar and ceiling... Made-on-the-premises tasty ketchup... Friggin GREAT Kobe burger and crispy fries... Same with the fish fritters (yum)... REALLY friendly server and great service...  \n\nThe only down side (but far from problematic) was that the \"bitter\" side salad I ordered was kinda blechy... as in, bleh! Why'd I order this?!\n\nBut I can't wait to go back here - such a casual, fun, divey but yummy food/drink/socialize with your friends kinda place! I hear it's great for just grabbing a drink or two at the bar, too...", "rating": 5, "date": "2008-02-19"}, {"excerpts": ["I got a burger that was maybe the best thing in the world, with shoestring fries. ", "so fucking tasty. \n", "What's really great about this place is how homey it feels, very welcoming and very friendly."], "author": "Eve O.", "review": "This place was pretty great. Of course, it was already an amazing night. Obama just won the nomination and the Mission was spinning. People were leaning out of cars and windows shouting, strangers crying and hugging, incredible. \nAnyway, we left our election party at like 10:30 to go to dinner and The Front Porch was still open late. We were the only diners in the restaurant but the whole staff was brimming over with excitement after the election. The four of us got into a cozy table and ordered...our friends got fried chicken, my boyfriend got the crab and grits. I got a burger that was maybe the best thing in the world, with shoestring fries. so fucking tasty. \nWhat's really great about this place is how homey it feels, very welcoming and very friendly.", "rating": 4, "date": "2008-11-06"}, {"excerpts": ["inside was juicy, moist and tender) with mashed potatoes and collared greens (both great), while my friend got the burger. ", "apparently it was cooked too rare for his taste, but the parts he did eat, he said were tasty too. ", "sangria was absolutely delicious. ", "not usually a fan of colorful drinks, but this was refreshing, not too sweet."], "author": "Joyce C.", "review": "Came here on a Wednesday night around 730, waited 30 min for a table for two. comfy patio outside as well as a bar inside to wait with drinks for a table to open up. great service, nice and informative waiters. hostess came to check on us a few times to make sure we were all right.\n\ncomplimentary chilled pea soup with jalapeno cream (?) wasn't bad, but the bbq shrimp was delicious! even the bread that soaked up all the sauce was tasty. i got fried chicken (outside was a little too salty but inside was juicy, moist and tender) with mashed potatoes and collared greens (both great), while my friend got the burger. apparently it was cooked too rare for his taste, but the parts he did eat, he said were tasty too. sangria was absolutely delicious. not usually a fan of colorful drinks, but this was refreshing, not too sweet.", "rating": 4, "date": "2009-03-19"}, {"excerpts": ["My guy had the bacon burger, one of the best he's had (and belive me, he's had a lot!)\n", "My daughter had macaroni and cheese, which was great, and which our server was kind enough to bring out early w/o even being asked!"], "author": "J W.", "review": "The first two times we came here, I was all thumbs down.  My impression was: loud, inattentive service that came with lots of Attitude when it came at all, mediocre food, small portions.\n\nMy guy finally convinced me to give it another try.  We went last night at around 5:30pm.  Fantastic!  like a different restaurant - no waiting, all the waitstaff were both super-nice and very attentive, the food was plentiful and delicious!  what happened?  I don't know, but i'm going back.\n\nThey started us off with delicious cornbread sticks and tasty paprika butter, followed by small glasses of chilled pea soup w/ habanero cream - so yummy!  and the waitress very thoughtfully brought a glass w/o the habanero for my daughter.\nI then had the halibut over a chive crepe wrapped around root veggies in watercress cream.  Amazing - the halibut was cooked perfectly, brown and crispy on top and moist and flaky inside.  My guy had the bacon burger, one of the best he's had (and belive me, he's had a lot!)\nMy daughter had macaroni and cheese, which was great, and which our server was kind enough to bring out early w/o even being asked!", "rating": 4, "date": "2009-03-20"}, {"excerpts": ["I love their burger, but there's always one thing wrong with whatever else we get (gumbo burnt, breading doesn't stick to the chicken, something overcooked, etc.). ", "A shame, since it's right around the corner.  ", "Service is often spotty as well. ", "An example: called for take-out this evening. ", "Whoever answered the phone asked me to hold for a second. ", "5 minutes went by. ", "I hung up and called back. ", "Busy signal, which I assume means they just left the phone off the hook. ", "Pizza it is, then!"], "author": "Sam B.", "review": "I love their burger, but there's always one thing wrong with whatever else we get (gumbo burnt, breading doesn't stick to the chicken, something overcooked, etc.). A shame, since it's right around the corner.  Service is often spotty as well. An example: called for take-out this evening. Whoever answered the phone asked me to hold for a second. 5 minutes went by. I hung up and called back. Busy signal, which I assume means they just left the phone off the hook. Pizza it is, then!", "rating": 2, "date": "2013-06-14"}, {"excerpts": ["The Burger came in second..."], "author": "Amanda D.", "review": "I love front porch. I just finished eating my leftovers for lunch and was moved to write a review. I think Front Porch beats out all other southern style places in the city that I've been so far. I thought it was way better than Blue Jay, and also better than Farmer Brown. \n\nIt has a homey atmosphere, and the food is rich and comforting. I also felt like they used fresh, quality ingredients. \n\nFor Apps:\n\nThe Plantain cakes were fabulous. The mango salad was also good. Two of my friends tried the pickled plate--some things were good, others not. \n\nEntrees:\n\nThe Crab porridge was the best...it was amazing. It enough for two and goes really well with a side of collard greens which, by the way, were cooked just right, rather than to death like most places.\n\nThe Burger came in second...one of the best burgers in town\n\nThe fired chicken also looked really good. \n\nThey also have a vegan and a fish special every day, both of which sounded great, but no one at my table ordered them. \n\nThe don't take reservations unless you are with a party of five or more. It was very reasonably priced--I was with six people, we ordered 3 starters, 6 entrees, 1 dessert, and 3 jugs of wine--it came out to $30 each including 20% tip.", "rating": 5, "date": "2007-05-11"}, {"excerpts": ["My one friend had the burger and said it was \"fire,\" it looked awesome "], "author": "Michael B.", "review": "Went here for a buddies birthday dinner last night. I love southern food and am thankful to have tried this place so I can go back. All in all this place is a 3 on yelp but more like a 2.5 for what I used to for southern grubbin. Cool area of town too bars right up the street, its practically in the mission. We had a few different things.\n\nThe Fried Green Tomatoes were solid, and would order again. The Blue Crab fritters were too doughy for me being a maryland man. The Catfish wasn't at all what expected and prefer good ole fried catfish myself. The roux on the creole was 100% burned, our server told us that dark roux's can taste that way but I'm no moron that shit was burnt. I've been eating southern food in the south for over a decade and it was certainly burnt. The chicken was nice and moist inside with crispy skin but the meat just a little salty. Probably a salt heavy brine would be my guess. The collards were good and not pork fatty at all which was a pleasant surprise. I liked the mac and cheese others at the table didn't. Sweet potato fries and mashed potatoes were both good. My one friend had the burger and said it was \"fire,\" it looked awesome A couple others had the steak and said it was \"aight,\" meaning to me it was probably not all that good. \n\nI'd be more inclined to return for lunch instead of dinner and check those dishes out and still be able to get the things I liked. I would also still like to try the grilled fish of the day cause i think the preparation on it sounds delicious and the pork chop, I have a feeling its brined too ;)", "rating": 3, "date": "2010-09-18"}, {"excerpts": ["I was also able to sample the conch fritters, which I would order again and was so sad to get only 3/4 of one, the fried chicken, which was moist and very flavorful, the salmon and plantains, which didn't really work for me (though I love both ingredients on their own!), the pork chop, which was solid, and the grass-fed burger (way to go) which was superb.  \n\n"], "author": "Pedro, aka Burgundy M.", "review": "After two failed attempts, I finally go to eat at the FP!\n\nWent with a group of 6 last week, and I'd wished we were a smaller party only because the tables don't accommodate 6 comfortably.  5, yes, but 6, not really.  How can you have a triangular table and only use two sides for a party of 6?!  I guess its proximity to the bar did not allow for the hypotenuse to be inhabited, so we were all squeezed in to the booth areas on the sides.  Anyhow, that was about my only complaint, as every dish was really interesting and for the most part good to great.   The service was also perfectly chill and attentive at the same time.  Always a plus.\n\nHaving six folks there certainly afforded me the opportunity to try several dishes, including three of my own - the crab and mango salad, which was killer, the jerk flank steak and potato salad, again killer, and the de-constructed cherry jelly donut dessert, very cool but not quite killer.  I was told they do a mean jerk quail, and have a rotating offering in the jerk category.  This is grounds for serious excitement, as my jerk flank steak, though slightly underdone - more like bleu than medium rare - was one of the best meat/spice/texture combo's I've had in a while.\n\nI was also able to sample the conch fritters, which I would order again and was so sad to get only 3/4 of one, the fried chicken, which was moist and very flavorful, the salmon and plantains, which didn't really work for me (though I love both ingredients on their own!), the pork chop, which was solid, and the grass-fed burger (way to go) which was superb.  \n\nMost menu items come fried, or with something fried, so be prepared for this aspect.  For me that means comfort food, and along those lines I think that FP could just be the best around.  Add to it the creative Caribbean-esque twist and you've got a winner.  I'm actually itching to go back.\n\n4.5 stars, going on 5...  but I need a few more visits...", "rating": 4, "date": "2007-04-30"}, {"excerpts": ["their burger were just mediocre, and their appetizer of fried assortments (i forgot what it was called) was not appetizing at all.\n", "we wanted to try the crab and grits because of everyone's ravings, but it wasn't even on the menu anymore.\n", "overall, the food was extremely overpriced and definitely not up to par in terms of quality.\n", "the atmosphere was pretty cute and warm though, and gave off a southern feeling, but that was about the best thing in the restaurant."], "author": "Michelle L.", "review": "first off, i want to say my friends and I went here because of the awesome yelp reviews we read online.\nlet's just say, all four of us were very, VERY disappointed.\nmaybe it's just not our thing, but none of us were satisfied with the food. the fried catfish was terribly bland and watery tasting (meaning it tasted like water). their burger were just mediocre, and their appetizer of fried assortments (i forgot what it was called) was not appetizing at all.\nwe wanted to try the crab and grits because of everyone's ravings, but it wasn't even on the menu anymore.\noverall, the food was extremely overpriced and definitely not up to par in terms of quality.\nthe atmosphere was pretty cute and warm though, and gave off a southern feeling, but that was about the best thing in the restaurant.", "rating": 2, "date": "2010-06-03"}, {"excerpts": ["but he actually at it all while I was eating half a burger and some insanely tasty jerk chicken off of my friend's plate.\n\n"], "author": "Miley M.", "review": "This place is unique...cool hipster interior, tasty food that is not overpriced, good beer list, inventive cocktails - put it all together and there is not much like it...especially in the city.\n\nWe had salt-cod fritters to start - not on the menu but our friend knew a friend who knew the owner, so we were hooked up...and if I go back, I will not let the lack of listing on the menu set me back - I will demand some again with a spicy tarter that is out of this world.\n\nChicken must have been good because I was supposed to split it with my super healthy husband but he actually at it all while I was eating half a burger and some insanely tasty jerk chicken off of my friend's plate.\n\nThe food and ambience would have been 4 stars but they get an extra gold star for their service.  It would appear that they held open auditions and picked the coolest, funkiest, friendliest and actually capable servers to match the rest of their theme and we loved it!", "rating": 5, "date": "2008-10-29"}, {"excerpts": ["I know I shouldn't go to a soul food joint and have the burger, but good lord, that was the finest hamburger I have ever eaten! ", "I had sworn off all burgers after feeling completely ill after a Burger Joint meal, figuring that if Niman Ranch was the best I was going to get, I'd rather say aloha to my burger habit entirely. ", "But the Uruguayan grassfed burger was cooked perfectly, seasoned brilliantly, and served on a bun that was in itself a party for my tongue. ", "And the fries? ", "Shut my mouth. ", "Only complaint, halfway through the meal, upon the arrival of said burger from heaven, I ordered a beer. ", "I had finished my burger when the waiter finally returned to inform me they were out of that variety.\n\n"], "author": "Brooke B.", "review": "I know I shouldn't go to a soul food joint and have the burger, but good lord, that was the finest hamburger I have ever eaten! I had sworn off all burgers after feeling completely ill after a Burger Joint meal, figuring that if Niman Ranch was the best I was going to get, I'd rather say aloha to my burger habit entirely. But the Uruguayan grassfed burger was cooked perfectly, seasoned brilliantly, and served on a bun that was in itself a party for my tongue. And the fries? Shut my mouth. ReeDICulously awesome.\n\nI have to say that the woman managing seating was a breath of fresh air for us. We arrived with 5 people and no reservation and she was polite, accommodating, and efficient - not to mention totally charming and funny. The night prior I had taken a party of 4 (my parents, godmother, and self) to Beretta, and left after waiting 90 minutes after being told we'd be seated in 10. Even so, the service here wasn't just good by comparison, it was just good.\n\nOnly complaint, halfway through the meal, upon the arrival of said burger from heaven, I ordered a beer. I had finished my burger when the waiter finally returned to inform me they were out of that variety.\n\nAlso, just a note to people, if you don't like cramped spaces or loud restaurants, this might not be for you. My dad has some hearing loss and could not really participate in the conversation.\n\nOH YEAH! the grilled romaine with avocado horseradish dressing and hunks of bacon was genius - almost as good as the near-identical salad at Blue Plate down the street.", "rating": 4, "date": "2008-07-03"}, {"excerpts": ["The burger was fine, however.\n\n"], "author": "John L.", "review": "A nice spot for good ol' southern cooking in the south end of the Mission.\n\nWe enjoyed the cozy interior and the warmth and friendliness of the staff. We wish the music was a little less loud, however -- a bit much for this sort of intimate, neighborhood venue.\n\nThree of the starters/sides (mac and cheese, shrimp and grits, gumbo) were marvelous-- richly seasoned and well-prepared. The fried okra was supposed to be spiced with pepper, but we couldn't detect it, and the bland breading smothered the delicate okra flavor.\n\nTwo of us had the fried chicken. While the smaller pieces were juicy and tender, both of the big pieces were not fully cooked (still red).  Beef can be rare but not chicken.The burger was fine, however.\n\nI'd go back.", "rating": 3, "date": "2010-07-07"}, {"excerpts": ["The burger was pretty much a burger, an above average one, but still, nothing special. ", "The chicken however.... ", "AWFUL! ", "Absolutely god forsakenly AWFUL!!!! The fried skin tasted, literally, like cardboard. ", "And my standards for chicken aren't that high so to do THIS bad, especially when everyone says how good it was, wow. ", "So disappointed. ", "The meat itself was nice and moist, so my boyfriend ", "and I just pulled off the fried part, but come on", ", that's the whole point of fried chicken. ", "Now, in all fairness to Front Porch, maybe that night something was wrong with their recipe. ", "Maybe they ran out of some sort of spice. ", "I definitely did here the table in front of us commenting on how strange the chicken tasted, and I heard the table next to us a little while later talking about how it had barely any taste either. ", "So maybe I went on an off night. "], "author": "Elly S.", "review": "I reviewed so many of the ads on here before checking out Front Porch and almost everyone said that the fried chicken was to die for! So needless to say, I was super stoked to be taking my lover there for his birthday.\n\nUnfortunately the experience more left me wanting to die, than being worth it to die for. \n\nWe were ushered in right when they opened and were the third table to sit down. The two of us were seated in the back of the restaurant right in front of the kitchen. About 3 minutes later, in walks a family of 6, 3 of whom are children under the age of  8. The hostess managed to seat that family right next to us and didn't offer to move us to one of the open booths or tables in the front of the restaurant. When we asked to move, they rolled their eyes, but obliged.\n\nLooking at the wine list, there was not a great selection under $40 and so we asked the waitress to bring us a bottle of her favorite red under $40. It was delicious, however when we received the check at the end of the meal, the wine had been $55. That was seriously sneaky. \n\nAs an appetizer we ordered the crab grits, and just like everyone says, they were DELICIOUS! The only amazing part of the meal.\n\nFor entrees, I ordered the fried chicken and my love ordered the cheeseburger. The burger was pretty much a burger, an above average one, but still, nothing special. The chicken however.... AWFUL! Absolutely god forsakenly AWFUL!!!! The fried skin tasted, literally, like cardboard. And my standards for chicken aren't that high so to do THIS bad, especially when everyone says how good it was, wow. So disappointed. The meat itself was nice and moist, so my boyfriend and I just pulled off the fried part, but come on, that's the whole point of fried chicken. Now, in all fairness to Front Porch, maybe that night something was wrong with their recipe. Maybe they ran out of some sort of spice. I definitely did here the table in front of us commenting on how strange the chicken tasted, and I heard the table next to us a little while later talking about how it had barely any taste either. So maybe I went on an off night. But with the reputation this place has, having an off night is completely unacceptable. \n\nBy the time the bill had come, we had spent almost $100, half because of that expensive bottle of wine the waitress snuck in.  but the other $50 was a cheeseburger, fried chicken and an appetizer. That's crazy. I could have made at home for that for half as much. Front Porch is just really ridiculously overpriced.\n\nI can say that I will not dine in at this restaurant again. I would definitely pick up the crab and grits to go, and that's why this place gets two stars instead of one, but other than that, Front Porch is on my sh!tl!st.", "rating": 2, "date": "2009-02-10"}, {"excerpts": ["I'd also recommend the burger, it was pretty damn tasty. ", "The bun wasn't amazing, but the burger itself was yummy. ", "My recommendation for FP is to may be have a little bit brighter lighting in here though, since it was very dark in the far corner where we were seated. ", "May be next time I'll request to not be shoved in the back corner. ", "All in all, a pleasant dining experience."], "author": "Kristy H.", "review": "The fried chicken is off the chain good. Not greasy or dry. It is one juicy piece of perfection. I'd recommend ordering the bucket for two if you're dining with a friend. My only qualm would be that it comes with garlic mashed potatoes and collared greens which were a bit underwhelming. The arugula salad was very tasty and a great appetizer to start since the chicken does take 25 minutes to make. (Worth the wait). I'd also recommend the burger, it was pretty damn tasty. The bun wasn't amazing, but the burger itself was yummy. My recommendation for FP is to may be have a little bit brighter lighting in here though, since it was very dark in the far corner where we were seated. May be next time I'll request to not be shoved in the back corner. All in all, a pleasant dining experience.", "rating": 4, "date": "2009-06-01"}, {"excerpts": ["For your first trip, you MUST get the burger. ", "It is some kind of super high quality cow, that you don't find in many SF restaurants (no! not kobe...something else...", "the bossman was telling my dining companion about it while I was getting pretty in the ladies'). ", "Order it medium rare. ", "Then order some red wine. ", "That's all you- ", "just make sure it's red. ", "When your enormous burger comes (and bacon and cheese are included in the $11 pricetag), douse that sucker in the sexy sexy homemade spicy ketchup and dig in. ", "But wait! ", "There is a pile of potatoes that accompanies the burger...", "I swear they dust the potatoes with crack. ", "Even Atkins couldn't keep me from wolfing those puppies down.  ", "Douse those with ketch up too...", "more...more...", "that's right. ", "The red wine brings the whole thing full circle and you will be too full for dessert. ", "Order it anyway and start  your diet over again tomorrow.\r\n", "I actually considered stealing the jar of ketchup from our table but my friend convinced me to leave it by promising we'd go back next week.\r\n\r\n", "Other highlights: ", "The pork chop made a pork-eater out of me and the heirloom tomato salad starter was all dressed up with pickled bits of veggies and a smooth, spicy mayo.  ", "The crumbly cornbread comes with an addictive sweet-buttery-lardy spread that I opted to eat with my spoon...\r\n\r\nUPDATE! ", "Couldn't resist the urge to go back last night. ", "Seems like the reviews in the Chronicle and other publications have paid off. ", "The place is hopping. ", "We waited an hour and a half for a table for two, and never complained once. ", "The friendly waitstaff remembered us and we enjoyed that addictive sangria and spicy champagne cocktails at the bar until a table opened up. ", "You MUST try the ceviche! ", "It comes with homemade chips that I couldn't resist dipping in that naughty, naughty ketchup. ", "ALSO...made a salmon lover out of me, and I have never liked fish. ", "The luscious cornbread was served piping hot and again, I ate ALL of the butter-sugar-pepper spread that came with it. ", "The burgers are Uruguayan beef, same as the good Argentinean beef we can't get here, apparently. ", "Get yourself over there! ", "The food rocks, the crowd's cool, and the staff are refreshingly friendly and familliar."], "author": "Autumn K.", "review": "In the process of yelping about the subpar ketchup at Slider's on Ninth, I was reminded of the out of this world ketchup at The Front Porch. I want to incorporate their ketchup into any and all future lovemaking, it's so delicious. If ketchup is your thing (it is SOOOOO my thing), you will love me for tipping you off to FP. I'm going to outline the Front Porch plan for you:\r\nOn your first trip, get the sangria while you're waiting for a table or while you're getting familiar with the brief, but widely varied menu. The sangria is pink (my fave color), tanngy, and velvety. It reminded me a little of pink lemonade. Order the sweet and spicy nuts, too (they're better than the ones at Solstice!). For your first trip, you MUST get the burger. It is some kind of super high quality cow, that you don't find in many SF restaurants (no! not kobe...something else...the bossman was telling my dining companion about it while I was getting pretty in the ladies'). Order it medium rare. Then order some red wine. That's all you- just make sure it's red. When your enormous burger comes (and bacon and cheese are included in the $11 pricetag), douse that sucker in the sexy sexy homemade spicy ketchup and dig in. But wait! There is a pile of potatoes that accompanies the burger...I swear they dust the potatoes with crack. Even Atkins couldn't keep me from wolfing those puppies down.  Douse those with ketch up too...more...more...that's right. The red wine brings the whole thing full circle and you will be too full for dessert. Order it anyway and start  your diet over again tomorrow.\r\nI actually considered stealing the jar of ketchup from our table but my friend convinced me to leave it by promising we'd go back next week.\r\n\r\nOther highlights: The pork chop made a pork-eater out of me and the heirloom tomato salad starter was all dressed up with pickled bits of veggies and a smooth, spicy mayo.  The crumbly cornbread comes with an addictive sweet-buttery-lardy spread that I opted to eat with my spoon...\r\n\r\nUPDATE! Couldn't resist the urge to go back last night. Seems like the reviews in the Chronicle and other publications have paid off. The place is hopping. We waited an hour and a half for a table for two, and never complained once. The friendly waitstaff remembered us and we enjoyed that addictive sangria and spicy champagne cocktails at the bar until a table opened up. You MUST try the ceviche! It comes with homemade chips that I couldn't resist dipping in that naughty, naughty ketchup. ALSO...made a salmon lover out of me, and I have never liked fish. The luscious cornbread was served piping hot and again, I ate ALL of the butter-sugar-pepper spread that came with it. The burgers are Uruguayan beef, same as the good Argentinean beef we can't get here, apparently. Get yourself over there! The food rocks, the crowd's cool, and the staff are refreshingly friendly and familliar.", "rating": 5, "date": "2006-10-26"}, {"excerpts": ["The burger was the last real meal I chose to eat before going into the hospital to deliver my baby, and the first after she was born.  ", "We loved it there, raving about it to all of our friends. "], "author": "Andrea H.", "review": "I hope that someone from the Front Porch staff is reading YELP posts.  I sincerely regret having to write this review, but after my most recent experience there, it's a must.  \n\nWe were HUGE fans of the restaurant.  Seriously!  The burger was the last real meal I chose to eat before going into the hospital to deliver my baby, and the first after she was born.  We loved it there, raving about it to all of our friends. Unfortunately, we looked like fools having talked it up only to be let down.\n\nIt's not the fact that it took an hour and a half to seat us, but what happened afterward.  Right from the start, it was bad. The normally delicious corn bread was much too spicy.  The baked oysters and shrimp were so-so.  But the most dissappointing part was my main course.  I opted to try the rabbit, thinking, if it's anywhere as good as their burgers and chicken, I'll be in heaven.  Instead the most expensive item on the menu was so dry I nearly choked.  No kidding. I had to leave the restaurant to get some air and clear my throat.  \n\nNeedless to say, I only finished the accompanying fixins, and hoped the sides would fill me up.  Oops, the waitress forgot to put in the order, so they arrived much later than the main courses AND were TERRIBLE. The sprouts, which are usually delicious, were undercooked, and the mac and cheese overcooked.  At the very least, the waitress could have comped them, but alas, they were on the bill.  UGH.  Finally, the waiter who cleared the table asked me if I was done with my fish. Fish? Well, even he couldn't believe a tender piece rabbit could be mangled so badly.\n\nA true bummer all the way around.  The worst part, however, is that our friends will probably not trust our restaurant selection again.  \n\nIt's going to take a lot of convincing to get me back to Front Porch.  Sorry Michael Law.", "rating": 2, "date": "2009-05-29"}, {"excerpts": ["I had the frog's legs appetizer, and the burger. ", "Both of which were quite good. ", "The burger was served with some thick tasty bacon, and steak fries. ", "The wait staff was prompt, and charming. ", "I have very little negative to say about the place, the only thing that was wrong, was that my drink was a little late in getting to the table. ", "But that is nit picking."], "author": "Cheston L.", "review": "The place has a lot of charm. The space is a little limited in the evenings, but the food was fantastic. I had the frog's legs appetizer, and the burger. Both of which were quite good. The burger was served with some thick tasty bacon, and steak fries. The wait staff was prompt, and charming. I have very little negative to say about the place, the only thing that was wrong, was that my drink was a little late in getting to the table. But that is nit picking.", "rating": 5, "date": "2009-03-25"}, {"excerpts": ["The fried chicken crust just kind of fell apart, the macaroni and cheese was just dried out macaroni with bread crumbs on it (no creaminess at all), and the burger ( i split my entree and another) - was spiced in a way that made it not so good.  ", "needless to say I will not be back - ", "If you want good comfort food - stick with Blue Plate.  ", "Also with all the southern food in the city - where is the cajun  - i want good cajun food!"], "author": "Greg M.", "review": "As i was eating - my first reaction was \"mehhh\", as I continued and thought about it more - I thought that \"mehhh\" was just because I wanted to like the meal a little, but in truth -  It was just plain bad.  The fried chicken crust just kind of fell apart, the macaroni and cheese was just dried out macaroni with bread crumbs on it (no creaminess at all), and the burger ( i split my entree and another) - was spiced in a way that made it not so good.  needless to say I will not be back - If you want good comfort food - stick with Blue Plate.  Also with all the southern food in the city - where is the cajun  - i want good cajun food!", "rating": 1, "date": "2007-10-24"}, {"excerpts": ["He got a burger and other than mistakenly ordering it more done than he wanted it was great as well.  ", "Another thing that was good for me was the cask beer. ", "It was my first beer from cask and although I normally like ice cold beer the flavor of the beer was great at room temp.  ", "The service was super. ", "I would say they understand southern hospitality.  ", "Also the hot sauces are pretty amazing too.  ", "I can't wait to go back and try more stuff.  ", "If you like southern cajun style food and understand what it truly is then this place should be on your list.  ", "It's great quality but feels so cozy so it just feels right. :-)"], "author": "Rodney P.", "review": "Wow, I decided to go here mostly because it was getting late and we wanted dinner not far from home. I found it on yelp and it was open until 10 and close and off we went.  Parking isn't bad and the neighborhood is very nice.  The front porch of the front porch provides a great walking up experience.  The inside is a surprise it looks kinda seedy bar but instead of seedy it's trendy and decorated very intriguing in a good way.  The seating is great, we got a table that had half van seats which was very comfortable and we loved the use.  Coming from the south I have a pretty high standard for most comfort southern food and fried okra seems to be one that fails constantly when I try these type restaurants.  Well, we got the okra for an app and it was great.  I've had better but not much better.  The rest of the meal just kept giving.  I got the fried chicken which came with mashed potatoes and collard greens.  The greens were cooked perfectly which means they were tender yet had just the right amount of texture left, not mushy. The potatoes were great. The chicken was, like some other reviews state, probably the best I've had in SF.  I ordered a side of molasses coated brussel sprouts simply because I just had to try them.  They were some of the best sprouts I've had and even though the portion was huge we finished them because they were so good.  He got a burger and other than mistakenly ordering it more done than he wanted it was great as well.  Another thing that was good for me was the cask beer. It was my first beer from cask and although I normally like ice cold beer the flavor of the beer was great at room temp.  The service was super. I would say they understand southern hospitality.  Also the hot sauces are pretty amazing too.  I can't wait to go back and try more stuff.  If you like southern cajun style food and understand what it truly is then this place should be on your list.  It's great quality but feels so cozy so it just feels right. :-)", "rating": 5, "date": "2010-11-14"}, {"excerpts": ["The burger, however, was a quality burger.  ", "This is a yelp recommendation disappointment.  ", "I am softening the blow for you yelpers that want to make the trek to somewhere in the mission."], "author": "Fatty A.", "review": "Nice little bar/ pub place.  It reminds me of Cha Cha Cha with entrees.  The fried chicken is just ok here.  I don't agree with the yelp consensus that their chicken is awesome.  I am fat.  I eat a lot of fried chicken.  $30 for 6 pieces of cornmeal crusted, some dry some seasoned fried chicken shouldn't be on the best of yelp.  My sister's fat manatee bf ate the entire bucket himself.  Fat ass I wanted another piece.  The burger, however, was a quality burger.  This is a yelp recommendation disappointment.  I am softening the blow for you yelpers that want to make the trek to somewhere in the mission.", "rating": 3, "date": "2007-04-21"}, {"excerpts": ["The burger comes with two big pieces of Bacon and a slice of cheddar automatically. ", "How rad is that? ", "The fries and ketchup have some ineffable spiciness too. ", "The bun could use an upgrade though, kind of greasy and lacking texture. ", "Still, this burger rates my list and shouldn't be missed. ", "The fried chicken is divine, but please take the garlic out of the mashed potatoes. ", "This ain't the Claim Jumper."], "author": "Zac H.", "review": "The burger comes with two big pieces of Bacon and a slice of cheddar automatically. How rad is that? The fries and ketchup have some ineffable spiciness too. The bun could use an upgrade though, kind of greasy and lacking texture. Still, this burger rates my list and shouldn't be missed. The fried chicken is divine, but please take the garlic out of the mashed potatoes. This ain't the Claim Jumper.", "rating": 4, "date": "2009-06-08"}, {"excerpts": ["We opted to order the fried chicken plate, the burger, and an order of crab grits with the idea that we would share everything. ", "The buttery crab grits were the clear winner of the evening although the habanero and scallions appeared to be absent. ", "No worry though", ", it was a tasty dish and a good value for $11.50. ", "The burger was a tough call. ", "The accouterments were all top notch, good pickles, a tangy, sweet home-made ketchup heavy on celery salt, and amazingly tasty bacon cooked just right. ", "Unfortunately the patty itself was less than stellar. ", "I knew that we should have ordered it rare, but my compatriots insisted on medium rare. ", "Although there was a hint of pink in the center, the patty was a little dry and crumbly, not a top notch juicy burger. ", "A small frown graced my face as I sampled the vaunted fried chicken. ", "Perhaps you know that I make an effort to get out in the world to eat as many versions of fried poultry as one girl can. ", "The F.P.'s version  will not be at the top of the list. ", "It tried hard with the pepper in the batter (which I love) but appeared to be over fried as the crispy coating was quite dark. "], "author": "Candice L.", "review": "So Front Porch is in my hood and we were really hoping to add it to the regular rotation. Although I had a good time there and thought that the prices were very reasonable, I can't say that I was blown away by the food. In fact, some of the dishes didn't work at all, whereas others were more successful. The bomb of the night was appetizer, I believe it was called something along the lines of southern greens with tomatoes and ricotta fritters. A fritter should be light, airy puffs of fried batter and hopefully include some kind of goody inside. The consensus at our table was that our fritters were ill conceived and leaden. They were dusted with powdered sugar which not only didn't complement the savory tomato sauce they sat in but actually clashed with it. Blah. \n\nMoving on, I will say that they have cheap booze which can be a blessing if you want to go out and have one of those nights. My \"deuce\" of Three Thieves pinot was easy drinking and $10, which was fine with me. \n\nWe opted to order the fried chicken plate, the burger, and an order of crab grits with the idea that we would share everything. The buttery crab grits were the clear winner of the evening although the habanero and scallions appeared to be absent. No worry though, it was a tasty dish and a good value for $11.50. The burger was a tough call. The accouterments were all top notch, good pickles, a tangy, sweet home-made ketchup heavy on celery salt, and amazingly tasty bacon cooked just right. Unfortunately the patty itself was less than stellar. I knew that we should have ordered it rare, but my compatriots insisted on medium rare. Although there was a hint of pink in the center, the patty was a little dry and crumbly, not a top notch juicy burger. A small frown graced my face as I sampled the vaunted fried chicken. Perhaps you know that I make an effort to get out in the world to eat as many versions of fried poultry as one girl can. The F.P.'s version  will not be at the top of the list. It tried hard with the pepper in the batter (which I love) but appeared to be over fried as the crispy coating was quite dark. It came with sides of black-eyed peas which were also rated as merely okay and some more creamy grits. \n\nService was on the spacey side and didn't seem particularly bright or polished. All were pleasant and they've done a lot with the space. I was really hoping for a more solid performance though. I'm sure I'll go back from time to time to get some grits but I hope they improve the fried chicken.", "rating": 3, "date": "2007-01-08"}, {"excerpts": ["The burger was a little over-salted and the fish and chips were a little spicy.  ", "All in all, a very good meal in a fun atmosphere with excellent service and reasonable prices."], "author": "Zac A.", "review": "Really enjoyed my meal last night at the Front Porch.  Great food.  Excellent service.  And they serve a number of their wines in two glass portion carafe's that they call a \"deuce.\"   Handy for having a little white and then transitioning to red.  They also were very accomodating of our group with three young kids and even had a kid's menu with a coloring book page with Mr. T on the opposite side.  As for the food, I tried the fried chicken which was very good, and the fresh fish option, the spicy crab and carribean jerk chicken were excellent as well.  The burger was a little over-salted and the fish and chips were a little spicy.  All in all, a very good meal in a fun atmosphere with excellent service and reasonable prices.", "rating": 4, "date": "2007-06-12"}, {"excerpts": ["Went here for a burger after the game.  ", "The fried pickle appetizer tasted like a dirty fryer.  ", "For $6+, one might expect a little more than 5-6 pickle slices.  ", "On that note, the $16 burger was overcooked, dry and tasteless.  ", "The fries weren't much better.  ", "Indeed, I had to inspect both the fries and burger closely to make sure they were not from Costco.  ", "A total disappoinment!"], "author": "Seth S.", "review": "Af-Front-al Porch.   Went here for a burger after the game.  The fried pickle appetizer tasted like a dirty fryer.  For $6+, one might expect a little more than 5-6 pickle slices.  On that note, the $16 burger was overcooked, dry and tasteless.  The fries weren't much better.  Indeed, I had to inspect both the fries and burger closely to make sure they were not from Costco.  A total disappoinment!", "rating": 1, "date": "2011-09-19"}, {"excerpts": ["The burger and fries was one of the better I've had in the city.  ", "The homemade sauce (some sort of barbecue/ ketchup tangy combination) blew everyone away.  ", "The fried plantains were good enough that we ended up ordering a second round for dessert.  ", "Although a bit dark, the restaurant had a  relaxing / casual feeling."], "author": "Morgen N.", "review": "The burger and fries was one of the better I've had in the city.  The homemade sauce (some sort of barbecue/ ketchup tangy combination) blew everyone away.  The fried plantains were good enough that we ended up ordering a second round for dessert.  Although a bit dark, the restaurant had a  relaxing / casual feeling.", "rating": 4, "date": "2009-01-21"}, {"excerpts": ["My sister and gf had the Uruguayan beef burger and let me tell you after I had a bite I made them each give me almost half of theirs.  ", "It was that good.  ", "Had a great soup and who doesn't like that cornbread ", "they bring out?  ", "Overall I've had at least 7-8 great meals here, my only gripe would be that it's pricey for what you get, but these days what isn't?"], "author": "Al K.", "review": "One of my favorites in the city.  Food is always good, service is friendly, and the beer selection is awesome.  On my last visit I finally tried the fried chicken, which was excellent, though my only gripe is portion size - their 'breast' piece looks like they cut a normal breast in half.  So it's good, but I would rate Hard Knox higher because they give you more meat for $6 less.  My sister and gf had the Uruguayan beef burger and let me tell you after I had a bite I made them each give me almost half of theirs.  It was that good.  Had a great soup and who doesn't like that cornbread they bring out?  Overall I've had at least 7-8 great meals here, my only gripe would be that it's pricey for what you get, but these days what isn't?", "rating": 5, "date": "2009-01-04"}, {"excerpts": ["but I ordered a burger.  ", "The reason is ...because, I only really like the breast ", "and it is a half of a chicken and ", "I new most of it would go wasted.  ", "The burger was excellent served on a beautiful Brioche bun.  ", "Aimee ordered the special \"Fish & Chips\"  they were very doughy.  ", "Also, they were supposed to be served with cole slaw but instead came with Fried okra, she was dissappointed because her plate consisted of all fried food.  ", "In all fairness we did order the cole slaw after the fact and the waiter did take it off our bill.  ", "We both tried  a drink called the \"electric marmalade\" and both liked it, however, it did go down really easy for 8 bucks a pop.  ", "Aimee switched over to a beer on tap that she found to be warm...", "I don't know what it is about this place... ", "maybe its the overall cuteness of the mission hot spot or maybe its  the comfort style food, but I will definitley return....warm beer and all!"], "author": "Michele K.", "review": "The Front Porch is a caribbean Soul food restaurant deep in the Mission District.  The space is cute and remindes me of a restaurant I might see in Silver lake...it is small and usually busy.  The staff is  attentive and very approachable.  \nI was craving Jerk chicken but I ordered a burger.  The reason is ...because, I only really like the breast and it is a half of a chicken and I new most of it would go wasted.  The burger was excellent served on a beautiful Brioche bun.  Aimee ordered the special \"Fish & Chips\"  they were very doughy.  Also, they were supposed to be served with cole slaw but instead came with Fried okra, she was dissappointed because her plate consisted of all fried food.  In all fairness we did order the cole slaw after the fact and the waiter did take it off our bill.  We both tried  a drink called the \"electric marmalade\" and both liked it, however, it did go down really easy for 8 bucks a pop.  Aimee switched over to a beer on tap that she found to be warm...I don't know what it is about this place... maybe its the overall cuteness of the mission hot spot or maybe its  the comfort style food, but I will definitley return....warm beer and all!", "rating": 3, "date": "2008-07-11"}, {"excerpts": ["I liked the corn bread at the beginning with the butter with the kick, but the burger was just alright and the crab and grits was just OK too.  ", "Good beer list."], "author": "Jaime C.", "review": "I give this place 4 stars for atmosphere.  It is really cute and cozy inside.  Its real dark and loud so good for an easy night out.  The menu I give a  3.  It is a fairly limited, however, the fried chicken is fantastic.  It is really that good.  I liked the corn bread at the beginning with the butter with the kick, but the burger was just alright and the crab and grits was just OK too.  Good beer list.", "rating": 3, "date": "2006-12-03"}, {"excerpts": ["Others ordered the crab and grits which was actually really good, the burger, ribs, steak, fish...everyone in the group was raving about it."], "author": "Lisa D.", "review": "We had the BEST experience at Front Porch.  A great neighborhood restaurant with good service, yummy sangria, and the food was all excellent.  We started with the ribs and wings.  I had the fried chicken which was the best I have had in the city (not like I have had much, but it was still the best).  Others ordered the crab and grits which was actually really good, the burger, ribs, steak, fish...everyone in the group was raving about it.", "rating": 5, "date": "2008-06-15"}, {"excerpts": ["IThe e flavors were very americana (fried chicken, burger, and fish and chips on the menu and the fish of the fish and chips was pretty flavoirless). ", "Love the location and decore (and, again, appetizers). ", "Service was good. ", "Will give another try to see if the entrees improve."], "author": "Scott M.", "review": "Appetizers were great (Ceviche and Tuna Tartare), but the entrees were lacking in flavor and imagination. IThe e flavors were very americana (fried chicken, burger, and fish and chips on the menu and the fish of the fish and chips was pretty flavoirless). Love the location and decore (and, again, appetizers). Service was good. Will give another try to see if the entrees improve.", "rating": 3, "date": "2006-09-03"}, {"excerpts": ["Standards like the fried chicken (way better last night than the first time I had it 5 months ago), the burger, and the kickass crab 'n ", "grits never disappoint.  ", "Their ceviche is, if not one of the best, by far the best value in town.  ", "Same can be said for what seems to have become a permanent app menu addition, the bistrot salad.  ", "Nightly seafood, vegan, and entree specials always make decision time a serious pain in the ass.  ", "Unless it's pork chop night, then it's a no-brainer.  ", "Always gotta order the fries trio, if for nothing else to act as a vehicle for more condiment consumption.  ", "And to quench the thirst and some of the heat from the habies, there are many tasty adult beverages to choose from.  ", "Although I am disappointed in the fact that the red-eye has disappeared... 2/3 pint glass of spiced tomato juice and a Bud tallboy.  ", "Trailer park bloody mary.  ", "Sure could go for one right about, um, now."], "author": "Drinky C.", "review": "As soon as I walked in,  I knew I was going to like it.  Reminded me of an old favorite from my PDX days called Dot's.  Dark, mismatched furniture, Zep on the stereo, and the delicious aroma of fried goodness.\n\nThe place is now one of my regular joints, and it's become an almost weekly habit.  In fact, I may actually be addicted to the house-made ketchup and cucumber-habanero chutney.  They're both delicious on their own, but combined they form like Voltron into some kind of God-sauce.  I'd eat my own baby if it were slathered in this stuff.\n\nStandards like the fried chicken (way better last night than the first time I had it 5 months ago), the burger, and the kickass crab 'n grits never disappoint.  Their ceviche is, if not one of the best, by far the best value in town.  Same can be said for what seems to have become a permanent app menu addition, the bistrot salad.  Nightly seafood, vegan, and entree specials always make decision time a serious pain in the ass.  Unless it's pork chop night, then it's a no-brainer.  Always gotta order the fries trio, if for nothing else to act as a vehicle for more condiment consumption.  And to quench the thirst and some of the heat from the habies, there are many tasty adult beverages to choose from.  Although I am disappointed in the fact that the red-eye has disappeared... 2/3 pint glass of spiced tomato juice and a Bud tallboy.  Trailer park bloody mary.  Sure could go for one right about, um, now.", "rating": 5, "date": "2007-02-18"}, {"excerpts": ["The grass-fed burger was tasty too. ", "And loved the unique spicy flavor to the fries. ", "This is definitely a fun, hidden spot with a cool, sexy yet low-key vibe and amazing food. ", "(Don't even try to count the calories here!) ", "The service was great with the exception of the unfriendly hostess who was clearly in need of a drink herself."], "author": "a p.", "review": "Oh. My.  I unknowingly ate a snail. I suppose I should've known what conch was, but as I'm not exactly known for my adventurous eating habits, I didn't. But I have to say, the conch and sweet pepper fritters at the Fronch Porch were amazingly delicious. In fact, I loved everything about this place. The corn bread was mmm mmm good. The grass-fed burger was tasty too. And loved the unique spicy flavor to the fries. This is definitely a fun, hidden spot with a cool, sexy yet low-key vibe and amazing food. (Don't even try to count the calories here!) The service was great with the exception of the unfriendly hostess who was clearly in need of a drink herself.", "rating": 4, "date": "2007-06-21"}, {"excerpts": ["i had the burger for my entree, partly just to choose something different from what other people were getting (fried chicken, crab and grits) but it was delicious.  ", "fries were good too.  ", "i tried my friend's crab and grits and really thought they were good.  ", "the fried chicken got rave reviews as well.  \n", "we didnt go with dessert, being too full and ready to hit the town after such a long dinner.  ", "oh well - there is always next time, because i WILL be back again!  ", "with 4 friends of course..."], "author": "Carolyn B.", "review": "the one thing you must know about the front porch is that they do not take reservations so you will wait.  they do if you have more than 5 people though, so my advice would be to russle up 4 friends just so that you can make a reservation!  \nanyway, once we had gotten through our 45 minute wait (which we spent at the 3300 club up the street... good little system they have where you can go up there for a drink while you wait and they just call you when your table is ready), we had a great meal.  i really liked the atmosphere - dark, cozy, even mysterious.  cool tin ceiling and slow fans, candlelight.  the service was very accommodating and friendly - we asked if there were any booths available and when one opened up a few minutes after we had ordered, the hostess nicely moved us there to be more comfortable.  \nwe started with the cod and pepper fritters (which actually came with our entrees vs first but we didnt care!) - my favorite dish of the evening.  first of all, they are fried, which is a guaranteed win right there.  but the cod was light and had great flavor and the peppers were just a subtle touch.  i had the burger for my entree, partly just to choose something different from what other people were getting (fried chicken, crab and grits) but it was delicious.  fries were good too.  i tried my friend's crab and grits and really thought they were good.  the fried chicken got rave reviews as well.  \nwe didnt go with dessert, being too full and ready to hit the town after such a long dinner.  oh well - there is always next time, because i WILL be back again!  with 4 friends of course...", "rating": 4, "date": "2007-11-04"}, {"excerpts": ["i have now been to the front porch on two occasions,  and have eaten fried chicken, shrimp po'boy, burger, and the rock cod. ", "of the four entries, enjoyed the chicken and the burger the most. if you want a good po'boy head to brenda's.  the drinks are really good though...", "my recommendation would be to come here with a couple friends, enjoy a bucket of chicken and try and few of the specialty  'bevies'."], "author": "Jaime R.", "review": "i have now been to the front porch on two occasions,  and have eaten fried chicken, shrimp po'boy, burger, and the rock cod. of the four entries, enjoyed the chicken and the burger the most. if you want a good po'boy head to brenda's.  the drinks are really good though...my recommendation would be to come here with a couple friends, enjoy a bucket of chicken and try and few of the specialty  'bevies'.", "rating": 3, "date": "2009-09-27"}, {"excerpts": ["I got to try a few bites of the burger.  ", "Amazing."], "author": "Tom Z.", "review": "Solid 4, maybe 4.5 stars now.  Had the ribs.  Great sauce, but not fall off the bone, which I prefer.  (I don't hold that against Front Porch, because nobody in the Bay Area seems to know how to cook ribs.)  Finally tried the fried chicken, and it was very, very good.  The skin has so much flavor and the chicken was still juicy.  Sides were solid, but nothing spectacular.  I got to try a few bites of the burger.  Amazing.", "rating": 4, "date": "2008-12-18"}, {"excerpts": ["We also ordered the trio of fries based on a yelp recommendation and low-and-behold, they ALSO came with the burger my boyfriend ordered.  ", "Say WHAT?  ", "Our server chose not to tell us this when we orderd - that's a crap load of french fries...  ", "I had the crab with grits and it was okay at best.  ", "Boyfriend loved the burger, but that did not make-up for poo service and all the other mediocre dishes."], "author": "Jane M.", "review": "Were my expectations too high?Probably, but I'm not willing to be that objective.  We arrived at 5:00 sat down at 5:45 and didn't even meet our server until 6:15 - say WHAT?  The conch fritterswere okay.  We also ordered the trio of fries based on a yelp recommendation and low-and-behold, they ALSO came with the burger my boyfriend ordered.  Say WHAT?  Our server chose not to tell us this when we orderd - that's a crap load of french fries...  I had the crab with grits and it was okay at best.  Boyfriend loved the burger, but that did not make-up for poo service and all the other mediocre dishes.", "rating": 2, "date": "2007-06-26"}, {"excerpts": ["that's why we went there - who goes to a place like this and orders a burger? ", "Yelpers do - that's who - because they are bozo's and don't know any better - then they write about it because they think they are qualified to do so and that somebody out there cares. ", "Listen up Yelpers - they don't. ", "If it weren't for your Mom and your \"friends\" that tell you how funny you are - ", "no one would read the uninformed crap that you write. ", "This place was such a bust it is hard to know where to begin? ", "Where they found the recipes for some of this food is a real mystery? ", "The food was so bad ", "it's almost like you would have to intentionally try to cook it that poorly. "], "author": "stephanie d.", "review": "I have avoided Yelper favorites for months now after the many lousy experiences I've had at these \"incredible favs\" of the Yelper (morons) crowd. But I got dragged to this place the other night because I am a former French Quarter resident and LSU grad - so pals of mine always want to take me to southern/cajun/creole places. Why? I don't know why...because I always tell them that I have NEVER had good Louisiana cooking outside of Louisiana - simple as that. But I went along willingly - with an open heart and an open mind probably brought on by the fact that I was seriously Jones'n for some really good red beans and rice and a bowl of real Louisiana style gumbo. Cute place - pretty good service - cold beer - comfy booths and tables - nice crowd of people - all good so far. So we order all the really southern items on the menu - that's why we went there - who goes to a place like this and orders a burger? Yelpers do - that's who - because they are bozo's and don't know any better - then they write about it because they think they are qualified to do so and that somebody out there cares. Listen up Yelpers - they don't. If it weren't for your Mom and your \"friends\" that tell you how funny you are - no one would read the uninformed crap that you write. This place was such a bust it is hard to know where to begin? Where they found the recipes for some of this food is a real mystery? The food was so bad it's almost like you would have to intentionally try to cook it that poorly. If you bill yourself as a southern food joint - and you serve inedible gumbo, lousy red beans and rice, mediocre greens, OK shrimp and grits and hush puppies like none I have ever eaten before (and not in a good way) - well then you deserve to get some not so nice things said about your place. This food was not OK or mediocre or \"maybe I'll try it again\" kinda food - it was just bad. Really bad. Yet I felt bad when we left - I liked the way the joint felt - someone has put their heart and soul into it and created a place with a great feeling and a cool crew. But the food we had was terrible and I will never be able to return there again. So - thanks again Yelpers! You've kept your track record in tact - another highly rated Yelper joint that was just about as bad as bad can be. Congrats to all you unqualified critic wannabe Yelper clowns.", "rating": 1, "date": "2010-01-20"}, {"excerpts": ["One word of advice-a medium rare burger comes out really rare."], "author": "r e.", "review": "Love their fried chicken and their burgers. Burgers are very homestyle with housemade ketchup. Yum! One word of advice-a medium rare burger comes out really rare.", "rating": 5, "date": "2009-04-30"}, {"excerpts": ["some entrees are 30+, but the burger is only $11.  ", "Personally I like that - you want gourmet food", ", you pay gourmet prices.  ", "The chicken is a great deal at about $15.  ", "Service was pretty attentive with occasional lapses.  ", "However they put up with our ridiculous 15-minute figure-out-the-bill session with a smile so extra points there.  ", "Overall, a very positive experience.  ", "I'd go back."], "author": "Adam H.", "review": "Had dinner here for the first time last night with a fun group.  Overall a very positive experience.  HAve to agree with other reviewers that it's not really a Carribean restaurant - American Continental/Soul Food is not a bad description.  The decor is cozy and fun, not too open, not too cramped.  They have a small, but excellent beer list, including St. Peter's Cream Stout, quite possibly my favorite beer ever, and an excellent accompaniment to some competent fried chicken.  The menu is eclectic and so are the prices - some entrees are 30+, but the burger is only $11.  Personally I like that - you want gourmet food, you pay gourmet prices.  The chicken is a great deal at about $15.  Service was pretty attentive with occasional lapses.  However they put up with our ridiculous 15-minute figure-out-the-bill session with a smile so extra points there.  Overall, a very positive experience.  I'd go back.", "rating": 4, "date": "2008-11-04"}, {"excerpts": ["loved the front porch burger and the ceviche.  ", "the fried chicken was delicious ", "but i was tremendously disappointed when my bucket did not contain any drumsticks.  ", "what is fried chicken without a drumstick?  ", "the wait for the table was pretty long which is typical for good food in SF but the service....", "well the owner was ", "super nice(i think he was the owner) - but ", "our waiter was just eh."], "author": "a g.", "review": "loved the front porch burger and the ceviche.  the fried chicken was delicious but i was tremendously disappointed when my bucket did not contain any drumsticks.  what is fried chicken without a drumstick?  the wait for the table was pretty long which is typical for good food in SF but the service....well the owner was super nice(i think he was the owner) - but our waiter was just eh.", "rating": 3, "date": "2007-02-13"}, {"excerpts": ["The burger has good meat, but the patty is just disgustingly thick. ", "The fries were good. ", "Pretty crispy for steak fries. ", "The street corn was good. ", "But it's just corn on the cob ", "and it's $5.  ", "I'll seek out another fried chicken place."], "author": "James C.", "review": "Disappointing considering the prices. Not sure i'd go back. Their menus is just strange. You can't get ribs unless you get it with the wings in the appetizer. The fried chicken is just okay. Lots of seasoning. The skin comes off the meat way too easily. The accompanying slaw doesn't really taste like much. The burger has good meat, but the patty is just disgustingly thick. The fries were good. Pretty crispy for steak fries. The street corn was good. But it's just corn on the cob and it's $5.  I'll seek out another fried chicken place.", "rating": 3, "date": "2008-06-30"}], "black eyed pea burger": [], "baked egg  grits portobello": [], "fried okra with jalapeno aioli": [{"excerpts": ["Biscuits & gravy and the FRIED OKRA with jalapeno aioli. "], "author": "Wing L.", "review": "Awesome place for brunch! I recommend reservations as this eatery is relatively small and there can be a line during popular brunch hours. We had a big party of 10, so we had reservations. We were seated in this corner booth with additional chairs. It was kinda tight, but we made it work.\n\nPARKING: Only street parking (mostly metered). There is one residential street where parking is free for 2 hours - but you gotta get lucky!\n\nFOOD: Think Southern style brunch food. Appetizers were great too! Biscuits & gravy and the FRIED OKRA with jalapeno aioli. Yum! \n\nTheir fried chicken is probably the most popular (takes 25 mins approx.). If you know you want it, order it fast so you don't have to wait long for it. Comes with huge pieces of chicken and a bacon waffle.\n\nI ordered the benedict with andouille sausage - yum! Served with choice of cheese grits or tater tots (got the grits, but it was sooo much. Probably should've gotten the tots).\n\nOverheard the coffee wasn't all that great - with some kind of spice to it?\n\nSERVICE & AMBIANCE: Mood lighting and pretty dark in there. Don't count on getting a good picture of your food in the dark - just enjoy it! Service was decent and food came out relatively quickly.", "rating": 4, "date": "2017-01-22"}, {"excerpts": ["For apps, we got the fried okra with jalapeno aioli, bacon-wrapped dates, and an arugula salad.\n\n"], "author": "Kristina L.", "review": "I LOVE southern food (well I'm from Texas so I grew up eating southern food)! A local friend recommended this place for great fried chicken. I'm actually not huge on fried chicken, but decided to give this place a try.\n\nThis place is pretty popular and crazy and I was lucky to grab the last reservation spot. \n\nWhen you get there, they give you a plate of corn bread with herb butter. They were good and so moist.  My friends and I were a little too excited so we ordered everything on the menu.\n\nFor apps, we got the fried okra with jalapeno aioli, bacon-wrapped dates, and an arugula salad.\n\n- Okra: These were pretty good. I liked the fried batter. The aioli was a bit mild for me but I like things spicy\n- Dates: OH these melted in your mouth! AMAZING! Even my friend who doesn't care about dates really enjoyed these\n- Arugula Salad: nice refreshing salad but nothing special\n- Biscuits: I had to get a side of biscuits but I was expecting it to be drenched in gravy. But I was happy with the jam and herb butter :)\n\nFor the main entrees, we got:\n\n- Spicy Shrimp and Grits: This was delicious and I wish I could have more now! The grits were so smooth and creamy. The andouille sausage had a good kick of spice and were tasty. The shrimp was cooked perfect!\n- Dr. Pepper Braised Short Ribs: These were good and I would say worth to try but I probably wouldn't order it again. It was a super rich dish, which is expected in southern cooking. This was my fiance's entree, but he seemed to enjoy eating my spicy shrimp and grits dish more ;)\n- Fried Chicken Plate: We thought it was amusing that this was served on a lunch cafeteria tray instead of a nice white plate like the other dishes. I tried a piece of the fried chicken and the batter was tasty and light surprisingly (it wasn't oily at all). The chicken was also super flavorful and moist. \n- Flounder: I'm not sure how this was but my friend seemed to enjoy it\n\nWe had to finish our meal with some good ole desserts. We ordered the brown bag beignets and the pumpkin brioche bread pudding. Brown bag beignets were good but not memorable. The bread pudding was delicious but it was alot more dense than I was expecting.", "rating": 4, "date": "2013-11-24"}, {"excerpts": ["- Fried Okra with Jalapeno Aioli ($7.50): ", "I loved the contrast in texture between the fried breading and the squishy okra. "], "author": "Jessica F.", "review": "Tucked into a hip, local street in Bernal Heights, The Front Porch is located on the first floor of an apartment building. The decor is absolutely adorable and homey, with rocking horses, a diverse array of potted plants, and small windows with curtains. This is the type of restaurant that belongs in a movie where the characters go on a perfect first date.\n\n- Fried Okra with Jalapeno Aioli ($7.50): I loved the contrast in texture between the fried breading and the squishy okra. The jalapeno aioli is not too spicy, and really gives a good kick of flavor.\n\n- Biscuits ($4.50/2 biscuits): These come with preserves and sage butter. Nothing special; I guess KFC has ruined my biscuit standards.\n\n- Baked Mac & Cheese ($8): I liked the shell-shaped pasta they used as the mac, and the cheese is not too overpowering. I did find this a bit undercooked.\n\n- Apple + Spice Brined Pork Chop ($21): I appreciate a good savory and sweet combination, and I'm really impressed by how much the apple flavor comes out in the meat. The homemade cranberry mustard on top of the pork chop is actually amazing (I don't like mustard, especially the grainy stuff, and I never choose to put it on my food). The bed of brussel sprouts and cornbread continued the savory and sweet trend.\n\n- Mulled Wine ($8): Those small moments of London always make my heart break. The wine is heavy on the spices and lower on the sweet factor than what I was expecting, but this is probably the most similar I've had in the states.\n\nAll dishes come with a mini cornbread with sage butter. They also give you their two spice sauces (the lighter bottle is more spicy), which you can buy by the bottle for $6 or 8. The place was quite crowded on a Saturday night at 7:30PM, so make a reservation if possible.\n\nStare fondly at the rocking horses. Front Porch rocks!", "rating": 4, "date": "2015-01-11"}, {"excerpts": ["We started off with the Fried Okra with Jalapeno Aioli and Fried Catfish Sliders. ", "The fried okra were addicting! ", "I just keep popping them into my mouth like popcorn!  ", "The catfish sliders were not too bad.. not enough fish though.. =", "T ", "For our main entree, we had the Fried Chicken, Shrimp and Grits, and the Lower Ninth Ward BBQ Shrimp. ", "They were all effin' awesome! ", "The shrimp and grits and bbq shrimp were both on the spicy side, but I love spicy food, so it was deelish for me. ", "the fried chicken was juicy and not overly battered. ", "PERFECT! "], "author": "My C.", "review": "As I try to cross off the list 100 food/drinks I must try before I die, the list brought me to the Front Porch for the Crab and Grits... A little disappointed I was to find out the chef that made that NO LONGER works there and took the recipe with him... Booo!!!!! But nonetheless, we sat down and continued with our experience. \n\nWe started off with the Fried Okra with Jalapeno Aioli and Fried Catfish Sliders. The fried okra were addicting! I just keep popping them into my mouth like popcorn!  The catfish sliders were not too bad.. not enough fish though.. =T For our main entree, we had the Fried Chicken, Shrimp and Grits, and the Lower Ninth Ward BBQ Shrimp. They were all effin' awesome! The shrimp and grits and bbq shrimp were both on the spicy side, but I love spicy food, so it was deelish for me. the fried chicken was juicy and not overly battered. PERFECT! =) \n\nWe got there a little past 6, and there were plenty of seats left. But by the time we left, around 8:30... the place was packed with a wait.. on a Wednesday night! Recession's over!!", "rating": 4, "date": "2009-05-03"}], "habanero hot sauce bottle": [], "red jalapeno hot sauce bottle": []}