{"smoked duck": [{"excerpts": ["The duck platter (smoked duck breast, duck confit, garlic fried rice w/ peanuts and other seasonings) was out of this world! ", "The squash salad was also a great balance of flavors and textures - slightly sweet pomegranate seeds, buttery smooth roasted squash, smoky pieces of Spanish ham, and generously sprinkled chunks of stinky pecorino cheese, finished with a tangy drizzle of balsamic vinegar. "], "author": "Anna C.", "review": "Came here after trying out State Bird and I have to say The Progress wins in a landslide in my book!\n\nThe duck platter (smoked duck breast, duck confit, garlic fried rice w/ peanuts and other seasonings) was out of this world! The squash salad was also a great balance of flavors and textures - slightly sweet pomegranate seeds, buttery smooth roasted squash, smoky pieces of Spanish ham, and generously sprinkled chunks of stinky pecorino cheese, finished with a tangy drizzle of balsamic vinegar. I dream of that. \n\nThings that were mediocre: the persimmon toast thing (rather bland), the kimchi pork pierogi (couldn't taste the kimchi at all and the porky was not very juicy). The warm apple cake was decent but was probably the strong point of their not-very-great dessert menu.\n\nThe only big issue that came up for us was that our server was super pushy, and encouraged us (party of 2) to add another 2 small plates to our order. We weren't convinced as we were not that hungry, so we pushed back and said we didn't think we needed it. He continued being aggressive about it so we just agreed and chose some dishes randomly (the persimmon toast and pierogi).\n\nWe ended up with more food than we needed, and the dishes we didn't like as much were the ones we were pushed to order randomly!! I'm not a huge fan of when restaurants are aggressive like this - I understand and appreciate that they try to recommend a good portion size for us, but it should feel more like a recommendation and not some sort of emotional blackmail lol. :'(", "rating": 4, "date": "2017-11-10"}, {"excerpts": ["- Smoked duck = "], "author": "Owie N.", "review": "This is probably my favorite restaurant to recommend to any of my friends, which is why I'm shocked that I haven't post a review for it. \n\nThe Progress is absolutely delicious, creative, and unexpected. \n\nStraightforward, this is a family style menu that you get to pick and choose from 6 dishes for $65 per person. We ordered:\n\n- \"Treasured Chest\" = tasty pork broth with tender sausage and dumpling. Favorite entrée that night. \n\n- Squab = aromatic spiced squab with salted chili paste. \n\n- Pig fries = crispy, fried, and crunchy goodness. Love the addition of shaved cauliflower and herbs. \n\n- BN ranch beef = with grilled dandelion greens. The beef was tender and moist. \n\n- Smoked duck = I love anything with duck meat. \n\n- Lamb Merquez = with yellow beans, octopus & crispy squid. Portion was just right. \n\n- Dessert = simply delicious. \n\nEverything was amazingly scrumptious. The staff here was super friendly and helpful. I'll gladly return for dinner. Cheers!\n\nThe simple things in life.", "rating": 5, "date": "2015-11-05"}, {"excerpts": ["Here's what we ordered:\n\nComplimentary \"Banchan\" --  http://bit.ly/1FnBuQb \n\nRaw Japanese Snapper with Turnips & Crème Fraîche -- http://bit.ly/1HVWSJL \n\nSmoked Duck with Marinated Pioppini Mushrooms & Dried Plum --  http://bit.ly/1yZ5FFK\n\nShaved Cauliflower-herbs & Pig Fries --  ", "My faves were definitely the Smoked Duck which was similar to the duck I had back at State Bird minus the pancakes, the Pig Fries because of their sheer fried pork awesomeness,  and surprisingly, the Lamb Merguez with Octopus and Squid, simply because I'm not into lamb that much.  ", "But somehow they found a way to bring that dish all together and "], "author": "Rodney H.", "review": "Since I'm huge fan of State Bird Provisions, it was only a matter of time before I would finally have dinner at their sister restaurant, The Progress.  I just had to wait a couple of months for the hype to die down a little bit.  Surprisingly, it wasn't as difficult to land a reservation here than for State Bird.\n\nWhen you walk in, it's a much more grander scale than State Bird.  The decor is warm and looks a lot brighter.  Plus they have two upper balconies for dining.  The big difference with The Progress is that they have a full cocktail bar here with tables so you can dine at the bar as well.\n\nThe food menu is completely different and can hold it's own against State Bird.  Where State Bird is more of a dim sum and tapas style restaurant, the Progress has a more family style dining approach with a 6-course dinner.  While the experience is still similar, the food portions here are larger.  I dined here with a couple friends so sharing each dish between the three of us was pretty easy to do.  The only thing that did take a while was for us to decide which 6 dishes to pick for our dinner.\n\nHere's what we ordered:\n\nComplimentary \"Banchan\" --  http://bit.ly/1FnBuQb \n\nRaw Japanese Snapper with Turnips & Crème Fraîche -- http://bit.ly/1HVWSJL \n\nSmoked Duck with Marinated Pioppini Mushrooms & Dried Plum --  http://bit.ly/1yZ5FFK\n\nShaved Cauliflower-herbs & Pig Fries --  http://bit.ly/1yZ6zC7\n\nAromatic Spiced Squab with Salted Chili Paste -- http://bit.ly/1HW03kN \n\nLamb Merguez with Yellow Eye Beans, Octopus & Crispy Squid --  http://bit.ly/1HW1iAu\n\nDessert Assortment --  http://bit.ly/1DNhNkO\ndessert choose 1 per person\nlemongrass floating island, rhubarb sorbet & coconut-ginger gelée\npoppyseed angel cake, strawberries, sicilian pistachio & mascarpone\ndates à la mode, St. George NOLA, hazelnuts & chocolate\n\nSo much food!  And we enjoyed pretty much everything we ordered.  My faves were definitely the Smoked Duck which was similar to the duck I had back at State Bird minus the pancakes, the Pig Fries because of their sheer fried pork awesomeness,  and surprisingly, the Lamb Merguez with Octopus and Squid, simply because I'm not into lamb that much.  But somehow they found a way to bring that dish all together and the Lamb Merguez didn't have an overpowering lamb taste.  The dessert assortment, while good, was a little bit of a let down in comparison to State Bird's dessert offerings.  I might end up skipping dessert next time since it's optional.\n\nJust recently, they changed the food menu at the bar.  Though it's still a la carte, the portions are more tapas sized like State Bird and at more affordable prices.  So basically, you can get a \"State Bird\" experience at the bar.\n\nIs The Progress better than State Bird?  It's pretty close,  Food-wise they're almost equally impressive, but I still prefer the whole \"dim sum\" experience at State Bird to be more entertaining.   Nonetheless, The Progress is an amazing follow up from the State Bird Provisions team and I wouldn't hesitate to go back again to try their other dishes, just like I would with State Bird.", "rating": 5, "date": "2015-09-30"}, {"excerpts": ["For our meal we chose:\n\n*smoked duck with marinated yellowfoot mushrooms & dried plum\n*shaved cauliflower-herbs & pig fries\n*pecorino 'roti' with perigord truffle buttermilk\n"], "author": "Mai W.", "review": "This place was a great dining experience. The drinks were great, the atmosphere was modern and of course the food was phenomenal.\n\nThe style of serving for this meal was very unique. You get a menu (much like dim sum places) and you mark of 6 dishes to share for the table. Everything is family style. You are not limited to choosing only six, you can add an additional dish for $10/person. The meal was $65/person which is not bad at all!\n\nFor our meal we chose:\n\n*smoked duck with marinated yellowfoot mushrooms & dried plum\n*shaved cauliflower-herbs & pig fries\n*pecorino 'roti' with perigord truffle buttermilk\n*lamb merguez with yellow eye beans, octopus & crispy squid\n*aromatic spiced squab with salted chili paste\n*grilled Five Dot Ranch beef with mustard-miso oyster sauce\n\nOur favorite by far was the Cauliflower and pig fries. The Lamb merguez came in a close second but all the food that came out was great!", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["Smoked duck w/ marinated yellowfoot mushrooms & dried plum - I insisted on ordering this, as I love the duck pancakes at State Bird. ", "Unfortunately this was very disappointing. ", "I have to agree with the reviewer that said this tasted like bologna. "], "author": "Adrienne H.", "review": "I was so SO excited about The Progress...only to leave disappointed, hangry, and entertaining the idea of having a second dinner at Zuni. At least I got a good buzz from the drinks.\n\nSo what happened? Well, I'm a big fan of State Bird (I may be biased, as it was also the location of the best first date ever). Therefore, I went to The Progress with high expectations but an open mind, knowing the concept would be different.\n\nDRINKS:\nWe got drinks while waiting for our table to be ready. This was the highlight of the night. AWESOME cocktails. I got the The Mezzanine (mezcal, house banana liqueur, allspice, lime, nocino). Being on a mezcal kick from Mexico a week earlier, I thoroughly enjoyed this smokey concoction. I also tried the King's Crossing (rye, calvados, mulling spice, lemon, egg white, cider). Woah, tasted like delicious spiked apple cider. During dinner, I enjoyed a chardonnay and prie blanc. They had a short, but varied wine by the glass selection. Impressive bottle selection.\n\nFOOD:\nAmuse Bouche - beef jerky, fried oyster, something with trout I believe, and cheese crackers. Great presentation and strong flavors. Off to a great start!\n\nSmoked duck w/ marinated yellowfoot mushrooms & dried plum - I insisted on ordering this, as I love the duck pancakes at State Bird. Unfortunately this was very disappointing. I have to agree with the reviewer that said this tasted like bologna. I couldn't finish it.\n\nPorcini & mt. tam dumpling w/ nettle salsa verde - Not bad, enjoyed the cheese filling, but too much dough to filling ratio.\n\nPercorino roti w/ black truffle buttermilk - How do you mess up roti? Soggy and the truffle was barely detectable. \n\nTreasure chest of fermented sausage, trout quenelles, pumpkin-rice dumpling in pork broth - My favorite dish of the meal. Delicious broth, loved the sausage and pumpkin dumplings. Trout quenelles was so-so.\n\nDungeness crab, bok choi, tofu stir fry - Ick. Barely any crab, tofu was bland and had an off putting taste. And I like tofu! - plain, fried, stinky, dried...but not this tofu.\n\nWild mushrooms w/ pickled local nori & kale - Bland. Lacked cohesiveness.\n\nThe meal wasn't a total flop, but it was disappointing and left me unsatisfied. The food sounded great on the menu but all lacked one thing or another in the execution.\n\nOther notes:\n-Good service in both the bar area and at dinner. Enthusiastic, helpful, and great all around.\n-They serve the full menu a la carte at the bar.\n-We had our own two top, but some tables were communal style.\n-Very beautiful, well-designed space. Custom chairs, tables, lighting. And the bathroom had fun colorful toilet paper.\n-No, I did not get a second dinner.", "rating": 2, "date": "2015-02-03"}, {"excerpts": ["Next, we had the smoked duck. ", "Maybe the second best dish of the night. ", "It's like a twist on the vietnamese beef carpaccio. ", "The roti is good ", "but it's not as good as roti at Singapore/Malaysia restaurant. ", "And when you think about the cost for this dish, it's ridiculously priced as 1 of 6 dishes of the meal. ", "Likely my favorite dish was the squab. ", "Love the bo-ssam style. ", "The next two dishes was forgettable. ", "Over cooked steak and lobster. ", "We finished off with a guava sorbet. ", "For the ladies in our group, they enjoyed this the most because of the explosion guava. "], "author": "Kien M.", "review": "Man was I disappointed in The Progress. \n\nI ran about 15 minutes late and they sat us right away. Awesome! We all started off with cocktails and they are so watered down. I got the sunny Jim and it was like Mike's hard lemonade. The amuse bouche plate was a nice gesture.\n\nOkay our food order comes in. First was the lamb tartare. The runner who mixed our tartare was 'F' ing rude, he barely mixed our tartare and just tossed the utensils after mixing. I like the dish and the creativity of the sesame cracker. Next, we had the smoked duck. Maybe the second best dish of the night. It's like a twist on the vietnamese beef carpaccio. The roti is good but it's not as good as roti at Singapore/Malaysia restaurant. And when you think about the cost for this dish, it's ridiculously priced as 1 of 6 dishes of the meal. Likely my favorite dish was the squab. Love the bo-ssam style. The next two dishes was forgettable. Over cooked steak and lobster. We finished off with a guava sorbet. For the ladies in our group, they enjoyed this the most because of the explosion guava. For night cap, got a Blue Bottle cap.\n\nOverall. State Bird Provision blows The Progress away. I don't think I will be back especially how expensive the bill was.", "rating": 3, "date": "2015-03-11"}, {"excerpts": ["Items of note:\n\nSmoked duck thang: really tasty. "], "author": "Peter T.", "review": "The food is expertly executed texture and balance wise. This particular chef seems to be a fan of acid, as each dish offered a nice contrast of depth with that nice vinegary -POP- at the end.  The service was easily the best I had in the city. Professional, prompt, my water was never less than half full, and items were coursed properly. \n\nItems of note:\n\nSmoked duck thang: really tasty. Duck is thinly sliced and really robust in flavor.\n\nCauliflower pig ear thang: one of the best dishes I tried. Thinly shaved cauliflower in the best vinaigrette I've had. Served with deep fried pig ear, which I've never had, but now I'm definitely a fan.\n\nEvery dish we had was 8.5 / 10 or higher. The above items were an 11/10.\n\nNot sure if I'd come again, but it sure left a great impression. The perfect service really polished off the entire experience. Highly, highly recommed.\n\n2 bottles of wine (corking fee) + the 6 dishes and an a la cart desert ended up being about $120 per person x 3 with tip.", "rating": 5, "date": "2015-03-23"}, {"excerpts": ["My boyfriend and I picked the following:\n\nSmoked duck with marinated pioppini mushrooms & dried plum. "], "author": "Christina S.", "review": "I'm writing this review post-Lazy Bear, so the Progress is a little less shiny in my mind, but nevertheless, The Progress is a must try.\n\nThe door is unlabeled, but you know exactly where you are because of the line next door at State Bird. Luckily, reservations aren't too tricky to make at the Progress.\n\nThe restaurant itself is beautiful, all wood and happy voices and a very tight squeeze to get to your table. You're brought a variety of snacks, and it's all well and good and delicious, but not particularly memorable.\n\nYou're given a check list, similar to dim sum, where you can pick 6 dishes to eat family style or 5 dishes and an individual sized dessert. My boyfriend and I picked the following:\n\nSmoked duck with marinated pioppini mushrooms & dried plum. This was very, very good. The plum was sweet, which played well with the smokey sweetness of the duck. \n\nShaved cauliflower-herbs & pig fries. This was good, but not too special. The pig fries had a healthy heaping of pig ear. I don't think I would order this again. \n\nSpiced lamb tartare with various mix-in condiments. This was probably my favorite dish. Really delicious and flavorful, and it came with these delicious, delicate chips that were salty and brought all the flavors together.\n\nPolpette of guinea hen & pork with blood orange & castelvetranos. This was probably my least favorite dish. Thinking back, I can't remember a single thing about this dish that stood out. \n\nTreasure chest of fermented sausage, trout quenelles & pumpkin-rice dumplings in a creamy pork broth. This was so freaking good. I just wanted more of it. The broth was amazing, and I really wanted another pumpkin dumpling, and I definitely wanted more of the trout quenelles. My least favorite element of this dish was the sausage, but that's just personal preference.\n\nThe dessert I chose was the poppyseed angel cake, strawberries, pistachio & marscapone. It was delicious, light, and exactly what I needed to finish off the evening.\n\nThis is a great place to go with a group of friends who have similar tastebuds to you. The alcohol selection is impressive, but it adds up once you've had a few glasses. I highly recommend checking out The Progress.", "rating": 4, "date": "2015-04-09"}, {"excerpts": ["The \"mix in\" condiments is greaaaat and the black sesame rice crackers were perfect for this mix\n\n- Smoked duck -\nSuper strong mushroom taste, just aiiite\n\n- \"Treasure chest\" -\nPumpkin rice dumping has a rice ball consistency, not sure if I taste pumpkin\nFermented sausage tastes stronger than I anticipated, it's fermented after all\nTrout quenelles tastes like typical Asian noodle bowl's fish balls\nCabbage "], "author": "Sandy T.", "review": "FROM THE CHEF\nA plate with six different tasters and these two stood out for me:\n\n- Fried oyster w/ orange aioli -\nThumbs up! Love the twist in using a different citrus. Would definitely get again. \n\n- \"Malaysian jerky with peanuts\" -\n....Uh, you mean grilled pork? Honestly, this is the grilled meat from any Vietnamese vermicelli\n\nOUR SIX DISHES\nThere's a menu you get to bubble in (I feel like I'm in school again haha) the six dishes you want for $65/person\n\n- Spiced lamb tartare -\nDelicious! Don't taste that gaminess of lamb. The \"mix in\" condiments is greaaaat and the black sesame rice crackers were perfect for this mix\n\n- Smoked duck -\nSuper strong mushroom taste, just aiiite\n\n- \"Treasure chest\" -\nPumpkin rice dumping has a rice ball consistency, not sure if I taste pumpkin\nFermented sausage tastes stronger than I anticipated, it's fermented after all\nTrout quenelles tastes like typical Asian noodle bowl's fish balls\nCabbage was very pickled\nBroth is nice but got acidic as I neared the bottom of the bowl\nLoved the bowl it came in though! \n\n- Rabbit+pork w/ castelvetranos -\nThe meat reminded me of meat you get from shwarmas, with an added layer of crisp from the fried outer layer. Was quite good. \nThe \"castelvetranos\" threw me off. It was weird. It tasted tart from the blood orange but savory from being with the rabbit+pork and sweet from the onions? And there's bits of fried potato skin in there? I wasn't sure what was going on but I couldn't eat more than a spoonful.\n\n- Five Dot Ranch beef -\nTasted grilled, which is good. Dish is good overall but nothing mind blowing or super memorable\n\n- Squab -\nCame in five slices, a wing, and a leg that was flipping us off (see photo). I was quite entertained by the long nails on the bird's foot, haha\nThe \"chili paste\" that came with this reminds me of the chili ginger sauce often served with hoi nam chicken\nAlso had cabbage leaves and a lemon slice with spices to piece the dish together. The flavors for this dish is great\n\nDESSERT\n- Elderflower floating island, guava sherbet, Arnold Palmer gelee -\nYum! Enjoyed this very much. It's refreshing without being overly sweet or creamy. Would definitely get again\n\n- Poppyseed cake with rhubarb and mascarpone -\nGood but not as good as the sherbet, that is all. \n\nCOCKTAILS\n- Sunny Jin -\nGin mix and it tastes like juice haha but what do you expect from a gin cocktail? \n\n- The Mezzanine -\nSaw mezcal and my eyes widened! But sadly, the drink is not as stiff as I'd like it. The smoky flavor I enjoy so much is masked too well. So sad. \n\nOverall, a good meal and a great experience. There was just the right amount of interaction between waiter, diner, and the food. The food will be prepped but not ready to eat until the waiter pours the broth or mixes the condiments. The diner would piece together the squab, cabbage, lime and chili paste to enjoy in one bite.\n\nIt's a great dinner but I'm not in a hurry to be back any time soon.", "rating": 4, "date": "2015-03-22"}, {"excerpts": ["Kiwi ricotta  \nSmoked duck\nCauliflower with pig fries\n"], "author": "Vee V.", "review": "Situated across from club Origin and next to Statebird. Still took me a min to find the place/door. No sign.\nPlace was pretty packed on a Wednesday night. I got there at 6:30pm and the only spot available was the corner at the bar area. Next available table was 10pm.\nSo I opt for the bar, luckily my gfs are petit. Servers are accommodating, they let us switched seats around. We each had the Sunny drink with aromatic orange peel: citrus and bubbly.  Yum..\n\nFood wise: plenty of small dishes to choose from the $5 & $10 plates. Everything was fresh. Place got VERY tight an hour into our dining. Literally people pushing up against and around us. Lots of HH goers!\n\nKiwi ricotta  \nSmoked duck\nCauliflower with pig fries\nWild mushroom and kale \nGrilled ranch beef\nLobster\nOctopus\nChocolate ice cream (the BEST of the tasting)\n\n$60 include tax/tip person. Not sure if it's worth to return...I just didn't feel \"wow'", "rating": 4, "date": "2015-03-03"}, {"excerpts": ["Their menu is composed of 12 dishes that seem to change, with the exception of some popular dishes like \"pig fries\" and \"smoked duck.", "\" ", "Although, don't quote me on this because it has only opened for a month or so. ", "Each person at your table is charged at a starting price of $65, with the entire table having the option of choosing 6 dishes. ", "The courses are portioned to match the number of people at your table, which in our case was 4. "], "author": "Jenny Z.", "review": "The Progress is a new sister restaurant, opened by the same owners of State Bird Provisions. In fact, the two are physically, right next door. Whereas SBP is the dim sum service of haute cuisine, The Progress is the banquet counterpart where courses are served family-style for each table.\n\nService was superb. They were attentive to refilling your water, and checking on you throughout the meal. Moreover, the waiters were quite knowledgable about the menu and are able to describe the dishes to you, with detail and opinion. The only downside of the service, at least considering the amount you were paying, was that they do not exchange the dishware often enough between \"courses.\" Although we had at a reservation at 7:30, we were not seated until past 8pm. So, be prepared to wait, even with a reservation. \n\nUnlike SBP, The Progress has a full liquor license, which means cocktails, beer, extensive wine list and a standing bar that opens at 5pm. After a glance, my friend and I decided to go with The Concession (popcorn infused rum, Coca Cola syrup with Vermouth as its base). It was smooth, lingering on the tongue and rich on the taste buds. I loved it. In fact, I would come back just to explore their cocktail menu. \n\nTheir menu is composed of 12 dishes that seem to change, with the exception of some popular dishes like \"pig fries\" and \"smoked duck.\" Although, don't quote me on this because it has only opened for a month or so. Each person at your table is charged at a starting price of $65, with the entire table having the option of choosing 6 dishes. The courses are portioned to match the number of people at your table, which in our case was 4. Keep in mind that you are paying for about $20 per plate, rounding out to about $100pp with a drink or dessert.\n\n1) Shaved romanesco, herbs and pig (ear) fries: very interesting. The pig ears tasted like they were pickled and then deep fried. The combination of salty, briny, fried pig ears paired well with the shaved romanesco and herbs. \n2) Yuzu and olive oil marinated raw tuna with green daikon: This was delicious. The tuna was fresh. However, I wished they did something with the raw daikon and carrots so that they would embody more flavor and pair better. Overall the tuna was good but the other components were lost in this dish. \n3) Curry rabbit & chicken karaage: interesting. It took us a little bit to figure out whether we were eating rabbit or chicken. The chicken and rabbit karaage were placed over a layer of shredded carrots and sautéed black trumpet mushrooms. Overall, the trumpet mushrooms and rabbit were my favorite parts of this dish. The mushrooms were earthy and cooked down to a silky perfection. The rabbit was well cooked, tender and carried a light hint of curry. The chicken was dry, lackluster and left much more to be desired. \n4) Treasure chest of fermented sausage, trout quenelles and pumpkin rice dumpling in a creamy pork broth: my favorite of the 6, mostly because each component was interesting and executed well. I've never had fermented sausage, which tasted almost like the kimchi in the soup. The trout quenelle's had the texture of Chinese fish balls but was much more flavorful. The pumpkin rice dumpling was soft, bouncy and extremely interesting. However, each person only gets one dumpling, which was barely the size of a quarter. The broth was light in taste but rich in texture. \n5) Lamb merquez with yellow eye beans, octopus and crispy squid: this one was good too. Possibly the 2nd contender. The lamb merquez was oversalted and chewy. Despite being the star of the dish, it tasted like slim jims. That said, I especially enjoyed the rest of the dish. The octopus was tender with a hint of smokiness from the grill. The squid was deep fried and the yellow eye beans were buttery and sweet. Overall, this dish came together well, except for the lamb merquez, which got lost in this dish.\n6) Dungeness crab, bok choy and tofu stir fry: it was good but not $20 good. The flavors reminded me a dashi-flavored stir fry agedashi tofu. The dungeness lump crab meat added flavor and luxurious touch to the dish, but that was about it; it was simply mixed in. \n\nMain dishes aside, I really enjoyed the \"banchan plate\" which came with 4 different bite-size banchan. Meager in portion, but very adventurous in interpretation and concept. My favorite was the fancy cheese-it cracker and malaysian style beef jerky.\n\nI appreciate the concept that State Bird Provisions upholds. Unfortunately, The Progress fell short of my expections. I enjoyed it the first time, but probably won't return.The beautiful ambiance couldn't make-up for the price per dish and the quality of it. Each dish recreated asian-fusion flavors, but in the end, the components were not executed as well as I wished. Moreover the construction and fusions of each dish felt disorganized and could have been more thought out. For the same style of food, I would rather return to SPB than The Progress, or save it for Benu", "rating": 3, "date": "2015-01-27"}, {"excerpts": ["They throw in a starter course (amazing) we had dumplings smoked duck (fantastic) roti ( rich and comforting) ", "treasure chest ( you must get this) ", "squab good but not at the level of the other dishes, lamb tartare. ", "OMG everyone went nuts on this one. ", "Flavors galore. ", "Lamb mergez. ", "This was possibly my favorite. ", "Steak. "], "author": "Paul G.", "review": "Having eaten at state bird I knew the food would be good but my guest experience there was not the best. Progress is well progress. Great greetings from a young talented and energetic staff. Great curated cocktails. Extensive wine lust very fairly priced and knowing friendly sommelier who really wants you to have fun. \nThe menu is delectable and tempting. For the tasting you choose six courses. They throw in a starter course (amazing) we had dumplings smoked duck (fantastic) roti ( rich and comforting) treasure chest ( you must get this) squab good but not at the level of the other dishes, lamb tartare. OMG everyone went nuts on this one. Flavors galore. Lamb mergez. This was possibly my favorite. Steak. Great flavor but also not at the level of the other dishes. \n\nBasically I am going to try and get here every six weeks. You should also", "rating": 5, "date": "2015-04-22"}, {"excerpts": ["While everything was derricious, there were a number of notables like the exquisitely soft smoked duck and marinated yellowfoot mushrooms & dried plum.  ", "Meaty, earthy awesomeness with some lovely acidity for balance.  ", "The shaved cauliflower-herbs & pig fries tasted like they were just pulled from the garden hours before "], "author": "Eric F.", "review": "Huge props to Ruobin W. for helping us score a weekend reservation at the awesome new addition from Stuart Brioza & Nicole Krasinski behind the beloved State Bird Provisions.\n\nThe atmosphere is largely reminiscent of SBP with a nice mix of modern and eclectic.  Everything is served family-style with a minimum commitment of 6 courses at $65/person and going up from there depending on your appetite.\n\nWhile everything was derricious, there were a number of notables like the exquisitely soft smoked duck and marinated yellowfoot mushrooms & dried plum.  Meaty, earthy awesomeness with some lovely acidity for balance.  The shaved cauliflower-herbs & pig fries tasted like they were just pulled from the garden hours before and I loved the variety of porcine parts used for the fries to provide a little surprise from piece to piece.\n\nFor the vegetable-inclined, the black butter butternut squash with caramelized onion & swiss chard turned out to be surprisingly hearty in addition to its depth of flavor accentuated by the soft sweetness of the onions.\n\nAnd that aromatic spiced squab with salted chili paste...ri-freaking-diculous!  Anyone familiar with Chinese squab preparations will remember that the birds far more often than not turned out dry and bland.  In this case, the tenderness and moisture upon first bite made us all seriously question if it was real squab.  Cray?  Yes.\n\nThe polpette of rabbit & pork with blood orange was solid though the former component was difficult to discern.  A good mix of savory flavors and citrus acidity.  The lamb merguez with octopus & crispy squid was very nicely cooked, just not particularly standout in its combination.  Lastly, our 'treasure chest' of fermented sausage, trout quenelles & pumpkin-rice dumpling in a 'creamy' pork broth was certainly unique.\n\nAs for sweet offerings, they were all fantastic with the combination of milk chocolate-black lager ice cream, cocoa sable & caraway seed being very much reminiscent of the bird's nest dessert aka crack in a bowl at SBP.  Get it.\n\nService here was good though quite a bit more distant than at SBP where there's so much more interaction with the staff presenting the vast array of plates.  Overall, the food here is top notch and absolutely on par with its big sibling next door.  However, the value has some room for improvement as our meal turned out to be comparable if not more than some 1 star Michelin spots.  Apples to oranges, sure, but still something to bear in mind.", "rating": 4, "date": "2015-03-14"}, {"excerpts": ["- Smoked duck = super tender and complemented by the mushrooms/plums\n", "- Pig fries = awesomely crunchy/not as salty as expected\n", "- Spiced squab ", "= how the hell do they keep it so moist?\n", "- Treasure chest = loved the tonkotsu broth, tasty sausages and mochi\n- All the desserts = perfect set of sweets for every personality. "], "author": "Ruobin W.", "review": "Yeah, this place is so... wow. I definitely enjoyed my experience here, but when I say it's once in a lifetime, I really mean you should just come here once. \n\nThe good: \n- Complimentary appetizers = best spelt I've ever eaten with other treats to whet your appetite.\n- Smoked duck = super tender and complemented by the mushrooms/plums\n- Pig fries = awesomely crunchy/not as salty as expected\n- Spiced squab = how the hell do they keep it so moist?\n- Treasure chest = loved the tonkotsu broth, tasty sausages and mochi\n- All the desserts = perfect set of sweets for every personality. black lager ice cream was amazing, the buddha cake was light and fluffy, and the elderflower island was an amazing mixture of sweet flavors\n- The service = prompt and frequent water filling\n\nThe ok:\n- Lamb merguez = nothing special really, the beans were the best part of this dish\n- Polpettes = unique flavors, but they're really just meatballs\n- Butternut squash = Great squash, but was super salty in my opinion", "rating": 4, "date": "2015-03-12"}, {"excerpts": ["From the current menu, my favorites are: the smoked duck and the beef with miso sauce.\n\n"], "author": "Kristen S.", "review": "It's obvious that these people put a lot of thought into their food...and they take pride in what they do.  The tasting menu is not just delicious, but a feast for your eyes too.  They use beautiful stoneware...love it.\n\nFrom the current menu, my favorites are: the smoked duck and the beef with miso sauce.\n\nCorkage fee is $30 each for the first two bottles.", "rating": 5, "date": "2015-02-23"}, {"excerpts": ["We tried the \nmache with green garlic;  (5)\nsmoked duck with marinated yellowfoot mushrooms & dried plum;  (4)\nshaved califlower-herbs & pig fries lobster bok choy & tofu stir-fry; and (2)\nblack butternut squash with caramelized onion & swiss chard (5)\npoppyseed buddha cake (3)\n\nI did was not that impressed. "], "author": "Vy T.", "review": "We heard about the new no-reservations menu from SF Eater and decided to give it a try. Arrived at 4:50 with a line of more than 8 people ahead of me, most trying to get a reservation but most just wanted to sit at the bar. You can get the bar menu at a great price of $5 or $10/plate. \n\nWe tried the \nmache with green garlic;  (5)\nsmoked duck with marinated yellowfoot mushrooms & dried plum;  (4)\nshaved califlower-herbs & pig fries lobster bok choy & tofu stir-fry; and (2)\nblack butternut squash with caramelized onion & swiss chard (5)\npoppyseed buddha cake (3)\n\nI did was not that impressed. State Bird is definitely the better option. It is pretty cheap for bar food with drinks at $5 or $10, but if you want dinner, elect for the reservation/table and minimum 6 course cause it was $75 for 2 people (food only) and we were still very, very hungry. Don't order the cake- $10 for a ridiculously small piece of what tasted like Safeway cake just softer.\n\nHIGHLY recommend that delicious butternut squash dish. yummy\n\nThe drinks are amazing- the bartenders are really into their drinks and seem like they love the job-the drinks reflect it too.", "rating": 3, "date": "2015-03-14"}, {"excerpts": ["Smoked duck w/ yellowfoot mushrooms-it was different with the mushrooms. "], "author": "Karen H.", "review": "I didn't have high hopes for this place since I didn't love State Bird, but it was really good. I really enjoyed the meal and the atmosphere. \n\n6 courses family style at $65 a person, but if you want more food, additional $10 a course. We didn't do the dessert and got 7 courses because we couldn't decided. The appetizers are defiantly way better than the entrees. \n\nFirst they start you off with a little sample of a bunch of items. (fresh fruit, fish, beef, etc..) It was a tease, but all really delicious. \n\nSmoked duck w/ yellowfoot mushrooms-it was different with the mushrooms. By itself I didn't like the texture, but with the duck it was really yummy. \n\nShaved cauliflower and pig fries-from the Yelpers, I heard this was a must try. I'm so glad I did. This was amazing! Crispy and just full of flavor. This is a dish you have to get.\n\nRaw Black Bass-this was a tartar w/ black chips. My favorite dish of the night. Super fresh and the flavors were just so yummy.\n\nRoti w/ black truffle buttermilk-a bit heavy, but it was so satisfying. I loved this also. Just drooling thinking about it. \n\nFor the main dishes:\n\nLobster, bok choy, and tofu-this was basically a stir fry and being Chinese, it wasn't bad. I liked it, but it wasn't anything special. \n\nSquab-I don't usually eat squab, but I heard it was really good. Super tender, great flavor and you can wrap it in lettuce. I love lettuce wraps. Best entree of the night. \n\nRanch beef w/ mustard-miso oyster sauce-beef was cooked perfectly, but this was the least favorite. It was missing something. The greens didn't really go with it. Can skip this dish for sure. \n\nI would come back and try other things for sure!", "rating": 4, "date": "2015-03-19"}, {"excerpts": ["Second we had the smoked duck with pioppini mushrooms and dried plum. "], "author": "Will L.", "review": "The Progress was pretty darn good. My foodie girlfriend, Christina, and I Ubered from Powell Street and arrived in the Fillmore ahead of schedule. We enjoyed\na nice park nearby with an excellent water fountain.\n\nWe walked to where the restaurant was and had to double check the address. There isn't a sign on the outside. Just this large industrial metal door.\n\nWe were  greeted by the staff and taken to our table. Our main waitress introduced herself and gave us a short and sweet explanation of how the menu works. Which was great for me because I was a little overwhelmed.\n\nLooking through the amazing dishes, Christina and I were hard pressed to make a decision. In the end we chose 5 dishes and two desserts for $65/person.\n\nAfter taking our order, another staff member brought us a beautiful snack tray with 6 different samples. All were unique and thoughtful and make you want more.\n\nI'll describe the dishes in the order they came.\n\nFirst up, the 'Spiced lamb tartare with various 'mix-in' condiments'. The condiments included sprouts, green onion, a nut of some sort, peppers, and more. They served it with a crunchy and salty blue sesame chip.\n\nSecond we had the smoked duck with pioppini mushrooms and dried plum. The duck left a magnificent smokey/sweet flavor in your mouth that was so tasty.\n\nAround the same time she delivered our shaved cauliflower and pig fries. This provided a crispy and salty compliment to the smokey/sweet duck.\n\nAfter our appetizer plates, we had two more coming.\n\nAnother waiter brought us our Treasure chest soup and described the ingredients. He was pretty humble when he described the dish, but he didn't need to be because it was a treasure. The pumpkin-rice dumpling was just sweet enough to mix well with the pork broth. The sausages were complex and a little overpowering at times, but unique. \n\nLast we had guinea hen and pork polpette. This dish was good, but unfortunately it just couldn't compare to the four previous plates.\n\nQuite full, we still had dessert. I had the milk chocolate-black lager ice cream with cocoa sable and caraway seed. It was sweet, chocolaty, crunchy, and just the right size.\n\nThe inside of The Progress is a wonderful view filled with crafted wooden tables and chairs. My one complaint is that it gets a bit noisy. Perhaps something on the walls could dampen the sound.\n\nThe Progress was wonderful. We are looking forward to coming out again when a new menu comes out.", "rating": 5, "date": "2015-04-01"}, {"excerpts": ["Food adventure became a party in the mouth with each of my five favorites: 1) first of the season asparagus with lime pickle yogurt & pistachio, 2) smoked duck with marinated yellow foot mushrooms and dried plum, 3) raw black bass with turnips and creme fraiche, 4) black butter butternut squash with caramelized onion and Swiss chard, and 5) lamb merguez with yellow beans, octopus & crispy squid. ", "So full could not finish the enjoyable lamb merguez dish, we opted for no dessert or after dinner beverages and waddled out. ", "In fact, my stomach still feels full this morning."], "author": "Nancy D.", "review": "Wow! One of the most creative and inventive delish San Francisco food experiences ever. How does the team even conceive these food combinations? Excellent service, space and vibe. Noise level high. \n\nFood adventure became a party in the mouth with each of my five favorites: 1) first of the season asparagus with lime pickle yogurt & pistachio, 2) smoked duck with marinated yellow foot mushrooms and dried plum, 3) raw black bass with turnips and creme fraiche, 4) black butter butternut squash with caramelized onion and Swiss chard, and 5) lamb merguez with yellow beans, octopus & crispy squid. My least favorite: 6) pecorino 'roti' with perigord truffle buttermilk--while the flavors were wonderful, I didn't care for the texture of the 'roti'.\n\nCocktails: Sunny Jim - addictively refreshing! \n\nDiners start off with a surprise eclectic dish of small bites, nice touch! \n\nSo full could not finish the enjoyable lamb merguez dish, we opted for no dessert or after dinner beverages and waddled out. In fact, my stomach still feels full this morning.", "rating": 5, "date": "2015-03-19"}, {"excerpts": ["Nice to have a soup during the meal\n\n- smoked duck with marinated pioppini mushrooms & dried plum "], "author": "Yan K.", "review": "A very pleasant experience at The Progress. We had (in rankings of our favourite to least):\n\n- lamb merguez with yellow eye beans, octopus & crispy squid - a lot of flavor and texture\n\n- raw japanese snapper with turnips & crème fraîche -- light and had a nice wasabi taste, really understated\n\n- aromatic spiced squab with salted chili paste - cooked very well, tender meat which is hard to do!\n\n- shaved cauliflower-herbs & pig fries - I liked this a lot, the fries were not very fried (which I disliked), and a lot of flavor. My boyfriend wasn't a fan as he thought it was too acidic\n\n- 'treasure chest' of fermented sausage, trout quenelles - as Asians, suppose we thought it wasn't too special. The chinese sausage we have all the time (and we didn't even think it was the best type), but the pumpkin mochi was good. Nice to have a soup during the meal\n\n- smoked duck with marinated pioppini mushrooms & dried plum - we both thought not too memorable\n\nWe also ordered a serving of the dessert (poppyseed angel food cake) to share for the two of us, which is what the server recommended. It was fine - we wanted a dessert to round out the meal, but also wasn't super memorable.\n\nService was fast, it took 2 hours for our meal, even though the food came out quickly. Decent value for a high-end restaurant. Portions were adequate, we felt full but not stuffed after the 6.5 courses.", "rating": 4, "date": "2015-04-05"}, {"excerpts": ["Next best was the smoked duck with marinated yellowfoot mushrooms & dried plum. \n\n"], "author": "Mike W.", "review": "The Progress absolutely lived up the hype and met our lofty expectations.  Our service was great,--friendly and attentive. All the dishes were explained when requested and we were given advice on which dished to order so as to not have too much or not enough food.\n\nWe had six dishes, no extras and no dessert.  The best was the lamb merguez with yellow eye beans, octopus & crispy squid. Probably the best dish I have had in the last few years anywhere.  The  different flavors and textures matched perfectly.  An absolute standout dish.  \n\nNext best was the roasted mushrooms & kale with local wakame kraut.  Seemingly so simple but incredibly flavorful.\n\nNext best was the shaved cauliflower-herbs & pig fries, pretty fantastic as well.\n\nNext best was the smoked duck with marinated yellowfoot mushrooms & dried plum. \n\nThe only dish that disappointed for us was the grilled Five Dot Ranch beef with mustard-miso oyster sauce.  Something about this just didn't gel and for us it was fairly bland.  So overall 5 of 6 dishes were very good to excellent, with the top three above being pretty fantastic.  \n\nOnly tried one cocktail, the Paloma, which was well balanced.  \n\nThe Progress is definitely worth another visit as six dishes leaves many things untasted.  Highly recommend this place.", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["Smoked duck just tasted like ham. ", "Super small portion. "], "author": "Christina S.", "review": "If State Bird didn't exist, I'd give Progress a better review but alas I've been spoiled. Roti was yummy but you can't go wrong with fried carbs and cheese. Smoked duck just tasted like ham. Super small portion. Lamb merguez (sausage) was a winner. State Bird quality there. Cane with octopus which was cooked perfectly. Liked sitting in the nook in the bar area but it got really loud. $30 corkage fee! Come on now. $70 bill and left hungry. I'll stick to State Bird.", "rating": 2, "date": "2015-03-29"}, {"excerpts": ["The food was pretty good, our favorites were the steak tartare, the sunchoke roti, and the tea smoked duck fried rice. ", "The size of each plate, for 5 people to share, was really quite small. ", "(Who decides how much 5 people can eat??! )", "When it was time for dessert, they were individual sized plates. ", "They were actually really small and cost $10 a piece. ", "We left hungry by the end of the meal, feeling that the whole experienced was overpriced, almost $500 after a few cocktails, a beer, a coffee, 3 desserts, and tax was added to the meal. ", "One more thing, the seating is SO uncomfortable, solid wood chairs and benches for the booths. ", "Our behinds were asleep by the end of the meal. ", "Certainly will not be making a special trip to the city again to dine here."], "author": "Andrea D.", "review": "Excited to dine here as we really enjoyed our experience at Statebird Provisions. The menu setup was confusing and required a lot of explanation from our server. $60 a person and you get to choose 4 dishes, that's it. The size of the dishes depends on the amount of people eating at the table. We had 5 people at the table. The small plates at the beginning came out before we even received the drinks we ordered. The food was pretty good, our favorites were the steak tartare, the sunchoke roti, and the tea smoked duck fried rice. The size of each plate, for 5 people to share, was really quite small. (Who decides how much 5 people can eat??! )When it was time for dessert, they were individual sized plates. They were actually really small and cost $10 a piece. We left hungry by the end of the meal, feeling that the whole experienced was overpriced, almost $500 after a few cocktails, a beer, a coffee, 3 desserts, and tax was added to the meal. One more thing, the seating is SO uncomfortable, solid wood chairs and benches for the booths. Our behinds were asleep by the end of the meal. Certainly will not be making a special trip to the city again to dine here.", "rating": 2, "date": "2016-02-12"}], "shaved cauliflowerherbs  pig fries": [], "spiced lamb tartare": [{"excerpts": ["- spot prawn - was so delicious\n\n- shaved cauliflower-herbs & pig fries\n\n- spiced lamb tartare - I had this dish 3 times now, and loving it each time more.\n\n"], "author": "Manda Bear B.", "review": "********************* 1275 **********************\n\n    New American restaurant The Progress serving inventive, family-style meals, farm-to-table with freshest ingredients, from the same kitchen as the State Bird Provisions team Michelin Starred Chef-owners Stuart Brioza and Nicole Krasinski. \n\n    I love the beautiful airy high ceiling that arches overhead, and the beautiful wood work on the wall, intensive labor work put into this beautiful, modern, but rustic The Progress. A large bar area with more than 20 seats, so without reservation, it's not a bad thing. The last few times I was here around 5:15 week nights, I got in. \n\n    The 90-seat dining room with a few more tables on the second level, usually fill up by 6 PM, and it's jam packed every night just like its sister State Bird Provisions next door. \n\n    The Progress serves bar menu and full dinner menu at the bar, so it's such a great option for diner like me CANNOT get any reservation from both restaurants :-) It's not a complain, in fact it makes me more excited and a little adrenaline rush with the thought that I couldn't get any seat even at the bar, haha. That was how I feel about last night dinner with my best friend in town. \n\n   Luckily chef Stuart Brioza was in, what a treat for my best friend and my visiting somm friend from NYC. \n\n   Love the concept of 6 dishes for $65 per person, and each additional dish for $10, plenty of delicious food to share, reasonable price point, great concept and execution. \n\n- spot prawn - was so delicious\n\n- shaved cauliflower-herbs & pig fries\n\n- spiced lamb tartare - I had this dish 3 times now, and loving it each time more.\n\n- raw japanese snapper - beautifully presented as good as it looks.\n\n- porcini & mt. tam dumpling with nettle salsa verde - newest dish in APR 2015, refreshing.\n\n- pecorino 'roti' with perigord truffle buttermilk - a MUST TRY\n\n- roasted mushrooms & kale with local wakame kraut - I had this dish 3 times and will continue order it as long as it's on the menu, a great choice for vegetarian.\n\n- butter clams on the half shell with kimchi piccata & shungiku\n\n- Spanish  barnacles - it was so delicious and I came back last night, it was gone!  \n\n- black butter butternut squash with caramelized onion & swiss chard\n\n- polpette of guinea hen & pork with blood orange & castelvetranos - another FAV dish of mine. \n\n- lamb merguez with yellow eye beans, octopus & crispy squid - my 3rd time with this dish, highly recommend \n\n- maitake, tofu curry & bok choy 'stir fry' with smoked black cod ponzu - reminds me of Chinese cuisine.\n\n- aromatic spiced squab with salted chili paste - reminds me of a Vietnamese dish that I had when I was growing up. It got the 5 spice flavor, the meat was so tender, delicious, I forgot when was the last time the squab could taste that good.\n\n- grilled Five Dot Ranch beef with mustard-miso oyster sauce - this was the only dish that wasn't my style :-) but my friends love it! I prefer my beef/steak with less sauce on it. \n\n    The cocktail list is also good. I presonally enjoyed the Paloma (reposado tequila, pomelo, lime, sugar, madras curry tincture) recommended by our server Kelly.\n\n  The wine list was delicious by Sommerlier Jason Alexander, if you are a wine lover, collector, or a somm, you would enjoy this list tremendously. He offers wines of the world, beautiful white Burgundy, the grower Champagnes, Rieslings, and plenty of French, Italian and Spanish red for under $70 bottles! And if you are a collector, check out the Cellar Selection, I'm in love! \n\n    The service by Eric last time at the dining room was excellent. The last 2 times at the bar was equally fantastic, attentive, caring, and purely enjoyable for us. \n\n    I'm looking forward to my next visit to explore the ever evolving menu daily and the wine list to pair with it. \n\n    Again, congratulations The Progress, San Francisco for being Jame Beards Foundation Award Semifinalists 2015, and I'm sure many accolades to come. \n\nNOTE: no valet parking, come at 5 PM on week night, you will surely get in at the bar!", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["The first 4 dishes below are the ones that really, really blew my mind:\n\n+ First, we had the spiced lamb tartare with various \"mix-in\" condiments. "], "author": "Cynthia L.", "review": "They serve a 6- course tasting menu for $65 per person (really, really good price).\n\nBut. It's served \"family- style.\" And YOU get to pick your entire meal.\n\nKinda cool. Right?\n\nHere's how dinner went down: We walk in & the vibe is on-point. Chill music is playing in the background, we are immediately greeted and taken to our table, the servers are dressed in casual attire (ie: jeans and flannel), and the ambiance was super cool. For a meal of this caliber, you would think it'd be somewhat pretentious with people walking around in suit and ties- it wasn't.\n\nFrom start to finish, our entire 2 hr experience was very laid back & professional at the same time. It was perfect.\n\nOh, and did I forget to mention that it's FUN!! Like even if you come here with boring Betty, you'll still have a good time.\n\nAs soon as we sat down, we were given a menu and a #2 pencil. Out of 17 items, we got to choose 6 courses for the entire table (with option to add more as you like).\n\nWhile we were deciding on what to get, a sampler platter of TINY bites came to the table (to be eaten with a toothpick).\n\nEverything was so damn delicious- it setup the rest of the meal perfectly. Basically, it got you excited for everything else to come.\n\nShortly after, our plates came out one by one (and since their menu changes all the time, I won't bore you guys with every detail in every single dish).\n\nThe first 4 dishes below are the ones that really, really blew my mind:\n\n+ First, we had the spiced lamb tartare with various \"mix-in\" condiments. The condiments included sprouts, sesame seeds, toasted pumpkin seeds, egg yolk bottarga, bronze fennel fronds, pickled kohlrabi strips and green onions. They served it with crunchy/salty black rice crackers.\n\nUhm, how on earth do they make these black rice crackers? Anyone??!!?!?!!\n\n+ Next, was the shaved cauliflower herbs & pig fries. If this is still on the menu, it's MUST GET. It was the perfect balance between flavors and textures- crispy, salty, crunchy and spicy. The herbs tasted like they were just pulled from the garden hours before.\n\n+ Third, we had the pecorino 'roti' with perigord truffle buttermilk.\n\nWhen it came to the table, everyone just looked at each other like, 'THAT'S IT?'\n\nBut from the very first bite to the last, we couldn't have enough of it. In fact, I'm still raving about it today to my friends: \"GUYS, I JUST HAD THE BEST ROTI EVER!\" (real life).\n\nSo even the simplest sounding menu item, was one of the biggest surprises. It was executed very well, and the truffle buttermilk was orgasmic. You gotta get it.\n\n+ OMG. This squab. I didn't even know what squab was until now. Every bite was tender with juicy flavors that can't be described. The closest thing I can think of is the quail at Cockscomb but this is even BETTER.\n\nThe feet on the legs were a little freaky. Just ignore it.\n\nTo sum it all up:\n\nThis is a place where you get to experience some of the best culinary dishes that SF has to offer, without breaking the bank.\n\nAt The Progress, you know you will be getting an amazing meal & dining experience without sitting through a boring, pretentious 3 hour Michelin meal.\n\nChefs Stuart Brioza and Nicole Krasinski has been changing the game since they opened State Bird Provisions, offering small tapas in a dim sum cart format. For those of you who don't know, it's one of the most highly talked about restaurants EVER. And they've won a ton of awards... no big deal.\n\nSo. You can see why The Progress has been the talk of the town since they opened. And trust me, they definitely live up to the hype.\n\nGot any special occasions, bdays or anniversaries coming up?\n\nBecause if I were you, I'd totally make a ressie ASAP (before it becomes impossible). Do it now, and you'll thank me later!\n\nMore pics and deets here: http://cyneats.com/the-progress-sf/", "rating": 5, "date": "2015-04-13"}, {"excerpts": ["Spiced lamb tartare with various mix-in condiments. ", "This was probably my favorite dish. "], "author": "Christina S.", "review": "I'm writing this review post-Lazy Bear, so the Progress is a little less shiny in my mind, but nevertheless, The Progress is a must try.\n\nThe door is unlabeled, but you know exactly where you are because of the line next door at State Bird. Luckily, reservations aren't too tricky to make at the Progress.\n\nThe restaurant itself is beautiful, all wood and happy voices and a very tight squeeze to get to your table. You're brought a variety of snacks, and it's all well and good and delicious, but not particularly memorable.\n\nYou're given a check list, similar to dim sum, where you can pick 6 dishes to eat family style or 5 dishes and an individual sized dessert. My boyfriend and I picked the following:\n\nSmoked duck with marinated pioppini mushrooms & dried plum. This was very, very good. The plum was sweet, which played well with the smokey sweetness of the duck. \n\nShaved cauliflower-herbs & pig fries. This was good, but not too special. The pig fries had a healthy heaping of pig ear. I don't think I would order this again. \n\nSpiced lamb tartare with various mix-in condiments. This was probably my favorite dish. Really delicious and flavorful, and it came with these delicious, delicate chips that were salty and brought all the flavors together.\n\nPolpette of guinea hen & pork with blood orange & castelvetranos. This was probably my least favorite dish. Thinking back, I can't remember a single thing about this dish that stood out. \n\nTreasure chest of fermented sausage, trout quenelles & pumpkin-rice dumplings in a creamy pork broth. This was so freaking good. I just wanted more of it. The broth was amazing, and I really wanted another pumpkin dumpling, and I definitely wanted more of the trout quenelles. My least favorite element of this dish was the sausage, but that's just personal preference.\n\nThe dessert I chose was the poppyseed angel cake, strawberries, pistachio & marscapone. It was delicious, light, and exactly what I needed to finish off the evening.\n\nThis is a great place to go with a group of friends who have similar tastebuds to you. The alcohol selection is impressive, but it adds up once you've had a few glasses. I highly recommend checking out The Progress.", "rating": 4, "date": "2015-04-09"}, {"excerpts": ["(I feel like I'm in school again haha) the six dishes you want for $65/person\n\n- Spiced lamb tartare -\nDelicious! "], "author": "Sandy T.", "review": "FROM THE CHEF\nA plate with six different tasters and these two stood out for me:\n\n- Fried oyster w/ orange aioli -\nThumbs up! Love the twist in using a different citrus. Would definitely get again. \n\n- \"Malaysian jerky with peanuts\" -\n....Uh, you mean grilled pork? Honestly, this is the grilled meat from any Vietnamese vermicelli\n\nOUR SIX DISHES\nThere's a menu you get to bubble in (I feel like I'm in school again haha) the six dishes you want for $65/person\n\n- Spiced lamb tartare -\nDelicious! Don't taste that gaminess of lamb. The \"mix in\" condiments is greaaaat and the black sesame rice crackers were perfect for this mix\n\n- Smoked duck -\nSuper strong mushroom taste, just aiiite\n\n- \"Treasure chest\" -\nPumpkin rice dumping has a rice ball consistency, not sure if I taste pumpkin\nFermented sausage tastes stronger than I anticipated, it's fermented after all\nTrout quenelles tastes like typical Asian noodle bowl's fish balls\nCabbage was very pickled\nBroth is nice but got acidic as I neared the bottom of the bowl\nLoved the bowl it came in though! \n\n- Rabbit+pork w/ castelvetranos -\nThe meat reminded me of meat you get from shwarmas, with an added layer of crisp from the fried outer layer. Was quite good. \nThe \"castelvetranos\" threw me off. It was weird. It tasted tart from the blood orange but savory from being with the rabbit+pork and sweet from the onions? And there's bits of fried potato skin in there? I wasn't sure what was going on but I couldn't eat more than a spoonful.\n\n- Five Dot Ranch beef -\nTasted grilled, which is good. Dish is good overall but nothing mind blowing or super memorable\n\n- Squab -\nCame in five slices, a wing, and a leg that was flipping us off (see photo). I was quite entertained by the long nails on the bird's foot, haha\nThe \"chili paste\" that came with this reminds me of the chili ginger sauce often served with hoi nam chicken\nAlso had cabbage leaves and a lemon slice with spices to piece the dish together. The flavors for this dish is great\n\nDESSERT\n- Elderflower floating island, guava sherbet, Arnold Palmer gelee -\nYum! Enjoyed this very much. It's refreshing without being overly sweet or creamy. Would definitely get again\n\n- Poppyseed cake with rhubarb and mascarpone -\nGood but not as good as the sherbet, that is all. \n\nCOCKTAILS\n- Sunny Jin -\nGin mix and it tastes like juice haha but what do you expect from a gin cocktail? \n\n- The Mezzanine -\nSaw mezcal and my eyes widened! But sadly, the drink is not as stiff as I'd like it. The smoky flavor I enjoy so much is masked too well. So sad. \n\nOverall, a good meal and a great experience. There was just the right amount of interaction between waiter, diner, and the food. The food will be prepped but not ready to eat until the waiter pours the broth or mixes the condiments. The diner would piece together the squab, cabbage, lime and chili paste to enjoy in one bite.\n\nIt's a great dinner but I'm not in a hurry to be back any time soon.", "rating": 4, "date": "2015-03-22"}, {"excerpts": ["First up, the 'Spiced lamb tartare with various 'mix-in' condiments'. ", "The condiments included sprouts, green onion, a nut of some sort, peppers, and more. "], "author": "Will L.", "review": "The Progress was pretty darn good. My foodie girlfriend, Christina, and I Ubered from Powell Street and arrived in the Fillmore ahead of schedule. We enjoyed\na nice park nearby with an excellent water fountain.\n\nWe walked to where the restaurant was and had to double check the address. There isn't a sign on the outside. Just this large industrial metal door.\n\nWe were  greeted by the staff and taken to our table. Our main waitress introduced herself and gave us a short and sweet explanation of how the menu works. Which was great for me because I was a little overwhelmed.\n\nLooking through the amazing dishes, Christina and I were hard pressed to make a decision. In the end we chose 5 dishes and two desserts for $65/person.\n\nAfter taking our order, another staff member brought us a beautiful snack tray with 6 different samples. All were unique and thoughtful and make you want more.\n\nI'll describe the dishes in the order they came.\n\nFirst up, the 'Spiced lamb tartare with various 'mix-in' condiments'. The condiments included sprouts, green onion, a nut of some sort, peppers, and more. They served it with a crunchy and salty blue sesame chip.\n\nSecond we had the smoked duck with pioppini mushrooms and dried plum. The duck left a magnificent smokey/sweet flavor in your mouth that was so tasty.\n\nAround the same time she delivered our shaved cauliflower and pig fries. This provided a crispy and salty compliment to the smokey/sweet duck.\n\nAfter our appetizer plates, we had two more coming.\n\nAnother waiter brought us our Treasure chest soup and described the ingredients. He was pretty humble when he described the dish, but he didn't need to be because it was a treasure. The pumpkin-rice dumpling was just sweet enough to mix well with the pork broth. The sausages were complex and a little overpowering at times, but unique. \n\nLast we had guinea hen and pork polpette. This dish was good, but unfortunately it just couldn't compare to the four previous plates.\n\nQuite full, we still had dessert. I had the milk chocolate-black lager ice cream with cocoa sable and caraway seed. It was sweet, chocolaty, crunchy, and just the right size.\n\nThe inside of The Progress is a wonderful view filled with crafted wooden tables and chairs. My one complaint is that it gets a bit noisy. Perhaps something on the walls could dampen the sound.\n\nThe Progress was wonderful. We are looking forward to coming out again when a new menu comes out.", "rating": 5, "date": "2015-04-01"}], "raw japanese snapper": [{"excerpts": ["Here's what we ordered:\n\nComplimentary \"Banchan\" --  http://bit.ly/1FnBuQb \n\nRaw Japanese Snapper with Turnips & Crème Fraîche -- http://bit.ly/1HVWSJL \n\nSmoked Duck with Marinated Pioppini Mushrooms & Dried Plum --  http://bit.ly/1yZ5FFK\n\nShaved Cauliflower-herbs & Pig Fries --  ", "My faves were definitely the Smoked Duck which was similar to the duck I had back at State Bird minus the pancakes, the Pig Fries because of their sheer fried pork awesomeness,  and surprisingly, the Lamb Merguez with Octopus and Squid, simply because I'm not into lamb that much.  ", "But somehow they found a way to bring that dish all together and "], "author": "Rodney H.", "review": "Since I'm huge fan of State Bird Provisions, it was only a matter of time before I would finally have dinner at their sister restaurant, The Progress.  I just had to wait a couple of months for the hype to die down a little bit.  Surprisingly, it wasn't as difficult to land a reservation here than for State Bird.\n\nWhen you walk in, it's a much more grander scale than State Bird.  The decor is warm and looks a lot brighter.  Plus they have two upper balconies for dining.  The big difference with The Progress is that they have a full cocktail bar here with tables so you can dine at the bar as well.\n\nThe food menu is completely different and can hold it's own against State Bird.  Where State Bird is more of a dim sum and tapas style restaurant, the Progress has a more family style dining approach with a 6-course dinner.  While the experience is still similar, the food portions here are larger.  I dined here with a couple friends so sharing each dish between the three of us was pretty easy to do.  The only thing that did take a while was for us to decide which 6 dishes to pick for our dinner.\n\nHere's what we ordered:\n\nComplimentary \"Banchan\" --  http://bit.ly/1FnBuQb \n\nRaw Japanese Snapper with Turnips & Crème Fraîche -- http://bit.ly/1HVWSJL \n\nSmoked Duck with Marinated Pioppini Mushrooms & Dried Plum --  http://bit.ly/1yZ5FFK\n\nShaved Cauliflower-herbs & Pig Fries --  http://bit.ly/1yZ6zC7\n\nAromatic Spiced Squab with Salted Chili Paste -- http://bit.ly/1HW03kN \n\nLamb Merguez with Yellow Eye Beans, Octopus & Crispy Squid --  http://bit.ly/1HW1iAu\n\nDessert Assortment --  http://bit.ly/1DNhNkO\ndessert choose 1 per person\nlemongrass floating island, rhubarb sorbet & coconut-ginger gelée\npoppyseed angel cake, strawberries, sicilian pistachio & mascarpone\ndates à la mode, St. George NOLA, hazelnuts & chocolate\n\nSo much food!  And we enjoyed pretty much everything we ordered.  My faves were definitely the Smoked Duck which was similar to the duck I had back at State Bird minus the pancakes, the Pig Fries because of their sheer fried pork awesomeness,  and surprisingly, the Lamb Merguez with Octopus and Squid, simply because I'm not into lamb that much.  But somehow they found a way to bring that dish all together and the Lamb Merguez didn't have an overpowering lamb taste.  The dessert assortment, while good, was a little bit of a let down in comparison to State Bird's dessert offerings.  I might end up skipping dessert next time since it's optional.\n\nJust recently, they changed the food menu at the bar.  Though it's still a la carte, the portions are more tapas sized like State Bird and at more affordable prices.  So basically, you can get a \"State Bird\" experience at the bar.\n\nIs The Progress better than State Bird?  It's pretty close,  Food-wise they're almost equally impressive, but I still prefer the whole \"dim sum\" experience at State Bird to be more entertaining.   Nonetheless, The Progress is an amazing follow up from the State Bird Provisions team and I wouldn't hesitate to go back again to try their other dishes, just like I would with State Bird.", "rating": 5, "date": "2015-09-30"}, {"excerpts": ["There was only my squid allergy, but she forgot to mention that the crackers that came with the Raw japanese snapper were squid ink. ", "* Raw japanese snapper w/ turnips & creme fraiche - 3.5 stars\npic: ", "http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=-ERLt2bR6iDzRGVEu-kD6Q\nrice crackers (squid ink cracker replacement): ", "http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=q0n6FfQTgoLNcd-5zHGDyg\nReally fresh, high quality. ", "The chips were really great - a light flaky texture, pretty crisp. "], "author": "Ziyan C.", "review": "Dinner here was excellent; we ate everything down to the last bite. Everyone on the reservation has to be there to be sat since it's a family-style meal w/ servings sized for the whole table. \n\nTHE WAIT: I got a 7:30pm reservation on a Thursday night exactly a month in advance. \n\nWe waited 45 minutes for table; the hostess had a free plate of tempura cauliflower made for us while we were at the bar. \n\nTHE SERVICE: Great. Our server was very friendly. She was careful to ask about allergies. There was only my squid allergy, but she forgot to mention that the crackers that came with the Raw japanese snapper were squid ink. She felt very bad about it. \n\nTHE COST: $91 total per person (meal for 4, plus 1 cocktail). \n\nMUST-HAVES: Pig fries, 'Treasure chest', Dates a la Mode.\n\n* Complimentary tempura cauliflower - 4 stars\npic: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=zaZ09BmC49cg9f55kUsFhw\nGreat soft crunch, very very tasty sauce! \n\nAMUSE-BOUCHE: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=lSRodiWiOKTt937dWj7mlQ\n* Cracker w/ fava bean hummus - 3 stars\nThe cracker was quite dry, but the hummus had texture & was tasty.\n* Gigante bean - 2.5 stars\nA little overcooked, not much flavor.\n* Curried mandarin - 2.5 stars\nThe curry was to subtle!\n* Strawberry w/ sesame hummus - 4 stars\nOne of my faves. The sesame hummus was great, like a lighter tahini with toasted hints. My friends thought it was an odd pairing w/ the strawberry, but I thought it worked. \n* Tempura mussel w/ blood orange aioli - 3.5 stars\nThe mussel was great, but I thought the sour flavor in the aioli was a bit odd.\n* Mongolian beef jerky w/ peanuts - 4 stars\nOverwhelmingly the favorite. Great flavor, really like a beef jerky, but actually soft tender meat!\n\nMAIN MENU: \n* Raw japanese snapper w/ turnips & creme fraiche - 3.5 stars\npic: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=-ERLt2bR6iDzRGVEu-kD6Q\nrice crackers (squid ink cracker replacement): http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=q0n6FfQTgoLNcd-5zHGDyg\nReally fresh, high quality. The chips were really great - a light flaky texture, pretty crisp. It would have been too tart without the creme fraiche, but that one component really tied everything together in one bite!\n\n* Shave cauliflower-herbs & pig fries - 4.5 stars\npic: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=ElJOAgWVvuxdcI1A8zl2QQ\nDoesn't look to impressive, but the deep fried pig ears: wow! They were super crunchy & packed full of flavor. Everyone loved this.\n\n* 'Treasure chest' of fermented sausage, trout quenelles & sweet onion-rice dumpling in a 'creamy' pork broth - 4.5 stars\npic: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=KG0jTXChYGLMqG9aWtE5hw\nI was surprised by how great this was! This had intense savory flavors. The sausage was fantastic, soft & rich in texture. The crunch of the slices of fresh sugar snap peas were a perfect addition. \n\n* 'Everything' roti w/ smoked onions & pickled squash - 4 stars\npic: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=nyZVve-XX-FSbCRDDVwKhQ\nThey should've brought this out before the Treasure Chest as it was more like an appetizer & didn't have as rich or complex flavors. My friends didn't love the roti for these reasons, but I thought that for a traditional roti. this was incredibly complex! It had a rich mix of seasonings & a strong hint of sesame. There were fresh ingredients that added crunch & unique flavors.\n\n* Polpette of rabbit & pork w/ blood orange & castelvetranos - 4 stars\npic: \nAnother fantastic one. The meatballs were soft & flavorful, but the texture was a bit homogeneous. I think it was strawberries rather than blood orange, but that fruit was super ripe, juicy, & sweet, & was amazing in a bite with the meat!\n\nDESSERT\n* Lemon verbena floating island, blueberry-strawberry sorbet - 4 stars\ncream: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=8OnnNcFcWiUtUiDB340c-w\nsorbet: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=IPKgSqZA9gPR3R0n8-GOhg\nEach part would not have worked on its own, the floating island being too rich & the sorbet way too tart. They come together nicely. There were savory hints somewhere in there too!\n\n* Sesame & almond tart w/ houjicha cream, kumquats, & cherries - 3 stars\npic: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=24-BURckfaaj7v5DresQtQ\nOverall the least favorite. The tart had a strange crumbly, dry texture that we didn't love.\n\n* Dates a la mode, St. George NOLA, hazelnuts & chocolate - 4.5 stars\npic: http://www.yelp.com/biz_photos/the-progress-san-francisco-2?select=v5S5vnLxys8ow_4iIAU3XQ\nNo one expected to like this, but it was everyone's favorite! The dates were warm, super soft, & had this thick, rich & soft chocolate inside. We loved the \"super vanilla\" ice cream soaked in the hazel & NOLA too.", "rating": 4, "date": "2015-05-27"}, {"excerpts": ["* raw japanese snapper with turnips and creme fraiche (light and refreshing)\n"], "author": "Dawne L.", "review": "Finally went on a long-overdue date night with the hubby, and we're glad we spent it here at The Progress.  It's right next to its sister restaurant, State Bird Provisions, with the same unassuming facade.  Once you step in, you're whisked away into married chefs Stuart Brioza's and Nicole Krasinski's world -- and we're fortunate transients to enjoy it!\n\nSERVICE:\nThe staff was very accommodating from start to finish. We didn't have any reservations, but their friendly host was able to seat us promptly. Every member of the staff who served us -- from the sommelier to dining room attendants -- were top-notch.  \n\nLOCATION:\nThe modern industrial look of the dining room was hip and haute.  Everything was well thought of, including the swanky bathrooms wrapped in gold wallpaper and linoleum.  Loved the open space and open kitchen, which made up for the tight bar seating.  \n\nFOOD:\nLove their take on \"family-style\" dining, which allowed us to try 6 spectacular dishes from their innovative menu.  We started with an appetizer platter compliments of the chef (I couldn't call it an \"amuse bouche\" because it was hefty!), then our dishes were served in 3 waves.  We chose 3 from the top \"lighter\" menu, and 3 \"heavy\" dishes, and were pretty satisfied and full at the end of it:\n\n* pig fries with shaved cauliflower and herbs (the clear standout of the meal!)\n* pecorino roti with perigold truffle buttermilk (fluffy and delicious!)\n* raw japanese snapper with turnips and creme fraiche (light and refreshing)\n* lamb merguez with octopus and crispy squid (a hearty and delightful stew)\n* lobster with bokchoy and tofu (stir-fried and seasoned perfectly)\n* spiced squab with chili paste (crispy skin and tender succulent meat!)\n\n\nWe expected nothing less from the James Beard honorees, and at $65 per person, this was a very satisfying 5* meal.  If you're not up for a big dinner, you can also try smaller versions of their dishes a la carte at the bar.  Their menu changes seasonally, so we'll definitely be back!", "rating": 5, "date": "2015-03-07"}, {"excerpts": ["- raw japanese snapper - beautifully presented as good as it looks.\n\n"], "author": "Manda Bear B.", "review": "********************* 1275 **********************\n\n    New American restaurant The Progress serving inventive, family-style meals, farm-to-table with freshest ingredients, from the same kitchen as the State Bird Provisions team Michelin Starred Chef-owners Stuart Brioza and Nicole Krasinski. \n\n    I love the beautiful airy high ceiling that arches overhead, and the beautiful wood work on the wall, intensive labor work put into this beautiful, modern, but rustic The Progress. A large bar area with more than 20 seats, so without reservation, it's not a bad thing. The last few times I was here around 5:15 week nights, I got in. \n\n    The 90-seat dining room with a few more tables on the second level, usually fill up by 6 PM, and it's jam packed every night just like its sister State Bird Provisions next door. \n\n    The Progress serves bar menu and full dinner menu at the bar, so it's such a great option for diner like me CANNOT get any reservation from both restaurants :-) It's not a complain, in fact it makes me more excited and a little adrenaline rush with the thought that I couldn't get any seat even at the bar, haha. That was how I feel about last night dinner with my best friend in town. \n\n   Luckily chef Stuart Brioza was in, what a treat for my best friend and my visiting somm friend from NYC. \n\n   Love the concept of 6 dishes for $65 per person, and each additional dish for $10, plenty of delicious food to share, reasonable price point, great concept and execution. \n\n- spot prawn - was so delicious\n\n- shaved cauliflower-herbs & pig fries\n\n- spiced lamb tartare - I had this dish 3 times now, and loving it each time more.\n\n- raw japanese snapper - beautifully presented as good as it looks.\n\n- porcini & mt. tam dumpling with nettle salsa verde - newest dish in APR 2015, refreshing.\n\n- pecorino 'roti' with perigord truffle buttermilk - a MUST TRY\n\n- roasted mushrooms & kale with local wakame kraut - I had this dish 3 times and will continue order it as long as it's on the menu, a great choice for vegetarian.\n\n- butter clams on the half shell with kimchi piccata & shungiku\n\n- Spanish  barnacles - it was so delicious and I came back last night, it was gone!  \n\n- black butter butternut squash with caramelized onion & swiss chard\n\n- polpette of guinea hen & pork with blood orange & castelvetranos - another FAV dish of mine. \n\n- lamb merguez with yellow eye beans, octopus & crispy squid - my 3rd time with this dish, highly recommend \n\n- maitake, tofu curry & bok choy 'stir fry' with smoked black cod ponzu - reminds me of Chinese cuisine.\n\n- aromatic spiced squab with salted chili paste - reminds me of a Vietnamese dish that I had when I was growing up. It got the 5 spice flavor, the meat was so tender, delicious, I forgot when was the last time the squab could taste that good.\n\n- grilled Five Dot Ranch beef with mustard-miso oyster sauce - this was the only dish that wasn't my style :-) but my friends love it! I prefer my beef/steak with less sauce on it. \n\n    The cocktail list is also good. I presonally enjoyed the Paloma (reposado tequila, pomelo, lime, sugar, madras curry tincture) recommended by our server Kelly.\n\n  The wine list was delicious by Sommerlier Jason Alexander, if you are a wine lover, collector, or a somm, you would enjoy this list tremendously. He offers wines of the world, beautiful white Burgundy, the grower Champagnes, Rieslings, and plenty of French, Italian and Spanish red for under $70 bottles! And if you are a collector, check out the Cellar Selection, I'm in love! \n\n    The service by Eric last time at the dining room was excellent. The last 2 times at the bar was equally fantastic, attentive, caring, and purely enjoyable for us. \n\n    I'm looking forward to my next visit to explore the ever evolving menu daily and the wine list to pair with it. \n\n    Again, congratulations The Progress, San Francisco for being Jame Beards Foundation Award Semifinalists 2015, and I'm sure many accolades to come. \n\nNOTE: no valet parking, come at 5 PM on week night, you will surely get in at the bar!", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["The raw Japanese snapper was very light and refreshing. ", "The lobster, bok choy & tofu stir-fry tasted like a more sophisticated version of what you would get at an asian wedding banquet. ", "The spiced squab with salted chili paste tasted like duck to me and was pretty good. ", "All in all, I wasn't super impressed with any dish, but I enjoyed the adventurousness and uniqueness of the meal. ", "Service was also great - would come back again to try new dishes!"], "author": "Chinh T.", "review": "I like the concept of the restaurant and enjoy having a variety of family style entrees to choose from. The high ceilings, upbeat atmosphere, and modern decor made it feel super chic, although the crowd when I went was a little older than expected (think mid 40s?). \n\nI was dining with 3 other girls and we all had different opinions on the dishes - my least favorite was the \"treasure chest\" of fermented sausage, probably because I didn't like how fermented the sausages were. The raw Japanese snapper was very light and refreshing. The lobster, bok choy & tofu stir-fry tasted like a more sophisticated version of what you would get at an asian wedding banquet. The spiced squab with salted chili paste tasted like duck to me and was pretty good. All in all, I wasn't super impressed with any dish, but I enjoyed the adventurousness and uniqueness of the meal. Service was also great - would come back again to try new dishes!", "rating": 4, "date": "2015-05-29"}, {"excerpts": ["The MENU - outstanding!\nasparagus with lime pickle yogurt & pistachio\nraw japanese snapper with turnips & crème fraîche\nsmoked & grilled artichokes with quinoa & shaved pig's head\n'treasure chest' of fermented sausage, "], "author": "Veronica O.", "review": "Amazing!! from unique delicious dishes to excellent service.  WOW!!!\nOn our last night in SanFran last week, by my Honey's Dad's choice, we were stunned how cool, contemporary and chic this place.  We were greeted with friendly hostess and welcome and served by a very friendly and knowledgeable server.  From the beginning 'till the end of our dinner was a memorable experience. \n\nThe MENU - outstanding!\nasparagus with lime pickle yogurt & pistachio\nraw japanese snapper with turnips & crème fraîche\nsmoked & grilled artichokes with quinoa & shaved pig's head\n'treasure chest' of fermented sausage, trout quenelles\npolpette of rabbit & pork with blood orange & castelvetranos\naromatic spiced squab with salted chili paste\n\nYou all have no idea how much I would love to describe every bite of each dishes! Let me just say that we were salivating every single bite we took.  \n\nVery much Highly recommended!!!", "rating": 5, "date": "2015-05-14"}, {"excerpts": ["We had (in rankings of our favourite to least):\n\n- lamb merguez with yellow eye beans, octopus & crispy squid - a lot of flavor and texture\n\n- raw japanese snapper with turnips & crème fraîche -- light and had a nice wasabi taste, really understated\n\n- aromatic spiced squab with salted chili paste - cooked very well, tender meat which is hard to do!\n\n- shaved cauliflower-herbs & pig fries - I liked this a lot, the fries were not very fried (which I disliked), and a lot of flavor. "], "author": "Yan K.", "review": "A very pleasant experience at The Progress. We had (in rankings of our favourite to least):\n\n- lamb merguez with yellow eye beans, octopus & crispy squid - a lot of flavor and texture\n\n- raw japanese snapper with turnips & crème fraîche -- light and had a nice wasabi taste, really understated\n\n- aromatic spiced squab with salted chili paste - cooked very well, tender meat which is hard to do!\n\n- shaved cauliflower-herbs & pig fries - I liked this a lot, the fries were not very fried (which I disliked), and a lot of flavor. My boyfriend wasn't a fan as he thought it was too acidic\n\n- 'treasure chest' of fermented sausage, trout quenelles - as Asians, suppose we thought it wasn't too special. The chinese sausage we have all the time (and we didn't even think it was the best type), but the pumpkin mochi was good. Nice to have a soup during the meal\n\n- smoked duck with marinated pioppini mushrooms & dried plum - we both thought not too memorable\n\nWe also ordered a serving of the dessert (poppyseed angel food cake) to share for the two of us, which is what the server recommended. It was fine - we wanted a dessert to round out the meal, but also wasn't super memorable.\n\nService was fast, it took 2 hours for our meal, even though the food came out quickly. Decent value for a high-end restaurant. Portions were adequate, we felt full but not stuffed after the 6.5 courses.", "rating": 4, "date": "2015-04-05"}], "spring pea  mt tam dumpling": [], "tomato curry roti": [{"excerpts": ["Next, the tomato curry roti was yummy and ever-so-slightly crisp while remaining chewy; ricotta and fava hummus provided a novel spread in which to dip the roti. "], "author": "Vincent L.", "review": "I had the pleasure of dining at The Progress with a great group of folks. It met all the hype and our expectations, and then some. Here, you'll get family-style dining in a venue that either once housed \"The Progress Theatre,\" or is based on it. Indeed, inside you'll be welcomed to stone walls, high ceilings, and a boisterous ambience.\n\nBut it's the food that revs up the volume several notches. When we dined, we chose six items from a large menu of offerings. While you now choose four, you can add more dishes at extra cost. And what creative offerings these were. After a shared course of six small, but tasty, starters, we started with the shaved cauliflower herbs and pig fries, which was a delicious way to pair something meaty with lots of greens as the base. Next, the tomato curry roti was yummy and ever-so-slightly crisp while remaining chewy; ricotta and fava hummus provided a novel spread in which to dip the roti. Then, a dish of grilled Sicilian artichokes with quinoa and shaved pig's head was yet another creative combination of savory meats with succulent greens.\n\nWe moved on to a \"treasure chest\" of fermented sausage, trout quenelles, and pumpkin-rice dumpling in a creamy pork broth - a hearty yet refreshing dish. Next, some savory, rich lamb merguez was complemented well by yellow eye beans, octopus, and crispy squid. Finally, polpettes of rabbit and pork, which came with bits of blood orange and castelvetranos, was another satisfyingly meaty dish. A dessert of elderflower floating island, rhubarb sorbet, and Arnold Palmer gelee was a soothing, not overpoweringly sweet way to balance out what was quite a hearty, rich meal. \n\nThe service was casual and very explanatory, and the overall experience was absolutely energizing. We all remarked at the end about how lucky we were to live in an area with such amazing creativity and innovation in all walks of life, particularly in its food. A fitting way to mark my 1500th review here on Yelp!", "rating": 5, "date": "2017-04-24"}, {"excerpts": ["Spring Pea & Mt. Tam Dumplings (3/5): expertly cooked, blandly flavored\n\nTomato Curry Roti (4/5): perfectly cooked, nice flavor - favorite dish of the night\n\nTreasure Chest (2/5): big letdown. "], "author": "Ethan R.", "review": "Summary: Great buzz in gorgeous, sexy space. Well-presented and creatively imagined dishes which unfortunately let-down when it comes to flavor.\n\nThe good: Aesthetic appeal of this gorgeous restaurant; creativity and presentation of the dishes; service\n\nThe bad: unfortunately, the flavors do not come together as well as they might. Nothing was delicious.\n\nWe had a good time at Progress the weekend before last. The restaurant is unbelievably gorgeous IMO, with a vibrant, energetic, fun ambiance. Service was on-point the entire night through, with only one slight timing issue. \n\n$65 prix fixe - choose your dishes to share with your party. Interesting dishes, creative, and well-presented.\n\nOnly drawback: nothing made me say, \"Wow, that's so good!\". Amazing taste is essential, that's the primary reason I'm paying so much to eat at The Progress, so the lack thereof was disappointing to say the least. Portion sizes are fine, and we left full at least.\n\nCauliflower and Pig Fries (2/5): just ok, didn't care for the astringency of the pig fries myself. Other half of party thought they were too rubbery.\n\nSpring Pea & Mt. Tam Dumplings (3/5): expertly cooked, blandly flavored\n\nTomato Curry Roti (4/5): perfectly cooked, nice flavor - favorite dish of the night\n\nTreasure Chest (2/5): big letdown. Broth was good; the disparate pieces didn't come together well in this dish, and were average when considered on their own. Not a fan of the pungent flavor of the sausage\n\nMaitake with black cod ponzu (3/5): fine, nothing special. I've had better, and recently\n\nFive Dot Ranch Beef (3/5): Just average, blandly flavored, but flavored enough to unfortunately conceal the core flavor of the quality meat\n\nFood: 3\nValue: 2\nService: 4 \nAmbiance: 4.5\nOverall: 3.5 (rounded down to 3 for Yelp's purposes)\n\nTab for two, with one $19 glass of wine and a $13 cocktail (tip included): $225", "rating": 3, "date": "2015-05-07"}, {"excerpts": ["Wish I had more!\n- tomato curry roti with ricotta and fava hummus", ": Roti was good, but was different from what my friend ordered since their menu changes often. ", "Will order again if it was on the menu.\n", "- butter clams with kimchi piccata: clams had a strong sea-taste to it as if it wasn't fresh, so I wasn't exactly impressed with this dish\n- treasure chest with fermented sausage, trout & dumplings: ", "Many like this dish, but I felt as if it was too salty for us. ", "The sausage and the broth itself. ", "The dumplings and trout were fine, but nothing that wows us.\n- squab with chili paste: The squab is probably my second favorite of all the things we had, but it was just a piece of leg, so I felt like it was hard to fully enjoy that between two people. ", "Good in flavor but a bit towards the saltier side, but not bad.\n", "- grilled five-dot ranch beef with mustard-miso oyster sauce: not bad, really liked the veggies. ", "The sauce was too overpowering in the dish, and the beef lacked a strong flavor of its own when it was drenched in the sauce.\n", "- sesame almond tarta with houjicha cream, kumquats and cherries: ", "Pretty good! "], "author": "Amanda C.", "review": "I came here expecting so much because of the hype on State Bird (which I haven't tried yet either) - but was disappointed. Got reservations, which was hard to get and my free appetizer was probably one of the best dishes we got. I also really enjoyed the pig ear fries best, so that's a must order. Upon arrival at your seat, you get a paper where you mark 6 things included for your visit and additional items will cost more. Our table was awkwardly positions because we were facing another couple that was facing us as we ate - awkwards. \n\nHere's what we chose:\n- shaved cauliflowers & herbs with pig fries: FAVORITE DISH - must get. Crispy pig fries - delicious and rich in flavor! Wish I had more!\n- tomato curry roti with ricotta and fava hummus: Roti was good, but was different from what my friend ordered since their menu changes often. Will order again if it was on the menu.\n- butter clams with kimchi piccata: clams had a strong sea-taste to it as if it wasn't fresh, so I wasn't exactly impressed with this dish\n- treasure chest with fermented sausage, trout & dumplings: Many like this dish, but I felt as if it was too salty for us. The sausage and the broth itself. The dumplings and trout were fine, but nothing that wows us.\n- squab with chili paste: The squab is probably my second favorite of all the things we had, but it was just a piece of leg, so I felt like it was hard to fully enjoy that between two people. Good in flavor but a bit towards the saltier side, but not bad.\n- grilled five-dot ranch beef with mustard-miso oyster sauce: not bad, really liked the veggies. The sauce was too overpowering in the dish, and the beef lacked a strong flavor of its own when it was drenched in the sauce.\n- sesame almond tarta with houjicha cream, kumquats and cherries: Pretty good! Liked the sesame tart part best.\n- salted caramel floating island, coconut sorbet and strawberries: I liked the strawberry best in this entire dish.\n\nProbably won't be back, but nice to have given it a try. This makes me less likely to want to try State Bird anymore, but if the opportunity presents itself, I don't mind trying.. but because reservations are so hard to get, I don't mind not going.", "rating": 3, "date": "2015-07-20"}, {"excerpts": ["Tomato curry roti with ricotta and fava hummus - ", "The roti was not cooked to my liking but the tomato curry and ricotta was AMAZING.\n", "*"], "author": "Nikitha R.", "review": "I've been waiting to check this place out since it opened and finally had the chance to last Sunday. There was ample seating at the bar when we walked in at 6:30 pm and my friend and I were seated immediately. We were able to order a la carte at the bar but there is a prix fixe menu if you are seated at a table.\n\nHighlights:\n***Asparagus with lime pickle yogurt and pistachio - The yogurt paired perfectly with the asparagus and the pistachio added a nice crunch to every bite.\n*** Tomato curry roti with ricotta and fava hummus - The roti was not cooked to my liking but the tomato curry and ricotta was AMAZING.\n***Grilled Five Dot Ranch beef with mustard-miso oyster sauce - Nice flavors!\n***Salted caramel floating island, coconut-creme fraiche sherbet, strawberries - A MUST. I'm not usually a fan of salted caramel but this dessert was soooo good.\n\nOverall, the quality of food and drinks and service were great but I personally enjoyed Statebird Provisions more.", "rating": 4, "date": "2015-05-11"}], "roasted mushrooms  kale": [], "butter clams on the half shell": [{"excerpts": ["- butter clams on the half shell with kimchi piccata & shungiku\n\n- Spanish  barnacles - it was so delicious "], "author": "Manda Bear B.", "review": "********************* 1275 **********************\n\n    New American restaurant The Progress serving inventive, family-style meals, farm-to-table with freshest ingredients, from the same kitchen as the State Bird Provisions team Michelin Starred Chef-owners Stuart Brioza and Nicole Krasinski. \n\n    I love the beautiful airy high ceiling that arches overhead, and the beautiful wood work on the wall, intensive labor work put into this beautiful, modern, but rustic The Progress. A large bar area with more than 20 seats, so without reservation, it's not a bad thing. The last few times I was here around 5:15 week nights, I got in. \n\n    The 90-seat dining room with a few more tables on the second level, usually fill up by 6 PM, and it's jam packed every night just like its sister State Bird Provisions next door. \n\n    The Progress serves bar menu and full dinner menu at the bar, so it's such a great option for diner like me CANNOT get any reservation from both restaurants :-) It's not a complain, in fact it makes me more excited and a little adrenaline rush with the thought that I couldn't get any seat even at the bar, haha. That was how I feel about last night dinner with my best friend in town. \n\n   Luckily chef Stuart Brioza was in, what a treat for my best friend and my visiting somm friend from NYC. \n\n   Love the concept of 6 dishes for $65 per person, and each additional dish for $10, plenty of delicious food to share, reasonable price point, great concept and execution. \n\n- spot prawn - was so delicious\n\n- shaved cauliflower-herbs & pig fries\n\n- spiced lamb tartare - I had this dish 3 times now, and loving it each time more.\n\n- raw japanese snapper - beautifully presented as good as it looks.\n\n- porcini & mt. tam dumpling with nettle salsa verde - newest dish in APR 2015, refreshing.\n\n- pecorino 'roti' with perigord truffle buttermilk - a MUST TRY\n\n- roasted mushrooms & kale with local wakame kraut - I had this dish 3 times and will continue order it as long as it's on the menu, a great choice for vegetarian.\n\n- butter clams on the half shell with kimchi piccata & shungiku\n\n- Spanish  barnacles - it was so delicious and I came back last night, it was gone!  \n\n- black butter butternut squash with caramelized onion & swiss chard\n\n- polpette of guinea hen & pork with blood orange & castelvetranos - another FAV dish of mine. \n\n- lamb merguez with yellow eye beans, octopus & crispy squid - my 3rd time with this dish, highly recommend \n\n- maitake, tofu curry & bok choy 'stir fry' with smoked black cod ponzu - reminds me of Chinese cuisine.\n\n- aromatic spiced squab with salted chili paste - reminds me of a Vietnamese dish that I had when I was growing up. It got the 5 spice flavor, the meat was so tender, delicious, I forgot when was the last time the squab could taste that good.\n\n- grilled Five Dot Ranch beef with mustard-miso oyster sauce - this was the only dish that wasn't my style :-) but my friends love it! I prefer my beef/steak with less sauce on it. \n\n    The cocktail list is also good. I presonally enjoyed the Paloma (reposado tequila, pomelo, lime, sugar, madras curry tincture) recommended by our server Kelly.\n\n  The wine list was delicious by Sommerlier Jason Alexander, if you are a wine lover, collector, or a somm, you would enjoy this list tremendously. He offers wines of the world, beautiful white Burgundy, the grower Champagnes, Rieslings, and plenty of French, Italian and Spanish red for under $70 bottles! And if you are a collector, check out the Cellar Selection, I'm in love! \n\n    The service by Eric last time at the dining room was excellent. The last 2 times at the bar was equally fantastic, attentive, caring, and purely enjoyable for us. \n\n    I'm looking forward to my next visit to explore the ever evolving menu daily and the wine list to pair with it. \n\n    Again, congratulations The Progress, San Francisco for being Jame Beards Foundation Award Semifinalists 2015, and I'm sure many accolades to come. \n\nNOTE: no valet parking, come at 5 PM on week night, you will surely get in at the bar!", "rating": 5, "date": "2015-04-03"}], "grilled sicilian artichokes": [{"excerpts": ["Then, a dish of grilled Sicilian artichokes with quinoa and shaved pig's head was yet another creative combination of savory meats with succulent greens.\n\n"], "author": "Vincent L.", "review": "I had the pleasure of dining at The Progress with a great group of folks. It met all the hype and our expectations, and then some. Here, you'll get family-style dining in a venue that either once housed \"The Progress Theatre,\" or is based on it. Indeed, inside you'll be welcomed to stone walls, high ceilings, and a boisterous ambience.\n\nBut it's the food that revs up the volume several notches. When we dined, we chose six items from a large menu of offerings. While you now choose four, you can add more dishes at extra cost. And what creative offerings these were. After a shared course of six small, but tasty, starters, we started with the shaved cauliflower herbs and pig fries, which was a delicious way to pair something meaty with lots of greens as the base. Next, the tomato curry roti was yummy and ever-so-slightly crisp while remaining chewy; ricotta and fava hummus provided a novel spread in which to dip the roti. Then, a dish of grilled Sicilian artichokes with quinoa and shaved pig's head was yet another creative combination of savory meats with succulent greens.\n\nWe moved on to a \"treasure chest\" of fermented sausage, trout quenelles, and pumpkin-rice dumpling in a creamy pork broth - a hearty yet refreshing dish. Next, some savory, rich lamb merguez was complemented well by yellow eye beans, octopus, and crispy squid. Finally, polpettes of rabbit and pork, which came with bits of blood orange and castelvetranos, was another satisfyingly meaty dish. A dessert of elderflower floating island, rhubarb sorbet, and Arnold Palmer gelee was a soothing, not overpoweringly sweet way to balance out what was quite a hearty, rich meal. \n\nThe service was casual and very explanatory, and the overall experience was absolutely energizing. We all remarked at the end about how lucky we were to live in an area with such amazing creativity and innovation in all walks of life, particularly in its food. A fitting way to mark my 1500th review here on Yelp!", "rating": 5, "date": "2017-04-24"}], "wood oven roasted morels ramps  smoked hollandaise": [], "polpette of rabbit  pork": [], "treasure chest of fermented sausage": [{"excerpts": ["Treasure chest of fermented sausage, trout quenelles, pumpkin-rice dumpling in pork broth - My favorite dish of the meal. ", "Delicious broth, loved the sausage and pumpkin dumplings. "], "author": "Adrienne H.", "review": "I was so SO excited about The Progress...only to leave disappointed, hangry, and entertaining the idea of having a second dinner at Zuni. At least I got a good buzz from the drinks.\n\nSo what happened? Well, I'm a big fan of State Bird (I may be biased, as it was also the location of the best first date ever). Therefore, I went to The Progress with high expectations but an open mind, knowing the concept would be different.\n\nDRINKS:\nWe got drinks while waiting for our table to be ready. This was the highlight of the night. AWESOME cocktails. I got the The Mezzanine (mezcal, house banana liqueur, allspice, lime, nocino). Being on a mezcal kick from Mexico a week earlier, I thoroughly enjoyed this smokey concoction. I also tried the King's Crossing (rye, calvados, mulling spice, lemon, egg white, cider). Woah, tasted like delicious spiked apple cider. During dinner, I enjoyed a chardonnay and prie blanc. They had a short, but varied wine by the glass selection. Impressive bottle selection.\n\nFOOD:\nAmuse Bouche - beef jerky, fried oyster, something with trout I believe, and cheese crackers. Great presentation and strong flavors. Off to a great start!\n\nSmoked duck w/ marinated yellowfoot mushrooms & dried plum - I insisted on ordering this, as I love the duck pancakes at State Bird. Unfortunately this was very disappointing. I have to agree with the reviewer that said this tasted like bologna. I couldn't finish it.\n\nPorcini & mt. tam dumpling w/ nettle salsa verde - Not bad, enjoyed the cheese filling, but too much dough to filling ratio.\n\nPercorino roti w/ black truffle buttermilk - How do you mess up roti? Soggy and the truffle was barely detectable. \n\nTreasure chest of fermented sausage, trout quenelles, pumpkin-rice dumpling in pork broth - My favorite dish of the meal. Delicious broth, loved the sausage and pumpkin dumplings. Trout quenelles was so-so.\n\nDungeness crab, bok choi, tofu stir fry - Ick. Barely any crab, tofu was bland and had an off putting taste. And I like tofu! - plain, fried, stinky, dried...but not this tofu.\n\nWild mushrooms w/ pickled local nori & kale - Bland. Lacked cohesiveness.\n\nThe meal wasn't a total flop, but it was disappointing and left me unsatisfied. The food sounded great on the menu but all lacked one thing or another in the execution.\n\nOther notes:\n-Good service in both the bar area and at dinner. Enthusiastic, helpful, and great all around.\n-They serve the full menu a la carte at the bar.\n-We had our own two top, but some tables were communal style.\n-Very beautiful, well-designed space. Custom chairs, tables, lighting. And the bathroom had fun colorful toilet paper.\n-No, I did not get a second dinner.", "rating": 2, "date": "2015-02-03"}, {"excerpts": ["Treasure Chest of fermented sausage, fish quenelles, tofu and pumpkin-rice dumplings in a creamy pork broth. ", "Basically a ramen soup with lots of little trinkets. ", "I would say this dish was creative due to the fish quenelles and fermented sausage in the soup. ", "What kind of soup ever includes those ingredients?! ", "They were so delicious though! "], "author": "Jocelyn L.", "review": "The Progress is State Bird Provision's newest addition to the Fillmore! State Bird is great but sometimes you get tired of the routine; it got a little bit repetitive and a hungry foodie always wants more. Thank god the Progress opened!  The concept is you pick 6 dishes from the menu (about 20 total items) and share family style, for $65/person. If you want to add dishes, they are an additional $10/person. Corkage is $25.\n\nThe restaurant ambiance is very cool. The bar has a metal frame hanging from the ceiling holding various plants. The restaurant as a whole is very long, and feels like you're on a train from the curved ceilings and curved walls. There are a lot of new wooden and modern panelings which are beautiful. There are two upstairs parts of the restaurant, on each end. In the center, it's a bunch of open space which creates a nice center and buzz of excitement. \n\nThe bartenders are attentive and quick, and thus we got our drinks with swift speed. I got the Sunny Jim ($11, gin, lemon, vanilla-pineapple syrup, kaffir lime leaf, soda, with curry-dusted pineapple), which tasted like a lemonade with vanilla and cream in it, quite tasty and different from any other drink I've had before.  My bf ordered the Concession ($11, rum, house cherry cola syrup, licorice bitters, with buttered popcorn) - he loved it, but for me it was too bitter of a drink (a \"guy\" drink).\n\nOur waiter, Gerald, was an extremely friendly, hilarious gay guy whom everyone would love to have as their BFF. He kept joking around with our table, and others too, and made my bf and I feel very at home. It was great! I hope you get him as your waiter. The chef, Stuart Brioza, was there putting the final touches on the dishes and also bringing some dishes to each table. He presented some of ours very happily, and with lots of pride; you could tell that his heart and soul went into this restaurant. Very cool!\n\nIt turns out the food is very much Asian Fusion, which took me by surprise. We ordered 6.5 dishes. My favorites were #1, 3, 4 and 5:\n\n1) Shaved cauliflower herbs and pig fries. This dish had a sour taste from the lime, and with the herbs and cauliflower, and savoriness of the fried meat, which made it taste like a Thai dish. The pig ears (don't be afraid like I was!) were not in an ear shaped like I had imagined, but instead little strips fried and oozing with fat drippings. Your loss if you don't order this one!\n\n2) Barely Poached Ridgebacks with yuzu & olio nuovo. Ridgebacks are Ebi, very similar to the dish you can sometimes order at Japanese restaurants where they fry the head, and the body of the shrimp. The head was fried, which was quite tasty. The body was poached, and very soft and the texture was amazing. However we felt this dish could have been ordered at another restaurant, not exactly the most innovative (not to say it was bad either though!)\n\n3) Sunchoke, Rosemary, and Pecorino Roti - the WINNER of the night. Roti is a style of Indian Crepe, if you've never had. It's flaky and doughy at the same time. You just rip it off, and it went terrifically with the pecorino cheese. Oh, my god! All of the other tables were ordering it too. \n\n4) Smoked black cod fried rice with squid & preserved lemon. Quite tasty. The black cod seemed like it was poached (vs. fried like I had envisioned) but that was great too, it just made the dish softer. The squid was fried, which gave the dish a nice contrast and complimented nicely with the pucker from the lemon.\n\n5) Treasure Chest of fermented sausage, fish quenelles, tofu and pumpkin-rice dumplings in a creamy pork broth. Basically a ramen soup with lots of little trinkets. I would say this dish was creative due to the fish quenelles and fermented sausage in the soup. What kind of soup ever includes those ingredients?! They were so delicious though! Quenelles were my fav since it was so soft - like biting into a fish cream puff. \n\n6) Aromatic spiced squab with salted chili paste - the \"China\" dish of the night. I wasn't too crazy about this one, but the squab was cooked well (medium rare) and thus soft and chewy. It also came with lettuce wraps and the chili paste - one of which was extremely bitter, which is probably why I didn't care for this dish much. It also wasn't the most creative. \n\n7) Honey cocoa ice cream & olio nuovo. Honey cocoa ice cream was extremely buttery, creamy and chocolatey in a smooth and tasty way. However that was the highlight of the dish. I wouldn't order desserts again; stick to the main savory dishes!\n\nCan't wait to return. I want to come back in summer, so I can try new things on the menu.", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["Treasure chest of fermented sausage, trout quenelles & pumpkin-rice dumplings in a creamy pork broth. ", "This was so freaking good. ", "I just wanted more of it. ", "The broth was amazing, and I really wanted another pumpkin dumpling, and I definitely wanted more of the trout quenelles. "], "author": "Christina S.", "review": "I'm writing this review post-Lazy Bear, so the Progress is a little less shiny in my mind, but nevertheless, The Progress is a must try.\n\nThe door is unlabeled, but you know exactly where you are because of the line next door at State Bird. Luckily, reservations aren't too tricky to make at the Progress.\n\nThe restaurant itself is beautiful, all wood and happy voices and a very tight squeeze to get to your table. You're brought a variety of snacks, and it's all well and good and delicious, but not particularly memorable.\n\nYou're given a check list, similar to dim sum, where you can pick 6 dishes to eat family style or 5 dishes and an individual sized dessert. My boyfriend and I picked the following:\n\nSmoked duck with marinated pioppini mushrooms & dried plum. This was very, very good. The plum was sweet, which played well with the smokey sweetness of the duck. \n\nShaved cauliflower-herbs & pig fries. This was good, but not too special. The pig fries had a healthy heaping of pig ear. I don't think I would order this again. \n\nSpiced lamb tartare with various mix-in condiments. This was probably my favorite dish. Really delicious and flavorful, and it came with these delicious, delicate chips that were salty and brought all the flavors together.\n\nPolpette of guinea hen & pork with blood orange & castelvetranos. This was probably my least favorite dish. Thinking back, I can't remember a single thing about this dish that stood out. \n\nTreasure chest of fermented sausage, trout quenelles & pumpkin-rice dumplings in a creamy pork broth. This was so freaking good. I just wanted more of it. The broth was amazing, and I really wanted another pumpkin dumpling, and I definitely wanted more of the trout quenelles. My least favorite element of this dish was the sausage, but that's just personal preference.\n\nThe dessert I chose was the poppyseed angel cake, strawberries, pistachio & marscapone. It was delicious, light, and exactly what I needed to finish off the evening.\n\nThis is a great place to go with a group of friends who have similar tastebuds to you. The alcohol selection is impressive, but it adds up once you've had a few glasses. I highly recommend checking out The Progress.", "rating": 4, "date": "2015-04-09"}, {"excerpts": ["4) Treasure chest of fermented sausage, trout quenelles and pumpkin rice ", "dumpling in a creamy pork broth: ", "my favorite of the 6, mostly because each component was interesting and executed well. ", "I've never had fermented sausage, which tasted almost like the kimchi in the soup. ", "The trout quenelle's had the texture of Chinese fish balls but was much more flavorful. ", "The pumpkin rice dumpling was soft, bouncy and extremely interesting. ", "However, each person only gets one dumpling, which was barely the size of a quarter. ", "The broth was light in taste but rich in texture. \n", "5) ", "Lamb merquez with yellow eye beans, octopus and crispy squid", ": this one was good too. ", "Possibly the 2nd contender. ", "The lamb merquez was oversalted and chewy. ", "Despite being the star of the dish, it tasted like slim jims. ", "That said, I especially enjoyed the rest of the dish. ", "The octopus was tender with a hint of smokiness from the grill. ", "The squid was deep fried and the yellow eye beans were buttery and sweet. ", "Overall, this dish came together well, except for the lamb merquez, which got lost in this dish.\n", "6) ", "Dungeness crab, bok choy and tofu stir fry", ": it was good but not $20 good. ", "The flavors reminded me a dashi-flavored stir fry agedashi tofu. "], "author": "Jenny Z.", "review": "The Progress is a new sister restaurant, opened by the same owners of State Bird Provisions. In fact, the two are physically, right next door. Whereas SBP is the dim sum service of haute cuisine, The Progress is the banquet counterpart where courses are served family-style for each table.\n\nService was superb. They were attentive to refilling your water, and checking on you throughout the meal. Moreover, the waiters were quite knowledgable about the menu and are able to describe the dishes to you, with detail and opinion. The only downside of the service, at least considering the amount you were paying, was that they do not exchange the dishware often enough between \"courses.\" Although we had at a reservation at 7:30, we were not seated until past 8pm. So, be prepared to wait, even with a reservation. \n\nUnlike SBP, The Progress has a full liquor license, which means cocktails, beer, extensive wine list and a standing bar that opens at 5pm. After a glance, my friend and I decided to go with The Concession (popcorn infused rum, Coca Cola syrup with Vermouth as its base). It was smooth, lingering on the tongue and rich on the taste buds. I loved it. In fact, I would come back just to explore their cocktail menu. \n\nTheir menu is composed of 12 dishes that seem to change, with the exception of some popular dishes like \"pig fries\" and \"smoked duck.\" Although, don't quote me on this because it has only opened for a month or so. Each person at your table is charged at a starting price of $65, with the entire table having the option of choosing 6 dishes. The courses are portioned to match the number of people at your table, which in our case was 4. Keep in mind that you are paying for about $20 per plate, rounding out to about $100pp with a drink or dessert.\n\n1) Shaved romanesco, herbs and pig (ear) fries: very interesting. The pig ears tasted like they were pickled and then deep fried. The combination of salty, briny, fried pig ears paired well with the shaved romanesco and herbs. \n2) Yuzu and olive oil marinated raw tuna with green daikon: This was delicious. The tuna was fresh. However, I wished they did something with the raw daikon and carrots so that they would embody more flavor and pair better. Overall the tuna was good but the other components were lost in this dish. \n3) Curry rabbit & chicken karaage: interesting. It took us a little bit to figure out whether we were eating rabbit or chicken. The chicken and rabbit karaage were placed over a layer of shredded carrots and sautéed black trumpet mushrooms. Overall, the trumpet mushrooms and rabbit were my favorite parts of this dish. The mushrooms were earthy and cooked down to a silky perfection. The rabbit was well cooked, tender and carried a light hint of curry. The chicken was dry, lackluster and left much more to be desired. \n4) Treasure chest of fermented sausage, trout quenelles and pumpkin rice dumpling in a creamy pork broth: my favorite of the 6, mostly because each component was interesting and executed well. I've never had fermented sausage, which tasted almost like the kimchi in the soup. The trout quenelle's had the texture of Chinese fish balls but was much more flavorful. The pumpkin rice dumpling was soft, bouncy and extremely interesting. However, each person only gets one dumpling, which was barely the size of a quarter. The broth was light in taste but rich in texture. \n5) Lamb merquez with yellow eye beans, octopus and crispy squid: this one was good too. Possibly the 2nd contender. The lamb merquez was oversalted and chewy. Despite being the star of the dish, it tasted like slim jims. That said, I especially enjoyed the rest of the dish. The octopus was tender with a hint of smokiness from the grill. The squid was deep fried and the yellow eye beans were buttery and sweet. Overall, this dish came together well, except for the lamb merquez, which got lost in this dish.\n6) Dungeness crab, bok choy and tofu stir fry: it was good but not $20 good. The flavors reminded me a dashi-flavored stir fry agedashi tofu. The dungeness lump crab meat added flavor and luxurious touch to the dish, but that was about it; it was simply mixed in. \n\nMain dishes aside, I really enjoyed the \"banchan plate\" which came with 4 different bite-size banchan. Meager in portion, but very adventurous in interpretation and concept. My favorite was the fancy cheese-it cracker and malaysian style beef jerky.\n\nI appreciate the concept that State Bird Provisions upholds. Unfortunately, The Progress fell short of my expections. I enjoyed it the first time, but probably won't return.The beautiful ambiance couldn't make-up for the price per dish and the quality of it. Each dish recreated asian-fusion flavors, but in the end, the components were not executed as well as I wished. Moreover the construction and fusions of each dish felt disorganized and could have been more thought out. For the same style of food, I would rather return to SPB than The Progress, or save it for Benu", "rating": 3, "date": "2015-01-27"}, {"excerpts": ["Treasure chest of fermented sausage, fish quenelles, tofu, and a pumpkin rice dumpling in a pork broth was a highpoint of the meal and a great palate cleanser.  "], "author": "David D.", "review": "Over the past year the restaurant reviewer and one of the commentators of the New York Times have complained that it can be a royal pain to get a meal at many restaurants.  The chef may offer only a fixed menu with no changes permitted; or may not offer a menu at all; alternatively you may be given a poem that offers little clue to what is to come.  And a meal can take hours.\n\nThe Progress has put the fun back into fine dining.  The restaurant is beautiful.  The servers are friendly.  You get a menu and can choose six of whatever the hell you want.  It's kind of a marriage of Gary Danko with the old Yun Luck Rice Shoppe in New York City.  \n\nThe restaurant has great music, mood, and energy.  And the food is very good at worst and inspired at best.  One more thing, Stuart Brioza and his wife know what it means to be a host/chef/owner.  They were all over the place cooking, greeting, serving, and bussing.  They exude hospitality.  \n\nA beautiful amuse was presented to each table that said welcome in a most tasty way.\n\nI then started my meal with smoked black cod fried rice with fried squid.  The squid was great.  The rice only OK as I was unable to taste the cod.  This was the weakest plate of my meal.\n\nGrilled shrimp with daikon, yuzu and olive oil was light and a nice introduction to what was to follow (in my estimation the food got better as the meal progressed).\n\nWild mushrooms came with pickled nori and brussels sprouts leaves.  The mushrooms had that earthy taste that I so love; the brussels sprouts leaves were a nice accent.  I did feel that there was a bit too much acid on the plate but others would likely disagree.\n\nTreasure chest of fermented sausage, fish quenelles, tofu, and a pumpkin rice dumpling in a pork broth was a highpoint of the meal and a great palate cleanser.  I suspect that this, in various guises, will become a signature of the restaurant.\n\nTwo meat courses came next and each was wonderful.  First, Don Watson's lamb scallopini with fava beans and cippolini tasted the way lamb should (the Don Watson name gives you a hint of that before this plate arrives).    Next, BN ranch beef with mustard-miso oyster sauce had that mineral taste that you rarely experience these days in meat.  \n\nOverall a great but expensive meal.  With a cocktail, tax, and tip I dropped $100 on my meal.  But it was worth it.  One does wonder whether the pricing will limit the popularity of The Progress. \n\nI left wondering whether they might offer a less expensive three or four course alternative to the full 6 course meal.  In any event, The Progress points the way towards dining the way many of us wish it to be.", "rating": 4, "date": "2015-01-05"}], "lamb merguez": [{"excerpts": ["Next, some savory, rich lamb merguez was complemented well by yellow eye beans, octopus, and crispy squid. ", "Finally, polpettes of rabbit and pork, which came with bits of blood orange and castelvetranos, was another satisfyingly meaty dish. "], "author": "Vincent L.", "review": "I had the pleasure of dining at The Progress with a great group of folks. It met all the hype and our expectations, and then some. Here, you'll get family-style dining in a venue that either once housed \"The Progress Theatre,\" or is based on it. Indeed, inside you'll be welcomed to stone walls, high ceilings, and a boisterous ambience.\n\nBut it's the food that revs up the volume several notches. When we dined, we chose six items from a large menu of offerings. While you now choose four, you can add more dishes at extra cost. And what creative offerings these were. After a shared course of six small, but tasty, starters, we started with the shaved cauliflower herbs and pig fries, which was a delicious way to pair something meaty with lots of greens as the base. Next, the tomato curry roti was yummy and ever-so-slightly crisp while remaining chewy; ricotta and fava hummus provided a novel spread in which to dip the roti. Then, a dish of grilled Sicilian artichokes with quinoa and shaved pig's head was yet another creative combination of savory meats with succulent greens.\n\nWe moved on to a \"treasure chest\" of fermented sausage, trout quenelles, and pumpkin-rice dumpling in a creamy pork broth - a hearty yet refreshing dish. Next, some savory, rich lamb merguez was complemented well by yellow eye beans, octopus, and crispy squid. Finally, polpettes of rabbit and pork, which came with bits of blood orange and castelvetranos, was another satisfyingly meaty dish. A dessert of elderflower floating island, rhubarb sorbet, and Arnold Palmer gelee was a soothing, not overpoweringly sweet way to balance out what was quite a hearty, rich meal. \n\nThe service was casual and very explanatory, and the overall experience was absolutely energizing. We all remarked at the end about how lucky we were to live in an area with such amazing creativity and innovation in all walks of life, particularly in its food. A fitting way to mark my 1500th review here on Yelp!", "rating": 5, "date": "2017-04-24"}, {"excerpts": ["Lamb Merguez with Yellow Eye Beans, Octopus & Crispy Squid --  ", "My faves were definitely the Smoked Duck which was similar to the duck I had back at State Bird minus the pancakes, the Pig Fries because of their sheer fried pork awesomeness,  and surprisingly, the Lamb Merguez with Octopus and Squid, simply because I'm not into lamb that much.  ", "But somehow they found a way to bring that dish all together and ", "the Lamb Merguez didn't have an overpowering lamb taste.  ", "The dessert assortment, while good, was a little bit of a let down in comparison to State Bird's dessert offerings.  "], "author": "Rodney H.", "review": "Since I'm huge fan of State Bird Provisions, it was only a matter of time before I would finally have dinner at their sister restaurant, The Progress.  I just had to wait a couple of months for the hype to die down a little bit.  Surprisingly, it wasn't as difficult to land a reservation here than for State Bird.\n\nWhen you walk in, it's a much more grander scale than State Bird.  The decor is warm and looks a lot brighter.  Plus they have two upper balconies for dining.  The big difference with The Progress is that they have a full cocktail bar here with tables so you can dine at the bar as well.\n\nThe food menu is completely different and can hold it's own against State Bird.  Where State Bird is more of a dim sum and tapas style restaurant, the Progress has a more family style dining approach with a 6-course dinner.  While the experience is still similar, the food portions here are larger.  I dined here with a couple friends so sharing each dish between the three of us was pretty easy to do.  The only thing that did take a while was for us to decide which 6 dishes to pick for our dinner.\n\nHere's what we ordered:\n\nComplimentary \"Banchan\" --  http://bit.ly/1FnBuQb \n\nRaw Japanese Snapper with Turnips & Crème Fraîche -- http://bit.ly/1HVWSJL \n\nSmoked Duck with Marinated Pioppini Mushrooms & Dried Plum --  http://bit.ly/1yZ5FFK\n\nShaved Cauliflower-herbs & Pig Fries --  http://bit.ly/1yZ6zC7\n\nAromatic Spiced Squab with Salted Chili Paste -- http://bit.ly/1HW03kN \n\nLamb Merguez with Yellow Eye Beans, Octopus & Crispy Squid --  http://bit.ly/1HW1iAu\n\nDessert Assortment --  http://bit.ly/1DNhNkO\ndessert choose 1 per person\nlemongrass floating island, rhubarb sorbet & coconut-ginger gelée\npoppyseed angel cake, strawberries, sicilian pistachio & mascarpone\ndates à la mode, St. George NOLA, hazelnuts & chocolate\n\nSo much food!  And we enjoyed pretty much everything we ordered.  My faves were definitely the Smoked Duck which was similar to the duck I had back at State Bird minus the pancakes, the Pig Fries because of their sheer fried pork awesomeness,  and surprisingly, the Lamb Merguez with Octopus and Squid, simply because I'm not into lamb that much.  But somehow they found a way to bring that dish all together and the Lamb Merguez didn't have an overpowering lamb taste.  The dessert assortment, while good, was a little bit of a let down in comparison to State Bird's dessert offerings.  I might end up skipping dessert next time since it's optional.\n\nJust recently, they changed the food menu at the bar.  Though it's still a la carte, the portions are more tapas sized like State Bird and at more affordable prices.  So basically, you can get a \"State Bird\" experience at the bar.\n\nIs The Progress better than State Bird?  It's pretty close,  Food-wise they're almost equally impressive, but I still prefer the whole \"dim sum\" experience at State Bird to be more entertaining.   Nonetheless, The Progress is an amazing follow up from the State Bird Provisions team and I wouldn't hesitate to go back again to try their other dishes, just like I would with State Bird.", "rating": 5, "date": "2015-09-30"}, {"excerpts": ["We got raw halibut, ricotta, pig fry, roti, cod and lamb merguez. ", "The best dish for me was definitely the roti (but then all the rotis in the world are all damn good...) ", "Disappointed in the cod although the chickpea at the bottom was nicely toasted and had good crunch. "], "author": "Joy Y.", "review": "Yeah the food is good but for 3 people its like $40 a plate which sounds like a joke amirite...\n\nService is ok. The hostess was really delightful but the waitress was hasty and she seemed to have been coughing a lot. I hope she feels better...\n\nWe got raw halibut, ricotta, pig fry, roti, cod and lamb merguez. The best dish for me was definitely the roti (but then all the rotis in the world are all damn good...) Disappointed in the cod although the chickpea at the bottom was nicely toasted and had good crunch. Ricotta was nothing special and I am not a huge fan of peach + cheese.\n\nAll dishes were intricate and had many many components but I cannot stop laughing about how much they are charing for the food they serve.", "rating": 3, "date": "2015-08-24"}, {"excerpts": ["*lamb merguez with yellow eye beans, octopus & crispy squid\n*aromatic spiced squab with salted chili paste\n", "The Lamb merguez came in a close second but all the food that came out was great!"], "author": "Mai W.", "review": "This place was a great dining experience. The drinks were great, the atmosphere was modern and of course the food was phenomenal.\n\nThe style of serving for this meal was very unique. You get a menu (much like dim sum places) and you mark of 6 dishes to share for the table. Everything is family style. You are not limited to choosing only six, you can add an additional dish for $10/person. The meal was $65/person which is not bad at all!\n\nFor our meal we chose:\n\n*smoked duck with marinated yellowfoot mushrooms & dried plum\n*shaved cauliflower-herbs & pig fries\n*pecorino 'roti' with perigord truffle buttermilk\n*lamb merguez with yellow eye beans, octopus & crispy squid\n*aromatic spiced squab with salted chili paste\n*grilled Five Dot Ranch beef with mustard-miso oyster sauce\n\nOur favorite by far was the Cauliflower and pig fries. The Lamb merguez came in a close second but all the food that came out was great!", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["* lamb merguez with octopus and crispy squid (a hearty and delightful stew)\n"], "author": "Dawne L.", "review": "Finally went on a long-overdue date night with the hubby, and we're glad we spent it here at The Progress.  It's right next to its sister restaurant, State Bird Provisions, with the same unassuming facade.  Once you step in, you're whisked away into married chefs Stuart Brioza's and Nicole Krasinski's world -- and we're fortunate transients to enjoy it!\n\nSERVICE:\nThe staff was very accommodating from start to finish. We didn't have any reservations, but their friendly host was able to seat us promptly. Every member of the staff who served us -- from the sommelier to dining room attendants -- were top-notch.  \n\nLOCATION:\nThe modern industrial look of the dining room was hip and haute.  Everything was well thought of, including the swanky bathrooms wrapped in gold wallpaper and linoleum.  Loved the open space and open kitchen, which made up for the tight bar seating.  \n\nFOOD:\nLove their take on \"family-style\" dining, which allowed us to try 6 spectacular dishes from their innovative menu.  We started with an appetizer platter compliments of the chef (I couldn't call it an \"amuse bouche\" because it was hefty!), then our dishes were served in 3 waves.  We chose 3 from the top \"lighter\" menu, and 3 \"heavy\" dishes, and were pretty satisfied and full at the end of it:\n\n* pig fries with shaved cauliflower and herbs (the clear standout of the meal!)\n* pecorino roti with perigold truffle buttermilk (fluffy and delicious!)\n* raw japanese snapper with turnips and creme fraiche (light and refreshing)\n* lamb merguez with octopus and crispy squid (a hearty and delightful stew)\n* lobster with bokchoy and tofu (stir-fried and seasoned perfectly)\n* spiced squab with chili paste (crispy skin and tender succulent meat!)\n\n\nWe expected nothing less from the James Beard honorees, and at $65 per person, this was a very satisfying 5* meal.  If you're not up for a big dinner, you can also try smaller versions of their dishes a la carte at the bar.  Their menu changes seasonally, so we'll definitely be back!", "rating": 5, "date": "2015-03-07"}, {"excerpts": ["The best dishes we had were the pig fries, the treasure chest, the pork and rabbit sausage, lamb merguez and pineapple confit tart. "], "author": "Stella J.", "review": "I haven't tried state birds yet so I can't compare it to that like everyone else. I got really lucky one day when I was looking for a reservation online and managed to score one on 2/4 @830. I like the interior decor it's really nice and modern. \n\nMy boyfriend and I decided to do family style and we ordered 6 dishes and a dessert. The snack platter that we had was delicious, everything we had went well together. It was a great start. The best dishes we had were the pig fries, the treasure chest, the pork and rabbit sausage, lamb merguez and pineapple confit tart. All had impeccable flavors and were cooked to perfection.\n\nI would say the dishes we didn't like were the grilled niman beef and the roti with buttermilk truffle sauce. The beef didn't feel like it was top quality, it was a bit tough and bland. As for the roti it was decent but the sauce didn't have much flavor. I would have preferred roti with curry sauce instead. \n\nOverall, a great experience but the two dishes we had was a bit disappointing. I would definitely come back again to try more dishes. Hopefully the menu changes again soon and they add more dishes. \n\nTotal for 2 w/ tax and tips: $170", "rating": 4, "date": "2015-02-17"}, {"excerpts": ["Lamb Merguez) and left about 1/3 to 1/2 of each dish uneaten. \n\n"], "author": "Ihno L.", "review": "Competent, but very overrated. Dishes are overly complicated with too many bells and whistles. It felt like the chef got carried away with an idea and just kept adding More and More and More -- when a little (or a lot of) restraint would have gone a long way. Of the 4 dishes we chose, we didn't finish 2 of them (1: Fried Rice w/ Duck, 2: Lamb Merguez) and left about 1/3 to 1/2 of each dish uneaten. \n\nThe best things we had were the starters, especially: Dates with Hazelnut Crema, and the Fried Chicken Karage with Umeboshi Vinaigrette. Both were very minimalist, but had great flavor.\n\nThe clementine almond cake dessert was surprisingly Not Good. While the cake itself was executed brilliantly, almond and clementine Do Not play well together. The tables next to us seemed to agree, as we saw huge portions of almond cake left uneaten.", "rating": 3, "date": "2015-12-23"}, {"excerpts": ["Lamb merguez with yellow eye beans, octopus & crispy squid\n6) BN ranch beef with dill pickle-chanterelle butter\n\nSad to say, "], "author": "Tiana C.", "review": "My friend and I were looking forward to our meal here. But we were both fairly disappointed with the meal. \n\nMeal:\nStarter: Complimentary appetizer\n1) Thai basil-curry oil marinated raw albacore, beets & pickled peppers served with a bowl of charentais melon-ginger soup\n2) Local anchovy & smoked trout 'stuffed' corno di toro pepper\n3) pig fry 'charcuterie' salad with fish sauce & herbs\n4) Stewed veal shoulder  \"blanquette' with roasted cauliflower mushrooms\n5) Lamb merguez with yellow eye beans, octopus & crispy squid\n6) BN ranch beef with dill pickle-chanterelle butter\n\nSad to say, my favorite dish was the starter that was complimentary and the pig fry. That had very nice balanced flavors. Other than that, everything else was underwhelming.\n\nI won't be coming back to this restaurant.\n\nFood: 3/5\nService: 4/5\nAmbiance: 4/5", "rating": 3, "date": "2015-09-25"}, {"excerpts": ["Actually, towards the last 2 dishes, I barely sampled them because I was reaching full stomach capacity, and they happened to be the most salty of dishes (chicken with eggplant vinaigrette and lamb merguez). "], "author": "Rita L.", "review": "My favorites of the night were the black fried rice oysters, the prawns, and the roasted figs with fondue. The other dishes were alright and were very distinct from one another, but this meal as a whole did not really leave me wanting more, which is shame for the $$$$ tag. Overall, I did enjoy the meal, but I will more likely go back to the sister restaurant next door. I did leave pretty full, so I thought the portions were just right for our group of 4. Actually, towards the last 2 dishes, I barely sampled them because I was reaching full stomach capacity, and they happened to be the most salty of dishes (chicken with eggplant vinaigrette and lamb merguez). Cocktails were tasty.\n\nAtmosphere was young and cool, and it's more fun to dress up, but if you come in casual wear, it's ok, no one will stare you down. Service was pretty good (there was a surprise service charge). Restrooms were amazing (so sparkly) despite the line for 3 unisex bathrooms. I appreciate the fact that we were maybe 15-20 mins late for our reservation and they didn't make it a big deal.", "rating": 4, "date": "2015-08-19"}, {"excerpts": ["The other yummy dish was the lamb merguez with yellow eye beans, octopus and crispy squid, which was soooo heavenly. ", "Everything on this dish was seasoned well. ", "I was really surprised at how delicious the crispy squid was! "], "author": "Jen N.", "review": "2.5 stars \n\nAmbiance was welcoming with high ceiling and natural light. Service was superb. The food was where it went right at the first dish and then wrong, wrong, wrong, wrong, and WRONG until the 6th dish. \n\nThe first yummy dish we had last night was the spiced don watson's lamb tartare. I have never had rare lamb before and this was a delightful experience. The lamb was very fresh and I recommend this dish to anyone who enjoys tartares. The other yummy dish was the lamb merguez with yellow eye beans, octopus and crispy squid, which was soooo heavenly. Everything on this dish was seasoned well. I was really surprised at how delicious the crispy squid was! It was yummier than the octopus, which was already waking up my taste buds from the NOT-SO-YUMMY dishes! \n\nHowever, the 2nd all the way to the 5th dish was not up to par to the expectations I had of this place. The dishes were:\n\n1) Pig fries -- go to your local Chinese butcher shop. They will sell you more tastier pig ears for less than $5! \n\n2) Black rice fried butter clams-kimchi 'picatta' -- WHAT IN THE WORLD WAS THIS?! My eyes were confused and my tastebuds were scarred from this weird texture. It looked like dried poop sprinkled with black sesame seeds. \n\n3) 'Treasure chest' of fermented sausage, trout quenelles and sweet onion-rice dumpling -- I HATED HATED HATED THIS DISH. If you ever had Vietnamese nem nuong (grilled pork) you would probably call this a poorly-made-white-person-who-lost-his-taste-buds-at-11-years-old version. Ugh. So gross. I was ALMOST ashamed of myself for finishing it. \n\n4) Grilled guinea hen with eggplant vinaigrette -- I wanted to like this dish like my boyfriend did, but there was just something off about it. Perhaps the vinaigrette made the meat not taste fresh to me or something, but I was over it after just one bite. \n\nSadly, even the dessert was BLEH. We had the Santa rosa plum and strawberry cake, as well as, the malted stracciatella ice cream -- both were not memorable. I was disappointed and felt extremely underwhelmed by the food here. My boyfriend, who isn't a harsh critic as me (he's a mountainman who eats dehydrated food as much as you and I inhale h2o), said that he wasn't feeling the food either. \n\nOverall, I would label this a wannabe Asian-Mexican Fusion with American Preparation-Style restaurant. Emphasis on the wannabe and American parts. Tip to the chefs: you should reallyyyyy make the food the way it is supposed to taste. As a Vietnamese girl who cooks authentic Vietnamese food and comes from four generations of chefs, I suggest using the smelly fish sauce, oyster sauce, sesame oil, shrimp/crab paste... etc... Once you get over the not-so-pleasant smell, you will realize that these sauces and pastes will add more flavors to ANYTHING that you make -- even lazy dishes like instant noodles.", "rating": 2, "date": "2015-07-01"}, {"excerpts": ["\"The Roti, Razor Clams, Rabbit and Pork Meatballs, Tofu & Cod, Lamb Merguez and dessert please."], "author": "Amy C.", "review": "\"Why are we going on a Wednesday?\"\n\"Because they are always booked on the weekends.\"\n\"Can I wear jeans?\" \n\"Yes.\"\n\n\"Where is it?\"\n\"It's near the place we went to with the dimsum like carts.  They had the quail.  And the rhubarb soda.  Remember?\"\n\"I don't remember the place but I remember the rhubarb soda.\"\n\n**********\n\n\"What's the address?\"\n\"1525.\"\n\"Yes, this is it. Pretty crowded.\"\n\"Party of 2 for 7:45pm.\"\n\n\"Cool space!  Looks like there's a second floor.  I wonder what was here before.  I like those light fixtures.\"\n\"Google says it used to be a theater.\"\n\"That must have been a LOT of renovating.\"\n\n\"Choose your own adventure. That's fun!\"\n\"$65 per person for 6 dishes isn't bad.\"\n\"The Roti, Razor Clams, Rabbit and Pork Meatballs, Tofu & Cod, Lamb Merguez and dessert please.\"\n\n\"Damn, it's loud.\"\n\"The staff here is awesome!  They just pitch in wherever. Genuinely friendly.  Cool but not trying to be, you know?\" \n\n**********\n\n\"Fancy platter!\"\n\"These toothpicks are perfect for miniature sword fighting. En garde!\"\n\"Which amuse bouches did you like the best? I liked the tempura oysters.\"\n\"The beef jerky. Tasted like kalbi.\"\n\n\"Which dish did you like the best?\"\n\"They were all gorgeous, creative and yummy.  Probably the Razor Clams or the Meatballs. The Roti was good.  I liked the Tofu and Bok Choy but the Cod was too salty for me.  I was too full to appreciate the lamb dish.\"\n\"I liked the actual dishes.\"\n\"Me too.  Never thought I'd see you show interest in some plates.\"\n\n\"And dessert?\"\n\"The Caramel Cloud thing reminded me of Bi-Rite's salted caramel ice cream so instant love.\"\n\"What about the kumquat cake?\n\"Interesting idea but not for me.\"\n\n\"Aren't you going to check out the bathroom? It's cool.\"\n\"Nope. I only go to the bathroom when I actually need to go to the bathroom.\" \n\"You're missing out.\"\n\n**********\n\n\"Worth the hype?\"\n\"Definitely. Also it got us out on a weeknight. We're wild and crazy!\"\n\"You mean we're old and married.\"\n\"That too.\"", "rating": 5, "date": "2015-05-17"}, {"excerpts": ["Lamb merguez: Meaty and tasty, lots of different flavors and textures\n- Amouse bouche: "], "author": "Wendy L.", "review": "It seems as though a reservation at State Bird is the impossible get and Progress, their new prix fixe restaurant, is the less impossible reservation to get. \n\nWe made a reservation far in advance and were so excited by the culinary adventures that awaited! \n\nMy favorite dishes of the night were as follows:\n- Pig fries with shaved cauliflower: I loved the variety of textures - the crunchy pig ears, the slightly wilted cauliflower. \n- Roti with ranch sauce: At its very core, this is bread and ranch. And what's not to like? But yes, a more sophisticated version of bread and ranch. \n- Lamb merguez: Meaty and tasty, lots of different flavors and textures\n- Amouse bouche: A delectable selection of tasty bites from jerky to tuna. \n\nGiven the quality of food and the price, Progress is a steal.", "rating": 4, "date": "2015-05-17"}, {"excerpts": ["- lamb merguez with yellow eye beans, octopus & crispy squid - my 3rd time with this dish, highly recommend \n\n- maitake, tofu curry & bok choy '"], "author": "Manda Bear B.", "review": "********************* 1275 **********************\n\n    New American restaurant The Progress serving inventive, family-style meals, farm-to-table with freshest ingredients, from the same kitchen as the State Bird Provisions team Michelin Starred Chef-owners Stuart Brioza and Nicole Krasinski. \n\n    I love the beautiful airy high ceiling that arches overhead, and the beautiful wood work on the wall, intensive labor work put into this beautiful, modern, but rustic The Progress. A large bar area with more than 20 seats, so without reservation, it's not a bad thing. The last few times I was here around 5:15 week nights, I got in. \n\n    The 90-seat dining room with a few more tables on the second level, usually fill up by 6 PM, and it's jam packed every night just like its sister State Bird Provisions next door. \n\n    The Progress serves bar menu and full dinner menu at the bar, so it's such a great option for diner like me CANNOT get any reservation from both restaurants :-) It's not a complain, in fact it makes me more excited and a little adrenaline rush with the thought that I couldn't get any seat even at the bar, haha. That was how I feel about last night dinner with my best friend in town. \n\n   Luckily chef Stuart Brioza was in, what a treat for my best friend and my visiting somm friend from NYC. \n\n   Love the concept of 6 dishes for $65 per person, and each additional dish for $10, plenty of delicious food to share, reasonable price point, great concept and execution. \n\n- spot prawn - was so delicious\n\n- shaved cauliflower-herbs & pig fries\n\n- spiced lamb tartare - I had this dish 3 times now, and loving it each time more.\n\n- raw japanese snapper - beautifully presented as good as it looks.\n\n- porcini & mt. tam dumpling with nettle salsa verde - newest dish in APR 2015, refreshing.\n\n- pecorino 'roti' with perigord truffle buttermilk - a MUST TRY\n\n- roasted mushrooms & kale with local wakame kraut - I had this dish 3 times and will continue order it as long as it's on the menu, a great choice for vegetarian.\n\n- butter clams on the half shell with kimchi piccata & shungiku\n\n- Spanish  barnacles - it was so delicious and I came back last night, it was gone!  \n\n- black butter butternut squash with caramelized onion & swiss chard\n\n- polpette of guinea hen & pork with blood orange & castelvetranos - another FAV dish of mine. \n\n- lamb merguez with yellow eye beans, octopus & crispy squid - my 3rd time with this dish, highly recommend \n\n- maitake, tofu curry & bok choy 'stir fry' with smoked black cod ponzu - reminds me of Chinese cuisine.\n\n- aromatic spiced squab with salted chili paste - reminds me of a Vietnamese dish that I had when I was growing up. It got the 5 spice flavor, the meat was so tender, delicious, I forgot when was the last time the squab could taste that good.\n\n- grilled Five Dot Ranch beef with mustard-miso oyster sauce - this was the only dish that wasn't my style :-) but my friends love it! I prefer my beef/steak with less sauce on it. \n\n    The cocktail list is also good. I presonally enjoyed the Paloma (reposado tequila, pomelo, lime, sugar, madras curry tincture) recommended by our server Kelly.\n\n  The wine list was delicious by Sommerlier Jason Alexander, if you are a wine lover, collector, or a somm, you would enjoy this list tremendously. He offers wines of the world, beautiful white Burgundy, the grower Champagnes, Rieslings, and plenty of French, Italian and Spanish red for under $70 bottles! And if you are a collector, check out the Cellar Selection, I'm in love! \n\n    The service by Eric last time at the dining room was excellent. The last 2 times at the bar was equally fantastic, attentive, caring, and purely enjoyable for us. \n\n    I'm looking forward to my next visit to explore the ever evolving menu daily and the wine list to pair with it. \n\n    Again, congratulations The Progress, San Francisco for being Jame Beards Foundation Award Semifinalists 2015, and I'm sure many accolades to come. \n\nNOTE: no valet parking, come at 5 PM on week night, you will surely get in at the bar!", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["Lamb merguez with yellow eye beans, octopus and crispy squid -- Favorite dish of the night\n", "* ", "Lamb merguez with yellow eye beans, octopus and crispy squid - Love this dish!!\n\n"], "author": "Christina W.", "review": "Went to The Progress 2x in 2 weeks and both times the food really hit the spot! Tried both the family style menu and The Bar a la carte menu and both times did not disappoint. \n\nWe were lucky to snag a 7pm reservation on Friday night. We opted to do the 6 course family- style menu ($65/person + $10/additional dishes). We had the following:\n\n* Amuse Bouche (complimentary)\n* Sea urchin & anchovy \"stuffed\" corno di torro pepper\n* Baby abalone with brown butter & tiny garden vegetables\n* Spiced eureka ling cod, blistered romanos & jimmy nardello verjus\n* Lamb merguez with yellow eye beans, octopus and crispy squid -- Favorite dish of the night\n* Veal schnitzel with dandelions, crescenza & green apple sauce\n* Red duroc pork with dill pickle chanterelle butter\n\nWe were stuffed after the 6 course dinner. Each of the dishes were wonderfully prepared and the flavors blended so well. The lamb  is a MUST have. The combination of flavor in that dish is just Ah-Ma-Zing! I've tried SBPR next door, and I enjoy the flavors of The Progress more.\n\nWe also tried walking in to the bar the following week. Didn't have a reservation, but we were lucky enough to wait only 5 minutes before we were seated.\n\nThe bar menu is slightly different than the family style menu. There were $5 provisions / $10 cold & hot / $20 plancha and grill. We had the following at the bar:\n\n* Curried Malaysian pork jerky with crushed peanuts - Delicious!\n* Lap cheong with salted chili paste\n* Raw HMB halibut with turnips & creme fraiche - Tasted a little bland \n* Devil's gulch rabbit with eggplant vinaigrette & black eyed pea salsa verde\n* Lamb merguez with yellow eye beans, octopus and crispy squid - Love this dish!!\n\nThe bar seating is suited when you aren't too hungry! Flavors and service is just as great as the family-style menu. The waiters and bartenders were really friendly at the bar too. Would definitely return again!", "rating": 5, "date": "2015-09-20"}, {"excerpts": ["Lamb Merguez, yellow eye beans, squid and octopus 3) Grilled Beef miso mustard oyster sauce. ", "Of the 3 the Merguez and seafood was the best dish but the octopus was a bit overcooked. ", "The Beef I had thought was going to be a flavor bomb but was pretty light and nice surprise ", "but it didnt deliver that flavor punch I wanted and might have been sous-vide just a bit too long as it lost its creaminess from the fat and was somewhat dry if not for the abundance of sauce. "], "author": "Michael B.", "review": "3.5 Stars\n\nIt was a good meal with good service and very innovative dishes. Ultimately I prefer State Bird over The Progress in terms of the overall experience. I do like how The Progress is laid out, the space is unique and efficiently designed, much roomier than it cohort next door, SBP with really cool balconies too!\n\nAs for the food I think if I went with just 1 other person I would have been more satisfied as I feel for each additional person they wasnt a full additional portion to go with. What I found awesome was as soon as we ordered they dropped a huge plate of \"snacks for the table.\" There were some great goodies in this amuse plate. The standouts to me were the poached leeks with trout roe, the spiced chicken jerky, and the squad pate.\n\nAs for dinner we had the following 6 courses in this order. They actually came out in two groups of three. First group was 1) kiwi and ricotta 2) black bass with turnips 3) Pecorino Truffle Roti. The Kiwi and Ricotta was absolutely amazing so fresh, so well balanced. The Black Bass was another huge hit, perfect smoke on the fish, reminded me of the smoked sturgeon dish we had at State Bird months ago and equally as good. The Roti was lackluster, the buttermilk truffle sauce was kinda bland and borning.\n\nThe next three dishes wew 1) Polpette of Rabbit and Pork 2) Lamb Merguez, yellow eye beans, squid and octopus 3) Grilled Beef miso mustard oyster sauce. Of the 3 the Merguez and seafood was the best dish but the octopus was a bit overcooked. The Beef I had thought was going to be a flavor bomb but was pretty light and nice surprise but it didnt deliver that flavor punch I wanted and might have been sous-vide just a bit too long as it lost its creaminess from the fat and was somewhat dry if not for the abundance of sauce. The polpette had flavor and were tender but lacking any cohesiveness to the dish and were dry as well.\n\nMy \"Jim\" drink I had was fabulous as were my counterparts mocktails. I'd give it another go again but it didnt live up to the hype or my expectations", "rating": 3, "date": "2015-02-16"}, {"excerpts": ["The lamb merguez with octopus & crispy squid was very nicely cooked, just not particularly standout in its combination.  ", "Lastly, our 'treasure chest' of fermented sausage, "], "author": "Eric F.", "review": "Huge props to Ruobin W. for helping us score a weekend reservation at the awesome new addition from Stuart Brioza & Nicole Krasinski behind the beloved State Bird Provisions.\n\nThe atmosphere is largely reminiscent of SBP with a nice mix of modern and eclectic.  Everything is served family-style with a minimum commitment of 6 courses at $65/person and going up from there depending on your appetite.\n\nWhile everything was derricious, there were a number of notables like the exquisitely soft smoked duck and marinated yellowfoot mushrooms & dried plum.  Meaty, earthy awesomeness with some lovely acidity for balance.  The shaved cauliflower-herbs & pig fries tasted like they were just pulled from the garden hours before and I loved the variety of porcine parts used for the fries to provide a little surprise from piece to piece.\n\nFor the vegetable-inclined, the black butter butternut squash with caramelized onion & swiss chard turned out to be surprisingly hearty in addition to its depth of flavor accentuated by the soft sweetness of the onions.\n\nAnd that aromatic spiced squab with salted chili paste...ri-freaking-diculous!  Anyone familiar with Chinese squab preparations will remember that the birds far more often than not turned out dry and bland.  In this case, the tenderness and moisture upon first bite made us all seriously question if it was real squab.  Cray?  Yes.\n\nThe polpette of rabbit & pork with blood orange was solid though the former component was difficult to discern.  A good mix of savory flavors and citrus acidity.  The lamb merguez with octopus & crispy squid was very nicely cooked, just not particularly standout in its combination.  Lastly, our 'treasure chest' of fermented sausage, trout quenelles & pumpkin-rice dumpling in a 'creamy' pork broth was certainly unique.\n\nAs for sweet offerings, they were all fantastic with the combination of milk chocolate-black lager ice cream, cocoa sable & caraway seed being very much reminiscent of the bird's nest dessert aka crack in a bowl at SBP.  Get it.\n\nService here was good though quite a bit more distant than at SBP where there's so much more interaction with the staff presenting the vast array of plates.  Overall, the food here is top notch and absolutely on par with its big sibling next door.  However, the value has some room for improvement as our meal turned out to be comparable if not more than some 1 star Michelin spots.  Apples to oranges, sure, but still something to bear in mind.", "rating": 4, "date": "2015-03-14"}, {"excerpts": ["Lamb merguez = ", "nothing special really, the beans were the best part of this dish\n- Polpettes = unique flavors, but they're really just meatballs\n", "- Butternut squash = ", "Great squash, but was super salty in my opinion"], "author": "Ruobin W.", "review": "Yeah, this place is so... wow. I definitely enjoyed my experience here, but when I say it's once in a lifetime, I really mean you should just come here once. \n\nThe good: \n- Complimentary appetizers = best spelt I've ever eaten with other treats to whet your appetite.\n- Smoked duck = super tender and complemented by the mushrooms/plums\n- Pig fries = awesomely crunchy/not as salty as expected\n- Spiced squab = how the hell do they keep it so moist?\n- Treasure chest = loved the tonkotsu broth, tasty sausages and mochi\n- All the desserts = perfect set of sweets for every personality. black lager ice cream was amazing, the buddha cake was light and fluffy, and the elderflower island was an amazing mixture of sweet flavors\n- The service = prompt and frequent water filling\n\nThe ok:\n- Lamb merguez = nothing special really, the beans were the best part of this dish\n- Polpettes = unique flavors, but they're really just meatballs\n- Butternut squash = Great squash, but was super salty in my opinion", "rating": 4, "date": "2015-03-12"}, {"excerpts": ["Lamb merguez with calamari and octopus.  ", "The last favorite of the meal.  "], "author": "Adam O.", "review": "Ate at this fantastic new joint on the last night of a recent sojourn out to the Bay area.\n\nBy now, the story is known.  Family style meals.  6 courses for 65.00 a person with a few snacks thrown in for good measure.  At the end of the day, feels like a steal.\n\nWe went all savory, after spending the afternoon hiking the Presidio and eating Bi-Rite ice cream.\n\nHad the following:\n\n1. Black rice fried oysters with kimchi \"picatta\".  One of my 2 favorite dishes of the night and one of the best plates of food I had in a week laced with exceptional food. \n\n2. Potato sauerkraut dumplings with plum preserves.  And....my other favorite dish of the night.  Simple, and absolutely delicious.  \n\n3. Abalone.  Great ingredient.  Wasn't overly fond of the preparation.\n\n4. Oven roasted maitakes.  Good rule of thumb is that everything roasted in a wood oven simply tastes better.  These were incredibly tasty, yet the dish was slightly one note to me.  Then again, mushrooms are not my favorite ingredient.\n\n5.  Ling cod with black garlic and smoke potatoes.  Fish was slightly overcooked, but a very flavorful dish.\n\n6. Lamb merguez with calamari and octopus.  The last favorite of the meal.  Delicious smorgasbord in a bowl.\n\n\n\nWine list was very good and helped myself to a few glasses.  Would have been nice to see an expanded beer list given the great selections to choose from in the Golden State (I'm looking at you Pliny).\n\nVery good service, and one of the 3 best meals I had on the entire trip.  Can't wait to eat at SBP next time..", "rating": 5, "date": "2015-10-22"}, {"excerpts": ["(Lamb merguez and guinea hen). ", "Standouts were the roasted fig with cheese fondue sauce and prawns. ", "Those were excellent!  ", "Nice presentations, good atmosphere, good service, but not memorable enough for me to return especially with statebird next ", "door- so much better! ", "Prob won't be back."], "author": "Vivian D.", "review": "Finally made it to the Progress after months of trying to book it and man I'm so disappointed. There was one or two stand out dishes but the last two dishes we got were just sooooo salty that I couldn't enjoy them anymore. (Lamb merguez and guinea hen). Standouts were the roasted fig with cheese fondue sauce and prawns. Those were excellent!  Nice presentations, good atmosphere, good service, but not memorable enough for me to return especially with statebird next door- so much better! Prob won't be back.", "rating": 3, "date": "2015-08-18"}, {"excerpts": ["Lamb Merguez\n", "5th: ", "The lamb merguez was just okay, and the treasure chest didn't quite work for me.  "], "author": "Andrew W.", "review": "When I heard that the guys from State Bird Provisions were opening up a new spot called, The Progress, I had to first look up what the heck State Bird Provisions was.\n\nAfter seeing SBP's accolades and reading how difficult it appeared to get a reservation there, I figured that I should check out The Progress and brag about it to all my friends, or at least check-in on Facebook and get those likes!\n\nIt was surprisingly easy making a reservation the night before, for three people at 8:00pm on a Monday evening.  When we arrived, we checked our backpacks into their complementary coat check.  The hostess notified us that our table wasn't ready yet, but I found out why, later.  So, we waited around for about 25 minutes until we were seated upstairs.  The restaurant space definitely opens much larger than what the entrance way initially revealed.\n\nTheir drink menu had many flavorful beer options.  To be honest, I was a little skeptical of the six-course family-style menu, particularly, with its sufficiency.  I went to the gym earlier, so I was carrying a voracious appetite, and I've been burned too many times before, leaving somewhere hungry after blowing through plate after plate of $15 \"tapas.\" But this was not the case here-- at the end of the meal, I was thoroughly stuffed.  Let's go to the tape!  (disclaimer: I can't remember what they called each of their dishes, but I'll try to describe what we selected as best as I can)\n\nBanchan\n1st:  Asparagus with Mascarpone\n2nd: Mushrooms & Kale\n3rd: Treasure Chest a/k/a sausage in a \"6-hour\" tonkatsu\n4th: Lamb Merguez\n5th: Lobster & Bok Choy\n6th: Spiced Squab Lettuce Wraps\n\nEvery dish had an interesting ethnic influence. The highlights were 1) the asparagus, which started off our meal with a blast of sweet and savory freshness, 2) the mushroom-kale, packed with flavor and fiber, and 3) the lobster, cooked to juicy perfection.  The lamb merguez was just okay, and the treasure chest didn't quite work for me.  The tanginess of the sausage and the creamy tonkatsu was a strange combination.\n\nWe ended up finishing our meal somewhere close to 11:00pm.  Each course came out at a leisurely pace, giving us ample time to dissect and digest each complex creation.  Thankfully, I had nothing important to do the next morning, so this wasn't a problem for me.  I would definitely suggest allotting about two hours when eating here.\n\nOverall, The Progress was a very enjoyable dining experience.  It looks like the menu changes frequently, so I'll have to come back again!", "rating": 4, "date": "2015-03-13"}, {"excerpts": ["Between the ling cod, whitefish, fried oysters, chicken broth, and lamb merguez, I guess the best dish was the chicken broth.  ", "Perhaps we simply chose poorly.  ", "The portion sizes were pretty generous, though, as we were both stuffed after the meal.  ", "Overall, The Progress was slightly disappointing, especially given the inevitable anticipation that builds up from having to book a table so far in advance."], "author": "Simon L.", "review": "Spacious restaurant with a nice ambiance.  The waiter was extremely attentive and helpful.  Similar to State Bird, all of the dishes seemed very carefully and thoughtfully assembled.  Whereas I truly enjoyed a few of the dishes at State Bird, however, none of the six family-style dishes we shared at The Progress were memorable.  Between the ling cod, whitefish, fried oysters, chicken broth, and lamb merguez, I guess the best dish was the chicken broth.  Perhaps we simply chose poorly.  The portion sizes were pretty generous, though, as we were both stuffed after the meal.  Overall, The Progress was slightly disappointing, especially given the inevitable anticipation that builds up from having to book a table so far in advance.", "rating": 3, "date": "2015-12-13"}, {"excerpts": ["Hearty honorable mention to the grilled Llano Seco pork and lamb merguez with octopus and crispy squid.\n\n"], "author": "Veronica S.", "review": "All I can say is WOW. From the moment we walked in to this time we left 3 hours later - absolutely magical. Even before we got there, I called to add 2 people to our reservation and they couldn't have been more accommodating - a great surprise from such a popular restaurant. They were equally gracious when I called back the next day to remove them. Just nice, nice to deal with.\n\nNow to the evening - can only comment on one cocktail, their beyond smooth, absolutely phenomenal Manhattan. Let's say we kept them coming all night!  Much to our head's chagrin the next day!\n\nFood:\nOf the starters, all delectable, but the carrots with curried yogurt, the buttermilk biscuits with apple bourbon black butter and the fish fry's kimchi tartar sauce knocked our socks off!\n\nQuick note on the cunningly titled Western Additions, the uni guacamole with tomato vinaigrette and rice crackers defies description. One of my favorites of the evening\n\nMains, again phenomenal. The Sunchoke Roti wins other favorite of the evening - puffy, crispy Roti that deliciously disappeared in my mouth. Hearty honorable mention to the grilled Llano Seco pork and lamb merguez with octopus and crispy squid.\n\nFun (and accommodating staff), a signed menu for my husband's birthday. A perfect evening!", "rating": 5, "date": "2016-01-10"}, {"excerpts": ["Lamb merguez with squid and octopus - squid was great ", "but so much cilantro you could barely taste anything else. ", "Literally hard to eat without picking it out. \n", "Dessert - we tried both the poppyseed angel cake and dates a la mode. "], "author": "Mike M.", "review": "Ehhhhhhhhhhhh.......So maybe we've been spoiled by the amazing food at State Bird but I found The Progress totally underwhelming. It's a fun ambiance but the food and service were both equally inconsistent. We were all quite excited to try this place but came away calling it \"The Regress.\"\n\nThe good stuff: \nLamb tartare - this was by far the best dish we had. Great presentation, fresh ingredients served table side and a unique take on typical steak tartare. MUST HAVE. \nSnapper - served with delicious squid ink chips. A little small for a family style dish but quite good. \nMorels with egg yolk - one of the better mushroom dishes I've ever had but also quite small\n\nThe disappointments: \nBeef - tough, lacked flavor besides salt, boring greens to accompany\nLamb merguez with squid and octopus - squid was great but so much cilantro you could barely taste anything else. Literally hard to eat without picking it out. \nDessert - we tried both the poppyseed angel cake and dates a la mode. Some of the least memorable/creative desserts I've had in a while (were an additional $10 each)\n\nPortions were all quite small for family style and our entire group was universally hungry after dinner. For $250+ per couple there are a thousand better places in San Francisco.", "rating": 3, "date": "2015-04-10"}, {"excerpts": ["Lamb merguez with squid and octopus - leave out the crappy lamb sausage and you'd have a stellar dish. \n\n"], "author": "Daniel K.", "review": "After having been blown away by State Bird I was expecting a lot from the Progress. But of the 6 dishes we got, I'd say 2 were excellent and 4 were decent, but had flaws. \n\nHighlights: the morels - wow. An incredibly memorable dish. Best thing we had. And I am definitely a meat person. But these models had such fantastic smokey flavor and texture. Best dish. Also the pig fries were great. A bit heavy on the acid, but overall delicious. \n\nOk-lights: pea and cheese dumplings. Missing any bite. Needed some seasoning. Razor clams - again. Nothing to write home about. The kimchi piccata was average. And the clams were unexciting. Treasure chest - way way too salty.  Hard to put down. Sausage texture was not pleasant. Lamb merguez with squid and octopus - leave out the crappy lamb sausage and you'd have a stellar dish. \n\nFor a restaurant with a lot of hype and a decent price tag, I expect more. \n\nOh and the house soda was delicious.", "rating": 3, "date": "2015-04-25"}, {"excerpts": ["Food adventure became a party in the mouth with each of my five favorites: 1) first of the season asparagus with lime pickle yogurt & pistachio, 2) smoked duck with marinated yellow foot mushrooms and dried plum, 3) raw black bass with turnips and creme fraiche, 4) black butter butternut squash with caramelized onion and Swiss chard, and 5) lamb merguez with yellow beans, octopus & crispy squid. ", "So full could not finish the enjoyable lamb merguez dish, we opted for no dessert or after dinner beverages and waddled out. ", "In fact, my stomach still feels full this morning."], "author": "Nancy D.", "review": "Wow! One of the most creative and inventive delish San Francisco food experiences ever. How does the team even conceive these food combinations? Excellent service, space and vibe. Noise level high. \n\nFood adventure became a party in the mouth with each of my five favorites: 1) first of the season asparagus with lime pickle yogurt & pistachio, 2) smoked duck with marinated yellow foot mushrooms and dried plum, 3) raw black bass with turnips and creme fraiche, 4) black butter butternut squash with caramelized onion and Swiss chard, and 5) lamb merguez with yellow beans, octopus & crispy squid. My least favorite: 6) pecorino 'roti' with perigord truffle buttermilk--while the flavors were wonderful, I didn't care for the texture of the 'roti'.\n\nCocktails: Sunny Jim - addictively refreshing! \n\nDiners start off with a surprise eclectic dish of small bites, nice touch! \n\nSo full could not finish the enjoyable lamb merguez dish, we opted for no dessert or after dinner beverages and waddled out. In fact, my stomach still feels full this morning.", "rating": 5, "date": "2015-03-19"}, {"excerpts": ["4/5\nLamb merguez. ", "Best dish. ", "4.5/5\nPomelo ice cream. ", "Mochi was disappointing. ", "4/5\n$95/person with tip/cocktails"], "author": "Olivia Q.", "review": "Food overall: 3/5\nGrilled beef. nothing interesting. 2/5\nBlack truffle roti. Plain. 2/5\nRavioli: 4/5\nLamb merguez. Best dish. 4.5/5\nPomelo ice cream. Mochi was disappointing. 4/5\n$95/person with tip/cocktails", "rating": 3, "date": "2016-01-21"}, {"excerpts": ["We had (in rankings of our favourite to least):\n\n- lamb merguez with yellow eye beans, octopus & crispy squid - a lot of flavor and texture\n\n- raw japanese snapper with turnips & crème fraîche -- light and had a nice wasabi taste, really understated\n\n- aromatic spiced squab with salted chili paste - cooked very well, tender meat which is hard to do!\n\n- shaved cauliflower-herbs & pig fries - I liked this a lot, the fries were not very fried (which I disliked), and a lot of flavor. "], "author": "Yan K.", "review": "A very pleasant experience at The Progress. We had (in rankings of our favourite to least):\n\n- lamb merguez with yellow eye beans, octopus & crispy squid - a lot of flavor and texture\n\n- raw japanese snapper with turnips & crème fraîche -- light and had a nice wasabi taste, really understated\n\n- aromatic spiced squab with salted chili paste - cooked very well, tender meat which is hard to do!\n\n- shaved cauliflower-herbs & pig fries - I liked this a lot, the fries were not very fried (which I disliked), and a lot of flavor. My boyfriend wasn't a fan as he thought it was too acidic\n\n- 'treasure chest' of fermented sausage, trout quenelles - as Asians, suppose we thought it wasn't too special. The chinese sausage we have all the time (and we didn't even think it was the best type), but the pumpkin mochi was good. Nice to have a soup during the meal\n\n- smoked duck with marinated pioppini mushrooms & dried plum - we both thought not too memorable\n\nWe also ordered a serving of the dessert (poppyseed angel food cake) to share for the two of us, which is what the server recommended. It was fine - we wanted a dessert to round out the meal, but also wasn't super memorable.\n\nService was fast, it took 2 hours for our meal, even though the food came out quickly. Decent value for a high-end restaurant. Portions were adequate, we felt full but not stuffed after the 6.5 courses.", "rating": 4, "date": "2015-04-05"}, {"excerpts": ["The best was the lamb merguez with yellow eye beans, octopus & crispy squid. ", "Probably the best dish I have had in the last few years anywhere.  ", "The  different flavors and textures matched perfectly.  "], "author": "Mike W.", "review": "The Progress absolutely lived up the hype and met our lofty expectations.  Our service was great,--friendly and attentive. All the dishes were explained when requested and we were given advice on which dished to order so as to not have too much or not enough food.\n\nWe had six dishes, no extras and no dessert.  The best was the lamb merguez with yellow eye beans, octopus & crispy squid. Probably the best dish I have had in the last few years anywhere.  The  different flavors and textures matched perfectly.  An absolute standout dish.  \n\nNext best was the roasted mushrooms & kale with local wakame kraut.  Seemingly so simple but incredibly flavorful.\n\nNext best was the shaved cauliflower-herbs & pig fries, pretty fantastic as well.\n\nNext best was the smoked duck with marinated yellowfoot mushrooms & dried plum. \n\nThe only dish that disappointed for us was the grilled Five Dot Ranch beef with mustard-miso oyster sauce.  Something about this just didn't gel and for us it was fairly bland.  So overall 5 of 6 dishes were very good to excellent, with the top three above being pretty fantastic.  \n\nOnly tried one cocktail, the Paloma, which was well balanced.  \n\nThe Progress is definitely worth another visit as six dishes leaves many things untasted.  Highly recommend this place.", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["The main dishes, Steak Tartare, Ravioli, Yellow Tail and Lamb Merguez. ", "All were just okay. ", "All seemed to be missing something. ", "Nothing reached out. ", "More like just doing the motions. ", "Have had better Steak tartare, Ravioli was bland, Yellow Tail was almost steamed. ", "I think it needs a crust. ", "Lamb was a sausage link with a bunch of different items thrown at it. ", "Probably won't go back..", "Sad."], "author": "J G.", "review": "After going to State Bird which was spectacular, decided to try The Progress. Went to it hoping for the parallel experience. Hoping to be Wow'd. Sorry to say, we were not. We asked two of the staff members for their thoughts and picks. We picked two from each that came up. To our disappointment, there was no WOW! Just plain Ho-Hum. The appetizers were pretty non-flavorable. Radish with like everyday Goat Cheese, So So Chicken Nuggets, Dates that were mushy in texture, Ham and Yuba was like something from Whole Foods Deli area, Shiitake Mushrooms with Quinoa probably the best. Not Great. The main dishes, Steak Tartare, Ravioli, Yellow Tail and Lamb Merguez. All were just okay. All seemed to be missing something. Nothing reached out. More like just doing the motions. Have had better Steak tartare, Ravioli was bland, Yellow Tail was almost steamed. I think it needs a crust. Lamb was a sausage link with a bunch of different items thrown at it. Probably won't go back..Sad.", "rating": 3, "date": "2015-12-21"}, {"excerpts": ["Lamb merguez (sausage) was a winner. ", "State Bird quality there. ", "Cane with octopus which was cooked perfectly. ", "Liked sitting in the nook in the bar area but it got really loud. ", "$30 corkage fee! ", "Come on now. ", "$70 bill and left hungry. ", "I'll stick to State Bird."], "author": "Christina S.", "review": "If State Bird didn't exist, I'd give Progress a better review but alas I've been spoiled. Roti was yummy but you can't go wrong with fried carbs and cheese. Smoked duck just tasted like ham. Super small portion. Lamb merguez (sausage) was a winner. State Bird quality there. Cane with octopus which was cooked perfectly. Liked sitting in the nook in the bar area but it got really loud. $30 corkage fee! Come on now. $70 bill and left hungry. I'll stick to State Bird.", "rating": 2, "date": "2015-03-29"}, {"excerpts": ["We got the raw halibut, sockeye, everything roti, potato dumpling, lamb merguez, and BN ranch beef.  ", "I have to admit that the best part of the meal was the amuse bouche platter before our selections were brought out.  ", "$65/person plus a bottle of wine put us back a nice $260.  ", "Simply put: overrated and overpriced.  ", "Service was average, food was average, ambiance was average.  ", "I hate to say it, folks...", "The Progress is just...average."], "author": "Angela R.", "review": "I hate to give The Progress three stars, but the meal was just okay.  First off, the restaurant itself is simply beautiful!  Soaring ceilings, beautiful tables, chairs, etc.  The bar is also gorgeous.  The restaurant was packed at 8 pm on a Tuesday evening (not shocking for SF), and we waited about 15 minutes to be seated for our reservation.  We ordered cocktails as we waited and they were delicious (manhattans).  I love the idea of choosing your tasting in advance and we actually decided to skip dessert altogether.  We got the raw halibut, sockeye, everything roti, potato dumpling, lamb merguez, and BN ranch beef.  I have to admit that the best part of the meal was the amuse bouche platter before our selections were brought out.  $65/person plus a bottle of wine put us back a nice $260.  Simply put: overrated and overpriced.  Service was average, food was average, ambiance was average.  I hate to say it, folks...The Progress is just...average.", "rating": 3, "date": "2015-08-26"}], "maitake tofu curry  bok choy stir fry": [], "aromatic spiced squab": [{"excerpts": ["- Squab = aromatic spiced squab with salted chili paste. \n\n"], "author": "Owie N.", "review": "This is probably my favorite restaurant to recommend to any of my friends, which is why I'm shocked that I haven't post a review for it. \n\nThe Progress is absolutely delicious, creative, and unexpected. \n\nStraightforward, this is a family style menu that you get to pick and choose from 6 dishes for $65 per person. We ordered:\n\n- \"Treasured Chest\" = tasty pork broth with tender sausage and dumpling. Favorite entrée that night. \n\n- Squab = aromatic spiced squab with salted chili paste. \n\n- Pig fries = crispy, fried, and crunchy goodness. Love the addition of shaved cauliflower and herbs. \n\n- BN ranch beef = with grilled dandelion greens. The beef was tender and moist. \n\n- Smoked duck = I love anything with duck meat. \n\n- Lamb Merquez = with yellow beans, octopus & crispy squid. Portion was just right. \n\n- Dessert = simply delicious. \n\nEverything was amazingly scrumptious. The staff here was super friendly and helpful. I'll gladly return for dinner. Cheers!\n\nThe simple things in life.", "rating": 5, "date": "2015-11-05"}, {"excerpts": ["Aromatic Spiced Squab with Salted Chili Paste -- http://bit.ly/1HW03kN \n\n"], "author": "Rodney H.", "review": "Since I'm huge fan of State Bird Provisions, it was only a matter of time before I would finally have dinner at their sister restaurant, The Progress.  I just had to wait a couple of months for the hype to die down a little bit.  Surprisingly, it wasn't as difficult to land a reservation here than for State Bird.\n\nWhen you walk in, it's a much more grander scale than State Bird.  The decor is warm and looks a lot brighter.  Plus they have two upper balconies for dining.  The big difference with The Progress is that they have a full cocktail bar here with tables so you can dine at the bar as well.\n\nThe food menu is completely different and can hold it's own against State Bird.  Where State Bird is more of a dim sum and tapas style restaurant, the Progress has a more family style dining approach with a 6-course dinner.  While the experience is still similar, the food portions here are larger.  I dined here with a couple friends so sharing each dish between the three of us was pretty easy to do.  The only thing that did take a while was for us to decide which 6 dishes to pick for our dinner.\n\nHere's what we ordered:\n\nComplimentary \"Banchan\" --  http://bit.ly/1FnBuQb \n\nRaw Japanese Snapper with Turnips & Crème Fraîche -- http://bit.ly/1HVWSJL \n\nSmoked Duck with Marinated Pioppini Mushrooms & Dried Plum --  http://bit.ly/1yZ5FFK\n\nShaved Cauliflower-herbs & Pig Fries --  http://bit.ly/1yZ6zC7\n\nAromatic Spiced Squab with Salted Chili Paste -- http://bit.ly/1HW03kN \n\nLamb Merguez with Yellow Eye Beans, Octopus & Crispy Squid --  http://bit.ly/1HW1iAu\n\nDessert Assortment --  http://bit.ly/1DNhNkO\ndessert choose 1 per person\nlemongrass floating island, rhubarb sorbet & coconut-ginger gelée\npoppyseed angel cake, strawberries, sicilian pistachio & mascarpone\ndates à la mode, St. George NOLA, hazelnuts & chocolate\n\nSo much food!  And we enjoyed pretty much everything we ordered.  My faves were definitely the Smoked Duck which was similar to the duck I had back at State Bird minus the pancakes, the Pig Fries because of their sheer fried pork awesomeness,  and surprisingly, the Lamb Merguez with Octopus and Squid, simply because I'm not into lamb that much.  But somehow they found a way to bring that dish all together and the Lamb Merguez didn't have an overpowering lamb taste.  The dessert assortment, while good, was a little bit of a let down in comparison to State Bird's dessert offerings.  I might end up skipping dessert next time since it's optional.\n\nJust recently, they changed the food menu at the bar.  Though it's still a la carte, the portions are more tapas sized like State Bird and at more affordable prices.  So basically, you can get a \"State Bird\" experience at the bar.\n\nIs The Progress better than State Bird?  It's pretty close,  Food-wise they're almost equally impressive, but I still prefer the whole \"dim sum\" experience at State Bird to be more entertaining.   Nonetheless, The Progress is an amazing follow up from the State Bird Provisions team and I wouldn't hesitate to go back again to try their other dishes, just like I would with State Bird.", "rating": 5, "date": "2015-09-30"}, {"excerpts": ["*lamb merguez with yellow eye beans, octopus & crispy squid\n*aromatic spiced squab with salted chili paste\n", "The Lamb merguez came in a close second but all the food that came out was great!"], "author": "Mai W.", "review": "This place was a great dining experience. The drinks were great, the atmosphere was modern and of course the food was phenomenal.\n\nThe style of serving for this meal was very unique. You get a menu (much like dim sum places) and you mark of 6 dishes to share for the table. Everything is family style. You are not limited to choosing only six, you can add an additional dish for $10/person. The meal was $65/person which is not bad at all!\n\nFor our meal we chose:\n\n*smoked duck with marinated yellowfoot mushrooms & dried plum\n*shaved cauliflower-herbs & pig fries\n*pecorino 'roti' with perigord truffle buttermilk\n*lamb merguez with yellow eye beans, octopus & crispy squid\n*aromatic spiced squab with salted chili paste\n*grilled Five Dot Ranch beef with mustard-miso oyster sauce\n\nOur favorite by far was the Cauliflower and pig fries. The Lamb merguez came in a close second but all the food that came out was great!", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["Aromatic Spiced Squab w/ salted chili paste: ", "http://bit.ly/1C373N1\n*Grilled BN Beef w/ mustard-miso oyster sauce: http://bit.ly/1xsmZ9X\n"], "author": "Cherylynn N.", "review": "Wanna know what The Progress and Kim Kardashian have in common?\n\nI know its blasphemy to compare the two but hear me out... \n\nLove her or hate her, Kim K.  is the most talked \"celebrity\" in 2014; mainly for her arse on Paper Magazine that resembled a baboon's injected with an overdose of botox and covered in Crisco (she's absolutely beautiful nonetheless). As for The Progress, it's the most talked about restaurant opening in SF this year from the wildly popular, State Bird Provisions. \n\nCurrently, it's reservations only for the dining area. The bar has a tiny alcove for 4 diners with a limited food menu. I was a \"refresh\" maniac for the last 4 days so I was lucky enough to snag reservations when they went live on OpenTable on Tuesday; the same day as their grand opening. \n\nThe Progress' menu is Californian/New American and is served family-style. Items are available a la carte or choose any 6 courses for $65, and pay an extra $10 pp for each add'l course: http://bit.ly/1z10K6n. We choose to create our own tasting menu with 9 courses ($95 pp) and were full by the third course so I highly recommend coming in a large group so you can sample everything. \n\n~ * ~ F O O D ~ * ~\n*Amuse Bouche/\"Snacks\": Radish, Smoked Trout, Lop Cheong (Chinese sausage) & Broccoli Tempura: http://bit.ly/1z10K6n\n*Dried Duck w/ smoked prune romesco & almond: http://bit.ly/1C3ksEC\n*Shaved Cauliflower-Herbs & Pig Fries: http://bit.ly/1wmcjYI\n*Sunchoke, Rosemary & Smoked Cured Egg Roti: http://bit.ly/1zzZAl2\n*Spicy Dungeness Crab Ricotta Cavatelli: http://bit.ly/1zA52Wn\n*Smoked Black Cod Fried Rice w/ squid & chrysanthemum: http://bit.ly/1DQph6g\n*Lamb Scallopini w/ pea shoots & cipollini: http://bit.ly/13D5dV5\n*Aromatic Spiced Squab w/ salted chili paste: http://bit.ly/1C373N1\n*Grilled BN Beef w/ mustard-miso oyster sauce: http://bit.ly/1xsmZ9X\n*Persimmon Sorbet w/ gingered-coconut floating island & candied buddha's hand: http://bit.ly/1wPqog5\n\nI adored the quad of amuse bouches (\"snacks\" which was a great indicator of the great things to come. The smoked trout was so addictive that I could have annihilated an entire bowl of it. \n\nFor the appetizers, the standouts were the Shaved Cauliflower with pig fries and Dried Duck. The pig ears were gelatinously crunchy and really gave a delicious texture contrast to the cauliflower. The prosciutto-like Dried Duck was sublime when wrapped around the baby potato croquettes. \n\nThe Roti was carbliciously flaky with the smoked cured egg giving it an assertive saltiness. Make sure to eat this while it's still hot! We weren't too fond of the Crab Cavatelli as the tomato sauce overpowered the crab meat. Didn't like the green beans that were mixed in either.\n\nA must order, the Black Cod Fried Rice was aromatic and complex both in flavor and texture from the tempura calamari. Another must order is the squab, it was nicely spiced and uber tender. The salted chili paste reminded me of gochujang but much, much better. While the lamb was also perfectly tender, it could have used a sauce to tie everything together. My least favorite was the BN Beef which was a tad chewy. The mustard-miso oyster sauce sounded great on paper but I found it a bit funky tasting.\n\nAt this point, we needed to lay our muffin tops onto a flatbed to roll out of the restaurant but luckily dessert was refreshing and light.  A genius exotic combo, the persimmon sorbet and meringue-like floating island and candied buddha's hand was perfect for someone like me who doesn't care for sugary sweets but craves a little something sweet to end a multi-course dinner.\n\nOh and I can't forget about the cocktails. If you like something savory and lightly sweet, try The Concession ($11) made with popcorn rum and cherry cola syrup: http://bit.ly/1x2Dt8Y. \n\n~ * ~ S E R V I C E ~ * ~\nFor their 2nd day of opening, hats off to the amazingly wonderful staff. From the hostess, our waiter (Ethan), food runners, to the sommelier, everyone was welcoming, knowledgeable (they knew every single ingredient on the menu), and attentive. \n\nI recognized some of the staff who use to work at Mina, Hakkasan, and Aveline and they were nice enough to come and say, hi when they recognized us. I'm planning a group dinner next month and Betsy was kind enough to give us a tour of the restaurant. \n\nFood service was on-point; 9 courses took a little over 90 minutes.\n\n~ * ~ A M B I A N C E / D E C O R ~ * ~\nPreviously the historic Progress Theater, they did a wonderful transforming the huge, multi-level space into a bright, warm , and casual space. The main dining room fits about 50 people while the dual mezzanine is great for large groups (8-20 people). \n\n~ * ~ P A R K I N G ~ * ~\nThe Fitness SF garage (1 block away across from the old Yoshi's) and Kabuki garage (2 blocks) both charge $2/hour after 6 pm.", "rating": 5, "date": "2014-12-18"}, {"excerpts": ["Aromatic spiced squab with salted chili paste ", "- Loved the aromatic spices on the squab as well as the chili paste...but was not a fan of the squab itself...", "there was not flavor...."], "author": "Nancy C.", "review": "Such a nice experience to enjoy 6 dishes exquisitely prepared with beautiful presentation and full of flavor!  It was our second visit and not disappointed at all.\n\nWe ordered different dishes from our first visit and were very pleased.  \n\nAsparagus with lime pickle yogurt & pistachio - The asparagus was so tender and sweet, which paired nicely with the lime pickle yogurt and the crunchiness from the pistachio.....yum!\n\nTomato curry 'roti' with ricotta & fava hummus - The only downside to this dish is that you get one roti...wish they provided more!\n\nTempura baby favas with manchego - OMG!  This was sooo good!  I was a bit skeptical to eat a tempura fava pod, but...it was very tender  with a nice crunch on the outside.  The cheese made such great flavor with a touch of sundried tomatoes on top.....Definitely a must if it's on the menu....\n\nWood oven roasted morels & smoke hollandaise - Smokey indeed!  Although there were loads of flavor from the morels...it was a bit smokey and needed something else to compliment it.....we ended up eating it with the potatoes from our other dish....\n\nPolpette of guinea hen & pork with blood orange & castelvetranos - As far as protein goes, this was a tasty one!  Lots of different flavors from the polpette which played nicely with the blood orange & castelvetranos olives as well as the potatoes....\n\nAromatic spiced squab with salted chili paste - Loved the aromatic spices on the squab as well as the chili paste...but was not a fan of the squab itself...there was not flavor....luckily for the spices, otherwise, it would have just been bland....\n\nOverall...a definite must for all you foodies!  And...$65 per person for six dishes is not too bad at all!  \n\nLooking forward to our next visit......bon appetit!", "rating": 5, "date": "2015-04-12"}, {"excerpts": ["aromatic spiced squab with salted chili paste - my favorite dish of the night. ", "super flavorful and perfectly cooked.\n"], "author": "Edward W.", "review": "Our friends made a reservation for 6pm on a Saturday. \n\nThese were the six dishes we ordered.\nporcinis with ham & wagon wheel croquettes - The croquettes were amazing. \nrazor clams on the plancha with kimchi piccata - I've never had razor clams before and it was certainly interesting to eat.\n'treasure chest' of fermented sausage, trout quenelles & sweet onion-rice dumpling in a 'creamy' pork broth - I thought the fermented sausages were a bit odd, but I loved the rest of the dish. \nmaritake, tofu & bok choy 'stif fry' with smoked black cod ponzu - This dish was good although I wish there was more ponzu.\naromatic spiced squab with salted chili paste - my favorite dish of the night. super flavorful and perfectly cooked.\ngrilled fie dot ranch beef with mustard-miso oyster sauce - beef was well flavored.\n\nAll the dishes were family style and had at least 4 pieces of everything since we were in a group of 4. The service here was top notch as they refilled the water very, very quickly. When we left the restaurant, the bar area was completely packed. I'd highly recommend getting a reservation ahead of time.", "rating": 4, "date": "2015-05-14"}, {"excerpts": ["6) Aromatic spiced squab with salted chili paste - the \"China\" dish of the night. ", "I wasn't too crazy about this one, but the squab was cooked well (medium rare) and thus soft and chewy. ", "It also came with lettuce wraps and the chili paste - one of which was extremely bitter, which is probably why I didn't care for this dish much. "], "author": "Jocelyn L.", "review": "The Progress is State Bird Provision's newest addition to the Fillmore! State Bird is great but sometimes you get tired of the routine; it got a little bit repetitive and a hungry foodie always wants more. Thank god the Progress opened!  The concept is you pick 6 dishes from the menu (about 20 total items) and share family style, for $65/person. If you want to add dishes, they are an additional $10/person. Corkage is $25.\n\nThe restaurant ambiance is very cool. The bar has a metal frame hanging from the ceiling holding various plants. The restaurant as a whole is very long, and feels like you're on a train from the curved ceilings and curved walls. There are a lot of new wooden and modern panelings which are beautiful. There are two upstairs parts of the restaurant, on each end. In the center, it's a bunch of open space which creates a nice center and buzz of excitement. \n\nThe bartenders are attentive and quick, and thus we got our drinks with swift speed. I got the Sunny Jim ($11, gin, lemon, vanilla-pineapple syrup, kaffir lime leaf, soda, with curry-dusted pineapple), which tasted like a lemonade with vanilla and cream in it, quite tasty and different from any other drink I've had before.  My bf ordered the Concession ($11, rum, house cherry cola syrup, licorice bitters, with buttered popcorn) - he loved it, but for me it was too bitter of a drink (a \"guy\" drink).\n\nOur waiter, Gerald, was an extremely friendly, hilarious gay guy whom everyone would love to have as their BFF. He kept joking around with our table, and others too, and made my bf and I feel very at home. It was great! I hope you get him as your waiter. The chef, Stuart Brioza, was there putting the final touches on the dishes and also bringing some dishes to each table. He presented some of ours very happily, and with lots of pride; you could tell that his heart and soul went into this restaurant. Very cool!\n\nIt turns out the food is very much Asian Fusion, which took me by surprise. We ordered 6.5 dishes. My favorites were #1, 3, 4 and 5:\n\n1) Shaved cauliflower herbs and pig fries. This dish had a sour taste from the lime, and with the herbs and cauliflower, and savoriness of the fried meat, which made it taste like a Thai dish. The pig ears (don't be afraid like I was!) were not in an ear shaped like I had imagined, but instead little strips fried and oozing with fat drippings. Your loss if you don't order this one!\n\n2) Barely Poached Ridgebacks with yuzu & olio nuovo. Ridgebacks are Ebi, very similar to the dish you can sometimes order at Japanese restaurants where they fry the head, and the body of the shrimp. The head was fried, which was quite tasty. The body was poached, and very soft and the texture was amazing. However we felt this dish could have been ordered at another restaurant, not exactly the most innovative (not to say it was bad either though!)\n\n3) Sunchoke, Rosemary, and Pecorino Roti - the WINNER of the night. Roti is a style of Indian Crepe, if you've never had. It's flaky and doughy at the same time. You just rip it off, and it went terrifically with the pecorino cheese. Oh, my god! All of the other tables were ordering it too. \n\n4) Smoked black cod fried rice with squid & preserved lemon. Quite tasty. The black cod seemed like it was poached (vs. fried like I had envisioned) but that was great too, it just made the dish softer. The squid was fried, which gave the dish a nice contrast and complimented nicely with the pucker from the lemon.\n\n5) Treasure Chest of fermented sausage, fish quenelles, tofu and pumpkin-rice dumplings in a creamy pork broth. Basically a ramen soup with lots of little trinkets. I would say this dish was creative due to the fish quenelles and fermented sausage in the soup. What kind of soup ever includes those ingredients?! They were so delicious though! Quenelles were my fav since it was so soft - like biting into a fish cream puff. \n\n6) Aromatic spiced squab with salted chili paste - the \"China\" dish of the night. I wasn't too crazy about this one, but the squab was cooked well (medium rare) and thus soft and chewy. It also came with lettuce wraps and the chili paste - one of which was extremely bitter, which is probably why I didn't care for this dish much. It also wasn't the most creative. \n\n7) Honey cocoa ice cream & olio nuovo. Honey cocoa ice cream was extremely buttery, creamy and chocolatey in a smooth and tasty way. However that was the highlight of the dish. I wouldn't order desserts again; stick to the main savory dishes!\n\nCan't wait to return. I want to come back in summer, so I can try new things on the menu.", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["- aromatic spiced squab with ", "salted chili paste - reminds me of a Vietnamese dish that I had when I was growing up. "], "author": "Manda Bear B.", "review": "********************* 1275 **********************\n\n    New American restaurant The Progress serving inventive, family-style meals, farm-to-table with freshest ingredients, from the same kitchen as the State Bird Provisions team Michelin Starred Chef-owners Stuart Brioza and Nicole Krasinski. \n\n    I love the beautiful airy high ceiling that arches overhead, and the beautiful wood work on the wall, intensive labor work put into this beautiful, modern, but rustic The Progress. A large bar area with more than 20 seats, so without reservation, it's not a bad thing. The last few times I was here around 5:15 week nights, I got in. \n\n    The 90-seat dining room with a few more tables on the second level, usually fill up by 6 PM, and it's jam packed every night just like its sister State Bird Provisions next door. \n\n    The Progress serves bar menu and full dinner menu at the bar, so it's such a great option for diner like me CANNOT get any reservation from both restaurants :-) It's not a complain, in fact it makes me more excited and a little adrenaline rush with the thought that I couldn't get any seat even at the bar, haha. That was how I feel about last night dinner with my best friend in town. \n\n   Luckily chef Stuart Brioza was in, what a treat for my best friend and my visiting somm friend from NYC. \n\n   Love the concept of 6 dishes for $65 per person, and each additional dish for $10, plenty of delicious food to share, reasonable price point, great concept and execution. \n\n- spot prawn - was so delicious\n\n- shaved cauliflower-herbs & pig fries\n\n- spiced lamb tartare - I had this dish 3 times now, and loving it each time more.\n\n- raw japanese snapper - beautifully presented as good as it looks.\n\n- porcini & mt. tam dumpling with nettle salsa verde - newest dish in APR 2015, refreshing.\n\n- pecorino 'roti' with perigord truffle buttermilk - a MUST TRY\n\n- roasted mushrooms & kale with local wakame kraut - I had this dish 3 times and will continue order it as long as it's on the menu, a great choice for vegetarian.\n\n- butter clams on the half shell with kimchi piccata & shungiku\n\n- Spanish  barnacles - it was so delicious and I came back last night, it was gone!  \n\n- black butter butternut squash with caramelized onion & swiss chard\n\n- polpette of guinea hen & pork with blood orange & castelvetranos - another FAV dish of mine. \n\n- lamb merguez with yellow eye beans, octopus & crispy squid - my 3rd time with this dish, highly recommend \n\n- maitake, tofu curry & bok choy 'stir fry' with smoked black cod ponzu - reminds me of Chinese cuisine.\n\n- aromatic spiced squab with salted chili paste - reminds me of a Vietnamese dish that I had when I was growing up. It got the 5 spice flavor, the meat was so tender, delicious, I forgot when was the last time the squab could taste that good.\n\n- grilled Five Dot Ranch beef with mustard-miso oyster sauce - this was the only dish that wasn't my style :-) but my friends love it! I prefer my beef/steak with less sauce on it. \n\n    The cocktail list is also good. I presonally enjoyed the Paloma (reposado tequila, pomelo, lime, sugar, madras curry tincture) recommended by our server Kelly.\n\n  The wine list was delicious by Sommerlier Jason Alexander, if you are a wine lover, collector, or a somm, you would enjoy this list tremendously. He offers wines of the world, beautiful white Burgundy, the grower Champagnes, Rieslings, and plenty of French, Italian and Spanish red for under $70 bottles! And if you are a collector, check out the Cellar Selection, I'm in love! \n\n    The service by Eric last time at the dining room was excellent. The last 2 times at the bar was equally fantastic, attentive, caring, and purely enjoyable for us. \n\n    I'm looking forward to my next visit to explore the ever evolving menu daily and the wine list to pair with it. \n\n    Again, congratulations The Progress, San Francisco for being Jame Beards Foundation Award Semifinalists 2015, and I'm sure many accolades to come. \n\nNOTE: no valet parking, come at 5 PM on week night, you will surely get in at the bar!", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["*Aromatic spiced squab w/salted chili paste - Crispy skin and wonderful spices and the chili paste was hot!  "], "author": "Cat C.", "review": "Have you ever had eyes for the hot older brother, but no matter how hard you tried, you failed?  So, you settled for the not as pined over but nice younger brother.  Okay, I don't double dip or even attempt to double dip amongst family or good friends, but I'm sure a lot of people can relate to this right?  So, I've always wanted to try older brother (or sister) restaurant, State Bird Provisions, but I've tried all the tips that my friends have given me in order to make a reservation and no luck.  I swear SBP is harder to get into than Stanford!  At first it seemed hard to get a reservation at The Progress as well, but about three weeks prior I was actually able to get a reservation for President's Day Monday at a reasonable time (6PM).  We both had the day off so I grabbed it.  \n\nThe door for both restaurants don't seem to be clearly marked.  We arrived a couple minutes early and were seated right away.  The restaurant already had a good amount of patrons.  We ended up sharing a communal style table which is for two parties of two, with a seat in between both on each side.  I honestly wasn't expecting much from The Progress due to a slew of mixed reviews, but we were pleasantly surprised.\n6 dishes for $65 per person..all parties must agree on the dishes as they are shared.\n\nA plate full of different amouse bouches were served: a chicken jerky, cheddar cracker, squab mousse, a fontina cheese dumpling and one more that we forgot.  Overall, they were really good bite size starters.  Two of my favorites were the squab mousse and fontina cheese dumpling.  \n\nOur 6 dishes:\n*Crab, bok choy, and tofu stir fry - Wonderful start to our meal.  Lots of bits of crab meat and we loved the tofu pillows, all in a light ginger sauce.  \n*Polpette of rabbit & pork with blood orange & castelvetranos - Never had rabbit, the pork and rabbit were so flavorful and tender.  The blood orange was a nice acidic and sweet compliment to the meat.  Our favorite dish!  \n*Grilled Five Dot Ranch beef w/mustard-miso oyster sauce - Like Cherylynn said, this was our least favorite dish.  Although it wasn't horrible, we were expecting more.  There were only four pieces of beef, and they weren't tender at all.\n*Black butter butternut squash w/caramelized onions & swiss chard - I gots to have my veggies!  The sweetness from the butternut squash and caramelized onions worked well with the bitterness of the swiss chard.  The butter tied in the savoriness.  \n*Shaved cauliflower-herbs & pig fries - I've had Taiwanese pig ear before and hated it, but we thought why not, let's try this, especially since it's fried.  These ears were done right!  The texture was so not like the other pig ear I've had (no cartilage weirdness here), there were also lots of pork belly strips, some acidity and fish sauce to cut the fattiness and the shaved cauliflower was a nice touch as well.  \n*Aromatic spiced squab w/salted chili paste - Crispy skin and wonderful spices and the chili paste was hot!  But there was very little meat on this, which made it a bummer.\n\nLike others said, we were still a little hungry, so yes, we went to that wonderful place further down Geary for a supplement (Jack In The Box).  The service was great, food was good; honestly I was expecting the worst.  But it's pricey for what you get.  If I could ever get a reservation at State Bird, I'm sure for what you pay here I'd be more satisfied over there.  3.5 rounded up.  Hot older brother (State Bird) I still got my eye on you!!", "rating": 4, "date": "2015-03-01"}, {"excerpts": ["And that aromatic spiced squab with salted chili paste...ri-freaking-diculous!  ", "Anyone familiar with Chinese squab preparations will remember that the birds far more often than not turned out dry and bland.  ", "In this case, the tenderness and moisture upon first bite made us all seriously question if it was real squab.  ", "Cray?  "], "author": "Eric F.", "review": "Huge props to Ruobin W. for helping us score a weekend reservation at the awesome new addition from Stuart Brioza & Nicole Krasinski behind the beloved State Bird Provisions.\n\nThe atmosphere is largely reminiscent of SBP with a nice mix of modern and eclectic.  Everything is served family-style with a minimum commitment of 6 courses at $65/person and going up from there depending on your appetite.\n\nWhile everything was derricious, there were a number of notables like the exquisitely soft smoked duck and marinated yellowfoot mushrooms & dried plum.  Meaty, earthy awesomeness with some lovely acidity for balance.  The shaved cauliflower-herbs & pig fries tasted like they were just pulled from the garden hours before and I loved the variety of porcine parts used for the fries to provide a little surprise from piece to piece.\n\nFor the vegetable-inclined, the black butter butternut squash with caramelized onion & swiss chard turned out to be surprisingly hearty in addition to its depth of flavor accentuated by the soft sweetness of the onions.\n\nAnd that aromatic spiced squab with salted chili paste...ri-freaking-diculous!  Anyone familiar with Chinese squab preparations will remember that the birds far more often than not turned out dry and bland.  In this case, the tenderness and moisture upon first bite made us all seriously question if it was real squab.  Cray?  Yes.\n\nThe polpette of rabbit & pork with blood orange was solid though the former component was difficult to discern.  A good mix of savory flavors and citrus acidity.  The lamb merguez with octopus & crispy squid was very nicely cooked, just not particularly standout in its combination.  Lastly, our 'treasure chest' of fermented sausage, trout quenelles & pumpkin-rice dumpling in a 'creamy' pork broth was certainly unique.\n\nAs for sweet offerings, they were all fantastic with the combination of milk chocolate-black lager ice cream, cocoa sable & caraway seed being very much reminiscent of the bird's nest dessert aka crack in a bowl at SBP.  Get it.\n\nService here was good though quite a bit more distant than at SBP where there's so much more interaction with the staff presenting the vast array of plates.  Overall, the food here is top notch and absolutely on par with its big sibling next door.  However, the value has some room for improvement as our meal turned out to be comparable if not more than some 1 star Michelin spots.  Apples to oranges, sure, but still something to bear in mind.", "rating": 4, "date": "2015-03-14"}, {"excerpts": ["We ordered the yuzu and olio nuovo marinated raw tuna with green daikon, shaved cauliflower-herbs with pig fries, pecorino 'roti' with black truffle buttermilk, 'treasure chest' of fermented sausage, trout quenelles and pumpkin mochi in a creamy pork broth, and lastly aromatic spiced squab with salted chili paste. \n\n"], "author": "Kaisi G.", "review": "This is an overdue review. My bf and I went here for our two year anniversary and he made the reservation a month in advance. This is one of the hottest new restaurants in SF and comes from the hands of people who brought you State Bird Provisions. It is poppin' so definitely make a reservation if you can or be prepared for a wait. They reserve a portion of their tables for walk ins though so definitely come try your luck.\n\nAt The Progress it's a bit different than State Bird where you get 6 courses for $65 and you mark off the menu which 6 you want to try. They have 4 different sections - appetizers, entrees and desserts and you can 6 of any of those. You don't have to pick a dessert if you don't want to which is nice or you can get all apps. \n\nEveryone gets an amuse-bouche platter as a starter and for ours we had homemade cheese crackers (it was okay), tempura oyster, baby radish in house made hummus, and homemade beef jerky. Everything else was very good minus the cheese cracker which I thought was underwhelming and kind of strange to be included with the other food.\n\nWe ordered the yuzu and olio nuovo marinated raw tuna with green daikon, shaved cauliflower-herbs with pig fries, pecorino 'roti' with black truffle buttermilk, 'treasure chest' of fermented sausage, trout quenelles and pumpkin mochi in a creamy pork broth, and lastly aromatic spiced squab with salted chili paste. \n\nEverything we had was fantastic. My favorite dishes of the night were the pig fries - bits of fried pig ears and pork jowl. So delicious when eaten with the shaved cauliflower and I think there was romanesco too. Little bites of fatty goodness that exploded in your mouth like an umami fireworks show. \n\nAnother fantastic dish was the treasure chest in which the house made fermented sausage was something I've never had before but definitely the best sausage I've ever eaten. It was just a very unique flavor and it's hard to describe, it tastes aged but in the good way like a dry-aged steak tastes. It tasted very meaty and unctuous which I personally really like. Also that broth? Omg it rivals any good ramen broth I've ever had. You could taste the hours and hours of the pork that simmered away to make it. Only thing was that I wish there had been more pumpkin mochi. We only had one piece each and it was so delicious I wanted more haha.\n\nAlso the pecorino roti with the black truffle buttermilk sauce? I've never had anything like it before and it's something I wish I could everyday for like breakfast or something. It wasn't too heavy or rich which I thought it would after a few bites. Instead there a highly addictive quality to it that makes you want more when you're done. \n\nAll in all a fantastic meal that left me wondering how they could make each bite so perfectly balanced. Each bite had just the right amount of salty, sweet, umami, and acidity.", "rating": 5, "date": "2015-02-28"}, {"excerpts": ["Aromatic spiced squab with salted chili paste: Served with small pieces of lettuce", ", the squab was tender and perfectly cooked. "], "author": "Vinitha R.", "review": "Overall, I really enjoyed all of the food. Most of it was very well balanced and the ingredients were incredibly fresh. You definitely could taste the quality immediately. It's hard to say anything negative about the experience, but it felt like the price point was a little bit off. With two drinks and food, each of us were looking at bills well over $100. Given the quantity of food, it felt like a little much. I would definitely enjoy eating some of the dishes again, but I can't honestly imagine that I will make it back any time soon.\n\nComparing this to State Bird may be unfair since they are trying to be independent establishments. But with the close proximity, and food/plating style, comparison comes naturally. Both restaurants have a distinct charm with well-trained and attentive wait staff. For me though, State Bird is the winner by a long shot serving up a a more creative menu with better portion sizes.\n\nLocal kiwi with super-fresh ricotta, almonds & pickled sunchokes: The ricotta was freshly made in house and the texture was divine. A lovely, fresh beginning to the meal.\n\nPorcini & mt. tam dumpling with nettle salsa verde: The dumplings had a creamy, soft porcini mushroom filling. I could have eaten about 10 more.\n\nRed snapper with turnips and creme fraiche: Probably my favorite item of the day. The snapper was fresh and the sauce really complimented the flavors.\n\nPecorino 'roti' with perigord truffle buttermilk: The roti was flaky and delicious and the buttermilk sauce was light and flavorful. Not all bites had the truffle shavings, but the ones that did were divine.\n\nDungeness crab, bok choy & tofu 'stir-fry': I need to figure out how to recreate this light ginger sauce. The crab meat was fresh and delicious.\n\nAromatic spiced squab with salted chili paste: Served with small pieces of lettuce, the squab was tender and perfectly cooked. The seasoning was very spice forward, but didn't overpower the squab at all.\n\nGrilled Five Dot Ranch beef with mustard-miso oyster sauce: The ordered this as an add on ($10/person) for three since I don't eat red meat.\n\nPro-Tip: at the bar, you can order off the menu a la carte. Might honestly be better value for your money.", "rating": 4, "date": "2015-03-02"}, {"excerpts": ["Aromatic Spiced Squab w/ salted chili paste - COOKED MEDIUM RARE, JUICY, PLUMP, one of the most delicious squab I have ever tasted in my life. "], "author": "Betty P.", "review": "WHO SCORED PARKING RIGHT IN FRONT BUT DIDN'T KNOW THE RESTURANT WAS IN FRONT OF US BECAUSE IT DIDN'T HAVE A SIGN? WE DID! My friend decided to take me here for my super belated birthday dinner. I heard that the owner of State Bird Provisions opened this joint so I was pretty excited just because I could never score any reservations at State Bird! This was the closest I could get to experiencing a \"similar\" vibe. The menu is family style, 65/pp so not bad at all! There were 2 dishes that stood out to me the most and they were...\n\n1. Shaved Cauliflower-Herbs & Pig Fries - OH BOY. The pig fries tasted as if you were eating a crispy, chewy pork jerky! Very flavorful, I wish there were more.\n\n2. Aromatic Spiced Squab w/ salted chili paste - COOKED MEDIUM RARE, JUICY, PLUMP, one of the most delicious squab I have ever tasted in my life. If I could, I would've asked for two of these instead of one.\n\nOverall, I'm glad we found parking in front. The hostess was nice enough to take tons of pictures for us! Probably will come back when there is a menu change to see how much they've improved!", "rating": 4, "date": "2015-03-04"}, {"excerpts": ["+ Aromatic spiced squab: dip a piece in the chili paste, then wrap with a radicchio leaf and eat.  ", "Like a lettuce wrap, but way better.\n", "+ Farro spezzato rustico with pork jowl & octopus: almost like a sophisticated porridge.  "], "author": "Tori S.", "review": "I passed by The Progress on their second day open as my friends and I were en route to State Bird for dinner.  My friend told me that it was the newest restaurant by the SBP team, and since I'd been in and out of town over the past few months, I had no idea it even existed.\n\nSo I made note to try, and after the holidays, I looked online and managed to score an early dinner reservation a few days later.  My husband was delighted that I was asking him on a \"date,\" and off we went.\n\nBeautiful decor, similar in style to SBP.  I want my future bathroom to look the way theirs did: glittery copper walls and a teal door.  Seriously, I had to tell my husband to go into the restroom to see what he'd be living with in the future.\n\nYou choose 6 items from the menu to share as a table for $65/person.  7 items is $75/person, and so on.  We ended up with 7 since too many things looked good, and a drink each (btw, the drinks are strong - I had to enlist my husband to help finish mine, since I was recovering from a cold and didn't want to pass out on the table).  The menu items change slightly based on what's in season, so don't expect the same thing every time you go.\n\nHighlights:\n+ Shaved cauliflower herbs & pig fries: these are thinly sliced fried pork ears (YUM), with a tangy spicy accompaniment of cauliflower.  I could eat this all day, every day.\n+ Aromatic spiced squab: dip a piece in the chili paste, then wrap with a radicchio leaf and eat.  Like a lettuce wrap, but way better.\n+ Farro spezzato rustico with pork jowl & octopus: almost like a sophisticated porridge.  I'm usually not a huge fan of octopus, but I almost picked up the bowl and licked it clean.\n\nJust okay:\n+ Smoked black cod fried rice: wasn't a fan of the aioli that came with it; I would've liked it better without, and I kept comparing it to SBP's duck fried rice (which I LOVE).\n+ Treasure chest of fermented sausasge, shrimp quenelles, tofu and pumpkin-rice dumpling in a pork broth: Loved the broth, tofu and the pumpkin-rice dumplings, didn't really like the other stuff because they didn't seem to mesh well with the broth.\n\nMeh, skip:\n- Porcini & Mt. Tam dumpling with nettle salsa verde: my problem with \"fusion\" food is that they create things for the sake of being creative, instead of for the actual taste.  Prime example is this dish; nothing tasted good together, though separately all items are delicious on their own.\n\nBecause I don't eat beef and I'm allergic to oysters, I didn't have any of the grilled BN beef, but my husband said it was okay.\n\nOverall a good dining experience with wonderful staff and ambiance.  Our entire meal, including one drink each, tax and tip, was close to $250.  We did have leftovers, and I don't recommend getting more than 6 dishes for the table, as it's a deceptively large amount of food because it's just a few bites per plate.\n\nNot entirely sure I would pick The Progress over SBP, as I like some of the flavors of the other restaurant better, but it's definitely a must-try at least once.", "rating": 4, "date": "2015-01-07"}, {"excerpts": ["trout quenelles\npolpette of rabbit & pork with blood orange & castelvetranos\naromatic spiced squab with salted chili paste\n\n"], "author": "Veronica O.", "review": "Amazing!! from unique delicious dishes to excellent service.  WOW!!!\nOn our last night in SanFran last week, by my Honey's Dad's choice, we were stunned how cool, contemporary and chic this place.  We were greeted with friendly hostess and welcome and served by a very friendly and knowledgeable server.  From the beginning 'till the end of our dinner was a memorable experience. \n\nThe MENU - outstanding!\nasparagus with lime pickle yogurt & pistachio\nraw japanese snapper with turnips & crème fraîche\nsmoked & grilled artichokes with quinoa & shaved pig's head\n'treasure chest' of fermented sausage, trout quenelles\npolpette of rabbit & pork with blood orange & castelvetranos\naromatic spiced squab with salted chili paste\n\nYou all have no idea how much I would love to describe every bite of each dishes! Let me just say that we were salivating every single bite we took.  \n\nVery much Highly recommended!!!", "rating": 5, "date": "2015-05-14"}, {"excerpts": ["The consistency was more creamy and that's likely due to the rice being recently made; not the day old rice we usually use to make this ;)\n- Aromatic spiced squab with salted chili paste - we didn't actually order this, so when the chef brought it out we were confused. ", "Our server had made a mistake and as a way to make-good, extended this plate gratis which was extremely courteous. ", "Squab tasted like a mix between quail and lamb with a five-spice like rub; I wasn't over the moon about this dish "], "author": "Johanna L.", "review": "I suppose my new year's resolution is to eat out each night and at a new restaurant every time. I made my way out to The Progress with the BF and a friend visiting from LA (with whom I also went to SBP my first time!). We aren't the type to make reservations, so we pressed our luck by going early to wait in line for one of the few tables left open for walk-ins.\n\nThe BF and I arrived first at 4:30p; no one was in line yet, but the SBP queue had already gathered. Here's the deal: if you don't have a reservation, you can get there early to wait in line and try to snag one of the seated tables. There's also an option to eat in the bar, but the tables are small and best for 2 people max; I even saw some people standing to eat at the bar -- whatever works. \n\nThey open doors @ 5p for both resos and walk ins, with the option of hanging out by the bar to grab some drinks. For walk-ins, first seating is at 5:30p so we hung out for a bit. Cocktail prices are reasonable, with the usual selection of gin/rhum/bourbon/mezcal/tequila style drinks. Our table took awhile and I had to check in with the host again (who seemed a bit stressed), but we were eventually seated closer to 6p.\n\nThe dining style and cuisine focus is quite different from SBP -- less tapas/dim sum and more family style portions with a huge emphasis on Asian flavors. The table has to decide on 6 dishes to fit within the $65/person, but if you want to add additional dishes, it's an extra $10/person per dish. After you decide which 6 plates you want, the chef and staff will portion out the dishes depending on the size of the group. We selected the following:\n\n+ Amuse bouche of smoked lap xuong, fermented goat cheese and pickled radish, broccoli tempura, and toasted seaweed with a salmon/mustard seed topping - beautifully plated and great rich flavors to kick start our palates. This really set the tone of the Asian cuisine themed menu.\n+ Shaved cauliflower-herbs and pig fries - one of my favorites of the night; the pig fries were crispy yet chewy at the same time. I could have ordered 2 of these to myself.\n+ Sunchoke, rosemary, & pecorino \"roti\" - we saw someone order this at the bar and knew we had to get it as well. The roti dough was freshly made and presented in a tent like, folded manner with shavings of pecorino on top of it. I didn't care for the specks of rosemary in it, but the sunchoke was a nice break from the rich flavors.\n+ \"Treasure Chest\" of fermented sausage, fish quenelles, tofu & pumpkin rice dumpling in a creamy pork broth - the production of pouring the broth into the soup is part of the experience. Seriously, do not sleep on this. The broth is rich and creamy like a ramen broth, with the tofu fried to a unique consistency that still maintained it's fry even while in the broth. The sourness from the fermented sausage (reminded me of something we ate in CPH) created a well-balanced amalgamation of flavors.\n+ Don Watson's lamb scallopini with fava greens & cippolini - encrusted with sesame seeds, the lamb was cooked well and had a nice crisp due to the sesame seeds. By this time I was getting a bit full, so the smaller portion was fine by me.\n- Smoked black cod fried rice with squid & preserved lemon - I suppose I expected this to be like Mission Chinese Food's salted cod fried rice, and it wasn't. The consistency was more creamy and that's likely due to the rice being recently made; not the day old rice we usually use to make this ;)\n- Aromatic spiced squab with salted chili paste - we didn't actually order this, so when the chef brought it out we were confused. Our server had made a mistake and as a way to make-good, extended this plate gratis which was extremely courteous. Squab tasted like a mix between quail and lamb with a five-spice like rub; I wasn't over the moon about this dish so it was great that it was free. \n\nDessert: our server gave us the option to order both desserts as 1 dish which was awesome -- he just asked us which one we wanted more of to portion it out accordingly.\n+ Honey cocoa ice cream & olio nuovo w jasmine tea poached fruits, greengage plum jam & ricotta whey - dat honey cocoa ice cream was the richest chocolate ice cream I've ever had and want to keep eating. Mixing the jam and fruits together was also a nice refreshing touch.\n- Triple citrus sorbet & star anise lime caramel w gingered coconut floating island & candied buddha's hand - more neutral on this one, I could have eaten just scoops of the honey cocoa ice cream and been satisfied.\n\nService was impeccable (despite the delay in being seated and the host looking confused when I checked in with her), the ambiance was bright and lively, and the food was spectacular. The tables were actually made from a tree in the Presidio that was either cut or had fallen down 4 years ago, and had been curing ever since. Apparently I'm into tables.", "rating": 5, "date": "2015-01-09"}, {"excerpts": ["We had (in rankings of our favourite to least):\n\n- lamb merguez with yellow eye beans, octopus & crispy squid - a lot of flavor and texture\n\n- raw japanese snapper with turnips & crème fraîche -- light and had a nice wasabi taste, really understated\n\n- aromatic spiced squab with salted chili paste - cooked very well, tender meat which is hard to do!\n\n- shaved cauliflower-herbs & pig fries - I liked this a lot, the fries were not very fried (which I disliked), and a lot of flavor. "], "author": "Yan K.", "review": "A very pleasant experience at The Progress. We had (in rankings of our favourite to least):\n\n- lamb merguez with yellow eye beans, octopus & crispy squid - a lot of flavor and texture\n\n- raw japanese snapper with turnips & crème fraîche -- light and had a nice wasabi taste, really understated\n\n- aromatic spiced squab with salted chili paste - cooked very well, tender meat which is hard to do!\n\n- shaved cauliflower-herbs & pig fries - I liked this a lot, the fries were not very fried (which I disliked), and a lot of flavor. My boyfriend wasn't a fan as he thought it was too acidic\n\n- 'treasure chest' of fermented sausage, trout quenelles - as Asians, suppose we thought it wasn't too special. The chinese sausage we have all the time (and we didn't even think it was the best type), but the pumpkin mochi was good. Nice to have a soup during the meal\n\n- smoked duck with marinated pioppini mushrooms & dried plum - we both thought not too memorable\n\nWe also ordered a serving of the dessert (poppyseed angel food cake) to share for the two of us, which is what the server recommended. It was fine - we wanted a dessert to round out the meal, but also wasn't super memorable.\n\nService was fast, it took 2 hours for our meal, even though the food came out quickly. Decent value for a high-end restaurant. Portions were adequate, we felt full but not stuffed after the 6.5 courses.", "rating": 4, "date": "2015-04-05"}], "grilled five dot ranch beef": [{"excerpts": ["*grilled Five Dot Ranch beef with mustard-miso oyster sauce\n\nOur favorite by far was the Cauliflower and pig fries. "], "author": "Mai W.", "review": "This place was a great dining experience. The drinks were great, the atmosphere was modern and of course the food was phenomenal.\n\nThe style of serving for this meal was very unique. You get a menu (much like dim sum places) and you mark of 6 dishes to share for the table. Everything is family style. You are not limited to choosing only six, you can add an additional dish for $10/person. The meal was $65/person which is not bad at all!\n\nFor our meal we chose:\n\n*smoked duck with marinated yellowfoot mushrooms & dried plum\n*shaved cauliflower-herbs & pig fries\n*pecorino 'roti' with perigord truffle buttermilk\n*lamb merguez with yellow eye beans, octopus & crispy squid\n*aromatic spiced squab with salted chili paste\n*grilled Five Dot Ranch beef with mustard-miso oyster sauce\n\nOur favorite by far was the Cauliflower and pig fries. The Lamb merguez came in a close second but all the food that came out was great!", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["- grilled Five Dot Ranch beef with mustard-miso oyster sauce - this was the only dish that wasn't my style :-) ", "but my friends love it! "], "author": "Manda Bear B.", "review": "********************* 1275 **********************\n\n    New American restaurant The Progress serving inventive, family-style meals, farm-to-table with freshest ingredients, from the same kitchen as the State Bird Provisions team Michelin Starred Chef-owners Stuart Brioza and Nicole Krasinski. \n\n    I love the beautiful airy high ceiling that arches overhead, and the beautiful wood work on the wall, intensive labor work put into this beautiful, modern, but rustic The Progress. A large bar area with more than 20 seats, so without reservation, it's not a bad thing. The last few times I was here around 5:15 week nights, I got in. \n\n    The 90-seat dining room with a few more tables on the second level, usually fill up by 6 PM, and it's jam packed every night just like its sister State Bird Provisions next door. \n\n    The Progress serves bar menu and full dinner menu at the bar, so it's such a great option for diner like me CANNOT get any reservation from both restaurants :-) It's not a complain, in fact it makes me more excited and a little adrenaline rush with the thought that I couldn't get any seat even at the bar, haha. That was how I feel about last night dinner with my best friend in town. \n\n   Luckily chef Stuart Brioza was in, what a treat for my best friend and my visiting somm friend from NYC. \n\n   Love the concept of 6 dishes for $65 per person, and each additional dish for $10, plenty of delicious food to share, reasonable price point, great concept and execution. \n\n- spot prawn - was so delicious\n\n- shaved cauliflower-herbs & pig fries\n\n- spiced lamb tartare - I had this dish 3 times now, and loving it each time more.\n\n- raw japanese snapper - beautifully presented as good as it looks.\n\n- porcini & mt. tam dumpling with nettle salsa verde - newest dish in APR 2015, refreshing.\n\n- pecorino 'roti' with perigord truffle buttermilk - a MUST TRY\n\n- roasted mushrooms & kale with local wakame kraut - I had this dish 3 times and will continue order it as long as it's on the menu, a great choice for vegetarian.\n\n- butter clams on the half shell with kimchi piccata & shungiku\n\n- Spanish  barnacles - it was so delicious and I came back last night, it was gone!  \n\n- black butter butternut squash with caramelized onion & swiss chard\n\n- polpette of guinea hen & pork with blood orange & castelvetranos - another FAV dish of mine. \n\n- lamb merguez with yellow eye beans, octopus & crispy squid - my 3rd time with this dish, highly recommend \n\n- maitake, tofu curry & bok choy 'stir fry' with smoked black cod ponzu - reminds me of Chinese cuisine.\n\n- aromatic spiced squab with salted chili paste - reminds me of a Vietnamese dish that I had when I was growing up. It got the 5 spice flavor, the meat was so tender, delicious, I forgot when was the last time the squab could taste that good.\n\n- grilled Five Dot Ranch beef with mustard-miso oyster sauce - this was the only dish that wasn't my style :-) but my friends love it! I prefer my beef/steak with less sauce on it. \n\n    The cocktail list is also good. I presonally enjoyed the Paloma (reposado tequila, pomelo, lime, sugar, madras curry tincture) recommended by our server Kelly.\n\n  The wine list was delicious by Sommerlier Jason Alexander, if you are a wine lover, collector, or a somm, you would enjoy this list tremendously. He offers wines of the world, beautiful white Burgundy, the grower Champagnes, Rieslings, and plenty of French, Italian and Spanish red for under $70 bottles! And if you are a collector, check out the Cellar Selection, I'm in love! \n\n    The service by Eric last time at the dining room was excellent. The last 2 times at the bar was equally fantastic, attentive, caring, and purely enjoyable for us. \n\n    I'm looking forward to my next visit to explore the ever evolving menu daily and the wine list to pair with it. \n\n    Again, congratulations The Progress, San Francisco for being Jame Beards Foundation Award Semifinalists 2015, and I'm sure many accolades to come. \n\nNOTE: no valet parking, come at 5 PM on week night, you will surely get in at the bar!", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["*Grilled Five Dot Ranch beef w/mustard-miso oyster sauce - Like Cherylynn said, this was our least favorite dish.  ", "Although it wasn't horrible, we were expecting more.  ", "There were only four pieces of beef, and they weren't tender at all.\n", "*Black butter butternut squash w/caramelized onions & swiss chard - I gots to have my veggies!  ", "The sweetness from the butternut squash and caramelized onions worked well with the bitterness of the swiss chard.  ", "The butter tied in the savoriness.  \n", "*Shaved cauliflower-herbs & pig fries - I've had Taiwanese pig ear before and hated it, but we thought why not, let's try this, especially since it's fried.  ", "These ears were done right!  ", "The texture was so not like the other pig ear I've had (no cartilage weirdness here), there were also lots of pork belly strips, some acidity and fish sauce to cut the fattiness and the shaved cauliflower was a nice touch as well.  \n"], "author": "Cat C.", "review": "Have you ever had eyes for the hot older brother, but no matter how hard you tried, you failed?  So, you settled for the not as pined over but nice younger brother.  Okay, I don't double dip or even attempt to double dip amongst family or good friends, but I'm sure a lot of people can relate to this right?  So, I've always wanted to try older brother (or sister) restaurant, State Bird Provisions, but I've tried all the tips that my friends have given me in order to make a reservation and no luck.  I swear SBP is harder to get into than Stanford!  At first it seemed hard to get a reservation at The Progress as well, but about three weeks prior I was actually able to get a reservation for President's Day Monday at a reasonable time (6PM).  We both had the day off so I grabbed it.  \n\nThe door for both restaurants don't seem to be clearly marked.  We arrived a couple minutes early and were seated right away.  The restaurant already had a good amount of patrons.  We ended up sharing a communal style table which is for two parties of two, with a seat in between both on each side.  I honestly wasn't expecting much from The Progress due to a slew of mixed reviews, but we were pleasantly surprised.\n6 dishes for $65 per person..all parties must agree on the dishes as they are shared.\n\nA plate full of different amouse bouches were served: a chicken jerky, cheddar cracker, squab mousse, a fontina cheese dumpling and one more that we forgot.  Overall, they were really good bite size starters.  Two of my favorites were the squab mousse and fontina cheese dumpling.  \n\nOur 6 dishes:\n*Crab, bok choy, and tofu stir fry - Wonderful start to our meal.  Lots of bits of crab meat and we loved the tofu pillows, all in a light ginger sauce.  \n*Polpette of rabbit & pork with blood orange & castelvetranos - Never had rabbit, the pork and rabbit were so flavorful and tender.  The blood orange was a nice acidic and sweet compliment to the meat.  Our favorite dish!  \n*Grilled Five Dot Ranch beef w/mustard-miso oyster sauce - Like Cherylynn said, this was our least favorite dish.  Although it wasn't horrible, we were expecting more.  There were only four pieces of beef, and they weren't tender at all.\n*Black butter butternut squash w/caramelized onions & swiss chard - I gots to have my veggies!  The sweetness from the butternut squash and caramelized onions worked well with the bitterness of the swiss chard.  The butter tied in the savoriness.  \n*Shaved cauliflower-herbs & pig fries - I've had Taiwanese pig ear before and hated it, but we thought why not, let's try this, especially since it's fried.  These ears were done right!  The texture was so not like the other pig ear I've had (no cartilage weirdness here), there were also lots of pork belly strips, some acidity and fish sauce to cut the fattiness and the shaved cauliflower was a nice touch as well.  \n*Aromatic spiced squab w/salted chili paste - Crispy skin and wonderful spices and the chili paste was hot!  But there was very little meat on this, which made it a bummer.\n\nLike others said, we were still a little hungry, so yes, we went to that wonderful place further down Geary for a supplement (Jack In The Box).  The service was great, food was good; honestly I was expecting the worst.  But it's pricey for what you get.  If I could ever get a reservation at State Bird, I'm sure for what you pay here I'd be more satisfied over there.  3.5 rounded up.  Hot older brother (State Bird) I still got my eye on you!!", "rating": 4, "date": "2015-03-01"}, {"excerpts": ["Grilled Five Dot Ranch beef with mustard-miso oyster sauce: The mustard sauce was very nice, but the beef tasted very standard. "], "author": "Justin H.", "review": "6-course meal for $65\nOverall: Great staff, good food. Will definitely come again at some point. The portions were filling without making me feel like I ate way too much.\n\nThe pacing for dishes was a little odd. After starting out perfectly with an appetizer plate and each of the veggies separately, we got the final three plates all at the same time. The portions were a good size, but it made the experience feel a little rushed, like we had to hurry and eat to make sure we got to the food while it was still hot on the plate. \n\nThe wait staff was very friendly, got us drinks quickly, and we're a joy to chat with. While we were trying to decide if we should order a seventh dish a la carte, the appetizer dish (which is a nice extra and not part of the dishes you get to choose) came out. That sealed that we should definitely just go with the recommended six plates. Desserts are one per person, so basically everyone gets to choose their own option, but it still counts as one course. \n\nThe appetizer was superb and great way to start the meal. A tender leek, nut-covered jerky, small piece of salmon and cucumber with sauce, a leafy thing with avocado sauce, fried gnocchi, and sliced strawberry with cheese. We both ended up scraping the plate clean with our toothpick utensils. \n\nFor drinks, we got some wine and a Sunny Jim. The Sunny Jim wasn't bad, but the vanilla was way too overpowering. If I didn't know the drink had gin (or any other ingredient), I would've guessed it was just some vanilla soda water.\n\nFor our mains, we ordered:\nShaved cauliflower and pig fries: A great mix, though the crispier pig ears weren't quite as delicious as the thick and meaty fried bits. The cauliflower and abundant greens made me feel a little less guilty about all the fried deliciousness.\n\nWild mushrooms & kale with local wakame kraut: The highlight of the meal for me. Tender kale with mushrooms so succulent it was like eating a steak. \n\nPolpette of pork with blood orange & castelvetranos: I think the castelvetranos referred to the olive sauce under this dish. On their own, the meatballs were a little salty, but they paired well with the potatoes. Adding the blood orange on top gave the entire dish a surprising pop. This needed a little more fruit to help even out the salty meat.\n\nLobster, bok choy, & tofu stir fry: An OK dish, but the lobster and the tofu tasted plain. The real surprise came from the kimchi; a toothsome addition that I wish there was more of throughout. \n\nGrilled Five Dot Ranch beef with mustard-miso oyster sauce: The mustard sauce was very nice, but the beef tasted very standard. Not quite the high quality that I'd expect for the small portions of meat. \n\nDessert: \n- Elderflower floating island, guava sherbert, & arnold palmer gelee\n- Milk chocolate-black lager ice cream, cocoa sable & caraway seed.\nFortunately, we didn't have to end the meal with so-so steak. I'd be hard-pressed to pick a favorite from these two amazing desserts. The fruity guava sherbert was a great foil to the rich, chocolatey ice cream sable. The chocolate dish also had a delicious crunchy chocolate surprise as the base, and it tasted like it was sprinkled with homemade Honeycrisp cereal. \n\nSide note: Several people around us ordered the \"Treasure Chest\" a broth covered mix of sausage and dumpling that looked wonderful.", "rating": 4, "date": "2015-03-15"}, {"excerpts": ["Grilled Five Dot Ranch beef with mustard-miso oyster sauce"], "author": "Vinitha R.", "review": "Overall, I really enjoyed all of the food. Most of it was very well balanced and the ingredients were incredibly fresh. You definitely could taste the quality immediately. It's hard to say anything negative about the experience, but it felt like the price point was a little bit off. With two drinks and food, each of us were looking at bills well over $100. Given the quantity of food, it felt like a little much. I would definitely enjoy eating some of the dishes again, but I can't honestly imagine that I will make it back any time soon.\n\nComparing this to State Bird may be unfair since they are trying to be independent establishments. But with the close proximity, and food/plating style, comparison comes naturally. Both restaurants have a distinct charm with well-trained and attentive wait staff. For me though, State Bird is the winner by a long shot serving up a a more creative menu with better portion sizes.\n\nLocal kiwi with super-fresh ricotta, almonds & pickled sunchokes: The ricotta was freshly made in house and the texture was divine. A lovely, fresh beginning to the meal.\n\nPorcini & mt. tam dumpling with nettle salsa verde: The dumplings had a creamy, soft porcini mushroom filling. I could have eaten about 10 more.\n\nRed snapper with turnips and creme fraiche: Probably my favorite item of the day. The snapper was fresh and the sauce really complimented the flavors.\n\nPecorino 'roti' with perigord truffle buttermilk: The roti was flaky and delicious and the buttermilk sauce was light and flavorful. Not all bites had the truffle shavings, but the ones that did were divine.\n\nDungeness crab, bok choy & tofu 'stir-fry': I need to figure out how to recreate this light ginger sauce. The crab meat was fresh and delicious.\n\nAromatic spiced squab with salted chili paste: Served with small pieces of lettuce, the squab was tender and perfectly cooked. The seasoning was very spice forward, but didn't overpower the squab at all.\n\nGrilled Five Dot Ranch beef with mustard-miso oyster sauce: The ordered this as an add on ($10/person) for three since I don't eat red meat.\n\nPro-Tip: at the bar, you can order off the menu a la carte. Might honestly be better value for your money.", "rating": 4, "date": "2015-03-02"}, {"excerpts": ["**Grilled Five Dot Ranch beef with mustard-miso oyster sauce - Nice flavors!\n", "*", "**Salted caramel floating island, coconut-creme fraiche sherbet, strawberries - A MUST. "], "author": "Nikitha R.", "review": "I've been waiting to check this place out since it opened and finally had the chance to last Sunday. There was ample seating at the bar when we walked in at 6:30 pm and my friend and I were seated immediately. We were able to order a la carte at the bar but there is a prix fixe menu if you are seated at a table.\n\nHighlights:\n***Asparagus with lime pickle yogurt and pistachio - The yogurt paired perfectly with the asparagus and the pistachio added a nice crunch to every bite.\n*** Tomato curry roti with ricotta and fava hummus - The roti was not cooked to my liking but the tomato curry and ricotta was AMAZING.\n***Grilled Five Dot Ranch beef with mustard-miso oyster sauce - Nice flavors!\n***Salted caramel floating island, coconut-creme fraiche sherbet, strawberries - A MUST. I'm not usually a fan of salted caramel but this dessert was soooo good.\n\nOverall, the quality of food and drinks and service were great but I personally enjoyed Statebird Provisions more.", "rating": 4, "date": "2015-05-11"}, {"excerpts": ["The only dish that disappointed for us was the grilled Five Dot Ranch beef with mustard-miso oyster sauce.  ", "Something about this just didn't gel and for us it was fairly bland.  "], "author": "Mike W.", "review": "The Progress absolutely lived up the hype and met our lofty expectations.  Our service was great,--friendly and attentive. All the dishes were explained when requested and we were given advice on which dished to order so as to not have too much or not enough food.\n\nWe had six dishes, no extras and no dessert.  The best was the lamb merguez with yellow eye beans, octopus & crispy squid. Probably the best dish I have had in the last few years anywhere.  The  different flavors and textures matched perfectly.  An absolute standout dish.  \n\nNext best was the roasted mushrooms & kale with local wakame kraut.  Seemingly so simple but incredibly flavorful.\n\nNext best was the shaved cauliflower-herbs & pig fries, pretty fantastic as well.\n\nNext best was the smoked duck with marinated yellowfoot mushrooms & dried plum. \n\nThe only dish that disappointed for us was the grilled Five Dot Ranch beef with mustard-miso oyster sauce.  Something about this just didn't gel and for us it was fairly bland.  So overall 5 of 6 dishes were very good to excellent, with the top three above being pretty fantastic.  \n\nOnly tried one cocktail, the Paloma, which was well balanced.  \n\nThe Progress is definitely worth another visit as six dishes leaves many things untasted.  Highly recommend this place.", "rating": 5, "date": "2015-04-03"}], "lemongrass floating island": [{"excerpts": ["http://bit.ly/1HW1iAu\n\nDessert Assortment --  http://bit.ly/1DNhNkO\ndessert choose 1 per person\nlemongrass floating island, rhubarb sorbet & coconut-ginger gelée\npoppyseed angel cake, strawberries, sicilian pistachio & mascarpone\ndates à la mode, St. George NOLA, hazelnuts & chocolate\n\nSo much food!  "], "author": "Rodney H.", "review": "Since I'm huge fan of State Bird Provisions, it was only a matter of time before I would finally have dinner at their sister restaurant, The Progress.  I just had to wait a couple of months for the hype to die down a little bit.  Surprisingly, it wasn't as difficult to land a reservation here than for State Bird.\n\nWhen you walk in, it's a much more grander scale than State Bird.  The decor is warm and looks a lot brighter.  Plus they have two upper balconies for dining.  The big difference with The Progress is that they have a full cocktail bar here with tables so you can dine at the bar as well.\n\nThe food menu is completely different and can hold it's own against State Bird.  Where State Bird is more of a dim sum and tapas style restaurant, the Progress has a more family style dining approach with a 6-course dinner.  While the experience is still similar, the food portions here are larger.  I dined here with a couple friends so sharing each dish between the three of us was pretty easy to do.  The only thing that did take a while was for us to decide which 6 dishes to pick for our dinner.\n\nHere's what we ordered:\n\nComplimentary \"Banchan\" --  http://bit.ly/1FnBuQb \n\nRaw Japanese Snapper with Turnips & Crème Fraîche -- http://bit.ly/1HVWSJL \n\nSmoked Duck with Marinated Pioppini Mushrooms & Dried Plum --  http://bit.ly/1yZ5FFK\n\nShaved Cauliflower-herbs & Pig Fries --  http://bit.ly/1yZ6zC7\n\nAromatic Spiced Squab with Salted Chili Paste -- http://bit.ly/1HW03kN \n\nLamb Merguez with Yellow Eye Beans, Octopus & Crispy Squid --  http://bit.ly/1HW1iAu\n\nDessert Assortment --  http://bit.ly/1DNhNkO\ndessert choose 1 per person\nlemongrass floating island, rhubarb sorbet & coconut-ginger gelée\npoppyseed angel cake, strawberries, sicilian pistachio & mascarpone\ndates à la mode, St. George NOLA, hazelnuts & chocolate\n\nSo much food!  And we enjoyed pretty much everything we ordered.  My faves were definitely the Smoked Duck which was similar to the duck I had back at State Bird minus the pancakes, the Pig Fries because of their sheer fried pork awesomeness,  and surprisingly, the Lamb Merguez with Octopus and Squid, simply because I'm not into lamb that much.  But somehow they found a way to bring that dish all together and the Lamb Merguez didn't have an overpowering lamb taste.  The dessert assortment, while good, was a little bit of a let down in comparison to State Bird's dessert offerings.  I might end up skipping dessert next time since it's optional.\n\nJust recently, they changed the food menu at the bar.  Though it's still a la carte, the portions are more tapas sized like State Bird and at more affordable prices.  So basically, you can get a \"State Bird\" experience at the bar.\n\nIs The Progress better than State Bird?  It's pretty close,  Food-wise they're almost equally impressive, but I still prefer the whole \"dim sum\" experience at State Bird to be more entertaining.   Nonetheless, The Progress is an amazing follow up from the State Bird Provisions team and I wouldn't hesitate to go back again to try their other dishes, just like I would with State Bird.", "rating": 5, "date": "2015-09-30"}, {"excerpts": ["The lemongrass floating island was worth it--the sorbet and cream blending to be surprisingly light. \n\n"], "author": "Laura S.", "review": "Playful and inventive, but also fussy and salty.  While especially the simplest dishes showed off inventive style, there were many moments where family style didn't feel like the best medium.  I'm a compulsive sharer--at Gary Danko, the server brought us an extra plate because we were eating each other's dishes--but the added steps: assembling the 4 ingredient squab, selecting which lamb mix-ins we wanted, pouring the pork broth over the tumble of plain-looking \"treasures\" and especially having to divide each dish into 4 portions, felt like the next version of making guacamole tableside: a gimmick that sidelined dinner in favor of the show.\n\nAnd while some of the dishes were fantastic, some over-favored fermenting and many were stingingly salty.  The Chef's gifts were roasted mushrooms in crisp housemade furikake, tempura mussels with too much black pepper, jerky with peanuts that tasted a lot like kalbi, housemade ham on a cracker, radishes with butter, but the unexpected stand out was the oranges with curry oil--a weirdly rich, refreshing bite.\n\nLamb Tartare--I loved the black rice cracker, but the pickled kohlrabi overpowered the other mix-ins. After picking it out, I could better taste the fresh meat. Perhaps I could have asked our server to hold them, but if my fiance doesn't like fennel, and the other couple have their own preferences, and we're eating out of the same dish; well, you get the picture.\n\nRoti came out burning hot and crisp. Like the oranges, the uninspiring description belied a winning dish. I would have gladly eaten the whole serving smeared with the tart, homemade ricotta.\n\nTreasure Chest was the first salt bomb.  The pork broth was rich, but needed the surprisingly mild trout quenelles (think rubbery matzo ball) to tame its saltiness.  The mochi balls were gritty instead of chewy and smooth. The fermented sausage was new for me--strong sausage with a sour punch like sauerkraut--but it didn't necessarily go with the broth.\n\nThe Morels, recommended by one of our innumerable servers, were blindly salty. Couldn't enjoy the custardy egg yolks, or the tender mushrooms, it was all salt.\n\nPolpette was not my choice but I'm so glad we got it--the creamy smoked potatoes made the dish.\n\nSpiced Squab was served as a lettuce wrap and the dark meat was richer than I'd anticipated. The wings were dried out, tough instead of crispy, and overseasoned. The right amount of rub was better applied to the meatier breast.  \n\nWe opted for 6 courses + 2 desserts. I should have listened to fellow yelpers: the poppyseed cake was moist, but utterly boring with stewed strawberries. The lemongrass floating island was worth it--the sorbet and cream blending to be surprisingly light. \n\nThe 4 of us were seated at a booth on 3 sides of a table--the 4th side was too close to our neighbors for anyone to sit there, so the two of us at the heads of the table weren't within arms distance of the center of the table, making family style even more challenging.  But maybe I'd forgive that because of the bathrooms. Possibly the greatest bathrooms ever. Not only did they have the \"vacant/occupied\" deadbolt--a must for single stall, unisex bathroom--but extra toilet paper was wrapped in festive giftwrap tissue and the walls and floors were pink glitter, as if a bouncy ball had exploded inside.", "rating": 3, "date": "2015-04-12"}], "rhubarb sorbet  coconutginger gele poppyseed angel cake": [], "strawberries sicilian pistachio  mascarpone": [], "datesla mode": [], "st george nola": [], "hazelnuts  chocolate": []}