{"bowl of soup": [], "bowl of chili": [], "veggie delight": [], "chef": [{"excerpts": ["I had the Chef's Salad with house-made poppy seed dressing.  ", "While I could appreciate the quality of the ingredients (Niman Ranch meats), it was a little bland, and seriously under dressed.  ", "I asked for more dressing and that helped somewhat.  "], "author": "Liz S.", "review": "If Toast, the restaurant, were toast, the food...what kind would it be?\n\nSourdough.  Very San Francisco, a step up from white bread, tasty, but not too \"out there\".\n\nThis new location looks a lot like the original one on Church, with more room.  Everything about it is clean and organized, including the food.\n\nImagine that you are at a diner and your food comes out looking exactly like the picture on the menu, instead of a thrown-together, fat-laden, mess.  You'd probably be happy with the healthier choice, but you might kind of miss the greasy spoon taste.  That's how Toast feels to me.\n\nMy lovely lunch date Kristina had a scramble, which came with hash browns and toast - it was good.  I had the Chef's Salad with house-made poppy seed dressing.  While I could appreciate the quality of the ingredients (Niman Ranch meats), it was a little bland, and seriously under dressed.  I asked for more dressing and that helped somewhat.  We shared the apple pie for dessert which was just ok.\n\nI think they are doing well, judging by the weekday crowd that was in there the day that we went.  I can see why - it is a reliable choice.  Service was nice, so no issues there.\n\nI like Toast, the restaurant, but just like toast, the food, it's not something that I'll get overly excited about.", "rating": 3, "date": "2008-07-08"}, {"excerpts": ["And best of all they didn't even make a bad comment when I went healthy with my AMAZINGLY GENEROUS chef salad ", "but I ruined my healthy attempt with the most delicious item to come out of that kitchen - HASH BROWNS ", "(read my Yelp review of Toast Eatery on Church).  "], "author": "Scott P.", "review": "I FIRST WANT TO GIVE A BIG SHOUT OUT TO MY TOAST EATERY GIRLS:  \n\nCHELSEA\nJESSICA\nTRACI\n\nThey made me feel so welcome tonight.  I hate dining alone but I felt like I didn't because these girls made me feel like I had company.   And best of all they didn't even make a bad comment when I went healthy with my AMAZINGLY GENEROUS chef salad but I ruined my healthy attempt with the most delicious item to come out of that kitchen - HASH BROWNS (read my Yelp review of Toast Eatery on Church).  I have already warned them I am coming in drunk one night and ordering the plate of hash browns with the sour cream and black olives and all the other good stuff!  \n\nI have been anticipating the opening of this place for close to a year.  I spilled the beans about it to my favorite blog sf.eater.com I have been peaking in the window wondering about the progress.  Well folks if you were die hard Herb's (may they rest in peace) please don't take your Herb's attitude to Toast.  It is a different place.  BUT THEY DID GIVE A NICE TRIBUTE TO HERB'S.  Just look at the big piece of toast hanging above the restroom.  You will understand when you go in and check it out.  \n\nI tell you don't wait, RUN, get in there, because this weekend is opening weekend and it will be crazy.  Those Noe Valley people who don't travel beyond the confines of 24th Street will kick themselves that they never made way down to Church and Day.  \n\nI was excited to learn they are open until 10:00.  Not sure if that is all nights but tonight they most certainly are open until then. I say if Pomodoro can do it so can Toast.  \n\nI just hope on Saturday and Sunday mornings they don't kick me out for bringing in my BERNIE'S COFFEE from across the street.  I love a good Bernie's and so does the rest of the hood.  My prediction is in due time it will be on the menu as well. \n\nSeriously this was my first dinner experience at my favorite breakfast spot.  I will be going back over and over again.  (Shhh inside scoop...maybe they will be putting some dinner items on the menu as time goes on!)   You didn't hear that from me.\n\nMy mornings will be forever changed when I walk out the door of my apartment building and smell the yumminess of the place we call Toast Eatery.\n\nChelsea, Jessica, and Traci hang in there girls you are going to get lots of business but remember...I gave you the first shout out! \n\nThanks from the guy who lives across the street!", "rating": 5, "date": "2008-06-26"}, {"excerpts": ["The \"chef\" at the grilled was creepily staring at me the entire time I was there! "], "author": "Briza Y.", "review": "So, I have passed this place on the 48 bus many times and always see lots of people eating here for lunch. Today I stopped for lunch and ordered some classic Eggs Benedict. I believe that if you serve eggs benedict you know how to make it well, considering that there are 4 main ingredients: Eggs, toaster muffin, Canadian bacon, and Hollandaise sauce (which is mainly butter and lemon juice). The egg was cooked correctly and the muffin was toasted right! Yay! The bacon was too chewy and I could barely cut it. The Hollandaise sauce was horrible! Where the heck was the paprika?! It was just bland and boring. Plus, the hash browns were nothing special and sat on the plate in the shape of a square. Shouldn't it be piled high in a beautiful mound of crispy potatoes? I think so.\n\nSo the food was blah. I ate half of my food, which totaled to $12.03. However, this was only half of the bad experience I had here. The \"chef\" at the grilled was creepily staring at me the entire time I was there! It was so awkward and made my dining experience just that much worse.\n\nMy suggestion is to stay on the 48 and pass this place by...", "rating": 1, "date": "2010-03-13"}, {"excerpts": ["I ordered the Chef Salad with poppy seed dressing. ", "There wasn't that much dressing, or it was just extremely light, to the point where there was hardly enough flavor. ", "Had to order blue cheese dressing on the side! ", "It was really just alright...had hardboiled eggs, avocado, cheese, ham, turkey, sprouts (which I liked), lettuce, tomato, olives...and with a baguette. "], "author": "Eryn K.", "review": "Solid 3 Stars. This is a practical breakfast/brunch/lunch place. Come here if you just want one. The food was good...but not amazing. The service was...alright.\n\nMy friend ordered the Mediterranean scramble - delicious. The hash browns were super crispy...I like it when they're more soft inside but crispy on the outside.\n\nI ordered the Chef Salad with poppy seed dressing. There wasn't that much dressing, or it was just extremely light, to the point where there was hardly enough flavor. Had to order blue cheese dressing on the side! It was really just alright...had hardboiled eggs, avocado, cheese, ham, turkey, sprouts (which I liked), lettuce, tomato, olives...and with a baguette. It was just okay.\n\nIt was just okay but everything else on the menu looked good. Like the macadamia/coconut pancakes! Next time maybe.\n\nThe service...well they just seemed like they wanted NOTHING to do with that place. Yes they filled my water, but they weren't that friendly and frankly just brought nothing to my table (metaphorically speaking of course!).", "rating": 3, "date": "2010-08-31"}, {"excerpts": ["He had the chef salad "], "author": "Kelly M.", "review": "We stopped here last Friday night because it was hot and neither of us wanted to cook.  He had the chef salad and I had the french dip sandwich with sweet potato fries.  Both were disappointing.  \n\nThe salad had dressing pre-tossed and then all the extra ingredients piled on top...so, no dressing on them...  \n\nThe sandwich was very bland and the dipping au jus was VERY salty (that seems to be a theme in restaurants we've gone to lately...I feel like I write that a lot!)  \n\nAnd finally the sweet potato fries, usually a favorite, were limp and oily.  I LOVE the ones at Taylor's in the Ferry Building.  They are the standard I compare all other sweet potato fries to...and these simply paled in comparison.\n\nVery, VERY mediocre food.  I can't imagine why we would go back...", "rating": 2, "date": "2008-09-10"}, {"excerpts": ["Chef Salad w/ ", "Ranch Dressing - $9.25 :", ": This looked huge and filling ", "but I wasn't satisfied with this salad for some reason.  "], "author": "Limzer L.", "review": "Went here on a Saturday and it was the place to be.  There was definitely a wait.  SO I guess that's why we decided to come here.  The food must be that good, then we shall try it.\n\nMimosas - $6.95 :: Average, nothing bad really...\n\nChef Salad w/ Ranch Dressing - $9.25 :: This looked huge and filling but I wasn't satisfied with this salad for some reason.  This seemed so appetizing  but the salad as a whole didn't amuse my tongue and stomach.\n\nBeef Cheesesteak Sandwich w/ Curley Fries - $10.25 :: This was well portioned and this tasted so delicious!  But then again, what fried food isn't?!  \n\nAnyways, I'd come here again to try more breakfast items than lunch items.  It's definitely worth another shot.", "rating": 3, "date": "2009-03-03"}], "grilled portabella": [], "albacore tuna": [], "portabella mushroom": [], "triple deck club": [], "blta": [{"excerpts": ["Was torn between the Patty Melt and the BLTA (bacon, lettuce, tomato, avocado) and went for the BLTA instead. "], "author": "Cindy W.", "review": "Super cute diner. Came for a late lunch. No wait. People were still finishing up but lots of 2-tops to spare. Chose to sit on one of the silver counter bar stools. (I like dangling my feet from a higher position.) Loved the decor, fun vibe, and easy feel of the place.\n\nMenu had a LOT to offer. Can see why people come for brunch with its full page of egg scrambles, omelets, pancakes, and waffles. We went for the sandwiches instead. Was torn between the Patty Melt and the BLTA (bacon, lettuce, tomato, avocado) and went for the BLTA instead. I was thinking it was healthier. \n\nI really liked my sandwich. Served on your choice of bread (I chose wheat), the sandwich was thick with crisp crisp bacon slices (felt like 4 or 5), lettuce, tomato and avocado. Tasted super fresh and fit the bill for a hot Noe day. Comes with a side of fries or salad. Again going for the healthier option, chose the mixed greens. Tasty!\n\nMy friend had the humongo pastrami sandwich. It didn't seem big at first but with the Boudin sourdough bread, and then the inch high pastrami, not to mention the lettuce and red onions, you really have to squeeze the tops and bottoms down to take a bite. He had skinny steak fries which were super good. Stick straight, not soggy, stood well, and dipped well in ketchup (meaning doesn't fold under the weight of the sauce). For $1 more, you can get the sweet potato fries. Maybe next time.\n\nTwo sandwiches totaled a little over $19 after tax. Very hearty. \n\nMy only critique is that it is warm in there, at least on a hot day. Aim for a seat by the door.", "rating": 4, "date": "2009-09-17"}], "chicken pesto": [{"excerpts": ["Chicken pesto sandwich- ", "really moist chicken!\n", "Heat Burger with brioche bun was really really good!\n", "Definitely coming back when I'm in Noey Valley"], "author": "Florita A.", "review": "Croissant toast with vanilla/cinnamon really yummy!\nChicken pesto sandwich- really moist chicken!\nHeat Burger with brioche bun was really really good!\nDefinitely coming back when I'm in Noey Valley", "rating": 4, "date": "2016-05-28"}, {"excerpts": ["The pear salad is fresh and particularly good with added grilled chicken, and the sandwiches are tasty (the chicken pesto in particular). ", "The fries -- both the regular and the sweet potato -- are good. ", "When I have eaten at the restaurant, service has always been fast and friendly. ", "Oddly enough, I have never tried weekend brunch (the sidewalk is always crowded, so it must be decent!)."], "author": "Katie M.", "review": "Toast has become one of my favorite Noe Valley takeout establishments; the service is fast and reliable, and orders are consistently ready ten to fifteen minutes after I place them. The pear salad is fresh and particularly good with added grilled chicken, and the sandwiches are tasty (the chicken pesto in particular). The fries -- both the regular and the sweet potato -- are good. When I have eaten at the restaurant, service has always been fast and friendly. Oddly enough, I have never tried weekend brunch (the sidewalk is always crowded, so it must be decent!).", "rating": 3, "date": "2012-03-05"}], "chicken cheese steak": [{"excerpts": ["Chicken cheese steak and corned beef hash are both appropriately greasy and tastily spot-hitting."], "author": "Rob T.", "review": "I live nearby but only came here after over a year. The lines outside on the weekends scream \"hipster joint\", but when I set foot inside on a weeknight for some dinner take-out, the ambiance was more locals' family-friendly establishment.\n\nChicken cheese steak and corned beef hash are both appropriately greasy and tastily spot-hitting.", "rating": 4, "date": "2011-03-05"}], "beef cheese steak": [], "hot pastrami": [{"excerpts": ["The Reuben sandwich is great and so is the hot pastrami. ", "Get the sweet potato fries. ", "The regular ones get cold easy and taste like a rubber band. \n", "The service is decent enough. ", "I'm not asking for a happy ended with my sandwich. ", "I'm the kinda guy that wants my food and be left alone."], "author": "Deejay K.", "review": "I find it funny how people that are not from a particular neighborhood will talk shit about going into another neighborhood. If babies and dogs offend you. Keep your ass in your own neighborhood and stop being a whiny bitch. \nThe menu isn't creative. It's a tad expensive, but I know what the rents go for on this street and all the lovely taxes that business owners pay. \nToast beats the hell outa Denny's or whatever shit hole you can eat at for less. Pick your poison. This place is a diner. What do you expect? \nThe chefs salad is awesome. The Reuben sandwich is great and so is the hot pastrami. Get the sweet potato fries. The regular ones get cold easy and taste like a rubber band. \nThe service is decent enough. I'm not asking for a happy ended with my sandwich. I'm the kinda guy that wants my food and be left alone.", "rating": 4, "date": "2010-08-02"}], "bbq pulled pork": [], "grilled ham and cheese": [], "albacore tuna salad": [], "bleu cheese": [{"excerpts": ["My friend ordered the salmon salad, and having asked for no bleu cheese, got a bed of greens with a formerly-frozen looking chunk of salmon and a few cherry tomatoes. ", "Another friend commented that her salad was bland. ", "I can't say that I need to go back. ", "Next time, I'll check out a Noe bakery for brunch."], "author": "Emilia S.", "review": "I love that this place is called an \"eatery\" versus \"restaurant.\" I love that it has toast-inspired art on the walls. I love that it has big windows and sits in the heart of Noe. I did not, however, love my brunch.\n\nBased on recommendation, we took our out-of-town visitors to Toast for brunch on Saturday. There was about a 20 minute wait which wasn't a big deal. The five of us were seated and handed menus. I noticed that the prices were about $2 more than my favorite brunch spot, Lower Haight's The Grind. They even had my lox scramble, but for $11.95 I decided against it.\n\nThree of us ordered eggs and two ordered salad. My turkey scramble tasted fine, but the presentation was a D+ at best. The eggs had a square of cheese poorly melted on top, and the hashbrowns were also a crispy square, cut from a mold. It was also a pretty small portion, although I support their efforts at portion control. My friend ordered the salmon salad, and having asked for no bleu cheese, got a bed of greens with a formerly-frozen looking chunk of salmon and a few cherry tomatoes. Another friend commented that her salad was bland. I can't say that I need to go back. Next time, I'll check out a Noe bakery for brunch.", "rating": 3, "date": "2010-06-14"}], "french": [{"excerpts": ["We decided to share the regular french toast (with added fruit) and the salmon scramble which was SO delicious and great in portion size. ", "We got the scramble with english muffins, so we essentially made our own benny's with scrambled eggs which tasted really good. ", "The hash browns could have been served in greater amount, but they are crispy and yummy. "], "author": "Jodi H.", "review": "Toast is a great option for a short wait and affordable breakfast/brunch in Noe Valley.\n\nUsually when people say Noe Valley, I think yoga moms, bougie lifestyles, and eggshell/tan colors. We happened upon Toast by accident, since we originally planned on going to Griddle Fresh...but after eating realized it was Toast. How hilarious! Their signage says eat Toast, which is pretty cute and not as \"telltale\" of the name as I thought. All inside the space they have graffiti/street art by this famous SF artist and pieces of toast animated and pictured. The vibe is definitely family-friendly, and very cozy and low-key--exactly what we needed.\n\nBoo was hungover from the night before, and I was pretty hungry and was looking for some hearty grub. We decided to share the regular french toast (with added fruit) and the salmon scramble which was SO delicious and great in portion size. We got the scramble with english muffins, so we essentially made our own benny's with scrambled eggs which tasted really good. The hash browns could have been served in greater amount, but they are crispy and yummy. They also have brunch items like benny's, sandwiches, pancakes, and the like.\n\nToast is actually as it is. There's nothing extra remarkable about it or the food. Our server was a kind girl who seemed to have so many tables to keep track of. She got her job done, but we didn't get any homey treatment because they did seem understaffed. The only things that could be improved are the house coffee (said the boo) and perhaps providing heaters for outdoor seating. However, Toast is more like a diner than a SF breakfast place...which is a great option especially in Noe Valley.", "rating": 4, "date": "2017-11-03"}, {"excerpts": ["I only come here when my husband wants the croissant French toast. ", "It's always such a guessing game on what to get. ", "I got the wet burrito before - bland, lack of good flavor. ", "I got the regular breakfast combo with French toast and hot links today. \n\n"], "author": "Christine L.", "review": "Poor reviews of this place versus the other Toast location leads me to think that the owner does not visit this location as much as the other one.\n\nI only come here when my husband wants the croissant French toast. It's always such a guessing game on what to get. I got the wet burrito before - bland, lack of good flavor. I got the regular breakfast combo with French toast and hot links today. \n\nThe hasbrowns were stale, and my sausage was totally burnt. It's a good thing I flipped the sausage over to see how the other side was, or I would have had a nasty surprise. They were nice enough to give me a new sausage. I overheard the table behind me that the waiter brought out the wrong item for the gentleman, so they had to do that one over too.\n\nI'm not bashing on the people who work here, but more am wanting to bring to attention that this place really lacks consistency, and honestly, needs a good manager to be on site to help bring this place up to it's full potential.\n\nEven the music in the background was so confusing that I actually noticed how weird it was. I could hear the sound of the tv, and the music playing on the speakers. The weirdest part though was, that the kitchen was playing music that was totally different, and I thought it was inappropriate considering that all the customers could hear it. \n\nI've been to the other toast location - that one has way better customer service. I hope that Toast ups it's game - it'd be nice if Noe Valley had another solid breakfast stop.", "rating": 2, "date": "2017-12-02"}, {"excerpts": ["I ordered the Croissant French Toast which is probably heavy in butter and calories ", "but it was pretty good.  ", "I'd probably go again for the Croissant French Toast."], "author": "Mike L.", "review": "Toast Eatery has a town diner type of feel without the diner prices.\n\nI went on a Saturday morning and there was a decent wait of people. My friend and I put our names down and went to Starbucks to get some coffee. They moved pretty quickly and sat us by the time we got back, we still had our Starbucks with us. One suggestion I have to a lot of those breakfast/brunch places that have a lot of people waiting, you should consider having a coffee station outside or something to convince folks to wait because I'm sure they lose people along the way.\n\nI ordered the Croissant French Toast which is probably heavy in butter and calories but it was pretty good.  I guess some of those melds of breakfast items do work, I still haven't tried a cronut.\n\nI'd probably go again for the Croissant French Toast.", "rating": 4, "date": "2015-10-20"}, {"excerpts": ["My son had some French toast which was quite tasty. ", "Bacon also looked nice and crispy. ", "it was very hard to get a glass of water and the service was not attentive. ", "I for sure will not return."], "author": "Pauline C.", "review": "That was really an undesirable meal.   My coffee cup arrive with old food on the side of it. I got a wet vegetarian burrito and it really had no flavor- the inside was just beans, a little egg and a little cheese. The black beans had zero salt and no flavor. The Ranchero sauce was also very uninspiring. My son had some French toast which was quite tasty. Bacon also looked nice and crispy. it was very hard to get a glass of water and the service was not attentive. I for sure will not return.", "rating": 2, "date": "2017-07-29"}, {"excerpts": ["The croissant French toast is a must. ", "Go big or go home. ", "Also, the Joe's scramble with turkey hit the spot. ", "Def coming back here for breakfast. ", ":)"], "author": "Alex G.", "review": "The croissant French toast is a must. Go big or go home. Also, the Joe's scramble with turkey hit the spot. Def coming back here for breakfast. :)", "rating": 5, "date": "2016-10-08"}, {"excerpts": ["This was particularly evident for my mom's French Toast which looked like ", "it was just flopped onto the plate. ", "Dusted with powdered sugar, but no other garnish. ", "Very different from the pictures we saw on yelp."], "author": "Elaine Y.", "review": "It was okay...not the best brunch I had, but definitely not the worse either. The hashbrowns were my favorite part of the meal though - crispy on the outside and fluffy on the inside. Most places can't get it right, but I thought Toast did it well. \n\nAs for my breakfast burrito, it was a bit of a letdown. It certainly had a lot of stuff: sour cream, cheese, avocado, eggs, salsa, and your choice of meat (I went with chicken apple sausage), but it wasn't well mixed. It was very mushy on the side with the condiments and cold. Cheese wasn't melted and there also wasn't a lot of meat in my opinion. I did like that the burrito was lightly grilled though,\n\nAll in all, food was decent. However, presentation doesn't seem to be a huge thought. Each plate was served up on a GIANT plate, but it was hardly filled. It just made the dish seem skimpy. This was particularly evident for my mom's French Toast which looked like it was just flopped onto the plate. Dusted with powdered sugar, but no other garnish. Very different from the pictures we saw on yelp.", "rating": 3, "date": "2015-04-06"}, {"excerpts": ["The croissant french toast is always served with fresh berries and bananas (they don't skimp on these either) and the omelets are made well. ", "Their sandwiches haven't been bad either. "], "author": "Esther A.", "review": "This is our go-to place for take out breakfast. It's quick, local, fairly priced, and food meets our expectations of what we want from a diner. Quite frankly, I'm not sure what others leaving low reviews purely for the atmosphere are expecting when it's a diner. \n\nThe croissant french toast is always served with fresh berries and bananas (they don't skimp on these either) and the omelets are made well. Their sandwiches haven't been bad either. Our orders are usually packaged up nicely and condiments/utensils provided.\n\nWhenever we don't feel like cooking on the weekend w/out having to wait the typical SF brunch spot waits, we come here. We order via phone amd upon arrival the food is ready to go. And so far we have not been disappointed!", "rating": 4, "date": "2013-02-20"}, {"excerpts": ["The French fries that came with my fish and chips were gross and soggy likely due to the fact they packed the fries and hot fish in with a ", "I can only assume was cold salad vs. The wilted nasty pile in the corner of the box. ", "The fish was the only decent thing in the box but the \"tater sauce was bland and mildly oily. ", "So far the only redeeming factor has been the Mac and cheese.  \n      ", "I strongly recommend the owner teach his staff how to properly box to go food a salad should never be put in the same container as hot fries or any hot food for that matter. ", "And line checks cause the tarter sauce tastes like mildly chunky mayo bland."], "author": "Kristen H.", "review": "Just got delivery through post mates. The French fries that came with my fish and chips were gross and soggy likely due to the fact they packed the fries and hot fish in with a I can only assume was cold salad vs. The wilted nasty pile in the corner of the box. The fish was the only decent thing in the box but the \"tater sauce was bland and mildly oily. So far the only redeeming factor has been the Mac and cheese.  \n      I strongly recommend the owner teach his staff how to properly box to go food a salad should never be put in the same container as hot fries or any hot food for that matter. And line checks cause the tarter sauce tastes like mildly chunky mayo bland.", "rating": 3, "date": "2015-03-30"}, {"excerpts": ["Corn beef hash was tasty as was the croissant French toast. ", "Price is right and maybe even cheaper for Noe Valley. ", "The only reason for 3 stars is the service. ", "They had many open tables but were extremely short staffed. ", "That meant there were groups of people on the wait list, just hanging around outside. ", "At one point, people just went in and grabbed their own seats. ", "Two servers in the whole restaurant for a Saturday breakfast rush is just not enough. ", "But I'd definitely come back and try again!"], "author": "Jessica L.", "review": "Hash brown hill is a must try! I got it with the avocado, sour cream and onions on the side with just the cheese on top. Delicious! \n\nCorn beef hash was tasty as was the croissant French toast. Price is right and maybe even cheaper for Noe Valley. The only reason for 3 stars is the service. They had many open tables but were extremely short staffed. That meant there were groups of people on the wait list, just hanging around outside. At one point, people just went in and grabbed their own seats. Two servers in the whole restaurant for a Saturday breakfast rush is just not enough. But I'd definitely come back and try again!", "rating": 3, "date": "2015-10-10"}, {"excerpts": ["Great brunch spot, ordered the challah French toast and the Nutella waffles. ", "Very delicious, service was good. ", "A little right in the seating, but a definite spot to try while in Noe Valley!"], "author": "Tiffany G.", "review": "Great brunch spot, ordered the challah French toast and the Nutella waffles. Very delicious, service was good. A little right in the seating, but a definite spot to try while in Noe Valley!", "rating": 4, "date": "2014-11-02"}, {"excerpts": ["I ordered the French Dip with a side of Garlic fries as well.\n", "Cali Burger: ", "Cooked to perfection! ", "It actually doesn't come with bacon, but if you add bacon it's the perfect combo. ", "It's still delicious without it, but for you bacon lovers, it's great. ", "The patty was tender and juicy and the cheese was soft and chewy. ", "The avocados were super fresh and if blended nicely with the burger. ", "The garlic fries were OK, she wasn't too impressed with them and neither was I, ", "so I would personally opt for the regular fries ", "(They were also a dollar extra).\n", "The French Dip: Very heavy, but enjoyable. ", "The sauce was a bit too salty for my liking, but the roast beef was pretty good, as was the bread (it was very chewy). "], "author": "Brian Y.", "review": "Nice place! Wanted to get brunch in The City, and passed by this restaurant and thought we'd give it a try. Once you walk in, you feel a calm ambiance. It's a feel you get where you would think, \"Hey, this is a perfect place to cure my hangover\". The menu has a plethora of option and there's something for everyone. Their prices were average and their portions were a good size. \n\nDecor: Nice view, and Diner-style feel (well it is a diner so duh), Very bright inside, very relaxing.\n\nService: When we walked in, the hostess said we could choose anywhere we would like to sit, which was a major plus. Menus were placed at every table so there was no need to wait for them. Very friendly service and our food only took about 10-15 minutes to come out, and we were STARVING so that was good.\n\nFood: My Girlfriend ordered the California Burger, medium rare with bacon and garlic fries. I ordered the French Dip with a side of Garlic fries as well.\nCali Burger: Cooked to perfection! It actually doesn't come with bacon, but if you add bacon it's the perfect combo. It's still delicious without it, but for you bacon lovers, it's great. The patty was tender and juicy and the cheese was soft and chewy. The avocados were super fresh and if blended nicely with the burger. The garlic fries were OK, she wasn't too impressed with them and neither was I, so I would personally opt for the regular fries (They were also a dollar extra).\nThe French Dip: Very heavy, but enjoyable. The sauce was a bit too salty for my liking, but the roast beef was pretty good, as was the bread (it was very chewy). Cheese was not melted all the way which sucked, but once dipped in the sauce, I forgot about that.\n\nWould definitely come back if in the area, but wouldn't go out of my way to go there.\n\nTip: Garlic fries will leave you with garlic breath the ENTIRE day so beware and prepare!!!", "rating": 4, "date": "2015-01-13"}, {"excerpts": ["They serve eggs, pancakes, french toast, waffles, salads, burgers, and sandwiches.  ", "I definitely plan on coming back to try other items.  ", "Yay for more diverse selections on 24th Street!!!"], "author": "Joe M.", "review": "Diner food in Noe Valley...FINALLY!!  Well, I grew up there and don't remember any place serving diner food, so it was a pleasant surprise to find Toast Eatery on 24th Street the other day.  The place, I believe, is fairly new...maybe only a year or two old.  I could be wrong.  Either way, it still looks pretty clean inside.  They have some cool artwork hanging on the walls and I appreciated that they had a TV as well. (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=kPG7GQi1OdpQ7Ehgge9EoA)\n\nEven though it was lunchtime, I'm a sucker for breakfast food and was craving some eggs.  So I went with the \"24th street\" omelet.  (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=pYJIIa2lU_6NuxK7N5KFUw)  It was made with chicken apple sausage, spinach, sun dried tomato, and feta.  It was pretty good.  All the ingredients had a distinct taste but still went well with each other.  The omelet also came with some pretty decent hash browns and my choice of bread.  (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=y9d8n_ZcRMpab4heJv9-pw)\n\nPricing is average, about $10 a pop.  Service was attentive and the food came out fast.  The menu is extensive enough that you can come back several times and still have plenty of options.  They serve eggs, pancakes, french toast, waffles, salads, burgers, and sandwiches.  I definitely plan on coming back to try other items.  Yay for more diverse selections on 24th Street!!!", "rating": 3, "date": "2011-08-23"}, {"excerpts": ["This review for the Toast French Toast (haha). ", "Pretty tasty, I must say. ", "I was a meh fan of the location on Polk Street near my hood, but liked the diner feel of this location a bit better. ", "The challah french toast in particular was really good--worth the trip alone and under $8, pretty reasonable."], "author": "Mel G.", "review": "This review for the Toast French Toast (haha). Pretty tasty, I must say. I was a meh fan of the location on Polk Street near my hood, but liked the diner feel of this location a bit better. The challah french toast in particular was really good--worth the trip alone and under $8, pretty reasonable.", "rating": 4, "date": "2013-09-14"}, {"excerpts": ["Waiter brought the wrong order to my friend, and after 5 minutes of waiting for new actual order he tells her they're out of the bun she needs for her french dip. ", "Food was also meh."], "author": "Samantha C.", "review": "Waiter brought the wrong order to my friend, and after 5 minutes of waiting for new actual order he tells her they're out of the bun she needs for her french dip. Food was also meh.", "rating": 2, "date": "2014-08-10"}, {"excerpts": ["My friend and I shared a TOAST COMBO (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=sQ3j-_JMC12bzVgLs1oKrw) and an order of croissant French toast. ", "I had high hopes for the CROISSANT FRENCH TOAST (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=M7eudIHtBgzFuxUYQeGDgQ) but it was a  major disappointment. ", "The math doesn't quite add up. ", "This is what I mean:\n\nCroissants = good\nFrench toast = good\n", "* French toast = meh\n\n", "Theoretically, croissant French toast should be double the goodness of the individual components. ", "In reality, all the things I love about croissants (flakiness, buttery-ness, fluffy-ness, airy-ness) gets lost in French toast form. ", "Instead, I was left with extra-greasy French toast :(\n\n"], "author": "Steph L.", "review": "While you're waiting for a table for brunch, you could make a game out of guessing how many strollers/babies/dogs you see walking past. We even saw a stroller with two babies! No, it wasn't a double stroller - one kid was in the seat, and the other was bundled up in the storage bin underneath. Who knew stroller space would be as scarce as SF real estate?\n\nAfter waiting about 45 minutes for a table of four, my friends and I finally got seated (we lost count of the number of strollers/babies/dogs). My friend and I shared a TOAST COMBO (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=sQ3j-_JMC12bzVgLs1oKrw) and an order of croissant French toast. The pancakes and hashbrowns from the combo were decent (but anything smothered with syrup and ketchup, respectively, is good in my books) and I really liked the chicken apple sausage.\n\nI had high hopes for the CROISSANT FRENCH TOAST (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=M7eudIHtBgzFuxUYQeGDgQ) but it was a  major disappointment. The math doesn't quite add up. This is what I mean:\n\nCroissants = good\nFrench toast = good\nAnd yet, Croissants * French toast = meh\n\nTheoretically, croissant French toast should be double the goodness of the individual components. In reality, all the things I love about croissants (flakiness, buttery-ness, fluffy-ness, airy-ness) gets lost in French toast form. Instead, I was left with extra-greasy French toast :(\n\nI had a bite of my friend's BELGIAN WAFFLES WITH NUTELLA & STRAWBERRIES (http://www.yelp.com/biz_photos/Hyjorx4CzbEJGEjaUzenng?select=aP92-9ez-0ism6Lhu9VX7Q) and that was scrumptious! But then again, I feel the same way about melted nutella as I do syrup and ketchup...\n\nToast is a good enough place for brunch (decent menu and average food), but not a place I would wait in line for.", "rating": 3, "date": "2010-04-18"}, {"excerpts": ["I love Toast Eatery's burgers, French toast topped with mixed fruits, salmon sandwich with salad,  fries, vanilla milk shake, root beer float and their coffee. "], "author": "Kentaro K.", "review": "I love Toast Eatery's burgers, French toast topped with mixed fruits, salmon sandwich with salad,  fries, vanilla milk shake, root beer float and their coffee. i come here often and they always serve high quality food. \n\nfor breakfast over the weekend, this place is always my top choice to eat.  last time my wife ordered a joe's scrambler, and she loved it!!!  my kids love their kid's size chocolate chip pancakes.  and me, i really love their coffee, strong and bold.\n\nthis is a very comfortable small place to eat in a nice neighborhood.  if you come on the weekend, you would have to wait in line.  if you come on the weekdays during lunch time or in the evening, it is very peaceful, relaxing.   the food come quick - always fresh and hot. the fruits are always fresh and sweet, especially their blue berry and strawberries.  \n\nthe service is good.  the servers are friendly and efficient. \n\ni love this place for 1 simple reason:  their food is good. i highly recommend this place for anyone here to eat.", "rating": 5, "date": "2012-07-30"}, {"excerpts": ["Favorite: croissant French toast. ", "One drawback: $2 for real maple syrup."], "author": "Kate C.", "review": "Consistently solid. Still my go-to spot for a chill brunch. Great omelets, delicious hash browns, solid sourdough toast. Favorite: croissant French toast. One drawback: $2 for real maple syrup.", "rating": 4, "date": "2014-05-19"}, {"excerpts": ["I had the french toast made out of croissant.  ", "That was a good dish.  ", "This time i got the chocolate chip pancakes.  ", "They were terrible.  ", "The flavor was bland and the texture was rubbery. ", "It was actually hard to cut it was so tough.  ", "It was a very disappointing meal.  ", "I did get a side of hash browns and they were delicious but come on, don't mess up pancakes!  "], "author": "Mick M.", "review": "I have eaten here before and it was really good.  I had the french toast made out of croissant.  That was a good dish.  This time i got the chocolate chip pancakes.  They were terrible.  The flavor was bland and the texture was rubbery. It was actually hard to cut it was so tough.  It was a very disappointing meal.  I did get a side of hash browns and they were delicious but come on, don't mess up pancakes!  They also charge $2 for maple syrup, who does that?  \n\nFor great pancakes go to Ella's or even Chow.  If you want the best pancakes I have ever had, go to Los Angeles and hit up Joe's for brunch on Abbot Kinney.  Ridiculous!", "rating": 2, "date": "2012-06-03"}, {"excerpts": ["Other people I've been with have been disappointed with proportion sizes but were generally happy with their meals (such as the French dip sandwich). "], "author": "Joanna A.", "review": "Been here a couple times. I've ordered eggs benedict and florentine here before and wasn't super impressed, but not disappoint either. I really don't like their hash browns though. There isn't enough to sop the sauces and yolks and the square shape bothers me. Other people I've been with have been disappointed with proportion sizes but were generally happy with their meals (such as the French dip sandwich). If you arrive at the right time on certain days, the bowl of fresh fruit is truly amazing and the freshest I've had in any restaurant.\n\nLast time I went was for my 21st birthday with a friend. But on my birthday, my friend and I had the waffle with strawberries and it was the best waffle I've had in a while. \n\nBeverage wise, I usually stick with orange juice, but I got a mimosa which was to my liking. The ratio of alcohol to orange juice was perfect. I'm tiny for the most part and not a constant drinker so if I get something strong, I usually have to make sure I eat a lot to sop it up. This was not the case though, which is why they get a 4.", "rating": 4, "date": "2012-04-18"}, {"excerpts": ["The place looks like a french bistro/retro diner. ", "I sit at the bar area.  ", "Ordered a hummus sandwich with avocado  and a salad.  ", "The hummus had way too much tahini in it.  ", "So much, in fact the nuttiness tasted almost like some food that was scorched in a pot. ", "The funny part about it was that the amount of hummus was barely there.  ", "Like you would dress the sand which with very little mayo. ", "If there was anymore hummus on the sandwich I probably would have gagged.  ", "Their greens were tasty though I guess overall it hit the spot for what I wanted at the moment.  ", "Service is ok. ", "I'll give it another try. ", "BTW bring your own salt."], "author": "A K.", "review": "So I walked in wanting something on the healthy side to eat.  I passed by and saw a dude eating a very delicate salad. So I'm in.... The place looks like a french bistro/retro diner. I sit at the bar area.  Ordered a hummus sandwich with avocado  and a salad.  The hummus had way too much tahini in it.  So much, in fact the nuttiness tasted almost like some food that was scorched in a pot. The funny part about it was that the amount of hummus was barely there.  Like you would dress the sand which with very little mayo. If there was anymore hummus on the sandwich I probably would have gagged.  Their greens were tasty though I guess overall it hit the spot for what I wanted at the moment.  Service is ok. I'll give it another try. BTW bring your own salt.", "rating": 3, "date": "2013-10-21"}, {"excerpts": ["I had the French Toast and it was GREAT! ", "My wife had a Waffle and her cousin a scramble.  "], "author": "Dominic A.", "review": "I have been living in SF for about seven months now.  I have visited Stacks, Just For You, Farmer Browns, and a few other breakfast places.  All great.... But TOAST has me writing a review.  I was going to give it a solid 4 stars, but after reading what others had to say I had to give them an extra star because I think some of the bad reviews are way off the mark. \n\nI had the French Toast and it was GREAT! My wife had a Waffle and her cousin a scramble.  It was all good stuff! \n\nI also liked the service, and the people that were eating in the joint.  They also had a GIANTS flag up and nice art! \n\nd", "rating": 5, "date": "2010-11-07"}, {"excerpts": ["Great French fries. ", "Decent Mac n cheese for kids."], "author": "olivia b.", "review": "Great French fries. Decent Mac n cheese for kids.", "rating": 5, "date": "2013-07-22"}, {"excerpts": ["My sourdough French toast was fine. ", "Other dishes on the table looked equally filling but unexciting."], "author": "Mikol G.", "review": "Meh.\n\nThe Good: Open before 10 AM midweek in Noe Valley, diverse menu, efficient service.  \n\nThe Bad: Boring food, over-mediated diner decor as predictable as the food.  \n\nThe Ugly: N/A\n\nPoints for speed. Was in and out in about 30 minutes. But had no desire to linger anyway. My sourdough French toast was fine. Other dishes on the table looked equally filling but unexciting.", "rating": 2, "date": "2010-03-31"}, {"excerpts": ["i ordered the french toast and my dad ordered eggs and my other dad ordered a breakfast burrito. ", "when the food came out i loved the way they decorated the plates. ", "i tried one bite of my french toast and i will never forget it. ", "their french toast was the best i have ever had and believe me i have had lots!!! ", "i recommend this spot as having great breakfast and i will definitely be going back again sometime soon."], "author": "Ford W.", "review": "we were taking a dog walk in the city and got hungry so we wandered down to this place because we thought it looked good. it was very busy when we got there and the smell coming from the kitchen was TO DIE FOR, so we asked for a seat outside and no problem we were seated right away, even though they were packed. i ordered the french toast and my dad ordered eggs and my other dad ordered a breakfast burrito. when the food came out i loved the way they decorated the plates. i tried one bite of my french toast and i will never forget it. their french toast was the best i have ever had and believe me i have had lots!!! i recommend this spot as having great breakfast and i will definitely be going back again sometime soon.", "rating": 5, "date": "2015-01-25"}, {"excerpts": ["Pretty good, typical all American breakfast: bacon, scrambled eggs, french toast in a cozy little restaurant.  \n\n"], "author": "Stacy L.", "review": "Pretty good, typical all American breakfast: bacon, scrambled eggs, french toast in a cozy little restaurant.  \n\nGreat location, nice atmosphere, great service not bad for a casual friendly eatery joint.", "rating": 3, "date": "2010-04-30"}, {"excerpts": ["I had a bitchin French Dip sando which was awesome.  ", "Good roast beef, no fat and a great sourdough french bread.  ", "The Au Jus was very tasty as well.  ", "I got a salad with their homemade poppyseed dressing which was good ", "but next time I'll go fries.  ", "I would definitely go back...maybe just a little bit later =)"], "author": "Kirsten M.", "review": "We happened upon this place when we passed up Pasta P because of the kid sitch.  Like too many of them.  SO, we got a seat up at the bar which was totally fine but again, the place was pretty kid filled.  I'm probably going to offend the parent's out there but you should be offended if you actually make your kids behave in a public place.  So yeah, could have done without the kids screaming, crawling under the tables and running around but I digress.  \n\nI had a bitchin French Dip sando which was awesome.  Good roast beef, no fat and a great sourdough french bread.  The Au Jus was very tasty as well.  I got a salad with their homemade poppyseed dressing which was good but next time I'll go fries.  I would definitely go back...maybe just a little bit later =)", "rating": 4, "date": "2009-03-17"}, {"excerpts": ["and I had the french dip sandwich with sweet potato fries.  "], "author": "Kelly M.", "review": "We stopped here last Friday night because it was hot and neither of us wanted to cook.  He had the chef salad and I had the french dip sandwich with sweet potato fries.  Both were disappointing.  \n\nThe salad had dressing pre-tossed and then all the extra ingredients piled on top...so, no dressing on them...  \n\nThe sandwich was very bland and the dipping au jus was VERY salty (that seems to be a theme in restaurants we've gone to lately...I feel like I write that a lot!)  \n\nAnd finally the sweet potato fries, usually a favorite, were limp and oily.  I LOVE the ones at Taylor's in the Ferry Building.  They are the standard I compare all other sweet potato fries to...and these simply paled in comparison.\n\nVery, VERY mediocre food.  I can't imagine why we would go back...", "rating": 2, "date": "2008-09-10"}, {"excerpts": ["Also had the croissant french toast with fresh fruit - the fruit was delicious, and so was the french toast!  \n\n"], "author": "Evan G.", "review": "Don't let the name fool you - Toast is open for 3 meals daily.  And while I'm bummed that I didn't get to try Toast's predecessor, Herb's Fine Foods, I think this is a good addition to the restaurants on 24th St.\n\nWe did a later Saturday brunch (1:30ish).  Letting the busboy run the wait list wasn't successful, as he wasn't quite sure who was seated, who was waiting, and what I was saying.  And there isn't a clear place as to where one should sign up for the list, or where one should wait once signed up on the list.  Hover in the doorway?  Hover near the plate glass windows on 24th St?  Hover near the curb so as not to loom over window table diners?  Not clear.  Once we were seated, things were pretty darn good.\n\nThey should install some ceiling fans - there's not a lot of air movement, and when it's warm outside, it's even warmer inside Toast.  Maybe they're trying to \"toast\" the patrons - nyuk, nyuk, nyuk.\n\nHad the Church St omelette (sausage, spinach, sun-dried tomato, feta), which was a perfectly prepared omelette, and they were more than happy to substitute potatoes with cottage cheese (thumbs up!)  Also had an iced chai, even though they didn't have it on the menu.  Also had the croissant french toast with fresh fruit - the fruit was delicious, and so was the french toast!  \n\nOur server was extremely friendly (and beautiful), and seemed to keep a pretty cool head among a bustle and noise of the crowd.  Dig the neon clock above the eatery bar, and dig the minimalist (and very clean!) bathroom.\n\nWould go back, and would like to try some of the speciality sandwiches.", "rating": 4, "date": "2008-07-31"}, {"excerpts": ["My eggs were ok as was the French toast ", "BUT my chicken sausage was the best I have eaten in awhile. ", "Decent prices for brunch... ", "cute sort of noe place.", "The hash browns were awesome... delectable really."], "author": "Pooja S.", "review": "Add half a star to the 3. We had a long wait with Sam. Nope Sam wasn't a human friend. Sam was a canine whose dad went to Toast on a rainy day and left Sam standing in the rain. \nThe food was OK for me but my husband loved his omlette... so much so that he didn't share it with me. My eggs were ok as was the French toast BUT my chicken sausage was the best I have eaten in awhile. Decent prices for brunch... cute sort of noe place.The hash browns were awesome... delectable really.", "rating": 3, "date": "2009-03-03"}, {"excerpts": ["Oh- and their french toast made with croissants are awesome too!  "], "author": "Alvin M.", "review": "One of my favorite breakfast/brunch place EVER!\n\nI've been coming here for 2 years now-to both locations!\nI love their hashbrowns!!!! My favorite breakfast dish-joe's scramble.  Oh- and their french toast made with croissants are awesome too!  Sometimes I'll get a side salad and their poppyseed dressing is to die for....\n\nI don't mind the wait for a table at Toast.  I usually don't wait more then 20mins.", "rating": 5, "date": "2009-09-14"}, {"excerpts": ["Amazing french toast!! ", "great and friendly workers"], "author": "Joe S.", "review": "Amazing french toast!! great and friendly workers", "rating": 4, "date": "2013-11-21"}, {"excerpts": ["The croissant french toast is a favorite of the kiddies too. ", "The fact that the serve breakfast all day isn't too shabby either. ", "The burgers are supposed to be great here too, but we can't seem to get off the breakfast menu whenever we go ", ":)"], "author": "Artina M.", "review": "Great diner breakfast! We prefer this location to the one nearer to our house on Church St. Something about the atmosphere and cooks at this location seems better to us, but the one on Church has outdoor seating so you can bring your dog if you like to that one. The hashbrowns are great as are every egg dish I've ordered. The croissant french toast is a favorite of the kiddies too. The fact that the serve breakfast all day isn't too shabby either. The burgers are supposed to be great here too, but we can't seem to get off the breakfast menu whenever we go :)", "rating": 4, "date": "2010-07-22"}, {"excerpts": ["Anyone who orders French Toast, be prepared to have toast that is browned that has no taste, and the egg batter with which it is supposed to have some vanilla flavoring has no flavoring whatsoever. ", "They could at least dust the \"French Toast\" with some confectioner's sugar. ", "At least the taste buds could identify a flavor of sorts. ", "I don't want to waste too much of your time or mine, but suffice it to say that the lunch fare is on par with the breakfast food, just not worth a visit. ", "My view is not from just from one sitting. ", "Since I live in the neighborhood toast is very convenient for me, hence my periodic visit with the hope the place improves. ", "Since Toast is usually very busy on the weekends, I guess the proprietor(s) don't feel the need to improve its food and service. ", "May I suggest they at least taste their tasteless food and perhaps make a change. ", "One last thought, for the life of me, I can't understand the continued patronizing of this diner.  ", "I have always thought San Franciscans had a far more discriminating palette. ", "Even Herbs Fine Foods, which once occupied the place before Toast, wasn't all that great, was better than Toast."], "author": "Barry V.", "review": "I am a long time resident of Noe Valley, actually on 24th Street less than two blocks away from Toast. I would like to preface this review by saying that I have eaten here quite a few times. The only reason I periodically return is to see if they have improved their service and the quality of their food. It is my humble opinion that they have not made any improvements from the day they first opened, which is to say the food and service stinks. Why does this diner have make the patron ask for Splenda? Each table and counter place has other sugar substitutes and sugar packets, but you have to ask for Splenda. What a stupid policy. Now as for the food. If I could rate this place with a negative star, I would, but Yelp doesn't give me that option. I could probably write a short story regarding the lousy food, but I will try to contain myself. First let me say, what they call scrambled eggs would be better characterized as a fried egg patty, over cooked, and topped with food that sometimes is nearly unidentifiable. The hash brown patties must have been cooked on a device where temperatures must approach those of the sun's surface. Toast people, turn down your grill a bit. Anyone who orders French Toast, be prepared to have toast that is browned that has no taste, and the egg batter with which it is supposed to have some vanilla flavoring has no flavoring whatsoever. They could at least dust the \"French Toast\" with some confectioner's sugar. At least the taste buds could identify a flavor of sorts. I don't want to waste too much of your time or mine, but suffice it to say that the lunch fare is on par with the breakfast food, just not worth a visit. My view is not from just from one sitting. Since I live in the neighborhood toast is very convenient for me, hence my periodic visit with the hope the place improves. Since Toast is usually very busy on the weekends, I guess the proprietor(s) don't feel the need to improve its food and service. May I suggest they at least taste their tasteless food and perhaps make a change. One last thought, for the life of me, I can't understand the continued patronizing of this diner.  I have always thought San Franciscans had a far more discriminating palette. Even Herbs Fine Foods, which once occupied the place before Toast, wasn't all that great, was better than Toast.", "rating": 1, "date": "2013-04-17"}, {"excerpts": ["Their omelets/scramblers, french toast, and hash browns are all delicious.  ", "(I haven't sampled other items.)"], "author": "Ellen S.", "review": "Yummy food, large servings, good prices, sweet servers, easy parking.  What's not to love?  Their omelets/scramblers, french toast, and hash browns are all delicious.  (I haven't sampled other items.)", "rating": 5, "date": "2010-04-12"}, {"excerpts": ["I enjoy the French Burger and the Noe Scramble.  ", "Nothing too fancy, the place is very reasonable with pricing and very clean."], "author": "Blake J.", "review": "This place is a good stand by for me.  I enjoy the French Burger and the Noe Scramble.  Nothing too fancy, the place is very reasonable with pricing and very clean.", "rating": 4, "date": "2010-04-19"}, {"excerpts": ["They have sweet potato french fries. ", "I usually get the turkey sandwich. ", "They do serve beer. ", "The staff has been friendly, helpful. ", "There are plenty of tables. ", "Unfortunately, it's always packed on Sundays, but that happens to most good restaurants for brunch."], "author": "Heidi L.", "review": "I like it! Nice little diner. The sandwiches are yum. They have sweet potato french fries. I usually get the turkey sandwich. They do serve beer. The staff has been friendly, helpful. There are plenty of tables. Unfortunately, it's always packed on Sundays, but that happens to most good restaurants for brunch.", "rating": 3, "date": "2010-06-02"}, {"excerpts": ["I ordered the French Toast Slam (which apparently has been renamed the Toast Combo) and my friend ordered the Ham and Cheese Omelet (which is now called the godfather).  ", "Unfortunately the prices of the new menu are much higher and my French Toast Slam came with a choice of sausage or bacon - not both.  ", "The eggs were even more watery than usual and I wasn't sure if the french toast was made with bread or if they had used recycled cardboard in an attempt at being green.  ", "I marinated my pork sausages in syrup in an attempt to make them edible, but even then they remained too hard to cut through with the knife provided.  ", "My friend's Ham and Cheese Omelet came with Italian sausage instead of ham, which would have been a nice upgrade if it didn't taste like burned bacon.  "], "author": "Andrew N.", "review": "I was excited at the modern style and menu selections of this new location - a definite upgrade to the aging looks of this chain's history.  I ordered the French Toast Slam (which apparently has been renamed the Toast Combo) and my friend ordered the Ham and Cheese Omelet (which is now called the godfather).  Unfortunately the prices of the new menu are much higher and my French Toast Slam came with a choice of sausage or bacon - not both.  The eggs were even more watery than usual and I wasn't sure if the french toast was made with bread or if they had used recycled cardboard in an attempt at being green.  I marinated my pork sausages in syrup in an attempt to make them edible, but even then they remained too hard to cut through with the knife provided.  My friend's Ham and Cheese Omelet came with Italian sausage instead of ham, which would have been a nice upgrade if it didn't taste like burned bacon.  We each had a large orange juice but it seems that while they've increased the price to $3.50, they've downgraded from minute maid to the generic powdered substitute.\n\nAll in all I'm unimpressed with the changes to the familiar restaurant design and menu.  I think I'll stick to their 816 Mission St location if I'm in the mood for bad food as at least the food tastes marginally better there and there isn't a line.  Maybe I would have been happier had I determined what the new incarnation of Moons over my Hammy is, but I think the only way I would give them a second chance is if they bring back the $2.99 Grand Slam.", "rating": 1, "date": "2008-09-01"}, {"excerpts": ["I had the French Dip sandwich (great) and the Cheddar Broccoli Soup (so-so).  ", "The wait staff was friendly, and the pecan pie hit the spot -- although I wouldn't say outstanding.  ", "(The waitress said the cupcakes were her favorite.) ", "I recommend this place for a good, any-night-of-the-week dinner.  ", "Although I hear their brunch is excellent!"], "author": "Jennifer P.", "review": "I went to Toast for a quick dinner on a Wednesday night, and it was just right.  I had the French Dip sandwich (great) and the Cheddar Broccoli Soup (so-so).  The wait staff was friendly, and the pecan pie hit the spot -- although I wouldn't say outstanding.  (The waitress said the cupcakes were her favorite.) I recommend this place for a good, any-night-of-the-week dinner.  Although I hear their brunch is excellent!", "rating": 4, "date": "2009-10-09"}, {"excerpts": ["the croissant french toast is exactly as it sounds. ", "the croissant french toast at Chloe's is more crisp and just much better. ", "the cornedbeef hash is dry but ", "i kind of like it that way. ", "a decent brunch ", "but i wouldn't rush to go again."], "author": "Regina C.", "review": "decent food but nothing to rave about. the croissant french toast is exactly as it sounds. the croissant french toast at Chloe's is more crisp and just much better. the cornedbeef hash is dry but i kind of like it that way. a decent brunch but i wouldn't rush to go again.", "rating": 3, "date": "2009-08-27"}, {"excerpts": ["I had the the french toast with fruits...", "it was ok.  ", "Not bad but nothing great.  ", "My cousin had a tuna melt and garlic fries.  ", "The fries would've been okay if they hadn't used those \"pre-choped and bottled\" garlic.  ", "The garlic taste wasn't the same."], "author": "Gia C.", "review": "Decided to go here for brunch on a Sunday.  Bracing myself for a long wait, I was quite surprised that we only porbably waited for about 15 minutes considering there was about 8 groups ahead of us.  I had the the french toast with fruits...it was ok.  Not bad but nothing great.  My cousin had a tuna melt and garlic fries.  The fries would've been okay if they hadn't used those \"pre-choped and bottled\" garlic.  The garlic taste wasn't the same.", "rating": 3, "date": "2010-08-09"}, {"excerpts": ["Went here for breakfast this morning and had the croissant french toast ", "- I must say it was truly amazing. ", "Service was great - what a solid start. ", "Welcome to the neighborhood Toast - great to finally have you here!"], "author": "SF Gal ..", "review": "Wow - this place rocks just as much as the first one on Church street! Went here for breakfast this morning and had the croissant french toast - I must say it was truly amazing. Service was great - what a solid start. Welcome to the neighborhood Toast - great to finally have you here!", "rating": 5, "date": "2008-06-26"}], "grilled onions": [], "grilled mushrooms": [], "lox": [{"excerpts": ["My lox benedict was fantastic, the fruit bowl was obviously fresh and had blueberries, strawberries, banana, and melon. "], "author": "Cristina B.", "review": "I absolutely love this place. I was in Noe Valley running errands and was looking for someplace to have breakfast. I walked in and was warmly greeted and encouraged to pick a seat anywhere, so I grabbed a table by the window so I could people watch as I ate. The coffee IS SOOOOOO GOOD I'm still thinking about it. My server was friendly and warm and took great care of me. My lox benedict was fantastic, the fruit bowl was obviously fresh and had blueberries, strawberries, banana, and melon. I got there right before a big rush of people, but I didn't feel rushed at all and tipped extra for the consideration. \n\nI will 100% be back. Great job, TOAST.", "rating": 5, "date": "2017-06-09"}, {"excerpts": ["My first time there this morning for breakfast and was unimpressed \nI ordered the salmon Benedict - the lox and the tomato were so cold they ruined the Benedict - I don't usually find my self overly sensitive to food temperature  but this was no good :("], "author": "Leda M.", "review": "My first time there this morning for breakfast and was unimpressed \nI ordered the salmon Benedict - the lox and the tomato were so cold they ruined the Benedict - I don't usually find my self overly sensitive to food temperature  but this was no good :(", "rating": 2, "date": "2015-05-14"}, {"excerpts": ["Just finishing up my lox and English muffin, made by our boy Louis ! ", "Damn this man makes the presentation look so good , you ALMOST don't want to eat it!! ", "Kudos to you Louis , keep up the great work!! ", "Speaking of great work, Irina our waitress was just a rockin' too!!"], "author": "Curtis L.", "review": "Just finishing up my lox and English muffin, made by our boy Louis ! Damn this man makes the presentation look so good , you ALMOST don't want to eat it!! Kudos to you Louis , keep up the great work!! Speaking of great work, Irina our waitress was just a rockin' too!!", "rating": 5, "date": "2013-08-15"}, {"excerpts": ["Lox scrambler - lox, avocado, tomato, green onion, cream cheese, capers. ", "$11.95\n", "Maybe I was hungry or just really anticipating the smokey taste of cured salmon, whatever it is, i remember the first bite was really good!  ", "I could definitely taste the different flavors of the lox, avocado, and on a nice fluffy bed of egg.   ", "It was rich and filling, and had a side of hash browns and a choice of toasts.  ", "For about $12, it was the scramble was enough for me being that I don't eat that much", "; I didn't get through much of the hash or toast.  ", "You get a decent amount of lox and a pretty big dollop of cream cheese.  \n\n"], "author": "Lindsay L.", "review": "Went here around 10:30 on a Friday and didn't have to wait too long at all. \n\nLox scrambler - lox, avocado, tomato, green onion, cream cheese, capers. $11.95\nMaybe I was hungry or just really anticipating the smokey taste of cured salmon, whatever it is, i remember the first bite was really good!  I could definitely taste the different flavors of the lox, avocado, and on a nice fluffy bed of egg.   It was rich and filling, and had a side of hash browns and a choice of toasts.  For about $12, it was the scramble was enough for me being that I don't eat that much; I didn't get through much of the hash or toast.  You get a decent amount of lox and a pretty big dollop of cream cheese.  \n\nHash brown hill - hash, cheddar, sour cream, black olives, avocado, green onions.  $7.95\nFor the price you definitely get your money's worth, at least from what I could tell.  It's a pretty big mound of hash that's both soft --not mushy-- and that still has some crunch to it which I personally like.  My mom orders it every time we've gone.", "rating": 4, "date": "2012-08-26"}, {"excerpts": ["They even had my lox scramble, but for $11.95 I decided against it.\n\n"], "author": "Emilia S.", "review": "I love that this place is called an \"eatery\" versus \"restaurant.\" I love that it has toast-inspired art on the walls. I love that it has big windows and sits in the heart of Noe. I did not, however, love my brunch.\n\nBased on recommendation, we took our out-of-town visitors to Toast for brunch on Saturday. There was about a 20 minute wait which wasn't a big deal. The five of us were seated and handed menus. I noticed that the prices were about $2 more than my favorite brunch spot, Lower Haight's The Grind. They even had my lox scramble, but for $11.95 I decided against it.\n\nThree of us ordered eggs and two ordered salad. My turkey scramble tasted fine, but the presentation was a D+ at best. The eggs had a square of cheese poorly melted on top, and the hashbrowns were also a crispy square, cut from a mold. It was also a pretty small portion, although I support their efforts at portion control. My friend ordered the salmon salad, and having asked for no bleu cheese, got a bed of greens with a formerly-frozen looking chunk of salmon and a few cherry tomatoes. Another friend commented that her salad was bland. I can't say that I need to go back. Next time, I'll check out a Noe bakery for brunch.", "rating": 3, "date": "2010-06-14"}, {"excerpts": ["Call it lox and round bread, at least it won't be false advertising!\n\n"], "author": "neil c.", "review": "Contrary to what some people believe, just because you take bread dough and bake it into a torus shape doesn't mean it's a bagel.  Call it lox and round bread, at least it won't be false advertising!\n\nAnyway, I appreciate the fact that you can get breakfast for dinner here up until around 9pm. That's such a rare thing to find in the area, heck breakfast for a 5pm dinner is hard enough! The food is generally pretty decent, and the menu is fairly vast with many breakfast and lunch type choices (from oatmeal to hamburgers) and the service is around what you would expect for a diner in Noe (a cut above standard diner service). \n\nI'll go back, but the bagel thing just rubs me the wrong way!", "rating": 3, "date": "2009-11-18"}, {"excerpts": ["Perhaps it's because they always seem to find a new way to incorporate lox, capers, and cream cheese into breakfast entrees.  ", "You can get 'em in an omelet, scrambler, or on a bagel.  ", "Other variations include a salad and burger (albeit the salmon is processed differently in these).  "], "author": "Michael C.", "review": "Seems to be my go to spot for breakfast in my neighborhood.  Perhaps it's because they always seem to find a new way to incorporate lox, capers, and cream cheese into breakfast entrees.  You can get 'em in an omelet, scrambler, or on a bagel.  Other variations include a salad and burger (albeit the salmon is processed differently in these).  Large portions regardless of what you get.  \n\nThe atmosphere is a nice mix of retro and modern, and there's plenty of light.  It's pretty hopping on the weekends, so come at off times.  A bit on the pricey side, but you'll leave full and content.", "rating": 4, "date": "2010-01-26"}, {"excerpts": ["My kid loves the lox bagel.  ", "I haven't found anything I adore ", "but it's all decent.  ", "Minus one star for charging extra for maple syrup ", "(and I don't even think it's real) when you order the pancakes."], "author": "Susan M.", "review": "Toast is good.  It's not great.  It's clean and friendly.  The artwork is fun.  My kid always wants to eat there. It's got god-awful lineups on the weekend. \n\nMy kid loves the lox bagel.  I haven't found anything I adore but it's all decent.  Minus one star for charging extra for maple syrup (and I don't even think it's real) when you order the pancakes.", "rating": 3, "date": "2009-02-07"}, {"excerpts": ["people watching - both inside and out,  delish Mr. Espresso coffee, and dreamy lox beigels and omelets. ", "Not too greasy. "], "author": "Richard B.", "review": "I'm surprised that Toast ain't averaging higher ... I love it.\n\nFriendly, prompt service (essential for hangover recovery), great village-y people watching - both inside and out,  delish Mr. Espresso coffee, and dreamy lox beigels and omelets. Not too greasy. Definitely higher on the \"rabbit food\" fruit and salad side than the average brunch spot.\n\nI wish there were more independent bruncheries like this.", "rating": 5, "date": "2009-01-31"}, {"excerpts": ["I had a $9 lox bagel (adequate, nothing special), plus $3.50 sweet potato fries that weren't even salted. ", "Crispy but talk about *bland.", "* ", "If you want awesome sweet potato fries go to Catch in the Sunset. "], "author": "SfMom O.", "review": "The menu has all the classics, but the prices are bumped up -- stinks for the customer but hey, someone's gotta pay for that flat-screen behind the bar.\n\nI had a $9 lox bagel (adequate, nothing special), plus $3.50 sweet potato fries that weren't even salted. Crispy but talk about *bland.* If you want awesome sweet potato fries go to Catch in the Sunset. They do use salt.\n\nOn another occasion, I ordered a 2-egg breakfast which came with toast and hash browns. The toast was tasty (woulda been ironic had it not) and the hash browns were AWESOME. Still though, I left feeling hungry. There was nothing traditionally diner-like about my dish's small proportions.\n\nService was pleasant enough, but the second time I went, my server kept doing drive-by's and dashing off before I could have a chance to make a request or ask a question. So I guess, service was on the inattentive side that time.\n\nThis place is packed by 12 noon -- even on weekdays, so if you don't want to deal with a lunch time wait, get there by 11:45am. Also, be prepared to hear every sordid detail of your neighboring table's lover's quarrel.  For some reason, I felt vaguely guilty for \"eavesdropping,\" but it couldn't be helped. They pack us in there like sardines. \n\nBoth times we went, I think we were like the only straight group in there. The Castro boys love this place.\n\nI dunno, I could take it or leave it. For heartier portions, better food, more attentive service, and a much cheaper bill (albeit less slickster), I'd rather go to Manor Cafe in West Portal.", "rating": 3, "date": "2008-10-10"}, {"excerpts": ["I ordered a cup of joe and the lox scramble with hash browns and wheat toast. ", "I don't know what it is but the combination of lox and cream cheese is just heaven to me. ", "Scramble that together ", "and... ", "sorry, I'm going to need a moment. ", "Toast took my favorite combo to a whole new level. ", "Not only were there huge chunks of salmon but they also threw in generous amounts of avocado and tomato! ", "I'll be surprised if I ever try another dish on the menu. ", "And the hash browns? ", "What can I say - crispy, ", "crunchy, awesome."], "author": "Susan L.", "review": "4.5 stars, potential 5 if I have a great return trip.\n\nI was leery going into the experience. My friend raved about it but I tend to lean on the side of the Yelp community. Can't blame me, right Yelpers? For once, I'm going against the grain. I had one hell of a fantastic meal at Toast! Granted, the wait was a bit painful but with enough nagging (apologies to the host - my friend is an east coaster!), we eventually were seated by the window. I ordered a cup of joe and the lox scramble with hash browns and wheat toast. I don't know what it is but the combination of lox and cream cheese is just heaven to me. Scramble that together and... sorry, I'm going to need a moment. Toast took my favorite combo to a whole new level. Not only were there huge chunks of salmon but they also threw in generous amounts of avocado and tomato! I'll be surprised if I ever try another dish on the menu. And the hash browns? What can I say - crispy, crunchy, awesome.", "rating": 4, "date": "2009-06-17"}, {"excerpts": ["Sat at the counter, watched the ball game and had some great coffee and a truly scrumptious omelette, the one with lox & capers, a bit pricey maybe but friendly staff & a clean non-grungy place to eat has to cost something."], "author": "I A.", "review": "Stopped in mid-afternoon Saturday for some brunch and loved it. Sat at the counter, watched the ball game and had some great coffee and a truly scrumptious omelette, the one with lox & capers, a bit pricey maybe but friendly staff & a clean non-grungy place to eat has to cost something.", "rating": 4, "date": "2008-07-26"}], "peanut butter  banana": [], "nutella  banana": []}