{"noncarbonated bottled water": [], "ebifry": [], "aji tempura": [], "chicken lemon basil appetizer": [], "super dynamite roll appetizer": [], "hopping california roll appetizer": [], "jumping tail roll appetizer": [], "nigiri sampler": [], "california roll appetizer": [], "spider roll appetizer": [], "poke salad": [], "piece crab salad sushi": [], "piece hamachi sushi": [], "piece ikura sushi": [], "piece kani sushi": [], "piece negihama sushi": [], "piece sake sushi": [], "piece shiro maguro sushi": [], "piece tamago sushi": [], "piece unagi sushi": [], "piece ebi sushi": [], "piece hirame sushi": [], "piece inari sushi": [], "piece maguro sushi": [], "piece saba sushi": [], "piece seaweed salad sushi": [], "piece spicy tuna sushi": [], "piece tobiko sushi": [], "asten maki roll": [], "kampyo maki": [], "osinko maki": [], "shiitaki maki": [], "wakame maki": [], "alaskan special roll": [], "crunch california roll": [], "double punch roll": [], "hopping california roll": [], "heaven roll": [{"excerpts": ["Some of our favorite rolls Francisco Roll, Heaven Roll, and Spider Roll. ", "My vegetarian colleagues and those who don't eat raw can find a number of great things to eat here."], "author": "Jen L.", "review": "This is a great spot for fast food sushi. My office has been ordering from here for 5 years though none of us have actually eaten in the establishment. In these 5 years, they have never gotten our orders wrong and they pack our lunches in individual bags with our name and items labeled. Their rolls are of a good size without too much rice and the fish is fresh and they give you decent slices of sashimi. We love their Agedashi Tofu and their Udon, Donburi and Salmon Bento Box are just as tasty. They offer brown rice but not for the sushi rolls. Some of our favorite rolls Francisco Roll, Heaven Roll, and Spider Roll. My vegetarian colleagues and those who don't eat raw can find a number of great things to eat here.", "rating": 5, "date": "2015-12-18"}, {"excerpts": [", Alaska roll (salmon and avocado) and the Heaven roll (spicy tuna, basically).\n\n"], "author": "Tori S.", "review": "When I was a wee little kid, my parents introduced me to Japanese food.  Much to their dismay, I spent the next few years of my childhood wanting to be a \"sushi waitress.\"  Especially if the perks included free green tea ice cream.\n\nFortunately, those days have passed, and I still love Japanese food (and green tea ice cream).  Which is why it's really annoying when Japanese-hunger-pangs hit me in the middle of the workday, and the closest place to my office is the Floating Sushi Boat place run by Chinese people in the middle of Chinatown.\n\nOne day my stomach decided that it wanted some hot noodle soup.  My first instinct was to go to Ramen Underground, but I was too lazy to stop by the ATM first, even though it was on the way.  So I looked up Tokyo Express, saw that you can order online (!) and immediately clicked my way through the website for some tempura udon, Alaska roll (salmon and avocado) and the Heaven roll (spicy tuna, basically).\n\nI placed my order through Seamless (if you're a first-time user, put in X949yT in the coupon box for $5 off!) and they said my order would be ready in about 30-35 minutes.  I headed to pick it up, and they asked for my ID, gave me my food, and sent me on my way.\n\nUnfortunately, I didn't know how long my food had been ready prior to my arrival, and although they were in separate bags, the heat from my udon made my sushi lukewarm, so I had to stick it in the refrigerator for a bit before enjoying.  I sort of wish they'd put my sushi outside or something until I got there.  The udon was good too, and it came with a small salad.  Downside was the price - as with most Japanese places, it's pricey if you order more than your basic bento box.\n\nTotal fan of this place, especially when I'm really craving some good ol' sushi.  The only thing missing was the green tea ice cream at the end of my meal.", "rating": 4, "date": "2012-01-12"}, {"excerpts": ["Their Heaven Roll really does taste like heaven! ", "A great lunch place!!!"], "author": "Ting Z.", "review": "I eat here at least two times a week. Great sushi and noodles, good prices, fresh ingredients. Their Heaven Roll really does taste like heaven! A great lunch place!!!", "rating": 4, "date": "2012-02-13"}, {"excerpts": ["The Heaven roll in particular is great - rather spicy and always yummi.\n\n"], "author": "Martin K.", "review": "I go here for the lunch specials at least once a week. The rolls are consistently very good, although maybe a bit on the small size for the price. The Heaven roll in particular is great - rather spicy and always yummi.\n\nThe miso soup that comes with the special is decent (I am a great fan of miso soup) and the salad is just some iceberg lettuce with pink dressing - nothing special, but always fresh.\n\nThe service is very good, and even if you do not call in your order, you will rarely wait more than 5 minutes for your food.", "rating": 4, "date": "2010-10-27"}, {"excerpts": ["My usuals are the udon, the rolls (heaven roll) and the donburi."], "author": "Brian S.", "review": "Based on price, quality and speediness of service, this is the best Japanese lunch option in the financial, period.\n\nMy usuals are the udon, the rolls (heaven roll) and the donburi.", "rating": 4, "date": "2007-08-27"}, {"excerpts": ["My favorite rolls are the spicy hamachi, spicy tuna, heaven roll, double punch, dragon roll, spicy CA roll, rock & roll, and the knock-out roll. ", "I love to go on Mondays because they have the heaven roll special that day ", "and it's only $9.99 for that plus 4 pieces of CA roll, miso soup and salad. ", "I'm getting hungry just thinking about it!"], "author": "Amanda S.", "review": "This is my favorite place to eat in the FiDi because: A. I'm obsessed with sushi, B. it's cheap (for sushi) and uber fresh, and C. it's right around the corner from my office. I come here about 2 times a week and I always get my food to go, but you can eat-in. If you're planning on eating there, it gets pretty crazy between 11:30-12:30 so it can be hard to find seating. They have awesome specials everyday, a few sushi ones and a non-sushi one. I have only had their sushi so I can't review any of the other food but I see a lot of people with Udon soup, bento boxes, and the teriyaki and donburi entrees. My favorite rolls are the spicy hamachi, spicy tuna, heaven roll, double punch, dragon roll, spicy CA roll, rock & roll, and the knock-out roll. I love to go on Mondays because they have the heaven roll special that day and it's only $9.99 for that plus 4 pieces of CA roll, miso soup and salad. I'm getting hungry just thinking about it!", "rating": 5, "date": "2008-01-09"}], "killer roll": [], "negihama maki": [], "shogun roll": [{"excerpts": ["I don't come here that often, but I was very satisfied with their Thursday special of a Shogun roll (Crab, Avocado & Cucumber, Eel & Tobiko on Top) and 3 spicy tuna rolls with miso soup and salad for $10 plus tax.  ", "In these tough economic times, it's not as crowded as it used to be which makes it a little more pleasant than before; there is some benefit to the plummeting of the world financial markets.  ", "In the past, I've gotten the bento box combos which are also good, but the ones that include sushi are a bit too much food for lunch, I find.  ", "Nice lunch spot."], "author": "Marc S.", "review": "I don't come here that often, but I was very satisfied with their Thursday special of a Shogun roll (Crab, Avocado & Cucumber, Eel & Tobiko on Top) and 3 spicy tuna rolls with miso soup and salad for $10 plus tax.  In these tough economic times, it's not as crowded as it used to be which makes it a little more pleasant than before; there is some benefit to the plummeting of the world financial markets.  In the past, I've gotten the bento box combos which are also good, but the ones that include sushi are a bit too much food for lunch, I find.  Nice lunch spot.", "rating": 4, "date": "2008-10-17"}], "special roll": [], "swabble roll": [], "amigo roll": [], "unakyu maki": [], "unagi avocado roll": [], "avokyu maki": [], "crunch tofu maki": [], "kaiware maki": [], "popeye roll": [], "ume shiso kyu maki": [], "vegetarian maki": [], "yam tempura roll": [{"excerpts": ["I got the Tofu Crunch Roll and the Yam Tempura Roll, and they were both amazing. ", "And they come with soup and salad all for around $10-15. ", "You can't beat that!"], "author": "Julia H.", "review": "Best sushi in the Financial District/China Town area! I am vegetarian and have a hard time finding sushi rolls that aren't just plain avocado, or plain asparagus. I got the Tofu Crunch Roll and the Yam Tempura Roll, and they were both amazing. And they come with soup and salad all for around $10-15. You can't beat that!", "rating": 5, "date": "2018-08-31"}], "alaskan maki": [], "bonsai roll": [], "devils roll": [], "francisco bay roll": [], "hawaiian punch roll": [], "jumping tail roll": [{"excerpts": ["the sushi combo plates and DEFINITELY get Jumping Tail roll (for a fried roll - cheap!!) ", "and Dynamite roll (for a spicy one).  ", "The rolls rule."], "author": "Priya R.", "review": "My favorite lunch place in the city.  The sushi melts like butter.  So fresh, so good.  The sashimi is probably the best economical sashimi in the city.  The people that work there are SO nice, even when it is crazy busy.  And this place is crazy busy.  But no matter how long the line is, you ALWAYS get a place to sit because the people who work there know how to get people in and out.  I recommend getting the sushi combo plates and DEFINITELY get Jumping Tail roll (for a fried roll - cheap!!) and Dynamite roll (for a spicy one).  The rolls rule.", "rating": 5, "date": "2009-12-12"}], "house roll": [{"excerpts": ["Recently i tried the House Roll, very tasty "], "author": "Theresa B.", "review": "Best Sushi in the Financial District. Hands down. I have been to Tokyo Express on several occasions...This place is one of my usual lunch spots. It does it crowded, so be there early or be there after the noon crowd. \n\nThe veggie tempura roll is the most amazing veg roll I've ever ever had. \nI also like the sweet yam roll and tofu crunch maki roll. Recently i tried the House Roll, very tasty I must admit. \n\nThe sushi is fresh, interesting and reasonably priced. \n\nI also enjoy the Salmon teriyaki and the salmon don...", "rating": 4, "date": "2009-07-28"}, {"excerpts": ["i usually get the tempura udon or house roll (deep fried yellowtail wrapped in soybean and topped with ponzu sauce and roe). \n\n"], "author": "Helen Y.", "review": "it's the closest sushi place near my work so not much variety when it comes to japanese places for lunch. i usually get the tempura udon or house roll (deep fried yellowtail wrapped in soybean and topped with ponzu sauce and roe). \n\ncome before noon to beat the lunch crowd and make sure you know what you want before you get in line or else you might feel some pressure to order when you get to the register.", "rating": 3, "date": "2008-06-06"}], "knock out roll": [], "samurai maki": [], "tokyo tower roll": [], "unatemp roll": [], "hirame sashimi": [], "sashimori combo a": [], "sashimori combo b": [], "special combo": [], "sushi for  combo": [], "blossom chirashi combo": [], "sushi and sashimi combo": [], "vegetable sushi combo": [], "sashimi and tempura combo": [{"excerpts": ["I ordered the sashimi and tempura combo $17.99. ", "They left out my TEMPURA! ", "Well, thank you for telling me that the chef gave me 2 extra pieces of fish madam. ", "But why didn't you tell me that there was no tempura available?! ", "I would have ordered something else!"], "author": "linda t.", "review": "I ordered the sashimi and tempura combo $17.99. They left out my TEMPURA! Well, thank you for telling me that the chef gave me 2 extra pieces of fish madam. But why didn't you tell me that there was no tempura available?! I would have ordered something else!", "rating": 2, "date": "2018-03-16"}], "chicken lemon basil entree": [], "oriental chicken salad": [], "prawn and vegetable tempura": [], "prawn tempura": [], "nabeyaki noodle soup": [], "chicken teriyaki donburi": [], "beef teriyaki donburi": [], "salmon teriyaki donburi": [], "chicken katsu donburi": [], "vegetable donburi": [], "tonkatsu donburi": []}