{"basic burger": [{"excerpts": ["Love the basic burger with onion rings.  ", "I'm not a huge fan of their french fries but I always steal some anyway.  "], "author": "Carrie N.", "review": "Love the basic burger with onion rings.  I'm not a huge fan of their french fries but I always steal some anyway.  Patty melt is the best anywhere.  Rye bread - buttered and grilled.  We've been going here for years and still enjoy it!", "rating": 5, "date": "2015-02-24"}], "cheese burger": [{"excerpts": ["So pretty much a double cheese burger. ", "Got a fountain drink plus fries. ", "Charged me $19 bucks and some change. ", "Expensive ass charbroiled frozen patties no flavor ass burger. ", "They add water to their katchup bottles. ", "Katchup was a lil extra watery. ", "Left feeling unsatisfied and frustrated because i paid for shitty food. ", "Never again"], "author": "Tha U.", "review": "Not impressed I can make a better burger then this shit. I ordered a tower burger with a extra patty.  So pretty much a double cheese burger. Got a fountain drink plus fries. Charged me $19 bucks and some change. Expensive ass charbroiled frozen patties no flavor ass burger. They add water to their katchup bottles. Katchup was a lil extra watery. Left feeling unsatisfied and frustrated because i paid for shitty food. Never again", "rating": 2, "date": "2016-01-02"}, {"excerpts": ["My hubby always order bacon cheese burger. ", "I'll try bacon cheese burger in next time.\n ", "They are quick and provide a good food in this town.", "I'll try bacon cheese burger in next time.\n ", "They are quick and provide a good food in this town."], "author": "Sookjung H.", "review": "My favorite in tower burger is fish and chips. It's best found so far. I tried it different places.not much tasty like tower burger.  more crispy and tasty. good price too. My hubby always order bacon cheese burger. I'll try bacon cheese burger in next time.\n They are quick and provide a good food in this town.", "rating": 5, "date": "2014-03-24"}, {"excerpts": ["I ordered a cheese burger,my boyfriend ordered tower burger and that lady with glasses served us 2 fries and beans instead, I mean TWO,not one,and she seems very upset with something that day,anyway we even got our water by ourself cuz no one was there to serve,eventually we left without finished those fries cuz those r too big portioned,not impressed AT ALL! ", "I will tell everyone I know about bad service in tower burger"], "author": "Nicole X.", "review": "Very disappointed service frankly, we lived closed by and drove just for tower burgers and we decided never come back again !I ordered a cheese burger,my boyfriend ordered tower burger and that lady with glasses served us 2 fries and beans instead, I mean TWO,not one,and she seems very upset with something that day,anyway we even got our water by ourself cuz no one was there to serve,eventually we left without finished those fries cuz those r too big portioned,not impressed AT ALL! I will tell everyone I know about bad service in tower burger", "rating": 2, "date": "2015-04-21"}, {"excerpts": ["Ordered a Mushroom and Cheese Burger which was well cooked and tasty.\n\n"], "author": "Thomas L.", "review": "I remember coming here a few years ago and not being impressed.  Came here for lunch a week ago with co-workers and I was pleasantly surprised.  Ordered a Mushroom and Cheese Burger which was well cooked and tasty.\n\nI did not like their refilled glass ketchup bottles with fading paper logos.  Please replace the bottles frequently or use another container that is washable!", "rating": 4, "date": "2013-04-22"}, {"excerpts": ["I had the bacon cheese burger with extra cheese... ", "well done... it was GREAT!! ", "Crispy, thick bacon... good cheddar cheese... ", "fresh toppings... ", "good ", "bun... "], "author": "Jen D.", "review": "Damn good burgers here.... \n\nI had the bacon cheese burger with extra cheese... well done... it was GREAT!! Crispy, thick bacon... good cheddar cheese... fresh toppings... good bun... great fries.... decent prices.... \n\nMe likes...", "rating": 5, "date": "2008-03-10"}, {"excerpts": ["The food is ok for what it is, but it is no way near worth dropping $7.50 for a bacon cheese burger that doesn't even come with fries, and then paying $3.40 for a tiny side of fries.  ", "Once I've spent $11 for just the burger and fries at a place where you order at a counter and then take a number (aka no wait staff), I start thinking of all the better places I could eat for the same money.  ", "And don't bother spending $3.50 for onion rings... ", "I did that once and got maybe 5 rings... ", "that's $0.60 per slice of onion."], "author": "Adam R.", "review": "The food is ok for what it is, but it is no way near worth dropping $7.50 for a bacon cheese burger that doesn't even come with fries, and then paying $3.40 for a tiny side of fries.  Once I've spent $11 for just the burger and fries at a place where you order at a counter and then take a number (aka no wait staff), I start thinking of all the better places I could eat for the same money.  And don't bother spending $3.50 for onion rings... I did that once and got maybe 5 rings... that's $0.60 per slice of onion.", "rating": 2, "date": "2009-04-27"}, {"excerpts": ["favorites are the bacon cheese burger and the California burger.  ", "neighborhood favorite."], "author": "T J.", "review": "good food, meat from nimans ranch.  they cook their burgers on the rare side so keep that in mind, with that said well done is still very juicy and tasty.  call to order for pickup, ALWAYS 5 minutes.  really good place to go if you had a long day and not up to making dinner.  favorites are the bacon cheese burger and the California burger.  neighborhood favorite.", "rating": 3, "date": "2008-08-05"}], "bacon burger": [{"excerpts": ["I usually get the bacon burger and it is good. ", "The fish n chips are good and so is the Cobb salad. ", "The have good service and fresh food, just nothing spectacular. ", "Good prices and a clean restaurant are consistent here."], "author": "Jay H.", "review": "Solid Mom and Pop joint that does everything good but nothing great. I eat here periodically because its conveinient when I am teaching. I usually get the bacon burger and it is good. The fish n chips are good and so is the Cobb salad. The have good service and fresh food, just nothing spectacular. Good prices and a clean restaurant are consistent here.", "rating": 3, "date": "2018-05-09"}, {"excerpts": ["I had a bacon burger with BBQ on it.  ", "I did not love their BBQ sauce but the burger was juicy like I like it.  ", "It did come out super fast ", "so that was a plus.  "], "author": "Jeff P.", "review": "The red lights of the \"TOWER BURGER\" sign have been calling to me, as I traveled on Portola, for some time now.  For some reason, I was intrigued.  And, now I know all about it.\n\nTower Burger is, as Eric M. said, a neighborhood burger joint.  There is no need to schlep here.  If you're in the area or live nearby -- fine.  If not, no schlep for you.\n\nThe burgers were average.  Good?  Yes.  Great?  No.  I had a bacon burger with BBQ on it.  I did not love their BBQ sauce but the burger was juicy like I like it.  It did come out super fast so that was a plus.  We were in and out in less than 20 minutes tonight.\n\nIt is a little ghetto inside.  They've obviously spent some money on the accent wall paint and the lighting fixtures and on DUCT TAPE.  There is upholstered bench seating along the restaurant's longest wall.  It is ripped in many, many spots.  This has been covered up with duct tape.  Kinda cheesy & tacky if you ask me.  It was hard to find a spot to sit where I wouldn't have to sit on tape.\n\nSo, now I know.", "rating": 3, "date": "2007-12-21"}], "bacon cheese burger": [{"excerpts": ["My hubby always order bacon cheese burger. ", "I'll try bacon cheese burger in next time.\n ", "They are quick and provide a good food in this town.", "I'll try bacon cheese burger in next time.\n ", "They are quick and provide a good food in this town."], "author": "Sookjung H.", "review": "My favorite in tower burger is fish and chips. It's best found so far. I tried it different places.not much tasty like tower burger.  more crispy and tasty. good price too. My hubby always order bacon cheese burger. I'll try bacon cheese burger in next time.\n They are quick and provide a good food in this town.", "rating": 5, "date": "2014-03-24"}, {"excerpts": ["I had the bacon cheese burger with extra cheese... ", "well done... it was GREAT!! ", "Crispy, thick bacon... good cheddar cheese... ", "fresh toppings... ", "good ", "bun... "], "author": "Jen D.", "review": "Damn good burgers here.... \n\nI had the bacon cheese burger with extra cheese... well done... it was GREAT!! Crispy, thick bacon... good cheddar cheese... fresh toppings... good bun... great fries.... decent prices.... \n\nMe likes...", "rating": 5, "date": "2008-03-10"}, {"excerpts": ["The food is ok for what it is, but it is no way near worth dropping $7.50 for a bacon cheese burger that doesn't even come with fries, and then paying $3.40 for a tiny side of fries.  ", "Once I've spent $11 for just the burger and fries at a place where you order at a counter and then take a number (aka no wait staff), I start thinking of all the better places I could eat for the same money.  ", "And don't bother spending $3.50 for onion rings... ", "I did that once and got maybe 5 rings... ", "that's $0.60 per slice of onion."], "author": "Adam R.", "review": "The food is ok for what it is, but it is no way near worth dropping $7.50 for a bacon cheese burger that doesn't even come with fries, and then paying $3.40 for a tiny side of fries.  Once I've spent $11 for just the burger and fries at a place where you order at a counter and then take a number (aka no wait staff), I start thinking of all the better places I could eat for the same money.  And don't bother spending $3.50 for onion rings... I did that once and got maybe 5 rings... that's $0.60 per slice of onion.", "rating": 2, "date": "2009-04-27"}, {"excerpts": ["favorites are the bacon cheese burger and the California burger.  ", "neighborhood favorite."], "author": "T J.", "review": "good food, meat from nimans ranch.  they cook their burgers on the rare side so keep that in mind, with that said well done is still very juicy and tasty.  call to order for pickup, ALWAYS 5 minutes.  really good place to go if you had a long day and not up to making dinner.  favorites are the bacon cheese burger and the California burger.  neighborhood favorite.", "rating": 3, "date": "2008-08-05"}], "mushroom burger": [{"excerpts": ["Burger was plain, even with a description of \"Mushroom burger ", "* Smoothered in mushroom's\", yes a few landed on the patty but not enough to tickle the taste buds. ", "Environ. "], "author": "Matsuo U.", "review": "Not much by way of good eats in this neck of the woods, Round Table Pizza & Tower Burger dominate the eats scene. This phenon confirms that there is a place for the stark, sterile and ho-hum eatery. Burger was plain, even with a description of \"Mushroom burger * Smoothered in mushroom's\", yes a few landed on the patty but not enough to tickle the taste buds. Environ. is plain, with about as much charm.\n\nTower is producer of a 'good' burger, if compared to the giant chain joints, not so good compared to the joints like Barneys Burgers which is a 5 minute drive down the hill to Noe Valley. Goodness is relative, part of the general theory of relativity...of Burger Goodness.\n\nhttp://www.yelp.com/biz/barneys-gourmet-hamburger-san-francisco-2\n\nInterestingly both Barneys Burger and Tower Burger tout using the premium beef from Niman Ranch. Its a little like thinking a Chevy will compete with a Ferrari, cos'  they both are rolling on Pirrelli's. Like a burger, a car can be judged by the stuff that goes on top that makes it special, not what it is riding on.\n\nYep, this burger joint is for the folks who utter things like: \"My car gets me from point A to point B\", this joint will get a burger seeker from point A to point B. Its an amazing thing to see the 4 & 5 star reviews, for this joint... I guess it helps when a joint like this is on the \"friends & family plan\"....", "rating": 2, "date": "2013-12-02"}, {"excerpts": ["Ordered the mushroom burger with fries.  ", "Burger is very juicy and tasty, fries are crisp, really nothing to complain about when it comes to the food.  ", "I had to knock off a start just because of the restaurant itself.  ", "When I walked in, I just wasnt feeling it.  ", "It almost felt like a cafeteria, and when I eat a burger, I like to enjoy the experience, if you know what I mean.  ", "Take ", "In-N-Out, you get the whole diner vibe and the loud kitchen and it feels like burger time there.  ", "Here at Tower, meh, not so much.  "], "author": "Kris P.", "review": "Ordered the mushroom burger with fries.  Burger is very juicy and tasty, fries are crisp, really nothing to complain about when it comes to the food.  I had to knock off a start just because of the restaurant itself.  When I walked in, I just wasnt feeling it.  It almost felt like a cafeteria, and when I eat a burger, I like to enjoy the experience, if you know what I mean.  Take In-N-Out, you get the whole diner vibe and the loud kitchen and it feels like burger time there.  Here at Tower, meh, not so much.  You might as well take your burger home and enjoy it at home, if you live across the street.\n\nIf you just need the burger without the frills, then this is your place.", "rating": 4, "date": "2013-01-06"}, {"excerpts": ["(Try the mushroom burger its my fave!)"], "author": "jenni k.", "review": "Not sure what people are complaining about- I love this place. The burgers AND salads are consistently delicious. And for the price they charge, their quality is fresh, tasty, and its a much bigger portion than most burger joints. Most places would charge alot more for the quality and quantity.\n\nI highly recommend this place and can't wait to eat there again!! (Try the mushroom burger its my fave!)", "rating": 5, "date": "2014-03-26"}, {"excerpts": ["In addition to ordering a plate of onion rings, my roomie for the mushroom burger (yuck! "], "author": "Surge C.", "review": "Onion rings. 'Nuff said. I'm not even a huge onion ring fan, but man Tower's onion rings had me mentally editing my favorite foods list.\n\nIn addition to ordering a plate of onion rings, my roomie for the mushroom burger (yuck! I hate mushrooms with a passion) and I got the California burger without sprouts (yum! I love me some avocados!). I asked for my burger to be cooked medium-well, but was disappointed to see it cooked well-done. However, I wasn't willing to make it an issue. Compared to other burgers I have had (Beep's, Umami's), this burger ranked pretty average.\n\nThough the service was great and the onion rings were DELISH, I would not come back. I think I overpaid for a mediocre burger.", "rating": 3, "date": "2012-02-09"}, {"excerpts": ["I ordered a mushroom burger with a side of onion rings and also decided to take the Mitchell's chocolate shake for a spin. \n\n"], "author": "Saunders C.", "review": "I'll gladly pay you Tuesday for a hamburger today. \n\nI'm always in search of a good burger, but it seems like you could start a riot when you claim this place or that place has the 'best' burger. Tower Burger came up on one of those lists, and since I was close by, I thought I'd check it out. Walked in on a Sunday night, the cashier was very friendly. I ordered a mushroom burger with a side of onion rings and also decided to take the Mitchell's chocolate shake for a spin. \n\nVerdict: Not bad. Meat is advertised as Niman Ranch. People in SF seem to be obsessed with that Niman Ranch beef. Anywho, the burger was nice an juicy. It was topped off with grilled mushrooms, cheddar cheese, red onions, pickle slices, tomato, green lettuce, and mayo on a sesame seed bun. Overall a fairly average burger. Onion rings are the frozen kind, but I was hungry and they were good. Mitchell's shake was creamy, although tasted small ice crystals in it, possibly a sign that the ice cream had accumulated some frost. But I'll note that they opted to keep the shake in the freezer while the food was prepared so it wouldn't melt. That's some good thinkin' right there. Service was fast, too, although they forgot the grilled onions on one of our burgers. \n\nThe place is pretty spacious, and actually nicely decorated. Plenty of street/metered parking right in front. I think Yelp says that it's cash only, but I saw that they take Visa and MC. \n\nThey're open daily from 10am-9pm. Go and support your local family businesses!", "rating": 4, "date": "2011-03-13"}, {"excerpts": ["The mushroom burger I had was OK.  ", "Hubby says his hamburger was \"good\".  ", "The Neiman Ranch beef patty tasted like any other decent beef patty I've had.  ", "\"", "Everything on it\" came with a tomato slice, lettuce, and pickle slices. ", "Hubby's meal came with bean chili (I didn't like it) and onion rings.  ", "I usually love onion rings, but not these.  \n", "It's not any better than a burger you can grill yourself on the 4th of July.  ", "At least it's real food and not processed."], "author": "Ry T.", "review": "I'm not a fan of hamburgers in general but hubby needed \"comfort\" food he told me which translates to mean he wants a hamburger. This place is a nice, family owned small business with nice owners.  Very casual and I'll bet quite popular with the SOTA high school and nearby elementary school kids during the school year. \n\nThe mushroom burger I had was OK.  Hubby says his hamburger was \"good\".  The Neiman Ranch beef patty tasted like any other decent beef patty I've had.  \"Everything on it\" came with a tomato slice, lettuce, and pickle slices. Hubby's meal came with bean chili (I didn't like it) and onion rings.  I usually love onion rings, but not these.  \nIt's not any better than a burger you can grill yourself on the 4th of July.  At least it's real food and not processed.", "rating": 3, "date": "2012-07-31"}, {"excerpts": ["Mine: mushroom burger, medium rare with a side of onion rings, his: bacon cheeseburger, medium rare with a side of fries for a total of $21.\n\n"], "author": "Ange L.", "review": "It was 3 PM and we were starving after going up and down numerous set of stairs carrying boxes and suitcases since 9.  \n\nWith our things still in boxes at the new place (and whilst wondering what we're signing up for when we decided to move into a single family home after all these years of living in a condo), we didn't feel like anything fancy and Tower Burger was the first entry that shows up when I did a Yelp! search.  \n\nIt was only 0.2 miles up Portola Dr from our new pad, so we decided to walk to check out the new neighborhood at the same time.  \n\nTower Burger was exactly what I expected of a cheap burger joint - open kitchen (strangely, no greasy smell), lots of utilitarian tables and chairs everywhere, and a counter behind which stood a teenager.  \n\nWe quickly ordered.  Mine: mushroom burger, medium rare with a side of onion rings, his: bacon cheeseburger, medium rare with a side of fries for a total of $21.\n\nThe onion rings and the fries were nothing special, however the burger was another story.  My tastebuds are not sensitive enough to be able to tell fresh Niman Ranch beef from their frozen no-frills counterpart, but they were well-trained enough to know that the beef tasted amazing.  \n\nNext time we'll try the milkshake made of nearby Mitchell's ice-cream!", "rating": 4, "date": "2011-04-06"}, {"excerpts": ["It seems like there's a hoard of veggie options, but there's really just two:  a mushroom burger or a gardenburger with numerous topping selections.  "], "author": "Marsha Z.", "review": "Tower's bordering on pricey, though, $10 for a burger meal is about the standard now in this town.  I still know I can get the same combo for less elsewhere.  Offerings are similar to Bistro Burger.  It seems like there's a hoard of veggie options, but there's really just two:  a mushroom burger or a gardenburger with numerous topping selections.  While not as generous with the fries, they were cooked to perfection, and that beats fistfuls of soggy fries any day.\n\nComing in with the impression of a small, greasy diner, it was a lot cleaner and larger than I had expected.  Run by sweet folks, Tower Burger's a total godsend if you happen to be stuck in this area.", "rating": 4, "date": "2007-06-12"}, {"excerpts": ["I ended up ordering the mushroom burger with a side of onion rings.\n\n"], "author": "Michael W.", "review": "Now I was a little skeptical because of the generic name of this place, but damn, I was proven wrong. Tower Burgers is a diamond in the rough.\n\nWhen arriving there, I was pretty amazed at how clean the place was. Honestly looked more like a real deal restaurant than a burger joint. \n\nNow with the burgers......pretty damn good. This place boasts Niman Ranch beef; therefore, I was expecting a juicy ass burger. I ended up ordering the mushroom burger with a side of onion rings.\n\nThe guys at Tower Burger were nice enough to hook it up with a free drink. Great burger. Very tasty onion rings. This place is definitely the best spot in the area.", "rating": 5, "date": "2010-05-17"}, {"excerpts": ["i am in LOVE with their mushroom burger! ", "it's super juicy and good. ", "they cook it just right with the meat still a little pink in the center. ", "they also don't skimp on the mushrooms. ", "they have really good onion rings too ", "but you have to order that separately. "], "author": "Lynn P.", "review": "i am in LOVE with their mushroom burger! it's super juicy and good. they cook it just right with the meat still a little pink in the center. they also don't skimp on the mushrooms. they have really good onion rings too but you have to order that separately. the price is good and the service is great! fast and friendly.\n\n**they do close at nine so don't think of going there anytime after that**", "rating": 5, "date": "2009-08-24"}, {"excerpts": ["the cheeseburger w/cheddar is yumm-o and the mushroom burger ? ", "Heavenly good. ", "I've also had a delectable grilled cheese sand (your choice of cheese & bread) -- what is more pleasing than melting cheese on crunchy buttered toast, hmm ? ", "nothing", ", that's what. ", "screw the arteries, gimme all that cheese"], "author": "Prima D.", "review": "jeepers but I love this burger haven ! the cheeseburger w/cheddar is yumm-o and the mushroom burger ? Heavenly good. I've also had a delectable grilled cheese sand (your choice of cheese & bread) -- what is more pleasing than melting cheese on crunchy buttered toast, hmm ? nothing, that's what. screw the arteries, gimme all that cheese", "rating": 5, "date": "2006-07-24"}, {"excerpts": ["Good portabella mushroom burger! ", "A tiny bit pricy, but great service and good food."], "author": "chris c.", "review": "Good portabella mushroom burger! A tiny bit pricy, but great service and good food.", "rating": 3, "date": "2009-04-06"}, {"excerpts": ["three words: BRIE MUSHROOM BURGER. \n\n"], "author": "Lisa M.", "review": "three words: BRIE MUSHROOM BURGER. \n\nplus nice staff, CLEAN, quiet, lots of parking.", "rating": 4, "date": "2007-01-22"}], "chili burger": [{"excerpts": ["8 different styles of veggie burgers, including a veggie chili burger (something I can never seem to find) AND Mitchell's ice cream milkshakes.  ", "Place was quiet, clean and the service was fast and friendly.  ", "If you're in the West Portal area and you need a good veggie burger, this is the place!"], "author": "Heather H.", "review": "Went here for the first time last weekend and loved it!  8 different styles of veggie burgers, including a veggie chili burger (something I can never seem to find) AND Mitchell's ice cream milkshakes.  Place was quiet, clean and the service was fast and friendly.  If you're in the West Portal area and you need a good veggie burger, this is the place!", "rating": 4, "date": "2011-08-01"}, {"excerpts": ["Value/Quality:\nI usually order the veggie chili burger with fries. ", "At $ 6.25 The portion of fries (that you have to pay extra) seems generous and the chili is satifying for a good eater like me. "], "author": "Raul A.", "review": "Selection:\nConsidering this is a burger joint, Tower burgers has lots of veggie options like the Portabella mushroom, california veggie (with avocados and sprouts), veggie Paris burger with brie and mushrooms and several others. They also have turkey burgers, sandwiches, salads and fish and chips.\n\nValue/Quality:\nI usually order the veggie chili burger with fries. At $ 6.25 The portion of fries (that you have to pay extra) seems generous and the chili is satifying for a good eater like me. The lettuce and tomato are always crisp and the food is hot, even for pick-up orders.\n\nLocation/service\nThe School of the Arts is near by, it gets crowded on weekdays around lunch time. I get my orders to go, you can always call ahead.  Mama and junior always take your order FAST without ever being rude or dismissive! They are lovely people, very efficient.  Now, if I could get them not to be stingy with the ketchup packages with to-go orders.....", "rating": 5, "date": "2007-05-22"}, {"excerpts": ["There was no chili burger, but you can get a regular cheeseburger with a bowl of pretty watery chili on the side.  ", "But that's not the restaurant's fault!  ", "The place is family-owned, and the people are nice.  ", "Overall it was a good place, very popular, but I don't think I would go back for the price...", "for the 2 of us it was about $17...compared to \"in-n-out\", definitely prefer the latter."], "author": "judy j.", "review": "my husband suddenly had a craving for chilli-burgers and fries, so on our way home we looked up \"chili burgers\" and saw this place.  There was no chili burger, but you can get a regular cheeseburger with a bowl of pretty watery chili on the side.  But that's not the restaurant's fault!  The place is family-owned, and the people are nice.  Overall it was a good place, very popular, but I don't think I would go back for the price...for the 2 of us it was about $17...compared to \"in-n-out\", definitely prefer the latter.", "rating": 4, "date": "2008-03-30"}], "western burger": [{"excerpts": ["Western Burger - 3.5 out of 5 - Home made BBQ sauce and aged chedder.  ", "The BBQ is very good with a nice tang to it.  "], "author": "Rob P.", "review": "Closer to 3.5 out of 5.  Very solid burger joint that is close to great... just missing a little \"wow\" factor.  \n\nI have been a casual dinner at Tower Burger since they opened.  The burgers here are pretty darn good.  Their patties are all made from Niman ranch beef and their milkshakes are made from Mitchell's Ice Cream.... needless to say their ingredients are all top notch.\n\nFOOD\n\nTower Burger - 3.5 out of 5 - Comes with grilled onion, bacon, mushroom and cheese.  Very good burger.  The bacon, of course, is good and adds a nice bacon kick, grilled onion and mushrooms add a nice earthiness.\n\nWestern Burger - 3.5 out of 5 - Home made BBQ sauce and aged chedder.  The BBQ is very good with a nice tang to it.  The cheddar is good balances well.\n\nOnion rings - 4 out of 5 - Very well done.  They have a nice crunch to them but aren't crunchy... a sign they are made fresh.  Can't go wrong here\n\nAMBIENCE\n\nTower Burger is kind of an in between burger place.  It isn't a dive and it is far from fancy.  The layout is pretty generic and almost feels like a chain restaurant... not a lot of personality.  It is however very clean and a nice place to eat\n\nOVERALL\n\nI've been here many times over the years and have always enjoyed my meals, but that is mostly because it is so close to where I (now used to) live.  While the place is solid... it is missing that \"special something\" to really put it in my upper tier of burger places.  Great place to eat if your in the area, but if you are looking for something special there are better places to go.", "rating": 3, "date": "2011-11-11"}, {"excerpts": ["Super good burgers, really enjoy the western burger and the vegi burgers. ", "The chocolate shakes are really good and the food is fast! ", "The fries are expensive though and don't come with the burgers, realistically you are looking at spending about $15 for a burger + fries and tax. ", "Next time I will split fries with the girlfriend. ", "All in all, yummy spot."], "author": "Ryan G.", "review": "Super good burgers, really enjoy the western burger and the vegi burgers. The chocolate shakes are really good and the food is fast! The fries are expensive though and don't come with the burgers, realistically you are looking at spending about $15 for a burger + fries and tax. Next time I will split fries with the girlfriend. All in all, yummy spot.", "rating": 4, "date": "2015-09-05"}, {"excerpts": ["$16 for a western burger, coleslaw, and onion rings, which by the way i only got 6 freaking rings!!!! "], "author": "Jett J.", "review": "After working out at the gym (im a personal trainer) i decided to stop by to check out tower since it was on the drive home, and it would be a good stop to get my protein intake and enjoy a nice burger and onion rings since it was my day off from my strict diet.\n\nthe burger was good, but it definitely was not worth the price.\n\nits my first time eating there and i was disappointed. $16 for a western burger, coleslaw, and onion rings, which by the way i only got 6 freaking rings!!!! what the hell man!!!! \n\ni would not go back there again, for people that don't care about spending 16 dollars for something thats going to leave you hungry then its a perfect fit. other places like Sliders offers better burgers and more quantity for your buck.\n\nDont be tricked by the reviews of this place.", "rating": 2, "date": "2010-02-17"}, {"excerpts": ["The Western Burger had mayou, which I didn't like, I thought it didn't considering it was a Western Burger. ", "That killed it for me. ", "The onions on it should of been grilled instead of being raw. "], "author": "Stanley K.", "review": "Burger restaurants are very hard to judge, you order one burger and that's the only one to critique. If it was just a burger you imagined, then it's truly nothing special. I guess I'm a burger fanatic. Since the Burger Bar in Las Vegas, nothing else is comparable. \n\nThe Western Burger had mayou, which I didn't like, I thought it didn't considering it was a Western Burger. That killed it for me. The onions on it should of been grilled instead of being raw. I enjoy the Niman Ranch beef cooked medium and the french fries were freshly hot which I really like.\n\nI would create a special weekly menu with people that have special orders, maybe making a special after them. That would earn another star, another one would be the interior decor which is kinda dull.", "rating": 3, "date": "2009-03-02"}, {"excerpts": ["Their BBQ sauce is to die for (get the Western Burger)! ", "YUM! :-)"], "author": "Robyn M.", "review": "Delicious burgers in a cute little place. Fast and clean serive. Their BBQ sauce is to die for (get the Western Burger)! YUM! :-)", "rating": 4, "date": "2011-11-16"}, {"excerpts": ["We both ordered the Western burger, he rolled his eyes at me ", "'cause I always read his mind and order what he wants before he can say it. ", "I ordered fries, he onion rings.  ", "The ambiance was drab strip mall. ", "75% empty. ", "We sat by the window for the extra light.  ", "Most of the other patrons seemed worn out and sad", ", I was happy to be sitting in the glow of my beloved's smiling face. ", "The burgers arrived fairly quickly.  ", "The ultra thin slice of cheese barely melted, the buns quick charred, and the most miserly drab of barbeque sauce I've ever seen applied to a western burger. ", "I ended up apply a liberal dose of ketchup to make the hamburger ok. ", "It isn't a terrible burger, but its below average. ", "The fries are edible but just barely. ", "I probably won't ever eat here again and I wouldn't recommend it. ", "The best thing I ate was my partners last onion ring. ", "It was perfect."], "author": "Herschell L.", "review": "I walked up the hill with my partner, against the roaring wind and blowing fog to try out this burger place.  The woman taking our orders was business-like, not particularly friendly, but ok. We both ordered the Western burger, he rolled his eyes at me 'cause I always read his mind and order what he wants before he can say it. I ordered fries, he onion rings.  The ambiance was drab strip mall. 75% empty. We sat by the window for the extra light.  Most of the other patrons seemed worn out and sad, I was happy to be sitting in the glow of my beloved's smiling face. The burgers arrived fairly quickly.  The ultra thin slice of cheese barely melted, the buns quick charred, and the most miserly drab of barbeque sauce I've ever seen applied to a western burger. I ended up apply a liberal dose of ketchup to make the hamburger ok. It isn't a terrible burger, but its below average. The fries are edible but just barely. I probably won't ever eat here again and I wouldn't recommend it. The best thing I ate was my partners last onion ring. It was perfect.", "rating": 2, "date": "2011-04-17"}, {"excerpts": ["My bf ordered the Western burger. ", "We had the order our onion rings on the side, extra.  ", "We also ordered a milkshake- Mitchell's ice cream! ", "Alas, the milkshake was watery and came in a drinking glass. ", "It was a small glass. ", "The weird thing about it was that my bf ", "and I decided to share the milkshake and the server who made the milkshake ", "decided that he would do us a favor and split the milkshake in two drinking glasses. ", "So, both our glasses were half full when they arrived.  ", "When I say drinking glasses, I literally mean water glasses, so they were small glasses. ", "You know how milkshakes come in the tall glasses with whip cream and a cherry on top, with another container full of it, so you get like two full glasses, not so here. ", "For the price of the milkshake.... so not worth it. ", "It was so watery", ", it just tasted like melted ice cream. ", "They get an extra star for having Niman ranch meat, but that really didn't make the burger taste any better. ", "The meat was juicy, but I felt like it needed to be seasoned just a little. ", "My bf said his burger just tasted like BBQ sauce and bun. ", "I guess the BBQ sauce was potent. ", "The brie cheese on my burger was tasty, I have never had this type of cheese on my burger before ", "and I think I will try it at home when I make burgers. ", "The best part of about our meal was when a lady came in and asked for a garden burger (which I suppose is their veggie burger) and she asked if she can have bacon on it. ", "Huh? ", "We got a good laugh out of that one. ", "The restaurant is spacious and roomy. ", "The bench seats can use a good makeover- ", "they have electrical tape covering the holes in the seats. ", "I would come here again, but would not make a special trip out here."], "author": "carebear l.", "review": "My bf and I wanted to really like this place. My bf and I really like burgers and thought that we would try this mom and pop place. When we arrived we were greeted with a smile. I ordered the Paris burger- with brie cheese and sauteed mushrooms. My bf ordered the Western burger. We had the order our onion rings on the side, extra.  We also ordered a milkshake- Mitchell's ice cream! Alas, the milkshake was watery and came in a drinking glass. It was a small glass. The weird thing about it was that my bf and I decided to share the milkshake and the server who made the milkshake decided that he would do us a favor and split the milkshake in two drinking glasses. So, both our glasses were half full when they arrived.  When I say drinking glasses, I literally mean water glasses, so they were small glasses. You know how milkshakes come in the tall glasses with whip cream and a cherry on top, with another container full of it, so you get like two full glasses, not so here. For the price of the milkshake.... so not worth it. It was so watery, it just tasted like melted ice cream. They get an extra star for having Niman ranch meat, but that really didn't make the burger taste any better. The meat was juicy, but I felt like it needed to be seasoned just a little. My bf said his burger just tasted like BBQ sauce and bun. I guess the BBQ sauce was potent. The brie cheese on my burger was tasty, I have never had this type of cheese on my burger before and I think I will try it at home when I make burgers. The best part of about our meal was when a lady came in and asked for a garden burger (which I suppose is their veggie burger) and she asked if she can have bacon on it. Huh? We got a good laugh out of that one. The restaurant is spacious and roomy. The bench seats can use a good makeover- they have electrical tape covering the holes in the seats. I would come here again, but would not make a special trip out here.", "rating": 3, "date": "2007-10-25"}], "paris burger": [{"excerpts": ["I chose the Paris burger with French fries both of which were quite good. ", "The lettuce, tomato and red onion were fresh and the meat was perfectly cooked medium.\n", "My partner had a mix of fried seafood, French friends and coleslaw.  ", "He liked everything and ate it all.\n", "So, while there was nothing spectacular about our meals, they were good."], "author": "Philip C.", "review": "We came here one evening for a simple dinner.  We had been here before but not in a long time.  We were greeted immediately by a young woman at the counter who took our order.\nWe sat at our table and in only five minutes, our meals were served.\nI chose the Paris burger with French fries both of which were quite good. The lettuce, tomato and red onion were fresh and the meat was perfectly cooked medium.\nMy partner had a mix of fried seafood, French friends and coleslaw.  He liked everything and ate it all.\nSo, while there was nothing spectacular about our meals, they were good.", "rating": 3, "date": "2017-06-04"}, {"excerpts": ["I ordered my Paris Burger and it was good. ", "Nothing too special about it ", "but I enjoyed it. ", "It's a bit pricey for my taste though.  ", "If in the area ", "and I'm having the urge for burgers ", "I'll go again ", "but I'll look first for other spots I have yet to tryout."], "author": "Joshua P.", "review": "3  simple because this is a burger spot with its own unique take on a burger.  I ordered my Paris Burger and it was good. Nothing too special about it but I enjoyed it. It's a bit pricey for my taste though.  If in the area and I'm having the urge for burgers I'll go again but I'll look first for other spots I have yet to tryout.", "rating": 3, "date": "2014-01-28"}, {"excerpts": ["Food:\n\n- Paris Burger (1 beef patty, a thick slice of brie cheese, sauteed mushrooms and condiments) \n\n"], "author": "Jason C. J.", "review": "First time here and I thought it was pretty good. Beef comes from Niman Ranch. Due to the high ceilings in this place, the noise level can get pretty loud quick. I'm glad I came here right before closing with my friend. \n\nFood:\n\n- Paris Burger (1 beef patty, a thick slice of brie cheese, sauteed mushrooms and condiments) \n\n- Peach Tea\n\nSurprisingly, I cleaned the plate of my burger, fries AND ketchup. I must have been really hungry, cuz I'm satisfied now. I thought this place was better than Five Guy's fall apart burger.", "rating": 4, "date": "2013-08-07"}, {"excerpts": ["The Paris Burger's Niman Ranch origin provides comfort when ordering medium rare, but may not even win a head-to-head taste match up with a Carl's Jr. Portobello burger (and would definitely lose a size contest).  ", "Although the meat is juicy and bun fresh, the lack of sufficient seasoning is evident from start to finish.  ", "Also, the brie's subtlety is incapable of impacting the Paris Burger's performance.\n\n"], "author": "Andrew M.", "review": "Tower Burger is entrenched in the no-man's land of fast food burgers at gourmet prices.\n\nThe Paris Burger's Niman Ranch origin provides comfort when ordering medium rare, but may not even win a head-to-head taste match up with a Carl's Jr. Portobello burger (and would definitely lose a size contest).  Although the meat is juicy and bun fresh, the lack of sufficient seasoning is evident from start to finish.  Also, the brie's subtlety is incapable of impacting the Paris Burger's performance.\n\nThe onion rings are wonderfully crispy, heartily battered, and somehow capable of repelling excess grease that is characteristic of most rings.  However, once again, the portions are scant.  \n\nWill not propose to revisit but willing to try again.", "rating": 3, "date": "2012-03-16"}, {"excerpts": ["I had the Paris burger, grilled mushrooms with a thin slab of brie cheese..."], "author": "Jade B.", "review": "I love burgers and this place gets it right!\n\nI had the Paris burger, grilled mushrooms with a thin slab of brie cheese...oh yeah baby!!!\n\nIt was grubbin!\n\nThe bf got the bacon cheeseburger and he demolished it...\n\nI'll be back again fo sho!", "rating": 4, "date": "2008-05-05"}, {"excerpts": ["I had the Paris burger which came with brie and mushrooms.  ", "Not enough Brie was my issue as it only covered part of the burger ", "so I didn't get the Brie in every bite which when having a burger, I like to have happen.  ", "Also the mayo was only put in the middle of the bun, so again, I didn't get the full effect in every bite.  ", "Meat was good though and bun was yummy.  "], "author": "Denise B.", "review": "Good burgers but nothing out of this world.  I liked the variety they offered, and the fact that it was a clean place.  Went there today at 12:30pm and though it was pretty full there was still seating, and the burgers came out within 5 minutes of ordering.  \n\nI had the Paris burger which came with brie and mushrooms.  Not enough Brie was my issue as it only covered part of the burger so I didn't get the Brie in every bite which when having a burger, I like to have happen.  Also the mayo was only put in the middle of the bun, so again, I didn't get the full effect in every bite.  Meat was good though and bun was yummy.  Fries were okay, not too thick and not the super skinny ones either.  \n\nMy boyfriend ordered the bacon cheeseburger and pretty much echoed my sentiments, good food but nothing super spectacular despite being made with the Niman Ranch beef.  \n\nWould I come back?  Yeah I would.  But would I sit there on Sunday morning in bed with a hangover and contemplate coming here to cure me of my woes?  Probably not.", "rating": 3, "date": "2007-06-05"}, {"excerpts": ["Red meat is most popular here but your Paris Burger reigns supreme. ", "(brie and mushrooms top this burger/gourmet comfort fuel)  ", "But if you are trying to stay healthy, the tuna salad is an effective stand-by.\r\n", "During the school year's noon hour, you get over-run by nearby highschool students ", "and I hesitate at your doors until the bell rings ", "and they empty out.  ", "It's only because I like you with fewer folks, quieter, and more devoted to me.  \r\n", "Sincerely,\r\nme"], "author": "Jen L.", "review": "Dear Tower Burger,\r\nThank you for being there.  Working across the way at Juvenile Hall can be rough somtimes, but your consistency alleves my anxiety on my darker days.  Your prices are fair and the burgers succeed at re-fueling me, making it so I can take on more violence and tragedy, systemic psychosis, and a few more hours of plying the trade.  Red meat is most popular here but your Paris Burger reigns supreme. (brie and mushrooms top this burger/gourmet comfort fuel)  But if you are trying to stay healthy, the tuna salad is an effective stand-by.\r\nDuring the school year's noon hour, you get over-run by nearby highschool students and I hesitate at your doors until the bell rings and they empty out.  It's only because I like you with fewer folks, quieter, and more devoted to me.  \r\nSincerely,\r\nme", "rating": 3, "date": "2006-07-12"}, {"excerpts": ["My personal fave is the Paris Burger with brie and grilled mushrooms. ", "Their fries aren't my favorite..but thats probably for the best!"], "author": "Melissa B.", "review": "Tower may not have the quirky atmosphere of Mel or Cable car- but its a heck of a lot cleaner. There is plenty of seating and high-chairs. Food to go, is ready fast (faster even then most drive thrus) and packaged for easy travel. The parking is easy to, they recently installed metered parking which has increased available spaces!! I really never thought I would be happy to see a meter- o this crazy town..\nBack to burgers. Towers burgers are huge and juicy. The price point is excellent. (More than fast and less than Cable.) They have a better selection of extras, and you aren't charged extra for every little thing. My personal fave is the Paris Burger with brie and grilled mushrooms. Their fries aren't my favorite..but thats probably for the best!", "rating": 5, "date": "2007-02-21"}, {"excerpts": ["Selection:\nConsidering this is a burger joint, Tower burgers has lots of veggie options like the Portabella mushroom, california veggie (with avocados and sprouts), veggie Paris burger with brie and mushrooms and several others. "], "author": "Raul A.", "review": "Selection:\nConsidering this is a burger joint, Tower burgers has lots of veggie options like the Portabella mushroom, california veggie (with avocados and sprouts), veggie Paris burger with brie and mushrooms and several others. They also have turkey burgers, sandwiches, salads and fish and chips.\n\nValue/Quality:\nI usually order the veggie chili burger with fries. At $ 6.25 The portion of fries (that you have to pay extra) seems generous and the chili is satifying for a good eater like me. The lettuce and tomato are always crisp and the food is hot, even for pick-up orders.\n\nLocation/service\nThe School of the Arts is near by, it gets crowded on weekdays around lunch time. I get my orders to go, you can always call ahead.  Mama and junior always take your order FAST without ever being rude or dismissive! They are lovely people, very efficient.  Now, if I could get them not to be stingy with the ketchup packages with to-go orders.....", "rating": 5, "date": "2007-05-22"}], "california burger": [{"excerpts": ["Always a fan of the California burger. ", "Crisp lettuce, tomatoes, pickles, red onion, avocado, Jack cheese and sprouts. "], "author": "Fannie S.", "review": "Burgers = good. Juicy. Niman Ranch beef patty.  Always a fan of the California burger. Crisp lettuce, tomatoes, pickles, red onion, avocado, Jack cheese and sprouts. (They offer grilled chicken sandwiches, garden burgers, other sandwiches, salads and fish & chips.)\n\nFries = good. They also have sweet potato fries now. \n\nService = friendly. (Order at the counter, pay, and then wait or seat yourself.)  \n\nPrices = moderate. $23 for two burgers (one specialty and one cheeseburger), one order of fries and two sodas.\n\nClean burger joint!  Oh and they have milkshakes, too!", "rating": 4, "date": "2015-03-28"}, {"excerpts": ["I got the California burger"], "author": "Lito Z.", "review": "Very tasty and clean burger. Also put together very well and cooked to perfection. I got the California burger", "rating": 5, "date": "2017-09-14"}, {"excerpts": ["Out of the burgers I've tried, I prefer the California burger. ", "The onion rings are also the way to go here."], "author": "Nina M.", "review": "Simple burger joint. Clean, quick, and convenient (because, let's face it- there is only this, a taqueria, or the awful Mollie Stones within like a mile of here). \n\nAside from burgers, you can also order a sandwich, fish&chips, or salad. \n\nI have not tried the sandwiches, but would not recommend the fish&chips b/c the fish portions are too small and the dish is super greasy. \n\nOut of the burgers I've tried, I prefer the California burger. The onion rings are also the way to go here.", "rating": 4, "date": "2013-09-07"}, {"excerpts": ["I tend to stick with the California burger as I love avocado. \n\n"], "author": "Jessica N.", "review": "Good customer service: fast and friendly. We pop in and out for to go orders. \n\nI really like the veggie burger menu, there are many different choices of flavors. I tend to stick with the California burger as I love avocado. \n\nMy husband likes the hamburger, says the patties are fresh. \n\nOverall, this is a great low key spot with quick service.", "rating": 4, "date": "2016-01-23"}, {"excerpts": ["I'm a fan of Tower Burger - pretty quick service and delicious burgers as well\n\nOrdered a California Burger to-go which had excellent lettuce (nice and crispy) as well as fresh avocado,which I appreciated. "], "author": "Brandon Y.", "review": "I'm a fan of Tower Burger - pretty quick service and delicious burgers as well\n\nOrdered a California Burger to-go which had excellent lettuce (nice and crispy) as well as fresh avocado,which I appreciated. Was a bit sad that it didn't come with the fries, but the burger was worth the $7-8 itself.\n\nAlso can't go wrong with a milkshake! This was a bit small for the price, but it was so tasty on a warm weekend. Just the right texture and taste of strawberry - highly recommended", "rating": 4, "date": "2013-03-25"}, {"excerpts": ["My favorite is the California burger that has avocado and sprouts included. \n", "I would definitely recommend this place especially if you are near twin peaks."], "author": "Woo L.", "review": "One of the best burgers in SF!\nKevin is the owner and he is awesome.\nThere are lots of different choices of burgers that are fresh and juicy.\nMy favorite is the California burger that has avocado and sprouts included. \nI would definitely recommend this place especially if you are near twin peaks.", "rating": 5, "date": "2016-03-03"}, {"excerpts": ["I hate mushrooms with a passion) and I got the California burger without sprouts ", "(yum! ", "I love me some avocados!). ", "I asked for my burger to be cooked medium-well, but was disappointed to see it cooked well-done. ", "However, I wasn't willing to make it an issue. "], "author": "Surge C.", "review": "Onion rings. 'Nuff said. I'm not even a huge onion ring fan, but man Tower's onion rings had me mentally editing my favorite foods list.\n\nIn addition to ordering a plate of onion rings, my roomie for the mushroom burger (yuck! I hate mushrooms with a passion) and I got the California burger without sprouts (yum! I love me some avocados!). I asked for my burger to be cooked medium-well, but was disappointed to see it cooked well-done. However, I wasn't willing to make it an issue. Compared to other burgers I have had (Beep's, Umami's), this burger ranked pretty average.\n\nThough the service was great and the onion rings were DELISH, I would not come back. I think I overpaid for a mediocre burger.", "rating": 3, "date": "2012-02-09"}, {"excerpts": ["My favorite flavor is California burger, which has avocado with bean sprouts and I enjoy adding mushroom to it. ", "The meat can be cooked as your demand but let's try it medium rare so that you can still feel the sweet juice melt inside and the smoky flavor outside. ", "In addition, the service is amazing, friendly and fast. ", "All you have to do is queuing to take order and then have a sit. ", "Even though there're peak hours or weekends, you'll never have to wait too long. ", "The chef is professional and the cooking area is open-up so that you can see the food is made carefully and sanitarily in front of you. ", "Moreover, the price is quite suitable compared to other customized Burger places, which is about $25 in total for two burgers, fried and two drinks. "], "author": "Dieu Nga T.", "review": "I go to Tower burger every time I feel like eating burger or some kind of American traditional food. I have been eating there for almost a year and since I found that place, I don't want to go to any other Burger places anymore. I've tried almost all of the main dishes there so far, including Burgers, salads, sandwiches and other side orders. Since the first time I tried Tower Burger, I've never been disappointed about anything there. The foods are always great and there are many choices. The burgers are tasty and organic while the salads are healthy and delicious. You can also customize your burgers like adding some stuff that you love. My favorite flavor is California burger, which has avocado with bean sprouts and I enjoy adding mushroom to it. The meat can be cooked as your demand but let's try it medium rare so that you can still feel the sweet juice melt inside and the smoky flavor outside. In addition, the service is amazing, friendly and fast. All you have to do is queuing to take order and then have a sit. Even though there're peak hours or weekends, you'll never have to wait too long. The chef is professional and the cooking area is open-up so that you can see the food is made carefully and sanitarily in front of you. Moreover, the price is quite suitable compared to other customized Burger places, which is about $25 in total for two burgers, fried and two drinks. Consequently, Tower Burger is such a lovely tasty affordable place for everyone to gather with friends or family!", "rating": 4, "date": "2016-04-24"}, {"excerpts": ["I got the California burger with avocado, sprouts, and jack cheese, and some fries. ", "Service was good and the food came out quickly, which is always nice. "], "author": "Joseph N.", "review": "Tower Burger is not mind-blowing or fancy, just solid and chill. I got the California burger with avocado, sprouts, and jack cheese, and some fries. Service was good and the food came out quickly, which is always nice. Their shakes are made with MItchell's ice cream, which I didn't try but imagine is great. \n\nIt's no Pearl's, but if you live nearby and want a burger, I'd recommend it.", "rating": 4, "date": "2013-01-29"}, {"excerpts": ["California Burger is great. ", "They are fast, clean and have never disappointed."], "author": "Jonathan M.", "review": "Always solid. California Burger is great. They are fast, clean and have never disappointed.", "rating": 5, "date": "2014-03-01"}, {"excerpts": ["I ate a California burger (avocado, swiss, sprouts) plus bacon. ", "I didn't really want the sprouts but the roughage can't hurt. ", "Along with the side of fries and tax, my total was $10.83, making this a very good deal. ", "And by the way, the cook those fries in a very tasty oil. ", "I even ate up the small little crunchy fry bits."], "author": "Mike H.", "review": "Tower Burger makes good burgers and great fries, among other things, in a small strip mall. That's really all you need to know.\n\nTower has been around for about 10 years for a reason: they take the food business seriously. You should go because they offer brown mustard, vinegar and hot sauce in addiiton to the standard four condiments. You should go because the restaurant is very clean. You should go because the food is prepared quickly and consistently. \n\nYou shouldn't if you're heavily interested in the decor; it's inoffensive but unremarkable. Mixed in with pictures of landscapes and animals are large prints based on food still-lifes. Add in Montana and Young jerseys and you have the visual. (Now would someone tell all the bandwagon Niners fans who abandoned the team 10 years ago to buy Patrick Willis jerseys? He is your best player.)\n\nHere, a burger cooked \"medium\" really means medium....not medium well! Thank you!!! It was pink in the middle and held together nicely. I ate a California burger (avocado, swiss, sprouts) plus bacon. I didn't really want the sprouts but the roughage can't hurt. Along with the side of fries and tax, my total was $10.83, making this a very good deal. And by the way, the cook those fries in a very tasty oil. I even ate up the small little crunchy fry bits.", "rating": 4, "date": "2012-01-31"}, {"excerpts": ["California Burger.. avocado, sprouts, the patty, mMmmmm ", "i love it!"], "author": "Cindy C.", "review": "California Burger.. avocado, sprouts, the patty, mMmmmm i love it!", "rating": 4, "date": "2013-10-01"}, {"excerpts": ["The Fish N Chips smelled really good but I opted for a California Burger...", "the beef is really good, but they can use some better higher quality buns, or let them toast a bit. ", "Like someone else said about theirs, my bun fell apart too.", "Other than that really good burger. ", "I was a little annoyed about the side of fries being 4 bucks (not included with burger) but you get a generous portion ", "so that's good. ", "Service could be dramatically increased. ", "The lady who took our order was trying to rush us when clearly we were off to the side looking at the menu since it was our first time, and she didn't smile. ", "She looked rather annoyed. ", "Girl like, CALM DOWN. ", "There is NO ONE behind us in line ", "and it is not busy. ", "That's the problem with most local small businesses, they think they don't have to give good customer service just because they aren't big and corporate smh. ", "The guy who gave us our food was nice though. ", "I'll still be back."], "author": "Marquis A.", "review": "I love trying out local places, am actually glad I did this one. The Fish N Chips smelled really good but I opted for a California Burger...the beef is really good, but they can use some better higher quality buns, or let them toast a bit. Like someone else said about theirs, my bun fell apart too.Other than that really good burger. I was a little annoyed about the side of fries being 4 bucks (not included with burger) but you get a generous portion so that's good. Service could be dramatically increased. The lady who took our order was trying to rush us when clearly we were off to the side looking at the menu since it was our first time, and she didn't smile. She looked rather annoyed. Girl like, CALM DOWN. There is NO ONE behind us in line and it is not busy. That's the problem with most local small businesses, they think they don't have to give good customer service just because they aren't big and corporate smh. The guy who gave us our food was nice though. I'll still be back.", "rating": 4, "date": "2014-04-04"}, {"excerpts": ["Which is just as well, though my California burger did look lonely on the big plate all by itself.\n\n"], "author": "DD B.", "review": "A good, no-frills burger joint, worth a visit if you happen to be in that part of town.  Fries don't come with - though for $7 I just assumed they did - you have to order them separately.  Which is just as well, though my California burger did look lonely on the big plate all by itself.\n\nI didn't realize the burgers were made from  Neiman Ranch beef until I read some of these reviews.  That explains both the good quality of the burger, and also the price.  But I've had a bad burger before, and I shudder at the memory, so I'll gladly pay a few bucks extra for a good one.", "rating": 4, "date": "2007-10-21"}, {"excerpts": ["I always ordered the California burger here which includes avocados and sprouts. ", "I wish they serve buffalo burgers in their menu with option of adding eggs on top! ", "I hope the owner is reading this and listen to my suggestions!!! ", "I will be back!"], "author": "Aylee G.", "review": "My cousin brought me here for lunch and their burgers are so good! They use natural niman ranch beef patties for all their burgers is a bonus for me. Their burgers have a strong char flavor that makes them super yummy! The fries are not greasy at all. Love them crispy fries and onion rings! I always ordered the California burger here which includes avocados and sprouts. I wish they serve buffalo burgers in their menu with option of adding eggs on top! I hope the owner is reading this and listen to my suggestions!!! I will be back!", "rating": 4, "date": "2011-05-26"}, {"excerpts": ["My favorite item is the California burger, which has avocado and sprouts(I have them hold the sprouts though). ", "Really any burger I've tried has been good, as have the chicken sandwiches. ", "The people are friendly and the place is always spotless. ", "I used to live right up the street off of Panorama, but even now that I'm on the other side of the City again I will gladly drive here for a quick bite"], "author": "Nick R.", "review": "I've been coming to Tower Burger since it opened back in,I'm guessing,2000. I've never been unhappy with the food or the service. My favorite item is the California burger, which has avocado and sprouts(I have them hold the sprouts though). Really any burger I've tried has been good, as have the chicken sandwiches. The people are friendly and the place is always spotless. I used to live right up the street off of Panorama, but even now that I'm on the other side of the City again I will gladly drive here for a quick bite", "rating": 5, "date": "2010-03-11"}, {"excerpts": ["I ordered a California burger and although it says \"bean sprouts\" is what it comes with, I had a suspicion that they meant alfalfa.  ", "When it came, it was alfalfa sprouts.  ", "Thank God because I cannot handle having bean sprouts with my burger.  ", "But either way, it was on the side.  ", "The burger was $6.99.  "], "author": "Ava T.", "review": "My friend wanted to take me to this place.  Said it was pretty cheap for a good ass burger.  Expected it to be a dingy hole-in-the-wall because that's how most places that are good tend to look sometimes.  I walked in and it was well-lit, decent dining space, and contemporary designed.  The counter person was very nice.\n\nI ordered a California burger and although it says \"bean sprouts\" is what it comes with, I had a suspicion that they meant alfalfa.  When it came, it was alfalfa sprouts.  Thank God because I cannot handle having bean sprouts with my burger.  But either way, it was on the side.  The burger was $6.99.  I got a drink and left the counter almost $10 poorer.  \n\nThey advertise that they use Niman Ranch beef, which is great!  But honestly, I've been to other burger joints who don't say that and their burgers tasted just the same.  I guess it's not really about the taste then, maybe more about the treatment of the cows.  Either way, I would come back as long as I knew I had $10 to spare.", "rating": 5, "date": "2008-03-21"}, {"excerpts": ["Love the California Burger (although I'm normally not a burger person):  ", "Niman Ranch beef (no hormones, no antibiotics), monterey jack, tomato-lettuce-pickle, avacado, sprouts-- mmmm"], "author": "Bunny C.", "review": "Love the California Burger (although I'm normally not a burger person):  Niman Ranch beef (no hormones, no antibiotics), monterey jack, tomato-lettuce-pickle, avacado, sprouts-- mmmm", "rating": 5, "date": "2010-06-06"}, {"excerpts": ["favorites are the bacon cheese burger and the California burger.  ", "neighborhood favorite."], "author": "T J.", "review": "good food, meat from nimans ranch.  they cook their burgers on the rare side so keep that in mind, with that said well done is still very juicy and tasty.  call to order for pickup, ALWAYS 5 minutes.  really good place to go if you had a long day and not up to making dinner.  favorites are the bacon cheese burger and the California burger.  neighborhood favorite.", "rating": 3, "date": "2008-08-05"}], "tower burger": [{"excerpts": ["We ordered:\n3 pieces fish and chips \nTower burger\nAnchor steam.  \n\n", "Tower burger came with bacon, grilled onion, sautéed mushroom, pickles and your choice of cheese (we picked provolone)- "], "author": "Junaline G.", "review": "Came here last Tuesday around 8pm for a quick bite.  It was highly recommended by one of my husbands patient.   The place was very spacious.  Not busy when we came.  It seems like the place is family owned.\n\nOur order was taken immediately.\n\nWe ordered:\n3 pieces fish and chips \nTower burger\nAnchor steam.  \n\nFish was Cod,  really bland, no flavor. I was really disappointed.  It also came with cole slaw which I really didn't care for. \n\nTower burger came with bacon, grilled onion, sautéed mushroom, pickles and your choice of cheese (we picked provolone)- we ordered it to be cooked medium rare, it was juicy and my husband enjoyed it.\n\nI can prolly find a better restaurant for fish and chips in the city.", "rating": 3, "date": "2018-03-18"}, {"excerpts": ["The plus side of tower burger though is you should be able to get parking whereas parking near BM in cole valley can be impossible.\n\n"], "author": "David A.", "review": "The bacon cheeseburger I had was excellent after I removed some of the overflowing mayo from the top of the bun. \n\nThe beef itself was good quality and cooked perfectly for a medium-well. The lettuce, tomato, and onion were all fresh.\n\nThe side of onion rings were also perfect for those who like true deep fried thick o rings.\n\nThe chocolate shake was small and disappointing while overpriced. \n\nI prefer burgermeister by a hair as I think it's a hair cheaper. The plus side of tower burger though is you should be able to get parking whereas parking near BM in cole valley can be impossible.\n\nIf I could give 3.5 stars I would.", "rating": 3, "date": "2017-04-08"}, {"excerpts": ["Tower Burger has been in my families rotation since it was put in (Who remembers the video store?). ", "We grab a to-go order every once in a while when cooking isn't in the cards. "], "author": "Ryan J.", "review": "Tower Burger has been in my families rotation since it was put in (Who remembers the video store?). We grab a to-go order every once in a while when cooking isn't in the cards. It's a solid choice and a decent burger in the area, so I would only give it 3 stars.\n\nFood - 3/5\nI normally get a regular hamburger with fries. It is a typical burger with red onions and pickles. The patty is usually cooked well, but can sometimes be a bit dry and lacks flavor. My remedy is ketchup and mustard. \n\nService - 4/5\nI haven't actually sat down to eat for a while, but I haven't really seen it super busy recently. Getting a table shouldn't be an issue too often. The owners seem really nice and the times I did sit in, service was fairly quick.\n\nAmbience - 4/5\nThis is a great place for groups of all sizes, as it is large and usually quiet enough for conversation. It is clean and not a bad place to stop for a quick burger that isn't \"fast food\".", "rating": 3, "date": "2017-06-22"}, {"excerpts": ["Dear Tower Burger,\nWe love you. ", "Especially your California Chicken Sandwich, your Chicken Cobb Salad (with ranch dressing), your large order of french fries, and your extremely large order of onion rings. ", "We miss you now that we moved to the Marina district ", "but we see you when we can. ", "Please don't take our long gaps between visits as a sign that we love you less. ", "Just know that we think of you often and come back as often as our car is willing to take the long journey South.\n", "Best,\nM & L"], "author": "Michael B.", "review": "Dear Tower Burger,\nWe love you. Especially your California Chicken Sandwich, your Chicken Cobb Salad (with ranch dressing), your large order of french fries, and your extremely large order of onion rings. We miss you now that we moved to the Marina district but we see you when we can. Please don't take our long gaps between visits as a sign that we love you less. Just know that we think of you often and come back as often as our car is willing to take the long journey South.\nBest,\nM & L", "rating": 4, "date": "2017-09-04"}, {"excerpts": ["There's not a lot to this review, but I think it's a fitting reflection of Tower Burger (in a good way).  ", "While there are a lot of trendy and hyped up places in the city to try, it's nice coming to a place like this that is refreshingly quiet and relaxed.  ", "In nearly every way, Tower Burger is the epitome of a \"no fuss, no muss\" kind of joint.  ", "There's a wealth of seating, the staff is friendly, service is quick, and the menu is simple yet functional - a variety of burgers, salads, fish & chips, sides, and shakes (with Mitchell's ice cream!).  ", "-- TOWER BURGER with Bacon, Grilled Onions, Sauteed Mushrooms, and Cheese...", "$7.99\n", "(http://www.yelp.com/biz_photos/tower-burger-san-francisco#VFjwj84V5Y7NXcGATV5xZw)\n", "I wouldn't rave about it like how others have, but it was a solid burger nonetheless.  ", "The bun wasn't the best, but the patty had a nice char and was decently juicy.  ", "In any case, even though Tower Burger may not fare well when compared to gourmet spots in the city, they're as solid of a bet as you'll find among \"neighborhood burger joints\".  ", "If nothing else, they're certainly the most convenient!"], "author": "Mike L.", "review": "There's not a lot to this review, but I think it's a fitting reflection of Tower Burger (in a good way).  While there are a lot of trendy and hyped up places in the city to try, it's nice coming to a place like this that is refreshingly quiet and relaxed.  It's fun to hit the town, but it's also just as fun to be lazy and grab a simple burger without a hassle!\n\nIn nearly every way, Tower Burger is the epitome of a \"no fuss, no muss\" kind of joint.  There's a wealth of seating, the staff is friendly, service is quick, and the menu is simple yet functional - a variety of burgers, salads, fish & chips, sides, and shakes (with Mitchell's ice cream!).  It's a perfect fit, and quite popular, with the neighborhood as well - a lot of families and regulars stop in to both dine in and grab some take out.\n\n-- TOWER BURGER with Bacon, Grilled Onions, Sauteed Mushrooms, and Cheese...$7.99\n(http://www.yelp.com/biz_photos/tower-burger-san-francisco#VFjwj84V5Y7NXcGATV5xZw)\nI wouldn't rave about it like how others have, but it was a solid burger nonetheless.  The bun wasn't the best, but the patty had a nice char and was decently juicy.  It could have used a little more seasoning, but the mushrooms, bacon, and cheese helped.\n\n-- CHILI CHEESE FRIES...$6.99\n(http://www.yelp.com/biz_photos/tower-burger-san-francisco#PkGHWyGnR95N4BCOcJhN6g)\nA bit of a miss, to be honest.  The fries themselves were more or less fine, and there was a decent amount of beans and meat, but the chili was really, really watery.  The taste was okay, but it was so thin that barely any of it stuck to the fries. \n\nTHREE AND A HALF STARS overall, but I (generously) rounded up in spite of the chili cheese fries.  The regular fries and onion rings my friends ordered were just fine, so those would probably be the better route to go.  In any case, even though Tower Burger may not fare well when compared to gourmet spots in the city, they're as solid of a bet as you'll find among \"neighborhood burger joints\".  If nothing else, they're certainly the most convenient!", "rating": 4, "date": "2014-11-18"}, {"excerpts": ["I 've been to Tower Burger for years and lately I just notice that the staff and the owner don't have any skill to greet their customers even though a nice \"Hello \" or \" Good-day\" in a nice way.\n", "We are the customers and we come here to buy your moderate price food. \n", "In &Out Burger has a better courtesy than them.\n", "So disappointed !!!!"], "author": "Benny B.", "review": "I 've been to Tower Burger for years and lately I just notice that the staff and the owner don't have any skill to greet their customers even though a nice \"Hello \" or \" Good-day\" in a nice way.\nWe are the customers and we come here to buy your moderate price food. \nIn &Out Burger has a better courtesy than them.\nSo disappointed !!!!", "rating": 3, "date": "2017-01-21"}, {"excerpts": ["Tower Burger is a great little neighborhood burger joint. "], "author": "Corrie H.", "review": "Tower Burger is a great little neighborhood burger joint. The service is always quick, they are friendly, and always professional. \n\nIt's unique but it's great!", "rating": 5, "date": "2016-12-18"}, {"excerpts": ["This has been an issue for tower burger in the past, they don't seem to understand the concept of a special order, (like adding ham to a club sandwich.) ", "when she told me they were closing and only had orders to go - 45 minutes BEFORE their advertised closing - I walked out. ", "I have never, in the last 3 or 4 years, been able to get exactly what I order when I do give them a chance. ", "It's not that hard! ", "I give them a try about every six months, and it has just degenerated time after time, and tonight was the last time. ", "It's time I said something.\n ", "The ownership changed probably 3 or 4 years ago, and the restaurant has never been the same. ", "They don't get your order right, and they close earlier then advertised. ", "From this point on I am going to Bulls Head in West Portal. ", "Bulls Head has a better menu, better quality meat, and no problem with special orders (this is how you get and KEEP customers.) ", "I am just done with the clowns at Tower burger. ", "They clearly are trying to run a business they know NOTHING about. ", "It's sad, because 3 or 4 years ago, before they changed ownership, they were really pretty good. ", "I have given them enough chances, i'm just done. ", "Do yourself a favor and go to any other burger restaurant than tower burger. ", "There are plenty of other good places out there in the vicinity if you don't mind heading to West portal or to the Castro."], "author": "Michael M.", "review": "I stopped in at 8:10 (all of their advertising says they are open until 9 PM ) I asked for ham to be added to my turkey club and the girl just looked at me like she clearly didn't understand, and then looked up at the ceiling and said \"we are closing, we only have orders to go. This has been an issue for tower burger in the past, they don't seem to understand the concept of a special order, (like adding ham to a club sandwich.) when she told me they were closing and only had orders to go - 45 minutes BEFORE their advertised closing - I walked out. I have never, in the last 3 or 4 years, been able to get exactly what I order when I do give them a chance. It's not that hard! I give them a try about every six months, and it has just degenerated time after time, and tonight was the last time. It's time I said something.\n The ownership changed probably 3 or 4 years ago, and the restaurant has never been the same. They don't get your order right, and they close earlier then advertised. From this point on I am going to Bulls Head in West Portal. Bulls Head has a better menu, better quality meat, and no problem with special orders (this is how you get and KEEP customers.) I am just done with the clowns at Tower burger. They clearly are trying to run a business they know NOTHING about. It's sad, because 3 or 4 years ago, before they changed ownership, they were really pretty good. I have given them enough chances, i'm just done. Do yourself a favor and go to any other burger restaurant than tower burger. There are plenty of other good places out there in the vicinity if you don't mind heading to West portal or to the Castro.", "rating": 1, "date": "2017-03-27"}, {"excerpts": ["There's just no reason to choose Tower Burger unless you couldn't find parking in West Portal or Glen Park; the parking is literally the best thing about this place. \n\n"], "author": "Jessica Z.", "review": "The food here is below average for the area and average for a burger joint. There's just no reason to choose Tower Burger unless you couldn't find parking in West Portal or Glen Park; the parking is literally the best thing about this place. \n\nI've been coming here on and off since I was in high school, and not much has changed. It's the same plain interior, same standard menu. Kind of run down after so many years. The only changes have been the price hikes and more inconsistency. You can have a good meal here (and in general, it seems like the burger patties are of good quality), you just don't know when. The toppings are often cool or undercooked, and the shakes can be icy. The burger is always medium-well no matter how you order it. \n\nI just don't know why you'd pay almost $20 (with tip) for a so-so burger, fries and a soda when you can get better for the same price literally anywhere, or comparable offerings for less. Convenience? Without the parking lot this place would've been gone years ago, and that's sad.", "rating": 2, "date": "2016-06-08"}, {"excerpts": ["I love eating at tower burger."], "author": "Yunmi J.", "review": "Best hawaiian burger!!!!\nMy boyfriend and I always go and order a burger and a chicken salad and share. So full filling, yummy, and fresh.\nI love eating at tower burger.", "rating": 5, "date": "2016-09-08"}, {"excerpts": ["Tower burger, I hope you get your stuff together and start caring about your business."], "author": "Chris C.", "review": "The sofa against the wall is dirty, the walls are dirty, and it looks like people have been attacking my plate for years with a spear. Their food is really basic. I've had food for the same price for much better quality. It sad to see this place has so much room for potential but has really let their business go downhill. Tower burger, I hope you get your stuff together and start caring about your business.", "rating": 1, "date": "2016-12-18"}, {"excerpts": ["After class today a friend suggested Tower Burger.  "], "author": "Shirley N.", "review": "I've been eyeing this place for a long long time.  Today I was craving a good burger and some fries.  After class today a friend suggested Tower Burger.  Said they serve basic burgers with Niman Ranch ground beef patties.   \n\nYou walk in and order off a laminated menu at the counter.  Better read quickly as the order taker/cashier is waiting to take your order.  Pay, take your number, and sit down.\n\nI got a jack cheeseburger with all the dressing - lettuce, sliced tomatoes, and Bermuda sliced onion, and a side of fries, and a fountain soda.  Hubby got the bacon cheddar cheeseburger.  Our charbroiled burgers were cooked to order.  The fries were piping hot.  Burgers were juicy.  All for about $20.\n\nI don't understand the negative reviews.  Service was quick.  Food was very good.  Easy parking.", "rating": 4, "date": "2014-06-14"}, {"excerpts": ["Not much by way of good eats in this neck of the woods, Round Table Pizza & Tower Burger dominate the eats scene. ", "This phenon confirms that there is a place for the stark, sterile and ho-hum eatery. ", "Interestingly both Barneys Burger and Tower Burger tout using the premium beef from Niman Ranch. ", "Its a little like thinking a Chevy will compete with a Ferrari, cos'  they both are rolling on Pirrelli's. "], "author": "Matsuo U.", "review": "Not much by way of good eats in this neck of the woods, Round Table Pizza & Tower Burger dominate the eats scene. This phenon confirms that there is a place for the stark, sterile and ho-hum eatery. Burger was plain, even with a description of \"Mushroom burger * Smoothered in mushroom's\", yes a few landed on the patty but not enough to tickle the taste buds. Environ. is plain, with about as much charm.\n\nTower is producer of a 'good' burger, if compared to the giant chain joints, not so good compared to the joints like Barneys Burgers which is a 5 minute drive down the hill to Noe Valley. Goodness is relative, part of the general theory of relativity...of Burger Goodness.\n\nhttp://www.yelp.com/biz/barneys-gourmet-hamburger-san-francisco-2\n\nInterestingly both Barneys Burger and Tower Burger tout using the premium beef from Niman Ranch. Its a little like thinking a Chevy will compete with a Ferrari, cos'  they both are rolling on Pirrelli's. Like a burger, a car can be judged by the stuff that goes on top that makes it special, not what it is riding on.\n\nYep, this burger joint is for the folks who utter things like: \"My car gets me from point A to point B\", this joint will get a burger seeker from point A to point B. Its an amazing thing to see the 4 & 5 star reviews, for this joint... I guess it helps when a joint like this is on the \"friends & family plan\"....", "rating": 2, "date": "2013-12-02"}, {"excerpts": ["I ordered a tower burger with a extra patty.  "], "author": "Tha U.", "review": "Not impressed I can make a better burger then this shit. I ordered a tower burger with a extra patty.  So pretty much a double cheese burger. Got a fountain drink plus fries. Charged me $19 bucks and some change. Expensive ass charbroiled frozen patties no flavor ass burger. They add water to their katchup bottles. Katchup was a lil extra watery. Left feeling unsatisfied and frustrated because i paid for shitty food. Never again", "rating": 2, "date": "2016-01-02"}, {"excerpts": ["It pains me to downgrade Tower Burger as the food is still a 3-4 level.  ", "Tower Burger has been a regular place to get good, simple grub.  ", "Last night, I and some friends arrived at 8:40 pm.  ", "The woman asked us if we wanted take out or were going to sit down.  ", "I said we'd like to sit down.  ", "She said \"We close at 9.\"  ", "My first review was in 2008 and I've been eating at Tower Burger ever since. ", "I'm sorry to have to look for another burger place that's nearby, but that attitude kills any appetite I have for their food."], "author": "Scott S.", "review": "It pains me to downgrade Tower Burger as the food is still a 3-4 level.  But after last night's experience, I doubt I'll ever eat there again.  \n\nTower Burger has been a regular place to get good, simple grub.  Last night, I and some friends arrived at 8:40 pm.  The woman asked us if we wanted take out or were going to sit down.  I said we'd like to sit down.  She said \"We close at 9.\"  Usually that means the kitchen closes and you can't order food.  \n\nI asked if we sat down, did she mean we had to leave at 9 pm?  \"Yes.\"  Not believing what I heard, I asked again.  If we order food and sit down, we have to leave at 9 pm?  \"Yes, do you still want to order?\"  \"No, not with that attitude.\" I replied.\n\nI strongly recommend they put up a sign at 8:30 pm which says \"Take out orders only\" or post a sign that says that.  I've NEVER been to a restaurant that tells you have to leave when they close.  Granted, most diners don't linger that long, or asking them to leave 30 minutes after closing is OK,  but telling someone they have to leave when you close?  \n\nMy first review was in 2008 and I've been eating at Tower Burger ever since. I'm sorry to have to look for another burger place that's nearby, but that attitude kills any appetite I have for their food.", "rating": 1, "date": "2014-04-04"}, {"excerpts": ["I'm a fan of Tower Burger - pretty quick service and delicious burgers as well\n\nOrdered a California Burger to-go which had excellent lettuce (nice and crispy) as well as fresh avocado,which I appreciated. "], "author": "Brandon Y.", "review": "I'm a fan of Tower Burger - pretty quick service and delicious burgers as well\n\nOrdered a California Burger to-go which had excellent lettuce (nice and crispy) as well as fresh avocado,which I appreciated. Was a bit sad that it didn't come with the fries, but the burger was worth the $7-8 itself.\n\nAlso can't go wrong with a milkshake! This was a bit small for the price, but it was so tasty on a warm weekend. Just the right texture and taste of strawberry - highly recommended", "rating": 4, "date": "2013-03-25"}, {"excerpts": ["Tower Burger is a reason why San Francisco is amazing - MOM and POP restaurants that are original and amazing! ", "Came off my flight and went straight here with a friend for a burger and was PLEASANTLY SURPRISED. ", "I was expecting an average burger, something to quell the beast in my belly, but the \"Tower Burger\" was perfectly cooked, moist, delicious and flavorful! ", "The patty was cooked perfectly medium rare to my liking as well. "], "author": "Christina N.", "review": "Tower Burger is a reason why San Francisco is amazing - MOM and POP restaurants that are original and amazing! Came off my flight and went straight here with a friend for a burger and was PLEASANTLY SURPRISED. I was expecting an average burger, something to quell the beast in my belly, but the \"Tower Burger\" was perfectly cooked, moist, delicious and flavorful! The patty was cooked perfectly medium rare to my liking as well. The cheese melted around the patty and in my mouth! \n\nMy friend ordered the 4 prawns + 2 fish and chips - OMG, even better than the burger were the prawns, sinfully crunchy and buttery! So good, the fish was amazing and the fries were addicting. I didn't get a chance to try the coleslaw that came with this meal, but then again, I didn't want to waste my stomach volume w/ vegetables (even vegetables swimming in mayo). \n\nThe restaurant is very low key, you order at the counter and they bring it out to your table - come eat, have a good burger and be on your merry way. The lady taking our order was a little rushed but I expect that type of service in these kinds of places - its about the food not the experience here!", "rating": 4, "date": "2014-10-02"}, {"excerpts": ["he said the Tower Burger.  ", "I tried it. ", "Pretty tasty. ", "Onion rings were a little bit greasy.  ", "My friends didn't enjoy theirs as much. "], "author": "Allyn V.", "review": "Three star. Not great. Solid.  I asked for the server's recommendation... he said the Tower Burger.  I tried it. Pretty tasty. Onion rings were a little bit greasy.  My friends didn't enjoy theirs as much. The turkey burger was a little dull and the chicken strips were kind of under-seasoned.", "rating": 3, "date": "2015-12-30"}, {"excerpts": ["I have been a casual dinner at Tower Burger since they opened.  ", "The burgers here are pretty darn good.  ", "Their patties are all made from Niman ranch beef and their milkshakes are made from Mitchell's Ice Cream.... ", "Tower Burger - 3.5 out of 5 ", "- Comes with grilled onion, bacon, mushroom and cheese.  ", "Very good burger.  ", "AMBIENCE\n\nTower Burger is kind of an in between burger place.  "], "author": "Rob P.", "review": "Closer to 3.5 out of 5.  Very solid burger joint that is close to great... just missing a little \"wow\" factor.  \n\nI have been a casual dinner at Tower Burger since they opened.  The burgers here are pretty darn good.  Their patties are all made from Niman ranch beef and their milkshakes are made from Mitchell's Ice Cream.... needless to say their ingredients are all top notch.\n\nFOOD\n\nTower Burger - 3.5 out of 5 - Comes with grilled onion, bacon, mushroom and cheese.  Very good burger.  The bacon, of course, is good and adds a nice bacon kick, grilled onion and mushrooms add a nice earthiness.\n\nWestern Burger - 3.5 out of 5 - Home made BBQ sauce and aged chedder.  The BBQ is very good with a nice tang to it.  The cheddar is good balances well.\n\nOnion rings - 4 out of 5 - Very well done.  They have a nice crunch to them but aren't crunchy... a sign they are made fresh.  Can't go wrong here\n\nAMBIENCE\n\nTower Burger is kind of an in between burger place.  It isn't a dive and it is far from fancy.  The layout is pretty generic and almost feels like a chain restaurant... not a lot of personality.  It is however very clean and a nice place to eat\n\nOVERALL\n\nI've been here many times over the years and have always enjoyed my meals, but that is mostly because it is so close to where I (now used to) live.  While the place is solid... it is missing that \"special something\" to really put it in my upper tier of burger places.  Great place to eat if your in the area, but if you are looking for something special there are better places to go.", "rating": 3, "date": "2011-11-11"}, {"excerpts": ["Got a Tower Burger and onion rings.\n", "They said get here in 5 minutes-we close at 9. ", "Got there in ten, and the chairs were all up, and they seemed really anxious to go home. "], "author": "El B.", "review": "Called in an order for pick up around 8:30. Got a Tower Burger and onion rings.\nThey said get here in 5 minutes-we close at 9. Got there in ten, and the chairs were all up, and they seemed really anxious to go home. My order was all ready to go. \n\nThe burger was cooked exactly the way I wanted it, and the onion rings were really good. I would go back, but maybe try to go a little earlier.", "rating": 4, "date": "2013-09-22"}, {"excerpts": ["I'm a real fan of hamburgers and Tower Burger didn't disappoint, the burger I had was cooked to perfection and reasonably priced. "], "author": "Matt B.", "review": "I'm a real fan of hamburgers and Tower Burger didn't disappoint, the burger I had was cooked to perfection and reasonably priced. I didn't order fries but in hindsight wished I had.\n\nThe service was quick and the restaurant clean, definitely a place I would like to go back to.", "rating": 5, "date": "2011-11-06"}, {"excerpts": ["It was seen  resting on the menu of Tower burger! "], "author": "Roger P.", "review": "Im always in search of a good burger. One of the burgers in particular that I go hunting for, is The Patty Melt. This burger is like BigFoot to me, you see it at a burger place once, when you go, then you look for it at another burger joint and it's missing! Or the bread is wrong! Or the bread is not grilled or toasted! Or the burger patty is too tough! Or they put sauce in it! Ughhh!! I'm going crazy!\nThen There was a sighting of the legendary BigFoot Patty Melt. It was seen  resting on the menu of Tower burger! They have the legendary Patty Melt! They use Rye bread! Check! They butter and grill the bread! Check! They use Neiman Ranch beef! Check! They have Caramelized onions! Check! I Have found my BigFoot! It's one of the better patty melts I have had.\nIt's really juicy. The quality is tasted in every bite. I'm so glad my search has come to an end.", "rating": 4, "date": "2013-04-17"}, {"excerpts": ["I had the Tower Burger with crispy bacon, mushrooms, grilled onions and cheese (http://www.yelp.com/biz_photos/zriqhz9jWIY0Y-PXBnLDCw?select=IwWOuCbco5F4LAPF0RUi-A).  ", "The burger was cooked a perfect medium well with just the right amount of pink and juices flowing.  ", "Very beefy flavor "], "author": "Wilhelm Y.", "review": "I just wish they were more generous with the onion rings that I had ordered.  They charged me an extra $3.50 for a side of onion rings to go with my burger, and I got a total of 6 onion rings!  \n\nDon't get me wrong these rings were good with a nice, creamy ring of hot onion surrounded by a golden, crispy battered shell but considering the quantity/price - totally not worth it!\n\nI had the Tower Burger with crispy bacon, mushrooms, grilled onions and cheese (http://www.yelp.com/biz_photos/zriqhz9jWIY0Y-PXBnLDCw?select=IwWOuCbco5F4LAPF0RUi-A).  The burger was cooked a perfect medium well with just the right amount of pink and juices flowing.  Very beefy flavor although there was just a slight charred taste to the meat.\n\nYou order at the counter and you're given a table number.  Your food is brought to you lightning fast.  I think my wait was less than five minutes and my food was ready to go.", "rating": 3, "date": "2008-04-27"}, {"excerpts": ["My favorite in tower burger is fish and chips. ", "It's best found so far. ", "I tried it different ", "places.not much tasty like tower burger.  ", "more crispy and tasty. ", "good price too. "], "author": "Sookjung H.", "review": "My favorite in tower burger is fish and chips. It's best found so far. I tried it different places.not much tasty like tower burger.  more crispy and tasty. good price too. My hubby always order bacon cheese burger. I'll try bacon cheese burger in next time.\n They are quick and provide a good food in this town.", "rating": 5, "date": "2014-03-24"}, {"excerpts": ["Tower Burger came up on one of those lists, and since I was close by, I thought I'd check it out. ", "Walked in on a Sunday night, the cashier was very friendly. "], "author": "Saunders C.", "review": "I'll gladly pay you Tuesday for a hamburger today. \n\nI'm always in search of a good burger, but it seems like you could start a riot when you claim this place or that place has the 'best' burger. Tower Burger came up on one of those lists, and since I was close by, I thought I'd check it out. Walked in on a Sunday night, the cashier was very friendly. I ordered a mushroom burger with a side of onion rings and also decided to take the Mitchell's chocolate shake for a spin. \n\nVerdict: Not bad. Meat is advertised as Niman Ranch. People in SF seem to be obsessed with that Niman Ranch beef. Anywho, the burger was nice an juicy. It was topped off with grilled mushrooms, cheddar cheese, red onions, pickle slices, tomato, green lettuce, and mayo on a sesame seed bun. Overall a fairly average burger. Onion rings are the frozen kind, but I was hungry and they were good. Mitchell's shake was creamy, although tasted small ice crystals in it, possibly a sign that the ice cream had accumulated some frost. But I'll note that they opted to keep the shake in the freezer while the food was prepared so it wouldn't melt. That's some good thinkin' right there. Service was fast, too, although they forgot the grilled onions on one of our burgers. \n\nThe place is pretty spacious, and actually nicely decorated. Plenty of street/metered parking right in front. I think Yelp says that it's cash only, but I saw that they take Visa and MC. \n\nThey're open daily from 10am-9pm. Go and support your local family businesses!", "rating": 4, "date": "2011-03-13"}, {"excerpts": ["After a day of helping my friend set up and break down her wedding stuff at Stern Grove, I decided to grab some food at Tower Burger.  ", "I went around 3pm and they were already out of the Portabello Mushroom which was my first choice.  ", "I ended up getting the brie cheese and sauteed mushrooms hambuger.  ", "I asked for medium on my burger but it was more on the medium well side.  ", "Well, no matter though, as it was juicy and flavorful.  ", "Price wise, it is almost priced right at $7 to $8 per burger.  "], "author": "Ben H L.", "review": "After a day of helping my friend set up and break down her wedding stuff at Stern Grove, I decided to grab some food at Tower Burger.  I went around 3pm and they were already out of the Portabello Mushroom which was my first choice.  I ended up getting the brie cheese and sauteed mushrooms hambuger.  I asked for medium on my burger but it was more on the medium well side.  Well, no matter though, as it was juicy and flavorful.  Price wise, it is almost priced right at $7 to $8 per burger.  Fries are separate and so are drinks.\n\nIf I do come back, I hope to get the portabella or a chicken sandwich just as a change of pace.", "rating": 3, "date": "2011-05-30"}, {"excerpts": ["I asked for a tower burger what should be their best burger... ", "The meat was ok but ", "no sauce in there just a wishy washy. ", "I really hate to put mustard or pepper on burger ", "but I had too this time. ", "The fries were not that good, I think I should asked for the famous onion rings but the fires was really common and oily... ", "The ambient is good but the food is not that much... ", "Only a really the layer of chews came with my burger instead of a melting cheese that you expect of a cheeseburger... ", "Even McDonald's has thicker layers of cheese.. ", "But since I was starving I ate it all.. ", "But I had the feeling that I paid too much for a common burger"], "author": "Breno R.", "review": "I was expecting much more after I saw all the reviews... Or I am really picky and I didn't notice that.. I asked for a tower burger what should be their best burger... The meat was ok but no sauce in there just a wishy washy. I really hate to put mustard or pepper on burger but I had too this time. The fries were not that good, I think I should asked for the famous onion rings but the fires was really common and oily... The ambient is good but the food is not that much... Only a really the layer of chews came with my burger instead of a melting cheese that you expect of a cheeseburger... Even McDonald's has thicker layers of cheese.. But since I was starving I ate it all.. But I had the feeling that I paid too much for a common burger", "rating": 1, "date": "2015-01-05"}, {"excerpts": ["I go to Tower burger every time I feel like eating burger or some kind of American traditional food. ", "I have been eating there for almost a year and since I found that place, I don't want to go to any other Burger places anymore. ", "I've tried almost all of the main dishes there so far, including Burgers, salads, sandwiches and other side orders. ", "Since the first time I tried Tower Burger, I've never been disappointed about anything there. ", "The foods are always great and there are many choices. ", "The burgers are tasty and organic while the salads are healthy and delicious. ", "You can also customize your burgers like adding some stuff that you love. ", "Consequently, Tower Burger is such a lovely tasty affordable place for everyone to gather with friends or family!"], "author": "Dieu Nga T.", "review": "I go to Tower burger every time I feel like eating burger or some kind of American traditional food. I have been eating there for almost a year and since I found that place, I don't want to go to any other Burger places anymore. I've tried almost all of the main dishes there so far, including Burgers, salads, sandwiches and other side orders. Since the first time I tried Tower Burger, I've never been disappointed about anything there. The foods are always great and there are many choices. The burgers are tasty and organic while the salads are healthy and delicious. You can also customize your burgers like adding some stuff that you love. My favorite flavor is California burger, which has avocado with bean sprouts and I enjoy adding mushroom to it. The meat can be cooked as your demand but let's try it medium rare so that you can still feel the sweet juice melt inside and the smoky flavor outside. In addition, the service is amazing, friendly and fast. All you have to do is queuing to take order and then have a sit. Even though there're peak hours or weekends, you'll never have to wait too long. The chef is professional and the cooking area is open-up so that you can see the food is made carefully and sanitarily in front of you. Moreover, the price is quite suitable compared to other customized Burger places, which is about $25 in total for two burgers, fried and two drinks. Consequently, Tower Burger is such a lovely tasty affordable place for everyone to gather with friends or family!", "rating": 4, "date": "2016-04-24"}, {"excerpts": ["I ordered a cheese burger,my boyfriend ordered tower burger and that lady with glasses served us 2 fries and beans instead, I mean TWO,not one,and she seems very upset with something that day,anyway we even got our water by ourself cuz no one was there to serve,eventually we left without finished those fries cuz those r too big portioned,not impressed AT ALL! ", "I will tell everyone I know about bad service in tower burger"], "author": "Nicole X.", "review": "Very disappointed service frankly, we lived closed by and drove just for tower burgers and we decided never come back again !I ordered a cheese burger,my boyfriend ordered tower burger and that lady with glasses served us 2 fries and beans instead, I mean TWO,not one,and she seems very upset with something that day,anyway we even got our water by ourself cuz no one was there to serve,eventually we left without finished those fries cuz those r too big portioned,not impressed AT ALL! I will tell everyone I know about bad service in tower burger", "rating": 2, "date": "2015-04-21"}, {"excerpts": ["Overall i had real good meal at tower burger. ", "You gonna love this!!"], "author": "Phillip N.", "review": "I just have to say. You will not get this quality burger with this price. BJ's burgers are good, but their Hawaiian burger is much better and cheaper. Salads are very fresh. It was something i didnt expect to be good but it was amazing.  Also i have to talk about the onion ring. You must get onion rings with burger. Overall i had real good meal at tower burger. You gonna love this!!", "rating": 5, "date": "2014-01-19"}, {"excerpts": ["I've been eating Tower Burger's fries and burgers for about 3 years ", "and I love it! ", "The burgers taste nice and juicy, the fries always come out piping hot, what's there to not like? ", "While reading some of the reviews on how the attitude of the employees suck or how the employees are rushing to go home, I have to say I don't blame them. ", "As a student in the highschool 2 blocks down from Tower Burger ", "I know that there are always students rushing in and making a mess of the place or rushing the cooks so they can get back to class on time (hence the fast cooking part of most reviews). ", "The employees would be tired after serving a bunch of highschool students everyday! ", "Who wouldn't be?! ", "Even though the attitude may throw you off, their burgers will make up for it."], "author": "Jasmine L.", "review": "I've been eating Tower Burger's fries and burgers for about 3 years and I love it! The burgers taste nice and juicy, the fries always come out piping hot, what's there to not like? While reading some of the reviews on how the attitude of the employees suck or how the employees are rushing to go home, I have to say I don't blame them. As a student in the highschool 2 blocks down from Tower Burger I know that there are always students rushing in and making a mess of the place or rushing the cooks so they can get back to class on time (hence the fast cooking part of most reviews). The employees would be tired after serving a bunch of highschool students everyday! Who wouldn't be?! Even though the attitude may throw you off, their burgers will make up for it.", "rating": 5, "date": "2014-10-15"}, {"excerpts": ["Tower Burger was first up.\n\n"], "author": "Brice H.", "review": "The new internship is up in Twin Peaks, and driving to lunch isn't much of an option, so I need to start checking out some of the joints within walking distance of my workplace.  Tower Burger was first up.\n\nSince it was my first day on the job I didn't really want a huge meal complete with a massive load of fries, so I just got myself a bbq cheddar veggie burger and a diet coke.  I will say however that the fries looked pretty amazing!  I will have to grab some after work sometime.\n\nOn to the burgers.  Since I only eat halal meat, I kept away from the beef, as incredibly tempting as it was.  This place has a relatively large selection of veggie burgers, and the bbq cheddar one seemed to call my name, and it definitely hit the spot.  The veggie burger patty was cooked just right, and the huge helping of bbq sauce with a melted slice of cheddar was the perfect accompaniment.  On top of that was a huge piece of fresh cut leaf lettuce, onions, tomato, and pickles.  Add in unlimited refills on the diet coke, and I was a happy happy camper!\n\nOnly down side was that a veggie burger and a diet coke ran me something like 9 dollars... yikes!!  The fish and chips also looked mighty tasty and are on the short list for next time I swing by.  This place gets pretty busy with the local school kid crowd around lunch time so be aware of that.  Super nice people behind the counter and a really clean seating area!", "rating": 4, "date": "2013-01-11"}, {"excerpts": ["Tower Burger is not mind-blowing or fancy, just solid and chill. "], "author": "Joseph N.", "review": "Tower Burger is not mind-blowing or fancy, just solid and chill. I got the California burger with avocado, sprouts, and jack cheese, and some fries. Service was good and the food came out quickly, which is always nice. Their shakes are made with MItchell's ice cream, which I didn't try but imagine is great. \n\nIt's no Pearl's, but if you live nearby and want a burger, I'd recommend it.", "rating": 4, "date": "2013-01-29"}, {"excerpts": ["Tower Burger is entrenched in the no-man's land of fast food burgers at gourmet prices.\n\n"], "author": "Andrew M.", "review": "Tower Burger is entrenched in the no-man's land of fast food burgers at gourmet prices.\n\nThe Paris Burger's Niman Ranch origin provides comfort when ordering medium rare, but may not even win a head-to-head taste match up with a Carl's Jr. Portobello burger (and would definitely lose a size contest).  Although the meat is juicy and bun fresh, the lack of sufficient seasoning is evident from start to finish.  Also, the brie's subtlety is incapable of impacting the Paris Burger's performance.\n\nThe onion rings are wonderfully crispy, heartily battered, and somehow capable of repelling excess grease that is characteristic of most rings.  However, once again, the portions are scant.  \n\nWill not propose to revisit but willing to try again.", "rating": 3, "date": "2012-03-16"}, {"excerpts": ["Tower Burger makes good burgers and great fries, among other things, in a small strip mall. "], "author": "Mike H.", "review": "Tower Burger makes good burgers and great fries, among other things, in a small strip mall. That's really all you need to know.\n\nTower has been around for about 10 years for a reason: they take the food business seriously. You should go because they offer brown mustard, vinegar and hot sauce in addiiton to the standard four condiments. You should go because the restaurant is very clean. You should go because the food is prepared quickly and consistently. \n\nYou shouldn't if you're heavily interested in the decor; it's inoffensive but unremarkable. Mixed in with pictures of landscapes and animals are large prints based on food still-lifes. Add in Montana and Young jerseys and you have the visual. (Now would someone tell all the bandwagon Niners fans who abandoned the team 10 years ago to buy Patrick Willis jerseys? He is your best player.)\n\nHere, a burger cooked \"medium\" really means medium....not medium well! Thank you!!! It was pink in the middle and held together nicely. I ate a California burger (avocado, swiss, sprouts) plus bacon. I didn't really want the sprouts but the roughage can't hurt. Along with the side of fries and tax, my total was $10.83, making this a very good deal. And by the way, the cook those fries in a very tasty oil. I even ate up the small little crunchy fry bits.", "rating": 4, "date": "2012-01-31"}, {"excerpts": ["so I could have enough time to get to Tower Burger from where I was coming. "], "author": "Thomas C.", "review": "My first time here was me calling in an order and then picking it up. Words of advice, please make sure that you have them read back your order to you to make sure it is correct. All of it.\n\nLong story short: When I was told it would take them only 5 minutes to make the burger, i asked whether they could hold off making the burger for 10 minutes so I could have enough time to get to Tower Burger from where I was coming. I received an answer in agreement.\n\nI thought this solved the time issue. It hadn't. I arrived and noticed that my food was ready and sitting in a plastic bag on the counter. I asked when it came up and the woman behind the counter said that she did not know. She then read the order which said to have the food ready at 7:10p. NO... I said start then, not be ready then. After fruitless discussion, I just took my cold, sad burger and left. \n\nIt was tasty for a cold, sad burger, perhaps that's where another star was added.\n\nNot the best first experience there and i'm not likely to come back. Unfortunate, but there are other burger joints in the area.", "rating": 2, "date": "2013-02-26"}, {"excerpts": ["Tower Burger rivals the Bistro Burger, Burger Joints and Burgermeisters of the world. ", "They serve only Niman Ranch meat. ", "Their chicken sandwich is juicy - not dry like other burger places. "], "author": "Mariela D.", "review": "I didn't expect to find a good burger in a strip mall. They're in a location you wouldn't expect - at the foot of Twin Peaks in a quaint little shopping area. \n\nTower Burger rivals the Bistro Burger, Burger Joints and Burgermeisters of the world. They serve only Niman Ranch meat. Their chicken sandwich is juicy - not dry like other burger places. Their parking lot makes it a convenient stop and they're decently priced (under $8).\n\nMake sure to specify how you want your burger cooked because they won't always ask. In which case, you'll end up with medium. \n\n*cringe*", "rating": 4, "date": "2011-04-05"}, {"excerpts": ["With our things still in boxes at the new place (and whilst wondering what we're signing up for when we decided to move into a single family home after all these years of living in a condo), we didn't feel like anything fancy and Tower Burger was the first entry that shows up when I did a Yelp! ", "Tower Burger was exactly what I expected of a cheap burger joint - open kitchen (strangely, no greasy smell), "], "author": "Ange L.", "review": "It was 3 PM and we were starving after going up and down numerous set of stairs carrying boxes and suitcases since 9.  \n\nWith our things still in boxes at the new place (and whilst wondering what we're signing up for when we decided to move into a single family home after all these years of living in a condo), we didn't feel like anything fancy and Tower Burger was the first entry that shows up when I did a Yelp! search.  \n\nIt was only 0.2 miles up Portola Dr from our new pad, so we decided to walk to check out the new neighborhood at the same time.  \n\nTower Burger was exactly what I expected of a cheap burger joint - open kitchen (strangely, no greasy smell), lots of utilitarian tables and chairs everywhere, and a counter behind which stood a teenager.  \n\nWe quickly ordered.  Mine: mushroom burger, medium rare with a side of onion rings, his: bacon cheeseburger, medium rare with a side of fries for a total of $21.\n\nThe onion rings and the fries were nothing special, however the burger was another story.  My tastebuds are not sensitive enough to be able to tell fresh Niman Ranch beef from their frozen no-frills counterpart, but they were well-trained enough to know that the beef tasted amazing.  \n\nNext time we'll try the milkshake made of nearby Mitchell's ice-cream!", "rating": 4, "date": "2011-04-06"}, {"excerpts": ["I really enjoy Tower Burger's burgers, grilled cheese and milkshakes! ", "The atmosphere is casual and the staff is amazing!"], "author": "C B.", "review": "I really enjoy Tower Burger's burgers, grilled cheese and milkshakes! The atmosphere is casual and the staff is amazing!", "rating": 5, "date": "2014-12-01"}, {"excerpts": ["Run by sweet folks, Tower Burger's a total godsend if you happen to be stuck in this area."], "author": "Marsha Z.", "review": "Tower's bordering on pricey, though, $10 for a burger meal is about the standard now in this town.  I still know I can get the same combo for less elsewhere.  Offerings are similar to Bistro Burger.  It seems like there's a hoard of veggie options, but there's really just two:  a mushroom burger or a gardenburger with numerous topping selections.  While not as generous with the fries, they were cooked to perfection, and that beats fistfuls of soggy fries any day.\n\nComing in with the impression of a small, greasy diner, it was a lot cleaner and larger than I had expected.  Run by sweet folks, Tower Burger's a total godsend if you happen to be stuck in this area.", "rating": 4, "date": "2007-06-12"}, {"excerpts": ["I normally go for their Tower Burger, medium. \n\n"], "author": "Gurpreet S.", "review": "Great burgers, incredible milk shakes. \nBut thats what the place is about, the cheesteaks arent as good, nor are the sandwiches. They make excellent onion rings and fries as well.\nI normally go for their Tower Burger, medium. \n\nThe thing about their milkshakes is that they use Mitchells ice cream.", "rating": 4, "date": "2012-01-04"}, {"excerpts": ["The bitch said I should have ordered a 'Tower Burger!' ", "Furthermore, my order was supposed to come with bacon. ", "The broad then told me she was going to charge me again for the bacon since she had to cook my burger again! ", "Are you that stupid? ", "You just got a negative review and now you've lost a customer who will dissuade anyone and everyone I come into contact for paying for your mistake! ", "What an idiot! ", "Yes I am mad!"], "author": "Denny L.", "review": "DO NOT EAT HERE! What an idiot she was! After three telephone orders for pick-up, they got our orders wrong each time!  I called to let them know I was returning to get my order corrected. The last and final time my order was wrong I got a lecture from the old broad because I asked for a 'burger, no cheese.' The bitch said I should have ordered a 'Tower Burger!' Furthermore, my order was supposed to come with bacon. The broad then told me she was going to charge me again for the bacon since she had to cook my burger again! Are you that stupid? You just got a negative review and now you've lost a customer who will dissuade anyone and everyone I come into contact for paying for your mistake! What an idiot! Yes I am mad!", "rating": 1, "date": "2013-05-01"}, {"excerpts": ["I didn't try it, but I love that Tower Burger makes floats.  ", "I'm a sucker for nostalgia, what can I say?"], "author": "Rebecca M.", "review": "Unassuming, clean, nice atmosphere, down-to-earth.\n\nThe young man who took our order was friendly & nice.  The order came out accurately & fairly quickly.  My burger was great.. toasted bun, tasty & juicy patty, cheese melted over the patty, cool tomato.  Fries were excellent!  & I love my fries, so trust me, these were fabulous!  Golden & slightly browned, hot, with crisp edges, mmmmm.  \n\nMy bf also loved his root beer float.  I didn't try it, but I love that Tower Burger makes floats.  I'm a sucker for nostalgia, what can I say?", "rating": 5, "date": "2010-06-17"}, {"excerpts": ["Unfortunately Tower Burger let me down. \n\n"], "author": "Chase S.", "review": "I was sooooo excited to go get a bacon cheeseburger. I had been under the weather for over a week eating nothing but soup and bland food and had an enormous craving for a burger. Unfortunately Tower Burger let me down. \n\nThe people ordering in front of us were told by the guy working \"we close in 10 minutes, you need to take it to-go\". So much for feeling welcome. Our food was up in less than 10 minutes and of course we took it to-go. The onion rings and french fries were very good, the burgers eh not so much. We both ordered our burgers medium rare but mine came out well done. Very well done. Yuck. Also both burgers were charred in a bad way. They tasted burnt and left an awful taste in my mouth. Neither one of us finished our burgers. \n\nI might give Tower another chance but with so many other places in SF to get a burger it won't be anytime soon. \n\npeace, love, and good booze ~ chase", "rating": 2, "date": "2010-03-21"}, {"excerpts": ["Tower Burger is the business!  ", "This place is family owned and the food is great.  ", "There is a number of places to get a salad or burger or chicken sandwich in the area, but for my money, Tower Burger is peer-less."], "author": "SummerSalt Villa T.", "review": "Tower Burger is the business!  This place is family owned and the food is great.  There is a number of places to get a salad or burger or chicken sandwich in the area, but for my money, Tower Burger is peer-less.", "rating": 5, "date": "2013-01-05"}, {"excerpts": ["Tower burger discriminates against teenagers. ", "For example, fries are 3.50 but they charge 4 for teenagers during lunch time at the nearby school. ", "Also, when an adult brings in outside food, the employees wouldn't say anything or they'd kindly ask to put their food away. ", "However, when a teenager brings in outside food, the employees scold them and rudely say \"this is not allowed. ", "no outside food.", "\" ", "Despite the rude workers, the food there is very good and freshly made."], "author": "Angela R.", "review": "Tower burger discriminates against teenagers. For example, fries are 3.50 but they charge 4 for teenagers during lunch time at the nearby school. Also, when an adult brings in outside food, the employees wouldn't say anything or they'd kindly ask to put their food away. However, when a teenager brings in outside food, the employees scold them and rudely say \"this is not allowed. no outside food.\" Despite the rude workers, the food there is very good and freshly made.", "rating": 3, "date": "2013-12-23"}, {"excerpts": ["The guys at Tower Burger were nice enough to hook it up with a free drink. ", "Great burger. ", "Very tasty onion rings. ", "This place is definitely the best spot in the area."], "author": "Michael W.", "review": "Now I was a little skeptical because of the generic name of this place, but damn, I was proven wrong. Tower Burgers is a diamond in the rough.\n\nWhen arriving there, I was pretty amazed at how clean the place was. Honestly looked more like a real deal restaurant than a burger joint. \n\nNow with the burgers......pretty damn good. This place boasts Niman Ranch beef; therefore, I was expecting a juicy ass burger. I ended up ordering the mushroom burger with a side of onion rings.\n\nThe guys at Tower Burger were nice enough to hook it up with a free drink. Great burger. Very tasty onion rings. This place is definitely the best spot in the area.", "rating": 5, "date": "2010-05-17"}, {"excerpts": ["like to try the tower burger. ", "Will definitely recommend."], "author": "Jun K.", "review": "I had a hawaiian burger. Perfectly cooked and meat was juicy. Next time Id like to try the tower burger. Will definitely recommend.", "rating": 5, "date": "2013-08-03"}, {"excerpts": ["I ate what I think they call their Tower burger.  ", "Sooooooo tasty.  ", "Loved it."], "author": "Sarah S.", "review": "This place has REALLY good burgers and fries.  My mouth is actually watering right now as I type this and think about the burger I ate there.\n\nThe place has a very spacious feel to it.  The inside is kind of whatever, but it doesn't matter to me if the food is really good (and it was).\n\nI ate what I think they call their Tower burger.  Sooooooo tasty.  Loved it.", "rating": 5, "date": "2011-03-06"}, {"excerpts": ["Tower Burger's burger is right up there.  ", "Don't forget to get fries too.  ", "You won't be disappointed."], "author": "Wai T.", "review": "This place is a hidden gem of a burger place.  Every time I drop by, the burger is always consistently good.  Don't get thrown by the reasonable price of the burger, like I did.  Every time I come, sit and bite into the burger, I always think to myself, \"This is a pretty tasty burger\".  This is a definite best burger place, and I've been to a number of 'best burger' joints.  Tower Burger's burger is right up there.  Don't forget to get fries too.  You won't be disappointed.", "rating": 5, "date": "2012-11-30"}, {"excerpts": ["So if you're in the Twin Peaks area and feel like eating at a top shelf burger joint (after all, it's the highest restaurant in The City elevation-wise), go to Tower Burger.  ", "If you're bringing the family, don't forget your Credit Cards because it adds up quickly!"], "author": "Alex S.", "review": "VERY nice burger joint.  High quality EVERYTHING.  That said, the prices aren't that great.  A burger with fries will set you back at least 10 bucks.  Well worth it though if you ask me.  Why?\n\n-a medium-rare burger is indeed medium-rare\n-a side of onion rings is always SIX.  no more, no less.  consistency is good!\n-chicken strips aren't the best, but hey, it's a burger place after all.\n-perfect amount of each condiment on burgers.  it's not too little where you would feel skimped, but it's also not piled on so when you take the first bite the whole burger falls apart.\n-niman ranch beef.  'nuff said.\n-friendly atmosphere! (even the cook is friendly!)\n\nSo if you're in the Twin Peaks area and feel like eating at a top shelf burger joint (after all, it's the highest restaurant in The City elevation-wise), go to Tower Burger.  If you're bringing the family, don't forget your Credit Cards because it adds up quickly!", "rating": 5, "date": "2009-03-09"}, {"excerpts": ["I ordered Tower Burger, Cobb Salad and Chocolate Milk Shake. ", "I never tasted a great burger until I ate the TOWER BURGER. ", "The meat was sooooo juicy and vegetables tasted very fresh!!! ", "The patty was made from Niman Ranch, which is very good organic beef. ", "The salad was also very fresh. ", "The chocolate flavor of the milk shake was very rich. ", "If you want to try the BEST BURGER, go to TOWER BURGER!\n", "I really recommend it!!!"], "author": "Cindy L.", "review": "This is the best burger shop in San Francisco!!!\n\nI ordered Tower Burger, Cobb Salad and Chocolate Milk Shake. I never tasted a great burger until I ate the TOWER BURGER. The meat was sooooo juicy and vegetables tasted very fresh!!! The patty was made from Niman Ranch, which is very good organic beef. The salad was also very fresh. The chocolate flavor of the milk shake was very rich. I thought it was not too sweet; it was JUST RIGHT~ \n\nThe service is very good; they are very friendly and nice. The restaurant is very clean, and the overall atmosphere is very comfortable.\n\nIf you want to try the BEST BURGER, go to TOWER BURGER!\nI really recommend it!!!", "rating": 5, "date": "2011-03-25"}, {"excerpts": ["I went into Tower Burger twice in a week and thought it was \"pretty good"], "author": "Matt C.", "review": "I went into Tower Burger twice in a week and thought it was \"pretty good\" then I went about my life and realized that I every burger I've had since then just does not compare. \n\nIts been rough for me. I've tried everything: my friends have tried setting me up with other burger joints; I've played the field, sometimes eating two different burgers in a weekend; I've even experimented with hotdogs.\n\nNothings worked. Damn you Tower!", "rating": 5, "date": "2009-03-17"}, {"excerpts": ["Howeve, that day came when I visited TOWER BURGER ", "Nothing did as TOWER BURGER'S did.\n\n"], "author": "Jt C.", "review": "I always imagine myself eating a super delicious burger in SF , but I haven't had that experience yet. Howeve, that day came when I visited TOWER BURGER and I was so so so pleased!!!!!\n\nThese burgers might be the best in the whole U.S, because I have visited so many places within and outside of CA. Nothing did as TOWER BURGER'S did.\n\nWhatever the burger you choose, the taste is fabulous. I guaranteed 100%.\n\nThanks for the deliciousness!!!!!!!\n\nP.s))) don' forget the ONION RINGS with burger!!!!!!!^^ it's fantastic!!!!!!", "rating": 5, "date": "2012-08-27"}, {"excerpts": ["If you don't like their Tower Burger, onion rings, and a chocolate milk shake with Mitchell's chocolate ice cream, your taste buds are weak!  ", "Five minute wait for cooked-to-order food.  ", "Quality meats from Niman Ranch, quality ice cream in shakes, and quality service.  ", "Delish."], "author": "Julie T.", "review": "If you don't like their Tower Burger, onion rings, and a chocolate milk shake with Mitchell's chocolate ice cream, your taste buds are weak!  Five minute wait for cooked-to-order food.  Quality meats from Niman Ranch, quality ice cream in shakes, and quality service.  Delish.", "rating": 4, "date": "2012-01-11"}, {"excerpts": ["Well I have and Tower Burger is the place.  \n\n"], "author": "Shane H.", "review": "Have you ever ordered take-out from a place and been told it'll be ready in five minutes? Better yet - have you ever had this happen every time you've ordered take-out? Well I have and Tower Burger is the place.  \n\nTower has continually astounded me with their speed and their good juicy burgers. They also make a mean bowl of steaming chili and their shakes are fantastic as well. This is a great place for hangover food because it's not only delicious but also made from high-quality ingredients.", "rating": 4, "date": "2007-05-21"}, {"excerpts": ["I ordered the Tower Burger - and it was simply wonderful. ", "Just the right amount of tenderness and juiciness in the beef - medium rare too...aah, simply delightful. ", "The burger will simply take you into burger nirvana ", "and then you will simply forget your current environment for a second or two. ", "Even though I did not order a milkshake, they definitely appear delicious ... ", "Excellent burgers at Tower Burger... ", "I'd come again."], "author": "Court L.", "review": "Props for the family-owned burger joint! \nEven though I don't regularly consume burgers (especially prepared with Niman Ranch meat), I just needed to this time around. I ordered the Tower Burger - and it was simply wonderful. Just the right amount of tenderness and juiciness in the beef - medium rare too...aah, simply delightful. The burger will simply take you into burger nirvana and then you will simply forget your current environment for a second or two. Even though I did not order a milkshake, they definitely appear delicious ... so order one. \n\nAnd if you're one of those 5-a-day fruit&veggie nut, then order a side salad. It's large enough to satisfy your daily requirement whilst offering some vegetation along with that carnivorous burger. \n\nExcellent burgers at Tower Burger... I'd come again.", "rating": 4, "date": "2009-03-29"}, {"excerpts": ["Bacon cheeseburger is the only way to do it and Tower Burger has it right!  ", "Excellent tasty meat, bacon done right, and cheese properly melted.  "], "author": "Jenn A.", "review": "Ooh snap!!!!!  Another great burger joint in the city!\n\nBacon cheeseburger is the only way to do it and Tower Burger has it right!  Excellent tasty meat, bacon done right, and cheese properly melted.  Fries were awesome as well as the onion rings (I snaked a few from a friend!)\n\nDecent burger prices, staff is great, and the place is super clean!  \n\nI tend to go bacon cheeseburger whenever I do burgers so I know my bacon cheeseburger, this place is definitely memorable and worth the return trip.", "rating": 4, "date": "2008-03-27"}, {"excerpts": ["Tower Burger is so unsuspecting....just sitting there in that strip mall on Portola.  ", "But, wow, it's pretty damn great!  ", "I don't eat beef, but the husband does and it makes me happy knowing that they serve Niman Ranch beef...."], "author": "Abby W.", "review": "Who knew?  Tower Burger is so unsuspecting....just sitting there in that strip mall on Portola.  But, wow, it's pretty damn great!  I don't eat beef, but the husband does and it makes me happy knowing that they serve Niman Ranch beef....so husband has lower chance of growing breasts due to absence of growth hormones!  \n\nAs for their various creative veggie burgers, I love 'em.  The fries too.  This place brought the joy back into my day after some crazy nursing school rotations at Laguna Honda....yikes.", "rating": 5, "date": "2006-09-06"}, {"excerpts": ["For years my buddy MF, the soon to be mega-watt premium cable show creator, has been raving and ranting at me about Tower Burger. ", "If I could bring ONE place down here it would be Tower Burger.\n\n", "Oh look, Tower Burger. ", "MF, you were wrong about \"Mongol\", but soooo right about Tower Burger."], "author": "Noah N.", "review": "[4- One of the Best of the Bay]\n\n[STORY BITS--- Scroll Past For Review]\nFor years my buddy MF, the soon to be mega-watt premium cable show creator, has been raving and ranting at me about Tower Burger. While I was down south recently, as we drove past Tommy's and Fatburger franchisees he openly scoffed.\n\nMF\nIf I could bring ONE place down here it would be Tower Burger.\n\nNN\nThat good?\n\nMF\nDon't even start me up, baby. I'll make you keep driving till with get back to civilization.\n\nOkay, so it didn't go down quite like that. Yet when Kym and I were figuring out lunch today while I played with my iPhone she declared that she wanted somewhere she could get fries since her Chinese medicine practitioner friend was putting her on an all brown rice diet for a week so she can diagnose an allergy she's been having.\n\nA week without fried foods sounds like hell to me too. What to do? \n\nWell the new App store made Yelp just a click away. Where can I get fries and a veggie burger close to the Panhandle that doesn't suck?\n\nOh look, Tower Burger. What a coinkydink!\n\n[REVIEW BIT]\n\nUnlike some Burger Joints... heh... Tower doesn't try and overwhelm you with the burger and fixin's. In fact presentation had me almost scratching my head. \"Where's the overload?\" I thought.\n\nYet that was the best part... the portions were perfect. This was just the right amount of Niman Ranch beef cooked precisely to order. Most short order cooks frak up medium well one way or another. The fries are crisp shoestrings that earn a \"Best In Class\"- with bonus points for Malt Vinegar on the table. \n\nKym ordered the veggie burger-- with bacon!!-- and chowed down with pre-cleanse glee.\n\nI walked out feeling not too full and not at all empty, that elusive \"just right\", and without any of the queasiness I got from the last time I ate at my formerly beloved Nation's.\n\nMF, you were wrong about \"Mongol\", but soooo right about Tower Burger.", "rating": 4, "date": "2008-07-14"}, {"excerpts": ["The ambaince at Tower Burger is very friendly, relaxed, and non pretentious.  ", "Think mom and pop."], "author": "Aaron P.", "review": "Fantastic burgers, not too expensive, friendly people!  However, BurgerMeister is better.  Honestly, I only dinged them a star because BurgerMeister is better.  The ambaince at Tower Burger is very friendly, relaxed, and non pretentious.  Think mom and pop.", "rating": 4, "date": "2011-09-20"}, {"excerpts": ["Dear Tower Burger,\r\nThank you for being there.  ", "Working across the way at Juvenile Hall can be rough somtimes, but your consistency alleves my anxiety on my darker days.  ", "Your prices are fair and the burgers succeed at re-fueling me, making it so I can take on more violence and tragedy, systemic psychosis, and a few more hours of plying the trade.  "], "author": "Jen L.", "review": "Dear Tower Burger,\r\nThank you for being there.  Working across the way at Juvenile Hall can be rough somtimes, but your consistency alleves my anxiety on my darker days.  Your prices are fair and the burgers succeed at re-fueling me, making it so I can take on more violence and tragedy, systemic psychosis, and a few more hours of plying the trade.  Red meat is most popular here but your Paris Burger reigns supreme. (brie and mushrooms top this burger/gourmet comfort fuel)  But if you are trying to stay healthy, the tuna salad is an effective stand-by.\r\nDuring the school year's noon hour, you get over-run by nearby highschool students and I hesitate at your doors until the bell rings and they empty out.  It's only because I like you with fewer folks, quieter, and more devoted to me.  \r\nSincerely,\r\nme", "rating": 3, "date": "2006-07-12"}, {"excerpts": ["The red lights of the \"TOWER BURGER\" sign have been calling to me, as I traveled on Portola, for some time now.  ", "For some reason, I was intrigued.  ", "Tower Burger is, as Eric M. said, a neighborhood burger joint.  ", "There is no need to schlep here.  ", "If you're in the area or live nearby -- fine.  "], "author": "Jeff P.", "review": "The red lights of the \"TOWER BURGER\" sign have been calling to me, as I traveled on Portola, for some time now.  For some reason, I was intrigued.  And, now I know all about it.\n\nTower Burger is, as Eric M. said, a neighborhood burger joint.  There is no need to schlep here.  If you're in the area or live nearby -- fine.  If not, no schlep for you.\n\nThe burgers were average.  Good?  Yes.  Great?  No.  I had a bacon burger with BBQ on it.  I did not love their BBQ sauce but the burger was juicy like I like it.  It did come out super fast so that was a plus.  We were in and out in less than 20 minutes tonight.\n\nIt is a little ghetto inside.  They've obviously spent some money on the accent wall paint and the lighting fixtures and on DUCT TAPE.  There is upholstered bench seating along the restaurant's longest wall.  It is ripped in many, many spots.  This has been covered up with duct tape.  Kinda cheesy & tacky if you ask me.  It was hard to find a spot to sit where I wouldn't have to sit on tape.\n\nSo, now I know.", "rating": 3, "date": "2007-12-21"}, {"excerpts": ["Now whenever I'm craving burger, I crave Tower Burger (since In ", "'N Out is too far).  ", "We went there for dinner yesterday--we shared a cheeseburger (Neiman Ranch beef!), fish n' chips (light and flaky like the tempura in Japan), and a Mitchell's chocolate milkshake.  "], "author": "Mijin L.", "review": "I would have never noticed this burger joint had Tim not taken me.  It's on Portola right by Twin Peaks, in a small strip mall that reminds me of the suburbs in Ohio.  There are booths and a soda fountain where you can make a suicide.  \n\nNow whenever I'm craving burger, I crave Tower Burger (since In 'N Out is too far).  We went there for dinner yesterday--we shared a cheeseburger (Neiman Ranch beef!), fish n' chips (light and flaky like the tempura in Japan), and a Mitchell's chocolate milkshake.  I was thoroughly satisfied and in a great mood.\n\nIt's family owned and worked- Korean folks!  I love nice Korean families.", "rating": 4, "date": "2007-05-24"}, {"excerpts": ["People aren't driving in from San Bruno or even Hayes Valley for some Tower Burger. \n\n", "All told, Tower Burger serves a satisfying, hot dinner for two that should set you back well less than $20 -- even less if you do take out and drink your own beer at home. ", "And on a foggy night on Portola, what else could you want?"], "author": "Eric M.", "review": "First of all, let's get one thing straight -- This is not a destination restaurant like Zuni. People aren't driving in from San Bruno or even Hayes Valley for some Tower Burger. \n\nTB is a neighborhood burger joint. If you live in Miraloma, Forest Hill, West Portal, Twin Peaks, or Glen Park, TB gets the job done -- a very good burger or chicken sandwich for a decent price by SF standards. \n\nThe atmosphere isn't anything special; in fact, it could probably use an upgrade. But the people are nice, and if you want takeout, your dinner will be ready within minutes of your call. The burgers themselves aren't heavily seasoned, but the extra fixings on top are generous. Yes, fries (not bad) or rings (better) are extra, but you get a mammoth portion that could easily feed two burgered adults. \n\nAll told, Tower Burger serves a satisfying, hot dinner for two that should set you back well less than $20 -- even less if you do take out and drink your own beer at home. And on a foggy night on Portola, what else could you want?", "rating": 4, "date": "2007-12-20"}, {"excerpts": ["IF you've never tried this Tower Burger... ", "I suggest you try it soon. ", "Its a locals favorite and the customer service is great, they are so friendly and attentive. ", "This is a perfect place to go if you want to unwind and relax in calm environment while enjoying a juicy burger!  ", "(droool...)"], "author": "Sylvia K.", "review": "This is my FAVORITE Burger Joint in all of the Bay Area!\n\nI love the fact that its a hearty burger joint, yet still intimate enough to talk without having to yell with your friends. I simply devour the Onion Rings! No other place makes Onion Rings the way they do...... yummmmm soOoo good! Burgers are also so juicy and flavorful. \n\nI'm drooling as Im typing this up. =)\n\nIF you've never tried this Tower Burger... I suggest you try it soon. Its a locals favorite and the customer service is great, they are so friendly and attentive. This is a perfect place to go if you want to unwind and relax in calm environment while enjoying a juicy burger!  (droool...)", "rating": 5, "date": "2008-09-30"}, {"excerpts": ["My first visit to Tower Burger was a good experience. ", "I felt like my burger was perfectly cooked, and the fixins were fresh. "], "author": "Courtney P.", "review": "My first visit to Tower Burger was a good experience. I felt like my burger was perfectly cooked, and the fixins were fresh. I was glad to see that they use Niman Ranch meats (it seems to becoming a standard 'round these parts).\n\nI gave them another shot tonight, and this time around was a bit of a mediocre experience. The burger, although cooked to my specs, was a bit lackluster in flavor (it didn't even seemed seasoned... even a little salt n' pepper coulda helped) and the bun was a bit soggy. I depended on the condiments to carry the burger.\n\nI will say that I do like their fries. They're fresh and crispy without being too crunchy, yet soft and piping hot on the inside. I can't help but reach in the bag on my way home and pull a few fries out to eat while still hot.\n\nI also appreciate that they vent the styro containers for to-go orders. They were very very quick this time around and I was in and outta there within a few minutes.\n\nHaven't had the shakes or eaten in yet, so I'll prolly give it another chance.", "rating": 3, "date": "2006-08-23"}, {"excerpts": ["I've been coming to Tower Burger since it opened back in,I'm guessing,2000. ", "I've never been unhappy with the food or the service. "], "author": "Nick R.", "review": "I've been coming to Tower Burger since it opened back in,I'm guessing,2000. I've never been unhappy with the food or the service. My favorite item is the California burger, which has avocado and sprouts(I have them hold the sprouts though). Really any burger I've tried has been good, as have the chicken sandwiches. The people are friendly and the place is always spotless. I used to live right up the street off of Panorama, but even now that I'm on the other side of the City again I will gladly drive here for a quick bite", "rating": 5, "date": "2010-03-11"}, {"excerpts": ["Maybe we were just starving, but tower burger really hits the spot... ", "I still think the best burgers in town are at zeitgeist, but they don't serve 'em all the time ", "Tower burger has nothing really special about it and it is not worth journeying across town for. "], "author": "Jess O.", "review": "Maybe we were just starving, but tower burger really hits the spot... I still think the best burgers in town are at zeitgeist, but they don't serve 'em all the time so what's a gal to do.\n\nTower burger has nothing really special about it and it is not worth journeying across town for. But if you live nearby or you happen to be in the area, it is decent burger and fries.\n\nThe family who runs the place seem really nice and eager to be helpful.  Although you order at the counter, they bring you your food and try to make it a bit nicer.\n\nWhen we were there a family birthday party had taken over a bunch of tables -- seemed a perfect place for it. Good for kids- let you bring in a cake -- etc.", "rating": 4, "date": "2008-02-09"}, {"excerpts": ["Tower Burger and the California, please get it cooked anything other than well-done\n", "The Tower Burger is amazing, it's so moist thanks to the mushrooms that it oozes, have napkins ready.\n", "The California is kind of interesting, you might be wary of sprouts and avocados on a burger, but it works."], "author": "Stephanie F.", "review": "mMm... Juicy burger....\n\nEvery time I pass by here my mouth waters a little, just a Pavlovian response I guess.\nTwo burgers you must try here: Tower Burger and the California, please get it cooked anything other than well-done\nThe Tower Burger is amazing, it's so moist thanks to the mushrooms that it oozes, have napkins ready.\nThe California is kind of interesting, you might be wary of sprouts and avocados on a burger, but it works.", "rating": 4, "date": "2008-06-08"}, {"excerpts": ["I drove up the hill to Tower Burger to try something from there for the first time.  ", "Looking at the menu I was expecting this meal to be good", "..there were also several other people in the place ", "so I wasn't scared away at first.  ", "But OMG the burgers are TERRIBLEEE!!!!  ", "I got a veggie burger which tasted SO MUCH worse than the ones you get in the frozen food section at the store.  ", "Ick...  ", "I had my veggie burger with brie and mushrooms and even those tasted bad!!  ", "The brie still had the rind on but was completely flavorless and the mushrooms didn't taste very good, somehow, either.  \n", "Ok, so maybe the problem is just the veggie burger?? ", "Totally not!  ", "My bf gets a bacon cheeseburger and the meat is completely lacking juices..we decided that the cook must press the burgers on the grill so that the meat gets all packed and drained of juices.  ", "Sigh...and if the food couldn't be any worse the chili cheese fries are absolutely disgusting.  ", "It's as bad as drinking ocean water.  ", "They are so salty that we just left the whole $5.99 worth of fries on the plate."], "author": "Amber R.", "review": "I would have never tried going here but as we all know Big Joe's Broiler #2 has the most ridiculous hours and is never open.  \nSo...I drove up the hill to Tower Burger to try something from there for the first time.  Looking at the menu I was expecting this meal to be good..there were also several other people in the place so I wasn't scared away at first.  But OMG the burgers are TERRIBLEEE!!!!  I got a veggie burger which tasted SO MUCH worse than the ones you get in the frozen food section at the store.  Ick...  I had my veggie burger with brie and mushrooms and even those tasted bad!!  The brie still had the rind on but was completely flavorless and the mushrooms didn't taste very good, somehow, either.  \nOk, so maybe the problem is just the veggie burger?? Totally not!  My bf gets a bacon cheeseburger and the meat is completely lacking juices..we decided that the cook must press the burgers on the grill so that the meat gets all packed and drained of juices.  Sigh...and if the food couldn't be any worse the chili cheese fries are absolutely disgusting.  It's as bad as drinking ocean water.  They are so salty that we just left the whole $5.99 worth of fries on the plate.", "rating": 1, "date": "2011-03-13"}, {"excerpts": ["Tower Burger is jawsome.  ", "Fish and chips are awesome, and the burgers are awesome.  ", "They are better fresh - consumed on-site, but the carry out option works extremely well for families or a night in.  ", "Service is polite, friendly and pretty fast.  ", "Nieman Ranch pattys are good.  ", "They serve beer as well, and the fries are good.  ", "What more could you want?"], "author": "Fiid W.", "review": "Tower Burger is jawsome.  Fish and chips are awesome, and the burgers are awesome.  They are better fresh - consumed on-site, but the carry out option works extremely well for families or a night in.  Service is polite, friendly and pretty fast.  Nieman Ranch pattys are good.  They serve beer as well, and the fries are good.  What more could you want?", "rating": 5, "date": "2009-10-15"}, {"excerpts": ["i ordered their \"tower burger.", "\" for about $7 it came with grilled onions, bacon, mushrooms, cheese, lettuce and tomatoes.  ", "it was good and it totally satisfied my burger craving! too bad ", "it didnt come with fries. ", "but i enjoyed it. ", "i also ordered a strawberry milkshake. ", "btw, they make their milkshakes with Mitchell's ice cream. "], "author": "B B.", "review": "my boyfriend and i were planning to go to Japantown for lunch. while we were in the car, i had this weird craving for a hamburger. as we were driving up Portola, i told him \"i want a hamburger. you wanna try that burger joint instead?\" so we ended up here.\n\nthe burgers were yummy. i ordered their \"tower burger.\" for about $7 it came with grilled onions, bacon, mushrooms, cheese, lettuce and tomatoes.  it was good and it totally satisfied my burger craving! too bad it didnt come with fries. but i enjoyed it. i also ordered a strawberry milkshake. btw, they make their milkshakes with Mitchell's ice cream. i believe it was around $5. \n\nwe went to Joe's Cable Car a couple weeks ago. even though Joe's \"grinds their chuck daily,\" this place uses beef from Niman Ranch http://www.nimanranch.com/index.aspx. my bf said he liked this place and it tasted better than Joe's. plus, its cheaper. we'll probably be back one day.", "rating": 4, "date": "2009-06-21"}, {"excerpts": ["Tower Burger is also kid friendly."], "author": "J H.", "review": "Love this place!  Good burgers, fries, tuna melts, veggie burgers.\n\nTower Burger is also kid friendly.", "rating": 4, "date": "2007-03-30"}, {"excerpts": ["If you want a pretty good, relatively inexpensive burger, Tower Burger is the place to go. ", "They service is really fast and they have a bunch of vegetarian options. ", "The milkshakes are too expensive and not very big, but its a solid burger joint."], "author": "Evan B.", "review": "If you want a pretty good, relatively inexpensive burger, Tower Burger is the place to go. They service is really fast and they have a bunch of vegetarian options. The milkshakes are too expensive and not very big, but its a solid burger joint.", "rating": 4, "date": "2009-08-17"}, {"excerpts": ["Had the Tower Burger and the Tuna Salad here today for a late lunch.  ", "Fast Service, easy parking and clean establishment.  ", "Burger was cooked the way I ordered it and with everything a burger is suppose to come with.  ", "Wanted to try the fish and chips that people raved about but was avoiding the fried foods today.  ", "Next time, fries and beer too!!!"], "author": "Ray Y.", "review": "Had the Tower Burger and the Tuna Salad here today for a late lunch.  Fast Service, easy parking and clean establishment.  Burger was cooked the way I ordered it and with everything a burger is suppose to come with.  Wanted to try the fish and chips that people raved about but was avoiding the fried foods today.  Next time, fries and beer too!!!", "rating": 4, "date": "2009-11-07"}, {"excerpts": ["I used to live in Twin Peaks and Tower Burger was a staple. ", "As a vegetarian, I'm not used to having choices for my veggie burgers, but at tower burger I had around 6! ", "The burgers are great (my husband is a meat eater and likes the regular burgers too)."], "author": "Niki S.", "review": "I used to live in Twin Peaks and Tower Burger was a staple. As a vegetarian, I'm not used to having choices for my veggie burgers, but at tower burger I had around 6! The burgers are great (my husband is a meat eater and likes the regular burgers too).", "rating": 4, "date": "2010-11-01"}, {"excerpts": ["There aren't too many places in SF I would call a staple but Tower Burger sure gets my vote. ", "Secluded up at the top of Diamond Heights this is no diamond in the rough. ", "Surrounded by an affluent community, Tower Burger's smoke stack permeates the neighborhood with BBQ-esque  type smells that makes the local vendors salivate. ", "The Tower Burger with cheese, bacon and mushrooms is the top hit and with a side of rings you're sittin pretty. ", "This place is also the cleanest burger establishment I've been in and the quality of food is outstanding. ", "I just wish they made an original philly cheese like the ones I get back east, ", "that way I could kill two birds with one stone."], "author": "Jason C.", "review": "There aren't too many places in SF I would call a staple but Tower Burger sure gets my vote. Secluded up at the top of Diamond Heights this is no diamond in the rough. Surrounded by an affluent community, Tower Burger's smoke stack permeates the neighborhood with BBQ-esque  type smells that makes the local vendors salivate. The Tower Burger with cheese, bacon and mushrooms is the top hit and with a side of rings you're sittin pretty. This place is also the cleanest burger establishment I've been in and the quality of food is outstanding. I just wish they made an original philly cheese like the ones I get back east, that way I could kill two birds with one stone.", "rating": 4, "date": "2009-05-11"}, {"excerpts": ["So I tried Tower Burger! ", "Never have had a bad burger from here!  ", "They are delicious and right up the street from my house.  ", "Always cooked just the way I order it! ", "There is ample metered parking out front.  ", "The service I have experienced is usually friendly and polite but can vary depending on who is working the counter.  ", "I really don't like the fries.  ", "They are soggy.  ", "I wish they had sweet potatoes fries!  ", "The service is mediocre. ", "Not bad if you are looking for something quick."], "author": "Michelle B.", "review": "I was craving a burger that wasn't \"fast foodie.\" So I tried Tower Burger! Never have had a bad burger from here!  They are delicious and right up the street from my house.  Always cooked just the way I order it! There is ample metered parking out front.  The service I have experienced is usually friendly and polite but can vary depending on who is working the counter.  I really don't like the fries.  They are soggy.  I wish they had sweet potatoes fries!  The service is mediocre. Not bad if you are looking for something quick.", "rating": 3, "date": "2010-04-28"}, {"excerpts": ["Had take out from Tower Burger and it was overall pretty tasty ", "(yeah, take-out isn't the best approach for burgers).  ", "Both burger and fries were just a tad, uhm, damp; not damp enough for the \"soggy\" word (hmm: at what point does damp become soggy?).  ", "I attribute this more to the containers and it being take out than anything else.  "], "author": "Evan D.", "review": "Had take out from Tower Burger and it was overall pretty tasty (yeah, take-out isn't the best approach for burgers).  Both burger and fries were just a tad, uhm, damp; not damp enough for the \"soggy\" word (hmm: at what point does damp become soggy?).  I attribute this more to the containers and it being take out than anything else.  This had the effect of making a quarter of the fries limp.  \n\nWould rate this three stars given the meal, but being nice because hell, it is a take out burger for goodness sake...", "rating": 4, "date": "2007-08-11"}, {"excerpts": ["I will definitely go back to Tower Burger when I am in S.F."], "author": "Yvonne C.", "review": "I love the fact that even though the place was packed,  our food  arrived to our table only 7 minutes after we ordered. The quality of beef here is excellent. I had the bacon cheeseburger, fries, and a Coke, and my honey had a bacon cheeseburger with a chocolate shake. Ice cream fans will love that they use MITCHELL'S ICE CREAM in the shakes! So good! We really enjoyed the clean, family friendly environment. I will definitely go back to Tower Burger when I am in S.F.", "rating": 4, "date": "2006-10-23"}, {"excerpts": ["but if I'm in the area, Tower Burger is definitely the place for a satisfying serving of some really good burger. ", "They have a variety to choose from, including burger, veggie burger, and whatever else you expect to find at a joint like this. ", "AND they actually give you real plates, too--a definite plus. ", "Spacious and clean, it looks like it could accommodate a heck of a lot of people. ", "I love that they keep it simple, but I can imagine this place getting to be really huge and popular with a bit more traffic."], "author": "Josephine J.", "review": "oh, YUM. i have to admit, as a Mission girl my favorite burger place is Big Mouth...but if I'm in the area, Tower Burger is definitely the place for a satisfying serving of some really good burger. They have a variety to choose from, including burger, veggie burger, and whatever else you expect to find at a joint like this. AND they actually give you real plates, too--a definite plus. Spacious and clean, it looks like it could accommodate a heck of a lot of people. I love that they keep it simple, but I can imagine this place getting to be really huge and popular with a bit more traffic.", "rating": 5, "date": "2007-07-31"}, {"excerpts": ["Tower Burger with mushrooms is my fav.!!!"], "author": "MihaSF N.", "review": "I used to live across the street. Hands down, best burgers under $10 in town. Tower Burger with mushrooms is my fav.!!!", "rating": 5, "date": "2009-12-04"}, {"excerpts": ["If in the area, hungry, Tower Burger will not let you down!  ", "Service is fine ", "(I think they might actually read their reviews) the burgers are Niman Ranch.  ", "Nothing to drive for miles for, but truly dandy when you are in this part of town.  ", "Seems clean too."], "author": "Cinnamon Z.", "review": "If in the area, hungry, Tower Burger will not let you down!  Service is fine (I think they might actually read their reviews) the burgers are Niman Ranch.  Nothing to drive for miles for, but truly dandy when you are in this part of town.  Seems clean too.", "rating": 4, "date": "2009-05-02"}, {"excerpts": ["Yay for Tower Burger! ", "They have really good food, and get their meat from Niman Ranch which is a place where they don't feed their livestock hormones and  ", "the intestines of other animals. ", "I always get a chocolate shake and chicken sandwich when I'm here. ", "The price isn't cheap but it's quality. ", "It also isn't expensive, I'd say the burgers range from 7-9 depending on what you want on it and fries, etc."], "author": "Catherine M.", "review": "Yay for Tower Burger! They have really good food, and get their meat from Niman Ranch which is a place where they don't feed their livestock hormones and  the intestines of other animals. I always get a chocolate shake and chicken sandwich when I'm here. The price isn't cheap but it's quality. It also isn't expensive, I'd say the burgers range from 7-9 depending on what you want on it and fries, etc.", "rating": 4, "date": "2007-01-15"}, {"excerpts": ["I really like Tower Burger! ", "Delicious burgers (veggie burgers too), onion rings, and crispy french fries - just the way i like em!"], "author": "Bumble B.", "review": "I really like Tower Burger! Delicious burgers (veggie burgers too), onion rings, and crispy french fries - just the way i like em!", "rating": 4, "date": "2007-12-25"}, {"excerpts": ["Tower Burger is a cash cow in that neighborhood from the looks of the traffic that was flowing in even on a monday night. ", "I was with Yelper friend Larry and his wife ", "and we all had the Tower Burger special. ", "It was the big burger with bacon, grilled onions, cheese. ", "Not bad for a neighborhood burger place ", "but they need to work on freshness of when the bacon was cooked. ", "It wasn't quite what I expected but they get a C for effort. ", "The extra order of fries for a buck wasn't so bad either as Sparky's charges way more than most places. ", "It's all about location my peeps when the menu burns a hole in yer pocket. ", "Carcinogen's, start your engines...!!!! ", "Vrrrrooooooommm....!"], "author": "Sven S.", "review": "This neighborhood has gone thru some huge changes over the years. I lived just 2 blocks form this place and it seems like there are more businesses that serve food than before. Tower Burger is a cash cow in that neighborhood from the looks of the traffic that was flowing in even on a monday night. I was with Yelper friend Larry and his wife and we all had the Tower Burger special. It was the big burger with bacon, grilled onions, cheese. Not bad for a neighborhood burger place but they need to work on freshness of when the bacon was cooked. It wasn't quite what I expected but they get a C for effort. The extra order of fries for a buck wasn't so bad either as Sparky's charges way more than most places. It's all about location my peeps when the menu burns a hole in yer pocket. Carcinogen's, start your engines...!!!! Vrrrrooooooommm....!", "rating": 3, "date": "2007-11-20"}, {"excerpts": ["Anyway, I like Tower Burger", ", it is my current default burger joint in SF. ", "I am open to new ideas and suggestions, so get in touch if you have a strong opinion.  ", "It's by the old Tower Market up on top of Diamond Heights, and while you won't be bowled over by the atmospherics. ", "you will have a solid Niman Ranch (that's pronounced ethical) experience."], "author": "Mark P.", "review": "I love a good burger, before I moved to SF I lived in Greenwich Village for 25 years where my favorite burgers (I mark with a (s) for still there or (g)  for gone) were Petes Tavern (s), Jane Street Tavern (s) (REALLY the best and, Corner Street Bistro (s) (if you can deal with bar fights, mice and bugs it is very good, and of course the Daniel Bouloud's DB (ok, I only watched somebody eat it and it squirted the foie gras out of its core onto his girl's very expensive clothes, ooh la la). Anyway, I like Tower Burger, it is my current default burger joint in SF. I am open to new ideas and suggestions, so get in touch if you have a strong opinion.  It's by the old Tower Market up on top of Diamond Heights, and while you won't be bowled over by the atmospherics. you will have a solid Niman Ranch (that's pronounced ethical) experience.", "rating": 4, "date": "2007-11-27"}, {"excerpts": ["The food is delicious at Tower Burger.  ", "I usually get a bacon cheeseburger with onion rings, and the fish and chips are really good.  ", "I don't care too much for the coleslaw though.  ", "The tuna salad is also delicious.  ", "The restaurant is clean, and the staff is friendly.  ", "They are always busy at lunch, but they work through it well and the quality of food does not change."], "author": "Trina R.", "review": "The food is delicious at Tower Burger.  I usually get a bacon cheeseburger with onion rings, and the fish and chips are really good.  I don't care too much for the coleslaw though.  The tuna salad is also delicious.  The restaurant is clean, and the staff is friendly.  They are always busy at lunch, but they work through it well and the quality of food does not change.", "rating": 5, "date": "2009-04-17"}, {"excerpts": ["I am conveniently located to the Tower Burger, but I almost never consider this place when I'm looking for my burger-fix.  ", "This place has been around for 6+ years and there is nothing outstanding about its service, (and quality, for that matter) that would bring me back no more than twice a year.  ", "Is it me, or is the \"Neiman Ranch Beef\" a little on the bitter side?  ", "As for the fries, I'm actually looking for a potato that delivers a superb crunch and moist texture on the inside.  ", "Their fries are just plain fried potatoes.  ", "Tower Burger is your average burger joint.  ", "I would give three stars for being average, but their meat is bitter."], "author": "Eric T.", "review": "I am conveniently located to the Tower Burger, but I almost never consider this place when I'm looking for my burger-fix.  This place has been around for 6+ years and there is nothing outstanding about its service, (and quality, for that matter) that would bring me back no more than twice a year.  Is it me, or is the \"Neiman Ranch Beef\" a little on the bitter side?  As for the fries, I'm actually looking for a potato that delivers a superb crunch and moist texture on the inside.  Their fries are just plain fried potatoes.  Tower Burger is your average burger joint.  I would give three stars for being average, but their meat is bitter.", "rating": 2, "date": "2008-01-13"}, {"excerpts": ["I used to live down the street from Tower Burger, I can say with confidence that I took it for granted. ", "This is simply the best burger you'll find in the Twin Peaks area...", "don't even bother trying to prove me wrong. ", "Tower is family owned an operated by an extremely friendly and polite group of people. ", "Both the restaurant and kitchen are always clean as a whistle, along with their delicious food. ", "They use high quality Niman Ranch beef in all of their burgers, so eat with complete confidence. ", "Don't be cornered into the burger though...", "I've never been disappointed with anything from Tower (except the gilled cheese...", "but it's a grilled cheese). ", "I still have friends that drive across SF just to get a burger from Tower...so take the journey. ", "I promise you won't be disappointed."], "author": "Jerry A.", "review": "I used to live down the street from Tower Burger, I can say with confidence that I took it for granted. This is simply the best burger you'll find in the Twin Peaks area...don't even bother trying to prove me wrong. Tower is family owned an operated by an extremely friendly and polite group of people. Both the restaurant and kitchen are always clean as a whistle, along with their delicious food. They use high quality Niman Ranch beef in all of their burgers, so eat with complete confidence. Don't be cornered into the burger though...I've never been disappointed with anything from Tower (except the gilled cheese...but it's a grilled cheese). I still have friends that drive across SF just to get a burger from Tower...so take the journey. I promise you won't be disappointed.", "rating": 5, "date": "2009-02-24"}, {"excerpts": ["When we don't feel like cooking, we head up to Tower Burger for , what we think, are the best tasting burgers in town.  ", "Great quality meat, buns not soggy and the best fries!  ", "Wash it down with a milkshake made from Mitchell's ice cream!  ", "If you're not into the meat thing, they have other menu choices, too."], "author": "suzanne l.", "review": "When we don't feel like cooking, we head up to Tower Burger for , what we think, are the best tasting burgers in town.  Great quality meat, buns not soggy and the best fries!  Wash it down with a milkshake made from Mitchell's ice cream!  If you're not into the meat thing, they have other menu choices, too.", "rating": 5, "date": "2007-10-25"}, {"excerpts": ["A regular Tower Burger-ite until now, on a visit last week, the 'kids' were running the show..first batch of fries were a wet grease fest, which is not the norm.", "I rooted around on my plate for some non soaked fries and then went to the to the counter to ask for another batch, the young lady looked at me like I was crazy and then dumped the fries from my plate BACK into the fry bin to give to someone else!  ", "Second batch worse than the first, the young man curtly informed me that this is what their fries are like, said 'we're busy ", "so Ill just give you your money back\"  and slapped $1.50 on the table. ", "I watched the grill cook pull the fry basket from the oil and without as much as a shake or oil drain moment, dump them dripping into the fry bin. ", "Gross! ", "Tower Burger owners, don't leave the shop in the kids hands!"], "author": "Charlotte F.", "review": "A regular Tower Burger-ite until now, on a visit last week, the 'kids' were running the show..first batch of fries were a wet grease fest, which is not the norm.I rooted around on my plate for some non soaked fries and then went to the to the counter to ask for another batch, the young lady looked at me like I was crazy and then dumped the fries from my plate BACK into the fry bin to give to someone else!  Second batch worse than the first, the young man curtly informed me that this is what their fries are like, said 'we're busy so Ill just give you your money back\"  and slapped $1.50 on the table. I watched the grill cook pull the fry basket from the oil and without as much as a shake or oil drain moment, dump them dripping into the fry bin. Gross! Tower Burger owners, don't leave the shop in the kids hands!", "rating": 1, "date": "2008-12-02"}, {"excerpts": ["We really like Tower Burger. ", "Burgers are great and it's a plus that they use Niman Ranch meat (if you are ordering a traditional beef burger). ", "Fries good, onion rings could do better but that is because I like the kind that are similar to Johnny Rockets, i.e. have crumbs on them or some such thing. ", "Anyway, I think the only drawback is the decor. ", "Really needs a facelift. ", "Not cozy, wouldn't want to hang out there, kinda cheap and stark. ", "But, the food is good and it seems like a nice, family-run place."], "author": "Shelley F.", "review": "We really like Tower Burger. Burgers are great and it's a plus that they use Niman Ranch meat (if you are ordering a traditional beef burger). Fries good, onion rings could do better but that is because I like the kind that are similar to Johnny Rockets, i.e. have crumbs on them or some such thing. Anyway, I think the only drawback is the decor. Really needs a facelift. Not cozy, wouldn't want to hang out there, kinda cheap and stark. But, the food is good and it seems like a nice, family-run place.", "rating": 4, "date": "2008-02-01"}, {"excerpts": ["the three best three things about Tower Burger for me is (1) the location, a two minute walk from my front door. ", "(2) Consistently good food. ", "(3)  ", "they got a 100 on their latest health report inspection!!!  ", "Their portions for fries are on the small side, but enough to fill you up along with one of their niman ranch burgers. ", "I also like their turkey burger a lot when I'm not in a red meat mood ", ":)"], "author": "TC C.", "review": "the three best three things about Tower Burger for me is (1) the location, a two minute walk from my front door. (2) Consistently good food. (3)  they got a 100 on their latest health report inspection!!!  Their portions for fries are on the small side, but enough to fill you up along with one of their niman ranch burgers. I also like their turkey burger a lot when I'm not in a red meat mood :)", "rating": 3, "date": "2008-06-22"}, {"excerpts": ["And so it was with Tower Burger.  ", "I'd been here before and thought it was good but not great, a perfectly fine place to have a burger if there are no higher quality options readily available.  ", "But on this particular occasion, with fine reddish dust covering my legs and most of my clothes, and ample amounts of lactic acid coursing through my veins, that $7 Niman Ranch Texas Burger with a small side of chili, along with an extra-cost plate of freshly cooked fries, rocked my world.  ", "Best.  ", "Meal.  ", "Ever.  ", "Like I said, on an average day, you can find a more interesting burger if you want to (for example, the Niman Ranch 1/3 pounders at my workplace's cafe are at last on par for quality, and cheaper and bigger), but you could certainly do worse than eating here.  ", "I'd really give this restaurant 3.5 stars if I could."], "author": "Chuck W.", "review": "After a long bike ride, *anything* tastes freakin' GREAT.  Powerbars, instant oatmeal, Fresh Choice, blades of cut grass...  And so it was with Tower Burger.  I'd been here before and thought it was good but not great, a perfectly fine place to have a burger if there are no higher quality options readily available.  But on this particular occasion, with fine reddish dust covering my legs and most of my clothes, and ample amounts of lactic acid coursing through my veins, that $7 Niman Ranch Texas Burger with a small side of chili, along with an extra-cost plate of freshly cooked fries, rocked my world.  Best.  Meal.  Ever.  Like I said, on an average day, you can find a more interesting burger if you want to (for example, the Niman Ranch 1/3 pounders at my workplace's cafe are at last on par for quality, and cheaper and bigger), but you could certainly do worse than eating here.  I'd really give this restaurant 3.5 stars if I could.", "rating": 3, "date": "2007-10-29"}, {"excerpts": ["I do like the burgers at tower burger. ", "They are cooked to order, come quickly, and have a 100 score for cleanliness. ", "I guess I have a beef (yuck yuck!) ", "about other things. ", "First, when my child came skipping  in one day (as 3 year olds are wont to do) she slipped on the hard, stone/tile wet floor that had just been cleaned. ", "There was no sign warning us that it was wet and therefore dangerous. ", "The people behind the counter lifted their eyes for a second, possibly because my daughter was wailing loudly, and then they quickly looked down. ", "This is not the way to win customers. ", "They could have shown a bit of concern, given the child a piece of ice, apologized for the wet floor. ", "Second, I think the price of the burgers are a tad high. ", "Everything is al la carte, so it doesn't include a salad, fries or slaw. ", "A bit pricey. ", "And finally, there should be a kid meal price, or a discount if all you ask for hot dog with not bun. ", "Please don't charge full price! ", "You want parents to come back, right? ", "Make us feel good about the pricing and floors!"], "author": "annie s.", "review": "I do like the burgers at tower burger. They are cooked to order, come quickly, and have a 100 score for cleanliness. I guess I have a beef (yuck yuck!) about other things. First, when my child came skipping  in one day (as 3 year olds are wont to do) she slipped on the hard, stone/tile wet floor that had just been cleaned. There was no sign warning us that it was wet and therefore dangerous. The people behind the counter lifted their eyes for a second, possibly because my daughter was wailing loudly, and then they quickly looked down. This is not the way to win customers. They could have shown a bit of concern, given the child a piece of ice, apologized for the wet floor. Second, I think the price of the burgers are a tad high. Everything is al la carte, so it doesn't include a salad, fries or slaw. A bit pricey. And finally, there should be a kid meal price, or a discount if all you ask for hot dog with not bun. Please don't charge full price! You want parents to come back, right? Make us feel good about the pricing and floors!", "rating": 2, "date": "2008-07-09"}], "hawaiian burger": [{"excerpts": ["Hawaiian burger and fish and chips was our order. ", "Overall the food was excellent. ", "Everything was fresh, very well portioned and flavorful. ", "Our order was done fast, plenty of sitting areas, great location, everything was clean and excellent customer service."], "author": "Nicho S.", "review": "Hawaiian burger and fish and chips was our order. Overall the food was excellent. Everything was fresh, very well portioned and flavorful. Our order was done fast, plenty of sitting areas, great location, everything was clean and excellent customer service.", "rating": 4, "date": "2017-11-17"}, {"excerpts": ["$7.95 Hawaiian Burger with $3.65 side of regular Fries."], "author": "Caesar A.", "review": "FYI  it is unfortunate this proprietor doesn't understand how a closing time works. 30 minutes before closing they will refuse to let you dine in but they will make your order if you will accept it to go only. When I took a burger three blocks home in a to-go box, I found it swimming inside the box with the bun inedible.\n.\nFor the life of me I can't understand why the burgers are so incredibly greasy. Others may say they're just juicy but in any case they're very messy to eat. \n.\nI don't like seeing they don't separate recycling from garbage, I wish they were more conscientious.\n.\n$7.95 Hawaiian Burger with $3.65 side of regular Fries.", "rating": 2, "date": "2017-09-06"}, {"excerpts": ["I ordered the Hawaiian burger and i love how the teriyaki sauce compliments the burger patty really well. ", "Also toppled with a sweet cut of pineapple its a must! ", "The french fries are alright. ", "I find the texture slightly dry but nonetheless its not bad. ", "In terms of pricing, its around 10 bucks with fries on average. ", "Anyways i highly recommend this place and I am a regular here."], "author": "John M.", "review": "Great fantastic HUMANE juicy burgers! First off lets just say if you are a humane meat supporter this place is a must! They get their meat from Neman Ranch (however it is spelled) and the quality of meat is the absolute best. I ordered the Hawaiian burger and i love how the teriyaki sauce compliments the burger patty really well. Also toppled with a sweet cut of pineapple its a must! The french fries are alright. I find the texture slightly dry but nonetheless its not bad. In terms of pricing, its around 10 bucks with fries on average. Anyways i highly recommend this place and I am a regular here.", "rating": 4, "date": "2017-12-12"}, {"excerpts": ["Best hawaiian burger!!!", "!\n", "My boyfriend ", "and I always go and order a burger and a chicken salad and share. ", "So full filling, yummy, and fresh.\n"], "author": "Yunmi J.", "review": "Best hawaiian burger!!!!\nMy boyfriend and I always go and order a burger and a chicken salad and share. So full filling, yummy, and fresh.\nI love eating at tower burger.", "rating": 5, "date": "2016-09-08"}, {"excerpts": ["BJ's burgers are good, but their Hawaiian burger is much better and cheaper. ", "Salads are very fresh. ", "It was something i didnt expect to be good ", "but it was amazing.  ", "Also i have to talk about the onion ring. ", "You must get onion rings with burger. "], "author": "Phillip N.", "review": "I just have to say. You will not get this quality burger with this price. BJ's burgers are good, but their Hawaiian burger is much better and cheaper. Salads are very fresh. It was something i didnt expect to be good but it was amazing.  Also i have to talk about the onion ring. You must get onion rings with burger. Overall i had real good meal at tower burger. You gonna love this!!", "rating": 5, "date": "2014-01-19"}, {"excerpts": ["I tried their Hawaiian burger and it was pretty good. ", "A little on the pricey side but worth it. ", "The fries don't get soggy as fast and the burger patty was cooked exactly like I wanted ", "so I love it!"], "author": "Maile W.", "review": "First time coming here with my friend and I like the place. Lots of natural lighting, room, and etc. I tried their Hawaiian burger and it was pretty good. A little on the pricey side but worth it. The fries don't get soggy as fast and the burger patty was cooked exactly like I wanted so I love it!", "rating": 5, "date": "2012-04-01"}, {"excerpts": ["Ordered Hawaiian burger. ", "Not bad. ", "Not too pricy. ", "Two burgers, one order of fries one order of onion rings, water= $22.14"], "author": "Ben M.", "review": "Ordered Hawaiian burger. Not bad. Not too pricy. Two burgers, one order of fries one order of onion rings, water= $22.14", "rating": 4, "date": "2013-10-26"}, {"excerpts": ["I had a hawaiian burger. ", "Perfectly cooked and meat was juicy. ", "Next time ", "Id "], "author": "Jun K.", "review": "I had a hawaiian burger. Perfectly cooked and meat was juicy. Next time Id like to try the tower burger. Will definitely recommend.", "rating": 5, "date": "2013-08-03"}], "basic veggie burger": [], "veggie cheese burger": [], "grilled veggie burger": [], "barbecue veggie burger": [], "potobella mushroom burger": [], "veggie chili burger": [{"excerpts": ["8 different styles of veggie burgers, including a veggie chili burger (something I can never seem to find) AND Mitchell's ice cream milkshakes.  ", "Place was quiet, clean and the service was fast and friendly.  ", "If you're in the West Portal area and you need a good veggie burger, this is the place!"], "author": "Heather H.", "review": "Went here for the first time last weekend and loved it!  8 different styles of veggie burgers, including a veggie chili burger (something I can never seem to find) AND Mitchell's ice cream milkshakes.  Place was quiet, clean and the service was fast and friendly.  If you're in the West Portal area and you need a good veggie burger, this is the place!", "rating": 4, "date": "2011-08-01"}, {"excerpts": ["Value/Quality:\nI usually order the veggie chili burger with fries. ", "At $ 6.25 The portion of fries (that you have to pay extra) seems generous and the chili is satifying for a good eater like me. "], "author": "Raul A.", "review": "Selection:\nConsidering this is a burger joint, Tower burgers has lots of veggie options like the Portabella mushroom, california veggie (with avocados and sprouts), veggie Paris burger with brie and mushrooms and several others. They also have turkey burgers, sandwiches, salads and fish and chips.\n\nValue/Quality:\nI usually order the veggie chili burger with fries. At $ 6.25 The portion of fries (that you have to pay extra) seems generous and the chili is satifying for a good eater like me. The lettuce and tomato are always crisp and the food is hot, even for pick-up orders.\n\nLocation/service\nThe School of the Arts is near by, it gets crowded on weekdays around lunch time. I get my orders to go, you can always call ahead.  Mama and junior always take your order FAST without ever being rude or dismissive! They are lovely people, very efficient.  Now, if I could get them not to be stingy with the ketchup packages with to-go orders.....", "rating": 5, "date": "2007-05-22"}], "veggie paris burger": [{"excerpts": ["Selection:\nConsidering this is a burger joint, Tower burgers has lots of veggie options like the Portabella mushroom, california veggie (with avocados and sprouts), veggie Paris burger with brie and mushrooms and several others. "], "author": "Raul A.", "review": "Selection:\nConsidering this is a burger joint, Tower burgers has lots of veggie options like the Portabella mushroom, california veggie (with avocados and sprouts), veggie Paris burger with brie and mushrooms and several others. They also have turkey burgers, sandwiches, salads and fish and chips.\n\nValue/Quality:\nI usually order the veggie chili burger with fries. At $ 6.25 The portion of fries (that you have to pay extra) seems generous and the chili is satifying for a good eater like me. The lettuce and tomato are always crisp and the food is hot, even for pick-up orders.\n\nLocation/service\nThe School of the Arts is near by, it gets crowded on weekdays around lunch time. I get my orders to go, you can always call ahead.  Mama and junior always take your order FAST without ever being rude or dismissive! They are lovely people, very efficient.  Now, if I could get them not to be stingy with the ketchup packages with to-go orders.....", "rating": 5, "date": "2007-05-22"}], "california veggie burger": [], "basic chicken sandwiches": [], "cheese chicken sandwiches": [], "paris chicken sandwiches": [], "mushroom chicken sandwiches": [], "california chicken sandwiches": [], "grilled ham  cheese": [], "patty melt": [{"excerpts": ["Pros:Patty melt was awesome! \n", "I love their onion rings\nClean interior with friendly staff!\n", "They take orders through the phone "], "author": "Daniel H.", "review": "Pros:Patty melt was awesome! \nI love their onion rings\nClean interior with friendly staff!\nThey take orders through the phone so it's ideal for anything who's willing to take out.\n\nCons: price? A little bit or maybe it's because I just order a lot.", "rating": 4, "date": "2011-09-18"}, {"excerpts": ["One of the burgers in particular that I go hunting for, is The Patty Melt. ", "This burger is like BigFoot to me, you see it at a burger place once, when you go, then you look for it at another burger joint ", "and it's missing! ", "Or the bread is wrong! ", "Or the bread is not grilled or toasted! ", "Or the burger patty is too tough! ", "Or they put sauce in it! ", "Ughhh!! ", "I'm going crazy!\n", "Then There was a sighting of the legendary BigFoot Patty Melt. ", "They have the legendary Patty Melt! ", "They use Rye bread! ", "Check! ", "They butter and grill the bread! ", "Check! ", "They use Neiman Ranch beef! ", "Check! ", "They have Caramelized onions! ", "Check! ", "I Have found my BigFoot! ", "It's one of the better patty melts I have had.\n", "It's really juicy. ", "The quality is tasted in every bite. ", "I'm so glad my search has come to an end."], "author": "Roger P.", "review": "Im always in search of a good burger. One of the burgers in particular that I go hunting for, is The Patty Melt. This burger is like BigFoot to me, you see it at a burger place once, when you go, then you look for it at another burger joint and it's missing! Or the bread is wrong! Or the bread is not grilled or toasted! Or the burger patty is too tough! Or they put sauce in it! Ughhh!! I'm going crazy!\nThen There was a sighting of the legendary BigFoot Patty Melt. It was seen  resting on the menu of Tower burger! They have the legendary Patty Melt! They use Rye bread! Check! They butter and grill the bread! Check! They use Neiman Ranch beef! Check! They have Caramelized onions! Check! I Have found my BigFoot! It's one of the better patty melts I have had.\nIt's really juicy. The quality is tasted in every bite. I'm so glad my search has come to an end.", "rating": 4, "date": "2013-04-17"}, {"excerpts": ["Patty melt is the best anywhere.  ", "Rye bread - buttered and grilled.  ", "We've been going here for years and still enjoy it!"], "author": "Carrie N.", "review": "Love the basic burger with onion rings.  I'm not a huge fan of their french fries but I always steal some anyway.  Patty melt is the best anywhere.  Rye bread - buttered and grilled.  We've been going here for years and still enjoy it!", "rating": 5, "date": "2015-02-24"}], "club house sandwich": [{"excerpts": ["Club House Sandwich $7.49 - turkey, bacon, lettuce, tomato, and mayo on sliced wheat toast. ", "Tasty triple decker but could've used a little more bacon.  ", "The bacon was a little lost under the generous amount of fresh crisp leafy lettuce. "], "author": "Hannah C.", "review": "Clean establishment, fast service, good food and decent portions. \n\nCalifornia Chicken Sandwich $7.89 - grilled chicken breast, jack cheese, pickles, red onions, sprouts, avocado, lettuce, and tomatoes on a French roll + $1.99 for onion rings. Chicken breast wasn't as dry as all grilled chicken breasts are.  Had a refreshing taste of sprouts, onions, and pickles.  http://www.yelp.com/biz_photos/zriqhz9jWIY0Y-PXBnLDCw?select=thz_LLrLexsccuzE0MMcoQ\n\nClub House Sandwich $7.49 - turkey, bacon, lettuce, tomato, and mayo on sliced wheat toast. Tasty triple decker but could've used a little more bacon.  The bacon was a little lost under the generous amount of fresh crisp leafy lettuce. http://www.yelp.com/biz_photos/zriqhz9jWIY0Y-PXBnLDCw?select=cA0ADiAgxRXIt-63RkR57w \n\nWill return when I'm in the mood for burgers or sandwiches.", "rating": 4, "date": "2010-03-21"}], "philly cheese steak": [{"excerpts": ["I get their great philly cheese steak.  ", "You cannot beat the service either.  ", "Family friendly and a joy of a place to sit down and have some great fries and a milkshake.  ", "A real milkshake."], "author": "Gregory P.", "review": "My son has grown up here, and it is as great as it was day one.  The best burgers in town by far.  I get their great philly cheese steak.  You cannot beat the service either.  Family friendly and a joy of a place to sit down and have some great fries and a milkshake.  A real milkshake.", "rating": 5, "date": "2015-05-27"}], "caesar salad": [], "albacore tuna salad": [], "pieces fish  chip": [], "prawns  chip": [], "pieces fish   pieces of prawn  chip": [], "chicken strips": [{"excerpts": ["My friend and I clearly ordered chicken strips, but they gave us fish and chips. ", "We asked if we could get what we ordered, but the man just said \"we already made that\" and kind of dismissed us."], "author": "Kees H.", "review": "Good burgers and fries, but terrible customer service. My friend and I clearly ordered chicken strips, but they gave us fish and chips. We asked if we could get what we ordered, but the man just said \"we already made that\" and kind of dismissed us.", "rating": 1, "date": "2016-04-18"}, {"excerpts": ["The turkey burger was a little dull and the chicken strips were kind of under-seasoned."], "author": "Allyn V.", "review": "Three star. Not great. Solid.  I asked for the server's recommendation... he said the Tower Burger.  I tried it. Pretty tasty. Onion rings were a little bit greasy.  My friends didn't enjoy theirs as much. The turkey burger was a little dull and the chicken strips were kind of under-seasoned.", "rating": 3, "date": "2015-12-30"}], "additional french fries": [], "additional onion rings": [], "additional salad": [], "side french fries": [], "chilli cheese fries": [], "side onion ring": [], "bowl chili": [], "cup of chili": [{"excerpts": ["Double burger, small cup of chili, shake and sweet potato fries... ", "$27!  ", "Almost disgusting chili, flavorless almost no meat in it.  ", "Burger was average at best with the cheapest vegetables you could find anywhere.  ", "The bun was cheap and a turn off; like what you'd find at Safeway A dollar for half a dozen. \n  ", "Sweet potato fries were hot and delicious; Mitchell's ice cream vanilla shake was boring.  ", "The service was good and very fast.  ", "I won't go back."], "author": "W. H.", "review": "this is a business based on Cost-cutting, cost-cutting, cost-cutting.   Cheap ingredients, cheap decor, and outrageous prices.  Double burger, small cup of chili, shake and sweet potato fries... $27!  Almost disgusting chili, flavorless almost no meat in it.  Burger was average at best with the cheapest vegetables you could find anywhere.  The bun was cheap and a turn off; like what you'd find at Safeway A dollar for half a dozen. \n  Sweet potato fries were hot and delicious; Mitchell's ice cream vanilla shake was boring.  The service was good and very fast.  I won't go back.", "rating": 2, "date": "2015-06-25"}], "bowl of soup": [], "cup of soup": [], "cole slaw": [{"excerpts": ["It also came with cole slaw which I really didn't care for. \n\n"], "author": "Junaline G.", "review": "Came here last Tuesday around 8pm for a quick bite.  It was highly recommended by one of my husbands patient.   The place was very spacious.  Not busy when we came.  It seems like the place is family owned.\n\nOur order was taken immediately.\n\nWe ordered:\n3 pieces fish and chips \nTower burger\nAnchor steam.  \n\nFish was Cod,  really bland, no flavor. I was really disappointed.  It also came with cole slaw which I really didn't care for. \n\nTower burger came with bacon, grilled onion, sautéed mushroom, pickles and your choice of cheese (we picked provolone)- we ordered it to be cooked medium rare, it was juicy and my husband enjoyed it.\n\nI can prolly find a better restaurant for fish and chips in the city.", "rating": 3, "date": "2018-03-18"}, {"excerpts": ["Need a larger serving of Cole slaw. ", "Food is clean and simple. ", "That's a good thing. ", "If your hungry and you want to get in and out this place will meet your needs. ", "Ample parking out front. ", "AND IM FULL."], "author": "Peter c.", "review": "Easy to order. Very friendly. Bench seats need new covers. Bathrooms very clean. Everything is very orderly and organized. Fish is good. Fries need salt. Need a larger serving of Cole slaw. Food is clean and simple. That's a good thing. If your hungry and you want to get in and out this place will meet your needs. Ample parking out front. AND IM FULL.", "rating": 4, "date": "2014-08-29"}], "small salad": [], "fountain soda": [{"excerpts": ["I got a jack cheeseburger with all the dressing - lettuce, sliced tomatoes, and Bermuda sliced onion, and a side of fries, and a fountain soda.  ", "Hubby got the bacon cheddar cheeseburger.  ", "Our charbroiled burgers were cooked to order.  ", "The fries were piping hot.  ", "Burgers were juicy.  "], "author": "Shirley N.", "review": "I've been eyeing this place for a long long time.  Today I was craving a good burger and some fries.  After class today a friend suggested Tower Burger.  Said they serve basic burgers with Niman Ranch ground beef patties.   \n\nYou walk in and order off a laminated menu at the counter.  Better read quickly as the order taker/cashier is waiting to take your order.  Pay, take your number, and sit down.\n\nI got a jack cheeseburger with all the dressing - lettuce, sliced tomatoes, and Bermuda sliced onion, and a side of fries, and a fountain soda.  Hubby got the bacon cheddar cheeseburger.  Our charbroiled burgers were cooked to order.  The fries were piping hot.  Burgers were juicy.  All for about $20.\n\nI don't understand the negative reviews.  Service was quick.  Food was very good.  Easy parking.", "rating": 4, "date": "2014-06-14"}], "coffee  hot chocolate": [], "mitchells chocolate vanilla strawberry shake": [], "coke  root beer float": []}