{"amenities": [{"excerpts": ["Fleming has all of the same amenities as Harding: clubhouse, range, practice greens, etc. "], "author": "Greg Q.", "review": "I hate to be the one who \"firsts\" Fleming, given how many other people have reviewed it under Harding's banner, but Fleming deserves its own review. I got out and played Fleming for the first time today, and it is a wonderful 9-hole course for fine-tuning your game.\n\nThe course plays par 30 - so there are six par 3 holes and three par 4's. Think of it as a mini-Harding. Fleming plays on the interior of Harding's back 9 - and if you've ever played Harding you've at least seen some of the yellow flags marking Fleming's layout.\n\nThe holes vary in length from easy to reach par 3s of 130 yards to \"hit & hope\" 235 yard par 3's. The par 4 holes are fair tests of golf, varying from 400 to 450 yards from the white tees, when they are moved back.\n\nI walked on at noon on a Wednesday. The pro shop staff were extremely courteous (I love those guys at Harding, really I do), got me processed and out the door in less than two minutes. The course itself was near-empty. I saw a few groups ahead of me, but never caught them. I had the green light to hit when ready for the entire round.\n\nI played 9 holes in under 90 minutes. Alone. With a lot of the same views you get while playing Harding and (this is the important part) the same condition fairways & greens. The greens at Fleming are in great shape, better than Lincoln, GGP, Sharp or Glen Eagles. In fact, the only muni in town with greens close to or better than Fleming's are...Harding!\n\nFleming has all of the same amenities as Harding: clubhouse, range, practice greens, etc. It is the best \"executive course\" in the city, and my new found home for quick rounds.\n\nCourse design/playability: 4 stars \nWalk-Ability: 5 stars\nCondition/maintenance: 5 stars\nDriving range/practice area: 4 stars\nPace of play: 5 stars\nAvg. wait for tee time: 5 stars\nPro shop staff: 5 stars", "rating": 5, "date": "2008-01-09"}]}