{"olive marinate": [], "bruschetta": [{"excerpts": ["The bruschetta tomatoes are not fresh.. it lost its flavor and the bread crust was tad hard. \n\n"], "author": "Linda C.", "review": "I have two complaint.. I wish the servers/ waiter tell the guests that the sodas are not refillable.. total of 4 refills came out $16... got duped. This happened to me at a different restaurant and didn't inform that the fancy water is not free... I assumed it was free.. \nbeware.. the soda refill is $4 per refill. It is a hidden fee.. there are some people that are on a budget \n\nThe bruschetta tomatoes are not fresh.. it lost its flavor and the bread crust was tad hard. \n\nIf I decided to come back again and I hope the server tell the guests that drinks are not refillable and is $4 per refill.", "rating": 3, "date": "2017-09-24"}, {"excerpts": ["When short on time, we pop in for at least an appetizer of Bruschetta or the Polenta con Funghi. ", "There is a nice selection of wines and signature cocktails. "], "author": "Shona M.", "review": "Pinocchio's is our favorite spot in North Beach. Upon arrival, my husband and I are reminded of just why with the charm of the Italian decor and the aromas of authentic Italian foods coming from the kitchen. The owner, Chef Giovanni and the staff remember us and always welcome us like old friends.  \n\nThe food here is simply addicting. When short on time, we pop in for at least an appetizer of Bruschetta or the Polenta con Funghi. There is a nice selection of wines and signature cocktails. (My guilty pleasure is the Limoncello Lemon Drop.) \n\nThe homemade pastas are absolutely delicious. My husband's favorite dish is the Ossobuco. As for me, I especially enjoy the Chicken Parmigiana.\n\nIf you are looking for an authentic Italian meal with a warm atmosphere and excellent service you will not be disappointed!", "rating": 5, "date": "2018-03-06"}, {"excerpts": ["The Gnocchi was awesome, the bruschetta was also terrific. ", "Service was great. "], "author": "Lou G.", "review": "This is a great restaurant to sit outside and take in the streets of San Francisco! With the Transamerica Tower as a backdrop we enjoyed a great lunch here. The Gnocchi was awesome, the bruschetta was also terrific. Service was great. Really happy to have found it, and would return again when in the area.\n\n\"Toodle-oo, Stromboli\"\nJiminy Cricket", "rating": 4, "date": "2015-07-26"}, {"excerpts": ["When tomatoes are in season, the bruschetta is a must. "], "author": "Elena R.", "review": "Great dinner spot! Love their seasonal specials (butternut squash ravioli, house made pappardelle with saffron cream sauce to name a couple). And their lasagna, whoa, out of this world amazing. When tomatoes are in season, the bruschetta is a must. Every thing we have had here is so amazing. \n\nIt is classic North Beach service, these aren't people that dote on you hand and foot, they are enjoyable and friendly staff passionate about getting you delicious food and drink. They also have house made limoncello - so good.", "rating": 5, "date": "2016-03-24"}, {"excerpts": ["I tried their minestrone soup as well as bruschetta and both were excellent.  ", "The restaurant is very traditional if you sit inside but outside seating offers good people watching."], "author": "Monica G.", "review": "My co-worker claims that their veal lasagna is better than the one she makes at home and she is Italian. Unfortunately I couldn't try it because I don't eat veal but apparently the cheese that was used knocked her socks off.   I tried their minestrone soup as well as bruschetta and both were excellent.  The restaurant is very traditional if you sit inside but outside seating offers good people watching.", "rating": 4, "date": "2015-10-18"}, {"excerpts": ["However the bruschetta starter was an icy mixture on top of tasteless toast. \n\n"], "author": "Dave B.", "review": "This review is overdue. My wife and I have had special gatherings at Pinocchio's in the past. So when we had an event to go to in San Francisco at the beginning of July we jumped at the chance to visit one of our favorite Italian restaurants.\n \nWhen we entered it was 8:50pm and there was a total of 4 tables occupied and one person sitting at the bar picking up a to-go order.  The hostess passed empty tables to end up offering us one directly across from the entrance into the kitchen. When asked if we can move to another table she told us they were for bigger parties, but reluctantly moved us to a table across from the bar.\n\nMariano greeted us, served water and took our order.  Basically we didn't see him again until the bill came. The antipasto salad, veal parmesan and gnocchi were good.  However the bruschetta starter was an icy mixture on top of tasteless toast. \n\nShortly after we ordered,  a bridal shower party of 10 arrived. Their waiter is the one who brought us our entree while juggling his bridal party as well as his other 2 tables.  I wish I would have gotten his name but we were sitting there in shock and disbelief at the service.\nWhere was Mariano? He was hanging out at the front door with the unenthusiastic hostess and a mystery staff? manager (wearing a track suit)?\n\nThis mystery staff/manager/ was not only friends with our waiter Mariano, but he must be pretty high up in the Trattoria Pinocchio world.  He waltzed through the restaurant from the kitchen area, to behind the bar tasting various draft beers then back to the front door to hang out with Mariano all the while twirling his white earbuds. Walking past tables and waitstaff with about a foot of his earbud cord twirling and swinging it around.\n\nI could go on and but typing this review and reliving the awful experience is exhausting.\nBottom line is that the next time in San Francisco I will find another Italian restaurant to spend my time and money at. Never again will we return or recommend this place.", "rating": 1, "date": "2015-07-07"}, {"excerpts": ["Highly recommend the salmon fettuccine and bruschetta."], "author": "Kellie B.", "review": "Have been coming here for 15 years with my husband.  Great food and wonderful service.  Highly recommend the salmon fettuccine and bruschetta.", "rating": 5, "date": "2017-03-17"}, {"excerpts": ["We had the bruschetta, omg so good. ", "Service was excellent too!  ", "Wish we lived close, we'd probably be here once a week"], "author": "Jill S.", "review": "At our table, we had lasagna, gnocchi, and eggplant Parmesan. All of us declared our food excellent! We had the bruschetta, omg so good. Service was excellent too!  Wish we lived close, we'd probably be here once a week", "rating": 5, "date": "2015-08-24"}, {"excerpts": ["That being said, they make a mean lemon drop and the bruschetta is fab. ", ": I'd go back for a lemon drop & bruschetta happy hour, but only if I had plenty of time on my hands."], "author": "Ashley P.", "review": "Don't come here if you're in a hurry. Service was slow, which would've been okay except that we had a show to catch. \n\nThat being said, they make a mean lemon drop and the bruschetta is fab. I got the chicken piccata and thought it was really good, while hubby's spaghetti & meatballs were \"just alright\" (his words; I didn't try it). \n\nOur server and busser were really friendly, plus is was nice that we got a seat outside (under the heat lamp) so we could people-watch. It's just a shame that we had to wait so long for everything. \n\nBottom line: I'd go back for a lemon drop & bruschetta happy hour, but only if I had plenty of time on my hands.", "rating": 3, "date": "2013-09-29"}, {"excerpts": ["Bruschetta was very tasty, but our cappellini and caprese salad were good, but overall an average experience."], "author": "Brian G.", "review": "Service was pleasant and attentive.  Al fresco seating was nice to people watch and a heater to take away the chill.  Bruschetta was very tasty, but our cappellini and caprese salad were good, but overall an average experience.", "rating": 3, "date": "2015-06-06"}, {"excerpts": ["Only caveat is that it might be hard to share with 3+ people because the portions of each element are limited - 2 pieces of tomato, basil, mozzarella and one piece of bruschetta, for example. ", "Also ordered a pizza, which was forgettable. ", "Rather greasy and not especially flavorful. ", "The service itself was great and the atmosphere was fresh. ", "If you want excellent pizza though, head to Golden Boy."], "author": "Rob E.", "review": "Great service, okay food. Out-of-town visitors wanted some Italian food on a Saturday afternoon so we stopped in. Antipasti was good and presented as a shareable portion. Only caveat is that it might be hard to share with 3+ people because the portions of each element are limited - 2 pieces of tomato, basil, mozzarella and one piece of bruschetta, for example. Also ordered a pizza, which was forgettable. Rather greasy and not especially flavorful. The service itself was great and the atmosphere was fresh. If you want excellent pizza though, head to Golden Boy.", "rating": 3, "date": "2015-06-28"}, {"excerpts": ["The Bruschetta is a must and the Antipasto Italiano is perfect to share between you and three friends. \n\n"], "author": "Mike V.", "review": "As an Italian I tend to avoid Italian restaurants, but I go here several times a year and highly recommend this restaurant for appetizers and their wine selection. The Bruschetta is a must and the Antipasto Italiano is perfect to share between you and three friends. \n\nThe service is excellent and the appetizers are more than filling. If you aren't starving, avoid trying to tackle an entree solo. \n\nHowever, IF you are feeling brave, I've never been disappointed with the gnocchi or any pasta smothered in a pink sauce. \n\nUsing the words of the Most Interesting Man in the World....\"I don't always choose [Italian], but when I do, I choose [Pinocchio].\"", "rating": 4, "date": "2010-01-04"}, {"excerpts": ["The bruschetta was amazing. ", "My gnocchi in a gogonzola sause  ", "(Enzo's Gnocchi) was first-rate. "], "author": "Gus V.", "review": "It is nice to see a favorite restaurant continue to perform year after year. I first visited Trattoria Pinocchio in 2008 and for the next couple of years, ate here 4 or 5 times a year. It was my go-to-place when visiting San Francisco on business for classic Italian food. It never disappointed with traditional pastas and veals. \n\nWhile there was plenty of tables, one reason I liked it is that I was often traveling alone and the bar was a convenient place to have a great meal while watching TV.\n\nI returned last week and it everything was still excellent. The bruschetta was amazing. My gnocchi in a gogonzola sause  (Enzo's Gnocchi) was first-rate. The proscioutto in melon was just OK (melon was under-ripe). \n\nBut the service was impeccable and considering the part of town, the price is reasonable. I'm certain I'll return on my next visit to SF.", "rating": 4, "date": "2014-07-27"}, {"excerpts": ["We started with the bruschetta, which was nothing short of amazing!  ", "It's so simple, but yet so complex.  ", "The rest of the meal was equally amazing.  ", "The bread was great.  "], "author": "Dave S.", "review": "Ok, to be fair I ate here about 3 months ago and don't recall which entree I had.  All I remember was that it was the best Italian food I've ever eaten, period!  We had been wandering around Chinatown, but didn't want Chinese food, so we started looking at menus and this spot looked the best.\n\nWe started with the bruschetta, which was nothing short of amazing!  It's so simple, but yet so complex.  The rest of the meal was equally amazing.  The bread was great.  All three entrees were amazing.\n\nIn looking at other reviews, people don't seem to like the servers; are they serious? They are joking around.  Don't you get it?  Do you like stuffy, boring people?  These folks aren't egotistical, they are just fun.  \n\nThe only Italian place that comes close to this in quality/value is Bizzarro Italian Cafe in Seattle.\n\nParking was remote, but that's SF.  \n\nWe're going back in few weeks and I can't wait!", "rating": 5, "date": "2011-07-03"}, {"excerpts": ["Yummy bruschetta too. "], "author": "Natasha D.", "review": "Food = amazing!\n\nMy mom and I were roaming through Little Italy and could not decide what place to eat.  I was going to skip this place and go for another but somehow we ended up eating here.\n\nI loved the garlic in all the food we ordered - very tasty to say the least. Yummy bruschetta too. My mom usually doesn't like Italian and she even liked this place.\n\nIt was a bit pricey, but really enjoyed the food (we went for lunch so it was a very relaxed meal) and everyone was friendly.", "rating": 5, "date": "2012-01-16"}, {"excerpts": ["My group of 5 scarfed down the calamari and bruschetta\n\nGnocchi was delicious!\n\n"], "author": "Dana S.", "review": "My group of 5 scarfed down the calamari and bruschetta\n\nGnocchi was delicious!\n\nRelatively empty on a Sunday afternoon. \n\nOverall, great!", "rating": 4, "date": "2012-01-30"}, {"excerpts": ["Appetizer of Bruschetta. "], "author": "Lori B.", "review": "Perfect place to sit outside in bustling North Beach and enjoy some pasta & wine. Our waiter was a cool, older Italian man that had that awesome Italian accent. So heavy, I could only understand about every 3rd word. He was great and made the meal more enjoyable. Aside from our perfect seating situation & service, the food was also delectable. \n\nAppetizer of Bruschetta. Hard to screw up yes, but this tasted so much fresher than most Bruschettas. \n\nEntree #1 ~ Butternut Squash Ravioli. One of my favorite pasta dishes and this didn't disappoint. The pasta was a little al dente which I'm a big fan of. \n\nEntree #2 ~ Orange & Black Ravioli stuffed with Lobster & Crab. My husband LOVED it. And it didn't hurt to have a dish that honored our world champion Giants!!\n\nWe had so many Italian food options in North Beach but we feel like we chose wisely. It was a nice end to our Giant's Victory Parade adventure in S.F.", "rating": 4, "date": "2010-11-04"}, {"excerpts": ["Today we came here for a working lunch; we ordered:\n\nFor appetizers, the boss ordered Calamari Fritti, Bruschetta, and Insalata Caprese.  "], "author": "Michael O.", "review": "We had a very sweet, very gay, Northern Italian waiter.  The best kind of waiter, in my view (... ok, except for Noel at Slanted Door)!\n\nToday we came here for a working lunch; we ordered:\n\nFor appetizers, the boss ordered Calamari Fritti, Bruschetta, and Insalata Caprese.  Our lunch entrees were Penne Arrabbiata, Lasagna Francesco, Linguine Calamari, Linguine al Pesto (now that looked very good - I'll be trying that next time!), Scampi Saut (which I had - Yu-UMMY!!!!!), and Chicken Parmigiana.\n\nThe prices range from $12 for pasta dishes all the way up to $22 for a filet mignon.\n\nI don't have a big problem with these prices, but I almost took one star off for the tactless little blip at the bottom of the menu \"Minimum 1 order per person\".  Does this mean I can't bring my sweetie in here and share an appetizer?  We both have to order one in order to be allowed to eat here?\n\nNow, that, my fellow yelpers, is simply poor form.\n\nI love our working lunches; we always wind up talking about the weirdest things (strip clubs, ex's, weird 3rd world countries ... random stuff)!", "rating": 4, "date": "2006-08-04"}, {"excerpts": ["The Bruschetta was really good here, great flavor."], "author": "Nhung T.", "review": "I like this place because it had outdoor seating. The service here was okay, but one of the waiter was pretty funny. I ended up ordering the Linguine del Pescatore, it came with mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce. The dish was very light and had a great flavor to it. The noodles was made aI dente, which I like. I thought the dish was a little bit bland, but if you add some parmesan cheese and pepper flakes it makes it a little better (dish was $23).\n\nThe Bruschetta was really good here, great flavor.", "rating": 3, "date": "2011-04-07"}, {"excerpts": ["The bruschetta was actually tasty. ", "Our service was adequate. ", "We were attracted by the quiet ambiance of the place after a long busy day, but unfortunately even that didn't pan out thanks to the obnoxious singing maitre ", "d. ", "All in all, a waste of money."], "author": "E S.", "review": "The gnocchi was disappointing and overpriced, like eating pillows of boiled mush. Olive appetizer was similarly overpriced, consisting more of lettuce than olives. The bruschetta was actually tasty. Our service was adequate. We were attracted by the quiet ambiance of the place after a long busy day, but unfortunately even that didn't pan out thanks to the obnoxious singing maitre d. All in all, a waste of money.", "rating": 2, "date": "2015-05-17"}, {"excerpts": ["We enjoyed Bruschetta, Insalata Cesare, Fettucine con ", "Pollo, Ravioli di Vitello, Dungeness Crab ", "w/pasta,   \n", "The Owner is delightful.  "], "author": "Mary lynn R.", "review": "Trattoria Pinocchio\n\nWe were greeted by the hostess and opted for outside seating which was comfortable and had a feeling of warmth.   The atmosphere was charming along with the music and we felt as if we were back in Italy.   Our waiter was the \"Silver Fox\" and he was not only personable, but his service was outstanding, along with the other wait staff.  He recommended a few of our dishes and was spot on.  We enjoyed Bruschetta, Insalata Cesare, Fettucine con Pollo, Ravioli di Vitello, Dungeness Crab w/pasta,   \nThe Owner is delightful.  He walks around singing and welcomes everyone as if they were at his home for dinner. \n\nTry Trattoria Pinocchio and you will not be disappointed!", "rating": 5, "date": "2011-12-18"}, {"excerpts": ["Highly recommend the bruschetta to start with.  ", "Seafood linguine as an entree.  "], "author": "Michael B.", "review": "Amazing!\n\nHighly recommend the bruschetta to start with.  Seafood linguine as an entree.  And the cannolii for dessert.\n\nGreat atmosphere.  Great service.  \n\nI think the Little Italy area in San Fran is amazing an this place is a great find.", "rating": 4, "date": "2010-05-15"}, {"excerpts": ["We sat outside on the sidewalk, enjoyed a glass of wine and order an appetizer of Bruschetta.  ", "The tomatoes were still firm and mixed perfectly with the garlic and olive oil, ", "one of my biggest let downs it ", "soggy tomatoes in bruschetta.  ", "I ordered the lasagna with veal and my mom had Cappellini al Pomodoro.  "], "author": "Kristen B.", "review": "First came here by accident while I was in town for work, I was walking around looking for another restaurants that I couldn't find and ended up here.  Thank god I did, I was alone so I sat at the bar and chatted with the bartender for a bit before ordering. \n\nI settled on the Spaghetti alla Carbonara with a glass of house red wine.  The dish was fresh and very creamy.  The peas were not soggy or dried out like I have had at other restaurants and the pancetta was perfect.  I was full and delighted as I made my way back to the hotel for the evening.  \n\nThe second time I came I had been living here for a couple months and was so excited to finally get to take some else here.  I brought my mom here for an afternoon lunch on Friday in November.  We sat outside on the sidewalk, enjoyed a glass of wine and order an appetizer of Bruschetta.  The tomatoes were still firm and mixed perfectly with the garlic and olive oil, one of my biggest let downs it soggy tomatoes in bruschetta.  I ordered the lasagna with veal and my mom had Cappellini al Pomodoro.  Both dishes were cooked to perfection with plenty of leftovers for later that day. \n\nI cannot wait to go back here again and try another dish!", "rating": 4, "date": "2010-05-23"}, {"excerpts": ["This restaurant even offers a generous serving of bruschetta and butter cubes to start with. ", "We were so full at the end of the meal and decided to skip dessert. "], "author": "Divya K.", "review": "Great little gem in North Beach! After walking down the streets of little Italy for a while we stumbled upon this place. What attracted us to it was the large selection of pasta, some with white sauce  which we absolutely adore. There was a 45 minute wait when we got inside -- they made us sit at the bar which wasn't bad;-). We had a vegetariano pizza and gnocchi. The gnocchi was just out of this world -- it was delicious, the sauce was thick and creamy and the gnocchi itself was succulent. \n\nThe pizza tasted so good -- it came with fresh vegetables and herbs. This restaurant even offers a generous serving of bruschetta and butter cubes to start with. We were so full at the end of the meal and decided to skip dessert. We can't wait to bring family over the next time we are in the area. \n\nAmbiance is lovely. The seating is comfortable . Mostly suited for a couple or a small party because of it's size.", "rating": 4, "date": "2010-05-22"}, {"excerpts": ["Bruschetta is one of the best in the city, and we have tried a lot. ", "Not always the best service but the ambiance and food certainly make up for it. ", "Highly recommended for lunch and for dinner."], "author": "Brittany A.", "review": "A wonderful place in North Beach with a wide menu to satify! Bruschetta is one of the best in the city, and we have tried a lot. Not always the best service but the ambiance and food certainly make up for it. Highly recommended for lunch and for dinner.", "rating": 4, "date": "2012-11-28"}, {"excerpts": ["While you wait for your entree, try the bruschetta. "], "author": "Alex C.", "review": "I went into this place with heavy skepticism and left thoroughly impressed. At first glance it seems like a magnet for douchebags looking for a pseudo-upscale meal. Well, maybe it is... but I didn't really care once their wait-staff seated us and paid careful attention to us the whole night.\n\nWhile you wait for your entree, try the bruschetta. Afterwards, go with the tiramisu for dessert.\n\nTrattoria Pinocchio features great food, impressive portions, reasonable prices and very friendly service... what's missing? Nothing if you ask me.\n\nI've been trying to not give out as many 5 star ratings, but I just can't find anything to complain about with this place. It's even close to a cheap parking garage!", "rating": 5, "date": "2006-11-01"}, {"excerpts": ["When he delivered our drinks he took our food order we ordered the bruschetta and the mushrooms for appetizers. ", "They took 17 minutes to come out ", "they are pretty brainless dishes it should maybe take 10 minutes. ", "The bruschetta was ok but the mushrooms were disgusting COVERED like I've never tasted with balsamic vinegar. \n\n"], "author": "Samantha T.", "review": "If i could give it a half star I would, it truly was that bad. I eat out a lot and I used to be a server so I understand that sometimes being a server is difficult but in this instance there was no excuse. \n\nWe had made a reservation for 8:30 and arrived at 8:37 and they did not have our table ready. So the hostess asked us if we could wait outside at one of the tables until they did get our table ready. We all sat outside for about 5 minutes until the hostess came outside and asked us if we could move out of the table so she could sit another party at the table even though A. she asked us to sit there and B. there was another table empty right next to us. I was very shocked.\n\nFinally 10 minutes after we arrived we were seated(even though we had a reservation). Once we sat down it took another 8 minutes just for us to be greeted by and our server who had already  walked by us twice without a word. When he finally came to the table he still didn't really greet us no name or anything just asked us what we wanted to drink. \n\nFrom the time we placed our drinks to the time our drinks arrived took 9 minutes (yes i timed it i don't usually but with such a bad start i felt that i needed to). The drinks were all ordered with expensive liquor and all poured with cheap liquor. Two of my friends out of five of us actually enjoyed there drinks but the rest of us were not impressed at all. Twenty minutes after we were seated at the table bread was delivered to the table. Yeah the stuff that should be dropped off 2 minutes after you are seated with the waters which we had to ask for. \n\nWhen he delivered our drinks he took our food order we ordered the bruschetta and the mushrooms for appetizers. They took 17 minutes to come out they are pretty brainless dishes it should maybe take 10 minutes. The bruschetta was ok but the mushrooms were disgusting COVERED like I've never tasted with balsamic vinegar. \n\nWhile we were waiting for our entrees to come out I made the mistake of going to the restroom, the ladies room was semi clean but their was no toilet paper and I was told the mens room was really awful.  Also while i was standing in line to wait for the one-person bathroom i watched one of the cooks pick up a chip dip it in salsa eat it then resume right back to work. Did not wash his hands didn't even wipe them off on his pants.\n\nWhen our entrees finally arrived 22 minutes after our appetizers they were definitely not worth the wait. For one thing my friends risotto was seen sitting under the lamp for at least 10 minutes. YUCK. I tried her risotto and even if it had been warm it would have tasted gross I can't even describe the taste but it wasn't a good one. I split the manicotti with my b/f it was ok but for an italian restaurant i expected better. The gnocci was actually pretty good I mean i guess they finally got something right. \n\nOverall the service food and drinks were awful. The only thing giving them one star is first i can't give them a half of a star which would only be for the gnocci because everything else was horrible.", "rating": 1, "date": "2009-03-29"}, {"excerpts": ["My friends have gotten chicken parm, bruschetta, and several pizzas. ", "So far the food has always been good. \n", "Service can be a little cheesy, especially when we ordered a bottle of wine and the server insisted we order the \"better bottle\" of the chianti. ", "We politely decline and sucked down our cheap bottle happily. \n", "Kinda touristy location so be careful of the people walking around trying to sell balloons and shit. ", "They won't go away even when you tell them to."], "author": "Jamie G.", "review": "If you want some delicious heart attack pasta order the gnocchi gorgonzola. It is so good except bring some Mylanta, yikes. The gnocchi is the reason for the 4 stars. Super, super delicious.\nMy friends have gotten chicken parm, bruschetta, and several pizzas. So far the food has always been good. \nService can be a little cheesy, especially when we ordered a bottle of wine and the server insisted we order the \"better bottle\" of the chianti. We politely decline and sucked down our cheap bottle happily. \nKinda touristy location so be careful of the people walking around trying to sell balloons and shit. They won't go away even when you tell them to.", "rating": 4, "date": "2007-04-20"}, {"excerpts": ["The bruschetta was burnt and even that was bland.  \n\n"], "author": "Jennifer E.", "review": "Bleh.  I took my kids here because they liked the open windows.  We all ended up regretting passing by several better choices.  The food was expensive and ridiculously bland.  We had the lentil soup from the specials menu, and it tasted like wet beans- not a speck of salt or any other seasoning I could detect.  The bruschetta was burnt and even that was bland.  \n\nWorst was the $20 plate of risotto, full of raw carrots and stringy asparagus.  Worse than bland- this dish was simply disgusting, and not one person at the table would eat more than a bite.  The staff was apathetic and paid us bare attention, even though there was only one other party in the restaurant.\n\nWhen we tried to pay the bill, we discovered they were having trouble running credit cards- something they'd never mentioned.  They left us sitting for over twenty minutes, trying to run cards, until I finally ended up walking two blocks to an ATM just so I could get out of there.  \n\nThis is the first time I've ever left a restaurant and headed directly to another, so we could actually eat something edible.", "rating": 1, "date": "2008-07-29"}, {"excerpts": ["We ordered the bruschetta, veal lasagna and meat tortellini in the walnut cream sauce. ", "The bruschetta was awesome. ", "A great balance of flavors--the crispness of the crust, the freshness of the tomatoes and the basil. ", "The lasagna was delicious. ", "It came drenched in a delicious meat sauce. ", "It was a hearty portion which was great because I was hungry. ", "I also had a bite of my boyfriend's tortellini. ", "I thought it was okay. ", "He was not a fan. "], "author": "Valerie C.", "review": "I definitely like this place. My first time here was for a large group dinner in December 2005 for my friend's bachelorette dinner. Everyone was pleased with the food and drinks. I think I ordered a pasta in a gorgonzola cream sauce which was amazing. \n\nI had dinner here last night with my boyfriend after the North Beach Festival. We ordered the bruschetta, veal lasagna and meat tortellini in the walnut cream sauce. The bruschetta was awesome. A great balance of flavors--the crispness of the crust, the freshness of the tomatoes and the basil. The lasagna was delicious. It came drenched in a delicious meat sauce. It was a hearty portion which was great because I was hungry. I also had a bite of my boyfriend's tortellini. I thought it was okay. He was not a fan. I think the walnut cream sauce sounded better than it actually was. \n\nWe will definitely be back but the next time I'll suggest he go with the gorgonzola cream sauce.", "rating": 4, "date": "2009-06-14"}, {"excerpts": ["We started with Bruschetta and some red wine (of course!). ", "Mmm-mmm. ", "Good appetizer. ", "In fact, everything was good - the only thing stopping me from giving it 5 stars was that I think I ordered the blandest dish: Ravioli Pomodoro (Spinach/Ricotta). ", "It was good, but not to die for. "], "author": "Amie S.", "review": "We had wanted to have some North Beach Italian for dinner all weekend - I was skeptical about this place because of the location and name, but the high ratings on Urban Spoon, the fact that we were tired and STARVING and that it wasn't super crowded drove us in here for dinner. \n\nWe started with Bruschetta and some red wine (of course!). Mmm-mmm. Good appetizer. In fact, everything was good - the only thing stopping me from giving it 5 stars was that I think I ordered the blandest dish: Ravioli Pomodoro (Spinach/Ricotta). It was good, but not to die for. However, I had some bites of my friends' Fettuccine Pollo Alfredo and the special w/Sausage and they were both SO TASTY. \n\nAfter dinner, the waiter brought us all complimentary Limoncello (SCORE!), and we ordered 1each of the deserts. The tiramisu was great, the creme brulee was yummy - but the best was the poached pears in DARK CHOCOLATE SAUCE. Omg. Why have I never ordered these before??? They were amazing. \n\nI'm marking this as a good dinner place in SF - there were a lot of restaurants around the area that looked cheesy/touristy, but this one proved itself to be better than its name.", "rating": 4, "date": "2008-07-31"}, {"excerpts": ["Oh, and you MUST try the bruschetta(?) appetizer, i swear it might've even been better than the pasta, so packed with flavor! ", "Anyone complaining about Michele the silver fox (the hilarious waiter) needs to leave because you obviously haven't met many italian men. ", "They're loud, outgoing, flirty, and fun! ", "The moms loved him, he's so nice and made us all laugh on several occasions. ", "He treats you like family by making you feel comfortable. ", "Obviously some people are too uptight and need to learn let loose and have fun. ", "When we left, he hugged us all and kissed our cheeks the italian way, waved and said, \"ciao bella!\" ", "Don't walk past this place, go inside, i tell you!"], "author": "Brooke S.", "review": "The family and i came here hungry on a day walking around china town. We knew it would be good when they had people outside the place trying to entice you inside (that's how it works in NYC). Mom got the lemon chicken, which was really delicious.what can i say?  im a sucker for capers. I got the ravioli. They sound plain but theyre cooked perfectly, the stuffing is just...magical. We come here whenever there's a special occasion to celebrate. Oh, and you MUST try the bruschetta(?) appetizer, i swear it might've even been better than the pasta, so packed with flavor! Anyone complaining about Michele the silver fox (the hilarious waiter) needs to leave because you obviously haven't met many italian men. They're loud, outgoing, flirty, and fun! The moms loved him, he's so nice and made us all laugh on several occasions. He treats you like family by making you feel comfortable. Obviously some people are too uptight and need to learn let loose and have fun. When we left, he hugged us all and kissed our cheeks the italian way, waved and said, \"ciao bella!\" Don't walk past this place, go inside, i tell you!", "rating": 5, "date": "2011-07-02"}, {"excerpts": ["We ordered two glasses of wine and the bruschetta. ", "The wine was ok, the bruschetta never came. ", "We already had our main course when we told the server (and also told him no worries), he shrugged it off and didn't even apologize. "], "author": "Ryan W.", "review": "I'm easy to please when it comes to dining, and I waited tables for five years, so I'm super understanding of the plight of servers. \n\nThat being said, this place was really disappointing--both the food and the service. My wife and I chose this on a whim (without consulting Yelp! ... oops) after we found that Sotto Mare is closed Sundays.\n\nWe ordered two glasses of wine and the bruschetta. The wine was ok, the bruschetta never came. We already had our main course when we told the server (and also told him no worries), he shrugged it off and didn't even apologize. Not that we needed or wanted one, but at least some acknowledgment would have been nice.\n\nMy wife got the Pescatore, and for the the first time in her life, she sent a dish back to the kitchen. I tried it, and not only did it taste bad, but the sauce was watery and the seafood was all cooked poorly. When we politely asked the server to take it back, he just grabbed it off the table and didn't even ask if she would like anything else to eat, nor did he seem to care that she was not satisfied with her dish.\n\nI was feeling simple and ordered the fettucini alfredo with chicken. It was ok. Not great. Not terrible. Hard to mess up that dish. \n\nAfter the meal, the server did not even acknowledge any of the missteps of the meal. He brought us our check and ran off. Luckily, we were eager to get out of there.\n\nAgain, we are not picky diners. We are not demanding. We even laughed this experience off and were not really mad. We left and went right next door to Caffe Puccini and had a wonderful meal with good service with a much smaller tab.\n\nIf you are in North Beach, don't eat at Trattoria Pinocchio. There are much better places to eat and have a nice dining experience.", "rating": 1, "date": "2009-09-07"}, {"excerpts": ["We also ordered the calamari and bruschetta.  ", "They both were average.  ", "Two glasses of wine, bruschetta, spaghetti with bolognese and tiramisu = $52.00.\n", "Overall: Average Italian experience.  ", "If I was to return, I will definitely order something different.  ", "There were other items on the menu that sounded great, but I was just in the mood for some spaghetti with bolognese sauce."], "author": "T P.", "review": "I came here on a Tuesday evening with two co-workers during a medical conference.  Surprisingly, it wasn pretty vacant.  I was expecting an amazing experience as I read great reviews in magazines and on yelp. Here is my feedback:\nService: very great, responsive.  My co-worker drinks a lot of water and they made the best effort to re-fill his glass.  \nAmbience: average.  We had a table by the window which became distracting with the pedestrians and cars.  Our table was next to the bar.\nFood: average.  My co-worker and I ordered the spaghetti with bolegnese sauce.  We both thought it was ok.  We also ordered the calamari and bruschetta.  They both were average.  The tiramisu, on the otherhand, was well made.  I would recommend ordering this!\nPrice: Two glasses of wine, bruschetta, spaghetti with bolognese and tiramisu = $52.00.\nOverall: Average Italian experience.  If I was to return, I will definitely order something different.  There were other items on the menu that sounded great, but I was just in the mood for some spaghetti with bolognese sauce.", "rating": 3, "date": "2011-09-14"}, {"excerpts": ["Our bruschetta came shortly after we ordered it ", "and it was amazing ", "I'm a self proclaimed bruschetta connoisseur, and it was almost perfection. "], "author": "Anna F.", "review": "Went here with the parents last weekend. (President's weekend so tourists out numbered locals 5-1) Walked in around 7:45 on Saturday night. Hostess told us a 10 minute wait. We ended up waiting about 25 minutes, but I've been a hostess, I know how it goes. No harm no foul. \n\nAs soon as we sat down we were given water bread and our drink order taken. My Mom ordered a wine she hadn't heard of but the waiter (hot Italian straight off the boat) had suggested a full bodied Cab. Well Mom didn't like it, she said it was fine when asked, but after the waiter noticed she hadn't drunk any he brought a new glass of wine on his own. Glass of wine #2 a hit! A very good sign of a very good waiter. \n\nOur bruschetta came shortly after we ordered it and it was amazing I'm a self proclaimed bruschetta connoisseur, and it was almost perfection. Then out of nowhere our waiter brought a complimentary insalata caprese without any real explanation, just that it was on the house. In my head I thought this was because said hot Italian waiter was preparing to ask for my hand in marriage and was preparing my parents for the question...Anyhow the gesture was much appreciated. Our main courses came. Pops had the lasagna Francesco, second only to Grandma's. Mom had the zuppa del minestrone, best I've had in my young life. I had the Penne Vodka, which had bacon in it...I've experienced this before in some Vodka sauces but normally it says that on the menu.  I moved around the bacon pieces and the penne ended up being very good. Peroni on tap, YAY!!\n\nGreat old school/old world service and food. I will defiantly be back.", "rating": 4, "date": "2008-02-20"}, {"excerpts": ["Like Stephanie P., I highly recommend the bruschetta--delicious!"], "author": "Nicole R.", "review": "I love this place. I was walking by yesterday and decided to go in, pretty much because this adorable Italian man kept telling me I should go in, so finally my friend and I went in.\nThe food was great as was the service. I think it's a really good place for a large group or  a few people.\n\nLike Stephanie P., I highly recommend the bruschetta--delicious!", "rating": 5, "date": "2007-01-06"}, {"excerpts": ["We ordered the antipasta platter which was the perfect amount of cured meats, cheeses, veggies, bruschetta, etc.  ", "A couple beers later, a satiated belly and we were off.  \n", "All in all, this place is a reasonable little stop off for a quick bite and a drink.  ", "One could say the service was a tad slow ", "but my beer was never empty and the bread basket always full, so ", "I'm not going to."], "author": "Mike F.", "review": "So we're in North Beach, we were hungry but not enough for a full meal, and it was five o'clock somewhere in the world which means I'm getting a beer.  Figured it was a nice day, sit outside and people watch while getting drunk and stuffing our faces.  We ordered the antipasta platter which was the perfect amount of cured meats, cheeses, veggies, bruschetta, etc.  A couple beers later, a satiated belly and we were off.  \nAll in all, this place is a reasonable little stop off for a quick bite and a drink.  One could say the service was a tad slow but my beer was never empty and the bread basket always full, so I'm not going to.", "rating": 4, "date": "2007-02-03"}, {"excerpts": ["And incredible bruschetta, topped with tons of sweet sweet tomatoes!"], "author": "Stephanie P.", "review": "OK prices, very nice waitstaff.  And incredible bruschetta, topped with tons of sweet sweet tomatoes!", "rating": 3, "date": "2005-04-14"}, {"excerpts": ["Bruschetta (very garlicky, very good but soggy), Chicken al Limone (great!), Pollo Alfredo (mediocre), Osso Bucco (slightly above average), Caesar Salad (pretty good). ", "Prices are pretty reasonable, I think, for North Beach. ", "They did however mess up our order, and they're pretty stingy with the bread on take-outs."], "author": "Rohan N.", "review": "Got some dishes for takeout. Bruschetta (very garlicky, very good but soggy), Chicken al Limone (great!), Pollo Alfredo (mediocre), Osso Bucco (slightly above average), Caesar Salad (pretty good). Prices are pretty reasonable, I think, for North Beach. They did however mess up our order, and they're pretty stingy with the bread on take-outs.", "rating": 3, "date": "2008-10-01"}, {"excerpts": ["Bruschetta was amazing and different then other restaruant.....  ", "Pasta were good ", "and so ws their Veil...  ", "I would highly recemond this place, great to visit with family and friendly....."], "author": "Aman v.", "review": "We went to this place last night....  It was great...  We wee greated warmly by the hostes...  Our server was very friendly and nice guy,,, He recemoded us some good choices...  Their Appitsers, and Main course were excellent..  Bruschetta was amazing and different then other restaruant.....  Pasta were good and so ws their Veil...  I would highly recemond this place, great to visit with family and friendly.....", "rating": 5, "date": "2008-08-07"}], "piatto di formaggi": [{"excerpts": ["We started with an appetizer Piatto di Formaggi\n(parmesean & gorgonzola cheese with pear & walnuts.) "], "author": "Dianne S.", "review": "My husband and had a great dining experience at this restaurant.  The service and food was just wonderful!\n\nWe started with an appetizer Piatto di Formaggi\n(parmesean & gorgonzola cheese with pear & walnuts.) This nice and light.\n\nI had Fettucine con Pollo (house made fresh fettuccine, sautéed chicken & vegetables in an Alfredo cream sauce.)  The sauce was creamy (thin) and flavorful... just superb!!!  \n\nMy husband had Linguine del Pescatore\n(mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce.)  \n\nWe would definitely recommend this restaurant.", "rating": 4, "date": "2016-01-16"}], "prosciutto e melone": [], "carpaccio": [{"excerpts": ["Carpaccio - Another winning appetizer. ", "beef sliced super thin with arugula, capers and bread and shaved cheese. "], "author": "Anthony L.", "review": "Let me start by saying I love this restaurant. While living in the SF Bay Area my wife and I would go here every Sunday for lunch and many times for dinner as well. The food is absolutely delicious and the service is wonderful as well. My favorite waiter is Antonio who has worked there for a while. Certain pastas are made fresh daily such as the gnocchi, tagliatelle and ravioli. \n\nGnocchi Enzo - One of my all time favorite dishes. Fresh homemade gnocchi in a gorgonzola cheese sauce. The sauces in this place have amazing flavor and the gnocchi literally melts in your mouth since it's made fresh. \n\nPenne Amatriciana - Their Amatriciana sauce is very different then other Amatriciana sauces I have had at Bay Area restaurants. The flavor is spectacular ! The pasta was cooked al dente which is the way it should be done. So may Italian restaurants in America and Americans in general seem to like their pasta overcooked. Try this dish and you will be addicted.\n\nButternut Squash Ravioli in cream sauce - The butternut ravioli is sometimes on the special menu and it is delicious. the ravioli is homemade and very fresh. The difference between boxed and homemade pasta is huge. There is no substitute for fresh pasta made daily. \n\nPasta Festa - Also on the special menu from time to time. My wife hade this meal and the pasta was tagliatelle with a cream sauce and seafood. It was delicious and the portions were huge as well.\n\nProsciuotto and Melone - I have started my meals frequently with this appetizer. The melon is always fresh and the prosciutto always top quality. The perfect balance between salt and potassium. Great flavor. Salt raises the blood pressure and potassium from the melon keep the blood pressure in check. This is a nice, fresh, cold appetizer.\n\nI miss San Francisco and this restaurant especially along with Trattoria La Siciliana. two of my favorite haunts. When I die I plan on haunting this place and stealing pasta from patrons' dishes lol. You can't go wrong with any of the food here. Prices are higher for some dishes but the pastas are made fresh and I would imagine the rents in North Beach are quite high.\n\nCarpaccio - Another winning appetizer. beef sliced super thin with arugula, capers and bread and shaved cheese. The flavor is great when you put them all together.\n\nPanini Sandwiches - If you choose any of the Panini sandwiches you can't go wrong. My wife and I have tried the veggie, chicken, prosciutto & Mozzarella and the Italian sausage and they were all delicious. They know food in this place.", "rating": 5, "date": "2016-01-30"}, {"excerpts": ["Carpaccio was sliced too thick but tasted fine.  ", "Bad Service from a forgetful waiter and cold food equals 2 stars.  ", "I should knock another star off for their automatic addition of gratuity for a party of 3!?? ", "And the kicker...gratuity is taxed...", "A bit ridiculous!"], "author": "Twinnie T.", "review": "Service was slow, bread was cold, ravioli was ok...It was good that I was able to taste the crab stuffing but it came warm, I was hoping for HOT food.  Carpaccio was sliced too thick but tasted fine.  Bad Service from a forgetful waiter and cold food equals 2 stars.  I should knock another star off for their automatic addition of gratuity for a party of 3!?? And the kicker...gratuity is taxed...A bit ridiculous!", "rating": 2, "date": "2016-05-23"}, {"excerpts": ["We ordered carpaccio for appetizers. ", "They were great. ", "I order d the veal piccata which was cooked to perfection, some of the others ordered pesto gnocchi, chicken saltimbocca and the chicken limone. ", "All of us thought the food was excellent. "], "author": "Shyam R.", "review": "Went as a part of a large group. The waiter was very attentive and warm! Food is great here- Fresh ingredients. We ordered carpaccio for appetizers. They were great. I order d the veal piccata which was cooked to perfection, some of the others ordered pesto gnocchi, chicken saltimbocca and the chicken limone. All of us thought the food was excellent. For dessert we ordered tiramisu and Spumoni ice cream. The tiramisu was 'beh' but the spumoni ice cream was DELICIOUS! \n\nOverall a good restaurant at North Beach to eat at. The wait time for food could be improved- but I understand it's an Italian thing!", "rating": 4, "date": "2015-06-06"}, {"excerpts": ["We ordered the carpaccio appetizer to share, it was seasoned perfectly. ", "For dinner I ordered linguine with clams and mussels, mom ordered the carbonara, and my sister ordered linguine with pesto. ", "All were delicious! ", "The portions were big, all three of us had to get to-go boxes. "], "author": "Lisa A.", "review": "My mom, sister and I had a wonderful dinner here tonight! I'm not sure why so many reviews mention poor service, because ours was excellent. I felt like our server was genuinely happy that we were there.\n\nWe ordered the carpaccio appetizer to share, it was seasoned perfectly. For dinner I ordered linguine with clams and mussels, mom ordered the carbonara, and my sister ordered linguine with pesto. All were delicious! The portions were big, all three of us had to get to-go boxes. I appreciated that our server recommended I try the linguine with mussels instead of the linguine with calamari that I originally ordered; it showed he cared about us having a nice meal. \n\nWe had a great time and would definitely go back.", "rating": 4, "date": "2014-09-16"}, {"excerpts": ["Carpaccio and a fig, goat cheese specialty antipasto. ", "Delicious!  ", "They use quality ingredients.....wonderful garlicky capers and olives, mild but tasty prosciutto. ", "Apparently they make their own pasta and we are planning to come back for a full dinner at our next visit."], "author": "Dominique S.", "review": "Loved the food here. We had cocktails and two appetizers before going to a show. Carpaccio and a fig, goat cheese specialty antipasto. Delicious!  They use quality ingredients.....wonderful garlicky capers and olives, mild but tasty prosciutto. Apparently they make their own pasta and we are planning to come back for a full dinner at our next visit.", "rating": 5, "date": "2015-09-04"}, {"excerpts": ["I ordered the carpaccio and the procuitto and melon as an appetizer and I was not disappointed. ", "For dinner I order the butternut squash ravioli (Ravioli di Zucca) ", "and I absolutely loved it. ", "I will definitely be returning to try other dishes because I had a hard time deciding what I wanted when I decided to order the ravioli."], "author": "Kristina D.", "review": "This is a wonderful place to eat. I loved the service and the food. The staff were friendly. I ordered the carpaccio and the procuitto and melon as an appetizer and I was not disappointed. For dinner I order the butternut squash ravioli (Ravioli di Zucca) and I absolutely loved it. I will definitely be returning to try other dishes because I had a hard time deciding what I wanted when I decided to order the ravioli.", "rating": 5, "date": "2013-01-28"}, {"excerpts": ["We started with Carpaccio prime beef tenderloin, arugula, shaved parmigiano, capers, truffle oil & grilled bread & Margherita pizza fresh tomatoes, basil & extra virgin olive. "], "author": "Kerstin B.", "review": "How we found this Italian delight in the middle of little Italy! \n\nI took my sister and mother to San Fran for their Birthdays last April. We were on a Cable Car and asked where do the locals go for really good Italian? We were told the The Stinking Rose. My sister piped in \"oh yeah my friend at work said we should go there, it was SO good\". Without hesitation we asked for directions. We took the bus down Columbus from our hotel as far as we could go. We started walking and most of the restaurants on Columbus have outside seating. So as we are walking we can see what everyone is serving, and the smells Divine. \n\nWe walk past Trattoria Pinocchio and the food looked amazing, we stopped and glanced at the menu and thought it might be pricey for lunch. We continued on to the Stinking Rose. Mind you all of the restaurants were pretty busy. We arrived at the Rose and it was dead, the menu looked blah and the prices were the same as Trattoria Pinocchio. The icing was when another guest came out while we were looking at the menu and said \"don't eat here it's not very good\". Game over we went back up Columbus to Trattoria Pinocchio. \n\nSOOOO glad we did. \n\nWe started with Carpaccio prime beef tenderloin, arugula, shaved parmigiano, capers, truffle oil & grilled bread & Margherita pizza fresh tomatoes, basil & extra virgin olive. Delizioso! \n\nMy sister ordered a bloody mary that she demanded I try, I don't like bloody mary's now I do damn that was good! I had to get a couple of my own yes I'm on vacation people! \n\nI had the Ossobuco braised veal shank served with saffron risotto & sautéed vegetables, my taste buds love me soo. This was the best Ossobuco I have had since it was home made for me. \n\nMy sis had Tortellini alla Boscaiola meat tortellini with peas, mushrooms & prosciutto in a cream sauce. Outstanding choice. \n\nMy mother had Ravioli di Salsiccia Our house made sausage ravioli served with a porcini cream sauce. Amazing! \n\nWe all shared with each other and had a fantastic meal, we sat outside it was a beautiful day. Our fob (translation fresh off boat) Italian waiter was a shit but we didn't care the food came quickly and it was incredible. He just had a funky attitude like we were beneath him or something. That's fine we tipped accordingly. He will soon learn how you make a buck in the US. \n\nI would give it more than 5 stars but that is all they let us do on yelp! Tourist and locals....I recommend you go here you won't regret it! Most authentic Italian, more on the Sicilian side I have had in a long time. \n\nPiacere il Pasto! Enjoy the meal in Italian. lol : )", "rating": 5, "date": "2009-06-20"}, {"excerpts": ["Carpaccio\n", "* Ravioli di Vitello love love Porcini cream sauces\n", "* ", "Spagetti Puttanesca\n", "* Spaghetti alla Bolognese"], "author": "Amanda R.", "review": "At 1 time this place was my fave Italian in the City. I forget with whom it was with that I went here with the 1st time but they knocked my socks off! Their Spagetti Puttanesca began a year long love affair with this dish! It was a perfect blend of the Salty (anchovies, olives) with the acidic tomato sauce.\n\nLove their alcoholic Cappuccino's or Espresso Coretto. The best of both world's really. I'm always fighting with myself on whether to do caffeine or alcohol. Their kitchen is pretty open and it always surprises me how little Italian kitchens are and how efficient they are despite there only being 1 or 2 cooks to execute a bulky menu of items. The only bad thing that I can say about Pinocchio's is that out of all of my visits there was only 1 time when I received absent minded service. \n\nOn one of my visits I  went with my friend Rebecca and while the food was great. We waited a really long time between courses and our drinks were left unfilled. We then left without anyone noticing. It was so bad that I told my friend not to leave a tip. Atrocious I know but it was THAT bad. Embarrassingly enough my gal pal left her wallet in the restaurant and had to go back. She said that the whole staff apologized for their oversight. I guess our visit coincided with one of their long time staff members last day. So they were pre-occupied. Just an FYI. Everyone has a bad day I would still give these peeps a try if you are in North Beach.\n\nTop Picks\n* Octopus Luciana\n* Carpaccio\n* Ravioli di Vitello love love Porcini cream sauces\n* Spagetti Puttanesca\n* Spaghetti alla Bolognese", "rating": 4, "date": "2009-09-28"}, {"excerpts": ["We ordered the beef carpaccio to start. ", "This is one of my favorite dishes, if done right, and let me say, it quite frequently isn't done right. ", "T.P. made the BEST carpaccio I have ever had. ", "Perfectly chilled (not fresh from the ice box, as it often is) ", "It had a healthy amount of lemon juice, capers and parmesan sprinkled on it, and to boot, truffle oil. ", "Oh happy day! ", "My sweetie got the puttanesca, which was just exactly what he was craving ", "and I got the spaghetti carbonara: divine. ", "The preparation of the carbonara is exactly how it is meant to be done. ", "The pasta perfectly al dente, the sauce, cheese and bacon perfectly coating every noodle. ", "My mouth is watering as I type. ", "We ate too much pasta, so we were unable to order desert. "], "author": "Liz R.", "review": "My boyfriend and I had a plan to take a cab to North Beach, an are of town we seldom visit, to find our \"new favorite Italian restaurant\". I know, this is quite a task, but we weren't yet starving, and felt up to it. We walked around and around and around looking at menus looking in windows to get a feel for the atmosphere, and alas the long search brought our weary feet (and now empty tummies) to Trattoria Pinoccio. It fit the bill in 3 main areas: 1. they had a great, varied menu 2. the light was dim (perhaps not quite dim enough for our taste) 3. they could seat us shortly (approx. 15 min.)\n\nWe ordered the beef carpaccio to start. This is one of my favorite dishes, if done right, and let me say, it quite frequently isn't done right. T.P. made the BEST carpaccio I have ever had. Perfectly chilled (not fresh from the ice box, as it often is) It had a healthy amount of lemon juice, capers and parmesan sprinkled on it, and to boot, truffle oil. Oh happy day! My sweetie got the puttanesca, which was just exactly what he was craving and I got the spaghetti carbonara: divine. The preparation of the carbonara is exactly how it is meant to be done. The pasta perfectly al dente, the sauce, cheese and bacon perfectly coating every noodle. My mouth is watering as I type. We ate too much pasta, so we were unable to order desert. Maybe next time.\n\nAs for the service, I don't recall. I was too busy stuffing my face.", "rating": 4, "date": "2009-01-27"}, {"excerpts": ["The only thing I did not like was the carpaccio.  ", "I though the truffle oil was overpowering.  ", "Overall, one of the best meals I had in a week of SF eating."], "author": "Scott P.", "review": "Dinner was wonderful.  In a party of 4, we all thought our dishes were terrific.  I even liked the lamb and I do not like lamb.  The only thing I did not like was the carpaccio.  I though the truffle oil was overpowering.  Overall, one of the best meals I had in a week of SF eating.", "rating": 4, "date": "2012-01-28"}, {"excerpts": ["We decided to order drinks and the Carpaccio as appetizer and told the waiter we needed more time to decide on the entree.\n\n ", "As it turns out the bread was stale and finally our Carpaccio was served.  ", "I then asked the waiter why the bread had not been served earlier ", "We decided we might as well eat the  Carpaccio  since we were charged for it, but it was awful, tasting more like Mortadella.  ", "We spent $35 and left no tip.  ", "We walked across the street while hearing the family next to us complain about their meal and had a  wonderful lunch at Colosseo.  ", "I will never patronize Trattoria Pinocchio again will tell all my friends how we were treated."], "author": "carmen d.", "review": "This was our third time at this restaurant and although the service was not too great the last time we were there, the food was good and my husband and I decided to have lunch there again. I should have known that our experience would not be a good one as soon as I was seated.  Shortly after a family was seated next to us and I was surprised that they were offered water and asked for their order before us. \n\n We eventually were asked for our order and I looked over to my husband and suggested sharing an entree.  To my surprise the waiter gave me a disapproving look.  We decided to order drinks and the Carpaccio as appetizer and told the waiter we needed more time to decide on the entree.\n\n Feeling a bit intimidated in the prospect of ordering a shared entree and thinking maybe it's not appropriate to order an entree to share,  we decided we would order two dishes once the appetizer is served.  So while we were enjoying our drinks and  getting  pretty hungry we realized the appetizer was taking longer than we thought and we had  no bread on our table.  I looked over at the family beside us and they had bread so I thought that the bus boy just forgot.  No one was around for me to ask so since I had to go to the ladies room any way  I decided to ask on my way there.   I tried to gain the attention of the waiter who ignored me twice.  I decided to ask to the bus boy who replied that the reason he didn't bring the bread was because we had not ordered our meal.  I was shocked and told him we ordered drinks and appetizer and awaiting to order the entree. He turned away to get some when I noticed he was complaining to the waiter about it. \n\nThe bus boy brought the bread and I said \"as you can see we ordered drinks and appetizer so is there a problem\" and he answered \"yes\".  At this point my husband wanted to leave but we had already ordered the appetizer.  As it turns out the bread was stale and finally our Carpaccio was served.  I then asked the waiter why the bread had not been served earlier and he said \"it's served when the bus boy is ready\" I was dumbfounded, and had  enough so I asked for the check.  \n\nWe decided we might as well eat the  Carpaccio  since we were charged for it, but it was awful, tasting more like Mortadella.  We spent $35 and left no tip.  We walked across the street while hearing the family next to us complain about their meal and had a  wonderful lunch at Colosseo.  I will never patronize Trattoria Pinocchio again will tell all my friends how we were treated.", "rating": 1, "date": "2012-04-29"}, {"excerpts": ["I enjoyed the carpaccio appetizer that was different than what I am used to.  ", "At Pinocchio's they include bread, mixed greens and capers in the dish with the sliced beef and shaved parmesan - nice touch.  "], "author": "Christine M.", "review": "My favorite meal of my whole San Francisco vacation was lunch here at Trattoria Pinocchio.  I make my own pasta and sauces so I can really appreciate the effort that goes into their homemade creations.  We sat outdoors which is always ideal.  I can't say that the service was exceptional, but the food certainly was.  \n\nI enjoyed the carpaccio appetizer that was different than what I am used to.  At Pinocchio's they include bread, mixed greens and capers in the dish with the sliced beef and shaved parmesan - nice touch.  I ordered the lunch special (spaghetti bolognese) and it came with mixed greens (the lunch special ended up being cheaper than the appetizer).  \n\nI have made gallons of bolognese sauce and Pinocchio's sauce was so excellent that I am going to alter my own recipe to start including ground veal and run it through the food processor to get that fine ground texture.", "rating": 4, "date": "2008-04-21"}, {"excerpts": ["We had already ordered 2 glasses of wine and did not want to be rude by leaving abruptly so we ordered the beef carpaccio which was actually very tasty and a nice presentation on the plate, only recommendation to them is to include a little more toast. ", "Maybe Pinocchio is great on the weekend when prepared with items on the menu but we will not return."], "author": "Barbara C.", "review": "they sat us at a cute table for 2 outside under a heat lamp with a plant giving us a little corner of privacy from the rush on Columbus.. this is where our rankings of Pinocchio peaked. Before we even had the chance to order our entrees they were out of 3 items we tried to order claiming they had a very busy weekend (it was a Wednesday night). Between the lack of options and the server who gave us little indication he cared that we were there we decided to move on for our meal. We had already ordered 2 glasses of wine and did not want to be rude by leaving abruptly so we ordered the beef carpaccio which was actually very tasty and a nice presentation on the plate, only recommendation to them is to include a little more toast. Maybe Pinocchio is great on the weekend when prepared with items on the menu but we will not return.", "rating": 1, "date": "2010-06-03"}, {"excerpts": ["Perfect carpaccio and pasta. ", "Comfortable atmosphere.  ", "I'll definitely go back!"], "author": "Julie A.", "review": "Great place. Delicious food. Perfect carpaccio and pasta. Comfortable atmosphere.  I'll definitely go back!", "rating": 5, "date": "2012-03-08"}], "salmone affumicato": [], "antipasti sapore italiano": [], "garlic bread": [], "polenta alla bolognese": [], "polenta con fungi": [], "calamari fritti": [{"excerpts": ["very good\nFood\nCalamari Fritti $10 was good\n"], "author": "Hungry K.", "review": "Greeting- hawkers\nVibe- little Italy tourista\nPrices- average\nParking- good luck\nService- very good\nFood\nCalamari Fritti $10 was good\nInsalata Mista was feasible $6.50\nGnocchi Sorrentina $16 was better than most. But gnocchi tasted pre boiled rather than cooked to order\nBaba Rum was not good-returned\n\nWIGB? No", "rating": 2, "date": "2015-01-04"}, {"excerpts": ["2 glasses pinot noir ($17), Calamari Fritti ($13.95), Gnocci Sorrentina ($20.95) and Spaghetti Bolognese ($18.95).  ", "As you can see we were not just ordering a cup of coffee.\n", "We waited.\n", "Finally the 1 waiter brought 1 glass of wine.  ", "We had to remind him we had ordered 2 glasses.\n", "Long story short:\n", "Service was VERY slow and inconsistent\n", "Wine was just OK\n", "Food was mediocre to just OK\nFor $91.00 Food+tax+tip ", "we expected a lot more.\n", "We will not re-visit any time soon."], "author": "Carol H.", "review": "We were hoping that Pinocchio's had maintained the level of service and food we remembered from a few years ago.  Sadly that was not the case.  We decided to have lunch here on a Thursday.  There were no customers inside which was fine because it was a beautiful day.  There were a FEW tables of customers outside, but since it was later in the day, those tables were almost done.  It also appeared that some of the tables were occupied by employees.\nWe sat inside by the windows.\nWe waited.\nWe waited even more.\nFinally the woman who had directed us in gave us menus.  \nI believe we had waited approximately 10 minutes.\nWe waited.\nThe waiter finally came to take our orders.\n2 glasses pinot noir ($17), Calamari Fritti ($13.95), Gnocci Sorrentina ($20.95) and Spaghetti Bolognese ($18.95).  As you can see we were not just ordering a cup of coffee.\nWe waited.\nFinally the 1 waiter brought 1 glass of wine.  We had to remind him we had ordered 2 glasses.\nLong story short:\nService was VERY slow and inconsistent\nWine was just OK\nFood was mediocre to just OK\nFor $91.00 Food+tax+tip we expected a lot more.\nWe will not re-visit any time soon.", "rating": 2, "date": "2014-08-26"}, {"excerpts": ["We had ordered the Calamari Fritti (light deep fried calamari with a side of spicy marinara sauce) ", "it was ok, just like fried calamari, nothing special about it.", "Linguine al Pesto Giovanni(Chef's housemade basil, pine nuts, parmigiano & garlic sauce)I liked it because I just got braces and the noodles were soft enough for me to eat."], "author": "CB S.", "review": "I gave Trattoria Pinocchio only one star because I don't think I could give them less than that!!Well, I went there with a couple of friends because it was a nice night and we didn't feel like cooking at home.\n\nWe went to Trattoria Pinocchio and we were seated quite fast. Our waiter did everything correct at first, by taking my order first and so on....\n\nWe had ordered the Calamari Fritti (light deep fried calamari with a side of spicy marinara sauce) it was ok, just like fried calamari, nothing special about it.Linguine al Pesto Giovanni(Chef's housemade basil, pine nuts, parmigiano & garlic sauce)I liked it because I just got braces and the noodles were soft enough for me to eat.Linguine del Pescatore(mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce)I was told that the center of the mussels were cold and the clams were gritty and still had sand in them.Vanilla Creme Brule(Our classic vanilla custard w/caramelized sugar crust)I can't comment on that because I didn't order that.\n\nFor me,I ate less than half of my meal because the noodles kept getting stuck in my braces. So I decided to take the remaining of my food to go. When the waiter came, I had told him that I wanted my food to go and he said ok and started to clean the table. When the waiter attempted to gather all of the dishes, he dropped a fork and it almost landed on my friend!! When I noticed that he had put two used  plates on my food,I reminded him that I wanted my food to go. The waiter  looked at me and said \"oh shit\" and continued to clean. When he came back, he said \"you don't want that food still? Right?\" I said no because you put dirty dishes in my food. Then he said that he could give me a dessert and I declined because I wanted the rest of my dinner. At that point I was shocked that he had the nerve to ask me if I wanted dessert instead asking me if he could remake my dinner. I could honestly say, he never asked me if I would like them to remake my dinner. Now I know it didn't cost that much to make my dinner, not because the ingredients are cheap but because they have cheap labors. \n\nWhen we received the bill, we noticed that he  didn't comp my meal or anything on the bill. As soon as we slipped a credit card with the bill, the waiter came right away to charge us. After he charged the credit card, he said that he overcharged us and had to void the first transaction. We didn't and couldn't understand why he kept talking to the manager and avoided eye contact with us for the remanding time we spent there, I would say it was awkward. Maybe they were  thinking, avoid the Asian people and they won't make a big deal about it!!!\n\nNow that I wrote my review, its up to you if you still want to check this place out. If you do decide to try this place out, I hope your food and service is better than ours and double or triple check your bill. What I mean by that is make sure the amount on the bill is the same amount when you sign your receipt .As for me, it was my first time there and my very last time there!!", "rating": 1, "date": "2013-04-26"}, {"excerpts": ["Today we came here for a working lunch; we ordered:\n\nFor appetizers, the boss ordered Calamari Fritti, Bruschetta, and Insalata Caprese.  "], "author": "Michael O.", "review": "We had a very sweet, very gay, Northern Italian waiter.  The best kind of waiter, in my view (... ok, except for Noel at Slanted Door)!\n\nToday we came here for a working lunch; we ordered:\n\nFor appetizers, the boss ordered Calamari Fritti, Bruschetta, and Insalata Caprese.  Our lunch entrees were Penne Arrabbiata, Lasagna Francesco, Linguine Calamari, Linguine al Pesto (now that looked very good - I'll be trying that next time!), Scampi Saut (which I had - Yu-UMMY!!!!!), and Chicken Parmigiana.\n\nThe prices range from $12 for pasta dishes all the way up to $22 for a filet mignon.\n\nI don't have a big problem with these prices, but I almost took one star off for the tactless little blip at the bottom of the menu \"Minimum 1 order per person\".  Does this mean I can't bring my sweetie in here and share an appetizer?  We both have to order one in order to be allowed to eat here?\n\nNow, that, my fellow yelpers, is simply poor form.\n\nI love our working lunches; we always wind up talking about the weirdest things (strip clubs, ex's, weird 3rd world countries ... random stuff)!", "rating": 4, "date": "2006-08-04"}, {"excerpts": ["My calamari fritti was just okay ", "(hence the four stars) - crispy but not especially tasty. \n", "Tue ambience was pleasant, and the wait staff friendly and attentive."], "author": "Da W.", "review": "My friend and I had a serendipitous meal at this wonderful restaurant. The caesar salad was one of the best I've ever had - crisp lettuce, just the right amount of dressing. The mixed salad was fresh and delicately dressed.\nMy friend had their homemade sausage ravioli with cream sauce - fabulous! My calamari fritti was just okay (hence the four stars) - crispy but not especially tasty. \nTue ambience was pleasant, and the wait staff friendly and attentive.", "rating": 4, "date": "2013-06-17"}, {"excerpts": ["Calamari fritti was a little cold once it got out.  ", "Chicken fettucini alfredo was decent but not memorable.  "], "author": "Yosie G.", "review": "Came here for a friend's birthday and had reservations at 7.  Almost all of us were there on time, a few stragglers.  However, at 7:05pm, the waiter tells us that there are alot of people with rezzies, and our rezzie was at 7pm so we need to hurry up.  -_-  Ok just because not everyone is there, you are telling us at 7:05 that we need to get out?  Hm..  \n\nOther than that, the food was alright.  Calamari fritti was a little cold once it got out.  Chicken fettucini alfredo was decent but not memorable.  Although the boyfriend enjoyed his spaghetti bolognese and the coffee.\n\nOverall, food is ok but service could have been better.", "rating": 3, "date": "2008-11-09"}], "octopus luciana": [{"excerpts": ["Octopus Luciana\n", "* "], "author": "Amanda R.", "review": "At 1 time this place was my fave Italian in the City. I forget with whom it was with that I went here with the 1st time but they knocked my socks off! Their Spagetti Puttanesca began a year long love affair with this dish! It was a perfect blend of the Salty (anchovies, olives) with the acidic tomato sauce.\n\nLove their alcoholic Cappuccino's or Espresso Coretto. The best of both world's really. I'm always fighting with myself on whether to do caffeine or alcohol. Their kitchen is pretty open and it always surprises me how little Italian kitchens are and how efficient they are despite there only being 1 or 2 cooks to execute a bulky menu of items. The only bad thing that I can say about Pinocchio's is that out of all of my visits there was only 1 time when I received absent minded service. \n\nOn one of my visits I  went with my friend Rebecca and while the food was great. We waited a really long time between courses and our drinks were left unfilled. We then left without anyone noticing. It was so bad that I told my friend not to leave a tip. Atrocious I know but it was THAT bad. Embarrassingly enough my gal pal left her wallet in the restaurant and had to go back. She said that the whole staff apologized for their oversight. I guess our visit coincided with one of their long time staff members last day. So they were pre-occupied. Just an FYI. Everyone has a bad day I would still give these peeps a try if you are in North Beach.\n\nTop Picks\n* Octopus Luciana\n* Carpaccio\n* Ravioli di Vitello love love Porcini cream sauces\n* Spagetti Puttanesca\n* Spaghetti alla Bolognese", "rating": 4, "date": "2009-09-28"}], "guazzetto di mare": [], "potobello marinato": [], "portobello alla griglia": [{"excerpts": ["We ordered the Guazzetto de Mare (steamed clams and mussels in white wine, garlic and tomatoes) and the Portobello alla Griglia (1 big portobello topped with sundried tomatoes over arugula). ", "Both were delicious! "], "author": "Stephanie T.", "review": "Friendly vibes, quick service, and yummy food!\n\nI stopped here for a 2 pm Blue Moon and appetizer session with the dad and Uncle. We ordered the Guazzetto de Mare (steamed clams and mussels in white wine, garlic and tomatoes) and the Portobello alla Griglia (1 big portobello topped with sundried tomatoes over arugula). Both were delicious! The Portobello is somewhat like a salad, and the free bread they give you is great with the extra broth from the clams. \n\nPrice point is average for Little Italy or a nice restaurant in general around the $10-$15 point but every dollar is worth it. \n\nIt's always nice with the outdoor seating in Little Italy, the buildings around you block off a good amount of the Bay breeze. The whole street is filled with happy people either walking passed you, next to you, or sitting down at another bistro across the street. Outdoor seating--always recommended!", "rating": 4, "date": "2014-04-22"}], "minestrone": [{"excerpts": ["I tried their minestrone soup as well as bruschetta and both were excellent.  ", "The restaurant is very traditional if you sit inside but outside seating offers good people watching."], "author": "Monica G.", "review": "My co-worker claims that their veal lasagna is better than the one she makes at home and she is Italian. Unfortunately I couldn't try it because I don't eat veal but apparently the cheese that was used knocked her socks off.   I tried their minestrone soup as well as bruschetta and both were excellent.  The restaurant is very traditional if you sit inside but outside seating offers good people watching.", "rating": 4, "date": "2015-10-18"}, {"excerpts": ["The tortellini, spaghetti, panini sandwich, chicken Alfredo, minestrone soup all were excellent! ", "The server was fun and kept every glass full during lunch."], "author": "Brenda O.", "review": "My 15 year old claims the four cheese pizza is the \"best pizza in the world!\"\nBrought our family of 18 here because we were starving. We brought our picky eaters, vegetarians, and impatient hangry attitudes, and this place surpassed our expectations. The tortellini, spaghetti, panini sandwich, chicken Alfredo, minestrone soup all were excellent! The server was fun and kept every glass full during lunch.", "rating": 5, "date": "2016-07-13"}, {"excerpts": ["The minestrone soup is very good! ", "My children ordered the Italian Sausage Paninis, they said they were delicious! ", "My Capellini Pomodoro was excellent. ", "It's an old North Beach street corner restaurant with old San Francisco charm. ", "I would love to come back for dinner the next time I'm in San Francisco!"], "author": "Victoria Q.", "review": "Came hear on New Years Eve for lunch. Walked in and most of the guests at the tables were speaking Italian to one another. So I felt we had made a wise choice. The lunch specials are fairly priced!!! The minestrone soup is very good! My children ordered the Italian Sausage Paninis, they said they were delicious! My Capellini Pomodoro was excellent. It's an old North Beach street corner restaurant with old San Francisco charm. I would love to come back for dinner the next time I'm in San Francisco!", "rating": 4, "date": "2016-12-31"}, {"excerpts": ["Choice of salad or minestrone (on the day I went) plus a pasta dish. ", "Bread is thrown into the mix ", "and I'm very happy with my green salad and fettucini Alfredo. ", "Plus a beer is $4 or a very decent sized glass of wine $5.\n"], "author": "Rickie J.", "review": "We went for the happy hour early dinner here over 4 hours ago and I'm still full!\nGreat value at around $17 for a 2 course meal if you go late afternoon (before 6.30). Choice of salad or minestrone (on the day I went) plus a pasta dish. Bread is thrown into the mix and I'm very happy with my green salad and fettucini Alfredo. Plus a beer is $4 or a very decent sized glass of wine $5.\nSo for 2 of us, it came to $44 plus tip.\n\nGreat service too; friendly, fast and authentic.", "rating": 4, "date": "2013-03-12"}, {"excerpts": ["[Minestrone soup]: Not going to lie, I literally only had the carrots of this soup (because my girl friend didn't like carrots) and just from eating those, the soup tasted delicious. "], "author": "Jasmine C.", "review": "Cute Italian restaurant in North Beach that  I absolutely had a fantastic time at! The host was so hilarious and charming in his thick Italian accent; it seriously made our meal exponentially more enjoyable! The ambiance was great--could either be romantic or fun for a groups of friends! I came with 3 other girls and we were seated immediately when we walked in (around 7:30 on a Friday night). \n\nORDERED:\n\n[Veal Lasagna]: I normally stray away from ordering lasagna when I go out just because I think it's so ordinary and I want to try other things. But thanks to a quick tip on Yelp, I decided to just go with it. It was delicious! No regrets. The meat sauce was so flavorful and the layers of cheese between the flat noodles really brought everything together. It didn't look like a lot at first, but that dish really filled me up! Yum!\n\n[Gnocchi sorrentino]: Someone else ordered this, and a word about gnocchi...do not be fooled by what looks like a small amount of these fluffy potato dumplings. They're pretty dense and delicious!\n\n[Linguine with clams]: I forget what the official name of this is...and it actually looked more like spaghetti than linguine, but I had a bite of my friend's pasta. Now, I don't like clams much, but I think if you're a big clam lover (like my friend who ordered this is) you'll love this one. There were so many clams in her dish, she said she had a harder time finding pasta than clams! And the noodles themselves were very well-flavored--like they were infused with ocean. Personally, it's not my go to dish, but I know there are many clam lovers out there =)\n\n[Minestrone soup]: Not going to lie, I literally only had the carrots of this soup (because my girl friend didn't like carrots) and just from eating those, the soup tasted delicious. If carrots could taste that good, the soup must have been amazing. \n\nWe had a great time here, and the Italian host really made our night more memorable and enjoyable. After taking a picture for us, he tried selling my camera to the next table for $4. hahah...what a charmer. I'd come back for more =) \n\nThe only minus I think would be the bread...I love me some good bread, (yes, pre-carbohydrate overload) and their bread was just okay. Price-wise, it's what you'd expect for dinner at any ordinary Italian place, and maybe a little more since it's SF and there's those health taxes and whatever...but the experience and food made up for it for sure! They really take their time to make classic Italian dishes beyond what you'd expect.", "rating": 4, "date": "2010-10-24"}, {"excerpts": [", it came with minestrone soup.. ", "The soup was fine, but not the best I've had. ", "I was dining with 3 children and found their children's selections to be lacking, as they only had one option. ", "Luckily they had pizza which we were able to split between them. ", "The prices are a bit high, but being right on Columbus does demand somewhat of a premium ", "so I won't hold it against them. ", "They also charge a 1% fee to every order to offset their healthcare costs, which seemed a little petty. ", "I mean, I paid $70+ for 3 kids and an adult ", "I would think they could get by without adding another buck onto the bill, but whatevs. ", "All in all, we were satisfied with our experience, but it didn't knock our socks off."], "author": "M C.", "review": "Visited this quaint restaurant yesterday and had a decent meal with adequate service. I chose the homemade fettuccine Alfredo and it was pretty good, it came with minestrone soup.. The soup was fine, but not the best I've had. I was dining with 3 children and found their children's selections to be lacking, as they only had one option. Luckily they had pizza which we were able to split between them. The prices are a bit high, but being right on Columbus does demand somewhat of a premium so I won't hold it against them. They also charge a 1% fee to every order to offset their healthcare costs, which seemed a little petty. I mean, I paid $70+ for 3 kids and an adult I would think they could get by without adding another buck onto the bill, but whatevs. All in all, we were satisfied with our experience, but it didn't knock our socks off.", "rating": 3, "date": "2014-12-30"}, {"excerpts": ["Accompanied by a light salad or minestrone. "], "author": "Barbara B.", "review": "Great pesto! So far, we haven't worked our way past this menu item. The noodles are silky and delicious, the pesto so good we're trying to replicate it at home. \n\nThe lunch portions are perfect: \"I doubt I can finish this\" midway through, but somehow I managed. Accompanied by a light salad or minestrone. Pinocchio's also serves a great cup of Illy coffee.\n\nThe server was attentive and great fun to interact with. We'll be back!", "rating": 5, "date": "2013-02-02"}, {"excerpts": ["My mom said it was the best Minestrone she has ever tasted. ", "I had the veal ravioli with the porcini mushroom sauce recommended by our server ", "and I couldn't stop eating. ", "It was so darn good!  ", "I have a new favorite to eat at whenever in San Francisco."], "author": "Stacey W.", "review": "Had a long, late patio lunch here on Saturday, and fell in love. My mom said it was the best Minestrone she has ever tasted. I had the veal ravioli with the porcini mushroom sauce recommended by our server and I couldn't stop eating. It was so darn good!  I have a new favorite to eat at whenever in San Francisco.", "rating": 5, "date": "2014-07-06"}, {"excerpts": ["The minestrone and pasta is perfect every time.  ", "If you like authentic italian cuisine this is it.  ", "I have also had the chicken Caesar and polenta and can't wait to try the veal piccata."], "author": "George M.", "review": "Giovanni and his staff are amazing.  The minestrone and pasta is perfect every time.  If you like authentic italian cuisine this is it.  I have also had the chicken Caesar and polenta and can't wait to try the veal piccata.", "rating": 5, "date": "2014-08-19"}, {"excerpts": ["Also had the minestrone soup, which was pretty delicious.\n\n"], "author": "Angel T.", "review": "BEST tiramisu I've had since I came back from Italy. It's homemade and simply heavenly.\n\nMy friend and I shared the magherita pizza, which was pretty decent- the crust was more like American pizzas, but aside from that, it fared pretty well with the original magherita pizza. \n\nAlso had the minestrone soup, which was pretty delicious.\n\nThe restaurant itself is adorable- had a very authentic and cozy feel to it! The waiters were extremely friendly and the owner runs around the restaurant singing (in Italian, and he's pretty good!) to both the guests and his employees.\n\nDefinitely one of the better restaurants in North Beach!", "rating": 4, "date": "2012-05-13"}, {"excerpts": ["Gorgeous day, gorgeous date, sat outside, ate tender ravioli, feather pillow gnocchi, the only minestrone I've ever liked and a decent glass of Chianti to wash it down cliche' style. \n\n"], "author": "wendella a.", "review": "Gorgeous day, gorgeous date, sat outside, ate tender ravioli, feather pillow gnocchi, the only minestrone I've ever liked and a decent glass of Chianti to wash it down cliche' style. \n\nI even managed to provide some theatrics for all to enjoy when my bra strap snapped and I had to sidle over to the bathroom to fix it while being careful not to fall. The floor of the restaurant is unusually slippery, like it's covered with baby powder...and my less than practical shoes weren't loving it. \n\nBut it only added to the fun. Good food - great company - great weather and attentive yet laid back service. I would recommend going here on a nice day and sitting outside, enjoy the people watching and get the gnocchi for sure - you'll miss out if you don't.  You may even need it to cushion a fall if you happen to have a skating session across the floor.", "rating": 4, "date": "2007-10-01"}, {"excerpts": ["We had the following:\n\nbowl of minestrone (6.50) "], "author": "Gloria H.", "review": "3.5 stars\n\nThere are so many Italian restaurants in the North Beach area and we've been working on trying a new one each time.  On a rare warm Friday evening, we decided on Pinocchio because of its outdoor seating.  Yes, there are a lot of sidewalk seating but Pinocchio probably has the best because it's located on a much wider street that doesn't have too much people or car traffic yet with view of Columbus where the action is.\n\nWe got a good sidewalk table and it was the perfect evening to be outdoor to enjoying the night.  The waiter was very friendly and helpful.  We had the following:\n\nbowl of minestrone (6.50) - it was good and hot, that's important\n\ncappellini al pomodoro ($12.95) - it was al dente and that's hard for cappellini.  simple but very flavorful.\n\nseafood ink taglitele ($19.95) - that was the pasta special of the day, this was very flavorful with a nice smokey flavor.  It is one of the better ink pasta we've tried. \n\nPoached pear al chocolate ($7) - this was delicious!  The pear was not soggy but still has a nice texture but the chocolate was fantastic.  I wish it came with something to wipe the chocolate but I made do with my finger, YUM!\n\nWe got a bottle of the Rufino Chianti ($28) and it was pretty good.", "rating": 3, "date": "2008-11-10"}, {"excerpts": ["Lunch here was spaghetti bolognese and minestrone. ", "Excellent food, superlative service, and ", "cafe style dining on the street make this a quintessential North Beach dining experience. ", "The pasta is all made in-house, and I was impressed by how delicate ordinary spaghetti with meat sauce could be - as if made by faeries."], "author": "Darren M.", "review": "Lunch here was spaghetti bolognese and minestrone. Excellent food, superlative service, and cafe style dining on the street make this a quintessential North Beach dining experience. The pasta is all made in-house, and I was impressed by how delicate ordinary spaghetti with meat sauce could be - as if made by faeries.", "rating": 4, "date": "2010-06-04"}, {"excerpts": ["Ordered the minestrone and the Pollo alla Griglia which is a Italian Panini with grilled chicken, tomatoes and a balsamic vinaigrette.  ", "The minestrone was piping hot which was good because it was really cold out but didn't really do it for me.  ", "The panini was tasty and fills you up without making you feel full.  ", "Our waiter was okay ", "but he never came back after he brought us our meal.  ", "Ran out of water early and went the whole meal without getting a refill.  ", "All in all, not a bad experience for the price."], "author": "Ken L.", "review": "Was in the city and got a tad hungry so we came across Trttoria Pinocchio and decided to partake of the food.  The restaurant is clean and decorated with long nosed marionettes.  Ordered the minestrone and the Pollo alla Griglia which is a Italian Panini with grilled chicken, tomatoes and a balsamic vinaigrette.  The minestrone was piping hot which was good because it was really cold out but didn't really do it for me.  The panini was tasty and fills you up without making you feel full.  Our waiter was okay but he never came back after he brought us our meal.  Ran out of water early and went the whole meal without getting a refill.  All in all, not a bad experience for the price.", "rating": 3, "date": "2007-01-17"}, {"excerpts": ["Mom had the zuppa del minestrone, best I've had in my young life. ", "I had the Penne Vodka, which had bacon in it...", "I've experienced this before in some Vodka sauces ", "but normally it says that on the menu.  ", "I moved around the bacon pieces and the penne ended up being very good. "], "author": "Anna F.", "review": "Went here with the parents last weekend. (President's weekend so tourists out numbered locals 5-1) Walked in around 7:45 on Saturday night. Hostess told us a 10 minute wait. We ended up waiting about 25 minutes, but I've been a hostess, I know how it goes. No harm no foul. \n\nAs soon as we sat down we were given water bread and our drink order taken. My Mom ordered a wine she hadn't heard of but the waiter (hot Italian straight off the boat) had suggested a full bodied Cab. Well Mom didn't like it, she said it was fine when asked, but after the waiter noticed she hadn't drunk any he brought a new glass of wine on his own. Glass of wine #2 a hit! A very good sign of a very good waiter. \n\nOur bruschetta came shortly after we ordered it and it was amazing I'm a self proclaimed bruschetta connoisseur, and it was almost perfection. Then out of nowhere our waiter brought a complimentary insalata caprese without any real explanation, just that it was on the house. In my head I thought this was because said hot Italian waiter was preparing to ask for my hand in marriage and was preparing my parents for the question...Anyhow the gesture was much appreciated. Our main courses came. Pops had the lasagna Francesco, second only to Grandma's. Mom had the zuppa del minestrone, best I've had in my young life. I had the Penne Vodka, which had bacon in it...I've experienced this before in some Vodka sauces but normally it says that on the menu.  I moved around the bacon pieces and the penne ended up being very good. Peroni on tap, YAY!!\n\nGreat old school/old world service and food. I will defiantly be back.", "rating": 4, "date": "2008-02-20"}], "zuppa del giorno": [], "insalata mista": [{"excerpts": ["The Insalata Mista was drenched in dressing. ", "The margarita pizza was a cheese pizza with a few diced tomatoes and a handful of basil thrown on.  ", "It was over baked just shy of being burnt. ", "We were the only patrons in the restaurant and they could not make one salad and one pizza correctly. ", "Do not waste your money."], "author": "Scott C.", "review": "Worst Italian food I have ever experienced. The Insalata Mista was drenched in dressing. The margarita pizza was a cheese pizza with a few diced tomatoes and a handful of basil thrown on.  It was over baked just shy of being burnt. We were the only patrons in the restaurant and they could not make one salad and one pizza correctly. Do not waste your money.", "rating": 1, "date": "2017-05-17"}, {"excerpts": ["Insalata Mista was feasible $6.50\n", "Gnocchi Sorrentina $16 was better than most. ", "But gnocchi tasted pre boiled rather than cooked to order\n"], "author": "Hungry K.", "review": "Greeting- hawkers\nVibe- little Italy tourista\nPrices- average\nParking- good luck\nService- very good\nFood\nCalamari Fritti $10 was good\nInsalata Mista was feasible $6.50\nGnocchi Sorrentina $16 was better than most. But gnocchi tasted pre boiled rather than cooked to order\nBaba Rum was not good-returned\n\nWIGB? No", "rating": 2, "date": "2015-01-04"}], "insalata cesare": [{"excerpts": ["We enjoyed Bruschetta, Insalata Cesare, Fettucine con ", "Pollo, Ravioli di Vitello, Dungeness Crab ", "w/pasta,   \n", "The Owner is delightful.  "], "author": "Mary lynn R.", "review": "Trattoria Pinocchio\n\nWe were greeted by the hostess and opted for outside seating which was comfortable and had a feeling of warmth.   The atmosphere was charming along with the music and we felt as if we were back in Italy.   Our waiter was the \"Silver Fox\" and he was not only personable, but his service was outstanding, along with the other wait staff.  He recommended a few of our dishes and was spot on.  We enjoyed Bruschetta, Insalata Cesare, Fettucine con Pollo, Ravioli di Vitello, Dungeness Crab w/pasta,   \nThe Owner is delightful.  He walks around singing and welcomes everyone as if they were at his home for dinner. \n\nTry Trattoria Pinocchio and you will not be disappointed!", "rating": 5, "date": "2011-12-18"}], "insalata di spinaci": [{"excerpts": ["We ordered the Insalata di Spinaci, Risotto Seafood, Linguine con Vongole e Cozze and the biggest  4 Stagioni Calzone.  ", "Each entree was so delicious. ", "The Italian herbs and flavors were of this world and popped with every bite. ", "Not to mention that yummy Italian bread. ", "Our waiter was very nice and accommodating.  ", "Everyone that worked at the restaurant was friendly including the fabulous Chefs. ", "We were very happy with Trattoria Pinocchio.  ", "We'll definitely be back."], "author": "T R.", "review": "I have been wanting to go to Trattoria Pinocchio for a while now.  My husband took me and a friend there for Mother's Day.  We were greeted by the manager who was very friendly.  We didn't have reservations and did not have to wait for a table.  The restaurant is beautifully decorated with a lot of room inside or you can choose to sit outside.  The menu selection is wonderful with a lot to choose from to satisfy your palate.  We ordered the Insalata di Spinaci, Risotto Seafood, Linguine con Vongole e Cozze and the biggest  4 Stagioni Calzone.  Each entree was so delicious. The Italian herbs and flavors were of this world and popped with every bite. Not to mention that yummy Italian bread. Our waiter was very nice and accommodating.  Everyone that worked at the restaurant was friendly including the fabulous Chefs. We were very happy with Trattoria Pinocchio.  We'll definitely be back.", "rating": 5, "date": "2016-05-10"}], "insalata caprese": [{"excerpts": ["Insalata Caprese - can't go wrong with a classic, mozzarella, basil and tomato salad, and this particular version was drizzled with pesto, which I thought was a nice way to tie all the flavors together. "], "author": "Aivy C.", "review": "A late night meal here was the best way to wrap up Valentine's Day, especially given the fact that we didn't have a reservation. My date and I wanted to eat as far away from Pillow Fight as possible, and because the North Beach garage is always open, we decided to park there and walk around in search of food. We didn't find anything, but I did find Adam E., who pointed us in the direction of this great little place! Thanks dude!\n\nMy date and I waited 15 minutes for our table but it wasn't a big deal because there was plenty of room at the bar. The bartender was a cool guy, and also very honest (he steered me away from some trendy pomegranate drink to a classic - and delicious - gin fizz). He also didn't *really* make fun of me for downing 3 glasses of water the second I sat down. \n\nWe were seated outdoors, and while it did take a while for everything to arrive, it was all on point:\n\nInsalata Caprese - can't go wrong with a classic, mozzarella, basil and tomato salad, and this particular version was drizzled with pesto, which I thought was a nice way to tie all the flavors together. I would have liked more grilled bread on the side, but it was great nonetheless. \n\nCapasante al Prosciutto - I make it a point to order any incarnation of scallops wrapped in salty meat whenever it's available, and this version did not disappoint. I had about 6 or 7 prosciutto-wrapped scallops on my plate, sauteed in wine and butter, and even though that doesn't sound like much, it filled me up. I ordered sauteed veggies to offset the rich saltiness of the seafood and meat. \n\nFiletto al Pepe Verde - this is what my date ordered, filet mignon served with sauteed veggies and garlic-rosemary roasted potatoes. This was just about the most perfect steak we both had in a very long time.\n\nI would come back again! The food is fantastic, and if you get a table outside (weather permitting), it's the perfect location for people watching.", "rating": 5, "date": "2010-02-16"}, {"excerpts": ["Today we came here for a working lunch; we ordered:\n\nFor appetizers, the boss ordered Calamari Fritti, Bruschetta, and Insalata Caprese.  "], "author": "Michael O.", "review": "We had a very sweet, very gay, Northern Italian waiter.  The best kind of waiter, in my view (... ok, except for Noel at Slanted Door)!\n\nToday we came here for a working lunch; we ordered:\n\nFor appetizers, the boss ordered Calamari Fritti, Bruschetta, and Insalata Caprese.  Our lunch entrees were Penne Arrabbiata, Lasagna Francesco, Linguine Calamari, Linguine al Pesto (now that looked very good - I'll be trying that next time!), Scampi Saut (which I had - Yu-UMMY!!!!!), and Chicken Parmigiana.\n\nThe prices range from $12 for pasta dishes all the way up to $22 for a filet mignon.\n\nI don't have a big problem with these prices, but I almost took one star off for the tactless little blip at the bottom of the menu \"Minimum 1 order per person\".  Does this mean I can't bring my sweetie in here and share an appetizer?  We both have to order one in order to be allowed to eat here?\n\nNow, that, my fellow yelpers, is simply poor form.\n\nI love our working lunches; we always wind up talking about the weirdest things (strip clubs, ex's, weird 3rd world countries ... random stuff)!", "rating": 4, "date": "2006-08-04"}, {"excerpts": ["Then out of nowhere our waiter brought a complimentary insalata caprese without any real explanation, just that it was on the house. ", "In my head I thought this was because said hot Italian waiter was preparing to ask for my hand in marriage and was preparing my parents for the question...", "Anyhow the gesture was much appreciated. ", "Our main courses came. ", "Pops had the lasagna Francesco, second only to Grandma's. "], "author": "Anna F.", "review": "Went here with the parents last weekend. (President's weekend so tourists out numbered locals 5-1) Walked in around 7:45 on Saturday night. Hostess told us a 10 minute wait. We ended up waiting about 25 minutes, but I've been a hostess, I know how it goes. No harm no foul. \n\nAs soon as we sat down we were given water bread and our drink order taken. My Mom ordered a wine she hadn't heard of but the waiter (hot Italian straight off the boat) had suggested a full bodied Cab. Well Mom didn't like it, she said it was fine when asked, but after the waiter noticed she hadn't drunk any he brought a new glass of wine on his own. Glass of wine #2 a hit! A very good sign of a very good waiter. \n\nOur bruschetta came shortly after we ordered it and it was amazing I'm a self proclaimed bruschetta connoisseur, and it was almost perfection. Then out of nowhere our waiter brought a complimentary insalata caprese without any real explanation, just that it was on the house. In my head I thought this was because said hot Italian waiter was preparing to ask for my hand in marriage and was preparing my parents for the question...Anyhow the gesture was much appreciated. Our main courses came. Pops had the lasagna Francesco, second only to Grandma's. Mom had the zuppa del minestrone, best I've had in my young life. I had the Penne Vodka, which had bacon in it...I've experienced this before in some Vodka sauces but normally it says that on the menu.  I moved around the bacon pieces and the penne ended up being very good. Peroni on tap, YAY!!\n\nGreat old school/old world service and food. I will defiantly be back.", "rating": 4, "date": "2008-02-20"}], "insalata tricolore": [{"excerpts": ["Our favorite plates are insalata tricolore, gnocchi enzo, tiramisu & limoncello...the list goes on. ", "We highly recommend."], "author": "Mark K.", "review": "My fiance and I just had our wedding reception tasting with Giovanni. He and the staff instantly make you feel like family. Our favorite plates are insalata tricolore, gnocchi enzo, tiramisu & limoncello...the list goes on. We highly recommend.", "rating": 5, "date": "2015-02-13"}], "warm seafood salad": [], "gorgonzola cheese": [{"excerpts": ["Fresh homemade gnocchi in a gorgonzola cheese sauce. "], "author": "Anthony L.", "review": "Let me start by saying I love this restaurant. While living in the SF Bay Area my wife and I would go here every Sunday for lunch and many times for dinner as well. The food is absolutely delicious and the service is wonderful as well. My favorite waiter is Antonio who has worked there for a while. Certain pastas are made fresh daily such as the gnocchi, tagliatelle and ravioli. \n\nGnocchi Enzo - One of my all time favorite dishes. Fresh homemade gnocchi in a gorgonzola cheese sauce. The sauces in this place have amazing flavor and the gnocchi literally melts in your mouth since it's made fresh. \n\nPenne Amatriciana - Their Amatriciana sauce is very different then other Amatriciana sauces I have had at Bay Area restaurants. The flavor is spectacular ! The pasta was cooked al dente which is the way it should be done. So may Italian restaurants in America and Americans in general seem to like their pasta overcooked. Try this dish and you will be addicted.\n\nButternut Squash Ravioli in cream sauce - The butternut ravioli is sometimes on the special menu and it is delicious. the ravioli is homemade and very fresh. The difference between boxed and homemade pasta is huge. There is no substitute for fresh pasta made daily. \n\nPasta Festa - Also on the special menu from time to time. My wife hade this meal and the pasta was tagliatelle with a cream sauce and seafood. It was delicious and the portions were huge as well.\n\nProsciuotto and Melone - I have started my meals frequently with this appetizer. The melon is always fresh and the prosciutto always top quality. The perfect balance between salt and potassium. Great flavor. Salt raises the blood pressure and potassium from the melon keep the blood pressure in check. This is a nice, fresh, cold appetizer.\n\nI miss San Francisco and this restaurant especially along with Trattoria La Siciliana. two of my favorite haunts. When I die I plan on haunting this place and stealing pasta from patrons' dishes lol. You can't go wrong with any of the food here. Prices are higher for some dishes but the pastas are made fresh and I would imagine the rents in North Beach are quite high.\n\nCarpaccio - Another winning appetizer. beef sliced super thin with arugula, capers and bread and shaved cheese. The flavor is great when you put them all together.\n\nPanini Sandwiches - If you choose any of the Panini sandwiches you can't go wrong. My wife and I have tried the veggie, chicken, prosciutto & Mozzarella and the Italian sausage and they were all delicious. They know food in this place.", "rating": 5, "date": "2016-01-30"}, {"excerpts": ["We started with an appetizer Piatto di Formaggi\n(parmesean & gorgonzola cheese with pear & walnuts.) "], "author": "Dianne S.", "review": "My husband and had a great dining experience at this restaurant.  The service and food was just wonderful!\n\nWe started with an appetizer Piatto di Formaggi\n(parmesean & gorgonzola cheese with pear & walnuts.) This nice and light.\n\nI had Fettucine con Pollo (house made fresh fettuccine, sautéed chicken & vegetables in an Alfredo cream sauce.)  The sauce was creamy (thin) and flavorful... just superb!!!  \n\nMy husband had Linguine del Pescatore\n(mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce.)  \n\nWe would definitely recommend this restaurant.", "rating": 4, "date": "2016-01-16"}], "grilled chicken breast": [], "bay shrimp": [], "prawns": [{"excerpts": ["Great food but went last night and got carbonara with prawns. ", "The prawns had a really weird taste ", "so I had three other people with me try them, who also said they tasted funny. ", "I told the white haired older waiter that they tasted weird, and he replied rudely saying they have never had a complaint before and argued with me that they were fine. ", "He then proceeded too only take the prawns off the bill and not the whole meal. ", "I got home and threw up all night. ", "Definitely had food poisoning."], "author": "Thalia S.", "review": "Great food but went last night and got carbonara with prawns. The prawns had a really weird taste so I had three other people with me try them, who also said they tasted funny. I told the white haired older waiter that they tasted weird, and he replied rudely saying they have never had a complaint before and argued with me that they were fine. He then proceeded too only take the prawns off the bill and not the whole meal. I got home and threw up all night. Definitely had food poisoning.", "rating": 2, "date": "2016-09-11"}, {"excerpts": ["My husband had Linguine del Pescatore\n(mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce.)  \n\n"], "author": "Dianne S.", "review": "My husband and had a great dining experience at this restaurant.  The service and food was just wonderful!\n\nWe started with an appetizer Piatto di Formaggi\n(parmesean & gorgonzola cheese with pear & walnuts.) This nice and light.\n\nI had Fettucine con Pollo (house made fresh fettuccine, sautéed chicken & vegetables in an Alfredo cream sauce.)  The sauce was creamy (thin) and flavorful... just superb!!!  \n\nMy husband had Linguine del Pescatore\n(mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce.)  \n\nWe would definitely recommend this restaurant.", "rating": 4, "date": "2016-01-16"}, {"excerpts": ["Full all the luscious clams, mussels, calamari, prawns and fresh fish.  "], "author": "Amy B.", "review": "We were strolling through North Beach and came across Trattoria Pinocchio.  A charming gentleman coaxed us in by serenading us.  We were tired of walking and ready to eat so that is all it took..haha.  \n\nCharming little area on the corner.  \n\nThe tables are very close so you can hear everything that is going on.  \n\nI had the Cioppino.  It was delicious.  Full all the luscious clams, mussels, calamari, prawns and fresh fish.  The definately did not skimp on the seafood.  \n\nI also had the Caipirinha -Cachaca, fresh lime, brown sugar.  Yummy and refreshing!!", "rating": 3, "date": "2010-04-09"}, {"excerpts": ["Linguine del Pescatore(mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce)I was told that the center of the mussels were cold and the clams were gritty and still had sand in them.", "Vanilla Creme Brule(Our classic vanilla custard w/caramelized sugar "], "author": "CB S.", "review": "I gave Trattoria Pinocchio only one star because I don't think I could give them less than that!!Well, I went there with a couple of friends because it was a nice night and we didn't feel like cooking at home.\n\nWe went to Trattoria Pinocchio and we were seated quite fast. Our waiter did everything correct at first, by taking my order first and so on....\n\nWe had ordered the Calamari Fritti (light deep fried calamari with a side of spicy marinara sauce) it was ok, just like fried calamari, nothing special about it.Linguine al Pesto Giovanni(Chef's housemade basil, pine nuts, parmigiano & garlic sauce)I liked it because I just got braces and the noodles were soft enough for me to eat.Linguine del Pescatore(mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce)I was told that the center of the mussels were cold and the clams were gritty and still had sand in them.Vanilla Creme Brule(Our classic vanilla custard w/caramelized sugar crust)I can't comment on that because I didn't order that.\n\nFor me,I ate less than half of my meal because the noodles kept getting stuck in my braces. So I decided to take the remaining of my food to go. When the waiter came, I had told him that I wanted my food to go and he said ok and started to clean the table. When the waiter attempted to gather all of the dishes, he dropped a fork and it almost landed on my friend!! When I noticed that he had put two used  plates on my food,I reminded him that I wanted my food to go. The waiter  looked at me and said \"oh shit\" and continued to clean. When he came back, he said \"you don't want that food still? Right?\" I said no because you put dirty dishes in my food. Then he said that he could give me a dessert and I declined because I wanted the rest of my dinner. At that point I was shocked that he had the nerve to ask me if I wanted dessert instead asking me if he could remake my dinner. I could honestly say, he never asked me if I would like them to remake my dinner. Now I know it didn't cost that much to make my dinner, not because the ingredients are cheap but because they have cheap labors. \n\nWhen we received the bill, we noticed that he  didn't comp my meal or anything on the bill. As soon as we slipped a credit card with the bill, the waiter came right away to charge us. After he charged the credit card, he said that he overcharged us and had to void the first transaction. We didn't and couldn't understand why he kept talking to the manager and avoided eye contact with us for the remanding time we spent there, I would say it was awkward. Maybe they were  thinking, avoid the Asian people and they won't make a big deal about it!!!\n\nNow that I wrote my review, its up to you if you still want to check this place out. If you do decide to try this place out, I hope your food and service is better than ours and double or triple check your bill. What I mean by that is make sure the amount on the bill is the same amount when you sign your receipt .As for me, it was my first time there and my very last time there!!", "rating": 1, "date": "2013-04-26"}, {"excerpts": ["I ended up ordering the Linguine del Pescatore, it came with mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce. ", "The dish was very light and had a great flavor to it. ", "The noodles was made aI dente, which I like. "], "author": "Nhung T.", "review": "I like this place because it had outdoor seating. The service here was okay, but one of the waiter was pretty funny. I ended up ordering the Linguine del Pescatore, it came with mussels, clams, calamari, prawns & fresh fish in garlic tomato sauce. The dish was very light and had a great flavor to it. The noodles was made aI dente, which I like. I thought the dish was a little bit bland, but if you add some parmesan cheese and pepper flakes it makes it a little better (dish was $23).\n\nThe Bruschetta was really good here, great flavor.", "rating": 3, "date": "2011-04-07"}], "margherita": [{"excerpts": ["Great margherita pizza and wine list."], "author": "Alec S.", "review": "Friendly and knowledgeable staff. Great margherita pizza and wine list.", "rating": 5, "date": "2018-03-27"}, {"excerpts": ["Margherita pizza was bland as well and the soup. ", "I had high hopes for this place especially in little Italy. ", "Oh well I guess better luck next time."], "author": "Foodie S.", "review": "Staff was friendly. Food was bland. Even the dessert wasn't authentic. As soon as the hostess said the pasta was made fresh I was ready to try out this place. The chicken parmigiana tasted too fried. You could taste the oil which isn't what should be tasted, it should be the food. I had to add Parmesan cheese to give the food flavor. Tried out my friends food too and wasn't great either. Margherita pizza was bland as well and the soup. I had high hopes for this place especially in little Italy. Oh well I guess better luck next time.", "rating": 3, "date": "2013-02-13"}, {"excerpts": ["We started with Carpaccio prime beef tenderloin, arugula, shaved parmigiano, capers, truffle oil & grilled bread & Margherita pizza fresh tomatoes, basil & extra virgin olive. "], "author": "Kerstin B.", "review": "How we found this Italian delight in the middle of little Italy! \n\nI took my sister and mother to San Fran for their Birthdays last April. We were on a Cable Car and asked where do the locals go for really good Italian? We were told the The Stinking Rose. My sister piped in \"oh yeah my friend at work said we should go there, it was SO good\". Without hesitation we asked for directions. We took the bus down Columbus from our hotel as far as we could go. We started walking and most of the restaurants on Columbus have outside seating. So as we are walking we can see what everyone is serving, and the smells Divine. \n\nWe walk past Trattoria Pinocchio and the food looked amazing, we stopped and glanced at the menu and thought it might be pricey for lunch. We continued on to the Stinking Rose. Mind you all of the restaurants were pretty busy. We arrived at the Rose and it was dead, the menu looked blah and the prices were the same as Trattoria Pinocchio. The icing was when another guest came out while we were looking at the menu and said \"don't eat here it's not very good\". Game over we went back up Columbus to Trattoria Pinocchio. \n\nSOOOO glad we did. \n\nWe started with Carpaccio prime beef tenderloin, arugula, shaved parmigiano, capers, truffle oil & grilled bread & Margherita pizza fresh tomatoes, basil & extra virgin olive. Delizioso! \n\nMy sister ordered a bloody mary that she demanded I try, I don't like bloody mary's now I do damn that was good! I had to get a couple of my own yes I'm on vacation people! \n\nI had the Ossobuco braised veal shank served with saffron risotto & sautéed vegetables, my taste buds love me soo. This was the best Ossobuco I have had since it was home made for me. \n\nMy sis had Tortellini alla Boscaiola meat tortellini with peas, mushrooms & prosciutto in a cream sauce. Outstanding choice. \n\nMy mother had Ravioli di Salsiccia Our house made sausage ravioli served with a porcini cream sauce. Amazing! \n\nWe all shared with each other and had a fantastic meal, we sat outside it was a beautiful day. Our fob (translation fresh off boat) Italian waiter was a shit but we didn't care the food came quickly and it was incredible. He just had a funky attitude like we were beneath him or something. That's fine we tipped accordingly. He will soon learn how you make a buck in the US. \n\nI would give it more than 5 stars but that is all they let us do on yelp! Tourist and locals....I recommend you go here you won't regret it! Most authentic Italian, more on the Sicilian side I have had in a long time. \n\nPiacere il Pasto! Enjoy the meal in Italian. lol : )", "rating": 5, "date": "2009-06-20"}, {"excerpts": ["My Girlfriend got the Pizza Margherita. ", "It was smothered in globs and globs of cheese that looked and tasted like the cheapest possible product they could get their hands on . ", "It was flavored heavily with sage and lots and lots, and LOTS of salt. ", "There were flavorless, unripe diced tomatoes and green herb flakes sprinkled all over the top.. ", "yuck.(I tried it and all night long I felt as if I had drunk a glass of salt)  ", "She couldn't eat more than one piece. ", "When the busser came to remove our \"finished\" plates and saw the not-eaten pizza they didn't ask her if she wanted it to go; they must have known how terrible it was.  ", "They simply don't serve good quality Italian food and they know it. ", "This place is EXPENSIVE and what you get is  embarrassing!!  "], "author": "craig v.", "review": "I thought of the perfect sign for the outside of this place. It would be a picture of Pinocchio with his nose extending all the way down the block, and a speech bubble beside his head, saying, \"The food is delicious here!\"  It would be appropriate, as only a real liar would say such a thing.\n \nThree of us went to dinner here the other night. We wanted to go to Pulcinella, which may have the best Italian   food in the area, but they were closed.  I have tried, since our visit, to try and think of ways to bump my review up to 2 stars, but it isn't possible. \nShame on these people for ripping off tourists with their horrible food.(I refuse to believe that any locals frequent this place).\n\nWe were really hungry.  They did seat us and take our orders right away. Each entree was hovering at around 17-25 dollars. The waiter may have been Italian, I don't know or care, but he certainly was playing the part of an Italian..dancing around and singing O Sole Mio..(didn't impress us, but whatever.)\n\nTwo of us ordered chicken parm entrees. The menu said that  we could get it with either mixed veggies or pasta but the waiter said it would be much easier for them to make pasta as it was late...so fine. They brought us some cold, hard, tough bread with cold butter. We didn't eat much of it.  When the entrees  arrived,  and I am using tactful language here, they were over-salted and had sauce from cans..no love or care in its presentation. Had it been 4 dollars I would have just thought \"ok--it's bad, but it's cheap\", but this was bad and expensive..The pasta was overcooked and the sauce on it tasted canned.  I'm Italian. I cook a lot. I know canned sauce when I am unfortunate enough to taste it.  \n\nMy Girlfriend got the Pizza Margherita. It was smothered in globs and globs of cheese that looked and tasted like the cheapest possible product they could get their hands on . It was flavored heavily with sage and lots and lots, and LOTS of salt. There were flavorless, unripe diced tomatoes and green herb flakes sprinkled all over the top.. yuck.(I tried it and all night long I felt as if I had drunk a glass of salt)  She couldn't eat more than one piece. When the busser came to remove our \"finished\" plates and saw the not-eaten pizza they didn't ask her if she wanted it to go; they must have known how terrible it was.  They simply don't serve good quality Italian food and they know it. This place is EXPENSIVE and what you get is  embarrassing!!  If I were to open a place and serve this kind of fare  to people I would be ashamed. \n\nDo yourselves a favor and  avoid this place, unless you really don't care what you are eating or how much you are spending---or unless you want to hear the shameless waiter singing and dancing IN YOUR FACE for his tips as the swill they serve up is being brought to your table.\n\nRemember folks,  in literature, Pinocchio is a well known fib teller. Don't believe him when he says that the food is good here! Go to Pulcinella's. Or Gepetto's...or Mcdonald's.. Or skip dinner and go to sleep early. You won't be missing anything. When you wish upon a star, I suggest wishing to be transported to any other restaurant.", "rating": 1, "date": "2011-05-09"}, {"excerpts": ["I've had the pizza margherita and brunch here, been happy with each visit."], "author": "Gary D.", "review": "Always get the same thing when I come here - Linguine with clams (vongole).  Favorite Italian place to get this dish.  I've had the pizza margherita and brunch here, been happy with each visit.", "rating": 4, "date": "2010-06-21"}, {"excerpts": ["We sat down and ordered a round and a margherita pizza. ", "The waiter actually came BACK to our table to ask us to order more because it \"cost him more for us to sit there than he would make.", "\" ", "WHAT? ", "As an ex-slave to the restuarant business, i was appalled. ", "He then did not come back to our table the rest of the night and after we asked the bus boy for our bill, he rudely dumped it on our table and walked away. ", "I will never be coming back to this place, we complained to the owner. ", "Ive had some bitchy waiters, but he took the cake."], "author": "Erin F.", "review": "Me and a few of my friends came in here for some yummy pizza and drinks. We sat down and ordered a round and a margherita pizza. The waiter actually came BACK to our table to ask us to order more because it \"cost him more for us to sit there than he would make.\" WHAT? As an ex-slave to the restuarant business, i was appalled. He then did not come back to our table the rest of the night and after we asked the bus boy for our bill, he rudely dumped it on our table and walked away. I will never be coming back to this place, we complained to the owner. Ive had some bitchy waiters, but he took the cake.", "rating": 1, "date": "2007-02-15"}], "pepperoni": [{"excerpts": ["Pepperoni pizza. ", "Rivaled Tony's. "], "author": "Ryan G.", "review": "Tonight was our last night in SF, and we were jones-ing for Little Italy after walking through yesterday after riding the trolley. The atmosphere was inviting and we had a perfect booth/table that felt private but great for taking in the action.\n\nWe started with a Caesar salad that was the best I've had in a while - heavy on parmesan and just the right amount of bite. For main course, we shared 3 entrées between the 4 of us:\n\n1) Ravioli stuffed with sausage in cream sauce. DIVINE\n\n2) Penne with pancetta in light red sauce - wonderful.\n\n3) Pepperoni pizza. Rivaled Tony's. Seriously good\n\nWe then capped it with a piece of Tiramisu that was light and flavorful, and enjoyed a bottle of Sangiovese throughout.\n\nThe owner (?) was serenading a group next to us with his singing - felt very authentic! \n\nHighly recommend.", "rating": 5, "date": "2015-07-05"}, {"excerpts": ["We ordered Ravioli di Salsiccia and a pepperoni pizza, but they were just.... average. ", "For the ravioli, the sauce was really good, but the ravioli itself wasn't cooked very well. ", "It was slightly hard, and I didn't understand why the inside was so soggy and bland. ", "For the pizza, I feel like I would've been better off at Domino's or Pizza Hut. "], "author": "Paul C.", "review": "Two words: below par.\n\nI was there with my friends after roaming around Little Italy area, trying to figure out where to eat. We decided to give this place a try, and got seated. The ambience was pretty quaint, and the service was really good, but the food was not. We ordered Ravioli di Salsiccia and a pepperoni pizza, but they were just.... average. For the ravioli, the sauce was really good, but the ravioli itself wasn't cooked very well. It was slightly hard, and I didn't understand why the inside was so soggy and bland. For the pizza, I feel like I would've been better off at Domino's or Pizza Hut. It looked like a cafeteria pizza, if I'm honest.\n\nBottom line: this restaurant is more for tourists. If you are searching for a high-quality Italian food, I recommend Tommaso's. Similar price, but the taste/quality difference is massive.", "rating": 2, "date": "2013-08-09"}, {"excerpts": ["The pepperoni pizza could only be described as boring. "], "author": "Susie W.", "review": "Two of us got the \"menu\" which includes a basic (cheap) pasta and small salad. My friend loved the penne arrabiata and my linquine with pesto was good, and enough for two meals. $13 seemed kind of expensive to me but I guess you're paying for the corner North Beach location.\n\nThe pepperoni pizza could only be described as boring. (If you're having a pizza jones skip the ambiance and head for Golden Boy on Green St)\n\nThe 11 year old couldn't say enough good things about the lasagna and scarfed it up before anyone could have a bite.\n\nOnce the restaurant got busy the service got more disorganized although it was ok. This restaurant could be called a \"safe bet\" but I would definitely try other places next time - especially because the bread was just so so.", "rating": 3, "date": "2007-07-13"}], "vegetariano": [{"excerpts": ["We had a vegetariano pizza and gnocchi. "], "author": "Divya K.", "review": "Great little gem in North Beach! After walking down the streets of little Italy for a while we stumbled upon this place. What attracted us to it was the large selection of pasta, some with white sauce  which we absolutely adore. There was a 45 minute wait when we got inside -- they made us sit at the bar which wasn't bad;-). We had a vegetariano pizza and gnocchi. The gnocchi was just out of this world -- it was delicious, the sauce was thick and creamy and the gnocchi itself was succulent. \n\nThe pizza tasted so good -- it came with fresh vegetables and herbs. This restaurant even offers a generous serving of bruschetta and butter cubes to start with. We were so full at the end of the meal and decided to skip dessert. We can't wait to bring family over the next time we are in the area. \n\nAmbiance is lovely. The seating is comfortable . Mostly suited for a couple or a small party because of it's size.", "rating": 4, "date": "2010-05-22"}], "pizza al tonno": [], "ai  formaggi": [], "stagioni": [{"excerpts": ["Went for the Pizza Quattro Stagioni and a draft Moretti beer... and here we go... ", "the unremarkable bland dough was uneven, deep pan on its \"South East\", burnt and solid as a Rivita biscuit on its \"North\". ", "The California South-of-the-Border pizzaiolo burnt the salami slices too...", "but it was OK as he buried his crime under a cheap and salty ham. ", "As Italian server Mariano, was very simpatico we pardoned him, but the owner should taste his own pizza before selling it to human beings ", "(Note: pizza not apt for animal testing either)... also a 15% service charge magically appeared on my check...", "And I could not even check the papers as Pinocchio has not Wi-Fi either...", "Oh, well...as I said, should ran for my life ", "but I did not..."], "author": "Pablo D.", "review": "\"Lasciate ogni speranza, voi ch'entrate\" (abandon all hope, you who enter here) Dante Alighieri, Inferno. I should follow my gut feeling and escape at once, after seeing all those half full plates returning to the kitchen... but I didn't... The front of house lady was fast and efficient. Went for the Pizza Quattro Stagioni and a draft Moretti beer... and here we go... the unremarkable bland dough was uneven, deep pan on its \"South East\", burnt and solid as a Rivita biscuit on its \"North\". The California South-of-the-Border pizzaiolo burnt the salami slices too...but it was OK as he buried his crime under a cheap and salty ham. As Italian server Mariano, was very simpatico we pardoned him, but the owner should taste his own pizza before selling it to human beings (Note: pizza not apt for animal testing either)... also a 15% service charge magically appeared on my check...And I could not even check the papers as Pinocchio has not Wi-Fi either...Oh, well...as I said, should ran for my life but I did not...", "rating": 1, "date": "2015-08-10"}, {"excerpts": ["We ordered the Insalata di Spinaci, Risotto Seafood, Linguine con Vongole e Cozze and the biggest  4 Stagioni Calzone.  ", "Each entree was so delicious. ", "The Italian herbs and flavors were of this world and popped with every bite. ", "Not to mention that yummy Italian bread. ", "Our waiter was very nice and accommodating.  ", "Everyone that worked at the restaurant was friendly including the fabulous Chefs. ", "We were very happy with Trattoria Pinocchio.  ", "We'll definitely be back."], "author": "T R.", "review": "I have been wanting to go to Trattoria Pinocchio for a while now.  My husband took me and a friend there for Mother's Day.  We were greeted by the manager who was very friendly.  We didn't have reservations and did not have to wait for a table.  The restaurant is beautifully decorated with a lot of room inside or you can choose to sit outside.  The menu selection is wonderful with a lot to choose from to satisfy your palate.  We ordered the Insalata di Spinaci, Risotto Seafood, Linguine con Vongole e Cozze and the biggest  4 Stagioni Calzone.  Each entree was so delicious. The Italian herbs and flavors were of this world and popped with every bite. Not to mention that yummy Italian bread. Our waiter was very nice and accommodating.  Everyone that worked at the restaurant was friendly including the fabulous Chefs. We were very happy with Trattoria Pinocchio.  We'll definitely be back.", "rating": 5, "date": "2016-05-10"}, {"excerpts": ["The 4 Stagioni Pizza was tasty but wasn't really all that special.  ", "We had a reservation, but they weren't ready for us even though we checked in 20 minutes early.  ", "We ended up freezing outside.  ", "Their heat lamps didn't reach to the other side of our tables.  ", "This place isn't really meant for large groups.  ", "The inside is really small and the bar only seats six people.  ", "The Italian waiter was charming and helpful."], "author": "Hoa Q.", "review": "The prices have gone up by two dollars for each item on the online menu.  Their portions are large, but I'm not sure it's worth the price.  The 4 Stagioni Pizza was tasty but wasn't really all that special.  We had a reservation, but they weren't ready for us even though we checked in 20 minutes early.  We ended up freezing outside.  Their heat lamps didn't reach to the other side of our tables.  This place isn't really meant for large groups.  The inside is really small and the bar only seats six people.  The Italian waiter was charming and helpful.", "rating": 3, "date": "2007-07-24"}], "calzone del boscaiolo": [], "olives onions garlic pesto eggplant tomato": [], "bell peppers artichokes mushrooms salami pepperoni anchovy": [], "gorgonzola proscuitto fresh fior di latte mozzarella": [], "chicken parmigiana": [{"excerpts": ["I tried a bite of the veal lasagna and the chicken parmigiana. ", "Both were good. ", "My bf thought the lasagna was just ok but huge portion ", "so he was stuffed.  ", "And our friend gets his standby spaghetti bolognese. ", "I thought the prices were pricy but average for SF, I suppose.  ", "Service was so-so. ", "We were left alone for a while at the end of meal when we were trying to get drink refills and the check."], "author": "Alison W.", "review": "This is one of my friend's standbys in SF for a meal. They serve pretty classic Italian food. We made a reservation on yelp but they were not too busy while we were there on a weekend night. I liked that they offer a variety of homemade pastas. I got the gnocchi pesto. I don't usually get pesto because I prefer tomato based sauces. Nut they sold me on homemade pesto. The first few gnocchi melted in my mouth like fluffy pillows. It was delicious. The pesto was great. I sopped up a lot of it with the complementary bread. My main complaint is that it's not very texturally diverse so it became harder to eat as I got deeper into the dish. All the gnocchi are the same texture. Though as it got colder, it didn't melt in my mouth as easily. The pesto sauce, while tasty was just saucy. They tried to add texture with pine nuts sprinkled in there but it wasn't enough. That's why I tried to have the bread with the pesto sauce too. Maybe if you were to get this, I would split this and another entrée with someone else. So you could try it but not have to eat a whole plate of it. I tried a bite of the veal lasagna and the chicken parmigiana. Both were good. My bf thought the lasagna was just ok but huge portion so he was stuffed.  And our friend gets his standby spaghetti bolognese. I thought the prices were pricy but average for SF, I suppose.  Service was so-so. We were left alone for a while at the end of meal when we were trying to get drink refills and the check.", "rating": 3, "date": "2018-06-27"}, {"excerpts": ["As for me, I especially enjoy the Chicken Parmigiana.\n\n"], "author": "Shona M.", "review": "Pinocchio's is our favorite spot in North Beach. Upon arrival, my husband and I are reminded of just why with the charm of the Italian decor and the aromas of authentic Italian foods coming from the kitchen. The owner, Chef Giovanni and the staff remember us and always welcome us like old friends.  \n\nThe food here is simply addicting. When short on time, we pop in for at least an appetizer of Bruschetta or the Polenta con Funghi. There is a nice selection of wines and signature cocktails. (My guilty pleasure is the Limoncello Lemon Drop.) \n\nThe homemade pastas are absolutely delicious. My husband's favorite dish is the Ossobuco. As for me, I especially enjoy the Chicken Parmigiana.\n\nIf you are looking for an authentic Italian meal with a warm atmosphere and excellent service you will not be disappointed!", "rating": 5, "date": "2018-03-06"}, {"excerpts": ["My bf wanted the chicken parmigiana, and he thought it was ok ", "(he's from Boston ", "so I think it is hard to compare to the good East coast food he grew up with), but I thought it was ok too.  ", "Service was ok too.  ", "They interrupted our conversation kind of rudely a couple times, and they seemed to focus their customer service energy on a table of Italian girls near us.  ", "Plus, they did not bring us water even after we asked a couple times.  ", "In fact, we had to pour our own water from a pitcher next to us instead - yeah, customer service was just ok.  ", "I'm not sure I'd come back based on our overall dining experience."], "author": "Maile N.", "review": "We were hungry after seeing Beach Blanket Babylon, and this place was within walking distance.  We had the fried calamari, and it had good flavor.  My bf wanted the chicken parmigiana, and he thought it was ok (he's from Boston so I think it is hard to compare to the good East coast food he grew up with), but I thought it was ok too.  Service was ok too.  They interrupted our conversation kind of rudely a couple times, and they seemed to focus their customer service energy on a table of Italian girls near us.  Plus, they did not bring us water even after we asked a couple times.  In fact, we had to pour our own water from a pitcher next to us instead - yeah, customer service was just ok.  I'm not sure I'd come back based on our overall dining experience.", "rating": 3, "date": "2015-08-08"}, {"excerpts": ["I had Chicken Parmigiana and Canapelli Pomodoro. ", "My mouth is watering again just thinking of it. ", "Yum! ", "Really great. ", "Will definitely go again when in San Fran."], "author": "Emily M.", "review": "We had a party of 10 that turned into 20. Made reservations only a few hours before then within 30 minutes of our arrival time we had to up the number and they were so accommodating!! \nI had Chicken Parmigiana and Canapelli Pomodoro. My mouth is watering again just thinking of it. Yum! Really great. Will definitely go again when in San Fran.", "rating": 5, "date": "2014-10-22"}, {"excerpts": ["I ordered the Chicken Parmigiana and the BF ordered the Chicken Saltimboca.  ", "Both dishes were full of flavor and exceeded my expectations.  ", "I love accidentally stumbling into delicious restaurants.  ", "Definitely a place I'd come and eat again!"], "author": "TRACY R.", "review": "We were forced to find a restaurant with outside seating since we had our dog with us and stumbled into this delicous italian haven.  It wasn't busy during lunch time on a weekday so wait staff were extra attentive.  They even brought my dog water!  So sweet!  I ordered the Chicken Parmigiana and the BF ordered the Chicken Saltimboca.  Both dishes were full of flavor and exceeded my expectations.  I love accidentally stumbling into delicious restaurants.  Definitely a place I'd come and eat again!", "rating": 4, "date": "2012-04-06"}, {"excerpts": ["We ordered the calamari and the chicken parmigiana. ", "The sauces on both were phenomenal. ", "We loved the food but the service was just okay."], "author": "Erin M.", "review": "My husband and I came here by recommendation. We ordered the calamari and the chicken parmigiana. The sauces on both were phenomenal. We loved the food but the service was just okay.", "rating": 4, "date": "2014-01-08"}, {"excerpts": ["I had the Chicken Parmigiana and some red wine.  "], "author": "Robert A.", "review": "We stopped in here for dinner with a large party and we were sat as soon as we walked in on a Friday night. The place was dimly lit and very intimate, though I was there with about 12 people it was the perfect setting.   I had the Chicken Parmigiana and some red wine.  The staff was great in dealing with our party and we did not have to wait long for service.\n\nI do not usually like italian food, but this placet changed my mind, absolutely fantastic!\n\nIf you are in the bay area, this is a must for dinner!", "rating": 5, "date": "2011-08-11"}, {"excerpts": ["Our lunch entrees were Penne Arrabbiata, Lasagna Francesco, Linguine Calamari, Linguine al Pesto (now that looked very good - I'll be trying that next time!), Scampi Saut (which I had - Yu-UMMY!!!!!), and Chicken Parmigiana.\n\n"], "author": "Michael O.", "review": "We had a very sweet, very gay, Northern Italian waiter.  The best kind of waiter, in my view (... ok, except for Noel at Slanted Door)!\n\nToday we came here for a working lunch; we ordered:\n\nFor appetizers, the boss ordered Calamari Fritti, Bruschetta, and Insalata Caprese.  Our lunch entrees were Penne Arrabbiata, Lasagna Francesco, Linguine Calamari, Linguine al Pesto (now that looked very good - I'll be trying that next time!), Scampi Saut (which I had - Yu-UMMY!!!!!), and Chicken Parmigiana.\n\nThe prices range from $12 for pasta dishes all the way up to $22 for a filet mignon.\n\nI don't have a big problem with these prices, but I almost took one star off for the tactless little blip at the bottom of the menu \"Minimum 1 order per person\".  Does this mean I can't bring my sweetie in here and share an appetizer?  We both have to order one in order to be allowed to eat here?\n\nNow, that, my fellow yelpers, is simply poor form.\n\nI love our working lunches; we always wind up talking about the weirdest things (strip clubs, ex's, weird 3rd world countries ... random stuff)!", "rating": 4, "date": "2006-08-04"}, {"excerpts": ["The chicken parmigiana tasted too fried. ", "You could taste the oil which isn't what should be tasted, it should be the food. ", "I had to add Parmesan cheese to give the food flavor. ", "Tried out my friends food too and wasn't great either. "], "author": "Foodie S.", "review": "Staff was friendly. Food was bland. Even the dessert wasn't authentic. As soon as the hostess said the pasta was made fresh I was ready to try out this place. The chicken parmigiana tasted too fried. You could taste the oil which isn't what should be tasted, it should be the food. I had to add Parmesan cheese to give the food flavor. Tried out my friends food too and wasn't great either. Margherita pizza was bland as well and the soup. I had high hopes for this place especially in little Italy. Oh well I guess better luck next time.", "rating": 3, "date": "2013-02-13"}, {"excerpts": ["Chicken Parmigiana wasn't very good at all. ", "It was the thinnest piece of chicken I've ever had, there was no taste, it was dry, and the breading was soft. ", "Did not taste fresh at all."], "author": "A A.", "review": "Chicken Parmigiana wasn't very good at all. It was the thinnest piece of chicken I've ever had, there was no taste, it was dry, and the breading was soft. Did not taste fresh at all.", "rating": 2, "date": "2014-07-09"}, {"excerpts": ["Only had the chicken parmigiana "], "author": "Anna E.", "review": "One word: YUCK.\n\nOnly had the chicken parmigiana but it tasted like Costco chicken nuggets with some pretty bad marinara sauce.\n\nOnly good thing about this place is that you can sit outside and people watch.", "rating": 2, "date": "2009-12-01"}, {"excerpts": ["I had the chicken parmigiana ", "and I got the roasted veggies ", "and they were so tasty this was an excellent choice! ", "we sat outside and were admiring the moon and the whole ambiance was great! ", "I will definitely come back, I give them 4 stars because the service was just okay! ", "and the spaghetti a la carbonara was not good at all. ", "But other than that it was great!"], "author": "Luis P.", "review": "After walking around couple of times we decided to eat here. The food was really tasty! I had the chicken parmigiana and I got the roasted veggies and they were so tasty this was an excellent choice! we sat outside and were admiring the moon and the whole ambiance was great! I will definitely come back, I give them 4 stars because the service was just okay! and the spaghetti a la carbonara was not good at all. But other than that it was great!", "rating": 5, "date": "2012-07-05"}, {"excerpts": ["I ordered the chicken parmigiana, it looked good when the plate arrived but the chicken was tough and rubbery, I hardly ate any of it. ", "It is probably the worst chicken parmigiana I've ever had. ", "The prices were ok, not too expensive ", "so I guess you get what you pay for. ", "Thankfully we had a bottle of wine and a salad ", "so I wasn't starving. ", "But considering how many awesome Italian restaurants there are in SF, you should def skip this. ", "My husband had the ravioli's and said they weren't that great. ", "Oh well."], "author": "Kimberly R.", "review": "We went here on a whim, out in NB and hungry and seemed ok. The service was good, wine selection was good but the food was disappointing. I ordered the chicken parmigiana, it looked good when the plate arrived but the chicken was tough and rubbery, I hardly ate any of it. It is probably the worst chicken parmigiana I've ever had. The prices were ok, not too expensive so I guess you get what you pay for. Thankfully we had a bottle of wine and a salad so I wasn't starving. But considering how many awesome Italian restaurants there are in SF, you should def skip this. My husband had the ravioli's and said they weren't that great. Oh well.", "rating": 2, "date": "2012-02-19"}, {"excerpts": ["For our entrées, we ordered the Chicken Parmigiana and the Fettucine con Salmone. ", "Both were delicious. ", "Portion size was perfect. "], "author": "K L.", "review": "What an awesome meal.\n\nIt is hard to choose a place to eat when you're craving Italian food in Little Italy. By random, my boyfriend and I decided to dine at Trattoria Pinocchio on a Friday night. We sat at one of the outside tables. The waiter was friendly and attentive. For our entrées, we ordered the Chicken Parmigiana and the Fettucine con Salmone. Both were delicious. Portion size was perfect. For dessert, we ordered the Vanilla Creme Brule with two espressos, which was the perfect way to end such a wonderful meal. Definitely don't judge this place by their bread, honestly, it isn't that good, but everything else was fantastic!", "rating": 4, "date": "2011-04-11"}, {"excerpts": ["The second night I had the Chicken Parmigiana which was also delicious.   \n\n"], "author": "Anthony W.", "review": "Quaint place in North Beach.  Friendly and funny staff; especially manager Enzo.  Went here twice for dinner while on vacation in San Francisco.  Had the Fettuccine with Salmon the first night; it was amazing!  The second night I had the Chicken Parmigiana which was also delicious.   \n\nHighly recommended for everyone!  I'm definitely returning next time I'm in San Francisco", "rating": 4, "date": "2010-07-25"}, {"excerpts": ["My friend had chicken parmigiana that was bland in my taste.  ", "Maybe this part of Italy doesn't use a lot of flavor.  ", "I've also heard that American Italian is more rich in flavor than authentic Italian, so I may be accustomed to the more garlic infused flavorful Italian.  ", "Also, the service was lacking.  ", "We were left waiting for our main course for over 20 minutes and nothing to drink."], "author": "Rachel S.", "review": "I don't know exactly what other Sicilian cooking I've had, but this definitely doesn't top my list of Italian Restaurants.  The Seafood Pasta I ordered was just OK. My friend had chicken parmigiana that was bland in my taste.  Maybe this part of Italy doesn't use a lot of flavor.  I've also heard that American Italian is more rich in flavor than authentic Italian, so I may be accustomed to the more garlic infused flavorful Italian.  Also, the service was lacking.  We were left waiting for our main course for over 20 minutes and nothing to drink.", "rating": 3, "date": "2008-07-29"}], "chicken al limone": [{"excerpts": ["He ordered the chicken al limone and I got the lamb chops. ", "My chops came out still breathing... ", "I asked the waiter to put it in for a little longer and it came out perfect the second time. ", "His chicken was really good... ", "Creamy, lemony, and velvety good sauce. "], "author": "Lynn H.", "review": "My friend and I were searching for yummy Italian food and we figured what better place than Little Italy. It was hard trying to figure out which restaurant we wanted to try, so I'm glad we picked this one. \n\nWe sat outside and the waiter came around promptly and asked us for our drink orders. As tempting as the drink/wine list looked, I was hungover earlier in the morning and really couldn't take another drop of alcohol (a story for another time). \n\nWe order the octopus appetizer. It was tasty but on the fishy and salty side. I guess that should have been what I expected from a seafood dish. He ordered the chicken al limone and I got the lamb chops. My chops came out still breathing... I asked the waiter to put it in for a little longer and it came out perfect the second time. His chicken was really good... Creamy, lemony, and velvety good sauce. My side of spinach and mushrooms was also very good. \n\nThe waiter and the maitre d' were both Italian and very friendly. The maitre d' even danced a little for us! Nice place. Would definitely go back if I was in the area again.", "rating": 4, "date": "2011-04-27"}, {"excerpts": ["You have to try the Chicken al Limone - it's absolutely delicious. ", "Not a huge fan of the raviolis, but the fresh bread totally makes up for it. ", "Be sure to meet Michele; he's such a charming Italian man. "], "author": "Stacy G.", "review": "This place is great. You have to try the Chicken al Limone - it's absolutely delicious. Not a huge fan of the raviolis, but the fresh bread totally makes up for it. Be sure to meet Michele; he's such a charming Italian man. He can guarantee you a great time and will provide you with top-notch service.\n\nWhen you do come here, don't forget to make a visit to the bar. The bartender, Nick, is as talented as he is charming as he is smokin' hot. Try his lemon drop martini -- you'll love it!", "rating": 4, "date": "2011-04-17"}, {"excerpts": ["I had the chicken al limone with pasta instead of potato. ", "The chicken itself was wonderful, in a velvety, lemony sauce. ", "I was afraid it was going to be a thin sauce (something I could make at home with EVOO and lemons and garlic) ", "but it much better. ", "Not too creamy, but not very oil-based either. ", "The pasta was good, too. ", "Spaghetti with red sauce. ", "But, my only qualm was that it was served on the same plate! ", "My red sauce was getting all mixed in with my lemon sauce and it was just weird. ", "I would have preferred to have it in a small bowl on the side. "], "author": "christine c.", "review": "Came here on a week night. Service was slow and sporadic. The bread was good, the water glasses were full (the bus boy was great) and my meal was better than mediocre but not over-the-top.\n\nPortions were good sized and the prices were right. I had the chicken al limone with pasta instead of potato. The chicken itself was wonderful, in a velvety, lemony sauce. I was afraid it was going to be a thin sauce (something I could make at home with EVOO and lemons and garlic) but it much better. Not too creamy, but not very oil-based either. The pasta was good, too. Spaghetti with red sauce. But, my only qualm was that it was served on the same plate! My red sauce was getting all mixed in with my lemon sauce and it was just weird. I would have preferred to have it in a small bowl on the side. Thought that my chicken was going to come with some veggies, too, but I guess that's not an option when you swap out the potato. \n\nEveryone else in my party liked their raviolis and other pastas, but no one was raving. Much better than some of the other touristy places and pretty cute, but nothing to write home about.\n\nWould go back, though. Lasagna looks delicious...", "rating": 3, "date": "2011-08-03"}, {"excerpts": ["(sorry, don't know what term to use to accurately describe it), mushroom soup and their chicken al limone.  ", "Would recommend everything so far."], "author": "j d.", "review": "Found a new place in North Beach!  Have been there a couple time now and have enjoyed both visits.  Need to go back and try their pizza and pasta.  Have tried their steak (yum!) which I don't see on their online menu and was served with a subtle/complex tomato 'sauce' (sorry, don't know what term to use to accurately describe it), mushroom soup and their chicken al limone.  Would recommend everything so far.", "rating": 4, "date": "2013-07-18"}, {"excerpts": ["Bruschetta (very garlicky, very good but soggy), Chicken al Limone (great!), Pollo Alfredo (mediocre), Osso Bucco (slightly above average), Caesar Salad (pretty good). ", "Prices are pretty reasonable, I think, for North Beach. ", "They did however mess up our order, and they're pretty stingy with the bread on take-outs."], "author": "Rohan N.", "review": "Got some dishes for takeout. Bruschetta (very garlicky, very good but soggy), Chicken al Limone (great!), Pollo Alfredo (mediocre), Osso Bucco (slightly above average), Caesar Salad (pretty good). Prices are pretty reasonable, I think, for North Beach. They did however mess up our order, and they're pretty stingy with the bread on take-outs.", "rating": 3, "date": "2008-10-01"}], "chicken saltimboca": [{"excerpts": ["I ordered the Chicken Parmigiana and the BF ordered the Chicken Saltimboca.  ", "Both dishes were full of flavor and exceeded my expectations.  ", "I love accidentally stumbling into delicious restaurants.  ", "Definitely a place I'd come and eat again!"], "author": "TRACY R.", "review": "We were forced to find a restaurant with outside seating since we had our dog with us and stumbled into this delicous italian haven.  It wasn't busy during lunch time on a weekday so wait staff were extra attentive.  They even brought my dog water!  So sweet!  I ordered the Chicken Parmigiana and the BF ordered the Chicken Saltimboca.  Both dishes were full of flavor and exceeded my expectations.  I love accidentally stumbling into delicious restaurants.  Definitely a place I'd come and eat again!", "rating": 4, "date": "2012-04-06"}, {"excerpts": ["We had Chicken Saltimboca, Linguini Pesto, Mushroom and Sausage Ravioli and Gnocchi in the white sauce. "], "author": "Rick F.", "review": "Bathrooms: Clean! \nAtmosphere: Happening! \nService: Above average!\nI would go back and recommend it to my friends and family!\n\nReservation for 4 at 8pm on a Saturday! Sat immediately! \n\nFood was exactly what I would expect from an Italian restaurant in North Beach.\n\nWe had Chicken Saltimboca, Linguini Pesto, Mushroom and Sausage Ravioli and Gnocchi in the white sauce. Appetizer was a Crab and Scallop Ravioli all very good served hot.\n\nI would go back and recommend it to my friends and family!\n\nRick", "rating": 3, "date": "2007-11-18"}], "tiramisu": [{"excerpts": ["The tiramisu was my favorite part of dinner and perhaps one of the biggest reasons I would come back here!\n\n"], "author": "Margarita V.", "review": "Went there with a 5 star review mindset but came out settling for 3.5... \n\nThe service was great, everything was served quickly. But most the actual food and drinks werent as good as i was hoping for. My gin martinis were a little bland, i was hoping my 2nd one would make up for the 1st one but they were both just ok. The calamari had a nice crunch perfectly cooked but not much flavor unless you dipped it in the sauces.\n\nMy friend and I shared the entire dinner because we wanted to have variety. The chicken parm and spaghetti were disappointing because i honestly thought their simple dishes should be the easiest to make good impressions with right? Not in this case.\n\nThe seafood dish was amazing tho. Fresh seafood, perfect pasta, etc. Just wish the rest of the meal was on the same level.\n\nThe tiramisu was my favorite part of dinner and perhaps one of the biggest reasons I would come back here!\n\nI would recommend this place for the good service, nice ambiance, and fabulous seafood. Just get a glass of wine instead because you always know that will be good ;)", "rating": 4, "date": "2017-08-03"}, {"excerpts": ["and I got the vegetarian ravioli and the tiramisu. ", "Make sure you get cheese on the ravioli. "], "author": "Pavan K.", "review": "gf and I got the vegetarian ravioli and the tiramisu. Make sure you get cheese on the ravioli. Both were phenomenal. \n\nThe bread came out warm, but the butter was ice cold! I don't get why a restaurant would do that. I expect that from the dollar menu but not at a high end restaurant.", "rating": 4, "date": "2018-02-22"}, {"excerpts": ["After that we had coffee with cannolis and their signature tiramisu. ", "I'm still having dreams about the tiramisu, it's their signature dish for a reason!"], "author": "Grace H.", "review": "I had the Spagetti alla Bolognese and it was to die for! Sauce was perfect and pasta was amazing. After that we had coffee with cannolis and their signature tiramisu. They make their own cannoli filling and it showed!! That was one of the best cannolis I've ever had and cannolis are my favorite dessert. I'm still having dreams about the tiramisu, it's their signature dish for a reason!", "rating": 5, "date": "2018-06-02"}, {"excerpts": ["We then capped it with a piece of Tiramisu that was light and flavorful, and enjoyed a bottle of Sangiovese throughout.\n\n"], "author": "Ryan G.", "review": "Tonight was our last night in SF, and we were jones-ing for Little Italy after walking through yesterday after riding the trolley. The atmosphere was inviting and we had a perfect booth/table that felt private but great for taking in the action.\n\nWe started with a Caesar salad that was the best I've had in a while - heavy on parmesan and just the right amount of bite. For main course, we shared 3 entrées between the 4 of us:\n\n1) Ravioli stuffed with sausage in cream sauce. DIVINE\n\n2) Penne with pancetta in light red sauce - wonderful.\n\n3) Pepperoni pizza. Rivaled Tony's. Seriously good\n\nWe then capped it with a piece of Tiramisu that was light and flavorful, and enjoyed a bottle of Sangiovese throughout.\n\nThe owner (?) was serenading a group next to us with his singing - felt very authentic! \n\nHighly recommend.", "rating": 5, "date": "2015-07-05"}, {"excerpts": ["The tiramisu was good. \n\n"], "author": "Hugo M.", "review": "We sat down in the outside patio, and the nice hostess turned on the heater for us.  I liked the romantic Italian music that complimented the atmosphere well to create a relaxing ambiance. The waiter came to greet us and take our drink orders. I ordered a capuccino. It came done properly as I would expect.\n\nThen, I ordered the Marsala. The chicken was done well, and did not come dry, the vegetables were steamed the right amount, and the potatoes were delicious as well. \n\nThe Marsala sauce was very good and not too sweet. \n\nService was nice. But the waiter could have been more attentive.  The restaurant was not that busy. The busser compensated for that. Our waiters name was Stephano and the busser's name was Luis. \n\nThe tiramisu was good. \n\nOverall, it was a good experience.", "rating": 4, "date": "2016-02-06"}, {"excerpts": ["My wife and I had the tiramisu and the Rum Baba cake. ", "The tiramisu, which is always good even out of a box, was terrible. ", "It tasted like an egg flan and lacked any coffee flavor. ", "Between the two of us we were only able to eat 40% before giving up. ", "The Rum cake was more of a bread, which may be on par for the culture, but it too was devoid of its many ingredient,  RUM. ", "In addition, the ice cream had ice in it. ", "Which meant it was stored improperly or was old. ", "At the end of the day, there are plenty of dessert options in that area, choose another."], "author": "Eric M.", "review": "This review is based solely on my dessert experience. I did not eat any dinner. That being said, this was a very disappointing experience.  My wife and I had the tiramisu and the Rum Baba cake. The tiramisu, which is always good even out of a box, was terrible. It tasted like an egg flan and lacked any coffee flavor. Between the two of us we were only able to eat 40% before giving up. The Rum cake was more of a bread, which may be on par for the culture, but it too was devoid of its many ingredient,  RUM. In addition, the ice cream had ice in it. Which meant it was stored improperly or was old. At the end of the day, there are plenty of dessert options in that area, choose another.", "rating": 2, "date": "2017-06-30"}, {"excerpts": ["The tiramisu was to die for!"], "author": "Mary D.", "review": "We ate an early supper at a window side table. Burrata for an appetizer and some of the best Rissoto I ever had. The Ciopino was also delightful. The tiramisu was to die for!", "rating": 5, "date": "2017-04-06"}, {"excerpts": ["For dessert we ordered tiramisu and Spumoni ice cream. ", "The tiramisu was 'beh' but the spumoni ice cream was DELICIOUS! \n\n"], "author": "Shyam R.", "review": "Went as a part of a large group. The waiter was very attentive and warm! Food is great here- Fresh ingredients. We ordered carpaccio for appetizers. They were great. I order d the veal piccata which was cooked to perfection, some of the others ordered pesto gnocchi, chicken saltimbocca and the chicken limone. All of us thought the food was excellent. For dessert we ordered tiramisu and Spumoni ice cream. The tiramisu was 'beh' but the spumoni ice cream was DELICIOUS! \n\nOverall a good restaurant at North Beach to eat at. The wait time for food could be improved- but I understand it's an Italian thing!", "rating": 4, "date": "2015-06-06"}, {"excerpts": ["So anyways it tasted O.K. \n\nDesert: nothing I can say - once again, my friend did take a tiramisu and rated it like 4/5. "], "author": "Dave C.", "review": "So let's begin; \n\nSo when we went to go find a restaurant, we fell apon \nThis restaurant. So I decided that I should rate this restaurant by food, drinks, service, etc. So let's begin: \n\nService: 5/5 - the waiters were super nice and friendly. Not only that, but with there Italians and had the accent, we felt like we were almost in Italy! (well not really, duh!) \n\nDrinks: nothing I can say - I ordered a standard drink: Sprite. But my friend orderd a type of vodka that he told me he rated 4/5 on. Don't take my word for this! \n\nFood: 3.5/5 I ordered there standard pizza (alot of mozzerella, tomatos and green leafs on it). It felt soggy maybe due to the fact there was a lot of stuff on it but anyways the dough was soggy. The cheese will ALWAYS fall off the pizza like if it was liquified. Usally the pizza and cheese should melt into your mouth but it basically melted infront of me. So anyways it tasted O.K. \n\nDesert: nothing I can say - once again, my friend did take a tiramisu and rated it like 4/5. It did have alot of coffee in it. Don't take my word for this. \n\nSo to conclude I have to rate it 4/5. I should recommend this restaurant but with some precautions.. I have not tasted there other foods like there pastas etc.) so if your reading this at there restaurant, go and continue ordering your food! Not to mention that it was hot inside but we got use to it in minutes. Enjoy!", "rating": 4, "date": "2015-06-28"}, {"excerpts": ["Best tiramisu ever! ", "Can't wait to come back."], "author": "Valerie M.", "review": "From the moment we walked in the door we felt like we were home. With the wonderful aromas that filled the air to the warm greetings from the staff we were truly welcomed . The bartender Zabit is very friendly and engaging in conversation and our waiter Jimmy was superb . The house made lemoncello is fabulous. The food and desserts are out of this world. Best tiramisu ever! Can't wait to come back.", "rating": 5, "date": "2016-05-23"}, {"excerpts": ["Their Tiramisu was nothing to write about, but it was still better than Mara's down the street."], "author": "Anson G.", "review": "Bottom Line: Still the best lasagna I've had.\n\nThe veal lasagna is the best lasagna.  You can tell the noodles were hand crafted, and the ragu prepared with care.  You can actually taste the rich goodness that is the ragu.  It is a saucy and meaty lasagna, but not a cheesy one.\n\nWe also had a veggie risotto, and it was very light and tasty.  Not what you expect when you get a risotto, but it was a pleasant contrast to the heavier lasagna.  \n\nAgain, their service was friendly and helpful.  I thought it was awesome how one waiter kept talking to us in Italian - and then he would translate (if he could) when we couldn't pick up on the phrases we couldn't understand.\n\nTheir Tiramisu was nothing to write about, but it was still better than Mara's down the street.", "rating": 5, "date": "2010-09-01"}, {"excerpts": ["Please leave room for the cannoli and tiramisu  ", "-- You will not be disappointed.  ", "Everything was fresh, flavorful and authentic.  ", "Our teenagers  LOVED their food and my daughter wants to go back there tomorrow night for her birthday so she can have everything again!!  ", "The service was spot on and friendly from the waiter, hostess and the chef was very gracious and humble when we \"gave compliments to chef\".  ", "Make sure you check out the chef cooking in the back of the restaurant  ", "-- you'll see how fresh everything really is!!"], "author": "Sue C.", "review": "We wanted a great Italian Restaurant in Little Italy while on vacation in SF.  We walked until we found one that looked authentic with decor and menu.  We were not disappointed!!  The pasta is made from scratch and you can tell!  I had the tortellini stuffed with veal in a cream sauce with peas, mushrooms and pancetta.  Excellent!!  My husband enjoyed the lasagna made with veal.  Please leave room for the cannoli and tiramisu  -- You will not be disappointed.  Everything was fresh, flavorful and authentic.  Our teenagers  LOVED their food and my daughter wants to go back there tomorrow night for her birthday so she can have everything again!!  The service was spot on and friendly from the waiter, hostess and the chef was very gracious and humble when we \"gave compliments to chef\".  Make sure you check out the chef cooking in the back of the restaurant  -- you'll see how fresh everything really is!!", "rating": 5, "date": "2017-06-29"}, {"excerpts": ["Our favorite plates are insalata tricolore, gnocchi enzo, tiramisu & limoncello...the list goes on. ", "We highly recommend."], "author": "Mark K.", "review": "My fiance and I just had our wedding reception tasting with Giovanni. He and the staff instantly make you feel like family. Our favorite plates are insalata tricolore, gnocchi enzo, tiramisu & limoncello...the list goes on. We highly recommend.", "rating": 5, "date": "2015-02-13"}, {"excerpts": ["Finally the Tiramisu - heaven!  ", "Top it off with the house Chianti & I've died and gone to heaven.   ", "Great meal on the last day of a great trip :-)"], "author": "Denise N.", "review": "Amazing food - thoroughly enjoyed the Carbonara (pasta is made on prem daily and it SHOWS).  Even the bread was fantastic (reminded me if my dear departed Italian grandmothers with the perfect thick crust).  Finally the Tiramisu - heaven!  Top it off with the house Chianti & I've died and gone to heaven.   Great meal on the last day of a great trip :-)", "rating": 5, "date": "2014-03-01"}, {"excerpts": ["We stopped for Pizza for the kids and we felt so welcomed that we ordered wine, brushetas , beer and a home made tiramisu which was delicious ... ", "We were even offered a lemmochelo for after dinner drink ... ", "Thank you for making our day a memorable one !!! ", "Highly recommend it!!"], "author": "Yuni N.", "review": "Excellent service and food!! Great ambiance!  Ended up in this restaurant after having a terrible experience in \"Chinatown Restaurant\".. The service and food here changed our day.. We stopped for Pizza for the kids and we felt so welcomed that we ordered wine, brushetas , beer and a home made tiramisu which was delicious ... We were even offered a lemmochelo for after dinner drink ... Thank you for making our day a memorable one !!! Highly recommend it!!", "rating": 5, "date": "2015-07-31"}, {"excerpts": ["Finished the meal with espresso and a creamy Tiramisu. ", "This will be our weekend ending dinner on the times we return to SF."], "author": "D F.", "review": "A March evening, sitting outside under the heaters, listening to Italian tenors sing....ambience was perfect! The meal started with a Caprices salad with the BEST Balsamic vinegar I've ever tasted followed by Butternut Squash Ravioli in a cream sauce; all of it superb! Finished the meal with espresso and a creamy Tiramisu. This will be our weekend ending dinner on the times we return to SF.", "rating": 5, "date": "2015-03-08"}, {"excerpts": ["The tiramisu was great, as was the cappuccino. ", "We'll be back!"], "author": "Randal C.", "review": "I love the North Beach! My wife and I wanted to get a cappuccino and share a dessert, so we parked the car on Columbus and walked up to Vallejo. We saw the Trattoria Pinocchio's outdoor cafe-style tables, and asked if we could sit outside and order some dessert.\n\nThe waiter was clearly Italian and very friendly.\n\nThe service was perfect...very European. They didn't keep coming back, interrupting our conversation, and trying to find ways to get a bigger tip. When we needed help, we asked...and received it.\n\nThe tiramisu was great, as was the cappuccino. We'll be back!", "rating": 5, "date": "2010-11-20"}, {"excerpts": ["BEST tiramisu I've had since I came back from Italy. "], "author": "Angel T.", "review": "BEST tiramisu I've had since I came back from Italy. It's homemade and simply heavenly.\n\nMy friend and I shared the magherita pizza, which was pretty decent- the crust was more like American pizzas, but aside from that, it fared pretty well with the original magherita pizza. \n\nAlso had the minestrone soup, which was pretty delicious.\n\nThe restaurant itself is adorable- had a very authentic and cozy feel to it! The waiters were extremely friendly and the owner runs around the restaurant singing (in Italian, and he's pretty good!) to both the guests and his employees.\n\nDefinitely one of the better restaurants in North Beach!", "rating": 4, "date": "2012-05-13"}, {"excerpts": ["The creme brulee and tiramisu were divine.  "], "author": "Pam S.", "review": "I happened upon Trattoria Pinocchio not long after I moved to the bay area- some \"friends\" were in town and we were looking for a place to eat.  I still have no idea how we ended up here, but it's always been one of my favorites.\n\nAlthough who my company has been has changed each time I've come here, there is one item I always get- the polenta with bolognese sauce.  If you don't know what polenta is, it's basically grits.  If you don't know what grits are, well, I don't know what to tell you.  Growing up in Nevada, I shouldn't really know what grits are, but somehow I do.  I found out about polenta from my italian stepfather (or mom's husband #2), and Pinocchio makes it better than most other places, I've found.\n\nThe rest of the menu is pretty extensive for italian food (being Irish, I'm not really the expert), and I always find a wine I like.  The entrees are always delicious, and the portions are good.  The creme brulee and tiramisu were divine.  The staff, all Italian, can sometimes be hard to understand, but it adds to the ambiance.\n\nAlthough the economy is rough, this is a place I will consistently support because I have always had a wonderful time here.\n\nDefinitely recommend.", "rating": 5, "date": "2009-01-15"}, {"excerpts": ["For dessert, we split the tiramisu and it was one of the best I've ever had. \n\n"], "author": "Colleen W.", "review": "I was a little disappointed with this place and it all stemmed from the service. \n\nThe location was great. We were offered outdoor seating which provided us with great people watching. There were heat lamps to keep us warm on a chilly night. \n\nThe server was borderline rude when we asked for wine suggestions. He said \"it depends what you like. a wine is a wine and you might like it or not.\" Seriously? No recommendations for your extensive wine list? Dude: you didn't even take the time to ask for our preference to give a proper recommendation. \n\nWhen we ordered our selection and asked for it to be decanted, instead of saying yes, he spouted that there is a fee for it and questioned our request. We had ordered a $50 wine.  Dude: You could have played that a little better. I think the cost was around $2. You could have said, \"just so you're aware, we charge a minimal fee\". It was a little embarassing to question us over it. \n\nWhen he brought the decanted wine over to our table, it splashed onto my guest's shirt!  Dude: you could have at LEAST comp'd the $2 fee for that stain. \n\nFortunately, the owner (or so the hostess told us) came by our table to say hello. I think he may have recognized my guest. He was very personable and made a good impression on us. I don't know if this had anything to do with the poor service we had received prior to meeting him. However, he wasn't there to apologize or anything so I'm not sure. \n\nOnto the food: \nThe complimentary bread wasn't anything special. I guess I'm spoiled by the amazing bakeries in San Francisco because I found the bread basket to be dull and a little stale. \n\nThe Antipasti platter was fantastic with a variety of delicious cured meats, cheeses, olives, and carby treats. \n\nWhen I decided to go out for Italian food in North Beach, I was on a mission to have Linguine with clams. The Linguine con Vongole e Cozze hit the spot! I ordered mine with all clams and they  happily accommodated my request. \n\nFor dessert, we split the tiramisu and it was one of the best I've ever had. \n\nOverall assessment: The service we received really spoiled what could have been a great meal. I feel that it's generous to give three stars but the food was really good.", "rating": 3, "date": "2010-08-18"}, {"excerpts": ["We split tiramisu for desert and it was very very good. ", "Next time I will try the gnocci. ", "I recommend this restaurant for good Sicilian eats."], "author": "Christy G.", "review": "Loved it! My boyfriend and I came to San Fransisco for a long weekend from Portland, we came with goals of eating great seafood and italian, pinocchio was definetly some good Italian! I had a ceasar salad (a little pricy) and vegetable lasagna which was incredible, my boyfriend had mixed salad and fettuchini Alfredo with chicken.. Also great but not as good as the lasagna. We split tiramisu for desert and it was very very good. Next time I will try the gnocci. I recommend this restaurant for good Sicilian eats.", "rating": 5, "date": "2012-11-30"}, {"excerpts": ["Afterwards, go with the tiramisu for dessert.\n\n"], "author": "Alex C.", "review": "I went into this place with heavy skepticism and left thoroughly impressed. At first glance it seems like a magnet for douchebags looking for a pseudo-upscale meal. Well, maybe it is... but I didn't really care once their wait-staff seated us and paid careful attention to us the whole night.\n\nWhile you wait for your entree, try the bruschetta. Afterwards, go with the tiramisu for dessert.\n\nTrattoria Pinocchio features great food, impressive portions, reasonable prices and very friendly service... what's missing? Nothing if you ask me.\n\nI've been trying to not give out as many 5 star ratings, but I just can't find anything to complain about with this place. It's even close to a cheap parking garage!", "rating": 5, "date": "2006-11-01"}, {"excerpts": ["The pasta was tasty, they frequently hooked a brotha up with some water, and made me grin like an idiot with a delicious tiramisu.  ", "Everyone wins."], "author": "Teej T.", "review": "Ugh, North Beach restaurants in SF are SOOOO for tourists.\n\nOh wait, I'm from L.A./San Diego.  Damnit.\n\n'twas delicious, and delightful company, including Yelp SF's very own Kirk B.  Huzzah.\n\nThe pasta was tasty, they frequently hooked a brotha up with some water, and made me grin like an idiot with a delicious tiramisu.  Everyone wins.", "rating": 4, "date": "2008-06-17"}, {"excerpts": ["The tiramisu was great, the creme brulee was yummy - but the best was the poached pears in DARK CHOCOLATE SAUCE. ", "Omg. ", "Why have I never ordered these before??? "], "author": "Amie S.", "review": "We had wanted to have some North Beach Italian for dinner all weekend - I was skeptical about this place because of the location and name, but the high ratings on Urban Spoon, the fact that we were tired and STARVING and that it wasn't super crowded drove us in here for dinner. \n\nWe started with Bruschetta and some red wine (of course!). Mmm-mmm. Good appetizer. In fact, everything was good - the only thing stopping me from giving it 5 stars was that I think I ordered the blandest dish: Ravioli Pomodoro (Spinach/Ricotta). It was good, but not to die for. However, I had some bites of my friends' Fettuccine Pollo Alfredo and the special w/Sausage and they were both SO TASTY. \n\nAfter dinner, the waiter brought us all complimentary Limoncello (SCORE!), and we ordered 1each of the deserts. The tiramisu was great, the creme brulee was yummy - but the best was the poached pears in DARK CHOCOLATE SAUCE. Omg. Why have I never ordered these before??? They were amazing. \n\nI'm marking this as a good dinner place in SF - there were a lot of restaurants around the area that looked cheesy/touristy, but this one proved itself to be better than its name.", "rating": 4, "date": "2008-07-31"}, {"excerpts": ["Top it off with some tiramisu or spumoni!"], "author": "Alyssa E.", "review": "My boyfriend and I wanted to do something nice and decided last minute to go to the city for the night and get some yummy food. We dressed up and he made reservations at Pinocchio's. The service was great and the food was so delicious. I had the Cioppino (spelling??). The sauce was thick and full of fresh garlic and herbs. MMMMM. We toasted with champagne and enjoyed each others company in low, romantic lighting. If you go to North Beach soon, try this place. You won't be disappointed.\nWe stayed there until almost 11pm so if you are hungry and you think it's too late to stop by for a meal, think again! Perfect place for a filing late night dinner. Top it off with some tiramisu or spumoni!", "rating": 4, "date": "2009-05-07"}, {"excerpts": ["The restaurant gave us fruity champagne to celebrate and the tiramisu was light, layered in fluffy cream, soft ladyfingers and rich in amaretto and coffee liqueur. ", "I'll always remember this place. ", "(sigh)"], "author": "Ready To Be S.", "review": "My sweetie proposed to me here so I must give it 5 stars for the locale. I had the parpadelle bolgonese. The noodles appeared homemade and the meat sauce was fantastic. I could taste the red wine and it must have been sitting on the stove for hours. The restaurant gave us fruity champagne to celebrate and the tiramisu was light, layered in fluffy cream, soft ladyfingers and rich in amaretto and coffee liqueur. I'll always remember this place. (sigh)", "rating": 5, "date": "2009-01-04"}, {"excerpts": ["The tiramisu, on the otherhand, was well made.  ", "I would recommend ordering this!\n", "Price: ", "Two glasses of wine, bruschetta, spaghetti with bolognese and tiramisu = $52.00.\n", "Overall: Average Italian experience.  ", "If I was to return, I will definitely order something different.  ", "There were other items on the menu that sounded great, but I was just in the mood for some spaghetti with bolognese sauce."], "author": "T P.", "review": "I came here on a Tuesday evening with two co-workers during a medical conference.  Surprisingly, it wasn pretty vacant.  I was expecting an amazing experience as I read great reviews in magazines and on yelp. Here is my feedback:\nService: very great, responsive.  My co-worker drinks a lot of water and they made the best effort to re-fill his glass.  \nAmbience: average.  We had a table by the window which became distracting with the pedestrians and cars.  Our table was next to the bar.\nFood: average.  My co-worker and I ordered the spaghetti with bolegnese sauce.  We both thought it was ok.  We also ordered the calamari and bruschetta.  They both were average.  The tiramisu, on the otherhand, was well made.  I would recommend ordering this!\nPrice: Two glasses of wine, bruschetta, spaghetti with bolognese and tiramisu = $52.00.\nOverall: Average Italian experience.  If I was to return, I will definitely order something different.  There were other items on the menu that sounded great, but I was just in the mood for some spaghetti with bolognese sauce.", "rating": 3, "date": "2011-09-14"}, {"excerpts": ["For dessert we had their chocolate moose and tiramisu.  ", "Moose was delicious.  ", "skip the Tiramisu and get something else instead.\n\n"], "author": "Marcia B.", "review": "how do we say \"not worth it\" in Italian?\n\n1.  the hostess was going to add a chair to the tiny table next to the entrance door to seat us 3.  we told her that we'd wait for a better table.\n\n2.  we got a great table outside right under the heater.\n\n3.  waiter took 10 mins. to come to us.  bread and water took another 5.  waiter didnt offer or suggest any wine.\n\n4.  they forgot our salad.  Only one of the appetizer came.  salad was made in haste and the dressing was all vinegar.\n\n5.  main course was decent.  i ordered their Osobucco which was good except 1/2 of it was fatty.  my sis ordered sea bass.  it was a bit over cooked.  it wasn't soft and flaky.   the sauce tasted good.   My bro-in law ordered their crab ravioli which was really good.  If only it wasn't drenched in sauce.  the sauce should be light since the falvour of the crab is rich enough and it should come through.\n\nFor dessert we had their chocolate moose and tiramisu.  Moose was delicious.  skip the Tiramisu and get something else instead.\n\n6.  their coffee was cold.  i asked for hot coffee and the waiter was very apologetic and gave me great hot coffee....  except it came after we finished out dessert.\n\n7.   they got so busy that they started putting tables everywhere.  felt a bit sleazy/cheap.\n\nThey have potential.  hope they improve on the details.", "rating": 2, "date": "2007-09-04"}], "cannoli": [{"excerpts": ["They make their own cannoli filling and it showed!! ", "That was one of the best cannolis I've ever had and cannolis are my favorite dessert. "], "author": "Grace H.", "review": "I had the Spagetti alla Bolognese and it was to die for! Sauce was perfect and pasta was amazing. After that we had coffee with cannolis and their signature tiramisu. They make their own cannoli filling and it showed!! That was one of the best cannolis I've ever had and cannolis are my favorite dessert. I'm still having dreams about the tiramisu, it's their signature dish for a reason!", "rating": 5, "date": "2018-06-02"}, {"excerpts": ["My friend and I sat at the bar and enjoyed White Russian coffees, cannoli and creme brulee. ", "Our bartender was very friendly and helpful. ", "Gave us lots of suggestions for places to see while we're in San Francisco. ", "Would like to come back and try dinner here."], "author": "Tina B.", "review": "Stopped in for an after dinner drink and dessert. My friend and I sat at the bar and enjoyed White Russian coffees, cannoli and creme brulee. Our bartender was very friendly and helpful. Gave us lots of suggestions for places to see while we're in San Francisco. Would like to come back and try dinner here.", "rating": 4, "date": "2016-10-10"}, {"excerpts": ["The cannoli is the best I have ever had and I have tasted probably 50 or more in other places. ", "This place is a must try! ", "It is my new favorite restaurant!"], "author": "Melissa L.", "review": "The best Italian food ever! Great service ambiance and homemade pasta. The owner and chef is from Italy. The cannoli is the best I have ever had and I have tasted probably 50 or more in other places. This place is a must try! It is my new favorite restaurant!", "rating": 5, "date": "2016-04-21"}, {"excerpts": ["Please leave room for the cannoli and tiramisu  ", "-- You will not be disappointed.  ", "Everything was fresh, flavorful and authentic.  ", "Our teenagers  LOVED their food and my daughter wants to go back there tomorrow night for her birthday so she can have everything again!!  ", "The service was spot on and friendly from the waiter, hostess and the chef was very gracious and humble when we \"gave compliments to chef\".  ", "Make sure you check out the chef cooking in the back of the restaurant  ", "-- you'll see how fresh everything really is!!"], "author": "Sue C.", "review": "We wanted a great Italian Restaurant in Little Italy while on vacation in SF.  We walked until we found one that looked authentic with decor and menu.  We were not disappointed!!  The pasta is made from scratch and you can tell!  I had the tortellini stuffed with veal in a cream sauce with peas, mushrooms and pancetta.  Excellent!!  My husband enjoyed the lasagna made with veal.  Please leave room for the cannoli and tiramisu  -- You will not be disappointed.  Everything was fresh, flavorful and authentic.  Our teenagers  LOVED their food and my daughter wants to go back there tomorrow night for her birthday so she can have everything again!!  The service was spot on and friendly from the waiter, hostess and the chef was very gracious and humble when we \"gave compliments to chef\".  Make sure you check out the chef cooking in the back of the restaurant  -- you'll see how fresh everything really is!!", "rating": 5, "date": "2017-06-29"}, {"excerpts": ["We got the cannoli and the mousse. ", "The server really saved our experience and made it more enjoyable. ", "However, the host might have been enough for us to never go back."], "author": "Denise C.", "review": "Okay, so I'm giving this restaurant two stars for only one reason. The red-haired host is to blame. I have never met someone that is so rude; I usually let people slide on rudeness for the most part because I am passive, but she was just terrible.\nFirst, she put us at a small table when there was five of us. She said there was no other tables in the restaurant (except the four open ones I saw in the back five minute later on my way to the bathroom). We said we would wait. My mother-in-law was freezing and wanted to move. We said we were willing to wait. She responded by saying it wasn't cold in the restaurant and we were lucky to even be getting a table. Not good business manners in my opinion. Then my mother-in-law that the restaurant felt cold to her and she wanted to move regardless. The host then rolled her eyes, turn and walked away. To add to the kicker as she was walking away she said very loudly \"oh Jesus Christ.\" I think she didn't think we would hear, but we did. So rude. Then she went up to the host stand and complained to a server about us. Small restaurant and this was very obvious. When my mother-in-law got up to talk to her to tell her she was being rude to us, she responded that we were being rude. Does she not understand that we are the customers and she needs to be accommodating. I'm not saying that moving us wasn't going to be a little bit of a hassel, but I mean come on.\nThe server on the other hand was a doll. I can't remember his name. I think he said he has worked there three years. He apologized for her. His service was fantastic. Very sweet and attentive. The food was good as well. Everyone was satisfied with their meals. And the dessert is some of the best i've tasted. We got the cannoli and the mousse. The server really saved our experience and made it more enjoyable. However, the host might have been enough for us to never go back.", "rating": 2, "date": "2010-07-13"}, {"excerpts": ["For desert we ended up enjoying several more Black Russian Capucino's and an order of cannoli.  ", "The coffee drinks here are just over the top good, and the cannoli was once again very, very good.\n\n"], "author": "Jeff K.", "review": "We first happened upon Trattoria Pinocchio the other evening while looking for someplace to enjoy a coffee drink and a connoli.  The manager was standing outside the front door, and with a welcoming smile and a booming voice with an Italian accent invited us inside.\n\nWe each enjoyed a Black Russian Cappucino and a connoli.  The coffee drinks were very, very good, and the connoli was delightful and delicious.  We decided to make dinner. reservations for the following evening.\n\nWhen we arrived for dinner we decided to eat outside, and our hostess made sure the patio heater over our table was working.  It was a great place to enjoy the last of a great summer day and some people watching.  We order calamari for an appetizer, along with a bottle of red wine, which seemed very reasonably priced.  The calamari came with two sauces, a spicey red sauce as well as a pretty standard tasting tartar sauce.  It was well prepared, lightly breaded and very good.\n\nThe bartender had told us the evening before that they make all of their own pasta. I ordered the lobster and crabl ravioli and my wife ordered the veal and porcini ravioli.  My ravioli were delicious and I felt the sauce was perfect, and my portion was just right for me.  My wife thought her ravioli were delicsious, but thought the sauce was a tad too rich when combined with the already pretty rich veal.  She very much enjoyed it though.  For desert we ended up enjoying several more Black Russian Capucino's and an order of cannoli.  The coffee drinks here are just over the top good, and the cannoli was once again very, very good.\n\nOur service was perfect, and there is not much room for improvement.  Our water was kept topped off, and someone showed up just in time to keep our wine glasses full as well.  We were allowed to enjoy a very liesurely pace and linger with our coffee drinks afterwards as we interacted with some of the great staff.  It seems that most of the staff is very much Italian and very passionate about the quality of food that they are serving.\n\nThough there are some other great looking choices for Italian in the North Beach area this place really impressed us and we will visit again when in the San Francisco area.", "rating": 4, "date": "2009-06-24"}], "vanilla creme brule": [{"excerpts": ["For dessert, we ordered the Vanilla Creme Brule with two espressos, which was the perfect way to end such a wonderful meal. ", "Definitely don't judge this place by their bread, honestly, it isn't that good, but everything else was fantastic!"], "author": "K L.", "review": "What an awesome meal.\n\nIt is hard to choose a place to eat when you're craving Italian food in Little Italy. By random, my boyfriend and I decided to dine at Trattoria Pinocchio on a Friday night. We sat at one of the outside tables. The waiter was friendly and attentive. For our entrées, we ordered the Chicken Parmigiana and the Fettucine con Salmone. Both were delicious. Portion size was perfect. For dessert, we ordered the Vanilla Creme Brule with two espressos, which was the perfect way to end such a wonderful meal. Definitely don't judge this place by their bread, honestly, it isn't that good, but everything else was fantastic!", "rating": 4, "date": "2011-04-11"}], "poached pear al cioccolato": [], "chocolate mousse": [{"excerpts": ["Super fresh pasta, had the gnocchi pesto was so good and so soft, then to top it off complimented with the best Manhattan and because I love my sweet things a super chocolate Mousse"], "author": "Claire C.", "review": "Super fresh pasta, had the gnocchi pesto was so good and so soft, then to top it off complimented with the best Manhattan and because I love my sweet things a super chocolate Mousse", "rating": 5, "date": "2018-10-27"}, {"excerpts": ["Chocolate mousse was horrible with 70 % of wipe cream. ", "I was wondering were was the chocolate. "], "author": "Jeff L.", "review": "Very disappointing experience last night. We go to this restaurant five to six time a year because I like their carbonara even if everything is over priced. Driving 50 miles for that.\n\nFood was average for the first time and I was sick after eating their carbonara.\n\nWaiter did not introduce himself and was not in good mood.\n\nWaiter did not want to serve pizza because he told us that we have to wait for 30 minutes. I never told him that it was a problem but pushed us to change our mind.\n\nWe ordered a tomato mozzarella for my daughter instead of a pizza. We asked without basil and pesto. 15 minutes later he came with the tomato mozzarella with pesto and basil on it. We asked him to change it, he told us it was not his fault.\n\nWe started eating and 10 minutes later the tomato mozzarella came.\n\nChocolate mousse was horrible with 70 % of wipe cream. I was wondering were was the chocolate. 7 dollars for that unbelievable.\n\nDecaf served cold. Ice tea refiled and served to my son. Waiter did not remember that it was my glass.\n\nWaiter added 15 % for the service for no reason. I asked him to remove it because I was very disappointed and commented my experience as requested on the bill.\n\nHorrible experience of one of my favorite restaurant before.\n\nOver priced, bad service, I won't go again.", "rating": 1, "date": "2012-07-08"}, {"excerpts": ["We finished it all with a lovely chocolate mousse desert and a round of limoncello, again poured by the generous singing waiter!  ", "We felt like we were in Italy!  ", "Highly recommend for food, ambiance and great service.  ", "Be sure to sit outside if the weather is warm enough."], "author": "Carol F.", "review": "We arrived in Little Italy with no specific plan for dinner and were lured into the restaurant by a very convincing hostess who told us we were going to love it.  She was right!  We started with the heirloom tomato and buratta salad which was excellent, tomatoes were so sweet and juicy.  Then we each had the homemade pasta dishes, mine was the spinach and ricotta ravioli, my husband had the ciopppino and a sid order of pasta bolonese, both delicious and my daughter had the gnocchi Enzo, which was light and fluffy, but he sauce was a little too rich, she was wishing she had chosen a lighter tomato based sauce.  We also had a wonderful bottle of wine which ended too soon so our singing waiter went into the bar and poured us all another glass on the house!  It was great!  We finished it all with a lovely chocolate mousse desert and a round of limoncello, again poured by the generous singing waiter!  We felt like we were in Italy!  Highly recommend for food, ambiance and great service.  Be sure to sit outside if the weather is warm enough.", "rating": 5, "date": "2015-09-09"}], "tartufo affogato": [{"excerpts": ["Looking forward to the tartufo affogato, and definitely planning to return!"], "author": "Dawn F.", "review": "Amazing dinner and service! Meant to post a picture of my delicious lemon chicken, but devoured it too quickly!! Looking forward to the tartufo affogato, and definitely planning to return!", "rating": 5, "date": "2016-03-16"}], "spumoni ice cream  biscotti": [], "lemon sorbeto": [], "biscotti": [{"excerpts": ["Ordered some dessert of coffee and spumoni ice cream with biscotti.  ", "The coffee was horrible!  ", "It tasted like hot water. ", "It was a good thing I didn't enjoy it since they do not offer refills anyway.  ", "The spumoni ice cream itself was good even though it was a rather small portion with the smallest biscotti I ever saw.  ", "We also overheard the next table decline taking home their leftover portions since they were so disappointed in their entrees.  ", "Will not be returning."], "author": "D S.", "review": "Two stars are only for the nice atmosphere.  Our waiter seemed miserable.  Ordered some dessert of coffee and spumoni ice cream with biscotti.  The coffee was horrible!  It tasted like hot water. It was a good thing I didn't enjoy it since they do not offer refills anyway.  The spumoni ice cream itself was good even though it was a rather small portion with the smallest biscotti I ever saw.  We also overheard the next table decline taking home their leftover portions since they were so disappointed in their entrees.  Will not be returning.", "rating": 2, "date": "2017-06-19"}], "piatti di formaggio e frutta": []}