{"dragon phoenix soup": [], "egg drop soup with spinach": [], "chicken with mix vegetable": [], "mandarin sauce chicken": [{"excerpts": ["I also ordered two luncheon dishes over fried rice: twice-cooked pork, and Mandarin sauce chicken. ", "This is standard Chinese fare. ", "How can you screw it up? ", "But the rice was hard and not puffy. ", "Also, many of the bamboo strips that come with the twice-cooked pork were too fibrous too eat. ", "The bamboo is supposed to be tender, not like chewing toothpicks. ", "The dishes were also very lacking in flavor, and while the prices are not high, they are not remarkably low either."], "author": "Robert H.", "review": "The place looks very bright and clean, and the staff was friendly enough, but the food was just not good. I got takeout. The green onion pancakes were extremely oily. I ate one while it was hot, but I couldn't eat the rest. The fried won-ton were also very oily and soggy, although the filling was tasty.\n\nI also ordered two luncheon dishes over fried rice: twice-cooked pork, and Mandarin sauce chicken. This is standard Chinese fare. How can you screw it up? But the rice was hard and not puffy. Also, many of the bamboo strips that come with the twice-cooked pork were too fibrous too eat. The bamboo is supposed to be tender, not like chewing toothpicks. The dishes were also very lacking in flavor, and while the prices are not high, they are not remarkably low either.", "rating": 2, "date": "2018-07-02"}], "diced chicken with cashew nuts": [{"excerpts": ["And finally (for this excursion):\n\nDiced Chicken with Cashew Nuts.  "], "author": "Jackson B.", "review": "My review is more fun than the others.  Also pretty damn informative.  Read it.  :D\n\nFirst let me praise:\n\nThe Egg Foo Young -  I could eat this _every time_ an egg dish is calling to me.  Of course, breakfast would be a natural fit, but WOW... they make the best EFY.  I could eat it anytime and be just as happy.  \n\nThe chicken variety I had recently was like Chinese Soul Food.  We're talkin' tasty **chicken gravy** over three (seemed more like 4 or 5!) fresh eggs, perfectly cooked, tender and fluffeeee.  The portion was generous enough that you'll either want to split it with a buddy, or have it at home so you can stick it in the fridge and do the aforementioned breakfast thing.  I'm thinkin' WAFFLES on the side would be the ultimate brekkie I could ever have... wow..\n\nA big 5 star stamp * * * * * from me on this dish.  I'm going to eat this everyday the next time I get a cold, which doesn't stand a chance against of Soul Food this Holy. \n\nThen let me get into:\n\nPork Buns!  Excuse me.. *BBQ* Pork Buns!  Holy ****!  I thought having grown up in SF meant I'd had the best PB's by now.  I was wrong!  You actually taste the BBQ-ness in the meat.. none of that unpalatable, slimy fat texture happenin' like what you get at most of the sidewalk dim sum joints; just sweet, tangy unadulterated Bar-Be-Que'd Pork with just the right amount of chewing resistance - not tough, not pablum, but meaty.. the way it should be.  Mine were baked and the pair of perfect brown buns made me feel for one hot second like I was on a beach in Brazil :)  I forgot to remove the semi-invisible white paper on the bottom due to being ravenously hungry.. on the first bun :)  That's ok, a little roughage never hurt anyone.  5 whole stars!  Why?  Read it again.\n\nAnd finally (for this excursion):\n\nDiced Chicken with Cashew Nuts.  Menu-described as: pan fried diced chicken with zucchini, celery and cashew nuts.  Sounds good, huh?  Welp, no celery...\nabout 7 cashews... lots of zucchini! (too much!).  AND, the sauce was watery.  Didn't stick to the above, which means the overall flavor was Bland unless eaten like a stew, with a big ol' spoon.  HOWEVER, once again, my peeps at Tsing Tao came through with the big ass portion.  Ok, maybe if you're hungry enough to hunt down and eat a moose, this would be one meal.  But if you eat like reg'lar folks, this could easily be your lunch and dinner.  Three-ish stars, bordering on 2.5.  Why?  Shaky prep. \n\nBackstory:\n\nMy folks took me here with my bro when we little tykes.  I've been in SF all my life, and it was the 1st place I had Chinese food.  Back in the day, I always seemed to end up with some combo of sizzling rice soup, mongolian beef, sweet and sour prawns or chicken, rice and 7up.  TT has been there awhile now!  The portions have increased in persons-feedable capacity, the food has been great from then to now, and I'm going back again this week.  Moving to Little Russia (about 15 blocks away from the best Chinese food at TT) was a great move.  There's a helluva lot of good food out here.   \n\nSo, by my math, 5 stars + 5 stars + 2.5 stars = 4 stars.  You can check this on your calculator, but I'm right.  They'll probably get 4.5 stars if people wise up to what's good on the menu and quit complaining about their first world problems.  We live like Royalty compared to A LOT of people in the world.  Be glad about it, then shutup and eat.", "rating": 4, "date": "2012-12-04"}], "kung pao  combo": [], "hot braised chicken wings": [], "chicken with house special eggplant": [], "honey walnuts chicken": [{"excerpts": ["I recommend the honey walnuts chicken! ", "It's about $2-3 more expensive than their other entrées, but I would say it's worth it. "], "author": "Mark B.", "review": "I recommend the honey walnuts chicken! It's about $2-3 more expensive than their other entrées, but I would say it's worth it. The chicken is sweet (but not too sweet), the walnuts on the side add a great crunch, and together with fried rice, it will make your taste buds pretty happy. \n\nWhen I lived in the Outer Richmond, Tsing Tao was my go-to restaurant whenever I was too lazy to make dinner for myself. I would order on the phone and within 10 minutes, my meal would be ready. Having that meal ready in 10 minutes is a little sketchy because it makes you question how freshly-made the food is, but when you get as hungry as I do, you tend not to care. \n\nNow, I live in the Outer Sunset where there are more options for Chinese restaurants, but Tsing Tao still remains my go-to restaurant when I am craving Chinese food. It is a $20 minimum for delivery and it generally takes about 25-30 minutes for my food to get to my house. \n\nI would also recommend Tsing Tao for lunch. For their lunch menu, most meals cost no more than $8 and it comes with a decent portion of rice and a good portion of meat. Definitely not a bad place to grab a quick, cheap lunch. \n\nOverall, you can consider me a Tsing Tao regular.", "rating": 4, "date": "2015-01-21"}], "roasted half duck": [], "general taos chicken": [], "orange flavor chicken": [], "chicken mushu": [], "pork mushu": [], "mandarin sauce pork": [], "pork with house special eggplant": [], "pork with asparagus": [], "crystal sparkling water": [], "singaporestyle noodle": [], "soup noodle": [], "rice sticks": [], "original pekingstyle spaghetti": [], "hot plate combination": [], "fried  shrimps": [], "green onion pan cake": [], "foil wrapped chicken": [], "sauteed string bean": [], "fried string bean with chili sauce": [], "braised bean curd": [{"excerpts": ["I ordered a braised bean curd entree which was pretty good, but not anything to rave about.\n\n"], "author": "Rachel T.", "review": "My review is just for the food that I ordered for delivery; I have not been to the restaurant. \n\nMy meal was decent. Wonton soup broth was very good, but the actual wontons were so-so. The chow mein was dry (seriously, why can't any Chinese delivery place in SF get chow mein right?), the potstickers were meh. I ordered a braised bean curd entree which was pretty good, but not anything to rave about.\n\nThe delivery came quite quickly (9pm on Sat night), and the driver was friendly. I'd order from them again, but I'm still on the lookout for a good Chinese delivery in the Sunset/Parkside area.", "rating": 3, "date": "2012-11-05"}], "kung pao bean curd": [], "family style bean curd": [], "black mushroom with bean curd": [], "fried salt and pepper bean curd": [], "beef with mix vegetable": [], "beef with chinese green vegetable": [], "shredded beef with chili sauce": [{"excerpts": ["Some of our regular dishes:\nCrab Meat Puffs\nKung Pao Chicken\nShredded Beef with Chili Sauce (this is particularly tasty)\nString Beans with Chili Sauce\nVegetable Chow Mein\nSpicy Sesame Prawns"], "author": "Martha S.", "review": "Tsing Tao is our regular Chinese delivery place, not least of which because they are so fast it's almost eerie.  Our current theory is they use some kind of time machine to go back and begin cooking your food before you actually order.  It's nice when we spend all evening going, \"I dunno, what do you want for dinner?\" only to discover it's 9:00.  \n\nAnd the food?  Totally solid, reasonably priced, not too greasy, and it avoids the \"every dish drenched in generic brown sauce\" syndrome.  Despite our repeated requests, the food is rarely as spicy as we'd like, but we are a little nuts that way, so I hardly blame them.  \n\nSome of our regular dishes:\nCrab Meat Puffs\nKung Pao Chicken\nShredded Beef with Chili Sauce (this is particularly tasty)\nString Beans with Chili Sauce\nVegetable Chow Mein\nSpicy Sesame Prawns", "rating": 3, "date": "2006-08-24"}], "beef in spicy garlic sauce": [], "beef with asparagus": [], "pot stickers tray": [], "lbs bbq pork chow mein tray": [], "lbs bbq pork fried rice tray": [], "lbs chicken chow mein tray": [], "lbs chicken fried rice tray": [], "lbs mix vegetables with bean curd tray": [], "lbs kung pao chicken tray": [], "lbs salt and pepper pork chop tray": [], "lbs chicken with sesame seed tray": [], "lbs orange flavor chicken tray": [], "lbs broccoli beef tray": [], "fried chicken wings tray": [], "lbs prawn with string bean tray": [], "vegetable and bean curd lunch special": [], "kung po tofu lunch special": [], "hot sauce tofu with pork": [], "hunan tofu lunch special": [], "pork with string bean lunch special": [], "pork with bitter melon lunch special": [], "pork with mixed vegetables lunch special": [], "chicken with mixed vegetables lunch special": [], "curry chicken lunch special": [], "mandarin sauce chicken lunch special": [], "black bean sauce chicken lunch special": [], "chicken with bitter melon lunch special": [], "hot braised chicken wings lunch special": [], "salt and pepper chicken wings lunch special": [], "general taos chicken lunch special": [], "orange flavor chicken lunch special": [], "green pepper beef lunch special": [], "dragon beef lunch special": [], "broccoli prawns lunch special": [], "prawns with black bean sauce lunch special": [], "beef with string beans lunch special": [], "prawns with string beans lunch special": [], "scrambled egg with prawns lunch special": [], "szechuan prawns lunch special": [], "garlic sauce prawns lunch special": [], "mandarin sauce prawns lunch special": [], "chicken asparagus lunch special": [], "beef with asparagus lunch special": [], "prawns with asparagus lunch special": [], "sweet  sour prawns": [], "snow pea prawns": [{"excerpts": ["The Snow Pea Prawns were the culprit for the illness.  ", "This dish didn't even taste very good going down so you can imagine the reverse order.\n"], "author": "Alicia G.", "review": "Worst restaurant ever.  This is going to have to be renamed Tsing Toilet because that's exactly where my meal ended up.\n\nOrdered delivery from here about a month ago and the violent food poisioning that ensued will assure that I never eat anything from Tsing Toilet again.  \n\nHot & Sour Soup was not very hot or sour, it tasted more like beef broth.\nThe Snow Pea Prawns were the culprit for the illness.  This dish didn't even taste very good going down so you can imagine the reverse order.\nGeneral's Chicken- rubbery and gross.\n\nSave your money and order from Hunan Cafe #2!", "rating": 1, "date": "2009-05-05"}], "prawns with scrambled eggs": [], "hot spicy sesame prawns": [], "salt  pepper squid": [], "ginger rock cod": [], "sliced fish with chinese green": [], "sliced fish with black bean sauce": [], "salt  pepper slices fish": [], "crispy fish with garlic sauce": [], "steamed whole fish with ginger  onion": [], "happy family": [{"excerpts": ["We decided to go with Happy Family and Foil Chicken Appetizer. ", "Both were good and filling. ", "Hot tea was served alongside our meal. ", "Service was efficient and attentive despite leaning towards the closing hours, which was much appreciated. "], "author": "Ann S.", "review": "After a long work shift, a quick Chinese sit down or takeout always sounds like a viable solution for convenience. Being that for some strange reason, most restaurants in San Francisco seem to close early, options are quite limited. After hopping around to a couple of closed establishments, I luckily stumbled across Tsing Tao and had 30 minutes to spare before they closed their doors for the night too.\n\nI was quickly directed to choose any seat I wanted. The place was empty so I had first pickings. \n\nThe menu looked pretty standard. There were the regular basic dishes you would normally see at any Chinese restaurant. We decided to go with Happy Family and Foil Chicken Appetizer. Both were good and filling. Hot tea was served alongside our meal. Service was efficient and attentive despite leaning towards the closing hours, which was much appreciated. Service goes a long way and they were able to deliver.\n\nLocated next to Legion of Honor Museum in a quiet neighborhood, this restaurant pushes out towards Ocean Beach. Street parking is available. They accept debit and credit cards too.", "rating": 4, "date": "2018-06-24"}, {"excerpts": ["Her happy family (mixed seafood) was bland but edible. ", "My fried beef with Chile sauce was tough and not spicy at all. ", "My daughter and her boyfriend each got orange chicken, which they completely hated. "], "author": "Nick M.", "review": "I'd give zero stars if i could, but the app won't let me.\n\nI spent $90 On #UberEats to get food from this restaurant delivered just a few miles away so that my wife and I could have a meal with my daughter and her boyfriend. \n\nThe food arrived in time, hot, and good looking, but the good feelings stopped when we started to eat. It was HORRIBLE.\nThe egg rolls were mushy and inedible. My wife and I both threw the food away. The wonton soup was weird, missing flavor and mysteriously chewy. My wife stopped after one wonton but I ate my portion.\nHer happy family (mixed seafood) was bland but edible. My fried beef with Chile sauce was tough and not spicy at all. My daughter and her boyfriend each got orange chicken, which they completely hated. We threw their food away as well as the chicken chow mein.\n\nThis really was one of the worst food experiences I've ever had. Hands down awful.", "rating": 1, "date": "2017-05-13"}, {"excerpts": ["I love happy family and is what I order to measure if I like or not a chinese restaurant.\n\n", "So the happy family was an insane mixture of things that it looked like more like a leftovers meal than a proper course. ", "And noodles were also overcooked. ", "Maybe I had bad luck ", "but I'm not ordering again."], "author": "JL B.", "review": "I love happy family and is what I order to measure if I like or not a chinese restaurant.\n\nWe ordered online because our preferred restaurant wasn't delivering, they deliver really fast  but that is not the most important thing for me, I don't smoke pot.\n\nSo the happy family was an insane mixture of things that it looked like more like a leftovers meal than a proper course. And noodles were also overcooked. Maybe I had bad luck but I'm not ordering again.", "rating": 1, "date": "2011-10-02"}], "seafood sizzle": [], "seafood basket": []}