{"cheese fries": [{"excerpts": ["V Cafe's menu is filled with your typical drunchies: fries, waffle fries, chili cheese fries, mozzarella sticks, buffalo wings, grilled cheese, fried chicken, fish & chips, burgers, and foot long cheese steak sandwiches. ", "Everything is under $13. ", "$10 minimum for CCs. ", "There's only a handful of tables ", "and there's even dog-friendly outdoor seating. "], "author": "Cherylynn N.", "review": "3.5 STARS\n\nWe all have that one person at work that we wish had a mute button. You know that one person that says, they have a \"quick\" question when you have a deadline to meet which then turns into a 45 minute monologue about their ingrown toe nail or how their breakfast burrito gave them the Hershey squirts this morning. \n\nYah, so yesterday was one of those days.\n\nAfter trying my best to nod and smile for 30 minutes, I had enough and politely tried to excuse myself.\n\n\"Sorry, but I have to use the restroom.\"\n\"Oh, I'll walk with you.\"\n\n\"Oh no, it's ok, I have to meet my friends for lunch right afterwards.\"\n\nAnd, these were my \"friends\" yesterday...like horny teenagers, they couldn't keep their hands (or their fins) off each other: http://bit.ly/2gFoTh0. I was like the third wheel watching them make out for the entire time I was at V Café and from the looks of it, it seems like this is a common occurrence. How cute.\n\nI've only visited V Café inebriated after a Thursday night at Holy Cow (next door). It's been years and it's a bit of a blur but I remember the food being quite good. \n\nOk, let's put this to the test...sober.\n\nV Cafe's menu is filled with your typical drunchies: fries, waffle fries, chili cheese fries, mozzarella sticks, buffalo wings, grilled cheese, fried chicken, fish & chips, burgers, and foot long cheese steak sandwiches. Everything is under $13. $10 minimum for CCs. There's only a handful of tables and there's even dog-friendly outdoor seating. Though...I wouldn't want to sit outside. \n\nI ordered the Half Cheese Steak Combo with salad (or fries), and choice of drink (includes bottled water) for $10.95. I added mushrooms and extra cheese for $2. \n\nThe staff is cold but they're efficient which is understandable given this is more of a late night drunchies haven. My order was ready in 5 minutes: http://bit.ly/2gSrqJh. \n\nThe hoagie roll was nicely toasted inside and out and was filled with a scalding hot mixture of thinly sliced steak, sautéed mushrooms & onions, and lots of melty, stretchy cheese. It hit the spot since it was my first meal of the day but the flavor was off. I asked for hot peppers but this apparently translates to Huy Fong Garlic Chili Sauce here so it tasted a bit Asian to me (the cooks are Asian). The cashier didn't ask what cheese I wanted and gave me provolone by default so make sure to request a certain cheese if you want it. A half of a cheese steak is plenty but if you're going for value, then it's worth forgoing the combo and getting a whole cheese steak for $11 and save the leftovers for another meal. \n\nThe salad was fresh and topped with sliced ripen roma tomatoes, crisp cucumbers, carrots, and garbanzo beans so no complaints there. \n\nI read a lot of negative reviews for delivery. I don't understand why people order fries (or anything fried) for delivery when it's a given that it's going to arrive soggy from condensation in the box. But, hey...I've ordered $150 worth of food service at a hotel before and passed out before eating it so I'm sure they had their reasons. \n\nOverall, my meal at V Café was decent but I prefer Buster's Cheese Steaks in North Beach. If I ate my meal inebriated (like I did years ago here), I wouldn't care about the off flavor from the Asian chili sauce but I hung up my dancing shoes years ago and traded it in for granny shoes. Comfort for the win!", "rating": 3, "date": "2016-11-29"}, {"excerpts": ["Also they deliver so you can shove your fat face with delicious cheese fries without needing to leave the comfort of your recliner.  ", "When I'm in the area I make sure I get a trip in to V ", "and I am considering moving closer for the sole purpose of their pizza cheese steak"], "author": "Dom J.", "review": "Huge selection and everything I've tried is great.  Also they deliver so you can shove your fat face with delicious cheese fries without needing to leave the comfort of your recliner.  When I'm in the area I make sure I get a trip in to V and I am considering moving closer for the sole purpose of their pizza cheese steak", "rating": 5, "date": "2017-07-26"}, {"excerpts": ["I have ordered from here twice the first time we ordered we had a 12\" Philly cheese-stake with bacon and a order of there chilly cheese fries which were to die for. ", "There's something about the waffle fries that taste better than the normal cut fries. ", "The second time around we order of course the chilly cheeses fries and a 12\" tuna with provolone. ", "Now this was one of the best tuna sandwiches I have had in a long time there was something about the sauce or seasoning that made me want more after each bite. ", "I have yet had a chance to go in to the cafe but definitely recommend you order something for lunch. ", "*", "Hint* chilly cheese fries"], "author": "Ivette K.", "review": "{This review is based on delivery only} \n\nSo my buddy and I have ordered from here twice the first time we ordered we had a 12\" Philly cheese-stake with bacon and a order of there chilly cheese fries which were to die for. There's something about the waffle fries that taste better than the normal cut fries. The second time around we order of course the chilly cheeses fries and a 12\" tuna with provolone. Now this was one of the best tuna sandwiches I have had in a long time there was something about the sauce or seasoning that made me want more after each bite. I have yet had a chance to go in to the cafe but definitely recommend you order something for lunch. *Hint* chilly cheese fries", "rating": 4, "date": "2012-04-10"}, {"excerpts": ["Chili Cheese Fries are Awesome. "], "author": "Norris T.", "review": "Solid greasiness! \n\nGREAT Tuna Melt. \n\nChili Cheese Fries are Awesome. Buffalo Tenders are Very Awesome. \n\nMushroom Cheeseburger is very good but not spectacular. \n\nSalads are huge and tasty and sans the greasiness.", "rating": 4, "date": "2008-12-27"}, {"excerpts": ["today for lunch, i ordered cheese fries and a fried egg and cheese sandwich. ", "i don't know what i was expecting. ", "i got a mountain of fries covered in velveeta-y goodness. ", "disappointed at the lack of actual sliced cheese, but hungry, i delved into the fat mountain and ate each and every single fry. ", "i still can't bring myself to eat the egg and cheese sandwich. ", "it's just too much. ", "how am i supposed to eat twelve inches of liquid cheese and fried eggs?"], "author": "Oleya P.", "review": "i eat here sometimes because they deliver to my place of work. today for lunch, i ordered cheese fries and a fried egg and cheese sandwich. i don't know what i was expecting. i got a mountain of fries covered in velveeta-y goodness. disappointed at the lack of actual sliced cheese, but hungry, i delved into the fat mountain and ate each and every single fry. i still can't bring myself to eat the egg and cheese sandwich. it's just too much. how am i supposed to eat twelve inches of liquid cheese and fried eggs?", "rating": 3, "date": "2007-06-08"}], "beerbattered onion rings": [], "mozzarella sticks": [{"excerpts": ["V Cafe's menu is filled with your typical drunchies: fries, waffle fries, chili cheese fries, mozzarella sticks, buffalo wings, grilled cheese, fried chicken, fish & chips, burgers, and foot long cheese steak sandwiches. ", "Everything is under $13. ", "$10 minimum for CCs. ", "There's only a handful of tables ", "and there's even dog-friendly outdoor seating. "], "author": "Cherylynn N.", "review": "3.5 STARS\n\nWe all have that one person at work that we wish had a mute button. You know that one person that says, they have a \"quick\" question when you have a deadline to meet which then turns into a 45 minute monologue about their ingrown toe nail or how their breakfast burrito gave them the Hershey squirts this morning. \n\nYah, so yesterday was one of those days.\n\nAfter trying my best to nod and smile for 30 minutes, I had enough and politely tried to excuse myself.\n\n\"Sorry, but I have to use the restroom.\"\n\"Oh, I'll walk with you.\"\n\n\"Oh no, it's ok, I have to meet my friends for lunch right afterwards.\"\n\nAnd, these were my \"friends\" yesterday...like horny teenagers, they couldn't keep their hands (or their fins) off each other: http://bit.ly/2gFoTh0. I was like the third wheel watching them make out for the entire time I was at V Café and from the looks of it, it seems like this is a common occurrence. How cute.\n\nI've only visited V Café inebriated after a Thursday night at Holy Cow (next door). It's been years and it's a bit of a blur but I remember the food being quite good. \n\nOk, let's put this to the test...sober.\n\nV Cafe's menu is filled with your typical drunchies: fries, waffle fries, chili cheese fries, mozzarella sticks, buffalo wings, grilled cheese, fried chicken, fish & chips, burgers, and foot long cheese steak sandwiches. Everything is under $13. $10 minimum for CCs. There's only a handful of tables and there's even dog-friendly outdoor seating. Though...I wouldn't want to sit outside. \n\nI ordered the Half Cheese Steak Combo with salad (or fries), and choice of drink (includes bottled water) for $10.95. I added mushrooms and extra cheese for $2. \n\nThe staff is cold but they're efficient which is understandable given this is more of a late night drunchies haven. My order was ready in 5 minutes: http://bit.ly/2gSrqJh. \n\nThe hoagie roll was nicely toasted inside and out and was filled with a scalding hot mixture of thinly sliced steak, sautéed mushrooms & onions, and lots of melty, stretchy cheese. It hit the spot since it was my first meal of the day but the flavor was off. I asked for hot peppers but this apparently translates to Huy Fong Garlic Chili Sauce here so it tasted a bit Asian to me (the cooks are Asian). The cashier didn't ask what cheese I wanted and gave me provolone by default so make sure to request a certain cheese if you want it. A half of a cheese steak is plenty but if you're going for value, then it's worth forgoing the combo and getting a whole cheese steak for $11 and save the leftovers for another meal. \n\nThe salad was fresh and topped with sliced ripen roma tomatoes, crisp cucumbers, carrots, and garbanzo beans so no complaints there. \n\nI read a lot of negative reviews for delivery. I don't understand why people order fries (or anything fried) for delivery when it's a given that it's going to arrive soggy from condensation in the box. But, hey...I've ordered $150 worth of food service at a hotel before and passed out before eating it so I'm sure they had their reasons. \n\nOverall, my meal at V Café was decent but I prefer Buster's Cheese Steaks in North Beach. If I ate my meal inebriated (like I did years ago here), I wouldn't care about the off flavor from the Asian chili sauce but I hung up my dancing shoes years ago and traded it in for granny shoes. Comfort for the win!", "rating": 3, "date": "2016-11-29"}, {"excerpts": ["This place has wonderful mozzarella sticks. ", "I am a sucker for ordering when I see them on menus and most of the time, I'll take a bite or two and then push the plate away before grimacing. ", "Not these, they are worth every bite!"], "author": "Roger G.", "review": "This place has wonderful mozzarella sticks. I am a sucker for ordering when I see them on menus and most of the time, I'll take a bite or two and then push the plate away before grimacing. Not these, they are worth every bite!", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["They reminded me of mozzarella sticks from a chain restaurant. ", "Same size, same beading, limp. ", "If you've ever had zucchini from Carl's Jr, then this is the same exact thing, just different shape. ", "I'm not a fan. "], "author": "Monique C.", "review": "OK, so maybe the mystique was lost on me because I didn't go in and experience the great service everyone has raved about and I wish I did. Sadly, I work nearby and had been in the office since 7am, up since 4:30 with no food. I was so hungry with no chance for a real lunch break in sight so I decided to yelp nearby places that delivered. V cafe popped up, and I read the reviews and decided to go for it.\n\nI ordered fried zucchini, and a mushroom Philly cheese with extra hot peppers and cheese. I was excited by the reviews and was hoping for the best, but as hungry as I was it would have been hard to disappoint....\n\n\nI'll say this. The delivery was super quick, I received my food in about 20-25 minutes and it was hot and fresh. And they followed my order instructions perfectly.\n\n I ate the zucchini first and they were not good at all. Now, I'm not sure if everyone is as particular as I am about their zucchini but this was breaded, then fried. They reminded me of mozzarella sticks from a chain restaurant. Same size, same beading, limp. If you've ever had zucchini from Carl's Jr, then this is the same exact thing, just different shape. I'm not a fan. I will not be ordering that again, and probably won't have a taste for fried zucchini for a while after that.\n\nThe Philly was on the better side of OK. It was good steak, and although I asked for extra cheese it wasn't quite extra cheesy. The thing that makes a Philly amazing to me is when the onions, peppers, steak and cheese all kinda become one amazing mix of goodness. That didn't happen with this sandwich. While it was definitely huge, and hot which I appreciated. It just didn't meet Philly steak standard of excellence. It wasn't bad, it just want VERY good.\n\nI wish I had better things to say, but I'd rather be honest. I'm not a picky eater and I'm also not that yelper who tears everything to pieces, but these items just didn't do it for me. I'd much rather eat at the cheesesteak shop in the east bay.", "rating": 2, "date": "2015-01-06"}, {"excerpts": ["I then decided to go back and order a \"lighter\" dish and opted for the mozzarella sticks. ", "Man, this place really knows about presentation! "], "author": "Nicole M.", "review": "A few Friday nights ago my boyfriend and I casually rolled a joint, smoked it on our roof, and then ventured out into SOMA in search of good eats.  We wandered into this place baked out of our minds and decided to get an egg sandwich. mmmm.  Who doesn't like breakfast for dinner?\n\nWhat they brought out could of killed a small child. \n\nThis was no ordinary egg sando, it was 12 inches of french bread, 4 eggs, and countless Kraft slices. Considering myself a sort of breakfast aficionado, if I had my whits about me, I would have to gone back there, smacked that little korean chef on his tootsie, and shown him how to really make an egg sammy.  However, I was high and found myself just staring into space.  So, I had to sit this one out. But my man grubbed it like an effing champ.\n\nI then decided to go back and order a \"lighter\" dish and opted for the mozzarella sticks. Man, this place really knows about presentation! I got 5 sticks, spread out like a sun, in a blob of marinara sauce on the middle of a flimsy ass paper plate. \n\n\nAnd to tell you the truth... If i smoke that OG death again, I'll probably go back.", "rating": 2, "date": "2014-06-03"}, {"excerpts": ["Ordered two burgers with fries and mozzarella sticks. ", "Decent burgers, definitely not the best in the city. ", "But they get the job done. ", "I ordered delivery and the food was brought to me very quickly. ", "Overall it was a very pleasant experience."], "author": "Charlene S.", "review": "Ordered two burgers with fries and mozzarella sticks. Decent burgers, definitely not the best in the city. But they get the job done. I ordered delivery and the food was brought to me very quickly. Overall it was a very pleasant experience.", "rating": 4, "date": "2016-03-03"}, {"excerpts": ["The mozzarella sticks and fried zucchini were ok too. "], "author": "Cindy W.", "review": "Great place to stop by when hungry after HH at one of the nearby bars. Big 12\" Philly Cheesesteaks - not quite the same as those I gobbled in the city of brotherly love - but this fits the bill. All sandwiches average about $7.95, mine had grilled onions, mushrooms, cheese and beef. It's not the kind of sandwich you can't put your mouth around. In fact it squishes down quite a bit, but if you add a side of steak fries and a drink (takes you up to about $10) you'll be set.\n\nThe mozzarella sticks and fried zucchini were ok too. You get a generous helping.\n\nOwners are nice - they put up with a bunch of semi-drunk and hungry people really well. \n\nClean bathroom - 1 stall - available for customers.", "rating": 3, "date": "2012-04-03"}, {"excerpts": ["And the mozzarella sticks were sub-par.  ", "They were soggy and sitting in marinara sauce.  ", "Do they not have to-go souffle cups for that?  ", "I will never eat their food again.  ", "Even drunk I would pass.  ", "McDonald's has a better chance of seeing me there after a night of drinkies."], "author": "Heather S.", "review": "This place is terrible.  I ordered a salad because it was suppose to come w/ avocado, it didn't.  I ordered a chicken cheesesteak and it was so greasy it made me nauseous.  Not to mention the hot peppers on the side I ordered, were not delivered.  Now I am fully aware that cheesesteaks in all their forms are greasy, but this was beyond the pale.  And whomever was explaining the whole fried food/chinese food connection to the burgers, can also make the connection w/ the steak samiches.  There is just this old wok oil flavour that accompanies the food.  And the mozzarella sticks were sub-par.  They were soggy and sitting in marinara sauce.  Do they not have to-go souffle cups for that?  I will never eat their food again.  Even drunk I would pass.  McDonald's has a better chance of seeing me there after a night of drinkies.", "rating": 2, "date": "2009-10-11"}], "chili cheese fries": [{"excerpts": ["V Cafe's menu is filled with your typical drunchies: fries, waffle fries, chili cheese fries, mozzarella sticks, buffalo wings, grilled cheese, fried chicken, fish & chips, burgers, and foot long cheese steak sandwiches. ", "Everything is under $13. ", "$10 minimum for CCs. ", "There's only a handful of tables ", "and there's even dog-friendly outdoor seating. "], "author": "Cherylynn N.", "review": "3.5 STARS\n\nWe all have that one person at work that we wish had a mute button. You know that one person that says, they have a \"quick\" question when you have a deadline to meet which then turns into a 45 minute monologue about their ingrown toe nail or how their breakfast burrito gave them the Hershey squirts this morning. \n\nYah, so yesterday was one of those days.\n\nAfter trying my best to nod and smile for 30 minutes, I had enough and politely tried to excuse myself.\n\n\"Sorry, but I have to use the restroom.\"\n\"Oh, I'll walk with you.\"\n\n\"Oh no, it's ok, I have to meet my friends for lunch right afterwards.\"\n\nAnd, these were my \"friends\" yesterday...like horny teenagers, they couldn't keep their hands (or their fins) off each other: http://bit.ly/2gFoTh0. I was like the third wheel watching them make out for the entire time I was at V Café and from the looks of it, it seems like this is a common occurrence. How cute.\n\nI've only visited V Café inebriated after a Thursday night at Holy Cow (next door). It's been years and it's a bit of a blur but I remember the food being quite good. \n\nOk, let's put this to the test...sober.\n\nV Cafe's menu is filled with your typical drunchies: fries, waffle fries, chili cheese fries, mozzarella sticks, buffalo wings, grilled cheese, fried chicken, fish & chips, burgers, and foot long cheese steak sandwiches. Everything is under $13. $10 minimum for CCs. There's only a handful of tables and there's even dog-friendly outdoor seating. Though...I wouldn't want to sit outside. \n\nI ordered the Half Cheese Steak Combo with salad (or fries), and choice of drink (includes bottled water) for $10.95. I added mushrooms and extra cheese for $2. \n\nThe staff is cold but they're efficient which is understandable given this is more of a late night drunchies haven. My order was ready in 5 minutes: http://bit.ly/2gSrqJh. \n\nThe hoagie roll was nicely toasted inside and out and was filled with a scalding hot mixture of thinly sliced steak, sautéed mushrooms & onions, and lots of melty, stretchy cheese. It hit the spot since it was my first meal of the day but the flavor was off. I asked for hot peppers but this apparently translates to Huy Fong Garlic Chili Sauce here so it tasted a bit Asian to me (the cooks are Asian). The cashier didn't ask what cheese I wanted and gave me provolone by default so make sure to request a certain cheese if you want it. A half of a cheese steak is plenty but if you're going for value, then it's worth forgoing the combo and getting a whole cheese steak for $11 and save the leftovers for another meal. \n\nThe salad was fresh and topped with sliced ripen roma tomatoes, crisp cucumbers, carrots, and garbanzo beans so no complaints there. \n\nI read a lot of negative reviews for delivery. I don't understand why people order fries (or anything fried) for delivery when it's a given that it's going to arrive soggy from condensation in the box. But, hey...I've ordered $150 worth of food service at a hotel before and passed out before eating it so I'm sure they had their reasons. \n\nOverall, my meal at V Café was decent but I prefer Buster's Cheese Steaks in North Beach. If I ate my meal inebriated (like I did years ago here), I wouldn't care about the off flavor from the Asian chili sauce but I hung up my dancing shoes years ago and traded it in for granny shoes. Comfort for the win!", "rating": 3, "date": "2016-11-29"}, {"excerpts": ["Chili Cheese Fries are Awesome. "], "author": "Norris T.", "review": "Solid greasiness! \n\nGREAT Tuna Melt. \n\nChili Cheese Fries are Awesome. Buffalo Tenders are Very Awesome. \n\nMushroom Cheeseburger is very good but not spectacular. \n\nSalads are huge and tasty and sans the greasiness.", "rating": 4, "date": "2008-12-27"}], "fried zucchini": [{"excerpts": [", I sometimes get the Fried Zucchini sticks!!! ", "To die for! ", "You gotta try this place."], "author": "Terri C.", "review": "I love this place. They are super nice and accommodating! My favorite dish is the Fried Fish Sandwich! SOOO GOOD! Generous portions and instead of their delicious fries, I sometimes get the Fried Zucchini sticks!!! To die for! You gotta try this place.", "rating": 5, "date": "2017-05-05"}, {"excerpts": ["We also ordered a fried zucchini instead of fries which were ok. ", "They weren't soggy and I wouldn't blame them for that since I had it delivered to me at work. "], "author": "Leina K.", "review": "Ordered a cheesesteak here via DoorDasha and was not disappointed! They actually followed the special instructions I wrote for half mushroom and half plain (I was sharing with a friend, which is totally doable because it was huge). I dare say it was better that Phat Philly's in the Mission that we tried previously when we were craving cheesesteaks. \n\nWe also ordered a fried zucchini instead of fries which were ok. They weren't soggy and I wouldn't blame them for that since I had it delivered to me at work. They were just plain and needed more seasoning. \n\nI'd definitely order from them again. They were great, I just need to order fries next time!", "rating": 4, "date": "2015-04-06"}, {"excerpts": ["I ordered fried zucchini, and a mushroom Philly cheese with extra hot peppers and cheese. ", "I will not be ordering that again, and probably won't have a taste for fried zucchini for a while after that.\n\n"], "author": "Monique C.", "review": "OK, so maybe the mystique was lost on me because I didn't go in and experience the great service everyone has raved about and I wish I did. Sadly, I work nearby and had been in the office since 7am, up since 4:30 with no food. I was so hungry with no chance for a real lunch break in sight so I decided to yelp nearby places that delivered. V cafe popped up, and I read the reviews and decided to go for it.\n\nI ordered fried zucchini, and a mushroom Philly cheese with extra hot peppers and cheese. I was excited by the reviews and was hoping for the best, but as hungry as I was it would have been hard to disappoint....\n\n\nI'll say this. The delivery was super quick, I received my food in about 20-25 minutes and it was hot and fresh. And they followed my order instructions perfectly.\n\n I ate the zucchini first and they were not good at all. Now, I'm not sure if everyone is as particular as I am about their zucchini but this was breaded, then fried. They reminded me of mozzarella sticks from a chain restaurant. Same size, same beading, limp. If you've ever had zucchini from Carl's Jr, then this is the same exact thing, just different shape. I'm not a fan. I will not be ordering that again, and probably won't have a taste for fried zucchini for a while after that.\n\nThe Philly was on the better side of OK. It was good steak, and although I asked for extra cheese it wasn't quite extra cheesy. The thing that makes a Philly amazing to me is when the onions, peppers, steak and cheese all kinda become one amazing mix of goodness. That didn't happen with this sandwich. While it was definitely huge, and hot which I appreciated. It just didn't meet Philly steak standard of excellence. It wasn't bad, it just want VERY good.\n\nI wish I had better things to say, but I'd rather be honest. I'm not a picky eater and I'm also not that yelper who tears everything to pieces, but these items just didn't do it for me. I'd much rather eat at the cheesesteak shop in the east bay.", "rating": 2, "date": "2015-01-06"}, {"excerpts": ["The fried zucchini sticks are good too. ", "so hot -i.e. ", "burn your mouth hot!-so crunchy and so just the right late night snack to die for."], "author": "Dom L.", "review": "good little cafe. Love the fact that they make everything to order. They are open late too, as I saw a sign that said open till 2am. Not sure if it's just weekends tho.\n\nThe cheesesteak was very good, very flavorful. They use a french roll, similar to a banh mi roll so if you are looking for a authentic philly amoroso roll, this isn't it. But it is still delicious all the same.\n\nDefinitely get the garlic fries. Just enough garlic for it to taste good but not be overwhelming. Crunchy on the outside and hot and fluffy on the inside.\n\nThe fried zucchini sticks are good too. so hot -i.e. burn your mouth hot!-so crunchy and so just the right late night snack to die for.", "rating": 4, "date": "2010-09-25"}, {"excerpts": ["The mozzarella sticks and fried zucchini were ok too. "], "author": "Cindy W.", "review": "Great place to stop by when hungry after HH at one of the nearby bars. Big 12\" Philly Cheesesteaks - not quite the same as those I gobbled in the city of brotherly love - but this fits the bill. All sandwiches average about $7.95, mine had grilled onions, mushrooms, cheese and beef. It's not the kind of sandwich you can't put your mouth around. In fact it squishes down quite a bit, but if you add a side of steak fries and a drink (takes you up to about $10) you'll be set.\n\nThe mozzarella sticks and fried zucchini were ok too. You get a generous helping.\n\nOwners are nice - they put up with a bunch of semi-drunk and hungry people really well. \n\nClean bathroom - 1 stall - available for customers.", "rating": 3, "date": "2012-04-03"}], "criss cut garlic fries": [], "steak sandwich": [{"excerpts": ["Part B - When the sandwich gets here, it is a steak sandwich. ", "I wanted the chicken philly cheese sandwich.  ", "I do not eat beef!! :-(  ", "The french fries were yummy though. :-)  ", "It will be a while before I go back to V Cafe. :-("], "author": "Annie W.", "review": "So, I used UBEREATS to order from here and it was a disaster. Part A - First of all, my original order was cancelled without notifying me. So after it was not delivered by the promised time, I checked the site and it was cancelled. SO, I reordered it cuz, I really like their sandwiches. Part B - When the sandwich gets here, it is a steak sandwich. I wanted the chicken philly cheese sandwich.  I do not eat beef!! :-(  The french fries were yummy though. :-)  It will be a while before I go back to V Cafe. :-(", "rating": 2, "date": "2018-06-28"}, {"excerpts": ["The cheese steak sandwich was delicious."], "author": "Christina F.", "review": "Ordered for delivery. Food was early and very good.  The chicken Ceasar salad was huge and smothered in dressing - wild recommend getting dressing on the side. The cheese steak sandwich was delicious.", "rating": 4, "date": "2018-06-02"}, {"excerpts": ["And boyfriend got a cheese steak sandwich, it was so good. ", "Those don't come with fries though.. ", "but the size is worth the cost. ", "Great food, clean eating area, the building itself is a little small but cozy. ", "Overall happy."], "author": "Jessica C.", "review": "First time coming here. Food is great. I got a grilled cheese and fries, waffles fries are amazing. And boyfriend got a cheese steak sandwich, it was so good. Those don't come with fries though.. but the size is worth the cost. Great food, clean eating area, the building itself is a little small but cozy. Overall happy.", "rating": 5, "date": "2018-04-11"}, {"excerpts": ["The Philly cheese steak sandwich is a good bet,and the burgers are also good. ", "My issue is the club salmon sandwich, I had to search for the salmon, very thin and very scarce. ", "A lot of bread,it should be called a bread sandwich with lettuce and salmon,emphasis bread:Three slices of bread,with the third slice in the middle to make up for the clear lack of Salmon. ", "The meal is $9.95 with fries, so it does not break the bank,but I would readily pay $14.95 and get some salmon for real."], "author": "Jimmy L.", "review": "Good food,great service, and a varied menu. I have eaten there many times and am almost never let down. The Philly cheese steak sandwich is a good bet,and the burgers are also good. My issue is the club salmon sandwich, I had to search for the salmon, very thin and very scarce. A lot of bread,it should be called a bread sandwich with lettuce and salmon,emphasis bread:Three slices of bread,with the third slice in the middle to make up for the clear lack of Salmon. The meal is $9.95 with fries, so it does not break the bank,but I would readily pay $14.95 and get some salmon for real.", "rating": 3, "date": "2015-09-04"}, {"excerpts": ["It's more like a \"grilled steak sandwich on a toasted roll\", but who cares, it's good. "], "author": "Brendan R.", "review": "So, I'm here like almost every day. There aren't a lot of good lunch options in this part of SoMa but I'll be damned if this isn't one of the best. Everything I've ever gotten here has been genuinely good quality, no cut corners or skimping ever, and I've been here probably close to a hundred times by now. Sure it's greasy as hell diner food, but it's delicious and served hot, fresh and blindingly quick. One of the most efficient, fast paced kitchens I've ever seen in my life. I will say that if you order a cheesesteak and expect a \"real authentic Philly cheesesteak\" then guess what, you're going to be disappointed. It's more like a \"grilled steak sandwich on a toasted roll\", but who cares, it's good. Their salads are really good too, if you want to minimize your intake of greasy fried deliciousness.\n\nAlso the service is friendly and like everything else, super quick and efficient. Your table will sometimes get bussed and cleaned up before you're even all the way out the door. This place literally has no downsides to it, except maybe the limited seating, but the place is a hole in the wall, so it is what it is. Whenever I have no idea what I want for lunch, I usually just end up coming here because I know I won't be disappointed. Keep it up V Cafe.\n\nP.S. Not sure why it's called V Cafe, they don't even serve coffee here? Oh well.", "rating": 5, "date": "2015-08-30"}, {"excerpts": ["Cheese-steak Sandwich - ", "This was a pretty good sandwich.  ", "The roll was nice and soft.  ", "The meat could have been a touch more tender and it could of been a bit cheesier.  ", "But I enjoyed it.  ", "Cheese steak Sandwich 1 $7.50 \n"], "author": "Mark D.", "review": "This is a review of delivery from V Cafe.\n\nEasy to order via http://eat24hours.com/\n\nDelivery - The order was placed at  1:59 PM.    The order was delivered at 2:44 PM.  At 45 minutes, the delivery time was well within the estimate of 45 to 60 minutes.  While not super speedy, I do consider delivery within 45 minutes to be relatively fast.  There was a $1 delivery fee.  The delivery person was polite and professional.\n\nOrder Minimum - The order minimum is low ($14).\n\nCheese-steak Sandwich - This was a pretty good sandwich.  The roll was nice and soft.  The meat could have been a touch more tender and it could of been a bit cheesier.  But I enjoyed it.  It was also a pretty large sandwich.\n\nhttp://tinyurl.com/3vg2wc5\n\nBacon Cheeseburger - This was a mediocre burger.   It was cooked past the ordered medium.  I would guess the patty had been frozen.  It did had that heavy denseness that usually only comes from a frozen patty.  It was edible but that was about it.\n\nhttp://tinyurl.com/3fxowqy\n\nWaffle Fries - These came with the burger and were very good.  \n\nPacking  - The food was all neatly packed.\n\nPricing - The prices are inline with my expectations.  I received a free soda for ordering $20 worth of food.  This offset the delivery charge.\n\nSoda 1 $1.35 Flavor: Coke Free !\nCheese steak Sandwich 1 $7.50 \nBacon Cheeseburger 1 $7.95\nSoda 2 $1.35 Flavor: Sprite\n\nSubtotal: $19.50\n Discount: $1.35\n Tax: $1.63\n Delivery Charge: $1.00\nTotal:   $20.78 \n\nOverall - The quality was a mixed bag.  The philly was better than the burger.  The prices were decent.  I would not order from them again for  a philly or a burger though.  I can get better versions of either delivered.  I might check out some of their other menu items.  Because they do have some interesting options for delivery.  The prices were decent and delivery was relatively fast.", "rating": 3, "date": "2011-07-27"}, {"excerpts": ["Went there today before my shift and ordered a \"half philly cheese steak sandwich\". \n", "To my surprise I got a large free refillable fountain soda, garlic wedges and a hot juices Philly Cheese Steak Sandwich for under $9. \n", "When I returned the plate to be thrown away the owner asked me \"what happened, you didn't like it\". ", "I told him NO I just couldn't finish all of it man.  \n", "I'm glad I just got the half order, their servings are huge. ", "I will need to go there again.", "To my surprise I got a large free refillable fountain soda, garlic wedges and a hot juices Philly Cheese Steak Sandwich for under $9. \n", "When I returned the plate to be thrown away the owner asked me \"what happened, you didn't like it\". ", "I told him NO I just couldn't finish all of it man.  \n", "I'm glad I just got the half order, their servings are huge. ", "I will need to go there again."], "author": "Shaun R.", "review": "Went there today before my shift and ordered a \"half philly cheese steak sandwich\". \nTo my surprise I got a large free refillable fountain soda, garlic wedges and a hot juices Philly Cheese Steak Sandwich for under $9. \nWhen I returned the plate to be thrown away the owner asked me \"what happened, you didn't like it\". I told him NO I just couldn't finish all of it man.  \nI'm glad I just got the half order, their servings are huge. I will need to go there again.", "rating": 5, "date": "2013-09-27"}, {"excerpts": ["I dropped in tonight and ordered a Cheese Steak Sandwich and Beer Battered Onion Rings.  ", "I had no idea how huge these sandwiches are.  ", "A foot long soft roll dripping with gooey, stringy melted cheese topped with a beef and onion mixture and peppers (your choice of hot or sweet).  ", "Dripping with a combination of meat juices, grease and cheese the sandwich was awesome.  ", "The rings were good too, but I couldn't finish my order because the sandwich left me stuffed.  ", "Fast, efficient service on a somewhat busy Friday night, I'll definitely be back again.  ", "A solid four stars!"], "author": "Wilhelm Y.", "review": "I dropped in tonight and ordered a Cheese Steak Sandwich and Beer Battered Onion Rings.  I had no idea how huge these sandwiches are.  A foot long soft roll dripping with gooey, stringy melted cheese topped with a beef and onion mixture and peppers (your choice of hot or sweet).  Dripping with a combination of meat juices, grease and cheese the sandwich was awesome.  The rings were good too, but I couldn't finish my order because the sandwich left me stuffed.  Fast, efficient service on a somewhat busy Friday night, I'll definitely be back again.  A solid four stars!", "rating": 4, "date": "2007-03-17"}, {"excerpts": ["more like the steak sandwich....there was NO cheese really..."], "author": "Dessa R.", "review": "ehh....it'll do.....it''s open late...and you're pretty wasted....it'll do.\n\nOrdered the philly cheesesteak sandwich....more like the steak sandwich....there was NO cheese really...and i'm big on cheese....and the chicken tenders were AIGHTTTT..\n\ncome here if you are pissed off pete drunk....nothing earth-shattering", "rating": 3, "date": "2008-09-27"}, {"excerpts": ["During lunch, I'll have a steak sandwich served any way I can think of and listen to bad yet oddly charming 80's music. ", "The sandwich will be awesome, the fries may or may not be transcendent, and I've never had a salad. ", "They have them on the menu ", "but I'd stay away. ", "I've only seen one person order one and it looked like the lettuce had been there for far too long.  ", "They're open for dinner as well ", "but I think the food is better during the day.  ", "When the fries are right, and you get a steak sandwich and let the grease from the sandwich drip into the pile of potatoes....", "a better fry you will never have."], "author": "Rob I.", "review": "Sweet, merciful Jesus I love this place. Great steak sandwiches and garlic fries, good chicken sandwiches, but don't bother with the salads.\n\nDuring lunch, I'll have a steak sandwich served any way I can think of and listen to bad yet oddly charming 80's music. The sandwich will be awesome, the fries may or may not be transcendent, and I've never had a salad. They have them on the menu but I'd stay away. I've only seen one person order one and it looked like the lettuce had been there for far too long.  They're open for dinner as well but I think the food is better during the day.  If you're coming from one of the bars or clubs near by, well, maybe the sandwiches are better at night.\n\nI don't know how many times I've eaten here but I'm sure it's stripped years of my life and I think it's worth it. I'm not from Philly and I won't pretend to be a cheese steak expert but this place is tasty. It used to be called Whiz Wit (a call to Philly aficionados out there) but was sold and renamed V Cafe. The chef that made Whiz Wit was brought back, however and bad ass steak sandwiches were once again available to to Mission/SOMA border region. Thank god. \n\nMy only complaint about V is that the fries are inconsistent. Usually they are waffle-cut, the Cadillac of Frenched fried potato, but sometimes they serve crinkle-cut, kinda freezer-burned fries instead. Also, the garlic fries are sometimes want for garlic. When the fries are right, and you get a steak sandwich and let the grease from the sandwich drip into the pile of potatoes....a better fry you will never have.", "rating": 4, "date": "2009-07-06"}, {"excerpts": ["I know they are known for their cheese steak, which I have yet to try since I'm so in love with the NY Steak Sandwich.  ", "I love it.  ", "It's so simple, yet tasty ", "and I love every delicious bite.  ", "I would have never ever ever ever gone here just by the looks or even looking at it on yelp since I generally don't find this type of food too interesting, but something about this place and their sandwiches are heavenly and fantastic.  ", "They're friendly and they remember me as the girl who orders the same thing every time, but I love it.  ", "LOVE IT.  ", "I'd come here ", "every chance if I could.  ", "But yeah, I don't know when they're open sometimes.  ", "But definitely open after a night out."], "author": "Josephine C.", "review": "Okay look, if you want healthy food, screw it.  BUT FLIP if you want a good sandwich this place is awesome and they are friendly.  We tripped onto this place after a boring night at Ruby Skye and my friend dragged us to the Holy Cow.  This place has garlic fries to die for.  I know they are known for their cheese steak, which I have yet to try since I'm so in love with the NY Steak Sandwich.  I love it.  It's so simple, yet tasty and I love every delicious bite.  I would have never ever ever ever gone here just by the looks or even looking at it on yelp since I generally don't find this type of food too interesting, but something about this place and their sandwiches are heavenly and fantastic.  They're friendly and they remember me as the girl who orders the same thing every time, but I love it.  LOVE IT.  I'd come here every chance if I could.  But yeah, I don't know when they're open sometimes.  But definitely open after a night out.", "rating": 5, "date": "2010-05-28"}], "cheese steak sandwich": [{"excerpts": ["The cheese steak sandwich was delicious."], "author": "Christina F.", "review": "Ordered for delivery. Food was early and very good.  The chicken Ceasar salad was huge and smothered in dressing - wild recommend getting dressing on the side. The cheese steak sandwich was delicious.", "rating": 4, "date": "2018-06-02"}, {"excerpts": ["And boyfriend got a cheese steak sandwich, it was so good. ", "Those don't come with fries though.. ", "but the size is worth the cost. ", "Great food, clean eating area, the building itself is a little small but cozy. ", "Overall happy."], "author": "Jessica C.", "review": "First time coming here. Food is great. I got a grilled cheese and fries, waffles fries are amazing. And boyfriend got a cheese steak sandwich, it was so good. Those don't come with fries though.. but the size is worth the cost. Great food, clean eating area, the building itself is a little small but cozy. Overall happy.", "rating": 5, "date": "2018-04-11"}, {"excerpts": ["The Philly cheese steak sandwich is a good bet,and the burgers are also good. ", "My issue is the club salmon sandwich, I had to search for the salmon, very thin and very scarce. ", "A lot of bread,it should be called a bread sandwich with lettuce and salmon,emphasis bread:Three slices of bread,with the third slice in the middle to make up for the clear lack of Salmon. ", "The meal is $9.95 with fries, so it does not break the bank,but I would readily pay $14.95 and get some salmon for real."], "author": "Jimmy L.", "review": "Good food,great service, and a varied menu. I have eaten there many times and am almost never let down. The Philly cheese steak sandwich is a good bet,and the burgers are also good. My issue is the club salmon sandwich, I had to search for the salmon, very thin and very scarce. A lot of bread,it should be called a bread sandwich with lettuce and salmon,emphasis bread:Three slices of bread,with the third slice in the middle to make up for the clear lack of Salmon. The meal is $9.95 with fries, so it does not break the bank,but I would readily pay $14.95 and get some salmon for real.", "rating": 3, "date": "2015-09-04"}, {"excerpts": ["Cheese steak Sandwich 1 $7.50 \n"], "author": "Mark D.", "review": "This is a review of delivery from V Cafe.\n\nEasy to order via http://eat24hours.com/\n\nDelivery - The order was placed at  1:59 PM.    The order was delivered at 2:44 PM.  At 45 minutes, the delivery time was well within the estimate of 45 to 60 minutes.  While not super speedy, I do consider delivery within 45 minutes to be relatively fast.  There was a $1 delivery fee.  The delivery person was polite and professional.\n\nOrder Minimum - The order minimum is low ($14).\n\nCheese-steak Sandwich - This was a pretty good sandwich.  The roll was nice and soft.  The meat could have been a touch more tender and it could of been a bit cheesier.  But I enjoyed it.  It was also a pretty large sandwich.\n\nhttp://tinyurl.com/3vg2wc5\n\nBacon Cheeseburger - This was a mediocre burger.   It was cooked past the ordered medium.  I would guess the patty had been frozen.  It did had that heavy denseness that usually only comes from a frozen patty.  It was edible but that was about it.\n\nhttp://tinyurl.com/3fxowqy\n\nWaffle Fries - These came with the burger and were very good.  \n\nPacking  - The food was all neatly packed.\n\nPricing - The prices are inline with my expectations.  I received a free soda for ordering $20 worth of food.  This offset the delivery charge.\n\nSoda 1 $1.35 Flavor: Coke Free !\nCheese steak Sandwich 1 $7.50 \nBacon Cheeseburger 1 $7.95\nSoda 2 $1.35 Flavor: Sprite\n\nSubtotal: $19.50\n Discount: $1.35\n Tax: $1.63\n Delivery Charge: $1.00\nTotal:   $20.78 \n\nOverall - The quality was a mixed bag.  The philly was better than the burger.  The prices were decent.  I would not order from them again for  a philly or a burger though.  I can get better versions of either delivered.  I might check out some of their other menu items.  Because they do have some interesting options for delivery.  The prices were decent and delivery was relatively fast.", "rating": 3, "date": "2011-07-27"}, {"excerpts": ["Went there today before my shift and ordered a \"half philly cheese steak sandwich\". \n", "To my surprise I got a large free refillable fountain soda, garlic wedges and a hot juices Philly Cheese Steak Sandwich for under $9. \n", "When I returned the plate to be thrown away the owner asked me \"what happened, you didn't like it\". ", "I told him NO I just couldn't finish all of it man.  \n", "I'm glad I just got the half order, their servings are huge. ", "I will need to go there again.", "To my surprise I got a large free refillable fountain soda, garlic wedges and a hot juices Philly Cheese Steak Sandwich for under $9. \n", "When I returned the plate to be thrown away the owner asked me \"what happened, you didn't like it\". ", "I told him NO I just couldn't finish all of it man.  \n", "I'm glad I just got the half order, their servings are huge. ", "I will need to go there again."], "author": "Shaun R.", "review": "Went there today before my shift and ordered a \"half philly cheese steak sandwich\". \nTo my surprise I got a large free refillable fountain soda, garlic wedges and a hot juices Philly Cheese Steak Sandwich for under $9. \nWhen I returned the plate to be thrown away the owner asked me \"what happened, you didn't like it\". I told him NO I just couldn't finish all of it man.  \nI'm glad I just got the half order, their servings are huge. I will need to go there again.", "rating": 5, "date": "2013-09-27"}, {"excerpts": ["I dropped in tonight and ordered a Cheese Steak Sandwich and Beer Battered Onion Rings.  ", "I had no idea how huge these sandwiches are.  ", "A foot long soft roll dripping with gooey, stringy melted cheese topped with a beef and onion mixture and peppers (your choice of hot or sweet).  ", "Dripping with a combination of meat juices, grease and cheese the sandwich was awesome.  ", "The rings were good too, but I couldn't finish my order because the sandwich left me stuffed.  ", "Fast, efficient service on a somewhat busy Friday night, I'll definitely be back again.  ", "A solid four stars!"], "author": "Wilhelm Y.", "review": "I dropped in tonight and ordered a Cheese Steak Sandwich and Beer Battered Onion Rings.  I had no idea how huge these sandwiches are.  A foot long soft roll dripping with gooey, stringy melted cheese topped with a beef and onion mixture and peppers (your choice of hot or sweet).  Dripping with a combination of meat juices, grease and cheese the sandwich was awesome.  The rings were good too, but I couldn't finish my order because the sandwich left me stuffed.  Fast, efficient service on a somewhat busy Friday night, I'll definitely be back again.  A solid four stars!", "rating": 4, "date": "2007-03-17"}], "pizza cheese steak sandwich": [], "mushroom cheese steak sandwich": [], "cheese steak hoagie": [{"excerpts": ["The chicken cheese steak hoagie is the bomb!!!"], "author": "Rhonnie R.", "review": "We order from here on the Eat24 App.  The food is great and they always deliver with a smile.   The chicken cheese steak hoagie is the bomb!!!", "rating": 5, "date": "2015-07-29"}], "the compromise sandwich with cheese": [], "bacon cheese steak sandwich": [], "teriyaki beef steak sandwich": [], "chicken cheese steak sandwich": [], "chicken cheese steak hoagie": [{"excerpts": ["The chicken cheese steak hoagie is the bomb!!!"], "author": "Rhonnie R.", "review": "We order from here on the Eat24 App.  The food is great and they always deliver with a smile.   The chicken cheese steak hoagie is the bomb!!!", "rating": 5, "date": "2015-07-29"}], "teriyaki chicken sandwich": [], "chicken parmigiano sandwich": [], "pesto chicken sandwich": [], "chicken cacciatore sandwich": [], "the sellout sandwich": [{"excerpts": ["Pretty damn good food, i love the sellout sandwich and their garlic fries. ", "WAY over priced though. ", "you can spend like 11 bucks on one sandwich and fries, and it doesn't quite taste like an 11 dollar sandwich. ", "i went here 10 times, just enough to fill up one sandwich card. ", "i will go to get my free sub soon, but after that, it just wont be worth it to return. ", "definitely good for a little while though."], "author": "J. G.", "review": "Pretty damn good food, i love the sellout sandwich and their garlic fries. WAY over priced though. you can spend like 11 bucks on one sandwich and fries, and it doesn't quite taste like an 11 dollar sandwich. i went here 10 times, just enough to fill up one sandwich card. i will go to get my free sub soon, but after that, it just wont be worth it to return. definitely good for a little while though.", "rating": 3, "date": "2007-08-26"}], "mushroom chicken cheese steak sandwich": [], "bacon chicken cheese steak sandwich": [], "ham cheese sandwich": [], "tuna provolone sandwich": [], "turkey swiss avocado sandwich": [], "blt": [{"excerpts": ["I like to order the BLT or Club and both come with delicious fries.  \n\n"], "author": "C R.", "review": "Love V Cafe.  Nothing fancy but great prices and good food.  Doesn't matter what you order, your going to love it.  I like to order the BLT or Club and both come with delicious fries.  \n\nLove V Cafe", "rating": 5, "date": "2014-05-15"}, {"excerpts": ["My former hangover central.  BLT with avocado?  ", "I think so.  ", "Or grilled cheese with tomato.  ", "Yumminess.  ", "But basically it's overpriced costco food.  ", "Sometimes it's what you need though.  ", "I could go for one RIGHT ", "NOW.  ", "Don't get the turkey sandwich or turkey burger though.  ", "Just trust me on this one."], "author": "Coco D.", "review": "My former hangover central.  BLT with avocado?  I think so.  Or grilled cheese with tomato.  Yumminess.  But basically it's overpriced costco food.  Sometimes it's what you need though.  I could go for one RIGHT NOW.  Don't get the turkey sandwich or turkey burger though.  Just trust me on this one.", "rating": 2, "date": "2006-06-02"}], "club house sandwich": [], "vegetarian sandwich": [], "salmon club on wheat toast": [], "grilled cheese on sourdough bread": [], "tuna melt": [{"excerpts": ["The tuna melt and fries combo I bought was great. ", "Even greater cause ", "I didn't even eat it till the next morning after and still thoroughly enjoyed it."], "author": "Cynthia G.", "review": "They serve food late which is a blessing since they are right by my place. The tuna melt and fries combo I bought was great. Even greater cause I didn't even eat it till the next morning after and still thoroughly enjoyed it.", "rating": 5, "date": "2017-11-07"}, {"excerpts": ["GREAT Tuna Melt. \n\n"], "author": "Norris T.", "review": "Solid greasiness! \n\nGREAT Tuna Melt. \n\nChili Cheese Fries are Awesome. Buffalo Tenders are Very Awesome. \n\nMushroom Cheeseburger is very good but not spectacular. \n\nSalads are huge and tasty and sans the greasiness.", "rating": 4, "date": "2008-12-27"}], "meatball sandwich": [], "eggplant parmigiana sandwich": [], "italian sausage sandwich": [], "egg and cheese sandwich": [{"excerpts": ["today for lunch, i ordered cheese fries and a fried egg and cheese sandwich. ", "i don't know what i was expecting. ", "i got a mountain of fries covered in velveeta-y goodness. ", "disappointed at the lack of actual sliced cheese, but hungry, i delved into the fat mountain and ate each and every single fry. ", "i still can't bring myself to eat the egg and cheese sandwich. ", "it's just too much. ", "how am i supposed to eat twelve inches of liquid cheese and fried eggs?"], "author": "Oleya P.", "review": "i eat here sometimes because they deliver to my place of work. today for lunch, i ordered cheese fries and a fried egg and cheese sandwich. i don't know what i was expecting. i got a mountain of fries covered in velveeta-y goodness. disappointed at the lack of actual sliced cheese, but hungry, i delved into the fat mountain and ate each and every single fry. i still can't bring myself to eat the egg and cheese sandwich. it's just too much. how am i supposed to eat twelve inches of liquid cheese and fried eggs?", "rating": 3, "date": "2007-06-08"}], "bacon egg and cheese sandwich": [], "poboy fried shrimp sandwich": [], "angus beef hot dog": [], "mini green salad": [], "salmon salad": [{"excerpts": ["Ordered salmon salad, popcorn shrimp, crispy chicken salad, chicken philly cheese steak... ."], "author": "Sophanarath P.", "review": "Food is delicious, heathy and delivered quickly!! Definitely a great choice for rainy days! Ordered salmon salad, popcorn shrimp, crispy chicken salad, chicken philly cheese steak... .", "rating": 5, "date": "2017-02-19"}], "bay shrimp salad": [], "house green salad": [], "steak salad": [{"excerpts": ["Burger and steak salad are very good. ", "They have great delivery options if you're like me and cannot find the time to get out of the office. ", "I typically order the cheese burger with fries. "], "author": "Marfel L.", "review": "Burger and steak salad are very good. They have great delivery options if you're like me and cannot find the time to get out of the office. I typically order the cheese burger with fries. If you like the taste of home made grilled burger, this is the place. \n\nThe service here is great as well. They are very accommodating.", "rating": 5, "date": "2018-03-24"}], "greek salad with feta cheese": [], "crispy chicken salad": [{"excerpts": ["Ordered salmon salad, popcorn shrimp, crispy chicken salad, chicken philly cheese steak... ."], "author": "Sophanarath P.", "review": "Food is delicious, heathy and delivered quickly!! Definitely a great choice for rainy days! Ordered salmon salad, popcorn shrimp, crispy chicken salad, chicken philly cheese steak... .", "rating": 5, "date": "2017-02-19"}, {"excerpts": ["I had the crispy chicken salad to go. ", "The surprisingly tasty and plentiful chicken seemed to be fried in light tempura or just a teensy bit of panko. ", "Very friendly service. ", "Not a destination restaurant for sure but a good value when you're in that neighborhood and want some good old-fashioned fried food."], "author": "Elizabeth R.", "review": "I stopped in to grab a quick lunch during a one-day job at the hip trendy branding agency next door. I had the crispy chicken salad to go. The surprisingly tasty and plentiful chicken seemed to be fried in light tempura or just a teensy bit of panko. Very friendly service. Not a destination restaurant for sure but a good value when you're in that neighborhood and want some good old-fashioned fried food.", "rating": 4, "date": "2011-10-30"}], "mini caesar salad": [], "tuna caesar salad": [], "salmon caesar salad": [{"excerpts": ["I ordered the Salmon Caesar Salad with Avocado. ", "It was good. ", "Very filling. ", "We also had the crinkle cut garlic fries which were fresh and tasty. ", "We would definitely order from here again. ", "The rest of the team ordered the cheese steak and po boy sandwiches!"], "author": "Kam H.", "review": "We ordered team lunch on doordashers. I ordered the Salmon Caesar Salad with Avocado. It was good. Very filling. We also had the crinkle cut garlic fries which were fresh and tasty. We would definitely order from here again. The rest of the team ordered the cheese steak and po boy sandwiches!", "rating": 4, "date": "2016-10-06"}], "bay shrimp caesar salad": [{"excerpts": ["bay shrimp Caesar salad + chicken \n", "2. ", "3 French fries\n3. ", "1 Hawaii burger\n4. "], "author": "Angelina B.", "review": "1. Menu above the cashier is current\n2. Menu printed out is charged extra (makes no sense)\n\nOkay y'all! Rainy night and need something cheap. This place is NOT! \n\nWe orders \n1. bay shrimp Caesar salad + chicken \n2. 3 French fries\n3. 1 Hawaii burger\n4. I chicken steak hogie\n\n\nHow in the HELL does all of this equal out to $50!?\nEvery little this, every little that was an EXTRA CHARGE! Wtf! \n\nHoagie was soggy\nFries were cold\nSalad was okay\nBurger wasn't even cooked well\n\nUgh! To save you money and your time\n\nSkip this place!", "rating": 1, "date": "2017-01-21"}], "steak caesar salad": [{"excerpts": ["I went light for lunch and got a Steak Caesar Salad.  ", "Given that we ordered and it had to be picked up, the steak probably cooled down.  ", "Nonetheless, the steak had flavor to it.  ", "Good flavor.  "], "author": "Sedine S.", "review": "While on a work trip, we decided to order lunch from a given notebook of different menus.\n\nI went light for lunch and got a Steak Caesar Salad.  Given that we ordered and it had to be picked up, the steak probably cooled down.  Nonetheless, the steak had flavor to it.  Good flavor.  The salad was whatever.\n\nThe 12-inch cheesesteak looked good.  But a gut bomb is what it looked like.  I wanted to save room for dinner later on too.", "rating": 2, "date": "2014-01-29"}], "fried chicken": [{"excerpts": ["V Cafe's menu is filled with your typical drunchies: fries, waffle fries, chili cheese fries, mozzarella sticks, buffalo wings, grilled cheese, fried chicken, fish & chips, burgers, and foot long cheese steak sandwiches. ", "Everything is under $13. ", "$10 minimum for CCs. ", "There's only a handful of tables ", "and there's even dog-friendly outdoor seating. "], "author": "Cherylynn N.", "review": "3.5 STARS\n\nWe all have that one person at work that we wish had a mute button. You know that one person that says, they have a \"quick\" question when you have a deadline to meet which then turns into a 45 minute monologue about their ingrown toe nail or how their breakfast burrito gave them the Hershey squirts this morning. \n\nYah, so yesterday was one of those days.\n\nAfter trying my best to nod and smile for 30 minutes, I had enough and politely tried to excuse myself.\n\n\"Sorry, but I have to use the restroom.\"\n\"Oh, I'll walk with you.\"\n\n\"Oh no, it's ok, I have to meet my friends for lunch right afterwards.\"\n\nAnd, these were my \"friends\" yesterday...like horny teenagers, they couldn't keep their hands (or their fins) off each other: http://bit.ly/2gFoTh0. I was like the third wheel watching them make out for the entire time I was at V Café and from the looks of it, it seems like this is a common occurrence. How cute.\n\nI've only visited V Café inebriated after a Thursday night at Holy Cow (next door). It's been years and it's a bit of a blur but I remember the food being quite good. \n\nOk, let's put this to the test...sober.\n\nV Cafe's menu is filled with your typical drunchies: fries, waffle fries, chili cheese fries, mozzarella sticks, buffalo wings, grilled cheese, fried chicken, fish & chips, burgers, and foot long cheese steak sandwiches. Everything is under $13. $10 minimum for CCs. There's only a handful of tables and there's even dog-friendly outdoor seating. Though...I wouldn't want to sit outside. \n\nI ordered the Half Cheese Steak Combo with salad (or fries), and choice of drink (includes bottled water) for $10.95. I added mushrooms and extra cheese for $2. \n\nThe staff is cold but they're efficient which is understandable given this is more of a late night drunchies haven. My order was ready in 5 minutes: http://bit.ly/2gSrqJh. \n\nThe hoagie roll was nicely toasted inside and out and was filled with a scalding hot mixture of thinly sliced steak, sautéed mushrooms & onions, and lots of melty, stretchy cheese. It hit the spot since it was my first meal of the day but the flavor was off. I asked for hot peppers but this apparently translates to Huy Fong Garlic Chili Sauce here so it tasted a bit Asian to me (the cooks are Asian). The cashier didn't ask what cheese I wanted and gave me provolone by default so make sure to request a certain cheese if you want it. A half of a cheese steak is plenty but if you're going for value, then it's worth forgoing the combo and getting a whole cheese steak for $11 and save the leftovers for another meal. \n\nThe salad was fresh and topped with sliced ripen roma tomatoes, crisp cucumbers, carrots, and garbanzo beans so no complaints there. \n\nI read a lot of negative reviews for delivery. I don't understand why people order fries (or anything fried) for delivery when it's a given that it's going to arrive soggy from condensation in the box. But, hey...I've ordered $150 worth of food service at a hotel before and passed out before eating it so I'm sure they had their reasons. \n\nOverall, my meal at V Café was decent but I prefer Buster's Cheese Steaks in North Beach. If I ate my meal inebriated (like I did years ago here), I wouldn't care about the off flavor from the Asian chili sauce but I hung up my dancing shoes years ago and traded it in for granny shoes. Comfort for the win!", "rating": 3, "date": "2016-11-29"}, {"excerpts": ["As always, ordering the fried chicken meal made me satusfied. ", "It's smells good, looks good , arrive ahead of time and all around just yummy!  ", "Love ordering from here when I'm at work!"], "author": "Bridget R.", "review": "As always, ordering the fried chicken meal made me satusfied. It's smells good, looks good , arrive ahead of time and all around just yummy!  Love ordering from here when I'm at work!", "rating": 5, "date": "2016-02-16"}, {"excerpts": ["I had the fried chicken with fries and a salad.  ", "First I would like to know what planet did they find that chicken. ", "I've never seen chicken pieces so tiny. ", "There were 4 pieces of chicken.  ", "The wing was the size of my thumb. ", "The wing was the sized of my other thumb. ", "Then there were the breast and thigh.  ", "Which wasn't much bigger.  ", "I've never had such flavorless bland chicken. ", "How do you mess up fried chicken? ", "They answered that question today. ", "I make better chicken at home.  ", "That brings me to the criss cross fries.   ", "Are they suppose to be stale tasting and bland. ", "Shouldn't they be crispy at least.  ", "The only thing barely edible was the salad. ", "Thank you for ruing my lunch V Cafe.  ", "The nerve of you serving that crap for $13. ", "Of course this is my opinion and experience. ", "Now let me go find the menu so it can be destroyed. ", "No more office orders!"], "author": "Sandy P.", "review": "I want my $13 dollars back.  I will never ever ever order anything from this place again. I had the fried chicken with fries and a salad.  First I would like to know what planet did they find that chicken. I've never seen chicken pieces so tiny. There were 4 pieces of chicken.  The wing was the size of my thumb. The wing was the sized of my other thumb. Then there were the breast and thigh.  Which wasn't much bigger.  I've never had such flavorless bland chicken. How do you mess up fried chicken? They answered that question today. I make better chicken at home.  That brings me to the criss cross fries.   Are they suppose to be stale tasting and bland. Shouldn't they be crispy at least.  The only thing barely edible was the salad. Thank you for ruing my lunch V Cafe.  The nerve of you serving that crap for $13. Of course this is my opinion and experience. Now let me go find the menu so it can be destroyed. No more office orders!", "rating": 1, "date": "2014-12-23"}], "fish and chips": [{"excerpts": ["They also deliver; )\nFish and chips, cheese steaks,onion rings to shrimp salads.."], "author": "Marlon P.", "review": "Great,quick and good. I have been going here since they opened. They also deliver; )\nFish and chips, cheese steaks,onion rings to shrimp salads..", "rating": 5, "date": "2017-09-26"}, {"excerpts": ["The fish and chips, really filing. ", "I've had a few burgers here that are just alright, but the fish and chips keeps me coming back. ", "That and the friendly service."], "author": "Anthony A.", "review": "The fish and chips, really filing. At just over $9 after tax it is quite a rewarding meal.\n\nI've had a few burgers here that are just alright, but the fish and chips keeps me coming back. That and the friendly service.", "rating": 4, "date": "2009-03-18"}], "gatorade": [], "coconut juice": [], "cheeseburger": [{"excerpts": ["I just had a cheeseburger and fries here and they were delicious. ", "I asked for grilled onions which I recommend. ", "It was $10 and it was worth it... ", "A third of a pound burger with all the condiments, pickles tomato lettuce, everything fresh and delicious. ", "Fast service very professional clean place good place to stop."], "author": "David P.", "review": "I just had a cheeseburger and fries here and they were delicious. I asked for grilled onions which I recommend. It was $10 and it was worth it... A third of a pound burger with all the condiments, pickles tomato lettuce, everything fresh and delicious. Fast service very professional clean place good place to stop.", "rating": 5, "date": "2018-02-19"}, {"excerpts": ["The fries were soggy because it was in the box with the cheeseburger bacon that I ordered. ", "The burger was all right and thought it was both filling."], "author": "Aj C.", "review": "I ordered V Cafe through Eat24.\n\nI was scrolling through the website to find a restaurant and I thought we could try out V Cafe for delivery. The delivery time was normal which took almost an hour (as expected).\n\nThe fries were soggy because it was in the box with the cheeseburger bacon that I ordered. The burger was all right and thought it was both filling.", "rating": 3, "date": "2016-05-01"}, {"excerpts": ["I had the mushroom cheeseburger with Swiss and she had a cheeseburger with garlic fries instead of regular. ", "She enjoyed her burger and was very excited about her fries being 'so garlicky, mmmm', and I really enjoyed my burger, too. "], "author": "W W.", "review": "My lady friend and I were around the corner and in need of sustenance. I hopped on Yelp, of course, and offered her a selection of decently-rated places nearby. She chose V Cafe and I phoned in an order for burgers.\n\nI had the mushroom cheeseburger with Swiss and she had a cheeseburger with garlic fries instead of regular. She enjoyed her burger and was very excited about her fries being 'so garlicky, mmmm', and I really enjoyed my burger, too. It was yummy and exceeded my expectations.\n\nAs if that weren't reason enough to eat here, the service was really friendly and they were so quick! It was a pleasant experience and the food was definitely better than standard diner fare.\n\nI'm happy we tried this place and we both are looking forward to sampling other things on their menu.", "rating": 4, "date": "2014-05-31"}, {"excerpts": ["http://tinyurl.com/3vg2wc5\n\nBacon Cheeseburger ", "Bacon Cheeseburger 1 $7.95\nSoda 2 $1.35 Flavor: ", "Bacon Cheeseburger 1 $7.95\nSoda 2 $1.35 Flavor: "], "author": "Mark D.", "review": "This is a review of delivery from V Cafe.\n\nEasy to order via http://eat24hours.com/\n\nDelivery - The order was placed at  1:59 PM.    The order was delivered at 2:44 PM.  At 45 minutes, the delivery time was well within the estimate of 45 to 60 minutes.  While not super speedy, I do consider delivery within 45 minutes to be relatively fast.  There was a $1 delivery fee.  The delivery person was polite and professional.\n\nOrder Minimum - The order minimum is low ($14).\n\nCheese-steak Sandwich - This was a pretty good sandwich.  The roll was nice and soft.  The meat could have been a touch more tender and it could of been a bit cheesier.  But I enjoyed it.  It was also a pretty large sandwich.\n\nhttp://tinyurl.com/3vg2wc5\n\nBacon Cheeseburger - This was a mediocre burger.   It was cooked past the ordered medium.  I would guess the patty had been frozen.  It did had that heavy denseness that usually only comes from a frozen patty.  It was edible but that was about it.\n\nhttp://tinyurl.com/3fxowqy\n\nWaffle Fries - These came with the burger and were very good.  \n\nPacking  - The food was all neatly packed.\n\nPricing - The prices are inline with my expectations.  I received a free soda for ordering $20 worth of food.  This offset the delivery charge.\n\nSoda 1 $1.35 Flavor: Coke Free !\nCheese steak Sandwich 1 $7.50 \nBacon Cheeseburger 1 $7.95\nSoda 2 $1.35 Flavor: Sprite\n\nSubtotal: $19.50\n Discount: $1.35\n Tax: $1.63\n Delivery Charge: $1.00\nTotal:   $20.78 \n\nOverall - The quality was a mixed bag.  The philly was better than the burger.  The prices were decent.  I would not order from them again for  a philly or a burger though.  I can get better versions of either delivered.  I might check out some of their other menu items.  Because they do have some interesting options for delivery.  The prices were decent and delivery was relatively fast.", "rating": 3, "date": "2011-07-27"}, {"excerpts": ["Prices are a bit steep - paid $8.95 for a bacon cheeseburger with a handful of fries - and the burger was your straight up frozen, not fresh patty.  ", "The patty itself tasted like garbage.  ", "The bacon was crispy but there was barely any bacon taste - just tasted like Chinese oil as another reviewer mentioned.  ", "HOW CAN YOU NOT MAKE ", "BACON TASTE ", "GOOD?!?! ", ":(  "], "author": "Elizabeth E.", "review": "I'm only giving 2 stars because their fries and onion rings were amazing... but everything else was a giant fail.\n\nIn my constant search for a decent American-style lunch spot near work, I tried V Cafe.\n\nPrices are a bit steep - paid $8.95 for a bacon cheeseburger with a handful of fries - and the burger was your straight up frozen, not fresh patty.  The patty itself tasted like garbage.  The bacon was crispy but there was barely any bacon taste - just tasted like Chinese oil as another reviewer mentioned.  HOW CAN YOU NOT MAKE BACON TASTE GOOD?!?! :(  So, there went the \"protein\" part of my meal... big sadface.\n\nOn a plus - their fries were fantastic and managed to travel well, as were their onion rings.   My main issue was with the delivery guy.  He kept calling my cell phone asking for directions when I had included them in my GrubHub order.  I work in a very hard-to-miss building.  First time he called, he said he was at our door and when I went outside, he was nowhere to be found.  About 15 minutes later, I see a car outside the gate and as I go out to see if it was the guy, he drove off.  He called back, I asked if that was him, he said yes... and then another 15 minutes went by before I saw him again.  He called me several times during this time but every time I picked up to try and help him, he'd say \"Hold on\" and then would hang up.\n\nSo, yeah dealing with their incompetent delivery driver was not fun.  I'll stick to Holy Grill for my overpriced burgers - at least theirs taste good.", "rating": 2, "date": "2012-12-22"}, {"excerpts": ["So I said to hell with it and got the double cheeseburger w/ fries.\n\n", "What I got was what cheeseburger heaven is made of. ", "The burger was cooked to my specification (med-rare) and was HUGE. ", "Think Nation's huge (they do delicious burgers in Oakland too). "], "author": "Chris M.", "review": "My boss frantically ran around the office asking if we wanted to order lunch from V Cafe. I'll admit, I looked at the menu and it was a bit sparse and weirdly fashioned. I'm not used to places which list sandwiches with no sides, etc. It can be a bit touch and go in SF. \n\nSo I said to hell with it and got the double cheeseburger w/ fries.\n\nSure, I paid 11 bucks. What I got was what cheeseburger heaven is made of. The burger was cooked to my specification (med-rare) and was HUGE. Think Nation's huge (they do delicious burgers in Oakland too). The waffle fries were good, but really only served to soak up the excess grease in my mouth.\n\nI felt bad, REAL BAD, eating this huge burger.\n\nBut not so bad I didn't repeat it the next week. I'm salivating just thinking about it now.", "rating": 5, "date": "2009-12-19"}, {"excerpts": ["Mushroom Cheeseburger is very good but not spectacular. \n\n"], "author": "Norris T.", "review": "Solid greasiness! \n\nGREAT Tuna Melt. \n\nChili Cheese Fries are Awesome. Buffalo Tenders are Very Awesome. \n\nMushroom Cheeseburger is very good but not spectacular. \n\nSalads are huge and tasty and sans the greasiness.", "rating": 4, "date": "2008-12-27"}, {"excerpts": ["in my opinion the bacon cheeseburger was a winner.  ", "I haven't had the fries there ", "but I always see people eating them.  ", "I can't really justify eating 1/2 pound of fries on top of a 800 calorie burger.  "], "author": "Anthony Y.", "review": "I had lunch here last week and ordered a cheesesteak.  The cheesesteak was pretty good.  I asked them to substitute provolone for American cheese and they did.  I also ordered extra cheese but I don't think I actually got extra cheese.  Which kind of perturbs me, but whatever next time I'll order extra extra cheese and see what happens.  I think that if they had Whiz it would be a 5 star cheesesteak.  The meat and the onions are plentiful and well seasoned.  However I did get a mouthful of gristle that was a little unappealing.  The cheesesteak as is is 3 stars.\n\nI have also had the burger here.  I was actually very impressed by the burger.  It was juicy, a little bit overcooked, but still juicy and they season the burger.  So many burger joints don't season the damn burger which drives me insane.  This place does.  I am sure the fat content of the ground beef is at least 25% which is fine by me and in my opinion the bacon cheeseburger was a winner.  I haven't had the fries there but I always see people eating them.  I can't really justify eating 1/2 pound of fries on top of a 800 calorie burger.  It's enough already.\n\nAll in all, I live and work around the corner and when I get a hankering for Jake's I go to V.... Because Jake's and Phat Philly don't deliver to me anymore.  Jake's I guess because I moved from Nob Hill to SOMA, which I can understand.  Phat Philly I don't really understand.  When they first opened up they delivered to me but don't anymore.", "rating": 4, "date": "2010-11-12"}, {"excerpts": ["'Specially the mushroom cheeseburger.\n\n"], "author": "Dwayne A.", "review": "The cheese steak --- super big and greasy and yummy goodness.\n\nThe burgers --- I love 'em.  'Specially the mushroom cheeseburger.\n\nI always ask for medium rare and one time it was overcooked.  But come on....this isn't about quality...this is about lunch after a hangover or just for plain comfort...\n\nThe garlic fries are mega-garlicky and I thank V for that!", "rating": 3, "date": "2007-05-30"}], "bacon cheeseburger": [{"excerpts": ["http://tinyurl.com/3vg2wc5\n\nBacon Cheeseburger ", "Bacon Cheeseburger 1 $7.95\nSoda 2 $1.35 Flavor: ", "Bacon Cheeseburger 1 $7.95\nSoda 2 $1.35 Flavor: "], "author": "Mark D.", "review": "This is a review of delivery from V Cafe.\n\nEasy to order via http://eat24hours.com/\n\nDelivery - The order was placed at  1:59 PM.    The order was delivered at 2:44 PM.  At 45 minutes, the delivery time was well within the estimate of 45 to 60 minutes.  While not super speedy, I do consider delivery within 45 minutes to be relatively fast.  There was a $1 delivery fee.  The delivery person was polite and professional.\n\nOrder Minimum - The order minimum is low ($14).\n\nCheese-steak Sandwich - This was a pretty good sandwich.  The roll was nice and soft.  The meat could have been a touch more tender and it could of been a bit cheesier.  But I enjoyed it.  It was also a pretty large sandwich.\n\nhttp://tinyurl.com/3vg2wc5\n\nBacon Cheeseburger - This was a mediocre burger.   It was cooked past the ordered medium.  I would guess the patty had been frozen.  It did had that heavy denseness that usually only comes from a frozen patty.  It was edible but that was about it.\n\nhttp://tinyurl.com/3fxowqy\n\nWaffle Fries - These came with the burger and were very good.  \n\nPacking  - The food was all neatly packed.\n\nPricing - The prices are inline with my expectations.  I received a free soda for ordering $20 worth of food.  This offset the delivery charge.\n\nSoda 1 $1.35 Flavor: Coke Free !\nCheese steak Sandwich 1 $7.50 \nBacon Cheeseburger 1 $7.95\nSoda 2 $1.35 Flavor: Sprite\n\nSubtotal: $19.50\n Discount: $1.35\n Tax: $1.63\n Delivery Charge: $1.00\nTotal:   $20.78 \n\nOverall - The quality was a mixed bag.  The philly was better than the burger.  The prices were decent.  I would not order from them again for  a philly or a burger though.  I can get better versions of either delivered.  I might check out some of their other menu items.  Because they do have some interesting options for delivery.  The prices were decent and delivery was relatively fast.", "rating": 3, "date": "2011-07-27"}, {"excerpts": ["Prices are a bit steep - paid $8.95 for a bacon cheeseburger with a handful of fries - and the burger was your straight up frozen, not fresh patty.  ", "The patty itself tasted like garbage.  ", "The bacon was crispy but there was barely any bacon taste - just tasted like Chinese oil as another reviewer mentioned.  ", "HOW CAN YOU NOT MAKE ", "BACON TASTE ", "GOOD?!?! ", ":(  "], "author": "Elizabeth E.", "review": "I'm only giving 2 stars because their fries and onion rings were amazing... but everything else was a giant fail.\n\nIn my constant search for a decent American-style lunch spot near work, I tried V Cafe.\n\nPrices are a bit steep - paid $8.95 for a bacon cheeseburger with a handful of fries - and the burger was your straight up frozen, not fresh patty.  The patty itself tasted like garbage.  The bacon was crispy but there was barely any bacon taste - just tasted like Chinese oil as another reviewer mentioned.  HOW CAN YOU NOT MAKE BACON TASTE GOOD?!?! :(  So, there went the \"protein\" part of my meal... big sadface.\n\nOn a plus - their fries were fantastic and managed to travel well, as were their onion rings.   My main issue was with the delivery guy.  He kept calling my cell phone asking for directions when I had included them in my GrubHub order.  I work in a very hard-to-miss building.  First time he called, he said he was at our door and when I went outside, he was nowhere to be found.  About 15 minutes later, I see a car outside the gate and as I go out to see if it was the guy, he drove off.  He called back, I asked if that was him, he said yes... and then another 15 minutes went by before I saw him again.  He called me several times during this time but every time I picked up to try and help him, he'd say \"Hold on\" and then would hang up.\n\nSo, yeah dealing with their incompetent delivery driver was not fun.  I'll stick to Holy Grill for my overpriced burgers - at least theirs taste good.", "rating": 2, "date": "2012-12-22"}, {"excerpts": ["in my opinion the bacon cheeseburger was a winner.  ", "I haven't had the fries there ", "but I always see people eating them.  ", "I can't really justify eating 1/2 pound of fries on top of a 800 calorie burger.  "], "author": "Anthony Y.", "review": "I had lunch here last week and ordered a cheesesteak.  The cheesesteak was pretty good.  I asked them to substitute provolone for American cheese and they did.  I also ordered extra cheese but I don't think I actually got extra cheese.  Which kind of perturbs me, but whatever next time I'll order extra extra cheese and see what happens.  I think that if they had Whiz it would be a 5 star cheesesteak.  The meat and the onions are plentiful and well seasoned.  However I did get a mouthful of gristle that was a little unappealing.  The cheesesteak as is is 3 stars.\n\nI have also had the burger here.  I was actually very impressed by the burger.  It was juicy, a little bit overcooked, but still juicy and they season the burger.  So many burger joints don't season the damn burger which drives me insane.  This place does.  I am sure the fat content of the ground beef is at least 25% which is fine by me and in my opinion the bacon cheeseburger was a winner.  I haven't had the fries there but I always see people eating them.  I can't really justify eating 1/2 pound of fries on top of a 800 calorie burger.  It's enough already.\n\nAll in all, I live and work around the corner and when I get a hankering for Jake's I go to V.... Because Jake's and Phat Philly don't deliver to me anymore.  Jake's I guess because I moved from Nob Hill to SOMA, which I can understand.  Phat Philly I don't really understand.  When they first opened up they delivered to me but don't anymore.", "rating": 4, "date": "2010-11-12"}], "avocado cheese olives burger": [], "teriyaki burger": [{"excerpts": ["The teriyaki burger is gross (teriyaki sauce on a burger).  ", "The fries are cool if you like those grid ones.  ", "So basically not a bad lunch place, but nothing special.  ", "OH, the pesto chicken sub looks delicious and gigantic, but I've never had it."], "author": "Avi H.", "review": "I used to come here for lunch often.  The cheese steak is ok -- well actually it was pretty bad (dry, tasteless).  I've had better on the East coast.  I like their burgers a lot, but don't get them to go.  The buns get really soggy in the styrofoam container.  The teriyaki burger is gross (teriyaki sauce on a burger).  The fries are cool if you like those grid ones.  So basically not a bad lunch place, but nothing special.  OH, the pesto chicken sub looks delicious and gigantic, but I've never had it.", "rating": 3, "date": "2007-03-28"}], "mushroom cheeseburger": [{"excerpts": ["I had the mushroom cheeseburger with Swiss and she had a cheeseburger with garlic fries instead of regular. ", "She enjoyed her burger and was very excited about her fries being 'so garlicky, mmmm', and I really enjoyed my burger, too. "], "author": "W W.", "review": "My lady friend and I were around the corner and in need of sustenance. I hopped on Yelp, of course, and offered her a selection of decently-rated places nearby. She chose V Cafe and I phoned in an order for burgers.\n\nI had the mushroom cheeseburger with Swiss and she had a cheeseburger with garlic fries instead of regular. She enjoyed her burger and was very excited about her fries being 'so garlicky, mmmm', and I really enjoyed my burger, too. It was yummy and exceeded my expectations.\n\nAs if that weren't reason enough to eat here, the service was really friendly and they were so quick! It was a pleasant experience and the food was definitely better than standard diner fare.\n\nI'm happy we tried this place and we both are looking forward to sampling other things on their menu.", "rating": 4, "date": "2014-05-31"}, {"excerpts": ["Mushroom Cheeseburger is very good but not spectacular. \n\n"], "author": "Norris T.", "review": "Solid greasiness! \n\nGREAT Tuna Melt. \n\nChili Cheese Fries are Awesome. Buffalo Tenders are Very Awesome. \n\nMushroom Cheeseburger is very good but not spectacular. \n\nSalads are huge and tasty and sans the greasiness.", "rating": 4, "date": "2008-12-27"}, {"excerpts": ["'Specially the mushroom cheeseburger.\n\n"], "author": "Dwayne A.", "review": "The cheese steak --- super big and greasy and yummy goodness.\n\nThe burgers --- I love 'em.  'Specially the mushroom cheeseburger.\n\nI always ask for medium rare and one time it was overcooked.  But come on....this isn't about quality...this is about lunch after a hangover or just for plain comfort...\n\nThe garlic fries are mega-garlicky and I thank V for that!", "rating": 3, "date": "2007-05-30"}], "hawaii cheeseburger": [], "double cheeseburger": [{"excerpts": ["So I said to hell with it and got the double cheeseburger w/ fries.\n\n", "What I got was what cheeseburger heaven is made of. ", "The burger was cooked to my specification (med-rare) and was HUGE. ", "Think Nation's huge (they do delicious burgers in Oakland too). "], "author": "Chris M.", "review": "My boss frantically ran around the office asking if we wanted to order lunch from V Cafe. I'll admit, I looked at the menu and it was a bit sparse and weirdly fashioned. I'm not used to places which list sandwiches with no sides, etc. It can be a bit touch and go in SF. \n\nSo I said to hell with it and got the double cheeseburger w/ fries.\n\nSure, I paid 11 bucks. What I got was what cheeseburger heaven is made of. The burger was cooked to my specification (med-rare) and was HUGE. Think Nation's huge (they do delicious burgers in Oakland too). The waffle fries were good, but really only served to soak up the excess grease in my mouth.\n\nI felt bad, REAL BAD, eating this huge burger.\n\nBut not so bad I didn't repeat it the next week. I'm salivating just thinking about it now.", "rating": 5, "date": "2009-12-19"}], "turkey cheeseburger": [], "fish burger": [], "vegetarian burger": [], "jalapeno cheeseburger": [], "feta cheeseburger": []}