{"princess cake": [{"excerpts": ["We got their Princess Cake: made with a Vanilla sponge cake (triple sec soaked) with a layer of raspberry jam, vanilla custard, and whipped cream, draped in green almond marzipan. ", "I've never had a princess cake before working at this office ", "and I have to say", ", it's really tasty. ", "Light, but still decadent. ", "Plus, the triple sec soaked cake gives it a lot of flavor and moisture. ", "I'm not big on marzipan, but it works in this case. "], "author": "Elena N.", "review": "At work, we do little birthday treats. It's always the bday person's choice, so this time, we had a cake from Victoria Pastry. We celebrated on Tuesday, October 23rd around 2pm.\n\nWe got their Princess Cake: made with a Vanilla sponge cake (triple sec soaked) with a layer of raspberry jam, vanilla custard, and whipped cream, draped in green almond marzipan. I've never had a princess cake before working at this office and I have to say, it's really tasty. Light, but still decadent. Plus, the triple sec soaked cake gives it a lot of flavor and moisture. I'm not big on marzipan, but it works in this case. Actually, the combination of the custard, jam, and whipped cream all work really well together.\n\nDefinitely a great bakery for princess cakes. We always pick one up here every year for this particular bday.", "rating": 4, "date": "2018-11-07"}, {"excerpts": ["The princess cake was far beyond anything that I expected.\n\n"], "author": "Ken L.", "review": "The princess cake was far beyond anything that I expected.\n\nI am not a huge sweet or cake person, but I tried this based on reviews and was so impressed by how mouthwateringly moist it was.\n\nIt produced one of those eating moments where all thoughts stop, time stops, and the center of the world is what is touching your tastebuds.", "rating": 5, "date": "2018-10-31"}, {"excerpts": ["Their signature princess cake looks tremendous and you can try a slice, or there are a few others that were very tempting. "], "author": "Jeffrey S.", "review": "More adventuring in North Beach led me to this shop. I'm not sure how I didn't see it here before, as I visit the truffle shop around the corner every time I'm in town, but today I did see it. I had just checked into my hotel, and taken the bus up to this neighborhood to get truffles as my first SF destination (because priorities) and I decided to take a quick detour for a pastry or cookie or something first. It's the kind of thing that a trip to San Francisco *should* involve. Having delicious destinations, but being open to trying all kinds of new things as they come up. Finding cute bakeries and sharing a few treats while seated at a small table, watching people walk by. Sipping, smiling, sampling.\n\nRoll the dice and sometimes you lose, but not today. I walked in and saw that they have cookies for sale by the pound, and I ordered one of every single cookie on the middle shelf. They happily obliged and I ended up with a menagerie of delightful little cookies. They were all very European--small, cute, and would have been perfect to sample, share, and compare notes. But I was flying solo today and ate them all myself. I sat down at the cute table out front and ate every last one all by myself. I closed my eyes and felt the sun on my face, the breeze in the air, and the flavors in my mouth. It was aaaaalmost perfect.\n\nOf the cookies, the lunette is the most interesting, with its heart shape and window between layers that lets you peek into the jam. They're gorgeous. But the real winner was the almond flavored one, with the pine nut topping and the amazing chew. I can't even describe the perfect balance of sweet and texture and crunch. I could eat a dozen right now. \n\nThis really is the kind of place you just pop in and try. Their signature princess cake looks tremendous and you can try a slice, or there are a few others that were very tempting. The eclairs (choose from cream or custard) also called my name, but I will come back to share this sort of experience with others in the future; there's much to try.\n\nI left, and then went and got my truffles. And then I wandered and tried three other places on a whim. But there's so much more to explore, so I'll be back to the neighborhood, and back to Victoria.", "rating": 5, "date": "2018-06-18"}, {"excerpts": ["The most popular items in here are their PRINCESS CAKE & CANNOLIS. ", "The PRINCESS CAKE has Raspberries,  Custard , Whipped  ", "Cream, Triple Sec, & almond paste. ", "It is a beautiful spring green color. ", "DELICIOUSSSS! ", "Their Cannolis are Ricotta filled with Chocolate Chips. ", "Also DELICIOUSSSS! ", "They also have great Cappuccinos. ", "They have table & chairs inside & outside this little Italian cafe. ", "This is a great people watching spot.  \n", "It used to be, you had to have mega bucks & be really rich to have the Good Life, not anymore. ", "The Game has changed. ", "You've been Upgraded. ", "Now You Can \nLive Like a King on a Limited Budget!"], "author": "Stephen Z.", "review": "AN ABSOLUTELY MUST DO! DELICIOUS ITALIAN PASTRIES & Cappuccino. Located in the Little Italy section of San Francisco called North Beach. The most popular items in here are their PRINCESS CAKE & CANNOLIS. The PRINCESS CAKE has Raspberries,  Custard , Whipped  Cream, Triple Sec, & almond paste. It is a beautiful spring green color. DELICIOUSSSS! Their Cannolis are Ricotta filled with Chocolate Chips. Also DELICIOUSSSS! They also have great Cappuccinos. They have table & chairs inside & outside this little Italian cafe. This is a great people watching spot.  \nIt used to be, you had to have mega bucks & be really rich to have the Good Life, not anymore. The Game has changed. You've been Upgraded. Now You Can \nLive Like a King on a Limited Budget!", "rating": 5, "date": "2018-03-17"}, {"excerpts": ["As I was about leave, an elderly local lady suggested to try the princess cake. ", "I do not want to miss an opportunity, I got myself a slice to go. ", "The first bite was heavenly. ", "The jam, cream, sponge cake and marzipan mingle together in my mouth. "], "author": "Yammie B.", "review": "After hearing Sunday service, I stopped by to get some breakfast. I ordered an iced coffee and a custard filled eclair. I am not much of a coffee drinker but it was smooth enough for me. The eclair was fresh and not too sweet. I can taste a hint of bitterness from the chocolate, which is a good thing for me.\n\nAs I was about leave, an elderly local lady suggested to try the princess cake. I do not want to miss an opportunity, I got myself a slice to go. The first bite was heavenly. The jam, cream, sponge cake and marzipan mingle together in my mouth. No regrets.\n\nNext time I visit San Francisco, I will definitely be back to try the rest of their pastries. No wonder its been around for so long (1914 to be exact).", "rating": 4, "date": "2018-06-25"}, {"excerpts": ["Tiramisu -  the best, not too sweet, full of espresso, moist \nPrincess cake - beautiful to the eye", ", I like almond but marzipan is too sweet\nCroissant -  just meh\nApple strudel - too sweet and gooey, ended up discarding it "], "author": "Connie W.", "review": "We seldom eat European desserts so this visit is a rare treat.\n\nTiramisu -  the best, not too sweet, full of espresso, moist \nPrincess cake - beautiful to the eye, I like almond but marzipan is too sweet\nCroissant -  just meh\nApple strudel - too sweet and gooey, ended up discarding it (I am a frugal person, not natural for me to throw away food)\n\nNext time will try their cookies to go\npignoli cookies (pine nut cookies)\namaretti cookies (almond cookes)", "rating": 3, "date": "2018-01-06"}, {"excerpts": ["The princess cake is probably the most ~ aesthetic ~ due to its bright green marzipan covering and intricate frosting lol. ", "It tasted okay, but the marzipan was a little overpowering. ", "The cake itself was fluffy and moist. ", "The apple strudel was good, but would've been better warmed up since it was so hard to tear apart. ", "And the cannoli was different from any other cannoli I've had - it's less sweet and you can really taste the ricotta in the filling. ", "Our favorite was the cheesecake, which was creamy, dense, and perfectly sweet."], "author": "Jen L.", "review": "I couldn't resist visiting this bakery to take a look at their princess cakes, but we ended up picking up some other goodies as well. We chose a sun-drenched spot on the seating area outside to enjoy the pastries. The princess cake is probably the most ~ aesthetic ~ due to its bright green marzipan covering and intricate frosting lol. It tasted okay, but the marzipan was a little overpowering. The cake itself was fluffy and moist. The apple strudel was good, but would've been better warmed up since it was so hard to tear apart. And the cannoli was different from any other cannoli I've had - it's less sweet and you can really taste the ricotta in the filling. Our favorite was the cheesecake, which was creamy, dense, and perfectly sweet.", "rating": 4, "date": "2018-02-02"}, {"excerpts": ["Victoria Pastry has got a number of sweets to choose from, but their princess cake is what they're known for. ", "It's very sweet and rich - even though we ate ours the next day, it was still fresh."], "author": "Casey S.", "review": "Victoria Pastry has got a number of sweets to choose from, but their princess cake is what they're known for. It's very sweet and rich - even though we ate ours the next day, it was still fresh.", "rating": 5, "date": "2018-04-16"}, {"excerpts": ["I had a slice of princess cake which was just incredible. ", "The martzipan was very tasty and the whole thing was delicious. ", "It was a bit pricey though. ", "The establishment is super adorable and the service was fine. ", "There is a restroom available for customers. ", "I recommend it if you need a special treat."], "author": "Elizabeth B.", "review": "I stopped by briefly for a snack and it was lovely. I had a slice of princess cake which was just incredible. The martzipan was very tasty and the whole thing was delicious. It was a bit pricey though. The establishment is super adorable and the service was fine. There is a restroom available for customers. I recommend it if you need a special treat.", "rating": 4, "date": "2018-06-02"}, {"excerpts": ["I really want to try their princess cake... "], "author": "Erica D.", "review": "This place is sooo yummy and OG. Right in teh heart of North Beach Little Italy I stopped by on Fathers day for some sweets and they were amazing. The cannolis and cream puffs are so fresh and sweet. Probably the best cannoli I have ever had. Knocking a star for the price ($4.75 each).... they dont even cost that much in NYC or Boston! \n\nI really want to try their princess cake... it looks so yummy and is sold by the slice!\n\nVery casual and unpretentious.... great place to grab a coffee and a cookie while site seeing in the area. Right next to a cute park you can go eat at!", "rating": 4, "date": "2017-06-21"}, {"excerpts": ["I've been wanting to try Princess cake ", "but it's pretty hard to find. ", "The princess cake here is delicious and it was fun to try! ", "They have a nice selection of pastries (all of which look pretty good). ", "Cake was a bit pricy ($5.75 per slice) but worth a try for sure. ", "Good dessert stop in North Beach/Little Italy!"], "author": "Kalena H.", "review": "I've been wanting to try Princess cake but it's pretty hard to find. The princess cake here is delicious and it was fun to try! They have a nice selection of pastries (all of which look pretty good). Cake was a bit pricy ($5.75 per slice) but worth a try for sure. Good dessert stop in North Beach/Little Italy!", "rating": 5, "date": "2018-07-02"}, {"excerpts": ["She always used to say, \"you haven't lived until you've tried their princess cake!!\" \n\n", "I think most might find their princess cake too sweet especially if your not into marzipan - almond paste, from what I've noticed lots of American born people are not that into it.\n\n"], "author": "Stefan T.", "review": "Slipped in here today 6/1/16 just in time before closing. \n\nThree years ago they moved to this location and was the first time I've been in... been going to their sister store Stellas instead.\n\nI might be biased as I grew up with these desserts as a kid. The neighbor across the street, an original SF native always brought them in. She always used to say, \"you haven't lived until you've tried their princess cake!!\" \n\nI think most might find their princess cake too sweet especially if your not into marzipan - almond paste, from what I've noticed lots of American born people are not that into it.\n\nGo in for their cookies sold by the pound. They are outstanding esp the pine nut cookies. I bought a variety of cookies and a Napoleon. All good stuff. At 8pm I could tell that the Napoleon was a bit soggy from sitting likely 12 hours but still as good as this type of dessert gets. See photos. At Stellas I know they sell cannolis and typically they only have a couple filled on display. As the day goes along they fill more to prevent soggyness. Didn't see any cannolis today at Victorias. In fact the two Napoeons they had left were sort of hidden toward the back. \n\nWould be nice if they would sell smaller slices. Typically what is sold here is rich. I recommend buying a slice and sharing with a friend along with a few pine nut cookies each.\n\nTry also in SF Tartine and BPatasserie. In Alameda try Crispian for the best almond croissant youve ever had.", "rating": 5, "date": "2016-06-01"}, {"excerpts": ["I ordered a princess cake. ", "But it wasn't a technically sound princess cake. ", "Princess cakes have a dome of whipped cream and even sponge cake layers inside. ", "Good but not exceptional."], "author": "Haana R.", "review": "I ordered a princess cake. The staff was friendly but couldn't remember if I paid because whoever took my call didn't make note of it. \n\nThe cake was yummy!  But it wasn't a technically sound princess cake. Princess cakes have a dome of whipped cream and even sponge cake layers inside. Good but not exceptional.", "rating": 3, "date": "2017-03-20"}, {"excerpts": ["Two words: Princess cake! \n\n"], "author": "Corinna T.", "review": "Two words: Princess cake! \n\nIf there is one thing you want to get, I'd recommend that. It is super moist and shareable. After having one bite, I knew I had to come back one day. I shared it with a friend, and half the slice was more than enough to satisfy my sweet tooth.\n\nBefore leaving,I bought a bag of cookies to go and they were good. Next time I would want to try the cannoli.\n\nOverall, great service. The woman helping me was very patient and helpful when I was making my pastry selections. I'd definitely come back!", "rating": 4, "date": "2015-09-17"}, {"excerpts": ["The place is on the small side and the Lady working not in the least bit cheery or welcoming, the cases were absolutely filled with row's of Cookies, Cupcakes, Pastries and Cake slices of which I settled on a Chocolate Eclair for my Husband and a slice of Princess Cake for myself. ", "The Princess Cake was ok, a little lacking in the jam layer but with a good Almond flavor, My Husband somewhat enjoyed the Eclair, it was a little on the dry side ", "so I'm not sure how long it was kept in the case. ", "I would be interested in returning at Easter as I see they Bake Hot Cross Buns here."], "author": "Emmalouise B.", "review": "1:30pm on a Sunday afternoon and your waiting in line with Hubby and a Girlfriend at Mama's after dragging them to the Escape from Alcatraz Triathlon when the talk turns to Chocolate Pastries for later. What do you do? Yelp, of course! Luckily Victoria Pastry was literally just around the corner so I was able to go and see what the offerings were while I left my Husband in Line.\n\nThe place is on the small side and the Lady working not in the least bit cheery or welcoming, the cases were absolutely filled with row's of Cookies, Cupcakes, Pastries and Cake slices of which I settled on a Chocolate Eclair for my Husband and a slice of Princess Cake for myself. I was pleased to discover that they have both the cream and custard filled Eclairs available here.\n\nThe Princess Cake was ok, a little lacking in the jam layer but with a good Almond flavor, My Husband somewhat enjoyed the Eclair, it was a little on the dry side so I'm not sure how long it was kept in the case. I would be interested in returning at Easter as I see they Bake Hot Cross Buns here.", "rating": 3, "date": "2015-07-15"}, {"excerpts": ["Aside from the fact that San Franciscans are strong supporters of a family business, there's a reason why this bakery has been around since 1914: their Swedish Princess cake.\n\n", "but Victoria's Pastry Company wins the Swedish Princess cake test by a mile."], "author": "Janice C.", "review": "Aside from the fact that San Franciscans are strong supporters of a family business, there's a reason why this bakery has been around since 1914: their Swedish Princess cake.\n\nSoft layers of sponge cake with raspberry jam and whipped cream covered with sweet marzipan fondant that tastes fresh, never crumbly. They've perfected the art of making this cake that even the Swedes will approve of. An 8 inch will set you back $35, but that's a memorable cake the birthday girl won't soon forget. \n\nOther enticing italian baked goods line the display case, but I wanted a sampling of the humongous strawberry cream puff. Ask for it if it's freshly made and you won't be disappointed. \n\nI personally have been going to Schubert's bakery for better cake selection (at a cheaper price) but Victoria's Pastry Company wins the Swedish Princess cake test by a mile.", "rating": 4, "date": "2015-06-30"}, {"excerpts": ["LOVE the Princess Cake!!! ", "read the reviews and it did not disappoint!!! ", "the cake was perfectly moist, the raspberry jam add a hint of sweetness along with the whipped cream, and the almond marzipan icing was amazing!!! ", "YUMMM... ", "now i need to find it in NYC. ", "Giving it 4 stars because the box for the cake was way too big and my cake was messy when I made it back to the hotel (", "only a few blocks ", "and i was being careful)."], "author": "Jenny Z.", "review": "OMG! LOVE the Princess Cake!!! read the reviews and it did not disappoint!!! the cake was perfectly moist, the raspberry jam add a hint of sweetness along with the whipped cream, and the almond marzipan icing was amazing!!! YUMMM... now i need to find it in NYC. Giving it 4 stars because the box for the cake was way too big and my cake was messy when I made it back to the hotel (only a few blocks and i was being careful).", "rating": 4, "date": "2016-11-07"}, {"excerpts": ["I think their specialty is a princess cake. ", "I tried some princess cake and thought it was good although a tiny bit too sweet for my tastes. "], "author": "Danielle C.", "review": "This is a small bakery located right off Columbus Avenue. There's a good variety of pastries here. I think their specialty is a princess cake. They sell cakes by the slice.\n\nI tried some princess cake and thought it was good although a tiny bit too sweet for my tastes. The cake is soaked in some sort of syrup.\n\nI got a cannoli myself. It was quite good with lots of chocolate chips in the cream.", "rating": 4, "date": "2015-07-11"}, {"excerpts": ["We were dining next door and having heard about all the rave reviews on the princess cake we stopped by to taste and something was off in the marzipan , the rest of the cake was fine ", "but I was getting an off taste of stale/ rancid  oil or fat in the marzipan that we had to leave it out. ", "So much for all the raving"], "author": "Prathima K.", "review": "We were dining next door and having heard about all the rave reviews on the princess cake we stopped by to taste and something was off in the marzipan , the rest of the cake was fine but I was getting an off taste of stale/ rancid  oil or fat in the marzipan that we had to leave it out. So much for all the raving", "rating": 2, "date": "2017-09-16"}, {"excerpts": ["Came by bright and early to pickup some of the princess cake for my wife's birthday. ", "The people were very nice. ", "The smell inside was so good and welcoming. ", "The cake was delicious and a big hit with the family. ", "Thank you guys for making my wife's birthday special!"], "author": "Eddie H.", "review": "Came by bright and early to pickup some of the princess cake for my wife's birthday. The people were very nice. The smell inside was so good and welcoming. The cake was delicious and a big hit with the family. Thank you guys for making my wife's birthday special!", "rating": 5, "date": "2017-01-02"}, {"excerpts": ["I read the reviews about the Princess Cake but it honestly did not look appealing to me. ", "Granted, I do have bad luck with choosing the good looking ones with an unappealing taste. ", "Anywho! ", "I swear I'll try the Princess Cake next time to see what the hubbub is all about!"], "author": "Linda K.", "review": "HOLY MOLY CANNOLI\n\nFinally had the chance to check out this pastry shop that has been around since 1914! I read the reviews about the Princess Cake but it honestly did not look appealing to me. Granted, I do have bad luck with choosing the good looking ones with an unappealing taste. Anywho! I ended up having the Almond Tarte (flaky pastry, almond butter cake and raspberry) and the Cannoli (ricoota and chocolate chips). \n\nFirst off, the Almond Tarte was meh. It was chewy and borderline solid. It was too difficult to attack with my fork, although I may be misinterpreting the \"tarte\" as a cake? Either way, I didn't taste the almond and the raspberry had a peanut butter-ish texture that I was not a fan of.\n\nBut the CANNOLI. Oh man! It's basically a thick crusted, flaky pastry wrapped around a long tube of cream. When you bite into it, the thick crust just cracks the entire cannoli into pieces but the combination of the crust and the cream made me want to take another bite! It was delicious!\n\nI honestly do feel like the pastries are a little overpriced for what it is, but it's a type of pastry I've never had and Victoria's might have started a new addiction. I swear I'll try the Princess Cake next time to see what the hubbub is all about!", "rating": 4, "date": "2014-11-09"}, {"excerpts": ["I was on a princess cake hunt throughout the city after having it at my wedding and landed here. ", "Unfortunately, their princess cake did not compare to the one we had in Novato, which did definitely set a very high standard, but still - I was hoping for more.\n\n"], "author": "Emily H.", "review": "I was on a princess cake hunt throughout the city after having it at my wedding and landed here. Unfortunately, their princess cake did not compare to the one we had in Novato, which did definitely set a very high standard, but still - I was hoping for more.\n\nThe plus was that they had really friendly service.", "rating": 3, "date": "2017-09-16"}, {"excerpts": ["Stopped in for a slice of cake a few days ago and decided on the beautiful green princess cake. ", "The staff were so sweet and helpful. ", "The cake itself was so delicious. ", "Not overly sweet but definitely satisfying and tasty. ", "Will definitely be stopping by here to try more treats!"], "author": "Jessica G.", "review": "Stopped in for a slice of cake a few days ago and decided on the beautiful green princess cake. The staff were so sweet and helpful. The cake itself was so delicious. Not overly sweet but definitely satisfying and tasty. Will definitely be stopping by here to try more treats!", "rating": 5, "date": "2016-11-13"}, {"excerpts": ["My mom got a princess cake from this bakery for my baby shower, and WOW was it amazing. ", "Best cake I've ever tasted, and absolutely gorgeous too. ", "The marzipan top is genius because it looks so nice & smooth like a fondant but tastes much better. ", "The inside of the cake is light and fluffy with delicious layers of whipped cream. ", "I would highly recommend one of these for any upcoming cake-eating occasion!"], "author": "Emily A.", "review": "My mom got a princess cake from this bakery for my baby shower, and WOW was it amazing. Best cake I've ever tasted, and absolutely gorgeous too. The marzipan top is genius because it looks so nice & smooth like a fondant but tastes much better. The inside of the cake is light and fluffy with delicious layers of whipped cream. I would highly recommend one of these for any upcoming cake-eating occasion!", "rating": 5, "date": "2016-10-22"}, {"excerpts": ["The Princess Cake.  ", "Tried it for the first time here when I was 20 or 21 & have kept it in my life ever since.  "], "author": "Veronica M.", "review": "What do you need to know about Victoria Pastry?  First, the yelp address states it's in Russian Hill, but it's not.  It's overlooking Washington Square Park, which is definitely North Beach.  \n\nNow, what this bakery excels at...\n\nThe Princess Cake.  Tried it for the first time here when I was 20 or 21 & have kept it in my life ever since.  I'm way over 21 now.\n\nThe Cappuccino Cake.  I've gotten one for more than a couple of birthday cakes.  Coffee & cream, in a cake?  Heavenly.\n\nThe little \"gingerbread\" raisin cookies.  In Italian, they're known as papassinos.  Soft & chewy, they're diamond/rectangular shaped & addictive.  Really, with milk, coffee, a cappuccino, or a latte...a perfect marriage.\n\nI've heard some complain that Victoria Cakes are too expensive.  I disagree.  They are worth it.  And, you get what you pay for.\n\nThey are known for their eclairs & cream puffs as well; but I rarely order those.  I love cake.  And those cookies.  \n\nSometimes I miss their original location (corner of Stockton & Vallejo), but admittedly that's only if I'm headed to the Walgreens a couple doors down from there.  This Washington Square Park location is far superior, only smaller.\n\n5 stars.", "rating": 5, "date": "2014-04-29"}, {"excerpts": ["Princess cake. ", "Yet another princess cake review ", "but I couldn't resist. ", "It's the best slice of non chocolate cake I've ever had! ", "Worth every penny. ", "Perfectly textured yellow cake with layers of whipped cream, custard, raspberry and triple sec all blanketed in a beautifully textured marzipan! \n", "Every bite is perfectly balanced with just the right amount of cake and filling. ", "What an amazing flavor profile! ", "How have I never heard of princess cake before!!! \n\n"], "author": "Jess K.", "review": "Boom. Princess cake. The end. \n\nYet another princess cake review but I couldn't resist. It's the best slice of non chocolate cake I've ever had! Worth every penny. Perfectly textured yellow cake with layers of whipped cream, custard, raspberry and triple sec all blanketed in a beautifully textured marzipan! \nEvery bite is perfectly balanced with just the right amount of cake and filling. What an amazing flavor profile! How have I never heard of princess cake before!!! \n\nThis slice of glory will make even the mightiest of macho men feel like a princess. \n\nAs for the rest of VPC's pastries, they all look gorgeous and mouth watering and I'm sure they will have something to satisfy whatever your sweet tooth desires.", "rating": 5, "date": "2015-07-15"}, {"excerpts": ["* time to give their Princess Cake a try.....", "And since everybody needs a friend, got a slice of Princess Cake as well as St. Honoré Cake to do the ultimate taste test\n\nPrincess Cake - very sweet & light as air - loved the almond undertones to the cake & the raspberry jam "], "author": "Adrienne G.", "review": "Meandering my way around the hood, trying to kill some time before a cheese class, when I find myself walking right by Victoria Pastry Company......fate was telling me it was *finally* time to give their Princess Cake a try.....it's been haunting me for forever!\n\nAnd since everybody needs a friend, got a slice of Princess Cake as well as St. Honoré Cake to do the ultimate taste test\n\nPrincess Cake - very sweet & light as air - loved the almond undertones to the cake & the raspberry jam was a nice cutting contrast.  The fork sliced its way through this cake like nobody's business & I found 1 slice could have served 2 people due to high sugar-sweetness factor.  Would get it again & pair w/ a lovely espresso.  I imagine the bitter coffee would be a perfect pairing!\n\nSt. Honoré Cake - put a cream puff on anything & I'm going to be a fan & this was no exception.  I liked the almond flavor to the cake & the whipped cream layers.  The bottom layer was like pastry dough & was kind of difficult to cut w/ the plastic fork - ended up getting whipped cream & cakey layers all over my little plate.... until I brought a knife into the picture.  Then it was much more manageable - but this still wouldn't stop me from getting it again - yeah, it was *that* good\n\nSo for my 1st foray into the world of Italian cakes in North Beach, have to say I'm a huge fan!", "rating": 4, "date": "2013-09-25"}, {"excerpts": ["Princess cake almond cake... ", "Italian macaroons... ", "Delicious"], "author": "Lindsay H.", "review": "Old-school and absolutely delicious... Great service. Cannoli out of this world, Napoleon too!  Princess cake almond cake... Italian macaroons... Delicious", "rating": 5, "date": "2017-04-13"}, {"excerpts": ["I've always liked their Chocolate Eclairs and Princess Cake!\n\n", "You can taste that their Chocolate Eclairs are made fresh instead of having the taste texture of just being in refrigeration for hours!\n\n", "As for their Princess Cake, I have always thought this cake looked unique ever since growing up because it has a chewy green outer layer and a layer of raspberry jam packed inside!  ", "It also reminds me of a cake that you would see in Alice in Wonderland, Mad Hatter's Tea Party!  "], "author": "Tiffany D.", "review": "I've always liked their Chocolate Eclairs and Princess Cake!\n\nYou can taste that their Chocolate Eclairs are made fresh instead of having the taste texture of just being in refrigeration for hours!\n\nAs for their Princess Cake, I have always thought this cake looked unique ever since growing up because it has a chewy green outer layer and a layer of raspberry jam packed inside!  It also reminds me of a cake that you would see in Alice in Wonderland, Mad Hatter's Tea Party!  It is very toot sweet!\n\nThey also offer other sweet, baked goodies here, but those two delights are my main favorites at this pastry shop!", "rating": 4, "date": "2013-04-24"}, {"excerpts": ["Princess cake slice and coffee proved to be exactly what I expected, beautifully done - and coffee from carafe was still fresh. ", "Old old bakery still doing it well."], "author": "cm g.", "review": "Princess cake slice and coffee proved to be exactly what I expected, beautifully done - and coffee from carafe was still fresh. Old old bakery still doing it well.", "rating": 3, "date": "2017-03-19"}, {"excerpts": ["Came here to buy slices of my \"go-to's\", the Princess cake and St, Honore.  ", "Had to settle with the Princess cakes slices since it appears that they don't sell the St. Honore anymore, as it's not even listed on their menu board. ", "If you haven't tried it, Princess cake is a yellow cake with layers of whipped cream, custard, raspberry jam, triple sec and covered with a smooth layer marzipan. ", "A princess indeed. ", "The Princess cake was as delicious as usual and wished I had some St. Honore to try as well. ", "Victoria, please bring back the St. Honore.\n", "(http://www.yelp.com/biz_photos/victoria-pastry-company-san-francisco-2?select=mSu3uywafqw7HHNCI11Ysg#LBtTA8QoY__6GmXLd2d3Jw)"], "author": "Al L.", "review": "1914? That's how long Victoria Pastry has been selling its delicious sweet delicacies.  Victoria relocated to the corner of Filbert and Powell streets after moving from its long-time location at the corner of Vallejo and Stockton streets.  \n\nThis new location is smaller and it appears that the menu selection has decreased as well. They still have the Italian cookies, larger cookies, danishes, cannolis, slices of cakes and whole cakes. Came here to buy slices of my \"go-to's\", the Princess cake and St, Honore.  Had to settle with the Princess cakes slices since it appears that they don't sell the St. Honore anymore, as it's not even listed on their menu board. (http://www.yelp.com/biz_photos/victoria-pastry-company-san-francisco-2?select=mSu3uywafqw7HHNCI11Ysg#7bdx2vdFPVhcAVXNe5abdQ)\n\nIf you haven't tried it, Princess cake is a yellow cake with layers of whipped cream, custard, raspberry jam, triple sec and covered with a smooth layer marzipan. A princess indeed. The Princess cake was as delicious as usual and wished I had some St. Honore to try as well. Victoria, please bring back the St. Honore.\n(http://www.yelp.com/biz_photos/victoria-pastry-company-san-francisco-2?select=mSu3uywafqw7HHNCI11Ysg#LBtTA8QoY__6GmXLd2d3Jw)", "rating": 4, "date": "2014-10-16"}, {"excerpts": ["We had the Princess cake and the Napoleon, they were both delicious.  ", "Wish we would have had to come back to try more of the amazing desserts that they offer. ", "Nice inside and outside seating areas to enjoy your dessert and coffee and people watch."], "author": "Marcia M.", "review": "Nice place for dessert in the North Beach area.  We had the Princess cake and the Napoleon, they were both delicious.  Wish we would have had to come back to try more of the amazing desserts that they offer. Nice inside and outside seating areas to enjoy your dessert and coffee and people watch.", "rating": 5, "date": "2017-10-09"}, {"excerpts": ["we tried a slice of the princess cake and the chocolate truffle cake - both were good.  ", "the fondant on the princess cake was not overly sweet and really good texture, while the chocolate was so dense and rich - just how i like them! ", "lol ", "we also got a couple small cookies - $12+ pretty good deal!  ", "i would definitely consider buying a princess cake for a dinner party!"], "author": "Christina L.", "review": "so glad we stumbled upon this spot!  we were walking around north beach and looking for pizza (per usual) and voila! - there it was on the corner.  i dont typically roam around that area, so i knew we had to stop in.  we tried a slice of the princess cake and the chocolate truffle cake - both were good.  the fondant on the princess cake was not overly sweet and really good texture, while the chocolate was so dense and rich - just how i like them! lol we also got a couple small cookies - $12+ pretty good deal!  i would definitely consider buying a princess cake for a dinner party!", "rating": 4, "date": "2016-01-18"}, {"excerpts": ["Princess Cake!!!!!!!!! ", "Didn't think I would like this cake ", "but it's now one of my favorites! ", "I have yet to try their Canolis!"], "author": "Cheryl V.", "review": "Princess Cake!!!!!!!!! Didn't think I would like this cake but it's now one of my favorites! I have yet to try their Canolis!", "rating": 5, "date": "2015-11-17"}, {"excerpts": ["Got the princess cake because of all the rave reviews. ", "Unfortunately it just wasn't the type of cake I would like. ", "Way way way too sweet. ", "Though the sponge was moist and soft. ", "The bakery looked nice and maybe I will try some other ones."], "author": "Jenn May Z.", "review": "Got the princess cake because of all the rave reviews. Unfortunately it just wasn't the type of cake I would like. Way way way too sweet. Though the sponge was moist and soft. The bakery looked nice and maybe I will try some other ones.", "rating": 2, "date": "2017-03-15"}, {"excerpts": ["Princess Cake. ", "However, when we sat down to enjoy our eats, we noticed a couple sitting next to us with just the Princess Cake. ", "The woman of the couple began to strike up a conversation with us... about Princess Cake.\n\n", "She is addicted to Princess Cake - considers herself a connoisseur of Princess Cake. ", "She says that everyone usually goes to this one other bakery for Princess Cake, but she's found that Victoria Pastry Company has THE BEST. ", "She would know. ", "She has to have Princess Cake if she ever sees it anywhere. ", "Hello, Princess Cake! ", "Cake has always been a member of the \"It does the job and generally all right\" club, but Princess Cake gets special honors. ", "While the other pastries are quite nice, Princess Cake is the business.\n\n", "Princess Cake. ", "Done."], "author": "Cate T.", "review": "Princess Cake. It's the biggest reason to stop in at Victoria Pastry Company.\n\nMy first stop-in was with a Yelp friend, and we'd settled on a couple of other choices, considering the high-gear of our sweet tooth at that moment. However, when we sat down to enjoy our eats, we noticed a couple sitting next to us with just the Princess Cake. The woman of the couple began to strike up a conversation with us... about Princess Cake.\n\nShe is addicted to Princess Cake - considers herself a connoisseur of Princess Cake. She says that everyone usually goes to this one other bakery for Princess Cake, but she's found that Victoria Pastry Company has THE BEST. She would know. She has to have Princess Cake if she ever sees it anywhere. When she discovered neither of us have had it, she refused to let that continue to be the case and lopped off a piece of her cake and gave it to us to try out.\n\nHello, Princess Cake! Where have you been in my life?!\n\nCake has always been a member of the \"It does the job and generally all right\" club, but Princess Cake gets special honors. The textures, the flavors, especially the texture of the marzipan puts this slice of heaven above the clouds.\n\nI did return during my trip for a slice of my very own and to try other things. While the other pastries are quite nice, Princess Cake is the business.\n\nI think the only drawback is that their offerings of tea are Bigelow (yuck!) and their offerings of coffee typically taste burned.  There is nothing like a good cup of tea with your pastry, but you're not going to find that good cuppa here.\n\nPrincess Cake. Done.", "rating": 4, "date": "2014-07-13"}, {"excerpts": ["This is the bakery that my husband's family has been buying Italian Rum Cake at for years and they also made our wedding cake which had layers of Italian Rum Cake and Princess Cake (almond flavor). ", "For my husband's birthday party this year I hiked from downtown San Francisco to Victoria Pastry Company on foot just to retrieve an Italian Rum Cake for him. ", "In that case I would recommend the Princess Cake."], "author": "Kelly H.", "review": "I'm afraid I'm biased and I just love this bakery. This is the bakery that my husband's family has been buying Italian Rum Cake at for years and they also made our wedding cake which had layers of Italian Rum Cake and Princess Cake (almond flavor). For my husband's birthday party this year I hiked from downtown San Francisco to Victoria Pastry Company on foot just to retrieve an Italian Rum Cake for him. I really love Victoria Pastry Company.\n\nThe cakes here are always light, flavorful and moist which was not the case when we did cake tasting sessions for our wedding. A lot of the cakes we tasted were on the dry and heavy side,  so it was nice to know that we could have our wedding cake made here and didn't have to settle for something else. \n\nWhenever we buy a cake to share I notice that people help themselves to seconds, especially when it comes to the Italian Rum Cake. It makes you feel like you had a shot of rum, which I enjoy but others might not. In that case I would recommend the Princess Cake.", "rating": 5, "date": "2015-11-01"}, {"excerpts": ["Great Italian pastries - my favorite thing to get here is their Princess Cake - to die for if you like almond.  ", "So light, so airy.  ", "I've tried several of their various cakes/tortes ", "- everything is delicious, and you cannot go wrong.  ", "Highly recommend this place."], "author": "Rachael S.", "review": "Great Italian pastries - my favorite thing to get here is their Princess Cake - to die for if you like almond.  So light, so airy.  I've tried several of their various cakes/tortes - everything is delicious, and you cannot go wrong.  Highly recommend this place.", "rating": 4, "date": "2014-04-07"}, {"excerpts": ["I got the princess cake and it was delicious. ", "Got it to go and it was still upright in the box after the hour drive home."], "author": "Katie F.", "review": "Really great service!! liked that they had small bites to try. I got the princess cake and it was delicious. Got it to go and it was still upright in the box after the hour drive home.", "rating": 5, "date": "2016-12-04"}, {"excerpts": ["We tried Princess Cake, which is one of their best sellers. ", "It was super tasty and unique! ", "We also tasted the cannoli, lemon bars and wedding cookies. ", "Everything was delicious. ", "The prices are also reasonable. ", "Must try!!"], "author": "Lillian Y.", "review": "While visiting SF- several people told us to check out this bakery! So glad we did! It's such a cute place aesthetically. Inside- the workers were so friendly. We tried Princess Cake, which is one of their best sellers. It was super tasty and unique! We also tasted the cannoli, lemon bars and wedding cookies. Everything was delicious. The prices are also reasonable. Must try!!", "rating": 5, "date": "2017-05-31"}, {"excerpts": ["The princess cake marzipan was too sweet for me, the chocolate fedora cake didn't have enough rum for my liking. ", "The napoleon was good, but a bit too sweet for my liking. ", "The \"butterfly\" cookies were OK, but not sweet enough for my liking. "], "author": "melissa c.", "review": "I have fond memories of a special birthday with the St. Honore cake and other pastries throughout they years. This is the first time at this location, and I brought a few pastries to take home. The princess cake marzipan was too sweet for me, the chocolate fedora cake didn't have enough rum for my liking. The napoleon was good, but a bit too sweet for my liking. The \"butterfly\" cookies were OK, but not sweet enough for my liking. 6 of them cost almost $3, which seems a tad expensive.\n\nAll in all, each slice was almost $5. I will be back, but much more selective about my cake choices next time.", "rating": 3, "date": "2015-05-06"}, {"excerpts": ["I want to like it, but they ran out of their infamous princess cake (at 2pm in the afternoon!!). ", "The two we got (black and white and cannoli) are just NO good. ", "Sweet with no dimension. ", "Both their chocolate and cream don't taste fresh and quite below standard quality.  ", "What a let down."], "author": "Miss Y.", "review": "I want to like it, but they ran out of their infamous princess cake (at 2pm in the afternoon!!). The two we got (black and white and cannoli) are just NO good. Sweet with no dimension. Both their chocolate and cream don't taste fresh and quite below standard quality.  What a let down.", "rating": 2, "date": "2015-02-17"}, {"excerpts": ["Princess cake is so hard to come by in Toronto, and Victoria does it so well. ", "It was so good that we went back again! ", "It's a tad bit pricey for a slice - almost $6, but it was well worth it. ", "The Italian cookies were also fantastic - we tried nearly every flavor and enjoyed the pine nut and walnut ones the most. ", "Definitely stop here ", "if you are in San Fran, it's also apparently been around since the early 1900s and definitely had an older and authentic feel to it."], "author": "Hana M.", "review": "SO! GOOD! Princess cake is so hard to come by in Toronto, and Victoria does it so well. It was so good that we went back again! It's a tad bit pricey for a slice - almost $6, but it was well worth it. The Italian cookies were also fantastic - we tried nearly every flavor and enjoyed the pine nut and walnut ones the most. Definitely stop here if you are in San Fran, it's also apparently been around since the early 1900s and definitely had an older and authentic feel to it.", "rating": 5, "date": "2016-08-15"}, {"excerpts": ["Princess cake = marzipan heaven over a divine weightless wonder of cake, cream, custard and jam.  ", "I always though the top layer was fondant (which I'm not a fan of) but it's marzipan rolled out and colored to the color of some fairy princess' ballgown, and super delicious!  ", "If you don't like almond-flavoring...", "($4.25 for the slice of Princess cake)\n\nService "], "author": "Fannie S.", "review": "Princess cake = marzipan heaven over a divine weightless wonder of cake, cream, custard and jam.  I always though the top layer was fondant (which I'm not a fan of) but it's marzipan rolled out and colored to the color of some fairy princess' ballgown, and super delicious!  If you don't like almond-flavoring...then marzipan is not for you.  \n\nPrices = reasonable.  ($4.25 for the slice of Princess cake)\n\nService = friendly.\n\nSeating = limited but we got there around 7 p.m. and it wasn't too busy nor packed.  They seem to have a lot of take out patrons.", "rating": 3, "date": "2012-08-31"}, {"excerpts": ["We had the Italian cake which had creme and then of course the lovely princess cake that I was curious about.  ", "I never saw this type of cakes, gummy custard creme yum yum and yum.  ", "It is pretty small on the corner. ", "They do have the typical Taramisu and Napoleon cakes that looked great. ", "I wanted the canoli as well too.  ", "Anyways very good, I loved it and would go again."], "author": "Keven W.", "review": "We bumped into this place by accident while walking in Little Italy.  We had the Italian cake which had creme and then of course the lovely princess cake that I was curious about.  I never saw this type of cakes, gummy custard creme yum yum and yum.  It is pretty small on the corner. They do have the typical Taramisu and Napoleon cakes that looked great. I wanted the canoli as well too.  Anyways very good, I loved it and would go again.", "rating": 5, "date": "2014-08-03"}, {"excerpts": ["Was looking for princess cake, and Victoria Pastry did not disappoint on that score. ", "Excellent.\n"], "author": "Aris F.", "review": "Was looking for princess cake, and Victoria Pastry did not disappoint on that score. Excellent.\nStella Pastry used to be my favorite pastry shop in SF, but now that I've fallen out of love with their sacripantina (which, by the way, you can also pick up at Victoria Pastry - same owners), I prefer Victoria Pastry.\n\nWish they were open later though.", "rating": 4, "date": "2015-04-21"}, {"excerpts": ["The Princess Cake\n\nhttp://www.yelp.com/biz_photos/VxtDQfBA3ECjTUO7CG1YXQ?select=eyhHHmI92CQPLGqPTFaayg\n\nhttp://www.yelp.com/biz_photos/VxtDQfBA3ECjTUO7CG1YXQ?select=CB3aDY11FvUEsB92zuMVXg\n\n3 sections of sponge cake filled with whipped cream, vanilla custard and raspberry filling.  "], "author": "Alan L.", "review": "For my 100th review I guess I'd have to give it to Victoria Pastry Company.\n\nGrowing up in this neighborhood ....Victoria Pastry Company was always my favorite.  I had my first Chocolate Eclair here and had it many more times after that.....today it's just as tasty as I can remember.\n\nThe Eclair is filled with either Whipped Cream or Custard and topped off with a Chocolate Frost.  You have got to bite into this....it's lite, it's tasty.....I don't mind getting whipped cream all over my mouth while eating this....but please do not touch my Eclair.\n\nThe St. Honore Cake\n\nThis was also one of my favorite cake in my younger days and today it still is.  The St. Honore Cake is a Vanilla pastry cream flaky crust and layered with rum soaked sponge layers and topped off with a ring of vanilla cream puffs.  Should you order a whole cake you can ask for extra cream puffs.  Do not take a slice of St. Honore Cake without the Cream Puff......because they go hand and hand.  Not too sweet, you can taste the Rum a little.  A fun cake to eat!!\n\nThe Princess Cake\n\nhttp://www.yelp.com/biz_photos/VxtDQfBA3ECjTUO7CG1YXQ?select=eyhHHmI92CQPLGqPTFaayg\n\nhttp://www.yelp.com/biz_photos/VxtDQfBA3ECjTUO7CG1YXQ?select=CB3aDY11FvUEsB92zuMVXg\n\n3 sections of sponge cake filled with whipped cream, vanilla custard and raspberry filling.  This is topped off with a Marzipan icing (Green, Pink or Natural color).  I brought this cake into work for a celebration and it was gone within 20 minutes.  At our company usually we have lots of cake left over...but not this time.\n\nNext the cookies....Amaretti Plain Cookie and the Amaretti Pinenut (Pignolli) Cookie.\n\nhttp://www.yelp.com/biz_photos/VxtDQfBA3ECjTUO7CG1YXQ?select=K3S1QHj1QdLwiWDVSjwaIw\n\nThis is a Macaroon almond mix and on the sweet side of thing....this is made with egg whites.  The Pignolli has Pinenuts added to the cookie.  Both cookies are on the rich side but very tasty.\n\nThe Torrone\n\nhttp://www.yelp.com/biz_photos/VxtDQfBA3ECjTUO7CG1YXQ?select=qGwUZ-AvFRJNF5sDMhsb2w\n\nTorrone is an Italian candy, very popular in Italy.  They make their own at Victory Pastry.  It's made of Honey, Fresh roasted Hazelnuts and nougat.  Very chew nougat.  The Nougat is sold in blocks....I like to cut up the blocks into small so it's easier to eat.\n\nAll this was around for me when I was growing up and today they continue to put a smile on my face.\n\nSpecial orders be sure to call it in or go online and place your order!\n\nI've not had an item here that has failed me......\nThey take cash and Credit Cards....\nThere are a few tables available for having a snack and some coffee.\nEnjoy the food, enjoy the fun!!\n\nRating - 5 stars from ever since I can remember.\nService - 5 stars....very nice people.\nParking can be a challenge in this area.", "rating": 5, "date": "2011-12-08"}, {"excerpts": ["Grew up with their princess cake for various different celebrations. ", "Their cakes have just the right amount of cake, cream, almond paste and we can't forget the RUM. ", "LOVE IT!!! ", "If you haven't tried their princess cake you're missing out!! ", "Pay a visit next time you're near by."], "author": "Kristina S.", "review": "One of the amazing bakeries you will visit!! Grew up with their princess cake for various different celebrations. Their cakes have just the right amount of cake, cream, almond paste and we can't forget the RUM. LOVE IT!!! Pair this cake with a nice cup of coffee or espresso and you are in heaven.\n\nIf you haven't tried their princess cake you're missing out!! Pay a visit next time you're near by.", "rating": 4, "date": "2014-04-28"}, {"excerpts": ["Fantastic moist and even layered Princess Cake, but wished there was more of a dome of whipped cream. ", ":)"], "author": "Nancy Y.", "review": "Another 3.5 stars but overall a solid bakery to relax after lunch. Has that old fashioned charm but the cushioned bench seating along the wall was a bit unclean. Cake price per slice is about the same as Stella's or other NB bakeries. Fantastic moist and even layered Princess Cake, but wished there was more of a dome of whipped cream. :)", "rating": 3, "date": "2016-01-28"}, {"excerpts": ["My friends got a slice of the princess cake.  ", "It has the green icing.  ", "I took a bite of it ", "and I was impressed!  ", "The icing is marzipan and inside is white cake with a layer of rasberry filling.  ", "It's just so good.  ", "For $5 a slice it better be!  ", "I would have given another star if the panna cotta was a little better."], "author": "Rachel R.", "review": "We stopped here because we needed an afternoon snack but nothing too big.  I got the panna cotta with fruit and a hot chocolate.  I was pretty disappointed with the panna cotta.  It was more like greek yogurt, almost no flavor.  I litterally was mixing in the hot chocolate to giv it some flavor.  The hot chocolate was really good.\n\nMy friends got a slice of the princess cake.  It has the green icing.  I took a bite of it and I was impressed!  The icing is marzipan and inside is white cake with a layer of rasberry filling.  It's just so good.  For $5 a slice it better be!  I would have given another star if the panna cotta was a little better.", "rating": 3, "date": "2014-05-07"}, {"excerpts": ["The cream puff and princess cake were divine. ", "The princess cake was the one with the light green glaze. ", "We felt like little princesses eating the cake ", "it was so delicate. ", "I know they are known for their cream puffs, but this cake hit the spot. \n", "A few people sitting here drinking coffee and reading. ", "We found a place to sit down, but can see how it could get busy and you would have to stand and enjoy your treats."], "author": "Mocha G.", "review": "The cream puff and princess cake were divine. The princess cake was the one with the light green glaze. We felt like little princesses eating the cake it was so delicate. I know they are known for their cream puffs, but this cake hit the spot. \nA few people sitting here drinking coffee and reading. We found a place to sit down, but can see how it could get busy and you would have to stand and enjoy your treats.", "rating": 4, "date": "2012-01-30"}, {"excerpts": ["I adore the princess cake - moist cake with raspberry jam, custard, whipped cream & blanketed  in marzipan!  ", "Oh joyful indulgence!  ", "The italian cookies sold by the lb are delightful bites."], "author": "Kim S.", "review": "I adore the princess cake - moist cake with raspberry jam, custard, whipped cream & blanketed  in marzipan!  Oh joyful indulgence!  The italian cookies sold by the lb are delightful bites.", "rating": 4, "date": "2011-11-25"}, {"excerpts": ["I have to echo everyone else's comments here on the Princess Cake. ", "AMAZING!! ", "If you love light spongecake with whipped cream type frosting - this is as good as it gets, or pretty darn close to it.  ", "I usually shy away from marzipan, finding it too rich for my tastes.  "], "author": "Alexis D.", "review": "I have to echo everyone else's comments here on the Princess Cake. AMAZING!! If you love light spongecake with whipped cream type frosting - this is as good as it gets, or pretty darn close to it.  I usually shy away from marzipan, finding it too rich for my tastes.  This was perfect. \n\nLooking forward to trying some more of the cakes next time.", "rating": 4, "date": "2014-11-06"}, {"excerpts": ["If I ever come back, it will be to try the Princess Cake that everyone here on Yelp seems to love!"], "author": "Fiana L.", "review": "Adorable little shop with some cute paintings of cake and cupcakes along their walls in Little Italy. \n\nMy friend and I walked in and looked at what they had to offer in their display. When she asked the man working there what the pastries on a certain shelf were, he lazily responded \"You want me to tell you ALL of them?!\" I can understand working long hours in a busy environment, but doing your best to help customers is a part of the job, period.\n\nAs for the actual pastries, we decided upon the chocolate mousse cake. It wasn't as good as we were hoping it would be, and it was a little pricey at $4.75 a slice.\n\nIf I ever come back, it will be to try the Princess Cake that everyone here on Yelp seems to love!", "rating": 3, "date": "2014-08-14"}, {"excerpts": ["I ended up splitting a slice of Princess cake and let me tell you that was heavenly. ", "Splitting it was perfect, its a rather large slice (it is $5 mind you). ", "The bottom layer was soaked in triple sec I believe, with a pistachio layer and a marzipan icing. ", "I would order a whole cake anytime (too bad I love in SoCal). "], "author": "Michelle P.", "review": "I was starving for a mid-afternoon snack and a coffee. We were strolling our way to the Wharf and came across this gem on the way.\n\nThe staff were very friendly and helpful. I ended up splitting a slice of Princess cake and let me tell you that was heavenly. Splitting it was perfect, its a rather large slice (it is $5 mind you). The bottom layer was soaked in triple sec I believe, with a pistachio layer and a marzipan icing. I would order a whole cake anytime (too bad I love in SoCal). The latte was good and hit the spot.\n\nI would definitely stop in next time I am craving a decadent piece of cake.", "rating": 4, "date": "2014-05-09"}, {"excerpts": ["We had a Princess cake, delicious, as well as a selection of their smaller cakes and everything was perfect. ", "Not too buttery or sugary compare to other so called bakeries."], "author": "Fabien-Pierre N.", "review": "We had a Princess cake, delicious, as well as a selection of their smaller cakes and everything was perfect. Not too buttery or sugary compare to other so called bakeries.", "rating": 5, "date": "2015-08-08"}, {"excerpts": ["The princess cake is amazing, as well as the cream puffs and cannoli's. ", "It doesn't get much better than the pastries you will find here. ", "Just go in and try a cookie at the least, you'll see..."], "author": "Mike S.", "review": "A must go to when you're in the SF area. The princess cake is amazing, as well as the cream puffs and cannoli's. It doesn't get much better than the pastries you will find here. Just go in and try a cookie at the least, you'll see...", "rating": 5, "date": "2015-08-04"}, {"excerpts": ["my birthday cake was a princess cake from victoria pastry company. "], "author": "Christine K.", "review": "my birthday cake was a princess cake from victoria pastry company. it was light fluffy cake with layers of custard, whipped cream, and raspberry jam--all covered in marzipan. \n\ni can't compare this to other princess cakes because victoria was my first, but i have to say that the cake was very pretty and tasted amazing..... \n\ngreat.... now i'm craving cake.", "rating": 5, "date": "2013-03-12"}, {"excerpts": ["I now have 3 loves in my life and the Princess cake is now one of them. ", "I love this so much that I have searched high and low for a bakery in my own state who makes this and have FAILED!!! ", "ALL ", "I CAN THINK "], "author": "Cris F.", "review": "I now have 3 loves in my life and the Princess cake is now one of them. I love this so much that I have searched high and low for a bakery in my own state who makes this and have FAILED!!! ALL I CAN THINK ABOUT IS THIS CAKE.  \n\nSo I am coming back to San Francisco in November and my first agenda will be to go get this cake. Off the plane and go get cake. Am I obsessed? Yes and that is putting it mildly.\n\nThe bakery has plenty of other options also and a few table to sit at while you eat your slice of cake and drink your coffee. While I was there a fireman came in and got a whole box for the guys back at the house. And you know what they say anywhere the police or firemen eat had to be good.", "rating": 5, "date": "2013-07-30"}, {"excerpts": ["Will definitely be back to try their princess cake one day!"], "author": "Jeanette S.", "review": "Just devoured a magnificent panna cotta topped with berries (you can choose the one with berries or chocolate). I honestly don't know where else to buy panna cotta because not every bakery will make it, so I bought it immediately. It was really rich and creamy, and definitely large enough to share with a friend or two. Will definitely be back to try their princess cake one day!", "rating": 4, "date": "2013-04-19"}, {"excerpts": ["I haven't tried the princess cake yet, but definitely need to do that in one of my cheat days. "], "author": "Novalina N.", "review": "This place is kinda \"lost\" in the middle of Chinatown so I never thought it's one of the good pastry shop. Ambiance and view are meh, so just get your pastries to go.\n\nThe danish is flakey and very big, the almond cookies are soft and delicious (prefer the one without almond chunks), and the biscotti is good as well.\n\nI haven't tried the princess cake yet, but definitely need to do that in one of my cheat days. Damn diet!\n\nLove how this place is kinda hidden so I'll definitely come back to this place.", "rating": 4, "date": "2011-02-08"}, {"excerpts": ["I needed a princess cake for Thanksgivukkah dinner and found a delicious one here! ", "I loved the fact they let me pay over the phone and that they were open until 8pm. ", "Although I only tried the princess cake, they had a great variety of cookies, cakes and pies in their cases. ", "After such a great experience with the princess cake, I'll be sure to return in the future."], "author": "Kelsey K.", "review": "I needed a princess cake for Thanksgivukkah dinner and found a delicious one here! I loved the fact they let me pay over the phone and that they were open until 8pm. Although I only tried the princess cake, they had a great variety of cookies, cakes and pies in their cases. After such a great experience with the princess cake, I'll be sure to return in the future.", "rating": 5, "date": "2013-11-30"}, {"excerpts": ["But is a slice of the Princess Cake (or a whole cake) 5 stars? ", "I liked the Princess Cake better. \n\n", "Not bad, but not the Princess Cake. ", "Long story short, just go for the Princess Cake...", "Unless you don't want a new addiction, because I'm seriously about to be a regular customer."], "author": "Steph A.", "review": "Is everything here 5 stars? No. But is a slice of the Princess Cake (or a whole cake) 5 stars? Ab-so-friggin-lutely!!! \n\nI've lived in the neighborhood for over 1.5 years and walked by here countless times and never paid attention. Then I heard through the grapevine that Victoria Pastry is the bees knees and had been a part of the neighborhood forever. Now time to try it...\n\nSince I was having a fat kid rainy Saturday night at home Netflixing, the next thing that caught my eye was another dessert I can't remember the name of, but it started with \"stra-\" and then something, and it was like tiramisu but no espresso. Okay, but not very exciting. I liked the Princess Cake better. \n\nI also tried the Panna Cotta with chocolate. Not bad, but not the Princess Cake. It needed a little more chocolate and another flavor. \n\nLong story short, just go for the Princess Cake...Unless you don't want a new addiction, because I'm seriously about to be a regular customer.", "rating": 5, "date": "2014-02-08"}, {"excerpts": ["and as to today my fav cake is still their Princess cake and their St. Honorie cake... you need to request the color of the princess cake if you want it in pink or else you will end up with green.. all their cakes are moist and fresh.. to me the princess cake is not to sweet which is perfect. ", "l ove how the St. Honorie cake has little cream puffs at the top and the inside has a thin layer of crust.. the only think i don't like is the service here.. there are times where they are nice to you ", "but there are times there is a mean lady around here."], "author": "Belinda C.", "review": "my family gets my birthday cake here every year when i was a kid. and as to today my fav cake is still their Princess cake and their St. Honorie cake... you need to request the color of the princess cake if you want it in pink or else you will end up with green.. all their cakes are moist and fresh.. to me the princess cake is not to sweet which is perfect. l ove how the St. Honorie cake has little cream puffs at the top and the inside has a thin layer of crust.. the only think i don't like is the service here.. there are times where they are nice to you but there are times there is a mean lady around here.", "rating": 4, "date": "2010-03-31"}, {"excerpts": ["I usually get Princess Cake from Miette, but Victoria's Princess Cake looks good. ", "I would like to try next time."], "author": "Vicki S.", "review": "Strawberry Cake taste mediocre, but couldn't resist to pay $5 slice because they have a nice seating in front of a shop. I rather go to Cafe Puccini if I only want to enjoy Cannoli and a cup of Coffee. I usually get Princess Cake from Miette, but Victoria's Princess Cake looks good. I would like to try next time.", "rating": 3, "date": "2015-04-12"}, {"excerpts": ["The princess cake is good, and so are the other ones. ", "I try to get different KINDS of cakes ", "everytime ", "I order one, but it seems like I always get the default cakes since I'm afraid of trying something new since it always, always backfires on me. =", "P"], "author": "Meena N.", "review": "I have been going here since I was born! I frequent this place a lot because I used to go to Chinatown every other week and this place is RIGHT there. This place makes authentic, from scratch Italian desserts as well as other pastries and cookies.\n\nI am not a fan of chocolate cake but I do like them here! Their Saint Honore cake is definitely a must when you have to bring dessert for a family/friend function. The princess cake is good, and so are the other ones. I try to get different KINDS of cakes everytime I order one, but it seems like I always get the default cakes since I'm afraid of trying something new since it always, always backfires on me. =P", "rating": 4, "date": "2010-10-14"}, {"excerpts": ["They have great princess cake and cookies!  ", "They are near the top of my list for go-to bakery on special occasions.  ", "I just wish they still had the black and white cookies.  ", "I remember those the first time I came here 16 years ago.  ", "Why no black and whites?"], "author": "Angelique B.", "review": "They have great princess cake and cookies!  They are near the top of my list for go-to bakery on special occasions.  I just wish they still had the black and white cookies.  I remember those the first time I came here 16 years ago.  Why no black and whites?", "rating": 4, "date": "2014-11-06"}, {"excerpts": ["i had the BEST experience with Victoria Pastry company over the weekend my close friend wanted a princess cake for her birthday party and after several phone calls with the nice customer service reps and a confrence call with the person the cake was being made for the cake turned out beautifully....", "i got a look at it and snapped a few photos before dropping it off at my friend's party ", "i was very impressed with the work they put in....", "it was EXACTLY how she wanted it! ", "everyone who saw and tried the cake loved it! ", "i just wanted to thank you for the good experience i'll definitely refer people to your shop!"], "author": "Jeff M.", "review": "i had the BEST experience with Victoria Pastry company over the weekend my close friend wanted a princess cake for her birthday party and after several phone calls with the nice customer service reps and a confrence call with the person the cake was being made for the cake turned out beautifully....i got a look at it and snapped a few photos before dropping it off at my friend's party i was very impressed with the work they put in....it was EXACTLY how she wanted it! everyone who saw and tried the cake loved it! i just wanted to thank you for the good experience i'll definitely refer people to your shop!", "rating": 5, "date": "2014-11-23"}, {"excerpts": ["Others may be obsessed with the Princess Cake, but I'm a St. Honoré Cake man myself. ", "And even though this place could almost now be in Chinatown, it's still a welcome old fashioned North Beach anchor. ", "Service is old school nice and the selection reminds me of what Mama used to make!"], "author": "Eric B.", "review": "Victoria Pastry Company is my favourite old Italian Bakery. Others may be obsessed with the Princess Cake, but I'm a St. Honoré Cake man myself. And even though this place could almost now be in Chinatown, it's still a welcome old fashioned North Beach anchor. Service is old school nice and the selection reminds me of what Mama used to make!", "rating": 4, "date": "2011-05-25"}, {"excerpts": ["We also tried their princess cake and oatmeal raisin cookie ( both crazy delicious). ", "I will be back for more really soon!"], "author": "Vickie Z.", "review": "LOve love loved it! Came here on a Wednesday early afternoon with a friend and ordered the strawberry shortcake ( delicious !!!! ) had the tiramisu and Mille-feuilles to go. Everything was just perfect! We also tried their princess cake and oatmeal raisin cookie ( both crazy delicious). I will be back for more really soon!", "rating": 4, "date": "2014-02-22"}, {"excerpts": ["Best princess cake. ", "100-year SF bakery."], "author": "Stella Y.", "review": "Best princess cake. 100-year SF bakery.", "rating": 5, "date": "2015-12-11"}, {"excerpts": ["My sister is obsessed with the Princess cake.  ", "I have not had the pleasure of sampling this delicacy because she always manages to eat it in secrecy.  ", "I love the almond torta.  ", "It is perfect for breakfast with a nice cup of hot tea.  ", "The cookies are yummy.  ", "So many different options!  ", "The cannoli?  ", "Perfection!  ", "They also sell tortoni candy which is one of my faves.  "], "author": "Karen G.", "review": "Mangia e statti zitto!\n\nThis is something I heard growing up in an Italian family.  Basically it means \"eat and stay quiet\"; or as my papa says \"shut up and eat\".  \n\nNo trip to SF is complete without a visit to Victoria Pastry Company.  We made sure to stop by before lunch.  Life is short...eat dessert first.  Well we didn't actually eat the dessert before lunch.  We just wanted to make sure to get our treats.\n\nMy sister is obsessed with the Princess cake.  I have not had the pleasure of sampling this delicacy because she always manages to eat it in secrecy.  I love the almond torta.  It is perfect for breakfast with a nice cup of hot tea.  The cookies are yummy.  So many different options!  The cannoli?  Perfection!  They also sell tortoni candy which is one of my faves.  Chewy, almondy goodness.\n\nAfter a visit to Victoria Pastry Company, you will definitely say \"Mangia e statti zitto\" too!  ;)", "rating": 5, "date": "2008-12-15"}, {"excerpts": ["I've been getting their princess cake and raspberry almond \"tart\" for my birthday every year since I came to America (19 years ago).\n\n"], "author": "Lin L.", "review": "I've been getting their princess cake and raspberry almond \"tart\" for my birthday every year since I came to America (19 years ago).\n\nThe marzipan is thin and not overwhelming.\n\nThe cake itself is light.\n\nThe cream is fluffy.\n\nThe raspberry \"inbetweens\" is perfectly sweet.\n\nI don't have anything negative to say about this place!!", "rating": 5, "date": "2011-07-18"}, {"excerpts": ["This review is for their princess cake. ", "Best princess cake ", "I've had so far ", "(I've tried a few from different places before). ", "The cake is structured so perfectly and so pretty to look at. ", "It tastes just as good as it looks."], "author": "HM N.", "review": "This review is for their princess cake. Best princess cake I've had so far (I've tried a few from different places before). The cake is structured so perfectly and so pretty to look at. It tastes just as good as it looks.", "rating": 5, "date": "2014-03-09"}, {"excerpts": ["They're also known for their princess cake, the St Honore cake and cannolli.\n\n"], "author": "Serena S.", "review": "Get the crostata for your next special occasion!  I went to Victoria to get apple and pumpkin pies for Thanksgiving and thankfully stumbled upon their crostata.  We got the raspberry flavor and it didn't last more than an hour - the pie is light, with a bit of almond crunch.  And the jam-like filling balances out the pastry - perfect for light dessert or morning pastry.  \n\nAlso, the tiramisu is HEAVENLY.  It costs $5.50 but it's worth every cent.  Somehow, the lady fingers keep their sponginess even when they're soaked with flavor.  The cream is light and the powdered cocoa/coffee topping is delicious.\n\nPlease note that Victoria Pastry moved in Aug 2012 to the corner of Filbert/ Powell, just a few blocks from its original location. The new space is right across from Washington Square and is bright, airy and a great spot to people watch.   \n\nVictoria Pastry = Old school italian bakery.  The ladies behind the counter are super-nice - they gave my kids a couple of cookies while we waited for the apple pie to come out of the oven!  They're also known for their princess cake, the St Honore cake and cannolli.\n\nWith the new location, it's become a new neighborhood gathering spot.  It's a must-visit in North Beach.", "rating": 5, "date": "2011-12-23"}, {"excerpts": ["We also shared a slice of the Princess cake, and it was this that brought back all of those great memories from my youth.  ", "I'm not a big fan of marzipan, but combined with the moist cake, the whipped cream, the thin line of raspberry filling ... ", "wow!  ", "It was not overly sweet and just delicious."], "author": "Wilhelm Y.", "review": "Spending much of my youth in the North Beach and Chinatown area I've had my share of the Victoria St. Honore cake as it was always a family favorite.  My brother and sister would often pick up a cake from here for any special occasion because it was always so much better than any of the Chinatown cakes.  I rarely visit the North Beach area these days, but while in the neighborhood this afternoon I decided to drop in for a taste treat from the past.\n\nI shared a Napoleon with a friend.  The pastry was flaky, but it was a bit chewy maybe from sitting around for awhile.  The custard was quite good as it oozed out between the layers of pastry creating a delicious mess.  We also shared a slice of the Princess cake, and it was this that brought back all of those great memories from my youth.  I'm not a big fan of marzipan, but combined with the moist cake, the whipped cream, the thin line of raspberry filling ... wow!  It was not overly sweet and just delicious.", "rating": 4, "date": "2007-01-20"}, {"excerpts": ["I tried the princess cake and it was nice and sweet. ", "Very sweet, actually. ", "I also tried their hazelnut cake which was new. ", "Also very sweet. ", "Everything in here is sweet. ", "Beware! "], "author": "Jonas T.", "review": "They pride themselves of their princess cakes and eclairs. I tried the princess cake and it was nice and sweet. Very sweet, actually. I also tried their hazelnut cake which was new. Also very sweet. Everything in here is sweet. Beware! But if you think your sweet tooth can handle it, I think you'll like this place.\n\nJONASAPPROVED!", "rating": 4, "date": "2007-01-21"}, {"excerpts": ["Ordered a 12 inch princess cake per recommendations from the staff over the phone to feed 20-25 people. ", "Be warned-the cake feeds more like 40. ", "They misspelled the requested name on the cake (after spelling it 3 times on the phone order) and the staff resisted correcting it."], "author": "Jay K.", "review": "The cake was pretty tasty, but wish they had better customer service. Ordered a 12 inch princess cake per recommendations from the staff over the phone to feed 20-25 people. Be warned-the cake feeds more like 40. They misspelled the requested name on the cake (after spelling it 3 times on the phone order) and the staff resisted correcting it.", "rating": 3, "date": "2014-04-16"}, {"excerpts": ["I tried their Princess Cake.  ", "It's only ok when it comes to the flavor.. it also loses points because of the thick fondant on top.  ", "Beh, I'm not a fan of thick fondant.  ", "If you make your way to the inner Richmond area, you have to try the Swedish Princess Cake from Schubert's Bakery--this one's really tasty.  \n\n"], "author": "Doreen M.", "review": "Friendly staff; falls short with the cakes but stands out with the macaroons/cookies.. \n\nI tried their Princess Cake.  It's only ok when it comes to the flavor.. it also loses points because of the thick fondant on top.  Beh, I'm not a fan of thick fondant.  If you make your way to the inner Richmond area, you have to try the Swedish Princess Cake from Schubert's Bakery--this one's really tasty.  \n\nI also tried the Chocolate Truffle Cake because I am a chocolate fiend; but this slice left me thinking, \"there's really chocolate ganache in this?\"  I prefer the Chocolate Truffle Slice from Stella Pastry & Cafe around the corner.  \n\nThe things I would come back to get are the Plain Coconut Macaroon and the Amaretti Plain Cookie.  Coconut Macaroon = Yummy! and packed with flavor; this little guy has weight to it so at $19.95/lb, it can be pricey.  However, the Amaretti is smaller/ lighter so I was able to get about 8 pcs for about $2.85.\n\nFYI--$10 minimum when using card.", "rating": 3, "date": "2011-10-09"}, {"excerpts": ["We ordered:\n\nPRINCESS CAKE: I've had princess cakes before, but this one did not meet my expectations.  ", "I enjoyed this a lot more than the princess cake.  ", "I love the fluffiness of the cake and the consistency of the marscapone cheese.  ", "I felt that they lacked something in it, although I don't know what.  "], "author": "Sarah F.", "review": "I have known of this place for as long as I can remember, but I've never had the urge to come in and give anything a try.\n\nFinally, I decided to give Victoria's a try.\n\nWe ordered:\n\nPRINCESS CAKE: I've had princess cakes before, but this one did not meet my expectations.  The marzipan was too thick for my liking, the cake was kind of on the dry side.  It wasn't spongy or fluffy enough for me.  Their custard seemed like custard pudding.  It wasn't ALL that, it was alright.\n\nTIRIMISU CAKE: I enjoyed this a lot more than the princess cake.  I love the fluffiness of the cake and the consistency of the marscapone cheese.  I felt that they lacked something in it, although I don't know what.  But overall I loved it.\n\nNext time, I want to give the cream puff's and the St. Honore cake a try.", "rating": 4, "date": "2009-08-15"}, {"excerpts": ["and got a piece of princess cake ", "(what? ", "I am a princess!).  ", "And this cake was fit for a princess!  ", "Beautifully soft sponge cake with a dreamy cream filling in the center.  ", "Literally melted in your mouth.  ", "Even the fondant was yummy!  ", "It was love, pure love.  ", "I missed that cake right after the last bite.  ", "Will be back for more!!"], "author": "Linda B.", "review": "We found Victoria Pastry Company while watching something on the Food Network - can't remember what it was, because I was mesmerized by what VPC had to offer!\n\nWe made our first trip there last year and took back a few of those stunning hand painted Easter eggs (read: I gingerly carried them on the plane with me, careful not to let anyone even breathe on them).  We didn't actually *try* anything on that trip (sadly).  This year?  Different story!  We went back for those gorgeous eggs again (had them shipped to our lucky recipients this time! The girl behind the counter was so helpful!!) and got a piece of princess cake (what? I am a princess!).  And this cake was fit for a princess!  Beautifully soft sponge cake with a dreamy cream filling in the center.  Literally melted in your mouth.  Even the fondant was yummy!  It was love, pure love.  I missed that cake right after the last bite.  Will be back for more!!", "rating": 4, "date": "2011-04-15"}, {"excerpts": ["Go with the Princess Cake. "], "author": "Tina T.", "review": "Chocolate lovers: get the Chocolate Truffle Cake. Rich, creamy, enough to satisfy cravings. So, SOOOO gooood!\n\nWant something lighter? Go with the Princess Cake. Not only is it pretty, the sponge cake and raspberry filling is SO delicious!\n\nTry and you will not regret!", "rating": 5, "date": "2010-02-20"}, {"excerpts": ["Of course the Princess cake wins first prize, but we recently tried the Chocolate Fedora and I cannot even put into simply type here how sumptuous is really was. ", "It's important to note I have never been to the physical shop itself, but the cakes are so good", ", it warrants a 5 star rating from me!"], "author": "Thomas K.", "review": "Seriously,\n\nI have had almost no better cakes than those from Victoria Pastry. We order them for our monthly office birthday celebration and nearly every one we've had has been utterly delicious. Of course the Princess cake wins first prize, but we recently tried the Chocolate Fedora and I cannot even put into simply type here how sumptuous is really was. It's important to note I have never been to the physical shop itself, but the cakes are so good, it warrants a 5 star rating from me!", "rating": 5, "date": "2011-04-20"}, {"excerpts": ["i come for the princess cake and cheesecake and another one i cant think of. "], "author": "JeF m.", "review": "the pastries are good. can get a bit pricey. the people are hit or miss. sometimes theyre nice, sometimes they seem like they dont want to be there. they arent always open during their posted hours. so maybe call ahead. \n\ni come for the princess cake and cheesecake and another one i cant think of. but the canolis and eclairs arent anything special.", "rating": 3, "date": "2014-07-12"}, {"excerpts": ["Truth be told, I've only had the princess cake, but it was so good that it alone warrants four stars. ", "The pastries all look gorgeous and the next time I'm in North Beach ", "I'll definitely come back to try something else (and will also get a princess cake slice and not think about it too hard). ", "Great service too!"], "author": "Rebecca P.", "review": "Truth be told, I've only had the princess cake, but it was so good that it alone warrants four stars. The pastries all look gorgeous and the next time I'm in North Beach I'll definitely come back to try something else (and will also get a princess cake slice and not think about it too hard). Great service too!", "rating": 4, "date": "2012-02-27"}, {"excerpts": ["I just ordered a princess cake for my 40th bday and it was fantastic. ", "We also had the princess cake at our wedding reception, and instead of freezing the top layer, the Victoria Pastry shop gives you a coupon to come in and get a fresh cake on your one year anniversary. ", "So I've had the princess cake on three occasions, and it was fantastic every time. ", "We also ordered the cookies - mixed assortment - and they got rave reviews at our party."], "author": "Kerry L.", "review": "I just ordered a princess cake for my 40th bday and it was fantastic. We also had the princess cake at our wedding reception, and instead of freezing the top layer, the Victoria Pastry shop gives you a coupon to come in and get a fresh cake on your one year anniversary. So I've had the princess cake on three occasions, and it was fantastic every time. We also ordered the cookies - mixed assortment - and they got rave reviews at our party.", "rating": 5, "date": "2012-06-05"}, {"excerpts": ["I go out of my way every trip to SF to buy their Princess Cake.  ", "Can easily become one of your favorite SF landmarks."], "author": "Mike H.", "review": "New location but same wonderful pastries.  (I see someone downgraded it to 1 star because of the move, but landlords don't always renew leases.)  Be careful -- their website victoriapastry.com still shows their old Stockton address, but they're not there.  Bottom line:  I go out of my way every trip to SF to buy their Princess Cake.  Can easily become one of your favorite SF landmarks.", "rating": 5, "date": "2013-02-27"}, {"excerpts": ["As a Princess Cake expert I would just like to say Victoria Pastry Company has got it right on the nose! "], "author": "Caitlin M.", "review": "As a Princess Cake expert I would just like to say Victoria Pastry Company has got it right on the nose! Absolutely delectable. \n\nOh & their hot cocoa is great too.", "rating": 5, "date": "2010-10-28"}, {"excerpts": ["I had some brownies, cannolis, amaretti cookies, italian rum cake, and princess cake. ", "Everything was great! ", "I'm a huge princess cake fan and the marzipan was so thick and yummy. ", "The cake itself was a litle dry ", "but I think that If I had a fresh cake made for me, it would be perfection. ", "The cannolis were very yummy, as were the cookies, brownies, and other cake. ", "I wouldn't necessarily say that this is the best bakery, but they do have great stuff ", ":)"], "author": "Sheeva G.", "review": "I pretty much bought half of the bakery when I came. I had some brownies, cannolis, amaretti cookies, italian rum cake, and princess cake. Everything was great! I'm a huge princess cake fan and the marzipan was so thick and yummy. The cake itself was a litle dry but I think that If I had a fresh cake made for me, it would be perfection. The cannolis were very yummy, as were the cookies, brownies, and other cake. I wouldn't necessarily say that this is the best bakery, but they do have great stuff :)", "rating": 4, "date": "2012-02-22"}, {"excerpts": ["Best pastry - Princess Cake!!  \n", "The service is always friendly.  ", "It's cute to see a group of BFF Nonnas gather here from time to time as regulars. \n", "Anyway, really good princess cake.  ", "That's all I gotta say."], "author": "Marzan W.", "review": "Been coming here since I was a baby, my grandpa often made a stop here whenever we were in the area.  Best pastry - Princess Cake!!  \nThe service is always friendly.  It's cute to see a group of BFF Nonnas gather here from time to time as regulars. \nAnyway, really good princess cake.  That's all I gotta say.", "rating": 4, "date": "2008-12-28"}, {"excerpts": ["actually discovered Princess Cake from VPC at a cafe in Sausalito -- loved the cake so much that I inquired its origin.  ", "\"", "We get the desserts delivered from Victoria Pastry in San Fran.\"  ", "So back in 2013 had to go to the source in North Beach.  ", "I know it's been discussed before, but their Princess Cake is divine.   ", "Pastry cream, whipped cream, and marzipan with one layer of raspberry jam is perfection.   ", "Their tiramisu is a little heavy on the alcohol, but still good.  ", "The other pastries I've tried have been good, but don't knock your socks off like the Princess Cake.   ", "So on our last day driving out to Redwood City to our son's house, we were going to pick up Princess Cake but ", "Richmond bakery called Schubert's was way more convenient.  ", "VPC is a slightly better cake but about 60% more expensive than Schubert's on Clement St., so take that into account if you don't want the hassle of North Beach and want to pay $20 for a cake rather than $34.   ", "Wish ", "I got to the Bay area more often ", "(only there about once/year to visit my son & his gf) as I adore VPC.   ", "The owner & the staff are sweeties.  ", "A few tables out front in the shade, as well as a few tables inside where my long-suffering husband sits & waits (he rarely eats desserts).  ", "Miss you already as the DC area where I live has a dearth of good Italian pastry.   ", "North End in Boston & North Beach in San Fran are the best IMAO if you're into cannolis, tiramisu, that zabaione cake (sfaggonia, one of my other favorites when I don't choose the Princess Cake)."], "author": "Suzanne G.", "review": "actually discovered Princess Cake from VPC at a cafe in Sausalito -- loved the cake so much that I inquired its origin.  \"We get the desserts delivered from Victoria Pastry in San Fran.\"  So back in 2013 had to go to the source in North Beach.  I know it's been discussed before, but their Princess Cake is divine.   Pastry cream, whipped cream, and marzipan with one layer of raspberry jam is perfection.   Their tiramisu is a little heavy on the alcohol, but still good.  The other pastries I've tried have been good, but don't knock your socks off like the Princess Cake.   So on our last day driving out to Redwood City to our son's house, we were going to pick up Princess Cake but Richmond bakery called Schubert's was way more convenient.  VPC is a slightly better cake but about 60% more expensive than Schubert's on Clement St., so take that into account if you don't want the hassle of North Beach and want to pay $20 for a cake rather than $34.   Wish I got to the Bay area more often (only there about once/year to visit my son & his gf) as I adore VPC.   The owner & the staff are sweeties.  A few tables out front in the shade, as well as a few tables inside where my long-suffering husband sits & waits (he rarely eats desserts).  Miss you already as the DC area where I live has a dearth of good Italian pastry.   North End in Boston & North Beach in San Fran are the best IMAO if you're into cannolis, tiramisu, that zabaione cake (sfaggonia, one of my other favorites when I don't choose the Princess Cake).", "rating": 4, "date": "2015-07-20"}, {"excerpts": ["The Princess cake was sooo good, thats the cake with the green marzipan on top, its sooo moist! ", "All the other cakes, tarts and pastries look sooo yummy! ", "I would try the puff pastry cake, but its made out of rum, yuck! ", "No thanks."], "author": "Karen F.", "review": "FYI: Parking is horrible as you know just from the street (Stockton and Vallejo); the heart of North Beach. If you were to pick-up, I would suggest that you park at one of the parking lots on Stockton to your left for less than an hour its $2.50.\n\nThe Princess cake was sooo good, thats the cake with the green marzipan on top, its sooo moist! All the other cakes, tarts and pastries look sooo yummy! I would try the puff pastry cake, but its made out of rum, yuck! No thanks.", "rating": 4, "date": "2008-12-09"}, {"excerpts": ["I had my doubts, but that slice of Princess cake was amazing! ", "I loved the soaked flavor of the cake. ", "The marzipan, cream and raspberry filling was delicious. ", "I don't usually like cake, mostly cause of the dryness. ", "This one was very moist."], "author": "Vera W.", "review": "Gotta admit... I had my doubts, but that slice of Princess cake was amazing! I loved the soaked flavor of the cake. The marzipan, cream and raspberry filling was delicious. I don't usually like cake, mostly cause of the dryness. This one was very moist.", "rating": 5, "date": "2011-09-08"}, {"excerpts": ["I have it on good authority that Victoria Pastry supplies Princess Cake to the Big Man in heaven.  ", "And it never runs out either.  ", "All you can eat Princess Cake.  ", "That's why it is called HEAVEN!!!!"], "author": "Caisa S.", "review": "I have it on good authority that Victoria Pastry supplies Princess Cake to the Big Man in heaven.  And it never runs out either.  All you can eat Princess Cake.  That's why it is called HEAVEN!!!!", "rating": 5, "date": "2012-01-15"}, {"excerpts": ["If they go and see Victoria at Victoria's pastry, get the Princess cake with the marzipan frosting they sure as hell will. \n\n"], "author": "Michael H.", "review": "I wanted pies. She wanted cake.\n\nImagine: blueberry pies, key lime pies, apple pies -a cornucopia of pies!\n\nHow many times have you pie and thought  \"Damn, this is good?\"\n\nAnd how many crummy wedding cakes have you eaten? My Auntie spent a small fortune on a cake from some fancy shmancy baker here in SF and I couldn't tell you if it was chocolate or vanilla.\n\nDid anyone say \"Damn, this is go-ood?\"\n\nIf they go and see Victoria at Victoria's pastry, get the Princess cake with the marzipan frosting they sure as hell will. \n\nMy wife and I went there two times tasting cake and found Victoria to be beyond polite and always generous with the tasting slices. Our cake was perfectly beautiful, delivered on time and easily assembled by the restaurant.\n\nMany a gastronome were present, so I was nervous at the decision not to have pie. To my great satisfaction, the cake was enjoyed by a wide \"palate\" of preferences, from those accustomed to American style sugary sweets to a more Chinese style-both loved the cake.\n\nHighly highly recommended.", "rating": 5, "date": "2008-02-11"}, {"excerpts": ["And it's not relegated to just Italian sweets--I got an absolutely killer Swedish Princess Cake there once.  ", "It's also great for coffee and pastries.  ", "I can't hang around this place too long as I'd put on 25 pounds just loitering."], "author": "Ralph B.", "review": "Truly awesome cakes and cookies.  When I need to go all out and get a cake for a special occasion, this is the spot.  And it's not relegated to just Italian sweets--I got an absolutely killer Swedish Princess Cake there once.  It's also great for coffee and pastries.  I can't hang around this place too long as I'd put on 25 pounds just loitering.", "rating": 5, "date": "2009-04-26"}, {"excerpts": ["I enjoyed a deliciously rich slice of Princess Cake from this bakery when we celebrated a co-worker's birthday.  ", "Soft, moist cake with a layer of custard, jam, and crushed almonds, and wrapped in sugary marzipan.  ", "I've heard their other pastries are also worth the walk up to North Beach, and so I think I will be making the trek up during a lunch break if I'm ever craving pastry sweets.  ", "The good thing is the walk up and down may burn off just enough calories to justify my eating sweets without special occasion!"], "author": "Shar M.", "review": "I enjoyed a deliciously rich slice of Princess Cake from this bakery when we celebrated a co-worker's birthday.  Soft, moist cake with a layer of custard, jam, and crushed almonds, and wrapped in sugary marzipan.  I've heard their other pastries are also worth the walk up to North Beach, and so I think I will be making the trek up during a lunch break if I'm ever craving pastry sweets.  The good thing is the walk up and down may burn off just enough calories to justify my eating sweets without special occasion!", "rating": 4, "date": "2008-09-15"}, {"excerpts": ["It has always been an absolute gem in my eyes, especially concerning their most prized and delicious princess cake. ", "I have simply never tasted one as good...EVER. ", "Needless to say, I went out of my way this past Sunday afternoon, traveling from the opposite end of the city for what should have been a very special treat. ", "Boy was I shocked and dismayed by arguably the worst customer service I have perhaps ever experienced. ", "Unfortunately I do not have the name of the server, but from the moment I walked in to order, the service my partner and I received was shockingly aggressive, ill mannered, and simply demeaning. ", "When asked what we would like, I proceeded to order a napoleon and an almond torte. ", "The first red flag occurred when the server proceeded to assertively rush me  as I was deciding what to order, and was extremely aggressive in his tone. ", "He then proceeded to place my order into a box and while doing so, one side of the torte fell off--to which he used his bare hand to push back together. ", "Unsanitary much?? ", "From the moment after I stated my order, he loudly yapped the total price to me, ($9.10) probably a good six times. ", "At this point he hadn't even finished wrapping my order, so I was confused at the veracity of his tone--especially being that there was no one else in line. ", "By the seventh time he barked at me, I was really confused and quite perplexed. ", "It was as if he thought I was going to run out of the establishment without paying? ", "To make matters worse, he then shouted to my parter the price one last time, before my parter became heated and told him not to worry and that we were going to pay him. ", "It was then that the server answered back that my partner was giving him a \"weird look\" so ", "thats why he repeated the ten of $9.10 with sure a forceful tone. ", "I have no idea what his problem was, but it made my parter ", "and I feel so upset and uncomfortable, that we decided to walk out. ", "It is moments like these that have the ability to make or break a business, regardless of the high quality of their product. ", "I sadly and unfortunately cannot frequent this establishment again, especially this location. ", "I am tempted to report this behavior to the labor board and /or health department, especially the grossly unsanitary portion of this experience."], "author": "Ahna K.", "review": "Let me preface this review by explaining that I have been frequenting Victoria Pastry (other locations as well) since I was a young child, so least 20+ years. It has always been an absolute gem in my eyes, especially concerning their most prized and delicious princess cake. I have simply never tasted one as good...EVER. Needless to say, I went out of my way this past Sunday afternoon, traveling from the opposite end of the city for what should have been a very special treat. Boy was I shocked and dismayed by arguably the worst customer service I have perhaps ever experienced. Unfortunately I do not have the name of the server, but from the moment I walked in to order, the service my partner and I received was shockingly aggressive, ill mannered, and simply demeaning. When asked what we would like, I proceeded to order a napoleon and an almond torte. The first red flag occurred when the server proceeded to assertively rush me  as I was deciding what to order, and was extremely aggressive in his tone. He then proceeded to place my order into a box and while doing so, one side of the torte fell off--to which he used his bare hand to push back together. Unsanitary much?? From the moment after I stated my order, he loudly yapped the total price to me, ($9.10) probably a good six times. At this point he hadn't even finished wrapping my order, so I was confused at the veracity of his tone--especially being that there was no one else in line. By the seventh time he barked at me, I was really confused and quite perplexed. It was as if he thought I was going to run out of the establishment without paying? To make matters worse, he then shouted to my parter the price one last time, before my parter became heated and told him not to worry and that we were going to pay him. It was then that the server answered back that my partner was giving him a \"weird look\" so thats why he repeated the ten of $9.10 with sure a forceful tone. I have no idea what his problem was, but it made my parter and I feel so upset and uncomfortable, that we decided to walk out. It is moments like these that have the ability to make or break a business, regardless of the high quality of their product. I sadly and unfortunately cannot frequent this establishment again, especially this location. I am tempted to report this behavior to the labor board and /or health department, especially the grossly unsanitary portion of this experience.", "rating": 1, "date": "2014-02-18"}, {"excerpts": ["Got a selection of pastries, the princess cake and some cookies, and I must say, the pastries were my favorite. ", "Tried the apple filled which wasn't too sweet, and I didn't think I would like the blueberry and cream cheese pastry, but I had a couple bites and it was a pleasant surprise. ", "I don't remember all the cookies that I got, but there was one with a hint of almond that had just the right amount of chewiness. ", "The cookies are small so you can try a bunch of them without feeling TOO guilty, but be careful, because before you know it...you'll have eaten an entire bag. ", "Princess cake was good, but a little to sweet and eggy for my taste. ", "Cute place to spend a morning with a friend or even grab a pastry to-go to munch on in the park."], "author": "Melissa M.", "review": "I run past here all the time on the way back for the gym, and finally gave in and grabbed a box since I was meeting up with a group of friends later in the day. Got a selection of pastries, the princess cake and some cookies, and I must say, the pastries were my favorite. Tried the apple filled which wasn't too sweet, and I didn't think I would like the blueberry and cream cheese pastry, but I had a couple bites and it was a pleasant surprise. I don't remember all the cookies that I got, but there was one with a hint of almond that had just the right amount of chewiness. The cookies are small so you can try a bunch of them without feeling TOO guilty, but be careful, because before you know it...you'll have eaten an entire bag. Princess cake was good, but a little to sweet and eggy for my taste. Cute place to spend a morning with a friend or even grab a pastry to-go to munch on in the park.", "rating": 4, "date": "2012-10-02"}, {"excerpts": ["Victoria's Bakery popped right up with her famous princess cake (which are DELICIOUS btw). \n\n", "To top it all off, she gave us a free saint honore cake, free slice of princess cake, and free cannoli. ", "yummy. ", "Great service, wonderful and cutesy lady (i love her accent tehe), and sure...", "the price might be a tad expensive, but its WORTH IT. ", "Trust me!"], "author": "Natasha S.", "review": "Alright guys. SO i almost NEVER write reviews but I felt that i had to for this WONDERFUL place. \n\nLets start the beginning of my journey.. \nWe wanted to get cakes for Prom (4 full sheets) and were looking for a really good place and of course I go  on yelp, and TADAAAH. Victoria's Bakery popped right up with her famous princess cake (which are DELICIOUS btw). \n\nAnyways. So I go over there, and was very, very sad to find that it would cost 1500 for 4 full sheets (precut). But Victoria was extremely helpful and genuinely wanted to help and offered an alternative: mini napoleons, mini eclaires, and only 2 full sheets pre-cut princess cakes. She originally doesnt do mini cakes, but she said \"for you, I do it.\" Dont you know thats the one thing a gir loves to hear?!~ It all came down to 1,100. A little bit over our budget... so she took 10 percent off and BAM. 990$ (barely matching our 1000 budget). WHOOOOHOOO!! \n\nTo top it all off, she gave us a free saint honore cake, free slice of princess cake, and free cannoli. yummy. Great service, wonderful and cutesy lady (i love her accent tehe), and sure...the price might be a tad expensive, but its WORTH IT. Trust me!", "rating": 5, "date": "2010-05-22"}, {"excerpts": ["We bought a princess cake from this bakery and i have to say it was very delicious.", "I wasn't crazy about the green marzipan but the inside was just decadent. ", "It was a white cake with whip cream and raspberry filling. ", "YUM!!! ", "If your little princess is a big or small. "], "author": "Denise C.", "review": "We bought a princess cake from this bakery and i have to say it was very delicious.I wasn't crazy about the green marzipan but the inside was just decadent. It was a white cake with whip cream and raspberry filling. YUM!!! If your little princess is a big or small. This cake will certainly bring a smile to her face. \n\nTry it!!", "rating": 4, "date": "2009-01-21"}, {"excerpts": ["The princess cake alone is worth five stars.  ", "It has a marzipan frosting, custard and berry sauce between layers of white cake.  ", "On the day I was craving a slice, however, they would not cut slices from a cake that was sitting in the display case for a me and my friend.  ", "No slices that day, they said!  ", "I had walked miles and miles for princess cake!  ", "I got no sympathy from the staff, but they did let me use the bathroom.  \r\n\r\n", "Luckily Stella isn't far from there and has phenomenal slices of cake and delicious coffee drinks as well."], "author": "senna c.", "review": "The princess cake alone is worth five stars.  It has a marzipan frosting, custard and berry sauce between layers of white cake.  On the day I was craving a slice, however, they would not cut slices from a cake that was sitting in the display case for a me and my friend.  No slices that day, they said!  I had walked miles and miles for princess cake!  I got no sympathy from the staff, but they did let me use the bathroom.  \r\n\r\nLuckily Stella isn't far from there and has phenomenal slices of cake and delicious coffee drinks as well.", "rating": 3, "date": "2006-04-19"}, {"excerpts": ["I love walking up the street for a special treat like a cannoli or an amazing piece of princess cake. ", "Yum!  ", "I have used them for special events like birthdays and even my wedding cake. ", "The staff is great...very friendly."], "author": "J W.", "review": "I was sad to see Victoria's Pastry leave the location they've resided at for 100 yrs. but happy to see that they've moved closer to were I live! I love walking up the street for a special treat like a cannoli or an amazing piece of princess cake. Yum!  I have used them for special events like birthdays and even my wedding cake. The staff is great...very friendly.", "rating": 5, "date": "2013-01-05"}, {"excerpts": ["Such delicious treats... especially love their princess cake and torrone. ", "An absolute must when in SF"], "author": "Big E.", "review": "Adorable Italian bakery! Such delicious treats... especially love their princess cake and torrone. An absolute must when in SF", "rating": 5, "date": "2009-11-11"}, {"excerpts": ["My husband and I had a Victoria Pastry Princess Cake as our wedding cake (only with buttercream frosting instead of the marzapan so we could have it decorated the way that we wanted). ", "We came in with both sets of parents and she even gave each dad a big slice of the Princess Cake that they didn't have to share with any of the rest of us! :-) "], "author": "Lisa Z.", "review": "My husband and I had a Victoria Pastry Princess Cake as our wedding cake (only with buttercream frosting instead of the marzapan so we could have it decorated the way that we wanted). It was very delicious!!!\n\nWhen we came in for our tasting the lady who helped us was very nice and gave us generous portions to try. We came in with both sets of parents and she even gave each dad a big slice of the Princess Cake that they didn't have to share with any of the rest of us! :-) The moms, my husband and I all shared a piece, plus 3 other slices of other flavors that we were choosing between.\n\nThe wedding cake was beautiful and delicious. I would have given 5 stars if it weren't for two things:\n\n1. We ordered a sheet cake in addition to the 3-tier wedding cake so we would have enough cake for everyone. The sheet cake was never delivered to the reception site and I didn't find that out until we were getting ready to cut the cake! Luckily we didn't end up needing it. There was enough cake for everyone who wanted it (plus a little extra - we got to keep the top tier). The owner was very nice about reimbursing us for the $ that we spent on the sheet cake that we never received\n\n2. At our tasting I brought the dimensions of our Lenox cake topper because I wanted to make sure that it would fit. The lady did not write down the dimensions and insisted that the cake topper would fit. Well...on wedding day it did not fit. The cake still looked pretty with fresh flowers that my mom collected from the guest book table as our cake topper (good thing she entered the ballroom before any of our guests did to check it out). Nobody knew the difference and the beautiful Lenox cake topper was still part of our wedding day as it sat on the cake table beside the cake.", "rating": 4, "date": "2009-06-09"}, {"excerpts": ["the princess cake is a work of art and sculpted to perfection...."], "author": "Hen A.", "review": "it's sugar lover's paradise..but i'm not a sugar lover...but....i'll take a sliver or a bite...their cream puffs (custard) is delicious....the cream puff rum cake is fabulous....the princess cake is a work of art and sculpted to perfection....", "rating": 4, "date": "2006-06-27"}, {"excerpts": ["What does it say about me, a 35 year old Samoan man, 6 feet, over 200 lbs and looks like he could play defense for the 49ers walking into Victoria's Pastry and ordering a slice of the Princess Cake?  ", "Gay?  ", "Yeah.  ", "You'd guess right.  ", "Into the most delicious cake that I'd gladly sell my mother for?  ", "Oh...MOST definitely!!"], "author": "Gordon A.", "review": "What does it say about me, a 35 year old Samoan man, 6 feet, over 200 lbs and looks like he could play defense for the 49ers walking into Victoria's Pastry and ordering a slice of the Princess Cake?  Gay?  Yeah.  You'd guess right.  Into the most delicious cake that I'd gladly sell my mother for?  Oh...MOST definitely!!", "rating": 4, "date": "2007-07-23"}, {"excerpts": ["They have ruined Princess Cake from anywhere else for me. ", "The new girl with the short hair is really nice, otherwise the service is apathetic at best. ", "I've tried a couple of their other pastries but was not impressed. ", "The Napoleon tasted a bit soggy but really, the Princess cake makes up for it completly. ", "Also once I ordered one with chocolate cake instead of vanilla and it was DIVINE."], "author": "Nadia P.", "review": "I get my birthday cake here every year. They have ruined Princess Cake from anywhere else for me. The new girl with the short hair is really nice, otherwise the service is apathetic at best. I've tried a couple of their other pastries but was not impressed. The Napoleon tasted a bit soggy but really, the Princess cake makes up for it completly. Also once I ordered one with chocolate cake instead of vanilla and it was DIVINE.", "rating": 5, "date": "2008-06-10"}, {"excerpts": ["Once inside the crowded bakery, we decided to get a slice of Princess Cake and a small red velvet cupcake.  ", "The Princess Cake was to die for- ", "the cake was moist and the marzipan frosting was sweet.  ", "The red velvet cupcake was just okay because both the frosting and cake were a little dull.  ", "Overall, Victoria's is one of San Francisco's finest, and I will be back for their sweet treats."], "author": "Shannon W.", "review": "I have no clue why I have never tried Victoria's, especially since I have always heard that it one of SF's finest.  So, I was in the city and decided to trug through a section of Chinatown in the hopes that the bakery lives up to my high expectations.  Once inside the crowded bakery, we decided to get a slice of Princess Cake and a small red velvet cupcake.  The Princess Cake was to die for- the cake was moist and the marzipan frosting was sweet.  The red velvet cupcake was just okay because both the frosting and cake were a little dull.  Overall, Victoria's is one of San Francisco's finest, and I will be back for their sweet treats.", "rating": 4, "date": "2009-10-24"}, {"excerpts": ["I love their princess cake with the moist cake, smooth cream and almond paste.  ", "Yum ... princess cake!"], "author": "Sara A.", "review": "I love their princess cake with the moist cake, smooth cream and almond paste.  Yum ... princess cake!", "rating": 4, "date": "2007-07-02"}, {"excerpts": ["the princess cake, pastry's and the coffee are great... ", "i come in almost every morning before work, every pastry that they have has been in my stomach mmmm...??? ", "maybe 3 times lolz... they do a great job for years and years... ", "Get there early though cuz they sell out quick, it's a great hangout spot between little ltaly and chinatown..."], "author": "jonathan h.", "review": "the princess cake, pastry's and the coffee are great... i come in almost every morning before work, every pastry that they have has been in my stomach mmmm...??? maybe 3 times lolz... they do a great job for years and years... Get there early though cuz they sell out quick, it's a great hangout spot between little ltaly and chinatown...", "rating": 5, "date": "2010-08-23"}, {"excerpts": ["I LOVE THEIR PRINCESS CAKE!!!!!!!!!!!!!!!!!!!!!!!!!!! ", "YUm! ", "=) ", "and I remembered trying a few other cakes here before as well.. ", "I never had any complaints. ", "love this place"], "author": "A L.", "review": "I LOVE THEIR PRINCESS CAKE!!!!!!!!!!!!!!!!!!!!!!!!!!! YUm! =) and I remembered trying a few other cakes here before as well.. I never had any complaints. love this place", "rating": 5, "date": "2009-04-15"}, {"excerpts": ["Their Princess Cake is also fantastic, although I have to admit that when I originally ordered it, it was meant as a joke because of the colour and it turned out to be an amazing hit.  ", "Can not believe that I have yet to try the tiramisu.  ", "All that said, I have not set foot inside of the SF shop.  ", "For 15 years I have ordered cakes for special occasions and have always had the best results!"], "author": "Susan M.", "review": "The St. Honoré Cake is brilliant, better than any other cake I've had.  Their Princess Cake is also fantastic, although I have to admit that when I originally ordered it, it was meant as a joke because of the colour and it turned out to be an amazing hit.  Can not believe that I have yet to try the tiramisu.  All that said, I have not set foot inside of the SF shop.  For 15 years I have ordered cakes for special occasions and have always had the best results!", "rating": 5, "date": "2011-06-16"}, {"excerpts": ["i am only rating on their princess cake. \n\n"], "author": "eve l.", "review": "i am only rating on their princess cake. \n\nthis cake is soooooo unbelievably delicious. if you're ever in a situation where you want to impress, make sure to pick up one of these bad boys... you won't be sorry. \n\nladies, this cake is PERFECT for a baby shower.", "rating": 5, "date": "2006-02-02"}, {"excerpts": ["I got the princess cake as my wedding cake here, or actually from the one in Marin, but it was the best freakin cake ", "Ive ever had!"], "author": "kelley d.", "review": "I got the princess cake as my wedding cake here, or actually from the one in Marin, but it was the best freakin cake Ive ever had!", "rating": 5, "date": "2007-11-17"}, {"excerpts": ["Two words - princess cake!  ", "Be ready to indulge your taste buds."], "author": "John c.", "review": "Two words - princess cake!  Be ready to indulge your taste buds.", "rating": 5, "date": "2007-06-19"}], "custom cakes": [], "cannolis": [{"excerpts": ["The most popular items in here are their PRINCESS CAKE & CANNOLIS. ", "The PRINCESS CAKE has Raspberries,  Custard , Whipped  ", "Cream, Triple Sec, & almond paste. ", "It is a beautiful spring green color. ", "DELICIOUSSSS! ", "Their Cannolis are Ricotta filled with Chocolate Chips. ", "Also DELICIOUSSSS! ", "They also have great Cappuccinos. ", "They have table & chairs inside & outside this little Italian cafe. ", "This is a great people watching spot.  \n", "It used to be, you had to have mega bucks & be really rich to have the Good Life, not anymore. ", "The Game has changed. ", "You've been Upgraded. ", "Now You Can \nLive Like a King on a Limited Budget!"], "author": "Stephen Z.", "review": "AN ABSOLUTELY MUST DO! DELICIOUS ITALIAN PASTRIES & Cappuccino. Located in the Little Italy section of San Francisco called North Beach. The most popular items in here are their PRINCESS CAKE & CANNOLIS. The PRINCESS CAKE has Raspberries,  Custard , Whipped  Cream, Triple Sec, & almond paste. It is a beautiful spring green color. DELICIOUSSSS! Their Cannolis are Ricotta filled with Chocolate Chips. Also DELICIOUSSSS! They also have great Cappuccinos. They have table & chairs inside & outside this little Italian cafe. This is a great people watching spot.  \nIt used to be, you had to have mega bucks & be really rich to have the Good Life, not anymore. The Game has changed. You've been Upgraded. Now You Can \nLive Like a King on a Limited Budget!", "rating": 5, "date": "2018-03-17"}, {"excerpts": ["The cannolis and cream puffs are so fresh and sweet. ", "Probably the best cannoli I have ever had. "], "author": "Erica D.", "review": "This place is sooo yummy and OG. Right in teh heart of North Beach Little Italy I stopped by on Fathers day for some sweets and they were amazing. The cannolis and cream puffs are so fresh and sweet. Probably the best cannoli I have ever had. Knocking a star for the price ($4.75 each).... they dont even cost that much in NYC or Boston! \n\nI really want to try their princess cake... it looks so yummy and is sold by the slice!\n\nVery casual and unpretentious.... great place to grab a coffee and a cookie while site seeing in the area. Right next to a cute park you can go eat at!", "rating": 4, "date": "2017-06-21"}, {"excerpts": ["I went there for Thor cannolis and it was very good. ", "I saw some food critics review and decided to go there. ", "It was out of my way but well worth it"], "author": "Bondr M.", "review": "I went there for Thor cannolis and it was very good. I saw some food critics review and decided to go there. It was out of my way but well worth it", "rating": 5, "date": "2018-05-23"}, {"excerpts": ["At Stellas I know they sell cannolis and typically they only have a couple filled on display. ", "As the day goes along they fill more to prevent soggyness. ", "Didn't see any cannolis today at Victorias. "], "author": "Stefan T.", "review": "Slipped in here today 6/1/16 just in time before closing. \n\nThree years ago they moved to this location and was the first time I've been in... been going to their sister store Stellas instead.\n\nI might be biased as I grew up with these desserts as a kid. The neighbor across the street, an original SF native always brought them in. She always used to say, \"you haven't lived until you've tried their princess cake!!\" \n\nI think most might find their princess cake too sweet especially if your not into marzipan - almond paste, from what I've noticed lots of American born people are not that into it.\n\nGo in for their cookies sold by the pound. They are outstanding esp the pine nut cookies. I bought a variety of cookies and a Napoleon. All good stuff. At 8pm I could tell that the Napoleon was a bit soggy from sitting likely 12 hours but still as good as this type of dessert gets. See photos. At Stellas I know they sell cannolis and typically they only have a couple filled on display. As the day goes along they fill more to prevent soggyness. Didn't see any cannolis today at Victorias. In fact the two Napoeons they had left were sort of hidden toward the back. \n\nWould be nice if they would sell smaller slices. Typically what is sold here is rich. I recommend buying a slice and sharing with a friend along with a few pine nut cookies each.\n\nTry also in SF Tartine and BPatasserie. In Alameda try Crispian for the best almond croissant youve ever had.", "rating": 5, "date": "2016-06-01"}, {"excerpts": ["Right across the street from Washington Square Park, they have a huge counter of little cookies, cakes, eclairs, cannolis, etc. ", "SO cute! ", "Also have coffee/espresso."], "author": "Natalie M.", "review": "Right across the street from Washington Square Park, they have a huge counter of little cookies, cakes, eclairs, cannolis, etc. SO cute! Also have coffee/espresso.", "rating": 5, "date": "2017-05-12"}, {"excerpts": ["Was a little disappointed that they were out of cannolis. ", "Over great pastries & people watching."], "author": "Amy S.", "review": "Enjoyed a latte and tiramisu. My daughter had cookies & got chocolate. Was a little disappointed that they were out of cannolis. Over great pastries & people watching.", "rating": 4, "date": "2017-05-29"}, {"excerpts": ["They still have the Italian cookies, larger cookies, danishes, cannolis, slices of cakes and whole cakes. "], "author": "Al L.", "review": "1914? That's how long Victoria Pastry has been selling its delicious sweet delicacies.  Victoria relocated to the corner of Filbert and Powell streets after moving from its long-time location at the corner of Vallejo and Stockton streets.  \n\nThis new location is smaller and it appears that the menu selection has decreased as well. They still have the Italian cookies, larger cookies, danishes, cannolis, slices of cakes and whole cakes. Came here to buy slices of my \"go-to's\", the Princess cake and St, Honore.  Had to settle with the Princess cakes slices since it appears that they don't sell the St. Honore anymore, as it's not even listed on their menu board. (http://www.yelp.com/biz_photos/victoria-pastry-company-san-francisco-2?select=mSu3uywafqw7HHNCI11Ysg#7bdx2vdFPVhcAVXNe5abdQ)\n\nIf you haven't tried it, Princess cake is a yellow cake with layers of whipped cream, custard, raspberry jam, triple sec and covered with a smooth layer marzipan. A princess indeed. The Princess cake was as delicious as usual and wished I had some St. Honore to try as well. Victoria, please bring back the St. Honore.\n(http://www.yelp.com/biz_photos/victoria-pastry-company-san-francisco-2?select=mSu3uywafqw7HHNCI11Ysg#LBtTA8QoY__6GmXLd2d3Jw)", "rating": 4, "date": "2014-10-16"}, {"excerpts": ["It looked like it would serve legit cannolis. ", "They only had chocolate chip ones left, not a traditional flavor but we were psyched. ", "Ordered two thinking they'd pipe them fresh, as good cannolis are done, she took two pre-filled ones from the counter. ", "Unfortunately, the cannolis were soggy (as expected with pre-filled ones) and the filling left a weird texture in our mouths. ", "So disappointed."], "author": "Cherie F.", "review": "Walking along the street before dinner, my husband and I got excited when we saw this place. It looked like it would serve legit cannolis. They only had chocolate chip ones left, not a traditional flavor but we were psyched. Ordered two thinking they'd pipe them fresh, as good cannolis are done, she took two pre-filled ones from the counter. Strange. \n\nWhat's worse was they cost us $9 for two. Holy Hanna! They better be delicious. Unfortunately, the cannolis were soggy (as expected with pre-filled ones) and the filling left a weird texture in our mouths. So disappointed.", "rating": 1, "date": "2015-08-05"}, {"excerpts": ["and I usually give-up certain foods during Lent, including dessert, but cannolis??  ", "Anyhoo, instead of stopping by Dianda's  on the way home (I live nearby)", "They still had cookies and various whole and slices of cakes, but I didn't see any cannolis. ", "I was the next person to be helped and I told the young woman that I wanted two cannolis. ", "She looked in the display case and of course she didn't say any left, but told me she would go to the back to get some. ", "From what I've read in a previous review, they make their cannollis made to order. ", "I paid for my cannollis ahead of time and about 5 min. ", "later, she came back out with small box of cannolis =). ", "I was happy. ", "D. \n\nOh, the cannolis set me back $8.50 ($4.25 for each). "], "author": "Neni E.", "review": "As a native San Franciscan, I'm ashamed to say that this past weekend was the first time I ever walked into this pastry shop. I frequent Chinatown every weekend for my weekly veggie and fruit shopping and Vietnamese food or dim sum fix, yet I never thought of walking in here to try their pastries....until I suddenly had a craving for cannollis. I don't know why, but I haven't had a cannoli since I've accepted my lactose-intolerance status years ago. I think the last time I had one was...10 years ago (?) from Dianda's Bakery here in the Mission. And here I was, craving for a connolli and I think it's because Lent is upon us and I usually give-up certain foods during Lent, including dessert, but cannolis??  Anyhoo, instead of stopping by Dianda's  on the way home (I live nearby), I thought I'd try this place since I was already in the area getting my pho fix. \n\nAs I walked-in, there was a lot of chatter from the patrons who were in there having coffee and pastries as an afternoon snack. No, not Italian, but Cantonese =). Remember, Chinatown is a hop, skip away. So the display was pretty empty. They still had cookies and various whole and slices of cakes, but I didn't see any cannolis. I was the next person to be helped and I told the young woman that I wanted two cannolis. She looked in the display case and of course she didn't say any left, but told me she would go to the back to get some. From what I've read in a previous review, they make their cannollis made to order. I paid for my cannollis ahead of time and about 5 min. later, she came back out with small box of cannolis =). I was happy. I now had my cannollis to satisfy my craving and dessert fix before Lent. \n\nSince I had two, I decided to only eat one with my tea when I got home and save the other for the next day. I was happy with my choice. Filling was firm and not runny, not too sweet, and had mini chocolate chips with a marachino cherry on each end. Mmmm....good choice, although I was eyeing there slice of tiramisu in t heir display case. Hmmm.....I just might have to go back on Monday or Tuesday before Lent to try that =D. \n\nOh, the cannolis set me back $8.50 ($4.25 for each). A little pricey?? Hmmm....I'll have to compare prices with Dianda's. In any case, it was delicious treat for me =).", "rating": 4, "date": "2012-02-19"}, {"excerpts": [", thank you for the best cannolis and service!"], "author": "Bernadette E.", "review": "Fist visit, it was a great experience and I'm sure I'll be back, thank you for the best cannolis and service!", "rating": 4, "date": "2014-07-29"}, {"excerpts": ["The cannolis are good. ", "You have to ask them for the cannolis because they store them in a refrigerator that you can't see. "], "author": "Denise C.", "review": "Not as good as Stella's pastry. The cannolis are good. You have to ask them for the cannolis because they store them in a refrigerator that you can't see. The Napoleons and Tiramisu cakes looked good. I'd like to go back again.", "rating": 4, "date": "2011-06-20"}, {"excerpts": ["I had some brownies, cannolis, amaretti cookies, italian rum cake, and princess cake. ", "Everything was great! ", "I'm a huge princess cake fan and the marzipan was so thick and yummy. ", "The cake itself was a litle dry ", "but I think that If I had a fresh cake made for me, it would be perfection. ", "The cannolis were very yummy, as were the cookies, brownies, and other cake. ", "I wouldn't necessarily say that this is the best bakery, but they do have great stuff ", ":)"], "author": "Sheeva G.", "review": "I pretty much bought half of the bakery when I came. I had some brownies, cannolis, amaretti cookies, italian rum cake, and princess cake. Everything was great! I'm a huge princess cake fan and the marzipan was so thick and yummy. The cake itself was a litle dry but I think that If I had a fresh cake made for me, it would be perfection. The cannolis were very yummy, as were the cookies, brownies, and other cake. I wouldn't necessarily say that this is the best bakery, but they do have great stuff :)", "rating": 4, "date": "2012-02-22"}, {"excerpts": ["North End in Boston & North Beach in San Fran are the best IMAO if you're into cannolis, tiramisu, that zabaione cake (sfaggonia, one of my other favorites when I don't choose the Princess Cake)."], "author": "Suzanne G.", "review": "actually discovered Princess Cake from VPC at a cafe in Sausalito -- loved the cake so much that I inquired its origin.  \"We get the desserts delivered from Victoria Pastry in San Fran.\"  So back in 2013 had to go to the source in North Beach.  I know it's been discussed before, but their Princess Cake is divine.   Pastry cream, whipped cream, and marzipan with one layer of raspberry jam is perfection.   Their tiramisu is a little heavy on the alcohol, but still good.  The other pastries I've tried have been good, but don't knock your socks off like the Princess Cake.   So on our last day driving out to Redwood City to our son's house, we were going to pick up Princess Cake but Richmond bakery called Schubert's was way more convenient.  VPC is a slightly better cake but about 60% more expensive than Schubert's on Clement St., so take that into account if you don't want the hassle of North Beach and want to pay $20 for a cake rather than $34.   Wish I got to the Bay area more often (only there about once/year to visit my son & his gf) as I adore VPC.   The owner & the staff are sweeties.  A few tables out front in the shade, as well as a few tables inside where my long-suffering husband sits & waits (he rarely eats desserts).  Miss you already as the DC area where I live has a dearth of good Italian pastry.   North End in Boston & North Beach in San Fran are the best IMAO if you're into cannolis, tiramisu, that zabaione cake (sfaggonia, one of my other favorites when I don't choose the Princess Cake).", "rating": 4, "date": "2015-07-20"}, {"excerpts": ["The cannolis go fast on the weekends."], "author": "Liz P.", "review": "Cannoli, how much do I love thee?  Let me count the ways.  \n\nVictoria does one damn fine cannoli.  Creamy sweetened ricotta studded with mini chocolate chips in a crisp shell.  It would make my Sicilian grandfather proud.  On par with Veniero's in NYC.\n\nI brought a boyfriend here once.  He had never sampled cannoli.  One bite and he was swooning.  It wasn't over me.\n\nBring your attitude and they may begrudgingly fill a shell up for you fresh if there aren't any in the case. \n\nBeware: The cannolis go fast on the weekends.", "rating": 4, "date": "2007-11-16"}, {"excerpts": ["I ordered 2 cannolis for myself, a piece of chocolate cake for my wife's belated birthday, a napoleon for me, a kitty cat cookie for my daughter, and a chocolate eclair for me. "], "author": "The Man M.", "review": "Youra gooda boy....\n\nOk --- I am 37 and yet I didn't mind being called a good boy by the woman who concocted my tasty treats. You should know a couple things about me. I try really hard to eat well six days a week. The seventh is pure gluttony! And I plan for it. I strategize as to how I am going to indulge. Today it was Victoria Pastry Co. I made the family wait in the car as I ran in to order (mainly because I knew my wife's mouth would drop as I picked one item after another). \"I'm gonna need a box\" I said when she asked me what I would like.  I ordered 2 cannolis for myself, a piece of chocolate cake for my wife's belated birthday, a napoleon for me, a kitty cat cookie for my daughter, and a chocolate eclair for me. (I do think of others....) \n\nI consider my self a critique of the eclair; so questioned the contents, \"is there real custard in there or something else\" --- \"I hava both custard and cream\" = \"Custard\" I replied without hesitation. \"And the napoleons too?\" --- \"Custard also\" she retorted.\n\"one of those please\"\n\n\"Youra gooda boy\" she said and handed me a complementary piece of cinnamon sour cream cake ( not bad also). I could not wait to get home.\n\nNow the review: the cannoli is as traditional as I have had in a while, not overstuffed with over-sweetened cream. The cookie was sturdy, and had more flavor than many of the other wafer types you find. The cream, though a bit bland for my taste, was very good. All in all, a solid A- for the treat. The napoleon: B+, though I am not a frequenter of the pastry. The pastry layers were a bit stiff, making the process a bit difficult to navigate. The custard was phenomenal! The cookie was good (and cute) and the chocolate espresso cake was very rich and moist; a clear A-. Now the best for last.\n\nThe best for last. Having tasted the custard with the napoleon, I could hardly wait to eat the eclair. But when I did, it surpassed my expectations. This is old school and what I mean by that, this is classic pat a choux, real custard and a fabulous chocolate ganache. This is like grandma used to make. The custard has been in the pat a choux just long enough for the texture to be firm on the outside and doughy on the inside. The ganache has a soft texture and melts on the roof of your mouth like a buttery kiss. A curve wrecker on the grading scale -  A+++.\n\nI will be back --- next Saturday of course. As for the rest of today --- harris' steak dinner and crme brule for yet another desert. Then, back to the gym for six more days.\n\nAdded commentary:  Victoria vs. Beard Papa  - this is kinda like Mercedes versus Porsche --- the two are very distinctive and good. Victoria is old school and classic (Mercedes) where as Papa is more performance (Porsche). \"It has an addictive chemical in it that makes ya crave it fortnightly smart ass\" (bonus points to those you can source the quote, which shouldn't be too hard in this city). There is no clear winner between the two. Try them both --- I did --- and will, again, -\nAnd again.\nAnd.....", "rating": 5, "date": "2006-11-04"}, {"excerpts": ["the cannolis here are kind of slender ", "and i'll tell you now", "with that said, their cannolis aren't overly sweet, which i like ", "but the shell is a little too greasy for me. ", "plus, charging $3.95 for something so small should be a crime!!!"], "author": "Regina C.", "review": "listen up fellas!!!!! the cannolis here are kind of slender and i'll tell you now, it's not about the length, it's about the GIRTH!!! \n\nwith that said, their cannolis aren't overly sweet, which i like but the shell is a little too greasy for me. plus, charging $3.95 for something so small should be a crime!!!", "rating": 2, "date": "2010-07-22"}, {"excerpts": ["The zucatto is awesome, the cannolis are very fresh , your grandmother would approve...\n", "Hot cross buns when available ,can't be found any better, and the twice baked selection of italian cookies is the best.\n", "Great cakes, make this a must for any good food journey...\n", "Traditional hard working family business...\n", "Update: ", "For Christmas 2011, I ordered online some 2lb. panettone for the house and guests, it arrived quickly,baked perfectly...", "Still the best on the West Coast...\nUpdate for Christmas 2012...\n", "Just tried to order our Christmas panettone on line and their site is down due to their move.", "Really sad news that they are not  there any more,but hopefully the new location will be just as great, and that their site will be up soon.\n", "Tradition on Grant  st.. has been changing for years,and  ", "I cant imagine that corner without them or the ovens that were there forever.", "All the best to them from our family."], "author": "John W.", "review": "Since I was a child, the panettone bread, is the finest San Francisco has to offer.\nThe zucatto is awesome, the cannolis are very fresh , your grandmother would approve...\nHot cross buns when available ,can't be found any better, and the twice baked selection of italian cookies is the best.\nGreat cakes, make this a must for any good food journey...\nTraditional hard working family business...\nUpdate: For Christmas 2011, I ordered online some 2lb. panettone for the house and guests, it arrived quickly,baked perfectly...Still the best on the West Coast...\nUpdate for Christmas 2012...\nJust tried to order our Christmas panettone on line and their site is down due to their move.Really sad news that they are not  there any more,but hopefully the new location will be just as great, and that their site will be up soon.\nTradition on Grant  st.. has been changing for years,and  I cant imagine that corner without them or the ovens that were there forever.All the best to them from our family.", "rating": 5, "date": "2010-04-17"}, {"excerpts": ["They have the most wonderful cannolis.  ", "This past month was my Father's birthday and I wanted to get him a box full of cannolis instead of a cake.  ", "I was in the south bay and about 2 hours out from the city.  ", "I knew they would be out by the time I got there.  ", "I called and they packed up a dozen for me and kept them cold until I got there.  ", "Great service, delicious pastry and easy to get to."], "author": "Jenna B.", "review": "I have been going here since I was about 5 years old.  They have the most wonderful cannolis.  This past month was my Father's birthday and I wanted to get him a box full of cannolis instead of a cake.  I was in the south bay and about 2 hours out from the city.  I knew they would be out by the time I got there.  I called and they packed up a dozen for me and kept them cold until I got there.  Great service, delicious pastry and easy to get to.", "rating": 5, "date": "2010-04-15"}], "eclairs": [{"excerpts": ["The eclairs (choose from cream or custard) also called my name, but I will come back to share this sort of experience with others in the future; there's much to try.\n\n"], "author": "Jeffrey S.", "review": "More adventuring in North Beach led me to this shop. I'm not sure how I didn't see it here before, as I visit the truffle shop around the corner every time I'm in town, but today I did see it. I had just checked into my hotel, and taken the bus up to this neighborhood to get truffles as my first SF destination (because priorities) and I decided to take a quick detour for a pastry or cookie or something first. It's the kind of thing that a trip to San Francisco *should* involve. Having delicious destinations, but being open to trying all kinds of new things as they come up. Finding cute bakeries and sharing a few treats while seated at a small table, watching people walk by. Sipping, smiling, sampling.\n\nRoll the dice and sometimes you lose, but not today. I walked in and saw that they have cookies for sale by the pound, and I ordered one of every single cookie on the middle shelf. They happily obliged and I ended up with a menagerie of delightful little cookies. They were all very European--small, cute, and would have been perfect to sample, share, and compare notes. But I was flying solo today and ate them all myself. I sat down at the cute table out front and ate every last one all by myself. I closed my eyes and felt the sun on my face, the breeze in the air, and the flavors in my mouth. It was aaaaalmost perfect.\n\nOf the cookies, the lunette is the most interesting, with its heart shape and window between layers that lets you peek into the jam. They're gorgeous. But the real winner was the almond flavored one, with the pine nut topping and the amazing chew. I can't even describe the perfect balance of sweet and texture and crunch. I could eat a dozen right now. \n\nThis really is the kind of place you just pop in and try. Their signature princess cake looks tremendous and you can try a slice, or there are a few others that were very tempting. The eclairs (choose from cream or custard) also called my name, but I will come back to share this sort of experience with others in the future; there's much to try.\n\nI left, and then went and got my truffles. And then I wandered and tried three other places on a whim. But there's so much more to explore, so I'll be back to the neighborhood, and back to Victoria.", "rating": 5, "date": "2018-06-18"}, {"excerpts": ["I was pleased to discover that they have both the cream and custard filled Eclairs available here.\n\n"], "author": "Emmalouise B.", "review": "1:30pm on a Sunday afternoon and your waiting in line with Hubby and a Girlfriend at Mama's after dragging them to the Escape from Alcatraz Triathlon when the talk turns to Chocolate Pastries for later. What do you do? Yelp, of course! Luckily Victoria Pastry was literally just around the corner so I was able to go and see what the offerings were while I left my Husband in Line.\n\nThe place is on the small side and the Lady working not in the least bit cheery or welcoming, the cases were absolutely filled with row's of Cookies, Cupcakes, Pastries and Cake slices of which I settled on a Chocolate Eclair for my Husband and a slice of Princess Cake for myself. I was pleased to discover that they have both the cream and custard filled Eclairs available here.\n\nThe Princess Cake was ok, a little lacking in the jam layer but with a good Almond flavor, My Husband somewhat enjoyed the Eclair, it was a little on the dry side so I'm not sure how long it was kept in the case. I would be interested in returning at Easter as I see they Bake Hot Cross Buns here.", "rating": 3, "date": "2015-07-15"}, {"excerpts": ["Right across the street from Washington Square Park, they have a huge counter of little cookies, cakes, eclairs, cannolis, etc. ", "SO cute! ", "Also have coffee/espresso."], "author": "Natalie M.", "review": "Right across the street from Washington Square Park, they have a huge counter of little cookies, cakes, eclairs, cannolis, etc. SO cute! Also have coffee/espresso.", "rating": 5, "date": "2017-05-12"}, {"excerpts": ["They are known for their eclairs & cream puffs as well; but I rarely order those.  ", "I love cake.  "], "author": "Veronica M.", "review": "What do you need to know about Victoria Pastry?  First, the yelp address states it's in Russian Hill, but it's not.  It's overlooking Washington Square Park, which is definitely North Beach.  \n\nNow, what this bakery excels at...\n\nThe Princess Cake.  Tried it for the first time here when I was 20 or 21 & have kept it in my life ever since.  I'm way over 21 now.\n\nThe Cappuccino Cake.  I've gotten one for more than a couple of birthday cakes.  Coffee & cream, in a cake?  Heavenly.\n\nThe little \"gingerbread\" raisin cookies.  In Italian, they're known as papassinos.  Soft & chewy, they're diamond/rectangular shaped & addictive.  Really, with milk, coffee, a cappuccino, or a latte...a perfect marriage.\n\nI've heard some complain that Victoria Cakes are too expensive.  I disagree.  They are worth it.  And, you get what you pay for.\n\nThey are known for their eclairs & cream puffs as well; but I rarely order those.  I love cake.  And those cookies.  \n\nSometimes I miss their original location (corner of Stockton & Vallejo), but admittedly that's only if I'm headed to the Walgreens a couple doors down from there.  This Washington Square Park location is far superior, only smaller.\n\n5 stars.", "rating": 5, "date": "2014-04-29"}, {"excerpts": ["I've always liked their Chocolate Eclairs and Princess Cake!\n\n", "You can taste that their Chocolate Eclairs are made fresh instead of having the taste texture of just being in refrigeration for hours!\n\n", "As for their Princess Cake, I have always thought this cake looked unique ever since growing up because it has a chewy green outer layer and a layer of raspberry jam packed inside!  ", "It also reminds me of a cake that you would see in Alice in Wonderland, Mad Hatter's Tea Party!  "], "author": "Tiffany D.", "review": "I've always liked their Chocolate Eclairs and Princess Cake!\n\nYou can taste that their Chocolate Eclairs are made fresh instead of having the taste texture of just being in refrigeration for hours!\n\nAs for their Princess Cake, I have always thought this cake looked unique ever since growing up because it has a chewy green outer layer and a layer of raspberry jam packed inside!  It also reminds me of a cake that you would see in Alice in Wonderland, Mad Hatter's Tea Party!  It is very toot sweet!\n\nThey also offer other sweet, baked goodies here, but those two delights are my main favorites at this pastry shop!", "rating": 4, "date": "2013-04-24"}, {"excerpts": ["finally i asked her what was the most popular? \n\"eclairs, cream puffs", "\"  she responded.\n", "i visisualiized the sweetness of the chocolate and  passed. too single dimensional.\nnot unique enough "], "author": "Victor G.", "review": "Victoria Pastry was  emptied of most  pastries, pies noonish sunday. lots of cookies left though. i was greeted many times but i was trying to see what was left so i didn't respond.\n\nfinally i asked her what was the most popular? \n\"eclairs, cream puffs\"  she responded.\ni visisualiized the sweetness of the chocolate and  passed. too single dimensional.\nnot unique enough so i choose -\n\neats:\n-neapolean cake, slice(4.50)\none kind left, saw online about 5 types\nseparate layers of flaky crusts, custard, cream. flaky\ndecadent crispness of the layers of crunchiness intermingled with custard, creme.\ndelish decadance\n-cherry turnover(2.5)\nbuttery crust with cherry filling reminiscent of cherry pies. 3 stars\n\ncrumbs:\n-service pretty good.\n-not much selection.\n-would have been disappointed with an eclair...", "rating": 4, "date": "2012-01-30"}, {"excerpts": ["Cookies by the pound, excellent eclairs, cakes and cannoli.  ", "Not overly sweet, but overly delicious.  ", "Stop in for a cup of coffee or tea and a snack.  ", "You don't be disappointed."], "author": "t d.", "review": "I like the new location Filbert and Columbus because it's closer to me.  Oh, so good.  Cookies by the pound, excellent eclairs, cakes and cannoli.  Not overly sweet, but overly delicious.  Stop in for a cup of coffee or tea and a snack.  You don't be disappointed.", "rating": 5, "date": "2012-10-10"}, {"excerpts": ["The eclairs were average. ", "I have tasted better ones. ", "The hot chocolate was average too. ", "A little bit pricey."], "author": "Pal T.", "review": "The eclairs were average. I have tasted better ones. The hot chocolate was average too. A little bit pricey.", "rating": 3, "date": "2015-01-03"}, {"excerpts": ["They pride themselves of their princess cakes and eclairs. "], "author": "Jonas T.", "review": "They pride themselves of their princess cakes and eclairs. I tried the princess cake and it was nice and sweet. Very sweet, actually. I also tried their hazelnut cake which was new. Also very sweet. Everything in here is sweet. Beware! But if you think your sweet tooth can handle it, I think you'll like this place.\n\nJONASAPPROVED!", "rating": 4, "date": "2007-01-21"}, {"excerpts": ["but the canolis and eclairs arent anything special."], "author": "JeF m.", "review": "the pastries are good. can get a bit pricey. the people are hit or miss. sometimes theyre nice, sometimes they seem like they dont want to be there. they arent always open during their posted hours. so maybe call ahead. \n\ni come for the princess cake and cheesecake and another one i cant think of. but the canolis and eclairs arent anything special.", "rating": 3, "date": "2014-07-12"}, {"excerpts": ["Tiramisu, Napoleon, cream puffs, eclairs, tarts, truffles, cannoli and danishes, the latter sweet option priced from $1.85 to $2.45. "], "author": "Janel Y.", "review": "On my way to Chinatown and needed something HOT to warm me up from today's blustery SF wind. This place was across the street from where I had parked so it just seemed logical to come here first since I knew I wouldn't find a decent cup of joe in Chinatown.\n\nThe place looked like a regular pastry shop. Glancing at the menu pastries ranged from ($3.95 to $4.50) Tiramisu, Napoleon, cream puffs, eclairs, tarts, truffles, cannoli and danishes, the latter sweet option priced from $1.85 to $2.45. They also had cookies and cakes in all sorts of flavors and prices.\n\nBut I wasn't here for the pastries...which is probably why my experience here wasn't too favorable. I came in and ordered a small vanilla latte ($2.90) which turned out to be luke warm and way too sweet. I know the syrups are sweet, but even Starbucks doesn't cause me to try and find some water to hydrate myself.\n\nThe place looked popular to locals for it offered several small tables and people were popping in and out of the place. I guess you come here for the treats and not the coffee. My bad.", "rating": 2, "date": "2009-02-08"}, {"excerpts": ["My coworker dragged me into the Victoria Pastry Company near Chinatown, after a long day's work and two hours of sleep the night before, claiming they have the best 'Eclairs in the world.\n\n"], "author": "Roel C.", "review": "My coworker dragged me into the Victoria Pastry Company near Chinatown, after a long day's work and two hours of sleep the night before, claiming they have the best 'Eclairs in the world.\n\nI took her word for it. \n\n1. I was still hungover.\n\n2. I only had two hours of sleep.\n\n3. WTF is an 'Eclair?!\n\nAnyway, she bought me one and sure enough they were tasty, nearly orgasmic. Let's just say if I was 100 percent at the time of consumption, I would've bought a dozen of this fucking things and ate them all on the spot.\n\nIn retrospect, I'll just stick to eating my all-time favorite pastry from the liquor stores I used to frequent as a child in ghetto Long Beach:\n\nChocodiles.", "rating": 5, "date": "2007-08-07"}, {"excerpts": ["Their chocolate eclairs make the cream puffs at Beard Papa seem like quesionably-edible items your niece made from her easy-bake oven. ", "Chocolate eclairs top my list, with whipped cream filling or custard. \n\n"], "author": "Kelly R.", "review": "Their chocolate eclairs make the cream puffs at Beard Papa seem like quesionably-edible items your niece made from her easy-bake oven. Out of the kindness of your heart you take a bite, but dream of something much more savory and delicious. \n\nThe sweets at Victoria Pastry is what you're dreaming of, whether you're aware of it or not.\n\nChocolate eclairs top my list, with whipped cream filling or custard. \n\nThe location is best traveled via foot, as parking is a mess and it's on the corner of where Chinatown meets North Beach meets a bunch of crazy homeless people mulling about.", "rating": 4, "date": "2007-06-19"}, {"excerpts": ["Their cream puffs, eclairs, napoleons, st honore's, and cookies are absolutely delicious.  ", "The cookies sold by weight ends up a bit expensive sometimes so i stick to the other items.  ", "The only item I've tried that I found subpar was their tiramisu.  ", "Otherwise, a consistant level of high quality delicious pastries and cakes!"], "author": "Animal K.", "review": "Victoria gets 5 stars because it is head above the rest of the pastry/cake places in the city proper.  That I've visited so far.  Well, there was another great one that sold large individual slices of cake, but they closed over a year or two ago.  heh.\n\nI'm of a mind that i do not have to love everysingle cake and cookie and pastry at a bakery/pastry place.  But there has to be enough to constantly lure me back.  Their cream puffs, eclairs, napoleons, st honore's, and cookies are absolutely delicious.  The cookies sold by weight ends up a bit expensive sometimes so i stick to the other items.  The only item I've tried that I found subpar was their tiramisu.  Otherwise, a consistant level of high quality delicious pastries and cakes!", "rating": 5, "date": "2006-07-08"}, {"excerpts": ["Chocolate Eclairs are fattening.\n\n"], "author": "Sachi T.", "review": "Chocolate Eclairs are fattening.\n\nThanks a lot, Victoria Pastry.", "rating": 4, "date": "2009-02-06"}, {"excerpts": ["The eclairs are just chocolaty enough and filled with fresh, sweet whipped cream. ", "DElicious! ", "I also have to get as many French cookies as I can to last me through to my next Victoria-fix. ", "A French cookie is crunchy, buttery cookie on the bottom, topped with a sweet, almond-flavored piping of crunch in the shape of 2 D's back-to-back, with jams (peach and raspberry?) filling in the \"holes.", "\" "], "author": "G. Q.", "review": "I would have given Victoria's 5 stars for the delicious, consistent pastries I've had there. But the terrible service brings the overall rating down 2 stars. Maybe they count on the fact that their goodies keep customers coming back again and again. I've been buying Victoria's pastries since the '50s and moved out of the area in the '70s. I make it a point to get my Victoria-fix satisfied every time I visit The City. \n\nYUMMY! For special occasions, I've picked up a St. Honore cake ranging in size from 8\" to a sheet cake. They are delicious with their layers of rum cream, cake, whipped cream (didn't it have a chocolate cream layer too?) and topped with delicious, light cream puffs. DElicious! The eclairs are just chocolaty enough and filled with fresh, sweet whipped cream. DElicious! I also have to get as many French cookies as I can to last me through to my next Victoria-fix. A French cookie is crunchy, buttery cookie on the bottom, topped with a sweet, almond-flavored piping of crunch in the shape of 2 D's back-to-back, with jams (peach and raspberry?) filling in the \"holes.\" DElicious. \n\nSERVICE: Immature, negligent, and inattentive. Maybe they're relatives of the owners; they acted as if they really couldn't care less if there were customers there or not, whether the customers had questions or not, and \nwhether those customers purchased anything or not.", "rating": 3, "date": "2010-10-24"}, {"excerpts": ["Chocoate Eclairs & St. Honore cake - p ", "e ", "r ", "i ", "o d.  ", "THE BEST!!!  ", "FOR YEARS, THE BEST"], "author": "Julie B.", "review": "Chocoate Eclairs & St. Honore cake - p e r i o d.  THE BEST!!!  FOR YEARS, THE BEST", "rating": 5, "date": "2009-08-16"}, {"excerpts": ["The best eclairs and princess cakes in the city if you ask me. ", "Not cheap though, but worth it for a special occasion. ", "The service can be a little abrupt, especially if they are busy. ", "Order ahead for the holidays, it's worth it."], "author": "Edward L.", "review": "The best eclairs and princess cakes in the city if you ask me. Not cheap though, but worth it for a special occasion. The service can be a little abrupt, especially if they are busy. Order ahead for the holidays, it's worth it.", "rating": 4, "date": "2007-04-01"}, {"excerpts": ["Their brioche, eclairs and napoleons are delicious. ", "They also do tasty cakes and cookies. ", "I can never go to north beach without picking something up from here. ", "Take a number!"], "author": "chip n. c.", "review": "I love this bakery and pastry shop. Their brioche, eclairs and napoleons are delicious. They also do tasty cakes and cookies. I can never go to north beach without picking something up from here. Take a number!", "rating": 5, "date": "2006-02-04"}], "napoleons": [{"excerpts": ["The Napoleons and Tiramisu cakes looked good. ", "I'd like to go back again."], "author": "Denise C.", "review": "Not as good as Stella's pastry. The cannolis are good. You have to ask them for the cannolis because they store them in a refrigerator that you can't see. The Napoleons and Tiramisu cakes looked good. I'd like to go back again.", "rating": 4, "date": "2011-06-20"}, {"excerpts": ["The world's best custard Napoleons!!  ", "Give them a try."], "author": "Briar S.", "review": "The world's best custard Napoleons!!  Give them a try.", "rating": 5, "date": "2012-01-06"}, {"excerpts": ["And the napoleons too?\" --- \"Custard also\" she retorted.\n"], "author": "The Man M.", "review": "Youra gooda boy....\n\nOk --- I am 37 and yet I didn't mind being called a good boy by the woman who concocted my tasty treats. You should know a couple things about me. I try really hard to eat well six days a week. The seventh is pure gluttony! And I plan for it. I strategize as to how I am going to indulge. Today it was Victoria Pastry Co. I made the family wait in the car as I ran in to order (mainly because I knew my wife's mouth would drop as I picked one item after another). \"I'm gonna need a box\" I said when she asked me what I would like.  I ordered 2 cannolis for myself, a piece of chocolate cake for my wife's belated birthday, a napoleon for me, a kitty cat cookie for my daughter, and a chocolate eclair for me. (I do think of others....) \n\nI consider my self a critique of the eclair; so questioned the contents, \"is there real custard in there or something else\" --- \"I hava both custard and cream\" = \"Custard\" I replied without hesitation. \"And the napoleons too?\" --- \"Custard also\" she retorted.\n\"one of those please\"\n\n\"Youra gooda boy\" she said and handed me a complementary piece of cinnamon sour cream cake ( not bad also). I could not wait to get home.\n\nNow the review: the cannoli is as traditional as I have had in a while, not overstuffed with over-sweetened cream. The cookie was sturdy, and had more flavor than many of the other wafer types you find. The cream, though a bit bland for my taste, was very good. All in all, a solid A- for the treat. The napoleon: B+, though I am not a frequenter of the pastry. The pastry layers were a bit stiff, making the process a bit difficult to navigate. The custard was phenomenal! The cookie was good (and cute) and the chocolate espresso cake was very rich and moist; a clear A-. Now the best for last.\n\nThe best for last. Having tasted the custard with the napoleon, I could hardly wait to eat the eclair. But when I did, it surpassed my expectations. This is old school and what I mean by that, this is classic pat a choux, real custard and a fabulous chocolate ganache. This is like grandma used to make. The custard has been in the pat a choux just long enough for the texture to be firm on the outside and doughy on the inside. The ganache has a soft texture and melts on the roof of your mouth like a buttery kiss. A curve wrecker on the grading scale -  A+++.\n\nI will be back --- next Saturday of course. As for the rest of today --- harris' steak dinner and crme brule for yet another desert. Then, back to the gym for six more days.\n\nAdded commentary:  Victoria vs. Beard Papa  - this is kinda like Mercedes versus Porsche --- the two are very distinctive and good. Victoria is old school and classic (Mercedes) where as Papa is more performance (Porsche). \"It has an addictive chemical in it that makes ya crave it fortnightly smart ass\" (bonus points to those you can source the quote, which shouldn't be too hard in this city). There is no clear winner between the two. Try them both --- I did --- and will, again, -\nAnd again.\nAnd.....", "rating": 5, "date": "2006-11-04"}, {"excerpts": ["Their napoleons are to die for -- and this coming from someone who doesn't care much for desserts. ", "They also have some to die for rum balls! ", "Situated on the edge of Chinatown and Little Italy"], "author": "Anita L.", "review": "This Italian bakery rivals those in NYC. Their napoleons are to die for -- and this coming from someone who doesn't care much for desserts. They also have some to die for rum balls! Situated on the edge of Chinatown and Little Italy", "rating": 5, "date": "2005-05-16"}, {"excerpts": ["Their cream puffs, eclairs, napoleons, st honore's, and cookies are absolutely delicious.  ", "The cookies sold by weight ends up a bit expensive sometimes so i stick to the other items.  ", "The only item I've tried that I found subpar was their tiramisu.  ", "Otherwise, a consistant level of high quality delicious pastries and cakes!"], "author": "Animal K.", "review": "Victoria gets 5 stars because it is head above the rest of the pastry/cake places in the city proper.  That I've visited so far.  Well, there was another great one that sold large individual slices of cake, but they closed over a year or two ago.  heh.\n\nI'm of a mind that i do not have to love everysingle cake and cookie and pastry at a bakery/pastry place.  But there has to be enough to constantly lure me back.  Their cream puffs, eclairs, napoleons, st honore's, and cookies are absolutely delicious.  The cookies sold by weight ends up a bit expensive sometimes so i stick to the other items.  The only item I've tried that I found subpar was their tiramisu.  Otherwise, a consistant level of high quality delicious pastries and cakes!", "rating": 5, "date": "2006-07-08"}, {"excerpts": ["The napoleons seemed a little soft instead of crispy/flaky, so I would definitely go to Schubert's for their napoleon.  ", "The cake was fluffy, but a little on the sweet side."], "author": "Yan M.", "review": "My parents bought a couple slices of cake/pastries from here a few days ago.  They've always told me that their cakes were pretty good.  They purchased:\n\n1.   Zabaione Napoleon Slice\n2.  Chocolate Custard Napoleon Slice\n3.  (I don't remember the name of the cake, but it is not a napoleon.)\n\nThe napoleons seemed a little soft instead of crispy/flaky, so I would definitely go to Schubert's for their napoleon.  The cake was fluffy, but a little on the sweet side.", "rating": 3, "date": "2009-10-01"}, {"excerpts": ["Heaven on earth is their St. Honore cake and also \ntheir napoleons and tea cookies!"], "author": "Minnie-Mousse' M.", "review": "Wonderful bakery that has been here for years. \nHeaven on earth is their St. Honore cake and also \ntheir napoleons and tea cookies!", "rating": 4, "date": "2008-06-02"}, {"excerpts": ["Update:\nNot to dis the Stella Pastry lovers, but I recently went to Stella instead of Victoria to compare their Napoleons ", "and you know what?  ", "Victoria Pastry's Napoleons (and total pastry selection) win for me.  ", "So I stand by my original review."], "author": "Robyn C.", "review": "I swoon at their almond cake - perfect with coffee - delectable napoleaon with whipped cream - meringue cookies and crusty rasberry bars -  everything so very dainty and ladylike and civilized - \n\nand it all comes in a bakery box tied with string.\n\nExactly on the border between Chinatown and North Beach - The fantastic Chinese Golden Gate bakery is only a block or two away - \n\nDid I say I Hella-Heart San Francisco yet?\n\nUpdate:\nNot to dis the Stella Pastry lovers, but I recently went to Stella instead of Victoria to compare their Napoleons and you know what?  Victoria Pastry's Napoleons (and total pastry selection) win for me.  So I stand by my original review.", "rating": 4, "date": "2006-05-22"}, {"excerpts": ["But Victoria was extremely helpful and genuinely wanted to help and offered an alternative: mini napoleons, mini eclaires, and only 2 full sheets pre-cut princess cakes. ", "She originally doesnt do mini cakes, but she said \"for you, I do it.", "\" ", "Dont you know thats the one thing a gir loves to hear?!~ ", "It all came down to 1,100. ", "A little bit over our budget... so she took 10 percent off and BAM. ", "990$ (barely matching our 1000 budget). "], "author": "Natasha S.", "review": "Alright guys. SO i almost NEVER write reviews but I felt that i had to for this WONDERFUL place. \n\nLets start the beginning of my journey.. \nWe wanted to get cakes for Prom (4 full sheets) and were looking for a really good place and of course I go  on yelp, and TADAAAH. Victoria's Bakery popped right up with her famous princess cake (which are DELICIOUS btw). \n\nAnyways. So I go over there, and was very, very sad to find that it would cost 1500 for 4 full sheets (precut). But Victoria was extremely helpful and genuinely wanted to help and offered an alternative: mini napoleons, mini eclaires, and only 2 full sheets pre-cut princess cakes. She originally doesnt do mini cakes, but she said \"for you, I do it.\" Dont you know thats the one thing a gir loves to hear?!~ It all came down to 1,100. A little bit over our budget... so she took 10 percent off and BAM. 990$ (barely matching our 1000 budget). WHOOOOHOOO!! \n\nTo top it all off, she gave us a free saint honore cake, free slice of princess cake, and free cannoli. yummy. Great service, wonderful and cutesy lady (i love her accent tehe), and sure...the price might be a tad expensive, but its WORTH IT. Trust me!", "rating": 5, "date": "2010-05-22"}, {"excerpts": ["Their brioche, eclairs and napoleons are delicious. ", "They also do tasty cakes and cookies. ", "I can never go to north beach without picking something up from here. ", "Take a number!"], "author": "chip n. c.", "review": "I love this bakery and pastry shop. Their brioche, eclairs and napoleons are delicious. They also do tasty cakes and cookies. I can never go to north beach without picking something up from here. Take a number!", "rating": 5, "date": "2006-02-04"}], "red velvet cupcakes": [{"excerpts": ["You should try the Red Velvet cupcakes, they are from an other world. ", "The cheesecake is pretty good too"], "author": "Håvard E.", "review": "You should try the Red Velvet cupcakes, they are from an other world. The cheesecake is pretty good too", "rating": 5, "date": "2016-12-28"}, {"excerpts": ["it was totally worth it though - especially as i ate the other half on day two (^(oo)^)v\n\nred velvet cupcakes are tasty as well!"], "author": "Vicki Y.", "review": "oh, strawberry shortcake, how does piggy love thee?\n\nfar too much, actually . . . which unfortunately tends to result in little piggies with stomachaches, as eating half of a strawberry shortcake in one day is wont to do .......\n\nwhoops, said the little piggy ( ' (oo) ' ) it was totally worth it though - especially as i ate the other half on day two (^(oo)^)v\n\nred velvet cupcakes are tasty as well!", "rating": 4, "date": "2010-05-10"}], "danishes": [{"excerpts": ["Although they use a gross raspberry filling that looks like it came out of a can for their danishes. ", "Also the custard on the danish looks \"gummy and gelatinous\". ", "I don't think I would buy it again. ", "I think I'll go for the cream cheese and blueberry danish with slits on top. ", "At least the blueberry filling is hidden if it came out of a can. ", "The almond tart is gross. ", "Tastes like too much artificial almond flavoring went in and couldn't taste the raspberry jam layer. ", "Also super dry. "], "author": "Catherine L.", "review": "Excellent iced latte!! Better than other cafes in the area and cheaper than Caffe Greco which comes in at $5. The pastries are hit or miss but not so expensive. Although they use a gross raspberry filling that looks like it came out of a can for their danishes. Also the custard on the danish looks \"gummy and gelatinous\". I don't think I would buy it again. I think I'll go for the cream cheese and blueberry danish with slits on top. At least the blueberry filling is hidden if it came out of a can. The almond tart is gross. Tastes like too much artificial almond flavoring went in and couldn't taste the raspberry jam layer. Also super dry. The chocolate chip cookie is solid (but not Specialty's quality). \n\nThis place is a go-to in the area for me.", "rating": 4, "date": "2016-11-11"}, {"excerpts": ["They still have the Italian cookies, larger cookies, danishes, cannolis, slices of cakes and whole cakes. "], "author": "Al L.", "review": "1914? That's how long Victoria Pastry has been selling its delicious sweet delicacies.  Victoria relocated to the corner of Filbert and Powell streets after moving from its long-time location at the corner of Vallejo and Stockton streets.  \n\nThis new location is smaller and it appears that the menu selection has decreased as well. They still have the Italian cookies, larger cookies, danishes, cannolis, slices of cakes and whole cakes. Came here to buy slices of my \"go-to's\", the Princess cake and St, Honore.  Had to settle with the Princess cakes slices since it appears that they don't sell the St. Honore anymore, as it's not even listed on their menu board. (http://www.yelp.com/biz_photos/victoria-pastry-company-san-francisco-2?select=mSu3uywafqw7HHNCI11Ysg#7bdx2vdFPVhcAVXNe5abdQ)\n\nIf you haven't tried it, Princess cake is a yellow cake with layers of whipped cream, custard, raspberry jam, triple sec and covered with a smooth layer marzipan. A princess indeed. The Princess cake was as delicious as usual and wished I had some St. Honore to try as well. Victoria, please bring back the St. Honore.\n(http://www.yelp.com/biz_photos/victoria-pastry-company-san-francisco-2?select=mSu3uywafqw7HHNCI11Ysg#LBtTA8QoY__6GmXLd2d3Jw)", "rating": 4, "date": "2014-10-16"}, {"excerpts": ["Tiramisu, Napoleon, cream puffs, eclairs, tarts, truffles, cannoli and danishes, the latter sweet option priced from $1.85 to $2.45. "], "author": "Janel Y.", "review": "On my way to Chinatown and needed something HOT to warm me up from today's blustery SF wind. This place was across the street from where I had parked so it just seemed logical to come here first since I knew I wouldn't find a decent cup of joe in Chinatown.\n\nThe place looked like a regular pastry shop. Glancing at the menu pastries ranged from ($3.95 to $4.50) Tiramisu, Napoleon, cream puffs, eclairs, tarts, truffles, cannoli and danishes, the latter sweet option priced from $1.85 to $2.45. They also had cookies and cakes in all sorts of flavors and prices.\n\nBut I wasn't here for the pastries...which is probably why my experience here wasn't too favorable. I came in and ordered a small vanilla latte ($2.90) which turned out to be luke warm and way too sweet. I know the syrups are sweet, but even Starbucks doesn't cause me to try and find some water to hydrate myself.\n\nThe place looked popular to locals for it offered several small tables and people were popping in and out of the place. I guess you come here for the treats and not the coffee. My bad.", "rating": 2, "date": "2009-02-08"}, {"excerpts": ["The crust was flakier than what I'm accustomed to with danishes, and the cheese was pretty good - nice and dense and not too sweet. ", "all in all, it was solid cheese danish.\r\n\r\n", "nevertheless, i don't think I'd really care to frequent this place. ", "it's a bit far away from my office when I can just as easily go to Brioche (which also has a good danish, and better coffee). ", "the selection of pastries seem pretty limited, though I'm curious how the others taste.\r\n\r\n", "I think the real attraction of this place is its longevity. ", "and I probably wouldn't go there on a daily basis, but it's something i'd get occasionally."], "author": "Bernie L.", "review": "I was told several times that their cheese danish was \"to die for.\"\r\n\r\nI tried it finally, and while it was pretty good, i don't think it's \"to die for\"-quality. it's seemingly pretty ordinary. The crust was flakier than what I'm accustomed to with danishes, and the cheese was pretty good - nice and dense and not too sweet. all in all, it was solid cheese danish.\r\n\r\nnevertheless, i don't think I'd really care to frequent this place. it's a bit far away from my office when I can just as easily go to Brioche (which also has a good danish, and better coffee). the selection of pastries seem pretty limited, though I'm curious how the others taste.\r\n\r\nI think the real attraction of this place is its longevity. and I probably wouldn't go there on a daily basis, but it's something i'd get occasionally.", "rating": 4, "date": "2006-04-20"}], "iced lattes": [], "cookies by the pound": [{"excerpts": ["This cute little bakery sells Italian cookies by the POUND! ", "Their cannoli's are to die for and the workers are really friendly."], "author": "Katie P.", "review": "This cute little bakery sells Italian cookies by the POUND! Their cannoli's are to die for and the workers are really friendly.", "rating": 5, "date": "2015-07-29"}, {"excerpts": ["Cookies by the pound, excellent eclairs, cakes and cannoli.  ", "Not overly sweet, but overly delicious.  ", "Stop in for a cup of coffee or tea and a snack.  ", "You don't be disappointed."], "author": "t d.", "review": "I like the new location Filbert and Columbus because it's closer to me.  Oh, so good.  Cookies by the pound, excellent eclairs, cakes and cannoli.  Not overly sweet, but overly delicious.  Stop in for a cup of coffee or tea and a snack.  You don't be disappointed.", "rating": 5, "date": "2012-10-10"}, {"excerpts": ["Cookies by the pound are overpriced.  ", "Definitely NOT going back!"], "author": "Phuong D.", "review": "Terrible service.  I received many high recommendations by older (native) San Franciscans about this bakery, but perhaps their experiences were from the past.  I heard Victoria's grand-kids are running the place now and they are only interested in making a buck.  \n\nIf you are a tourist looking for something tasty to try and its near closing time, please do not go here!  The staff will rush you out the door even though there are tables and chairs.  We were obviously tourists who wanted to try the much acclaimed St Honore Cake that everyone talks about, but the staff won't even give you plastic forks and paper plates as they quickly push you out the door.  We had to go two blocks down to a coffee shop who was nice enough to give us plastic cutlery and plates even though we didn't order anything from them initially.\n\nCookies by the pound are overpriced.  Definitely NOT going back!", "rating": 1, "date": "2011-08-28"}], "almond tarte": [{"excerpts": ["I ended up having the Almond Tarte (flaky pastry, almond butter cake and raspberry) and the Cannoli (ricoota and chocolate chips). \n\n", "First off, the Almond Tarte was meh. ", "It was chewy and borderline solid. ", "It was too difficult to attack with my fork, although I may be misinterpreting the \"tarte\" as a cake? "], "author": "Linda K.", "review": "HOLY MOLY CANNOLI\n\nFinally had the chance to check out this pastry shop that has been around since 1914! I read the reviews about the Princess Cake but it honestly did not look appealing to me. Granted, I do have bad luck with choosing the good looking ones with an unappealing taste. Anywho! I ended up having the Almond Tarte (flaky pastry, almond butter cake and raspberry) and the Cannoli (ricoota and chocolate chips). \n\nFirst off, the Almond Tarte was meh. It was chewy and borderline solid. It was too difficult to attack with my fork, although I may be misinterpreting the \"tarte\" as a cake? Either way, I didn't taste the almond and the raspberry had a peanut butter-ish texture that I was not a fan of.\n\nBut the CANNOLI. Oh man! It's basically a thick crusted, flaky pastry wrapped around a long tube of cream. When you bite into it, the thick crust just cracks the entire cannoli into pieces but the combination of the crust and the cream made me want to take another bite! It was delicious!\n\nI honestly do feel like the pastries are a little overpriced for what it is, but it's a type of pastry I've never had and Victoria's might have started a new addiction. I swear I'll try the Princess Cake next time to see what the hubbub is all about!", "rating": 4, "date": "2014-11-09"}]}