{"kartoffelsuppe mit oder ohne wienerwurst": [], "soljanka": [{"excerpts": ["Try the soljanka, the cold cut platter, Roulade and Kalter Hund for desert. ", "Satisfied."], "author": "Kaden I.", "review": "My go-to now. Definitely authentic eastern German cuisine. Try the soljanka, the cold cut platter, Roulade and Kalter Hund for desert. Satisfied.", "rating": 5, "date": "2018-01-10"}, {"excerpts": ["I started with the soljanka (tomato - cabbage soup with salami, bacon & pickles), which was tangy, and delicious, with just the right amount of meat to provide flavor without making the dish too heavy. ", "I've never had tomato soup that included a slice of lemon. "], "author": "Rob P.", "review": "If you're in the mood for some unique, flavorful food in a quirky, comfortable setting, this is the place. \n\nI started with the soljanka (tomato - cabbage soup with salami, bacon & pickles), which was tangy, and delicious, with just the right amount of meat to provide flavor without making the dish too heavy. I've never had tomato soup that included a slice of lemon. But it really melded the flavors together. \n\nFor an entree, I had rinderroulade (tri-tip stuffed with bacon, pickles and mustard, spätzle and red cabbage). The meat was tinder and served in a red gravy. The spätzle was a perfect side, more interesting and flavorful than potatoes. And the cabbage provided just enough vinegary pizzazz to keep the dish interesting. \n\nThe rote grütze (red berry pudding - raspberries, strawberries & blueberries made with cream of wheat and vanilla sauce) was a fitting finale. The berry flavor was strong and refreshing. \n\nThe woman with the German accent who was serving us was very helpful and accommodating. She was obviously very proud of the food, and rightfully so. This is definitely a place I will go back to.", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["SOLJANKA (TOMATO - CABAGE SOUP WITH SALAMI, BACON & \nPICKLES)\n\n"], "author": "Gourmet Princessa L.", "review": "GOT GERMAN FOOD? YA! AND IT'S DELICIOUS MINUS THE PLANE RIDE! \n\nThanks to the lack of communication by Schmidt's closure for private event on Sunday evening, we came to Walzwerk instead and had a great German dinner. By far, the best German food I had in SF.\n\nWe walked in with no reservation and the place was packed on a Sunday night at 8pm. We got lucky as a table just opened up and we got seated immediately. There were 3 of us so we decided to order everythign to share family style. We ordered:\n\n1. SMALL POTATO PANCAKES WITH CHIVE SOUR CREAM AND APPLESAUCE. \n\nWOW! Best potato pancakes I've ever had. The outter layer is crispy, but in the inside is creamy and fluffy. The chive sour cream is a great match and it really brings out the flavor of the potatoes. \n\n2. SOLJANKA (TOMATO - CABAGE SOUP WITH SALAMI, BACON & \nPICKLES)\n\nI ordered this because I love soup. This is a little too sour for my taste bud, but friends and family know that I can't really take anything too sour. But the broth is very hearty, very flavorful. It has a strong tomatoes flavors and the salami and bacons are salty, which makes the soup so appetizing. \n\nWe ordered 3 entrees and shared them family style:\n\n3. GRILLED THÜRINGER BRATWURST SERVED WITH MASHED POTATOES & SAUERKRAUT\n\nWow! I love Bratwurst and this one is dynamite. The sausage casing is seared to crispy and so flavorful. The meat mixture is great. Mashed potatoes are so creamy and the sauerkraut is nicely marinated, but still retained a good slightly crunchy texture of the cabbage. If you haven't have fresh sauerkraut (no, not the bottled stuff you get from the supermarket for your BBQ dogs), you have to try these sauerkraut. You will never eat the bottled stuff ever again. \n\n4. SAUERBRATEN (MARINATED BEEF) WITH POTATO DUMPLINGS AND BRAISED RED CABBAGE\n\nI thought this dish was only ok for me mainly because it was a little sour, but the beef slices were very tender and you can cut it with a folk. It has great flavors and the sauce is very hearty. The potato dumplings (German's version of the Italian's gnocchi) were so fluffy and covered in creamy sauce. \n\n5. SCHNITZEL (BREADED PORKLOIN) WITH MASHED POTATOES & \nSTEWED GREEN BEANS\n\nThe Schnitzel (German version of the Japanese tontatsu or pork cutlet) has a very thin breading on the outside layer, but fried to perfect golden brown and crispy and the meat is still moist on the inside. The green beans were heavenly. \n\n6. APPLE STRUDEL WITH VANILLA ICE CREAM\n\nGreat puff pastry and the stuffing was apples, some nuts and I think raisins? It was all good and came out nice and hot.\n\nTotal bill $120 for the 3 of us including tax and tips for all the food above, 3 beers and 2 apple scholes (really delicious apple juice). Not bad at all and more importantly we all had a great meal and our half German friend really enjoyed his dinner. Everything was well made, very authentic (yes, we speak from experience of dining in Germany) and our server, Francis was super nice and very helpful when it comes to helping us decide on which beer to order from their very extensive all German beer menu. \n\nThe moral of my story is -- sometimes a backup plan can turn out to be better than the original plan. \n\nYes, we'll be back definitely. Danke!", "rating": 4, "date": "2010-09-10"}, {"excerpts": ["I started with the Soljanka, a hearty tomato and cabbage soup with bits of bacon and salami.  ", "It was relatively simple but still so flavorful.  ", "For my entree, I tried the grilled Thuringer Bratwurst with some boiled potatoes, sauerkraut, and a delicious spicy mustard - also a home run.  ", "There were also a bunch of authentic german beers on the menu.  "], "author": "Tim N.", "review": "My first visit to this cozy east-german restaurant left me with mixed feelings.  On the plus side, the food itself was excellent.  I started with the Soljanka, a hearty tomato and cabbage soup with bits of bacon and salami.  It was relatively simple but still so flavorful.  For my entree, I tried the grilled Thuringer Bratwurst with some boiled potatoes, sauerkraut, and a delicious spicy mustard - also a home run.  There were also a bunch of authentic german beers on the menu.  The Schwarzbier and the Hefewiezen were both tasty and very reasonably priced.  \n\nUnfortunately, my group was a bit disappointed with the surprisingly long lag between our appetizer and our entree.  Also, after we had finished eating our dinners, we found out that there had been a Specials Menu that our server had never given us.\n\nFour stars for the food, and maybe 2.5 for the service this time around.  We'll chalk it up to a busy Saturday night, and hopefully we'll have better luck next time we visit.", "rating": 3, "date": "2010-05-23"}, {"excerpts": ["The soljanka soup is a real treat - a mix of pickled vegetables in a nice broth with bits of sausage thrown in - warms you up instantly and has a sour/savory flavor that is unique and very tasty.\n\n"], "author": "Liz S.", "review": "It's a little East Village, a lot East Berlin.\n\nIn my book, Walzwerk is the coolest restaurant in San Francisco.\n\nWhen you walk in, there is a definite buzz to the place - people are engrossed in conversation, food is coming out on steaming hot plates, and drinks are going down at a rapid clip.  There are no kitten heels or cosmos in sight.  The decor is a delightful hodgepodge of all things German, from propoganda posters to kitchy accessories.  Tables are mix and match, just like the eclectic clientele who loyally keep the restaurant busy every night.\n\nFirst, start with one of their many delicious beers - my husband likes the Optimator, while I prefer the amber.  You can't go wrong with a Weisse beer on a summer day - I can't think of anything more refreshing.\n\nFor appetizers, the potato pancakes are wonderful - thick and hearty, with sour cream and applesauce on the side.  Big enough to share, if you're feeling generous.  \n\nThe house-cured salmon is also lovely, with triangles of brown bread and a big bowl of beets on the side.\n\nThe soljanka soup is a real treat - a mix of pickled vegetables in a nice broth with bits of sausage thrown in - warms you up instantly and has a sour/savory flavor that is unique and very tasty.\n\nFor dinner, be sure to check the specials menu, because you can't go wrong with one of the fresh fish or pork selections.\n\nFavorites from the regular menu include:  Jaeger Schnitzel with Creamy Mushroom Sauce, Sauerbraten (Marinated Beef), Breast of Chicken stuffed with Apples & Bacon, Roast Pork.    If sausages are your thing, of course there is a great selection of those as well.\n\n**Vegetarians please note:  the Vegitarian Schnitzel is really good - a must-try!**\n\nDesserts:  Love the Cold Dog - layers and layers of cake & chocolate - almost a cross between a cake & a cookie, and the Apple Strudel is very good, too.  Again, there are usually specials such as cheesecake and chocolate pudding - all excellent.\n\nEven if you don't think you like German food, give Walzwerk a try.  In its very straightforward approach to both its service and its cuisine, it is sure to charm you.", "rating": 5, "date": "2006-05-31"}, {"excerpts": ["Soljanka ", "I thought I'd never be able to eat again. ", "But here it is: Delicious! ", "Thueringer Bratwurst mit Sauerkraut and Kartoffelbrei: ", "Delicious! "], "author": "Marco K.", "review": "I haven't had East German cuisine since... well... East Germany became history almost exactly 20 years ago. And then in the U.S.? Impossible!\n\nWalzwerk is as close as it gets! Whatever is lacking in taste - and that's pretty negligible to begin with - I attribute to differing food sources. \n\nSoljanka I thought I'd never be able to eat again. But here it is: Delicious! Thueringer Bratwurst mit Sauerkraut and Kartoffelbrei: Delicious! And Kalter Hund? Ditto!\n\nOstdeutsches Essen beim Klassenfeind? Hell yeah! Keep this place in business! I love it! Love it! Love it!", "rating": 5, "date": "2010-03-06"}, {"excerpts": ["Make sure you try the Soljanka soup ", "- it's heavenly."], "author": "Dan L.", "review": "I don't think I've been here and not heard German-speaking patrons, always a good sign of a place that offers 'ethnic' food. Me, I love Walzwerk  - it's one of my favorite places to eat in SF. I'd knock off one star, as the food isn't consistently stellar, sometimes it's just good, which ain't a bad thing, but I am a picky so-and-so. But I added one star for them being so accomodating...one night they had Weiner Schnitzel, but were offering it with mash & veg - I like mine with Ksesptzle & Gurkensalat and it was no problem to substitute. Sweet :)\n\nMake sure you try the Soljanka soup - it's heavenly.", "rating": 5, "date": "2008-05-12"}, {"excerpts": ["The soljanka soup was absolutely delicious and is quite possibly the one thing that will bring me back. ", "The beef roulade was tougher than leather, bone dry and completely flavorless (not to mention ice cold in the middle), though the spatzel and red cabbage that accompanied it were very good. ", "I tried a bit of the bratwurst and mashed potatoes and both were outstanding. ", "I make some mean mashed potatoes myself "], "author": "Thomas S.", "review": "I've finally come to the ultimate realization that service in San Francisco restaurants just plain sucks. This moment of clarity arrived in the middle of dinner at Walzwerk. Previously, I had thought that it was a particularly localized affliction, a North Beach thing. I am horribly mistaken.\n\nI like German food, my father loves German food. So the old man was in town and I took him here for dinner. The imported waitress who looked old enough to know better, spent most of her time ignoring the customers, the service bell and anything except for some schmoe at the bar with whom she would make out with like a highschooler on a prom date - in full view of the front of the house. WtF? Getting a beverage, butter for the bread, water, the FOOD that's sitting in the order window, I might as well have done it myself, fer chrissakes. Not to mention when I finally got my entree, it was not what I ordered and much discussion ensued before I got my correct order fired. That said, I should mention another waitress came on duty as we were finishing dinner and took over our table and was very friendly. I hope she's working when I go back.\n\n  The food was hit and miss. The soljanka soup was absolutely delicious and is quite possibly the one thing that will bring me back. The beef roulade was tougher than leather, bone dry and completely flavorless (not to mention ice cold in the middle), though the spatzel and red cabbage that accompanied it were very good. I tried a bit of the bratwurst and mashed potatoes and both were outstanding. I make some mean mashed potatoes myself so I never get excited about eating them in restaurants, but these were really good.\n\n  The portions are ginormous and I'm certainly not one of those waifish metro types, but I couldn't come close to knocking out my plate.\n\n  Overall, I'll give it another shot. It seems to be one of those places where you have to know what's good. If you get the right things, you'll have a great meal, if you get a clunker, you get stuck in a big way. I think avoiding the beef dishes is a good idea.", "rating": 3, "date": "2007-11-14"}, {"excerpts": ["The Jagerschnitzle is always perfect, and I'm told the soljanka is worth a trip here by itself.  ", "I've heard people complain about the service here, but I've had nothing but good experiences so far.  ", "This place is more suited for smaller groups, with a focus on good german food.  ", "If you're looking for a more raucous evening with a better beer selection, Suppenkuche is what you're looking for.  ", "Either way you go, you're in for some great german food and beer."], "author": "Joshua W.", "review": "I consider this commonly overlooked East German restaurant to be one of the best places to have German food in the city.  The beer selection isn't quite as good as Suppenkuche, but the food is a couple of notches better.  The Jagerschnitzle is always perfect, and I'm told the soljanka is worth a trip here by itself.  I've heard people complain about the service here, but I've had nothing but good experiences so far.  This place is more suited for smaller groups, with a focus on good german food.  If you're looking for a more raucous evening with a better beer selection, Suppenkuche is what you're looking for.  Either way you go, you're in for some great german food and beer.", "rating": 5, "date": "2007-12-10"}, {"excerpts": ["And I am so totally addicted to the soljanka (super hearty savory/sour veggie, salami, pickle soup). ", "Great food, beer, service and atmosphere. ", "Brush up on your German and try ordering auf Deutsch!"], "author": "Jeremy H.", "review": "I always leave full, happy, and completely satisfied. the wienerschnitzel is perfect! And I am so totally addicted to the soljanka (super hearty savory/sour veggie, salami, pickle soup). Great food, beer, service and atmosphere. Brush up on your German and try ordering auf Deutsch!", "rating": 5, "date": "2006-03-07"}, {"excerpts": ["The soljanka soup sounded oddly good. ", "Cabbage/tomato soup with pickles, salami and bacon? ", "Love it. ", "I love pickles and I love salami (nothing silly intended), so this soup was my kinda thing. ", "Not that much cabbage. ", "Lots of small cubes of salami. ", "Would love a meal size version of this. \n", "For entree got the roasted garlic pork. ", "Really wanted to try either the spaetzle or the potato dumplings but roast pork came w/potatoes. ", "Was able to sub the spaetzle. ", "Friend got the schnitzel. \n", "They ended up giving me potatoes and spaetzle. ", "Server apologized and said they forgot, so gave me a side of spaetzle in separate bowl. ", "I was told they wouldn't charge for two things, but spaetzle is extra. ", "My pork was presented as two pinwheel type rounds with loads of garlic rolled inside. ", "Alot of meat. ", "Alot of food! ", "The seasonal veggie was slices of cooked carrots. ", "One pork wheel was a bit tough. ", "The other was more tender but most of the outside of the round was a rind of fat. ", "All needed salt. ", "The spaetzle was lukewarm. ", "I love chewy pasta-type foods, but wasn't so excited about the spaetzle. ", "Not much flavor and no discernible sauce or seasoning. ", "Probably better hot. \n", "My friend's schnitzel was tasty and tender. ", "What's not to like about pounded thin pork that's been breaded and pan fried?! ", "He liked my dish better. ", "I liked his better. \n", "Most unusual, I was unable to finish my meal. ", "That almost never happens unless I'm ill. ", "I think it was the heaviness and meatiness that did me in. ", "And boy, was there a lot of garlic! ", "I was belching garlic fire all night. ", "Kinda gross, really. \n", "In the end I'd say I LOVE the soup, but could pass on the rest. ", "It was okay, not great. ", "The service was nice, relatively friendly and i wasn't charged for the spaetzle nor one of my 7up/beer drinks. \n", "The samples they gave me of the drinks were large and also not charged. ", "I left full, satisfied, but not ecstatic. \n", "I have been searching for a good Soljanka recipe today, though. ", "Anyone have Walzwerk's? ", "Do they sell that by the vat?"], "author": "Allucaneat G.", "review": "Took my friend here for his birthday. Figured a German restaurant would have lots of meat but with a twist. Got there around 7:30 on a Saturday and told there was a 30 min wait. They don't accept reservations for parties of less than 4. We sat in the small waiting area and had drinks. The 7up/beer sounded good, but not sure so they gave me 2 VERY generous samples, one w/ pilsner other with wheat beer. Wheat was tasty. Also sampled the sparkling wine. That was really good. Would like more of that. \nWhen seated for dinner, I had several questions. Server was nice enough but a bit terse. Understandable though, as It was busy and there were only 2 servers. \nThe soljanka soup sounded oddly good. Cabbage/tomato soup with pickles, salami and bacon? Love it. I love pickles and I love salami (nothing silly intended), so this soup was my kinda thing. Not that much cabbage. Lots of small cubes of salami. Would love a meal size version of this. \nFor entree got the roasted garlic pork. Really wanted to try either the spaetzle or the potato dumplings but roast pork came w/potatoes. Was able to sub the spaetzle. Friend got the schnitzel. \nThey ended up giving me potatoes and spaetzle. Server apologized and said they forgot, so gave me a side of spaetzle in separate bowl. I was told they wouldn't charge for two things, but spaetzle is extra. My pork was presented as two pinwheel type rounds with loads of garlic rolled inside. Alot of meat. Alot of food! The seasonal veggie was slices of cooked carrots. One pork wheel was a bit tough. The other was more tender but most of the outside of the round was a rind of fat. All needed salt. The spaetzle was lukewarm. I love chewy pasta-type foods, but wasn't so excited about the spaetzle. Not much flavor and no discernible sauce or seasoning. Probably better hot. \nMy friend's schnitzel was tasty and tender. What's not to like about pounded thin pork that's been breaded and pan fried?! He liked my dish better. I liked his better. \nMost unusual, I was unable to finish my meal. That almost never happens unless I'm ill. I think it was the heaviness and meatiness that did me in. And boy, was there a lot of garlic! I was belching garlic fire all night. Kinda gross, really. \nIn the end I'd say I LOVE the soup, but could pass on the rest. It was okay, not great. The service was nice, relatively friendly and i wasn't charged for the spaetzle nor one of my 7up/beer drinks. \nThe samples they gave me of the drinks were large and also not charged. I left full, satisfied, but not ecstatic. \nI have been searching for a good Soljanka recipe today, though. Anyone have Walzwerk's? Do they sell that by the vat?", "rating": 3, "date": "2011-02-13"}, {"excerpts": ["the appetizers are also worth trying, but i have my old stand by's: potato pancakes or soljanka.   ", "be sure to try the specials."], "author": "erica u.", "review": "OMG a salivacious place to eat, especially when it's cold out.  the wiener is awesome.   it's hearty, tasty and will put you to bed.  the appetizers are also worth trying, but i have my old stand by's: potato pancakes or soljanka.   be sure to try the specials.", "rating": 5, "date": "2008-02-05"}, {"excerpts": ["It was the first time I had a Soljanka soup (never heard of this in west Germany). ", "It was totally awesome. ", "I had the Rouladen, which were very good and my wife had the Jäger Schnitzel which was really super good. ", "The place is really small inside and not very noticeable form the outside. ", "Very gemueltich and antler free."], "author": "Marcus Z.", "review": "I've been to most of the German restaurants in the Bay Area, but this is the one I liked the most. It was the first time I had a Soljanka soup (never heard of this in west Germany). It was totally awesome. I had the Rouladen, which were very good and my wife had the Jäger Schnitzel which was really super good. The place is really small inside and not very noticeable form the outside. Very gemueltich and antler free.", "rating": 5, "date": "2009-09-07"}], "kartoffelpuffer": [{"excerpts": ["We took his dad here who was visiting from Berlin and we went full throttle on ordering several dishes: the uber crispy kartoffelpuffer with chive sour cream and applesauce, schnitzel vom schwein (breaded porkloin with mashed potatoes and veggies), grilled pork and veal bratwurst and the rinderroulade.  ", "Both men had their eyes rolling at the back of their heads while making MMM!! ", "sounds. ", "They took spoonful after spoonful of creamy mash potatoes and stuffed it into their mouths. ", "I felt proud ordering the Rinderroulade ", ":) ", "My fiance's grandma would make this rich dish in the height of the summer when I visit and ", "it's seriously, the best combination of flavors you'll put in your mouth. ", "The melt in your mouth tri-tip is stuffed with bacon, the delightful crunch of the pickles and tangyness of the mustard. ", "It is soft, crunchy, savory and overall, a wonderful concoction that'll make your belly very happy. "], "author": "Janice C.", "review": "Winter is coming. \n\nTo which you should reply: \"Ein Bier bitteschön!\"\n\nThe night air outside might be chilly, but you're sitting in the warm insides of Walzwerk. After downing a cold Franziskaner, settle in and notice your surroundings. It feels very ... industrial doesn't it? with Marx, Engels and Lenin staring back at you, you'll probably feel out of place and maybe a bit uncomfortable. \n\nGood. Because, when you travel outside of the comforts of your (foodie) home, you should feel like that. In fact, having a dinner at Walzwerk feels like you've traveled back in time to East Germany and that's what owner Christiane is hoping for. \n\nMy Berlin born fiance attests to the authenticity of this place. It is as East German as you can get. We took his dad here who was visiting from Berlin and we went full throttle on ordering several dishes: the uber crispy kartoffelpuffer with chive sour cream and applesauce, schnitzel vom schwein (breaded porkloin with mashed potatoes and veggies), grilled pork and veal bratwurst and the rinderroulade.  Both men had their eyes rolling at the back of their heads while making MMM!! sounds. They took spoonful after spoonful of creamy mash potatoes and stuffed it into their mouths. The MMMeats were all traditionally and expertly prepared. \n\nI felt proud ordering the Rinderroulade :) My fiance's grandma would make this rich dish in the height of the summer when I visit and it's seriously, the best combination of flavors you'll put in your mouth. The melt in your mouth tri-tip is stuffed with bacon, the delightful crunch of the pickles and tangyness of the mustard. It is soft, crunchy, savory and overall, a wonderful concoction that'll make your belly very happy. Try it. \n\nI'm so fortunate to have Walzwerk in SF. This is Eastern German cuisine done right.", "rating": 5, "date": "2016-12-04"}, {"excerpts": ["Started off with kartoffelpuffer (small potato pancakes with chive sour cream and applesauce). ", "It was good with the chive sour cream and weird with the applesauce. "], "author": "Michelle T.", "review": "Started off with kartoffelpuffer (small potato pancakes with chive sour cream and applesauce). It was good with the chive sour cream and weird with the applesauce. There wasn't enough chives in the sour cream to taste the chives, so it just tasted like regular sour cream. \n\nFor the entree I ordered the schnitzel vom huhn (chicken breast breaded, boiled potatoes and cucumber salad, but replaced boiled potatoes with mashed potatoes) and my boyfriend ordered the jägerschnitzel (porkloin with spätzle and creamy mushroom sauce). I really like the balance of the creamy mashed potatoes with the fried chicken breast. The chicken breast was juicy and tender. The creamy mushroom sauce was really good. I don't remember much of how the porkloin tasted. The highlight of that dish was definitely the sauce. \n\nBoth entrees were really heavy and because of that I think one entree can be shared with two people.", "rating": 3, "date": "2017-07-18"}, {"excerpts": ["The kartoffelpuffer came next.  ", "We shared these potato pancakes served with a side of sour cream and applesauce.  "], "author": "Thomas D.", "review": "Service was wunderbar.  Both of our servers were great at explaining the dishes and making everyone feel welcome at this starkly appointed replica of the former East Germany.\nFrom the unadorned light bulbs overhead, to the chipped enamel tables set against dimly painted yellow walls, we felt as if we walked into a time warp of the former Soviet-era.\n\nBoth the mood and tone were quite inviting and relaxed.  It's as if you walked into someone's home and sat down for a realistic, home cooked German meal.  I don't think there were 10 tables in the small dining room.\n\nThe beer selection is pretty cool and exciting.  We were steered to the bottled Gaffel Kölsch and the draft Weltenburg Helles.  They were delicious!!  German beer---love it!\n\nA small appetizer was immediately brought to the table.  It was made up of thinly sliced, small square bread bottoms with cucumber, sliced radish, sour cream, cheese and a little piece of bratwurst on top.  I was expecting more flavor but didn't get it.\n\nThe kartoffelpuffer came next.  We shared these potato pancakes served with a side of sour cream and applesauce.  They were dense and plain tasting--the applesauce was the better choice to kick up the flavor.\n\nI ordered the schnitzel vom schwein and was served a large portion of a breaded, pork cutlet.\nThe accompanying mashed potatoes were creamy and tasty.  The pork was very good too.\nThe side vegetables were a fresh mix of squash, carrots and brussel sprouts.\n\nMy partner had the hühnerbrust gefüllt mit äpfeln und speck.  This rolled chicken breast was stuffed with bacon, apples and raisins and covered in a white gravy.  What looked like it should offer a-- \"wow\"--- in flavor,  just didn't bring that much taste.  The accompanying sides were the same as above.  Again, outstanding mashed potatoes.\n\nI'm sorry, but the apfelstrudel dissapointed.  The dough was heavy and rubbery.  I had a hard time getting through it with my fork.  Apple strudels that I have had in the past were crisp, crunchy and full of flavor.  This was not.\n\nWe may have played it safe with the dishes we ordered.  Next time we visit, I'd like to experiment with their cabbage and sausage dishes and search for more flavor.\n\nAll in all, it was a nice experience and we are so lucky to have all of these choices in SF.", "rating": 3, "date": "2015-10-25"}, {"excerpts": ["*Kartoffelpuffer: Potato pancakes w/ chive sour cream, applesauce ($7): ", "http://bit.ly/1JsqBh4\n", "*Matjes Herring w/ sour cream, apples, onions, pickles, pumpernickel bread ($9): http://bit.ly/1D8XQ7L\n", "*", "Gebeizter Lachs: "], "author": "Cherylynn N.", "review": "4.5 STARS \n\nI have a love and hate relationship with large group dinners.\n\nI love being able to get together with friends who I rarely see these days because of our busy schedules. Seems like everybody and their mama is getting engaged, married, and/or knocked up on FB...except us. We're over here like, \"Heeeeeey, look at my furbaby in his OOTD\".  *le sigh*\n\nI hate organizing group dinners because finding a reasonably priced restaurant in SF that can accommodate a large group AND have easy street parking is like finding a unicorn. Then, with some restaurants you have to deal with stupid penalty charges if you have flaky friends who don't even bother texting that they can't make it. \n\nWalzwerk is that unicorn.\n\nThe East German menu is carniwhore friendly with large portions at very affordable prices. They have a private room in the back that can accommodate up to 20 people, and finding street parking in this area of the Mission is not impossible. If you have a group of 10+, there's a set dinner: sampling of all the apps and 3 shared entrees for $28 pp which is dirt cheap for SF. Beer and wine only. Reservations accepted for parties 4 or more.\n\nWe had less than 10 people so we ordered a bunch of apps, our own entrees, and shared several desserts:\n\nA P P S\n*Kartoffelpuffer: Potato pancakes w/ chive sour cream, applesauce ($7): http://bit.ly/1JsqBh4\n*Matjes Herring w/ sour cream, apples, onions, pickles, pumpernickel bread ($9): http://bit.ly/1D8XQ7L\n*Gebeizter Lachs: House cured salmon, horseradish cream, marinated beets, fitness bread ($9): http://bit.ly/1Ipa1tm\n\nThe group favorite was the potato pancakes. Sure, they were just glorified hash browns but they were delicious with the creamy sour cream and nicely tart applesauce. The herring and house cured salmon were standard. We enjoyed the accompanying marinated beets which were slightly pickle-y. Not a fan of German bread because of that grainy texture. \n\nE N T R E E S\n*Jägerschnitzel: Unbreaded porkloin w/ spätzle, creamy mushroom sauce ($16): http://bit.ly/1HYQGSP\n*Kassler: Smoked pork chop w/ mashed potatoes, brussels sprouts ($18): http://bit.ly/1ScwCUT\n\nThe entrees are the star of Walzwerk's menu. Everybody loved their entrée. They're huge, hearty, and comforting. My Jägerschnitzel (unbreaded) was tender and showered in this sinfully delicious creamy mushroom sauce (great depth of flavor). The spätzle absorbed this yummy sauce which made it even more delightful to enjoy these tiny dumplings. Highly recommended! \n\nI had a bite of the Kassler which would satisfy any pork chop lover. The thick cut pork shop was surprisingly very tender and moist with a pronounced smokiness. \n\nD E S S E R T S\n*Apfelstrudel: Filo dough filled w/ apples, raisins, nuts & brandy, vanilla ice cream, whipped cream ($7): http://bit.ly/1SL4zH0\n*Weekly Special: Bread Pudding w/ caramel sauce, whipped cream ($7): http://bit.ly/1gju9qZ\n\nDesserts were disappointing which is why I'm rounding down my rating. The Apfelstrudel tasted like an undercooked apple pie. Didn't taste any flaky layers from the supposed filo dough and the apples were still hard.\n\nThe bread pudding was better than the Apfelstrudel but just ok. We also ordered the Rote Grütze Berry Pudding  (sorry, no pic) which I wouldn't recommend. The \"pudding\" was watery and very tart. \n\nIt was packed on a Saturday night and there were only two waitresses who rocked it. They were knowledgeable and quick on their feet. They also have their sh*t together in the kitchen as we got all our dishes very timely. \n\nI've been to Walzwerk before my Yelp days and it's just as good as I remembered it. Next time, I'm going to bring an ACME baguette to sop up all that mushroom gravy deliciousness from the Jägerschnitzel. Shhhh.....", "rating": 4, "date": "2015-07-28"}, {"excerpts": ["I ordered the kartoffelpuffer (small potato pancakes with chive sour cream and applesauce) and rinderroulade (tri-tip stuffed with bacon, pickles and mustard, spätzle and red cabbage).\n\n"], "author": "Daffodil L.", "review": "Awesome ambiance, fantastic service, and great concept, though food lagged a little behind expectation. \n\nThe interior feels very cozy and there's a small waiting area for you to relax with one of their many beer offerings. Even though the wait was long on a Saturday night, the waiters courteously made sure we weren't waiting on drink orders and kept us updated on progress.\n\nI ordered the kartoffelpuffer (small potato pancakes with chive sour cream and applesauce) and rinderroulade (tri-tip stuffed with bacon, pickles and mustard, spätzle and red cabbage).\n\nFirst the potato pancakes - loved the fresh chives on top and the slight char on the pancakes was perfect. Overall though, the pancakes were a little plain, and the apple sauce (which tasted like Motts) didn't enhance it for us. \n\nNow the tri-tip... . it sounded absolutely delicious, which made the disappointment much worse. The tri-tip itself was wonderfully tender (tasted slow-cooked), but the meat itself didn't have much flavor and relied heavily on an unmemorable sauce on top. The pickle was a soggy cucumber lacking acidic bite and crunch. The bacon-oh woe-didn't add anything but pork fat to the concoction. The spatzle... well, I like spatzle so it was okay. In general though, execution was just lacking. \n\nOverall loved the concept, but the flavors, unfortunately, just weren't there for me.", "rating": 3, "date": "2016-02-01"}, {"excerpts": ["I ordered the potato cakes (kleine Kartoffelpuffer), which were really good! ", "I also had the bacon-wrapped Thüringer Bratwurst filled with cheese (gefüllt mit Käse). ", "It was good, but I felt the sauerkraut was not on par and the potato tasted a lot different than potatoes I had in Germany. ", "/"], "author": "Kelley L.", "review": "Ambiance: 4 stars\nFood: 4 stars\nService: 4 stars\n\nWalzwerk pays homage to East Berlin's unique culture. I really liked there were books too, in addition to the very East Berlin furnture. The waitresses also speak German, which is pretty awesome because I have not had anyone to speak German with since I moved back to the States.\n\nI lived in Berlin, so I really appreciated the atmosphere of the restaurant as well as all the art. I was a bit disappointed with the beer selection because there were not many options. I had the Spaten Märzen, which was good, but I wish there was Paulaner because I really miss that!\n\nThe menu is not as large as other German restaurants because most German food people think of comes from Bavaria (Bayern) and not Berlin. I ordered the potato cakes (kleine Kartoffelpuffer), which were really good! I also had the bacon-wrapped Thüringer Bratwurst filled with cheese (gefüllt mit Käse). It was good, but I felt the sauerkraut was not on par and the potato tasted a lot different than potatoes I had in Germany. /: However, the Spätzle was really yummy.\n\nThe waitress was really nice and attended to us when we needed the attention. It was really refreshing to come to a German restaurant in SF where there was more focus on the food than the beer selection. Finally, a great German restaurant in SF! I would love to come back here again.", "rating": 4, "date": "2013-02-16"}, {"excerpts": ["The kartoffelpuffer (potato pancakes) were delicious, the Kassler (pork chop and mash potatoes with brussel sprouts) was made just right and tender and the vegetarisch schnitzel was very good.  "], "author": "Tony M.", "review": "My friend who is visiting from Germany and I came here last nite for the first time and we enjoyed everything about the place. The owners here are so friendly and welcoming.  We would definitely come back.  It is authentic East German food and my friend and I loved it.  The kartoffelpuffer (potato pancakes) were delicious, the Kassler (pork chop and mash potatoes with brussel sprouts) was made just right and tender and the vegetarisch schnitzel was very good.  We shared the kalter hund and it was a simple yet very satisfying dessert. \nDanke Sehr!", "rating": 5, "date": "2016-02-17"}, {"excerpts": ["We had the Kartoffelpuffer, die Kartoffelsuppe, der Schnitzel vom schwein, salmon. "], "author": "CeeLo L.", "review": "Love the decor, and the food was awesome! I like that they had a decent list of Austrian wines to choose from as well.  Only downsides were that the service was a bit slow and we didn't get the correct dessert that we had ordered, but everything else was so great, we didn't mind so much.\n\nWe had the Kartoffelpuffer, die Kartoffelsuppe, der Schnitzel vom schwein, salmon. Apfelstruddel and Kalter Hund. YUM!!\n\nLooking forward to going back soon*", "rating": 5, "date": "2015-07-27"}, {"excerpts": ["We tried the Kartoffelpuffer, Kartoffelsuppe, salad, Jagerschnitzel, and the Schnitzel vom Huhn. ", "Everything was VERY good. ", "They also have a good selection of German beers, wines, and spirits. ", "Our waitress was attentive, knowledgable, and very nice. ", "We will definitely come back again."], "author": "Rob L.", "review": "This place is GREAT. The food and the service are excellent. We tried the Kartoffelpuffer, Kartoffelsuppe, salad, Jagerschnitzel, and the Schnitzel vom Huhn. Everything was VERY good. They also have a good selection of German beers, wines, and spirits. Our waitress was attentive, knowledgable, and very nice. We will definitely come back again.", "rating": 4, "date": "2015-07-19"}, {"excerpts": ["The kartoffelpuffer needed a bit more crispness - the thickness made it a bit too soft for my taste. "], "author": "Spoon G.", "review": "Walzwerk is a good solid restaurant, but I wish the food quality was just a bit better. I think that Suppenkuche outshines Walzwerk on the food, but I like the homey atmosphere here.\n\nWe ordered the Diesel (Coke and Beer), herring salad, pork schnitzel in a mushroom sauce with spaetzle, with the kartofelpuffer.\n\nThe kartoffelpuffer needed a bit more crispness - the thickness made it a bit too soft for my taste. The spaetzle were a bit too dried out, maybe overcooked in the oven?\n\nThe service was very friendly and the meal was satisfying and filling. The portions are pretty big so you can consider sharing a dish.", "rating": 3, "date": "2008-06-03"}, {"excerpts": ["Absolutely everything was phenomenal, including the very tasty Kartoffelpuffer appetizer and the Thueringer Salad. ", "Add the great selection of tasty draft beers and the friendly service (this despite the fact that the place was packed to the rafters), this dinner is one for the record books. ", "I am definitely coming back and bringing friends who are looking for an authentic German dining experience."], "author": "B A.", "review": "I am originally from Austria and even know how to cook a few original Viennese dishes (like Wiener Schnitzel), so I am generally a pretty discerning customer when it comes to German or Austrian food.\nAfter dining at the Walzwerk last Saturday with two friends, I can honestly say that this is some of the best German / Austrian food I have EVER had. Between the three of us we tried the Sauerbraten, Jaegerschnitzel, and Goulash. \nAbsolutely everything was phenomenal, including the very tasty Kartoffelpuffer appetizer and the Thueringer Salad. Add the great selection of tasty draft beers and the friendly service (this despite the fact that the place was packed to the rafters), this dinner is one for the record books. I am definitely coming back and bringing friends who are looking for an authentic German dining experience.", "rating": 5, "date": "2008-01-13"}, {"excerpts": ["We started with the kartoffelpuffer (potato pancakes) which were quite good, with applesauce and sour cream. ", "Haven't had that much since I was in Germany 4 years ago, so I was quite happy if you can imagine. ", "Dishes, I ordered the kaesespaetzle, which was much better than the ones at other German restaurants in the area. ", "Honestly felt like this was quite authentic, with German servers and German people as part of the restaurants patrons. ", "This is a place I would probably recommend to my German relatives, I think they would feel at home, sort of. ", "To top off dessert was the rote gruetze, which I have never seen at any other German restaurant (also introduced to me in Germany of course... ", "many many years ago). ", "I don't quite remember the taste of it from Germany "], "author": "Yosie G.", "review": "Loved this restaurant. Tucked away on the edge of the Mission (about a block away from 16th Str Bart) the decor very much reminded me of the film \"Goodbye Lenin\" (which I loved btw). It's not so big, and people do make reservations, also not so good for large parties (max of 6 people really).\n\nGood selection of German beer on tap, some bottle selections as well. I had the Franziskaner (hef), surprisingly our server told me \"I thought you might like that one\" to which I replied yes and laughed. Not sure if I give off a \"I want Franziskaner\" aura or something. We started with the kartoffelpuffer (potato pancakes) which were quite good, with applesauce and sour cream. Haven't had that much since I was in Germany 4 years ago, so I was quite happy if you can imagine. Dishes, I ordered the kaesespaetzle, which was much better than the ones at other German restaurants in the area. Honestly felt like this was quite authentic, with German servers and German people as part of the restaurants patrons. This is a place I would probably recommend to my German relatives, I think they would feel at home, sort of. To top off dessert was the rote gruetze, which I have never seen at any other German restaurant (also introduced to me in Germany of course... many many years ago). I don't quite remember the taste of it from Germany but I thought it was not so bad at the restaurant.\n\nOverall service was not so bad as some people say, there were basically 2 servers and one lady who brought out some food and took away plates and cleaned tables but didn't take your order (she was the American). Cost is ok, maybe a little on the high end, but you don't come by authentic German food very often, so I let my wallet take a hit...", "rating": 5, "date": "2008-03-21"}], "matjes hering": [{"excerpts": ["Matjes Hering comes along with beer, as well as German style cold cuts delicatessen.\n", "Entree: "], "author": "Sergey G.", "review": "TL;DR It's not a fancy place, but food is great!\n\nGreat place for someone who wants to experience authentic yet surprisingly familiar food in low key but stylish place.\nBeer: Opt for German on tap - either light or dark lager (I had both :)\nAppetizers: Matjes Hering comes along with beer, as well as German style cold cuts delicatessen.\nEntree: Pork schnitzel was great, and Rinderroulade even better (a bit sweet garnish).\nNote: Dishes come in full size and priced well in-line with food quality.\nService: casual, polite and attentive.\n\nDanke schön!", "rating": 4, "date": "2018-07-16"}, {"excerpts": ["Best creamed herring (Matjes Hering) ", "I may have ever have had the pleasure of consuming, along with some delicious spatzle with house-smoked salmon and a fresh veg slaw from the specials menu. "], "author": "Anna L.", "review": "1st time here. Small location, but got seats at the bar right away (Thursday night 6pm, with a German Film Fest happening down the street). Delightful, authentic, hole-in-the-wall East German setting + food. \nBest creamed herring (Matjes Hering) I may have ever have had the pleasure of consuming, along with some delicious spatzle with house-smoked salmon and a fresh veg slaw from the specials menu. Husband also very much enjoyed his beef entree (a special version of the Sauerbraten, I think), but said he would have found it excellent had he swapped his baby redskins for spatzle --seriously, it's really, really good spatzle. Lovely owners/staff, also very good German beer on draft. \nMy only regret was having to eat so quickly to get to a class, rather than getting to linger, enjoying a few more drinks and savoring each bite. Absolutely will return!", "rating": 5, "date": "2016-01-15"}], "hausgebeizter lachs": [], "thüringer salat": [], "grüner salat": [], "bratwurst thüringer art": [{"excerpts": ["very tasty\nbratwurst thüringer art - delicious, but only comes with 1 pork & veal sausage which is quite expensive considering "], "author": "Edward W.", "review": "Had a reservation ahead of time for 5. The restaurant is small, cozy, and noisy. I loved the ambiance as it reminded me of the time I was in Germany. \n\nOrdered the following items:\nhefeweizen draft beer - 0.5L, tasty and worth it.\npotato soup with sausage - thick potato base with a sausage. very tasty\nbratwurst thüringer art - delicious, but only comes with 1 pork & veal sausage which is quite expensive considering the kassler and rinderroulade are only $1 and $2 respectively more expensive.\nkassler -  smoked pork chop looks like a big piece of ham, but tastes like pork chop and has a smoky flavor to it. mashed potatoes seems to be the go to starch for German dishes.\nrinderroulade - tri-tip stuffed with bacon was so flavorful. the spätzle was also delicious and not too doughy. \napfelstrudel - a bit too sweet for my liking, but well made.\nkalter hund - layered cake made of butter cookies, chocolate and rum. This was a very unique tasting dessert, dense yet airy at the same time. It is certainly worth a try.\n\nThe service here is quick and attentive. I'm definitely coming back for some authentic German food.", "rating": 4, "date": "2016-02-17"}], "schnitzel vom schwein": [{"excerpts": ["We took his dad here who was visiting from Berlin and we went full throttle on ordering several dishes: the uber crispy kartoffelpuffer with chive sour cream and applesauce, schnitzel vom schwein (breaded porkloin with mashed potatoes and veggies), grilled pork and veal bratwurst and the rinderroulade.  ", "Both men had their eyes rolling at the back of their heads while making MMM!! ", "sounds. ", "They took spoonful after spoonful of creamy mash potatoes and stuffed it into their mouths. ", "I felt proud ordering the Rinderroulade ", ":) ", "My fiance's grandma would make this rich dish in the height of the summer when I visit and ", "it's seriously, the best combination of flavors you'll put in your mouth. ", "The melt in your mouth tri-tip is stuffed with bacon, the delightful crunch of the pickles and tangyness of the mustard. ", "It is soft, crunchy, savory and overall, a wonderful concoction that'll make your belly very happy. "], "author": "Janice C.", "review": "Winter is coming. \n\nTo which you should reply: \"Ein Bier bitteschön!\"\n\nThe night air outside might be chilly, but you're sitting in the warm insides of Walzwerk. After downing a cold Franziskaner, settle in and notice your surroundings. It feels very ... industrial doesn't it? with Marx, Engels and Lenin staring back at you, you'll probably feel out of place and maybe a bit uncomfortable. \n\nGood. Because, when you travel outside of the comforts of your (foodie) home, you should feel like that. In fact, having a dinner at Walzwerk feels like you've traveled back in time to East Germany and that's what owner Christiane is hoping for. \n\nMy Berlin born fiance attests to the authenticity of this place. It is as East German as you can get. We took his dad here who was visiting from Berlin and we went full throttle on ordering several dishes: the uber crispy kartoffelpuffer with chive sour cream and applesauce, schnitzel vom schwein (breaded porkloin with mashed potatoes and veggies), grilled pork and veal bratwurst and the rinderroulade.  Both men had their eyes rolling at the back of their heads while making MMM!! sounds. They took spoonful after spoonful of creamy mash potatoes and stuffed it into their mouths. The MMMeats were all traditionally and expertly prepared. \n\nI felt proud ordering the Rinderroulade :) My fiance's grandma would make this rich dish in the height of the summer when I visit and it's seriously, the best combination of flavors you'll put in your mouth. The melt in your mouth tri-tip is stuffed with bacon, the delightful crunch of the pickles and tangyness of the mustard. It is soft, crunchy, savory and overall, a wonderful concoction that'll make your belly very happy. Try it. \n\nI'm so fortunate to have Walzwerk in SF. This is Eastern German cuisine done right.", "rating": 5, "date": "2016-12-04"}, {"excerpts": ["I ordered the schnitzel vom schwein and was served a large portion of a breaded, pork cutlet.\n", "The accompanying mashed potatoes were creamy and tasty.  ", "The pork was very good too.\n"], "author": "Thomas D.", "review": "Service was wunderbar.  Both of our servers were great at explaining the dishes and making everyone feel welcome at this starkly appointed replica of the former East Germany.\nFrom the unadorned light bulbs overhead, to the chipped enamel tables set against dimly painted yellow walls, we felt as if we walked into a time warp of the former Soviet-era.\n\nBoth the mood and tone were quite inviting and relaxed.  It's as if you walked into someone's home and sat down for a realistic, home cooked German meal.  I don't think there were 10 tables in the small dining room.\n\nThe beer selection is pretty cool and exciting.  We were steered to the bottled Gaffel Kölsch and the draft Weltenburg Helles.  They were delicious!!  German beer---love it!\n\nA small appetizer was immediately brought to the table.  It was made up of thinly sliced, small square bread bottoms with cucumber, sliced radish, sour cream, cheese and a little piece of bratwurst on top.  I was expecting more flavor but didn't get it.\n\nThe kartoffelpuffer came next.  We shared these potato pancakes served with a side of sour cream and applesauce.  They were dense and plain tasting--the applesauce was the better choice to kick up the flavor.\n\nI ordered the schnitzel vom schwein and was served a large portion of a breaded, pork cutlet.\nThe accompanying mashed potatoes were creamy and tasty.  The pork was very good too.\nThe side vegetables were a fresh mix of squash, carrots and brussel sprouts.\n\nMy partner had the hühnerbrust gefüllt mit äpfeln und speck.  This rolled chicken breast was stuffed with bacon, apples and raisins and covered in a white gravy.  What looked like it should offer a-- \"wow\"--- in flavor,  just didn't bring that much taste.  The accompanying sides were the same as above.  Again, outstanding mashed potatoes.\n\nI'm sorry, but the apfelstrudel dissapointed.  The dough was heavy and rubbery.  I had a hard time getting through it with my fork.  Apple strudels that I have had in the past were crisp, crunchy and full of flavor.  This was not.\n\nWe may have played it safe with the dishes we ordered.  Next time we visit, I'd like to experiment with their cabbage and sausage dishes and search for more flavor.\n\nAll in all, it was a nice experience and we are so lucky to have all of these choices in SF.", "rating": 3, "date": "2015-10-25"}, {"excerpts": ["- Schnitzel vom schwein (breaded pork loin with mashed potatoes and vegetables, including Brussels sprouts). ", "Daughter reported the mashed potatoes were very tasty, and the pork looked really good too (to me!). \n", "- Kassler (smoked pork chop with mashed potatoes and Brussels sprouts). ", "The pork chop was very tender and perfectly cooked. "], "author": "June W.", "review": "Had dinner here tonight (Friday). Came in around 5:40, so they'd just opened, and we were the first ones there. We got seats at the front, by the windows. Welcoming staff (owners, right?). Great decor, nice DDR touches.\n\nNice complimentary bites to start with. We had the great grapefruit beer everyone has been raving about in their Yelp reviews - yep, it is pretty good!\n\nFor entrees, we had:\n\n- Jagerschnitzel (unbreaded pork loin with spaetzle, and mushroom sauce). My entrree. Wow, so good. The spaetzle had a nice crust/crunch on them, so they had a nice firmness along with the soft. Mushrooms and sauce were very tasty, as was the pork.\n- Schnitzel vom schwein (breaded pork loin with mashed potatoes and vegetables, including Brussels sprouts). Daughter reported the mashed potatoes were very tasty, and the pork looked really good too (to me!). \n- Kassler (smoked pork chop with mashed potatoes and Brussels sprouts). The pork chop was very tender and perfectly cooked. Husband also liked the potatoes very much.\n\nWe had for dessert:\n\n- Kalter Hund (\"cold dog\" - great name) - layered cake with butter cookies, chocolate and rum, served with a little sauce on the side. This was delicious. These types of cakes can be dry, which is why I usually stay away from these, but this was very good, not at all dry.\n- Rote Gruze - this was a red berry pudding with raspberries, strawberries and blueberries, made with cream of wheat (!) and vanilla sauce. I was a bit worried with a dessert made with Cream of Wheat, but it was actually very good. Wasn't sure what to think of the texture (a bit grainy), but we enjoyed it very much.\n\nDefinitely a good choice for dinner tonight, and will be back!", "rating": 5, "date": "2017-07-14"}, {"excerpts": ["We had the Kartoffelpuffer, die Kartoffelsuppe, der Schnitzel vom schwein, salmon. "], "author": "CeeLo L.", "review": "Love the decor, and the food was awesome! I like that they had a decent list of Austrian wines to choose from as well.  Only downsides were that the service was a bit slow and we didn't get the correct dessert that we had ordered, but everything else was so great, we didn't mind so much.\n\nWe had the Kartoffelpuffer, die Kartoffelsuppe, der Schnitzel vom schwein, salmon. Apfelstruddel and Kalter Hund. YUM!!\n\nLooking forward to going back soon*", "rating": 5, "date": "2015-07-27"}, {"excerpts": ["Mein Date (not sure if this is the German word for date) hat das Schnitzel vom Schwein ", "mit Gemüse der Saison und Kartoffelbrei bestellt; es schmeckt auch gut. ", "Also, ich habe vor dem Restaurant einen Parkplatz gefunden. "], "author": "Evelyn C.", "review": "I shall attempt writing this review in German (please forgive grammatical mistakes). English translation will be in second paragraph. \n\nDieses Restaurant ist klein aber sehr charmant, und das Essen war sehr lecker. Unsere Kellnerin war eine Amerikanerin und sprach kein Deutsch, aber sie war sehr hilfreich und nett. Ich habe die Lammkoteletts  und ein Schwazbier bestellt. Mein Date (not sure if this is the German word for date) hat das Schnitzel vom Schwein mit Gemüse der Saison und Kartoffelbrei bestellt; es schmeckt auch gut. Also, ich habe vor dem Restaurant einen Parkplatz gefunden. Yay!\n\nThe place is small and charming, and the food was really good. Our waitress was really helpful and nice. I had ordered the lamb chops and a dark beer, both which I found tasty, but the lamb may be a tad on the gamey side for people who aren't a huge fan of lamb. Date ordered the schnitzel, which was also really good. \n\nAlso, I found parking right outside the restaurant, so parking shouldn't be an issue (it was a weeknight though, so not sure about weekends).\n\nEdit 7/30/2013: Must order the cheese späztle. It's like mac n cheese times 10. Sie müssen die Käsespätzle bestellen. Lecker lecker!", "rating": 4, "date": "2013-01-29"}], "schnitzel vom huhn": [{"excerpts": ["For the entree I ordered the schnitzel vom huhn (chicken breast breaded, boiled potatoes and cucumber salad, but replaced boiled potatoes with mashed potatoes) and my boyfriend ordered the jägerschnitzel (porkloin with spätzle and creamy mushroom sauce). ", "I really like the balance of the creamy mashed potatoes with the fried chicken breast. ", "The chicken breast was juicy and tender. ", "The creamy mushroom sauce was really good. ", "I don't remember much of how the porkloin tasted. "], "author": "Michelle T.", "review": "Started off with kartoffelpuffer (small potato pancakes with chive sour cream and applesauce). It was good with the chive sour cream and weird with the applesauce. There wasn't enough chives in the sour cream to taste the chives, so it just tasted like regular sour cream. \n\nFor the entree I ordered the schnitzel vom huhn (chicken breast breaded, boiled potatoes and cucumber salad, but replaced boiled potatoes with mashed potatoes) and my boyfriend ordered the jägerschnitzel (porkloin with spätzle and creamy mushroom sauce). I really like the balance of the creamy mashed potatoes with the fried chicken breast. The chicken breast was juicy and tender. The creamy mushroom sauce was really good. I don't remember much of how the porkloin tasted. The highlight of that dish was definitely the sauce. \n\nBoth entrees were really heavy and because of that I think one entree can be shared with two people.", "rating": 3, "date": "2017-07-18"}, {"excerpts": ["There are all the familiar dishes and I was in the mood for the Schnitzel vom Huhn--most people might expect a large pizza sized Schnitzel.  ", "I like the nice golden brown exterior and moist chicken.  ", "The Schnitzel is served with moist rosemary potatoes and nicely vinegary uber thin cucumber slices.  ", "The meal was completely satisfying and I like the East German approach a style different than say a Bavarian cuisine style.  "], "author": "Jaime Patricio M.", "review": "Outstanding place for East German Food.  I am glad San Francisco has German food -- I remember when it was a rare thing.  Now San Francisco has great options.  Just coming back from Berlin I had a hankering for German food and I know that Walzwerk specialises in East German cuisine --I was simply overdue for a visit.  There are all the familiar dishes and I was in the mood for the Schnitzel vom Huhn--most people might expect a large pizza sized Schnitzel.  I like the nice golden brown exterior and moist chicken.  The Schnitzel is served with moist rosemary potatoes and nicely vinegary uber thin cucumber slices.  The meal was completely satisfying and I like the East German approach a style different than say a Bavarian cuisine style.  I love the East German style-- very homey and absolutely delicious.  \n\nI absolutely love the interior design--all DDR inspired--I was seating below Marx, Engels and Lenin and above the door is a picture of Erich Honecker the omni present General Secretary of the Central Committee of the Socialist Unity Party of Germany in his well known 1976 headshot.   Even the salt and pepper shakers are from the DDR period and I took photos of everything on the wall--most cool!  \n\nThe service was attentive and I liked the menu offering, the beer selection is everything I needed to get my fix of Berlin and East German beers.  I am so glad there is a place like Walzwerk that is nearby to enjoy outstanding East German food.  \n\nLoved the experience.", "rating": 5, "date": "2016-07-17"}, {"excerpts": ["We tried the Kartoffelpuffer, Kartoffelsuppe, salad, Jagerschnitzel, and the Schnitzel vom Huhn. ", "Everything was VERY good. ", "They also have a good selection of German beers, wines, and spirits. ", "Our waitress was attentive, knowledgable, and very nice. ", "We will definitely come back again."], "author": "Rob L.", "review": "This place is GREAT. The food and the service are excellent. We tried the Kartoffelpuffer, Kartoffelsuppe, salad, Jagerschnitzel, and the Schnitzel vom Huhn. Everything was VERY good. They also have a good selection of German beers, wines, and spirits. Our waitress was attentive, knowledgable, and very nice. We will definitely come back again.", "rating": 4, "date": "2015-07-19"}], "jäger schnitzel vom schwein": [], "kassler vom grill": [{"excerpts": ["I recommend getting the Kassler vom Grill (smoked pork chop bone in, mashed potatoes & brussels sprouts). ", "It was so tender and flavorful. ", "It was perfect! ", ":)"], "author": "David T.", "review": "What a great place! The staff was very friendly and welcoming (and hilarious).\n\nThe food was fantastic! I recommend getting the Kassler vom Grill (smoked pork chop bone in, mashed potatoes & brussels sprouts). It was so tender and flavorful. It was perfect! :)", "rating": 4, "date": "2017-10-23"}], "hühnerbrust gefüllt mit äpfeln und speck": [{"excerpts": ["My partner had the hühnerbrust gefüllt mit äpfeln und speck.  ", "This rolled chicken breast was stuffed with bacon, apples and raisins and covered in a white gravy.  ", "What looked like it should offer a-- \"wow\"--- in flavor,  ", "just didn't bring that much taste.  ", "The accompanying sides were the same as above.  "], "author": "Thomas D.", "review": "Service was wunderbar.  Both of our servers were great at explaining the dishes and making everyone feel welcome at this starkly appointed replica of the former East Germany.\nFrom the unadorned light bulbs overhead, to the chipped enamel tables set against dimly painted yellow walls, we felt as if we walked into a time warp of the former Soviet-era.\n\nBoth the mood and tone were quite inviting and relaxed.  It's as if you walked into someone's home and sat down for a realistic, home cooked German meal.  I don't think there were 10 tables in the small dining room.\n\nThe beer selection is pretty cool and exciting.  We were steered to the bottled Gaffel Kölsch and the draft Weltenburg Helles.  They were delicious!!  German beer---love it!\n\nA small appetizer was immediately brought to the table.  It was made up of thinly sliced, small square bread bottoms with cucumber, sliced radish, sour cream, cheese and a little piece of bratwurst on top.  I was expecting more flavor but didn't get it.\n\nThe kartoffelpuffer came next.  We shared these potato pancakes served with a side of sour cream and applesauce.  They were dense and plain tasting--the applesauce was the better choice to kick up the flavor.\n\nI ordered the schnitzel vom schwein and was served a large portion of a breaded, pork cutlet.\nThe accompanying mashed potatoes were creamy and tasty.  The pork was very good too.\nThe side vegetables were a fresh mix of squash, carrots and brussel sprouts.\n\nMy partner had the hühnerbrust gefüllt mit äpfeln und speck.  This rolled chicken breast was stuffed with bacon, apples and raisins and covered in a white gravy.  What looked like it should offer a-- \"wow\"--- in flavor,  just didn't bring that much taste.  The accompanying sides were the same as above.  Again, outstanding mashed potatoes.\n\nI'm sorry, but the apfelstrudel dissapointed.  The dough was heavy and rubbery.  I had a hard time getting through it with my fork.  Apple strudels that I have had in the past were crisp, crunchy and full of flavor.  This was not.\n\nWe may have played it safe with the dishes we ordered.  Next time we visit, I'd like to experiment with their cabbage and sausage dishes and search for more flavor.\n\nAll in all, it was a nice experience and we are so lucky to have all of these choices in SF.", "rating": 3, "date": "2015-10-25"}], "rinderroulade": [{"excerpts": ["We took his dad here who was visiting from Berlin and we went full throttle on ordering several dishes: the uber crispy kartoffelpuffer with chive sour cream and applesauce, schnitzel vom schwein (breaded porkloin with mashed potatoes and veggies), grilled pork and veal bratwurst and the rinderroulade.  ", "Both men had their eyes rolling at the back of their heads while making MMM!! ", "sounds. ", "They took spoonful after spoonful of creamy mash potatoes and stuffed it into their mouths. ", "I felt proud ordering the Rinderroulade ", ":) ", "My fiance's grandma would make this rich dish in the height of the summer when I visit and ", "it's seriously, the best combination of flavors you'll put in your mouth. ", "The melt in your mouth tri-tip is stuffed with bacon, the delightful crunch of the pickles and tangyness of the mustard. ", "It is soft, crunchy, savory and overall, a wonderful concoction that'll make your belly very happy. "], "author": "Janice C.", "review": "Winter is coming. \n\nTo which you should reply: \"Ein Bier bitteschön!\"\n\nThe night air outside might be chilly, but you're sitting in the warm insides of Walzwerk. After downing a cold Franziskaner, settle in and notice your surroundings. It feels very ... industrial doesn't it? with Marx, Engels and Lenin staring back at you, you'll probably feel out of place and maybe a bit uncomfortable. \n\nGood. Because, when you travel outside of the comforts of your (foodie) home, you should feel like that. In fact, having a dinner at Walzwerk feels like you've traveled back in time to East Germany and that's what owner Christiane is hoping for. \n\nMy Berlin born fiance attests to the authenticity of this place. It is as East German as you can get. We took his dad here who was visiting from Berlin and we went full throttle on ordering several dishes: the uber crispy kartoffelpuffer with chive sour cream and applesauce, schnitzel vom schwein (breaded porkloin with mashed potatoes and veggies), grilled pork and veal bratwurst and the rinderroulade.  Both men had their eyes rolling at the back of their heads while making MMM!! sounds. They took spoonful after spoonful of creamy mash potatoes and stuffed it into their mouths. The MMMeats were all traditionally and expertly prepared. \n\nI felt proud ordering the Rinderroulade :) My fiance's grandma would make this rich dish in the height of the summer when I visit and it's seriously, the best combination of flavors you'll put in your mouth. The melt in your mouth tri-tip is stuffed with bacon, the delightful crunch of the pickles and tangyness of the mustard. It is soft, crunchy, savory and overall, a wonderful concoction that'll make your belly very happy. Try it. \n\nI'm so fortunate to have Walzwerk in SF. This is Eastern German cuisine done right.", "rating": 5, "date": "2016-12-04"}, {"excerpts": ["Pork schnitzel was great, and Rinderroulade even better (a bit sweet garnish).\n", "Note: Dishes come in full size and priced well in-line with food quality.\n"], "author": "Sergey G.", "review": "TL;DR It's not a fancy place, but food is great!\n\nGreat place for someone who wants to experience authentic yet surprisingly familiar food in low key but stylish place.\nBeer: Opt for German on tap - either light or dark lager (I had both :)\nAppetizers: Matjes Hering comes along with beer, as well as German style cold cuts delicatessen.\nEntree: Pork schnitzel was great, and Rinderroulade even better (a bit sweet garnish).\nNote: Dishes come in full size and priced well in-line with food quality.\nService: casual, polite and attentive.\n\nDanke schön!", "rating": 4, "date": "2018-07-16"}, {"excerpts": ["The rinderroulade, sauerbraten, vegetarische krautroulade, and jägerschnitzel are delicious!\n\n"], "author": "Michael B.", "review": "One of my favorite secret spots in San Francisco. The food, service and ambiance are excellent; it's like dining at someone's home.\n\nThe rinderroulade, sauerbraten, vegetarische krautroulade, and jägerschnitzel are delicious!\n\nI've only been a few times, so I'm really going to have change that.", "rating": 4, "date": "2017-09-22"}, {"excerpts": ["the kassler and rinderroulade are only $1 and $2 respectively more expensive.\n", "kassler -  smoked pork chop looks like a big piece of ham, but tastes like pork chop and has a smoky flavor to it. ", "mashed potatoes seems to be the go to starch for German dishes.\n", "rinderroulade - tri-tip stuffed with bacon was so flavorful. ", "the spätzle was also delicious and not too doughy. \n"], "author": "Edward W.", "review": "Had a reservation ahead of time for 5. The restaurant is small, cozy, and noisy. I loved the ambiance as it reminded me of the time I was in Germany. \n\nOrdered the following items:\nhefeweizen draft beer - 0.5L, tasty and worth it.\npotato soup with sausage - thick potato base with a sausage. very tasty\nbratwurst thüringer art - delicious, but only comes with 1 pork & veal sausage which is quite expensive considering the kassler and rinderroulade are only $1 and $2 respectively more expensive.\nkassler -  smoked pork chop looks like a big piece of ham, but tastes like pork chop and has a smoky flavor to it. mashed potatoes seems to be the go to starch for German dishes.\nrinderroulade - tri-tip stuffed with bacon was so flavorful. the spätzle was also delicious and not too doughy. \napfelstrudel - a bit too sweet for my liking, but well made.\nkalter hund - layered cake made of butter cookies, chocolate and rum. This was a very unique tasting dessert, dense yet airy at the same time. It is certainly worth a try.\n\nThe service here is quick and attentive. I'm definitely coming back for some authentic German food.", "rating": 4, "date": "2016-02-17"}, {"excerpts": ["I ordered the kartoffelpuffer (small potato pancakes with chive sour cream and applesauce) and rinderroulade (tri-tip stuffed with bacon, pickles and mustard, spätzle and red cabbage).\n\n"], "author": "Daffodil L.", "review": "Awesome ambiance, fantastic service, and great concept, though food lagged a little behind expectation. \n\nThe interior feels very cozy and there's a small waiting area for you to relax with one of their many beer offerings. Even though the wait was long on a Saturday night, the waiters courteously made sure we weren't waiting on drink orders and kept us updated on progress.\n\nI ordered the kartoffelpuffer (small potato pancakes with chive sour cream and applesauce) and rinderroulade (tri-tip stuffed with bacon, pickles and mustard, spätzle and red cabbage).\n\nFirst the potato pancakes - loved the fresh chives on top and the slight char on the pancakes was perfect. Overall though, the pancakes were a little plain, and the apple sauce (which tasted like Motts) didn't enhance it for us. \n\nNow the tri-tip... . it sounded absolutely delicious, which made the disappointment much worse. The tri-tip itself was wonderfully tender (tasted slow-cooked), but the meat itself didn't have much flavor and relied heavily on an unmemorable sauce on top. The pickle was a soggy cucumber lacking acidic bite and crunch. The bacon-oh woe-didn't add anything but pork fat to the concoction. The spatzle... well, I like spatzle so it was okay. In general though, execution was just lacking. \n\nOverall loved the concept, but the flavors, unfortunately, just weren't there for me.", "rating": 3, "date": "2016-02-01"}, {"excerpts": ["HIGHLY recommend the rinderroulade ($19) which is tri-tip beef stuffed with bacon, pickles, and mustard, with spätzle and red cabbage on the side. ", "The beef was soooo tender - it reminded me of the meat that crumbles off a perfectly cooked rack of ribs. ", "The ingredients wrapped inside the beef, along with the delicious sauce drizzled on top, made the dish hearty, unique, and just soo delicious!"], "author": "Jeffrey Z.", "review": "Much better environment than Suppenkuche! While Suppenkuche is super loud with communal seating, Walzwerk is decidedly quieter and has individual seating, allowing both privacy and the ability to carry a proper conversation.\n\nHIGHLY recommend the rinderroulade ($19) which is tri-tip beef stuffed with bacon, pickles, and mustard, with spätzle and red cabbage on the side. The beef was soooo tender - it reminded me of the meat that crumbles off a perfectly cooked rack of ribs. The ingredients wrapped inside the beef, along with the delicious sauce drizzled on top, made the dish hearty, unique, and just soo delicious!", "rating": 4, "date": "2016-02-22"}, {"excerpts": ["For an entree, I had rinderroulade (tri-tip stuffed with bacon, pickles and mustard, spätzle and red cabbage). ", "The meat was tinder and served in a red gravy. ", "The spätzle was a perfect side, more interesting and flavorful than potatoes. "], "author": "Rob P.", "review": "If you're in the mood for some unique, flavorful food in a quirky, comfortable setting, this is the place. \n\nI started with the soljanka (tomato - cabbage soup with salami, bacon & pickles), which was tangy, and delicious, with just the right amount of meat to provide flavor without making the dish too heavy. I've never had tomato soup that included a slice of lemon. But it really melded the flavors together. \n\nFor an entree, I had rinderroulade (tri-tip stuffed with bacon, pickles and mustard, spätzle and red cabbage). The meat was tinder and served in a red gravy. The spätzle was a perfect side, more interesting and flavorful than potatoes. And the cabbage provided just enough vinegary pizzazz to keep the dish interesting. \n\nThe rote grütze (red berry pudding - raspberries, strawberries & blueberries made with cream of wheat and vanilla sauce) was a fitting finale. The berry flavor was strong and refreshing. \n\nThe woman with the German accent who was serving us was very helpful and accommodating. She was obviously very proud of the food, and rightfully so. This is definitely a place I will go back to.", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["I thought about ordering vegetarian so we could share, but I had to try the rinderroulade.  ", "BEST THING EVER!  "], "author": "Elizabeth L.", "review": "We have been looking for a restaurant like this for about 10 years since our favorite spot changed on the peninsula.\n\nThe food is the quality of a five star restaurant -- prepared like my aunt used to cook -- She grew up in Germany and was the best cook ever -- or at least until tonight.\n\nOne problem that we have is that my husband is vegetarian, so it's uncomfortable to go to a place where there are one (or no) choices on the menu.  Walzwerk had three outstanding entree choices.  I thought about ordering vegetarian so we could share, but I had to try the rinderroulade.  BEST THING EVER!  Except my husband, who ordered the spatzle with cheese said HIS dinner was actually the best new thing in the world.\n\nWe looked around at the other food being served and can't wait to go back and try some of the things we saw.  \n\nI heard they filled up early, and I didn't want to be stuck in Friday traffic, so we made it a point to be there at 5:30 when the opened.  We were greeted with a buttered bread/cucumber/cheese/radish square that was divine.  \n\nThe servers were prompt and friendly - and the draft beer was cold and fresh.\n\nI finally found my culinary home!\n\nAnd the cold-war-era sign on the door saying we were leaving the American Sector reminded us of how fortunate we are to live in a place where we can afford this kind of experience and feel safe and cared for..", "rating": 5, "date": "2015-05-15"}, {"excerpts": ["My companions enjoyed their schnitzel and especially the rinderroulade. "], "author": "Melanie W.", "review": "Delicious comfort food, perfectly prepared. Best trout I have eaten anywhere served with mountains of scrumptious mashed potatoes and al dente vegetables. My companions enjoyed their schnitzel and especially the rinderroulade. Nice selection of German white wines complemented the food.\n\nAttentive service and cozy, homey ambiance. Generous portions are good value. I will return to this intimate, quiet spot to sample more dishes from the tempting menu. An authentic taste of Germany in the Mission district.", "rating": 5, "date": "2015-05-22"}, {"excerpts": ["The rinderroulade (Beef roulade) and the solianka soup were really good.  ", "The cold dog dessert was awesome too.  "], "author": "S C.", "review": "Oh - the food is really really good, and very authentic.  The rinderroulade (Beef roulade) and the solianka soup were really good.  The cold dog dessert was awesome too.  They have an ok selection of German beer.\n\nWhat is costing a star is the agonizingly slow service.  It took 40 minutes for a table, and what was worse - about 45 minutes for the food to come out after we were finally seated.  Hmm.... I would go for the food but try to get there as soon as they open...", "rating": 4, "date": "2009-09-13"}, {"excerpts": ["i had the rinderroulade with red cabbage and spätzle. ", "nom nom! ", "the spätzle was a bit dry, imho, though. ", "what memories it brought back! "], "author": "Jonathan K.", "review": "it was time yet again to choose a place in the city to eat, and, one year after moving back from two years in germany, it was definitely time to have some german food. \n\ni think i enjoyed this place more than my friends. the food tasted completely authentic, even the mashed potatoes! i had the rinderroulade with red cabbage and spätzle. nom nom! the spätzle was a bit dry, imho, though. what memories it brought back! add on an apfelschorle and the open-faced sandwich-y hors d'œuvre...perfect! \n\ni would have given it 5 stars but i don't think my friends were all that impressed--one said her chicken was too dry. \n\nslightly over-priced, but i'm totally willing to pay for it.\n\nif i'm in the city i'll totally go back again but i think speisekammer edges this place out (even though it doesn't have as much authenticity).", "rating": 4, "date": "2008-08-23"}], "sauerbraten": [{"excerpts": ["The sauerbraten is so delicious. ", "Really liked the stuffed cabbage too. ", "Love the atmosphere. ", "Feels like I'm back in Germany. ", "Service is great and beer list has just the right beers you need."], "author": "Helen C.", "review": "The sauerbraten is so delicious. Really liked the stuffed cabbage too. Love the atmosphere. Feels like I'm back in Germany. Service is great and beer list has just the right beers you need.", "rating": 5, "date": "2018-08-30"}, {"excerpts": ["The pork loin with mushroom gravy and spaetzle and Sauerbraten were both delicious! ", "Look forward to returning next time ", "I'm in the area"], "author": "Nicole J.", "review": "It felt like going to a German grandmother's house. The setting is cozy and casual. Service was prompt and polite. \n\nStart of with the potato pancakes :) \nThe pork loin with mushroom gravy and spaetzle and Sauerbraten were both delicious! Look forward to returning next time I'm in the area", "rating": 5, "date": "2018-05-19"}, {"excerpts": ["I chose Sauerbraten and it was excellent- ", "Sometimes it's a dish that somehow manages to be dry despite the sauce, and in this case it was perfectly done and the flavors were spot on.  ", "The bread dumplings were firm but not stodgy, and the red cabbage was well seasoned and had just the right amount of tooth.  ", "My colleagues had similarly excellent experiences with the Schnitzel dishes.  ", "While the food is hearty, and the portions exceedingly generous.  "], "author": "Jacques C.", "review": "I've just returned from an exquisite meal here.  I was with a group of two other musicians, and I sought the place out motivated by both a love of German fare and a desire to experience some Ostalgie.  The space is adorned with plenty of memorabilia from the DDR; The Ampelmännchen card on the restroom door was a particular favorite of mine.  \n\nWe were seated quickly, and our needs were well attended to.  The bier was excellent, and the food was well-executed.  Service was friendly without being obsequious.  \n\nI chose Sauerbraten and it was excellent- Sometimes it's a dish that somehow manages to be dry despite the sauce, and in this case it was perfectly done and the flavors were spot on.  The bread dumplings were firm but not stodgy, and the red cabbage was well seasoned and had just the right amount of tooth.  My colleagues had similarly excellent experiences with the Schnitzel dishes.  While the food is hearty, and the portions exceedingly generous.  I was able to leave without feeling unwell!  \n\nI regret that I didn't have desert. \n\nThis is a wonderful restaurant, and I will make it a point to return any time I am in the Bay Area.  While of would be helpful to have some experience with German cuisine before you go it is not essential.", "rating": 5, "date": "2018-04-08"}, {"excerpts": ["The rinderroulade, sauerbraten, vegetarische krautroulade, and jägerschnitzel are delicious!\n\n"], "author": "Michael B.", "review": "One of my favorite secret spots in San Francisco. The food, service and ambiance are excellent; it's like dining at someone's home.\n\nThe rinderroulade, sauerbraten, vegetarische krautroulade, and jägerschnitzel are delicious!\n\nI've only been a few times, so I'm really going to have change that.", "rating": 4, "date": "2017-09-22"}, {"excerpts": ["We ordered the Jaeger schnitzel, sauerbraten and the bratwurst entree, along wit the cold plate appetizer.\n", "Only the Sauerbraten was hot. \n \n", "After telling our waitress for the second time that our food came out cold, she yelled at me in front of all the guest and my family that she \"couldn't help me\" and even had the nerve to complain back to me for \"flagging\" her down to order beverage and food too many times.\n", "Isn't that your job??? \n", "I understand it's a busy night "], "author": "Monika V.", "review": "We ordered the Jaeger schnitzel, sauerbraten and the bratwurst entree, along wit the cold plate appetizer.\nFirst of all, the appetizer, the dark beer and the German red wine was good. \n\nInitially, when we walked in, there were only 2 other tables and the our waitress was pleasant to us. \nWell, unfortunately The food came out cold..which is always such a disappointment after waiting 30 minutes. There was only one server who was seating people and serving them simultaneously. By the time our food came out for the first time, the restaurant was packed. \nAfter we told our waitress that our food was cold, she picked it up, still pleasant, yet mumbled that it \"felt warm\" well, the second time the food came out, my Jaeger schnitzel and the mashed potatoes in the Bratwurst dish were still cold. Only the Sauerbraten was hot. \n \nAfter telling our waitress for the second time that our food came out cold, she yelled at me in front of all the guest and my family that she \"couldn't help me\" and even had the nerve to complain back to me for \"flagging\" her down to order beverage and food too many times.\nIsn't that your job??? \nI understand it's a busy night and it's not easy to serve everyone, but seriously her attitude was completely uncalled for and very unprofessional to say the least!\n\nMy husband was in complete shock and asked to leave.\nI left in tears as I was disrespected by the server in front of everyone! She then had the nerve to complain in German loudly about us in front of the guest by the bar, when we were just trying to pay for the food that we did not eat..\n\nUnfortunately, I can't review on the food, because we didn't have a chance to really taste it, but on the service side, I can say that it was a very VERY disturbing experience for me and my family that I did not expect!\n\nWe drove 2 hours to go there based on reviews and we will never go back.", "rating": 1, "date": "2018-03-17"}, {"excerpts": ["Entree #3 - Sauerbraten marinated beef, mushroom bread dumplings and red cabbage.  ", "Again, superbly cooked and plated.  "], "author": "Marla B.", "review": "5 Star from the moment we were seated until we left.  Haven't been here in about 3 or 4 years and it's still Fabulous.  Our server, Yahni (sp?) was delightful and she was super busy, taking orders, bussing tables, getting drinks, making change and she NEVER lost her zeal and provided impeccable service. As busy as she was she never faltered on attention to detail and giving us the time we needed to understand a few items on the menu.\n\nDrinks -  3 highly recommended dark, but light beers.\n\nAppetizer - A Special - Sautéed onion on a puff pastry with Sour Cream and a nicely dressed salad.\n\nEntree #1 - was actually 2 appetizers, small potato pancakes with chive sour cream and applesauce, 3 fluffy and not greasy pancakes and house cured salmon with horseradish cream, marinated beets and fitness bread, nicely plated and extremely fresh. My guest was supremely pleased.\n\nEntree #2 - Also a special, which was a Pork Shoulder stuffed with apples and possibly apricots and cheese (can't remember the type of cheese), it may have been ricotta, but not sure with a light gravy on top, served with roasted potatoes and really fresh and crispy green beans. After my 1st bite, I was in Heaven.  Everything was superbly cooked to perfection.\n\nEntree #3 - Sauerbraten marinated beef, mushroom bread dumplings and red cabbage.  Again, superbly cooked and plated.  Mushroom bread dumplings were fluffy and light and the red cabbage had the right amount of \"pickling\", also a winner with another guest.\n\nService was very attentive but not overbearing.\n\nNext up... yes... we still had a little room... Dessert.  The gal had overheard it was my Birthday so when she presented me with \"another special\" of the night a Rhubarb Tart, it came with a Well Wish Birthday Candle.  So sweet of her to remember.  Other party had the filo dough filled with apples, raisins, nuts & brandy, vanilla ice cream and whipped cream.  It didn't appear to be made with Filo dough as it was a lot thicker and not as flaky as I have remembered in the past, but it was still very good.  We all ordered our Ice Cream on the side, which was delicious and honestly seemed homemade.\n\nThe whole experience was exceptional, right down to the low key ambience. Very much like you would experience in East Germany.\n\nExtremely good value for the whole meal.", "rating": 5, "date": "2017-03-08"}, {"excerpts": ["The mashed potatoes are perfect for soaking up sauce, and the spaetzle and sauerbraten taste just like my dad's. ", "I'm not such a fan of dumplings ( never have been) ", "but friends who like dumplings seem to like these. ", "Pickled herring? ", "Yum. ", "House cured salmon? "], "author": "El B.", "review": "Years later and I still love this place. It's funky in a great way ( creative)  and has delicious comfort food.\n\n The jagerschnitzle, beef roulade and bratwurst are still among my favorite things to get when the dog bites or the bee stings. The mashed potatoes are perfect for soaking up sauce, and the spaetzle and sauerbraten taste just like my dad's. I'm not such a fan of dumplings ( never have been) but friends who like dumplings seem to like these. Pickled herring? Yum. House cured salmon? More yum.\n\nAnd then there's beer. Germans know their beer. Get what's on tap. Tell your server what you like and they'll bring you tastes of things and you will be super happy.\n\nPortions are huge, so if you know you're coming for dinner eat sparingly during the day...save your calories and appetite for Walzwek. \n\nSide Note: Skip dessert. It doesnt stand up to the meal and will leave you feeling let down. I am waiting for them to fix the dessert situation and then five stars. I actually rate my experiences 5 stars because I know not to get dessert, but when I'm out with friends they always insist ( ah my foolish friends who never listen to me.) And then the last thing discussed is the dessert issue and that is not the way to end a stellar meal....so four stars.", "rating": 4, "date": "2015-09-20"}, {"excerpts": ["(I ordered the sauerbraten and it was amazing) and super authentic (approved by a German guest). ", "Staff was super friendly and great service."], "author": "Lauren H.", "review": "This place was a delightful find! Food was delicious (I ordered the sauerbraten and it was amazing) and super authentic (approved by a German guest). Staff was super friendly and great service.", "rating": 5, "date": "2017-07-20"}, {"excerpts": ["Sauerbraten platter under the watchful eye\nof Karl Marx in a austere ambience with wonderful service, very worth it!!!"], "author": "Judith R.", "review": "Sauerbraten platter under the watchful eye\nof Karl Marx in a austere ambience with wonderful service, very worth it!!!", "rating": 5, "date": "2017-04-08"}, {"excerpts": ["do it, sauerbraten was well received."], "author": "Monika R.", "review": "I was really disturbed at the giant, respectful portraits of Marx and Lenin on the walls.  Dining under the serene gaze of mass murderers?  How can that be ok?  I guess it is supposed to contribute to the East German vibe but I must say I could not get past it.  I am a student of history.  It was disturbing to me, really off-putting.  I am surprised more reviewers don't mention it.  \n\nServers cool, decor fine, nice variety of food offering, spaetzle done in a dry style which is not my fave but a lot of restaurants do it, sauerbraten was well received.", "rating": 2, "date": "2016-08-22"}, {"excerpts": ["Ordered the sauerbraten with the cheese spatzle and red kraut. ", "Even though it sounds like a overly manly portion, it wasn't ", "so you won't be obesely full with no room for dessert. "], "author": "Earl G.", "review": "First of all, Walzwerk is East German, so it's a little bit different from the typical Germanic restaurants that go beer, brats, and lederhosen. \n \nThe crowd is late 20's to 30's, lighting is dim, decor is eclectic, and  the tables are picnic (perfect for small groups). (http://www.yelp.com/biz_photos/ISCijFt3uO4M7yzclSwEuw?select=_0QZGrg91aaiMhh7tQyYYg)\n\nWe were in the private back room area and adding authenticity to our ambiance was this group of hipster German girls that only spoke in German. I felt like a tourist in my own city. \n\nOrdered the sauerbraten with the cheese spatzle and red kraut. Even though it sounds like a overly manly portion, it wasn't so you won't be obesely full with no room for dessert. (http://www.yelp.com/biz_photos/ISCijFt3uO4M7yzclSwEuw?select=eYPbJOCcu8f7XNCZLQN0XQ)\n\nThe \"cold dog\" layer cake made with cookies was sehr gut, or very good for you English readers.  \n\nWhat's interesting is that they have beer mixers, so it's half beer and half coke or 7up. Seeing that, I ordered ordered the kristall weizen hoping it would be Cristal and beer mixed together but unfortunately it was not. The location of this place gives enough street cred.", "rating": 4, "date": "2010-03-13"}, {"excerpts": ["We ordered the jager schnitzel and sauerbraten.  ", "Both of the dishes were good although I think I liked the jager schnitzel more because of the mushroom sauce it was sitting in.  ", "The sauerbraten came with red cabbage which was really tasty and the meat was super tender.  \n\n"], "author": "Shirley T.", "review": "The meal at Walzwerk was my first authentic German food experience.  I'd have to say that the restaurant has a very homey/mama's-place decor.  \n\nWe ordered the jager schnitzel and sauerbraten.  Both of the dishes were good although I think I liked the jager schnitzel more because of the mushroom sauce it was sitting in.  The sauerbraten came with red cabbage which was really tasty and the meat was super tender.  \n\nVery filling meal and great portions.  I am quite disappointed that I did not get to have any German beer with my meal, but all in all It was a satisfying meal.  I can't say that I love German food, but it wasn't bad for my first time trying.", "rating": 3, "date": "2014-06-13"}, {"excerpts": ["Both the sauerbraten and the beef roulade were't quite as tender or flavorful as they'd been previously, but they were still very enjoyable.\n\n"], "author": "Amy D.", "review": "You'll never leave Walzwerk (or any German restaurant really) hungry. A recent visit wasn't quite up to earlier standards but it's still probably the best German food in SF.\n\nThe herring appetizer is fantastic - the pumpernickel bread is a great contrast with the pickled fish. Both the sauerbraten and the beef roulade were't quite as tender or flavorful as they'd been previously, but they were still very enjoyable.\n\nWe're still trying to work out how to have enough room left at the end to try the cold dog!\n\nWe consider 2 stars to be an average restaurant so Walzwerk is still highly recommended - just not quite as good on this occasion as in the past.", "rating": 4, "date": "2012-05-20"}, {"excerpts": ["and she had the beef sauerbraten and a crepe special for desert. ", "All if it was so good and the service was also on point. ", "The portions are substantial and seem really reasonable for modern day San Francisco. ", "The giant plate of Jagerschnitzel was only $16 which I hear is the average price of toast around town these days. ", "My only complaint is that I was so full afterwards that I went home and immediately passed out from food coma."], "author": "Wes W.", "review": "Myself and my better half enjoyed our recent Saturday night meal at Walzwerk. I had the Jagerschnitzel and she had the beef sauerbraten and a crepe special for desert. All if it was so good and the service was also on point. The portions are substantial and seem really reasonable for modern day San Francisco. The giant plate of Jagerschnitzel was only $16 which I hear is the average price of toast around town these days. My only complaint is that I was so full afterwards that I went home and immediately passed out from food coma.", "rating": 5, "date": "2016-01-17"}, {"excerpts": ["We ordered a pretty good assortment of appetizers and the Sauerbraten and Jagerschnitzel as mains.  ", "I had the tomato cabbage soup and thought it was pretty good and something different.  ", "The Sauerbraten was good and the beef was pretty tender.  ", "It came with some good potato dumplings and some red cabbage.  "], "author": "Scott L.", "review": "We went here based on Yelp reviews and with a restaurant.com certificate.  We called to make reservations and were told they didn't have anything until later in the evening, but if we came in they could probably get us in.  We took a chance and went.  When we arrived we were told the only place they could get us in was the back room.  We asked if there was a difference and we were shown the room.  Other than being a little more sparsely decorated and having some plain tables it wasn't bad.\n\nWe placed our drink order and looked over the menus.  They have a decent beer selection, with some difficult to find here choices.  Our beers came first and the others came later.  We ordered a pretty good assortment of appetizers and the Sauerbraten and Jagerschnitzel as mains.  I had the tomato cabbage soup and thought it was pretty good and something different.  The Sauerbraten was good and the beef was pretty tender.  It came with some good potato dumplings and some red cabbage.  The Jagerschnitzel was also pretty good and came with Spatzle and cabbage.\n\nWalzwerk wasn't exactly cheap even with the restaurant.com certificate, but I think it wasn't unreasonable given the food.  My favorite German place in SF is still Suppenkuche, but I'd gladly eat at Walzwerk again sometime.", "rating": 4, "date": "2012-03-14"}, {"excerpts": ["Husband also very much enjoyed his beef entree (a special version of the Sauerbraten, I think), but said he would have found it excellent ", "had he swapped his baby redskins for spatzle ", "--seriously", ", it's really, really good spatzle. ", "Lovely owners/staff, also very good German beer on draft. \n", "My only regret was having to eat so quickly to get to a class, rather than getting to linger, enjoying a few more drinks and savoring each bite. ", "Absolutely will return!"], "author": "Anna L.", "review": "1st time here. Small location, but got seats at the bar right away (Thursday night 6pm, with a German Film Fest happening down the street). Delightful, authentic, hole-in-the-wall East German setting + food. \nBest creamed herring (Matjes Hering) I may have ever have had the pleasure of consuming, along with some delicious spatzle with house-smoked salmon and a fresh veg slaw from the specials menu. Husband also very much enjoyed his beef entree (a special version of the Sauerbraten, I think), but said he would have found it excellent had he swapped his baby redskins for spatzle --seriously, it's really, really good spatzle. Lovely owners/staff, also very good German beer on draft. \nMy only regret was having to eat so quickly to get to a class, rather than getting to linger, enjoying a few more drinks and savoring each bite. Absolutely will return!", "rating": 5, "date": "2016-01-15"}, {"excerpts": ["Where else can you get spaetzle and sauerbraten? ", "Yum, yum, yum."], "author": "Lineka D.", "review": "I love German food, and I love this restaurant. Where else can you get spaetzle and sauerbraten? Yum, yum, yum.", "rating": 5, "date": "2016-11-21"}, {"excerpts": ["Sauerbraten (Marinated Beef) with Potato Dumplings and Braised Red Cabbage: Pretty tasty, Beef tenderized and moist. "], "author": "Janice T.", "review": "Everything (food and beer) was tasty. And place was cozy and casual. \n\nWent with party of 10 and surprise, they take reservations and have small private room in the back. I think that's really good for dinner parties. \n\nSchnitzel (Breaded Porkloin) with Mashed Potatoes & Seasonal Vegetables: Not bad. Pork breaded well and pork was tender. However, it was a little dry towards the end even with the lemon. I am not going to complain too much about it since it was a big piece and it was fried. So overall, this dish was good.\n\nJäger Schnitzel (Porkloin) with Spätzle and Creamy Mushrooom Sauce: Very saucy and tasty. Definitely, if you are not looking for something fried, order this. I was very impressed how soft their pork loin came out to be.\n\nGrilled Thüringer Bratwurst served with Mashed Potatoes & Sauerkraut: I think I was expecting a bigger piece of Bratwurst, but what came out was a longer version of the American Breakfast Sausage. I am willing to re-try, but it wouldn't be on top of my list.\n\nGarlic Roast Pork with Potatoes and Vegetables: Conflicting! My husband's and other party attendee's pork dish was tender and done perfectly. However, other dinner party attendee said his pork was dry. And from what I could see. It was truly rock hard dry. So chances are 33% totally dry and 66% chance of moist pork. I guess if it is a bit dry, you might want to tell the waitress. It is suppose to be tender and moist. What happen? Too long off the stove?\n\nSauerbraten (Marinated Beef) with Potato Dumplings and Braised Red Cabbage: Pretty tasty, Beef tenderized and moist. I defintely would like to go and try a full dish of this.\n\nOverall, this place has a nice family casual dining feel. People are super nice there and the whole feel of the place just works for it. I definitely recommend trying this place. The place, the food, and the beer-It just works!!!", "rating": 4, "date": "2011-04-18"}, {"excerpts": ["I had the Sauerbraten (braised beef) with red cabbage and potato dumplings. ", "While I didn't really care for the dumplings, the beef and cabbage were amazing! ", "This paired perfectly with light amber beer (forgot name) that I ordered. "], "author": "E M.", "review": "I went there with three friends on a Thursday Night. Made reservations, quickly seated by a very nice/cool server. She offered great suggestions and was very helpful with our beer selections. \n\nI had the Sauerbraten (braised beef) with red cabbage and potato dumplings. While I didn't really care for the dumplings, the beef and cabbage were amazing! This paired perfectly with light amber beer (forgot name) that I ordered. Come hungry, because the portions are huge. \n\nThe other big hit at our table was the awesome potato pancakes as an appetizer and the Jager Schniztel (porkloing with creamy mushroom sauce). OMG! that dish was so rich and creamy with perfectly cooked loin. \n\nOverall, an awesome place for excellent comfort style food (bring appetite), great selection of beer, and good service. \n\nI will definitely be back!", "rating": 5, "date": "2013-08-02"}, {"excerpts": ["SAUERBRATEN (MARINATED BEEF) "], "author": "Gourmet Princessa L.", "review": "GOT GERMAN FOOD? YA! AND IT'S DELICIOUS MINUS THE PLANE RIDE! \n\nThanks to the lack of communication by Schmidt's closure for private event on Sunday evening, we came to Walzwerk instead and had a great German dinner. By far, the best German food I had in SF.\n\nWe walked in with no reservation and the place was packed on a Sunday night at 8pm. We got lucky as a table just opened up and we got seated immediately. There were 3 of us so we decided to order everythign to share family style. We ordered:\n\n1. SMALL POTATO PANCAKES WITH CHIVE SOUR CREAM AND APPLESAUCE. \n\nWOW! Best potato pancakes I've ever had. The outter layer is crispy, but in the inside is creamy and fluffy. The chive sour cream is a great match and it really brings out the flavor of the potatoes. \n\n2. SOLJANKA (TOMATO - CABAGE SOUP WITH SALAMI, BACON & \nPICKLES)\n\nI ordered this because I love soup. This is a little too sour for my taste bud, but friends and family know that I can't really take anything too sour. But the broth is very hearty, very flavorful. It has a strong tomatoes flavors and the salami and bacons are salty, which makes the soup so appetizing. \n\nWe ordered 3 entrees and shared them family style:\n\n3. GRILLED THÜRINGER BRATWURST SERVED WITH MASHED POTATOES & SAUERKRAUT\n\nWow! I love Bratwurst and this one is dynamite. The sausage casing is seared to crispy and so flavorful. The meat mixture is great. Mashed potatoes are so creamy and the sauerkraut is nicely marinated, but still retained a good slightly crunchy texture of the cabbage. If you haven't have fresh sauerkraut (no, not the bottled stuff you get from the supermarket for your BBQ dogs), you have to try these sauerkraut. You will never eat the bottled stuff ever again. \n\n4. SAUERBRATEN (MARINATED BEEF) WITH POTATO DUMPLINGS AND BRAISED RED CABBAGE\n\nI thought this dish was only ok for me mainly because it was a little sour, but the beef slices were very tender and you can cut it with a folk. It has great flavors and the sauce is very hearty. The potato dumplings (German's version of the Italian's gnocchi) were so fluffy and covered in creamy sauce. \n\n5. SCHNITZEL (BREADED PORKLOIN) WITH MASHED POTATOES & \nSTEWED GREEN BEANS\n\nThe Schnitzel (German version of the Japanese tontatsu or pork cutlet) has a very thin breading on the outside layer, but fried to perfect golden brown and crispy and the meat is still moist on the inside. The green beans were heavenly. \n\n6. APPLE STRUDEL WITH VANILLA ICE CREAM\n\nGreat puff pastry and the stuffing was apples, some nuts and I think raisins? It was all good and came out nice and hot.\n\nTotal bill $120 for the 3 of us including tax and tips for all the food above, 3 beers and 2 apple scholes (really delicious apple juice). Not bad at all and more importantly we all had a great meal and our half German friend really enjoyed his dinner. Everything was well made, very authentic (yes, we speak from experience of dining in Germany) and our server, Francis was super nice and very helpful when it comes to helping us decide on which beer to order from their very extensive all German beer menu. \n\nThe moral of my story is -- sometimes a backup plan can turn out to be better than the original plan. \n\nYes, we'll be back definitely. Danke!", "rating": 4, "date": "2010-09-10"}, {"excerpts": ["The erdinger was a perfect match with my sauerbraten which, as other yelpers have pointed out, wasn't so sauer, but was still a rare treat for a germanophile such as myself. "], "author": "Scott S.", "review": "Came here with a party of six for a friend's birthday. First of all, everything about this place screams \"East Germany\" from the moment you enter the restaurant even to the very last moment where you shut the door behind you; the instant you set foot into the restaurant you'll be surrounded by rustic post-war propaganda posters from around the DDR, and also by your standard hof-style wooden \"picnic\" tables and homey seatings... \n\nOn to the food and brew: as usual I was the first to arrive, so while waiting for my fellow diners to arrive, I decided to start the night off right with an erdinger kristallweizen. The erdinger was a perfect match with my sauerbraten which, as other yelpers have pointed out, wasn't so sauer, but was still a rare treat for a germanophile such as myself. The highlight of my dish wasn't the braten itself but the potato dumplings--I wish I could order a whole bucket of these and swim in a bathtub full of them. \n\nMy second pair-up of the evening was the draft radeberger (the only other place I've seen that has this outside of Germany was this awesome German Pub in the Chaoyang district in Beijing and Suppenküche) and a piece of Jägerschnitzel I stole from the fellow diner to the right--the creamy mushroom sauce and the radeberger literally coagulated into some yummy fluid  sensation in my mouth, which put me into a 5-minute mini food coma.\n\nThis restaurant really deserves five stars, but the nature of Eastern German cuisine sorta takes away that last star; even though the food (and beer) at Walzwerk is awesome, you're basically paying top-dollar for really good comfort food.", "rating": 4, "date": "2010-12-09"}, {"excerpts": ["Other classics like the jäger schnitzel and sauerbraten are some of my favorites. ", "Be sure to finish your night with an Underberg,  and get a round for the gals too, they earned it."], "author": "john s.", "review": "Seriously great. I've been here several times and it blows my mind that two gals can keep a jamming front of the house rolling every time. Last time I was there we used a Bloomspot on the last night of the coupon, I have no problem paying full price here, and as a result there was a bit of a wait, but a wait with beer it is hardly that. Some people were being turned away because they didn't plan ahead, so don't let any of those reviews sway you because I'm sure they are out there.\nTwo words: pickled herring, every time a must. Once we had some leftover and I woke the next morning excited to eat it. Other classics like the jäger schnitzel and sauerbraten are some of my favorites. Be sure to finish your night with an Underberg,  and get a round for the gals too, they earned it.", "rating": 5, "date": "2013-02-28"}, {"excerpts": ["Jäger Schnitzel\nSauerbraten \nBreast of Chicken stuffed with Apples & Bacon\nBeef Roulade"], "author": "I B.", "review": "Awesome food! Any food I tried :)\n\nWe had lots of food.. some that I recall:\n\nSmall Potato Pancakes with Chive Sour Cream and Applesauce\nJäger Schnitzel\nSauerbraten \nBreast of Chicken stuffed with Apples & Bacon\nBeef Roulade", "rating": 4, "date": "2012-09-13"}, {"excerpts": ["The herring is not to be missed and the sauerbraten is sooo delicious. ", "Great job on the red cabbage too! ", "Server was really competent and super pleasant."], "author": "Mary M.", "review": "This place is amazing! Best German food I have ever enjoyed! The herring is not to be missed and the sauerbraten is sooo delicious. Great job on the red cabbage too! Server was really competent and super pleasant.", "rating": 5, "date": "2015-12-01"}, {"excerpts": ["The entree was Sauerbraten (Marinated Beef) with Potato Dumplings and Braised Red Cabbage.  "], "author": "Dale N.", "review": "First visit...\n\nAuthentic German food..great selection.  Be prepared to wait\nif you go on a weekend unless you have a party of four or more\nand then you can make reservations.\n\nGo for the food (after all, isn't that what this is all about?)...not\nfor the ambiance.  The place certainly has old world flavor and\ncuisine with authentic knickknacks and decorations but it is on \nthe small side and rather noisy.\n\nGreat waitstaff.  Taking in account how busy they were, they did\na great job.  Plan on making this the highlight of your evening instead\nof just a dinner before a movie or a show.  I started with a bowl of\nthe nightly soup special, a butter squash cream.  Very large bowl..\nhot and tasty.  I had the potato pancakes with sour cream as an\nappetizer...very good.  The entree was Sauerbraten (Marinated Beef) with Potato Dumplings and Braised Red Cabbage.  I appreciated that\nthe different courses were served in a timely manner and not all\nstacked up together.\n\nBottom line.. I will return!!", "rating": 4, "date": "2009-01-04"}, {"excerpts": ["I had the sauerbraten as the main course -- the sauce is a bit too sour for me, but I loved the red cabbage. ", "I kinda regretted my choice when I saw the mister's jägerschnitzel! "], "author": "Alice C.", "review": "Just walked in with a couple of friends. It has a very German atmosphere (big sturdy tables, flimsy chairs, small interior), and the hostess/waiter both speak German.\n\nFood was great -- we had a matjes herring appetizer, and it was fantastic. Sour but very tasty, great to start off the meal. I had the sauerbraten as the main course -- the sauce is a bit too sour for me, but I loved the red cabbage. I kinda regretted my choice when I saw the mister's jägerschnitzel! It was lathered in a rich mushroom cream sauce and he really liked it.\n\nGooseberry cake is the dessert. The gooseberries, meh, a bit funky, but personally I don't like them very much to begin with. The cake more than made up for it. It's not too sweet, just hit the right spot, like how European sweets are supposed to be, and it's served with a *non-sweetened* whipped cream! Nice! If you have the American kind of sweet tooth (i.e. you like loads of sugar), the desserts here might not be for you.\n\nOf course, they have German beer there, and they serve it by the half litre like they do in Europe :)\n\nThis is definitely a gem in a otherwise sketchy neighbourhood.", "rating": 4, "date": "2009-10-18"}, {"excerpts": ["After more Pilsners and I decided to stay with generic-German food by ordering Sauerbraten with potato dumplings and braised red cabbage. ", "If you're a vegan, go home. ", "This marinated beef was spicier than what I expected from Erich Hanocker's Deutsche Demokratische Republik, or GDR or East Germany. ", "Potato dumpling and red cabbage squirted their juices well (with flavorful combination) in my mouth. ", "I'm not versed enough to compare tasty squirts of this Sauerbraten against say, the Rhineland or Swabbian versions, but who cares? "], "author": "Reyz A.", "review": "I didn't know that a restaurant with an East German motif could serve such tasty food. My friend and I went there (he was originally from Hamburg) and I was expecting to be fed heaping portions of glutonous-pork/potato-based hauptgang and washed down with some Dresden Radeberger Pilsner. My expectations were correct, but it was flavorful-- but bring a sleeping bag to have a nap in after such a big meal. \n\nI started with the small tasty potato pancakes because I was hungry. Wrong move with the Raderberger, because now I'm starting to get filled. After more Pilsners and I decided to stay with generic-German food by ordering Sauerbraten with potato dumplings and braised red cabbage. If you're a vegan, go home. This marinated beef was spicier than what I expected from Erich Hanocker's Deutsche Demokratische Republik, or GDR or East Germany. Potato dumpling and red cabbage squirted their juices well (with flavorful combination) in my mouth. I'm not versed enough to compare tasty squirts of this Sauerbraten against say, the Rhineland or Swabbian versions, but who cares? Hefeweizen bitte!! \n\nOh yeah, did I mention GDR? Yes, the place does look like a stoic cafeteria fit for your finest people's machinists. I have to admit that after a few rounds of Hefeweizen, Wallenburg and more Radeberger, the wall portraits of Marx, Engles and other protectors of workers' paradise started to talk to this capitalist. I'm not sure I saw Lenin's portrait (he was my favorite Beatle, or is that Lenon?), but the food and beer will compel me to come back.", "rating": 4, "date": "2011-01-05"}, {"excerpts": ["I had the Sauerbraten (Marinated Beef) with Potato Dumplings and Braised Red Cabbage. ", "It was delicious. ", "All of us were happy with our food selections. ", "I had a hefe here to drink and it was the best hefe I have ever drunk! ", "So tasty! ", "They also had interesting drinks, part soda and part beer. ", "We were not trying to be that authentic lol. ", "It was a little pricy but worth it, I am glad we went!"], "author": "Brigid P.", "review": "I went here with friends when visiting SF and really enjoyed it. It is a small eatery and pretty plainly decorated (but it is in East German theme so fitting). I had the Sauerbraten (Marinated Beef) with Potato Dumplings and Braised Red Cabbage. It was delicious. All of us were happy with our food selections. I had a hefe here to drink and it was the best hefe I have ever drunk! So tasty! They also had interesting drinks, part soda and part beer. We were not trying to be that authentic lol. It was a little pricy but worth it, I am glad we went!", "rating": 5, "date": "2011-06-27"}, {"excerpts": ["I had the sauerbraten (marinated beef) with potato dumplings and braised red cabbage, which was pretty good, if not spectacular.  ", "A friend had the beef roulade (tri-tip stuffed with bacon, pickles, mustard & onions), which sounded like a meal and half (and it was).  ", "It was like a baby turducken - layers upon layers of meat attack until you surrender and/or pack it up to resume the battle later.  "], "author": "jon y.", "review": "I came here twice, both times with a party of three, both times with a $50 gift certificate (thanks, Restaurant.com!).  As expected, each time we came out fuller than we ought to have been.\n\nPersonally, I enjoyed the appetizers more than the main courses.  I really liked the pickled herring, which, by the way, I had no idea was a thing.  It tasted...kind of exactly how I expect pickled fish to taste.  I also loved the tomato-cabbage soup...perfectly sour and yes, appetizing.  The potato pancakes were good, but nothing special.\n\nI had the sauerbraten (marinated beef) with potato dumplings and braised red cabbage, which was pretty good, if not spectacular.  A friend had the beef roulade (tri-tip stuffed with bacon, pickles, mustard & onions), which sounded like a meal and half (and it was).  It was like a baby turducken - layers upon layers of meat attack until you surrender and/or pack it up to resume the battle later.  The schnitzel (breaded porkloin) tasted kind of like Japanese tonkatsu - take that how you will.\n\nBoth times I've come to this place, it's been really full.  They have a tiny waiting area, and it can get a little cramped in there.  However, this is nothing a few good German beers on tap cannot cure.\n\nThree stars because when it comes down to it, I don't think I would return if I don't have a gift certificate for this place.  It's good, but not amazing.", "rating": 3, "date": "2011-01-28"}, {"excerpts": ["We enjoyed the Sauerbraten (beef) with potato dumplings and red cabbage. ", "And Schnitzel (breaded fried pork) with potatoes & steamed vegetables. ", "The Sauerbraten ($18) is as the word suggests = sour. ", "Hence, very appetizing. ", "The potato dumplings are unique! ", "Its not the texture of a whole-boiled potato. ", "But rather, a little more chewy and flavorful. "], "author": "Pancakes D.", "review": "Awesome little place! Stepping into this restaurant is like walking across the threshold into Germany! The atmosphere was very inviting and the servers made sure we felt comfortable throughout! \n\nWe enjoyed the Sauerbraten (beef) with potato dumplings and red cabbage. And Schnitzel (breaded fried pork) with potatoes & steamed vegetables. Both were GOOD HEARTY COUNTRY STYLE MEALS.\n\nThe Sauerbraten ($18) is as the word suggests = sour. Hence, very appetizing. The potato dumplings are unique! Its not the texture of a whole-boiled potato. But rather, a little more chewy and flavorful. I believe there was bread incorporated in there. \n\nThe Schnitzel ($16) was good. I liked that it was not too dry as meat tend to be, when fried. It was nicely moist and tender. Cold German beer ($6) to wash all the GOOD STUFF down! Excellent!\n\nFinally, we shared a nice little dessert- Red Berry Pudding ($6) which is FANTASTIC. Soft, creamy texture of berries enveloping your taste buds and you would wish this meal never ends.  \n\nA fantastic experience if you would like to dine in charming Germany, minus the crazy-airfare.", "rating": 4, "date": "2011-08-30"}, {"excerpts": ["For the entree I had the Sauerbraten and tried the Roulade - both were tasty and the dumplings were different than I have had before. ", "Potato vs bread based. "], "author": "Angelito R.", "review": "I had a good experience here. I have eaten at all the German restaurants in the city and I would rank this pretty high.\n\nI had the herring appetizer. I find that actual germans/austrians don't like this - but I love it. I buy from the grocery store to eat at  home... although I am neither german nor austrian.\n\nFor the entree I had the Sauerbraten and tried the Roulade - both were tasty and the dumplings were different than I have had before. Potato vs bread based. The spetzle served with the Roulade was fantastic.\n\nOne thing to note - the place is not big and they will only seat your party at the appropriately sized table. That is if you are a party of two - don't expect to be seated even if you see a big table free - because it is meant for a party of 4... saw this happen to a couple of people, but they did not seem to mind.", "rating": 4, "date": "2009-04-16"}, {"excerpts": ["I cannot ever get enough Sauerbraten (roasted beef with dumplings and red cabbage).  ", "We also got the schnitzel with Spaetzle.  ", "Oh Spaetzle.  ", "You are so delicious.  "], "author": "Sean H.", "review": "Having only been to Suppenkuche (and loving it) I had been meaning to try Walzwurk, which is much closer to my house, for some authentic German food (and beer).  Finally did, and I am sad it took me so long.  It's a pretty cozy place, but has a very cool Eastern German feel inside.  We were lucky to grab an immediate seat at the bar on a Saturday night before the people started rolling in and were subsequently told there would be a long wait.  \n\nGreat German beers on tap (Schwarzbier ,mmmm), and oh the food.  I cannot ever get enough Sauerbraten (roasted beef with dumplings and red cabbage).  We also got the schnitzel with Spaetzle.  Oh Spaetzle.  You are so delicious.  Such good food, great beer, good service, and since it was pouring rain outside, a pretty ideal spot to be to stay warm and dry.  \n\nLoved Walzwurk and we will definitely be back.", "rating": 5, "date": "2011-03-20"}, {"excerpts": ["I ordered the SAUERBRATEN, which was really flavorful at first, but then became more and more difficult to eat because it was WAY to sweet for an entree.  ", "My cousin ordered the JAGER SCHNITZEL, which was covered in a delicious creamy mushroom sauce.  ", "I would come back and order the jager schnitzel.  \n", "We had a restaurant.com coupon that we presented before ordering, but they forgot to apply it to our check, which caused for a lot of confusion.  ", "We had to remind them of it and ask for the revised check.  ", "Not too happy about that...."], "author": "rose h.", "review": "I ordered the SAUERBRATEN, which was really flavorful at first, but then became more and more difficult to eat because it was WAY to sweet for an entree.  My cousin ordered the JAGER SCHNITZEL, which was covered in a delicious creamy mushroom sauce.  I would come back and order the jager schnitzel.  \nWe had a restaurant.com coupon that we presented before ordering, but they forgot to apply it to our check, which caused for a lot of confusion.  We had to remind them of it and ask for the revised check.  Not too happy about that....", "rating": 3, "date": "2011-08-28"}, {"excerpts": ["We ordered the potato cakes, schnitzel, the sauerbraten, garlic roast pork, and an apple strudel. ", "Must disagree with my fellow Yelpers here and say the schnitzel was my least favorite of the three. ", "It was dry and tasted a bit like Katsu. ", "The garlic roast pork on the other hand was sooo good! ", "Very tender and juicy. ", "The potato cakes also lived up to its hype. ", "As others have said, it's German comfort food "], "author": "Anita W.", "review": "Took a friend here for her birthday and we were a small party. We ordered the potato cakes, schnitzel, the sauerbraten, garlic roast pork, and an apple strudel. Must disagree with my fellow Yelpers here and say the schnitzel was my least favorite of the three. It was dry and tasted a bit like Katsu. The garlic roast pork on the other hand was sooo good! Very tender and juicy. The potato cakes also lived up to its hype. As others have said, it's German comfort food and I could've easily mistaken this kind of food to be something from a cafe if I didn't purposely search Yelp for this. \n\nOk so I only wanted the strudel after watching Inglorious Basterds. Unfortunately it didn't come with a nice cold glass of milk, but it had ice cream on the side. Eh good enough I guess. It tasted like a pastry and had different kinds of nuts in it. \n\nMy only complaint is that the food took kind of long to get to us, not sure if it was because there was a party of 8 ahead of us, but thank goodness we had each others' company so we hardly noticed it. \n\nI would come back again.", "rating": 4, "date": "2010-03-31"}, {"excerpts": ["Three friends and shared schnitzel, sauerbraten, stuffed chicken breast, and bratwurst.  ", "All were outstanding.  ", "I don't know how they prepare the mashed potatoes, but they were the best I've ever had.  "], "author": "Marcello L.", "review": "Best restaurant experience I've had in my US travels all summer.  The food was delicious.  Three friends and shared schnitzel, sauerbraten, stuffed chicken breast, and bratwurst.  All were outstanding.  I don't know how they prepare the mashed potatoes, but they were the best I've ever had.  The sauerkraut and another cabbage dish were incredible.\n\nWe actually started with the cold cut plate and potato pancakes, both of which were excellent.  For dessert, we shared the cold dog (layered chocolate cake with butter cookies) and schockoladenvanillapudding (not how it's spelled; I just can't remember), a wonderful chocolate pudding with vanilla sauce).\n\nThis was well worth the 20 to 30-min. wait.  The staff was so attentive and playful.  Two of the servers chatted with us when the rush died down.  They were both very friendly and fun.\n\nDid I mention the amazing sauerkraut?  I'll be hitting this place whenever I visit the City from now on!", "rating": 5, "date": "2011-07-18"}, {"excerpts": ["Sauerbraten\n\nApple Strudel with Ciao Bella Vanilla Ice Cream for dessert\n\n"], "author": "Thomas O.", "review": "I love this find in the City.  The food is very good and the beer is even better!  They import all of their beer from Germany and I am told that only a couple places on the west coast carry the beers they carry.  There is one beer I think it was called Schwarzbier.  It is very dark, almost black in color.  The bartender explained something about fire roasting the malt until it is dark.  This dark malt give the beer a hint of a coffee flavor.  I am not all too knowledgeable in beer processes, so some of this may be slightly wrong... but freaking drink it and you slowly decide you really don't care how it gets into your glass, just as long as it gets there!! \nThe food I have tried and really like are:\n\nPotato Pancake appetizers (awesome with the applesauce believe it or not)\n\nJäger Schnitzel (and no... there is no Jägermeister in it... at least I don't think.  I had a lot of beer, so who can tell, right?)\n\nSauerbraten\n\nApple Strudel with Ciao Bella Vanilla Ice Cream for dessert\n\nThere was one dinner item that I was not fond of and it was the Beef Roulade.  It is made with tri-tip and I just felt that the tri-tip was not a good choice of meat to roast.  I like my tri-tip cooked or grilled like a steak at medium rare.  It's worth a shot, though if you like well done tri-tip.", "rating": 4, "date": "2010-03-17"}, {"excerpts": ["The potato pancakes were delicious, the beet soup a touch salty for my taste, the sauerbraten and schnitzel were both good.  ", "The ice tea is rosehip, not black, and was very tasty.  ", "Food plus beer definitely has a soporific effect which is not bad at all on a chilly fall night, especially if the stumbling distance between table and bed is not too far."], "author": "Jane F.", "review": "I happened upon this place by happy accident.  I had intended to go to another German place somewhere around Folsom and 20th (I think?) but didn't know the name, so after a quick Yelp consult I assumed this was my intended destination and moseyed over.\n\nThis place deserves 5 stars for ambience.  From the street (cold, windy, industrial, even a touch desolate), Walzwerk offers a glimpse through its windows of muted light, frothy amber beers and abundant plates.  Inside, the 6 or 7 tables were full so we sat at the tiny bar to wait with a brew, peruse the bilingual menu and take in the decor - mostly kitsch.  The European staff are casual and relaxed - sometimes a little inattentive, but very friendly and I was so charmed by the ambience I didn't mind waiting.  There is nothing pretentious or even hip about Walzwerk.  It didn't even feel much like San Francisco - and certainly not the Mission.\n\nThe food was solid, both in quality and in nature.  The potato pancakes were delicious, the beet soup a touch salty for my taste, the sauerbraten and schnitzel were both good.  The ice tea is rosehip, not black, and was very tasty.  Food plus beer definitely has a soporific effect which is not bad at all on a chilly fall night, especially if the stumbling distance between table and bed is not too far.", "rating": 4, "date": "2010-11-20"}, {"excerpts": ["The food was great - highly recommend the Sauerbraten and the potato pancakes.  "], "author": "Josh B.", "review": "Had a great birthday dinner here a couple weeks ago.  Had a group of 10 people so we got the back room to ourselves which was perfect since we were probably fairly loud and would have been annoying to any other nearby diners. \n\nThe food was great - highly recommend the Sauerbraten and the potato pancakes.  Contrary to some other reviews - we also had good service and no issues with waiting for seating. \n\nAlso highly recommend a round of Underberg post-dinner to kick-off the digestion.  It's basically the German version of Fernet, but it didn't seem to make everyone cringe as much as Fernet does.", "rating": 5, "date": "2010-06-27"}, {"excerpts": ["Food: I ordered the Sauerbraten (basically marinated beef or a pot roast-esque dish) which comes with potato dumplings and red cabbage. ", "The beef was tasty but the potato dumplings were bland or strangely seasoned because it did not go well with the beef. ", "The red cabbage was ok. ", "My date had their special that night: bacon wrapped Hefeweizen bratwurst with a cheese filling. ", "The sides were mashed potatoes and sauerkraut. "], "author": "Klaus t.", "review": "Good place for some authentic German fare and beers. \n\nFood: I ordered the Sauerbraten (basically marinated beef or a pot roast-esque dish) which comes with potato dumplings and red cabbage. The beef was tasty but the potato dumplings were bland or strangely seasoned because it did not go well with the beef. The red cabbage was ok. My date had their special that night: bacon wrapped Hefeweizen bratwurst with a cheese filling. The sides were mashed potatoes and sauerkraut. He said his dish was great.\n\nService: Our waitress completely forgot to put in our order!! You could tell she was the only one working the small restaurant but we had been waiting long enough to watch another table seated at the same time as us finish their food. She also didn't bother to come back to fill our glasses or ask how we were doing. Also, I've experienced waiters offering some sort of apology appetizer or drink for doing the mistake she did. Nothing was done just that our food would be expedited (which is expected since she forgot to put in our order.)\n\nWould much rather go to Suppenkuche for German if I were ever in the mood.", "rating": 3, "date": "2012-05-27"}, {"excerpts": ["The other two entrees (sauerbraten and ", "I forget the other one we ordered) had an overpowering vinegar-based gravy that made sauerkraut redundant. ", "Potato dumplings though. ", "I wish I could roll around on a pile of potato dumplings."], "author": "Will R.", "review": "Thick heavy food that goes into your stomach and gives it a hug from the inside. The winner was beef roulade. The other two entrees (sauerbraten and I forget the other one we ordered) had an overpowering vinegar-based gravy that made sauerkraut redundant. Potato dumplings though. I wish I could roll around on a pile of potato dumplings.", "rating": 4, "date": "2013-08-14"}, {"excerpts": ["Favorites from the regular menu include:  Jaeger Schnitzel with Creamy Mushroom Sauce, Sauerbraten (Marinated Beef), Breast of Chicken stuffed with Apples & Bacon, Roast Pork.    "], "author": "Liz S.", "review": "It's a little East Village, a lot East Berlin.\n\nIn my book, Walzwerk is the coolest restaurant in San Francisco.\n\nWhen you walk in, there is a definite buzz to the place - people are engrossed in conversation, food is coming out on steaming hot plates, and drinks are going down at a rapid clip.  There are no kitten heels or cosmos in sight.  The decor is a delightful hodgepodge of all things German, from propoganda posters to kitchy accessories.  Tables are mix and match, just like the eclectic clientele who loyally keep the restaurant busy every night.\n\nFirst, start with one of their many delicious beers - my husband likes the Optimator, while I prefer the amber.  You can't go wrong with a Weisse beer on a summer day - I can't think of anything more refreshing.\n\nFor appetizers, the potato pancakes are wonderful - thick and hearty, with sour cream and applesauce on the side.  Big enough to share, if you're feeling generous.  \n\nThe house-cured salmon is also lovely, with triangles of brown bread and a big bowl of beets on the side.\n\nThe soljanka soup is a real treat - a mix of pickled vegetables in a nice broth with bits of sausage thrown in - warms you up instantly and has a sour/savory flavor that is unique and very tasty.\n\nFor dinner, be sure to check the specials menu, because you can't go wrong with one of the fresh fish or pork selections.\n\nFavorites from the regular menu include:  Jaeger Schnitzel with Creamy Mushroom Sauce, Sauerbraten (Marinated Beef), Breast of Chicken stuffed with Apples & Bacon, Roast Pork.    If sausages are your thing, of course there is a great selection of those as well.\n\n**Vegetarians please note:  the Vegitarian Schnitzel is really good - a must-try!**\n\nDesserts:  Love the Cold Dog - layers and layers of cake & chocolate - almost a cross between a cake & a cookie, and the Apple Strudel is very good, too.  Again, there are usually specials such as cheesecake and chocolate pudding - all excellent.\n\nEven if you don't think you like German food, give Walzwerk a try.  In its very straightforward approach to both its service and its cuisine, it is sure to charm you.", "rating": 5, "date": "2006-05-31"}, {"excerpts": ["The boyfriend ordered the sauerbraten.  ", "The BIL has made both dishes multiple times, in fact every Christmas we have sauerbraten as our Christmas meal.  ", "That's right every year for the past 11 years for Christmas my Viet family would gather around a table and eat sauerbraten.  ", "Anyhow, our dishes came out and mine was fantastic, but there wasn't that much.  ", "I gobbled that thing up quickly.  ", "I rarely finish my meal.  ", "I'm also never the first person to finish my meal.  ", "I not only finished my meal first ", "but I ate it all.  ", "There's something off here.  ", "The saurebraten didn't really taste like the BIL (or his mom's, who came over from Germany one year for Xmas and cooked it for us).  ", "It was a bit more tomatoey than what I'm used to.  ", "I'm not sure what's \"more authentic", "\" but since both the BIL has the thickest German accent that after 11 years I still sometimes have trouble understanding him, and his mother who still lives in Germany's didn't quite taste like this ", "I'm going to go with them.  ", "That's fine though, it was still fine tasting, although the dish could have used more kartoffelkloesse (potato dumplings, ", "see, I know what I'm talking about here!)  "], "author": "Quynh-An P.", "review": "I was a little excited about coming to this place.  I have a German brother-in-law (\"the BIL\") and of all the menus I've seen from the various German places around town, this menu had the most dishes that the BIL has cooked for my family.  My sister and her family have since moved far away and I don't get to come over to their German meals anymore, so this made me think of them.\n\nI ordered the jager schnitzel.  The boyfriend ordered the sauerbraten.  The BIL has made both dishes multiple times, in fact every Christmas we have sauerbraten as our Christmas meal.  That's right every year for the past 11 years for Christmas my Viet family would gather around a table and eat sauerbraten.  Anyhow, our dishes came out and mine was fantastic, but there wasn't that much.  I gobbled that thing up quickly.  I rarely finish my meal.  I'm also never the first person to finish my meal.  I not only finished my meal first but I ate it all.  There's something off here.  The saurebraten didn't really taste like the BIL (or his mom's, who came over from Germany one year for Xmas and cooked it for us).  It was a bit more tomatoey than what I'm used to.  I'm not sure what's \"more authentic\" but since both the BIL has the thickest German accent that after 11 years I still sometimes have trouble understanding him, and his mother who still lives in Germany's didn't quite taste like this I'm going to go with them.  That's fine though, it was still fine tasting, although the dish could have used more kartoffelkloesse (potato dumplings, see, I know what I'm talking about here!)  They only gave the boyfriend 2, which is definitely not enough starch for this beef dish.\n\nWhile the food was pretty good (although again, portions were woefully small) what makes me not want to come back here was the service.  I get it, it was busy, and there's only 2 of you...but when we ask you to get us our bill and you don't and then proceed to avoid all eye contact with us until the other waitress feels bad and comes over with it, there's a problem.  We waited 20 minutes before we even asked the bill, and then waited another 10 minutes before we got it.  Absolutely unacceptable.  The BIL and his mother would be embarrassed if they knew about this.", "rating": 3, "date": "2011-09-17"}, {"excerpts": ["Mike gets the sauerbraten-of which all is quite good, but i cannot stop taking little nibbles of his sweet braised cabbage-which seems to have cinnamon spice and possibly apples or onions added to it. "], "author": "Alexis W.", "review": "Probably as dang authentic as you're going to get, Walzwerk is delicious and easier to get into than Suppenkuche. \n\nNow, granted, I was there on a Tuesday at roughly 5:30 with my friend Mike, but it was all around satisfying and beat the winter chills away with a heavy spike tipped bat. I had a craving for rib-sticking comfort food, and nobody really does that better than the Germans. \n\nFirst up, a little amuse of rye bread topped with salumi...I don't know what the German word for cold cuts is, and a light cheese w/ some veg. Mmmm...good start. \n\nOnto potato pancake appetizer-which is more than enough for a small meal for the less ravenous of the people out there. Three 3\" diameter, hockey pucks of mashed potato-crispy on the outside, squashy on in the inside-with chives, sour cream and applesauce. \n\nThen the main event, for me at least, JAGERSCHNIZEL. \n\nCrispy fried pork loin. Breaded, seasoned, crispy, delicious. But wait, it gets better...paired with a mushroom cream sauce and SPAEZTLE. Little dumplings of fluffy joy. And the best part? Some of the spaeztle had been fried in butter prior to being added to the cream sauce. So they were crispy fluffy joy buttons. Yes, it's a heart attack waiting to happen. Give me a friggin break, I'm all of 28. I can handle it. Plus, when again in my lifetime am I going to get to fully enjoy the delights of this kind of food? don't hate. \n\nMike gets the sauerbraten-of which all is quite good, but i cannot stop taking little nibbles of his sweet braised cabbage-which seems to have cinnamon spice and possibly apples or onions added to it. It's like dessert cabbage. \n\nWe split the apple tart. Round it out with an order of Elderberry soda and coke (by the way, they also do beer mixed with coke, which must be a European thing). Neither of us drink beer so we cannot attest to the accuracy of the beer/wine list. We waddle out the door, fully and completely satiated, into the darkness of night. Check out the back room for the kitche and posters.", "rating": 5, "date": "2008-03-16"}, {"excerpts": ["Especially the main course: excellent jager schnitzel and sauerbraten. ", "The potato pancakes were too doughy for my taste and the beet soup was very average. ", "It could have used some embellishment. ", "But I suppose that's part of the charm of this place: it's stripped down East German asceticism. "], "author": "Andy S.", "review": "The food was pretty good here. Especially the main course: excellent jager schnitzel and sauerbraten. The potato pancakes were too doughy for my taste and the beet soup was very average. It could have used some embellishment. But I suppose that's part of the charm of this place: it's stripped down East German asceticism. Great German beer on tap. \n\nBut the service left a lot to be desired. In fact the service just sucked, some of the worst I've had in this town. There's just this  \"Oh, I guess I'll serve you\" too-cool for school vibe among the wait staff. If you're in the club, you're cool, if you're not, whatever. They brought a beer to our table almost 15 minutes after we asked for it and no apologies. That wasn't cool. \n\nIf I had to pick between Walzwerk and Suppenkuche, I'd pick the later one. Better service, better appetizers, about equal on the main courses. Actually, no, Suppenkuche makes the best spatzle I've ever had.", "rating": 2, "date": "2007-02-20"}, {"excerpts": ["We got the Mushroom Jäger Schnitzel, the Sauerbraten and the Veggie Cabbage Roulade with spätzle, red cabbage, mashed potatoes and green peas. ", "We washed it all down with a few pitchers of beer and our waiter was so amazing that he gave everyone in our whole group a free shot of schnapps at the end of the meal. "], "author": "Anna R.", "review": "We came here for a friend's birthday and it was amazing! Come in a group of 10 or more and opt for their $25/person family style meal that includes every appetizer and three main entrees off the menu. We got the Mushroom Jäger Schnitzel, the Sauerbraten and the Veggie Cabbage Roulade with spätzle, red cabbage, mashed potatoes and green peas. We washed it all down with a few pitchers of beer and our waiter was so amazing that he gave everyone in our whole group a free shot of schnapps at the end of the meal. (If you come in a group, be sure to call ahead for a reservation)\n\nCome for the food, stay for the beer and take in the scenery. In the back room, where they sat our group, there was random decor all shipped over from Germany. One of our tables was actually an old desk built to withstand an air raid. Inside, we found old German books, including a 10-year reunion yearbook.", "rating": 5, "date": "2009-12-21"}, {"excerpts": ["You have to try to Sauerbraten, but order with Spaetzle instead. ", "One of the best meals in town. ", "The owners and all the waiters/waitresses are so friendly, in an East German kind of way. \n", "This place is GREAT, much better than the other German spots. "], "author": "Rhubarb M.", "review": "You have to try to Sauerbraten, but order with Spaetzle instead. One of the best meals in town. The owners and all the waiters/waitresses are so friendly, in an East German kind of way. \nThis place is GREAT, much better than the other German spots. Love love love the industrial style and all the decorations. \n\nBack room good for large groups.", "rating": 5, "date": "2007-12-30"}, {"excerpts": ["The food is great and un-frilly, sauerbraten is served with potato dumplings (Kartoffelkloesse) and red cabbage - delicious.\n", "The beer selection is not broad, but its all good."], "author": "Tom S.", "review": "I really like this place, although it does lack one point of authenticity - german service is very brusk and unhelpful. The last time I came to eat here our waiter was downright *friendly* and even paused to harrass the girl I was with about not eating enough.\n\nThe food is great and un-frilly, sauerbraten is served with potato dumplings (Kartoffelkloesse) and red cabbage - delicious.\nThe beer selection is not broad, but its all good.", "rating": 5, "date": "2006-10-20"}, {"excerpts": ["My friends had the jager schnitzel and sauerbraten; and everything was equally goot.\n\n"], "author": "Mark M.", "review": "goot times!  I veely enchoyed dis plaz.  Das foot vas speck-tacular, as vas da dekor unt da two vimen owners runnink da joint.\n\nWe loved the look, feel and comfort of the place.  Very small though the space is well used.  The decor theme (East German) is obvious while remaining cosy, casual and subtle.  The two women owners running the place are wonderful; friendly and courteous while moving at the speed of light.\n\nBeer selection is good enough.  I had the pils and friends had the special dark and hefeweizen  (I detected cloves and fruit flavor in the heff...not my style) but the pilsner was very good.\n\nWe shared mass quantities of the potato appetizer.  Not your typical latke, but more like a lightly pan seared mash potato consistency.  Each order had three thick 'patties', served with apple sauce and sour cream;  yum yum.  A meal in itself. \n\nI had the bratwurst, served with great kraut and the best mashed potatoes I ever had  (I can only guess what the put in it for flavoring and creaminess).  Excellent!  My friends had the jager schnitzel and sauerbraten; and everything was equally goot.\n\nWe also shared the pickle soup; which was tomato based with pickle slices, onions, bacon, sausage and more in it.  It was good, but the pickle flavor was a bit overbearing.  \n\nIt does get a bit loud inside, but not too loud for conversation.  Prices are fair for the city.  So go cross Checkpoint Charlie and have fun!\n\nGood stuff!!", "rating": 5, "date": "2009-05-31"}, {"excerpts": ["My daughter ordered the sauerbraten beef entree and the lychee bionade soda. ", "I ordered the stuffed chicken entree and a non alcoholic maltz beverage called Kaiserdom( I was curious about this drink but after 2 sips,I realized that I didn't like it).  ", "We were served our beverages first and it took awhile for the food to arrive because the place was busy. ", "The waitresses were very kind and apologetic about the wait.  ", "One of the waitresses even noticed that I didn't drink my beverage and asked me if I liked it or not.  ", "I was honest and told her that I really found the drink to be way to sweet for my taste ", "and I didn't care for the flavor either. ", "She also admitted that she did not like it and offered to replace it with another drink. ", "I thought that was very nice of her ", "but I declined and said that I would stick with the water. ", "Eventually, the food arrived and everything was delicious.\n", "I had even ordered an entree to go for my husband and this is where they lose the 2 other stars....\n", "I had requested the pork schnitzel entree as a \"to go\" item when we ordered our entrees and it was given to us at the same time our food had arrived.  ", "Since the schnitzel was all boxed up and wrapped, I didn't even give it a second thought to look at the product since the food on our plates looked great.  ", "Well, when i arrived home and opened up the box, I was very surprised and disappointed to see that they had \"overcooked\" the schnitzel because the breading looked very charred! ", "My husband was surprised that they would even serve something that looked like it had been burnt.  ", "I felt so bad that I offered to remove the breading and salvage the meat and put it in a sandwich ", "but he was already hungry and tried to eat some of the schnitzel .  ", "The mashed potatoes and mixed vegetables were fine but the cook probably was too busy to pay attention to frying the pork schnitzel.  ", "Next time, I will make sure to peek at  the \"to go\" item before I leave the restaurant!!"], "author": "Amelia C.", "review": "My daughter ordered the sauerbraten beef entree and the lychee bionade soda. I ordered the stuffed chicken entree and a non alcoholic maltz beverage called Kaiserdom( I was curious about this drink but after 2 sips,I realized that I didn't like it).  We were served our beverages first and it took awhile for the food to arrive because the place was busy. The waitresses were very kind and apologetic about the wait.  One of the waitresses even noticed that I didn't drink my beverage and asked me if I liked it or not.  I was honest and told her that I really found the drink to be way to sweet for my taste and I didn't care for the flavor either. She also admitted that she did not like it and offered to replace it with another drink. I thought that was very nice of her but I declined and said that I would stick with the water. Eventually, the food arrived and everything was delicious.\nI had even ordered an entree to go for my husband and this is where they lose the 2 other stars....\nI had requested the pork schnitzel entree as a \"to go\" item when we ordered our entrees and it was given to us at the same time our food had arrived.  Since the schnitzel was all boxed up and wrapped, I didn't even give it a second thought to look at the product since the food on our plates looked great.  Well, when i arrived home and opened up the box, I was very surprised and disappointed to see that they had \"overcooked\" the schnitzel because the breading looked very charred! My husband was surprised that they would even serve something that looked like it had been burnt.  I felt so bad that I offered to remove the breading and salvage the meat and put it in a sandwich but he was already hungry and tried to eat some of the schnitzel .  The mashed potatoes and mixed vegetables were fine but the cook probably was too busy to pay attention to frying the pork schnitzel.  Next time, I will make sure to peek at  the \"to go\" item before I leave the restaurant!!", "rating": 3, "date": "2011-09-03"}, {"excerpts": ["the entrees wowed me:\nthe sauerbraten beef dish was soft marinated pieces of yumminess and came with heavy potato dumplings and cabbage.\n", "the jager schnitzel was fantastic! "], "author": "Anh V.", "review": "small, not so comfy tables and chilly but bring on the beer and soon the windows were steamy from all the folks packed in by 7pm.\n\nthe potato pancakes were deelish\nthe cheese spatzel was good too but the cabbage outshined it!\n\nthe entrees wowed me:\nthe sauerbraten beef dish was soft marinated pieces of yumminess and came with heavy potato dumplings and cabbage.\nthe jager schnitzel was fantastic! tender pork with mushroom sauce and more spatzel.\n\nno meal is complete without dessert so the chocolate tart was a supersized version of a choco truffle.  \n\ntwo thumbs up for a melt in your mouth caloric affair!", "rating": 4, "date": "2010-02-01"}, {"excerpts": ["The mains were the sauerbraten (?), the pan fried rainbow trout special, and the chicken breast stuffed with apple, bacon, and who knows what else. ", "The salmon was good, these three exceeded all expectations. "], "author": "Joe D.", "review": "I know I'm late on this one but who could've expected such fantastic food with such a good vibe from a self-proclaimed East German restaurant?\n\nWe were a threesome and started with the house-cured salmon which came with tasty fresh beets. Tasty and off to a good start.\n\nThe mains were the sauerbraten (?), the pan fried rainbow trout special, and the chicken breast stuffed with apple, bacon, and who knows what else. The salmon was good, these three exceeded all expectations. Serious food done very very well.\n\nThe decor is relatively spartan but the vibe is very laid back and warm.\n\nI will return again. And again. And again.", "rating": 5, "date": "2007-02-14"}, {"excerpts": ["sauerbraten was really good, home-style, tender meat. \n\n"], "author": "miss b.", "review": "nice place to go for german food.\n\nFOOD: ~my sauerbraten was really good, home-style, tender meat. \n\n~the potato dumplings were bland, so i traded for my friend's mashed potatoes that came w/his excellent bratwurst. i actually liked the braised red cabbage, which surprised me. \n\n~yummy rote grutze (red berry pudding) was nice.\n\nDRINKS: beer is gut.\n\nSERVICE: the owner couldn't have been any nicer, & our server was really nice & straightforward, too.\n\nDECOR: the owner collected everything from east germany, from the s&p shakers to the flower vases to the bath products on display in the bathroom. very comfy & home-style, i can see why germans go here when they're feeling homesick. i love the tiny bar area! random yet cool. & how they spray painted the industrial stuff outside the window & lighted it, very artsy.\n\nBATHROOM: i think there's only one. hilarious old east german albums on the walls. i don't like how the tp holder is on the ground & rusted.\n\nOVERALL: i'd go back if i was in the mood for bratwurst or some potato pancakes (mmm).", "rating": 3, "date": "2006-08-17"}, {"excerpts": ["I had the Sauerbraten and the potato dumplings were as good as homemade. ", "And most importantly they have some great German beers on tap. ", "This place is small so don't go with a large group unless you can afford to wait, but put this on your regular eatery list if you enjoy German food."], "author": "Darin A.", "review": "This little place is a fantastic little restaurant. The decor is entertaining with its pictures of East Germany icons and the major leaders of the bolshevik revolution. The food was really good though. This is not what you'd expect from a German restaurant. I had the Sauerbraten and the potato dumplings were as good as homemade. And most importantly they have some great German beers on tap. This place is small so don't go with a large group unless you can afford to wait, but put this on your regular eatery list if you enjoy German food.", "rating": 4, "date": "2011-01-17"}, {"excerpts": ["I had the Sauerbraten... ", "a liiiittle too sour for my taste buds. ", "So I don't really recommend that dish. ", "My friend got the Chicken stuffed with apples and stuff, now THAT was good. ", "OMG... "], "author": "Eugenia Y.", "review": "Pretty tasty place. Arranged my friends bday dinner party here 'cause he's all about German food. \n\nAnyways, I have to say that the potato cakes by far were the tastiest things I had there.\n\nI had the Sauerbraten... a liiiittle too sour for my taste buds. So I don't really recommend that dish. My friend got the Chicken stuffed with apples and stuff, now THAT was good. OMG... if I ever go there again i'll take one of those please. \n\nWE also requested a truck loaded full of these tiny liquor bottles... I had 2.\n\n1 i shot straight down my throat. The 2nd went right out my nose...it's jagerish... so you can only imagine. \n\nAnyways, place is cool. Very cute. Ambience is something to admire. All the servers have nice little accents so I'm assuming it's pretty authentic. \n\nOh, and beer is tasty... not as much of a selection I thought a German place would have though.", "rating": 4, "date": "2008-12-05"}, {"excerpts": ["And then there was the brat, schnitzel, sauerbraten and beef roulade.  "], "author": "Scott S.", "review": "For me a good test of a restaurant is the quality of the side dishes that accompany a main dish.  At this charismatic dining experience the mashed potatoes, spätzle, mixed veggies, red cabbage and dumpling-thingy (don't know the name but you gotta try it) RULED.  Seriously.  These dishes can sometimes be doldrum place-fillers on one's plate - not here.\n\nAnd then there was the brat, schnitzel, sauerbraten and beef roulade.  One word will do - YUM!!\n\nAdd fantastic German beer, intriguing German and sometimes East German decor (including a collection of small liquor bottles chosen from grandpa's collection of over 500 imported direct to next-to-the-bar, a Germanic medicine cabinet in the bathroom and a neon shower curtain keeping the cold weather out just inside the front door) and witty but cheery service and you get an A+.", "rating": 5, "date": "2010-11-21"}, {"excerpts": ["so the other tries to order sauerbraten, which comes with potato dumplings.  ", "but guess what?  "], "author": "Nikki F.", "review": "downhill.  is the high speed train this place is on.  the other night, they ran out of schnitzel.  and spatzle.  this affected every single one of our orders.  how can you run out of schnitzel?  and spatzle?  we stopped in for an early dinner at 7pm famished after a hike in muir woods.  and wait, they didn't tell us until 15 minutes *after* we placed our orders.  which was really annoying.  and not sure what's going on back there but she later comes back and says one of us can get the last schnitzel.  so the other tries to order sauerbraten, which comes with potato dumplings.  but guess what?  you guessed it, they're out of potato dumplings.  ??!?\n\ni used to think this place was better than suppenkuche and i used to proselytize this fact widely.  but then somethings gone terribly wrong here, though you wouldn't know it from the continuing lines that build out onto the street for this place.  one thing i do know is that some of the waitstaff seems to have moved to suppenkuche in the last year or so.  perhaps he took all the recipes with him.  \n\ngranted the food wasn't exactly what we all had ordered, but we made the necessary adjustments in expectations they required.  we were famished, but we still have tastebuds.  i can still scrape the salt deposits off the roof of my mouth.  overly salted, oily fatty sauces.  the red cabbage was all sugary sweet, no sour.  dumping salt, sugar, and oil on everything tells me either your ingredients are turning and you don't want me to know, or you just don't give and crap about what you're putting on my plate.  one of the sides - seasonal vegetables was a bunch of overly salted and buttered frozen broccoli.  my tri-tip roulade was dry, which defies even my imagine, and tasted like squirrel, leaving me to assume it probably definitely wasn't tri-tip.  the potato pancakes were just their mashed potatoes shaped into a hockey puck and pan fried in oil.  not my kind of potato pancakes. \n\ni peaked back in to the kitchen to see what all was happening back there and it was authentic all right, authentic war-time berlin.  or like a dank abandoned house in east berlin where squatters have taken over.  food spattered on the walls, bits strewn everywhere, and puddles of sauce and chunks covering the floors.  dishes being hosed and scattered about.  now authentic is not the right word for it since most germans are a fastidiously, painstakingly clean folk. in short, this kitchen was unacceptable by even the dirtiest mission standards.  \nas i walked back to my table, i must have been visibly peeved, since the owner gave me the most sad and apologetic smile she could muster without saying a word.  i wanted to ask her to come taste our food. but i didn't.  \n\nthe only thing good about this place is the beer and the friendly, if clueless, server.  one star each.  but that is never going to bring me back, especially at $90 bucks for 3 people.  what a waste.", "rating": 2, "date": "2009-07-07"}, {"excerpts": ["We ordered the roast garlic pork, schnitzel (breaded porkloin), and the sauerbraten (marinated beef).  \n\n"], "author": "Aaron F.", "review": "Went to this place for my friend's birthday, which heard about from his coworker.  It really is one of those hole in the walls other than it having a little overhang out front.  The inside was small, but it was pretty crowded too.\n\nWe ordered some drinks and it came up we were celebrating a birthday when they carded us.  So, they brought the drinks with some little tiny bottles of something called \"Underberg.\"  It wasn't a drink, but an after-meal bitter that happens to be 44% alcohol by vol, lol.  They introduced us to this custom of toasting each other while looking them dead straight in the eyes and then downing it like a shot.  It tastes and smells like root beer along with a bunch of other spices.  It goes down smooth and not too bad of an aftertaste.  It made my girlfriend's ears feel warm.\n\nWe ordered the roast garlic pork, schnitzel (breaded porkloin), and the sauerbraten (marinated beef).  \n\nThe beef was the best in my opinion.  It was very tender like veal and the sauce tasted kind of like a wine reduction.  This dish also came with potato dumplings that were delicious and red cabbage, also good.\n\nI liked the breaded pork loin next.  It was what you would expect from a breaded pork loin, although more tender.  The garlic pork had a wonderful sauce but the pork was a tiny bit overcooked, but still great with the sauce.\n\nDesert was a terrific apple strudel and ice cream. The strudel has small, diced apples, raisins, and nuts, and is NOT filled with all that gooey junk from store bought strudels.\n\nService was excellent and authentically German (hard to understand accents sometimes).  And we definitely appreciated the birthday toast.  Food was great considering none of us knew what to expect from German food.   Perhaps a little pricey for the amount you get and somewhat out of the way.", "rating": 4, "date": "2010-03-19"}, {"excerpts": ["From the cream of potato with garlic soup, to the sauerbraten, to the chicken with a great sauce, all the way down to the apple streudel.  ", "It seems German restaurants are few and far between where I live so it was a treat to find one while visiting San Francisco.  ", "And this was a good one!"], "author": "Dave C.", "review": "We actually found this place, which was a very small neighborhood restaurant.  But my, it was really good.  From the cream of potato with garlic soup, to the sauerbraten, to the chicken with a great sauce, all the way down to the apple streudel.  It seems German restaurants are few and far between where I live so it was a treat to find one while visiting San Francisco.  And this was a good one!", "rating": 4, "date": "2010-12-12"}, {"excerpts": ["I couldn't decide between the jaegersnitzel or the sauerbraten and our adorable server wisely suggested the sauerbraten, but with a side of spatzle instead of potato dumplings. ", "It was great, especially the spatzle and red cabbage, but incredibly filling. ", "I ordered more wine as we began our third round of Anne Frank jokes. \n", "Aryan prince leaned in. ", "\"", "I bet they're wondering what the hell I'm doing with a brown haired, brown eyed girl. ", "Don't worry. ", "You're Italian. ", "Technically, we're on the same side.", "\" \n\"Check out these portraits on the wall. ", "Who the hell is that? ", "Heinrich Himmler?\"\n", "\"", "Hey, Ava Braun. ", "Volume.", "\"\n", "\"What? ", "Too soon?", "\"\nIt's not a fun dinner unless it's a wildly inappropriate dinner. ", "Any reference to my being a happy \"camper\" was taken beyond the realms of decency. ", "It was fabulous. \n", "But after three drinks and enough food to stock the Fuhrerbunker, it was time to go home. ", "Getting the check, however, proved to be impossible. ", "That adorable server had settled in at a table, engrossed in conversation with the cast of Sprockets. ", "And the only other staff member was scrambling to deal with everyone else, including a table of A-Ha fans playing cards nearby. ", "It probably took 30 minutes from the time we wanted to leave to our actually pushing open the door. \n", "It pissed the Aryan prince off more than it did me. ", "After all, I got canned champagne and a movie with the BFF, a cute, worldly, out-of-the-ordinary dinner with the Gestapo's dream candidate and a cache of appalling, send-you-straight-to-hell jokes that'll last me till my next plate of spatzle..."], "author": "Beth S.", "review": "I had the best night last night. And it went a little something like this:\nI raced out of work to meet my BFF for a 5:30 movie at the Lumiere. We're both obsessed with anything Indian, and will gladly sit through the most ridiculous Bollywood musical just so we can plan our outfits for our Bollywood party, in a constant state of planning. I arrived late, finding her out front holding my ticket and a mysterious paper bag filled with \"treats.\"\nWe grabbed two fabulous indie theater seats, threw down our bags and as the credits rolled, I realized once again why Zoe is my BFF. \nMy girl pulled out 4 cans of Sofia minis. \nWe watched The Namesake. We laughed. We cried. We drank champagne out of a can. \nBy 8 o'clock I had kissed Zoe goodbye, called Mikey and offered, \"I can pick up food, we can order food or we can go out.\"\n\"I feel like going out.\"\n\"Oh thank god. Me too.\"\nWe drove around our hood looking for parking when I remembered. Walzwerk! That German joint. We should go there. After all, I was having dinner with the Aryan prince, a literal poster boy for SS recruiters. And parking at 14th and South Van Ness is a lot easier than 17th and Mission. \nWe walked inside, found the perfect table by the window and ordered our respective wine and beer. (Note to my fellow wine drinkers, they have like 3 choices and all by the glass. I had the Chard. It was fine.)\nThe place was packed with loud hipstard types, the staff was all Euro-laid back and we had glittery, warm candles at our table. Dipping our spectacular potato pancakes in sour cream and chives, we settled in and perused our menu. Aryan prince wanted the special of the day, a mixed grill with sausage, salmon and beef, with mashed potatoes and sauerkraut. I had bites of all (except the salmon. I don't do salmon) and it was good. Not great. But good. \nI couldn't decide between the jaegersnitzel or the sauerbraten and our adorable server wisely suggested the sauerbraten, but with a side of spatzle instead of potato dumplings. It was great, especially the spatzle and red cabbage, but incredibly filling. I ordered more wine as we began our third round of Anne Frank jokes. \nAryan prince leaned in. \"I bet they're wondering what the hell I'm doing with a brown haired, brown eyed girl. Don't worry. You're Italian. Technically, we're on the same side.\" \n\"Check out these portraits on the wall. Who the hell is that? Heinrich Himmler?\"\n\"Hey, Ava Braun. Volume.\"\n\"What? Too soon?\"\nIt's not a fun dinner unless it's a wildly inappropriate dinner. Any reference to my being a happy \"camper\" was taken beyond the realms of decency. It was fabulous. \nBut after three drinks and enough food to stock the Fuhrerbunker, it was time to go home. Getting the check, however, proved to be impossible. That adorable server had settled in at a table, engrossed in conversation with the cast of Sprockets. And the only other staff member was scrambling to deal with everyone else, including a table of A-Ha fans playing cards nearby. It probably took 30 minutes from the time we wanted to leave to our actually pushing open the door. \nIt pissed the Aryan prince off more than it did me. After all, I got canned champagne and a movie with the BFF, a cute, worldly, out-of-the-ordinary dinner with the Gestapo's dream candidate and a cache of appalling, send-you-straight-to-hell jokes that'll last me till my next plate of spatzle...", "rating": 4, "date": "2007-05-24"}, {"excerpts": ["I ordered the Sauerbraten (tough, thick slices without much flavor)  with Potato Dumplings (dry and bland) and Braised Red Cabbage (the only food item that could really be classified as excellent).  ", "My wife had one of the night's specials, Goulash (better than mine, but still only ok) with Spatzle (should have been lighter).  ", "Also tried the Tomato - Cabage Soup and Thuringer Salad, of which neither were particularly appealing.  ", "Service was lacking and the noise level was very high.  ", "I really do like German food, but sorry, ", "Walzwerk, you didn't do it for me."], "author": "Stephen M.", "review": "My experience at Walzwerk was disappointing.  The German draft beer was good (Spaten Amber ... mmm!) , but everything else was below expectation.  I ordered the Sauerbraten (tough, thick slices without much flavor)  with Potato Dumplings (dry and bland) and Braised Red Cabbage (the only food item that could really be classified as excellent).  My wife had one of the night's specials, Goulash (better than mine, but still only ok) with Spatzle (should have been lighter).  Also tried the Tomato - Cabage Soup and Thuringer Salad, of which neither were particularly appealing.  Service was lacking and the noise level was very high.  I really do like German food, but sorry, Walzwerk, you didn't do it for me.", "rating": 2, "date": "2010-10-29"}, {"excerpts": ["The waitstaff is friendly and personable, and the sauerbraten is to die for. ", "Great after a hard week at work."], "author": "Marie G.", "review": "Love this place. So homey and laid back. The waitstaff is friendly and personable, and the sauerbraten is to die for. Great after a hard week at work.", "rating": 5, "date": "2011-08-27"}, {"excerpts": ["Between the three of us we tried the Sauerbraten, Jaegerschnitzel, and Goulash. \n"], "author": "B A.", "review": "I am originally from Austria and even know how to cook a few original Viennese dishes (like Wiener Schnitzel), so I am generally a pretty discerning customer when it comes to German or Austrian food.\nAfter dining at the Walzwerk last Saturday with two friends, I can honestly say that this is some of the best German / Austrian food I have EVER had. Between the three of us we tried the Sauerbraten, Jaegerschnitzel, and Goulash. \nAbsolutely everything was phenomenal, including the very tasty Kartoffelpuffer appetizer and the Thueringer Salad. Add the great selection of tasty draft beers and the friendly service (this despite the fact that the place was packed to the rafters), this dinner is one for the record books. I am definitely coming back and bringing friends who are looking for an authentic German dining experience.", "rating": 5, "date": "2008-01-13"}, {"excerpts": ["They've got killer sauerbraten, bratwurst and potato dumplings. ", "Those potato dumplings are awesome. ", "Granted, I've never seen how they actually make them, but they taste just like authentic Thuringian potato dumplings made from grated raw potato (as opposed to cooked, mashed potatoes), which give them a unique texture and taste you'd be hard-pressed to find even in Germany."], "author": "Kei H.", "review": "Like many of the other reviewers, I'm continually astonished that a place on such a desolate spot on South Van Ness serving German food, of all things, is consistently so packed. And the wait can be infuriating, especially if you're a party of 2 and there are plenty of larger tables open. \nBut. You can't really beat the atmosphere. It feels like an (admittedly somewhat trendy) Ossi bar in Berlin (or Dresden or Jena, etc.), right down to the unassuming little plastic salt and pepper shakers and the unmistakable home-cooked taste of the food. All you need is a view of some ugly pre-fab housing and some sad old chainsmoking retirees and you'd be on Leipzigerstrasse. \nOne gripe I do have is that a lot of the food is a bit too sweet, but I complain about the food in the way that you'd complain about your mom's food. It just tastes satisfyingly homey, and any misgivings can be washed away with a healthy dose of beer. \nI do wish they kept bar hours, did group-seating ala Suppenkueche and had Augustiner (granted, not an East German beer, but then, neither is Weltenburger, Franziskaner or a number of others they also serve), but whatever. They've got killer sauerbraten, bratwurst and potato dumplings. Those potato dumplings are awesome. Granted, I've never seen how they actually make them, but they taste just like authentic Thuringian potato dumplings made from grated raw potato (as opposed to cooked, mashed potatoes), which give them a unique texture and taste you'd be hard-pressed to find even in Germany.", "rating": 4, "date": "2008-07-30"}, {"excerpts": ["Had the rindsroulade and the sauerbraten. ", "Neither were drenched in thick gravy, which unfortunately has been the norm at other German restaurant, but instead in pan juices. ", "Served with tasty pan-fried spaetzle and clove spiced red-cabbage. ", "Even desserts were tasty. ", "Go try the Rote Gruetze (berry pudding)...delicious. ", "But the \"cold dog\" and the ever-present applestrudel are just as tasty!"], "author": "chris k.", "review": "This was the last German restaurant that I had left to try in the city and I should not have waited this long. Great DDR environment, fun/friendly server and good beer selections!\n\nThe food was just like I remembered. I never liked the herring salad growing up, but this was much better. Had the rindsroulade and the sauerbraten. Neither were drenched in thick gravy, which unfortunately has been the norm at other German restaurant, but instead in pan juices. Served with tasty pan-fried spaetzle and clove spiced red-cabbage. Even desserts were tasty. Go try the Rote Gruetze (berry pudding)...delicious. But the \"cold dog\" and the ever-present applestrudel are just as tasty!", "rating": 5, "date": "2009-04-10"}, {"excerpts": ["The Sauerbraten is great, not too sweet, not too sauer, sorry...sour and perfectly tender.  ", "The Jagerschnitzle, also great, bratwurst great, potato pancakes, great", ", Thuringer salad great, red cabbage...see the trend?  ", "The big potato dumplings could use a little extra something, as could the red berry pudding desert, but all is forgiven in light of the sauerkraut which can only be described as magnificent.  ", "They have a great German beer selection, many on tap, as well as a pair of interesting beer and soda concoctions which are actually pretty refreshing.  ", "They also have a perfect dessert called cold dog, which is cold but not canine in any way I can see.  ", "I wish I could remember the name of the little bottles of aquavit-esque liquor they have on hand as a post-spaetzle digestif..."], "author": "Peter L.", "review": "One time in 1989, I found myself in East Berlin for an afternoon.  To get there, I had to change 25 West German Deutschmarks for 25 East German ones, which at first didn't bother me, but at the time, people were pretty excited about some wall coming down or something and East Berlin was basically a ghost town as all the East Germans were over in West Berlin buying Japanese electronics at inflated prices, drinking coca-cola and reveling a bit too much in the joys of capitalism.  The only place in East Berlin I could find to spend my East German Deutschmarks was a little ice-cream parlor that doled out cold war-sized wafer cones of strict ice milk in an assortment that was pedestrian at best.  Even with my Middle American appetite, I can't down 25 East German Deutschmarks worth of Gorbachev-era ice-milk, and on that day, with all the excitement of chipping away at the wall and meeting Checkpoint Charlie MP's from Port Washington, WI, I only managed to get rid of about 4 of East German Deutschmarks.  So now, somewhere in my vast collection of crap, probably in a bag next to the pieces of the wall that I chipped off using a hammer I stole from a little kid from Baden-Baden, I have 21 rather austere looking, completely obsolete East German Deutschmarks.\n\nOk, yeah, so Walzwerk...\n35 stars for the spinach salmon spaetzle!  Sadly, I'll have to dock them 22 stars for not having it on the menu every day.  Actually, come to think of it, I'm going to dock them another 6 stars for not delivering to me personally a spinach salmon spaetzle dinner 5 out of 7 nights of the week.  Ok, where does that leave us...7 stars?  That sounds about right.\n\nI love this place.  As you've probably gathered, I love the Spaetzle, with or without salmon and spinach.  In fact, at times it's hard for me to order anything else due to this mildly unhealthy infatuation.  But I have persevered in the face of such noodle-y adversity and have tried many other Teutonic treats as well.  The beet soup is good and comes in a really cool square red \"bowl\".  The Sauerbraten is great, not too sweet, not too sauer, sorry...sour and perfectly tender.  The Jagerschnitzle, also great, bratwurst great, potato pancakes, great, Thuringer salad great, red cabbage...see the trend?  The big potato dumplings could use a little extra something, as could the red berry pudding desert, but all is forgiven in light of the sauerkraut which can only be described as magnificent.  They have a great German beer selection, many on tap, as well as a pair of interesting beer and soda concoctions which are actually pretty refreshing.  They also have a perfect dessert called cold dog, which is cold but not canine in any way I can see.  I wish I could remember the name of the little bottles of aquavit-esque liquor they have on hand as a post-spaetzle digestif...kind of an acquired taste but an apt way to top off the meal.\n\nThe service is good, too.  They're working hard there, and can be, on occasion, a little gruff, but always good natured and quick to laugh.  It does always seem to be busy, so either make a reservation or be prepared to squeeze into the small waiting area and drink excellent beer until your number's up.  I love the mash-up dcor of industrial, graphic, East German chic.  Especially the bathroom collection of cold war toiletries and Deutschland 45's.\n\nNow if only they'd let me pay for my spaetzle with those damn East German Deutschmarks...", "rating": 5, "date": "2007-10-11"}, {"excerpts": ["self main entree sauerbraten, marinated beef, with potato dumplings and sour red cabbage $sixteen decent....beef tender and sweet....warm sour red cabbage salad ", "good sharp contrast....", "sweet and sour good balance?....", "sadly potato dumpling disappointing....worst in comparison to other german dumplings had.....to add...a comment of tastings...", "bite of cod bit overcooked and dry....bacon wrapped cabbage..infused with bacon fat taste good....", "chew of boiled beef fine and sauced....hearty meal for hungry soul...."], "author": "Hen A.", "review": "mission location...quick trot from 16th mission bart....eclectic german decor...mix matching seating and plates....fitting mission vibe....alsterwasser $four...1 part beer to 1 part 7-up.....gulp and surprisingly cold, light, sweet and refreshing....new favorite beer \"cocktail\"?...possible....receiving trio of cheese and meat appetizer complimentary....ordering potato pancake trio $six fine...fried, soft and good with sweet applesauce and sour cream saucing....second, thuringer salad $seven subpar...trio of mild white cabbage, sour red cabbage and sweet carrot salad.... self main entree sauerbraten, marinated beef, with potato dumplings and sour red cabbage $sixteen decent....beef tender and sweet....warm sour red cabbage salad good sharp contrast....sweet and sour good balance?....sadly potato dumpling disappointing....worst in comparison to other german dumplings had.....to add...a comment of tastings...bite of cod bit overcooked and dry....bacon wrapped cabbage..infused with bacon fat taste good....chew of boiled beef fine and sauced....hearty meal for hungry soul....", "rating": 3, "date": "2008-09-11"}, {"excerpts": ["(roast chicken...go figure) but my sauerbraten was over-cooked and full of grissle. ", "If the bad food and bad service were part of the East German theme I could laugh it off, but it clearly isn't. ", "Save yourself the time and money and go to Schnitzel Haus or Suppenkuche."], "author": "Brad D.", "review": "I love German food and I love everything about the DDR, so I was uber excited to find out about this place. My excitement was quelched by the lousy food and rotten service. At first I chalked up the serivce to part of the East German ambience, later I realized it was just sheer attitude. Worst German meal ever!!! The potato dumpling was like eating a warm, wet, sponge - absolutely no flavor. My buddy had the spaetzle; weirdest I've ever seen. His chicken was good (roast chicken...go figure) but my sauerbraten was over-cooked and full of grissle. If the bad food and bad service were part of the East German theme I could laugh it off, but it clearly isn't. Save yourself the time and money and go to Schnitzel Haus or Suppenkuche.", "rating": 1, "date": "2007-04-17"}, {"excerpts": ["had the spaten amber, one of the best ambers i've ever had, the sauerbraten, and spiced red wine for dessert (christmas special).  ", "quiet and chill on a sunday night with the place full of friends of the staff - it was like Cheers, but actually cool.  ", "and the decor makes me want to live there."], "author": "James R.", "review": "everything about this pace is awesome.  decor, staff, food, beer.  had the spaten amber, one of the best ambers i've ever had, the sauerbraten, and spiced red wine for dessert (christmas special).  quiet and chill on a sunday night with the place full of friends of the staff - it was like Cheers, but actually cool.  and the decor makes me want to live there.", "rating": 5, "date": "2008-12-07"}, {"excerpts": ["I think the food is as good as Suppenkuche although I like the Sauerbraten better at Suppenkuche ", "I prefer the Spaetzel at Walzwerk.  ", "With all the food, drinks and a few people had dessert it ended up at $40/pp including tip and tax, now that is a deal!  ", "We had a large table in the back room and it was a great place for a large group.  ", "Will be going back."], "author": "Liz B.", "review": "I had a group of 11 so went with the group menu...talk about value for money! We had lots of leftovers and everyone went away full and satisfied.  I think the food is as good as Suppenkuche although I like the Sauerbraten better at Suppenkuche I prefer the Spaetzel at Walzwerk.  With all the food, drinks and a few people had dessert it ended up at $40/pp including tip and tax, now that is a deal!  We had a large table in the back room and it was a great place for a large group.  Will be going back.", "rating": 5, "date": "2008-11-12"}], "käsespätzle": [{"excerpts": ["We tried bratwurst, schnitzel, käsespätzle and speck washed down with dark beer.  ", "Will be back to explore more of the menu.  ", "Prost!"], "author": "I Be E.", "review": "A nice cozy quaint little restaurant that feels like Europe once you are inside.  We used the back room to seat 15 comfortably.  All dishes were delicious.  Service was excellent.  They would split, share, dishes for what we needed and even suggested best way to serve them.  We tried bratwurst, schnitzel, käsespätzle and speck washed down with dark beer.  Will be back to explore more of the menu.  Prost!", "rating": 4, "date": "2018-01-22"}, {"excerpts": ["Käsespätzle bestellen. ", "Lecker lecker!"], "author": "Evelyn C.", "review": "I shall attempt writing this review in German (please forgive grammatical mistakes). English translation will be in second paragraph. \n\nDieses Restaurant ist klein aber sehr charmant, und das Essen war sehr lecker. Unsere Kellnerin war eine Amerikanerin und sprach kein Deutsch, aber sie war sehr hilfreich und nett. Ich habe die Lammkoteletts  und ein Schwazbier bestellt. Mein Date (not sure if this is the German word for date) hat das Schnitzel vom Schwein mit Gemüse der Saison und Kartoffelbrei bestellt; es schmeckt auch gut. Also, ich habe vor dem Restaurant einen Parkplatz gefunden. Yay!\n\nThe place is small and charming, and the food was really good. Our waitress was really helpful and nice. I had ordered the lamb chops and a dark beer, both which I found tasty, but the lamb may be a tad on the gamey side for people who aren't a huge fan of lamb. Date ordered the schnitzel, which was also really good. \n\nAlso, I found parking right outside the restaurant, so parking shouldn't be an issue (it was a weeknight though, so not sure about weekends).\n\nEdit 7/30/2013: Must order the cheese späztle. It's like mac n cheese times 10. Sie müssen die Käsespätzle bestellen. Lecker lecker!", "rating": 4, "date": "2013-01-29"}, {"excerpts": ["There's something magical about washing down Jägerschnitzel und Käsespätzle with a half liter of Köstritzer, and you bet your expanding ass that Walzwerk gets it all right.\n\n"], "author": "Susuk L.", "review": "Took old man M out here for his 132nd birthday and had a grand old time.  Carefully selected German ales and lagers are happily served in the correct glassware at the correct temperature.  There's something magical about washing down Jägerschnitzel und Käsespätzle with a half liter of Köstritzer, and you bet your expanding ass that Walzwerk gets it all right.\n\nExcellent grub and suds aside, they've done a great job with the decor.  The place has a grimy industrial feel, no doubt meant to evoke visions of the East German proletariat life of the 70s and 80s.  You half expect Erich Honecker to be sitting next to you, quaffing Berliner-Weisse.  The service is similarly Germanic - a bit robotic, but fundamentally able.  Not so sure about the kitchen, as it took forever for them to fill our orders.\n\nThe quibbles are minor considering that for $60, we got away with six beers, two entrees, and a dessert, all of which were uniformly splendid.  Walzwerk did right by us.  So schmeckt Berlin!", "rating": 4, "date": "2008-10-05"}], "vegetarisches schnitzel": [], "vegetarische krautroulade": [{"excerpts": ["The rinderroulade, sauerbraten, vegetarische krautroulade, and jägerschnitzel are delicious!\n\n"], "author": "Michael B.", "review": "One of my favorite secret spots in San Francisco. The food, service and ambiance are excellent; it's like dining at someone's home.\n\nThe rinderroulade, sauerbraten, vegetarische krautroulade, and jägerschnitzel are delicious!\n\nI've only been a few times, so I'm really going to have change that.", "rating": 4, "date": "2017-09-22"}, {"excerpts": ["I absolutely adored the entree that we ordered - the vegetarische krautroulade, stuffed cabbage with lentils, root veggies, and lots of other good stuff, smothered in a fragrant tomato sauce. ", "The cabbage was infused with the filling and the tomato sauce, so it was really delicious. ", "The stuffing was combined in sort of a mash consistency, and it was just bursting with delicious flavor! ", "All of the many ingredients used complemented each other very well, especially when mixed with the tomato sauce. ", "The serving size is also super large and well worth the $15 that I paid for the dish. "], "author": "Sheila D.", "review": "Really, really good. I'd never had German food before coming to Walzwerk, so I really had no idea what to expect before walking in. I wound up going with a friend on a Thursday evening for dinner, and surprisingly, it was super full. I would say, make a reservation if you know for sure that you want to come. But even if you're just walking in, the line won't be too long if you're there on a weekday.\n\nService is great. All the servers are super friendly, patient, and helpful, which is great because the menu has some pretty foreign terms. Wait was somewhat long (15-20min to get our main courses), but our server checked up on us during that time to make sure we had enough water/drinks/etc. Location is pretty sketchy, but if you are with someone else, it shouldn't be a problem walking around.\n\nThe food itself is definitely unique but very, very good. My friend and I shared an appetizer and an entree. The matjes herring (basically a potato salad-esque dish with fish instead of potatoes) appetizer was the most interesting of the night. I still can't tell if I liked it or not, but it did present me with such a unique flavor composition that I have never experienced before. I'd say that the flavors of the sauce are really similar to your typical potato salad. The texture of the fish, however, was the most unfamiliar to me. Upon first bite, my friend and I both didn't know if we had actually eaten the fish or if it was something else. We had to try a few more pieces before confirming that it was indeed the fish. Chewy, cold, and didn't remind me of fish meat at all. Not my favorite dish of the night, but still worth a try if you're want to experience new flavors.\n\nI absolutely adored the entree that we ordered - the vegetarische krautroulade, stuffed cabbage with lentils, root veggies, and lots of other good stuff, smothered in a fragrant tomato sauce. The cabbage was infused with the filling and the tomato sauce, so it was really delicious. The stuffing was combined in sort of a mash consistency, and it was just bursting with delicious flavor! All of the many ingredients used complemented each other very well, especially when mixed with the tomato sauce. The serving size is also super large and well worth the $15 that I paid for the dish. I still have half of the dish sitting in my fridge for dinner tonight!\n\nOverall, I was very pleasantly surprised by this restaurant, especially because I had no idea what German food was! I've heard the beers here are superb, so if I do come back, I'll definitely try the drinks and more of the hot foods... and maybe pass on some of the bizarre cold appetizers.", "rating": 4, "date": "2015-08-29"}], "apfelstrudel": [{"excerpts": ["I'm sorry, but the apfelstrudel dissapointed.  ", "The dough was heavy and rubbery.  ", "I had a hard time getting through it with my fork.  ", "Apple strudels that I have had in the past were crisp, crunchy and full of flavor.  "], "author": "Thomas D.", "review": "Service was wunderbar.  Both of our servers were great at explaining the dishes and making everyone feel welcome at this starkly appointed replica of the former East Germany.\nFrom the unadorned light bulbs overhead, to the chipped enamel tables set against dimly painted yellow walls, we felt as if we walked into a time warp of the former Soviet-era.\n\nBoth the mood and tone were quite inviting and relaxed.  It's as if you walked into someone's home and sat down for a realistic, home cooked German meal.  I don't think there were 10 tables in the small dining room.\n\nThe beer selection is pretty cool and exciting.  We were steered to the bottled Gaffel Kölsch and the draft Weltenburg Helles.  They were delicious!!  German beer---love it!\n\nA small appetizer was immediately brought to the table.  It was made up of thinly sliced, small square bread bottoms with cucumber, sliced radish, sour cream, cheese and a little piece of bratwurst on top.  I was expecting more flavor but didn't get it.\n\nThe kartoffelpuffer came next.  We shared these potato pancakes served with a side of sour cream and applesauce.  They were dense and plain tasting--the applesauce was the better choice to kick up the flavor.\n\nI ordered the schnitzel vom schwein and was served a large portion of a breaded, pork cutlet.\nThe accompanying mashed potatoes were creamy and tasty.  The pork was very good too.\nThe side vegetables were a fresh mix of squash, carrots and brussel sprouts.\n\nMy partner had the hühnerbrust gefüllt mit äpfeln und speck.  This rolled chicken breast was stuffed with bacon, apples and raisins and covered in a white gravy.  What looked like it should offer a-- \"wow\"--- in flavor,  just didn't bring that much taste.  The accompanying sides were the same as above.  Again, outstanding mashed potatoes.\n\nI'm sorry, but the apfelstrudel dissapointed.  The dough was heavy and rubbery.  I had a hard time getting through it with my fork.  Apple strudels that I have had in the past were crisp, crunchy and full of flavor.  This was not.\n\nWe may have played it safe with the dishes we ordered.  Next time we visit, I'd like to experiment with their cabbage and sausage dishes and search for more flavor.\n\nAll in all, it was a nice experience and we are so lucky to have all of these choices in SF.", "rating": 3, "date": "2015-10-25"}, {"excerpts": ["apfelstrudel - a bit too sweet for my liking, but well made.\n"], "author": "Edward W.", "review": "Had a reservation ahead of time for 5. The restaurant is small, cozy, and noisy. I loved the ambiance as it reminded me of the time I was in Germany. \n\nOrdered the following items:\nhefeweizen draft beer - 0.5L, tasty and worth it.\npotato soup with sausage - thick potato base with a sausage. very tasty\nbratwurst thüringer art - delicious, but only comes with 1 pork & veal sausage which is quite expensive considering the kassler and rinderroulade are only $1 and $2 respectively more expensive.\nkassler -  smoked pork chop looks like a big piece of ham, but tastes like pork chop and has a smoky flavor to it. mashed potatoes seems to be the go to starch for German dishes.\nrinderroulade - tri-tip stuffed with bacon was so flavorful. the spätzle was also delicious and not too doughy. \napfelstrudel - a bit too sweet for my liking, but well made.\nkalter hund - layered cake made of butter cookies, chocolate and rum. This was a very unique tasting dessert, dense yet airy at the same time. It is certainly worth a try.\n\nThe service here is quick and attentive. I'm definitely coming back for some authentic German food.", "rating": 4, "date": "2016-02-17"}, {"excerpts": ["Apfelstrudel: Filo dough filled w/ apples, raisins, nuts & brandy, vanilla ice cream, whipped cream ($7): ", "http://bit.ly/1SL4zH0\n", "*Weekly Special: Bread Pudding w/ ", "caramel sauce, whipped cream ($7)", ": ", "The Apfelstrudel tasted like an undercooked apple pie. ", "The bread pudding was better than the Apfelstrudel but just ok. "], "author": "Cherylynn N.", "review": "4.5 STARS \n\nI have a love and hate relationship with large group dinners.\n\nI love being able to get together with friends who I rarely see these days because of our busy schedules. Seems like everybody and their mama is getting engaged, married, and/or knocked up on FB...except us. We're over here like, \"Heeeeeey, look at my furbaby in his OOTD\".  *le sigh*\n\nI hate organizing group dinners because finding a reasonably priced restaurant in SF that can accommodate a large group AND have easy street parking is like finding a unicorn. Then, with some restaurants you have to deal with stupid penalty charges if you have flaky friends who don't even bother texting that they can't make it. \n\nWalzwerk is that unicorn.\n\nThe East German menu is carniwhore friendly with large portions at very affordable prices. They have a private room in the back that can accommodate up to 20 people, and finding street parking in this area of the Mission is not impossible. If you have a group of 10+, there's a set dinner: sampling of all the apps and 3 shared entrees for $28 pp which is dirt cheap for SF. Beer and wine only. Reservations accepted for parties 4 or more.\n\nWe had less than 10 people so we ordered a bunch of apps, our own entrees, and shared several desserts:\n\nA P P S\n*Kartoffelpuffer: Potato pancakes w/ chive sour cream, applesauce ($7): http://bit.ly/1JsqBh4\n*Matjes Herring w/ sour cream, apples, onions, pickles, pumpernickel bread ($9): http://bit.ly/1D8XQ7L\n*Gebeizter Lachs: House cured salmon, horseradish cream, marinated beets, fitness bread ($9): http://bit.ly/1Ipa1tm\n\nThe group favorite was the potato pancakes. Sure, they were just glorified hash browns but they were delicious with the creamy sour cream and nicely tart applesauce. The herring and house cured salmon were standard. We enjoyed the accompanying marinated beets which were slightly pickle-y. Not a fan of German bread because of that grainy texture. \n\nE N T R E E S\n*Jägerschnitzel: Unbreaded porkloin w/ spätzle, creamy mushroom sauce ($16): http://bit.ly/1HYQGSP\n*Kassler: Smoked pork chop w/ mashed potatoes, brussels sprouts ($18): http://bit.ly/1ScwCUT\n\nThe entrees are the star of Walzwerk's menu. Everybody loved their entrée. They're huge, hearty, and comforting. My Jägerschnitzel (unbreaded) was tender and showered in this sinfully delicious creamy mushroom sauce (great depth of flavor). The spätzle absorbed this yummy sauce which made it even more delightful to enjoy these tiny dumplings. Highly recommended! \n\nI had a bite of the Kassler which would satisfy any pork chop lover. The thick cut pork shop was surprisingly very tender and moist with a pronounced smokiness. \n\nD E S S E R T S\n*Apfelstrudel: Filo dough filled w/ apples, raisins, nuts & brandy, vanilla ice cream, whipped cream ($7): http://bit.ly/1SL4zH0\n*Weekly Special: Bread Pudding w/ caramel sauce, whipped cream ($7): http://bit.ly/1gju9qZ\n\nDesserts were disappointing which is why I'm rounding down my rating. The Apfelstrudel tasted like an undercooked apple pie. Didn't taste any flaky layers from the supposed filo dough and the apples were still hard.\n\nThe bread pudding was better than the Apfelstrudel but just ok. We also ordered the Rote Grütze Berry Pudding  (sorry, no pic) which I wouldn't recommend. The \"pudding\" was watery and very tart. \n\nIt was packed on a Saturday night and there were only two waitresses who rocked it. They were knowledgeable and quick on their feet. They also have their sh*t together in the kitchen as we got all our dishes very timely. \n\nI've been to Walzwerk before my Yelp days and it's just as good as I remembered it. Next time, I'm going to bring an ACME baguette to sop up all that mushroom gravy deliciousness from the Jägerschnitzel. Shhhh.....", "rating": 4, "date": "2015-07-28"}, {"excerpts": ["The Apfelstrudel was just like my Austrian grandma made it, which is almost impossible! ", "The dessert wine and digestive made me truly feel at home. ", "Also in true European fashion, your entree doesn't arrive till you're done with your appetizer and the check doesn't till you ask for it!!!\n", "Great restaurant!"], "author": "Oliver P.", "review": "I'm German and have been here twice now. The food is very good. German cooking can be a little heavy, Isabelle however combines the German tradition with California lifestyle and by that I mean the dishes are delightfully healthy. The decorations are authentic historical socialist East German. The selection of beer is very good and the desserts are a highlight as well. The Apfelstrudel was just like my Austrian grandma made it, which is almost impossible! The dessert wine and digestive made me truly feel at home. Also in true European fashion, your entree doesn't arrive till you're done with your appetizer and the check doesn't till you ask for it!!!\nGreat restaurant!", "rating": 5, "date": "2015-05-16"}, {"excerpts": ["Speaking of which, the apfelstrudel is lovely as was the Christmas Plate of cookies (but you MUST have coffee with the latter!) ", "(I love sauerkraut!) ", "The service is typical German-- "], "author": "Jen S.", "review": "I STILL haven't shut up about how good this food was. (I love sauerkraut!) The beef roulade was not nearly as good as homemade I've had but the jagerschnitzel was phenomenal! The gluhwein was very nice, though I should've saved it for dessert. Speaking of which, the apfelstrudel is lovely as was the Christmas Plate of cookies (but you MUST have coffee with the latter!) (I love sauerkraut!) The service is typical German-- no extra pleasantries to speak of. \n\nYesterday I called and left a message requesting a reservation for four for this evening and I received a call back saying they were SO full and there's no way they could spare a table. (I love sauerkraut!) I had no idea how small this place actually is, but we walked in and were seated immediately (and there was at least one additional available table!) So even if they claim reservations are unavailable, you might want to take your chances. They sure made a lot of money from my willingness to do so!\n\nIt was perhaps the most unhealthy meal I've eaten in a very VERY long time, but boy was it worth it! I felt right at home with all these tall beautiful German women. Oh, and I love sauerkraut. I would marry it if I could.", "rating": 5, "date": "2007-12-14"}], "kalter hund": [{"excerpts": ["I'd like to return and try the schnitzel and the kalter hund dessert "], "author": "Tay H.", "review": "Gah, what a hidden gem.  I was so shocked when I realized this had been here ~two decades and I am only now finding out about it.\n\nFrom the food to the atmosphere, I just loved my dinner here.  I really enjoy German food but am so tired of the beer hall shtick and was relieved to see something *different*  Despite the fact that it's a German restaurant, there was something about the decor that made me think Cold War era and the show, The Americans....though, on further reflection, maybe it reminded me of the movie, Atomic Blonde (which is the right country, at least).  Either way, it was something kind of fun and kitschy without being over-the-top.\n\nAll the food we ate was excellent and hearty - and perhaps more than we needed.  Two of us shared the potato soup with sausage, the tomato soup with salami, the house cured salmon on fitness bread, some kind of mixed sausage platter, and then the bratwurst entree with mashed potatoes.  I liked everything quite a lot, with the exception of the (1) tomato soup (which was good but not really my style) and (2) the mashed potatoes (which needed more salt and/or gravy of some sort).  I'd like to return and try the schnitzel and the kalter hund dessert :)\n\nService was friendly and efficient.\n\nI'd definitely return.", "rating": 5, "date": "2018-04-30"}, {"excerpts": ["kalter hund - layered cake made of butter cookies, chocolate and rum. ", "This was a very unique tasting dessert, dense yet airy at the same time. "], "author": "Edward W.", "review": "Had a reservation ahead of time for 5. The restaurant is small, cozy, and noisy. I loved the ambiance as it reminded me of the time I was in Germany. \n\nOrdered the following items:\nhefeweizen draft beer - 0.5L, tasty and worth it.\npotato soup with sausage - thick potato base with a sausage. very tasty\nbratwurst thüringer art - delicious, but only comes with 1 pork & veal sausage which is quite expensive considering the kassler and rinderroulade are only $1 and $2 respectively more expensive.\nkassler -  smoked pork chop looks like a big piece of ham, but tastes like pork chop and has a smoky flavor to it. mashed potatoes seems to be the go to starch for German dishes.\nrinderroulade - tri-tip stuffed with bacon was so flavorful. the spätzle was also delicious and not too doughy. \napfelstrudel - a bit too sweet for my liking, but well made.\nkalter hund - layered cake made of butter cookies, chocolate and rum. This was a very unique tasting dessert, dense yet airy at the same time. It is certainly worth a try.\n\nThe service here is quick and attentive. I'm definitely coming back for some authentic German food.", "rating": 4, "date": "2016-02-17"}, {"excerpts": ["We had for dessert:\n\n- Kalter Hund (\"cold dog\" - great name) - layered cake with butter cookies, chocolate and rum, served with a little sauce on the side. "], "author": "June W.", "review": "Had dinner here tonight (Friday). Came in around 5:40, so they'd just opened, and we were the first ones there. We got seats at the front, by the windows. Welcoming staff (owners, right?). Great decor, nice DDR touches.\n\nNice complimentary bites to start with. We had the great grapefruit beer everyone has been raving about in their Yelp reviews - yep, it is pretty good!\n\nFor entrees, we had:\n\n- Jagerschnitzel (unbreaded pork loin with spaetzle, and mushroom sauce). My entrree. Wow, so good. The spaetzle had a nice crust/crunch on them, so they had a nice firmness along with the soft. Mushrooms and sauce were very tasty, as was the pork.\n- Schnitzel vom schwein (breaded pork loin with mashed potatoes and vegetables, including Brussels sprouts). Daughter reported the mashed potatoes were very tasty, and the pork looked really good too (to me!). \n- Kassler (smoked pork chop with mashed potatoes and Brussels sprouts). The pork chop was very tender and perfectly cooked. Husband also liked the potatoes very much.\n\nWe had for dessert:\n\n- Kalter Hund (\"cold dog\" - great name) - layered cake with butter cookies, chocolate and rum, served with a little sauce on the side. This was delicious. These types of cakes can be dry, which is why I usually stay away from these, but this was very good, not at all dry.\n- Rote Gruze - this was a red berry pudding with raspberries, strawberries and blueberries, made with cream of wheat (!) and vanilla sauce. I was a bit worried with a dessert made with Cream of Wheat, but it was actually very good. Wasn't sure what to think of the texture (a bit grainy), but we enjoyed it very much.\n\nDefinitely a good choice for dinner tonight, and will be back!", "rating": 5, "date": "2017-07-14"}, {"excerpts": ["Try the soljanka, the cold cut platter, Roulade and Kalter Hund for desert. ", "Satisfied."], "author": "Kaden I.", "review": "My go-to now. Definitely authentic eastern German cuisine. Try the soljanka, the cold cut platter, Roulade and Kalter Hund for desert. Satisfied.", "rating": 5, "date": "2018-01-10"}, {"excerpts": ["We shared the kalter hund and it was a simple yet very satisfying dessert. \n", "Danke Sehr!"], "author": "Tony M.", "review": "My friend who is visiting from Germany and I came here last nite for the first time and we enjoyed everything about the place. The owners here are so friendly and welcoming.  We would definitely come back.  It is authentic East German food and my friend and I loved it.  The kartoffelpuffer (potato pancakes) were delicious, the Kassler (pork chop and mash potatoes with brussel sprouts) was made just right and tender and the vegetarisch schnitzel was very good.  We shared the kalter hund and it was a simple yet very satisfying dessert. \nDanke Sehr!", "rating": 5, "date": "2016-02-17"}, {"excerpts": ["Apfelstruddel and Kalter Hund. "], "author": "CeeLo L.", "review": "Love the decor, and the food was awesome! I like that they had a decent list of Austrian wines to choose from as well.  Only downsides were that the service was a bit slow and we didn't get the correct dessert that we had ordered, but everything else was so great, we didn't mind so much.\n\nWe had the Kartoffelpuffer, die Kartoffelsuppe, der Schnitzel vom schwein, salmon. Apfelstruddel and Kalter Hund. YUM!!\n\nLooking forward to going back soon*", "rating": 5, "date": "2015-07-27"}, {"excerpts": ["Had complimentary amuse bouche (German-style canape), dark lager, jagerschnitzel and kalter hund for dessert--", "all amazing--the \"cold dog\" cake was especially wonderful and an architectural wonder.  ", "Great value for the money", "; the overall experience was one-of-a-kind; having been to Germany, totally authentic.  ", "Can't wait to return, looking forward to trying their Christmas goose!"], "author": "Lorin H.", "review": "Came here on my birthday for the first time and fell in love with the atmosphere, food and historic East German decor! Owner Christiane was an uber-server. Had complimentary amuse bouche (German-style canape), dark lager, jagerschnitzel and kalter hund for dessert--all amazing--the \"cold dog\" cake was especially wonderful and an architectural wonder.  Great value for the money; the overall experience was one-of-a-kind; having been to Germany, totally authentic.  Can't wait to return, looking forward to trying their Christmas goose!", "rating": 4, "date": "2017-01-06"}, {"excerpts": ["Finishing off the meal was a kalter hund. ", "The spread had an attractive sugar-syrup to dip your chocolate cake into. "], "author": "Amal C.", "review": "Willkommen, mein freund, in der DDR.\n\nThis restaurant is a step into the past, with pictures of the great minds behind the CCCP on the walls, German newspaper headlines about Washington in the \"toiletten\", and large glasses of beer. The only change this restaurant has from the old days, is the friendly hostesses here.\n\nThe service was great. We were able to get a table without reservation: although we had to eat between 6:45-8:00. So they are able to fit people in with no problem.\n\nThe pickled herring was a nice start to the meal. Not too sharp, not too fishy. Just the right amount of flavor for your mouth to be happy, and not overwhelmed.\n\nThe beef roulade was spectacular and juicy. The meat was juicy, The cabbage was sharp and fresh, and the softy-yet-crispy spätzle complimented both.\n\nFinishing off the meal was a kalter hund. The spread had an attractive sugar-syrup to dip your chocolate cake into. The presentation on this alone was well put together.\n\nAll over, I would definitely suggest this to anyone looking to try good German food. It's not too harsh for newbies, and the delicious meat isn't too spicy or sharp, but definitely not bland.\n\nTry it at least once. But remember to bring your papers.", "rating": 4, "date": "2014-11-06"}, {"excerpts": ["I was very surprised to also find 'Kalter Hund' which is a dessert and definitely worth a try.\n\n"], "author": "Isa T.", "review": "This is a great authentic German restaurant.\n\nWe've been here a few times and the food is delicious. I find many dishes, that you would usually only find in Germany itself. I was very surprised to also find 'Kalter Hund' which is a dessert and definitely worth a try.\n\nThe staff is super friendly too. Just make sure to come early or get reservations. Not surprising - it usually gets busy :)", "rating": 5, "date": "2012-03-05"}, {"excerpts": ["We ordered the kalter hund for desert to go.  ", "It looked really yummy "], "author": "Dave O.", "review": "I lived in Germany for several years so I'd like to consider myself and expert on German food...not difficult really, German food is pretty straight forward.  But this places does it well.   \n\nI had the schnitzel with spaetzle and my friend had the Jaegerschnitzel and both were very good.  Hot and crispy but not at all greasy and the spaetzle was perfect.  We ordered the kalter hund for desert to go.  It looked really yummy but I never got the chance to taste it as I left it at my friends house.  \n\nSome people mentioned a problem with the staff, they were courteous and attentive to us but I could see a little tension behind the scenes.  \n\nRegardless, it didn't effect our service or food so we'll be back.", "rating": 4, "date": "2010-11-08"}, {"excerpts": ["And Kalter Hund? "], "author": "Marco K.", "review": "I haven't had East German cuisine since... well... East Germany became history almost exactly 20 years ago. And then in the U.S.? Impossible!\n\nWalzwerk is as close as it gets! Whatever is lacking in taste - and that's pretty negligible to begin with - I attribute to differing food sources. \n\nSoljanka I thought I'd never be able to eat again. But here it is: Delicious! Thueringer Bratwurst mit Sauerkraut and Kartoffelbrei: Delicious! And Kalter Hund? Ditto!\n\nOstdeutsches Essen beim Klassenfeind? Hell yeah! Keep this place in business! I love it! Love it! Love it!", "rating": 5, "date": "2010-03-06"}], "rote grütze": [{"excerpts": ["We also ordered the Rote Grütze Berry Pudding  (sorry, no pic) which I wouldn't recommend. "], "author": "Cherylynn N.", "review": "4.5 STARS \n\nI have a love and hate relationship with large group dinners.\n\nI love being able to get together with friends who I rarely see these days because of our busy schedules. Seems like everybody and their mama is getting engaged, married, and/or knocked up on FB...except us. We're over here like, \"Heeeeeey, look at my furbaby in his OOTD\".  *le sigh*\n\nI hate organizing group dinners because finding a reasonably priced restaurant in SF that can accommodate a large group AND have easy street parking is like finding a unicorn. Then, with some restaurants you have to deal with stupid penalty charges if you have flaky friends who don't even bother texting that they can't make it. \n\nWalzwerk is that unicorn.\n\nThe East German menu is carniwhore friendly with large portions at very affordable prices. They have a private room in the back that can accommodate up to 20 people, and finding street parking in this area of the Mission is not impossible. If you have a group of 10+, there's a set dinner: sampling of all the apps and 3 shared entrees for $28 pp which is dirt cheap for SF. Beer and wine only. Reservations accepted for parties 4 or more.\n\nWe had less than 10 people so we ordered a bunch of apps, our own entrees, and shared several desserts:\n\nA P P S\n*Kartoffelpuffer: Potato pancakes w/ chive sour cream, applesauce ($7): http://bit.ly/1JsqBh4\n*Matjes Herring w/ sour cream, apples, onions, pickles, pumpernickel bread ($9): http://bit.ly/1D8XQ7L\n*Gebeizter Lachs: House cured salmon, horseradish cream, marinated beets, fitness bread ($9): http://bit.ly/1Ipa1tm\n\nThe group favorite was the potato pancakes. Sure, they were just glorified hash browns but they were delicious with the creamy sour cream and nicely tart applesauce. The herring and house cured salmon were standard. We enjoyed the accompanying marinated beets which were slightly pickle-y. Not a fan of German bread because of that grainy texture. \n\nE N T R E E S\n*Jägerschnitzel: Unbreaded porkloin w/ spätzle, creamy mushroom sauce ($16): http://bit.ly/1HYQGSP\n*Kassler: Smoked pork chop w/ mashed potatoes, brussels sprouts ($18): http://bit.ly/1ScwCUT\n\nThe entrees are the star of Walzwerk's menu. Everybody loved their entrée. They're huge, hearty, and comforting. My Jägerschnitzel (unbreaded) was tender and showered in this sinfully delicious creamy mushroom sauce (great depth of flavor). The spätzle absorbed this yummy sauce which made it even more delightful to enjoy these tiny dumplings. Highly recommended! \n\nI had a bite of the Kassler which would satisfy any pork chop lover. The thick cut pork shop was surprisingly very tender and moist with a pronounced smokiness. \n\nD E S S E R T S\n*Apfelstrudel: Filo dough filled w/ apples, raisins, nuts & brandy, vanilla ice cream, whipped cream ($7): http://bit.ly/1SL4zH0\n*Weekly Special: Bread Pudding w/ caramel sauce, whipped cream ($7): http://bit.ly/1gju9qZ\n\nDesserts were disappointing which is why I'm rounding down my rating. The Apfelstrudel tasted like an undercooked apple pie. Didn't taste any flaky layers from the supposed filo dough and the apples were still hard.\n\nThe bread pudding was better than the Apfelstrudel but just ok. We also ordered the Rote Grütze Berry Pudding  (sorry, no pic) which I wouldn't recommend. The \"pudding\" was watery and very tart. \n\nIt was packed on a Saturday night and there were only two waitresses who rocked it. They were knowledgeable and quick on their feet. They also have their sh*t together in the kitchen as we got all our dishes very timely. \n\nI've been to Walzwerk before my Yelp days and it's just as good as I remembered it. Next time, I'm going to bring an ACME baguette to sop up all that mushroom gravy deliciousness from the Jägerschnitzel. Shhhh.....", "rating": 4, "date": "2015-07-28"}, {"excerpts": ["The rote grütze (red berry pudding - raspberries, strawberries & blueberries made with cream of wheat and vanilla sauce) was a fitting finale. "], "author": "Rob P.", "review": "If you're in the mood for some unique, flavorful food in a quirky, comfortable setting, this is the place. \n\nI started with the soljanka (tomato - cabbage soup with salami, bacon & pickles), which was tangy, and delicious, with just the right amount of meat to provide flavor without making the dish too heavy. I've never had tomato soup that included a slice of lemon. But it really melded the flavors together. \n\nFor an entree, I had rinderroulade (tri-tip stuffed with bacon, pickles and mustard, spätzle and red cabbage). The meat was tinder and served in a red gravy. The spätzle was a perfect side, more interesting and flavorful than potatoes. And the cabbage provided just enough vinegary pizzazz to keep the dish interesting. \n\nThe rote grütze (red berry pudding - raspberries, strawberries & blueberries made with cream of wheat and vanilla sauce) was a fitting finale. The berry flavor was strong and refreshing. \n\nThe woman with the German accent who was serving us was very helpful and accommodating. She was obviously very proud of the food, and rightfully so. This is definitely a place I will go back to.", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["Hey they have Rote Grütze and Bionade.\n\n\n"], "author": "Dennis G.", "review": "Having grown up in Berlin and having just recently moved back (A friend of mine thought it would be funny to take me me to a German restaurant a day after i came back to SF) I have been to Suppenküche and wasn't thoroughly impressed, so I was keen to check out Walzwerk. Automatic Stars for having a pic of Erich Honecker, nothing like some DDR nostaligia! Beerwise, proper half liters like one would get in Germany, and the food was pretty good. I wish they had more Junge Pioniere (Seid bereit!) deco to really encapsulate the experience. Maybe they did, and i just did not notice cause of marathon drinking the night before and minor jetlag. Minus some points for not having fritz cola and for a northern (east) german style restaurant...Spätzle where's the Currywurst or Eisbein? These minor things can be overlooked because...Hey they have Rote Grütze and Bionade.\n\n\nI ended up getting Spätzle ha.", "rating": 4, "date": "2012-09-23"}]}