{"gomae tuna tataki": [], "kapachi hot dish": [], "miso salmon": [{"excerpts": ["I had the Hawaiian Roll, the Miso Salmon sushi, and the Baby Lobster sushi.\n\n"], "author": "Michael A.", "review": "Very innovative and fresh sushi menu!  The creativity of the menu caught my eye and in I went. \n\nI had the Hawaiian Roll, the Miso Salmon sushi, and the Baby Lobster sushi.\n\nThe presentation was top notch, and there was plenty of selection in terms of fresh seafood.  The two sushi selections were seared and well seasoned with garnish and sauce.\n\nFor those of you that don't do sushi, there's plenty of hot appetizers that looked amazing, whizzing by my table.  There is also a salad, robata, nabeyaki, and traditional food menu (labeled main dish). \n\nDespite being Friday, packed and crazy, my server Zeon still managed to be very attentive. Great!", "rating": 5, "date": "2014-01-10"}, {"excerpts": ["We ordered 6 rolls: X, Kamikaze, Martini, Miso Salmon, Crunchy CA, and Volcano. ", "As a salmon lover, the Miso Salmon roll was right up my alley. "], "author": "Sharon L.", "review": "It was my birthday, my friends told me to pick a place for dinner. I'm new to the city, but not to the Bay, so I found this place on Yelp, thought it looked pretty classy, and sent out the link so my friend could make the reservation.\n\nTuesday night, 8 pm, the restaurant is basically empty and we get our pick of tables. Now that I think about it, it's probably because the Giants' World Series game was on, although there are TVs at this restaurant too. \n\nI'll admit, the empty tables were worrisome at first, but the service was all the more attentive for it. We were immediately offered water and edamame. My friend brought a coupon for a free crunchy CA roll for a purchase over $35, which apparently can only be redeemed if you order online. But since we didn't know that, and because it was my birthday, the waiter told us that they'd honor the coupon anyway. So far, so good...\n\nWe ordered 6 rolls: X, Kamikaze, Martini, Miso Salmon, Crunchy CA, and Volcano. The Martini and Crunchy CA were fried really well and the Martini roll is actually served in a martini glass! As a salmon lover, the Miso Salmon roll was right up my alley. All the fish was very fresh.\n\nWe also ordered 3 of the soju cocktails, which were hit and miss. My passion cocktail (soju, pineapple juice, mango juice), was definitely the hit. Not very strong, but very delicious.\n\nAfter we finished--free dessert (since it was my birthday and all)! The waiter (I wish we knew his name!) brought a plate of mint chocolate and coffee ice cream mochi with some chocolate syrup in a flower pattern, and he and my friends started a round of Happy Birthday, all in different keys. Very cute, and I love both mint chocolate and coffee ice cream.\n\nGive this place a shot. I sure am glad I did, especially on an important occasion like a birthday. We're talking about returning for those $1 oysters during happy hour...", "rating": 5, "date": "2014-10-22"}, {"excerpts": ["I had the miso salmon, assorted sashimi and 6 oyster shooters. ", "All excellent and all an excellent value. ", "I'm glad I walked by and decided to go in for lunch. ", "Wendy was very nice and helpful, too. ", "Great service."], "author": "Stephen C.", "review": "Excellent lunch and happy hour specials.  I had the miso salmon, assorted sashimi and 6 oyster shooters. All excellent and all an excellent value. I'm glad I walked by and decided to go in for lunch. Wendy was very nice and helpful, too. Great service.", "rating": 5, "date": "2014-06-24"}, {"excerpts": ["Try the miso salmon! ", "It just melts in your mouth. ", "Loved it!"], "author": "Hailee K.", "review": "I've come here on numerous occasions and honestly, I don't have anything to complain about. The staff is great. Especially the owner, he's hilarious. He makes sure he does his round to see how every table is doing and converse a little. Very hands on. Impressive. \nEverything I've tried here has been a success for me. But my recent visit I tried something that I just fell in love with? Try the miso salmon! It just melts in your mouth. Loved it!", "rating": 4, "date": "2013-12-19"}, {"excerpts": ["The sushi and sashimi here was great, the miso salmon sushi is a must try. ", "Service was great and will definitely be back again!"], "author": "Kevin T.", "review": "The food is delicious and fresh here. The sushi and sashimi here was great, the miso salmon sushi is a must try. Service was great and will definitely be back again!", "rating": 5, "date": "2014-01-17"}], "shooter tasting": [{"excerpts": ["Also, their Shooter Tasting is to die for. ", "A little bit of everything on each spoon for you to try! ", "What else can you ask for?"], "author": "Darrin L.", "review": "Great service. Fast. Great specialties. Fresh fish. What else can you ask for.\n\nI love their Toro Tartare. Taste so fresh and automatically melts in your mouth.\n\nThey also have a special fried rice which absolutely mind blowing. (Mix in some fresh wasabi!)\n\nAlso, their Shooter Tasting is to die for. A little bit of everything on each spoon for you to try! What else can you ask for?", "rating": 5, "date": "2014-05-21"}, {"excerpts": ["PS if you like uni and ankimo get the shooter tasting... ", "It's to die for"], "author": "Patrick N.", "review": "Wow!!! That is all I can say. The fish... Fresh. The ambiance... Beautiful. The chefs Jesse and Dragon (I think that's his name) were amazing. Not only were their dish captivating but their preparation was impeccable. Definitely coming back. PS if you like uni and ankimo get the shooter tasting... It's to die for", "rating": 5, "date": "2013-12-17"}], "golden eye": [{"excerpts": ["and we really like the golden eye and the salmon and tuna tartare.  ", "This time we also got the volcano roll which is our new favorite."], "author": "Mike E.", "review": "The food is good but the service was a bit slow.  This is are second time here and we really like the golden eye and the salmon and tuna tartare.  This time we also got the volcano roll which is our new favorite.", "rating": 3, "date": "2013-08-17"}, {"excerpts": ["The food was nothing short of excellent, particularly the sashimi sampler and the AMAZING Golden Eye, which a salmon wrap with snow crab, shiso, mango and tobiko. ", "Quite possibly the most delicious thing I've ever eaten. ", "Our waitress, Wendy, was incredibly knowledgeable and gave us very helpful tips, including which things really shouldn't be dipped in soy sauce so that their flavor could be properly savored. ", "They also have REAL WASABI in addition to the paste ", "one almost always gets, which is a nice treat. ", "We were actually the only customers there, which was sad and in due in part to the war zone of the Castro, which is being completely torn up and renovated these days, so I can't speak for how the service might be if it was crowded but "], "author": "James W.", "review": "I live in the Castro and I've avoided going into this place because I honestly thought it looked tacky, but we decided to give it a whirl last night and boy am I glad we did! The food was nothing short of excellent, particularly the sashimi sampler and the AMAZING Golden Eye, which a salmon wrap with snow crab, shiso, mango and tobiko. Quite possibly the most delicious thing I've ever eaten. Our waitress, Wendy, was incredibly knowledgeable and gave us very helpful tips, including which things really shouldn't be dipped in soy sauce so that their flavor could be properly savored. They also have REAL WASABI in addition to the paste one almost always gets, which is a nice treat. We were actually the only customers there, which was sad and in due in part to the war zone of the Castro, which is being completely torn up and renovated these days, so I can't speak for how the service might be if it was crowded but for us it was perfect. \n\nSo we gorged on a lot of food and had a $30 bottle of sake that seemed magically bottomless, and the meal came to $100 for the two of us, which seems very reasonable. We will definitely be back! I'm surprised to see so many negative reviews here. I'm giving it 4 stars instead of 5 only because we're in San Francisco and that does not do justice to the truly extraordinary restaurants we have here.", "rating": 4, "date": "2014-04-15"}], "seared yellow tail": [], "salmon tuna tartare": [{"excerpts": ["The salmon tuna tartare is to die for."], "author": "Jordan J.", "review": "This is a reliably excellent sushi restaurant and I feel lucky to have them just up the street from my house. We have gotten takeout  from them many, many times over the years and the fish is perfectly fresh every time. The salmon tuna tartare is to die for.", "rating": 5, "date": "2018-08-07"}], "spicy tuna tartare": [], "yuzu hirame": [{"excerpts": ["Traditional dishes with a twist like Yuzu Hirame and Garlic Edamame was very delicious.  ", "Good assortment and very fresh sashimi.  ", "Ask server for fresh grated wasabi!  ", "Ankimo was very creamy.  ", "I think they are still improving their menu, but I think they would do well with more specialty dishes like the Yuzu Hirame and more sashimi and oyster options.\n\n"], "author": "Jenny K.", "review": "Strengths:  Traditional dishes with a twist like Yuzu Hirame and Garlic Edamame was very delicious.  Good assortment and very fresh sashimi.  Ask server for fresh grated wasabi!  Ankimo was very creamy.  Sparkling sake?---instant fan!\n\nWeaknesses:  The restaurant is a lot bigger after the remodel and feels a little less personal, but now it is updated, open, and comfortable.  On the flip side...this makes a great place to have a large party.\n\nOpportunities:  I think they are still improving their menu, but I think they would do well with more specialty dishes like the Yuzu Hirame and more sashimi and oyster options.\n\nThreats:  At least 10 other sushi places within 4 blocks, where do I start?  \n\nTotal:  $120 for 2 ppl with drinks...quite a few are those darn sparkling sake.", "rating": 4, "date": "2012-10-23"}], "sashimi regular  pcs": [], "sashimi deluxe  pcs": [], "snow crab temaki": [{"excerpts": ["just don't ever order Ramen as I guess it isn't this place's strong area, though I had the chance to try the Snow Crab Temaki which I thought it is quite impressive."], "author": "Skyler Z.", "review": "I've been here a couple times and the service alone were consistently professional, the food were are ok just don't ever order Ramen as I guess it isn't this place's strong area, though I had the chance to try the Snow Crab Temaki which I thought it is quite impressive.", "rating": 3, "date": "2018-08-11"}], "unagi cucumber temaki": [], "hamachi and green onion temaki": [], "salmon skin and cucumber temaki": [], "spicy tuna and cucumber temaki": [], "spider temaki  pcs": [], "ebi and cucumber temaki": [], "madai sushi": [], "walu sushi": [{"excerpts": ["I HIGHLY recommend their seared walu sushi-succulent, tasty, buttery, orgy and heaven in your mouth awesomeness.\n\n"], "author": "Jan R.", "review": "If I had to pick a sushi/Japanese restaurant in the Castro district, it'd be Wasabi Bistro. \n\nI pride myself in thinking that I'm somewhat of a sushi connoisseur, and in terms of taste, service, decor and price(not that this place is cheap, because it's definitely not).\n\nValue wise, they have an excellent happy hour menu: $1 oysters, $5 tempura $4 gyozas, a real bang for your buck. Moreover, their happy hour starts at 11:30am, which is unheard of.\n\nI recommend their 3pcs/ or 6pcs Omakase menu in order to enjoy the best and tastiest sushi they offer.\n\nI HIGHLY recommend their seared walu sushi-succulent, tasty, buttery, orgy and heaven in your mouth awesomeness.\n\nAs of right now, I'm the \"duke\" of Osaka sushi, which is a far cry from what Wasabi Bistro is. It's just that the later is right across from my work and I rather not walk further.\n\nI strongly recommend you to try this place. Great food, Assertive service and has a modern touch in its decor.\n\n5 stars!", "rating": 5, "date": "2014-06-19"}], "amae ebi sushi": [], "blue shrimp sushi": [], "ikura with quail egg sushi": [], "tobiko with quail egg sushi": [], "uni sushi": [], "hamachi sashimi": [], "hirame sashimi": [{"excerpts": ["I loved the Truffle Oil infused Hirame Sashimi & Ankimo.  ", "Great selection on Sake.  ", "Most of all, the service was excellent.  \n", "Found out they have happy hour starting at 11am with $1 oyster.  ", "I will definitely go back again for their happy hour."], "author": "W W.", "review": "This place is awesome! I was there with two of my friends last night. The sashimi was super fresh and nicely presented. The rolls we tried were delicious. I loved the Truffle Oil infused Hirame Sashimi & Ankimo.  Great selection on Sake.  Most of all, the service was excellent.  \nFound out they have happy hour starting at 11am with $1 oyster.  I will definitely go back again for their happy hour.", "rating": 5, "date": "2013-05-11"}], "hotate sashimi": [], "madai sashimi": [], "maguro sashimi": [], "tako sashimi": [], "walu sashimi": [], "castro roll": [{"excerpts": ["Serena was extremely helpful with not only navigating the menu but has also suggested great choices with what to get with friends: \n\n- Castro roll. \n"], "author": "Dave S.", "review": "Serena was extremely helpful with not only navigating the menu but has also suggested great choices with what to get with friends: \n\n- Castro roll. \n- hamachi Kama\n- chef's sashimi\n- Hamachi Temaki\n- Spicy Tuna\n- Tempura\n\nAll of these choices were spot on and very tasty. The sale was potent and a treat to have!\n\nIt's a great place to hang and get sushi deep in the Castro.", "rating": 5, "date": "2018-01-10"}, {"excerpts": ["The Castro roll, snow crab hand roll and of course the crazy roll with hamachi on top is mouth watering. ", "We'll be back soon!"], "author": "LeNiece V.", "review": "I love coming here, everytime I do the service and food are amazing!  Sara is an asset to the team and always makes it a great experience for us. \n\nThe Castro roll, snow crab hand roll and of course the crazy roll with hamachi on top is mouth watering. We'll be back soon!", "rating": 5, "date": "2017-11-14"}, {"excerpts": ["He got the chicken miso ramen and I got the Castro Roll", "..", "well..when in Castro right?!  ", "The Castro roll was spicy crab, avocado, cucumber, jalapeno and Suzuki (waiter described it to me as like a butterfish) and a special spicy sauce.  ", "Veggie gyoza was nice and crisp but not greasy filled with delightful veggies.  ", "My Castro roll was huge and yes indeed, spicy!  ", "The seafood was fresh and it was a great roll.  ", "However, after I ate a few pieces, I noticed a hair ontop of one of the pieces..ugh..and I don't think it was mine.  ", "But this happens at so many restaurants ", "so I won't hold them too accountable for it.  ", "He enjoyed his huge bowl of ramen.  "], "author": "Cat C.", "review": "Sexy, shiny lounge like decor..think Carbon Lounge on Bay Street sorta.  We were too late for happy hour but we picked Wasabi Bistro due to location, and the good reviews.  Also, because my friend wanted ramen, and I wanted some sushi or other non-noodle options.  \n\nWe shared the veggie gyoza.  He got the chicken miso ramen and I got the Castro Roll..well..when in Castro right?!  The Castro roll was spicy crab, avocado, cucumber, jalapeno and Suzuki (waiter described it to me as like a butterfish) and a special spicy sauce.  Veggie gyoza was nice and crisp but not greasy filled with delightful veggies.  My Castro roll was huge and yes indeed, spicy!  The seafood was fresh and it was a great roll.  However, after I ate a few pieces, I noticed a hair ontop of one of the pieces..ugh..and I don't think it was mine.  But this happens at so many restaurants so I won't hold them too accountable for it.  He enjoyed his huge bowl of ramen.  I like how Wasabi Bistro offers a lot of alternatives for SF's diverse clientele - veggie options, soy paper options for sushi, etc. \n\nService was friendly and good, but then as they got busier a little less attentive.  Prices are a little on the higher side.  I would give them somewhere between a 3.25 - 3.5.  I would be game for coming again for some more rolls and drinks if I needed to meet up with him in the Castro area again.", "rating": 3, "date": "2015-02-27"}, {"excerpts": ["We had miso soup, which was remarkably tasty, and three rolls (Pink Lady, Tiger Roll, and Castro Roll), all of which were exceptionally good.\n\n"], "author": "Russell M.", "review": "The food at Wasabi Bistro is quite good. We had miso soup, which was remarkably tasty, and three rolls (Pink Lady, Tiger Roll, and Castro Roll), all of which were exceptionally good.\n\nThe reason for only three stars instead of five was the noise. This restaurant has almost no noise-absorbing material at all -- except the diners' clothes. Fewer than half the tables were occupied, yet we had to shout across the table to carry on a conversation. The owners must have spent a great deal of money on renovating this place (which used to be a chinese restaurant with a takeout counter), and it looks quite nice. Yet they seem to have spent zero dollars on making it a pleasant place for a meal with friends.\n\nI'll probably go back to Wasabi Bistro -- but I'll carefully choose a time when it is nearly empty of other guests.", "rating": 3, "date": "2015-07-07"}, {"excerpts": ["Castro roll\n3) ", "Grisly tough toro tartare with overripe avocados for $18 !!!!!\n", "4) ", "A mound tofu chunks\n5) "], "author": "Jill T.", "review": "1) Overly salty miso soup\n2) Butane soaked Castro roll\n3) Grisly tough toro tartare with overripe avocados for $18 !!!!!\n4) A mound tofu chunks\n5) Scallops that were so badly over cooked they could have been used as bouncy balls.\n\nThere was one roll that was ok at best but I can't remember the name of it. \n\nWe should have know since it was empty on a Friday night and we were trying to wait out the traffic. Ugh. \n\nThe food was pretty awful. The atmosphere was weird. Loud lounge music, a basketball game on, and some chick flick on another TV. It was a sureal strange scene! I don't think I ever want to repeat.", "rating": 1, "date": "2013-12-07"}, {"excerpts": ["Also, the special Castro Roll tastes like lighter fluid."], "author": "Morris R.", "review": "My sushi was covered in fruit flies. Also, the special Castro Roll tastes like lighter fluid.", "rating": 2, "date": "2013-09-07"}, {"excerpts": ["The Castro roll is amazing as are all the other speciality rolls we've had over the past several visits. ", "We've been twice on this visit to SF alone."], "author": "Michael G.", "review": "Always have had a great experience here! On our last visit the server remembered us and reminded us what we had the time before. The Castro roll is amazing as are all the other speciality rolls we've had over the past several visits. We've been twice on this visit to SF alone.", "rating": 4, "date": "2015-02-26"}, {"excerpts": ["The castro roll is my FAV! ", "The fried calamari is finger licking good!!!"], "author": "Fiona S.", "review": "Excellent service! The castro roll is my FAV! The fried calamari is finger licking good!!!", "rating": 5, "date": "2015-10-28"}], "crunch unagi roll": [{"excerpts": ["I got the Crunch Unagi Roll which took a bit to be served. ", "I was fine because it had to be deep fried which as long as there's reason ", "then I'm fine. "], "author": "Kathleen M.", "review": "The waiter we had was very nice! He reminded me of the kpop singer name Jay Park. His service actually made the experience a lot better. He was nice that he apologized for my roll taking long, complimented my makeup and how he liked how white my teeth was all through out the day. The temperature of the restaurant was alittle humid for me. The appearance of the place was very classy and beautiful. One con about the restaurant is that their toilets are not the best at flushing! Haha, I attempted to flush 4 times because the toilet seat cover wouldn't go down. \n \nThe prices here are the same price as any other sushi restaurants. The highest roll is around $12 and the Sashimi is around $16. The rolls were not the best sushi we tasted. The sushi is quite mediocre and the presentation of it was unevenly cut. I got the Crunch Unagi Roll which took a bit to be served. I was fine because it had to be deep fried which as long as there's reason then I'm fine. The other rolls which tasted very basic were the Tempura roll & Spicy Tuna roll. \n\nThe restaurant's sushi is good for just a quick lunch break. If you're looking for a very flavorful tasting sushi or something that stands out, this may not be the best fit. Overall it was a decent experience.", "rating": 3, "date": "2016-02-15"}, {"excerpts": ["My fav roll is the California crunch and bae likes the crunch unagi roll which are about $22 total after tax. ", "The location is great, a little further up Castro and  18th street by Oz pizza (which I also recommend)."], "author": "Mel L.", "review": "out of all the sushi places in the Castro this is by far bae and I's fav place.\n\npros: friendly service, classy venue, large selection of sake, fresh quality rolls made by sushi chefs in front of you, a few tvs that support local sports teams, and two bathrooms. You can also order online and the delivery few is free with a $25 purchase. They even have a happy hour who doesn't love those!\n\nMy fav roll is the California crunch and bae likes the crunch unagi roll which are about $22 total after tax. The location is great, a little further up Castro and  18th street by Oz pizza (which I also recommend).", "rating": 4, "date": "2016-06-04"}, {"excerpts": ["This place is amazing, crunch unagi roll and x roll are s'gooood. ", "Delivery is pretty great too, always prompt."], "author": "Dinero A.", "review": "This place is amazing, crunch unagi roll and x roll are s'gooood. Delivery is pretty great too, always prompt.", "rating": 5, "date": "2014-11-13"}], "q madness roll": [], "scallop love roll": [], "iris roll": [], "kamikaze roll": [], "mango tango roll": [{"excerpts": ["We got some weird mango tango roll that was super disgusting...", "I had two pieces of it and tried to pawn it off to other people."], "author": "Anthony N.", "review": "It was super nice and shiny inside, but the food wasn't very good..\n\nand there was a bone in the sashimi...which is so wrong on so many levels..\n\nI just kept thinking how many times they've reused that swirled fish body decoration on the plate...I point this out because the type of fish wasn't any of the kind of sashimi that was ordered...and the waiter awkwardly took it away which i thought was fishy...haha fishy get it?\n\nWe got some weird mango tango roll that was super disgusting...I had two pieces of it and tried to pawn it off to other people.", "rating": 2, "date": "2013-03-04"}], "martini roll": [{"excerpts": ["The Martini and Crunchy CA were fried really well and the Martini roll is actually served in a martini glass! "], "author": "Sharon L.", "review": "It was my birthday, my friends told me to pick a place for dinner. I'm new to the city, but not to the Bay, so I found this place on Yelp, thought it looked pretty classy, and sent out the link so my friend could make the reservation.\n\nTuesday night, 8 pm, the restaurant is basically empty and we get our pick of tables. Now that I think about it, it's probably because the Giants' World Series game was on, although there are TVs at this restaurant too. \n\nI'll admit, the empty tables were worrisome at first, but the service was all the more attentive for it. We were immediately offered water and edamame. My friend brought a coupon for a free crunchy CA roll for a purchase over $35, which apparently can only be redeemed if you order online. But since we didn't know that, and because it was my birthday, the waiter told us that they'd honor the coupon anyway. So far, so good...\n\nWe ordered 6 rolls: X, Kamikaze, Martini, Miso Salmon, Crunchy CA, and Volcano. The Martini and Crunchy CA were fried really well and the Martini roll is actually served in a martini glass! As a salmon lover, the Miso Salmon roll was right up my alley. All the fish was very fresh.\n\nWe also ordered 3 of the soju cocktails, which were hit and miss. My passion cocktail (soju, pineapple juice, mango juice), was definitely the hit. Not very strong, but very delicious.\n\nAfter we finished--free dessert (since it was my birthday and all)! The waiter (I wish we knew his name!) brought a plate of mint chocolate and coffee ice cream mochi with some chocolate syrup in a flower pattern, and he and my friends started a round of Happy Birthday, all in different keys. Very cute, and I love both mint chocolate and coffee ice cream.\n\nGive this place a shot. I sure am glad I did, especially on an important occasion like a birthday. We're talking about returning for those $1 oysters during happy hour...", "rating": 5, "date": "2014-10-22"}], "pink lady roll": [{"excerpts": ["Ordered were the beef robata, smoked salmon, akimo (monk liver fish), chicken karaage (not on menu), chicken teriyaki, pink lady roll, and several other rolls that I cannot remember.    \n\n", "Most of the food was OK in taste except for the pink lady roll.  ", "The roll is served with some odd sauce over the salmon layer.   "], "author": "Marck N.", "review": "After a leisurely day, my friends and I dined here for our first dinner of 2013.   We shared several plates and rolls.   Ordered were the beef robata, smoked salmon, akimo (monk liver fish), chicken karaage (not on menu), chicken teriyaki, pink lady roll, and several other rolls that I cannot remember.    \n\nMost of the food was OK in taste except for the pink lady roll.  The roll is served with some odd sauce over the salmon layer.   The sauce was not to my liking.  \n\nService was slow that evening, though it wasn't really crowded. I would say it was a little over half capacity.  Our server though was very good, as she was attentive to what we ordered.  She provided an extra large salad and 4 miso soups for our (at the time) 1 plate order. And she also corrected the chicken karaage portion size, as she noticed they brought out an appetizer portion.", "rating": 3, "date": "2013-01-03"}], "san francisco roll": [], "super dynamite roll": [], "asparagus maki roll": [], "asparagus and shitake roll": [], "avocado maki roll": [], "kappa maki roll": [], "vegetable dragon roll": [], "garlic edamame salad": [], "seafood poke salad": [], "steamed clams soup no broth": [], "miso clams soup": [], "curry chicken katsu": [], "curry tonkatsu": [], "curry seafood": [], "asparagus beef skewers": [], "bacon scallop skewers": [], "bacon enoki skewers": [], "bacon cherry tomato skewers": [], "beef short ribs skewers": [], "grilled asparagus skewers": [], "lamb chop skewers": [{"excerpts": ["Additionally, I also enjoyed the sushito peppers, seared fish, lamb chop skewers, toro, and chicken karaage. \n\n"], "author": "Julia L.", "review": "Truly enjoyed my dining experience at Wasabi Bistro! I came with a large party and the servers were attentive and made sure that we were taken care of.\n\nSalmon sashimi is my absolute favorite and this place has it fresh and oishii. Additionally, I also enjoyed the sushito peppers, seared fish, lamb chop skewers, toro, and chicken karaage. \n\nIt was such a wonderful dinner that I found myself thinking about it the next day and wished that I could eat the meal all over again. Good thing my wish isn't unattainable and I can pay Wasabi Bistro another visit.\n\nwasabi bistro\ncozy place for a nice meal\nparty in your mouth\n~haiku", "rating": 5, "date": "2018-04-14"}], "rainbow shrimp skewers": [], "stuffed mushroom skewers": [], "vegetarian lover skewers": [], "yakibuta pork skewers": [], "yakitori skewers": [], "miso chicken main dish": [], "miso salmon main dish": [], "miso glazed sea bass main dish": [], "new york steak teriyaki main dish": [], "salmon teriyaki main dish": [], "unaju don main dish": [], "salmon shioyaki main dish": [], "tuna donburi main dish": [], "salmon donburi main dish": [], "katsu donburi main dish": [], "niku donburi main dish": [], "curry chicken katsu main dish": [], "curry tonkatsu main dish": [], "curry beef main dish": [], "curry seafood main dish": [], "tempura main dish": [], "chicken yaki soba": [], "chicken yaki udon": [], "seafood yaki udon": [], "seafood yaki soba": [], "pork ramen": [{"excerpts": ["The main event came with the $11 bowl of Pork Ramen, which came in a white designer bowl more fitting as part of a Danish modern place setting. ", "The surprise was how delicious it was with slices of rolled roast pork generously swimming in the hearty broth alongside bamboo shoots and bean sprouts (see photo). ", "I had every reason to believe it was going to be a noodle disaster, but far from it, I think I may come back just for that again. "], "author": "Ed U.", "review": "How fabulously swanky and perfectly appropriate Wasabi Bistro is for the Castro where everything just needs to be, well, fabulous. At least that's the impression I got when I entered the doors of this new Japanese eatery, the one that took over All Season Sushi. I came at about 8PM on a Wednesday after a rather long day at work, and the place was still moderately busy. I was seated in the bar area where there were plenty of empty two-tops. It should come as no surprise that the decor was dominated by black lacquer, high-end light fixtures and lots of mirrors.\n\nIt was like eating at Liberace's Vegas showroom. Like I said...fabulous. Complimentary edamame arrived almost as soon as I sat down (see photo). While I was squeezing the beans into my mouth one pod at at time, I kept noticing how the menu went on for days as it was dominated by quite an eclectic collection of sushi and rolls. I always feel guilty ordering an elaborate sushi plate just for myself, so I went modest and ordered the $6.50 Spicy Tuna Roll (see photo) - simple, risk-averse and to the point. It was just fine as a starter.\n\nThe main event came with the $11 bowl of Pork Ramen, which came in a white designer bowl more fitting as part of a Danish modern place setting. The surprise was how delicious it was with slices of rolled roast pork generously swimming in the hearty broth alongside bamboo shoots and bean sprouts (see photo). I had every reason to believe it was going to be a noodle disaster, but far from it, I think I may come back just for that again. I'm also tempted to try tantalizing side dishes like wasabi scallop, tofu steak or any of the robata since I like the challenge of skewers when I eat.\n\nFOOD - 4 stars...killer ramen bowl is a major surprise worth trying here\nAMBIANCE - 3.5 stars...just fabulous...it's the Castro, sweetie\nSERVICE - 3.5 stars...on the quiet side\nTOTAL - 4 stars...makes me want to try some more", "rating": 4, "date": "2013-03-04"}, {"excerpts": ["I ordered the pork ramen and it was delivered cold and no noodles. \n", "Haven't been back and won't go back. \n", "Between my experience and a mile long list of horror stories from friends we'd much rather go elsewhere."], "author": "Jake S.", "review": "I ordered the pork ramen and it was delivered cold and no noodles. \nHaven't been back and won't go back. \nBetween my experience and a mile long list of horror stories from friends we'd much rather go elsewhere.", "rating": 1, "date": "2014-04-08"}], "tori udon": [], "vegetable yaki soba": [], "vegetable yaki udon": [], "baked oyster": [], "baked mussel": [], "jalapeno hopa": [], "miso eggplant": [], "miso sea bass": [], "pine nuts shrimp": [], "seared scallop": [], "tofu steak": [{"excerpts": ["I'm also tempted to try tantalizing side dishes like wasabi scallop, tofu steak or any of the robata since I like the challenge of skewers when I eat.\n\n"], "author": "Ed U.", "review": "How fabulously swanky and perfectly appropriate Wasabi Bistro is for the Castro where everything just needs to be, well, fabulous. At least that's the impression I got when I entered the doors of this new Japanese eatery, the one that took over All Season Sushi. I came at about 8PM on a Wednesday after a rather long day at work, and the place was still moderately busy. I was seated in the bar area where there were plenty of empty two-tops. It should come as no surprise that the decor was dominated by black lacquer, high-end light fixtures and lots of mirrors.\n\nIt was like eating at Liberace's Vegas showroom. Like I said...fabulous. Complimentary edamame arrived almost as soon as I sat down (see photo). While I was squeezing the beans into my mouth one pod at at time, I kept noticing how the menu went on for days as it was dominated by quite an eclectic collection of sushi and rolls. I always feel guilty ordering an elaborate sushi plate just for myself, so I went modest and ordered the $6.50 Spicy Tuna Roll (see photo) - simple, risk-averse and to the point. It was just fine as a starter.\n\nThe main event came with the $11 bowl of Pork Ramen, which came in a white designer bowl more fitting as part of a Danish modern place setting. The surprise was how delicious it was with slices of rolled roast pork generously swimming in the hearty broth alongside bamboo shoots and bean sprouts (see photo). I had every reason to believe it was going to be a noodle disaster, but far from it, I think I may come back just for that again. I'm also tempted to try tantalizing side dishes like wasabi scallop, tofu steak or any of the robata since I like the challenge of skewers when I eat.\n\nFOOD - 4 stars...killer ramen bowl is a major surprise worth trying here\nAMBIANCE - 3.5 stars...just fabulous...it's the Castro, sweetie\nSERVICE - 3.5 stars...on the quiet side\nTOTAL - 4 stars...makes me want to try some more", "rating": 4, "date": "2013-03-04"}, {"excerpts": ["The tofu steak was drowning in a sea of soy sauce and was too salty for me.  ", "It was also crisp outside but mushy inside.  ", "I would expect firm tofu to call this a steak. ", "My sense is that the chef added it to the menu just to please vegetarians but does not really care how it tastes. ", "The veggie dragon roll was pretty bland and the ratio of rice was too high. "], "author": "Ryder M.", "review": "I was a little disappointed by the food at this price level.  The only dish I would eat again was the fried tempura which deserves 4 to 5 stars.  The service and atmosphere were also good.  I'll also mention that being vegan I ordered all vegetable rolls and dishes. \n\nThe tofu steak was drowning in a sea of soy sauce and was too salty for me.  It was also crisp outside but mushy inside.  I would expect firm tofu to call this a steak. My sense is that the chef added it to the menu just to please vegetarians but does not really care how it tastes. The veggie dragon roll was pretty bland and the ratio of rice was too high. It was like eating plain rice garnished with a little avocado. \n\nNext the potstickers were mushy and the dipping sauce way too salty for this dog. With tip the meal was close to $50 and was generally disappointing due to the food alone.", "rating": 2, "date": "2014-06-15"}], "vegetable gyoza": [], "wasabi garlic prawn": [], "mineral sparking water": []}