{"buttermilk fried calamari rock shrimp  fennel": [], "maine lobster risotto": [{"excerpts": ["I had the Maine Lobster Risotto (on the appetizer menu ", "but it  was plenty of food for me) ", "and it was phenomenal. "], "author": "Victoria C.", "review": "I'm surprised by the low rating for Waterfront, because I had a fantastic experience.\n\nThere's an outdoor heated seating area that has an awesome view of the Bay Bridge. We opted to sit inside, which was beautifully decorated for the holiday season. \n\nThe staff was more than accommodating of our group of 13 trickling in to fill up the table, especially without a reservation. Complementary bread and butter kicked off the meal. Our food came out pretty quickly. I had the Maine Lobster Risotto (on the appetizer menu but it  was plenty of food for me) and it was phenomenal. I tried some of my friend's Roasted Chicken Breast, which was also delicious.\n\nGreat service, great food, and great ambiance. This was an awesome place to show off San Francisco's dining scene to our out of town friends!", "rating": 5, "date": "2015-12-21"}, {"excerpts": ["I ordered the maine lobster risotto. ", "It was delicious. ", "I love risotto and it was definitely made well and lobster. ", "YUM! "], "author": "Nina Y.", "review": "Came here for a recruiting dinner. Maybe because there were other tables on the top floor that were spending more money - on alcohol and food - but I feel like we didn't get great service. \n\nI ordered the maine lobster risotto. It was delicious. I love risotto and it was definitely made well and lobster. YUM! I did wish they had a big claw of it or something, but the pieces in it weren't bad. \n\nThe main course - the tenderloin - was delicious too. I really enjoyed that piece of meat. \n\nNo dessert for us though. Shame. \n\nI'll have to try it for happy hour at some point in time.", "rating": 3, "date": "2014-04-26"}], "grilled pancetta wrapped prawns": [{"excerpts": ["I like the grilled pancetta wrapped prawns \n"], "author": "Dani D.", "review": "Came awhile ago.Yea,wow that really helps with helping you decide on whether to go now. Hey,the view,company,drinks and good conversation may do the trick to come over to the Waterfront and try it out. \n\nI was lucky enough to go for an early lunch(a treat).We go there and the place wasn't even that busy yet.Not really and we sat near the patio,but inisde.I thought that would be nice to come on the weekend and sit and relax out there(yeah right,can I wear converse). \n\nAnyway,the waitress was nice and patient.The place was clean and even though people started coming in our waitress was still on a roll. \n\nI like the grilled pancetta wrapped prawns \nThe crab cakes were ok \n\nMy main course I decided on Grilled Hanger Steak & frites balsamic onions. I also had the delicious crab mashed potatoes.Yep,those were some luscious tasting carbs that I stuffed myself silly with. \n\nVery,very good.The service overall was great and for dessert I think I had some sticky toffee pudding...they had several selections of desserts to make a choice from,but by this time my button was ready to pop on my pants and I was ready to go...go,not back to work but go home and take a nap. \n\nWaterfront I thought was nice. Dressy/casual,I would say yes,but come as you are and see if they have the nerve to let you not come in. \n\nI think it may be casual.", "rating": 3, "date": "2010-01-18"}, {"excerpts": ["Grilled Pancetta Wrapped Prawns, White Bean Truffle Ragout \n", "I couldn't stop eating these. "], "author": "Kristen E.", "review": "I've come here for an early dinner/appetizers twice.. Both for 4th of July weekends 2010 and 2008 and I have to say I had a very pleasurable experience BOTH TIMES. Good food and good service. \n\nWe walked in and they seated us on the patio as we requested. The view was incredible and the evening was a fabulous way to start the first day in San Francisco after several years of not being here.. It was sunny and hot till about 8:30 \n\nAs the evening breeze came up we asked the bus boy if he could move the heater lamp by us cause it was getting cold. He did so, no questions asked and when he couldn't get it to lite, he got additional help. \n\nOur waitress came over and took our drink order immediately. I wasn't sure how I was going to like the waitress cause she came off a little abrupt at first, (I think there was a culture barrier I might have had) but when we got to talking, she was actually really accommodating and we were glad we stayed. \n\nWe ordered: \n\n1) Buttermilk Fried Calamari, Rock Shrimp, Fennel & Spicy Aioli \nThis is one of my favorites here. It is soo incredibly good and fresh. We ordered a second round. We always order this when we come here. \n\n2) Grilled Pancetta Wrapped Prawns, White Bean Truffle Ragout \nI couldn't stop eating these. Like with the Calamari, we ordered 2 or 3 of these. \n\n3) Dungeness Crab Cakes, Mache, Meyer Lemon Aioli \nThis was delicious and full of fresh crab. Didn't have all that filler that a lot of restaurants use to save on the expense of crab meat.", "rating": 4, "date": "2010-07-26"}], "manila clams": [{"excerpts": ["I loved their manila clams appetizer. ", "Broth was flavorful, portion was large, great for sharing. \n", "Their cioppino was a bit dissapointing, fell short of sotto mare or even tadich grill. ", "Portion was big, with crabs legs, shrimps, clams, etc, so it is still a great dish, but It lacked flavor and seafood tasted a bit bland. \n", "Overall, if you want great seafood on the embarcadero, I would head to Pier 23. ", "If you want something fancier, head to Waterbar."], "author": "Nancy Z.", "review": "This place is more of a 3.5 stars. \nI loved their manila clams appetizer. Broth was flavorful, portion was large, great for sharing. \nTheir cioppino was a bit dissapointing, fell short of sotto mare or even tadich grill. Portion was big, with crabs legs, shrimps, clams, etc, so it is still a great dish, but It lacked flavor and seafood tasted a bit bland. \nOverall, if you want great seafood on the embarcadero, I would head to Pier 23. If you want something fancier, head to Waterbar.", "rating": 3, "date": "2013-08-30"}, {"excerpts": ["Manila clams : 4 stars. ", "Good. ", "Almost too much portion for appetizer. ", "Came with burnt toasts \nLobster mac & cheese : 1 star. ", "Bland ! ", "No cheese & salt,  but cream \nCarmel ice cream : 1 star.  ", "Too sweet to me. ", "Had bubbles cuz it's half way melted. \n \n"], "author": "H R.", "review": "One star for the view and one star for the \"Not horrible but ok\" food.\n\nWe came here for dinner. \n\nFirst of all, waiter took our order without writing down. 2 of us order 6 small dishes (and desserts later). I repeated my order twice, just to be sure. \nAs I expected, he forgot my lobster mac & cheese. I wish I had balls to say \"if you can't remember, write those down! \" He was nice but NOT GOOD.\nHe brought it shortly, but he brought Lobster risotto. Then the other guy brought me a correct dish. Confused. \nAfter all, lobster mac & cheese was so tasteless I should've cancelled it. \nYelp reviews are not always right to your taste. \n\nCrab cakes : 3 stars. Good but nothing special. Had a crab bone in it. Aioli was bland. \nManila clams : 4 stars. Good. Almost too much portion for appetizer. Came with burnt toasts \nLobster mac & cheese : 1 star. Bland ! No cheese & salt,  but cream \nCarmel ice cream : 1 star.  Too sweet to me. Had bubbles cuz it's half way melted. \n \nI split the bill w my friend who had Ahi tuna tar tar, Caesar salad, Asparagus, Sorbet and a glass of white wine, my share, w 15% tips, was $71.\n\nBottom line,\"overpriced\".  Everything should be at least 20% cheaper for these mediocre food. A typical tourist ripoff restaurant with wonderful location and view. \n\nThank God ! I found a street parking. Other wise, I would've spent another $14 (valet parking) for this dinner !\n \nBy the way, to the management of the restaurant, was our bill included gratuity ?  We forgot to pay attention to it. Now I suspect if we added 15% extra tip for the bad service to our already gratuity added bill.", "rating": 2, "date": "2014-05-11"}], "ahu tuna tartare": [], "beef tartar and fries": [], "marin miyagi": [{"excerpts": ["The oysters of the day were the Marin Miyagi. ", "They are pretty small, but very tasty. ", "Ceviche is pretty light, citrusy, and really adds to the meal. ", "The grilled prawns were juicy and tender. ", "From the prix fixe menu, there is the smoked fish croquette, the seared Hawaiian ono comes with terragon peas and...a slice of disappointment. ", "The peas are so crisp and buttery, and I could probably just order the peas as a side. ", "Unfortunately, the bread on that dish was burnt and soaked in oil. ", "At the end we ended up leaving the bread alone. ", "The smoked fish croquette was deep fried goodness. ", "The prix fixe ends with a chocolate pavlova. ", "The raspberries, cream, and chocolate cream were amazing but the meringue did not. ", "The prix fixe  menu does well for the price point. ", "Most of what we ordered was great, and while the meringue and bread detract from what we had overall, I still really enjoyed my meal here and would love to come back."], "author": "Ophelia K.", "review": "I had a great time at the Waterfront earlier for lunch during happy hour! The view is beautiful and the service was very attentive and accomodating.  The server provided bread and butter with crushed salt on top as a way to start off the meal, which I really appreciated.\n\nWe ordered a dozen $1 oysters, the Prix Fixe (3 course meal), the ceviche, and the grilled prawns. Everything came quickly and the presentation is on point. The oysters of the day were the Marin Miyagi. They are pretty small, but very tasty. Ceviche is pretty light, citrusy, and really adds to the meal. The grilled prawns were juicy and tender. From the prix fixe menu, there is the smoked fish croquette, the seared Hawaiian ono comes with terragon peas and...a slice of disappointment. The peas are so crisp and buttery, and I could probably just order the peas as a side. Unfortunately, the bread on that dish was burnt and soaked in oil. At the end we ended up leaving the bread alone. The smoked fish croquette was deep fried goodness. The prix fixe ends with a chocolate pavlova. The raspberries, cream, and chocolate cream were amazing but the meringue did not. The prix fixe  menu does well for the price point. Most of what we ordered was great, and while the meringue and bread detract from what we had overall, I still really enjoyed my meal here and would love to come back.", "rating": 4, "date": "2016-05-26"}], "hama hama on the half shell": [], "kumamoto oyster on half shell": [], "baked oyster per oyster": [], "chefs selection of oysters per oyster": [], "fresh seafood platter": [{"excerpts": ["Our group started with the Fresh Seafood Platter.  ", "The service was excellent."], "author": "Brent S.", "review": "I really liked the Seafood Linguini.  Our group started with the Fresh Seafood Platter.  The service was excellent.", "rating": 4, "date": "2014-08-28"}], "crab  wild gulf prawn cocktail": [], "whole cracked crab": [], "whole cracked lobster": [], "waterfront clam chowder": [{"excerpts": ["We tried their:\n\nWaterfront Clam Chowder: "], "author": "Charlene L.", "review": "My boyfriend and I visited this restaurant for lunch for their Dine About Town menu and absolutely loved it! If you happen to get a table in the patio area, the view is gorgeous! We tried their:\n\nWaterfront Clam Chowder: This dish decent but nothing special. For the price this dish typically would be, I think it is a bit overpriced for the amount you get. \n\nFresh Oysters: Under their Dine About Town menu, one of the options was three fresh oysters. I absolutely loved this dish and how fresh the oysters were! Yummmmm!\n\nGrilled Rainbow Trout: This was my favorite dish. The rainbow trout was grilled perfectly with great flavors. Portion-wise, I thought they were pretty generous. Sadly, I don't believe this is on their regular menu but I wish it was!\n\nOven Roasted Pork Loin: My boyfriend ordered this dish and enjoyed it as well. The pork was a little on the dry side but the sauce helped. We also enjoyed that the portions for this dish were very generous and was more than enough to fill him up!\n\nCreme Brulee: This was a great dessert to end our meal. Their creme brulee had plenty of flavor from the vanilla beans at the bottom. I wish the shell on top was a little crunchier but it was still pretty good. The tart flavors of the fruits complemented the sweetness of the dessert pretty well. This was definitely enough to share!\n\nParking in this area can be a little difficult but they do offer a valet service. The staff was very friendly and helpful! We plan on coming back in the future and possibly checking out their happy hour options :)", "rating": 4, "date": "2014-01-25"}, {"excerpts": ["As far as the food was concerned, I went with the Dine About Town (DAT) featured salad, the Kobe Beef Burger, and added their Waterfront Clam Chowder to the mix. ", "The salad... was salad; no bugs, yay!. ", "The Kobe Burger was dry. ", "I had ordered it to be medium, but it came super dry and well done; cooked through. ", "The Clam Chowder was probably the highlight of the meal. ", "But that's not why I'm giving this place just 2 stars. ", "Why am I giving this place a 2 star rating you ask? ", "Well my wife ordered the DAT salad and pasta. ", "The problem was mainly with her meal. ", "While she was enjoying her pasta, she unfortunately ate a rotten mussel which she described as tasting like feces (if you could put a taste to feces), and she found shell fragments in her pasta as well. ", "So I'm giving it a 2 out of 5... ", "and I'm sticking to it. ", "We may come back to give them another shot, but for now... they get a 2 from me."], "author": "Gerald B.", "review": "I wish I could've given this place a better rating. Came here with my wife for a Dine About Town lunch special, and was disappointed. Aside from the spectacular view, the food fell short. The service was decent, although the wait staff wouldn't leave us alone long enough to enjoy the meal. I realize that attentive wait staff is a good thing... but being bothered every 5 minutes didn't make much for a great conversation. Though our waitress, Chelsea was very helpful, the other 2 people tending to us were quite annoying. As far as the food was concerned, I went with the Dine About Town (DAT) featured salad, the Kobe Beef Burger, and added their Waterfront Clam Chowder to the mix. The salad... was salad; no bugs, yay!. The Kobe Burger was dry. I had ordered it to be medium, but it came super dry and well done; cooked through. The Clam Chowder was probably the highlight of the meal. But that's not why I'm giving this place just 2 stars. Why am I giving this place a 2 star rating you ask? Well my wife ordered the DAT salad and pasta. The problem was mainly with her meal. While she was enjoying her pasta, she unfortunately ate a rotten mussel which she described as tasting like feces (if you could put a taste to feces), and she found shell fragments in her pasta as well. So I'm giving it a 2 out of 5... and I'm sticking to it. We may come back to give them another shot, but for now... they get a 2 from me.", "rating": 2, "date": "2011-06-06"}], "heirloom tomato salad": [{"excerpts": ["I had chowder for lunch so opted for the heirloom tomato salad for my starter which was quite good.  ", "My husband had the chowder that he thought was really tasty.  ", "From there, I had seafood linguine and he had sea bass.  ", "I'm surprised to see the bad reviews for the sea bass here as his was well cooked and moist as one would expect.  ", "My linguine featured fresh pasta  and seafood in a light broth.  "], "author": "Ann K.", "review": "Visited on a rainy Saturday night and had a great time at the Waterfront.  We were seated in their \"outdoor\" area which I feared would be cold but proved to be warm and cozy.  They were fighting a leak around one of the plexiglass doors but we were seated on the other side so no problems for us.  We had a really great view of the Bay Bridge that was undiminished by the rain.\n\nI had chowder for lunch so opted for the heirloom tomato salad for my starter which was quite good.  My husband had the chowder that he thought was really tasty.  From there, I had seafood linguine and he had sea bass.  I'm surprised to see the bad reviews for the sea bass here as his was well cooked and moist as one would expect.  My linguine featured fresh pasta  and seafood in a light broth.  A little salty for my taste but probably just right for most as I don't eat much salt.\n\nWe shared sticky toffee carmel pudding for dessert.  This was a letdown as it was nothing like we expected.  Extremely sweet it was sort of a sliced sweet bread (think banana bread without the banana) with the sauce poured over the top.  The table next to us had the apple crisp that looked much better.\n\nThere are better restaurants in San Francisco for sure but most don't have the view the Waterfront does so balance the two and you'll have a great visit.", "rating": 4, "date": "2016-10-20"}, {"excerpts": ["Their heirloom tomato salad with beets and burrata was silky smooth. ", "Nice flavor from the persimmons. ", "Beautiful presented. ", "$14. "], "author": "Earl G.", "review": "Came for a big group holiday dinner, 15+/-. \n\nFor water front dining with water front prices, the food was surprisingly average with some hits and misses. (http://www.yelp.com/biz_photos/DeGdhZKXoTnyyFc8GC2BHg?select=SVvBoLdH9rd2XEqoAHyGdQ)\n\nI loved the size of their gulf prawns wrapped in pancetta ($14 for 4 pcs), except they were overcooked. The accompanying serrano chili oil did nothing for me though. For the calamari and rock shrimp appetizer ($14), they used buttermilk which held on to the frying oil. Heavy. We all agreed and would have preferred a lighter and fresher batter. \n\nTheir heirloom tomato salad with beets and burrata was silky smooth. Nice flavor from the persimmons. Beautiful presented. $14. (http://www.yelp.com/biz_photos/DeGdhZKXoTnyyFc8GC2BHg?select=ta4YSfYaO2pHPn40eRuZ0g)\n\nI had a taste of their grilled American wagyu flatiron steak with chimichurri ($25). It was ok, I like chimichurri but this one was too herbal for my tastes. The accompanying polenta fries were the star. A crust on the outside with a melted gooey inside. \n\n2011 has been a challenging and great year so I celebrated by ordering the most expensive item on the menu. The grilled snake river farms 12 oz American wagyu new york strip ($39) with a side of lobster mac and cheese ($12). The steak was a perfect medium rare with a solid char. I didn't ask if it had been aged but it tasted like it. I thought about giving Waterfront 4 stars because I loved the steak but it's more of a testament of Waterfront NOT messing up the steak and just letting the Snake River wagyu speak for itself. It was more lobster scraps with the watery mac and cheese. Get the steak, skip the lobster mac. (http://www.yelp.com/biz_photos/DeGdhZKXoTnyyFc8GC2BHg?select=qG6Pfyh_R8YEwQl0Pdnv7Q)\n\nWe ended the night with a little sticky toffee pudding w/ caramel ice cream ($8.5). Didn't like the soaked brownie cakes. Would have liked a better ice cream to cake ratio too. The \"pudding\" was too dense and sweet for my liking. (http://www.yelp.com/biz_photos/DeGdhZKXoTnyyFc8GC2BHg?select=z5xVNdX9xFpA0MujDyvZuQ)\n\nIf' I'm dining along the water, I'd rather go to Waterbar or Epic. But if you must, I'd say go for happy hour. The hostess reminds me of pre-rehab Lindsay Lohan!", "rating": 3, "date": "2011-12-18"}, {"excerpts": ["I had the heirloom tomato salad. ", "The tomatoes were under ripe, and I question whether or not they were actually heirloom tomatoes. ", "It had a small - very small - amount of delicious buratta cheese on top - and get this - wait for it - fried onions (like those you get in a can for green bean casserole for Thanksgiving dinner). ", "I believe there was one small piece of wilted basil as well. "], "author": "Katie G.", "review": "I came here for a large family dinner not too long ago, and was very disappointed with both the service and the quality of the food. The location of this restaurant cannot be beat! With views overlooking the bay and the bridge, I can certainly see why they try to get away with the prices they charge - but sadly - the food does not do justice to the view.\n\nI had the heirloom tomato salad. The tomatoes were under ripe, and I question whether or not they were actually heirloom tomatoes. It had a small - very small - amount of delicious buratta cheese on top - and get this - wait for it - fried onions (like those you get in a can for green bean casserole for Thanksgiving dinner). I believe there was one small piece of wilted basil as well. VERY disappointing.\n\nI had the Wagu beef steak with arugula as my entree (entrees are served a la carte - and from what I hear - the lobster mac and cheese is a good side dish option). The pile of plain, fresh from the bag arugula went untouched (why even bother putting it on the plate? i would call it an expensive garnish). The steak was mediocre, and heavily salted. It came with a sweet dipping sauce to cover the poor preparation. Avoid it. \n\nOther items at the table that got equally poor reviews ; clam chowder (sweet and too rich), Choppino (full of salmon and pretty much nothing else). Our waiter was loud, bizarre, and condescending. It felt like family night at a fancy retirement home. I will not be coming back here again.", "rating": 2, "date": "2012-10-01"}, {"excerpts": ["The food was tasty - lobster risotto, beef cheek, heirloom tomato salad, sea bass. ", "Yum! ", "Definitely worth the visit if you can catch SF on those beautiful sunny days."], "author": "Kaitlyn H.", "review": "I'm not sure why this restaurant has such low reviews. I've been here two times and both times it was great. There are those rare balmy nights in SF where you can sit outdoors and enjoy the picturesque beauty of the city and enjoy amazing food - I was able to do this while looking at the scenic view at the restaurant that does its namesake justice. My first time at the restaurant, I had a 4 hour happy hour with colleagues and it was so much fun. The food was tasty - lobster risotto, beef cheek, heirloom tomato salad, sea bass. Yum! Definitely worth the visit if you can catch SF on those beautiful sunny days.", "rating": 5, "date": "2011-11-13"}, {"excerpts": ["Heirloom tomato salad was average - but in SF, average is stellar anywhere else.\n"], "author": "Faisal M.", "review": "I only had delivery from this place so I can only comment on the food.\nDecent cioppino and the lobster risotto was fantastic. Heirloom tomato salad was average - but in SF, average is stellar anywhere else.\nDefinitely on the high-end price point.\n\nI have only seen older people going into the restaurant when I pass it in my run along the Embarcadero but I would consider a visit just based on the food quality the one time.", "rating": 3, "date": "2009-10-11"}, {"excerpts": ["I had the heirloom tomato salad... which was a bit on the soggy side.... ", "we split a desert sampler that was a bit overbearing ", "and I had the worst mocha I have ever had served in a wine glass which was awkward.... ", "My date complained that his steak was cold... ", "Service was good... but nothing memorable..."], "author": "Jennifer B.", "review": "Meh... I've had better... I've had worse... Great selection for vegetarina's... the view alone is worth 3 stars... My date told them that we were celebrating our anniversary  when he made the reservation to ensure we would get a table on the water... umm okay... this was our first date? The only reason I found out was because the hostess said, 'so what anniversary are you celebrating?' errrr awkward... but the table was pretty amazing with a perfect view of the bay bridge and the SF belle river boat... I enjoyed watching the lights of the city come on while the sunset over the bay. We split the grilled artichoke... which was amazing... I had the heirloom tomato salad... which was a bit on the soggy side.... we split a desert sampler that was a bit overbearing and I had the worst mocha I have ever had served in a wine glass which was awkward.... My date complained that his steak was cold... Service was good... but nothing memorable...", "rating": 3, "date": "2009-06-18"}, {"excerpts": ["The positives: good service on both occasions and a delicious heirloom tomato salad (when they have it as a daily special)."], "author": "S J.", "review": "I really wanted to like this place.  Such a great location and nice menu -- and I love seafood.  But the food has been really disappointing both times I've been there.  (Fish once, scallops another time.)  It's also really expensive.  Since I was there on business lunches, I couldn't be too bitter, but would've been pretty unhappy if it'd been on my own dime.  The positives: good service on both occasions and a delicious heirloom tomato salad (when they have it as a daily special).", "rating": 2, "date": "2008-06-13"}], "waterfront kobe beef cheeseburger": [], "maine lobster salad sandwich lunch": [], "dungeness crab sandwich lunch": [], "king salmon burger": [], "waterfront cioppino": [{"excerpts": ["You will find the Waterfront menu is known for their Seafood, particularly their Waterfront Cioppino. ", "It was really good. ", "I also enjoyed my Buttermilk Calamari with Rock Shrimp and Fennel.  ", "I did noticed that they did not have a Vegan selection on the menu which was a bit of a let down for some of my coworkers.  "], "author": "Edwin R.", "review": "The Waterfront Restaurant for as long as I can remember, has been around for a very long time. Their website said since 1969.  I used to ride my bike around here when I was eight years old, and they are still here!!  I think that's so cool.\n\nMany famous people have dined here from Sports to Music to Movie Stars.... It is a definite destination for the big names. I even remember seeing in the news that Madonna came here, and the Waterfront is considered as one of her favorite places to dine in San Francisco.\n\nYou will find the Waterfront menu is known for their Seafood, particularly their Waterfront Cioppino. It was really good. I also enjoyed my Buttermilk Calamari with Rock Shrimp and Fennel.  I did noticed that they did not have a Vegan selection on the menu which was a bit of a let down for some of my coworkers.  I hope that they can incorporate this in their menu as San Francisco is a major foodie hub!\n\nFor some that may not know, the Waterfront also serves Happy Hour with cocktails for only $7, fresh Oysters for .99 cents and try their bake Oysters for only $5.  It will melt in your mouth.\n\nWhen you make your reservation, asked for the view towards the Bay Bridge. When the lights are lit up, it makes a very cozy and romantic dinner for two.\n\nFor a large group like company parties, you can dine in the middle where you will have your own space, and your group will be separated from everyone else.  It keeps conversation a lot easier to understand too.  \n\nOverall, service here was great, and I suggest you use their valet parking for about $16.  It is very convenient and only a few steps away from the front door!  \n\nUntil then, Cheers! ~ :p", "rating": 4, "date": "2015-11-03"}, {"excerpts": ["I ordered the Waterfront cioppino and it was worth $34! ", "Delicious! ", "I look forward to dessert ", "so I wanted to make sure I saved room for that! ", "Got the mini dessert sampler $18, it was perfect because you get to try a little bit of everything. ", "This place is great for special occasions. ", "You get to over look the bridge at sunset, gourmet meal and high class service. \n", "My only downer, my fathers lobster wasn't fully cooked. ", "Though it was full of meat it was under cooked. ", "I would have liked for him to enjoy his meal especially bc he paid a lot for it! ", "But other than that definitely is a just go place :)"], "author": "Christina U.", "review": "Went this evening for my birthday dinner and it was a wonderful experience. The waiters were great. The food was amazing and the ambience was pleasant. I ordered the Waterfront cioppino and it was worth $34! Delicious! I look forward to dessert so I wanted to make sure I saved room for that! Got the mini dessert sampler $18, it was perfect because you get to try a little bit of everything. This place is great for special occasions. You get to over look the bridge at sunset, gourmet meal and high class service. \nMy only downer, my fathers lobster wasn't fully cooked. Though it was full of meat it was under cooked. I would have liked for him to enjoy his meal especially bc he paid a lot for it! But other than that definitely is a just go place :)", "rating": 4, "date": "2013-10-26"}, {"excerpts": ["The food (i ordered the Waterfront Cioppino) was bland.  ", "It was presented well, but had no real great taste.  ", "The bread they served was hard too...not very enjoyable.  ", "So for the price of the meal and service, I would have rather spent it elsewhere."], "author": "Anthony W.", "review": "The restaurant has a really nice view overlooking the bay.  But all that doesn't really matter so much since the service wasn't very pleasant and the food was mediocre.\n\nWe went there to experience it since it looked nice from the outside and inside.  Once we got in, we were immediately seated at our table.  Not knowing if it was okay to bring drinks from the bar to the table, I politely asked the waiter if that was possible.......he gave us a really quite-stern stare.  We asked again politely, thinking that he was just joking and giving us a hard time.  But he was serious and looked at us stern again.  He said \"1 round only....I will give you that only\".  At that moment, I knew I didn't enjoy the service.  I mean, come on, if that's not cool to bring drinks at the bar, just say so nicely, don't just stare at us uncomfortably.  \n\nAnyways, that was already off track.  The rest of the evening he did serve us but it just felt cold.  He just never smiled, barely spoke......I just felt really uncomfortable with him around.  \n\nThe food (i ordered the Waterfront Cioppino) was bland.  It was presented well, but had no real great taste.  The bread they served was hard too...not very enjoyable.  So for the price of the meal and service, I would have rather spent it elsewhere.", "rating": 2, "date": "2012-10-18"}, {"excerpts": ["Second Course\nWaterfront cioppino or Kobe cheeseburger, french fries & bacon aioli\n\n"], "author": "Meagan C.", "review": "I stopped by yesterday for the Dine About Town Lunch menu:\n\nFirst Course\nSoup of the day or Roasted beet salad, pomegranate vinaigrette & Sonoma goat cheese\n.....\nSecond Course\nWaterfront cioppino or Kobe cheeseburger, french fries & bacon aioli\n\nThe soup of the day was tomato and vegetable, so even though I knew I was having the cioppino for the second course my weakness for tomato soup was too strong to pass up.  Unfortunately, the soup tasted a little bit like Garden Vegetable Ragu.  My friend had the roasted beet salad and it was not only giant, but apparently delish.  She loved the pomegranate vinaigrette.\n\nWe both had the cioppino and loved it.  Perfect for a mid-work-day lunch.  I wasn't left with that miserably-full-I-need-a-nap-now feeling.  The fish, mussels, clam, crab, and shrimp were all fresh and tasty in a flavorful broth.\n\nReally though, the reason I come here is because on a sunny day, sitting on their south facing patio is heaven.  The wind barricades keep it nice and warm.  Its like a little vacation from the office - and you can be there and back in under an hour and a half.", "rating": 3, "date": "2011-01-20"}, {"excerpts": ["I had the Cold Smoked Salmon, the Waterfront Cioppino, and the Strwaberry Rubarb.  ", "The sauce on the salmon is a little heavy for my taste, but overall a great dish.  ", "The Cioppino was absolutely phenomenal.   ", "There is tons of seafood in it: crab, prawns, fish, and clams.  ", "Definitely worth the price of the dish.  "], "author": "Kelvin V.", "review": "Just had lunch at Waterfront after not being there for a few years.  Don't know about all of the negative reviews below, but the food was great and the service better.\n\nI had the Cold Smoked Salmon, the Waterfront Cioppino, and the Strwaberry Rubarb.  The sauce on the salmon is a little heavy for my taste, but overall a great dish.  The Cioppino was absolutely phenomenal.   There is tons of seafood in it: crab, prawns, fish, and clams.  Definitely worth the price of the dish.  The Rubarb was good but nothing spectacular.\n\nOthers at the table had the Spinach Salad, the Chicken Escalope, and the Chocolate Fondant.  The salad is interesting in that the vinaigrette is not a simple olive oil base.  The Chicken Escalope, interestingly enough, looks like scrambled eggs but tastes good.  The fondant is very heavily chocolate- good for those with a love of chocolate.\n\nService was great and view was ok.  It's the same view you get while standing on the Embaracadero (which means no Golden Gate Bridge views are possible, so don't know why someone's complaining about that).  The meal is pricey but the prix fixe menus are great choices, and when you walk into the place you know you're going to spend a good chunk of change, so it's to be expected.\n\nA final note: they have a happy hour from 3-7 M-S and it looks like the menu is pretty decent.  Drinks and appetizers under $5 and the appetizers all look great.  Could be an interesting place for a quieter happy hour.", "rating": 4, "date": "2009-06-11"}], "marys chicken breast": [], "grilled sea bass": [{"excerpts": ["We ordered the grilled sea bass which had so little flavor we sent it back and ordered the sole munierre which was not bad for diner food but very disappointing here. ", "On the positive side the ahi tuna appetizer was delicious and the wood fired while fish with crab was also very good.  ", "Overall we can't see coming back."], "author": "Mike B.", "review": "Nice location with very friendly staff. Unfortunately for $30 entrees the food was mediocre. We ordered the grilled sea bass which had so little flavor we sent it back and ordered the sole munierre which was not bad for diner food but very disappointing here. On the positive side the ahi tuna appetizer was delicious and the wood fired while fish with crab was also very good.  Overall we can't see coming back.", "rating": 3, "date": "2017-09-01"}, {"excerpts": ["We had the baked oysters (which are always my favorite), grilled sea bass, petrale sole meuniere mashed potatoes & sautéed spinach, and the handmade seafood linguini with rock shrimp, mussels, clams, crab & bay scallops. ", "I loved the food, service and views!"], "author": "L F.", "review": "We were here 4th of July weekend and got a table with great views to the waterfront at sunset. We Ubered since we knew parking is a bit of a challenge in the area. The restaurant is on the pricey side but everything we ordered was delicious. I liked that the menu offerings were limited and did not overwhelm you.  Our waiter was from Colombia and he was awesome! I can't remember his name but he was very attentive and offered great suggestions. We had the baked oysters (which are always my favorite), grilled sea bass, petrale sole meuniere mashed potatoes & sautéed spinach, and the handmade seafood linguini with rock shrimp, mussels, clams, crab & bay scallops. I loved the food, service and views!", "rating": 4, "date": "2017-07-06"}, {"excerpts": ["Grilled Sea Bass off the hooked. ", "Calamari appetizers very decent and not very greasy. ", "The view is breath taking. ", "Will take my family to dine here again"], "author": "Mel B.", "review": "Grilled Sea Bass off the hooked. Calamari appetizers very decent and not very greasy. The view is breath taking. Will take my family to dine here again", "rating": 5, "date": "2017-08-20"}, {"excerpts": ["The mesquite grilled sea bass was AWFUL-- dry and ill-prepared.  ", "I can do better myself at home.  ", "The sea bass came with no side dishes, no garnish-- essentially no color whatsover on the white plate.  ", "The aeshetic presentation was much like one imagines food in the Arctic Tundra in the dead of winter -- white, gray, cream colors.  ", "Bland all around.  ", "I ate about a fourth of the fish before I gave up.  ", "The spinach and fig salad I ordered for an appetizer was equally disappointing-- ", "the spinach leaves were large and tough, and the dressing was gummy and sweet, kind of like Chinese dipping sauce.  ", "I didn't finish that either "], "author": "Maria M.", "review": "This place was a near-complete disappointment from the moment we stepped in the door.  I wish I'd consulted Yelp before going.  Our reservation was at 7:30, and we weren't seated until 8:00.  As we sat in wait by the host booth, we noticed that a tall, athlete-looking man and his date walked in without a reservation, requested a table by the water, and were seated immediately.  The hosts and manager/owner(?) fluttering about the host stand appeared disorganized and disheveled.  No one smiled.  \n\nWhen they finally seated us after our half hour wait, there was no apology for or acknowledgment of the wait whatsoever.  This tone of unapologetic neglect characterized our entire experience at Waterfront; for a place charging $20 and up for mediocre entrees, this kind of service is inexcusable.  \n\nAt the table, my mother was seated in a chair in which she found her feet entangled in the tubing that supplies fuel to the outdoor heating lamps, a set-up that seems a likely fire hazard.  When she asked the waiter to move her to the other side of the table, he hesitated because, he said, he \"might trip on it himself.\"  Hello?  Why was it set up this way in the first place?  \n\nThe waiter was horrible.  I have no idea why this man is in the food service profession.  He seemed nervous, and had absolutely no sense of graciousness.  He immediately asked us for our order without even greeting us, he didn't tell us the specials until we asked, he offered no explanation for our hour-long wait for our entrees, and (as I read in another review-- must be the same waiter), his response to anything we said was \"understood.\"  My mother's food came without the herb salad described on the menu.  When we pointed this out after we finished our meals (he never came back to check in with us as we ate, and we were not able to flag him down), he responded that our discontent was  \"understood.\"  Neither did he offer to comp a dessert or drink nor to bring the salad!  \n\nAfter an hour wait for the entress, we were so hungry that just about anything would taste good, yet I couldn't even finish my meal.  The lobster risotto was the only dish worth ordering of the three we had at our table.  The mesquite grilled sea bass was AWFUL-- dry and ill-prepared.  I can do better myself at home.  The sea bass came with no side dishes, no garnish-- essentially no color whatsover on the white plate.  The aeshetic presentation was much like one imagines food in the Arctic Tundra in the dead of winter -- white, gray, cream colors.  Bland all around.  I ate about a fourth of the fish before I gave up.  The spinach and fig salad I ordered for an appetizer was equally disappointing-- the spinach leaves were large and tough, and the dressing was gummy and sweet, kind of like Chinese dipping sauce.  I didn't finish that either (it's rare that I leave food on my plate, even if it's mediocre).   \n\nThe one glimmer of pleasure in this meal was the dessert course.  We shared a peach tartin and almond cake, both of which were lovely.  Their pastry chef seems to be the only one in the kitchen who knows what he/she is doing.  \n\nI definitely won't return to this place.  I can get the views it offers (its only bonus, besides dessert) by walking along any pier on the Embarcadero, for free, any night I want.", "rating": 1, "date": "2007-09-17"}], "handmade seafood linguini": [{"excerpts": ["We had the baked oysters (which are always my favorite), grilled sea bass, petrale sole meuniere mashed potatoes & sautéed spinach, and the handmade seafood linguini with rock shrimp, mussels, clams, crab & bay scallops. ", "I loved the food, service and views!"], "author": "L F.", "review": "We were here 4th of July weekend and got a table with great views to the waterfront at sunset. We Ubered since we knew parking is a bit of a challenge in the area. The restaurant is on the pricey side but everything we ordered was delicious. I liked that the menu offerings were limited and did not overwhelm you.  Our waiter was from Colombia and he was awesome! I can't remember his name but he was very attentive and offered great suggestions. We had the baked oysters (which are always my favorite), grilled sea bass, petrale sole meuniere mashed potatoes & sautéed spinach, and the handmade seafood linguini with rock shrimp, mussels, clams, crab & bay scallops. I loved the food, service and views!", "rating": 4, "date": "2017-07-06"}, {"excerpts": ["I had the handmade seafood linguini, but I did try a little bite from everyone else, and they all tasted amazing. ", "When the lobster mac and cheese came out, I could smell the truffle oil wafting into my brain and tantalizing all my senses. ", "I. Love. ", "Truffle. ", "And you put truffle AND lobster AND cheeeeeeeese together? ", "Kill me now. ", "I'm in heaven. ", "The staff brought out the cake my sister bought at the end of the night, let me blow out the candles, then took it back to the kitchen only to return 10 minutes later with perfectly cut pieces for my guests and I. ", "By the time we were done with dessert and paying the bill, we were full, happy, and we all decided to leave extra tip on top of our 18% gratuity, because the service was so good. "], "author": "Jeani L.", "review": "Ever since I could remember, my birthday has always fallen inside what adolescents affectionately refer to as \"spring break.\" It's that crazy time of year when people do even crazier things. For the past couple years, I've been lucky enough to observe this week-long celebration of the coming of spring (characterized by inebriation, heavy partying, and usually a lot of nudity) in South Beach. Spring break in Cancun? That's for children compared to Ultra Music Festival and Winter Music Conference week in Miami. And this year was no different. I flew back from four straight days of debauchery on Sunday night, and I was DEAD tired. All I wanted to do for my birthday the next day was sleep. However, having the sweetest sister in the world (poor me), she wanted to invite a couple of my friends and set up a little birthday dinner. How could I possibly say no to that? \n\nSis suggested that we go to the Waterfront. I knew where it was, but I hadn't been there in years. Since I wasn't doing any of the planning, I basically let my little sister do all the legwork. We got there about 15 minutes late, but thanks to the adorable valet who calls all the ladies \"bella\", we were able to get inside right away. My sister had called ahead and requested a table with a view, and they had told her they would try to accommodate us as much as possible, but it so happened that there was a huge Siemens conference going on that night and they had taken up the entire downstairs patio that overlooked the bay. Waterfront, however, was gracious enough to save a table for us upstairs that had an equally amazing view. We were seated right away.\n\nOur waiter came by and gave us the usual spiel on recommendations for the night. He then took our order, sans notepad. I love when they do that. Not only was the staff extra knowledgeable about the food, they were helpful and attentive, even though we were sitting in a table tucked away into one of the more secluded corners of the restaurant. Our glasses were never empty, our dishes came out promptly, and our food was at perfect temperature. I had the handmade seafood linguini, but I did try a little bite from everyone else, and they all tasted amazing. When the lobster mac and cheese came out, I could smell the truffle oil wafting into my brain and tantalizing all my senses. I. Love. Truffle. And you put truffle AND lobster AND cheeeeeeeese together? Kill me now. I'm in heaven. The staff brought out the cake my sister bought at the end of the night, let me blow out the candles, then took it back to the kitchen only to return 10 minutes later with perfectly cut pieces for my guests and I. By the time we were done with dessert and paying the bill, we were full, happy, and we all decided to leave extra tip on top of our 18% gratuity, because the service was so good. We hadn't even noticed that we were the last table in the restaurant, because no one had rushed us out, even though it was way past closing. \n\nWaterfront, you are one class act. Thank you for making my birthday dinner absolutely perfect.", "rating": 4, "date": "2012-04-04"}], "veggie pasta penne": [], "petrale sole meuniere": [{"excerpts": ["We had the baked oysters (which are always my favorite), grilled sea bass, petrale sole meuniere mashed potatoes & sautéed spinach, and the handmade seafood linguini with rock shrimp, mussels, clams, crab & bay scallops. ", "I loved the food, service and views!"], "author": "L F.", "review": "We were here 4th of July weekend and got a table with great views to the waterfront at sunset. We Ubered since we knew parking is a bit of a challenge in the area. The restaurant is on the pricey side but everything we ordered was delicious. I liked that the menu offerings were limited and did not overwhelm you.  Our waiter was from Colombia and he was awesome! I can't remember his name but he was very attentive and offered great suggestions. We had the baked oysters (which are always my favorite), grilled sea bass, petrale sole meuniere mashed potatoes & sautéed spinach, and the handmade seafood linguini with rock shrimp, mussels, clams, crab & bay scallops. I loved the food, service and views!", "rating": 4, "date": "2017-07-06"}, {"excerpts": ["For our entrees:\n\nPetrale Sole Meuniere Mashed Potatoes & Sautéed Spinach.  "], "author": "Mark S.", "review": "We enjoyed a nice leisure lunch on Sunday.\n\nWe started with a dozen oysters on a half shell and Dungeness Crab Cakes.   the crab cakes were made to perfections.\n\nFor our entrees:\n\nPetrale Sole Meuniere Mashed Potatoes & Sautéed Spinach.  The sauce was very light (which is perfect).  Heavy sauces on fish tends to hide the flavor of the fish\n \n Grilled Local White Sea Bass with Crushed Fingerlings, Asparagus, Orange Tomato Vinaigrette.   I prefer grilled fish with no sauces.  It was grilled perfect and not dry to the taste.\n\nDesert:  Lemon Trio\n\nA great dish to share.  The cheesecake was a little heavy, but not bad.\n\nThe staff was personable and very professional.\n\nAs locals, we would recommend this restaurant.  A little pricey, but worth the visit", "rating": 4, "date": "2016-06-06"}], "wood oven roasted whole fish dungeness crab": [], "fillet of beef tenderloin": [], "oven roasted day boat scallops": [], "mixed grill salmon prawns scallops  lobster tail": [], "spaghettini pasta": [], "grilled skuna bay salmon": [], "snake river grilled kobe new york strip steak": [], "hawaiian escolar": [{"excerpts": ["The grilled Hawaiian Escolar was oh so delicious ", "but I would have appreciated a written or verbal warning about our inability to digest the fish's wax esters (read: a surprising case of Keriorrhea a day later that google helped me diagnose).  ", "I wouldn't go out of my way to eat here, but it's fine alternative for an impromptu dinner if you're in the area."], "author": "Clara H.", "review": "I ended up at Waterfront at 8 pm on a Tuesday night because we had no reservations or patience to wait for a table at all the other jam packed restaurants on Embarcadero.  From the outside, I was expecting the restaurant to be dead empty, but it was about two thirds full and we scored a table in the enclosed back deck area.  The menu was a bit pricey, but it's expected with such a great view of the Bay Bridge.  Our server was very pleasant and happily accommodated my friend's request for subbing out the anchovies with bacon in their Caesar salad.  The grilled Hawaiian Escolar was oh so delicious but I would have appreciated a written or verbal warning about our inability to digest the fish's wax esters (read: a surprising case of Keriorrhea a day later that google helped me diagnose).  I wouldn't go out of my way to eat here, but it's fine alternative for an impromptu dinner if you're in the area.", "rating": 3, "date": "2013-09-15"}], "pacific swordfish": [], "pacific king salmon": [], "crab mashed potatoes": [{"excerpts": ["Neither the halibut nor the crab mashed potatoes had any flavor. ", "The atmosphere was decent."], "author": "Pam T.", "review": "We were here for a conference and our rep took us to Waterfront, needless to say it was not very good. The special, Halibut, was very dry and overcooked. Neither the halibut nor the crab mashed potatoes had any flavor. The atmosphere was decent.", "rating": 2, "date": "2018-10-01"}, {"excerpts": ["The lobster mac & cheese and crab mashed potatoes were TO DIE FOR!!! ", "My sea bass was cooked perfectly. ", "The food was definitely worth the trip for a night I didn't feel like leaving the house. ", "Nom nom ", ":)"], "author": "Ali R.", "review": "Absolutely LOVED Waterfront. Looking for tasty seafood and a GREAT view? Visit this spot!!!  From the service, the food, the view, to the table setting ... it was a worthwhile experience. I was a few minutes late for my reservation and yet the staff was extremely accommodating. Seating was immediate even though it was a busy night (a big deal for me). Everything we ordered was amazingly tasty. Hands down, our waiter gets a 5 star rating. He was patient and instrumental with my wine pairing, which was totally delish with my meal. The calamari was perfectly crispy. The lobster mac & cheese and crab mashed potatoes were TO DIE FOR!!! My sea bass was cooked perfectly. The food was definitely worth the trip for a night I didn't feel like leaving the house. Nom nom :)", "rating": 5, "date": "2017-09-12"}, {"excerpts": ["Lobster Risotto was lovely, crab mashed potatoes was very nice, seafood was really great! ", "Fine dining usually does not include french fries though. \n", "However you're still paying for the view because this seafood could have been significantly less expensive a few blocks away from the Embarcadero and likely the same quality. \n", "It's a really nice place ", "but since Im just a tourist to SF, Ill definitely check out other spots before I return."], "author": "Mitch B.", "review": "You're paying for the view. Do not be deceived in anyway. This is the single reason your bill will be over $200 for a date night including a bottle of wine. \n\nThe food, while good, isn't any better or worse than any of the other nice restaurants with a similar view on the Embarcadero.  The portions are mediocre though filling. Like any upscale restaurant all the food is a la carte so your sides are additional. The seafood, which is why we went here, was superb. Lobster Risotto was lovely, crab mashed potatoes was very nice, seafood was really great! Fine dining usually does not include french fries though. \nHowever you're still paying for the view because this seafood could have been significantly less expensive a few blocks away from the Embarcadero and likely the same quality. \nIt's a really nice place but since Im just a tourist to SF, Ill definitely check out other spots before I return.", "rating": 3, "date": "2017-09-26"}, {"excerpts": ["The food itself was FABULOUS, I had the salmon burger, sweet potato fries and crab mashed potatoes. "], "author": "Nae F.", "review": "The food itself was FABULOUS, I had the salmon burger, sweet potato fries and crab mashed potatoes. Also, everyone in my party enjoyed their food. \n\nNow the service was something different. Our server was not pleasant at all, he didn't even make eye contact when he said \"Happy Holidays\". He NEVER smiled during our whole visit! \n\nService was slow for our party of 6- were seated at 11:30 and left a little after 1:30. We did not order coffee, dessert and 4 people out of our party ordered a very basic meal and the other 2 ordered burgers. \n\nIf it wasn't for the good company our visit would have been terrible.", "rating": 3, "date": "2016-12-09"}, {"excerpts": ["We also ordered crab mashed potatoes and lobster mac & cheese. ", "Between the two, the crab mashed potatoes were the best. ", "Fantastic food, and excellent service !!"], "author": "J. A.", "review": "Stunning view of the bay bridge. Came here for our anniversary, and it did not disappoint. We had the seafood linguine, which was amazing. We also ordered crab mashed potatoes and lobster mac & cheese. Between the two, the crab mashed potatoes were the best. Fantastic food, and excellent service !!", "rating": 4, "date": "2016-11-29"}, {"excerpts": ["Crab mashed potatoes are a must! ", "Waiters gave horrible service for a nice restaurant. ", "They rarely came to check on or refill our water glasses. ", "We'll be back otherwise!"], "author": "Eman D.", "review": "We had a reservation and were seated on the outside enclosed patio. The view was nice, especially because of how close you are to the Bay Bridge. We watched the lights turn on at dusk! Food was perfectly done, however it took a while to figure out what to order since I'm gluten intolerant. Crab mashed potatoes are a must! Waiters gave horrible service for a nice restaurant. They rarely came to check on or refill our water glasses. We'll be back otherwise!", "rating": 4, "date": "2016-06-18"}, {"excerpts": ["The lobster mac and cheese and crab mashed potatoes were TO DIE FOR!!! ", "My sea bass was cooked perfectly. ", "It was definitely worth the trip for a night ", "I didn't feel like leaving the house!!! ", "Nom nom :)"], "author": "Alecia G.", "review": "Absolutely LOVED Waterfront. Looking for tasty seafood and a GREAT view? Visit this spot. Everything we ordered was amazingly tasty. From the service, the food, the view, to the table setting ... it was a great experience. I was a few minutes late for my reservation and yet the staff was extremely accommodating. Seating was immediate even though it was a busy night (a big deal for me). Hands down, our waiter gets a 5 star rating. He was instrumental with my wine pairing, which was totally delish with my meal. The calamari was perfectly crispy. The lobster mac and cheese and crab mashed potatoes were TO DIE FOR!!! My sea bass was cooked perfectly. It was definitely worth the trip for a night I didn't feel like leaving the house!!! Nom nom :)", "rating": 5, "date": "2017-09-12"}, {"excerpts": ["I ended up with the salmon special with crab mashed potatoes, and it was absolutely to die for. ", "My parter got the bass, and he really enjoyed his meal. ", "To end the night we decided to go with the desert sampler and our server was sweet enough to put some candles in our desert because it was our anniversary! ", "Very special night, wonderful food, and we both really enjoyed the service. ", "Would be back again just for that salmon! "], "author": "Allison J.", "review": "Made a reservation for my anniversary at 6pm Monday night. We weren't greeted right away, but in a few minutes a hostess came to us, and sat us by the finest window seat in the house (we were twenty minutes early and still sat right away). The waiter was nice and very attentive. He took our drinks, told us the special and gave us a few minutes. \n\nI ended up with the salmon special with crab mashed potatoes, and it was absolutely to die for. My parter got the bass, and he really enjoyed his meal. To end the night we decided to go with the desert sampler and our server was sweet enough to put some candles in our desert because it was our anniversary! Very special night, wonderful food, and we both really enjoyed the service. Would be back again just for that salmon! Yum! \n\nWorth the hour and a half drive.", "rating": 5, "date": "2017-02-09"}, {"excerpts": ["We both had the mixed seafood grill entree and the crab mashed potatoes on the side. ", "The scallops were to die for, the lobster tails a bit dry but overall the crab mashed potatoes stole the show. ", "We dine out weekly in the bay area and would only recommend Waterfront for the saving grace which is the food... and was wonderfully delicious. ", "Would have loved dessert but did not want to wait again for service ", "so just had a cappuccino and paid the bill. ", "For our 15th wedding anniversary we were hoping for more but just got bare minimum service."], "author": "Kelly H.", "review": "Booked reservations on OpenTable for our wedding anniversary requesting a table with a view for said celebration. Arrived about fifteen min early, greeted warmly by host and seated quickly to an upstairs window table with wonderful view. SO far so good. Took some time for waiter to approach and ask for our cocktail order. He did not introduce himself, which is customary, but not a huge deal. Food and drink servers very prompt and friendly. \nLobster Risotto is wonderful, as is the pancetta wrapped gulf prawn appetizers... however when the appetizers were delivered our entree order was not taken which we found odd. \nFor the price paid the waiter was nowhere near as attentive with service as he should have been. We enjoyed the view and the quiet ambiance but service is what keeps customers coming back. We had finished eating our appetizer courses and had to request more bread before our entree order was even taken. No check back on us during appetizer course by the waiter , this would have solved this and allowed for refresh on drink order as well. We both had the mixed seafood grill entree and the crab mashed potatoes on the side. The scallops were to die for, the lobster tails a bit dry but overall the crab mashed potatoes stole the show. We dine out weekly in the bay area and would only recommend Waterfront for the saving grace which is the food... and was wonderfully delicious. Would have loved dessert but did not want to wait again for service so just had a cappuccino and paid the bill. For our 15th wedding anniversary we were hoping for more but just got bare minimum service.", "rating": 3, "date": "2016-09-15"}, {"excerpts": ["Our party had a few menu items: Calamari, Crab cakes, Parmesan fries, Swordfish with lemon Aioli, Salmon with Serrano Aioli, Crab mashed potatoes and (drum roll/deep breath) ", "Sautéed spinach and cabbage. ", "Yes, our table was big enough for all this food, as were our appetites.  ", "We left no remnants or evidence of food behind either. "], "author": "Cat V.", "review": "Maybe we were just really hungry since we did skip lunch...or the food, service, atmosphere was just amazing.  \n\nWell, it's definitely the latter.\n\nWe strolled in Zombieland-style like on a manhunt for some flesh: we were beyond starving.  Surprisingly, despite the gripes on wait staff's time management skills from other reviews, we were seated right away, served and sent off all in a timely manner. \n\nOur party had a few menu items: Calamari, Crab cakes, Parmesan fries, Swordfish with lemon Aioli, Salmon with Serrano Aioli, Crab mashed potatoes and (drum roll/deep breath) Sautéed spinach and cabbage. Yes, our table was big enough for all this food, as were our appetites.  We left no remnants or evidence of food behind either. So good.\n\nNot much of a draft selection, just the basics: Sierra Nevada, Blue Moon, and two others. There's tons of seating all with a spectacular view of the bay. Nice spot for a casual date for dinner or drinks.", "rating": 4, "date": "2013-04-21"}, {"excerpts": ["The salmon special was underwhelming, the crab mashed potatoes seemed to lack seasoning, but at least my moms steak was good. ", "I used to love this place, but not sure if I will return after this dinner."], "author": "Brian W.", "review": "Not quite sure what happened with the service here, but my last visit may be my last. On May 11th we took my mother here for her birthday. It wasn't very very busy at the time of our arrival, but once seated we were not approached for about 12 minutes. The table behind us with 2 people sitting there, not eating, or drinking got a lot more attention. Those people also happened to be holding the table for another group and didn't even order drinks. They say there for at least an hour and every few minutes were checked on. Our table however had to frequently remind staff of our requests. The salmon special was underwhelming, the crab mashed potatoes seemed to lack seasoning, but at least my moms steak was good. I used to love this place, but not sure if I will return after this dinner.", "rating": 2, "date": "2016-05-13"}, {"excerpts": ["Dinner was ok - (tiny) fresh oysters, mixed drinks were tasty (but on the pricey side, $11/each), fish was grilled well, and the crab mashed potatoes were decent. ", "Our waiter didn't inform us of any specials (he did tell neighboring tables), took the drink menu away before we even orderd dinner. "], "author": "Belinda M.", "review": "To echo other reviews, the service is definitely not anything I could recommend. Our experience was awful. Save yourself from the headache and mediocre food.\n\nDinner was ok - (tiny) fresh oysters, mixed drinks were tasty (but on the pricey side, $11/each), fish was grilled well, and the crab mashed potatoes were decent. Our waiter didn't inform us of any specials (he did tell neighboring tables), took the drink menu away before we even orderd dinner. Food was 6/10, typical tourist food with a nice view of the bay.\n\nAfter ordering, our waiter knocked an entire glass of water on my husband's lap and iPhone, and the meal quickly went south. His jeans are ok...the iPhone, not so much. We were looking simply looking for an apology and at least an offer to rectify the mishap (Really sorry about that, here's some dessert?).\n\nOur waiter sent the manager over to our table towards the end of the meal and his immediate response was to say \"You shouldn't have your phone on the table, I keep mine in my pocket.\" This is how he APPROACHED the conversation - didn't even greet us or tell us his name. It was more than 5 minutes into the discussion before he apologized, and that was after I pointed out that we had not yet received an apology. \n\nWe're reasonable people and understand that accidents happen. We had a circular conversation for over 10 minutes (I'm sure this disturbed other diners, but what did he care?) with someone who has blatant disregard for customer service and not an iota of people skills (rude, condescending and hostile is the extent of his abilities). He offered no solutions and was reluctant to even provide us with a business card (which he never did).\n\nFor what it's worth, this is the first Yelp! review I've been compelled to write. We've all experienced bad service and accidents happen. We weren't looking to get a free meal, but this guy was completely horrible. In the end we just agreed to disagree and left the restaurant.", "rating": 1, "date": "2014-08-17"}, {"excerpts": ["One of my must haves are the Crab Mashed Potatoes "], "author": "Amanda N.", "review": "One of my fave spots for happy hour after the weeklong financial district slog. Oysters are .99, they have $5 glasses of prosecco and $3 draft beers. The sliders are on the smaller side, and not really even worth the $5 price tag, but still tasty. \n\nOne of my must haves are the Crab Mashed Potatoes -- you will not be sorry, they are amazing!\n\nToo bad the view from the bar is partially obstructed by the bottles - it's a great one!", "rating": 4, "date": "2013-09-11"}, {"excerpts": ["We had the night's special that I can't remember (oops), the salmon, crab mashed potatoes, and lobster Mac n cheese. ", "All the dishes were great, as well as the cocktails! ", "Great location, we sat on the patio facing the bridge and the bay. ", "Highly recommended!! ", "Plus I got two free birthday desserts only because the first one forgot the candle, haha, a great experience! ", "We made a reservation but for a Tuesday night, didn't seem to need one."], "author": "Lacey C.", "review": "This was my second time at this restaurant while on vacation in San Francisco, once as a child and now on my 22nd birthday. Both times were great! The service was phenomenal... pretty amazing. We had the night's special that I can't remember (oops), the salmon, crab mashed potatoes, and lobster Mac n cheese. All the dishes were great, as well as the cocktails! Great location, we sat on the patio facing the bridge and the bay. Highly recommended!! Plus I got two free birthday desserts only because the first one forgot the candle, haha, a great experience! We made a reservation but for a Tuesday night, didn't seem to need one.", "rating": 5, "date": "2014-05-30"}, {"excerpts": ["I tasted the crab mashed potatoes and they were delicious.\n\n"], "author": "Ryan L.", "review": "My parents were in town and I wanted to take them to see the city.  I'm not that famliar with the city and didn't know where to go.  Eventually we ended up on the Embarcadero and we were starving.  My mother is a sucker for a nice view so we went to the Waterfront Restaurant.\n\nThis place is definitely for tourists, but it's a long way from Fisherman's Wharf.  The restaurant is very nice and it's got great service.  It's a little expensive and a little too touristy, but still a good place to eat.\n\nThe food was good.  I got the appetizer of black truffle and lobster macaroni and cheese.  It was delicious and not a big amount.  It did have a lot of lobster and great flavor.  For $17 it was overpriced, but the meals are all between $20 and $30. Everything comes à la carte so the sides are all individually priced.  Please be aware that the sides are large and can be shared.  I tasted the crab mashed potatoes and they were delicious.\n\nThe view was good.  You could see the entire bay North of the Bay Bridge.  The seating is on the second floor so you get an excellent view.  It may be touristy but it was still a nice meal.", "rating": 4, "date": "2011-03-04"}, {"excerpts": ["The mussels tasted fresh and I really liked the crab mashed potatoes. ", "Our server was really friendly. ", "The hostess was a little snobby."], "author": "Tiffany G.", "review": "The mussels tasted fresh and I really liked the crab mashed potatoes. Our server was really friendly. The hostess was a little snobby.", "rating": 4, "date": "2016-04-02"}, {"excerpts": ["I also had the crab mashed potatoes and you can definitely taste the crab. "], "author": "Char L.", "review": "We came at lunch on a Saturday and had no problem with seating or service. Our waitress was very nice and came frequently to see if we were ready to order since we were still waiting on people. The only con was that we were seated upstairs and there is no AC and it was very hot that weekend. We were sweating in our seats. A k-mart fan marginally helped. Fancy restaurant with k-mart fans for display. Classy!\n\nMy lobster sandwich was delicious with huge chunks of lobster inside. It was messy to eat since the sauce quickly soaked the bread and made it soggy. You get a generous portion of salad on the side as well. I also had the crab mashed potatoes and you can definitely taste the crab. It was quite good as well. \n\nOverall, I had a good experience with the food and service was good. Only thing that sucked was the heat.", "rating": 3, "date": "2010-06-15"}, {"excerpts": ["We had to try the side of crab mashed potatoes. ", "This was probably my favorite of the items. ", "I will have to try this place again for a more complete meal. ", "I have a feeling the gorgeous view would go nicely with an actual entree. ", "Not a bad restaurant, but the views be more spectacular than the food."], "author": "V B.", "review": "Had shared appetizers and a glass of wine the other night with my partner. The calamari wasn't bad. We also had the white wine muscles. I had ordered clams, but they were out sadly. Wish is came with more bread for the white wine sauce. We had to try the side of crab mashed potatoes. This was probably my favorite of the items. I will have to try this place again for a more complete meal. I have a feeling the gorgeous view would go nicely with an actual entree. Not a bad restaurant, but the views be more spectacular than the food.", "rating": 3, "date": "2014-07-17"}, {"excerpts": ["I'll be back at some point though, especially to try their Lobster Risotto and Crab Mashed Potatoes."], "author": "Mike L.", "review": "Really surprised by all the negative reviews...not to say that this place blew me away, but certainly lower than I would have guessed.  I had always wanted to try Waterfront after driving by a few times and then checking out their menu online though.  Plus, it's right on the waterfront (so THAT's where the name comes from... =P), so that view alone made it worthwhile to try.\n\nWe came here on a mild evening for their Happy Hour menu, and got a chance to eat in their \"patio\" area.  Wanting to try a bit of everything, we ordered their Clams with White Wine and Garlic, Mussels in Madras Curry, Calamari, Fries, and the Duet of Sliders.  The Calamari and the Fries were pretty standard, though they went great with the aioli sauce (calamari) or the mussels/clams sauces (fries).  The Clams and Mussels were pretty good, but I would opt for the mussels again if only because the Madras Curry made it a little more unique.  The real winner was the sliders plate - really hit the spot with a cold beer after a day at work, and probably one of the better sliders I've had.  \n\nThere are certainly some redeeming qualities about this place, but I have to admit I can see why some felt their experience was underwhelming.  Service was uneven, as the waitress was nice, but it took a while for her to make her rounds.  Also, when we arrived to get a table for the happy hour, the hostess gave us an odd look and checked the clock before bringing us a table (we were there 30 mins before it ended, so not sure what was going on there).  Some of the prices seem to land a bit on the high side based on the menu, but hard to say if it's worth it quality/portion wise.  Decent chance I'll be back at some point though, especially to try their Lobster Risotto and Crab Mashed Potatoes.", "rating": 3, "date": "2009-11-23"}, {"excerpts": ["I tasted some of the Crab Mashed Potatoes which were delicious, much tastier than the regular mashed potatoes that came with my steak. \n\n"], "author": "Chris G.", "review": "Went with a friend's immediate family for a birthday dinner, 5:45 reservation. Parking (for free) was a nightmare but it was also just before a Giants game. \n\nOverall quite simple, modern architecture and decor with a slight rustic feel. This place looks way better at night than it does during the day. Great view of the Bay bridge, Yuerba Buena and Treasure Island.\nWe were seated quickly as there were only 3 other parties. We ordered drinks, skipped the appetizers and went right for the entrees.\n\nI ordered the Grilled \"SRF\"(Snake River Farm) American Wagyu Flatiron Steak with a Demi-Glace and Mashed Potatoes. Also got a side of Grilled Asparagus.\n\nThe steak was very tasty, cooked medium-rare and quite juicy. However, it was a very small serving, even with the potatoes it was as filling as an average appetizer. For $24 it was too small of a portion. Grilled asparagus was undercooked, had grill marks but was still very crunchy and cold.\n\nI tasted some of the Crab Mashed Potatoes which were delicious, much tastier than the regular mashed potatoes that came with my steak. \n\nThe service was quite bad. After we ordered Entrees the waitress did not come back for ~30 minutes. We were all in need of drinks for a long time. 2 of the sides we ordered never showed up, and one of them was the wrong order. My friend's entree showed up as another wrong order, and it took another 20 minutes or so to bring the correct one out. After we were all finished and waiting for a dessert menu, again our waitress was nowhere to be found. We planned on ordering dessert, but by the time she got to our table we were off the idea.\n\nThe poor service was surprising as it was a very quiet night at the Waterfront. I wish i could've tried some more dishes as there were many interesting menu items, however what I had was overpriced and did not fill me up. The general manager came to our table afterwards to thank us and ask how everything was - which was nice - but, too little, too late.", "rating": 3, "date": "2011-06-17"}, {"excerpts": ["and I had the Lobster and my fave the crab mashed potatoes !!\n\n"], "author": "Patricia M.", "review": "We came back to the Waterfront last week for dinner and it was Great !\n\nThe Menu changed back to what we were used to, with some improvements for the better.\n\nA bit of a younger take over at the bar and couches, Happy Hour must be a hit with the mid-twenties crowd in search for  good times, food and drinks for under $20 after work. We decided to take a seat in the outside heated patio before dinner and enjoy the view.\n\nWe started with the prawns and calamari and a couple glasses of white wine.\nMy husband had the Cioppino as always and I had the Lobster and my fave the crab mashed potatoes !!\n\nThe food was good and tasty, the service was very attentive and not rushed.\nWe had a funny and engaging server with an accent, who made dinner entertaining and very satisfying.\n\nCan't imagine a better place to be next year to enjoy The America's Cup !!\n\nOverall, I can say its well worth it to drive out to the Embarcadero and enjoy places like the Waterfront.\n\nA classy older dame, that has weathered many winters and gets only better with time.", "rating": 4, "date": "2011-11-03"}, {"excerpts": ["views are amazing - started with glass of wine at the bar - super nice bartender, excellent selection by the glass - once seated, the crab mashed potatoes were awesome - the scallop special with pepitas, mushroom risotto, etc were great - attentive servers, happy diners"], "author": "Doug R.", "review": "views are amazing - started with glass of wine at the bar - super nice bartender, excellent selection by the glass - once seated, the crab mashed potatoes were awesome - the scallop special with pepitas, mushroom risotto, etc were great - attentive servers, happy diners", "rating": 4, "date": "2015-01-17"}, {"excerpts": ["I also had the delicious crab mashed potatoes."], "author": "Dani D.", "review": "Came awhile ago.Yea,wow that really helps with helping you decide on whether to go now. Hey,the view,company,drinks and good conversation may do the trick to come over to the Waterfront and try it out. \n\nI was lucky enough to go for an early lunch(a treat).We go there and the place wasn't even that busy yet.Not really and we sat near the patio,but inisde.I thought that would be nice to come on the weekend and sit and relax out there(yeah right,can I wear converse). \n\nAnyway,the waitress was nice and patient.The place was clean and even though people started coming in our waitress was still on a roll. \n\nI like the grilled pancetta wrapped prawns \nThe crab cakes were ok \n\nMy main course I decided on Grilled Hanger Steak & frites balsamic onions. I also had the delicious crab mashed potatoes.Yep,those were some luscious tasting carbs that I stuffed myself silly with. \n\nVery,very good.The service overall was great and for dessert I think I had some sticky toffee pudding...they had several selections of desserts to make a choice from,but by this time my button was ready to pop on my pants and I was ready to go...go,not back to work but go home and take a nap. \n\nWaterfront I thought was nice. Dressy/casual,I would say yes,but come as you are and see if they have the nerve to let you not come in. \n\nI think it may be casual.", "rating": 3, "date": "2010-01-18"}, {"excerpts": ["Highlights included buttermilk-coated calamari appetizer, crab mashed potatoes, wood-fired scallops with meyer lemon aioli.  "], "author": "Lxs S.", "review": "The Scene - Business Dinner, 6 people, beautiful spring evening, Waterfront Restaurant, under the canopied tent overlooking SF Bay.\n\nThe Food - generally good, but not great.  Highlights included buttermilk-coated calamari appetizer, crab mashed potatoes, wood-fired scallops with meyer lemon aioli.  Lowlights included improperly cooked brussel sprouts & limited vegan choices.\n\nThe Service - our waitress was very friendly but English was her 2nd language.  It was impossible to understand most of what she said.  When the time came for her to explain the specials, she read off a card that she barely understood - and she couldn't answer our questions.  Once we got past that, getting her attention throughout the remainder of the evening was spotty - she showed up when we didn't need her, but finding her when we did was aggravating.\n\nFor the price, the location and considering all the other nearby alternatives, Waterfront needs to up their game.", "rating": 2, "date": "2010-03-28"}, {"excerpts": ["I had Tuna served rare with citrus wasabi sauce, crab mashed potatoes and grilled asparagus. "], "author": "Wayne P.", "review": "I'm not feeling the hate that others have for the Waterfront. I can sum up this review in two words \"tourist trap\". Read no further if you hate these kind of places.\n\nI have passed the Waterfront Restaurant a thousand times. Yesterday the traffic was backed up heading into Fisherman's Wharf so I decided to take the risk and try the place.\n\nThe view was great. The service was excellent. The patio seating was comfortable, not too cool or hot. The food was not terrible. I had Tuna served rare with citrus wasabi sauce, crab mashed potatoes and grilled asparagus. My wife had a filet mignon (supposedly medium, but more on the well done side) and spinach.\n\nIt cost me 200 bucks for dinner, tip, 2 glasses of wine, a couple of cocktails, desert, a cup of coffee, and valet parking.\n\nThis is a case of a mediocre establishment being in an excellent location. Being \"not terrible\" justifies the 3 stars.", "rating": 3, "date": "2008-08-24"}, {"excerpts": ["And we both ordered a side of crab mashed potatoes which was perfect texture and so delicious. \n", "It sucks that I live in so. ", "cal. ", "and not up in san fran.", ", i would be going there all the time. ", "I think they really should have a restaurant in LA."], "author": "Matthew M.", "review": "Alright I understand that every restaurant is different at certain times and that one restaurant can be great at one time and then very bad at another. \nThis is my review of the Waterfront Restaurant, I went there with my mom, dad, and brother on August 7th this year. \n We went there between 2:45 and 3:30. We were seated in about 15 min. so thats a plus for not waiting that long.  But it did take a bit for us to order and for the food to get to us.  But overall it was worth it.  Me, my mom and dad, shared the Seafood Pasta but ordered it without any mussels in it. It was Delicious, there was not that much crab or lobster but the shrimps and clams were perfect, and the pasta was delicious because it soaked up all the delicious sauce and juices of the seafood. 5 star seafood pasta man, I'm telling you. By the way the White Wine lemon garlic broth was not  garlicky at all, it was the center of the dish.\nMy brother had the pan seared chicken, it was just as good. The jus was so delicious! the white beans, carrots, and green beans, in it were delicious as well. The chicken was perfectly seared and juicy, perfect serving of chicken and good helping of vegetables. \nAnd we both ordered a side of crab mashed potatoes which was perfect texture and so delicious. \nIt sucks that I live in so. cal. and not up in san fran., i would be going there all the time. I think they really should have a restaurant in LA.", "rating": 5, "date": "2011-08-13"}, {"excerpts": ["We ordered the seared Ahi Tuna, a side of the crab mashed potatoes, garlic french fries, and a half dozen fresh oysters on the half shell as appetizers. \n\n", "The crab mashed potatoes were my favorite thing out of everything we ordered. ", "Fluffy and light with crab evenly distributed in every mouthful. ", "MMMM. "], "author": "Julia W.", "review": "So I was shopping with my bff in Union Square. A bit chilled and all shopped out, we headed out of the masses of shoppers and out to a quieter area for dinner.\n\nWe figured we would pick a random restaurant along Embarcadero would be good. Lo and behold, we ended up picking the Waterfront Restaurant. We haven't been there and were curious to see what sumptuous food awaited for us. \n\nThe location is gorgeous. We were seated almost immediately against the windows near the outside patio. A gorgeous view of the Bay Bridge in the evening and a server who was very polite and attentive to us. We ordered the seared Ahi Tuna, a side of the crab mashed potatoes, garlic french fries, and a half dozen fresh oysters on the half shell as appetizers. \n\nIt was a great evening for us to catch up on what's going in our busy lives. The oysters came out first and were so fresh and delicious. Our eyes lit up as we savored each one.  Then our main meal came out. The Ahi Tuna was grilled rare (just the way I like it!) and the soy wasabi sauce was very tasty! The crab mashed potatoes were my favorite thing out of everything we ordered. Fluffy and light with crab evenly distributed in every mouthful. MMMM. Deliciousness!\n\nAll in all, it was a fantastic evening and we had a wonderful time. Of course, the restaurant was more on the pricey side but since we hardly hang out anymore, it was worth the experience.", "rating": 4, "date": "2008-11-19"}, {"excerpts": ["I tried the scallops and prawns, crab cakes, black angus NY steak and the crab mashed potatoes.  \n\n", "Crab mashed potatoes:  ", "Definitely one of the highlights of the night.  "], "author": "Brent T.", "review": "We recently had a company event at this restaurant and the main detractor of the evening was the service.\n\nThe waitress was insistent on asking us if we wanted pellegrino water and wine even though we repeatedly told her that we were not interested.  Also, throughout the entire night, it seemed like their main goal was to rush through the service so that we could leave and get out of their restaurant.  This seems strange and rude to us considering that they restaurant was pretty much empty.\n\nThe food was average at best.  I tried the scallops and prawns, crab cakes, black angus NY steak and the crab mashed potatoes.  \n\nScallops and prawns:  As a seafood restaurant, I don't think their seafood was as fresh as some other seafood restaurants that I've been to.  The scallops were better than average, but the prawns were similar to prawns that you can get at any average seafood restaurant.\n\nCrab cakes:  The texture was a little bit dry, but the crab seemed fresh and the taste was good.  The sauce was a little spicy but good.\n\nBlack angus NY steak:  The quality of the meat was hard to determine since they overcooked it.  We asked for medium, but it came back well-done.  The pommes frites that came with it was very well done and was a good compliment to the steak.\n\nCrab mashed potatoes:  Definitely one of the highlights of the night.  I've never had something like this, so it was a nice new side dish that tasted great.\n\nOverall, I think the worst part of the night was the service.  The food was decent and the view/ambiance was definitely unique.", "rating": 3, "date": "2008-06-02"}, {"excerpts": ["The crab mashed potatoes were pretty interesting. ", "I loved the texture of crab meat in mashed potatoes ", "but I thought it could've been more flavorful. ", "My bf's angus steak was humungo. ", "It came with garlic fries and bacon string beans. ", "I can't stand the taste of bloody red meat "], "author": "Annie C.", "review": "My bf took me here for my bday and what a nice surprise. The first thing that wow me was the gorgeous view. It was hot on that Saturday and the night was absolutely clear and warm. We were seated on the corner of the outer room and we have an unobstructed view of the lit bay bridge and the rising moon. So romantic.....\n\nWe ordered the crab cake as appetizer and it came out amazing fast, probably a minute after they gave us the bread. You can just tell that it was something that they made ahead and just heated through. The presentation wasn't too exciting but I liked it regardless because of they were really generous with the crab meat. BTW, after eating the grilled bread from Pisces in Sunset, plain old bread will never make it anymore. I had the Seabass with lemon caper sauce. I could care less about the sauce because the fish was better by itself. The crab mashed potatoes were pretty interesting. I loved the texture of crab meat in mashed potatoes but I thought it could've been more flavorful. My bf's angus steak was humungo. It came with garlic fries and bacon string beans. I can't stand the taste of bloody red meat so I didn't try it. \n\nMost of the waiters there were older folks that had a hard time remember what the special of the night was. It was a bit slow for them to get to our table although there were people in only 1/4 of the restaurant. The whole place wasn't as fancy as I imagined it to be. The food was definitely a bit disappointing. The best thing of the night was being able to spend time w/ my bf. That in itself is priceless.", "rating": 2, "date": "2008-11-21"}, {"excerpts": ["The crab mashed potatoes were very good, and we enjoyed our grilled asparagus. ", "The Hawaiian Swordfish was excellent. ", "The wine the manager recommended was fabulous, we couldn't have had a better evening."], "author": "Michelle W.", "review": "I had an excellent experience at the Waterfront. We could see the Bay Bridge, and the Embarcadero Ctr was lit up like presents for Christmas! The crab mashed potatoes were very good, and we enjoyed our grilled asparagus. The Hawaiian Swordfish was excellent. The wine the manager recommended was fabulous, we couldn't have had a better evening.", "rating": 5, "date": "2010-01-25"}, {"excerpts": ["Forget the Lobster on the plate that is also to-die-for, forget the Filet Mignon on Crab Mashed Potatoes ", "that's ", "to-die-for, ", "oh hell this food is to-die-for! ", "Service is great, ", "prices pretty good for this area and considering the food that's to-die-for. ", "Don't pass this place bye, you'll be missing one of the best restaurant experiences around."], "author": "Dave K.", "review": "This place is soooo good, ate here three nights in a row! Let me say: \"Lobster and black Truffle Mac 'N Cheese\" - to-die-for! Forget the Lobster on the plate that is also to-die-for, forget the Filet Mignon on Crab Mashed Potatoes that's to-die-for, oh hell this food is to-die-for! Service is great, prices pretty good for this area and considering the food that's to-die-for. Don't pass this place bye, you'll be missing one of the best restaurant experiences around.", "rating": 4, "date": "2010-05-09"}, {"excerpts": ["If you get a chance also try their crab mashed potatoes and wild mushrooms. \n\n"], "author": "Green P.", "review": "If you're looking for fresh and delicious food in a tranquil environment accompanied by great service then you have reached your destination. \n\nThis place has the tastiest swordfish ever! It is definitely fresh and seasoned to perfection. Their halibut is also delicious and my guy who is a lobster fan boasts about their lobster salad. If you get a chance also try their crab mashed potatoes and wild mushrooms. \n\nI have to say I am baffled by the negative reviews below. I have received impeccable service from the staff every time I have come here whether it be lunch or dinner. The only reason I am not giving it a full 5 stars is because there is a hostess there that has an abrupt personality. Other than that the servers are attentive and there is a private parking lot next to the restaurant with valet parking for only $10. If that weren't convenient enough they can put the $10 directly on your bill if you're like me and never carry cash. They have a great selection of wine and champagne. The restaurant itself has been remodeled and has a very modern feel to it. \n\nI must admit that when I returned from a long weekend away from my honey and he mentioned he had made reservations here I was disappointed due to all the negative reviews posted. I am so glad we didn't cancel our reservations, we love this place! It has become our guilty pleasure! If you haven't tried it yet it is definitely worth trying, but beware it may turn into your guilty pleasure as well.", "rating": 4, "date": "2010-05-27"}, {"excerpts": ["Crab mashed potatoes - this was by far the tastiest thing I had all night. ", "I would go here just to get the crab mashed potatoes... ", "it was SO GOOD. ", "You took a bite and there was the perfect amount of shredded crabmeat intermingled with thick mashed potato and a lovely sweet butteriness that was just fabulous.\n", "Almond Cake dessert ", "- I enjoyed the almond cake, but I've had better (often). ", "The cake itself was moist enough but the dish would have benefited from having some liquor-based sauce drizzled over it. ", "Strawberries and creme fraise were served with the dish. . . ", "the creme needed a little more sweetness, it was quite bland. ", "The combination of the three was very light - overall for a dessert too mild.\n", "Peach Tartin with Cinnamon Ice Cream - Average. ", "The tart itself didn't stand up to the heavily syruped (and very thinly sliced) peaches. ", "Cinnamon Ice cream was very nice - not too sweet and could have actually been a little less sweet to contrast the very very syrupy peaches.\n", "White Peach and Lemon Sorbet - my favorite dessert. ", "Definitely order this. ", "The white peach sorbet had that lovely \"fuzzy\" finish, which seems so hard to replicate because I rarely have the pleasure of experiencing fuzzy sorbet. ", "The lemon sorbet was fabulous. ", "Very tart, made your lips smack, and complimented the white peach very well. ", "I would definitely go out of my way just to have some.\n", "Creme Brulet - I'd say that this creme brulet was above average. ", "I love when it's not too firm, which this pulled off. ", "Didn't knock my socks off.\n", "Espresso - this was really very good and my date actually ordered one for himself after tasting mine. ", "did not taste burnt at all, very nice creme, lovely finish. "], "author": "Annie T.", "review": "I'm going to break this review into three categories: Food, Ambiance, Service.\n\nFood: 2 stars\nCrab cakes: Actually quite good. They were very small, but the crab was very meaty, fresh, and it wasn't mucked up with any creaminess in the cake itself. The sauce served with the crab cakes complimented the crust nicely.\nFries: Average and for the money I expected better. They could have been a little crispier, maybe cooked another minute\nClam Chowder: It had bacon in it, which was very nice. The bacon was quality (thick chunks of smoked bacon). There was also a nice amount of pepper in the chowder, which I really enjoyed. I think what was missing was that it seemed that the bacon was thrown into the chowder as an afterthought - it didn't taste as if the soup itself were stewed with bacon so the flavor wasn't injected well throughout the soup. Also, it was a little too creamy and thick for my taste. I prefer a chowder that you can't stand a spoon up in.\nLemon Risotto with Lobster: There may as well have been no lobster in there, because I didn't get any lobster flavor at all. I expected the lemon to be more flavorful - there was only a hint of lemon and there was zero lemon on the finish. My expectation was to have some seafood (lobster, perhaps?) undertone but there was nothing. The portion was enormous, however and it took passing the plate around to finish it.\nSpecial last night - seared ahi tuna with butternut squash puree - It was maybe the biggest serving of ahi tuna I have ever seen. It was too thick - the sear was so thin compared to the sheer thickness of the steak. There were two pieces served in a bowl - the bowl was far too small for this portion. that dish could have easily been served on a platter twice as big. Presentation was horrible. Ok, back to the food. I took a bite and I was surprised at the lack of flavor. It was basically sashimi with a 30 second sear on each side with no flavoring. The butternut squash puree was too thin - and there was far too much of it served - you couldn't pick it up really with your fork, you really needed a spoon to scoop it.  The sweetness was nice, but I didn't understand what it was doing with the ahi tuna - there was nothing added to the ahi by combining the puree with the tuna in one bite. \nPetrole Sole - There was nothing really impressive about this dish. The fish itself was well cooked but there was a severe lack of flavoring. The sauce served with the sole was tomato-based and added absolutely nothing to the fish.\nCrab mashed potatoes - this was by far the tastiest thing I had all night. I would go here just to get the crab mashed potatoes... it was SO GOOD. You took a bite and there was the perfect amount of shredded crabmeat intermingled with thick mashed potato and a lovely sweet butteriness that was just fabulous.\nAlmond Cake dessert - I enjoyed the almond cake, but I've had better (often). The cake itself was moist enough but the dish would have benefited from having some liquor-based sauce drizzled over it. Strawberries and creme fraise were served with the dish. . . the creme needed a little more sweetness, it was quite bland. The combination of the three was very light - overall for a dessert too mild.\nPeach Tartin with Cinnamon Ice Cream - Average. The tart itself didn't stand up to the heavily syruped (and very thinly sliced) peaches. Cinnamon Ice cream was very nice - not too sweet and could have actually been a little less sweet to contrast the very very syrupy peaches.\nWhite Peach and Lemon Sorbet - my favorite dessert. Definitely order this. The white peach sorbet had that lovely \"fuzzy\" finish, which seems so hard to replicate because I rarely have the pleasure of experiencing fuzzy sorbet. The lemon sorbet was fabulous. Very tart, made your lips smack, and complimented the white peach very well. I would definitely go out of my way just to have some.\nCreme Brulet - I'd say that this creme brulet was above average. I love when it's not too firm, which this pulled off. Didn't knock my socks off.\nEspresso - this was really very good and my date actually ordered one for himself after tasting mine. did not taste burnt at all, very nice creme, lovely finish. Complimented the almond cake very nicely.\n\nAll in all, I will probably never go back for food. But, it very well may be a nice place to stop in for dessert and espresso.\n\nAmbiance: 5 stars on the patio, 2 stars indoors\nThe patio is the winner here, everyone's said it. The space is small and intimate and the view is to die for. There's really no other reason to take someone here.\n\nService: 2 stars, was three, but they lost a point at the very end. \nService was OK.  He took quite a while to get around to ordering. He never once came by to ask how the food or how the drinks were, which was a bit odd - at the end however, he said \"you do realize service is not included, right?\" Umm... LAME.\n\nomg, I've reached my max.", "rating": 2, "date": "2008-09-21"}, {"excerpts": ["As other reviewers observed, the crab mashed potatoes are worth eating, esp. ", "with a tasty lemon sauce around them. ", "Your other choices are tuna (got good reviews at my table), slightly overcooked salmon, slightly overcooked white fish of various varieties. ", "And steak. ", "Dessert, ditto: flourless chocolate cake, ok, apple tart , shrug, etc etc. ", "If I were served this food at a large wedding or other event, it would be unremarkably fine. ", "Something you can eat without comment in the background. ", "At an SF restaurant, it seems inexcusable. ", "My recommendation: order a couple straight whiskeys and eat the crab mashed potatoes."], "author": "Carrie G.", "review": "\"Meh\" pretty much sums it up. The restaurant is pretty, the view is great. If you get stuck going here, its not the end of the world. Whoever designed the menu did a reasonably good job, but the execution is poor both on the food quality and the service front. And you know what poor execution means in a seafood restaurant: yup, that's overcooked fish. Nothing here tastes _bad_, mind you, but its often not high on the flavor or freshness scale. As other reviewers observed, the crab mashed potatoes are worth eating, esp. with a tasty lemon sauce around them. Your other choices are tuna (got good reviews at my table), slightly overcooked salmon, slightly overcooked white fish of various varieties. And steak. Dessert, ditto: flourless chocolate cake, ok, apple tart , shrug, etc etc. If I were served this food at a large wedding or other event, it would be unremarkably fine. Something you can eat without comment in the background. At an SF restaurant, it seems inexcusable. Especially given the prices.\n\nAs for the service, it was well-intentioned. But it didn't work out successfully. We were a table of 10, and the waitress wrote down the position of every dish. But then the plates would come and it would be a whole 5 min of, who ordered the salmon? Repeated with every course. And the wrong desserts came out, there was a 5 min discussion withe the waitress of whether it was possible to order a half-caf cappuccino (I was spectating and the result seemed highly unclear, though some form of cappuccino did arrive). And each plate seemed to be brought by a different person who had no contextual information, despite the fact that the restaurant was largely empty.\n\nTo sum up: the 2.5 star average on Yelp seems fair to me. Don't go by choice, but if you have to go, you'll live through the experience. My recommendation: order a couple straight whiskeys and eat the crab mashed potatoes.", "rating": 2, "date": "2008-12-31"}, {"excerpts": ["I did have the fore sight to order a side of crab mashed potatoes ($6) which was totally awesome. ", "They use real crab, not crab with a \"K\". ", "They kept the french bread (sliced baggets, kinda hard) coming... and the coffee was excellent. ", "The servers did keep getting the plates mixed up on who ordered what... there were only four of us. ", "All in all, this place charges waaaaay too much (brunch for four... $140.00) for service that could be better, and food "], "author": "Rick V.", "review": "HAPPY NEW YEAR!\nOur first trip to a restaurant this year belonged to the Waterfont, New Year's Day for lunch.\n\nRight off the bat, $10 to park in their little valet lot... more on this later. We did have reservations for four, but the place was not crowded at all. We were seated right away. The view is incredible! Too bad it was overcast. The staff is very courteous, friendly and attentive. Two brunch specials ($20. ea) were ordered that had granola & fruit with cream to start, then a single halved sausage served with a egg & mushroom scramble. Sorbet & coffee... nothing really exciting. I ordered the fried calamari appetizer($11), which was really tender and seasoned really great, and the fish and chips entree. This order was pathetic... a bed of battered fries and onions, with five or six fish nuggets on top and a little cup of malt vinegar. $16 bucks! I did have the fore sight to order a side of crab mashed potatoes ($6) which was totally awesome. They use real crab, not crab with a \"K\". They kept the french bread (sliced baggets, kinda hard) coming... and the coffee was excellent. The servers did keep getting the plates mixed up on who ordered what... there were only four of us. All in all, this place charges waaaaay too much (brunch for four... $140.00) for service that could be better, and food that's just average.\n\nAbout the valet parking... you pull up, the guy backs in to the spot like 10 feet away for you. When you come back, he asks you what car you have (yeah, I could've said the Big Silver Lexus, but...) then he pulls it out of the space for you, a car length or so. (wow!) It was New Years, I gave him the $10 plus another buck.\n\nYou don't have to eat here...  but take your camera, the view is the same from outside the building.", "rating": 2, "date": "2009-01-03"}, {"excerpts": ["Highlights were cream of asparagus soup with a small and delicious crab garnish, crab mashed potatoes, spinach side, and dessert sampler. ", "Not happy with the roasted root vegetables (were they roasted a few days ago?), the roasted salmon (oily), or the saffron citrus sauce. ", "Grilled salmon, oysters, steak, and scallops were all ok to pretty good. ", "You can get better food elsewhere nearby & can pay less for it, but you aren't likely to get such a great view and classic \"nice\" atmosphere. ", "Nice bar area downstairs too."], "author": "karis m.", "review": "Great view of the Bay and a reservation landed our party of 4 a table by the bayfront windows for dinner. Staff was friendly and polite, but service was a bit slow and the server a bit inattentive. Reasonable wine prices and an ok list - not huge but some good choices. The dinner menu is small with meat, fish, and seafood options - nothing on the\nmenu for vegetarians. Our server informed us they were out of 2 menu items - artichokes (currently in season!) and ahi tuna. Very good French bread and delicious butter. Highlights were cream of asparagus soup with a small and delicious crab garnish, crab mashed potatoes, spinach side, and dessert sampler. Not happy with the roasted root vegetables (were they roasted a few days ago?), the roasted salmon (oily), or the saffron citrus sauce. Grilled salmon, oysters, steak, and scallops were all ok to pretty good. You can get better food elsewhere nearby & can pay less for it, but you aren't likely to get such a great view and classic \"nice\" atmosphere. Nice bar area downstairs too.", "rating": 2, "date": "2011-05-16"}, {"excerpts": ["The crab mashed potatoes were promising comfort food.  ", "Again, they were good, but not great.  "], "author": "Catherine C.", "review": "I recently took a good friend here for dinner on a special girls' night out.  I had been hoping that the other reviews were just a fluke, but sadly, this is not true.  \n\nMy first reaction: \"tacky tacky tacky\" when I saw the reference to a 4% surcharge on your bill being added for health insurance costs.  Why not just add it to the cost of the menu without making me feel guilty?  I want San Franciscans to have health insurance.  I want good food.  I do not care for passive agressive political statements on my menu.\n\nThat being said, it's really about the food. I ordered off the \"fresh fish wild your way\"  part of the menu, and selected sea bass.  I mean, really.  Sea bass is a glorious fish and kind of hard to mess up, considering the fat content.  And my fish wasn't bad.  It just wasn't good.  The fish was slightly overdone and somewhat tasteless.  I will say, however, that the soy citrus wasabi sauce was very tasty.  Perhaps the flavors could have been used better than as a sauce added on the plate.  \n\nThe crab mashed potatoes were promising comfort food.  Again, they were good, but not great.  Just a bit underseasoned.  \n\nOn a good note, the pancetta wrapped prawns were grilled to perfection and the wine choices were as expected.  The location can't be beat - great views all around.  \n\nOverall, I'm not going back.  May be worth trying once, if someone else is paying and you want a nice view to go with your dinner.  Probably not worth it if you are there for the food.", "rating": 2, "date": "2008-07-01"}], "lobster mac  cheese": [], "french fries with parmesan": [{"excerpts": ["I ordered Ahi Tuna Tartare with a side of French Fries with Parmesan. ", "It took a long time for our order to come through but our host apologized for the incident. ", "We also ordered a bottle of 2016 Duckhorn Sauvignon Blanc. ", "The tuna tartare was sweet and it came with about 4 fried wontons. ", "Frankly, the Tuna Tartare to Fried Wontons ratio was totally off. ", "I need like at least 4 more wontons. ", "I mean, you don't expect me to pile up raw fish on a crumbling wonton. ", "Otherwise, it was good.\n", "The fries we're subpar. ", "That's a \"skip-that-shit."], "author": "Sheila C.", "review": "I ordered Ahi Tuna Tartare with a side of French Fries with Parmesan. It took a long time for our order to come through but our host apologized for the incident. We also ordered a bottle of 2016 Duckhorn Sauvignon Blanc. The tuna tartare was sweet and it came with about 4 fried wontons. Frankly, the Tuna Tartare to Fried Wontons ratio was totally off. I need like at least 4 more wontons. I mean, you don't expect me to pile up raw fish on a crumbling wonton. Otherwise, it was good.\nThe fries we're subpar. That's a \"skip-that-shit.\"\n\nThe 2016 Duckhorn Sauv Blanc was well-balanced. Bold with pineapple on the palate and pear on the nose.", "rating": 4, "date": "2017-09-14"}], "shisito peppers": [], "blue lake green beans": [], "spinach  napa cabbage": [], "asparagus with lemon  olive oil": [], "buttermilk fried calamari rock shrimp  fennel lunch": [], "dungeness crab cakes lunch": [], "grilled pancetta wrapped pawns lunch": [], "steamers lunch": [], "ahu tuna tartare lunch": [], "mussels lunch": [], "maine lobster risotto lunch": [], "beef tartar and fries lunch": [], "waterfront clam chowder lunch": [], "baby lettuce salad": [], "classic caesar salad lunch": [], "seafood cobb salad lunch": [], "waterfront louie salad lunch": [], "heirloom tomato salad lunch": [], "rock cod fish  chips lunch": [], "handmade seafood linguini lunch": [], "veggie pasta penne lunch": [], "weekly prefixed lunch special": [], "waterfront cioppino lunch": [], "seafood pasta lunch": [], "grilled sea bass lunch": [], "king salmon lunch": [], "oven roasted day boat scallops lunch": [], "mixed grill salmon prawns scallops  lobster tail lunch": [], "spaghettini pasta lunch": [], "alaskan halibut fish and chips": [], "marys chicken breast lunch": [], "grilled new york strip steak lunch": [], "petrale sole meuniere lunch": [], "crab mashed potatoes lunch": [], "grilled asparagus lunch": [], "lobster mac  cheese lunch": [], "french fries with parmesan lunch": [], "brussels sprouts lunch": [], "baked oyster lunch per oyster": [], "chefs selection of oysters lunch per oyster": []}