{"chunky guacamole  chips": [], "queso  chips": [], "campfire cornbread skillet": [{"excerpts": ["- Campfire cornbread skillet: pretty straightforward and tasty\n- Squash blossom puffy taco: by far my least favorite item that we ordered. ", "All you could taste was fried-ness. ", "All of the other flavors (goat cheese, black beans, romesco sauce) were completely hidden. ", "I took one bite and was done. \n", "- Dungeness crab enchilada: "], "author": "Regina L.", "review": "Oof. As my husband said at the end of our meal, \"that was a two going on four, if, well, you know...\" \n\nOur experience at West of Pecos was not great. In fact, it was rather disappointing. We came in on a Thursday, and while it seemed pretty full, we were seated immediately. We were looking for a lowkey, fun date night spot, but as we were getting seated, I worried out loud if perhaps this was not the vibe we were looking for. The restaurant has a (barely) more upscale Chevy's vibe, complete with the table of women next to us getting drunk on margaritas and a table of screaming children and apathetic parents on our other side. Mind you, I completely understand that it's out of the restaurant's hands how people choose to behave themselves. However, it definitely didn't help. \n\nOur server was friendly and answered a few questions that we had about the menu. We figured out what we wanted to order fairly quickly: \n- Queso deluxe: chorizo, guac, sour cream and corn atop a large skillet of queso. Probably my favorite dish, but chips were only ok. \n- Campfire cornbread skillet: pretty straightforward and tasty\n- Squash blossom puffy taco: by far my least favorite item that we ordered. All you could taste was fried-ness. All of the other flavors (goat cheese, black beans, romesco sauce) were completely hidden. I took one bite and was done. \n- Dungeness crab enchilada: This dish was fine; portion of crab was generous but the dish was a little all over the place in terms of taste. \n\nI also ordered the green michelada which just tasted like celery juice with a splash of beer. Definitely not great, but I was warned that it was far different from a traditional michelada. My husband got a mezcal cocktail and enjoyed it. \n\nWe asked for hot sauce twice during our meal, and our server completely forgot to order it. We had also ordered a side of rice and beans, which never came. It ended up being fine because I got pretty full on the chips and queso alone. The food was super heavy and definitely was not a great date night choice. I could see this place being fun if you only plan on getting drinks and some appetizers. Otherwise, I'm sticking with traditional Mexican food from now on.", "rating": 2, "date": "2017-08-21"}, {"excerpts": ["As for food, we ordered the guacamole and the campfire cornbread skillet for appetizer, and the fish tacos and the fried chicken for the main courses.\n\n"], "author": "Luby H.", "review": "Everything about West of Pecos was spectacular! As a walk in on Friday night, we were surprisingly seated right away even though our entire party wasn't present yet. We actually sat at the table for a good 30 minutes at least before the others showed up, but the waitresses were so kind and understanding and refilled our drinks constantly. \n\nAs for food, we ordered the guacamole and the campfire cornbread skillet for appetizer, and the fish tacos and the fried chicken for the main courses.\n\nI must say that all 4 of these dishes were truly amazing that I think they are equally as recommendable depending on your personal preference. The guacamole is a definite must because of its freshness but the cornbread was just divine when eaten with the syrup and butter. On the other hand, I personally love fish tacos and ze rally enjoyed the perfect texture of the fried fish strips in my tacos, but the fried chicken was one of the best I've ever had. The chicken was tender and the breading had a sweet finish due to the brown sugar buttermilk. Paired with the collard greens and mashed potato, it was divine. \n\nThis is definitely a restaurant worth trying and one I will be coming back to!", "rating": 4, "date": "2014-12-19"}, {"excerpts": ["We had the campfire cornbread skillet and was so yum, had to take the rest home.\n\n"], "author": "David V.", "review": "Went there last night around 9pm and did not have a reservation. After waiting about 10 minutes we got seated!! \n\nThe drinks and the food great. I did not have high expectations, as there are so many places opening in the Mission these days, but I was greatly surprised.\n\nI would recommend the \"Crumbled Goat Cheese & Wild Arugula\" - simply devine - the dried tomatoes was a good surprise. The \"Pollo Asado Al Carbon\" (half chicken) was delicious - well seasoned! We had the campfire cornbread skillet and was so yum, had to take the rest home.\n\nGo check out this place. I think they are still fining their feet with service, but the food and the atmosphere was awesome. Planning to go back soon.", "rating": 5, "date": "2012-08-05"}], "maple glazed pork belly": [{"excerpts": ["The maple glazed pork belly tacos melted in our mouths. ", "the scrambled eggs def gave it a breakfast touch to differentiate it from regular tacos. ", "for dessert we got a side of CHURROs that came with mexican chocolate dipping sauce. ", "deeee-freakin-licious. ", "the BLOODY MARY was also nice and spicy "], "author": "Veronica E.", "review": "we got to Sunday Streets early, this time it was in the Mission. Naturally, we were hungry so we made our way to West of Pecos... BEST DECISION everrr\n\nAMBIANCE: we walked into this very \"OC\" reminiscent Mexican food spot, meaning it was super clean and \"fancier\" than the average City spot. it was pretty large and open but we sat closer to the bar. it was a long booth with small round tables along side it. the decor was a mix of dessert icons, wooden chairs and tables, chilli peppers hanging from the ceiling, cattle skulls and horns, rot iron candle chandelier, and leather skins as portrait. i felt like i wanted to buy some cowboy boots from Wasteland so i can wear them here even though it's casual and no specific attire :)  \n\nFOOD:  SO GOOD. seriously. I'm from San Diego and i'm very critical of Mexican food and dont really care for classic mexican food but this spot has it on point! i got the DUNGENOUS CRAB BREAKFAST CHIMICHUNGA, my cousins got the BREAKFAST PORK BELLY TACOS, and HUEVOS RANCHEROS. i would rank the goodness in that order too. the crab chimichunga was so light and flakey on the outside and contained collared greens, bacon, scrambled eggs, mascarpone, and green chillies. i enjoyed every bite! oh and it was also larger than the plate in length. The maple glazed pork belly tacos melted in our mouths. the scrambled eggs def gave it a breakfast touch to differentiate it from regular tacos. for dessert we got a side of CHURROs that came with mexican chocolate dipping sauce. deeee-freakin-licious. the BLOODY MARY was also nice and spicy :)\n\nPRICE:  average per plate is $12, but you get what you pay for!\n\nSERVICE: the waiter we had was sooo nice and accommodating. we asked if we could get a side of Churros since we saw there is a dish of Fried Chicken and Churros and he was more than happy to accommodate.\n\nPARKING: street parking in the mission, well you know how that goes.", "rating": 5, "date": "2014-09-08"}, {"excerpts": ["Even if you're looking for something more traditional they've got the eggs benny perfected; the maple glazed pork belly is the most delicious thing you've ever tasted; and the french toast looks awesome (though I haven't yet tried it).\n\n"], "author": "Karina K.", "review": "Ummm, how is this place not packed on a Saturday morning?! I've been here for dinner, and raved about the food (baby kale tostada salad is fresh, super tasty, and really a meal in itself; fish tacos are deelish, too!) \n\nBut brunch is my new dig. I've tried the Stuffed Poblano Chiles; and Austin Breakfast Tacos. Both amazing. Even if you're looking for something more traditional they've got the eggs benny perfected; the maple glazed pork belly is the most delicious thing you've ever tasted; and the french toast looks awesome (though I haven't yet tried it).\n\nMy fave in the brunch spread, I have to admit, is sipping down those Pecos Pimms Cups. I'm not even a cocktail kinda person, but they're sooo delightfully refreshing and tasty, especially while looking out through the open windows to the buzz of Valencia street.", "rating": 5, "date": "2014-05-12"}], "biscuit  strawberry jam": [], "fresh seasonal fruit": [], "american breakfast": [{"excerpts": ["My girlfriend and I got the American breakfast which was good but the crown jewel was the croissant french toast. ", "Devine. "], "author": "Shachar M.", "review": "Wow what a brunch. We toured all over the city looking for a good brunch place on our first visit to San Fran and we saw this one on Yelp. 15 min later on an Uber pool we got here and we had one of the best brunch food we ever had! \n\nMy girlfriend and I got the American breakfast which was good but the crown jewel was the croissant french toast. Devine. Nothing can't describe how enjoyable was that experience.\n\nIn a nut shell go there and order it!", "rating": 5, "date": "2016-01-17"}, {"excerpts": ["I got the American breakfast which comes with eggs, biscuit, and home fries. ", "The biscuit is delicious. ", "It's huge fluffy and crispy on the outside. ", "No need to add butter or jelly on it because it's so good. ", "Now if you want a life changing experience get the croissant French toast. ", "Holy moly ", "it was the best breakfast food I have ever experienced! ", "First off it's huge. ", "Secondly it's amazing! ", "Not to sweet and not to cinnamon based flavor like some French toast. "], "author": "Krizia C.", "review": "My 5 stars is based off the brunch menu only. Although I did look around at other tables and their food looked amazing. \n\nWalked in on a Sunday afternoon and had no issue Getting a table. It was packed, but no crazy lines. Also the place is roomy so you can go to the bar and wait. The service was attentive and good. \n\nI got the American breakfast which comes with eggs, biscuit, and home fries. The biscuit is delicious. It's huge fluffy and crispy on the outside. No need to add butter or jelly on it because it's so good. Now if you want a life changing experience get the croissant French toast. Holy moly it was the best breakfast food I have ever experienced! First off it's huge. Secondly it's amazing! Not to sweet and not to cinnamon based flavor like some French toast. We opted for the butter and fruit on the side and it was worth it because the French toast is so damn good! \n\nI left stuffed satisfied and can't believe I've been missing out on such good brunch.", "rating": 5, "date": "2016-01-17"}, {"excerpts": ["The croissant french toast, american breakfast, fried chicken and churros and eggs benedict were all divine! ", "fresh, well cooked, not greasy, tasty and authentic. ", "Will go back for sure. ", "Service can be perked up a bit but food is 5 stars!"], "author": "Sarah M.", "review": "We walked in on a whim on sunday morning. And we made the right decision. We ordered from the brunch menu. The croissant french toast, american breakfast, fried chicken and churros and eggs benedict were all divine! fresh, well cooked, not greasy, tasty and authentic. Will go back for sure. Service can be perked up a bit but food is 5 stars!", "rating": 4, "date": "2016-01-22"}], "christmas huevos rancheros": [{"excerpts": ["The Christmas Huevos Rancheros were good and the carnitas ", "puffy taco was amazing.  ", "The chile con queso with chips was a great way to start.   ", "All in all a great place for brunch"], "author": "Bob B.", "review": "We had a great time.    Loved the New Mexican style food. Great ambiance outside with our own beehive fireplace.   We'll be going back.  The Christmas Huevos Rancheros were good and the carnitas puffy taco was amazing.  The chile con queso with chips was a great way to start.   All in all a great place for brunch", "rating": 5, "date": "2015-08-30"}], "pork belly austin breakfast tacos": [{"excerpts": ["Two Pork Belly Austin Breakfast Tacos (scrambled eggs, maple-glazed pork belly, shredded cheese, pico de gallo, flour tortillas, avocado, chipotle aioli. ", "$10) - 4.5 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#5HwcWC73YaajuKoDOXn6kA\n", "up close: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#_islhVp7CmGvwdkVGn1IMw\n", "The tortillas were amazing! ", "Thick, freshly made, that texture that's soft yet holds well, that crackles just a little bit when you pick it up and bend it around the toppings. ", "This was a huge standout for me in the meal. ", "Most of the taco is filled with eggs, which are big, light, fluffy. ", "There is a giant slab of pork belly on top, and a big slice of avocado. ", "While all the ingredients were great, it was a little imbalanced with mostly eggs. "], "author": "Ziyan C.", "review": "I'm almost hesitant to review West of Pecos for brunch because it means the secret will be out about how AWESOME it is. Here's why:\n\n1) No wait. None. For 6 people, at 11:30am on a Sunday? Unheard of! We could've shown up at 12pm or 1pm - same. There may appear to be no tables available when you reserve online, but if you email they're very prompt. I didn't even need to do that in the end!\n\n2) VERY cost-effective. Every dish was well under $15, most were around $10 - and of course it was all really tasty as well as vegetarian-friendly.\n\n3) Excellent service. We were very well-attended to (they were often coming around, we asked for hot water which was a little unusual and they made sure to refill those too, they saw I was cold and closed the doors that were previously propped open) and made sure to tip extra because they deserved it. \n\nSNACKS\n* Carrot Cake French Toast (cream cheese frosting. $8) - 4.5 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#svuomVWB8Ah0oXe5zH6nIw\ncross-section: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#_BQfDZu70GRK8ILfo9r9DA\nHow can you NOT order this? Two of my favorite things in the world in one, and they make it work. The texture was more dense like carrot cake, but the edges of the bread were crisped like French Toast. The cream cheese frosting, raspberries, maple syrup, and glazed pecans were awesome, awesome, awesome together.\n\n* Biscuit & Strawberry Jam ($3) - 3.5 stars\nThe jam is great - light, a little tart. The biscuit was soft and fluffy on the inside, with a thick shell, but was a bit dry.\n\nBRUNCH\n* Two Pork Belly Austin Breakfast Tacos (scrambled eggs, maple-glazed pork belly, shredded cheese, pico de gallo, flour tortillas, avocado, chipotle aioli. $10) - 4.5 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#5HwcWC73YaajuKoDOXn6kA\nup close: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#_islhVp7CmGvwdkVGn1IMw\nThe tortillas were amazing! Thick, freshly made, that texture that's soft yet holds well, that crackles just a little bit when you pick it up and bend it around the toppings. This was a huge standout for me in the meal. Most of the taco is filled with eggs, which are big, light, fluffy. There is a giant slab of pork belly on top, and a big slice of avocado. While all the ingredients were great, it was a little imbalanced with mostly eggs. Also, the avocados & pork belly on top - while it looked great - made it hard to eat because they were such big pieces placed neatly on top of the eggs.\n\n* Polenta con Chorizo (aged cheddar, eggs, smoked cream, corn, veggies, home fries. $13) - 4 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#pAaa-FiwmUn4ZxrXGhAhKw\ncross-section: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#nSiXZgRDqW_VzQ669qFFxQ\nThis was a very uniquely made! I was expecting a thick soup-like polenta on the bottom of the bowl, but they actually fry the polenta into two slabs. I liked that! A big of crunch, a chance to break open the poached egg and let the yolk run over it. There wasn't as much meat as I'd hoped in the soup, maybe 2 big chunks, but it was soft super tasty. \n\nLUNCHY\n* Pair of Baby Kale Tostadas (black beans, guacamole, tomato vinaigrette. $9) - 4 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#W5jfn0H-6XwolV6i_s155g\nI tried a bite of this and it was great! Lighter fare, but great balance of flavors.\n\nBrunch/lunch menu: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#zf8-3MnDpltyc0uGAwR6mQ\nDrinks: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#9Y_1KZZGsYmGHtOKdh-0HA", "rating": 5, "date": "2014-12-21"}], "pecos eggs benny": [{"excerpts": ["To eat, we had the pecos eggs benny (comes with a side salad and home fries) and the pork belly breakfast tacos (no side). "], "author": "Aletta B.", "review": "Wandering around the mission on a sunny Saturday morning and I ended up at West of Pecos for brunch. I was more than happy to stay once I arrived. The place has a great vibe - with the bushels of chili peppers hanging from the ceiling and the friendly staff - I enjoyed my time there. \n\nThe brunch menu takes classic American brunch and gives it a bit of a Mexican spin. First off I tried the bloody mary, which I was a bit apprehensive about (made with interesting ingredients). However, the combination they came up with (which I cannot remember) tasted just great! To eat, we had the pecos eggs benny (comes with a side salad and home fries) and the pork belly breakfast tacos (no side). Both were delicious! \n\nWest of Pecos does not have outdoor seating, but there are tables by the windows, which is almost as good. The perfect spot to grab a drink or a meal, anytime of the day.", "rating": 3, "date": "2016-02-15"}], "dungeness crab breakfast chimichanga": [], "fried chicken  churros": [], "stuffed pobland chile": [], "carrot cake french toast": [{"excerpts": ["* Carrot Cake French Toast (cream cheese frosting. ", "$8) - 4.5 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#svuomVWB8Ah0oXe5zH6nIw\ncross-section: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#_BQfDZu70GRK8ILfo9r9DA\n", "How can you NOT order this? ", "Two of my favorite things in the world in one, and they make it work. ", "The texture was more dense like carrot cake, but the edges of the bread were crisped like French Toast. "], "author": "Ziyan C.", "review": "I'm almost hesitant to review West of Pecos for brunch because it means the secret will be out about how AWESOME it is. Here's why:\n\n1) No wait. None. For 6 people, at 11:30am on a Sunday? Unheard of! We could've shown up at 12pm or 1pm - same. There may appear to be no tables available when you reserve online, but if you email they're very prompt. I didn't even need to do that in the end!\n\n2) VERY cost-effective. Every dish was well under $15, most were around $10 - and of course it was all really tasty as well as vegetarian-friendly.\n\n3) Excellent service. We were very well-attended to (they were often coming around, we asked for hot water which was a little unusual and they made sure to refill those too, they saw I was cold and closed the doors that were previously propped open) and made sure to tip extra because they deserved it. \n\nSNACKS\n* Carrot Cake French Toast (cream cheese frosting. $8) - 4.5 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#svuomVWB8Ah0oXe5zH6nIw\ncross-section: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#_BQfDZu70GRK8ILfo9r9DA\nHow can you NOT order this? Two of my favorite things in the world in one, and they make it work. The texture was more dense like carrot cake, but the edges of the bread were crisped like French Toast. The cream cheese frosting, raspberries, maple syrup, and glazed pecans were awesome, awesome, awesome together.\n\n* Biscuit & Strawberry Jam ($3) - 3.5 stars\nThe jam is great - light, a little tart. The biscuit was soft and fluffy on the inside, with a thick shell, but was a bit dry.\n\nBRUNCH\n* Two Pork Belly Austin Breakfast Tacos (scrambled eggs, maple-glazed pork belly, shredded cheese, pico de gallo, flour tortillas, avocado, chipotle aioli. $10) - 4.5 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#5HwcWC73YaajuKoDOXn6kA\nup close: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#_islhVp7CmGvwdkVGn1IMw\nThe tortillas were amazing! Thick, freshly made, that texture that's soft yet holds well, that crackles just a little bit when you pick it up and bend it around the toppings. This was a huge standout for me in the meal. Most of the taco is filled with eggs, which are big, light, fluffy. There is a giant slab of pork belly on top, and a big slice of avocado. While all the ingredients were great, it was a little imbalanced with mostly eggs. Also, the avocados & pork belly on top - while it looked great - made it hard to eat because they were such big pieces placed neatly on top of the eggs.\n\n* Polenta con Chorizo (aged cheddar, eggs, smoked cream, corn, veggies, home fries. $13) - 4 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#pAaa-FiwmUn4ZxrXGhAhKw\ncross-section: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#nSiXZgRDqW_VzQ669qFFxQ\nThis was a very uniquely made! I was expecting a thick soup-like polenta on the bottom of the bowl, but they actually fry the polenta into two slabs. I liked that! A big of crunch, a chance to break open the poached egg and let the yolk run over it. There wasn't as much meat as I'd hoped in the soup, maybe 2 big chunks, but it was soft super tasty. \n\nLUNCHY\n* Pair of Baby Kale Tostadas (black beans, guacamole, tomato vinaigrette. $9) - 4 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#W5jfn0H-6XwolV6i_s155g\nI tried a bite of this and it was great! Lighter fare, but great balance of flavors.\n\nBrunch/lunch menu: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#zf8-3MnDpltyc0uGAwR6mQ\nDrinks: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#9Y_1KZZGsYmGHtOKdh-0HA", "rating": 5, "date": "2014-12-21"}, {"excerpts": ["I ordered the Austin style tacos and my boyfriend ordered the carrot cake French toast. ", "It was really unique and amazing food and not even that expensive. ", "Good quality and price. ", "Definitely recommend this place for brunch. ", "We left super full and happy!!!!"], "author": "Ali R.", "review": "Other restaurants for brunch were about a half hour wait so my boyfriend and I happened to try this place out. It was surprisingly not crowded, we were seated right away, great atmosphere, quick and good service and the food was one of the best brunches I've had in SF. The maple pork belly side was so delicious!! I ordered the Austin style tacos and my boyfriend ordered the carrot cake French toast. It was really unique and amazing food and not even that expensive. Good quality and price. Definitely recommend this place for brunch. We left super full and happy!!!!", "rating": 5, "date": "2014-08-10"}, {"excerpts": ["We tried the carrot cake french toast (so yummy and moist and not too sweet), the kid's mac and cheese, the crab and avocado tostada (so fresh), and the brisket hash. ", "Everything was yum! ", "Definitely have to come back and eat here again."], "author": "J R.", "review": "Absolutely delicious brunch! Great service too. We tried the carrot cake french toast (so yummy and moist and not too sweet), the kid's mac and cheese, the crab and avocado tostada (so fresh), and the brisket hash. Everything was yum! Definitely have to come back and eat here again.", "rating": 5, "date": "2015-01-16"}], "west of pecos fish tacos": [{"excerpts": [", I got the West of Pecos Fish Tacos for $15. ", "3 tacos stuffed with beer battered wild Alaskan cod, avocado, chipotle aioli and cabbage. ", "First off, what a beautiful plate! ", "Lots of amazing vibrant colors. ", "Then you bite into it ", "and WOW, has to be one of the best fish tacos I've had, probably due to the fresh ingredients. "], "author": "Rockne H.", "review": "I never really hang out in The Mission district so when my friend suggested we do that for a change, I was definitely on board. We settled on a place close to some of the shopping on Valencia and so glad we did! \n\nThis place is super nice and consistent with the Tex-Mex theme. Blue walls and dark wood around the place offer a more modern feel while the weathered looking table tops remind you of the Lonestar type tradition. Our service was ok. Not a lot of visits to the table but that's because they were super busy. It didn't bother me at all though, they were cordial. Here's what I had for dinner: \n\n-Started with the queso and chips, topped with house-made chorizo for $9. This was a classic dish and super good! the queso was a little more runnier than I'd prefer but thank goodness the flavors were there! I liked the nice touch of chorizo on top to seal the deal\n\n-For dinner, I got the West of Pecos Fish Tacos for $15. 3 tacos stuffed with beer battered wild Alaskan cod, avocado, chipotle aioli and cabbage. First off, what a beautiful plate! Lots of amazing vibrant colors. Then you bite into it and WOW, has to be one of the best fish tacos I've had, probably due to the fresh ingredients. I would HIGHLY RECOMMEND this!! \n\nI love this city. There are so many gems around town and for the Mission, I would consider this to be one. Those fish tacos will keep me coming back time and time again. Go check them out!", "rating": 4, "date": "2016-01-07"}, {"excerpts": ["West of Pecos fish tacos with the sauce, chopped harvest salad with chicken, fried green tomatoes\n\n", "The West of Pecos fish tacos were loaded with lots of fried fish and the sauce added a nice tangy flavor. ", "The tacos were delicious with my Modelo. ", "The fried green tomatoes were crispy and paired nicely with the lemon aioli. ", "Lastly, the chopped harvest salad with chicken was absolutely amazing. ", "If there's anything I'd come back for, it would most definitely be for this salad! "], "author": "Jane P.", "review": "West of Pecos can be an enjoyable experience if you order the right things. Here's a quick summary of my preferences:\n\nThe Not So Good: green chile mac n cheese, side of rice and beans, chicken enchilada mole\nThe Good: West of Pecos fish tacos with the sauce, chopped harvest salad with chicken, fried green tomatoes\n\nThe green chile mac n' cheese smelled so good when it first came to the table, but the disappointment started at the first bite. It is extremely bland. Since the restaurant is labelled on Yelp as Tex-Mex, I had particular expectations for the rice and beans. The rice was green and the black beans had an off taste. Altogether, it was a bit bland too. The chicken mole was unexciting.\n\nNow for the good dishes I tried, they were REALLY GOOD. The West of Pecos fish tacos were loaded with lots of fried fish and the sauce added a nice tangy flavor. The tacos were delicious with my Modelo. The fried green tomatoes were crispy and paired nicely with the lemon aioli. Lastly, the chopped harvest salad with chicken was absolutely amazing. If there's anything I'd come back for, it would most definitely be for this salad! There was just a great balance with the crunchy jicama, soft lettuce, smooth avocado, and slight bitterness from the queso fresco. \n\nCustomer service was great and the outside seating with the heat lamp was perfect for a chilly night when I was there.", "rating": 3, "date": "2016-02-19"}, {"excerpts": ["Our favorites: messy Texas ribs, butternut squash enchiladas and the west of pecos fish tacos. "], "author": "Brian K.", "review": "Yeeehaw! West of Pecos, you sexy, wild-western cowboy you!! \n\nYou've lassoed me, my entire office and all of our swoonin' hearts in like a herd of longhorn cattle lazily grazing on the wide open American prairie of yesteryear! Replacing that lousy metaphorical prairie grass with your delicious South-western fare and heavenly libations, you've made strong, champion bulls out of us all, and we're ready for our second, third, fourth and forever rodeo, so don't ever go closin' your saloon doors--please!!\n\nAs an event planner in LA and current office manager at our company here in SF, I am extremely impressed with West of Pecos' level of professionalism, courtesy and mastery in putting on our office holiday party this year. Not only were the servers, hostesses, bartenders and owner all extremely responsive and helpful, but they made the evening even more fantastic with their fun personalities--thanks again to the entire staff, and special shout-out to Caitlyn, Lisa and Kelcey! Lisa helped me coordinate the entire event, and she was very quick to respond and patient with all of my questions :) Kelcey was our amazing (and quite beautiful) server/ new best friend who kept the party going!! \n\nNow for the food & drinks. Two words: epic and delicious. Exactly what you'd want from your TexMex cuisine. Everything had so much flavor and quality. Our favorites: messy Texas ribs, butternut squash enchiladas and the west of pecos fish tacos. The salsa and guac were also entirely on-point.\n\nBy the end of the night our introductory howdy how had completely transformed to howdy how in the How-can-this-place-kick-so-much-ass, and I can't wait to get back to my new favorite Mission restaurant. As good as it gets.\n\nOne more time, out of pure enthusiasm, yeeeeehaaawwwwwwwwwww!!!!", "rating": 5, "date": "2015-12-11"}, {"excerpts": ["Ordered the \"3 west of pecos fish tacos\" which was excellent!"], "author": "Shahar K.", "review": "The atmosphere is very nice. Sat on the bar and watched the cooks do their work - fascinating! Service was good as well. Ordered the \"3 west of pecos fish tacos\" which was excellent!", "rating": 4, "date": "2015-11-08"}], "pair of baby kale tostadas": [{"excerpts": ["* Pair of Baby Kale Tostadas (black beans, guacamole, tomato vinaigrette. ", "$9) - 4 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#W5jfn0H-6XwolV6i_s155g\n", "I tried a bite of this and it was great! "], "author": "Ziyan C.", "review": "I'm almost hesitant to review West of Pecos for brunch because it means the secret will be out about how AWESOME it is. Here's why:\n\n1) No wait. None. For 6 people, at 11:30am on a Sunday? Unheard of! We could've shown up at 12pm or 1pm - same. There may appear to be no tables available when you reserve online, but if you email they're very prompt. I didn't even need to do that in the end!\n\n2) VERY cost-effective. Every dish was well under $15, most were around $10 - and of course it was all really tasty as well as vegetarian-friendly.\n\n3) Excellent service. We were very well-attended to (they were often coming around, we asked for hot water which was a little unusual and they made sure to refill those too, they saw I was cold and closed the doors that were previously propped open) and made sure to tip extra because they deserved it. \n\nSNACKS\n* Carrot Cake French Toast (cream cheese frosting. $8) - 4.5 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#svuomVWB8Ah0oXe5zH6nIw\ncross-section: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#_BQfDZu70GRK8ILfo9r9DA\nHow can you NOT order this? Two of my favorite things in the world in one, and they make it work. The texture was more dense like carrot cake, but the edges of the bread were crisped like French Toast. The cream cheese frosting, raspberries, maple syrup, and glazed pecans were awesome, awesome, awesome together.\n\n* Biscuit & Strawberry Jam ($3) - 3.5 stars\nThe jam is great - light, a little tart. The biscuit was soft and fluffy on the inside, with a thick shell, but was a bit dry.\n\nBRUNCH\n* Two Pork Belly Austin Breakfast Tacos (scrambled eggs, maple-glazed pork belly, shredded cheese, pico de gallo, flour tortillas, avocado, chipotle aioli. $10) - 4.5 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#5HwcWC73YaajuKoDOXn6kA\nup close: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#_islhVp7CmGvwdkVGn1IMw\nThe tortillas were amazing! Thick, freshly made, that texture that's soft yet holds well, that crackles just a little bit when you pick it up and bend it around the toppings. This was a huge standout for me in the meal. Most of the taco is filled with eggs, which are big, light, fluffy. There is a giant slab of pork belly on top, and a big slice of avocado. While all the ingredients were great, it was a little imbalanced with mostly eggs. Also, the avocados & pork belly on top - while it looked great - made it hard to eat because they were such big pieces placed neatly on top of the eggs.\n\n* Polenta con Chorizo (aged cheddar, eggs, smoked cream, corn, veggies, home fries. $13) - 4 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#pAaa-FiwmUn4ZxrXGhAhKw\ncross-section: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#nSiXZgRDqW_VzQ669qFFxQ\nThis was a very uniquely made! I was expecting a thick soup-like polenta on the bottom of the bowl, but they actually fry the polenta into two slabs. I liked that! A big of crunch, a chance to break open the poached egg and let the yolk run over it. There wasn't as much meat as I'd hoped in the soup, maybe 2 big chunks, but it was soft super tasty. \n\nLUNCHY\n* Pair of Baby Kale Tostadas (black beans, guacamole, tomato vinaigrette. $9) - 4 stars\npic: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#W5jfn0H-6XwolV6i_s155g\nI tried a bite of this and it was great! Lighter fare, but great balance of flavors.\n\nBrunch/lunch menu: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#zf8-3MnDpltyc0uGAwR6mQ\nDrinks: http://www.yelp.com/biz_photos/west-of-pecos-san-francisco?select=zf8-3MnDpltyc0uGAwR6mQ#9Y_1KZZGsYmGHtOKdh-0HA", "rating": 5, "date": "2014-12-21"}], "chopped harvest salad": [{"excerpts": ["Tip: the chopped harvest salad is a really tasty, healthy option if you're not feeling like tacos today but the group wants to go. \n\n"], "author": "Almgren P.", "review": "Best guacamole and chips in town! Great service and kid friendly restaurant. We've been there +20 times and have never disappointed. Just order the chips with guacamole for starters and your good. \n\nTip: the chopped harvest salad is a really tasty, healthy option if you're not feeling like tacos today but the group wants to go. \n\nTip2: Their margaritas...", "rating": 5, "date": "2018-08-25"}, {"excerpts": ["The chopped harvest salad is the best salad I've ever had in my life. ", "Added bonus for the goblets of beer. ", "Does anyone know if the green goddess dressing is for sale?????????"], "author": "Rachel J.", "review": "The chopped harvest salad is the best salad I've ever had in my life. Added bonus for the goblets of beer. Does anyone know if the green goddess dressing is for sale?????????", "rating": 5, "date": "2018-07-03"}, {"excerpts": ["West of Pecos fish tacos with the sauce, chopped harvest salad with chicken, fried green tomatoes\n\n", "The West of Pecos fish tacos were loaded with lots of fried fish and the sauce added a nice tangy flavor. ", "The tacos were delicious with my Modelo. ", "The fried green tomatoes were crispy and paired nicely with the lemon aioli. ", "Lastly, the chopped harvest salad with chicken was absolutely amazing. ", "If there's anything I'd come back for, it would most definitely be for this salad! "], "author": "Jane P.", "review": "West of Pecos can be an enjoyable experience if you order the right things. Here's a quick summary of my preferences:\n\nThe Not So Good: green chile mac n cheese, side of rice and beans, chicken enchilada mole\nThe Good: West of Pecos fish tacos with the sauce, chopped harvest salad with chicken, fried green tomatoes\n\nThe green chile mac n' cheese smelled so good when it first came to the table, but the disappointment started at the first bite. It is extremely bland. Since the restaurant is labelled on Yelp as Tex-Mex, I had particular expectations for the rice and beans. The rice was green and the black beans had an off taste. Altogether, it was a bit bland too. The chicken mole was unexciting.\n\nNow for the good dishes I tried, they were REALLY GOOD. The West of Pecos fish tacos were loaded with lots of fried fish and the sauce added a nice tangy flavor. The tacos were delicious with my Modelo. The fried green tomatoes were crispy and paired nicely with the lemon aioli. Lastly, the chopped harvest salad with chicken was absolutely amazing. If there's anything I'd come back for, it would most definitely be for this salad! There was just a great balance with the crunchy jicama, soft lettuce, smooth avocado, and slight bitterness from the queso fresco. \n\nCustomer service was great and the outside seating with the heat lamp was perfect for a chilly night when I was there.", "rating": 3, "date": "2016-02-19"}, {"excerpts": ["The Chopped Harvest Salad was impeccable and unlike any salad I have ever tasted! "], "author": "Nell C.", "review": "Can I get a HIGH FIVE for West of Pecos?! You bet! My experience at West of Pecos in Mission was awesome! \n\nThe Chopped Harvest Salad was impeccable and unlike any salad I have ever tasted! The salad was chilled and each bite of the crisp lettuce, jicama, corn, crispy garbanzo beans, avocado, queso fresco, cilantro vinaigrette was bursting with flavor!\n\nOur server was wonderful and the ambiance was very Southwestern.  Definitely a place to chill and have a beer or two with chips and salsa.", "rating": 5, "date": "2014-10-22"}], "woodhouse grilled artichoke": [{"excerpts": ["* WOODHOUSE GRILLED ARTICHOKE ($17): ", "Typically, I am not a big artichoke fan and didn't like anything about this dish. "], "author": "Jess C.", "review": "3.5 Overall Stars - 2 stars for food, and 5 stars for drinks. \n\nWest of Pecos claims to serve family-style, sharable dishes when in reality, sharing is difficult for most items. The menu contains interesting sounding, modernized Tex-Mex dishes which fall short in the areas of execution, flavor, and quality of ingredients. \n\nOf all the things I tried, the only thing I would actually pay for again are things with pork shoulder and the mac n cheese. Come for the drinks (happy hour M-F), not for the food.\n\nFOOD \n* GREEN CHILE MAC N CHEESE ($6): This was good, but didn't really taste special. It was probably one of the better things we ordered, good value, and a good side to share.\n\n* BRAISED PORK SHOULDER ($11): Tasty, flavorful, and fork tender. I would get this again although the portion was very small. \n\n* GRILLED CORN ($8): $8 for 1 cob of corn? Wow, that just seems kind of ridiculous. Plus, the corn was not particularly fresh, very heavily covered in honey, so it tasted a bit rubbery and artificial. \n\n* ANCHO AND APRICOT PORK RIBS ($16): Good flavor, but kind of tough.\n\n* FLAT IRON STEAK ($19): Really tasty! Unfortunately, it was also too chewy.\n\n* MARGARET's PORKCHOP ($17): Unevenly cooked, very dry at parts, unmemorable, a bit small, and pales in comparison to Nopa or Seven Hills.\n\n* WOODHOUSE GRILLED ARTICHOKE ($17): Typically, I am not a big artichoke fan and didn't like anything about this dish. I thought this was boring, overpriced, needed sauce or flavor, and fresher seafood.\n\nDRINKS: (5-6:30PM HAPPY HOUR)\n* MEZCAL MULE ($9): Smoky and comes in a cute little camping style cup!\n\n* PRICKLY PECOS MARGARITA ($9): Spicy, fruity, you can't go wrong. Similar to drinks at Cantina - I could drink this all day :)", "rating": 3, "date": "2013-03-19"}, {"excerpts": ["Woodhouse Grilled Artichoke with dungeness crab and shrimps was incredible!!\n", "The service was great too. ", "I would love to go back for dinner and try some drinks."], "author": "Fumie N.", "review": "I went there for brunch and had the best artichoke dish ever. Woodhouse Grilled Artichoke with dungeness crab and shrimps was incredible!!\nThe service was great too. I would love to go back for dinner and try some drinks.", "rating": 5, "date": "2014-06-15"}, {"excerpts": ["Woodhouse grilled Artichoke \nFish Tacos\nBrown Sugar Buttermilk Fried Chicken \nChips and Guacamole \n\n"], "author": "Thea M.", "review": "OMG!! SOOOO GOOOD!!\nThis is my new favorite restaurant.\n\nI went with my fiance, future sister and father-in-law. \nWe sat in front under a heat lamp and next to the fireplace. \nThe atmosphere is great - relaxing and sets an evening tone. \n\nThe amazingly fantastic things we ordered:\nDrinks (I can't remember the fun names) - one with whisky, one with tequila and jalepeno, one fruity. \nWoodhouse grilled Artichoke \nFish Tacos\nBrown Sugar Buttermilk Fried Chicken \nChips and Guacamole \n\nAll I can say is GO. ORDER EVERYTHING!!! \n\nLike I said -- My new favorite restaurant.  Enough said!", "rating": 5, "date": "2014-02-20"}, {"excerpts": ["The avocado and peas tendrils appetizer, topped off with the woodhouse grilled artichoke.  "], "author": "Mark S.", "review": "The avocado and peas tendrils appetizer, topped off with the woodhouse grilled artichoke.  AMAZING.\n\nMy partner had Margaret's porkchop, tasty, flavorful and tender.", "rating": 4, "date": "2013-03-08"}, {"excerpts": ["Woodhouse grilled artichoke. ", "The best! ", "You get the whole artichoke... ", "AND it's filled with crab and shrimp. "], "author": "CatsPjs Z.", "review": "I'd normally never eat \"tex mex\", not sure why, just was never impressed with the cuisine before. Went here because it was the only place available for a party of 4 on a Saturday night. I was impressed! \n\nHere are the fantastic things that we ordered:\nThe ribs. I never order ribs in restaurants (unless its a franchise restaurant), cause they'll  just give you 2 tiny skinny little ribbies. But not here! Good portion!\n\nWoodhouse grilled artichoke. The best! You get the whole artichoke... AND it's filled with crab and shrimp. Amazing.\n\nThe ambiance was casual, yet somewhat classy. The kinda place you can even bring your conservative relatives to. The service was pretty good too. I'd be back.", "rating": 5, "date": "2013-07-24"}], "steak  egg muffin": [], "hatch green chile cheese burger": [], "bottomless coffee": [{"excerpts": ["Churros & fried chicken, croissant French toast, juevos rancheros, stuffed poblano chilies & bottomless coffee! ", "Was delightful! ", "Great ambiance & really sweet ginger GM/owner that brought us complementary chips & guac for helping him with the Christmas lights! ", "Will recommend to friends & definitely come back!"], "author": "Lindsey D.", "review": "Churros & fried chicken, croissant French toast, juevos rancheros, stuffed poblano chilies & bottomless coffee! Was delightful! Great ambiance & really sweet ginger GM/owner that brought us complementary chips & guac for helping him with the Christmas lights! Will recommend to friends & definitely come back!", "rating": 5, "date": "2015-12-05"}], "iced tea or hot tea": [], "doityourself lemonade": [], "doityourself arnie palmer": [], "fresh squeezed orange or grapefruit juice": [], "mexican coke ibc root beer ginger beer": [], "coca cola diet coke sprite": [], "fresh tomato blood mary": [], "michelada verde": [{"excerpts": ["I ordered they're vegan\nBowl and michelada verde.. both the food and drinks were really good. ", "Everything was well\nSeasoned and tasted so fresh with so much flavor. ", "Will definitely come back to try their chicken and churros! ", "Lol"], "author": "Aide S.", "review": "Went to Valencia this morning trying to find a good place for brunch.. went to a couple of places and they were all a 1.5hr wait.. West of Pecos was our 3rd try at getting some food and did not disappoint. Luckily they were able to sit us right away! The place is super cute. Service was great, and the food.. DELICIOUS!! I ordered they're vegan\nBowl and michelada verde.. both the food and drinks were really good. Everything was well\nSeasoned and tasted so fresh with so much flavor. Will definitely come back to try their chicken and churros! Lol", "rating": 5, "date": "2018-03-25"}], "pecos pimms cup": [{"excerpts": ["Recommend the Pecos Pimms cup. ", "West of Pecos and San Quentin are the only two places where you can drink out of this cup, specially designed to be hard to turn into a shiv. "], "author": "A H.", "review": "Best brunch spot in the mission. \n\nIn an homage to Marie Antoinnette - and I hope that I won't be treated similarly - let the peasants eat boogaloos. West of Pecos is where it's at. \n\nTO SUMMARIZE:\n1. EXCELLENT Food\n2. Great Ambiance\n3. Great servers\n\nGet some. \n\n\nRecommend the Pecos Pimms cup. West of Pecos and San Quentin are the only two places where you can drink out of this cup, specially designed to be hard to turn into a shiv. Google it.\n\nOwner must be a badass. \n\nWest of Pecos brunch.", "rating": 5, "date": "2014-05-10"}], "sangria": [{"excerpts": ["I tried the frozen margarita sangria mixed drink and it was really tasty. ", "For dinner we tried the enchiladas and fried chicken plate. "], "author": "Asha S.", "review": "I checked out West of Pecos for an early dinner on a Saturday evening. \nThe decor of the bar and restaurant are really fun and give the place a southwestern vibe. \n\nI tried the frozen margarita sangria mixed drink and it was really tasty. For dinner we tried the enchiladas and fried chicken plate. The food was subpar - the chicken on the fried chicken plate was covered in a layer of fat and it was obvious that the chicken fat had not been cleaned off the chicken before it was cooked. \n\nThe enchiladas were overpowered by too much sauce that was runny. The chicken inside the enchiladas was mashed which was okay. Overall the food was not good and the reason for my three star review. If they improved their food I would return. Otherwise I would only come back for their drinks.", "rating": 3, "date": "2018-06-20"}, {"excerpts": ["Margaritas & sangria were both pretty solid. "], "author": "Ruby C.", "review": "I only dropped by for HH but it's definitely a spot I'd like to return for dinner. \n\n+ HH Food (5pm-6:30pm): great taco choices, I particularly enjoyed the brisket and honey duck ones. Habanero wings were a bit too smoky spicy for me. Guacamole and chips were delish! Queso and chorizo was another great choice as well. We ordered the puffy tacos (not on HH menu but a mere $5/each). I didn't like the puffy tacos because it was a bit thick and doughy. Margaritas & sangria were both pretty solid. Very reasonable prices.\n\n+ Ambiance: I love the decor (chili hanging from the ceiling) and the open, airy space near the bar. We got there right when it opened (at 5pm) and during the 2hrs we stayed, it was busy but not crowded which is always a plus.", "rating": 5, "date": "2016-07-18"}, {"excerpts": ["I've been obsessed with Aqui Cal-Mex down in San Jose for their \"Swirls\" which is frozen house margarita mixed with their sangria. ", "Now their swirls are no joke as it can easily get you on \"another level\". ", "But honestly who has the time to travel 45 minutes south just to drink? ", "Now when I discovered that West of Pecos sold their own version of the Swirl called \"Sangre del Toro\", I knew I had to try it. ", "It was amazing just like Aqui Cal-Mex. ", "Much smaller size but sure got the job done. "], "author": "Denzell S.", "review": "What initially was supposed to be a 5 minute pit-stop to use the bathroom before heading out to Blondie's Bar, turned out to be an hour and a half just taking shots, drinking cocktails, and eating food. It's undeniable that Tex-Mex restaurants are the best places to celebrate Happy Hour, but I firmly believe this is the best one out here in the city.\n\nI've been obsessed with Aqui Cal-Mex down in San Jose for their \"Swirls\" which is frozen house margarita mixed with their sangria. Now their swirls are no joke as it can easily get you on \"another level\". But honestly who has the time to travel 45 minutes south just to drink? Now when I discovered that West of Pecos sold their own version of the Swirl called \"Sangre del Toro\", I knew I had to try it. It was amazing just like Aqui Cal-Mex. Much smaller size but sure got the job done. Their drinks were fairly priced and of course their Management and Staff were so nice even if my friends and I were a little tipsy.\n\nUnfortunately I can't say too much about their food as I only had their guacamole and chips. But at that moment, they were amazing. I do have intentions of coming back here soon. Maybe for another Happy Hour? Hopefully this time I can actually try their food because they look so delicious from the people seated next to me.", "rating": 4, "date": "2016-09-14"}, {"excerpts": ["The beverages were tasty, Sangria and Margaritas all around.  ", "The meals were plentiful.  ", "Fajitas, Buttermilk Chicken and meat platter were ordered...shared and agreed all guests would return and recommend to friends."], "author": "Nancy M.", "review": "We had a most enjoyable dinner celebration here for my daughter's birthday.  Loved the environment, decor and elements which fostered the theme of the restaurant.  The waitstaff was very attentive and added to the experience.  The beverages were tasty, Sangria and Margaritas all around.  The meals were plentiful.  Fajitas, Buttermilk Chicken and meat platter were ordered...shared and agreed all guests would return and recommend to friends.", "rating": 4, "date": "2017-03-30"}, {"excerpts": ["Or if you just want a sangria and/or margarita. ", ";)"], "author": "Julia N.", "review": "Wish I had discovered this place when I still lived in San Francisco proper! In short: West of Pecos is a low-key but nice Latin American restaurant with flavorful, beautifully plated food.\n\nMy favorites:\n\n-Fish tacos: a plate comes with 3 tacos. You can also ask for smaller portions as well--we got 1 extra so we could split evenly. The batter is crispy and light but well-defined, and the fillings are a crunchy slaw and tangy sauce, which complement the fish very well. (Pro tip: eat them fast or the corn tortillas will start to lose structural integrity from the slaw)\n\n-Maple brussel sprouts: I could eat these all day. I don't know what they put in this dish, but it is so comforting to eat. It is sweet yet rounded out nicely with a slightly salty/buttery flavor. Texture-wise, the sprouts are soft and minimally crispy.\n\n-Churros: this dish comes with 3 churros and 2 sauces. All I need is that caramel/dulce de leche sauce, though. Churros were crispy outside and soft inside, but a couple of time started imploding in my fingers. No worries though, because that caramel sauce is amazing.\n\nWorth checking out if you're looking for good food with a clean, rustic environment. Or if you just want a sangria and/or margarita. ;)", "rating": 5, "date": "2016-06-24"}, {"excerpts": ["* Margarita + Sangria drink (YUM)\n", "* Coloring menu (duh)"], "author": "Alexa H.", "review": "This place is a good one to bookmark! I walked in and immediately saw that they had crayons + kids menus which I of course asked if I could have one just for funsies. The waitress had to go in the back to print more kids menus so I could color while we waited for food -- she definitely hooked it up! \n\nFood was fantastic, definitely planning on going back more regularly.\n\nFavorites:\n* Crab guacamole\n* The veggie option for tacos\n* Margarita + Sangria drink (YUM)\n* Coloring menu (duh)", "rating": 5, "date": "2016-07-18"}, {"excerpts": ["Sangria - came in a cool vase. ", "super refreshing w/ cinnamon in it that surprisingly tasted really delicious \nChunky guac & chips - fresh chunky pieces of guac w/slices of cherry tomatos, green onions & a splash of lime to eat w/their crispy chips", "..yum! ", "Def recommend as a starter\nStuffed Poblano Chile- absolutely amazing & highly recommend ordering! ", "Great flavors inside the chile w/ the eggs,corn, smoked cream&cheddar. ", "Brussel sprouts cooked perfectly. ", "The home run were the home fries, perfectly crispy on the outside but still soft on the inside. "], "author": "Trina N.", "review": "I don't know how this place has 3.5 stare b/c I beg to differ\n\nSETTING: really spacious & tons of interesting southwestern decors like chilis hanging from the ceiling, cattle skulls, & little skeleton dolls. We came on a sunny day,so the place was refreshing&well lit w/their open doors&windows and natural lighting from the roof\n\nFOOD: \nSangria - came in a cool vase. super refreshing w/ cinnamon in it that surprisingly tasted really delicious \nChunky guac & chips - fresh chunky pieces of guac w/slices of cherry tomatos, green onions & a splash of lime to eat w/their crispy chips..yum! Def recommend as a starter\nStuffed Poblano Chile- absolutely amazing & highly recommend ordering! Great flavors inside the chile w/ the eggs,corn, smoked cream&cheddar. Brussel sprouts cooked perfectly. The home run were the home fries, perfectly crispy on the outside but still soft on the inside. Best home fries ever\n\nSERVICE: Very attentive & super friendly that one of the servers had a small convo w/me&my bf asking us how our day was&how we were doing. Jst things like that is a plus for me as a customer & makes a diff in the experience\n\nOverall, had a wonderful experience&will def be coming back again", "rating": 5, "date": "2015-03-28"}, {"excerpts": ["The sangria tasted like it was very obviously made of cheap wine with NO fruit chunks.  ", "The fish tacos were overloaded with red cabbage and fell apart.  "], "author": "Sona P.", "review": "In a neighborhood full of great Mexican and other international restaurants, this place is just ok.  We ordered guacamole for the table, and it came out very chunky and difficult to eat, because how they artfully placed lime and avocado wedges to make it look \"pretty.\"  The sangria tasted like it was very obviously made of cheap wine with NO fruit chunks.  The fish tacos were overloaded with red cabbage and fell apart.  And the tortillas were rather stiff and flavorless; not the warm corn goodness I'd expected.\n\nOn the plus side, they do have a decent happy hour until 6:30pm and the service was friendly.", "rating": 3, "date": "2016-09-17"}, {"excerpts": ["Would stick to the sangria. \n\n"], "author": "Tiffany V.", "review": "One of the few places in the Mission I had not been to until last week. Was home all day with the roomie working from home and watching Millionaire Matchmaker so we decided to catch a $5 uber to get some dinner. \n\nHe had just been here a week before but gladly came with me again! I ordered the shot and beer to start with. Waitress was a bit confused when I asked her what the beer and shot was since it literally says on the menu that its rotating and how else would I know what it was but it was their cider and a shot of mescal. I would honestly skip this and the way she answered made it sound like its not really \"rotating.\" I choked down the cider and made my roommate drink the rest of my shot. It was not happening. The bar had lost my order so the waitress gave it to me on the house for the extra wait and I honestly did not even notice the wait. Super nice! Otherwise its $9. Would stick to the sangria. \n\nI wasn't that hungry but I got the lobster enchiladas and was soooo full after. Stupid brain! Asked if I wanted rice and beans (extra $) but the waitress said the enchiladas are so rich they don't need the sides so I opted out. There is a ton of sauce though so I ate it with the chips. Huge pieces of lobster! \n\nThe chips and salsa might actually be the best part of the meal to be honest. Chips are so bomb! I would only come back for their happy hour otherwise. So many better food and drink options on the block! Oh and my roommate said the restaurant was too dark and I said it was too loud. I loved how dark it was and he didn't even notice it was loud. To each their own!", "rating": 3, "date": "2015-02-01"}, {"excerpts": ["Good place for happy hour after work, decently priced drinks $6 sangria. ", "We got: fried chicken, mushroom and beef puffy tacos, sangria\n\nGet again: mushroom "], "author": "Kristin C.", "review": "Good place for happy hour after work, decently priced drinks $6 sangria. Good place nice drinks and upscale Mexican food before going out in the mission on weekends. \n\nWe got: fried chicken, mushroom and beef puffy tacos, sangria\n\nGet again: mushroom puffy taco was the best and beef puffy tacos second. Chicken was okay but the sides were yummy! Try the butternut squash enchilada.", "rating": 4, "date": "2016-01-20"}, {"excerpts": ["$5 Sangria and frozen margs, $5 starters, and $3 for an order (of two) tacos!\n\n"], "author": "Jonathan C.", "review": "I've come here way too many times to count. The menu has changed quite a bit  since their initial opening, and there are some things that I really enjoy on the current one and some things I miss from the original; one being the Maine lobster salad for example. But all things aside, I am a big fan of this place. The ambience is very much in keeping with its Tex Mex cuisine, down to the steer horns and poncho-like blankets adorning the walls. \n\nIf you have time, come for the Happy hour (5pm-6:30pm): $5 Sangria and frozen margs, $5 starters, and $3 for an order (of two) tacos!\n\nThe current dinner menu satisfies. I've had the BBQ chicken (huge portion and juicy all around), flank steak, and the chile relleno. All of the above have left me pleased. The green chile mac was good, but definitely under seasoned. A few dashes of hot sauce fixed that issue and added a nice kick. \n\nA go-to drink for me has been the Pecos Punch (not sure if it is still on the drink menu) but it is a blend of rum and other good libations. Definitely on the sweet side, but comes in a glass carafe - meant for sharing... unless you're trying to get after it that evening. \n\nOverall, great restaurant. If you're looking for a cute and trendy but unpretentious restaurant in the mission that has a playful menu, this place is your spot. I took my, very particular father here and he could not have enjoyed himself more. That alone ensures this spot is a winner.", "rating": 4, "date": "2014-05-28"}, {"excerpts": ["We started off with some chunky guac and a pitcher of sangria. ", "The guac was phenomenal, great flavor, and a chunks of peppers as well to give it that kick. ", "The sangria was on another level. ", "It came in a chilled vase and was a good size as well giving my gf ", "and I 4 glasses each. ", "It had a different taste to it, bit of cinnamon and other spices, my gf said it even reminded her of an got horchata. ", "I decided to go with the Cuban sandwich for my meal. ", "Wow is the best way to describe it. ", "The pork was so tender it melted in my mouth, flavor packed and savory. ", "The bread was also great toasted to perfection to give it a nice crunch.  ", "And on top of everything being on point the waitress and staff are so good, personable and smiling the entire time, their attentiveness was very appreciated. ", "I highly recommend this place, you gotta give the sangria a try!"], "author": "Josue V.", "review": "One of the best dining experiences I've had in SF! Came here for lunch after seeing it on a couple of sites as a must visit in the mission. To start the place is huge, multiple seating areas that can fit a group of any size as well as nice outdoor seating. The decor is amazing, great decorations that make you feel like your at an authentic tex-mex restaurant, and he skylights did it great justice as well bringing in some nice warmth and light. I was already impressed before I even saw the menu.\nWe started off with some chunky guac and a pitcher of sangria. The guac was phenomenal, great flavor, and a chunks of peppers as well to give it that kick. The sangria was on another level. It came in a chilled vase and was a good size as well giving my gf and I 4 glasses each. It had a different taste to it, bit of cinnamon and other spices, my gf said it even reminded her of an got horchata. I decided to go with the Cuban sandwich for my meal. Wow is the best way to describe it. The pork was so tender it melted in my mouth, flavor packed and savory. The bread was also great toasted to perfection to give it a nice crunch.  And on top of everything being on point the waitress and staff are so good, personable and smiling the entire time, their attentiveness was very appreciated. I highly recommend this place, you gotta give the sangria a try!", "rating": 5, "date": "2015-03-29"}, {"excerpts": ["Their cocktails were very good:\n-Pecos margarita\n-Sangre (margarita/sangria)\n", "-Devils Tooth (bourbon my fave!)\n"], "author": "Vol T.", "review": "3.5 stars\n\nI'm from Texas so first of all, let me say that I don't really think this is Tex Mex. Tex Mex restaurant would never have fried chicken on the menu!\n\nBut maybe Southwestern? Anyway, I really liked the decor. Very appropriate. The wood tables and chair also went well with the theme. We did get reservations for Friday evening and prob a good idea since there was quite a crowd.\n\nTheir cocktails were very good:\n-Pecos margarita\n-Sangre (margarita/sangria)\n-Devils Tooth (bourbon my fave!)\n-Rodeo Ghost (mezcal)\n\nFood:\n-Queso and chips (with chorizo.. very good!)\n-Pork belly and egg flatbread (this was ok but unique)\n-Brown Sugar Buttermilk fried chicken (very good. It's actually half of cornish hen which I've never had, but tasted just like chicken)\n-Chile Relleno (this was ok)\n\nI enjoyed my experience but hubby was less enthused. The service was slow also. I found myself waiting quite a while for drinks/food. But not too terrible. \nOther than that, it's not a bad place.", "rating": 4, "date": "2014-03-11"}, {"excerpts": ["The food was off the hook - from the sangria to the margaritas to the guacamole to the duck tacos to the pork tacos to the puffy tacos with shashito peppers!   \n\n"], "author": "Matt T.", "review": "Came here for an event and Tyler (owner) was so accommodating and amazing.  The food was off the hook - from the sangria to the margaritas to the guacamole to the duck tacos to the pork tacos to the puffy tacos with shashito peppers!   \n\nGreat service and great food.", "rating": 5, "date": "2015-06-14"}, {"excerpts": ["Friendly service and tasty sangria. ", "Steak for the fajitas a little dry but flavorful. ", "Nice ambience ", "but it was a rainy night ", "and they keep the front doors open which caused the the interior to be cold enough ", "I kept my jacket on through dinner. ", "I would return."], "author": "Brian M.", "review": "Group of 5 with different plates and all were pleased. Friendly service and tasty sangria. Steak for the fajitas a little dry but flavorful. Nice ambience but it was a rainy night and they keep the front doors open which caused the the interior to be cold enough I kept my jacket on through dinner. I would return.", "rating": 4, "date": "2017-03-21"}, {"excerpts": ["But our waiter was on top of things and got in our drink orders for sangria pretty quick. ", "The sangria was very ok, nothing to write home about. \n", "We started with the guacamole which was really good! ", "Small portion though, just enough for two to split. ", "We also ordered two tacos each ", "and I got the beef brisket and carnitas. ", "These were probably the greasiest tacos I've had. ", "They kept dripping everywhere and were extremely messy to eat. ", "The grease was overkill. ", "It also took our waiter a while to come clear our plates and get us more sangria, so things were just piling up on our tiny bar table. ", "Gave it a try, but safe to say I will not be returning."], "author": "Alisha K.", "review": "We came here for taco tuesday expecting it to be a full house in the Mission. That was our first mistake, it was easy to get a table since it was so empty. It should not be this easy to get a table at a Mexican restaurant in the Mission! We decided on a seat at the bar, which are probably the smallest bar tables ever. But our waiter was on top of things and got in our drink orders for sangria pretty quick. The sangria was very ok, nothing to write home about. \nWe started with the guacamole which was really good! Small portion though, just enough for two to split. We also ordered two tacos each and I got the beef brisket and carnitas. These were probably the greasiest tacos I've had. They kept dripping everywhere and were extremely messy to eat. The grease was overkill. It also took our waiter a while to come clear our plates and get us more sangria, so things were just piling up on our tiny bar table. Gave it a try, but safe to say I will not be returning.", "rating": 2, "date": "2015-11-18"}, {"excerpts": ["The drinks are kinda pricey and the sangria is sub par, but the food is great!"], "author": "Tony C.", "review": "Fluffy tacos are great. Service is very friendly and attentive. It's never been a long wait to get a table even though there have been plenty of people there. The drinks are kinda pricey and the sangria is sub par, but the food is great!", "rating": 4, "date": "2015-12-04"}, {"excerpts": ["Their sangria was pleasantly strong; margaritas just a tad bit too sweet for me. \n", "Would definitely return (for another happy hour)."], "author": "Clara H.", "review": "Happy hour menu's tacos were soooooo good. Each taco for $2.50, they're gigantic and sweet and dripping with sauce. Also shared a guacamole, which was fantastic. Their sangria was pleasantly strong; margaritas just a tad bit too sweet for me. \nWould definitely return (for another happy hour).", "rating": 4, "date": "2015-06-24"}, {"excerpts": ["How could you not love a bar that combined frozen margarita w/ sangria? "], "author": "Andrea L.", "review": "I really wanted to like west of pecos more. How could you not love a bar that combined frozen margarita w/ sangria? But... it just wasn't up to par when it came to the important things: food and service \n\nI ordered the bbq ribs. My friend got the fried green tomato salad. His portion seemed a little small, salad with a little s, not a Salad, if you know what I mean. \nMy ribs were just salty. There was no flavor to the bbq sauce. They were so so salty. The texture of the meat was decent. Not fall off the bone tender, but adequately tender. \n\nThat frozen margarita drink? Tequila in the margarita tasted pretty cheap and well, it takes a lot for me to dislike tequila, especially in a frozen margarita. \n\nService was not great. I liked the bartender who served me, but she was hard to flag down even when I was right in front of her and there were only 2 other people at the bar. Similarly our waitress was fine when we could get a hold of her, but that was super difficult. No one came to refill our waters and we had to ask for a box separately from the check (really?). \n\nI like the space and the location, but I don't think it's worth coming back, especially for the price.", "rating": 3, "date": "2013-07-17"}, {"excerpts": ["I paired it with sangria--", "okay well, two sangrias--but it was noon when we arrived. ", "I am already plotting my return... ", "Quite possibly next weekend!!"], "author": "Marilyn S.", "review": "We've been here for dinner a few months ago and came back today for Sunday brunch after a walk in the neighborhood. Wow!! Was i delighted! Now lactose free, dining out is sometimes challenging. Today I ordered pork belly Austin tacos, with no cheese. My oh my!! The BEST tacos ever! Two flour tortillas (just the right size and delish) with scrambled eggs, pork belly, sliced avocado, light salsa and amazing aioli! Honestly, my favorite taco, fantastic breakfast/brunch. I paired it with sangria--okay well, two sangrias--but it was noon when we arrived. I am already plotting my return... Quite possibly next weekend!!", "rating": 5, "date": "2016-06-26"}, {"excerpts": ["2 things: Please bring back that delicious frozen sangria/margarita like NOW , and that lobster enchilada maybe needs to take a vacation and try something else in it's place. ", "The flavor profile was meh. ", "But I have had so many YES moments at your establishment I ride hard for West of Pecos"], "author": "Lauren V.", "review": "The queso is an addictive drug, so delicious. Service is still awesome. 2 things: Please bring back that delicious frozen sangria/margarita like NOW , and that lobster enchilada maybe needs to take a vacation and try something else in it's place. The flavor profile was meh. But I have had so many YES moments at your establishment I ride hard for West of Pecos", "rating": 4, "date": "2014-11-11"}, {"excerpts": ["Fast and friendly service, fresh guacamole; drinks are OK - the sangria had a unique cinnamon / nutmeg taste to it."], "author": "Natasha N.", "review": "Went here for paint nite on a Wednesday which was also during it's happy hour. Fast and friendly service, fresh guacamole; drinks are OK - the sangria had a unique cinnamon / nutmeg taste to it.", "rating": 4, "date": "2014-05-01"}], "guacamole n chips": [], "campfire cornbread skillet cider molasses": [], "queso n chips chorizo scallions": [], "fresh fruit": [{"excerpts": ["It also came with fresh fruit, so every bite got a nice cool pop of freshness.\n\n"], "author": "Kristin M.", "review": "Brunch review! (Because, take note, THEY DO BRUNCH! Apparently that's a recent development, so I'm giving it the all-caps treatment.)\n\nMy brother and his new wife invited whoever wanted to join them the morning after their wedding for brunch at this place, and I'm so glad I was able to shake off my hangover enough to make it! \n\nI think my dish was called Pecos Poached Eggs, and it had poached eggs and pulled pork and tomato on some kind of bread or muffin or something, and was amaaazing. Best possible hangover food, and would totally order it up sans hangover, too. Same goes for the Bloody Mary. So money.\n\nI also scored a few bites of my neighbor's french toast, and it was excellent - thick, just the right texture (soft, with a little crisp around the edges), and flavor to the bread itself, so it was good even without the syrup. It also came with fresh fruit, so every bite got a nice cool pop of freshness.\n\nWe had (hung over) people arriving at all different times, and West of Pecos was super nice about accommodating everyone, taking and bringing out orders as people arrived, and letting us keep our party together even when like half the table had already eaten and were just hanging out.\n\nThey were a great spot for a big group, but there were lots of people eating there in twos and fours as well, so I feel like I can safely recommend for whatever you've got going on. Also, this was my only time there, but I heard from some other folks at the table that they've also got a great happy hour with well-mixed cocktails and a quality beer list, so I'll be checking that out next time I'm in town!", "rating": 5, "date": "2012-10-29"}], "biscuit strawberry jam": [], "sourdough english muffin": [], "texas chili braised buffalo sopaipillas": []}