{"cup of tai ice tea": [], "cup of peach ice tea": [], "cup of snapple ice tea": [], "vegetable spring rolls": [{"excerpts": ["Vegetable spring rolls - yummy appetizer, comes out piping hot. "], "author": "Connie L.", "review": "It seems like this place either has really great reviews or really crappy ones. From reading other reviews, though, customers seem to have the most problems with take out delivery and language barrier.\n\nI've eaten here three times now and I've been very happy all three times. Fast highlights: affordable (most dishes under $10), great portion sizes, quality and authentic Chinese dishes, no msg and food is not too oily, peaceful restaurant ambiance w piano music, dishes come out carefully and aesthetically plated, and they take good care of you in terms of service. \n\nFast downsides: language barrier. The owner, Ming, is very nice. When I asked about the menu, though, I did experience some difficulty understanding what he meant. So that can feel a bit awkward. We ended up switching to Cantonese and had no problems after that. If you don't know Cantonese, though, just try to be patient and ask Ming to speak slowly or ask for another waiter. Sure we are in America, but I think pple should try to be kind and understanding regardless. \n\nFood experience in detail:\nMy first two times I ordered the Mongolian beef with rice and vegetables, a pretty basic standard Chinese dish. It was a bit heavy with the onions, but the portion size was pretty generous and the presentation was great. I would definitely recommend this option as a fast and basic it delicious dish if you're not sure what to order. \n\nMy third time here, I brought my mom, so I wanted to pick out some more sophisticated Chinese dishes (as Asian moms are not easily impressed eating out, and my mom passes silent judgement on every dish that does not meet her expections..)\nSo, we ordered (and in order of my recommendation): \n\n1. West lake beef soup - a creamy, slightly salty Chinese soup that has some mushrooms, beef bits, and egg. It was nice and savory, and enough soup for 3 pple, definitely try this! Presentation of the soup was so pretty, it could have been in a food catalog. \n\n2. Garlic pea sprout - if you want a Chinese vegetable dish, try this! Pea sprout is usually more expensive at other restaurants but here it was reasonable. Portion size is great, not too oily, slightly salty and garlic taste. \n\n3. Vegetable spring rolls - yummy appetizer, comes out piping hot. Also I'm a sucker for spring rolls\n\n4. Wild Pepper seafood basket - an assortment of seafood and vegetables (shrimp, scallops, peas, cucumber, mushroom, broccoli, carrots, etc) cooked together and placed into a crisp bowl-shaped pancake. Best part of this dish was the presentation. The seafood and vegetables were not burnt, was tender and not dry, and just the right amount of oil. The one bad thing was it was a bit saltier than necessary. \n\n5. Wild Pepper chicken - pretty good. There was chicken, bell peppers, mushrooms, cucumber, tossed together w a flavorful slightly salty sauce. Really yummy with rice. Comes spicy but you can adjust for less or more. \n\nI'm happy to say my mom was happy w the meal (disaster avoided!!) and our total meal cost was about $50 but we ordered so much we basically paid for two dinners for us both. All in all, will definitely be back.", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["Vegetable spring rolls - nothing special, but solid\nShrimp dumplings - passable, stick with Yank Sing\nBBQ spare ribs - finger licking good\n", "Wor Wonton Soup - like no wonton soup ", "I ever had back ", "East, a meal onto itself - beef, chicken, shrimp, veggies and wonton - yum\nChinese broccoli w/beef - a little more beef would've been nice but ", "lots of green goodness, took away a little of my guilt from the spare ribs\nPrawns over baby bok choy - mild, lite, lots of green goodness, could've used a bit more flavor ", "but overall, a nice balance to everything else\n", "General tso's chicken - breaded, fatty, tasty, huge, huge portion\nVegetable chow mein - solid, great accompaniment to all\nLeftovers for DAYS.  "], "author": "Isabel G.", "review": "I've been looking for decent Chinese food that delivers for a while.  Three years in fact, since moving here from NY.  Finally, a place I will be ordering from again!  Yay!  After reading the previous reviews, I figured there was a trend with the negatives - language skills being an issue when ordering on the phone.  Yay for grubhub.\nVegetable spring rolls - nothing special, but solid\nShrimp dumplings - passable, stick with Yank Sing\nBBQ spare ribs - finger licking good\nWor Wonton Soup - like no wonton soup I ever had back East, a meal onto itself - beef, chicken, shrimp, veggies and wonton - yum\nChinese broccoli w/beef - a little more beef would've been nice but lots of green goodness, took away a little of my guilt from the spare ribs\nPrawns over baby bok choy - mild, lite, lots of green goodness, could've used a bit more flavor but overall, a nice balance to everything else\nGeneral tso's chicken - breaded, fatty, tasty, huge, huge portion\nVegetable chow mein - solid, great accompaniment to all\nLeftovers for DAYS.  Portions were huge.  \n\nWill definitely be ordering again.", "rating": 4, "date": "2011-11-06"}], "vegetable pot stickers": [], "salt and pepper vegetable ball": [], "beef on the sticks": [{"excerpts": ["the xinjiang skewers (which appear on the seamless menu but are \"beef on the sticks\" on their webpage) are also super yummy - beef drenched in cumin and soy sauce.\n\n"], "author": "T L.", "review": "for delivery, this is the best chinese place i've found thus far.\n\nthe fake chicken dishes excellent.  i've tried about 3-4 of these and although it's the same batter-fried fake meat prepared differently, it's almost always yummy.  note that i suspect the fake chicken batter is not gluten free\n\nthe fried chicken wings, beef chow fun and garlic pea sprouts are also *excellent*.\n\nthe xinjiang skewers (which appear on the seamless menu but are \"beef on the sticks\" on their webpage) are also super yummy - beef drenched in cumin and soy sauce.\n\nfried rice, dimsum are passably good\n\nservings are ginormous.  $40 here is about 4-5 servings for me.", "rating": 5, "date": "2012-10-02"}, {"excerpts": ["Once I got the Beef on the Sticks, and if that meat was beef, you'd have to convince me with a DNA test. "], "author": "Brooke B.", "review": "I just placed an order and it arived in 10 minutes. Whoa. Not sure if that's great or highly suspect.\n\nWild Pepper is the best Chinese within delivery distance of me. And I have tried some interesting things here - most of which were passable, a few that were sublime (Wild Pepper Chicken). Ask for anything with steamed veggies and customize a healthy dish with the sauce of your choosing (I like the spicy and the garlic).\n\nNow, I am a conossieur of sizzling rice soup and get it every time. What's weird is that depending on the day, it's either incredibly forgettable, or spectacular. Last week, it was packed with fresh, totally never-canned veggies including asparagus, cooked perfectly (not boiled to death) and lots of shrimp and white meat chicken. Tonight, mostly broth, weak veg variety. Next time I'm going to make a specific request and be sure my soup is made on the spot (asparagus, please!). \n\nOnce I got the Beef on the Sticks, and if that meat was beef, you'd have to convince me with a DNA test. So gross.\n\nI love the simple cucumber salad, and the chili potato is an interesting alternative to noodles - basically a riced semi-raw potato dressed in vinegar and chili flakes. never seen anything like it, not sure i could reproduce it.", "rating": 4, "date": "2009-02-20"}], "vegetable steamed dumplings": [], "pork steamed dumplings": [], "mini shanghai pork buns": [], "combination dim sum": [], "mings eggplant": [], "deep fried samosa": [], "deep fried oyster": [], "mings wrap": [], "tomato and egg flower soup": [], "hot sour soup": [], "spinach mushroom with tofu soup": [], "monks garden soup": [], "hong kong wor wonton soup": [], "seafood hot and sour soup with basil": [], "soft tofu salad with chili and scallions": [], "spinach salad with ginger sauce": [], "broccoli salad with garlic sauce": [], "string bean with dry shrimp salad": [], "red oil wonton salad": [], "bean sprouts cucumber salad": [], "mango salad with tiger prawns": [], "papaya and seasonal greens salad": [], "cold noodle salad": [], "chicken mushu": [], "mango and pineapple chicken": [], "red ginger chicken": [], "double mushroom and chicken": [], "chinese broccoli with chicken": [], "mix vegetable with chicken": [], "wild pepper chicken": [{"excerpts": ["Wild Pepper chicken - pretty good. ", "There was chicken, bell peppers, mushrooms, cucumber, tossed together w a flavorful slightly salty sauce. ", "Really yummy with rice. ", "Comes spicy "], "author": "Connie L.", "review": "It seems like this place either has really great reviews or really crappy ones. From reading other reviews, though, customers seem to have the most problems with take out delivery and language barrier.\n\nI've eaten here three times now and I've been very happy all three times. Fast highlights: affordable (most dishes under $10), great portion sizes, quality and authentic Chinese dishes, no msg and food is not too oily, peaceful restaurant ambiance w piano music, dishes come out carefully and aesthetically plated, and they take good care of you in terms of service. \n\nFast downsides: language barrier. The owner, Ming, is very nice. When I asked about the menu, though, I did experience some difficulty understanding what he meant. So that can feel a bit awkward. We ended up switching to Cantonese and had no problems after that. If you don't know Cantonese, though, just try to be patient and ask Ming to speak slowly or ask for another waiter. Sure we are in America, but I think pple should try to be kind and understanding regardless. \n\nFood experience in detail:\nMy first two times I ordered the Mongolian beef with rice and vegetables, a pretty basic standard Chinese dish. It was a bit heavy with the onions, but the portion size was pretty generous and the presentation was great. I would definitely recommend this option as a fast and basic it delicious dish if you're not sure what to order. \n\nMy third time here, I brought my mom, so I wanted to pick out some more sophisticated Chinese dishes (as Asian moms are not easily impressed eating out, and my mom passes silent judgement on every dish that does not meet her expections..)\nSo, we ordered (and in order of my recommendation): \n\n1. West lake beef soup - a creamy, slightly salty Chinese soup that has some mushrooms, beef bits, and egg. It was nice and savory, and enough soup for 3 pple, definitely try this! Presentation of the soup was so pretty, it could have been in a food catalog. \n\n2. Garlic pea sprout - if you want a Chinese vegetable dish, try this! Pea sprout is usually more expensive at other restaurants but here it was reasonable. Portion size is great, not too oily, slightly salty and garlic taste. \n\n3. Vegetable spring rolls - yummy appetizer, comes out piping hot. Also I'm a sucker for spring rolls\n\n4. Wild Pepper seafood basket - an assortment of seafood and vegetables (shrimp, scallops, peas, cucumber, mushroom, broccoli, carrots, etc) cooked together and placed into a crisp bowl-shaped pancake. Best part of this dish was the presentation. The seafood and vegetables were not burnt, was tender and not dry, and just the right amount of oil. The one bad thing was it was a bit saltier than necessary. \n\n5. Wild Pepper chicken - pretty good. There was chicken, bell peppers, mushrooms, cucumber, tossed together w a flavorful slightly salty sauce. Really yummy with rice. Comes spicy but you can adjust for less or more. \n\nI'm happy to say my mom was happy w the meal (disaster avoided!!) and our total meal cost was about $50 but we ordered so much we basically paid for two dinners for us both. All in all, will definitely be back.", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["The wild pepper chicken was just about average. ", "But the worst was the Singapore style noodles: all they tasted of was tumeric. ", "I am allergic to shrimp and had specifically asked for no meat, but the noodles came with shrimp as well as chicken, which had a weird red color to it. ", "Luckily, I noticed the shrimp before I started eating it, else this day would have ended terribly for me. ", "Will never be ordering from here again!"], "author": "Shripad D.", "review": "This has been one of my worst restaurant experiences so far. The Hong Kong style noodles tasted of nothing. The wild pepper chicken was just about average. But the worst was the Singapore style noodles: all they tasted of was tumeric. I am allergic to shrimp and had specifically asked for no meat, but the noodles came with shrimp as well as chicken, which had a weird red color to it. Luckily, I noticed the shrimp before I started eating it, else this day would have ended terribly for me. Will never be ordering from here again!", "rating": 1, "date": "2018-06-20"}, {"excerpts": ["and I ordered the combination appetizer plate, Mongolian beef, wild pepper chicken, and pork fried rice. ", "There was no option in the app to request the dishes spicy ", "so I called after placing the order to ask and--well, didn't go so well. ", "Person who answered the phone didn't understand me at all and just kept saying \"okay, your order?"], "author": "Semuteh F.", "review": "3.5 Stars\nOrdered through postmates. Totally adequate, greasy, Chinese food to calm the craving I had for Chinese food take out tonight. \n\nThe beau and I ordered the combination appetizer plate, Mongolian beef, wild pepper chicken, and pork fried rice. There was no option in the app to request the dishes spicy so I called after placing the order to ask and--well, didn't go so well. Person who answered the phone didn't understand me at all and just kept saying \"okay, your order?\" \n\nDishes didn't come spicy but we used sriracha for some heat. Best dish was a tie between fried rice and Mongolian beef. We have a TON of leftovers. I would skip the appetizers next time since none of them were particularly good. \n\nOkay in a pinch but nothing special here.", "rating": 3, "date": "2016-08-28"}, {"excerpts": ["The Wild Pepper chicken was okay, a little salty and greasy, not bad "], "author": "Nick G.", "review": "We were looking for some inexpensive Chinese that took credit card and was open late.  Wild Pepper fit the bill.   We ordered a hot and sour soup, vegetable delight, and the Wild Pepper meatless chicken (after reading numerous positive reviews of it).\n\nOverall it was decent and hit the spot at the time.  The hot and sour soup was good.  Nicely spicy and not too salty.  The vegetable delight was great, nicely sauteed vegetables, nice and light.  The Wild Pepper chicken was okay, a little salty and greasy, not bad but I think I would just order normal chicken next time. \n\nMet the requirements.  Fast and hot delivery.  Thanks guys!", "rating": 3, "date": "2014-08-20"}, {"excerpts": ["Ordered: \nWild Pepper Chicken - Peppery and flavorful. "], "author": "Anush V.", "review": "Food was fantastic. \n\nOrdered: \nWild Pepper Chicken - Peppery and flavorful. Tons of vegetables which may not be for everyone, but good balance for me. \n\nChicken Chow Mein - A bit dry, but very good and huge portion. \n\nCombo Fried Rice - I asked for this spicy, and they actually did make it spicy! It was delicious. \n\nBlack Mushroom and Bok Choy - I LOVE mushrooms, and my wife and I really enjoyed this. Very saucey so especially good with rice. \n\nOverall - definitely worth the order, and will def be a go to for Chinese in the Mission.", "rating": 4, "date": "2015-05-04"}, {"excerpts": ["The wild pepper chicken is pretty delicious. ", "Moderately spicy with zucchini, peppers and mushrooms. ", "Definitely recommend. ", "Pick-up is always ready when I show up 15min after calling."], "author": "Mark T.", "review": "The wild pepper chicken is pretty delicious. Moderately spicy with zucchini, peppers and mushrooms. Definitely recommend. Pick-up is always ready when I show up 15min after calling.", "rating": 4, "date": "2016-01-17"}, {"excerpts": ["Their Wild Pepper Chicken was not a lunch special but the waiter told me he would make it for me!  ", "It was only $6.50 and came with soup and a huge serving of white rice.  ", "It was a good amount of food for the price ", "and I left more than stuffed.  "], "author": "Claire M.", "review": "Feeling under the weather?  Need to clear your sinuses?  Skip the pharmacy and just come here instead!  The spices and hot and sour soup made my sinuses so clear, better than any medicine I have ever taken!\n\nTheir lunch specials range between $5 and $7.  It comes with your choice of a dish (chicken, beef, tofu, and vegetable varieties).  Their Wild Pepper Chicken was not a lunch special but the waiter told me he would make it for me!  It was only $6.50 and came with soup and a huge serving of white rice.  It was a good amount of food for the price and I left more than stuffed.  That's a steal for anything in San Francisco.\n\nOverall, the quality of the food was good, but not great.  Would have only given three stars but because I feel nearly 100% after eating here, I gave one more!", "rating": 4, "date": "2010-06-18"}, {"excerpts": ["and I ordered the wild pepper chicken.  ", "I had to order white rice separately, but would have ordered chow mein or brown rice. "], "author": "Po L.", "review": "3.5 A clean and friendly restaurant that delivers.\n\nSo the name says it all and I ordered the wild pepper chicken.  I had to order white rice separately, but would have ordered chow mein or brown rice. For $9.80 you easily get enough food for two meals, unless you have a tape worm, and it was flavorful with tender chicken and fresh peppers.\n\nWalnut shrimp was ordered too.  The candied walnuts were good and the shrimp was breaded which is a bit different from the norm, however, the shrimp was good.\n\nI would definitely come here again if I am in the mood for some Asian food.", "rating": 4, "date": "2009-11-30"}, {"excerpts": ["Ordered the mushu pork, general's chicken, and wild pepper chicken.  ", "Also ordered wonton soup and weren't sure if we got the right thing or not.  ", "Certainly not what you expect from wonton soup but actually was pretty good."], "author": "Scott P.", "review": "Very bad take out experience. There were no pancakes included with the mu-shu pork, no sauce for the pot stickers (which were breaded or something and disappointing aside from the lack of sauce), and no included napkins or plastic forks (which I usually expect from take out but wasn't advertised).\n\nThe food itself was average at best.  Ordered the mushu pork, general's chicken, and wild pepper chicken.  Also ordered wonton soup and weren't sure if we got the right thing or not.  Certainly not what you expect from wonton soup but actually was pretty good.", "rating": 2, "date": "2012-05-28"}, {"excerpts": ["I also had the Wild Pepper chicken, Szechuan hot pot with beef, chicken fried rice, and dry sauteed string beans and they were all good.  "], "author": "Vicente G.", "review": "Argh!  Close, but no cigar.\n\nI usually don't order from restaurants that leave those annoying menus on my front gate, but I was really craving Chinese and I still haven't found a decent place that delivers in the Noe/Mission area.  After reading the glowing reviews on Yelp, I decided to give Wild Pepper a try.  The service was excellent: the lady who answered the phone was very friendly as was the delivery man.  The food was delivered promptly and the prices were good for the amount and quality of food.\n\nI guess there was only one problem, and it's a big one for me.  The food was super-duper greasy!  I was optimistic from the reviews, and maybe my order was a fluke, but geez louise!  There was enough residual grease to deep fry an order of egg rolls.  It's the kind of grease that coats your lips and leaves a taste in your mouth after you're done eating.  I just had leftovers, and I was hoping that the grease would have magically disappeared by now, but it was still there.  I expect a certain amount of grease from Chinese food, but this was an intolerable amount.\n\nIn all fairness, the dishes were delicious and had great flavors.  The hot and sour soup was amazing and had the right amount of spiciness.  You can't make soup greasy, right?  I also had the Wild Pepper chicken, Szechuan hot pot with beef, chicken fried rice, and dry sauteed string beans and they were all good.  Well, maybe the fried rice was just OK, but it was free!  \n\nI really want to like Wild Pepper because I need a go-to Chinese place, so I'm truly hoping that my order was anomalous.  Next time I crave Chinese delivery, I'll give Wild Pepper another try unless I've found something better.  Any suggestions?", "rating": 3, "date": "2007-01-29"}, {"excerpts": ["We thought we would risk it, so we ordered seven entrees - two veggie, two shrimp, crispy beef, crispy pork, wild pepper chicken, plus veggie egg rolls.  ", "As it says on the menu, order two entrees and get fried rice or chow mien - we got the rice.  ", "This was for eight people, and we polished off most of it, leaving just enough for two plates of leftovers.  ", "The crispy pork and wild pepper chicken were also really good.  ", "I was a little disappointed that we didn't' get more fried rice - it seemed that whether you order two entrees or seven, you may get the same amount of the 'free' fried rice.  "], "author": "Chris W.", "review": "After reading the 1-star reviews and finding them all to be related to delivery, we were leery about getting delivery, especially having never tried the restaurant.  We thought we would risk it, so we ordered seven entrees - two veggie, two shrimp, crispy beef, crispy pork, wild pepper chicken, plus veggie egg rolls.  As it says on the menu, order two entrees and get fried rice or chow mien - we got the rice.  This was for eight people, and we polished off most of it, leaving just enough for two plates of leftovers.  I usually don't eat leftovers from a Chinese restaurant, but I did this time and it was still good.  \n\nFirst off, I placed the order at 6:15 and was told it would be 30-45 minutes.  27-minutes later, the doorbell rang.  We live about 3-miles and maybe 10-minutes drive from the restaurant, so it took them 17-minutes to prepare our seven entrees!  Not too shabby.\n\nThe garlic mixed veggies were firm and perfectly cooked.  The eggplant was a little mushy, but overall tasty.  The picky vegetarian in the group who claimed not to usually like eggplant did enjoy this dish.  The two shrimp dishes were practically indistinguishable except for the squid in one.  Both were tasty, although the squid was a little chewy - it IS squid after all.\n\nThe Szechuan crispy beef was awesome.  The crispy pork and wild pepper chicken were also really good.  I was a little disappointed that we didn't' get more fried rice - it seemed that whether you order two entrees or seven, you may get the same amount of the 'free' fried rice.  The veggie egg rolls were yummy, too - crispy outside and flavorful.\n\nWe all finished with the tingle of chili and white pepper in our mouths, but not so much as to be uncomfortable.  The heat on these dishes was perfect and enhanced the flavors instead of simply being hot.\n\nOverall, a really good meal, especially for delivery.  Ended up being about $9/person plus tip to the driver.", "rating": 4, "date": "2007-07-12"}, {"excerpts": ["Seriously, though, I had the Wild Pepper Chicken and a Hunan Pork dish - asked for both to be very spicy, and spicy they were!  ", "As stated by other yelpers, there was a distinctive lack of gristle or meat parts that make you say \"hmmmmm\".  ", "Wild Pepper is now my Chinese delivery default!"], "author": "Julie L.", "review": "Jan 2010 update - down to 3 stars, we dined in (you'd think that would be better) and it was downright lame.  Now I don't know where I stand, but it's gone downhill since the first time.  Isn't that just the way?\n\nBelieve the hype!  I did, but I was still a bit dubious -- how do you know what will be good?  Well, Wild Pepper is.  Fast delivery, fresh food -- when I took leftovers out of the fridge the next day, there were no grease puddles!  What a concept!\nSeriously, though, I had the Wild Pepper Chicken and a Hunan Pork dish - asked for both to be very spicy, and spicy they were!  As stated by other yelpers, there was a distinctive lack of gristle or meat parts that make you say \"hmmmmm\".  Wild Pepper is now my Chinese delivery default!", "rating": 3, "date": "2006-08-13"}, {"excerpts": ["And I have tried some interesting things here - most of which were passable, a few that were sublime (Wild Pepper Chicken). "], "author": "Brooke B.", "review": "I just placed an order and it arived in 10 minutes. Whoa. Not sure if that's great or highly suspect.\n\nWild Pepper is the best Chinese within delivery distance of me. And I have tried some interesting things here - most of which were passable, a few that were sublime (Wild Pepper Chicken). Ask for anything with steamed veggies and customize a healthy dish with the sauce of your choosing (I like the spicy and the garlic).\n\nNow, I am a conossieur of sizzling rice soup and get it every time. What's weird is that depending on the day, it's either incredibly forgettable, or spectacular. Last week, it was packed with fresh, totally never-canned veggies including asparagus, cooked perfectly (not boiled to death) and lots of shrimp and white meat chicken. Tonight, mostly broth, weak veg variety. Next time I'm going to make a specific request and be sure my soup is made on the spot (asparagus, please!). \n\nOnce I got the Beef on the Sticks, and if that meat was beef, you'd have to convince me with a DNA test. So gross.\n\nI love the simple cucumber salad, and the chili potato is an interesting alternative to noodles - basically a riced semi-raw potato dressed in vinegar and chili flakes. never seen anything like it, not sure i could reproduce it.", "rating": 4, "date": "2009-02-20"}, {"excerpts": ["The other food, Black Mushroom with Baby Bok Choy and Wild Pepper Chicken, was also ok, but not great.  ", "Left me in need of a lot of liquids to quench the thirst."], "author": "I m.", "review": "Very fast delivery, so was happy about that.\nOrdered Hot and Sour soup, but got wonton instead.  It was ok, but either very salty or full of msg.  Eating it made me very thirsty and my mouth tingle.   The other food, Black Mushroom with Baby Bok Choy and Wild Pepper Chicken, was also ok, but not great.  Left me in need of a lot of liquids to quench the thirst.", "rating": 2, "date": "2010-09-29"}, {"excerpts": ["The sesame beef, crab rangoon and string bean chicken are good, the Wild Pepper chicken special was drowning in too many vegetables.  ", "Overall, a good option for take out, especially with the free chow mein or fried rice with 2 entrees as a nice bonus!"], "author": "Rochelle J.", "review": "Like many, I've never been to the restaurant, just gotten delivery, but they are lightning fast!  I usually have my food within 20 minutes.  The sesame beef, crab rangoon and string bean chicken are good, the Wild Pepper chicken special was drowning in too many vegetables.  Overall, a good option for take out, especially with the free chow mein or fried rice with 2 entrees as a nice bonus!", "rating": 4, "date": "2008-10-07"}, {"excerpts": ["The signature \"wild pepper chicken\" is actually more celery than anything else, and the occasional small pepper chunk. ", "Good portions."], "author": "M L.", "review": "Reasonably decent sesame chicken, bad crab rangoons, okay dumplings, good egg rolls, good fried rice. Not a bad pick for delivery but not a great one either. The signature \"wild pepper chicken\" is actually more celery than anything else, and the occasional small pepper chunk. Good portions.", "rating": 3, "date": "2008-03-12"}, {"excerpts": ["the egg rolls, hot-and-sour soup and wild pepper chicken were all fresh, flavorful and quite delectable. ", "and yes, it was easy on the wallet. ", "now this is how chinese food should be - good and cheap. ", "hell ", "yes, my girlfriend and i were so excited that we were jumping and high-fiving each other. ", "then soon our eyes turned moist as it dawned on us that we've finally found our elusive chinese delivery in the mission. ", "an epiphany indeed... go wild pepper!"], "author": "frisco j.", "review": "the other day my girlfriend and i were almost in tears. you see, after one disappointing chinese delivery after another, we pretty much gave up on finding a decent chinese delivery in the mission, and resigned ourselves to firecracker (american chinese)... then one evening after an extremely tough day at work, we were craving chinese but were too tired and lazy to walk a few blocks to firecracker. what to do? what to do? out of sheer desperation, i yelped for chinese in the mission. oh, what's this? wild pepper? hmmm. 4 stars but only 4 reviews. is this legit? should i take a chance? am i going to be disappointed yet again? oh what the hell. it won't be the first time and i'll have another place to yelp about. so i called and spoke to a friendly lady who helped me out with the order. the food arrived within 20 minutes. ok, i only live a few blocks away. so maybe that's not a great accomplishment. however, my food was an outstanding accomplishment. the egg rolls, hot-and-sour soup and wild pepper chicken were all fresh, flavorful and quite delectable. and yes, it was easy on the wallet. now this is how chinese food should be - good and cheap. hell yes, my girlfriend and i were so excited that we were jumping and high-fiving each other. then soon our eyes turned moist as it dawned on us that we've finally found our elusive chinese delivery in the mission. an epiphany indeed... go wild pepper!", "rating": 4, "date": "2006-06-07"}, {"excerpts": ["Wild pepper chicken is the bomb with Szechwan chili pepper flakes, carrots, celery, and a sauce of chili oil which compliments the tender chicken slices and vegetables.  ", "Lemon fish is crispy with a greasless batter and a thick but not overpowering and too thick of a lemon sauce.  ", "Jade shrimp is succulent with fresh spinach, bamboo shoots, and fresh bean curd in a light sauce.  ", "The house special lo mein is a plethora of ground pork, onions, and a mild brown sauce that tasted like it could have been bean sauce (what am I saying, it was just that.)  ", "I will definitely be returning to try the won tons in chili sauce, ants climbing up a tree, and the Szechwan crispy beef.  ", "As I say in all of my reviews, great food, service, atmosphere, and prices; what more could you ask for?!  ", "Oh,! ", "I enjoyed the Kenny G music which they had playing (probably his Greatest Hits, Best of, or Very Best Of CD.)  ", "It made the experience all the more enjoyable and relaxing.  ", "Hopefully, I should be going back in another month or two or three."], "author": "Brian S.", "review": "Wild Pepper is an excellent addition to the Noe Valley neighborhood.  It is a casual place with friendly and at tentative service.  Szechwan and Hunan are the name of the game, (needless to say they have mild dishes.)  Pot stickers have crispy golden exterior that is also firm and filled with a savory mixture of pork, cabbage, and ginger and other seasonings.  Green onion pancakes are are light, crispy, and greasless with a perfect balance of dough and green onions with a creamy peanut butter-like dipping sauce.  Wild pepper chicken is the bomb with Szechwan chili pepper flakes, carrots, celery, and a sauce of chili oil which compliments the tender chicken slices and vegetables.  Lemon fish is crispy with a greasless batter and a thick but not overpowering and too thick of a lemon sauce.  Jade shrimp is succulent with fresh spinach, bamboo shoots, and fresh bean curd in a light sauce.  The house special lo mein is a plethora of ground pork, onions, and a mild brown sauce that tasted like it could have been bean sauce (what am I saying, it was just that.)  I will definitely be returning to try the won tons in chili sauce, ants climbing up a tree, and the Szechwan crispy beef.  As I say in all of my reviews, great food, service, atmosphere, and prices; what more could you ask for?!  Oh,! I enjoyed the Kenny G music which they had playing (probably his Greatest Hits, Best of, or Very Best Of CD.)  It made the experience all the more enjoyable and relaxing.  Hopefully, I should be going back in another month or two or three.", "rating": 5, "date": "2008-01-16"}], "whole roast duck": [], "whole crispy chicken": [], "pork egg fu young": [], "vegetable scrambled egg": [], "chicken scrambled egg": [], "beef scrambled egg": [], "pork scrambled egg": [], "seafood egg fu young": [], "combination egg fu young": [], "seafood scrambled egg": [], "combination scrambled egg": [], "prawns with tofu in lobster sauce": [{"excerpts": ["We got the Calamari with Black Bean Sauce and the Prawns with Tofu in Lobster Sauce, both made spicy. "], "author": "D H.", "review": "The Lunch Special is a must do...\n\n$4.95-$5.95=heaps o' food!\n\nWe got the Calamari with Black Bean Sauce and the Prawns with Tofu in Lobster Sauce, both made spicy. (although not quite \"picante\" enough for my fire retardant mouth) \n\nThe Calamari, DELISH! perfectly seasoned with lotsa calamari, which was well cooked, not too chewy. \n\nThe Prawns, a little underseasoned, it was missing something. Not unedible, but bland nonetheless. \n\nOh, and the lunch specials also came with two free egg rolls, which since they were free, they tasted awesome. \nFree food always tastes better. \n\nFor $13 we got lunch for two hungry ladies, and leftovers for dinner. \n\nNot the best, but for a cheap, tasty lunch, I'd give it go again.", "rating": 4, "date": "2009-01-16"}], "garlic squid": [], "jalapeno squid": [{"excerpts": ["we didn't have a menu (and they don't have a website), so we ordered based on others' reviews:  the jalapeno squid, the crispy szechuan beef, and the string beans with tofu.  ", "the squid was good--they didn't skim on the seafood and the sauce was nice and spicy.  ", "the beef tasted quite good, but i wouldn't call it crispy by any stretch of the imagination.  "], "author": "Roshni R.", "review": "i'm vacillating between 3 and 4 stars here...  the meal was definitely a 3 star meal, but given that it was delivery and chinese delivery generally sucks, does it deserve an extra star?  i'm not sure...\n\nanyhow, the roomie and i ordered in the other night and chose wild pepper based on yelp.  we didn't have a menu (and they don't have a website), so we ordered based on others' reviews:  the jalapeno squid, the crispy szechuan beef, and the string beans with tofu.  the squid was good--they didn't skim on the seafood and the sauce was nice and spicy.  the beef tasted quite good, but i wouldn't call it crispy by any stretch of the imagination.  the beans were over cooked, limp, and wrinkled, and the tofu was deep-fried and dripping with grease.\n\ndelivery took almost an hour, but they gave fair warning for that.", "rating": 4, "date": "2007-01-17"}], "stir fried triple delight": [], "szechuan flounder fillet": [], "sweet and sour flounder fillet": [], "salt and pepper squid": [], "double mushroom and prawns": [], "prawns over chinese baby bokchoy": [], "volcano prawns": [{"excerpts": ["General Tsao chicken or tofu....amazing....volcano prawns...", "for those who love sweet and spicy!!! \n", "I need to try the dry braised chicken wings, honey walnut prawns and everything else. \n", "Also the menu is interesting, the menu explains all the styles of which the food is cooked, very helpful. ", "I've only been three times to eat at this location, but I plan to attend more with my wife and twins!!!"], "author": "Adrian P.", "review": "This place is epic! The food tastes fresh, the restaurant is clean, prices are reasonable and most importantly the food is finger licking good!!!!!!\nMy cousin brought me here and right away we were greeted by owner. The owner was very nice and was ready to cater to our needs. He spoke with us, made some recommendations and had some good laughs. \nThe food is amazing...Szechuan beef!!! General Tsao chicken or tofu....amazing....volcano prawns...for those who love sweet and spicy!!! \nI need to try the dry braised chicken wings, honey walnut prawns and everything else. \nAlso the menu is interesting, the menu explains all the styles of which the food is cooked, very helpful. I've only been three times to eat at this location, but I plan to attend more with my wife and twins!!!", "rating": 5, "date": "2015-06-23"}, {"excerpts": ["Breakdown by dish:\n\n- Volcano Prawns:  "], "author": "Ayumi Y.", "review": "Overall it was kind of meh. The dishes were pretty bland and unimaginative; it was a typical Americanized Chinese place.\n\nWe did famiry style. Breakdown by dish:\n\n- Volcano Prawns:  Sweet, battered and fried prawn goodness. Tasty, reminded me of Panda Express too (in a guilty pleasure sort of way).\n- Monk's Soup:  Basic savoury vegetable soup. Solid.\n- Mapo Tofu:  I had a legit Mapo tofu a few days ago at Sichuan Fusion in Richmond, and this one is probably 2 classes below that. In other words, I could have made this blindfolded from crappy tofu and packaged seasoning. Blandly spicy, poor tofu texture.\n- Spicy beef with scallion:  When I saw it, I was like WTF is this? Cornstarch sauce laden beef, peas, carrots, and onions... at least the beef wasn't stringy. It wasn't very spicy though.\n- Bok choy with mushrooms:  I liked it a lot actually. A bit too gooey cornstarchy saucey style, but the flavor was pretty good.\n\nSo, 3 out of 5. We paid $16 each for 5 people so it was reasonable, but I can't say I'd come here again.\n\nRedeeming quality: they deliver.", "rating": 3, "date": "2010-12-26"}, {"excerpts": ["The volcano prawns are freakin amazing.  ", "CALL instead of 3rd-party internet order ", "and you'll get your food faster (for those of you who blast this place for slow delivery)"], "author": "Ed P.", "review": "I found this place in 2010 when my usual place closed for remodeling.  In 17 years in SF I've ordered Chinese food delivery from MANY places.  Wild Pepper is by far the best.  The volcano prawns are freakin amazing.  CALL instead of 3rd-party internet order and you'll get your food faster (for those of you who blast this place for slow delivery)", "rating": 4, "date": "2013-10-20"}, {"excerpts": ["I ordered the broccoli beef platter and the volcano prawns and maybe after 5 mintues of ordering the food they were already serving me and my family our orders. ", "Their jasmine tea is delicious and cleansing after eating and drinking some tea ", "i felt good and not so over fed..", "I am still searching for the same tea because it is that good. ", "The customer service is great, the servers are so attentive and nice. ", "I recommend this place and i refuse to go anywhere else for chinese food. ", "Oh and the food is a little pricey but the quality and quantity is worth every dime. ", "Two thumbs up!!"], "author": "Christine A.", "review": "This place is absolutely fantastic, and it makes me so happy that they are right down the street from my home. I can honestly say this is the best chinese food I ever had, the restaurant looks so nice and clean, it looks welcoming and the food is delicious! each plate looks so presentable, the veggies are so crisp and fresh and the flavors are great. I ordered the broccoli beef platter and the volcano prawns and maybe after 5 mintues of ordering the food they were already serving me and my family our orders. Their jasmine tea is delicious and cleansing after eating and drinking some tea i felt good and not so over fed..I am still searching for the same tea because it is that good. The customer service is great, the servers are so attentive and nice. I recommend this place and i refuse to go anywhere else for chinese food. Oh and the food is a little pricey but the quality and quantity is worth every dime. Two thumbs up!!", "rating": 5, "date": "2014-07-29"}], "salmon with asparagus": [{"excerpts": ["We ordered General Tao chicken, dry braised chicken wings, salmon with asparagus, and garlic pea sprouts, all very delicious and highly recommend!  \n", "The restaurant itself has dim lights with red/orange walls to complement the Chinese art pieces; very good choice of interior design compared to other Chinese restaurants! \n", "Servers were quick and polite. ", "The owner, Ming, was very friendly and took the time to converse with his customers. "], "author": "Jessica L.", "review": "I was feeling Chinese food, so decided to come here with my boyfriend. At the end of the day, we were both extremely full with a lot of left overs to bring home. We ordered 4 entrees and was only able to finish 1/3 of each because the portions were huge! We ordered General Tao chicken, dry braised chicken wings, salmon with asparagus, and garlic pea sprouts, all very delicious and highly recommend!  \nThe restaurant itself has dim lights with red/orange walls to complement the Chinese art pieces; very good choice of interior design compared to other Chinese restaurants! \nServers were quick and polite. The owner, Ming, was very friendly and took the time to converse with his customers. He made sure we were satisfied with our meal and kept checking back on us! \n\nOverall, very satisfied with our experience and definitely coming back here again!", "rating": 5, "date": "2014-01-19"}, {"excerpts": ["Some of the other orders made were fake chicken, beef with broccoli and salmon with asparagus. \n\n"], "author": "Hilda Z.", "review": "A large group of my work buddies and I came for lunch today. It seems like a lovely restaurant, with an extensive menu of tasty options.\n\nI went for the lunch special of 'cumin lamb'. It was less than $10 and came with soup and side of rice. Some of the other orders made were fake chicken, beef with broccoli and salmon with asparagus. \n\nAlthough I must commend the hefty portions, my order of lamb was drowning in cumin. I mean, did the cap fall off the spice jar? I tend to like cumin, but this I could not really enjoy. It could have been socks with cumin...because all I tasted with the spice. =(\n\nI guess that I went on an off day....??", "rating": 2, "date": "2012-04-03"}, {"excerpts": ["I personally recommend the Ming's Dinner and the Salmon with Asparagus. ", "Loving it!!!"], "author": "Jian L.", "review": "We have been going to this restaurant  for many times. Both my girl friend and I like their food very much. The environment and the service are great. I personally recommend the Ming's Dinner and the Salmon with Asparagus. Loving it!!!", "rating": 5, "date": "2014-01-07"}], "portobello mushroom with prawns": [], "prawns with vegetable": [], "vegetable jalapeno fried rice": [], "chicken jalapeno fried rice": [], "beef jalapeno fried rice": [], "pork jalapeno fried rice": [], "singapore style noodle": [], "vegetable hong kong style crispy noodle": [], "chicken hong kong style crispy noodle": [], "beef hong kong style crispy noodle": [], "pork hong kong style crispy noodle": [], "house special lao mein": [], "wild pepper spice noodle": [], "vegetable fried brown rice": [], "chicken fried brown rice": [], "beef fried brown rice": [], "pork fried brown rice": [], "seafood jalapeno fried rice": [], "combination jalapeno fried rice": [], "seafood fried brown rice": [], "combination fried brown rice": [], "seafood hong kong style crispy noodle": [], "combination hong kong style crispy noodle": [], "a wild pepper lamb chop": [], "b princess prawn": [], "c szechuan crispy beef": [], "d basil eggplant with prawns and scallops": [], "e dry braised chicken wings": [], "f salt and pepper triple delight": [], "g black forest pork": [], "h lemon fish": [], "i black pepper beef in sizzling plate": [], "j old country scallops": [], "k jade prawns": [], "l king salmon steak": [], "m walnut prawns": [], "n satay beef in sizzling plate": [], "o happy family": [], "p mini szechuan hot pot": [], "q minced chicken lettuce cups": [], "r mountain city chicken": [], "s mussels with black bean sauce": [], "t double mushroom and triple delight": [], "u three delicacies": [], "v mings dinner": [], "w spicy beef with scallion in wine sauce": [], "steamed mixed vegetable": [], "steamed mixed vegetables with chicken": [], "steamed broccoli with bean curd": [], "steamed mixed vegetables with buckwheat noodle": [], "wild pepper tofu": [{"excerpts": ["I like the Wild Pepper Tofu and Hot and sour soup.  \n\n"], "author": "Lauren R.", "review": "I love that Wild Pepper delivers and is nearby. Their food is consistent. HUGE portions, EXTREMELY greasy and good flavor (it has to be really really bad for you, fyi). I like the Wild Pepper Tofu and Hot and sour soup.  \n\nTonight my delivery took an hour and a half to arrive. I called twice to check in, since they told me 45 minutes. Both times they told me the driver was a few minutes away (calls placed 30 mins apart). The food just arrived and is cold and spilled in the bag. Boo:(", "rating": 3, "date": "2012-12-19"}, {"excerpts": ["My current favorite dish is the Wild Pepper Tofu - they use good stuff, flavoring is perfect, not too salty.  ", "My other favorite Chinese restaurant dish is salt and pepper pork and sadly, I do not like how they make theirs.  ", "Everything else, like General Tsao's chicken - delish.  "], "author": "S.T. C.", "review": "This review is for delivery only.\n\nI've tried Wild Pepper here and there and I feel like they've definitely improved their food.  Food is hot and fresh.  My current favorite dish is the Wild Pepper Tofu - they use good stuff, flavoring is perfect, not too salty.  My other favorite Chinese restaurant dish is salt and pepper pork and sadly, I do not like how they make theirs.  Everything else, like General Tsao's chicken - delish.  I also like their steamed vegetable - it's fresh, crunchy and nicely flavored.  \n\nTheir delivery time is generally pretty fast.  I've also never had any mistakes with my order.  I like that you can place your order online (over the phone has been fine as well).  This is a convenient and delish option for Chinese food.", "rating": 4, "date": "2011-12-21"}, {"excerpts": ["I ate the wild pepper tofu.  "], "author": "Chris M.", "review": "I'm not a connoisseur of Chinese food, but this place was delicious.  Drop by at lunch and you can get larger portions for pretty cheap.  \n\nI ate the wild pepper tofu.  Tons of veggies, not too greasy, and huge portions for $6.50.  \n\nDefinitely my go to for Chinese food in the Mission", "rating": 5, "date": "2011-03-21"}, {"excerpts": ["I got the Wild Pepper Tofu and the Kung Pao Tofu and the Chow Mein. ", "I thought the flavors were pretty good, but since I'm not a huge fan of pepper, the Wild Pepper Tofu fell short of my expectations. ", "The delivery service did take a lot longer than the guaranteed 30-45 minutes; but it turned out to be worth the wait. ", "Just a side note, I live ", "REALLY far away from the restaurant's location", ", so I guess it was understandable that it took so long; I just wish someone had warned us! ", "All in all, the food was pretty good and it came in SUPER large portions ", "so it lasted us for two days. ", "The price is decent ", "so I would recommend this place for a late night Chinoise craving ", ":)"], "author": "Suhasini C.", "review": "EDIT: A friend of mine pointed out that Wild Peppers had a highly questionable health inspection so we have stopped ordering from them. Check it out at: http://cleanscores.com/1521/Wild+Pepper\n\n\nI ordered delivery from Wild Pepper a few nights ago and the food was pretty tasty! I got the Wild Pepper Tofu and the Kung Pao Tofu and the Chow Mein. I thought the flavors were pretty good, but since I'm not a huge fan of pepper, the Wild Pepper Tofu fell short of my expectations. The delivery service did take a lot longer than the guaranteed 30-45 minutes; but it turned out to be worth the wait. Just a side note, I live REALLY far away from the restaurant's location, so I guess it was understandable that it took so long; I just wish someone had warned us! All in all, the food was pretty good and it came in SUPER large portions so it lasted us for two days. The price is decent so I would recommend this place for a late night Chinoise craving :)", "rating": 3, "date": "2007-08-10"}], "vegetable mushu": [], "chili potato": [{"excerpts": ["But the dish that makes me drool is called Chili Potato. ", "It's so simple but is like nothing I've ever eaten. ", "It's like Chinese mac and cheese! ", "Drooooool."], "author": "Angelique L.", "review": "I used to live right next door to this restaurant and I couldn't walk by the place without drooling -- a Pavlovian response to one of their dishes.\n\nFirst I want to say that I've been to Eric's and a number of other Chinese places in the city that are supposed to be amazing and I still like Wild Pepper better. For another, it's way more low key than Eric's which to me is deafeningly loud and always a mad house with people getting to go orders. Another one of those places that everyone thinks is good because everyone else says it's good.\n\nWild Pepper is not that attractive or charming but the staff are friendly, the food is really good and it's super cheap. It's a hole in the wall but I've always walked out really happy. I've also brought people here from out of town who loved it as well.\n\nThe portions are huge. I've never finished a dish but was happy to bring home the leftovers which (another hallmark, tasted just as good the next day). I love the Monk's Garden soup which is full of fresh vegetables and comes in a huge tureen that I've never been able to finish (seriously, 3-4 people could eat this). The vegetarian Mu Shu is amazing as well. But the dish that makes me drool is called Chili Potato. It's so simple but is like nothing I've ever eaten. It's like Chinese mac and cheese! Drooooool.", "rating": 4, "date": "2010-02-25"}, {"excerpts": ["The chili potato was like nothing I have had before. ", "The vegetarian egg rolls were crisp and flavorsome. ", "The brown rice was fluffy and light.\r\n\r\n", "So... what made this experience even more fabulous - 15 minute delivery - that's what! \r\n\r\n", "You read it right ", "- Fifteen", "... minute... delivery! ", "No.. kidding! ", "It would take me longer to drive there!"], "author": "Kingpin X.", "review": "The food is simple, delicious, on the money. The portions are huge - two entrees is easily enough for three hungry lasses and lads. The vegetarian mu-shu was probably the best. The chili potato was like nothing I have had before. The vegetarian egg rolls were crisp and flavorsome. The brown rice was fluffy and light.\r\n\r\nSo... what made this experience even more fabulous - 15 minute delivery - that's what! \r\n\r\nYou read it right - Fifteen... minute... delivery! No.. kidding! It would take me longer to drive there!", "rating": 4, "date": "2006-10-05"}, {"excerpts": ["They also have an entree called Chili Potato that I've seen nowhere else. ", "It's just potato, sliced noodle-thin and wok-tossed (maybe steamed) with cucumber, bell and chili pepper. ", "Potatoes and chinese food, together again for the first time. ", "I know it's just a lowly spud, but I found it revelation that I could dump my Szechaun Chicken over something besides rice."], "author": "Jeremy W.", "review": "The Mission is hurrd up for decent Chinese food, let alone delivery options. This place is my current favorite, with options for every kind of fussiness, really fast ETAs (which may be down to my lazy ass only being esconced 3 blocks away) and free fried rice or chow mein with only two entrees.\n\nAll of the vegetarian stuff I've tried is very satisfying and I echo the sage maria d's \"no mystery meat\" proclaimation. I mean nothing's \"your first sit-down at Nanking\" good, but for a bad case of what I call  \"the hangries\", this place could save your life. \n\nThey also have an entree called Chili Potato that I've seen nowhere else. It's just potato, sliced noodle-thin and wok-tossed (maybe steamed) with cucumber, bell and chili pepper. Potatoes and chinese food, together again for the first time. I know it's just a lowly spud, but I found it revelation that I could dump my Szechaun Chicken over something besides rice.", "rating": 4, "date": "2006-09-07"}, {"excerpts": ["I love the simple cucumber salad, and the chili potato is an interesting alternative to noodles - basically a riced semi-raw potato dressed in vinegar and chili flakes. ", "never seen anything like it, not sure i could reproduce it."], "author": "Brooke B.", "review": "I just placed an order and it arived in 10 minutes. Whoa. Not sure if that's great or highly suspect.\n\nWild Pepper is the best Chinese within delivery distance of me. And I have tried some interesting things here - most of which were passable, a few that were sublime (Wild Pepper Chicken). Ask for anything with steamed veggies and customize a healthy dish with the sauce of your choosing (I like the spicy and the garlic).\n\nNow, I am a conossieur of sizzling rice soup and get it every time. What's weird is that depending on the day, it's either incredibly forgettable, or spectacular. Last week, it was packed with fresh, totally never-canned veggies including asparagus, cooked perfectly (not boiled to death) and lots of shrimp and white meat chicken. Tonight, mostly broth, weak veg variety. Next time I'm going to make a specific request and be sure my soup is made on the spot (asparagus, please!). \n\nOnce I got the Beef on the Sticks, and if that meat was beef, you'd have to convince me with a DNA test. So gross.\n\nI love the simple cucumber salad, and the chili potato is an interesting alternative to noodles - basically a riced semi-raw potato dressed in vinegar and chili flakes. never seen anything like it, not sure i could reproduce it.", "rating": 4, "date": "2009-02-20"}], "hunan eggplant": [{"excerpts": ["The hunan eggplant was soggy, the chow mein was horribly salty, and the meatless general tsos was so thickly fried it was difficult to chew. ", "The dumplings were also over cooked. ", "Very disappointing experience."], "author": "Marissa N.", "review": "The dishes we ordered were so unpalatable that we had to throw them away. The hunan eggplant was soggy, the chow mein was horribly salty, and the meatless general tsos was so thickly fried it was difficult to chew. The dumplings were also over cooked. Very disappointing experience.", "rating": 1, "date": "2018-05-23"}, {"excerpts": [", the Hunan Eggplant is pretty good and if you feel like curry, the Indian Monk is a yellow curry with veggies and Chinese mushrooms.\n\n"], "author": "Jenn S.", "review": "Me and my girlfriend's FAVE Chinese food spot!\n\nWe're vegan and love how accommodating this restaurant is to us. We come so much the staff knows us and they are always super friendly.The food is delicious and we've brought tons of friends and family here and they all love it.\n\nWe always get General Tsao's Meatless Chicken. That is our ultimate favorite.  A little spicy, a little sweet, perfectly delicious every time. It's a Must Get! Even the meat eaters love it. \n\nFor veggies, we get the Dry Sauteed String Beans (yum!), the Hunan Eggplant is pretty good and if you feel like curry, the Indian Monk is a yellow curry with veggies and Chinese mushrooms.\n\nBut, everything is yummy and consistent. We've also had Kung Pao Meatless Chicken, Dry Braised Meatless Chicken, Salt and Pepper Meatless Chicken, Five Flavor Meatless Chicken (similar to General Tsao's but get General Tsaos!), Veggie Chow Fun, Jalapeño Fried Rice (no egg) and prob tons more I cant remember.\n\nIf you're feeling meatless chicken is too heavy, they have a section called Health Food Section where its your choice of different steamed veggies, your choice of a protein and you can pick your sauce.", "rating": 5, "date": "2014-08-27"}, {"excerpts": ["I also ordered Hunan Eggplant and the Monk's Garden Soup. ", "I had heard the Monk's Soup came with \"vegetable balls"], "author": "Tamara F.", "review": "I've lived in the Mission temporarily for a number of weeks over the past year, and as a vegan who typically enjoys spicy Asian food, I've been drawn to Wild Pepper twice, even though it's not the healthiest, and I'm not a big fan of fake meat, anyway.\n\nIn general, they leave a good impression.  The owner, though possibly a little brusque at first, is genuinely kind, and concerned about the enjoyment of your meal. Though a little oily, the veggies are not overcooked, and the portions are certainly generous. \n\nI find it a bit annoying when Yelpers give a restaurant a horrible rating based on the timeliness of the delivery alone. That isn't very helpful to readers who are interested in the quality of the food, and not just whether the meal will be brought to their doorstep promptly.  The first time I ate Wild Pepper I did order delivery -- and was not that happy with the food, mostly because I ordered General Tso's, or maybe Sesame, meatless chicken, against my better judgement, and it is basically a pile of deep fried breaded-ness.  I also ordered the soft tofu and green onion salad and similarly, it was exactly what you would expect, and not very impressive.\n\nThis time around I ate at the restaurant, and purposefully ordered way too much food so I could try a few things and have leftovers for later.  Worried that every meatless chicken dish would be like the first, but just with different sauce, I asked the owner / waiter if it was always fried, and he said I could order any of the meatless chicken dishes not fried.  I went for Szechuan since I like spicy and it seemed popular from the reviews.  I also ordered Hunan Eggplant and the Monk's Garden Soup. I had heard the Monk's Soup came with \"vegetable balls\" so I checked to make sure there was no egg and was reassured a couple times that it was vegan (in a respectful, not obnoxious way).\n\nThe soup could easily be a meal for one in itself. I thought the broth was a bit bland but the veggies were good and the vegetable balls were dangerously addictive.  The balls aren't necessarily eaten in the soup; they come on the side and are nice and crispy on their own (and there's a lot of them!). They were sort of like little Chinese pakoras.\n\nThe eggplant and \"chicken\" came out a bit later.  I was too full to eat much of them, but found them pretty good, but maybe because I didn't have very high expectations. I did think the sauces were a little similar and not nearly as spicy as I would have liked.  If you like spicy, emphasize it upon ordering--even if you say you like spicy, you should probably be clear that you like it really, extra spicy (not, you know, Midwestern American spicy). The Szechuan meatless chicken had a sort of black bean sauce with some jalapenos and came with a mix of vegetables. I found I liked the meatless chicken a lot better when it wasn't breaded and sauced into oblivion, though the texture is more like a firm tofu than \"meat.\" Though I was full, I kept snacking on the firm little cubes. The eggplant was soft, just like I like it, stir-fried with bell peppers and onions. \n\nI was satisfied with my meal, and similarly my curiosity about Wild Pepper is satisfied as well. Since I don't live in the neighborhood, I probably won't make an effort to go back--and I think Enjoy Vegetarian is better.  But it's a decent option for the Mission if you don't mind spending about $10 a person.  And with the complimentary tea, attentive service, and pleasant atmosphere, dining in is just as enjoyable as getting delivery.", "rating": 3, "date": "2011-08-07"}], "cumin tofu": [{"excerpts": ["The cumin tofu is delicious though, lots of veggies, and great spices. ", "My to go orders are always ready within 10 minutes which is nice. ", "I still recommend it for good cheap Chinese food."], "author": "Gaea W.", "review": "I'm a big fan and get take out from here often, and I would have given it 4-4 1/2 stars of flavor, but I just got a small rock in my brown rice which has put a damper on my star rating. The cumin tofu is delicious though, lots of veggies, and great spices. My to go orders are always ready within 10 minutes which is nice. I still recommend it for good cheap Chinese food.", "rating": 3, "date": "2009-09-12"}], "general tsao tofu": [{"excerpts": ["the general tsao tofu is my personal favorite and the free fried rice or lo mein with 2 dinner orders makes this place affordable."], "author": "brandon b.", "review": "prompt quick accurate delivery. the general tsao tofu is my personal favorite and the free fried rice or lo mein with 2 dinner orders makes this place affordable.", "rating": 3, "date": "2008-02-25"}], "black mushroom with baby bok choy": [{"excerpts": ["The other food, Black Mushroom with Baby Bok Choy and Wild Pepper Chicken, was also ok, but not great.  ", "Left me in need of a lot of liquids to quench the thirst."], "author": "I m.", "review": "Very fast delivery, so was happy about that.\nOrdered Hot and Sour soup, but got wonton instead.  It was ok, but either very salty or full of msg.  Eating it made me very thirsty and my mouth tingle.   The other food, Black Mushroom with Baby Bok Choy and Wild Pepper Chicken, was also ok, but not great.  Left me in need of a lot of liquids to quench the thirst.", "rating": 2, "date": "2010-09-29"}], "string bean with tofu in garlic and salt": [], "dry sauteed string bean": [], "szechuan buddha": [{"excerpts": ["The Szechuan Buddha looks promising. ", "I see black fungus, tofu, green beans, broccoli and bean curd skin, among other stuff. ", "The sauce is okay ", ": The Szechuan Meatless chicken is exactly the same dish as the Szechuan Buddha, just with meatless chicken instead of bean curd skin and black fungus. ", "The mediocrity of this sauce is much more apparent now. ", "The meatless chicken has no real flavor so it tastes literally exactly like the Szechuan Buddha dish; the \"chicken\" adds nothing. "], "author": "Jay S.", "review": "4:15pm: Placed an order here a while ago. Guess I'll \"live Yelp\" my experience.\n\n4:45pm: Food arrived. It was $30. I gave the delivery guy $40 and he just turned around and started to walk away! Rude. I had to ask him for some change. Is that a thing, unilaterally deciding your own tip and walking away? Minus one star.\n\n4:47pm: The Szechuan Buddha looks promising. I see black fungus, tofu, green beans, broccoli and bean curd skin, among other stuff. The sauce is okay but I wouldn't call it \"spicy,\" as they have.\n\n4:49pm: The Szechuan Meatless chicken is exactly the same dish as the Szechuan Buddha, just with meatless chicken instead of bean curd skin and black fungus. The mediocrity of this sauce is much more apparent now. Definitely rolled the dice and lost on this one.\n\nThe meatless chicken pieces are small and lack the mouthfeel of better meatless chicken, like the kind they use at Crazy Pepper. The texture is spongier, too, which wouldn't be such a big deal if they weren't just soaking up more of this mediocre sauce.\n\n5:05pm: The Wild Pepper Noodle is just okay. Some might call these egg noodles mushy. \n\n5:07pm: Struggling to discern a meaningful difference between the flavor profiles of any of these dishes. The meatless chicken has no real flavor so it tastes literally exactly like the Szechuan Buddha dish; the \"chicken\" adds nothing. The Wild Pepper Noodle is super whatever.\n\n5:10pm: I enjoyed a potent spliff before this meal and still can't seem to eat more than a bowl and a half of it.\n\n5:14pm: Is my game done installing yet?\n\n5:14pm: *Pokes last piece of meatless chicken in the bowl*\n\n5:17pm: Ugh, wait what? That was just the setup process and now there's 2 hours left of install time?? *exits Final Fantasy: A Realm Reborn.* I can't deal with this shit. *starts Fallout 4.*\n\n5:19pm: Crap, there's still food in my bowl but I don't wanna eat it, which isn't like me at all. This was such a waste. I feel guilty now. I'll eat it for lunch tomorrow, promise.\n\n5:26pm: I feel like this meal was a metaphor for my relatively crappy 2015, bad decisions included, and now I'm sad. Will 2016 suck too? How did one crappy meal send me into a tailspin about the trajectory of my entire life? *inhales spliff* Was this meal so bad that it literally made me depressed? Fuck.", "rating": 2, "date": "2016-01-02"}, {"excerpts": ["The Szechuan Buddha and Mongolian soy  chicken were delicious! ", "Thanks to Alice for the wonderful service. ", "I dropped my fortune cookie and she replaced it, very kind. ", "The fortune is a very important experience when it comes to Chinese food. ", ";)"], "author": "Ania M.", "review": "The Szechuan Buddha and Mongolian soy  chicken were delicious! Thanks to Alice for the wonderful service. I dropped my fortune cookie and she replaced it, very kind. The fortune is a very important experience when it comes to Chinese food. ;)", "rating": 5, "date": "2014-03-17"}], "indian monk": [{"excerpts": [", the Hunan Eggplant is pretty good and if you feel like curry, the Indian Monk is a yellow curry with veggies and Chinese mushrooms.\n\n"], "author": "Jenn S.", "review": "Me and my girlfriend's FAVE Chinese food spot!\n\nWe're vegan and love how accommodating this restaurant is to us. We come so much the staff knows us and they are always super friendly.The food is delicious and we've brought tons of friends and family here and they all love it.\n\nWe always get General Tsao's Meatless Chicken. That is our ultimate favorite.  A little spicy, a little sweet, perfectly delicious every time. It's a Must Get! Even the meat eaters love it. \n\nFor veggies, we get the Dry Sauteed String Beans (yum!), the Hunan Eggplant is pretty good and if you feel like curry, the Indian Monk is a yellow curry with veggies and Chinese mushrooms.\n\nBut, everything is yummy and consistent. We've also had Kung Pao Meatless Chicken, Dry Braised Meatless Chicken, Salt and Pepper Meatless Chicken, Five Flavor Meatless Chicken (similar to General Tsao's but get General Tsaos!), Veggie Chow Fun, Jalapeño Fried Rice (no egg) and prob tons more I cant remember.\n\nIf you're feeling meatless chicken is too heavy, they have a section called Health Food Section where its your choice of different steamed veggies, your choice of a protein and you can pick your sauce.", "rating": 5, "date": "2014-08-27"}], "pressed flavored tofu with bamboo tofu": [], "shang hai tofu": [], "double mushroom with chop sui": [], "wild pepper eggplant": [], "walnut asparagus": [], "chinese broccoli with ginger sauce": [], "authentic mapo tofu": [{"excerpts": ["\"authentic mapo tofu\" (to be honest ", "I don't know what is/nt authentic "], "author": "Katies F.", "review": "I think I like this better than Eric's on Church, but seeing as I live across the street from E's, I'll probably be there before Wild Pepper out of sheer laziness.\n\nWent with 5 other people at 7pm on a Saturday - no wait. We ordered:\n\nWild Pepper Beef (pretty good)\nSalt and pepper fish (surprisingly good)\nHong kong style crispy noodles with chicken (I could take it or leave it)\nSizzling rice soup (liked it)\nMixed veggies (pretty standard)\nBrown rice (it was listed on the menu as $1.00 and white rice was $1.25 or something like that. They charged us the same as white rice, but only for 4 people...so we did not complain).\n\"authentic mapo tofu\" (to be honest I don't know what is/nt authentic but I only thought this was okay)\n\nTotal, pre-tip, post tax: $58.50 - for 6 really full people! \n\nThe only things I didn't like was that they don't appear to serve anything but water and tea (or at least it was not on the menu), and I really wanted a coke. Also, the waitstaff was busy serving everyone else, or so it seemed. We asked for chili since it wasn't on the table, and it didn't come till we had finished the soup. Rice did not appear with the mapo tofu, had to wait till another dish came out first. And I had a hard time flagging someone down for the bill - while we were not rushing through the meal, we did have someplace to be afterwards and needed to get going!\n\nOverall, not perfect, and not the best Chinese food ever, but pretty good for your $$ and the area. I'll be back sometime to try the dim sum.", "rating": 3, "date": "2010-09-20"}], "wild pepper meatless chicken": [{"excerpts": ["We ordered a hot and sour soup, vegetable delight, and the Wild Pepper meatless chicken (after reading numerous positive reviews of it).\n\n"], "author": "Nick G.", "review": "We were looking for some inexpensive Chinese that took credit card and was open late.  Wild Pepper fit the bill.   We ordered a hot and sour soup, vegetable delight, and the Wild Pepper meatless chicken (after reading numerous positive reviews of it).\n\nOverall it was decent and hit the spot at the time.  The hot and sour soup was good.  Nicely spicy and not too salty.  The vegetable delight was great, nicely sauteed vegetables, nice and light.  The Wild Pepper chicken was okay, a little salty and greasy, not bad but I think I would just order normal chicken next time. \n\nMet the requirements.  Fast and hot delivery.  Thanks guys!", "rating": 3, "date": "2014-08-20"}, {"excerpts": ["My favorite dishes are Wild Pepper meatless chicken, tomato beef chow fun, vegetable wonton soup, avocado spring rolls, ", "onion pancakes (their peanut sauce is thicker and tastes much better than creamy peanut sauce), and green tea ice cream for dessert. "], "author": "Allen S.", "review": "This is one of the best restaurants in San Francisco. My rating is going to be based on four categories. Food, service, atmosphere and price. \n\nThe ingredients here taste like they were picked from a garden in the back of the restaurant. Everything is fresh as can be and the mix of flavors are some of the tastiest I've ever experienced. I like eating plant based food and Wild Pepper has textured, flavored, soy that they call meatless chicken. It is FANTASTIC!!! My favorite dishes are Wild Pepper meatless chicken, tomato beef chow fun, vegetable wonton soup, avocado spring rolls, onion pancakes (their peanut sauce is thicker and tastes much better than creamy peanut sauce), and green tea ice cream for dessert. Try the General Tsao, Broccoli beef, Kung Pao and Vegetarian Delight entrées as well. \n\nI always tip 25% here because the service is constantly superb. Ming, the creator and owner, puts his heart and soul into this business. It's easy to tell his culinary experience by the quality and diversity of Chinese cuisine he serves plus his management experience is evident in how well the restaurant operations are run. The staff is extremely friendly and kind, always helping before I ask for assistance and listening to everything I and my friends ask for. John and Alice specifically do an exceptional job keeping me happy and expressing interest in friendship with me, which makes me very happy. The chefs always do an exceptional job listening to even the smallest of details to ensure customer satisfaction which always makes people happy knowing they are being taken great care of. \n\nThe ambiance here just perfectly brings me into Chinese culture, even though I'm in the Mission district of San Francisco. They have soft cultural music playing, historic decorations on the walls and on the floors and an exceptionally clean venue. They incorporate plants into their ambiance as well which I love because it brings a more natural feel. \n\nThe appetizers are priced around $5 and the entrées around $10 which are extremely reasonable because the portions are HUGE!! I am a big man who eats a lot of food and I can barely finish one $10 entrée which turns into a second meal later in the day or the next day, so I end up paying $10 for two delicious meals which I love doing!! In terms of San Francisco prices, this is an absolute jem because normally I would be expecting to pay closer to $15-$20 for the same entrées. \n\nAll in all, I hope my review has better helped you understand why Wild Pepper is a must dine in San Francisco. The combination of high quality food, phenomenal service and ambiance as well as great price is difficult to find in San Francisco and Wild Pepper does them all and more. Thank you for reading and I hope to hear about your experience at Wild Pepper soon! :)", "rating": 5, "date": "2015-06-16"}], "szechuan meatless chicken": [{"excerpts": [": The Szechuan Meatless chicken is exactly the same dish as the Szechuan Buddha, just with meatless chicken instead of bean curd skin and black fungus. ", "The mediocrity of this sauce is much more apparent now. "], "author": "Jay S.", "review": "4:15pm: Placed an order here a while ago. Guess I'll \"live Yelp\" my experience.\n\n4:45pm: Food arrived. It was $30. I gave the delivery guy $40 and he just turned around and started to walk away! Rude. I had to ask him for some change. Is that a thing, unilaterally deciding your own tip and walking away? Minus one star.\n\n4:47pm: The Szechuan Buddha looks promising. I see black fungus, tofu, green beans, broccoli and bean curd skin, among other stuff. The sauce is okay but I wouldn't call it \"spicy,\" as they have.\n\n4:49pm: The Szechuan Meatless chicken is exactly the same dish as the Szechuan Buddha, just with meatless chicken instead of bean curd skin and black fungus. The mediocrity of this sauce is much more apparent now. Definitely rolled the dice and lost on this one.\n\nThe meatless chicken pieces are small and lack the mouthfeel of better meatless chicken, like the kind they use at Crazy Pepper. The texture is spongier, too, which wouldn't be such a big deal if they weren't just soaking up more of this mediocre sauce.\n\n5:05pm: The Wild Pepper Noodle is just okay. Some might call these egg noodles mushy. \n\n5:07pm: Struggling to discern a meaningful difference between the flavor profiles of any of these dishes. The meatless chicken has no real flavor so it tastes literally exactly like the Szechuan Buddha dish; the \"chicken\" adds nothing. The Wild Pepper Noodle is super whatever.\n\n5:10pm: I enjoyed a potent spliff before this meal and still can't seem to eat more than a bowl and a half of it.\n\n5:14pm: Is my game done installing yet?\n\n5:14pm: *Pokes last piece of meatless chicken in the bowl*\n\n5:17pm: Ugh, wait what? That was just the setup process and now there's 2 hours left of install time?? *exits Final Fantasy: A Realm Reborn.* I can't deal with this shit. *starts Fallout 4.*\n\n5:19pm: Crap, there's still food in my bowl but I don't wanna eat it, which isn't like me at all. This was such a waste. I feel guilty now. I'll eat it for lunch tomorrow, promise.\n\n5:26pm: I feel like this meal was a metaphor for my relatively crappy 2015, bad decisions included, and now I'm sad. Will 2016 suck too? How did one crappy meal send me into a tailspin about the trajectory of my entire life? *inhales spliff* Was this meal so bad that it literally made me depressed? Fuck.", "rating": 2, "date": "2016-01-02"}, {"excerpts": ["The Szechuan meatless chicken had a sort of black bean sauce with some jalapenos and came with a mix of vegetables. ", "I found I liked the meatless chicken a lot better when it wasn't breaded and sauced into oblivion, though the texture is more like a firm tofu than \"meat.", "\" ", "Though I was full, I kept snacking on the firm little cubes. "], "author": "Tamara F.", "review": "I've lived in the Mission temporarily for a number of weeks over the past year, and as a vegan who typically enjoys spicy Asian food, I've been drawn to Wild Pepper twice, even though it's not the healthiest, and I'm not a big fan of fake meat, anyway.\n\nIn general, they leave a good impression.  The owner, though possibly a little brusque at first, is genuinely kind, and concerned about the enjoyment of your meal. Though a little oily, the veggies are not overcooked, and the portions are certainly generous. \n\nI find it a bit annoying when Yelpers give a restaurant a horrible rating based on the timeliness of the delivery alone. That isn't very helpful to readers who are interested in the quality of the food, and not just whether the meal will be brought to their doorstep promptly.  The first time I ate Wild Pepper I did order delivery -- and was not that happy with the food, mostly because I ordered General Tso's, or maybe Sesame, meatless chicken, against my better judgement, and it is basically a pile of deep fried breaded-ness.  I also ordered the soft tofu and green onion salad and similarly, it was exactly what you would expect, and not very impressive.\n\nThis time around I ate at the restaurant, and purposefully ordered way too much food so I could try a few things and have leftovers for later.  Worried that every meatless chicken dish would be like the first, but just with different sauce, I asked the owner / waiter if it was always fried, and he said I could order any of the meatless chicken dishes not fried.  I went for Szechuan since I like spicy and it seemed popular from the reviews.  I also ordered Hunan Eggplant and the Monk's Garden Soup. I had heard the Monk's Soup came with \"vegetable balls\" so I checked to make sure there was no egg and was reassured a couple times that it was vegan (in a respectful, not obnoxious way).\n\nThe soup could easily be a meal for one in itself. I thought the broth was a bit bland but the veggies were good and the vegetable balls were dangerously addictive.  The balls aren't necessarily eaten in the soup; they come on the side and are nice and crispy on their own (and there's a lot of them!). They were sort of like little Chinese pakoras.\n\nThe eggplant and \"chicken\" came out a bit later.  I was too full to eat much of them, but found them pretty good, but maybe because I didn't have very high expectations. I did think the sauces were a little similar and not nearly as spicy as I would have liked.  If you like spicy, emphasize it upon ordering--even if you say you like spicy, you should probably be clear that you like it really, extra spicy (not, you know, Midwestern American spicy). The Szechuan meatless chicken had a sort of black bean sauce with some jalapenos and came with a mix of vegetables. I found I liked the meatless chicken a lot better when it wasn't breaded and sauced into oblivion, though the texture is more like a firm tofu than \"meat.\" Though I was full, I kept snacking on the firm little cubes. The eggplant was soft, just like I like it, stir-fried with bell peppers and onions. \n\nI was satisfied with my meal, and similarly my curiosity about Wild Pepper is satisfied as well. Since I don't live in the neighborhood, I probably won't make an effort to go back--and I think Enjoy Vegetarian is better.  But it's a decent option for the Mission if you don't mind spending about $10 a person.  And with the complimentary tea, attentive service, and pleasant atmosphere, dining in is just as enjoyable as getting delivery.", "rating": 3, "date": "2011-08-07"}], "general tsao meatless chicken": [{"excerpts": ["Order General Tsao Meatless Chicken and Vegetarian Mu-Shu.  ", "You can try all the other variations, but why?  "], "author": "John S.", "review": "Sometimes having good intuition is bad.  I used to order delivery so often that I got way too good at figuring out what the best veggie items on a given menu were.  I would order one (or two if I hadn't reached the delivery minimum); it would arrive; I would eat it; it would be delicious; I would write a rave review.\n\nSimple, right?\n\nExcept that I would tell myself that I needed to try different things, so after ordering the same item or two four times, I would change it up.  And it wouldn't be as good.  The next time, I would change it up again with different change-ups, and they wouldn't be as good as those first times.  Convinced that I had simply put too much faith in the accuracy of my memory, I would reorder the original favorites, and guess what?  They would be excellent.\n\nAnd that, my friends, is exactly what Wild Pepper is all about.  Don't waste your time trying different stuff.  Order General Tsao Meatless Chicken and Vegetarian Mu-Shu.  You can try all the other variations, but why?  I've already done all this work for you.\n\nIf you must experiment, avoid Vegetarian Delight (boring and bland) and Sweet & Sour Meatless Chicken (way too much like everything from King Dong in Berkeley).  Everything else is OK.  The delivery is quick, and their delivery area is ridiculously vast.", "rating": 4, "date": "2011-12-24"}, {"excerpts": ["their general tsao meatless chicken is even better. "], "author": "Andie P.", "review": "I'M SUCHA FAN! i too dream about their meatless chicken! deep fried deliciousness.\n\ni've tried their orange meatless chicken - which has an amazing sweet-savory sauce and they actually throw in shaved orange rinds to enhance the flavor. yum. their general tsao meatless chicken is even better. amazing sauce!\n\nreally bummed they don't deliver to my NOPA 'hood. so instead i hit up Big Lantern if i want chinese delivery to my area...not AS good but still tastey w/ vegetarian options.", "rating": 5, "date": "2010-11-12"}], "dry braised meatless chicken": [{"excerpts": ["We've also had Kung Pao Meatless Chicken, Dry Braised Meatless Chicken, Salt and Pepper Meatless Chicken, "], "author": "Jenn S.", "review": "Me and my girlfriend's FAVE Chinese food spot!\n\nWe're vegan and love how accommodating this restaurant is to us. We come so much the staff knows us and they are always super friendly.The food is delicious and we've brought tons of friends and family here and they all love it.\n\nWe always get General Tsao's Meatless Chicken. That is our ultimate favorite.  A little spicy, a little sweet, perfectly delicious every time. It's a Must Get! Even the meat eaters love it. \n\nFor veggies, we get the Dry Sauteed String Beans (yum!), the Hunan Eggplant is pretty good and if you feel like curry, the Indian Monk is a yellow curry with veggies and Chinese mushrooms.\n\nBut, everything is yummy and consistent. We've also had Kung Pao Meatless Chicken, Dry Braised Meatless Chicken, Salt and Pepper Meatless Chicken, Five Flavor Meatless Chicken (similar to General Tsao's but get General Tsaos!), Veggie Chow Fun, Jalapeño Fried Rice (no egg) and prob tons more I cant remember.\n\nIf you're feeling meatless chicken is too heavy, they have a section called Health Food Section where its your choice of different steamed veggies, your choice of a protein and you can pick your sauce.", "rating": 5, "date": "2014-08-27"}], "flavor meatless chicken": [{"excerpts": ["Five Flavor Meatless Chicken (similar to General Tsao's but get General Tsaos!), Veggie Chow Fun, Jalapeño Fried Rice (no egg) and "], "author": "Jenn S.", "review": "Me and my girlfriend's FAVE Chinese food spot!\n\nWe're vegan and love how accommodating this restaurant is to us. We come so much the staff knows us and they are always super friendly.The food is delicious and we've brought tons of friends and family here and they all love it.\n\nWe always get General Tsao's Meatless Chicken. That is our ultimate favorite.  A little spicy, a little sweet, perfectly delicious every time. It's a Must Get! Even the meat eaters love it. \n\nFor veggies, we get the Dry Sauteed String Beans (yum!), the Hunan Eggplant is pretty good and if you feel like curry, the Indian Monk is a yellow curry with veggies and Chinese mushrooms.\n\nBut, everything is yummy and consistent. We've also had Kung Pao Meatless Chicken, Dry Braised Meatless Chicken, Salt and Pepper Meatless Chicken, Five Flavor Meatless Chicken (similar to General Tsao's but get General Tsaos!), Veggie Chow Fun, Jalapeño Fried Rice (no egg) and prob tons more I cant remember.\n\nIf you're feeling meatless chicken is too heavy, they have a section called Health Food Section where its your choice of different steamed veggies, your choice of a protein and you can pick your sauce.", "rating": 5, "date": "2014-08-27"}, {"excerpts": ["Flavor Meatless Chicken (VERY tasty)\n\n"], "author": "Mike N.", "review": "Joined our vegan friends for dinner and had a fantastic time. Prompt, attentive service. Food prepared super fast and came out at a steady (not too fast) pace.\n\nWe enjoyed a family style dinner, which was more than enough to eat among our party of seven.\n\nMust try:\n-Dry Braised Meatless Chicken (SUPER yummy)\n-Five Flavor Meatless Chicken (VERY tasty)\n\nNot so much:\n-Wild Pepper Spicy Noodles (bland and boring)\n\nBrown rice comes out until you can't eat anymore, which was great, considering we had a bunch of dishes among the table.\n\nAlthough we didn't get to try any of their soup dishes, I glimpsed around the restaurant and saw many tables with a soup dish of some sort. Maybe everyone's on to something?\n\nWho knew a vegan dinner would be as delicious as it was!", "rating": 4, "date": "2013-08-28"}, {"excerpts": ["I love the five flavor meatless chicken so much that I think I singlehandedly made it one of the restaurant's most popular items on delivery.com. ", "It's like crack. ", "I've ordered it three times in one week, and that's six meals at least, because the portions are very generous. ", "Delivery is always very very fast. ", "Sometimes TOO fast - one night about 10-15 minutes after I had placed my order, my dog was barking and I was trying to get her to shut up, but ", "it was because the delivery guy was there already! ", "Poor guy was waiting by the door for awhile since I didn't think it was possible he could be there already and hadn't heard the knock over the barking. ", "Oh yeah, "], "author": "K. E.", "review": "I've never visited the actual location, but this is my favorite delivery, bar none. \n\nThe food from here is so yummy! There are tons of tofu and meatless chicken dishes for vegetarians like me. I love the five flavor meatless chicken so much that I think I singlehandedly made it one of the restaurant's most popular items on delivery.com. It's like crack. I've ordered it three times in one week, and that's six meals at least, because the portions are very generous. Delivery is always very very fast. Sometimes TOO fast - one night about 10-15 minutes after I had placed my order, my dog was barking and I was trying to get her to shut up, but it was because the delivery guy was there already! Poor guy was waiting by the door for awhile since I didn't think it was possible he could be there already and hadn't heard the knock over the barking. Oh yeah, and they have brown rice!\n\nMMM I think I'm about to order from here right now, in fact!", "rating": 5, "date": "2010-11-20"}], "lemon grass meatless chicken": [], "sesame beef": [{"excerpts": ["The sesame beef was very tough and too sweet. ", "The Chow Fun wasn't made with rice noodles, they actually looked like wheat chow mein noodles."], "author": "Rebecca J.", "review": "This place used to be much better. The hot and sour soup is still good, but most of the other stuff is not as good as it used to be. I ordered some food tonight and, while it arrived really quickly, the overall quality of the food was not good. The sesame beef was very tough and too sweet. The Chow Fun wasn't made with rice noodles, they actually looked like wheat chow mein noodles.", "rating": 2, "date": "2015-10-23"}, {"excerpts": ["I had orange chicken, general tso's chicken, sweet and sour chicken, and sesame beef. ", "These were all great! ", "The sauce isn't overwhelmingly thick or in excess. ", "The pork fried rice is great as well. ", "This is high quality take-out."], "author": "Ryan H.", "review": "Fantastic take-out! I had this twice while I was out this past trip. I had orange chicken, general tso's chicken, sweet and sour chicken, and sesame beef. These were all great! The sauce isn't overwhelmingly thick or in excess. The pork fried rice is great as well. This is high quality take-out.", "rating": 5, "date": "2013-10-04"}, {"excerpts": ["Take-out  has always been adequate and reliable, but my two favorites  -  General Tsao's chicken and sesame beef are so much tastier when eaten in the restaurant.  ", "All the yummy "], "author": "Becca V.", "review": "I've been getting delivery from Wild Pepper for a couple of years, but tonight was the first time I got the opportunity to eat at the restaurant.  Take-out  has always been adequate and reliable, but my two favorites  -  General Tsao's chicken and sesame beef are so much tastier when eaten in the restaurant.  All the yummy oh-so-bad-for-you crispiness of the fried dishes are somewhat lost in translation when delivery is involved.\n\nThe service is somewhat marginal (this place does a ton of take-out and delivery, so the phone is always ringing)  but your order comes out quickly.  And, of course, you get the fried rice or chow mein free when you order two entrees.\n\nHooray for fried food.", "rating": 4, "date": "2009-01-18"}, {"excerpts": ["The sesame beef, crab rangoon and string bean chicken are good, the Wild Pepper chicken special was drowning in too many vegetables.  ", "Overall, a good option for take out, especially with the free chow mein or fried rice with 2 entrees as a nice bonus!"], "author": "Rochelle J.", "review": "Like many, I've never been to the restaurant, just gotten delivery, but they are lightning fast!  I usually have my food within 20 minutes.  The sesame beef, crab rangoon and string bean chicken are good, the Wild Pepper chicken special was drowning in too many vegetables.  Overall, a good option for take out, especially with the free chow mein or fried rice with 2 entrees as a nice bonus!", "rating": 4, "date": "2008-10-07"}], "hunan hot pepper beef": [{"excerpts": ["I also ordered their Hunan hot pepper beef, but they mistakenly made it with pork.  ", "When I told them I ordered beef, they were apologetic and immediately rushed to correct my order; however, I was starving and so went with the pork.  "], "author": "Nate B.", "review": "Food: 4\nService: 3+\n\nThis is a very good, affordable option for Chinese in the south Mission.  Their egg drop tomato soup is divinely silky and has just the right amount of spice.  I also ordered their Hunan hot pepper beef, but they mistakenly made it with pork.  When I told them I ordered beef, they were apologetic and immediately rushed to correct my order; however, I was starving and so went with the pork.  I would have preferred a bit more heat to the spices - which I'll indicate next time I order - but this was another very strong dish.\n\nOh yeah, their portions are huge.  The soup and pork, with steamed rice, lasted me for two and a half meals!\n\n(I have only had takeout here once, so consider this to be a preliminary review.  I definitely plan on returning and will update this review then.)", "rating": 4, "date": "2006-05-13"}], "lamb with green onion": [], "satay beef in sizzling plate": [], "cow on the snow": [], "hunan hot pepper pork": [], "shredded pork with garlic sauce": [], "dry braised crispy pork": [], "ants on the tree": [], "salt and pepper spareribs": [], "double mushroom and shredded pork": [], "peking style pork chop": [], "string bean with tofu in garlic and salt lunch special": [], "dry sauteed string bean lunch special": [], "szechuan buddha lunch special": [], "cumin beef lunch special": [], "broccoli beef lunch special": [], "beef with chinese broccoli lunch special": [], "hunan hot pepper pork lunch special": [], "black forest pork lunch special": [], "twice cooked pork lunch special": [], "dry braised crispy pork lunch special": [], "shredded pork with garlic sauce lunch special": [], "wild pepper chicken lunch special": [], "wild pepper tofu lunch special": [], "tofu with beef lunch special": [], "szechuan chicken lunch special": [], "chicken with vegetable lunch special": [], "orange chicken lunch special": [], "kung pao tofu lunch special": [], "general tsao chicken lunch special": [], "general tsao tofu lunch special": [], "prawns with tofu in lobster sauce lunch special": [], "calamari with black bean sauce lunch special": [], "prawns with vegetable lunch special": [], "wild pepper meatless chicken lunch special": [], "general tsao meatless chicken lunch special": [], "curry meatless chicken lunch special": [], "crispy chicken lunch special": [], "salt and pepper pork chop lunch special": [], "slice of cheesecake": []}