{"fried meat dumping": [], "shrimp gow": [{"excerpts": ["All of these for $6 (ONLY)\n2 shrimp gow: sticky and chewy and soft in the most delicious way. ", "There's one huge shrimp in each piece which is great!\n", "1 sesame ball: sticky and chewy and not too sweet, which is a plus. ", "There's plenty of red bean paste in there. ", "The sesame gives it an aromatic smell. \n", "1 congee: what a great congee! ", "Not bland and not too intense. ", "This will be great for when you're sick or just want something mellow to eat for breakfast. ", "A whole tub is only $3.50 with pieces of meat and 1,000 years egg in it. ", "Love it so much! \n"], "author": "Yuan Z.", "review": "All of these for $6 (ONLY)\n2 shrimp gow: sticky and chewy and soft in the most delicious way. There's one huge shrimp in each piece which is great!\n1 sesame ball: sticky and chewy and not too sweet, which is a plus. There's plenty of red bean paste in there. The sesame gives it an aromatic smell. \n1 congee: what a great congee! Not bland and not too intense. This will be great for when you're sick or just want something mellow to eat for breakfast. A whole tub is only $3.50 with pieces of meat and 1,000 years egg in it. Love it so much! \nThere are a handful of seatings inside the store so you can enjoy your food then and there!\n\nTotally going to come back.", "rating": 5, "date": "2018-10-01"}, {"excerpts": ["Tried boiled leek shrimp gow and would say it was pretty good. ", "The price was also low which was the best part. ", "I guess it is shrimp with spring onions and the covering is of refined flour."], "author": "Sharad B.", "review": "Was stralling nearby when this bakery caught my eye. Tried boiled leek shrimp gow and would say it was pretty good. The price was also low which was the best part. I guess it is shrimp with spring onions and the covering is of refined flour.", "rating": 4, "date": "2018-06-17"}, {"excerpts": ["The shrimp gow and shumai were really good.  "], "author": "Matthew G.", "review": "We were in the area and thought about checking this place out.  The shrimp gow and shumai were really good.  We also tried the baked and steam bbq pork bun.  The food was good and the service was fast.", "rating": 5, "date": "2018-10-02"}, {"excerpts": ["You get 3 shrimp gow for $2.30. ", "You can't beat that cause the fancy dim sum places are double the price. ", "I love the local feel and food is still amazing till this day. ", "The aroma of this place still has the nostalgic feeling when I was just a kid walking down the streets with my Lola and the lingering freshness before we entered is bittersweet. ", "Service still has genuine people who still care about there customers. ", "I will definitely still come back for my dim sum craving!"], "author": "Amanda E.", "review": "One of the freshest dim sum on Clemente St and it's so affordable. You get 3 shrimp gow for $2.30. You can't beat that cause the fancy dim sum places are double the price. I love the local feel and food is still amazing till this day. The aroma of this place still has the nostalgic feeling when I was just a kid walking down the streets with my Lola and the lingering freshness before we entered is bittersweet. Service still has genuine people who still care about there customers. I will definitely still come back for my dim sum craving!", "rating": 5, "date": "2017-06-26"}, {"excerpts": ["I like the shrimp gow. ", "Cash only."], "author": "Hit And Run P.", "review": "This is my favorite Dim Sum on clement. There's lots of options, and I know everyone has their favorites, but this is mine because they are consistently good and still a great price. Been coming her for at least a decade. I like the shrimp gow. Cash only.", "rating": 5, "date": "2018-08-15"}, {"excerpts": ["We usually go for the shrimp gow, shrimp and leek gow, pork shumai, potstickers, and 2 custard buns. ", "We also went halfsies on a pork bun, which was filled with sweet pork. ", "All pretty tasty. "], "author": "Rachelle Y.", "review": "It was only fitting to celebrate the Chinese New Year with some dim sum! My boyfriend and I decided to try a new spot, opposed to our go-to Good Luck Dim Sum down the block. Even though we decided to try a new place, we still ended up ordering the same things. New year, same order. The 3 for $2.20 deal is a steal! We usually go for the shrimp gow, shrimp and leek gow, pork shumai, potstickers, and 2 custard buns. We also went halfsies on a pork bun, which was filled with sweet pork. All pretty tasty. You can expect to spend less than $15 to feed 2 starving people. \n\nI like how this place is cleaner than most restaurants on this block. Also has lots of tables to sit, which is good for larger groups. Overall, a good pick for some cheap authentic dim sum. Gung hay fat choy!", "rating": 5, "date": "2017-01-29"}, {"excerpts": ["- Leek-shrimp gow barely had any shrimp with bluntly cooked leeks.\n", "- Pork shui mai was too bland with hard meaty chunks\n- Steamed bao was also huge, but the pork filling was oddly saucy."], "author": "Brian U.", "review": "Most of the food was low on flavor, but also wasn't that salty or greasy. From best to worse:\n- Baked bao was huge and evenly filled with lots of meat and good outside color.\n- Fried taro had an enjoyable filling inside the mashed taro and a fun crispy fried exterior, but was a little throat scratchy.\n- Leek-shrimp gow barely had any shrimp with bluntly cooked leeks.\n- Pork shui mai was too bland with hard meaty chunks\n- Steamed bao was also huge, but the pork filling was oddly saucy.", "rating": 3, "date": "2016-07-11"}, {"excerpts": ["Shrimp Gow ", "\"aka\" Har Gow (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=wOHusAFk0IJyootF2tx1EA) - ", "You get at least two baby shrimp in each along with some finely chopped bamboo shoot, and some gritty tapioca starch encased in a rather thick steamed rice flour skin that is super rubbery.  ", "Sara and I actually played catch with one, and it was so rubbery it didn't break open.  "], "author": "Wilhelm Y.", "review": "Wing Lee continues to be my favorite dim sum spot along Clement Street.  Granted, I haven't tried every single dim sum shop along Clement Street, but among the ones I have tried in that area (Good Luck Dim Sum, Gourmet Dim Sum & Clement Restaurant) Wing Lee stands out as the one restaurant that uses the least MSG.  That's good news for someone like me who is sensitive to MSG or high sodium levels.\n\nLike most dim sum places I have my likes and dislikes.  You will never, ever see me eating turnip cakes, leek dumplings, beef siu mais or beef rice rolls at any dim sum shop regardless of how good they are.  I don't like the taste of them, and I definitely don't like the look of them.\n\nAs my friend Sara A and I embarked on a six day great outdoors trip this would be the only restaurant food purchase of our entire trip.  Everything except for the shrimp gows were exceptional, and through the magic of words and pictures here is where my review begins.  One other thing, what I refer to the pastries as may not be what the restaurant refers to them as.\n\nChicken Siu Mai (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=3iTDI7x3FT6o4yuJ7WCuSw) - It's everything you love about your pork siu mais, but ground chicken thigh meat is used instead of the pork.  The filling seems pretty simple with ground chicken, finely chopped mushrooms and carrots that are wrapped in a thin flour wrapper and steamed.  These were very well seasoned and I could not detect any MSG.\n\nShrimp Gow \"aka\" Har Gow (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=wOHusAFk0IJyootF2tx1EA) - You get at least two baby shrimp in each along with some finely chopped bamboo shoot, and some gritty tapioca starch encased in a rather thick steamed rice flour skin that is super rubbery.  Sara and I actually played catch with one, and it was so rubbery it didn't break open.  These were okay, but I definitely detected some MSG inside the filling.\n\nFun Gor or Steamed Pork Dumpling (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=VkDFwAVV3MgUDwC7k-rh4w) - The filling is very well compacted and had good flavor.  The rice flour skin was also on the thick side, but aside from the ones my mom used to make I've come to expect thick skins on fun gors.  The filling consisted of minced pork, shrimp bits, mushrooms, carrots, bamboo shoots, green onion and cilantro.  All were chopped finely.  No MSG taste.\n\nSweet Rice Cake (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=96VVquk3h_uoAi1i-qV1qg) - These are a personal favorite of mine.  Pretty simple too.  It's a ball of sweet glutinous rice (sticky rice) flavored with minced green onion and bits of BBQ pork and wrapped inside a super thin rice flour membrane.  These pastries appear small but just a few will fill you up because the rice is packed so firmly.  Here is how it looks on the inside (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=80EgwX6Zdg9u79wABfmtHw).\n\nBean Curd Rolls (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=xho1Q8i5AVXQsn1fJmkLxw) - We had to try these because we had never seen them offered here before.  These are a good vegetarian option to the meat filled rice rolls and very tasty.  The filling consisted of thin glass noodles, chopped shiitake mushrooms, strips of carrot and strips of wood ear wrapped in hydrated dried bean curd and steamed.  They're served with soy sauce and chopped green onion.  We both agreed that these were delicious for a dish containing no meat.  Here's the shot of the filling (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=aCOYiEaIWv7T3HWTqRR8Pg).\n\nChicken Combination Bun (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=8FD0AwItk92djvd1YaikXA) - My dad and I love Wing Lee's chicken combination buns.  As you can see from the photo there is tender, juicy chicken thigh meat with green onions, a part of a hard boiled egg, a whole shiitake mushroom and a piece of Chinese sausage inside the steamed sweet bun.  Best of all ... no MSG taste.\n\nThe ladies here are cool and all are very much trilingual (Cantonese, Mandarin, English).  If they can understand my Chinglish they can understand anyone.", "rating": 4, "date": "2009-03-30"}, {"excerpts": ["Great Shrimp Gow, Pork Sew Mai, and Pot Stickers! ", "Dinner for under $5? "], "author": "Addadada A.", "review": "WOW! When I want to make my mom REALLY happy...I bring her home her fave DIM SUM from WING LEE BAKERY! \n\nAt 3 for $1.50 how can one go wrong! Great Shrimp Gow, Pork Sew Mai, and Pot Stickers! Dinner for under $5? WOW!\n\nEasy to point if the language barrier gets in the way...\n\nTO GO is the best option. (NOT a sit-down type of place...)", "rating": 4, "date": "2010-02-24"}, {"excerpts": ["The shrimp gow are especially good. \n\n"], "author": "Ryan A.", "review": "I'm not sure, but I think the prices are going up. It used to seem absurdly cheap, but now it's just cheap.\n\nI think this place offeres the freshest dim sum on upper Clement st. The shrimp gow are especially good. \n\nIf you order not to go, they give you your stuff on a metal plate which is kind of cool.", "rating": 4, "date": "2006-06-24"}, {"excerpts": ["Went in for lunch and grabbed three shrimp gow and 3 of the hugest pork ", "sew mai ", "I've ever seen for $3.  ", "Couldn't be happier."], "author": "Asha H.", "review": "I now live seven blocks away and damn happy about it.  Went in for lunch and grabbed three shrimp gow and 3 of the hugest pork sew mai I've ever seen for $3.  Couldn't be happier.", "rating": 5, "date": "2009-01-11"}, {"excerpts": ["I would recommend the baked pork bun and the shrimp gow (if its freshly made, mornings are best)."], "author": "Shannon A.", "review": "I usually stop by here during a day of shopping on Clement and its pretty good for what you pay. But since I've moved to the area I've gone a couple of times and noticed how rude the staff are. I don't know if its because I'm not Chinese and I don't know what everything is called, but it sucks either way. \n\nI went this morning to pick up a nice breakfast and I knew that I was going to order a lot so I asked for a to-go box. I saw that the woman in front of me was offered a box so I didn't think it would be a problem. Instead, the server looked at me like I was an idiot and threw all of my food into a plastic bag, which was exactly what I was trying to avoid. \n\nThe experience wasn't all bad but unfortunately, the quality of service tainted my whole breakfast. I would recommend the baked pork bun and the shrimp gow (if its freshly made, mornings are best).", "rating": 2, "date": "2009-02-28"}, {"excerpts": ["We usually always order the Chicken Siumei and the shrimp gow which is 3 for $1.40. ", "The siumei is huge and does not have shrimp in it (since I dont eat shrimp but my boyfriend does!) ", "They also have beef noodle rolls here for only $2! \n", "The dim sum here is good and prices are not bad. ", "Make sure you get here before dinner time or else ", "they may be out of what you are looking for!"], "author": "Miss H K.", "review": "My boyfriend and I love coming here for dim sum. We usually always order the Chicken Siumei and the shrimp gow which is 3 for $1.40. The siumei is huge and does not have shrimp in it (since I dont eat shrimp but my boyfriend does!) They also have beef noodle rolls here for only $2! \nThe dim sum here is good and prices are not bad. Make sure you get here before dinner time or else they may be out of what you are looking for!", "rating": 5, "date": "2007-03-17"}, {"excerpts": ["The shrimp gow was better, and I liked it. "], "author": "Tina S.", "review": "I read a lot of positive reviews about this place and saw where it ranked on citysearch and I was totally shocked by the low quality of some of the dim sum I bought there: not at all correspondent with the place's reputation. I got the fried taro dumpling: it was still freezing in the center, almost frozen.  The shrimp leek gow did NOT taste good -- it was very fishy and tasted off.  The shrimp gow was better, and I liked it. The char sui bao (steamed bbq pork bun) was good, although the ratio of dough to pork was definitely weighted towards the dough --  the dough was of excellent consistency, though, and taste. Overall, disappointed -- although it is cheap, I still expect quality b/c it ain't THAT cheap.", "rating": 2, "date": "2009-01-01"}], "coriander gow": [{"excerpts": ["Very good take-out dim sum (especially the sesame balls and black bean rice cakes; for savory I like the coriander gow and tofu skin rolls). ", "Service is not so friendly but is efficient, which is important because the line can be long."], "author": "Katya F.", "review": "Very good take-out dim sum (especially the sesame balls and black bean rice cakes; for savory I like the coriander gow and tofu skin rolls). Service is not so friendly but is efficient, which is important because the line can be long.", "rating": 4, "date": "2018-06-25"}, {"excerpts": ["The coriander gow gee is an absolute steal - 3 for $1.70! "], "author": "Tresna L.", "review": "Steamed bao bigger than my fist for 90 cents!? Yes please!\n\nThe pork in the chai sui bao is chunky and has a good five spice kick. I love throwing some chilli sauce on their for a bit of extra kick. The coriander gow gee is an absolute steal - 3 for $1.70! They're big and plump, the veggie filling is good but the dough is a little thick and flabby and a bit too oily for my liking.\n\nWhile these might not be the most refined dumplings and bao you've ever had, they do pack some flavour and they're mighty mighty cheap. If you're hungry and want to stuff your tummy hole for just a few dollars then you'd do a lot worse than coming here and eating a plate of hot steaming buns.", "rating": 3, "date": "2013-04-17"}, {"excerpts": ["We settled on the coriander gow, beef siu mai, taro dumplings, chicken sticky rice, and a chicken combination bun.\n\n", "The coriander gow were a close second, featuring more shrimp than I thought could fit in something so small, the tangy kick of the Chinese celery, and a rice wrapper thicker than you would think it had a right to be.  "], "author": "Becca S.", "review": "Becca's Christmascapade 2010 - A Triptych.\nPart the First\n\nI wanted to make it a diptych because it's a funnier word but alas, I patronized three businesses on Christmas day.  Wing Lee was the first.  I have previously found it hard to choose to go to a dim sum restaurant other than Good Luck, and so I planned in advance on going to Wing Lee.  My resolve was strong - I had passed by the goodies in their window many times, and the time was nigh for some of those goodies to land squarely in my stomach.\n\nWhen we got there at 11am, it was really crowded!  Prime brunch time on a weekend, so that certainly made sense.  But the line moved quickly, and there was plenty of space at their long, communal tables to fit my boyfriend and me.  The line gave me plenty of time to covetously ogle their bountiful spread (Look, Ma!  No thesaurus!), and I was really impressed.  Their selection seemed to include a few more options than I was used to - combination buns, sweet steamed buns, baked buns, siu mai, potstickers, rice rolls, sticky rice, rice cakes, cakey cakes, and all with a variety of fillings.  We settled on the coriander gow, beef siu mai, taro dumplings, chicken sticky rice, and a chicken combination bun.\n\nThe shining stars, for me, were the beef siu mai.  The meat simply melted in my mouth, and the first bite revealed the glorious innards, in which the beef shone a lovely shade of pink.  The coriander gow were a close second, featuring more shrimp than I thought could fit in something so small, the tangy kick of the Chinese celery, and a rice wrapper thicker than you would think it had a right to be.  The taro dumpings were also impressive, containing more taro than I would have thought could possibly be squished into a dumpling of that size.\n\nThe combination bun and sticky rice were also really good, but not as flavorful as I would have liked.  The combination bun is a really interesting concept, combining multiple parts of a chicken with egg, sausage, and mushroom, but for everything that was in there, it was a little bland.  The bun itself, however, was really substantial but still fluffy.  My other gripe is that Wing Lee dim sum seems to all fall apart rather easily.  I realize this probably happens because the ingredients are fresher, or better for me, but it's a little less fun to eat a dumpling when you're desperately trying to make sure that you don't have to settle for eating all its components separately.\n\nThe atmosphere was delightful, and contained just the right amount of shouting in Chinese from the front counter back into the kitchen.  The tables were all clean, and were wiped down as I was watching, and there was only one bottle of hot sauce in the whole place, but I always find it really fun to share.  I'm very glad I went, and look forward to going again and sampling even more of that impressively ginormous menu.", "rating": 4, "date": "2010-12-26"}, {"excerpts": ["I get their chicken skewers, fried meat dumplings, beef rice rolls,  steamed bbq pork buns, coriander gow, siu mai, har gow, or other stuff, too, depending on how hungry I am.  "], "author": "Paul B.", "review": "\"Would it be wrong to get a rice plate?\" \n\nWhen I hear my roommate ask me this, I know that greasy dim sum is soon in the tummy.  If you spend 10 dollars at the dim sum side and aren't full to bursting... well this is a family channel.\n\nI get their chicken skewers, fried meat dumplings, beef rice rolls,  steamed bbq pork buns, coriander gow, siu mai, har gow, or other stuff, too, depending on how hungry I am.  I always try to get something new each time to expand my palette.\n\nGo there for lunch, and you won't be disappointed - tasty, nice variety, friendly counter staff, inexpensive!", "rating": 4, "date": "2007-11-17"}], "shark fin gow": [{"excerpts": ["The shark fin gow (don't worry, they are just pork and mushroom dumplings shaped kinda like a shark) were full of filling. "], "author": "JJ H.", "review": "I used to skip this place in favor of Good Luck, Gourmet, or Xiao Long Bao. Can't remember why.  Maybe I thought their cha siu bows weren't all that. \n\nBut I just grabbed a few items, and hey, they're pretty good! The shark fin gow (don't worry, they are just pork and mushroom dumplings shaped kinda like a shark) were full of filling. And not as greasy/fatty as Good Luck's. \n\nGood selection, short line, old auntie enjoying her jook, fair prices for Clement Street. I'll put it back on my list of to go dim sum joints.", "rating": 4, "date": "2018-03-11"}, {"excerpts": ["Shark Fin Gow: Not bad. ", "It's like a huge meatball in the shape of a dumpling. "], "author": "Jess C.", "review": "This is my go to place for dim sum take out:\n\nShrimp Har Gow: This is the clear white spherical dumpling. Pretty delish, make sure you dip it in chili sauce and soy sauce.\n\nShrimp Wrapped in White Noodle (Har Cheung): SKIP. The noodle is so thick and tough on the outside. It is supposed to be silky and delicate. The shrimp is tiny on the inside. And the sweet soy sauce on top is too watery.\n\nShark Fin Gow: Not bad. It's like a huge meatball in the shape of a dumpling. I prefer the siu mai.\n\nSiu Mai: YUM. Mushroomy :) \n\nChive Dumpling: Meh - Skip. Clear spherical dumpling filled with dark green chives and a shrimp.\n\nCoriander Dumpling: This one had a nice little crunch. It is large clear dumpling with chopped up veggies.\n\nJook: can't go wrong here!", "rating": 4, "date": "2011-09-22"}, {"excerpts": ["Very thick & meaty dumplings, such as the shui mai & shark fin gow. "], "author": "Katrina H.", "review": "Cheap dim-sum to go! This is my go-to place when I'm craving dim sum & need it quick. You're getting good stuff for what you're paying for. $1.60 for 3 dumplings. \n\nVery thick & meaty dumplings, such as the shui mai & shark fin gow. I usually get those, along with some bbq pork buns and hargow with chives. \n\nSkip the shrimp rice rolls. The rice rolls are super thick, and the sweet soy sauce tastes watered down. \n\nFYI, this isn't one of those dim sum places where they push around the carts full of steaming dumplings. Definitely good stuff for the price though!", "rating": 4, "date": "2011-10-19"}, {"excerpts": ["There's not as many as at a sit-down restaurant, but for some reason, all the ones that I usually order anyway are here, shrimp and chive gow, shark fin gow, shrimp har gow, or tun cake.  ", "3 of a kind for $1.50, but "], "author": "David A.", "review": "As far as dim-sum goes, this is as good as it gets on this side of Chinatown.\n\nFirst off, food is (in order of importance) a) tasty, b) cheap, and c) filling.  \n\nThe steamed buns are 70 cents each (Except for the chicken special one, which is $1.20, and twice as big as the regular chicken one.)  Now take heed; these are huge.  My favorite is the pork vegetable one.  Baked buns are slightly more, like 80 cents to $1.  \n\nThey have a pretty good variety of dimsum.  There's not as many as at a sit-down restaurant, but for some reason, all the ones that I usually order anyway are here, shrimp and chive gow, shark fin gow, shrimp har gow, or tun cake.  3 of a kind for $1.50, but if you're nice, they might let you mix and match!\n\nJook (congee), especially the chicken one, is hearty and yummy and a bowl is $2.\n\nLobby is cozy and (relatively) clean.\n\nI generally don't give a shit about service, because you can't eat service.  However, service here doesn't really leave anything to complain about.  They're incredibly efficient and neither friendly nor unfriendly (which puts them probably among the friendliest 20% of Chinese restaurants.)\n\nThe only thing I wasn't impressed with was the steamed BBQ pork bun.  It was edible, of course, but too much corn starch for my liking.  If you want a good laugh...order the steamed sausage bun.\n\nNothing beats sitting here with a comforting bowl of jook and a steamed bun and assorted dimsum before you while staring out into the rain.", "rating": 5, "date": "2008-02-11"}, {"excerpts": ["When I come here, I always order the same items which I know are good such as their pork Siu Mai (tasty and huge), their Shark Fin gow (delicious and plump), their Siu Lung Pao (mini steamed pork and vegetable buns - I love their soft and fluffy buns), on occasion their Egg rolls, and Lomai Kai (chicken sticky rice wrapped in lotus leaf - these are humongous here!).  \n\n"], "author": "Nadine M.", "review": "Wing Lee is my go-to place when I crave \"to-go Dim Sum.\"  Most* Dim Sum items are good, come in generous portion and are very decently priced.  When I come here, I always order the same items which I know are good such as their pork Siu Mai (tasty and huge), their Shark Fin gow (delicious and plump), their Siu Lung Pao (mini steamed pork and vegetable buns - I love their soft and fluffy buns), on occasion their Egg rolls, and Lomai Kai (chicken sticky rice wrapped in lotus leaf - these are humongous here!).  \n\nHowever, I would stay away from their *Ha-gow (shrimp dumplings) and any \"gows\" that involves a whitish-transparent wrapping.  These dumplings are hard to swallow given that the whitish wrapping, that contain the fillings, is really un-refined and super thick and heavy.  Eating these would usually cut my appetite right away.  So, I just stick to what I like to fully satisfy my cravings.  But if you really crave some Ha-gow, just walk a few blocks down to \"Good Luck Dim Sum.\" They have good to-go Ha-gows there, with a more refined wrapping filled with generous shrimp stuffing.", "rating": 4, "date": "2010-05-16"}], "boiled leeks shrimp pork gow": [], "taro gow": [{"excerpts": ["like their taro gow..its hella good! "], "author": "Jessica h.", "review": "Good dim sum shop! I like how they have pretty much everything you want and the prices are soooooooo cheap..all the usual dim dum (ha gows, sew mai) are 3 for $1.50, and their selection is pretty substantial. They have 3 diff kinds of sew mai (chicken, pork, or beef) and they have some original gows too...like their taro gow..its hella good! Whenever I come here in the mornings, there is always a line...a pretty diverse line too...different types of asians (not just chinese), and caucasians too.\n\nHeres a mini scorecard of some things I've eaten here:\nRice porridge: $2.25 eh..only ok kinda runny and the rice is a little gritty. \nSin-Jook-Gurn (the beancurd wrapped  rolls): $2.00 for about 4 of them..hella good! Lots of flavor.\nPotstickers: huge and also 3 for $1.50. Not bad, but I'd stick to the steamed dim dum.\nVarious steamed dim sum: good, and they also have an original kind of skin too..its more translucent and chewy but its good.\nBuns: the most expensive thing on the menu...at 80 cents each. damn now that is breaking the bank. get the yellow custard buns! (nai wong bow) creamy and not too sweet...perfection!", "rating": 4, "date": "2008-09-10"}], "sweet rice cake": [{"excerpts": ["I usually get the Shu Mai, Pot stickers, BBQ Pork bun, Chinese Donut, Sweet Rice Cake, and the Red Bean Sesame balls.", "The portion size are pretty huge, you definitely get what you pay for here ", "and it's super quick. "], "author": "Julia K.", "review": "Quick, cheap, and good.\n\nIf you're craving for dim sum (take out) in the Richmond, I highly suggest coming here -- but make sure you know what you want before you order because the workers here don't have any patience.  \n\nI usually get the Shu Mai, Pot stickers, BBQ Pork bun, Chinese Donut, Sweet Rice Cake, and the Red Bean Sesame balls.The portion size are pretty huge, you definitely get what you pay for here and it's super quick. I think most of the dim sum sells 3 at $1.90 or somewhere around that range, which isn't bad. \n\nHighly recommend. Also, I believe it's cash only! So make sure to have some on hand. And, don't feel flustered when ordering, it may seem intimating at first but they tend to get you the correct dim sum if you order confidently.", "rating": 4, "date": "2015-03-11"}, {"excerpts": ["Sweet Rice Cake (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=96VVquk3h_uoAi1i-qV1qg) ", "- These are a personal favorite of mine.  ", "Pretty simple too.  ", "It's a ball of sweet glutinous rice (sticky rice) flavored with minced green onion and bits of BBQ pork and wrapped inside a super thin rice flour membrane.  ", "These pastries appear small but just a few will fill you up because the rice is packed so firmly.  "], "author": "Wilhelm Y.", "review": "Wing Lee continues to be my favorite dim sum spot along Clement Street.  Granted, I haven't tried every single dim sum shop along Clement Street, but among the ones I have tried in that area (Good Luck Dim Sum, Gourmet Dim Sum & Clement Restaurant) Wing Lee stands out as the one restaurant that uses the least MSG.  That's good news for someone like me who is sensitive to MSG or high sodium levels.\n\nLike most dim sum places I have my likes and dislikes.  You will never, ever see me eating turnip cakes, leek dumplings, beef siu mais or beef rice rolls at any dim sum shop regardless of how good they are.  I don't like the taste of them, and I definitely don't like the look of them.\n\nAs my friend Sara A and I embarked on a six day great outdoors trip this would be the only restaurant food purchase of our entire trip.  Everything except for the shrimp gows were exceptional, and through the magic of words and pictures here is where my review begins.  One other thing, what I refer to the pastries as may not be what the restaurant refers to them as.\n\nChicken Siu Mai (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=3iTDI7x3FT6o4yuJ7WCuSw) - It's everything you love about your pork siu mais, but ground chicken thigh meat is used instead of the pork.  The filling seems pretty simple with ground chicken, finely chopped mushrooms and carrots that are wrapped in a thin flour wrapper and steamed.  These were very well seasoned and I could not detect any MSG.\n\nShrimp Gow \"aka\" Har Gow (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=wOHusAFk0IJyootF2tx1EA) - You get at least two baby shrimp in each along with some finely chopped bamboo shoot, and some gritty tapioca starch encased in a rather thick steamed rice flour skin that is super rubbery.  Sara and I actually played catch with one, and it was so rubbery it didn't break open.  These were okay, but I definitely detected some MSG inside the filling.\n\nFun Gor or Steamed Pork Dumpling (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=VkDFwAVV3MgUDwC7k-rh4w) - The filling is very well compacted and had good flavor.  The rice flour skin was also on the thick side, but aside from the ones my mom used to make I've come to expect thick skins on fun gors.  The filling consisted of minced pork, shrimp bits, mushrooms, carrots, bamboo shoots, green onion and cilantro.  All were chopped finely.  No MSG taste.\n\nSweet Rice Cake (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=96VVquk3h_uoAi1i-qV1qg) - These are a personal favorite of mine.  Pretty simple too.  It's a ball of sweet glutinous rice (sticky rice) flavored with minced green onion and bits of BBQ pork and wrapped inside a super thin rice flour membrane.  These pastries appear small but just a few will fill you up because the rice is packed so firmly.  Here is how it looks on the inside (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=80EgwX6Zdg9u79wABfmtHw).\n\nBean Curd Rolls (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=xho1Q8i5AVXQsn1fJmkLxw) - We had to try these because we had never seen them offered here before.  These are a good vegetarian option to the meat filled rice rolls and very tasty.  The filling consisted of thin glass noodles, chopped shiitake mushrooms, strips of carrot and strips of wood ear wrapped in hydrated dried bean curd and steamed.  They're served with soy sauce and chopped green onion.  We both agreed that these were delicious for a dish containing no meat.  Here's the shot of the filling (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=aCOYiEaIWv7T3HWTqRR8Pg).\n\nChicken Combination Bun (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=8FD0AwItk92djvd1YaikXA) - My dad and I love Wing Lee's chicken combination buns.  As you can see from the photo there is tender, juicy chicken thigh meat with green onions, a part of a hard boiled egg, a whole shiitake mushroom and a piece of Chinese sausage inside the steamed sweet bun.  Best of all ... no MSG taste.\n\nThe ladies here are cool and all are very much trilingual (Cantonese, Mandarin, English).  If they can understand my Chinglish they can understand anyone.", "rating": 4, "date": "2009-03-30"}, {"excerpts": ["Sweet rice cake\n4. ", "Pork shumai Dumplings\n5. ", "Fun-goh (pork, shrimp, mushrooms)"], "author": "Oliver D.", "review": "I must say, their Ha-gow (shrimp dumplings) are YUM! Full of flavor and always fresh! This place is consistently busy and the trays/ containers of steamed delicacies are usually replenished every 20 min. The pastries are made in the morning, but I can't review them because I've never had them. =)\n\nGreat place for favorable tasting and cheap Dim Sum on the go!\n\n1. Steam pork buns\n2. Ha-Gow (shrimp dumplings)\n3. Sweet rice cake\n4. Pork shumai Dumplings\n5. Fun-goh (pork, shrimp, mushrooms)", "rating": 4, "date": "2009-10-15"}], "cornstarch cake": [], "pork sew mai": [{"excerpts": ["Great Shrimp Gow, Pork Sew Mai, and Pot Stickers! ", "Dinner for under $5? "], "author": "Addadada A.", "review": "WOW! When I want to make my mom REALLY happy...I bring her home her fave DIM SUM from WING LEE BAKERY! \n\nAt 3 for $1.50 how can one go wrong! Great Shrimp Gow, Pork Sew Mai, and Pot Stickers! Dinner for under $5? WOW!\n\nEasy to point if the language barrier gets in the way...\n\nTO GO is the best option. (NOT a sit-down type of place...)", "rating": 4, "date": "2010-02-24"}], "beef sew mai": [{"excerpts": ["Pork or beef Sew Mai: even though its not in par with Koi Palace or Asian Pearl standards, we all still love it. ", "The beef sew mai tastes more like the beef balls (ngau yook) served in dim sum restaurants. ", "Both damn good. "], "author": "Chung L M.", "review": "Yummy and damn cheap! Most of the stuff here are $1.50 to $1.80 for 3 pieces. I think prices went a little up. Come here before 1700 hours before most of their stuff sells out. It helps to speak Cantonese here although you will still be adequately served if you dont. Im a normal face here and already made friends with the ladies behind the counter. They are a nice group to deal with.\n\nI Always come here to buy bulk loads of to go dim sum and egg custart tarts (daan taat) for dinner and for breakfast at home if im ever in the Richmond district. I always buy 2 FULL plastic boxes and it costs me $13 to $15 which feeds 3 people at home breakfast, lunch and dinner for 4 days. \n\nEgg custard tart (daan taat): pie like crust (not the 'so pey' flaky type) with sweetened egg in the centre. $.65 per piece and tastes awesome.\n\nSesame ball: $1.40 each. Crispy outside with chewy inner layer filled with dark lotus seed pastes. Again awesome. Even retains its crispiness days after being bought and microwaved at home.\n\nCha Sew So: dont know what its called in english but it is a squar flat pastry wrapped around little amounts of Cha Sew (BBQ pork). LOVE the crispy and soft delicate pastry. BBQ pork inside gives it a nice touch. Like a Cha Sew Bau pork bun but with a pastry instead of a bun. A little more BBQ pork inside would be nice but I Highly recommend it.\n\nPork or beef Sew Mai: even though its not in par with Koi Palace or Asian Pearl standards, we all still love it. The beef sew mai tastes more like the beef balls (ngau yook) served in dim sum restaurants. Both damn good. $1.40 for 3 pieces.\n\nHa Gau (shrimp gau): love it and the shrimp inside was flavourfull considering this place is a cheap to go dim sum shop.\n\nSpring roll: lots of vegetables inside. The type i personally enjoy. Even when i leave it in my fridge for days and the outer layer is totally soggy, i still love it. It is crispy when you eat it fresh though.\n\nIf you are nit picky about dim sum, then go to Asian Pearl or Koi Palace. What you get here is what you pay. Dirt cheap dim sum and fairly good food and fast efficient service. Me coming from Hong Kong and being accustomed to real deal dim sum and Chinese food, I still have no complaints about eating from here.", "rating": 5, "date": "2013-11-11"}], "chicken sew mai": [{"excerpts": ["I brought some Chicken Sew Mai and Sticky Rice with Pork to a picnic and everyone was wowed by my brilliant idea...too bad they were mostly vegetarians."], "author": "Wes M.", "review": "Now here's an idea!  Dim sum like Koi Palace, but with 99.98% less of a wait (roughly 1 second as opposed to 5,000).  Ok, sure they don't have the same selection, and sure it's less gourmet, but when you need something cheap, convenient and comforting, look no further than these little bundles of joy.  I brought some Chicken Sew Mai and Sticky Rice with Pork to a picnic and everyone was wowed by my brilliant idea...too bad they were mostly vegetarians.", "rating": 4, "date": "2007-05-06"}], "steamed pork dumping": [], "pot sticker": [{"excerpts": ["I picked up some shrimp dumplings, a pot sticker and an egg tart recently. ", "Everything was good but could have been better. ", "The shrimp dumplings are still huge but a lot of the size is just the wrapper. ", "The pot sticker wasn't very flavorful and the egg tart crust was more crumbly than flaky. ", "I prefer the latter. "], "author": "Maya S.", "review": "I picked up some shrimp dumplings, a pot sticker and an egg tart recently. Everything was good but could have been better. The shrimp dumplings are still huge but a lot of the size is just the wrapper. The pot sticker wasn't very flavorful and the egg tart crust was more crumbly than flaky. I prefer the latter. Also, everything seemed a bit more greasier during this visit. \n\nPrices went up another 10 cents again, and service hasn't change, for me at least. Still cold.", "rating": 3, "date": "2012-09-03"}], "black bean rice cake": [], "spring roll": [{"excerpts": ["Spring roll: ", "lots of vegetables inside. ", "The type i personally enjoy. ", "Even when i leave it in my fridge for days and the outer layer is totally soggy, i still love it. "], "author": "Chung L M.", "review": "Yummy and damn cheap! Most of the stuff here are $1.50 to $1.80 for 3 pieces. I think prices went a little up. Come here before 1700 hours before most of their stuff sells out. It helps to speak Cantonese here although you will still be adequately served if you dont. Im a normal face here and already made friends with the ladies behind the counter. They are a nice group to deal with.\n\nI Always come here to buy bulk loads of to go dim sum and egg custart tarts (daan taat) for dinner and for breakfast at home if im ever in the Richmond district. I always buy 2 FULL plastic boxes and it costs me $13 to $15 which feeds 3 people at home breakfast, lunch and dinner for 4 days. \n\nEgg custard tart (daan taat): pie like crust (not the 'so pey' flaky type) with sweetened egg in the centre. $.65 per piece and tastes awesome.\n\nSesame ball: $1.40 each. Crispy outside with chewy inner layer filled with dark lotus seed pastes. Again awesome. Even retains its crispiness days after being bought and microwaved at home.\n\nCha Sew So: dont know what its called in english but it is a squar flat pastry wrapped around little amounts of Cha Sew (BBQ pork). LOVE the crispy and soft delicate pastry. BBQ pork inside gives it a nice touch. Like a Cha Sew Bau pork bun but with a pastry instead of a bun. A little more BBQ pork inside would be nice but I Highly recommend it.\n\nPork or beef Sew Mai: even though its not in par with Koi Palace or Asian Pearl standards, we all still love it. The beef sew mai tastes more like the beef balls (ngau yook) served in dim sum restaurants. Both damn good. $1.40 for 3 pieces.\n\nHa Gau (shrimp gau): love it and the shrimp inside was flavourfull considering this place is a cheap to go dim sum shop.\n\nSpring roll: lots of vegetables inside. The type i personally enjoy. Even when i leave it in my fridge for days and the outer layer is totally soggy, i still love it. It is crispy when you eat it fresh though.\n\nIf you are nit picky about dim sum, then go to Asian Pearl or Koi Palace. What you get here is what you pay. Dirt cheap dim sum and fairly good food and fast efficient service. Me coming from Hong Kong and being accustomed to real deal dim sum and Chinese food, I still have no complaints about eating from here.", "rating": 5, "date": "2013-11-11"}], "pork combination": [], "steam sponge cake": [], "taro cake": [{"excerpts": ["Their taro cake was even worse.  "], "author": "Alan T.", "review": "No no no!  \n\nI first ran into this place's dim sum when I attended the book party of \"The Fortune Cookie Chronicles\" at Swig in March 2008.  The organizers provided dim sum and at that time I was really impressed with the siu mai (pork dumpling) and hai gao (shrimp dumpling).  So I asked the organizer where he got it.  \n\nSince that time Wing Lee has been on my list and I finally got to it yesterday.  But I was super disappointed.  My dim sum was cold but that can be fixed if you ask them to reheat it.  \n\nBut the worse thing was the taste and preparation.  I think one of their selling points is to make the dim sum entree big and cheap to attract customers while forgoing the taste.  With my hai gao, they did have a big piece of shrimp, but the flour covering was even bigger - thus this was not tasty.  Their taro cake was even worse.  It was undercooked!\n\nDim sum, which is really a collection of light chinese dishes, on steroids is great!  But make sure it tastes great too.  And since this place didn't pass my taste test, needless to say, I'll pass on this place in the future.", "rating": 2, "date": "2008-06-16"}], "tun cake": [{"excerpts": ["There's not as many as at a sit-down restaurant, but for some reason, all the ones that I usually order anyway are here, shrimp and chive gow, shark fin gow, shrimp har gow, or tun cake.  ", "3 of a kind for $1.50, but "], "author": "David A.", "review": "As far as dim-sum goes, this is as good as it gets on this side of Chinatown.\n\nFirst off, food is (in order of importance) a) tasty, b) cheap, and c) filling.  \n\nThe steamed buns are 70 cents each (Except for the chicken special one, which is $1.20, and twice as big as the regular chicken one.)  Now take heed; these are huge.  My favorite is the pork vegetable one.  Baked buns are slightly more, like 80 cents to $1.  \n\nThey have a pretty good variety of dimsum.  There's not as many as at a sit-down restaurant, but for some reason, all the ones that I usually order anyway are here, shrimp and chive gow, shark fin gow, shrimp har gow, or tun cake.  3 of a kind for $1.50, but if you're nice, they might let you mix and match!\n\nJook (congee), especially the chicken one, is hearty and yummy and a bowl is $2.\n\nLobby is cozy and (relatively) clean.\n\nI generally don't give a shit about service, because you can't eat service.  However, service here doesn't really leave anything to complain about.  They're incredibly efficient and neither friendly nor unfriendly (which puts them probably among the friendliest 20% of Chinese restaurants.)\n\nThe only thing I wasn't impressed with was the steamed BBQ pork bun.  It was edible, of course, but too much corn starch for my liking.  If you want a good laugh...order the steamed sausage bun.\n\nNothing beats sitting here with a comforting bowl of jook and a steamed bun and assorted dimsum before you while staring out into the rain.", "rating": 5, "date": "2008-02-11"}], "bbq pork bun": [{"excerpts": ["We also tried the baked and steam bbq pork bun.  ", "The food was good and the service was fast."], "author": "Matthew G.", "review": "We were in the area and thought about checking this place out.  The shrimp gow and shumai were really good.  We also tried the baked and steam bbq pork bun.  The food was good and the service was fast.", "rating": 5, "date": "2018-10-02"}, {"excerpts": ["I got a small box filled with dumplings, shumai, and a BBQ pork bun all for $8. ", "I really liked the shrimp dumplings in particular. ", "They also sell some desserts too that looked pretty good. ", "Overall great deal!"], "author": "Linda X.", "review": "Tasty, no frills dim sum place. It's cheap and cash only! The service was quick (especially if you can speak Chinese) and there's a few tables to eat at inside.\n\nI got a small box filled with dumplings, shumai, and a BBQ pork bun all for $8. I really liked the shrimp dumplings in particular. They also sell some desserts too that looked pretty good. Overall great deal!", "rating": 4, "date": "2017-02-25"}, {"excerpts": ["We ordered the typical stuff - steamed BBQ pork bun, shrimp, pork and chive dumplings. ", "The BBQ bun had a ton of bread and very little meat - we had to take several bites of the bun before getting to the pork filling. ", "The shrimp dumplings were the same - they had a TON of flour/skin and maybe three teeny tiny little shrimp inside. ", "We felt like we just ate a ton of white flour. "], "author": "Cee J.", "review": "Wow, I'm really surprised at the 4 star review. This place is mediocre at best, and totally skimps on the ingredients. We ordered the typical stuff - steamed BBQ pork bun, shrimp, pork and chive dumplings. The BBQ bun had a ton of bread and very little meat - we had to take several bites of the bun before getting to the pork filling. The shrimp dumplings were the same - they had a TON of flour/skin and maybe three teeny tiny little shrimp inside. We felt like we just ate a ton of white flour. The pork dumplings were decent.\n\nWe only came here because Good Luck dim sum is closed on Tuesdays. So unless you're dying for dim sum on a Tuesday, go to Good Luck dim sum (which is just two blocks away) instead!", "rating": 2, "date": "2017-09-07"}, {"excerpts": ["Yay for BBQ pork bun. ", "Mehhh for pineapple bun. ", "Hella cheap though. ", "I'd go back for dim sum."], "author": "Kelly G.", "review": "Yay for BBQ pork bun. Mehhh for pineapple bun. Hella cheap though. I'd go back for dim sum.", "rating": 3, "date": "2017-04-25"}, {"excerpts": ["I stop in at least once a month for my BBQ pork bun fix."], "author": "Jeff H.", "review": "This is the Chinese Bakery equivalent of Seinfeld's Soup Nazi.  Great food at good prices, almost always a line, and don't ask questions.  You had better know what you want when it is your turn to order or you will get the glare.\n\nGreat selection of items.  Everything I have tried here I have enjoyed.  I have even used them for large orders for gatherings.\n\nThe service is fast, though not conducive to the undecided tourist.  Some of the regulars are know to just cut to the front of the line when they come in (I have seen it myself).  And since the line forms at the counter and goes back into the store, it easy for them to do this.  But at least they know what they want, order quickly, and often have cash in hand before even ordering.\n\nI stop in at least once a month for my BBQ pork bun fix.", "rating": 4, "date": "2014-07-09"}, {"excerpts": ["Baked bbq pork bun, Har gao and Siu Mai.\n\n"], "author": "Mark O.", "review": "So I decided to go on a dim sum hunt in Richmond today. I started at Wing Lee on Clement street. \n\n*Note* I am basing all of my dim sum reviews on the following three items (as they are my favorites): Baked bbq pork bun, Har gao and Siu Mai.\n\nBao - The bun was rather dry. The filling was decent but lacked flavor although it did have decent size chunks of pork which is something I look for.\n\nHar gao - While this was fairly moist compared to the other items I got, there were almost no shrimp in it and those it did have were tiny little bay shrimps! Unacceptable.\n\nSiu mai - The pork filling again lacked flavor and the whole thing was rather dry, both inside and out.\n\nSo far, this was one of my least favorite dim sum shops. I will not be returning to this one.", "rating": 1, "date": "2014-08-25"}, {"excerpts": ["The best BBQ pork bun good thing it's in the city and far away from me. ", "It can be addictive!"], "author": "Noel O.", "review": "The best BBQ pork bun good thing it's in the city and far away from me. It can be addictive!", "rating": 5, "date": "2017-08-13"}, {"excerpts": ["This visit was part of a 6-person BBQ Pork Bun Crawl to a bunch of San Francisco's most popular bakeries. ", "To read up on other bakeries we visited, check out my Yelp list: http://www.yelp.com/list/bbq-pork-bun-crawl-sf-san-francisco."], "author": "Mark C.", "review": "The Steamed Pork Bun here features untraditional brownish bread, that looked like it was made with whole wheat. This departure from tradition for the bread, and the average tasting meat within, made for an unimpressive experience. \n\nThat said, the other items we tried here were much better. The Savory Pork and Vegetable Buns provided a great combination of flavors, and the dim sum items we tried -- the Chive Dumpling and Bean Curd in Tofu Wrap -- were also great and definitely worth checking out.\n\nThis visit was part of a 6-person BBQ Pork Bun Crawl to a bunch of San Francisco's most popular bakeries. To read up on other bakeries we visited, check out my Yelp list: http://www.yelp.com/list/bbq-pork-bun-crawl-sf-san-francisco.", "rating": 3, "date": "2013-07-04"}, {"excerpts": ["Whenever I visit my aunt, she would buy the steamed bbq pork bun for us to eat.  ", "Normally, I don't like steamed buns because they seem to lack flavor.  ", "However, the buns here were delicious.  ", "The filling were juicy, with tons of sauce.  ", "Since the filling was filled with sauce, I had to use the outer bread to mop up all the juice.  ", "I just ate one before typing this review!  ", "Besides the steamed bbq pork bun, my aunt would also order other dim sum items (stir fried rice rolls, steamed chicken bun, etc.).  ", "Unfortunately, the flavors are sub par. ", "Four stars is just for the steamed bbq pork bun."], "author": "Sandy Q.", "review": "Whenever I visit my aunt, she would buy the steamed bbq pork bun for us to eat.  Normally, I don't like steamed buns because they seem to lack flavor.  However, the buns here were delicious.  The filling were juicy, with tons of sauce.  Since the filling was filled with sauce, I had to use the outer bread to mop up all the juice.  I just ate one before typing this review!  Besides the steamed bbq pork bun, my aunt would also order other dim sum items (stir fried rice rolls, steamed chicken bun, etc.).  Unfortunately, the flavors are sub par. Four stars is just for the steamed bbq pork bun.", "rating": 4, "date": "2016-03-31"}, {"excerpts": ["+Steamed BBQ Pork bun - good amount of meat, less fat/gristle than other places I've visited in Chinatown\n+Banana cake - great flavor, kind of disintegrated in my hands.  "], "author": "Ben K.", "review": "Weekday, 1:30 PM - 4 people\n\nQuick in and out - what else can you expect from a takeout dim sum place?  We were on the way back to the office, so we stopped in here to get a sampling of what they had.  First thing we noticed was English on the menus!  This is a big plus - some places in Chinatown don't bother doing this, and although I know what is being offered (from living in Asia for years), most people are probably confused and left to point aimlessly at what looks appetizing.  My choices were the go-to orders at this type of place, because unfortunately they were lacking on the flaky pastries (char siu so, for example).  I saw egg tarts tucked away in one corner under a heating lamp, but they didn't look very good. \n\n+Steamed BBQ Pork bun - good amount of meat, less fat/gristle than other places I've visited in Chinatown\n+Banana cake - great flavor, kind of disintegrated in my hands.  Banana flavor really came through and not overly sweet\n+Steamed Chicken bun - could actually see the chunks of chicken meat, as opposed to congealed chicken parts mush I've seen in other areas of the city\n+Steamed Egg Custard Bun - good flavor, not the best, not the worst.  \n\nI paid $3.30 total for my 3 steamed buns, and I tried someone else's banana cake.  Good value for what I got.  Overall a nice takeout dim sum experience (you have to distinguish between takeout and sit-down dim sum - VERY different).  If you live in the Western half, and you don't feel like going to Chinatown, this is a great alternative.", "rating": 4, "date": "2015-07-28"}, {"excerpts": ["I usually get the Shu Mai, Pot stickers, BBQ Pork bun, Chinese Donut, Sweet Rice Cake, and the Red Bean Sesame balls.", "The portion size are pretty huge, you definitely get what you pay for here ", "and it's super quick. "], "author": "Julia K.", "review": "Quick, cheap, and good.\n\nIf you're craving for dim sum (take out) in the Richmond, I highly suggest coming here -- but make sure you know what you want before you order because the workers here don't have any patience.  \n\nI usually get the Shu Mai, Pot stickers, BBQ Pork bun, Chinese Donut, Sweet Rice Cake, and the Red Bean Sesame balls.The portion size are pretty huge, you definitely get what you pay for here and it's super quick. I think most of the dim sum sells 3 at $1.90 or somewhere around that range, which isn't bad. \n\nHighly recommend. Also, I believe it's cash only! So make sure to have some on hand. And, don't feel flustered when ordering, it may seem intimating at first but they tend to get you the correct dim sum if you order confidently.", "rating": 4, "date": "2015-03-11"}, {"excerpts": ["They also have every other chinese bakery item u can want, chinese donuts to steam bbq pork bun. ", "This hood is known for the asian food ", "so, im not suprised. "], "author": "Mono L.", "review": "Ready to go, ready to eat, ready to die for.. \nThey pass my dim sum test,\nI got 1 box full of pork & shrimp siu mai,\n& i loved every bite. They also have every other chinese bakery item u can want, chinese donuts to steam bbq pork bun. This hood is known for the asian food so, im not suprised. I will be back. \n\nBut seating for eating in is not very ideal. Get it to go", "rating": 4, "date": "2014-08-25"}, {"excerpts": ["Steamed BBQ Pork Bun - Nice, not too much dough (as compared to many others, it is supposed to be somewhat bready), dough was flavorful, light yeasty taste (some have no flavor at all).  ", "Filling had nice meat with a little fat (not grisly), sauce had a light smokiness to it that went well with the yeastiness in the dough.  ", "Most of all there was not a hint of funk in the meat.  ", "I feel that often the strong BBQ flavor (even at some of the highly rated bakeries) is masking some funky meat ", "and I'm really grossed out when I get a hit of that older meat flavor, not a bit of it here.  ", "I hope this remains consistent! "], "author": "Kelly B.", "review": "This is the dim sum bakery I've been looking for!  It's tasty, fresh, cheap and fast!\nI'll have to try it a few more times, hope they are consistently this good.  I've tried a few other highly rated dim sum bakeries in San Francisco and Oakland chinatowns and they have been okay but I do like to try some of the different items they have on offer and usually there will be something that just tastes funky (and not just in a way that's different), I liked everything we ordered here, everything tasted very fresh (didn't get anything deep fried this time though).\n\nSteamed BBQ Pork Bun - Nice, not too much dough (as compared to many others, it is supposed to be somewhat bready), dough was flavorful, light yeasty taste (some have no flavor at all).  Filling had nice meat with a little fat (not grisly), sauce had a light smokiness to it that went well with the yeastiness in the dough.  Most of all there was not a hint of funk in the meat.  I feel that often the strong BBQ flavor (even at some of the highly rated bakeries) is masking some funky meat and I'm really grossed out when I get a hit of that older meat flavor, not a bit of it here.  I hope this remains consistent! :)\n\nPot Stickers - Nice but not stand out, would have liked a little more roasty, seared flavor but again fresh and I liked the larger bits of lightly crunchy cabbage in them.   \n\nBean Curd Rolls - These soy bean skin wrapped rolls were delicious, crunchy vegetables inside, nice sauce.\n\nCombo Pork Dumpling - I really liked the nice thin steamed skin on this.\n\nRound steamed dumpling (unknown name) - Lightly sweet, dark sauce inside with peanuts and probably small pork bits, and some vegetables, it was more of a flattened ball shape with a thicker, mochi like skin, different and good too.\n\nI'm going back!", "rating": 5, "date": "2014-11-15"}, {"excerpts": ["I got an order of leek chives with shrimp dumplings (3), an order of peanut dumplings (3), turnip cake (3 large ones), one steamed BBQ pork bun, and one glutinous rice with chicken in banana leaf - all for under $10.  ", "But the dumpling skin is so thick with cornstarch, and the pork bun is so doughy, and the turnip cake ", "so bland, that it just isn't that good as the 4 star average Yelp ratings suggest."], "author": "Vivian W.", "review": "I seriously have to stop trusting Yelp reviews when it comes to dim sum in SF.  Yes, this stuff is cheap.  I got an order of leek chives with shrimp dumplings (3), an order of peanut dumplings (3), turnip cake (3 large ones), one steamed BBQ pork bun, and one glutinous rice with chicken in banana leaf - all for under $10.  But the dumpling skin is so thick with cornstarch, and the pork bun is so doughy, and the turnip cake so bland, that it just isn't that good as the 4 star average Yelp ratings suggest.", "rating": 2, "date": "2014-03-14"}, {"excerpts": ["Hard to beat a baked chicken or BBQ pork bun for one whole dollar and steamed dumplings/", "sew mai/gow at 3 for $1.70. "], "author": "Alissa A.", "review": "I'm no dim sum aficionado, but this place is pretty darn good. Just make sure to order your food to go; there is negative ambiance here.\n\nHard to beat a baked chicken or BBQ pork bun for one whole dollar and steamed dumplings/sew mai/gow at 3 for $1.70. And, yes, they are good.\n\nCome with friends and order a little of everything. Make sure you ask for some napkins to go in the bag - those (savory) taro cakes and sesame balls left me quite a greasy mess. Oh, and soy sauce. The baked chicken bun was lacking in the flavor department and could have used some.\n\nMinor gripes, but overall, I've been happy on the multiple occasions I've eaten (from) here. \nNow, if only I knew what a \"Wife Cake\" is...  looks like next time I'll have to spring an extra buck to solve that mystery.", "rating": 3, "date": "2013-01-22"}, {"excerpts": ["siu bao (BBQ pork bun) ", "a try--it was amazing! ", "I may have liked it even more than I do original steamed bao, which I like a lot. "], "author": "Kate V.", "review": "I'm pretty sure 3 is a lucky number in Chinese culture. Maybe that's why all the dim sum shops on Clement dispense their orders in batches of 3. At Wing Lee, without hesitation I immediately request one order of my favorite dim sum, har gao (shrimp dumplings); but I usually have to put a little more thought into deciding which one or two others I'll really be able to finish 3 of. Should I go for the pork shumai? Potstickers? Veggies rolled up in the flat noodles? Especially with the huge line of people that has inevitably queued up behind me, I've never had the courage to ask if it's possible to mix and match.\n\nThere's certainly not a lack of takeout dim sum places along this street, and I don't necessarily have a concrete reason as to why Wing Lee is my favorite of the bunch, but I can assure you that it's good. Recently I gave their whole wheat cha siu bao (BBQ pork bun) a try--it was amazing! I may have liked it even more than I do original steamed bao, which I like a lot. Look at these Chinese people, getting all health conscious and stuff... gotta love the way they keep with the times!\n\nAlso make sure you pick up an egg custard tart. For 80 cents, how could you not?", "rating": 5, "date": "2010-07-30"}, {"excerpts": ["Stopped by to get my fix of BBQ pork bun goodness.  ", "They have fantastic pork buns ($1.30 each), and all kinds of fantastic looking dim sum.  ", "This time we didn't get any dim sum because there wasn't a free table in the place, but we will definitely be back soon.  ", "Everything looks fresh and delicious.  ", "Great prices too."], "author": "Christine Z.", "review": "Oh Yum!   Stopped by to get my fix of BBQ pork bun goodness.  They have fantastic pork buns ($1.30 each), and all kinds of fantastic looking dim sum.  This time we didn't get any dim sum because there wasn't a free table in the place, but we will definitely be back soon.  Everything looks fresh and delicious.  Great prices too.", "rating": 4, "date": "2015-01-17"}, {"excerpts": ["(a bbq pork bun is bigger than my hand, but the filling is just so-so) ", "If you're hunting for good dim sum spots, you might want to pass on this -- even with the cheap price I don't think I'll go there again. ", "It's all about the price to quality ratio - ", "I've had way better dim sum for just a bit more than that price."], "author": "Alice C.", "review": "Take-out dim sum...hmm...while the concept is not new even in Hong Kong, it certainly is not what I think dim sum should be. Granted, I'm rating this place based on the food alone.\n\nIf you read every review, you'll find that the reason this place gets a lot of stars is because it's cheap. The reason I'm giving the place a 2-star is also because it's cheap...dirt cheap, because the food isn't even worth that.\n\nBut if you know anything about dim sum -- don't believe the reviews. All the dim sum are oversized and cheap, but, well, they hardly compare to the offerings of any good dim sum restaurants in the area. Worst is, when I ordered the radish cakes (which actually tastes pretty good) and rice noodles (with beef in it), they have to microwave the food, right in front of my eyes.\n\nSpeaking of which, rice noodles (cheung fun) are supposed to be very, very thin, with meat rolled up into it. The rice noodles here have to be more than 0.5 cm thick, which is nothing like I've seen.\n\nSo, if you're tight on money, this place will feed you well. (a bbq pork bun is bigger than my hand, but the filling is just so-so) If you're hunting for good dim sum spots, you might want to pass on this -- even with the cheap price I don't think I'll go there again. It's all about the price to quality ratio - I've had way better dim sum for just a bit more than that price.", "rating": 2, "date": "2009-10-13"}, {"excerpts": ["Huge bbq pork bun for $.80?!?! "], "author": "Em F.", "review": "Food: 3 stars\nPrice: 5 stars\n\nAs a cantonese american growing up with dim sum I would have to say that the food here was so-so.\n\nCharsui bao: Good but the pork was a bit runny and saucy. I sense that they must put a butt load of sugar and not that much quality char sui. The white bread surrounding the meat was good though.\n\nChicken kabob stick: chicken had a nice bbq flavor but was greasy and kind of dry and overcooked. \n\nHar gow: the shrimp part was good but the rice part was overly thick and was very greasy.\n\nCocktail bun: a bit dry and the filling was a bit dry also. I mean overall the bun was good but I definitely had better in many other places. I know $0.60 cents is cheap but most places sell that thing 4/$1 and it tastes way better.\n\nOverall the food here is ok but the price is FREAKIN CHEAP! i didn't even know they sell dim sum for so cheap. 3 hargow for 1.50?? Huge bbq pork bun for $.80?!?! The weekend before this i got a nasty and dry viet sandwich for $4 a block from this place.\n\nI would come here if I just wanted a quick fix but in order to get quality dim sum you are going to have to go a (good) restaurant (Tai Wu and Koi Palace and Fook Yuen come to mind).", "rating": 4, "date": "2010-09-28"}, {"excerpts": ["The only thing I wasn't impressed with was the steamed BBQ pork bun.  ", "It was edible, of course, but too much corn starch for my liking.  "], "author": "David A.", "review": "As far as dim-sum goes, this is as good as it gets on this side of Chinatown.\n\nFirst off, food is (in order of importance) a) tasty, b) cheap, and c) filling.  \n\nThe steamed buns are 70 cents each (Except for the chicken special one, which is $1.20, and twice as big as the regular chicken one.)  Now take heed; these are huge.  My favorite is the pork vegetable one.  Baked buns are slightly more, like 80 cents to $1.  \n\nThey have a pretty good variety of dimsum.  There's not as many as at a sit-down restaurant, but for some reason, all the ones that I usually order anyway are here, shrimp and chive gow, shark fin gow, shrimp har gow, or tun cake.  3 of a kind for $1.50, but if you're nice, they might let you mix and match!\n\nJook (congee), especially the chicken one, is hearty and yummy and a bowl is $2.\n\nLobby is cozy and (relatively) clean.\n\nI generally don't give a shit about service, because you can't eat service.  However, service here doesn't really leave anything to complain about.  They're incredibly efficient and neither friendly nor unfriendly (which puts them probably among the friendliest 20% of Chinese restaurants.)\n\nThe only thing I wasn't impressed with was the steamed BBQ pork bun.  It was edible, of course, but too much corn starch for my liking.  If you want a good laugh...order the steamed sausage bun.\n\nNothing beats sitting here with a comforting bowl of jook and a steamed bun and assorted dimsum before you while staring out into the rain.", "rating": 5, "date": "2008-02-11"}, {"excerpts": ["I got their baked BBQ pork bun ", "and it's DELICIOUS. ", "Soft, fresh, and loads of goodness inside (not small shiesty portions you would expect from one of those sit-downs). "], "author": "Yee-Shing W.", "review": "Like Good Luck Dim Sum, this place is cheap cheap cheap. They also have most all the usual dim sum items but I think they specialize more in breads and buns. I got their baked BBQ pork bun and it's DELICIOUS. Soft, fresh, and loads of goodness inside (not small shiesty portions you would expect from one of those sit-downs). Also tried the fried dumplings - also really really good. \n\nIf I had to compare the two, I think Good Luck wins. The line was super long at GL vs 2-3 people at WL so I guess that says something? But whatever, do what I did and hit up both! \n\nOh and they speak some English so keep the broken Chinese to yourself haha :P Cash only!", "rating": 4, "date": "2010-06-20"}, {"excerpts": ["I'd recommend the pork siu mai, chicken kabob (sometimes a little cold, so try to get it when it's fresh), steamed BBQ pork bun ", "(oh god yes), sesame balls, and shrimp thingamajig (har gow). ", "You can get dangerously stuffed for $4. ", "Come here with cash, as they don't take credit cards, and if you can, come in the early afternoon. "], "author": "Evan H.", "review": "Maaaan, since moving out of SF, I really miss Wing Lee. It was my favorite place to go and grab a super cheap / super filling meal. I'd recommend the pork siu mai, chicken kabob (sometimes a little cold, so try to get it when it's fresh), steamed BBQ pork bun (oh god yes), sesame balls, and shrimp thingamajig (har gow). You can get dangerously stuffed for $4. Come here with cash, as they don't take credit cards, and if you can, come in the early afternoon. It seems a little less crowded than the morning rush, and that's when they seem to replenish the waning supply of yummies with freshly-cooked yummies.\n\nIt's not the most relaxing environment... it gets crazy crowded and cramped, and you always have the pleasant aural sensation of the ladies behind the counter yelling back and forth with the ladies in the kitchen (they should invest in an intercom, I think). BUT: the food is soooo good. I've been to the fancier sit-down dim sum places in SF, and while they are okay, and probably healthier, I much prefer the cheap yummy fast-foodish stuff from Wing Lee. Sure, call me a barbarian for scoffing at your finest meats and cheeses, but sometimes you just want a goddamn Big Mac. :-)", "rating": 5, "date": "2010-05-25"}, {"excerpts": ["As Goldilocks said after she wolfed down Baby Bear's porridge, the Wing Lee BBQ Pork Bun is just right!  ", "They're not overly large, like at other places, and they're filled with chunks of meat, not huge chunks of gristle.  "], "author": "Robyn C.", "review": "As Goldilocks said after she wolfed down Baby Bear's porridge, the Wing Lee BBQ Pork Bun is just right!  They're not overly large, like at other places, and they're filled with chunks of meat, not huge chunks of gristle.  I personally think the fried rice dumplings are super yummy. \n\nAnd since I can only eat one other dumpling after a pork bun, that's pretty much where my story ends.", "rating": 4, "date": "2008-03-09"}, {"excerpts": ["The shrimp sew mai was cold gunk wrapped in goo, and the bbq pork bun was flavorless except for the taste of uncooked dough and the pieces of fat in the tasteless bbq sauce. \n\n"], "author": "Ana D.", "review": "I read the reviews, and was so excited to stop by this bakery with my husband during our trip to San Francisco. We waited in line, got 2 cold cans of soda from the case, and picked out our very inexpensive dim sum choices from a large selection.  The ladies used tongs occasionally and wore gloves with which they handled food and money indiscriminately.\n\nEating the first of the food - it was cold. Not cold like \"Someone refrigerated this\", but cold like food left on a counter for a couple hours before it's put in the fridge. \n\nThe chicken was tasty, but I wondered what the repercussions of the food's temperature was going to be.  The shrimp sew mai was cold gunk wrapped in goo, and the bbq pork bun was flavorless except for the taste of uncooked dough and the pieces of fat in the tasteless bbq sauce. \n\nI really like food, and it's a memorable day when I don't finish or at least want to finish all my food. We made a memory - I threw away 1/3 of our lunch and continued with our day, content to leave the sad lunch behind us. \n\nA few hours later, the sad lunch came back! My husband threw up, and my stomach is torn up as I'm writing this.  \n\nIt sucked having our hopes up and then having a crappy meal that turned into crap in our bodies far too quickly. I'm not giving up though - I will find good, inexpensive dim sum that doesn't make my mouth and my stomach upset. And if you happen to find it first, hit me up!", "rating": 1, "date": "2010-02-21"}, {"excerpts": ["(is this why you're going here?)\nfood: 4\n\nmy morning/afternoon/6:59 BBQ pork bun fix!\n\n"], "author": "Miss C.", "review": "atmosphere: 3 (is this why you're going here?)\nfood: 4\n\nmy morning/afternoon/6:59 BBQ pork bun fix!\n\nquick, reliable, relatively clean, tasty.", "rating": 4, "date": "2007-05-12"}, {"excerpts": ["The char sui bao (steamed bbq pork bun) was good, although the ratio of dough to pork was definitely weighted towards the dough --  the dough was of excellent consistency, though, and taste. ", "Overall, disappointed -- although it is cheap, I still expect quality b/c it ain't THAT cheap."], "author": "Tina S.", "review": "I read a lot of positive reviews about this place and saw where it ranked on citysearch and I was totally shocked by the low quality of some of the dim sum I bought there: not at all correspondent with the place's reputation. I got the fried taro dumpling: it was still freezing in the center, almost frozen.  The shrimp leek gow did NOT taste good -- it was very fishy and tasted off.  The shrimp gow was better, and I liked it. The char sui bao (steamed bbq pork bun) was good, although the ratio of dough to pork was definitely weighted towards the dough --  the dough was of excellent consistency, though, and taste. Overall, disappointed -- although it is cheap, I still expect quality b/c it ain't THAT cheap.", "rating": 2, "date": "2009-01-01"}, {"excerpts": ["The best BBQ pork bun you can ever get anywhere and trust me, I have had a lot of BBQ pork bun all over the Bay Area and Silicon Valley.  ", "The fillings are huge and not sticky like some other places.  ", "They also have great porridge if you like these things.  ", "If you do go though make sure to get there before noon for the porridge, they tend to be gone by 2pm.  ", "If you see a long line, don't be discourage, it usually moves fast and you have your delicious and cheap meal within minutes of waiting."], "author": "Paul Z.", "review": "The best BBQ pork bun you can ever get anywhere and trust me, I have had a lot of BBQ pork bun all over the Bay Area and Silicon Valley.  The fillings are huge and not sticky like some other places.  They also have great porridge if you like these things.  If you do go though make sure to get there before noon for the porridge, they tend to be gone by 2pm.  If you see a long line, don't be discourage, it usually moves fast and you have your delicious and cheap meal within minutes of waiting.", "rating": 4, "date": "2008-10-11"}], "pork wvegetable bun": [], "egg custard bun": [{"excerpts": ["(Ham Suy Gok)\n- Steamed White Carrot Cake\n- Steamed Egg Custard Bun\n\nSample picture of one of our dim sum platters - http://www.yelp.com/biz_photos/wing-lee-bakery-san-francisco?userid=I-FmdvI28N7OIIt4JZOgIg#DA-XtKujmlmdRxQbIwj_mg\n\n"], "author": "Tiffany D.", "review": "Their dim sum is so cheap and yummy at the same time!!!  Drizzle the dim sum with hot sauce and soy sauce so it'll add spicy and salty flavors to the overall dim sum meal!  MmMmmm!\n\nWhere do I even start to place out what I have ordered here?\n\nL I S T  O F  R E C O M M E N D A T I O N S\n- Bean Curd Roll\n- Chicken Combination Bun and Pork Bun\n- Steamed Shrimp with Chives\n- Steamed Pork (Siu Mai) and Beef \n- Shrimp (Har Gow)\n- Fried Taro\n- Fried Pork Ball (Ham Suy Gok)\n- Steamed White Carrot Cake\n- Steamed Egg Custard Bun\n\nSample picture of one of our dim sum platters - http://www.yelp.com/biz_photos/wing-lee-bakery-san-francisco?userid=I-FmdvI28N7OIIt4JZOgIg#DA-XtKujmlmdRxQbIwj_mg\n\nAll of this, made a splendid, inexpensive, brunch meal that fed 3 hungry people all for under about 15 bucks!  Bring cash!", "rating": 5, "date": "2013-04-21"}, {"excerpts": ["Banana flavor really came through and not overly sweet\n+Steamed Chicken bun - could actually see the chunks of chicken meat, as opposed to congealed chicken parts mush I've seen in other areas of the city\n+Steamed Egg Custard Bun - good flavor, not the best, not the worst.  \n\n"], "author": "Ben K.", "review": "Weekday, 1:30 PM - 4 people\n\nQuick in and out - what else can you expect from a takeout dim sum place?  We were on the way back to the office, so we stopped in here to get a sampling of what they had.  First thing we noticed was English on the menus!  This is a big plus - some places in Chinatown don't bother doing this, and although I know what is being offered (from living in Asia for years), most people are probably confused and left to point aimlessly at what looks appetizing.  My choices were the go-to orders at this type of place, because unfortunately they were lacking on the flaky pastries (char siu so, for example).  I saw egg tarts tucked away in one corner under a heating lamp, but they didn't look very good. \n\n+Steamed BBQ Pork bun - good amount of meat, less fat/gristle than other places I've visited in Chinatown\n+Banana cake - great flavor, kind of disintegrated in my hands.  Banana flavor really came through and not overly sweet\n+Steamed Chicken bun - could actually see the chunks of chicken meat, as opposed to congealed chicken parts mush I've seen in other areas of the city\n+Steamed Egg Custard Bun - good flavor, not the best, not the worst.  \n\nI paid $3.30 total for my 3 steamed buns, and I tried someone else's banana cake.  Good value for what I got.  Overall a nice takeout dim sum experience (you have to distinguish between takeout and sit-down dim sum - VERY different).  If you live in the Western half, and you don't feel like going to Chinatown, this is a great alternative.", "rating": 4, "date": "2015-07-28"}, {"excerpts": ["but I didn't manage to taste it because I was too busy eating the egg custard bun... "], "author": "Cath M.", "review": "Came here last week for some quick bites... or snacks... or dim sum! The line was long (came around the afternoon) but the service was fast. Ordered WHEAT pork buns for the sis (she loves that) but I didn't manage to taste it because I was too busy eating the egg custard bun... it was freshly baked and it was fluffy and delish! \n\nPrice: can't beat it! \n\nHighly recommend if you're craving dim sum but wants to avoid the dim sum craze!", "rating": 4, "date": "2013-06-08"}], "lotus bun": [], "black bean bun": [], "sausage bun": [{"excerpts": ["Har gow and Chinese sausage bun are by far the best items here. ", "Come early to get the fresh stuff. ", "You won't regret it."], "author": "Alex H.", "review": "Har gow and Chinese sausage bun are by far the best items here. Come early to get the fresh stuff. You won't regret it.", "rating": 4, "date": "2018-07-25"}, {"excerpts": ["If you want a good laugh...order the steamed sausage bun.\n\n"], "author": "David A.", "review": "As far as dim-sum goes, this is as good as it gets on this side of Chinatown.\n\nFirst off, food is (in order of importance) a) tasty, b) cheap, and c) filling.  \n\nThe steamed buns are 70 cents each (Except for the chicken special one, which is $1.20, and twice as big as the regular chicken one.)  Now take heed; these are huge.  My favorite is the pork vegetable one.  Baked buns are slightly more, like 80 cents to $1.  \n\nThey have a pretty good variety of dimsum.  There's not as many as at a sit-down restaurant, but for some reason, all the ones that I usually order anyway are here, shrimp and chive gow, shark fin gow, shrimp har gow, or tun cake.  3 of a kind for $1.50, but if you're nice, they might let you mix and match!\n\nJook (congee), especially the chicken one, is hearty and yummy and a bowl is $2.\n\nLobby is cozy and (relatively) clean.\n\nI generally don't give a shit about service, because you can't eat service.  However, service here doesn't really leave anything to complain about.  They're incredibly efficient and neither friendly nor unfriendly (which puts them probably among the friendliest 20% of Chinese restaurants.)\n\nThe only thing I wasn't impressed with was the steamed BBQ pork bun.  It was edible, of course, but too much corn starch for my liking.  If you want a good laugh...order the steamed sausage bun.\n\nNothing beats sitting here with a comforting bowl of jook and a steamed bun and assorted dimsum before you while staring out into the rain.", "rating": 5, "date": "2008-02-11"}, {"excerpts": ["Other good items include: sui mai, shark fin dumpling, chinese sausage bun, pork buns, and yellow cake. ", "Good variety. ", "Cheap. "], "author": "Veronica H.", "review": "Good place for some take out dim sum. We frequent this location when we're unable to go to Chinatown.\n\nThey have one of the best chicken buns around. It's filled w/(of course) chicken, mushroom, egg, Chinese sausage, and cilantro (yuck!). It's huge so I only eat half per sitting. Tasty! Other good items include: sui mai, shark fin dumpling, chinese sausage bun, pork buns, and yellow cake. Good variety. Cheap. There's always a line, but they get to you pretty quick. \n\nThere are some seats if you wish to dine in as well.", "rating": 4, "date": "2008-02-29"}], "chicken combination bun": [{"excerpts": ["A T I O N S\n- Bean Curd Roll\n- Chicken Combination Bun and Pork Bun\n- Steamed Shrimp with Chives\n", "- Steamed Pork (Siu Mai) and Beef \n- Shrimp (Har Gow)\n- Fried Taro\n- Fried Pork Ball "], "author": "Tiffany D.", "review": "Their dim sum is so cheap and yummy at the same time!!!  Drizzle the dim sum with hot sauce and soy sauce so it'll add spicy and salty flavors to the overall dim sum meal!  MmMmmm!\n\nWhere do I even start to place out what I have ordered here?\n\nL I S T  O F  R E C O M M E N D A T I O N S\n- Bean Curd Roll\n- Chicken Combination Bun and Pork Bun\n- Steamed Shrimp with Chives\n- Steamed Pork (Siu Mai) and Beef \n- Shrimp (Har Gow)\n- Fried Taro\n- Fried Pork Ball (Ham Suy Gok)\n- Steamed White Carrot Cake\n- Steamed Egg Custard Bun\n\nSample picture of one of our dim sum platters - http://www.yelp.com/biz_photos/wing-lee-bakery-san-francisco?userid=I-FmdvI28N7OIIt4JZOgIg#DA-XtKujmlmdRxQbIwj_mg\n\nAll of this, made a splendid, inexpensive, brunch meal that fed 3 hungry people all for under about 15 bucks!  Bring cash!", "rating": 5, "date": "2013-04-21"}, {"excerpts": ["Chicken Combination Bun (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=8FD0AwItk92djvd1YaikXA) ", "- ", "My dad and I love Wing Lee's chicken combination buns.  ", "As you can see from the photo there is tender, juicy chicken thigh meat with green onions, a part of a hard boiled egg, a whole shiitake mushroom and a piece of Chinese sausage inside the steamed sweet bun.  "], "author": "Wilhelm Y.", "review": "Wing Lee continues to be my favorite dim sum spot along Clement Street.  Granted, I haven't tried every single dim sum shop along Clement Street, but among the ones I have tried in that area (Good Luck Dim Sum, Gourmet Dim Sum & Clement Restaurant) Wing Lee stands out as the one restaurant that uses the least MSG.  That's good news for someone like me who is sensitive to MSG or high sodium levels.\n\nLike most dim sum places I have my likes and dislikes.  You will never, ever see me eating turnip cakes, leek dumplings, beef siu mais or beef rice rolls at any dim sum shop regardless of how good they are.  I don't like the taste of them, and I definitely don't like the look of them.\n\nAs my friend Sara A and I embarked on a six day great outdoors trip this would be the only restaurant food purchase of our entire trip.  Everything except for the shrimp gows were exceptional, and through the magic of words and pictures here is where my review begins.  One other thing, what I refer to the pastries as may not be what the restaurant refers to them as.\n\nChicken Siu Mai (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=3iTDI7x3FT6o4yuJ7WCuSw) - It's everything you love about your pork siu mais, but ground chicken thigh meat is used instead of the pork.  The filling seems pretty simple with ground chicken, finely chopped mushrooms and carrots that are wrapped in a thin flour wrapper and steamed.  These were very well seasoned and I could not detect any MSG.\n\nShrimp Gow \"aka\" Har Gow (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=wOHusAFk0IJyootF2tx1EA) - You get at least two baby shrimp in each along with some finely chopped bamboo shoot, and some gritty tapioca starch encased in a rather thick steamed rice flour skin that is super rubbery.  Sara and I actually played catch with one, and it was so rubbery it didn't break open.  These were okay, but I definitely detected some MSG inside the filling.\n\nFun Gor or Steamed Pork Dumpling (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=VkDFwAVV3MgUDwC7k-rh4w) - The filling is very well compacted and had good flavor.  The rice flour skin was also on the thick side, but aside from the ones my mom used to make I've come to expect thick skins on fun gors.  The filling consisted of minced pork, shrimp bits, mushrooms, carrots, bamboo shoots, green onion and cilantro.  All were chopped finely.  No MSG taste.\n\nSweet Rice Cake (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=96VVquk3h_uoAi1i-qV1qg) - These are a personal favorite of mine.  Pretty simple too.  It's a ball of sweet glutinous rice (sticky rice) flavored with minced green onion and bits of BBQ pork and wrapped inside a super thin rice flour membrane.  These pastries appear small but just a few will fill you up because the rice is packed so firmly.  Here is how it looks on the inside (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=80EgwX6Zdg9u79wABfmtHw).\n\nBean Curd Rolls (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=xho1Q8i5AVXQsn1fJmkLxw) - We had to try these because we had never seen them offered here before.  These are a good vegetarian option to the meat filled rice rolls and very tasty.  The filling consisted of thin glass noodles, chopped shiitake mushrooms, strips of carrot and strips of wood ear wrapped in hydrated dried bean curd and steamed.  They're served with soy sauce and chopped green onion.  We both agreed that these were delicious for a dish containing no meat.  Here's the shot of the filling (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=aCOYiEaIWv7T3HWTqRR8Pg).\n\nChicken Combination Bun (http://www.yelp.com/biz_photos/cHBLiy_53nQZrsrR-NH_Hg?select=8FD0AwItk92djvd1YaikXA) - My dad and I love Wing Lee's chicken combination buns.  As you can see from the photo there is tender, juicy chicken thigh meat with green onions, a part of a hard boiled egg, a whole shiitake mushroom and a piece of Chinese sausage inside the steamed sweet bun.  Best of all ... no MSG taste.\n\nThe ladies here are cool and all are very much trilingual (Cantonese, Mandarin, English).  If they can understand my Chinglish they can understand anyone.", "rating": 4, "date": "2009-03-30"}, {"excerpts": ["I also ordered the chicken combination bun, the custard bun, and the sesame balls, and I was not impressed with any of these.  ", "They all came with larger size, with bigger portion of the skin/flour.  "], "author": "Elle W.", "review": "It has passed the lunch time and I was really starving. I stopped by at this place and ordered as though there's no tomorrow. It's true that the place is cheap and one can be very well fed under $15. Unfortunately, I am not impressed with the food. \n\nThe size of each dumpling is big, but that's because the skin is thicker than it normally is.  I tried the har gow, shrimp and chive dumplings and vegetable steam dumplings--all of which delivered their usual taste but I am not a big fan of the thick skin. There's also a good amount of fat in each har gow. The egg custard tart tasted really bland and I had a hard time finishing one. I also ordered the chicken combination bun, the custard bun, and the sesame balls, and I was not impressed with any of these.  They all came with larger size, with bigger portion of the skin/flour.  It's not that I am hard to please, but I doubt if you would feel the same if you had been to many other better dim sum places--esp those in SoCal! \n\nThe bottom line is that the place would be a quick fix for anyone craving for dim sum. The best part is that it is cheap. But in terms of the food, don't expect the best or anything impressive here. And be prepared to have some thick skinned dumplings!\n\nStaffs are friendly and the lady who helped me with the order had a smile on her face. Not that it's unusual but probably worth a note. Cash only. Parking depends on luck. I got a spot within 5 min on a weekend.", "rating": 3, "date": "2012-01-01"}, {"excerpts": ["We settled on the coriander gow, beef siu mai, taro dumplings, chicken sticky rice, and a chicken combination bun.\n\n", "The coriander gow were a close second, featuring more shrimp than I thought could fit in something so small, the tangy kick of the Chinese celery, and a rice wrapper thicker than you would think it had a right to be.  "], "author": "Becca S.", "review": "Becca's Christmascapade 2010 - A Triptych.\nPart the First\n\nI wanted to make it a diptych because it's a funnier word but alas, I patronized three businesses on Christmas day.  Wing Lee was the first.  I have previously found it hard to choose to go to a dim sum restaurant other than Good Luck, and so I planned in advance on going to Wing Lee.  My resolve was strong - I had passed by the goodies in their window many times, and the time was nigh for some of those goodies to land squarely in my stomach.\n\nWhen we got there at 11am, it was really crowded!  Prime brunch time on a weekend, so that certainly made sense.  But the line moved quickly, and there was plenty of space at their long, communal tables to fit my boyfriend and me.  The line gave me plenty of time to covetously ogle their bountiful spread (Look, Ma!  No thesaurus!), and I was really impressed.  Their selection seemed to include a few more options than I was used to - combination buns, sweet steamed buns, baked buns, siu mai, potstickers, rice rolls, sticky rice, rice cakes, cakey cakes, and all with a variety of fillings.  We settled on the coriander gow, beef siu mai, taro dumplings, chicken sticky rice, and a chicken combination bun.\n\nThe shining stars, for me, were the beef siu mai.  The meat simply melted in my mouth, and the first bite revealed the glorious innards, in which the beef shone a lovely shade of pink.  The coriander gow were a close second, featuring more shrimp than I thought could fit in something so small, the tangy kick of the Chinese celery, and a rice wrapper thicker than you would think it had a right to be.  The taro dumpings were also impressive, containing more taro than I would have thought could possibly be squished into a dumpling of that size.\n\nThe combination bun and sticky rice were also really good, but not as flavorful as I would have liked.  The combination bun is a really interesting concept, combining multiple parts of a chicken with egg, sausage, and mushroom, but for everything that was in there, it was a little bland.  The bun itself, however, was really substantial but still fluffy.  My other gripe is that Wing Lee dim sum seems to all fall apart rather easily.  I realize this probably happens because the ingredients are fresher, or better for me, but it's a little less fun to eat a dumpling when you're desperately trying to make sure that you don't have to settle for eating all its components separately.\n\nThe atmosphere was delightful, and contained just the right amount of shouting in Chinese from the front counter back into the kitchen.  The tables were all clean, and were wiped down as I was watching, and there was only one bottle of hot sauce in the whole place, but I always find it really fun to share.  I'm very glad I went, and look forward to going again and sampling even more of that impressively ginormous menu.", "rating": 4, "date": "2010-12-26"}, {"excerpts": ["I asked lady if chicken combination bun had any pork. ", "She said \"no pork no pork\" but off course the bun has pork sausage. ", "The beef sui mai is good - no complaints!"], "author": "Try E.", "review": "The dim sum is OK. Its not bad, they typically run out of stuff so good to go there early. I asked lady if chicken combination bun had any pork. She said \"no pork no pork\" but off course the bun has pork sausage. The beef sui mai is good - no complaints!", "rating": 3, "date": "2012-03-10"}], "bake pineapple bun": [], "bake cocktail bun": [], "rice pork soup": [], "rice chicken soup": [], "beef rice roll": [], "shrimp rice roll": [], "sweet rice pork": [], "sweet rice chicken": [{"excerpts": ["Also good is the sweet rice chicken wrapped in banana leaves."], "author": "Daniel L.", "review": "I often stop here for dim sum.  I particularly like their baked barbecued pork buns.  Also good is the sweet rice chicken wrapped in banana leaves.", "rating": 5, "date": "2009-05-13"}], "fried taro dumping": [], "bean cake": [], "b b q pork turn over": [], "fried shrimp leeks": [], "sweet rice boll": [], "chinese bread": [], "bbq chicken": [{"excerpts": ["Upon entering this corner bakery and placed an order of 8 baked BBQ  baos and 4 baked BBQ chicken baos. ", "But they only had BBQ pork buns. "], "author": "Chefs Daughter D.", "review": "While on a Monday in SF, decided to grab a few baked Chinese pork bun (char siu bao). Didnt want to go to Chinatown, so yelped and found this place open on Monday.  Found most Chinese restaurants and/or bakery's are closed on Monday and/or Tuesday's.\n\nAfter a car backing out almost hit us. (Driver apparently backing out didn't see the stopped car on street (waiting for traffic to move forward), made one more round and found a space and fed the meter. Upon entering this corner bakery and placed an order of 8 baked BBQ  baos and 4 baked BBQ chicken baos. But they only had BBQ pork buns. So just got 8 buns for $12.00 ($1.50/ea)\n\nVery disappointed. Bun was dry and smaller than our regular go to SF Bakery.  The filling was minimal, dry, less fat pieces (yes I like bits of fat in it), sweet sauce surrounding the pork mini bits was average, but good.  It was more bread than filling. It took a few bites to get to meat.   After a day, the top bun crust became rock hard too. Literally tapped on it and it was hard.\n\nAs a visiting out of towner, very I hoped for better as I don't frequent the city to often. So this foodie purchase was a bust :(", "rating": 2, "date": "2017-10-28"}, {"excerpts": ["and I think the bbq chicken skewer ", "I had the first time was overkill. "], "author": "Umesh T.", "review": "Been here twice and it delivers good bang-for-the-buck. The chicken steamed bun was pretty good but I prefer the baked chicken buns. I wish the chicken fillings inside the baked buns were fried/grilled instead of the exact same as in the steamed buns.\n\nThe potstickers were a little disappointing. The 'wrap' wasn't all that texturally and I have had more flavourful fillings at many other places. The shrimp sew mai was par for the course and I think the bbq chicken skewer I had the first time was overkill. I liked it!\n\nBoth my meals here were well under the $10 mark and the first time I had only 2 of the potstickers and boxed the remaining 4!\n\nI wouldn't mind jumping in here again for a quick bite, on my way to Schubert's bakery next door, but I'd try the others in the same neighbourhood before I settle on any one \"favourite\" joint.", "rating": 3, "date": "2010-11-14"}, {"excerpts": ["I also love the BBQ chicken skewers - charred to perfection with lots of juicy, flavorful fatty bits laced through each bite. \n\n"], "author": "Diane Y.", "review": "Cash Only!\n\nPopular items are super fresh and hot: shrimp dumplings, pork/other buns, siu mai - anything in the ginormous metal steamers or in the bun ovens. The bun dough is fluffy and a bit sweet, which I love but some find odd. I also love the BBQ chicken skewers - charred to perfection with lots of juicy, flavorful fatty bits laced through each bite. \n\nThe items offered to the left, near the window, are less fresh and not always piping hot. They do offer a few vegetarian options: a vegetarian bun, a tofu skin roll, and the almost-vegetarian fried marinated tofu with mystery fish paste filling (which you can just detach with a fork), but none of these are usually served hot.\n\nI promise they don't serve anything super creepy like mashed brains or chicken feet disguised in buns, so pretty please - don't be the guy who holds up the line pointing at everything asking \"what's that? what's that? what's that?\" If it looks tasty, just try it! It probably will be.", "rating": 4, "date": "2011-05-14"}, {"excerpts": ["Be sure to also try their bbq chicken skewers as well as their pot stickers! ", "It's very affordable!"], "author": "cindy c.", "review": "We always come here for especially their shrimp dumplings---big shrimps! Be sure to also try their bbq chicken skewers as well as their pot stickers! It's very affordable!", "rating": 4, "date": "2009-12-22"}, {"excerpts": ["1 bbq chicken stick + 2 Cha siu baau (one steamed, one baked) "], "author": "Giselle U.", "review": "2 orders shrimp roll + 2 orders har gow, + 2 orders siu mai + 2  orders shark's fin dumplings + 1 bbq chicken stick + 2 Cha siu baau (one steamed, one baked) + 1 order sesame balls + 2 sodas + 1 bottled water = 4 fat asses and roughly $20 ($19.60). \n\nyes, we ate this all in one sitting. (3 girls and 1 guy, oh the shame).", "rating": 5, "date": "2007-05-29"}, {"excerpts": ["anyways, i also got a bbq chicken skewer for $1.50. ", "it wasnt really bbq, but pretty darn good(and cooked!). ", "overall, a solid place. ", "very cheap, but stay away from the chicken buns..."], "author": "Andrew T.", "review": "very cheap stuff here. their meat buns are less than a dollar. apparently the bbq pork one was good(i dont eat pork), but my chicken one was kinda nasty. the chicken was border-line raw looking. of course, my fat-ass still finished it but that's beyond the point. anyways, i also got a bbq chicken skewer for $1.50. it wasnt really bbq, but pretty darn good(and cooked!). overall, a solid place. very cheap, but stay away from the chicken buns...", "rating": 3, "date": "2009-01-05"}]}