{"chips  salsa": [], "garlic pizza bread": [{"excerpts": ["I ordered the Garlic Pizza Bread for starters. ", "It had a lot of crushed garlic. ", "I wasn't expecting that. ", "I like garlic", ", I just wasn't expecting that much of it and that much fresh garlic which is a plus. ", "*", "**", "I'm from the East ", "so fresh garlic isn't so free flying on our dishes. ", "It's something I'm getting used to while being in California. ", "The Garlic Pizza Bread is a great tasting starter. \n\n"], "author": "Carrie K.", "review": "*Tourist Approved.. \n\nI ordered the Garlic Pizza Bread for starters. It had a lot of crushed garlic. I wasn't expecting that. I like garlic, I just wasn't expecting that much of it and that much fresh garlic which is a plus. ***I'm from the East so fresh garlic isn't so free flying on our dishes. It's something I'm getting used to while being in California. The Garlic Pizza Bread is a great tasting starter. \n\nFor my lunch I ordered the delicious Grilled Salmon Bowl. This was filled with fresh sautéed veggies and get this- coconut rice, not plain rice, not brown rice but COCONUT rice. Do you see my amazement? Well, it's because anyone could've put this dish on plain white rice and called it a day but no the creator of the menu put some brains behind it and used his/her culinary degree. Who says tourist places don't offer good food? I beg to differ. This dish also had teriyaki sauce which offered a great balance. \n\n\n** just a little note** this whole area has great shops with good prices, live music, boat tours, retro/classic arcade, Seals docked and talking :) and a bus ride away from China Town.", "rating": 4, "date": "2017-06-12"}, {"excerpts": ["Had some beers and the garlic pizza bread. ", "Was tasty but only if you LIKE garlic! ", "The Restroom set up is ", "TOTALLY weird. ", "Co-Ed sinks with private restrooms and ", "you enter through a circus big top tent."], "author": "Amy W.", "review": "David at the Bar is a hoot! Had some beers and the garlic pizza bread. Was tasty but only if you LIKE garlic! The Restroom set up is TOTALLY weird. Co-Ed sinks with private restrooms and you enter through a circus big top tent.", "rating": 4, "date": "2017-10-27"}, {"excerpts": ["They served us Hawaiian pizza, garlic pizza bread, fish and chips, though I think their garlic fries were the best. ", "The restrooms were so confusing! ", "I saw a male coming out of the restrooms and there were no signs, so I just awkwardly stood outside the door! ", "The waiters were nice to us. ", "I must admit though, this place is quite pricey for dishes that are not particularly spectacular or unique. ", "Nonetheless, it's a great place to eat while touring!"], "author": "Sharon H.", "review": "The place is packed with people and waiters are rushing in and out. They served us Hawaiian pizza, garlic pizza bread, fish and chips, though I think their garlic fries were the best. The restrooms were so confusing! I saw a male coming out of the restrooms and there were no signs, so I just awkwardly stood outside the door! The waiters were nice to us. I must admit though, this place is quite pricey for dishes that are not particularly spectacular or unique. Nonetheless, it's a great place to eat while touring!", "rating": 4, "date": "2017-06-26"}, {"excerpts": ["Well, we used the coupon that gives you free garlic pizza bread with an entree purchase. ", "The garlic pizza was made with fresh minced garlic and was delicious. ", "We also ordered some yummy 23 oz cocktails to go with our meal. ", "I wasn't too hungry ", "so I got a bowl of the clam chowder and shared a little of my fiancé's teriyaki burger. ", "The clam chowder had lots of chunks of clam in it which I thought was awesome. ", "I had some the day before at another restaurant ", "and I swear it was all potato and no clam. ", "The bowl was very filling and only $1 more than a cup. "], "author": "Mo M.", "review": "Definitely a tourist spot but rightfully so. If you're sitting outside you get to do lots of people watching and if you're inside you get a great view of the water and boats. So, you win either way. \n\nWe got a coupon from the Pier 39 fun pack that we obtained at the welcome center. Oh and did I mention that the coupon book was free with my Yelp checkin?! How awesome is that? Well, we used the coupon that gives you free garlic pizza bread with an entree purchase. The garlic pizza was made with fresh minced garlic and was delicious. We also ordered some yummy 23 oz cocktails to go with our meal. I wasn't too hungry so I got a bowl of the clam chowder and shared a little of my fiancé's teriyaki burger. The clam chowder had lots of chunks of clam in it which I thought was awesome. I had some the day before at another restaurant and I swear it was all potato and no clam. The bowl was very filling and only $1 more than a cup. You can also upgrade to a bread bowl for $3 more. \n\nMy fiancé's teriyaki burger was very good.  Lots of gooey cheese, yummy grilled pineapple and perfectly cooked chicken. Good stuff. \n\nYes though some might call this a tourist trap, I would say they actually did a great job! Oh and did I mention that service was great too? Our waitress was always wearing a smile, attentive and even answered our touristy questions. Thumbs up!!", "rating": 5, "date": "2015-10-01"}, {"excerpts": ["So we ordered Clam Chowder with bread bowl and Garlic Pizza Bread which was perfectly $15. \n\n"], "author": "Alice C.", "review": "We had to find a place to get a validation for Pier 39 Garage. So we happen to go to this place because this place is the first place that you see when you enter the Pier 39. You need to spend $15 in order to get a validation. So we ordered Clam Chowder with bread bowl and Garlic Pizza Bread which was perfectly $15. \n\nTheir service was so so because they have a lot people working but it is really hard to call someone for help. JUST A FRIENDLY REMINDER, when the waitresses sat you close to the windows or close to the bathroom, don't sit there. IT STINKS! \n\nAlso, the worst and the funniest thing is that when the check was given and put the cash, the waitress asked if I needed change when the change was over $5. I don't think I would give $5 tip for eating $15. So I hope they don't do that... People leave the full cash, if they want to give the change as a tip. But if a customer waits on a table to get a change that means they want the change! OK?", "rating": 2, "date": "2014-11-07"}, {"excerpts": ["We ordered the garlic pizza bread and one of the burritos. ", "The food and service were quite good. ", "Prices were a little high, but that tends to be the trend in The city."], "author": "Robin W.", "review": "The hubby and I were looking for someplace to eat after the Alcatraz night tour and stumbled upon this place. We ordered the garlic pizza bread and one of the burritos. The food and service were quite good. Prices were a little high, but that tends to be the trend in The city.", "rating": 3, "date": "2014-06-26"}, {"excerpts": ["One thing and one thing only: garlic pizza bread. ", "Whenever I went ", "(the numerous two visits) ", "I always had the opportunity to get this item for free thru mobile check-in or printed coupons. ", "Either way, even if it wasn't free, I would still like them. ", "And that, fellow yelpers, is the sole reason why I give this place three stars."], "author": "Christine C.", "review": "There's nothing amazing about their food, or their menu. They definitely tried. I saw the effort when they put mango baby back ribs in their appetizer section, and decided to give it a try. Meh. Gave them another try when I came back a second time, this time for chili cheese fries... Ok I didn't specifically go there for chili cheese fries, but that (for some weird reason) was the most appealing to me at that time. Nope. Couldn't even finish a 1/4 of it.\n\nMy goodness, is there anything good about this place? Why did I give it three stars if I claimed to not have liked anything that I've tried so far? One thing and one thing only: garlic pizza bread. Whenever I went (the numerous two visits) I always had the opportunity to get this item for free thru mobile check-in or printed coupons. Either way, even if it wasn't free, I would still like them. And that, fellow yelpers, is the sole reason why I give this place three stars.", "rating": 3, "date": "2014-03-10"}, {"excerpts": ["I started with a garlic pizza bread appetizer.  ", "I was starving, so I needed something quickly.  ", "The bread part of it was pretty good - light on the inside, crunchy on the outside.  ", "But the sauce wasn't very saucy.  ", "It seemed coagulated and dry.  ", "The cheese was okay.  "], "author": "Ben B.", "review": "It had been nearly 24 hours since I'd eaten, so Wipeout could have served me a plate of sea lion nostrils and I would have thanked them for it.  As it is, Wipeout is merely adequate, but I liked my server.\n\nThe place has a very Jimmy Buffett/Margaritaville quality to it, which would usually cause me to start throwing condiments.  But thankfully, I heard not a single Buffett tune, so the surf motif gets a pass this time.  There is a fire pit outside, which looked like it would be a cool place to eat.  As I was dining alone, though, I stood no chance of dislodging the baby boomers crowded around the flame.  No matter.  I pulled up a picnic table.\n\nI started with a garlic pizza bread appetizer.  I was starving, so I needed something quickly.  The bread part of it was pretty good - light on the inside, crunchy on the outside.  But the sauce wasn't very saucy.  It seemed coagulated and dry.  The cheese was okay.  Still, I finished the plate.\n\nI ordered the barbecue burger with garlic fries.  For burger that contains fried onions, pepper jack cheese and bbq sauce, it essentially had no flavor at all.  But most of the food I've had in SF has been exceedingly bland, so maybe that's par for the course.  Thumbs down, Wipeout.\n\nThe garlic fries were actually pretty good.  My server initially brought my plate with regular fries, but quickly returned with a basket of the garlic version I'd ordered.\n\nBy no means should you make Wipeout Bar & Grill a go-to dinner destination.  But if you're looking for some decent appetizers and a good atmosphere for a few drinks, it may hit the spot.", "rating": 2, "date": "2009-10-14"}, {"excerpts": ["The garlic pizza bread was good for a snack, but honestly a kid at home could've put cheese on bread with some sauce and cook it up. ", "This was such a disappointment. ", "A glass of coke was 4 dollars as well. ", "I know it's pier 39 but really. ", "You would be better checking out pier 23 and paying a little more for quality seafood done right."], "author": "Miguel F.", "review": "Maybe it's because I ordered tacos but this restaurant was a joke. I could've made better fish tacos. There was no spice and the tacos were flavorless. The garlic pizza bread was good for a snack, but honestly a kid at home could've put cheese on bread with some sauce and cook it up. This was such a disappointment. A glass of coke was 4 dollars as well. I know it's pier 39 but really. You would be better checking out pier 23 and paying a little more for quality seafood done right.", "rating": 2, "date": "2014-07-28"}], "gnarly garlic fries": [{"excerpts": ["The gnarly garlic fries were delicious! ", "Definitely worth a stop in. ", "Unfortunately, the BBQ pork sandwiches come with very little BBQ to them, and the sauce is a very generic ketchup-type style. ", "Drinks are very expensive, especially considering McDonald's is just down the street with $1 large drinks. ", "Still... Garlic fries are amazing!"], "author": "Kari C.", "review": "Decent food - stopped at there to go section. The gnarly garlic fries were delicious! Definitely worth a stop in. Unfortunately, the BBQ pork sandwiches come with very little BBQ to them, and the sauce is a very generic ketchup-type style. Drinks are very expensive, especially considering McDonald's is just down the street with $1 large drinks. Still... Garlic fries are amazing!", "rating": 3, "date": "2016-07-13"}, {"excerpts": ["The Gnarly Garlic fries were also SLAMMING, though the whole \"fresh\" garlic makes me want to slap someone, it isn't fresh if it was made a few days ago people ... ", "I don't have any proof but the taste said \"I am not fresh you lover of garlic above all things\" (vampires would die if they touched me.)  ", "The Shrimp Burrito ... not spicy, but very tasty.  "], "author": "Brad S.", "review": "There are places that you eat at just because they look cool, there are places that you eat at because you get recommend .... and then there are places that you eat at because they say they have a big burrito (and look pretty cool.)  \n\nSo everyone has been saying that the service is good.  They are wrong, Molly was one of the best servers I've had.  She was attentive but not pushy, every question I asked (a lot because I was feeling pedantic)  she either knew the answer to of went to find out, the recommended drink (Shawna's Summer Splash) could have had paint thinner in it and I still would have drank the whole thing, it was GREAT!\n\nThe kids meal was not a big hit, for my son, but I thought the dog was really good.  The Gnarly Garlic fries were also SLAMMING, though the whole \"fresh\" garlic makes me want to slap someone, it isn't fresh if it was made a few days ago people ... I don't have any proof but the taste said \"I am not fresh you lover of garlic above all things\" (vampires would die if they touched me.)  The Shrimp Burrito ... not spicy, but very tasty.  It wasn't the size of a Hula Hut Tubular Taco, but it was big enough to make me feel like I was going to bust through my pants.  \n\nFYI there is a nice photo op right close with half of a VW minibus, pretty funny, there is also a pretty good one with the surfer dude hanging out.  I really enjoyed this place, and would recommend it.  Very Tasty!\n\nThe only complaint I have is the music was drowned out by the tool at the front of Pier 39 trying to sell his CDs.  Dude, if I want to buy a CD I'll go to a store, or iTune it.", "rating": 4, "date": "2009-11-25"}], "outrageous onion rings": [{"excerpts": ["The OUTRAGEOUS Onion Rings are just Heavenly sitting alongside my Jalapeno Burger....YOWZA.... ", "Outstanding Job! ", "and I washed it all down with a SPIKED Arnold Palmer....", "the wife had her usual OFF ", "THE LIP Lemondrop and the TACO Salad...", "Love this place. ", "The servers are SO Friendly and know the answer to every question and are happy to suggest something different. ", "That along with the AMAZING FOOD AND DRINKS is why we keep coming back time after time. ", "People visit us from all over the country and we send them here every time and they all \"Praise\" my suggestion!!\n", "Keep it going Please", "....Hats Off to Wipeout Bar & Grill         ", "BRAVO !!  :-)"], "author": "Carl G.", "review": "WOW...I wish I could give 6 Stars! The OUTRAGEOUS Onion Rings are just Heavenly sitting alongside my Jalapeno Burger....YOWZA.... Outstanding Job! and I washed it all down with a SPIKED Arnold Palmer....the wife had her usual OFF THE LIP Lemondrop and the TACO Salad...Love this place. The servers are SO Friendly and know the answer to every question and are happy to suggest something different. That along with the AMAZING FOOD AND DRINKS is why we keep coming back time after time. People visit us from all over the country and we send them here every time and they all \"Praise\" my suggestion!!\nKeep it going Please....Hats Off to Wipeout Bar & Grill         BRAVO !!  :-)", "rating": 5, "date": "2015-03-20"}, {"excerpts": ["the \"Outrageous Onion Rings\" and some \"Sweet Potato Fries\"\n\nService was okay"], "author": "Kiyana D.", "review": "Tried this place about a year ago.\n\nI was expecting this place to be bad. But it was actually pretty good, considering that it was in Pier 39, and the last place you'd expect yourself to be eating at a burger place. Rather than going down to fishermans wharf to get a clam chowder. \n\nMy boyfriend and I both ordered the \"Wipe Out Burger\" without bleu cheese.\nthe \"Outrageous Onion Rings\" and some \"Sweet Potato Fries\"\n\nService was okay, it wasn't that busy but our server did come around often to refill our drinks and check on us which I liked. Over all, I'd eat here again.", "rating": 4, "date": "2012-11-17"}], "spicy chicken wings": [], "crispy fried calamari": [{"excerpts": ["We had crispy fried calamari for appetizers, and it was great, but there was a long wait between the appetizer and the main course itself. ", "As hungry as we were, we ordered another crispy fried calamari and soon right after we got our main course.  "], "author": "Rheine T.", "review": "We were just walking all the way down Pier 39, and just figured, what the heck, we're hungry, let's enter.  Got a window seat, very nice view, you can see Alcatraz from where we were seating.  We had crispy fried calamari for appetizers, and it was great, but there was a long wait between the appetizer and the main course itself. As hungry as we were, we ordered another crispy fried calamari and soon right after we got our main course.  The main theme of this restaurant is seafood but good thing they have a Teriyaki Chicken Bowl, the serving was really huge, but maybe it's because we ate two appetizers and it literally just filled us up.  As I said, SF can be a bit pricey, the Teriyaki Chicken Bowl was $13.95, but it was okay because it was tasty!  The calamari was $8.95 so times two that's $17.  It was worth it, but once this restaurant gets busy, which is all the time I think, there may be a quite a long wait for seats.", "rating": 4, "date": "2011-07-29"}], "coconut fried shrimp": [{"excerpts": ["However, our friend (who wasn't that hungry) only went with the \"Coconut Fried Shrimp\" (which was priced at $10.95) and was not satisfied how small the amount of food was that she got. ", "My entree (that was only a mere $2.00 more) had way more overall food. "], "author": "Donovan H.", "review": "When you have a tourist trap area like Pier 39/Fisherman's Wharf in the most popular part of San Francisco, one might always assume that food & drink prices are absurdly inflated. Not to mention, some of these restaurants offer only mediocre quality food. Surprisingly, this isn't quite the case with \"Wipeout Bar & Grill\".\n\nAs far as getting to this restaurant (located in the heart of Pier 39), it is relatively easy to find as you will see giant wooden posts paired up with palm trees and surfboards, it almost looks like a place that should be in Malibu or Honolulu and not a cool climate like San Francisco. Forget about driving to this place; the parking garage is located a couple blocks away. My advice is to either walk, bike, take a cab, Muni bus, or trolley.\n\nThis is actually my second time dining here, however it is my first review on the place. I came here with my lady and our friend (who was celebrating her birthday over Labor Day weekend). We arrived around 5:30pm (on the afternoon of Sunday 9/4/16) and were told by the hostess it would be about a 35-minute wait. Unfortunately, this place does not provide the portable buzzers when your table is ready; nor do they text you. Not a big deal but staying near the restaurant hearing for someone to call your name can be challenging, especially since it is very loud inside.\n\nAnd speaking of the inside, you will find a fairly large and spacious dining area complete with a very surf-inspired theme to it. Some of the tables are even carved out as surfboards. And for the serious surf enthusiasts, there is also a chalkboard that lists the daily surf reports as well as shark attack reports. One thing I didn't really care for were the bathrooms. A restaurant this busy only had 3 toilets (with private doors) that are used by men & women while the sink is located outside. That's a bit odd if you ask me. The outside has plenty of seating to dine as well as fire pits for those cold, foggy San Francisco days.\n\nFortunately the wait time was only 20 minutes and we are all seated around 5:50pm. Our hostess (whom I forgot her name) was very friendly and had an awesome personality. We all ordered drinks, I was craving an iced cold beer so I went with a 20 oz. size of the Ballast Point Sculpin IPA. To eat, I decided on their \"Teriyaki Pineapple Chicken Sandwich\" (for $12.95). This consisted of a grilled chicken breast, teriyaki sauce, grilled pineapple and jack cheese served on a toasted bun. As my side of choice, I went the healthier route and went with a side salad w/vinaigrette dressing.\n\nAs busy as this place was, all three of us got our meals out in less than 15 minutes; I find that to be quite impressive. Now onto the food.. I actually enjoyed every bite of my pineapple chicken sandwich. It was flavored very well and was a very generous portion that filled me up very well. My lady ordered their \"Teriyaki Chicken Rice Bowl\" and she loved her meal as well. However, our friend (who wasn't that hungry) only went with the \"Coconut Fried Shrimp\" (which was priced at $10.95) and was not satisfied how small the amount of food was that she got. My entree (that was only a mere $2.00 more) had way more overall food. So it really depends on what you order that determines if you get your moneys worth or not.\n\nOverall, \"Wipeout Bar & Grill\" is a decent place that won't burn a hole in your pocket. They do serve breakfast, a huge variety of drinks (with a full bar & several beers on tap), and finally a decent dessert menu. And speaking of desserts, our friend (the birthday girl) had Happy Birthday sung to her and got complimentary chocolate lava cake with vanilla ice cream and whipped cream. So all in all, its a solid 4-star dining experience, not the best place I've been to but far better than some of the other overpriced touristy restaurants in the area.", "rating": 4, "date": "2016-09-07"}, {"excerpts": ["I started off with the coconut fried shrimp. ", "Too much coconut and the dipping sauce wasn't all that. ", "Then I continued with buffalo wings. ", "They were saucy and juicy-- the best part of my meal for sure. ", "I finished my meal off with the the chorizo & chicken pizza. "], "author": "Phi N.", "review": "The items I ordered sounded better on paper. I started off with the coconut fried shrimp. Too much coconut and the dipping sauce wasn't all that. Then I continued with buffalo wings. They were saucy and juicy-- the best part of my meal for sure. I finished my meal off with the the chorizo & chicken pizza. Both the meats and the pizza itself was really dry\n\nService was good; waitress kept the refills coming and was patient with our indecisive ordering, lol.", "rating": 3, "date": "2015-11-28"}], "wipeout nachos": [{"excerpts": ["We had wipeout nachos with chicken as an app, Baja fish tacos as my entree, and both my sister and fiancé had coconut shrimp. ", "The food really was delicious. ", "It was an extremely busy day / time ", "so I'm sure that's why everything came out fast."], "author": "Kimber B.", "review": "Dropped in here after a whale tour. We were quickly seated even though the place was packed! The waitress let us know that she was new and didn't have everything down yet which I thought was nice. We ordered an appetizer and the waitress, while she was very sweet, was kinda pressing us to order entrees at the same time. I told her I didn't want the app and entrees to come out at the same time and she said they wouldn't, so we ordered everything at once. Well.... everything came out at once and the table was extremely crowded- which isn't too big of a deal since all the food was great. We had wipeout nachos with chicken as an app, Baja fish tacos as my entree, and both my sister and fiancé had coconut shrimp. The food really was delicious. It was an extremely busy day / time so I'm sure that's why everything came out fast.", "rating": 4, "date": "2018-06-09"}, {"excerpts": ["Wipeout Nachos, were actually pretty good and well prepared.. "], "author": "Mike H.", "review": "ok, USUALLY, I hate trying tourist trap restaurants, and being on Pier 39, the menu seemed enticing.. \n\nBeer / had decent options, but the one I wanted was just tapped, and warm, so stuck it out with Water... boo\n\nCalamari Appetizer was mediocre, little \"greasy\" but decent portion size. Wipeout Nachos, were actually pretty good and well prepared.. Not a bean person, but this dish was tolerable with the cheeses, and added fixins.. \n\nNow the MAIN reason for 4 stars, was the Sesame Tuna Salad.. yes a damn salad.... OK? .. Large slice of AHI Tuna on top of COCONUT Rice, with some seared veggies.. Very nice portion size, and couldnt finish the entire dish.... Coconut Rice was badass.. no JOKE, with hints of cilantro n a few other items like garlic, etc,,, but damn, one of my all time favorite rice dishes... Stir Fried veggies are always great and healthy. Now the only downfall, was the AHI was a over cooked, \"seared\" but definitely wasn't rare in the middle, which I would have loved, but was edible enough to enjoy.. \n\nYes, I would come back here with the family... Out and about on my own ? hmmm, that Rice though,,,, !!", "rating": 4, "date": "2017-12-20"}, {"excerpts": ["wipeout nachos very good ", "but i asked for no pico de gallo ", "but the waitress must of forgot since the dont write down peoples order which i thought was weird. ", "We had to keep telling her she missed two of our starter orders. ", "The baby back ribs were good but definitely \"baby backs\" very small should have called them short ribs but flavor on point not a bar b que sauce but a teriyaki taste \"sweet sour and a little spice\" wipeout seafood plate very good and garlic fries good very \"garlicky\" not much parmesan great for garlic lovers. ", "Free refills which is great considering the 3 dollar and something charge for a medium size cup. ", "Yes i would go again and try something else wont hurt to try for a second time"], "author": "Sasha J.", "review": "Place looks crowded but its really not there time for waiting for a table is not long maybe 15 mins at the most. Food was pretty good..wipeout nachos very good but i asked for no pico de gallo but the waitress must of forgot since the dont write down peoples order which i thought was weird. We had to keep telling her she missed two of our starter orders. The baby back ribs were good but definitely \"baby backs\" very small should have called them short ribs but flavor on point not a bar b que sauce but a teriyaki taste \"sweet sour and a little spice\" wipeout seafood plate very good and garlic fries good very \"garlicky\" not much parmesan great for garlic lovers. Free refills which is great considering the 3 dollar and something charge for a medium size cup. Yes i would go again and try something else wont hurt to try for a second time", "rating": 3, "date": "2018-07-21"}], "honey bbq babyback ribs": [], "bacon blue cheese fries": [{"excerpts": ["Finally placed our order for 2 drinks and the Bacon Blue Cheese Fries. ", "Asked to close out immediately after as we were sort of on a time crunch. ", "Food and drinks took literally forever to come out. ", "And each time the person bringing whatever over seemed confused or lost. ", "With both the drinks and fries, the server walked by us, looked around with a puzzled look on his/her face, and then finally set down whatever they had at our table. ", "Drinks were extremely watered down, tasted as if they put a teaspoon of alcohol in it. ", "The french fries, however, were very good, as I had never had fries with blue cheese and I LOVE blue cheese. ", "Also, despite the fact that we asked for the bill immediately after ordering, that took another 15 minutes to get to us. ", "And then another 15 to receive the copies to sign. ", "We were also not checked on once. ", "Overall, fries were good, drinks were watery, and service was just a no. ", "Will most likely never come back."], "author": "Genevieve M.", "review": "Attended the Spring Wine Pour at Pier 39 and was waiting for someone to join our party. Spotted this restaurant as it is one of the first ones you see at the entrance to the pier. Decided to grab a drink with a friend while waiting.\n\nWas greeted (or not) by an un-smiling hostess. Asked if there was some room at the bar for 2. There wasn't, so we were seated on the patio where at least we could watch the passerby. We were handed our menus and didn't get approached for another 15 minutes. Finally placed our order for 2 drinks and the Bacon Blue Cheese Fries. Asked to close out immediately after as we were sort of on a time crunch. Food and drinks took literally forever to come out. And each time the person bringing whatever over seemed confused or lost. With both the drinks and fries, the server walked by us, looked around with a puzzled look on his/her face, and then finally set down whatever they had at our table. Drinks were extremely watered down, tasted as if they put a teaspoon of alcohol in it. The french fries, however, were very good, as I had never had fries with blue cheese and I LOVE blue cheese. Also, despite the fact that we asked for the bill immediately after ordering, that took another 15 minutes to get to us. And then another 15 to receive the copies to sign. We were also not checked on once. Overall, fries were good, drinks were watery, and service was just a no. Will most likely never come back.", "rating": 2, "date": "2017-05-22"}], "new england clam chowder or chili con carne": [], "caesar": [{"excerpts": ["My caesar salad was like many other restaurants. ", "I wish the chicken would have been warm though. ", "Overall, this was a good stop."], "author": "Rebecca D.", "review": "We came here because we were hungry after getting into the fisherman's wharf area. We liked the restaurant because of their dog friendly patio. The theme of the restaurant was your typical nautical flare, but done well. The prices where cheaper than I was expecting but still cost us 60 for an app, meals and drinks. Our dog was given a water bowl by the staff. The onion rings where done really well. My boyfriend wishes they toasted the bread for the clam chowder bread bowl. My caesar salad was like many other restaurants. I wish the chicken would have been warm though. Overall, this was a good stop.", "rating": 4, "date": "2018-06-29"}, {"excerpts": ["and then we got the Caesar salad which was a good salad for sure. ", "The fries were like $8.95.... ", "expensive "], "author": "Melissa M.", "review": "Such a great place to eat!!! First off we are from out of town and have no idea what's around. When we walked and I searched up pics on yelp I confirmed of what already was to be true- this place will knock my socks off. \n\nWe first ordered the garlic fries (made perfectly. Not too garlicky and just right!!) and then we got the Caesar salad which was a good salad for sure. The fries were like $8.95.... expensive but i dunno.... \n\nThen we got 2 salmon bowls (one for each of my friends) and I got the carne asada  Baja tacos which had skirt steak and a beautifully made dressing on top. We were sooooo full and enjoyed every last bit!!! \n\nTotal came out to be $100.20 with one alcoholic drink called strawberry mango tequila \n\nNot bad? But yes it's pricey - worth it? I think so.. \n\nOur waitress's name was Iris. Super nice and sweet girl!!", "rating": 5, "date": "2017-08-16"}, {"excerpts": ["I got the Caesar salad and grilled teriyaki and pineapple sandwich. ", "5 stars all around"], "author": "Courtney M.", "review": "Great food at a great value. Hopefully you have the pleasure of having Brandon D. as your waiter!! Great service as well as a great personality!\n\nI got the Caesar salad and grilled teriyaki and pineapple sandwich. 5 stars all around", "rating": 5, "date": "2015-07-02"}, {"excerpts": ["My caesar salad was delish as well. ", "The ambiance is nice and pulls you away from the business of the pier for a while and the decor is very cute and beach themed."], "author": "Jenelle G.", "review": "Service was amazing. Our waitress was very attentive and helpful. She even gave us extra clam chowder when it was already overfilling the bread bowl. My caesar salad was delish as well. The ambiance is nice and pulls you away from the business of the pier for a while and the decor is very cute and beach themed.", "rating": 4, "date": "2013-01-05"}], "bbq chicken salad": [{"excerpts": ["I had the bbq chicken salad, with salmon instead of chicken.  ", "The lettuce wasn't the freshest, the salmon was a decent sized piece but tasteless and there was no bbq sauce or zing to be found.  ", "You know when you're pouring tons of Ranch on a salad ", "and it's still blah, that it's just not a great salad.  "], "author": "Lucky S.", "review": "Fun looking, beach-themed restaurant on pier 39 with great patio seating that's perfect for enjoying people watching and the weather on a beautiful day.\n\nWe had great service, but the food itself was mediocre, at best.  Not awful, but certainly not as good as other options.  \n\n\nI had the bbq chicken salad, with salmon instead of chicken.  The lettuce wasn't the freshest, the salmon was a decent sized piece but tasteless and there was no bbq sauce or zing to be found.  You know when you're pouring tons of Ranch on a salad and it's still blah, that it's just not a great salad.  :/\n\nMy son ordered the ahi tuna bowl.  He said the fish was decent, but the rest he refused to eat.\n\nWe did order onion rings and those were pretty yummy.\n\nIf you decide to come, know that it's for the vibe and outdoor patio and not the great food.", "rating": 3, "date": "2016-04-01"}, {"excerpts": ["I had the BBQ chicken salad and it was pretty good.  ", "My wife had the BBQ ribs sampler that has 6 ribs which was plenty for her meal.  ", "The ribs were good though and regretted not ordering that for myself."], "author": "Bruce C.", "review": "We had dinner and it was a good experience with good service.  Beers were a little pricey but what do you expect in San Francisco.  I had the BBQ chicken salad and it was pretty good.  My wife had the BBQ ribs sampler that has 6 ribs which was plenty for her meal.  The ribs were good though and regretted not ordering that for myself.", "rating": 4, "date": "2017-10-28"}, {"excerpts": ["I had the bbq chicken salad and it was delicious."], "author": "R C.", "review": "This place was great!! After a long walk our family was hungry. They sat us right away and the staff was quick and efficient!  Food was fantastic and not overly priced like you would expect at other tourist locations. I had the bbq chicken salad and it was delicious.", "rating": 5, "date": "2015-11-29"}], "grilled salmon salad": [{"excerpts": ["I ordered the Grilled Salmon Salad (no dressing) and the Boyfriend ordered the WipeOut Fried Combo. ", "When the my salad came out I was disappointed on the size of the salmon. ", "However, the taste of the salmon was juicy and perfect. ", "It is the best salmon I tasted at a bar & grill by far. "], "author": "Cathy N.", "review": "The one thing that attracted me the most about this spot that it was the first spot upon my arrival on Pier 39 that had a patio area to eat. Then it was the people, the people that this place attracts. How it was decorated, what they offered opened to people who are casually dress and could afford a tasty meal.\n\nSo after we walked along the Pier, we headed back out to this spot to have lunch. We were a bit confused on where the entrance was. There was a separate windows to place order to go. Then another door to the patio from the inside. The actual door for us to get seated was located at the very front.\n\nNot surprisingly, it was incredibly busy. I asked the hostess how long is the wait. She responded, \"10-15 minutes.\" \"Oh okay. Party for two (2) please.\" \"Sure.\" They started to call out names one after the other. So if you weren't around when they called it, you missed your chance at a table. They went through it quick. As if they didn't have patience. So instead of us waiting for 10-15 minutes, we only stood there for a few minutes. =]\n\nIt was a beautiful day; the weather was perfect. It was noisy but very relaxing. Our server was Breaker. He greeted us with a smile (plus!) and helped us right away. Gave us the right amount of time to pick out our entree selection and served us our drinks and food at a fair timely matter.\n\nI ordered the Grilled Salmon Salad (no dressing) and the Boyfriend ordered the WipeOut Fried Combo. When the my salad came out I was disappointed on the size of the salmon. However, the taste of the salmon was juicy and perfect. It is the best salmon I tasted at a bar & grill by far. I tried some of the boyfriend's dish and it was definitely delish.\n\nThe service was excellent, the dish is good so I definitely would recommend this spot to others again. I wish there wasn't as much pigeons there. I felt like my food was going to get pooped on. Hehee.", "rating": 4, "date": "2012-06-24"}], "seared tuna salad": [{"excerpts": ["that's all the kid wanted) and the seared tuna salad.  ", "The salad was huge, fresh ad delicious; the tuna was perfectly cooked, i.e. not overcooked in the slightest.  "], "author": "Susie C.", "review": "In true tourist fashion, we ate here our first night in SF (2 adults, 2 kids).  We waited about 10 minutes to be seated inside where it was warmer.  Service was pretty good although once the mumbling waiter delivered our food he never checked on us.  We ate the BBQ burger, a plain burger, extra fries (what?  that's all the kid wanted) and the seared tuna salad.  The salad was huge, fresh ad delicious; the tuna was perfectly cooked, i.e. not overcooked in the slightest.  The BBQ burger was ordered medium rare and the waiter gave us a heads up that it would be bloody in the middle -- that was welcome news, and that's how it was cooked, too.  Total tab about $80 with tax and tip (we all drank water).", "rating": 4, "date": "2015-12-29"}], "thai style steak  noodle salad": [], "cheese please": [], "pipeline pepperoni": [], "buffalo chicken": [{"excerpts": ["I got the buffalo chicken pizza and my boyfriend got the Baja fish tacos. ", "The pizza tasted like it's frozen and just popped in an oven. ", "And the fish tacos was pretty good, but the beans and rice that went with them not so good! ", "The rice had a weird taste and the black beans were sweet. ", "Service and drinks were good, but the food was not so good."], "author": "Jenni M.", "review": "Came to San Francisco as a tourist and we got\nHungry after walking pier 39 so we stopped here to get dinner. The service was nice and fast. We got margaritas and they were delicious, but the food was not so delicious. I got the buffalo chicken pizza and my boyfriend got the Baja fish tacos. The pizza tasted like it's frozen and just popped in an oven. And the fish tacos was pretty good, but the beans and rice that went with them not so good! The rice had a weird taste and the black beans were sweet. Service and drinks were good, but the food was not so good.", "rating": 3, "date": "2018-03-28"}, {"excerpts": ["Went here again this weekend and got the Buffalo Chicken Pizza again. ", "So good. ", "This time I remembered to take pictures before I ate it. ", "Our server was nice and attentive. ", "We decided to sit outside and they put us under a heat lamp. ", "We were getting a little too warm ", "so we asked if we could move to another table. ", "They were really nice about it."], "author": "Dee P.", "review": "Went here again this weekend and got the Buffalo Chicken Pizza again. So good. This time I remembered to take pictures before I ate it. Our server was nice and attentive. We decided to sit outside and they put us under a heat lamp. We were getting a little too warm so we asked if we could move to another table. They were really nice about it.", "rating": 4, "date": "2013-09-23"}], "primo pesto": [], "hawaii  ohhhh": [], "chorizo  chicken": [], "the veg head": [], "build your own pizza": [], "fish  chips": [], "fried calamari  chips": [], "coconut shrimp  chips": [], "wipeout fried combo": [{"excerpts": ["and I was told that their most ordered dishes include burgers and the Wipeout Fried Combo, and fish tacos. ", "I'll definitely try a burger next time ", "I go there "], "author": "Lara T.", "review": "I had the Wipeout Fried Combo- it was massive and superb! My friend had a Veggie burger which was bland though. Their fries are really good though! and I was told that their most ordered dishes include burgers and the Wipeout Fried Combo, and fish tacos. I'll definitely try a burger next time I go there :)\n\nThe service is pretty good, waiters/waitresses pretty nice and helpful!", "rating": 4, "date": "2016-02-26"}, {"excerpts": ["had Wipeout Fried Combo - Fried Fish, Calamari and Coconut Shrimp w/fries and coleslaw.  ", "The food was very fresh, good and hot!  ", "The fish was big, golden fried and crunchy!  "], "author": "Vikki J.", "review": "Wipeout Bar and Grill is always packed so it was time for us to give it a try.  Even though the place was packed we were seated right away back in the back by the windows.  Our waitress was very nice and friendly and the service was fast and good!\n\nI had the Fish and Chips w/fries and coleslaw and hubby had Wipeout Fried Combo - Fried Fish, Calamari and Coconut Shrimp w/fries and coleslaw.  The food was very fresh, good and hot!  The fish was big, golden fried and crunchy!  The fries were fresh and hot and the coleslaw was good with a little bit of crunch, not mushy.\n\nWe had a very good experience and will definitely be back on our next trip to San Francisco!", "rating": 4, "date": "2015-06-13"}, {"excerpts": ["I ended up loving my dish, it was the Wipeout Fried Combo. ", "Ton of food and it tasted great. ", "I'd definitely come here again."], "author": "Steve W.", "review": "I've been to Pier 39 a bunch but this is the first time I've ever eaten here... What made the whole experience so good was our waiter. The guy (Brandon) was chill, down to earth, told us what he liked and didn't like, he took time to explain the different plates, and never left our waters empty. By far one of the best waiters I've ever had. \n\nI ended up loving my dish, it was the Wipeout Fried Combo. Ton of food and it tasted great. I'd definitely come here again.", "rating": 5, "date": "2015-04-26"}, {"excerpts": ["My sister and her friend ordered the Wipeout Fried Combo ($15.99) and it's a fried fish, fried calamari, and coconut shrimp platter.  ", "It looked rather appetizing ", "but I didn't want to try it because I don't know about them ", "but I hate it when people want to try my food or share.  ", "\"Get your own, dude\".  "], "author": "Tram N.", "review": "Parking validation if under 2 hours - pretty sweet and I dig the unisex-style restroom because it's something I have never seen or been to plus they do have a baby changing station that is relatively clean.  They do have at least one restaurant personnel in the restroom facility at all times to ensure cleanliness and to assure patrons that it is a boys' and girls' bathroom, haha.   \n\nThe wait time wasn't that long for a Saturday night.  I think we waited for about 10 minutes?  The hostess was nice and our server at first was also nice however, during the middle of our meal, there was a server exchange due to her lunch so what I heard from the group was that the replacement server was rude and plain out sucks.  Fortunately for her, I wasn't present or else I would have said something.  \n\nI knew I wanted clam chowder because I'm in San Francisco and it's a mandatory soup to order especially at the pier and I did but I refrained from ordering it in a sourdough bread bowl because I did not want to consume over 800 calories and over 70g of carbs, not to mention over 25g of fat in a soup - SOUP!!!  Plus I was spending money left and right that weekend so my soup costs just $4.99.  I can spend lavishly on myself when it comes to food but I have a finance conscience, however.  \n\nWhat I really wanted to order was the taco salad which looked fresh and ginormous but I didn't want to spend $12.95 on a salad.  I can be cheap but this is where I regret not ordering that because I really wanted it *sad face*  At least I made up for it at Chocolate Heaven afterwards.  I devoured 3 chocolate covered Oreo's in less than 2 minutes.  \n\nMy sister and her friend ordered the Wipeout Fried Combo ($15.99) and it's a fried fish, fried calamari, and coconut shrimp platter.  It looked rather appetizing but I didn't want to try it because I don't know about them but I hate it when people want to try my food or share.  \"Get your own, dude\".  They also ordered The Jalapeno Burger ($12.50).  The burger was brought out cut in half already per their request and it looked deliciously medium rare but if it was my burger, I'd order it rare.  \n\nKevin ordered a pizza and added his own toppings.  If I recall correctly, he opted for bacon, chicken, and pineapple.  He raved about it but I personally didn't care for it (had it as leftovers the following day).  It was on the dry side.  Meh.  \n\nI left before we paid because the kiddo started to act up.  Instead of allowing him to be loud, cry, or scream... I took him out for a walk (Chocolate Heaven) and to listen to the live music that was right in front of Hard Rock Cafe.  I didn't return to the group but when I came back in to wait a bit, the hostess remembered me and validated my parking ticket.  \n\nThe food is ok and the service can definitely improve (the server).", "rating": 3, "date": "2013-04-19"}, {"excerpts": ["I ordered the Grilled Salmon Salad (no dressing) and the Boyfriend ordered the WipeOut Fried Combo. ", "When the my salad came out I was disappointed on the size of the salmon. ", "However, the taste of the salmon was juicy and perfect. ", "It is the best salmon I tasted at a bar & grill by far. "], "author": "Cathy N.", "review": "The one thing that attracted me the most about this spot that it was the first spot upon my arrival on Pier 39 that had a patio area to eat. Then it was the people, the people that this place attracts. How it was decorated, what they offered opened to people who are casually dress and could afford a tasty meal.\n\nSo after we walked along the Pier, we headed back out to this spot to have lunch. We were a bit confused on where the entrance was. There was a separate windows to place order to go. Then another door to the patio from the inside. The actual door for us to get seated was located at the very front.\n\nNot surprisingly, it was incredibly busy. I asked the hostess how long is the wait. She responded, \"10-15 minutes.\" \"Oh okay. Party for two (2) please.\" \"Sure.\" They started to call out names one after the other. So if you weren't around when they called it, you missed your chance at a table. They went through it quick. As if they didn't have patience. So instead of us waiting for 10-15 minutes, we only stood there for a few minutes. =]\n\nIt was a beautiful day; the weather was perfect. It was noisy but very relaxing. Our server was Breaker. He greeted us with a smile (plus!) and helped us right away. Gave us the right amount of time to pick out our entree selection and served us our drinks and food at a fair timely matter.\n\nI ordered the Grilled Salmon Salad (no dressing) and the Boyfriend ordered the WipeOut Fried Combo. When the my salad came out I was disappointed on the size of the salmon. However, the taste of the salmon was juicy and perfect. It is the best salmon I tasted at a bar & grill by far. I tried some of the boyfriend's dish and it was definitely delish.\n\nThe service was excellent, the dish is good so I definitely would recommend this spot to others again. I wish there wasn't as much pigeons there. I felt like my food was going to get pooped on. Hehee.", "rating": 4, "date": "2012-06-24"}, {"excerpts": ["I had the Wipeout Fried Combo ($15.95). ", "It included A LOT of calamari, one or two pieces of fried fish and two skewers of coconut shrimp. ", "The taste was pretty much standard as compared to other fish & chip places, but it was a tad oily for me. ", "The sauces that came with the meal were delicious- ", "I like the sweet sauce. ", "This place isn't a place I'd crave to go, but it satisfied my stomach since I was hungry. ", "The staff was really friendly and the service was pretty fast. ", "It's convenient and there's inside & outside seating. "], "author": "Eri K.", "review": "A couple of us were on Fisherman's wharf hungry and ready to sit. I have not personally been to Pier 39 before so everything was new to me. We decided to get fish & chips since we were so close to the waters. We decided to come to Wipeout Bar and Grill. I had the Wipeout Fried Combo ($15.95). It included A LOT of calamari, one or two pieces of fried fish and two skewers of coconut shrimp. The taste was pretty much standard as compared to other fish & chip places, but it was a tad oily for me. The sauces that came with the meal were delicious- I like the sweet sauce. This place isn't a place I'd crave to go, but it satisfied my stomach since I was hungry. The staff was really friendly and the service was pretty fast. It's convenient and there's inside & outside seating. I think it's a family-friendly place, but I wouldn't come here on a date or anything.. just a casual hang-out kind of place.\n\nFinal verdict? I may want to try somewhere else, but if I can't find anything else better, I'd come back.", "rating": 3, "date": "2012-06-18"}, {"excerpts": ["$15.95 Wipeout Fried Combo (fish, shrimp, & calamari) ", "http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=zfrBx4zUYLNAZ7b7-3vRUg\n", "My cousin enjoyed this. "], "author": "Mary J.", "review": "The Bay Area has been having some odd weather this Summer, but visiting Wipe Out Bar & Grill restaurant at Pier 39 SF on a Saturday afternoon made the trip worth while. My rating is really 3.5-stars, but I'll round up.\n\nWHEN: Saturday 7/16/11, 3pm-ish\n\nWHERE: Pier 39 SF, ground level to the left, to the left. One of the 1st large restaurants upon walking into the Pier 39 area. http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=AXmgUpz3tlJyLZombPS7BQ\n\nLAYOUT: Very casual seafood/burger spot. Spacious seating for ppl of all shapes & sizes. Kid friendly, handicap friendly, & senior citizen friendly. Armless chairs & all table seating; no booths. Indoor & outdoor seating.\n\nCUST SVC: GREAT friendly & helpful staff! From host/hostess, to our Waiter-Willy, to food server, to the next employee directing you to their uni-sex bathroom area or the host/hostess stand. I've been here now 2 times, & both times have been great cust service. Keep up the excellent work team ^_^\n\nVISIT: My cousin recently had a birthday & wanted to eat @ a seafood spot in Pier 39. It was a pretty crowded Saturday afternoon @ Pier 39. After viewing a few restaurants, pricing, spaciousness, & wait time, we opted for Wipe Out Bar & Grill. Wait time for party of 3 (me, sis, & cousin) about 15-20min...got seated in 10min dinning inside ^_^\n\nEATS: Overall, all our eats were quite enjoyable! Fresh & hot. Drinks were pretty damn good too.\n\n$10 Giant 23oz Alcoholic Drinks (Tasty Wave, Pina Colada, & Shark Bite) http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=hor38iAPUHLP4jSBu7bvCw\nGreat recommendation by our Waiter-Willy! Cousin & myself are light weight I guess, or we didn't enough in the morning 'cuz 1/2 through our drink my sis said we both looked buzzed. They were still good though.\n\n$9.50 Glazed Pork Ribs (apps) http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=9nMc-1EQIXBzIdLV3HOSxw\nNot bad. Sauce made your finger tips worth sucking on. Had some bite; not fall off the bone...some ppl prefer that, but no biggie w/ me. Meat cooked just fine.\n\n$4.25 Cup of New England Clam Chowder http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=muBhVQPG7vwOvpxQVi9K4Q\nAlso good & worth my recommendation. Stayed hot to the last scoop. Hot, creamy, & fulfilling.\n\n$15.95 Wipeout Fried Combo (fish, shrimp, & calamari) http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=zfrBx4zUYLNAZ7b7-3vRUg\nMy cousin enjoyed this. Portion size plenty, hot, & fresh...she couldn't finish it actually.\n\n$9.95 Bread \"Chili\" Bowl & Salad Combo http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=F4RIg0EYkU73NecZgG7sRw\nSis went this route, but there was plenty more she wanted to try so she'll be back. Salad was over dressed w/ dressing, but chili bread bowl was pretty good.\n\n$11.95 BBQ Chicken Pizza http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=68oDljVQ3fVVVmeVqKDiUw\nYeah, I got pizza. I had a seafood item last time & was pleased so thought to try other. Glad I did. Really enjoyed the chicken on this pizza, more bbq sauce on pizza than I expected, but I'm not complaining ;-) No take home here, I finished everything!\n\nFINAL TAB: So party of 3 we spent $94.84 http://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=oBD_yGxYcMtlhkyvKg753g My cousin was happy having her birthday late-lunch here w/ sis & I. Of course this place will always be a considerate line up for me when visiting Pier 39...now I've recruited 2 more fans for 'em. Think I got my eye out on their burgers in my next visit *tee-hee*.", "rating": 4, "date": "2011-07-20"}, {"excerpts": ["I got the Wipeout Fried Combo (Fish, Coconut Shrimp, and Calamari) and the g"], "author": "Andrew C.", "review": "We stopped here before a Blue & Gold Fleet bay cruise (what MIL wanted to do for her b-day). I got the Wipeout Fried Combo (Fish, Coconut Shrimp, and Calamari) and the g/f got the clam chowder in bread bowl.\n\nVery mixed performance with the fried fish being the best of the lot. The beer batter was cooked perfectly and the flesh nice and moist. The coconut shrimp (3 on one skewer)  had the coconut coating burned, but the shrimp itself was not overdone. The spicy dipping sauce was tasty and I used that with the other items as well. \n\nThe calamari were virtually inedible: chewy and rubbery. I love calamari and was excited to see how much they gave in this mixed plate, but only ate 2-3 pieces.\n\nThe clam chowder was good with plentiful and not-overcooked bits of clam. \n\nA bit on the pricey side for what you get, but this is Tourist Central here and saw it was better value than the Eagle Cafe where we grabbed a quick drink later.", "rating": 2, "date": "2009-12-08"}, {"excerpts": ["So, we got a bowl of clam chowder and their Wipeout Fried Combo (fried fish, calamari, and breaded shrimp skewers). ", "It was all pretty good, the batter not being too thick and crisp to near perfection. ", "The only thing is that the calamari rings are relatively small in ratio to the batter. ", "Their fries were perfectly crispy ", "I must say. "], "author": "michelle f.", "review": "Yum! This place averages about $10-$15 for an entree, but still relatively cheaper than other Pier 39 restaurants.\n\nMy boyfriend and I came here after one of those cruises around the bay, and this was a good pick. What caught my eye was the fire pit they have in their outdoor seating. What a nice way to kick back and relax around a fire with some friends in this laidback surfer restaurant. Ignore the bustling tourists.\n\nWe were both fairly hungry, but perhaps not enough to eat an entire meal. So, we got a bowl of clam chowder and their Wipeout Fried Combo (fried fish, calamari, and breaded shrimp skewers). It was all pretty good, the batter not being too thick and crisp to near perfection. The only thing is that the calamari rings are relatively small in ratio to the batter. Their fries were perfectly crispy I must say. This dish alone was pretty filling for the 2 of us.\n\nClam chowder was worth it as well. Flavorful with some of those octagonal crackers on the side. Helped wash down the seafood!", "rating": 3, "date": "2011-04-10"}, {"excerpts": ["My fiancee ordered the Wipeout Fried Combo (combination of fried fish, calamari and coconut shrimp). ", "They give you quite a lot of thickly breaded calamari, but not very much shrimp or fish. ", "Also, the shrimp still had their crap-filled intestines in them. "], "author": "John C.", "review": "Nothing special about this place, really. You just need to know that since it's located at Pier 39, it's meant for tourists, which means the prices are higher than they should be.\n\nThere is a pretty large selection of food: burgers, fried seafood, sandwiches, etc., along with various alcoholic concoctions.\n\nI opted for the Jalapeño burger (topped with pickled jalapeños, jalapeño relish and melted jack cheese on a toasted bun). It wasn't bad at all. My fiancee ordered the Wipeout Fried Combo (combination of fried fish, calamari and coconut shrimp). They give you quite a lot of thickly breaded calamari, but not very much shrimp or fish. Also, the shrimp still had their crap-filled intestines in them. Both entrees came with fries as well (a bit too much salt added to them).\n\nOverall, Wipeout was alright. Just nothing special, and a bit overpriced.", "rating": 3, "date": "2010-09-27"}], "teriyaki chicken bowl": [{"excerpts": ["Wifey had the Teriyaki Chicken Bowl that was very good. ", "The Garlic Fries were good. ", "Not a bad place, but doubtful ", "we'll be back."], "author": "Karl S.", "review": "Happened to find ourselves on Pier 39 and decided to grab dinner here. Crowded and Touristy, but we tried it anyhow. The service was good and I ordered the Skirt Steak. It had great flavor but was also the toughest piece of meat I've had in a long time, like trying to eat my flip flop tough. Wifey had the Teriyaki Chicken Bowl that was very good. The Garlic Fries were good. Not a bad place, but doubtful we'll be back.", "rating": 3, "date": "2016-09-13"}, {"excerpts": ["A teriyaki chicken bowl with rice and veggies. ", "To my surprise her kids meal was better than mine, and a great portion so it was enough for us to share and be satisfied. ", "If you're in pier 39 and looking for a place to grab a bite, keep walking. ", "Or stop in for a drink on their patio cause that looked fun ", "and it overlooks the water."], "author": "Darin T.", "review": "Wow. I think the only reason I gave this place a star was because of its prime location on Pier 39. The service was friendly but extremely slow. I mean, I waited so long for her to take my payment that I contemplated walking up. \n\nFirst things first, the food. I got fish tacos. I'm in San Francisco on the water. What better place to eat fish? The menu said fresh Alaskan cod. The waitress said they're great so I get them. It comes deep fried in these awkward oblong shapes. I don't do fried fish. Fresh does not equal fried. Specify that in the menu. Also this shit looked like it came straight out of a freezer bag and dumped into a deep fryer. To me it was inedible. I didn't eat it. I tried my rice and beans-- I bit down onto what was raw crunchy rice mixed in with cooked. Can you imagine eating this? It was actually painful. I pushed my plate away and tried my daughters food. A teriyaki chicken bowl with rice and veggies. To my surprise her kids meal was better than mine, and a great portion so it was enough for us to share and be satisfied. If you're in pier 39 and looking for a place to grab a bite, keep walking. Or stop in for a drink on their patio cause that looked fun and it overlooks the water.", "rating": 1, "date": "2016-04-18"}, {"excerpts": ["My friend got an appetizer, and I got the Teriyaki Chicken Bowl...", "chicken was cold, the whole dish seemed like it was a TV dinner that was reheated. ", "Definitely will not order again.... ", "We were mostly interested in the drinks and we were very happy with them. ", "Service was EXTREMELY slow, our waitress gave us time to think about what we wanted but we really didn't need the full 35 minutes it took her to come back... ", "also she admitted she forgot about us...."], "author": "R B.", "review": "My best friend and I decided on Wipe Out to start my birthday celebration Food was ok...definitely nothing special. My friend got an appetizer, and I got the Teriyaki Chicken Bowl...chicken was cold, the whole dish seemed like it was a TV dinner that was reheated. Definitely will not order again.... We were mostly interested in the drinks and we were very happy with them. Service was EXTREMELY slow, our waitress gave us time to think about what we wanted but we really didn't need the full 35 minutes it took her to come back... also she admitted she forgot about us....we were also overcharged for some random \"salsa\" charge...and she seemed annoyed when I brought up that we had no salsa.....and that i did not want to pay for it.\n\nThe next thing we found super strange was the bathroom situation!!! its a unisex bathroom with a super awkward layout...there were paper towels and water all over the counters/floor and guys and girls waiting in line together was very strange and my friend and I felt super uncomfortable along with the other woman standing next to me who was fixing her makeup.. So overall, do not expect exceptional seafood or service, just enjoy the drinks! I got the Corona-Rita and loved it!", "rating": 3, "date": "2016-08-26"}, {"excerpts": ["Just had lunch there.. the teriyaki chicken bowl was awesome!!  ", "So good. \n", "Also very good service too.  \n", "The bathroom is unique.. coed sink area with locking private coed stalls."], "author": "Anna R.", "review": "Just had lunch there.. the teriyaki chicken bowl was awesome!!  So good. \nAlso very good service too.  \nThe bathroom is unique.. coed sink area with locking private coed stalls.", "rating": 5, "date": "2016-06-14"}, {"excerpts": ["My husband ordered the Teriyaki Chicken Bowl. ", "It was a generous amount of food but really sweet. ", "Overall, the atmosphere was family friendly but the food was just OK."], "author": "Pugsly W.", "review": "Me, my husband, and another couple were hanging out at Pier 39 looking for a place to eat. Most places at the pier were pretty pricey so we chose Wipeout Bar and Grill. Their prices were suitable but the food was nothing to scream about. The clam chowder was ok. I also ordered a fish and grilled chicken taco. I was not impressed. My husband ordered the Teriyaki Chicken Bowl. It was a generous amount of food but really sweet. Overall, the atmosphere was family friendly but the food was just OK.", "rating": 2, "date": "2013-02-25"}, {"excerpts": ["we tried the teriyaki chicken burger and the teriyaki chicken bowl..", "the burger was good but the bowl was far too sweet than expected which was a big turn off. ", "the food is on expensive side."], "author": "Nia A.", "review": "you have to actually wait for say 15-20 min..the food is on average side taste wise but its quite filling. we tried the teriyaki chicken burger and the teriyaki chicken bowl..the burger was good but the bowl was far too sweet than expected which was a big turn off. the food is on expensive side.", "rating": 3, "date": "2013-08-23"}, {"excerpts": ["The main theme of this restaurant is seafood but good thing they have a Teriyaki Chicken Bowl, the serving was really huge, but maybe it's because we ate two appetizers and it literally just filled us up.  ", "As I said, SF can be a bit pricey, the Teriyaki Chicken Bowl was $13.95, but it was okay because it was tasty!  ", "The calamari was $8.95 so times two ", "that's $17.  ", "It was worth it, but once this restaurant gets busy, which is all the time I think, there may be a quite a long wait for seats."], "author": "Rheine T.", "review": "We were just walking all the way down Pier 39, and just figured, what the heck, we're hungry, let's enter.  Got a window seat, very nice view, you can see Alcatraz from where we were seating.  We had crispy fried calamari for appetizers, and it was great, but there was a long wait between the appetizer and the main course itself. As hungry as we were, we ordered another crispy fried calamari and soon right after we got our main course.  The main theme of this restaurant is seafood but good thing they have a Teriyaki Chicken Bowl, the serving was really huge, but maybe it's because we ate two appetizers and it literally just filled us up.  As I said, SF can be a bit pricey, the Teriyaki Chicken Bowl was $13.95, but it was okay because it was tasty!  The calamari was $8.95 so times two that's $17.  It was worth it, but once this restaurant gets busy, which is all the time I think, there may be a quite a long wait for seats.", "rating": 4, "date": "2011-07-29"}], "grilled salmon bowl": [{"excerpts": ["For my lunch I ordered the delicious Grilled Salmon Bowl. ", "This was filled with fresh sautéed veggies and get this- coconut rice, not plain rice, not brown rice but COCONUT rice. ", "Do you see my amazement? ", "Well, it's because anyone could've put this dish on plain white rice and called it a day ", "but no the creator of the menu put some brains behind it and used his/her culinary degree. ", "Who says tourist places don't offer good food? ", "I beg to differ. "], "author": "Carrie K.", "review": "*Tourist Approved.. \n\nI ordered the Garlic Pizza Bread for starters. It had a lot of crushed garlic. I wasn't expecting that. I like garlic, I just wasn't expecting that much of it and that much fresh garlic which is a plus. ***I'm from the East so fresh garlic isn't so free flying on our dishes. It's something I'm getting used to while being in California. The Garlic Pizza Bread is a great tasting starter. \n\nFor my lunch I ordered the delicious Grilled Salmon Bowl. This was filled with fresh sautéed veggies and get this- coconut rice, not plain rice, not brown rice but COCONUT rice. Do you see my amazement? Well, it's because anyone could've put this dish on plain white rice and called it a day but no the creator of the menu put some brains behind it and used his/her culinary degree. Who says tourist places don't offer good food? I beg to differ. This dish also had teriyaki sauce which offered a great balance. \n\n\n** just a little note** this whole area has great shops with good prices, live music, boat tours, retro/classic arcade, Seals docked and talking :) and a bus ride away from China Town.", "rating": 4, "date": "2017-06-12"}, {"excerpts": ["The grilled salmon bowl was really good! ", "The nachos were just okay. ", "Great customer service. ", "Would definitely go back!"], "author": "Kelsey Z.", "review": "The grilled salmon bowl was really good! The nachos were just okay. Great customer service. Would definitely go back!", "rating": 4, "date": "2018-08-15"}, {"excerpts": ["We got the fish and chips and grilled salmon bowl ", "but all of the food looked good here and ", "there were lots of options."], "author": "Christie A.", "review": "We stopped here for a late dinner after a late sunset cruise. The food was really good and we were able to get in with no wait (all the other restaurants nearby had hour long waits). We got the fish and chips and grilled salmon bowl but all of the food looked good here and there were lots of options.", "rating": 5, "date": "2018-05-27"}, {"excerpts": ["the Grilled Salmon Bowl and mom had the Coconut Shrimp & Small Chowder.\n", "While we waited we enjoyed the free wifi (must give your e-mail) and funky decor.\n", "The dishes were delicious and by the end we were more than satisfied! ", "I highly recomend this place if you don't want to overspend and are in a rush."], "author": "Marla M.", "review": "We made a quick late lunch stop and we obviously wanted some seafood. We got seated right away and they took our order promptly (we were starving). I had the Grilled Salmon Bowl and mom had the Coconut Shrimp & Small Chowder.\nWhile we waited we enjoyed the free wifi (must give your e-mail) and funky decor.\nThe dishes were delicious and by the end we were more than satisfied! I highly recomend this place if you don't want to overspend and are in a rush.", "rating": 5, "date": "2016-03-29"}, {"excerpts": ["Ordered Veg Burger, BBQ Chicken Pizza, Coconut Shrimp& Chips, Grilled Salmon Bowl. ", "We were very hungry and directly ordered these, skipping starters. ", "The portions were good size. ", "I couldbarely finish my burger ( after stuffing all the fries). ", "Salmon was fresh n nicely grilled. ", "Service was good and the lady was updating us on our order ETA and didnt take more than 15min to arrive."], "author": "Tara P.", "review": "Went Sat night after spending evening strolling Pier 39, enjoying awesome weather! Ordered Veg Burger, BBQ Chicken Pizza, Coconut Shrimp& Chips, Grilled Salmon Bowl. We were very hungry and directly ordered these, skipping starters. The portions were good size. I couldbarely finish my burger ( after stuffing all the fries). Salmon was fresh n nicely grilled. Service was good and the lady was updating us on our order ETA and didnt take more than 15min to arrive.", "rating": 4, "date": "2017-06-26"}, {"excerpts": ["When it came to dinner, I took the advice of the server: Grilled Salmon Bowl. ", "A really nice piece of salmon, grilled and atop of fresh sauteed vegetables & rice. ", "The teriyaki sauce was a good touch & the rice had fresh coconut mixed in which was surprisingly wonderful. ", "It was an extremely tummy-pleasing meal, but would go somewhere else next time."], "author": "Sammy S.", "review": "Located on Pier 39 in San Fran. Touristy, yes, but they had a fun, clean, & inviting outdoor dining area (much different from the blah inside of the restaurant!). I was craving seafood, but much of what they had to offer was fried fried and more fried items. Not my bag, unless I'm having really good fish and chips, which I'm pretty sure theirs wasn't. Fun, big drinks that belong on a tropical island but it was delicious so no complaints here! I had a marg. When it came to dinner, I took the advice of the server: Grilled Salmon Bowl. A really nice piece of salmon, grilled and atop of fresh sauteed vegetables & rice. The teriyaki sauce was a good touch & the rice had fresh coconut mixed in which was surprisingly wonderful. It was an extremely tummy-pleasing meal, but would go somewhere else next time.", "rating": 3, "date": "2014-05-05"}], "sizzling shrimp  steak bowl": [], "sesame tuna bowl": [{"excerpts": ["The sesame tuna bowl was light and refreshing, and the veggies in it were seasoned wonderfully and still had a great crunch. ", "The tuna was perfectly seared with the tender inside. ", "So many complex levels, so delicious. ", "The jalapeño burger didn't have much heat, but the relish on it was fabulous. ", "Great drinks, great atmosphere, would definitely go back."], "author": "Becky B.", "review": "We were meeting up with friends who were bumming around Pier 39 for a gorgeous day. We needed a bit of the \"hair of the dog\" after a fun filled day at the Dickens Christmas Fest and we grabbed some lunch here. The sesame tuna bowl was light and refreshing, and the veggies in it were seasoned wonderfully and still had a great crunch. The tuna was perfectly seared with the tender inside. So many complex levels, so delicious. The jalapeño burger didn't have much heat, but the relish on it was fabulous. Great drinks, great atmosphere, would definitely go back.", "rating": 4, "date": "2017-12-17"}, {"excerpts": ["Now... the real reason for 5 stars: Sesame Tuna Bowl.   ", "Didn't expect much, based on some prior reviews. ", "One bite, and that changed. ", "Coconut rice, ginger, cilantro, and a decent chunk of perfectly seared tuna on top! ", "Simply exceptional!!! ", "If I had time, I would order another, right now. ", "And again for breakfast! ", "This simple tuna, rice, vegetable dinner is one of the best restaurant meals I have had in a very very long time. ", "It's not massive. ", "It's not bland. ", "It's not over seasoned. ", "It's just perfect!"], "author": "Tim D.", "review": "Ok. Just stopped by for a quick, late dinner. Most of the pier closes down early, so went with Wipeout, and their late close time. \n\nDecent (not epic) tap beer selection. Good quality, but variety is a little limited. Not a big issue, since quality seems to be their goal.\n\nSampled two IPAs before grabbing a pint. Guy behind the bar is on point. Mostly cleaning, but serving as necessary. \n\nNow... the real reason for 5 stars: Sesame Tuna Bowl.   Didn't expect much, based on some prior reviews. One bite, and that changed. Coconut rice, ginger, cilantro, and a decent chunk of perfectly seared tuna on top! Simply exceptional!!! If I had time, I would order another, right now. And again for breakfast! This simple tuna, rice, vegetable dinner is one of the best restaurant meals I have had in a very very long time. It's not massive. It's not bland. It's not over seasoned. It's just perfect!", "rating": 5, "date": "2018-08-08"}], "the beyond burger": [], "the jalapeno burger": [{"excerpts": ["They also ordered The Jalapeno Burger ($12.50).  ", "The burger was brought out cut in half already per their request and it looked deliciously medium rare "], "author": "Tram N.", "review": "Parking validation if under 2 hours - pretty sweet and I dig the unisex-style restroom because it's something I have never seen or been to plus they do have a baby changing station that is relatively clean.  They do have at least one restaurant personnel in the restroom facility at all times to ensure cleanliness and to assure patrons that it is a boys' and girls' bathroom, haha.   \n\nThe wait time wasn't that long for a Saturday night.  I think we waited for about 10 minutes?  The hostess was nice and our server at first was also nice however, during the middle of our meal, there was a server exchange due to her lunch so what I heard from the group was that the replacement server was rude and plain out sucks.  Fortunately for her, I wasn't present or else I would have said something.  \n\nI knew I wanted clam chowder because I'm in San Francisco and it's a mandatory soup to order especially at the pier and I did but I refrained from ordering it in a sourdough bread bowl because I did not want to consume over 800 calories and over 70g of carbs, not to mention over 25g of fat in a soup - SOUP!!!  Plus I was spending money left and right that weekend so my soup costs just $4.99.  I can spend lavishly on myself when it comes to food but I have a finance conscience, however.  \n\nWhat I really wanted to order was the taco salad which looked fresh and ginormous but I didn't want to spend $12.95 on a salad.  I can be cheap but this is where I regret not ordering that because I really wanted it *sad face*  At least I made up for it at Chocolate Heaven afterwards.  I devoured 3 chocolate covered Oreo's in less than 2 minutes.  \n\nMy sister and her friend ordered the Wipeout Fried Combo ($15.99) and it's a fried fish, fried calamari, and coconut shrimp platter.  It looked rather appetizing but I didn't want to try it because I don't know about them but I hate it when people want to try my food or share.  \"Get your own, dude\".  They also ordered The Jalapeno Burger ($12.50).  The burger was brought out cut in half already per their request and it looked deliciously medium rare but if it was my burger, I'd order it rare.  \n\nKevin ordered a pizza and added his own toppings.  If I recall correctly, he opted for bacon, chicken, and pineapple.  He raved about it but I personally didn't care for it (had it as leftovers the following day).  It was on the dry side.  Meh.  \n\nI left before we paid because the kiddo started to act up.  Instead of allowing him to be loud, cry, or scream... I took him out for a walk (Chocolate Heaven) and to listen to the live music that was right in front of Hard Rock Cafe.  I didn't return to the group but when I came back in to wait a bit, the hostess remembered me and validated my parking ticket.  \n\nThe food is ok and the service can definitely improve (the server).", "rating": 3, "date": "2013-04-19"}, {"excerpts": ["The garlic fries weren't too, well, \"garlic-y\" and the jalapeno burger ", "I had a good amount of spice, aside from the bottom bun being too wet and falling apart by the time I got it. ", "The server took care of us perfectly, and even came back several times to make sure we were taken care of, even with a lot of tables, which was appreciated. ", "Just be mindful the bathroom is set up unisex, and the main handwashing area is just one big sink outside the bathrooms, if you're weirded out by not having designated male and female bathrooms."], "author": "Dan M.", "review": "If you want a table, apparently you have to walk around to the other side of this place, opposite of the VW bug takeout stand. The wait was around 15 minutes, which made sense since it was fairly crowded there (decent sports bar where they were showing all NFL games on a projector and at tv's around the bar). They should have some sort of intercom outside that tells you your table is ready though, if you were not directly outside the front entrance, you'd never hear them call for you. The garlic fries weren't too, well, \"garlic-y\" and the jalapeno burger I had a good amount of spice, aside from the bottom bun being too wet and falling apart by the time I got it. The server took care of us perfectly, and even came back several times to make sure we were taken care of, even with a lot of tables, which was appreciated. Just be mindful the bathroom is set up unisex, and the main handwashing area is just one big sink outside the bathrooms, if you're weirded out by not having designated male and female bathrooms.", "rating": 3, "date": "2013-10-07"}], "turkey burger": [{"excerpts": ["First and last time eating here, my boys and I stopped to grab lunch but the food was greasy, fries were not crispy and my turkey burger tasteless all for almost $70... not worth the price!"], "author": "Jaime C.", "review": "First and last time eating here, my boys and I stopped to grab lunch but the food was greasy, fries were not crispy and my turkey burger tasteless all for almost $70... not worth the price!", "rating": 2, "date": "2018-03-18"}, {"excerpts": ["but I decided to get a turkey burger -___- ", "(it was awesome though). ", "I can't speak on the rest of the menu, but the coconut shrimp were some of the best I've had that weren't in Hawaii and the turkey burger would definitely be something I'd order again if I hadn't known what their fish 'n chips tasted like. "], "author": "Michael S.", "review": "I'd call it a diamond-in-the-rough but it's literally on Pier 39 so I can't really say that.\nHowever, you might walk past this place a hundred times and comment on how cool their little beachy walk-up bar is or how clever their Wipeout To Go truck looks plastered on the side of their building but if you've never walked in, you're truly missing out on my Pier 39 budget-friendly favorite.\n\nPier 39 has really stepped its collective game up and I've noticed an up-scale new wave of restaurants has matched their pricey shops so it's refreshing that a place like Wipeout still makes the cut! It seems they've earned their keep with friendly service, pretty good food and outside eating accommodations.\n\nIs this the place to get world-class oysters in a half shell or that \"fresh\" ahi tuna tar tar that sounds so elegant when you order it? No. But if you're in the mood for some tropically-inspired comfort food, you've got nothing to lose. They pretty much had me at Anchor Steam beer-battered fish 'n chips but I decided to get a turkey burger -___- (it was awesome though). Luckily I have an awesome girlfriend who got the fish 'n chips and after one bite, I was hooked.\n\nI can't speak on the rest of the menu, but the coconut shrimp were some of the best I've had that weren't in Hawaii and the turkey burger would definitely be something I'd order again if I hadn't known what their fish 'n chips tasted like. Great seasonings, everything cooked/fried to golden perfection, friendly staff and we got to enjoy it all outside on their plentiful seating area. \n\nWhat else do you want? You're in San Francisco, enjoy your day, just stop here at some point.", "rating": 5, "date": "2014-03-12"}, {"excerpts": ["We got the turkey burger and carnitas burrito.  ", "It was pretty empty for a Monday night but after a long day the food was very good.  ", "I would come here again.  ", "They have good drinks also."], "author": "Miranda B.", "review": "We picked this place because it was first in line of places to eat.  We were tired and the patio was very inviting.  We got seated inside and our waitress was great.  She was very helpful with the menu.  I couldn't decide and her recommendation was good.  We got the turkey burger and carnitas burrito.  It was pretty empty for a Monday night but after a long day the food was very good.  I would come here again.  They have good drinks also.", "rating": 4, "date": "2014-12-02"}, {"excerpts": ["I got a turkey burger. \n", "It might have been the best turkey burger I've ever had! ", "The bun was delicious! "], "author": "Yessenia O.", "review": "Came in here after an Alcatraz Tour. We were SO hungry!\ncould be why the food tasted so good. We got chips and salsa to start. \nThe salsa was okay, chips were good. The server was friendly, but he barely spoke to us.My boyfriend got the BBQ burger he devoured it! I got a turkey burger. \nIt might have been the best turkey burger I've ever had! The bun was delicious! so soft and flavorable! \n\nThe atmosphere was nice, very casual. We sat next to a window which was nice. \n\nI would come back! :)", "rating": 4, "date": "2012-01-19"}, {"excerpts": ["So I order the turkey burger with BBQ sauce, this was also not good. ", "The burger had a soapy taste like they had soap on the grill or something. ", "There are so many other place to eat."], "author": "Anthony L.", "review": "This place sucks, I came up to NoCal for work, so after I decided to visit fishermen's wharf. I walking down the pier and when I finished my sight seeing I seen this place and decide to give it a try. Bad idea order calamari first then changed my mind and order fish tacos instead. So when my food came out it was the calamari, let down but decided that I was hungry so I just kept it. They tasted like all batter and minimal amount of the flavorless calamari. So I order the turkey burger with BBQ sauce, this was also not good. The burger had a soapy taste like they had soap on the grill or something. There are so many other place to eat.", "rating": 1, "date": "2013-01-28"}, {"excerpts": ["I had the turkey burger with  fries, neither gad any flavor."], "author": "Seth G.", "review": "Been here many times as it is not expensive and we don't typically have to wait long. We always have the calamari appetizer but today it was flavorless and we are not fans of cocktail sauce that was served with it. I had the turkey burger with  fries, neither gad any flavor.", "rating": 2, "date": "2014-08-16"}, {"excerpts": ["Turkey burger was one of the best I've had. ", "Lots of flavor."], "author": "Lonny R.", "review": "Food and service here was great.  Ordered fried calamari and the portion size was great. Turkey burger was one of the best I've had. Lots of flavor.", "rating": 4, "date": "2012-08-25"}, {"excerpts": ["$4\n\ntry: hawaiian burger (sub beef for turkey burger):  lettuce, tomato, onion, pickle, grilled pineapple, teriyaki glaze and melted jack cheese on sesame seed bun with fries. "], "author": "terra d.", "review": "4 for the delicious raspberry martini, 3 for the food. not a long wait and the hostess had an amazing peacock feather tattoo. \n\nappetizer: chips and salsa (warm tortilla chips and awesome salsa). took a bit longer than \"immediately\" as the waiter claimed. $4\n\ntry: hawaiian burger (sub beef for turkey burger):  lettuce, tomato, onion, pickle, grilled pineapple, teriyaki glaze and melted jack cheese on sesame seed bun with fries. $10\n\nwarning: watch out for moulting pigeons with missing toes! oh, they also serve shark...?", "rating": 3, "date": "2008-04-13"}], "bbq burger": [{"excerpts": ["I had the BBQ burger with a side of BBQ sauce. ", "The bun was nice and soft, only thing was the inside of the burger kept slipping out every time I took a bite ", "so I was looking like a hot mess with hella napkins around me ", "lol. "], "author": "Yee W.", "review": "This review is for the TO GO wipeout van. There was a short line so we decided to check it out.\n\nWe ordered the chili cheese fries which was surprisingly larger than expected. It was fresh and hot! My man really enjoyed it, his tastebuds was loving it. \n\nI had the BBQ burger with a side of BBQ sauce. The bun was nice and soft, only thing was the inside of the burger kept slipping out every time I took a bite so I was looking like a hot mess with hella napkins around me lol. But it was pretty good, I killed the entire thing! \n\nThen our son had a slice of cheese pizza which he liked and ate for the most part. Nothing too fancy, just a regular piece of pizza. \n\nThere was a lot of seating area, table and benches. Napkin holders on each table. A separate small area with utensils next to the TO GO van. There was a basket of crayons too but no coloring paper? I don't know, maybe for the kids to keep busy?", "rating": 4, "date": "2018-08-12"}, {"excerpts": ["I had the BBQ burger and my wife had the hamburger. ", "Both were cooked exactly as ordered. ", "The fries were seasoned well and the beer was cold. ", "Our service was prompt and very attentive."], "author": "Petey C.", "review": "I had the BBQ burger and my wife had the hamburger. Both were cooked exactly as ordered. The fries were seasoned well and the beer was cold. Our service was prompt and very attentive.", "rating": 4, "date": "2017-11-13"}, {"excerpts": ["I ordered the Baja Fish Tacos, my boyfriend ordered the Hot Wings with Fries, and our friends got the Chicken Teriyaki Sandwich w/ Pineapple and the BBQ Burger with Jalapeño ", "and we were all VERY pleased with our meals ! ", "I would definitely recommend this place to anyone who plans on visiting this area ! ", "(:"], "author": "Nyomi M.", "review": "Came here yesterday with my boyfriend and two of our friends and we were pretty pleased ! (: It was a Saturday at Pier 39 during lunch hour which is a very busy time, place, AND day ! We were told it would take 25 minutes to get seated and we were actually sat within about 15 minutes or so which was very nice. The customer service was very friendly and fast for being such a busy time and place ! (: The food was GREAT ! I ordered the Baja Fish Tacos, my boyfriend ordered the Hot Wings with Fries, and our friends got the Chicken Teriyaki Sandwich w/ Pineapple and the BBQ Burger with Jalapeño and we were all VERY pleased with our meals ! I would definitely recommend this place to anyone who plans on visiting this area ! (:", "rating": 5, "date": "2017-04-02"}, {"excerpts": ["so we ordered the BBQ burger with crispy onions and the chicken sandwich with pineapple and teriyaki.  ", "The burger was much better than the chicken as I can remember feeling like I was on a commercial eating it when the bbq sauce dripped from the burger.  ", "Charred to perfection.  ", "The chicken sandwich was really messy and the bun a little soggy from the teriyaki but not too bad.  ", "My daughter ordered the mac n cheese with fries.  ", "The mac was straight out of the old fashioned Kraft box...it always amazes me that they would serve that at restaurants and charge the prices they do for it.  ", "Anyways, she was fine....just like good 'ol mac and cheese from home ", "I guess. "], "author": "Carissa C.", "review": "Outdoor seating at its best.  We come here every time we visit San Fran-total tourist trap but a good one!  People watch while you drink your specialty drink or beer and hope you don't get pooped on by the birds. LOL  We started in the sun and as time went by the tarp shade came out little by little-just like magic till the patio was totally shaded.  We ordered our drinks- a tall beer and a Mai Tai.  Nothing better than being on vacation with a frosty beer glass with ice cold beer to drink.  Sigh.  \n\nThe BF and I thought we would share two dishes so we ordered the BBQ burger with crispy onions and the chicken sandwich with pineapple and teriyaki.  The burger was much better than the chicken as I can remember feeling like I was on a commercial eating it when the bbq sauce dripped from the burger.  Charred to perfection.  The chicken sandwich was really messy and the bun a little soggy from the teriyaki but not too bad.  My daughter ordered the mac n cheese with fries.  The mac was straight out of the old fashioned Kraft box...it always amazes me that they would serve that at restaurants and charge the prices they do for it.  Anyways, she was fine....just like good 'ol mac and cheese from home I guess. haha\n\nThe atmosphere is exactly what you expect being in California.  Totally chill, good food and drink, great customer service and enjoying the fab Cali weather!  The décor is a beachy-surfer theme with cute little signs that make you laugh.  Get your pic with the surfer dude statue in the front for giggles.  Even if I lived in San Fran I would still visit Wipeout on occasion.  Sigh....I wish I was still there.", "rating": 3, "date": "2013-05-23"}, {"excerpts": ["My friend had the BBQ Burger, she said it was good, but nothing to write home about. \n\n"], "author": "Meghan L.", "review": "I went here Easter Sunday with my father and best friend who were both visiting from out of town. We opted to park in the Pier 39th garage as we planned on doing a little walking around the piers after lunch. \n\nWe were seated right away inside (too windy for me outside!) and had a nice window seat with a view of the bay, after ordering we enjoyed our soda and laughed until our Chips and Salsa arrived, Taking into consideration that this isn't a Latin restaurant, the salsa was fairly good.\n\nOur food came out promptly even though they were fairly busy for lunch. \n\nMy dad had the Tuna Ginger Salad, the Tuna was decent, a little tough in my opinion, but had good flavor. \n\nMy friend had the BBQ Burger, she said it was good, but nothing to write home about. \n\nI had the Fish and Chips, I was disappointed. The fish was pretty dry and had very little flavor in the batter. I poured on the lemon and vinegar just to spice it up.\n\nOur server was fantastic! Polite. Attentive. Informative. Friendly. \n\nOver all it was an A-OK lunch. I wouldn't dine here regularly, but it's a fun place to take visitors if they are at the Wharf.\n\nThey validate parking for the Pier 39 Garage.", "rating": 3, "date": "2011-04-25"}, {"excerpts": ["To get into the mood we ordered a couple of mai tais, while we waited for our chicken teriyaki bowl and BBQ burger. ", "The teriyaki bowl had coconut steamed rice, which tasted delicious, and the burger came with thinly cut onion rings in addition to the usual french fries. "], "author": "David D.", "review": "San Francisco can be tropical if you know where to look. \n\nOn Saturday we joined the tourists in sunny North Beach, taking in the sights at Pier 39. Wipeout had a 15-minute wait for the first available seating, which suited us just fine. We noticed the sweat shirts and hoodies in the gift shop, which probably sell well in the summertime. This day the sun was out and the air was calm, making them excess cargo. \n\nWe were seated on the patio, a fenced-off area right on the Pier thoroughfare. To get into the mood we ordered a couple of mai tais, while we waited for our chicken teriyaki bowl and BBQ burger. The teriyaki bowl had coconut steamed rice, which tasted delicious, and the burger came with thinly cut onion rings in addition to the usual french fries. All of this for $53 + tip, of which about $22 was in the mai tais. \n\nThe mai tais were served in a hurricane glass, about 24 oz. each, and we had to regain our sea legs after we stood up again. No sharks were sighted, although a herd of young harbor seals was gaining ground on the docks below.", "rating": 5, "date": "2011-08-28"}, {"excerpts": ["We ate the BBQ burger, a plain burger, extra fries (what?  ", "The BBQ burger was ordered medium rare and the waiter gave us a heads up that it would be bloody in the middle -- that was welcome news, and that's how it was cooked, too.  ", "Total tab about $80 with tax and tip (we all drank water)."], "author": "Susie C.", "review": "In true tourist fashion, we ate here our first night in SF (2 adults, 2 kids).  We waited about 10 minutes to be seated inside where it was warmer.  Service was pretty good although once the mumbling waiter delivered our food he never checked on us.  We ate the BBQ burger, a plain burger, extra fries (what?  that's all the kid wanted) and the seared tuna salad.  The salad was huge, fresh ad delicious; the tuna was perfectly cooked, i.e. not overcooked in the slightest.  The BBQ burger was ordered medium rare and the waiter gave us a heads up that it would be bloody in the middle -- that was welcome news, and that's how it was cooked, too.  Total tab about $80 with tax and tip (we all drank water).", "rating": 4, "date": "2015-12-29"}, {"excerpts": ["My boyfriend got the BBQ burger he devoured it! "], "author": "Yessenia O.", "review": "Came in here after an Alcatraz Tour. We were SO hungry!\ncould be why the food tasted so good. We got chips and salsa to start. \nThe salsa was okay, chips were good. The server was friendly, but he barely spoke to us.My boyfriend got the BBQ burger he devoured it! I got a turkey burger. \nIt might have been the best turkey burger I've ever had! The bun was delicious! so soft and flavorable! \n\nThe atmosphere was nice, very casual. We sat next to a window which was nice. \n\nI would come back! :)", "rating": 4, "date": "2012-01-19"}, {"excerpts": ["The BBQ Burger I ordered was good but definitely not worth spending $11.  "], "author": "Serena C.", "review": "Came here with a hungry group of friends because it was the first restaurant we encountered on the pier and did I mention? We were hungry.  In the end, I left conflicted about our decision to eat here... \n\nI'll admit, they have a lot of delicious choices on their menu to choose from that will leave you at wit's end about which one to select. And the food is actually pretty good and they provide large portions. But I simply can't forgive the prices ($9-10 for most appetizers; $10-12 for most sandwiches,  burgers, tacos and burritos; $14-16 for most specialty entrees). The BBQ Burger I ordered was good but definitely not worth spending $11.  In my opinion, the prices for their items are too high for my tastes for what I'm getting, but to my understanding these prices are fair for Pier-39 prices. \n\nI did enjoy the surf-themed environment of the restaurant though.  We had a surfboard for a table which was cool, but rather unpractical since it was narrow making it hard to fit all of our entrees on the table and even harder for those of us sitting at the ends of the surfboards.  There are some televisions situated in parts of the room tuned to various sports channels and a full-service bar is available as well. \n\nI can find better places to eat for a lower or even decent price, so sorry Wipeout Bar and Grill... unless you have a change of heart in your prices, me and my wallet are not coming back.", "rating": 3, "date": "2009-08-28"}, {"excerpts": ["I've only tried one other menu item, a bbq burger I think it was? ", "Well, I don't think 9 bucks is a whole lot for the portion sizes. "], "author": "Manisha T.", "review": "Well, this is the first review I've bothered to write that isn't getting the highest possible rating, but only because of a couple of short-comings.\n\nFirst, I loooove the ribs (you can order them as an appetizer or as a meal). They are succulent, juicy, sweet and barbeque-ey and I'm addicted to them! I've only tried one other menu item, a bbq burger I think it was? Well, I don't think 9 bucks is a whole lot for the portion sizes. You get a heap of fries with virtually every menu item, and the sandwiches are huge. \n\nI don't go very often because it's all the way at the Wharf. But the upside is that every time I go (with friends or family visiting) I ALWAYS pick Wipe-Out. The other options around are ridiculously overpriced. I mean, I know it's seafood but there's no way you can justify charging 50 bucks for crabmeat!\n\nI always take people on the scenic route through the city so that, by the time we get to the Wharf, we're ready to throw down! Wipe Out is perfect for that.\n\nI like the margaritas. They may be watered-down but they're huge and I like fruity mild drinks over hard liquor anyway. ;)\n\nOn the down side, the service is kind of iffy, mostly kids serving with very short attention spans...no one was rude, just flighty and air-headed. At least they were nice! And the decor is kind of like Joe's Crab Shack, it's themed and corny but the food's good so who really cares?", "rating": 4, "date": "2008-12-22"}, {"excerpts": ["When I came to this restaurant I came in with a open mind and got a BBQ Burger with those small onion crisps and fries and this was really good ", "actually i would visit this place again ", "I usually do not go to Fisherman's Wharf to actually eat but this place was pretty good they have TVs and projectors for those Sport games. ", "But this is surely a tourist area and a tourist restaurant but its expected."], "author": "Scott R.", "review": "When I came to this restaurant I came in with a open mind and got a BBQ Burger with those small onion crisps and fries and this was really good actually i would visit this place again I usually do not go to Fisherman's Wharf to actually eat but this place was pretty good they have TVs and projectors for those Sport games. But this is surely a tourist area and a tourist restaurant but its expected.", "rating": 4, "date": "2012-03-03"}], "the hawaiian burger": [{"excerpts": ["Hubby recommends the Hawaiian burger. ", "Check this place out."], "author": "Kimberly K.", "review": "Mostly based on the service alone. Really quick and very friendly. We only had the burgers which are really good. Hubby recommends the Hawaiian burger. Check this place out.", "rating": 4, "date": "2017-04-22"}, {"excerpts": ["I ordered the California Burger (guacamole, bacon, and jack cheese), my friends ordered clam chowder, the Hawaiian burger, salmon BLT, a regular burger, and fish and chips. \n\n"], "author": "Julie N.", "review": "Since Pier 39 is a huge tourist infested area, the wait for a table was about 30 minutes. That's totally understandable since it was a crowded day on the pier and we had a group of 10. \n\nEverybody ordered their food; we were all really excited to eat and extremely hungry. I ordered the California Burger (guacamole, bacon, and jack cheese), my friends ordered clam chowder, the Hawaiian burger, salmon BLT, a regular burger, and fish and chips. \n\nIt all went wrong when every single person at the table got their food, but me. I obviously was pretty angry because well, everybody finished most of their food and my food STILL wasn't out. My friend asked the workers if my food was coming out yet, but they just said they would \"check on it.\" After 5 minutes, my food still wasn't coming out while people who came in after me got their food first... ok?? My food was obviously forgotten and the workers were obviously ignoring our table. 5 minutes later, my food FINALLY came out after a 20 minute wait. Oh, and the waiter also forgot my friend's order of French fries, did he not write ANY of the orders down, or...????\n\nMy burger was mediocre, tasted like a burger. There was nothing special about it, even though the price for it was pretty expensive.\n\nWhen the check came out, the waiter said he took my burger off the check. I felt bad for being angry, so I gave him a nice tip. But there was a problem with the check, and he ended up charging my friend's credit card twice... Which pretty much made me angry again because I gave him a good tip for being a lousy waiter. I didn't expect amazing service, but I expected at least decent service.", "rating": 2, "date": "2015-08-04"}, {"excerpts": ["Also ordered was the Hawaiian Burger, which was good but the underwhelmed bun was overwhelmed by the sauce resulting in a soggy affair. \n\n"], "author": "George L.", "review": "Hey all.\n\nI usually don't review bars and grill type places as I find they all generally offer the standard bar type foods and environment. \n\nBut I had a change in heart and decided to review Wipeout on Pier 39 Fisherman's Wharf. Place was lively and colorful. Right in the heart of the Pier 39 shopping area. \n\nWe decided to sit at the outside section especially if you are into people watching. The service was great and fast. \n\nI ordered the Fish and Chips which included an amble serving of Alaskan Cod lightly battered in beer. My rating was 8 our of 10. The fries are great if you into them.\n\nAlso ordered was the Hawaiian Burger, which was good but the underwhelmed bun was overwhelmed by the sauce resulting in a soggy affair. \n\nCheers.", "rating": 4, "date": "2015-09-01"}, {"excerpts": ["I had the Hawaiian burger, it was ok. ", "The meat is really good but the flavors were a bit flat and the pineapple slice was a bit too thin. ", "The fries though are the real deal. ", "Everyone else quite enjoyed their burgers (one vegetarian, one with blue cheese and one California with guacamole)"], "author": "Tamara S.", "review": "The Wipeout Bar and Girl like many restaurants on Pier 39 has a good outdoor seating , that is perfect for people watching when eating the food. \n\nOne of the best things that they offer is the many different options for soda drinks. You can mix and match pretty much anything. \n\nTheir nachos are very good, the half order was enough for 4 people as an appetizer. \n\nI had the Hawaiian burger, it was ok. The meat is really good but the flavors were a bit flat and the pineapple slice was a bit too thin. The fries though are the real deal. Everyone else quite enjoyed their burgers (one vegetarian, one with blue cheese and one California with guacamole)", "rating": 3, "date": "2015-01-18"}, {"excerpts": ["I got the Hawaiian Burger... and they are VERY generous with that teriyaki sauce. ", "It was one of those drip all over your hands and plate and face burgers. "], "author": "Leanna S.", "review": "We were starving and wanted a quick bite to eat, but not fast food - so we ended up here. Cool, chill spot. Casual - lots of TVs that had college football on. \n\nI got the Hawaiian Burger... and they are VERY generous with that teriyaki sauce. It was one of those drip all over your hands and plate and face burgers. LOVED IT. \n\nThe service was mediocre... but then again I didn't expect it to be since its mostly high school/college students making minimum wage. Slow... but friendly. \n\nDef worth checking out if you're at the wharf and dont want to throw down hella bank for a fancy schmancy place, but dont want fast food either.", "rating": 3, "date": "2012-09-21"}, {"excerpts": ["The Hawaiian Burger ($11.95) ", "- My brother got this. ", "He was craving a burger, & was satisfied. "], "author": "Jessica A.", "review": "My family celebrated Easter early, so when it was actually Easter Day, I decided to spend it with my brother, his girlfriend, & their daughter. It was a bit on the sunny side (at least in the morning), so we wanted to do something. We decided to go to Pier 39! \n\nCouldn't really decide where we should eat. Picked a couple places & just went with the one with the shortest wait..considering that it was a Sunday, Easter, & a tourist spot all day every day. The winning restaurant = Wipeout Bar & Grill.\n\nWhile I thought I'd have a good day (I mean..it was Easter!), the moment I went to up to the hostesses, I was automatically in a bad mood. I originally went up to the hostesses to inquire about the wait time for 4 people. They kind of just stared at me for a while, which made me feel uncomfortable. One woman asked, \"Do you have a preference?\" First of all, preference for what?! When I didn't answer right away, she looked at me like I was stupid, which I did NOT appreciate!! I think that's what ticked me off. She still didn't clarify her question, but I had figured out what she was asking me. But already from that point, I just didn't want to deal with her anymore. I almost wanted to tell my brother to let's go somewhere else, but I knew everyone was hungry. \n\nThey told me about 20-30 minutes wait time, so my brother, his girlfriend, & their daughter wandered around the area a bit. I decided to stay behind just in case we were called. They called my name (which they got wrong btw. I'm pretty sure 'Jessica' is a pretty common name) & I told them that I had to get the rest of my party. They were very IMPATIENT & quick to grab someone else. Like seriously?! They kept pushing me to hurry up basically & that was NOT okay. \n\nAfter getting horrible hostess service, I was hoping that the rest of the experience would make up for it. Our waitress was really nice, which is why I gave 2 stars instead of 1 star. As for the food, that was alright. Here's what we ordered...\n\nTeriyaki Pineapple Chicken Sandwich ($12.50) - I'm cutting down on my red meat, so I decided to get chicken instead. It was okay. The bun was way too small for the chicken..or the chicken was too big for the sandwich. The teriyaki & pineapple was good, but definitely made the sandwich messy to eat. Towards the end, I ended up using my fork & knife to eat it. It was just okay though. It also came with crispy fries, which were good. I probably wouldn't order it again.\n\nThe Hawaiian Burger ($11.95) - My brother got this. He was craving a burger, & was satisfied. Also came with crispy fries.\n\nFish & Chips ($13.95) - My brother's girlfriend got this. She liked it..oh, my niece did too. \n\nOverall, I'm not a fan of my experience at Wipeout Bar & Grill. From the beginning, my experience started to go downhill. If I'm back at Pier 39, I would rather take my services elsewhere.", "rating": 2, "date": "2012-04-11"}, {"excerpts": ["I ordered the The Hawaiian Burger - I love cooked pineapples! ", "Burger was topped with a  grilled pineapple, teriyaki glaze and melted jack cheese, served on a toasted bun. \n"], "author": "Cass J.", "review": "When it comes to good eats with Kids at Fisherman's Wharf, the options are limited. Kids are picky, and many don't like seafood, and most often you just want to get them something to eat to shut them up.  \n\nSo where do you dine with the kids at the Wharf without breaking the bank with overpriced mediocre food? Hard Rock Cafe...Johnny Rockets for a quick burger?  You can support these national chains for American food if you like.\n\nOr, you can support a local Bay Area joint with a warm beach-y, California surf-town feel.  \n\nWipeout Grill is a great place for families.  The atmosphere is reminiscent of beach-side dining options along the California coast with both outdoor patio seating on a warm day, or plentiful indoor seating either with a bay-side view or bar seating with TVs playing your favorite ball game, while enjoying a drink off of their extensive beer, wine, margarita and Specialty drinks menu.  \n\nComfortable enough for large parties, you don't have to worry about making a big mess since they welcome families of all shapes and sizes.  \n\nI dined here for a quick bite to eat awhile back after wanting sit-down service, but nothing too fancy.  We were quickly seated by the window and our server was efficient and friendly.\n\nI ordered the The Hawaiian Burger - I love cooked pineapples! Burger was topped with a  grilled pineapple, teriyaki glaze and melted jack cheese, served on a toasted bun. \nhttp://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=xYSsntNQEH-2SNVmbYkfiw\n\nBurger was cooked to my request...Medium Well and the bun was nicely toasted and warm as described.  I'm not so much into a cold bun when eating a hot burger, and Wipe Out Grill did my burger nicely.  \n\nWe also ordered the Wipe Out Fried Combo - A combination of fried fish, calamari and coconut shrimp, served with a tangy sweet and sour sauce and side of cole slaw.  \nhttp://www.yelp.com/biz_photos/iaKZgEBfD4Ak4OR2vNKFrg?select=zJe_KOxH_YgW9m8d3GP4IA\n\nBatter seemed nice and crispy at first, but became soggy quite quickly.  But for the most part, portion size was decent. \n\nPrices are competitive for the rest of the Wharf area...with my burger being $10.95 and the Combo platter at $15.95. It's the price you way for choosing to dine at the Wharf.  \n\nYes, you can get better deals elsewhere, but this place is great with families who don't have a lot of time, but would like a decent sit-down service restaurant with fun beach-y California atmosphere and extensive food and drink menu.", "rating": 4, "date": "2010-01-02"}, {"excerpts": ["Had the Hawaiian Burger and the pineapple plus the teriyaki glaze added the right sweetness.fries were hot and plentiful . ", "My food was brought out quickly. ", "All in all awesome service"], "author": "Alfonsina S.", "review": "Great choices on the menu. Had the Hawaiian Burger and the pineapple plus the teriyaki glaze added the right sweetness.fries were hot and plentiful . My food was brought out quickly. All in all awesome service", "rating": 4, "date": "2014-10-02"}], "the wipeout burger": [{"excerpts": ["I've also had the wipeout burger and it's good.  \n\n"], "author": "Andrew S.", "review": "This is a solid casual, fast, affordable option when visiting Pier 39.  My usual order is a cup of the clam chowder and their ribs. Both are consistently good and good value for money.  Be careful with the chowder, it can come piping hot. I've also had the wipeout burger and it's good.  \n\nThis place gets really, really busy and service can be problematic at times. There are also typically a lot of tourists with kids coming here (not a romantic place at all) and there can be a rather long line for the restroom.  Including tax and tip, expect to pay about $30 to $40 per person.", "rating": 4, "date": "2018-05-27"}, {"excerpts": ["My husband and daughter both ordered the wipeout burger and upgraded to the blue cheese fries. "], "author": "Susana Q.", "review": "Our go-to at Pier 39 is Chowders but since I can no longer eat fried or high fat foods and my husband wasn't in the mood for it, we decided to pay a visit to this place. \n\nWe visited on a Thursday evening with a group of 5. Were seated as soon as my name was taken and the waitress took our drink order right away. Then brought the drinks before any time passed. It was busy and most tables were full but the service was speedy without feeling rushed.\n\nBeing a bariatric patient, I almost always ask for a kid's menu and she happily obliged, no questions asked. Not many restaurants allow an adult to order off the menu without a long explanation or some sort of proof that one is on a bariatric diet or even at all. I immediately noticed that their kid's menu offered a grilled teriyaki salmon, coconut rice and veggie dish. How perfect is that?! I was leary though, as I've never had salmon but said, \"what the heck?! I'll try it\". I was NOT disappointed! The portion of salmon was tiny but enough to fill me up after a bite of rice and the veggies. I took most of it to go. \n\nMy husband and daughter both ordered the wipeout burger and upgraded to the blue cheese fries. They said it was all delicious and the patty was perfectly cooked to medium, just like they asked. \n\nMy son (mr picky) ordered their Cali burger (avocado, bacon and jack cheese) and upgraded to onion rings. He's never ordered a burger like this before as he's a bbq bacon type, usually. I was pleasantly surprised to see him enjoy that burger though. He said the bacon was perfect and he loved it all. \n\nThe burger and fry portions are huge! Definitely shareable for lighter eaters. Even my son, who cleans his plate (13 y/o), left food behind because he was so full. \n\nMy niece ordered the clam chowder in a bread bowl. She's also picky and only usually likes the clam chowder bowls from a little stand in Old Sacramento but said this one was amazing. She never finishes her food but scraped this bowl clean! \n\nOur drinks were never empty and our food was served surprisingly quickly considering how busy it was. I thought for sure there would be a lengthy wait because but they definitely have an efficient and competent kitchen crew! We were in and out in about an hour. The most shocking item on the menu as far as price was my husband's beer; $10!! The prices aren't listed on the menu, which is pretty clever because he wouldn't have ordered it if he knew before hand but oh well, no biggie. Our bill was a few cents over $100 which I found to not be too unreasonable.\n\nWill definitely return!", "rating": 5, "date": "2018-04-07"}, {"excerpts": ["The wipeout burger had the best flavor but this joint was definitely not #2 spot worthy."], "author": "Jackie S.", "review": "Ordered the nachos, pizza bread, wipe out burger, and California burger. Everything was pretty meh. The wipeout burger had the best flavor but this joint was definitely not #2 spot worthy.", "rating": 2, "date": "2018-03-04"}, {"excerpts": ["My husband got the Wipeout burger and it was pretty tasty too. ", "We were pleased!"], "author": "Sarah X.", "review": "Visiting San Fran with the family and decided to stop here for some lunch. I got the Chicken Teriyaki bowl and it was delicious! Definitely would recommend. The meat was tender and everything else was packed with flavor. My husband got the Wipeout burger and it was pretty tasty too. We were pleased!", "rating": 4, "date": "2017-12-06"}, {"excerpts": ["The California Burger and the Wipeout Burger were both very dry. ", "We asked for medium but the came out well. ", "The wipeout burger had no sauce "], "author": "Brandy H.", "review": "It took ten minutes for our server to even come and take a drink order.\n\nFood came out quickly but my order of two tacos came out wrong twice. \n\nThe California Burger and the Wipeout Burger were both very dry. We asked for medium but the came out well. The wipeout burger had no sauce what so ever.\n\nThe tacos themselves deserves a 4/5. The crane Asada was really moist and had a grey sauce on it. The fish tacos also had great flavor but instead of plopping a huge chunk of fried fish on there it would have been better to break the fish up. \n\nI will give them another chance but will only be ordering tacos.", "rating": 3, "date": "2014-08-03"}, {"excerpts": ["I got the Wipeout Burger which was awesome."], "author": "MIke H.", "review": "The food and service was good.  Outside seating was pleasant.  Good comes out fast and the menu was diverse enough.  The food was good.  I got the Wipeout Burger which was awesome.", "rating": 4, "date": "2015-04-19"}, {"excerpts": ["My boyfriend got the wipeout burger ", "cause that's what our server recommended, my boyfriend lovessss burgers ", "and he said it was good, and that's saying something! ", "Okay ", "I know this review is getting really long, but what made this experience so enjoyable was our server David with the sweetest smile and wasn't rushing us at all! ", "He gave us great recommendation, and we will definitely ask for him! ", "Overall 5 BIG STARS for this place!!"], "author": "Lucretia C.", "review": "So I normally don't write yelp reviews cause I feel like it's a waste of time...BUTTTTTT the  good and the service was just AMAZING, that I have to write a review for this place. Starting off with the food review, my boyfriend and I ordered the coconut shrimp, it was on point! The outside was crispy and the flavor of coconut wasn't overwhelming at all! It was perfect! And then for the entrées I had the chicken pasta and OMG!\nSoooooo good!!! I wish the sauce was a little thicker but other then that It was mouthwatering! My boyfriend got the wipeout burger cause that's what our server recommended, my boyfriend lovessss burgers and he said it was good, and that's saying something! Okay I know this review is getting really long, but what made this experience so enjoyable was our server David with the sweetest smile and wasn't rushing us at all! He gave us great recommendation, and we will definitely ask for him! Overall 5 BIG STARS for this place!!", "rating": 5, "date": "2015-07-01"}, {"excerpts": ["The wipeout burger here has started me on a blue cheese burger kick. ", "It was so good that I had to share it with my son ", "and I was fortunate to have this burger be his first time ever having a burger. ", "He loved it. ", "Like romantically. ", "Jru was our server again, and I remembered him from last time, and just as last time he was fast, quick, and speedy with the service, refills, and answers to any questions. ", "He is still great with the kids as he made my infant son giggle like crazy. ", "He also didn't mind that my son was making a full on mess on the ground, which I always feel terrible about, unfortunately he is 8 months old and still working on his dining skills. ", "The birds didn't mind the smorgasbord as we were outside on the patio and they cleaned up the mess tout de suite. ", "Once again, I can not recommend a better place to anyone at Pier 39 for outstanding food and service."], "author": "Michael B.", "review": "Came back to Pier 39 recently with my new son to show him the sights and sounds and sea lions. Decided to stop by Wipeout as I remembered how good it was last time I was here with my daughter. I felt compelled to write this second review as it is rare for me to go back to a place and receive the same 5 star experience again. The wipeout burger here has started me on a blue cheese burger kick. It was so good that I had to share it with my son and I was fortunate to have this burger be his first time ever having a burger. He loved it. Like romantically. Jru was our server again, and I remembered him from last time, and just as last time he was fast, quick, and speedy with the service, refills, and answers to any questions. He is still great with the kids as he made my infant son giggle like crazy. He also didn't mind that my son was making a full on mess on the ground, which I always feel terrible about, unfortunately he is 8 months old and still working on his dining skills. The birds didn't mind the smorgasbord as we were outside on the patio and they cleaned up the mess tout de suite. Once again, I can not recommend a better place to anyone at Pier 39 for outstanding food and service.", "rating": 5, "date": "2016-05-07"}, {"excerpts": ["I had the Grilled Fish Burrito and my boyfriend had the Wipeout Burger and Gnarly Fries. ", "The fries were too salty for my liking, but he seemed to enjoy them. ", "My burrito was really good ", "and it's huge! ", "I had to take it to go. \n", "The decor of the restaurant is cute. ", "I like the mural that is paitned on the walls. ", "We had an overall good experience. ", "We would come back"], "author": "Sharlena S.", "review": "Nice place for it to be a themed bar on the Pier. The staff was very welcoming and attentive. I had the Grilled Fish Burrito and my boyfriend had the Wipeout Burger and Gnarly Fries. The fries were too salty for my liking, but he seemed to enjoy them. My burrito was really good and it's huge! I had to take it to go. \nThe decor of the restaurant is cute. I like the mural that is paitned on the walls. We had an overall good experience. We would come back", "rating": 4, "date": "2013-03-13"}, {"excerpts": ["I had the chicken nachos and my husband had the wipeout burger. ", "We would visit again."], "author": "Joanne R.", "review": "I didn't expect much and was pleasantly surprised. Even though I was there during the lunch rush, I was seated within 5 minutes. Waiter took our order promptly and  and food was pretty good. I had the chicken nachos and my husband had the wipeout burger. We would visit again.", "rating": 4, "date": "2015-10-13"}, {"excerpts": ["We were recommended the Wipeout Burger and Anchor IPA...what a great combo! ", "We asked the really nice bartender Michael where we can have a romantic dinner. ", "He suggested Fog Harbor upstairs. ", "Really great dinner! ", "I would try either one these places if your coming to SF!"], "author": "John R.", "review": "\"Had a great anniversary week in SF and stumbled upon Wipeout. We were recommended the Wipeout Burger and Anchor IPA...what a great combo! We asked the really nice bartender Michael where we can have a romantic dinner. He suggested Fog Harbor upstairs. Really great dinner! I would try either one these places if your coming to SF!", "rating": 5, "date": "2014-03-04"}, {"excerpts": ["2 of us got the wipeout burger and they were fantastic, the only criticism I have is that it could have had a little sauce of some sort on it like some A-1 would have tasted great with the blue cheese and fried onion straws, anything other than Ketchup. \n\n"], "author": "Nicole C.", "review": "This place was much better than expected... First, it appears to be a lot smaller on the outside than it really is on the inside. The decor and atmosphere in the restaurant was fun and playful. \n\nOur group tried the garlic fries and the chili cheese fries and they were fantastic! \n\nThe burgers and sandwiches that were tried in our group all faired well. 2 of us got the wipeout burger and they were fantastic, the only criticism I have is that it could have had a little sauce of some sort on it like some A-1 would have tasted great with the blue cheese and fried onion straws, anything other than Ketchup. \n\nService was top notch, our waiter was on top of everything and even the manager was making rounds to all the tables and making sure everything was great, as well as helping his staff out! \n\nWe had a good time and enjoyed this restaurant!", "rating": 4, "date": "2009-07-26"}], "the california burger": [{"excerpts": ["We got coconut shrimp (see attached photo), the California burger, and another burger ", "(sorry can't remember the name). ", "All three meals received a thumbs up. "], "author": "Madison M.", "review": "We stopped in on Sunday night for a bite to eat. No wait and fast service. We got coconut shrimp (see attached photo), the California burger, and another burger (sorry can't remember the name). All three meals received a thumbs up. If you're walking around the Piers and looking for a place to go, we'd recommend swinging by -- especially if there's a game on you'd like to watch! \n\n\n**if you grab coffee, cookies, or anything else from Biscotti next door the receipt comes with a Wipe-Out coupon!", "rating": 5, "date": "2018-03-15"}, {"excerpts": ["Enjoyed the California Burger. ", "However Pepsi isn't an alternative to Coke, Coke is good, Pepsi isn't."], "author": "Danny D.", "review": "Enjoyed the California Burger. However Pepsi isn't an alternative to Coke, Coke is good, Pepsi isn't.", "rating": 3, "date": "2018-02-25"}, {"excerpts": ["My husband got the California burger ", "And he was very satisfied as well. ", "It also has great service ", "Jamie is an awesome friendly waitress."], "author": "Betzybebb G.", "review": "Best fish tacos i have ever eaten, served with a pic De gallo that is so delicious. My husband got the California burger And he was very satisfied as well. It also has great service Jamie is an awesome friendly waitress.", "rating": 5, "date": "2017-07-01"}, {"excerpts": ["I ordered the California Burger (guacamole, bacon, and jack cheese), my friends ordered clam chowder, the Hawaiian burger, salmon BLT, a regular burger, and fish and chips. \n\n"], "author": "Julie N.", "review": "Since Pier 39 is a huge tourist infested area, the wait for a table was about 30 minutes. That's totally understandable since it was a crowded day on the pier and we had a group of 10. \n\nEverybody ordered their food; we were all really excited to eat and extremely hungry. I ordered the California Burger (guacamole, bacon, and jack cheese), my friends ordered clam chowder, the Hawaiian burger, salmon BLT, a regular burger, and fish and chips. \n\nIt all went wrong when every single person at the table got their food, but me. I obviously was pretty angry because well, everybody finished most of their food and my food STILL wasn't out. My friend asked the workers if my food was coming out yet, but they just said they would \"check on it.\" After 5 minutes, my food still wasn't coming out while people who came in after me got their food first... ok?? My food was obviously forgotten and the workers were obviously ignoring our table. 5 minutes later, my food FINALLY came out after a 20 minute wait. Oh, and the waiter also forgot my friend's order of French fries, did he not write ANY of the orders down, or...????\n\nMy burger was mediocre, tasted like a burger. There was nothing special about it, even though the price for it was pretty expensive.\n\nWhen the check came out, the waiter said he took my burger off the check. I felt bad for being angry, so I gave him a nice tip. But there was a problem with the check, and he ended up charging my friend's credit card twice... Which pretty much made me angry again because I gave him a good tip for being a lousy waiter. I didn't expect amazing service, but I expected at least decent service.", "rating": 2, "date": "2015-08-04"}, {"excerpts": ["The California Burger, medium-rear was fulfilling", "; I was actually impressed, I thought it'd be a basic tasting burger ", "but it was pretty good."], "author": "Stacy O.", "review": "The California Burger, medium-rear was fulfilling; I was actually impressed, I thought it'd be a basic tasting burger but it was pretty good.", "rating": 4, "date": "2017-02-13"}, {"excerpts": ["The California burger was great as well. ", "Very cute decor. ", "Service was slow but very kind and accommodating. ", "Drinks were very expensive."], "author": "Carrie J.", "review": "Excellent nachos...enough for 2. Children's menu salmon was delish according to our 12 year old. The California burger was great as well. Very cute decor. Service was slow but very kind and accommodating. Drinks were very expensive.", "rating": 4, "date": "2017-04-02"}, {"excerpts": ["at $20, before tip, for the California burger, FF and a soft drink ($3.50 alone!)."], "author": "Leah M.", "review": "Located just inside the shopping area of Pier 39.  A very relaxed surfer-themed restaurant to get American style burgers and fries.  Sit inside or outside.  They have a really nice bonfire area near the front entrance if you are lucky enough to get a seat there on a chilly Fall evening. The hostesses were especially nice and accommodating.  \nA little pricey (but what isn't in San Francisco?) at $20, before tip, for the California burger, FF and a soft drink ($3.50 alone!).", "rating": 4, "date": "2014-11-16"}, {"excerpts": ["I ordered the California burger (which comes with guacamole and bacon) medium rare and they cooked it perfectly. ", "The fries were pretty average but nothing to complain about. ", "The prices for everything were very reasonable and we all left very full and happy. ", "Also an added bonus for families with little ones, they have a stroller parking area where we were able to leave our stroller while we ate, and their bathrooms have changing tables which was also great when you have a little one in diapers!"], "author": "Julia O.", "review": "I came here with my family while we were visiting Pier 39 and we had a great experience! There were 3 adults and 2 children in our party and even though it was a busy Sunday, we were seated within about 15 minutes. Our server was very friendly and attentive, and she took our drink orders right away. We started with nachos to share and they were huge! My only complaint was that the cheese wasn't all the way melted on some parts but they were still yummy. The entree portions were also very generous. I ordered the California burger (which comes with guacamole and bacon) medium rare and they cooked it perfectly. The fries were pretty average but nothing to complain about. The prices for everything were very reasonable and we all left very full and happy. Also an added bonus for families with little ones, they have a stroller parking area where we were able to leave our stroller while we ate, and their bathrooms have changing tables which was also great when you have a little one in diapers!", "rating": 5, "date": "2016-04-17"}, {"excerpts": ["The California Burger and the Wipeout Burger were both very dry. ", "We asked for medium but the came out well. ", "The wipeout burger had no sauce "], "author": "Brandy H.", "review": "It took ten minutes for our server to even come and take a drink order.\n\nFood came out quickly but my order of two tacos came out wrong twice. \n\nThe California Burger and the Wipeout Burger were both very dry. We asked for medium but the came out well. The wipeout burger had no sauce what so ever.\n\nThe tacos themselves deserves a 4/5. The crane Asada was really moist and had a grey sauce on it. The fish tacos also had great flavor but instead of plopping a huge chunk of fried fish on there it would have been better to break the fish up. \n\nI will give them another chance but will only be ordering tacos.", "rating": 3, "date": "2014-08-03"}, {"excerpts": ["The California burger, which has bacon guacamole reminds me of something I'd find "], "author": "Michael H.", "review": "The California burger, which has bacon guacamole reminds me of something I'd find while strolling along the diners near Santa Cruz, that is the diners that existed before all the night clubs and posh wine bars that replaced them along the warf.\n\nI've been here a few times after work to grab a bite and couple drinks, though it should be noted that while it has a full bar this place is super family friendly. The band that plays every now and again inside will often have to compete with children playing on the floor near the \"stage\" area.\n\nI imagine parents really like this place.", "rating": 4, "date": "2013-08-09"}, {"excerpts": ["Went there w my three girlfriends had some drinks and the California burger! ", "Great service the lady Juana was very helpful! ", "Loved the atmosphere and the food was delicious!"], "author": "Amber A.", "review": "Went there w my three girlfriends had some drinks and the California burger! Great service the lady Juana was very helpful! Loved the atmosphere and the food was delicious!", "rating": 5, "date": "2013-11-07"}, {"excerpts": ["And also had the California burger.\n\n"], "author": "Peter C.", "review": "Sometimes, ladies and gentleman, as much as you might not like to hear it, there may be a very good reason as to why your server isn't as bubbly as you'd like. You are probably a rude, disrespectful customer. \n\nThat being said, I had a great time here. Just needed to kill some time before the ferry, and I sat outside in the sun. Had two Cuervo spiked Corona's which were great. And also had the California burger.\n\nService wise, I had servers who weren't even assigned to my section come up and talk to me with smile on. Everyone was real nice, and down to earth.\n\nWhile a bit on the pricey side, it must be said that it being a tourist trap, that is kind of unavoidable.", "rating": 5, "date": "2012-04-18"}, {"excerpts": ["i had the california burger and not only was it decent size (1/2lbs) ", "it was delicious. ", "its not very expensive either it was about 13 for the burger and it came with a load of fries."], "author": "Steven N.", "review": "really good food. i had the california burger and not only was it decent size (1/2lbs) it was delicious. its not very expensive either it was about 13 for the burger and it came with a load of fries.", "rating": 4, "date": "2011-06-29"}, {"excerpts": ["For the main event, I ordered the California Burger that comes with a 1/2 lb burger, guacamole, bacon, and a gloriously toasted bun. ", "It was super delicious. "], "author": "Matt B.", "review": "My wife and I went to the Wipeout Bar and Grill on June 1, '08. It was one of those cold evenings at Pier 39, and we were super glad to be rushed to our seats at a warm table inside. \n\nThere was some sort of police/security activity going on when we arrived... it seemed like a few teenage girls were angry about a discrepancy in their bill from an earlier event. Why they couldn't talk to the manager without bringing in the cavalry is beyond me. Either way... it made the experience more interesting, and didn't take away from our enjoyment.\n\nThe initial service wasn't super fast. I had a feeling that the commotion up front had something to do with that... but either way, it was about 10 minutes before our server had dropped by to ask us for our beverage selection. Once we had his attention though, he was on the ball. \n\nWe started off with chips & salsa, but the \"roasted tomato salsa\" left much to be desired. It didn't have any kick whatsoever. We ended up dropping in a lot of Tapatio to spice things up.\n\nFor the main event, I ordered the California Burger that comes with a 1/2 lb burger, guacamole, bacon, and a gloriously toasted bun. It was super delicious. My wife ordered the Teriyaki & Pineapple sandwich, which she said was good, but she wasn't super excited about it.\n\nOverall, it was nice to get out of the cold and have a juicy burger lathered in guacamole. Mmm...", "rating": 3, "date": "2008-06-03"}, {"excerpts": ["The California burger was one of the best ever...perfectly cooked, fresh avocado, crispy bacon, and amazingly fresh fries.  ", "I was in heaven.  ", "All made better by the delightful company of the manager, Gerald who I chatted with easily as I sat at the bar (originally I ordering take out but the pleasant atmosphere made me switch to eat in).  ", "He was extremely attentive to all customers and just topped off the overall dining experience.  ", "Will definitely be back again."], "author": "Denise E.", "review": "I had to fast all day before a doctor's appointment. After which I was DYING for a big juicy hamburger.  I found the Wipeout Bar and Grill using the nearby search feature of the yelp mobile app (love that).  I'm super picky when it comes to burgers and this was seriously a delicious treat. The California burger was one of the best ever...perfectly cooked, fresh avocado, crispy bacon, and amazingly fresh fries.  I was in heaven.  All made better by the delightful company of the manager, Gerald who I chatted with easily as I sat at the bar (originally I ordering take out but the pleasant atmosphere made me switch to eat in).  He was extremely attentive to all customers and just topped off the overall dining experience.  Will definitely be back again.", "rating": 5, "date": "2012-08-10"}, {"excerpts": ["I ordered the coconut shrimp and the BF got the california burger with garlic fries. ", "The service was good and the drinks were always refilled and the food came fast. ", "The french fries were great. ", "I have an obsession with french fries and I thought these were pretty good. ", "The coconut shrimp were large and very coconut-y haha and they give you a pretty good amount. ", "They come with this chili/honey dip or something ", "and it was pretty spicy. ", "The boyfriends burger was delicious! ", "It had bacon, guacamole and jack cheese on it and the garlic fries were good as well not too garlicky too where it was overwhelming. ", "Meal came out to $41 and some change, pretty expensive but its Fishermans Wharf "], "author": "Cheri M.", "review": "My boyfriend and I took a \"daycation\" to San Francisco to walk around Fishermans Wharf and couldn't figure out where to eat. The boyfriend doesn't really like seafood so we were walking by this place and the prices looked okay and they had some seafood and pizza/burgers n such so we just decided to eat here. We ate outside and they had this cool little fire pit with a few chairs around it so people could grab a drink and sit down and relax. We didnt get any margaritas or alcohol but a lot of people around us did. They looked pretty good. We started with chips and salsa which were bleh. They were really plain and the salsa kind of sucked. I ordered the coconut shrimp and the BF got the california burger with garlic fries. The service was good and the drinks were always refilled and the food came fast. The french fries were great. I have an obsession with french fries and I thought these were pretty good. The coconut shrimp were large and very coconut-y haha and they give you a pretty good amount. They come with this chili/honey dip or something and it was pretty spicy. The boyfriends burger was delicious! It had bacon, guacamole and jack cheese on it and the garlic fries were good as well not too garlicky too where it was overwhelming. Meal came out to $41 and some change, pretty expensive but its Fishermans Wharf so I expected it.\n\nOverall it was a cool place to grab a quick bite to eat. This wouldn't be my top choice and am definitely going to try some other places next time we come to the wharf.", "rating": 3, "date": "2010-05-19"}], "chili cheese dog": [{"excerpts": ["I got the chili cheese dog with French fries and jalapeños on top of my hot dog. ", "The coleslaw was flavorless and disgusting."], "author": "Aj C.", "review": "By far the slowest service in Pier 39!\n\nFirst of all, I went to the wrong area because I thought that's where they seat you. How beer, everyone that passed me ignored me for 10 minutes. When a couple waited behind me, a waitress escorted them to where they should wait... WTF?\n\nSecond of all, when we tried paying for the check, our waitress literally took more than 20 minutes to get to our table.\n\nThe food as mediocre too.\n\nI got the chili cheese dog with French fries and jalapeños on top of my hot dog. The coleslaw was flavorless and disgusting.", "rating": 1, "date": "2016-04-20"}, {"excerpts": ["I ordered the BBQ Pork and my friend ordered the Chili Cheese Dog (see below). ", "It comes with fries and coleslaw. ", "The portions are decent and plenty to feel full afterwards! ", "I really liked the texture of the BBQ Pork - tenderrr. ", "The BBQ flavor was really yummy - not spicy or anything like that either. ", "My friend enjoyed the chili cheese dog as well =]\n\n"], "author": "Nicole C.", "review": "I came here on a Thursday evening and it wasn't packed at all. There's inside and outside seating (don't worry, there's heaters up above). When you walk in, make a left towards the entrance where a hostess can help you!\n\nI ordered the BBQ Pork and my friend ordered the Chili Cheese Dog (see below). It comes with fries and coleslaw. The portions are decent and plenty to feel full afterwards! I really liked the texture of the BBQ Pork - tenderrr. The BBQ flavor was really yummy - not spicy or anything like that either. My friend enjoyed the chili cheese dog as well =]\n\nI also came here and went to the bar. The bartenders are super nice and their drinks are priced normally which kind of surprised me since this place is on Pier 39. I would definitely come back here again to hang out since it is pretty spacious to eat with a large group of friends! I also really appreciate how their menu thoroughly points out what is in each of the entrees and drinks they have!", "rating": 4, "date": "2015-02-27"}, {"excerpts": ["Our son had the chili cheese dog which he devoured within a few minutes (as like any other 17 yr. ", "old would). ", "The only issue he had with eating outside here, was that the birds were freaking him out, LOL!. \n", "I had the Sesame Seared Tuna bowl, which at $17-18, I thought was a little expensive for lunch. ", "Then our waitress, Gabby, brought it out and that question left me as soon as I tried the wasabi aioli topped, ginger smothered, ahi tuna. ", "It was all resting on top of stir-fried veggies and coconut rice. ", "This dish was GREAT!!! ", "The freshly cut tuna was perfectly cooked to just above rare, and the crust wasn't overpowering. ", "I'm not a veggie/rice person, but they were well seasoned and the rice was just right. "], "author": "David E.", "review": "Our little family of 4 decided to have a \"family fun day\" summer got away from us. So San Francisco here we come. We first went to the California Academy of Science (review to come), and worked up an appetite and decide to head down to Fisherman's Wharf, luckily we found parking across from Pier 39 and proceeded across the skywalk. After checking out a few places, we decided to eat here (daughter HAD to have chicken tenders). \nThe wait wasn't to bad for a Saturday at 2:00pm, maybe 20 minutes top. My wife ordered the same as our \"princess\", which were 4 or 5 strips of REALLY juicy, crispy chicken. They did say that the fries were so-so, and I don't think either one touched their coleslaw - too bad, I liked it just fine. Our son had the chili cheese dog which he devoured within a few minutes (as like any other 17 yr. old would). The only issue he had with eating outside here, was that the birds were freaking him out, LOL!. \nI had the Sesame Seared Tuna bowl, which at $17-18, I thought was a little expensive for lunch. Then our waitress, Gabby, brought it out and that question left me as soon as I tried the wasabi aioli topped, ginger smothered, ahi tuna. It was all resting on top of stir-fried veggies and coconut rice. This dish was GREAT!!! The freshly cut tuna was perfectly cooked to just above rare, and the crust wasn't overpowering. I'm not a veggie/rice person, but they were well seasoned and the rice was just right. If I could have (without embarrassing my family), I would have licked my plate clean :)\n\nKudos to the chefs, cooks, and wait staff, you ALL made our day by making us feel at home :)\n\nP.S. Don't forget to have your parking validated before you leave. It saved us almost $20.00!", "rating": 4, "date": "2015-07-26"}], "grilled chicken breast": [{"excerpts": ["This consisted of a grilled chicken breast, teriyaki sauce, grilled pineapple and jack cheese served on a toasted bun. "], "author": "Donovan H.", "review": "When you have a tourist trap area like Pier 39/Fisherman's Wharf in the most popular part of San Francisco, one might always assume that food & drink prices are absurdly inflated. Not to mention, some of these restaurants offer only mediocre quality food. Surprisingly, this isn't quite the case with \"Wipeout Bar & Grill\".\n\nAs far as getting to this restaurant (located in the heart of Pier 39), it is relatively easy to find as you will see giant wooden posts paired up with palm trees and surfboards, it almost looks like a place that should be in Malibu or Honolulu and not a cool climate like San Francisco. Forget about driving to this place; the parking garage is located a couple blocks away. My advice is to either walk, bike, take a cab, Muni bus, or trolley.\n\nThis is actually my second time dining here, however it is my first review on the place. I came here with my lady and our friend (who was celebrating her birthday over Labor Day weekend). We arrived around 5:30pm (on the afternoon of Sunday 9/4/16) and were told by the hostess it would be about a 35-minute wait. Unfortunately, this place does not provide the portable buzzers when your table is ready; nor do they text you. Not a big deal but staying near the restaurant hearing for someone to call your name can be challenging, especially since it is very loud inside.\n\nAnd speaking of the inside, you will find a fairly large and spacious dining area complete with a very surf-inspired theme to it. Some of the tables are even carved out as surfboards. And for the serious surf enthusiasts, there is also a chalkboard that lists the daily surf reports as well as shark attack reports. One thing I didn't really care for were the bathrooms. A restaurant this busy only had 3 toilets (with private doors) that are used by men & women while the sink is located outside. That's a bit odd if you ask me. The outside has plenty of seating to dine as well as fire pits for those cold, foggy San Francisco days.\n\nFortunately the wait time was only 20 minutes and we are all seated around 5:50pm. Our hostess (whom I forgot her name) was very friendly and had an awesome personality. We all ordered drinks, I was craving an iced cold beer so I went with a 20 oz. size of the Ballast Point Sculpin IPA. To eat, I decided on their \"Teriyaki Pineapple Chicken Sandwich\" (for $12.95). This consisted of a grilled chicken breast, teriyaki sauce, grilled pineapple and jack cheese served on a toasted bun. As my side of choice, I went the healthier route and went with a side salad w/vinaigrette dressing.\n\nAs busy as this place was, all three of us got our meals out in less than 15 minutes; I find that to be quite impressive. Now onto the food.. I actually enjoyed every bite of my pineapple chicken sandwich. It was flavored very well and was a very generous portion that filled me up very well. My lady ordered their \"Teriyaki Chicken Rice Bowl\" and she loved her meal as well. However, our friend (who wasn't that hungry) only went with the \"Coconut Fried Shrimp\" (which was priced at $10.95) and was not satisfied how small the amount of food was that she got. My entree (that was only a mere $2.00 more) had way more overall food. So it really depends on what you order that determines if you get your moneys worth or not.\n\nOverall, \"Wipeout Bar & Grill\" is a decent place that won't burn a hole in your pocket. They do serve breakfast, a huge variety of drinks (with a full bar & several beers on tap), and finally a decent dessert menu. And speaking of desserts, our friend (the birthday girl) had Happy Birthday sung to her and got complimentary chocolate lava cake with vanilla ice cream and whipped cream. So all in all, its a solid 4-star dining experience, not the best place I've been to but far better than some of the other overpriced touristy restaurants in the area.", "rating": 4, "date": "2016-09-07"}], "the beach club": [{"excerpts": ["My friend had gotten \"The Beach Club\", which looked pretty good! ", "It had 5 rolls of turkey, between sourdough bread, onion, tomatoes, lettuce... "], "author": "Phoebe T.", "review": "Came here for the first time since it was my best friend's Birthday (Saturday), it was pretty crowded but the wait was only 15 minutes. When it was our turn to get seated they sat us down outside between a couple and a family, it sucked because I could hear in both sides of the conversation.\n\nAnywho, lets talk about food. So, since it was my friend's Birthday the manager (I believe?) talked her into getting a beer, we didn't really pay much attention to what the name the beer was but he had told us it was from Hawaii, something Kona(?), it was alright it actually reminded us of a more fizzier Corona if that makes any sense, a glass of that was $8!!! \n\nI ordered the grilled chicken burrito, it wasn't all that great. It had bean, grilled chicken, and that's pretty much all I can remember (not memorable what so ever), it also came with some chips but no salsa! FAIL.\n\nMy friend had gotten \"The Beach Club\", which looked pretty good! It had 5 rolls of turkey, between sourdough bread, onion, tomatoes, lettuce... Additional avocado for $1 and a side of friends ($10.95), not bad for a sandwich especially for a spot like this.\n\nThe thing that really rubbed me the wrong way was that when the couple that was sitting next to us left, some random guy with a glass of red wine just walked up and sat next to us and kept staring at me when I was eating! It was really rude so I turned to him & asked him what he was looking at and his response was \"You have such a beautiful face and such a nice body\", I was like \"WTF?!\", he wouldn't leave me alone!!! My friend & I started telling him off but he just sat there smiling at me and looking at me as though I was a piece of carcass and he was a hungry vulture! Finally he got the point and walked off & our waiter finally returned & I had told him what happened, he told us that he'll make sure that guy doesn't sit there & as he left to go back to the kitchen the creeper came back & kept complimenting me! That was my last straw! My friend & I kept yelling at him & he finally left. UGH!!!!\n\nAnother thing that confused me was that they had given my girlfriend a Birthday dessert (usually restaurants give small ones for free) but I was charged $6 for that! If I knew it was $6, I wouldn't have even told him it was her Birthday since we were already getting irritated with this place!\n\nOverall, our bill came out to almost $50. We paid for my burrito, her sandwich, a beer and her Birthday dessert that we never even ordered. This place gets a 2 star. Decent food, decent price, weirdos, and sad that we had to pay for a dessert we didn't order. Never coming back.", "rating": 2, "date": "2012-02-20"}], "teriyaki pineapple chicken": [{"excerpts": ["To eat, I decided on their \"Teriyaki Pineapple Chicken Sandwich\" (for $12.95). "], "author": "Donovan H.", "review": "When you have a tourist trap area like Pier 39/Fisherman's Wharf in the most popular part of San Francisco, one might always assume that food & drink prices are absurdly inflated. Not to mention, some of these restaurants offer only mediocre quality food. Surprisingly, this isn't quite the case with \"Wipeout Bar & Grill\".\n\nAs far as getting to this restaurant (located in the heart of Pier 39), it is relatively easy to find as you will see giant wooden posts paired up with palm trees and surfboards, it almost looks like a place that should be in Malibu or Honolulu and not a cool climate like San Francisco. Forget about driving to this place; the parking garage is located a couple blocks away. My advice is to either walk, bike, take a cab, Muni bus, or trolley.\n\nThis is actually my second time dining here, however it is my first review on the place. I came here with my lady and our friend (who was celebrating her birthday over Labor Day weekend). We arrived around 5:30pm (on the afternoon of Sunday 9/4/16) and were told by the hostess it would be about a 35-minute wait. Unfortunately, this place does not provide the portable buzzers when your table is ready; nor do they text you. Not a big deal but staying near the restaurant hearing for someone to call your name can be challenging, especially since it is very loud inside.\n\nAnd speaking of the inside, you will find a fairly large and spacious dining area complete with a very surf-inspired theme to it. Some of the tables are even carved out as surfboards. And for the serious surf enthusiasts, there is also a chalkboard that lists the daily surf reports as well as shark attack reports. One thing I didn't really care for were the bathrooms. A restaurant this busy only had 3 toilets (with private doors) that are used by men & women while the sink is located outside. That's a bit odd if you ask me. The outside has plenty of seating to dine as well as fire pits for those cold, foggy San Francisco days.\n\nFortunately the wait time was only 20 minutes and we are all seated around 5:50pm. Our hostess (whom I forgot her name) was very friendly and had an awesome personality. We all ordered drinks, I was craving an iced cold beer so I went with a 20 oz. size of the Ballast Point Sculpin IPA. To eat, I decided on their \"Teriyaki Pineapple Chicken Sandwich\" (for $12.95). This consisted of a grilled chicken breast, teriyaki sauce, grilled pineapple and jack cheese served on a toasted bun. As my side of choice, I went the healthier route and went with a side salad w/vinaigrette dressing.\n\nAs busy as this place was, all three of us got our meals out in less than 15 minutes; I find that to be quite impressive. Now onto the food.. I actually enjoyed every bite of my pineapple chicken sandwich. It was flavored very well and was a very generous portion that filled me up very well. My lady ordered their \"Teriyaki Chicken Rice Bowl\" and she loved her meal as well. However, our friend (who wasn't that hungry) only went with the \"Coconut Fried Shrimp\" (which was priced at $10.95) and was not satisfied how small the amount of food was that she got. My entree (that was only a mere $2.00 more) had way more overall food. So it really depends on what you order that determines if you get your moneys worth or not.\n\nOverall, \"Wipeout Bar & Grill\" is a decent place that won't burn a hole in your pocket. They do serve breakfast, a huge variety of drinks (with a full bar & several beers on tap), and finally a decent dessert menu. And speaking of desserts, our friend (the birthday girl) had Happy Birthday sung to her and got complimentary chocolate lava cake with vanilla ice cream and whipped cream. So all in all, its a solid 4-star dining experience, not the best place I've been to but far better than some of the other overpriced touristy restaurants in the area.", "rating": 4, "date": "2016-09-07"}, {"excerpts": ["Hubby had fish & chips & I had the teriyaki pineapple chicken sandwich.  ", "It was smothered in teriyaki sauce which I would wasn't the case ", "but maybe the the recipe!\n", "In totally I would recommend this place! \n", "Thank you Karen!"], "author": "Simi K.", "review": "First time dining in! Had lunch in the patio area! Super packed! Fast and friendly service! \nFire pit was awesome as it's usually chilly in the city. And the pigeons were amusing to watch as they fight for food on the floor! Our server Karen was wonderful! I don't know  how many tables she was handling but she certainly took care of us! Even I we noticed the management was involved in taking care of people! It's a wonderful resturant. Menu: has salads sandwiches burgers pizza tacos! Great choices. Hubby had fish & chips & I had the teriyaki pineapple chicken sandwich.  It was smothered in teriyaki sauce which I would wasn't the case but maybe the the recipe!\nIn totally I would recommend this place! \nThank you Karen!", "rating": 5, "date": "2017-10-20"}, {"excerpts": ["Teriyaki Pineapple Chicken Sandwich ($12.50) - ", "I'm cutting down on my red meat, so I decided to get chicken instead. ", "It was okay. ", "The bun was way too small for the chicken..or the chicken was too big for the sandwich. ", "The teriyaki & pineapple was good, but definitely made the sandwich messy to eat. ", "Towards the end, I ended up using my fork & knife to eat it. ", "It was just okay though. ", "It also came with crispy fries, which were good. "], "author": "Jessica A.", "review": "My family celebrated Easter early, so when it was actually Easter Day, I decided to spend it with my brother, his girlfriend, & their daughter. It was a bit on the sunny side (at least in the morning), so we wanted to do something. We decided to go to Pier 39! \n\nCouldn't really decide where we should eat. Picked a couple places & just went with the one with the shortest wait..considering that it was a Sunday, Easter, & a tourist spot all day every day. The winning restaurant = Wipeout Bar & Grill.\n\nWhile I thought I'd have a good day (I mean..it was Easter!), the moment I went to up to the hostesses, I was automatically in a bad mood. I originally went up to the hostesses to inquire about the wait time for 4 people. They kind of just stared at me for a while, which made me feel uncomfortable. One woman asked, \"Do you have a preference?\" First of all, preference for what?! When I didn't answer right away, she looked at me like I was stupid, which I did NOT appreciate!! I think that's what ticked me off. She still didn't clarify her question, but I had figured out what she was asking me. But already from that point, I just didn't want to deal with her anymore. I almost wanted to tell my brother to let's go somewhere else, but I knew everyone was hungry. \n\nThey told me about 20-30 minutes wait time, so my brother, his girlfriend, & their daughter wandered around the area a bit. I decided to stay behind just in case we were called. They called my name (which they got wrong btw. I'm pretty sure 'Jessica' is a pretty common name) & I told them that I had to get the rest of my party. They were very IMPATIENT & quick to grab someone else. Like seriously?! They kept pushing me to hurry up basically & that was NOT okay. \n\nAfter getting horrible hostess service, I was hoping that the rest of the experience would make up for it. Our waitress was really nice, which is why I gave 2 stars instead of 1 star. As for the food, that was alright. Here's what we ordered...\n\nTeriyaki Pineapple Chicken Sandwich ($12.50) - I'm cutting down on my red meat, so I decided to get chicken instead. It was okay. The bun was way too small for the chicken..or the chicken was too big for the sandwich. The teriyaki & pineapple was good, but definitely made the sandwich messy to eat. Towards the end, I ended up using my fork & knife to eat it. It was just okay though. It also came with crispy fries, which were good. I probably wouldn't order it again.\n\nThe Hawaiian Burger ($11.95) - My brother got this. He was craving a burger, & was satisfied. Also came with crispy fries.\n\nFish & Chips ($13.95) - My brother's girlfriend got this. She liked it..oh, my niece did too. \n\nOverall, I'm not a fan of my experience at Wipeout Bar & Grill. From the beginning, my experience started to go downhill. If I'm back at Pier 39, I would rather take my services elsewhere.", "rating": 2, "date": "2012-04-11"}, {"excerpts": ["I had the Teriyaki Pineapple Chicken sandwich and my kids had chicken fingers and pizza from the kid's menu. ", "Large portions and tasted great. ", "My only complaint was the service, after our food was dropped off our waiter never came back to check on us or refill drinks. ", "Our cups were empty at least 25 minutes while we ate. ", "I finally had to ask the hostess to bring my son some ranch. ", "When we saw our waiter again he was bringing the check. ", "As a former waitress I feel strongly that you need to check that your table at least has everything they need to eat their meal, especially considering it was not crazy busy. ", "I would eat here again on another trip because the food was excellent and a great choice for families."], "author": "Maggie R.", "review": "My two children and I ate here on January 30, around 7 pm. The restaurant was busy, but not packed. We came here because of some discount coupons I got from the CA Visitor's Center upstairs with my AAA card- 20% off or a free kid's meal. The food is excellent- I had the Teriyaki Pineapple Chicken sandwich and my kids had chicken fingers and pizza from the kid's menu. Large portions and tasted great. My only complaint was the service, after our food was dropped off our waiter never came back to check on us or refill drinks. Our cups were empty at least 25 minutes while we ate. I finally had to ask the hostess to bring my son some ranch. When we saw our waiter again he was bringing the check. As a former waitress I feel strongly that you need to check that your table at least has everything they need to eat their meal, especially considering it was not crazy busy. I would eat here again on another trip because the food was excellent and a great choice for families.", "rating": 3, "date": "2016-01-18"}], "fried fish sandwich": [{"excerpts": ["Well I'll raise you a barnacle and a hungry stomach in exchange for your finest fried fish sandwich with chips. "], "author": "Andy L.", "review": "Aww man! Why didn't I come to this place sooner! I've always passed by this restaurant while visiting Pier 39, never giving it any thought whatsoever! Come time for lunch during a busy weekend outing and this place was nominated as our new restaurant of the day. Wipeout Bar & Grill, why have you never caught my attention before? \n\nWipeout, I see you've got a lot of surf food and beach snacks on your menu! Well I'll raise you a barnacle and a hungry stomach in exchange for your finest fried fish sandwich with chips. Throw in some chili for good measure and let me wash it down with your smoothest virgin ocean rum AKA water. \n\nOur chosen fare consisted of seafoods and meats! From Chorizo & Chicken pizza, Fish Fried Sandwich, to the Carne Asada Burritos, we definitely had a little land and sea action going on! We had an awesome waitress named Natasha and a patio table with great scenery and shade! Couldn't have asked for a better first time experience at Wipeout!\n\nI love eating seafood and on this particular day, I was craving it! Wipeout had a charismatic and fun environment! Our main waitress Natasha and all the other waiters who helped us were super friendly and energetic! In all, I would definitely recommend this place for their great selection of seafoods and other menu items, even if it was only for a Clam Chowder with bread bowl. \n\nSurfs up!", "rating": 4, "date": "2017-07-06"}, {"excerpts": ["and I ordered the fried fish sandwich. "], "author": "Chris F.", "review": "This place is alright. My girlfriend and I sat at the bar. She ordered the taco salad and I ordered the fried fish sandwich. We ordered beer and a piña colada as well. \n\nThe beer was cold. The piña colada was good. The service was pretty good. If you want to drink go here. \n\nThe food was average at best. The fish was greaser than I would expect. The taco salad had too much cabbage. An option of onion rings instead of fries would be nice. Fresh avocado would be great. No sour cream on the salad? Weird. \n\nThere was a roach. The manager was alerted. He said he would take care of it.", "rating": 2, "date": "2015-09-08"}, {"excerpts": ["Lastly,...their Fried Fish Sandwich....lets just say there was more bread than fish. "], "author": "D. N.", "review": "The quality of food here is not healthy IMHO. \nI feel much regret going here because the food was so very....VERY SALTY and not that appetizing......as I write this...I feel sick to my stomach. \n\nThe Clam Chowder was nothing close to what you get on Fisherman's Wharf...which would have satisfied me for dinner alone. It was too salty again and tasted like canned soup. and did not taste freshly made. \n\nAnd make sure that if you want Calamari....for $9.95....you get only Calamari. \n\nThey ended up ordering us the Calamari \"Entree\" which we did not specify as what we wanted...so they charged us the $14.95. The fries I suppose was $5 but those too were not great at all. \n\nLastly,...their Fried Fish Sandwich....lets just say there was more bread than fish. And it tasted no different from what I have eaten at the run of the mill fast food joint.  \n\nOverall....It was a big disappointment for both me and my boyfriend that we do not ever plan to come here again.\n\nThe staff was courteous and we appreciated that. Just not the food. Sorry...but Wipeout at Pier 39 was a definite Wipeout of our hard-earned money!  \n\nOh btw....Keep in mind. Restaurants in San Francisco charge for the food, tax....and charge an extra ordinance fee to you. \n\nThat just about put the icing on the cake that did not agree with us....a definite \"No way Jose!\" for us if we were to wonder where to go and eat again in SF.", "rating": 1, "date": "2016-05-06"}], "salmon blt": [{"excerpts": ["I absolutely love the seafood combo, fish and chips and salmon BLt sandwich.\n\n"], "author": "Amit S.", "review": "This is one of my go to places every time I visit pier 39. I absolutely love the seafood combo, fish and chips and salmon BLt sandwich.\n\nThis place has amazing ambience and there is indoor as well as outdoor seating available.\n\nThe drinks are pretty awesome with great service.", "rating": 5, "date": "2017-06-12"}, {"excerpts": ["We had their cod fish n chips, which were a little greasy but sooo worth whatever the calories were, and a salmon BLT. ", "It never occurred to us to combine our favorite fish with our favorite sandwich, but it was delicious and we're glad we ordered it. ", "The staff was also super quick to refill our drinks, which is great. \n", "The decor is funny, and very clever. ", "From using surf boards as tables, to reusing Coors Light holders for condiments really reinforced the whole \"day at the beach\" feeling. ", "The bathrooms were also great. ", "Through a cute little beach tent, they have four unisex stalls (more like little rooms) which were very clean, and an area for everyone to wash their hands. \n", "The only thing that kinda sucked, (pun intended) is that they use paper straws instead of plastic straws. ", "While this is way better for the environment, and I dig that, they do kinda get soggy after a little while of drinking and need to be replaced.\n", "So while the price is a little more then we wanted to spend, it is 100% worth it, and next time we visit San Francisco we will return here!"], "author": "Jeremy L.", "review": "We stopped by Monday at about seven, and were seated immediately. The staff was incredibly polite, and fast with bringing out our drinks and food. It was kinda busy, so we were super surprised to be able to eat so quickly. The food was absolutely delicious, and cooked to perfection. We had their cod fish n chips, which were a little greasy but sooo worth whatever the calories were, and a salmon BLT. It never occurred to us to combine our favorite fish with our favorite sandwich, but it was delicious and we're glad we ordered it. The staff was also super quick to refill our drinks, which is great. \nThe decor is funny, and very clever. From using surf boards as tables, to reusing Coors Light holders for condiments really reinforced the whole \"day at the beach\" feeling. The bathrooms were also great. Through a cute little beach tent, they have four unisex stalls (more like little rooms) which were very clean, and an area for everyone to wash their hands. \nThe only thing that kinda sucked, (pun intended) is that they use paper straws instead of plastic straws. While this is way better for the environment, and I dig that, they do kinda get soggy after a little while of drinking and need to be replaced.\nSo while the price is a little more then we wanted to spend, it is 100% worth it, and next time we visit San Francisco we will return here!", "rating": 5, "date": "2018-03-26"}, {"excerpts": ["I ordered the salmon BLT that looked appetizing. ", "Too bad there was barely any mayo on it, making the salmon taste drier than it already did. ", "(Points for adding a nice portion of lettuce", ", so I could get some green in.) "], "author": "Tanvier P.", "review": "Mmm, yeah ... this place was just okay. Fisherman's Wharf is super busy and filled with tourists. With so many places to choose from we decided to give this one a shot. The spot is fun and has the quintessential beach theme to it. Our server was very nice and attentive.\n\nThe food, however, was forgettable.\n\nI ordered the salmon BLT that looked appetizing. Too bad there was barely any mayo on it, making the salmon taste drier than it already did. (Points for adding a nice portion of lettuce, so I could get some green in.) My husband did say he enjoyed his fish tacos.\n\nThe biggest disappointment came with our kids' order. The chicken tenders they got were so hard and over-cooked, I'm pretty sure the sea life wouldn't dare touch them. You could barely pull pieces of edible meat from each tender. Needless to say, our kids ended up eating our food.\n\nLike others commenting, it took a while to get our food and for the waitress to come back with check. I will say the waitress (likely a grandmother) did an awesome job of splitting up our kids' single meal on two plates, and bringing out their food before ours.\n\nMaybe this place had an off day. We won't be returning to find out. I guess I should've looked at all the three star reviews before picking this place.", "rating": 3, "date": "2016-04-18"}, {"excerpts": ["I ordered the Salmon BLT that came with a huge side of fries, both were hot and delicious. ", "They actually have a public bathroom here, which is hard to find in this city! ", "The bathroom was clean, lemony fresh, and the stalls were head to toe like their own little rooms. ", "Only complaint is the paper straws and the restaurant is very open so it may get cold at night. ", "Otherwise, I would definitely recommend this surfer-themed restaurant, I will for sure be coming back!"], "author": "Logan L.", "review": "I'm 100% satisfied with my visit here. The staff was quick to seat us, get our orders, and our food came in probably 10ish minutes. I ordered the Salmon BLT that came with a huge side of fries, both were hot and delicious. They actually have a public bathroom here, which is hard to find in this city! The bathroom was clean, lemony fresh, and the stalls were head to toe like their own little rooms. Only complaint is the paper straws and the restaurant is very open so it may get cold at night. Otherwise, I would definitely recommend this surfer-themed restaurant, I will for sure be coming back!", "rating": 5, "date": "2018-03-26"}, {"excerpts": ["My girlfriend ordered the Salmon BLT, which she proceeded to get sick from that evening. \n\n"], "author": "Ali A.", "review": "Worst restaurant I've even been to. Overpriced tourist trap with horrible service. After we were seated, we were abandoned for 15 minutes before we flagged a waitress down for some water. Which then took another 5 minutes to appear. She rattled off some line about there being \"confusion from a shift change\" but considering she never bothered to return to our table after we ordered I highly doubt that story. \n\nIt cost $9 for a Budweiser, and the burger, which I ordered as medium rare, could almost be called well-done. My girlfriend ordered the Salmon BLT, which she proceeded to get sick from that evening. \n\nAfter that wonderful food experience, we were ignored again until a completely different waiter came by who we begged to take our plates and give us our check. Honestly has to be the most all-around terrible restaurant experience I've had in my life. \n\nAlso, don't sit outside or you'll get harassed by the aggressive pigeons on the pier.", "rating": 1, "date": "2016-09-06"}, {"excerpts": ["I ordered the California Burger (guacamole, bacon, and jack cheese), my friends ordered clam chowder, the Hawaiian burger, salmon BLT, a regular burger, and fish and chips. \n\n"], "author": "Julie N.", "review": "Since Pier 39 is a huge tourist infested area, the wait for a table was about 30 minutes. That's totally understandable since it was a crowded day on the pier and we had a group of 10. \n\nEverybody ordered their food; we were all really excited to eat and extremely hungry. I ordered the California Burger (guacamole, bacon, and jack cheese), my friends ordered clam chowder, the Hawaiian burger, salmon BLT, a regular burger, and fish and chips. \n\nIt all went wrong when every single person at the table got their food, but me. I obviously was pretty angry because well, everybody finished most of their food and my food STILL wasn't out. My friend asked the workers if my food was coming out yet, but they just said they would \"check on it.\" After 5 minutes, my food still wasn't coming out while people who came in after me got their food first... ok?? My food was obviously forgotten and the workers were obviously ignoring our table. 5 minutes later, my food FINALLY came out after a 20 minute wait. Oh, and the waiter also forgot my friend's order of French fries, did he not write ANY of the orders down, or...????\n\nMy burger was mediocre, tasted like a burger. There was nothing special about it, even though the price for it was pretty expensive.\n\nWhen the check came out, the waiter said he took my burger off the check. I felt bad for being angry, so I gave him a nice tip. But there was a problem with the check, and he ended up charging my friend's credit card twice... Which pretty much made me angry again because I gave him a good tip for being a lousy waiter. I didn't expect amazing service, but I expected at least decent service.", "rating": 2, "date": "2015-08-04"}, {"excerpts": ["I ordered the Salmon BLT with garlic fries and it was delicious! ", "Thank you Gabby for the great service and great food!"], "author": "Katherine R.", "review": "I had lunch at Wipeout Bar and Grill and I had fantastic service! My waitress Gabby was very hospitable. She kindly came to my table and introduced herself and took my order. I ordered the Salmon BLT with garlic fries and it was delicious! Thank you Gabby for the great service and great food!", "rating": 5, "date": "2017-03-22"}, {"excerpts": ["For an entree, I ordered the Salmon BLT. ", "The salmon was cooked perfectly and the sandwich was pretty good! ", "Granted, this wasn't some 5 star seafood restaurant, but I was definitely impressed. ", "And, our server was a pretty awesome dude. ", "I can't think of his name, but he was very nice and made it a point to make conversation with us. ", "He asked us where we were from and kept purposely saying \"Illinois\" wrong. ", "It was pretty hilarious, you should've been there. ", "I would totally return."], "author": "Heather J.", "review": "Walked past this place and Pier 39 and knew I had to stop in to eat. I am a sucker for \"surf\" and \"beach\" themed eateries. Lucky for me, this one did not disappoint! Started off with a Mai Tai, which was just what I needed on my search for a tropical blended drink. For an entree, I ordered the Salmon BLT. The salmon was cooked perfectly and the sandwich was pretty good! Granted, this wasn't some 5 star seafood restaurant, but I was definitely impressed. And, our server was a pretty awesome dude. I can't think of his name, but he was very nice and made it a point to make conversation with us. He asked us where we were from and kept purposely saying \"Illinois\" wrong. It was pretty hilarious, you should've been there. I would totally return.", "rating": 4, "date": "2015-06-15"}, {"excerpts": ["I ate the Salmon BLT, which was about what I was expecting it to be. ", "It was good, the bacon was perfectly crisp, but it could have used a little more sauce. ", "I found it to be just a little bit dry. ", "I would still order it again. "], "author": "Meagan E.", "review": "Came here for lunch after taking my daughter to the aquarium right next door. It was PACKED, but they still got us sat in a pretty timely manner. Our waitress was very sweet, but a little slow--understandable considering how busy it was. I ate the Salmon BLT, which was about what I was expecting it to be. It was good, the bacon was perfectly crisp, but it could have used a little more sauce. I found it to be just a little bit dry. I would still order it again. The manager came by to check on us about halfway through our meal--nice to know that the supervisors are doing a good job of making sure things run smoothly. \n\nAlso: I noticed on my daughter's menu there was something about a discount on tickets for the aquarium. Good to know if you're looking for somewhere to eat BEFORE you go in there :)", "rating": 3, "date": "2014-04-22"}, {"excerpts": ["Coconut shrimp is yummy, salmon BLT was ehhh ok, chicken tenders for my son were good. ", "Adult beverages were good but my blueberry drink was super sweet which I'm not into very much ", "but I drank it. ", "View was awesome and they have tv's for those who want to watch sports or anything else. ", "We might try it again but try other places first."], "author": "Tony S.", "review": "Coconut shrimp is yummy, salmon BLT was ehhh ok, chicken tenders for my son were good. Adult beverages were good but my blueberry drink was super sweet which I'm not into very much but I drank it. View was awesome and they have tv's for those who want to watch sports or anything else. We might try it again but try other places first.", "rating": 3, "date": "2014-03-05"}, {"excerpts": ["I ordered the Salmon BLT with pesto mayo and it was absolutely delicious. ", "Great taste, fresh, the combination is Salmon and pesto mayo were great.  ", "We also ordered the fried cod fish sandwich, and it was good but not as good as the salmon.  ", "Prices are reasonable compared to other restaurants in the area. ", "Fun place to visit!"], "author": "Patty R.", "review": "I ordered the Salmon BLT with pesto mayo and it was absolutely delicious. Great taste, fresh, the combination is Salmon and pesto mayo were great.  We also ordered the fried cod fish sandwich, and it was good but not as good as the salmon.  Prices are reasonable compared to other restaurants in the area. Fun place to visit!", "rating": 3, "date": "2015-06-16"}, {"excerpts": ["I had the Salmon BLT and it was delicious!  ", "And my server Lex, was  delight, and even drew me a map on how to get to SOMA from there.\n", "I will definitely be back!"], "author": "Heather E.", "review": "Went to Wipeout to grab some lunch.  David the manager greeted me at the door and was very nice and welcoming.\nI had the Salmon BLT and it was delicious!  And my server Lex, was  delight, and even drew me a map on how to get to SOMA from there.\nI will definitely be back!", "rating": 5, "date": "2010-12-05"}, {"excerpts": ["had the salmon blt which is around 15 bones and comes with fries. ", "little on the pricey side ", "but so is every place around the pier. ", "service was pretty good, waitress was attentive and often came by to refill my drink like three times."], "author": "Ethyl M.", "review": "not bad of a place to go for lunch. had the salmon blt which is around 15 bones and comes with fries. little on the pricey side but so is every place around the pier. service was pretty good, waitress was attentive and often came by to refill my drink like three times.", "rating": 4, "date": "2015-04-09"}, {"excerpts": ["Salmon BLT and fish tacos were great! \n", "Loved how friendly and accommodating the staff were. ", "Everyone is really nice and it makes the whole experience very enjoyable."], "author": "Christina E.", "review": "Service was great!\n\nAt first, my friend and I decided to sit outside where we were immediately helped by a very friendly waitress. She got our drinks and appetizer very quickly. It got pretty cold so we asked to sit inside. I was nervous about asking because I didn't want to be a pain, but I didn't have anything to worry about. The waitress was understanding and immediately asked the hostess about indoor seating. She told us it would be a 10 minute wait, but then came back a few minutes later to let us know that our table was ready. \n\nWhen we got inside, the manager, Edwin, greeted us and gave suggestions for food & drinks to order. Once we decided, our new waiter (Herbert) got our order in. We didn't have to wait long for our food to come out. \nSalmon BLT and fish tacos were great! \nLoved how friendly and accommodating the staff were. Everyone is really nice and it makes the whole experience very enjoyable.", "rating": 5, "date": "2014-03-14"}, {"excerpts": ["I ordered the Salmon BLT, I love fish!  ", "The salmon was tender and the flavor was just right, but I really felt odd eating it with bread, lettuce, and tomatoes.  "], "author": "Nina Y.", "review": "I was hungry and Wipeout was the first restaurant I saw.  It didn't LOOK bad, so my friend and I decided to eat here.  We were seated in the sun outside and decided to move tables to a shadier area.  A server later asked us to move to a smaller table (we were seated at a table for four).  Having worked at a restaurant before I can understand why-- if there was a party of four waiting to be seated it would make sense to have them sit at our table so they wouldn't have to wait.  Good customer service for them, but kind of bad for us.  No biggie though. \n\nI ordered the Salmon BLT, I love fish!  The salmon was tender and the flavor was just right, but I really felt odd eating it with bread, lettuce, and tomatoes.  Yes, I know it's what I ordered but at the time I didn't think it would taste so weird all together.\n\nMy friend ordered the Teriyaki Chicken Sandwich, which was... average.  I had half of it and I can just say it was very forgettable.\n\nOverall this place was just whatevers.  Not good, not bad.  It filled me up--which was basically what I wanted, haha", "rating": 3, "date": "2010-07-18"}, {"excerpts": ["Decent menu, had a grilled salmon BLT and sweet potatoe fries.  ", "Pretty tasty.  ", "Reasonably priced.  "], "author": "M R.", "review": "Fast service and quick outside seating, even on a busy Sunday.  Decent menu, had a grilled salmon BLT and sweet potatoe fries.  Pretty tasty.  Reasonably priced.  Would probably come back again if I were in the area.\n\nFood: 3/5\nService: 3/5\nAmbiance: 3/5", "rating": 3, "date": "2012-05-13"}], "baja fish": [{"excerpts": ["We had wipeout nachos with chicken as an app, Baja fish tacos as my entree, and both my sister and fiancé had coconut shrimp. ", "The food really was delicious. ", "It was an extremely busy day / time ", "so I'm sure that's why everything came out fast."], "author": "Kimber B.", "review": "Dropped in here after a whale tour. We were quickly seated even though the place was packed! The waitress let us know that she was new and didn't have everything down yet which I thought was nice. We ordered an appetizer and the waitress, while she was very sweet, was kinda pressing us to order entrees at the same time. I told her I didn't want the app and entrees to come out at the same time and she said they wouldn't, so we ordered everything at once. Well.... everything came out at once and the table was extremely crowded- which isn't too big of a deal since all the food was great. We had wipeout nachos with chicken as an app, Baja fish tacos as my entree, and both my sister and fiancé had coconut shrimp. The food really was delicious. It was an extremely busy day / time so I'm sure that's why everything came out fast.", "rating": 4, "date": "2018-06-09"}, {"excerpts": ["I ordered chips and salsa as an appetizer, and Baja fish taco's for lunch. ", "Their menu has a wide selection (taco's, pizza, burgers, sandwiches, salads, burrito's, bowls, and pasta) so it took a minute to decide what I wanted. \n", "My food was \"just okay\". ", "I might be biased, since no one can compare to San Diego taco's, but I was hoping it would be better since we were at a Pier. "], "author": "Cat T.", "review": "Stopped here during our one-day trip to the bay. It's a tourist restaurant on the famous Pier, right along the walk way as you walk in/out from the street. \n\nService was great. We were seated outdoors, and our drink order was taken as soon as we sat down. I ordered a house margarita and my husband ordered a corona-rita. They tasted just as expected. \n\n**Fair warning - if you plan on eating outside, you'll be surrounded by brave, ruthless birds.**\n\nSince my husband wasn't too hungry, he didn't order anything. I ordered chips and salsa as an appetizer, and Baja fish taco's for lunch. Their menu has a wide selection (taco's, pizza, burgers, sandwiches, salads, burrito's, bowls, and pasta) so it took a minute to decide what I wanted. \nMy food was \"just okay\". I might be biased, since no one can compare to San Diego taco's, but I was hoping it would be better since we were at a Pier. The salsa for the chips was bland, but the chips were tasty.\n\nThe restrooms were gender neutral, and the sink was a long, metal sink, with multiple faucets (kind of Costco's bathrooms). I thought it was refreshing to see a mixed gender line, since most restroom rooms are mainly for the women's side.", "rating": 3, "date": "2017-11-27"}, {"excerpts": ["I got the buffalo chicken pizza and my boyfriend got the Baja fish tacos. ", "The pizza tasted like it's frozen and just popped in an oven. ", "And the fish tacos was pretty good, but the beans and rice that went with them not so good! ", "The rice had a weird taste and the black beans were sweet. ", "Service and drinks were good, but the food was not so good."], "author": "Jenni M.", "review": "Came to San Francisco as a tourist and we got\nHungry after walking pier 39 so we stopped here to get dinner. The service was nice and fast. We got margaritas and they were delicious, but the food was not so delicious. I got the buffalo chicken pizza and my boyfriend got the Baja fish tacos. The pizza tasted like it's frozen and just popped in an oven. And the fish tacos was pretty good, but the beans and rice that went with them not so good! The rice had a weird taste and the black beans were sweet. Service and drinks were good, but the food was not so good.", "rating": 3, "date": "2018-03-28"}, {"excerpts": ["My family had the Baja fish tacos where the fish was lacking in flavor. ", "Too much fried for our taste. ", "My mother had the fish sandwich with the same problem. ", "My brother had the fish burrito with the same problem. ", "We're Spanish and we like our food seasoned so the rice and beans that came along with all the meals was just bad. ", "The carne asada tacos were decent.\n", "Overall the food was not worth the price at all. ", "Even with understanding San Francisco's inflated prices."], "author": "Andre V.", "review": "The vibe and service was great\n\nThe food however was not. My family had the Baja fish tacos where the fish was lacking in flavor. Too much fried for our taste. My mother had the fish sandwich with the same problem. My brother had the fish burrito with the same problem. We're Spanish and we like our food seasoned so the rice and beans that came along with all the meals was just bad. The carne asada tacos were decent.\nOverall the food was not worth the price at all. Even with understanding San Francisco's inflated prices.", "rating": 2, "date": "2018-03-13"}, {"excerpts": ["I ordered the Baja Fish Tacos, my boyfriend ordered the Hot Wings with Fries, and our friends got the Chicken Teriyaki Sandwich w/ Pineapple and the BBQ Burger with Jalapeño ", "and we were all VERY pleased with our meals ! ", "I would definitely recommend this place to anyone who plans on visiting this area ! ", "(:"], "author": "Nyomi M.", "review": "Came here yesterday with my boyfriend and two of our friends and we were pretty pleased ! (: It was a Saturday at Pier 39 during lunch hour which is a very busy time, place, AND day ! We were told it would take 25 minutes to get seated and we were actually sat within about 15 minutes or so which was very nice. The customer service was very friendly and fast for being such a busy time and place ! (: The food was GREAT ! I ordered the Baja Fish Tacos, my boyfriend ordered the Hot Wings with Fries, and our friends got the Chicken Teriyaki Sandwich w/ Pineapple and the BBQ Burger with Jalapeño and we were all VERY pleased with our meals ! I would definitely recommend this place to anyone who plans on visiting this area ! (:", "rating": 5, "date": "2017-04-02"}, {"excerpts": ["Clam chowder and Baja fish tacos were great. ", "Definitely will be back the next time we are at Pier 39. ", "See what I did there... ", ":)"], "author": "Tim N.", "review": "Awesome service from Wilfredo. Clam chowder and Baja fish tacos were great. Definitely will be back the next time we are at Pier 39. See what I did there... :)", "rating": 4, "date": "2017-02-04"}, {"excerpts": ["Ordered two tacos, one fish (Crispy Baja Fish) and one chicken (Grilled Chicken) tacos. ", "The salsa sauce was really nice and a bit spicy. ", "I like the fried fish a lot "], "author": "Rainbow C.", "review": "Ordered two tacos, one fish (Crispy Baja Fish) and one chicken (Grilled Chicken) tacos. The salsa sauce was really nice and a bit spicy. I like the fried fish a lot and it went well with the sauce.\n\nThe chicken taco was nice and spicy. \n\nBoth tacos is nice. I like the fish tacos a bit more than the chicken taco.", "rating": 4, "date": "2014-08-23"}], "al pastor": [], "grilled fish": [{"excerpts": ["I got a grilled fish taco and a steak taco. ", "The grilled fish taco put me in heaven. ", "I'm not sure if I was just really hungry, but that was the best fish taco I've ever had, and that's comparing it to fish tacos in Ensenada. ", "The steak was also pretty good, but the fish taco outperformed it ", "so I didn't even care about the steak taco anymore. ", "The beans were good, too. ", "The rice, I wasn't too impressed with. ", "It was probably the corn, but it tasted kinda sweet, which I didn't really enjoy that much.\n", "I wish I had ordered a drink because they looked delicious. ", "They have these large drinks that are blended and are served sort of tiki style. ", "I believe you can also order a drink of your choice and they still serve it in the same type of glass. ", "I overhead a table next to mine ordering a Sex on the Beach and was served in that huge glass. "], "author": "Melissa S.", "review": "I'm pretty impressed by this place. I expected it to be this touristy overpriced low quality seafood.  I mean it definitely is touristy, but the food was pretty good. Yes, probably overpriced, but everything in SF is overpriced. \nIt seems like this place gets busy, but my boyfriend and I were seated almost right away. I don't think we waited more than 10 minutes. Their service was pretty fast. \n\nAnyway, I got the order of two tacos with rice and beans. I got a grilled fish taco and a steak taco. The grilled fish taco put me in heaven. I'm not sure if I was just really hungry, but that was the best fish taco I've ever had, and that's comparing it to fish tacos in Ensenada. The steak was also pretty good, but the fish taco outperformed it so I didn't even care about the steak taco anymore. The beans were good, too. The rice, I wasn't too impressed with. It was probably the corn, but it tasted kinda sweet, which I didn't really enjoy that much.\nI wish I had ordered a drink because they looked delicious. They have these large drinks that are blended and are served sort of tiki style. I believe you can also order a drink of your choice and they still serve it in the same type of glass. I overhead a table next to mine ordering a Sex on the Beach and was served in that huge glass. Not sure if they made that request, or that's just the way they do it there.\n\nI wish I had also tried the fish and chips, too. They looked really appetizing, but I could only eat so much. The reason I also didn't order a drink is because I had to make an hour drive back to my hotel. I was in SF just to visit Alcatraz.! I was exhausted from Alcatraz, and was glad to get quick service at this super packed touristy area.", "rating": 4, "date": "2017-08-25"}, {"excerpts": ["I had the grilled fish burrito on a plate. ", "It was delicious! ", "The sweet potato and garlic fries were to die for! ", "Our waitress was very accommodating!"], "author": "Sue A.", "review": "Great food and reasonable price! I had the grilled fish burrito on a plate. It was delicious! The sweet potato and garlic fries were to die for! Our waitress was very accommodating!", "rating": 5, "date": "2016-07-26"}, {"excerpts": ["I had the Grilled Fish Burrito and my boyfriend had the Wipeout Burger and Gnarly Fries. ", "The fries were too salty for my liking, but he seemed to enjoy them. ", "My burrito was really good ", "and it's huge! ", "I had to take it to go. \n", "The decor of the restaurant is cute. ", "I like the mural that is paitned on the walls. ", "We had an overall good experience. ", "We would come back"], "author": "Sharlena S.", "review": "Nice place for it to be a themed bar on the Pier. The staff was very welcoming and attentive. I had the Grilled Fish Burrito and my boyfriend had the Wipeout Burger and Gnarly Fries. The fries were too salty for my liking, but he seemed to enjoy them. My burrito was really good and it's huge! I had to take it to go. \nThe decor of the restaurant is cute. I like the mural that is paitned on the walls. We had an overall good experience. We would come back", "rating": 4, "date": "2013-03-13"}, {"excerpts": ["I chose one carnitas, one grilled fish. ", "They were both sooo delicious. "], "author": "Jen B.", "review": "We chose Wipeout for a large group, 20 in total, 50% girls age 11-12 and 50% moms. It was perfect! The menu was extensive and affordable. The vibe in the place was a lot of fun and our server was GREAT. I want to say his name was Michael but I did have a very large margarita so it's possible I have that wrong.\n\nWe started with chips and salsa and great margaritas for the moms. The drinks were large, delicious, and a good strong pour! I felt my drink before I was even half way through. The food was tasty. My kid ate all of her chicken and fries and I devoured my meal too. I opted for the two taco combo which offers you a choice of a few different types of tacos. I chose one carnitas, one grilled fish. They were both sooo delicious. They came with rice and beans and although I usually don't each much of that part of my meal, the beans were really good too.\n\nI was really pleasantly surprised and would definitely come back again!", "rating": 5, "date": "2010-05-12"}], "cheese quesadilla": [{"excerpts": ["We ordered the cheese quesadilla with fries and a salmon rice bowl. "], "author": "David S.", "review": "Mexico meets California meets a tourist trap. It was, somewhat to my surprise, a very good experience. We were greeted and seated quickly. The hostess was great, seating us right where we requested. Our waitress was timely and very friendly. Clean bathrooms and clean tables. \n\nBe warned, it is very touristy. We came here for an early lunch before the fleet week show. \n\nWe ordered the cheese quesadilla with fries and a salmon rice bowl. Both were yummy. \n\nMy favorite part was the beverages. We both had Coke Zeros with special flavoring a. Mine was cherry vanilla. Yes!", "rating": 4, "date": "2015-10-11"}], "hot dog": [{"excerpts": ["I got the chili cheese dog with French fries and jalapeños on top of my hot dog. ", "The coleslaw was flavorless and disgusting."], "author": "Aj C.", "review": "By far the slowest service in Pier 39!\n\nFirst of all, I went to the wrong area because I thought that's where they seat you. How beer, everyone that passed me ignored me for 10 minutes. When a couple waited behind me, a waitress escorted them to where they should wait... WTF?\n\nSecond of all, when we tried paying for the check, our waitress literally took more than 20 minutes to get to our table.\n\nThe food as mediocre too.\n\nI got the chili cheese dog with French fries and jalapeños on top of my hot dog. The coleslaw was flavorless and disgusting.", "rating": 1, "date": "2016-04-20"}, {"excerpts": ["Kids got a hot dog and chicken strips. ", "Hot dog was as cheap as it gets, chicken strips were over cooked and leathery. ", "I got chicken tacos and the husband got a hamburger. ", "My tacos were flavorless and my husbands hamburger was like gas station food. \n", "I would not recommend this place to traveling families."], "author": "Heidi B.", "review": "Sub par service and even worse food. We wanted to find a kid friendly place for picky eaters who were needing a break from pizza. Atmosphere was pretty much what you'd expect with a kitschy surf vibe. Menu was limited, pizza, Mexican, salads apps and bar food. \nWe got chips and salsa as an app and the chips were all broken crumbs, so much so that we thought it was a surprise when we found a single whole chip. The drinks took forever to arrive and we thought we may have been forgotten about. Our waitress spilt a beer on our 6 year old and while apologetic, all we received was a 20% off from the manager, who should have came by himself. Kids got a hot dog and chicken strips. Hot dog was as cheap as it gets, chicken strips were over cooked and leathery. I got chicken tacos and the husband got a hamburger. My tacos were flavorless and my husbands hamburger was like gas station food. \nI would not recommend this place to traveling families.", "rating": 1, "date": "2018-04-09"}, {"excerpts": ["The only thing decent was the Nathan's Hot dog . "], "author": "Gerald A.", "review": "Service was friendly and fast \n\nRestaurant was clean and tidy \n\nI had the Chili dog and it was disgusting ! The only thing decent was the Nathan's Hot dog . Didn't use chili but some version you find at a gas station and cheese was fake and gross\n\nMy kid had Mac and Cheese and it was largely disappointing , guys use Kraft or Annie's vs making your own crap\n\nThe Turkey club wife had was great- full of flavor and meat \n\nI would save your money and stay away", "rating": 3, "date": "2016-01-03"}, {"excerpts": ["I won't go back, i could get better food from the hot dog stand around the corner. ", "But to each their own."], "author": "Heather N.", "review": "Much like other locals, I went in with low expectations and to no surprise it was awful. We went in with 3 kids under the age of 5, and the hostess sat us at a high top.... Noo common sense seriously. \n\nThen we got sat at a 4 person booth. It took 15 minutes to be approached-- enough time to look over the menu and have all 3 children decide what they want plus us two adults. By the time we got a server she got our drinks, appetizers and food ordered. Appetizers came out before drinks did. Garlic Fries and Chips & Salsa. Bland but edible. I ordered a California burger, and the guacamole was seriously the most disgusting pre packaged guac i've ever had. I wiped all of it off 4 bites into the burger. My husband had the wipeout plate, fried shrimp and calamari which was soggy and undercooked. My daughter got chicken strips, burnt. And the kids mac n cheese didn't receive a complaint from my nieces. \n\nThe entire time we were there, our server checked on us 3 times. It took 20 minutes to even get our check done. I had to ask another server for a to go box (that my 3 year old insisted upon). My husband and I both worked in the service industry for many years, we know how to handle triple seating and campers-- it sucks but you deal with it the best you can! You're in a prime location, just because you know you're still going to have customers, doesn't mean you can't give better service to every guest. I won't go back, i could get better food from the hot dog stand around the corner. But to each their own.", "rating": 1, "date": "2014-07-01"}, {"excerpts": ["Boring hot dog, and a rare kids cheeseburger. ", "I enjoy rare/medium rare, but I'm an adult. ", "My young kid didn't like his very rare burger. ", "I didn't think I had to specify \"well done\" off the kids menu, wasn't even asked."], "author": "Abel L.", "review": "Good fish dishes, but pretty bad on the kids menu. Boring hot dog, and a rare kids cheeseburger. I enjoy rare/medium rare, but I'm an adult. My young kid didn't like his very rare burger. I didn't think I had to specify \"well done\" off the kids menu, wasn't even asked.", "rating": 3, "date": "2016-03-22"}, {"excerpts": ["My other niece had a hot dog and who knows if that was good or not because my niece doesn't say much but the hot dog was huge. ", "It looked more like a Polska kielbasa than your typical hot dog.\n", "The location was ideal and the prices were right on. ", "We went on a Saturday afternoon and were seated quickly. ", "Thanks Wipeout!"], "author": "Loretta J.", "review": "Food was great. Loved the atmosphere. Waitress very nice and the food came out super-quick. I had the clam chowder in a sourdough bowl which was good. My niece and sister-in-law had their BBQ sandwich. They both said it was the most delicious sandwich they've ever had. \nMy other niece had a hot dog and who knows if that was good or not because my niece doesn't say much but the hot dog was huge. It looked more like a Polska kielbasa than your typical hot dog.\nThe location was ideal and the prices were right on. We went on a Saturday afternoon and were seated quickly. Thanks Wipeout!", "rating": 4, "date": "2009-07-26"}], "chicken tenders": [{"excerpts": ["The chicken tenders they got were so hard and over-cooked, I'm pretty sure the sea life wouldn't dare touch them. ", "You could barely pull pieces of edible meat from each tender. "], "author": "Tanvier P.", "review": "Mmm, yeah ... this place was just okay. Fisherman's Wharf is super busy and filled with tourists. With so many places to choose from we decided to give this one a shot. The spot is fun and has the quintessential beach theme to it. Our server was very nice and attentive.\n\nThe food, however, was forgettable.\n\nI ordered the salmon BLT that looked appetizing. Too bad there was barely any mayo on it, making the salmon taste drier than it already did. (Points for adding a nice portion of lettuce, so I could get some green in.) My husband did say he enjoyed his fish tacos.\n\nThe biggest disappointment came with our kids' order. The chicken tenders they got were so hard and over-cooked, I'm pretty sure the sea life wouldn't dare touch them. You could barely pull pieces of edible meat from each tender. Needless to say, our kids ended up eating our food.\n\nLike others commenting, it took a while to get our food and for the waitress to come back with check. I will say the waitress (likely a grandmother) did an awesome job of splitting up our kids' single meal on two plates, and bringing out their food before ours.\n\nMaybe this place had an off day. We won't be returning to find out. I guess I should've looked at all the three star reviews before picking this place.", "rating": 3, "date": "2016-04-18"}, {"excerpts": ["We ordered:\nHamburger w/ cheese\nChicken tenders\nGrilled salmon and rice bowl\n", "The food was mediocre.  ", "The hamburger was ok. ", "The salmon was good. ", "The rice was mushy. ", "It was one of the first places we saw on pier 39 and if you haven't eaten since breakfast and now it's 7:00 p.m.", ", it'll do. ", "We got seated in about 15 minutes. ", "Once we got our food, it was difficult to get any service. ", "We had to walk up to the waiter to get the bill. ", "Lots of outdoor seating, of course, but make sure you're wearing a jacket in the evenings because it's really cold and there are no heat lamps. ", "If there is another restaurant that you are considering, try that one instead."], "author": "Judy H.", "review": "We ordered:\nHamburger w/ cheese\nChicken tenders\nGrilled salmon and rice bowl\nThe food was mediocre.  The hamburger was ok. The salmon was good. The rice was mushy. It was one of the first places we saw on pier 39 and if you haven't eaten since breakfast and now it's 7:00 p.m., it'll do. We got seated in about 15 minutes. Once we got our food, it was difficult to get any service. We had to walk up to the waiter to get the bill. Lots of outdoor seating, of course, but make sure you're wearing a jacket in the evenings because it's really cold and there are no heat lamps. If there is another restaurant that you are considering, try that one instead.", "rating": 2, "date": "2015-07-31"}, {"excerpts": ["I had the chicken tenders, and my sister had the carne asada tacos. ", "We loved our food. "], "author": "Ness G.", "review": "Wipeout has been awesome. The atmosphere is nice. The service was great. We had Josh, he was so awesome. Very informative and helping. My group came from LA on a visit and he gave us some tips on touring the city as well as their menu.\n\nThe food was delicious. I had the chicken tenders, and my sister had the carne asada tacos. We loved our food. The coronarita was a very tastey drink:) \n\nI recommend this place. It's close to all the cool shops too!", "rating": 4, "date": "2015-05-03"}, {"excerpts": ["The kids ordered chicken tenders and we had to ask 3 different people for ranch dipping sauce. ", "We first asked Alexa who has no personality and doesn't smile once. ", "Joyce was our first waitress. ", "Thanks to Jesus we received the ranch dipping sauce. ", "When we first say down and ordered we asked for 2 checks since we both had plastic only. ", "When the bill came it was in 2 checks. ", "We sent it back and requested for 2 bills.  ", "We noticed that there was a 18% gratuity added on to it.  ", "The manager came over and asked if everything is ok.  ", "We asked why there was tip already included it. ", "His response was that if there was more than 6 people tip is included. ", "Well that means if it is 7 or more tip is included. ", "We had 6 people. ", "Most places advertise that if have a group of XX or more then tip would be added on. ", "There was nothing indicating this.  ", "Don't get me wrong, I don't mind paying 18% tip, but the service would have to be great, not bad.  "], "author": "Teresa G.", "review": "Came here because the menu looked good and looked like it there was a variety for the 6 of us. I ordered the chorizo and chicken pizza. The meat on the pizza was dry and nasty. The kids ordered chicken tenders and we had to ask 3 different people for ranch dipping sauce. We first asked Alexa who has no personality and doesn't smile once. Joyce was our first waitress. Thanks to Jesus we received the ranch dipping sauce. When we first say down and ordered we asked for 2 checks since we both had plastic only. When the bill came it was in 2 checks. We sent it back and requested for 2 bills.  We noticed that there was a 18% gratuity added on to it.  The manager came over and asked if everything is ok.  We asked why there was tip already included it. His response was that if there was more than 6 people tip is included. Well that means if it is 7 or more tip is included. We had 6 people. Most places advertise that if have a group of XX or more then tip would be added on. There was nothing indicating this.  Don't get me wrong, I don't mind paying 18% tip, but the service would have to be great, not bad.  The manager was nice but Alexa makes it so we will never return there.\n\nP.s. inspect your water before you drink it.  My friends husband found a seed in it when he was done and no there was no lemon in the water.", "rating": 1, "date": "2012-03-19"}, {"excerpts": ["After checking out a few places, we decided to eat here (daughter HAD to have chicken tenders). \n", "The wait wasn't to bad for a Saturday at 2:00pm, maybe 20 minutes top. ", "My wife ordered the same as our \"princess\", which were 4 or 5 strips of REALLY juicy, crispy chicken. ", "They did say that the fries were so-so, and I don't think either one touched their coleslaw - too bad, I liked it just fine. "], "author": "David E.", "review": "Our little family of 4 decided to have a \"family fun day\" summer got away from us. So San Francisco here we come. We first went to the California Academy of Science (review to come), and worked up an appetite and decide to head down to Fisherman's Wharf, luckily we found parking across from Pier 39 and proceeded across the skywalk. After checking out a few places, we decided to eat here (daughter HAD to have chicken tenders). \nThe wait wasn't to bad for a Saturday at 2:00pm, maybe 20 minutes top. My wife ordered the same as our \"princess\", which were 4 or 5 strips of REALLY juicy, crispy chicken. They did say that the fries were so-so, and I don't think either one touched their coleslaw - too bad, I liked it just fine. Our son had the chili cheese dog which he devoured within a few minutes (as like any other 17 yr. old would). The only issue he had with eating outside here, was that the birds were freaking him out, LOL!. \nI had the Sesame Seared Tuna bowl, which at $17-18, I thought was a little expensive for lunch. Then our waitress, Gabby, brought it out and that question left me as soon as I tried the wasabi aioli topped, ginger smothered, ahi tuna. It was all resting on top of stir-fried veggies and coconut rice. This dish was GREAT!!! The freshly cut tuna was perfectly cooked to just above rare, and the crust wasn't overpowering. I'm not a veggie/rice person, but they were well seasoned and the rice was just right. If I could have (without embarrassing my family), I would have licked my plate clean :)\n\nKudos to the chefs, cooks, and wait staff, you ALL made our day by making us feel at home :)\n\nP.S. Don't forget to have your parking validated before you leave. It saved us almost $20.00!", "rating": 4, "date": "2015-07-26"}, {"excerpts": ["Coconut shrimp is yummy, salmon BLT was ehhh ok, chicken tenders for my son were good. ", "Adult beverages were good but my blueberry drink was super sweet which I'm not into very much ", "but I drank it. ", "View was awesome and they have tv's for those who want to watch sports or anything else. ", "We might try it again but try other places first."], "author": "Tony S.", "review": "Coconut shrimp is yummy, salmon BLT was ehhh ok, chicken tenders for my son were good. Adult beverages were good but my blueberry drink was super sweet which I'm not into very much but I drank it. View was awesome and they have tv's for those who want to watch sports or anything else. We might try it again but try other places first.", "rating": 3, "date": "2014-03-05"}, {"excerpts": ["DH had the tacos and our son the chicken tenders.  \n\n"], "author": "Michelle W.", "review": "Had another great lunch at Wipeout today!  We were seated right away and greeted by the server within minutes.  Drinks were served quickly.  \nI had the Ahi sandwich which was super good.  I don't think I'll ever try anything else.  DH had the tacos and our son the chicken tenders.  \n\nThe restroom confused me and others.  One little boy was doing the potty dance not knowing if he can come in since I was in there.  His dad told him it was okay that boys and girls share the restrooms here.", "rating": 4, "date": "2009-04-05"}], "cheese or pepperoni pizza": [], "grilled teriyaki salmon bowl with coconut rice and veggies": []}