{"won ton noodle soup": [{"excerpts": ["This is my go to place for won ton noodle soup and beef stew ", "hor fun. ", "It is the closest won tons i can get that is close to the Guangzhou or Hong Kong styles. ", "Noodles are freshly made and is just delicious. ", "Would be perfect if they comply to their business hours instead of closing when they should be open."], "author": "WeR5 L.", "review": "This is my go to place for won ton noodle soup and beef stew hor fun. It is the closest won tons i can get that is close to the Guangzhou or Hong Kong styles. Noodles are freshly made and is just delicious. Would be perfect if they comply to their business hours instead of closing when they should be open.", "rating": 5, "date": "2018-10-04"}, {"excerpts": ["We got the won ton noodle soup ($5.75) and fish ball noodle soup ($6.15). ", "You can substitute the egg noodles for the flat white rice noodles at no additional charge. ", "The won tons didn't taste that great to me. ", "We also ordered the spicy beef tripe ($5.25) and the pig ears ($5.25). ", "There's never a wait, so this is a good option for fast and cheap food."], "author": "Nicole M.", "review": "I used to come here all the time with my friends on Thursday nights for a quick cheap bite, but I see that they raised their prices :/ They're definitely still reasonable though. We got the won ton noodle soup ($5.75) and fish ball noodle soup ($6.15). You can substitute the egg noodles for the flat white rice noodles at no additional charge. The won tons didn't taste that great to me. We also ordered the spicy beef tripe ($5.25) and the pig ears ($5.25). There's never a wait, so this is a good option for fast and cheap food.", "rating": 3, "date": "2018-01-05"}, {"excerpts": ["My ngao nom (beef stew) won ton noodle soup was delicious! ", "Very tender beef and tendon and a generous portion. ", "The won tons were plump and tasty, there were 6 of them. ", "The noodles were cooked to perfect tenderness. ", "The soup was flavorful and not too salty.  ", "Perfect comfort food, only $7.95!"], "author": "Nellie J.", "review": "Exactly what you would expect from a good won ton place. My ngao nom (beef stew) won ton noodle soup was delicious! Very tender beef and tendon and a generous portion. The won tons were plump and tasty, there were 6 of them. The noodles were cooked to perfect tenderness. The soup was flavorful and not too salty.  Perfect comfort food, only $7.95!", "rating": 5, "date": "2018-08-27"}, {"excerpts": ["We sat down and ordered two soups which were somewhat reasonably priced, I got a won ton noodle soup and my fiance got a fish ball soup.\n"], "author": "Josh Giosue D.", "review": "We were out and about on a weekday, it was late and this place seemed to be one of the few places open in the neighborhood.\n\nWe sat down and ordered two soups which were somewhat reasonably priced, I got a won ton noodle soup and my fiance got a fish ball soup.\nMy won-ton soup was pretty good, nothing out of this world, my fiance enjoyed her fish ball soup as well.\n\nThe reason why I'm giving this place 4 stars is \n1. Its nice to have a place that closes late on weekdays in the neighborhood.\n2. The food was actually decent.", "rating": 4, "date": "2015-12-08"}, {"excerpts": ["Won Ton Noodle soup was Terrible\n\nVegetable wasn't taste right. \n\n"], "author": "Mack A.", "review": "I gave 2 stars for opening late \n\nBut seriously the food is bad. \n\nNot only no taste but it's bad quality \n\nWon Ton Noodle soup was Terrible\n\nVegetable wasn't taste right. \n\nService was good tho. \n\nFirst and also my last time here. \n\nHere are just too many good restaurants to try but unfortunately not this one!", "rating": 2, "date": "2016-12-27"}, {"excerpts": ["Won Ton Noodle Soup; and 3. ", "Duck Porridge.  ", "All three were GREAT!  ", "Daughter said, \"Next time, I'll probably skip the noodles and just get the Won Ton Soup.", "\"  LOVE finding a great Won Ton restaurant close by to home . . . ", "AND endorsed by JUDY K.!!!"], "author": "Victor T.", "review": "When my daughter and I saw that ELITE YELPER, JUDY K., came here and shared such a positive review for WON TON HOUSE, we knew we HAD TO try it!  Well, just as JUDY K. said, \"no-frills dining, just good food on the cheap\"!  Service was GREAT!  The waitress was very friendly and accommodating.  The food was SO YUMMY!!!  We ordered 1. Won Ton Soup; 2. Won Ton Noodle Soup; and 3. Duck Porridge.  All three were GREAT!  Daughter said, \"Next time, I'll probably skip the noodles and just get the Won Ton Soup.\"  LOVE finding a great Won Ton restaurant close by to home . . . AND endorsed by JUDY K.!!!", "rating": 4, "date": "2017-06-27"}, {"excerpts": ["Won Ton Noodle Soup (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#_o08CiG6XmYhflC8fhnn-w) ", "- The won tons are nice and plump and pretty decent.  ", "The noodles stay firm for the duration of your visit, and they don't get mushy.  ", "The broth is where the MSG is really noticeable.  ", "Don't finish the broth ", "Like the won ton noodle soup the MSG is in its broth.  "], "author": "Wilhelm Y.", "review": "MSG can kill or make some persons really, really sick, but some people are not the least bothered by consuming MSG.  Me?  I'm a bit in between.  While MSG can provide an irritating tingle in my mouth or on my tongue I've never become sick from consuming it.  Sometimes I enjoy living on the edge, and it's those times when I visit the Won Ton House on Noriega Street.\n\nDon't expect impeccable service here.  It's basically a sit where you want type of place and the waitress will wait until you are properly seated before bringing you a boiling cup of hot tea.  She'll take your order, bring you your food, occasionally glance at you to make sure you're not doing anything mischievous (taking photos of food is the exception) then she'll bring you your check.\n\nLiving on the edge isn't the reason I eat here though.  I eat here because the food is cheap and as much as I hate to admit it I do have some of those cheap-Chinesey genes in me.\n\nLet's take a look at what I've ordered on recent visits:\n\nWon Ton Noodle Soup (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#_o08CiG6XmYhflC8fhnn-w) - The won tons are nice and plump and pretty decent.  The noodles stay firm for the duration of your visit, and they don't get mushy.  The broth is where the MSG is really noticeable.  Don't finish the broth and I'm usually okay.\n\nPotstickers (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#0QLakvWbQuiqJmkBpM7jtg) - Sometimes five to an order and sometimes six!  Mixed with the coarsely ground pork is a bit of cabbage and sometimes a bit of ginger.  It's not bad and the MSG is minimal.\n\nStewed Beef Brisket Noodle Soup (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#kGkSDCM8wN7sEWGeDcTf3g) - The beef is usually tender and the tendons are properly chewy.  Like the won ton noodle soup the MSG is in its broth.  You'll know what to do.\n\nRoast Duck & BBQ Pork over Noodles (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#xa6sEzBFnVtxqz5a0NHwug) - You can have this over rice too, but I'm always going to be a noodles kind of guy.  As with mostly all Chinese BBQ the MSG is in the marinade.  They use the same sturdy noodles on this as they use in their noodle soups.  They pour some of the fatty liquid from the BBQ meats into the noodle to give it some extra oomph and extra MSG.\n\nMake sure you drink a lot of liquids after eating here just to wash away the MSG.  \n\nSo if MSG and low health scores don't bother you so much, and you want hot, cheap food relatively fast this place is A-OK!", "rating": 3, "date": "2014-04-30"}, {"excerpts": ["Won Ton Noodle soup for $5 cant go wrong with that. ", "Primarily you come here for the won tons. ", "The soup they use isnt just water with a sprinkle of flavor, it tastes pretty good. ", "The won tons are good sized. ", "They have several variations with roasted duck, different kind of dumplings  and other varieties of dishes. ", "There are plenty of rice options here also. "], "author": "T C.", "review": "Simple tasty reliable Won Ton Noodle soup for $5 cant go wrong with that. Primarily you come here for the won tons. The soup they use isnt just water with a sprinkle of flavor, it tastes pretty good. The won tons are good sized. They have several variations with roasted duck, different kind of dumplings  and other varieties of dishes. There are plenty of rice options here also. The food is good but not spectacular. \n\nThey get pretty busy during lunch and dinner time. I swear the 2 ladies working here have been there forever. Good service and the waits arent long. The place isnt fancy or a hole in the wall, just very simple and kept pretty clean.", "rating": 4, "date": "2014-03-27"}, {"excerpts": ["Gone are the days of him thinking that the won ton noodle soup at the local Ranch 99 was the best won ton in town.\n\n"], "author": "Mario O.", "review": "There are nights that nothing can beat a good bowl of won ton soup. I went to Won Ton Noodle house because their soup has always been made properly with the right amount of noodles and won tons. The soup by itself is excellent.\n\nI ordered the shrimp won tons and my friend ordered barbecue pork. It was my friends first time going here and he came away pleased and full. I insisted he try some of my shrimp won tons and after sampling one he remarked that he will be ordering that on our next visit.  Gone are the days of him thinking that the won ton noodle soup at the local Ranch 99 was the best won ton in town.\n\nI live in Daly City so it's not really that close but, in my opinion it's worth the drive. Parking can be difficult depending on the time of day or night you decide to go. For the most part if you're patient a spot will open up or at the very worst you will have to park a block away and walk to the restaurant. \n\nI would also suggest trying their fried pot stickers but, order them the minute you are seated because it does take a little while for them to be served.", "rating": 5, "date": "2014-12-17"}, {"excerpts": ["The portion of my braised beef stew won ton noodle soup was more than enough. ", "Unfortunately, it wasn't as flavorful as in past years  "], "author": "Debbie T.", "review": "I started coming here 30 years ago...and regularly, too.  Mostly for the won ton noodle dishes.  Jook (congee) to take out on sick days.\n\nNow, it's only place I know between the Richmond & Sunset that has a nice selection of jook.\n\nToday was the first day back in over 4 years.  Same menu, good prices.  The portion of my braised beef stew won ton noodle soup was more than enough. Unfortunately, it wasn't as flavorful as in past years  It wasn't bad, though.\n\nI'd still call it a neighborhood gem. After all they don't have any competition on either side of Golden Gate Park.  Girl's gotta go somewhere for jook & won ton in the same place.", "rating": 3, "date": "2014-02-20"}, {"excerpts": ["Since this is \"Won Ton House,\" I've only ordered won ton noodle soup, which happens to be my #1 comfort food. ", "It's a really simple dish, so the $4.75 price is fitting. ", "You get a heap of egg noodles, about five wontons with shrimp and pork inside, and broth. ", "No veggies, no meat - though maybe the other options on the menu include them... "], "author": "Steph S.", "review": "I'm a fan of Won Ton House and have been here twice so far, both as \"real food\" stops before going across the street to Golden Island for dessert. :)\n\nWon Ton House reminds me of the restaurants we visited in Hong Kong... No frills in the decor or the presentation of the food, but really good flavors and extremely well-priced.\n\nWhen you sit down, the auntie lady acting as both server and cook will bring over two mugs of tea. The tea, while brewed in one of those diner-style coffee carafes, is actually quite good - warming on a chilly night and not over-steeped. \n\nSince this is \"Won Ton House,\" I've only ordered won ton noodle soup, which happens to be my #1 comfort food. It's a really simple dish, so the $4.75 price is fitting. You get a heap of egg noodles, about five wontons with shrimp and pork inside, and broth. No veggies, no meat - though maybe the other options on the menu include them... I'll have to check next time.\n\nThe won tons are very good and are full of meat. Every won ton seemed to have at least one shrimp in it. The broth (chicken-based) is light, but flavorful and I didn't really detect any MSG. That is, I didn't feel super thirsty after finishing my bowl, but I'm not really a stickler for MSG to begin with. Most Chinese restaurants use it, so it's not a big deal to me.\n\nDuring our first visit, the bf's sister got a noodle dish topped with char siu bbq pork. There was an incredible amount of pork; I was actually thinking about getting this to-go. :p Our second visit, the bf got the spicy Szechuan noodle soup. The noodles looked good and the chunks of beef were lean. I wish they were a *little* more tender than they were, but I'm thinking that this dish might not be a specialty of theirs so personally, I wouldn't pick it. Bf said that the broth was good though.\n\nThe best part of our meals here has been the turnip cake or \"law back gow\". SO GOOD. It's pan-fried so each piece is crispy on the outside, but once you bite into it, it's incredibly soft and pillowy and so smooth. You must order this no matter what.\n\nDinner for two was about $8 before tip and we left (for dessert at Golden Island) full and happy.", "rating": 5, "date": "2014-08-18"}, {"excerpts": ["We ordered BBQ Pork Lo Mein and 2 won ton noodle soup.  ", "You can chose thin or thick noodles for your noodle soup.  ", "That's a plus for me because  a lot of places only offer thin noodle "], "author": "Wendy H.", "review": "We wanted to go to Bakery & Cafe for lunch but they were crowded and there's a wait.  If you have two small children you know that won't do.  Checked out the restaurants adjacent to Bakery & Cafe (Icehouse & Won Ton House).  Icehouse looks like they are empty.  There were people in Won Ton House so we went in (that and the under $5 meals lured us in).\n\nThere is no one to seat you.  You pretty much seat yourself but the waitress does notice you and comes by with your tea and water in a jiffy.  My tea came in a cracked cup.  I was definitely worried that it would implode and spill all over me when I touch it -- luckily it didn't.\n\nWe ordered BBQ Pork Lo Mein and 2 won ton noodle soup.  You can chose thin or thick noodles for your noodle soup.  That's a plus for me because  a lot of places only offer thin noodle and it feels like you are chewing on wire.\n\nFood came fast.  There were about 8 won tons in the noodle soup.  No veggies.  I guess you would have to order that separately.  Come on, even some lettuce would be good.\n\nWon ton is good.  You can see medium whole shrimp and some pork.  No mushrooms - fine with me.  Noodles are cooked just right.  They are not undercooked like so many places do it (that makes them wiry!).\n\n3 dishes = $15.  Wow!  That's cheap!  Portions are just right.  Cash only.\n\nYes it's a hole in a wall and service is typical \"I don't care\" Chinese style but hey, this isn't a 5-star restaurant and we aren't paying 5-star prices so fine with me!", "rating": 4, "date": "2011-08-06"}, {"excerpts": ["They have the best won ton noodle soup for years in the SF. ", "the won tons have meat and shrimp inside the wrapper. ", "the broth is good and not too salty. ", "price is definitely afforadable too. ", "street parking is hard to find and there is no parking lot."], "author": "Ray S.", "review": "They have the best won ton noodle soup for years in the SF. the won tons have meat and shrimp inside the wrapper. the broth is good and not too salty. price is definitely afforadable too. street parking is hard to find and there is no parking lot.", "rating": 5, "date": "2015-09-02"}, {"excerpts": ["The only place I go for jook and won ton noodle soup. ", "Food is always good and the price is on point!"], "author": "danny h.", "review": "The only place I go for jook and won ton noodle soup. Food is always good and the price is on point!", "rating": 5, "date": "2015-06-24"}, {"excerpts": ["I love Hong Kong style won ton noodle soup.  ", "This place makes a great won ton and dumpling noodle soup.  "], "author": "Frank M.", "review": "I love Hong Kong style won ton noodle soup.  This place makes a great won ton and dumpling noodle soup.  It tastes just like what you get in Hong Kong in a dive joint.\n\nThe side dishes, meats, veggies all suck.  Too much goo and not enough flavor. \n\nI would continue to eat here, except I decide to go to the counter and pay... that is when I witnessed the chef handling my food sneeze into his hand and fling the stuff out of his nose into the compost bin and then wipe on his apron.  That is it... no hand washing.\n\nI'm not eating here anymore...", "rating": 1, "date": "2012-03-12"}, {"excerpts": ["Won ton noodle soup is about $5.50 and they make it in about $5-10 minutes depending on how busy they are.."], "author": "Rob T.", "review": "This place is great, quick, and cheap. Won ton noodle soup is about $5.50 and they make it in about $5-10 minutes depending on how busy they are..", "rating": 5, "date": "2014-12-15"}, {"excerpts": ["This is my go-to place for won ton noodle soup. ", "My mother trained me well and this is the only thing I know how to order in Chinese to look like I'm legit. ", "It's not the best food, but it is comfort food. ", "Sometimes, you just want those thin egg noodles. ", "The won tons are loaded as well, as it is a struggle to cram the whole thing in my mouth. ", "And for some reason, i am always drawn to drink the soup.... ", "maybe it's full of MSG? "], "author": "Tiffany C.", "review": "True rating would be 3.5 but I rounded up. \n\nThis is my go-to place for won ton noodle soup. My mother trained me well and this is the only thing I know how to order in Chinese to look like I'm legit. It's not the best food, but it is comfort food. Sometimes, you just want those thin egg noodles. The won tons are loaded as well, as it is a struggle to cram the whole thing in my mouth. And for some reason, i am always drawn to drink the soup.... maybe it's full of MSG? Also, they bring your order out fast!\n\nOverall, a cheap deal for some comfort food. Try it!", "rating": 4, "date": "2012-02-26"}, {"excerpts": ["I only order the won ton noodle soup and turnup cake ! ", "Their to go service is quick ! ", "I never actually sat down and ate there ", "but I def recommend if you want a quick bite then here is your place to go ", "and it is affordable :)"], "author": "Tiffany K.", "review": "Usually come to this place after work and then head to boom with the bf . I only order the won ton noodle soup and turnup cake ! Their to go service is quick ! I never actually sat down and ate there but I def recommend if you want a quick bite then here is your place to go and it is affordable :)", "rating": 3, "date": "2012-01-28"}, {"excerpts": ["I got the won ton noodle soup accompanied with pot stickers. ", "The soup base was lacking in flavor and  substance. ", "The won tons and the pot stickers saved the day with the help of some rice. ", "Filling but lacking in any great flavors. ", "How can this be when you're place ", "is called Won-Ton-House!?! "], "author": "Gary T.", "review": "Came here with a coworker to fill our gullets with won tons and noodles!\n\nService was fast and no frills. I got the won ton noodle soup accompanied with pot stickers. The soup base was lacking in flavor and  substance. The won tons and the pot stickers saved the day with the help of some rice. Filling but lacking in any great flavors. How can this be when you're place is called Won-Ton-House!?! A let down to say the least.\n\nIf I had to I'd probably come back but would definitely order something else.", "rating": 2, "date": "2009-04-10"}, {"excerpts": ["My feelings and I ordered the Szechuan spicy beef over noodles, Won Ton noodle soup, "], "author": "Melissa C.", "review": "This place was ok. My feelings and I ordered the Szechuan spicy beef over noodles, Won Ton noodle soup, Won Ton soup, shrimp dumpling noodle soup and pot stickers. The soups were average, the angels would appear to be Angel hair pasta and it wasn't even cooked al dente. The broth was ok but it was on the salty side. The pot stickers were ok but never again shall I order the beef. It was disgusting!! The beef was rubbery, the noodles were undercooked and the sauce want spicy and it was extremely bland. Service was despicable, they totally forgot we were there.", "rating": 2, "date": "2014-08-16"}, {"excerpts": ["The Won Ton Noodle Soup is only slightly better than what you would find in an instant bowl, but with a serving size that is probably two instant bowls, fresher dumplings, and a price tag under $4, it is still a bargain.  ", "The Curry Potstickers are appropriately greasy and complementary to the Won Ton Noodle Soup.  "], "author": "Andrew M.", "review": "Won Ton House is a cheap and filling option for cold, blistery nights (which is every night in San Francisco).\n\nThe Won Ton Noodle Soup is only slightly better than what you would find in an instant bowl, but with a serving size that is probably two instant bowls, fresher dumplings, and a price tag under $4, it is still a bargain.  The bowl is probably not satisfactory by itself for dinner, but would hit the spot as a late night snack.\n\nThe Curry Potstickers are appropriately greasy and complementary to the Won Ton Noodle Soup.  The strong curry flavor, slightly crispy skin, and hot sauce available for drenching make the potstickers a dangerous addiction.\n\nVisit Won Ton House for a satisfactory, hot meal on a budget!", "rating": 3, "date": "2011-12-30"}, {"excerpts": ["For a bowl of won ton noodle soup at $3.95, they're practically giving it away!"], "author": "Eric L.", "review": "This is chinaman's comfort food and being a chinaman, it's also my hangover cure if the wallet is looking a little thin. I have fond memories of coming here with my parents when I was in elementary school and ordering a Chinese tamale and a hung dao bing (red bean drink). \n\nThroughout the years I've lost my sweet tooth and ditched the hung dao bing for their scalding hot tea. For the n00bs out there to Won Ton House, here's a tip: let the tea cool before taking that first sip no matter how thirsty you may be. \n\nI can really say I've tried everything on the menu and everything is great. For a bowl of won ton noodle soup at $3.95, they're practically giving it away!", "rating": 4, "date": "2011-01-27"}, {"excerpts": ["Shrimp won ton noodle soup for $4.15? ", "Complementary tea? ", "Quiet, with no hustle and bustle? "], "author": "Diane G.", "review": "Shrimp won ton noodle soup for $4.15? Complementary tea? Quiet, with no hustle and bustle? Win, win, win! \n\nThis ain't no fancy meal, but when you and your friend are sick, broke, and hungry, this place fits the bill perfectly!", "rating": 4, "date": "2011-01-28"}, {"excerpts": ["That said, $3 for a bowl of won ton noodle soup is not going to be very spectacular...", "and it wasn't ", "but it was still $3 ", "so you can walk out the door without feeling you got jipped. ", "I only tried the won ton noodle soup ", "but I don't think I would get it again. ", "Or if I did, I would skip the noodles and just get the soup. ", "Noodles were kind of hard to chew. ", "I peeked at other tables and the other menu items ", "didn't look that amazing either. "], "author": "Yee-Shing W.", "review": "You're getting what you pay for. That said, $3 for a bowl of won ton noodle soup is not going to be very spectacular...and it wasn't but it was still $3 so you can walk out the door without feeling you got jipped. You shouldn't anyway.\n\nI only tried the won ton noodle soup but I don't think I would get it again. Or if I did, I would skip the noodles and just get the soup. Noodles were kind of hard to chew. I peeked at other tables and the other menu items didn't look that amazing either. Nonetheless, if you're looking to eat on the cheap, this is your spot.\n\nWon Ton House is as ghetto as they come. Service is quick but don't expect it to come with a smile ;)", "rating": 3, "date": "2011-04-25"}, {"excerpts": ["$3.95 for a bowl of won ton noodle soup?!!  "], "author": "Mashi M.", "review": "Good cheap eats! $3.95 for a bowl of won ton noodle soup?!!  The price may lead you to believe that the food may be sub par, but not so! \n\nThe won tons are the most flavorful I have had for won ton soup and they even give you TWO, count em, TWO pieces of green veggie. hahaha. For the veggie fix, we ordered the Chinese broccoli in oyster sauce which was also tasty and well priced. \n\nGreat place for a quick and belly warming meal.", "rating": 4, "date": "2008-02-20"}, {"excerpts": ["(Won Ton noodle soup) and you can't miss.  ", "Their other fairs are ...meh... really just there for variety only.   "], "author": "Ed F.", "review": "Stick to their name sake (Won Ton noodle soup) and you can't miss.  Their other fairs are ...meh... really just there for variety only.   Knock off one star if you're there for anything other then Won Tons.\n\nPlan to get here off peak (typical feeding time) if you drive and hope to get a parking space nearby.  But what's a few blocks between car and cheap good feed...", "rating": 4, "date": "2010-01-31"}, {"excerpts": ["Somebody in my party ordered the #1 - the Won Ton Noodle soup.  ", "Both of the prices were the same: $3.95.  ", "The difference ewas that hers came with noodles, cabbage, and about 4 wontons, while mine came with cabbage and about 8 wontons made of shrimp/pork.  ", "I don't know if she had shrimp in hers as well.  "], "author": "Leslie Y.", "review": "Very cheap food for decent quality!  Majority of all the menu's items are about 5 dollars more or less.  Open conveniently late for night diners/snackers!\n\nTonight, on my first visit here, I ordered #2 - the Won Ton soup.  Somebody in my party ordered the #1 - the Won Ton Noodle soup.  Both of the prices were the same: $3.95.  The difference ewas that hers came with noodles, cabbage, and about 4 wontons, while mine came with cabbage and about 8 wontons made of shrimp/pork.  I don't know if she had shrimp in hers as well.  Anyways, it was a darn good deal!  \n\nI'm usually not too big on chinese food either, mind you.  Honestly,  tonight I wanted to go for the Roast Duck over Rice but I was skeptical as to whether they would give me slabs of fatty duck; it being on the cheap end of prices, usually resulting in poor quality.  However, upon reviewing my fellow diner's Roast Duck Noodle Soup, the duck pieces were not half bad!  They were decent slabs of meat!  I'll be sure to give that one a try next time. \n\nService is acceptable.  There seemed to be only one waitress or so working the floor - but that was enough.  The food came QUICK - within 5-8 minutes of ordering.  She came by and refilled our tea cups as needed.", "rating": 4, "date": "2009-02-25"}, {"excerpts": ["For about $4 you can get the best won ton noodle soup between 10pm to midnight. ", "What else do you want as an Asian."], "author": "Solomon C.", "review": "For about $4 you can get the best won ton noodle soup between 10pm to midnight. What else do you want as an Asian.", "rating": 4, "date": "2012-11-30"}, {"excerpts": ["We always get the same things:  won ton noodle soup for me, roasted duck noodle soup for husband, noodle soup (2) for girls, rolled ho fun with plum sauce (housemade white soft noodles in the sauce with a light amount of white sesame seeds) for all, turnip cake (2 orders - we're all obsessed) and gai lan (Chinese brocolli in light soy/garlic sauce).  ", "If it's the weekend, we sometimes skip the ho fun and go with the fried dough, which is greasy hot deliciousness especially when dipped in the hot soups.  ", "You can dip the turnip cake in the soup, too, or it might accidentally fall into the soup if your chopstick skills are similar to mine-- then you can fish it out.  ", "Red bean drink is delicious.  "], "author": "Erin M.", "review": "This place is downright cheap, not just inexpensive.  We always get the same things:  won ton noodle soup for me, roasted duck noodle soup for husband, noodle soup (2) for girls, rolled ho fun with plum sauce (housemade white soft noodles in the sauce with a light amount of white sesame seeds) for all, turnip cake (2 orders - we're all obsessed) and gai lan (Chinese brocolli in light soy/garlic sauce).  If it's the weekend, we sometimes skip the ho fun and go with the fried dough, which is greasy hot deliciousness especially when dipped in the hot soups.  You can dip the turnip cake in the soup, too, or it might accidentally fall into the soup if your chopstick skills are similar to mine-- then you can fish it out.  Red bean drink is delicious.  Hot tea is dangerously hot; I have an s-shaped burn scar on my arm from when I knocked the hot tea onto my arm in the late 90s, so I am much more cautious with those cups.  \n\nService is hilariously indifferent but at the same time they always take our orders immediately, bring the food out promptly, and provide our bill with no comment.  Our meals, paid for with cash, usually cost around $25 and we get so much food it is always impressive.  We're all quite sensitive to MSG and have never noticed its effects post-meal, so we aren't sure it's used in the foods we eat, but the food provides a high that may mask minor sins.  Did I mention the turnip cake?  It is consistently the best one I've ever had, even from high end dim sum restaurants in SF like Yank Sing and lower end dim sum joints in Oakland's Chinatown.  We usually order extra and bring it home to the family.", "rating": 4, "date": "2012-01-07"}, {"excerpts": ["Its only 3.95 for won ton noodle soup! "], "author": "Warren G.", "review": "This place is very affordable and convenient to go to.  I come here when i crave won tons.  Its only 3.95 for won ton noodle soup! and theres like 6 wontons.. i believe. \n\nWhen hungry, we order the cheap sides like 'Lo bok go' and pig ears which is our favorite.  All soaked in red vinegar.  \n\nThe tea is super hot !!  But this is good because i hate cold to warm-cold tea.  Must be HOT or warm-hot.  \n\nI tried the rice plates with roast pork and duck but i don't suggest it because you should usually get those things at the place where they hang em up front since thats how you know its fresh and fat!\n\nToo bad they close at 11 and sometimes 12 because i'd like to come here at 2am for snacks.  4 stars!!\n\no yeah, they dont accept credit/debit card, so have cash", "rating": 4, "date": "2007-11-30"}, {"excerpts": ["I usually order the won ton noodle soup or the sampan porridge. "], "author": "Calvin P.", "review": "I usually order the won ton noodle soup or the sampan porridge. Very simple but very satisfying. \n\nBut the tastiest item on the menu are the curry pot stickers. I'd be fine if they decided to change the place's name to Curry Pot Sticker House.  I was bummed out one time when they told us the person who makes them was on vacation and they did not have curry pot stickers that night. \n\nGreat little place in the Sunset for a quick meal. Almost never a wait and it's a better deal than any of the nearby pho places.", "rating": 5, "date": "2011-08-01"}, {"excerpts": ["my boyfriend had the shrimp dumpling noodle soup and i had the won ton noodle soup. ", "they tasted the same to me... both were a shrimp-pork combination. ", "the broth was just okay... ", "nothing spectacular. ", "the gailan was awesome but i'd pass on the pot stickers. since we ordered so much food, it was $22 after tax and tip for two noodle soups, pot stickers, gailan, and a soda."], "author": "Kimberly S.", "review": "the place is decently good and cheap and the service is quick. my boyfriend had the shrimp dumpling noodle soup and i had the won ton noodle soup. they tasted the same to me... both were a shrimp-pork combination. the broth was just okay... nothing spectacular. the gailan was awesome but i'd pass on the pot stickers. since we ordered so much food, it was $22 after tax and tip for two noodle soups, pot stickers, gailan, and a soda.", "rating": 3, "date": "2010-02-01"}, {"excerpts": ["I love the won ton noodle soup here. ", "Quick, delicious and cheap. ", "Parking can be a pain some times since it's on Noriega, but it's manageable."], "author": "Rick L.", "review": "Good food, cheap prices. \n\nI love the won ton noodle soup here. Quick, delicious and cheap. Parking can be a pain some times since it's on Noriega, but it's manageable.", "rating": 4, "date": "2006-12-06"}, {"excerpts": ["If you want better won ton noodle soup with duck, then Win's on Taraval is the better place for this."], "author": "Ry T.", "review": "Not too many places where you can get inexpensive Chinese comfort food late at night. CASH ONLY, that's why.  They're opened until midnite daily except on Sundays.  We had just returned from Florida (can't find good Chinese food in Orlando) and wanted Chinese food but everywhere we called were closed except here.  5 orders ran us $25. Their congee is watered down but passable.  The won ton noodles are good and the beef stew noodles are very good with ample chunks of beef.  The curry beef tendon over rice was fair, if you just like to chew on tendon and not really eat anything.  There are ample tables around.  Not the best Chinese food to be had but not the worse either.\nOn a 2nd day, I stopped for take-out. The stewed beef brisket noodle soup was too salty and the beef pieces were dry and tough.  The Szechuan spicy beef over rice was flavorful and not too spicy with cooked pieces of lettuce, a lot of rice but \"where's the beef?\"   The won ton soup was fair.  You get about 5 pieces of chunky won ton.  I do like their won ton noodles which are thin and chewy.  The roast duck won ton was same as above, just a rare few pieces of duck.  If you want better won ton noodle soup with duck, then Win's on Taraval is the better place for this.", "rating": 3, "date": "2008-08-15"}, {"excerpts": ["Expect to spend less than $6 (includes tip) when you come here for a bowl of won ton noodle soup (there are usually five won tons in the bowl). ", "Other dishes are also pleasantly tasty and inexpensive."], "author": "Teresa Y.", "review": "I do love cheap good eats! Expect to spend less than $6 (includes tip) when you come here for a bowl of won ton noodle soup (there are usually five won tons in the bowl). Other dishes are also pleasantly tasty and inexpensive.", "rating": 4, "date": "2008-03-09"}, {"excerpts": ["I typically order the fish congee (jook), won ton noodle soup, or the ginger chicken rice plate with a side of chinese broccoli.  ", "Open late and parking is sometimes difficult on weekend evenings."], "author": "Mike J.", "review": "Traditional hong kong style noodle house with fast service, fresh food, and reasonable prices.  I typically order the fish congee (jook), won ton noodle soup, or the ginger chicken rice plate with a side of chinese broccoli.  Open late and parking is sometimes difficult on weekend evenings.", "rating": 4, "date": "2008-03-15"}, {"excerpts": ["I don't eat their won ton noodle soup but my bf  ", "and I come here for their jook with pork and the 1000-year old egg. ", "Quick service and very affordable."], "author": "kristin e.", "review": "I don't eat their won ton noodle soup but my bf  and I come here for their jook with pork and the 1000-year old egg. Quick service and very affordable.", "rating": 4, "date": "2005-10-31"}, {"excerpts": ["The won ton noodle soup is super and almost like the one that my Chinese grandma used to make for me."], "author": "Jacquee P.", "review": "I used to come here years ago and recently came back whilst waiting for my car to get an oil change. While I will never ever get an oil change from that place ever again, I will come back to this old favorite. The won ton noodle soup is super and almost like the one that my Chinese grandma used to make for me.", "rating": 5, "date": "2007-01-29"}, {"excerpts": ["my favorite place to get a good bowl of won ton noodle soup. ", "the price is good and the food is always good! ", "lo-mein is good too. ", "put a little bit of their sauce from the table (the one in the little bowl w/ the spoon.) ", "this is good anytime! ", "and their service is quick and friendly"], "author": "Janelle H.", "review": "my favorite place to get a good bowl of won ton noodle soup. the price is good and the food is always good! lo-mein is good too. put a little bit of their sauce from the table (the one in the little bowl w/ the spoon.) this is good anytime! and their service is quick and friendly", "rating": 5, "date": "2006-03-27"}, {"excerpts": ["Won ton noodle soup was OK. ", "Lots of noodles and about 6-8 won tons (didn't really count) in bland broth. ", "The shrimp in the won ton is not as fresh as it once was (think they use frozen now) and they left the intestines in the shrimp, which I unfortunately had a few crunches of its sandy debris.  ", "However, their preserved egg and pork jook was very good - quite smooth and tasty with lots of eggs and pork and it goes great with Chinese fried donut  ", "(yau jap gwei.) "], "author": "Nancy M.", "review": "The last time I came here was 15 years ago. I decided to come to this place after meeting with friends for old time sake. Won ton noodle soup was OK. Lots of noodles and about 6-8 won tons (didn't really count) in bland broth. The shrimp in the won ton is not as fresh as it once was (think they use frozen now) and they left the intestines in the shrimp, which I unfortunately had a few crunches of its sandy debris.  However, their preserved egg and pork jook was very good - quite smooth and tasty with lots of eggs and pork and it goes great with Chinese fried donut  (yau jap gwei.) Chinese tamale (joan) was mediocre - Joy Luck in Cupertino has better joan with better flavor ingredients such as the chinese sausage and duck egg.  Overall, this place isn't what it used to be 15 years ago. Sadly, the quality of their wontons and dumplings have gone downhill. I guess you get what you pay for and their food is cheap. I will just get the jook next time.", "rating": 2, "date": "2007-11-17"}], "shrimp dumpling noodle soup": [{"excerpts": ["Was able to try the dumplings, the won-ton noodle soup, shrimp dumpling noodle soup, and fish porridge. ", "Everything was A-OK, not spectacular but not bad. "], "author": "Daniel C.", "review": "This place reminds me of the Chinese equivalent of an American Diner. There's lots of regulars who show up to eat alone while reading the paper, the decor is basic, and the food is cheap and comforting. Was able to try the dumplings, the won-ton noodle soup, shrimp dumpling noodle soup, and fish porridge. Everything was A-OK, not spectacular but not bad. Not sure what the difference between Wontons and Shrimp Dumplings were but the Shrimp Dumpling is definitely better tasting (Seemed like they both had the same type of filling)\n\nPrice was very cheap and the food reminds me of childhood. I could probably lounge around here for a few hours.", "rating": 4, "date": "2016-02-22"}, {"excerpts": ["The shrimp dumpling noodle soup was good too - but next time i'd pass on the noodles and just get the shrimp dumpling soup!"], "author": "Michelle L.", "review": "Great place for late night greasy chinese food goodness.\nCame here after Outsidelands (we were starving) around 11:00 PM and were seated quickly.\n\nThe duck congee was delicious - perfect balance between creamy rice and savory duck.\nThe shrimp dumpling noodle soup was good too - but next time i'd pass on the noodles and just get the shrimp dumpling soup!", "rating": 3, "date": "2015-08-10"}, {"excerpts": ["Well, I went here months back with a friend for a small bite to eat and got the shrimp dumpling noodle soup.  ", "Maybe I should have just stuck with some wonton mein, but it was not good at all.  ", "The meat tasted odd like it was old and it was more meat than shrimp.  ", "Noodles were cooked fine, and broth was standard by wonton house standards.  ", "Prices were cheap too.  ", "The waitress was really nice, but dang those dumplings be gross!  "], "author": "Cat C.", "review": "Some things just taste better when you're a kid: lunchables, Benihana's, dried macaraoni, you get my drift.  My dad used to take me here all the time when I was a little girl.  I think I used to get either the wonton mein or the bbq meats noodle plates.  Well, I went here months back with a friend for a small bite to eat and got the shrimp dumpling noodle soup.  Maybe I should have just stuck with some wonton mein, but it was not good at all.  The meat tasted odd like it was old and it was more meat than shrimp.  Noodles were cooked fine, and broth was standard by wonton house standards.  Prices were cheap too.  The waitress was really nice, but dang those dumplings be gross!  Maybe I ordered the wrong thing?   \n\nI think I'd rather just wait for a trip down to San Bruno to get some good noodle soup at Fat Wong's.", "rating": 2, "date": "2015-01-06"}, {"excerpts": ["Shrimp Dumpling Noodle Soup really hit the spot."], "author": "Bruce W.", "review": "Good, Cheap and Open Late. Shrimp Dumpling Noodle Soup really hit the spot.", "rating": 4, "date": "2015-08-21"}, {"excerpts": ["We ordered shrimp dumpling noodle soup and the braised beef over rice last night. ", "The soup was okay. ", "The beef had more inedible parts (ligaments, tough tendons) than what can be humanly digestible. ", "To top it off, the chili sauce had an insect in it! ", "That was the most unacceptable thing of all! ", "It's been more than 12 hrs since that meal ", "and I'm still feeling queasy. ", "Awful awful awful!"], "author": "Kathryn H.", "review": "Awful first time experience. We ordered shrimp dumpling noodle soup and the braised beef over rice last night. The soup was okay. The beef had more inedible parts (ligaments, tough tendons) than what can be humanly digestible. To top it off, the chili sauce had an insect in it! That was the most unacceptable thing of all! It's been more than 12 hrs since that meal and I'm still feeling queasy. Awful awful awful!", "rating": 1, "date": "2014-10-26"}, {"excerpts": ["we would always order the same 2 items...shrimp dumpling noodle soup and beef brisket over rice.  "], "author": "Jen W.", "review": "i've been coming to the good ole wonton house since i was in elementary school.\n\nmy dad used to take me here late night after a fun filled evening of bowling.  we would always order the same 2 items...shrimp dumpling noodle soup and beef brisket over rice.  they also have other items such as jook and items over noodles...but i have pretty much stuck to my family tradition with the 2 items.\n\nthe dumplings and wontons are homemade...and after you order, your food comes out within 5 minutes.  the prices are uber cheap!  i don't think any dish is more then $6.  3 of us ordered 4 dishes and the check came out to $20...can't beat that!\n\ni've never been disappointed...the food has been the same for the past how many years...the same lady waitress still works there.  haha.  now that i think of it...i remember the same mugs being used when i was a kid!\n\nif you're looking for something to warm you up when the weather is cold or if you have a cold, won ton house is the place to be...it won't empty out your pockets...and you'll leave super full.  woot woot!  oh and they don't take credit cards...bofa is down the block.", "rating": 4, "date": "2012-02-04"}, {"excerpts": ["My friend and I shared Shrimp Dumpling Noodle Soup, Turnip Cake, and BBQ Pork & Roasted Duck over noodles. ", "The Shrimp Dumpling was okay. ", "The soup was super bland for my taste ", "so I added loads of chili sauce in order to enhance the taste. ", "The turnip cake; however, was amazing! ", "It was definitely my favorite ", "and I'm super glad it was that cheap. ", "The BBQ Pork & Roasted Duck was pretty flavorful as well even though I wish they could have added some sort of vegetables to it. ", "I'm not tripping though since it was pretty cheap and the portion was just right. ", "The order came out to be $14 something which means my friend and I paid around $7 each. ", "NOT bad since we were both satisfied AND full. ", "4 star? "], "author": "Anna L.", "review": "I went here for dinner two days ago. I was starving after class around 9pm and wanted something cheap for dinner. \n\nI didn't even notice this place until my friend showed me the day before because it was super small. I could say it's one of those hole in the wall for me. One of the positives about this place is they open till 12am, not that late but still pretty good. \n\nMy friend and I shared Shrimp Dumpling Noodle Soup, Turnip Cake, and BBQ Pork & Roasted Duck over noodles. The Shrimp Dumpling was okay. The soup was super bland for my taste so I added loads of chili sauce in order to enhance the taste. The turnip cake; however, was amazing! It was definitely my favorite and I'm super glad it was that cheap. The BBQ Pork & Roasted Duck was pretty flavorful as well even though I wish they could have added some sort of vegetables to it. I'm not tripping though since it was pretty cheap and the portion was just right. The order came out to be $14 something which means my friend and I paid around $7 each. NOT bad since we were both satisfied AND full. 4 star? Yeah, why not. \n\nAs for service, I give it a 3. I think they are a lot better than other typical Asian restaurants I've been to. Nevertheless, my tea cup was not fully washed when it came out, so there goes a star for service. And since my water and tea didn't get refill so down another star. \n\nOverall, the waitress was nice to us and I was content with my meal so the service star didn't effect that much about my opinion of this place. I would definitely come back again no doubt!", "rating": 4, "date": "2012-07-21"}, {"excerpts": ["I always get the shrimp dumpling noodle soup with the bbq pork added. "], "author": "Krissel A.", "review": "Oh Won Ton House.\n\nI am a fan indeed. I come here every so often with my friends, but when it's summer time... goodness we're here a lot. It brings back so many memories. I always crave this place randomly and it always, always, always hits the spot. Yay for instant gratification! \n\nBut the food is good and cheap. I always get the shrimp dumpling noodle soup with the bbq pork added. I will never stray from that either. \n\nI LOVE THIS PLACE! :D", "rating": 4, "date": "2011-12-21"}, {"excerpts": ["Won Ton soup, shrimp dumpling noodle soup and pot stickers. ", "The soups were average, the angels would appear to be Angel hair pasta and it wasn't even cooked al dente. ", "The broth was ok ", "but it was on the salty side. ", "The pot stickers were ok but never again shall I order the beef. ", "It was disgusting!! ", "The beef was rubbery, the noodles were undercooked and the sauce want spicy and it was extremely bland. ", "Service was despicable, they totally forgot we were there."], "author": "Melissa C.", "review": "This place was ok. My feelings and I ordered the Szechuan spicy beef over noodles, Won Ton noodle soup, Won Ton soup, shrimp dumpling noodle soup and pot stickers. The soups were average, the angels would appear to be Angel hair pasta and it wasn't even cooked al dente. The broth was ok but it was on the salty side. The pot stickers were ok but never again shall I order the beef. It was disgusting!! The beef was rubbery, the noodles were undercooked and the sauce want spicy and it was extremely bland. Service was despicable, they totally forgot we were there.", "rating": 2, "date": "2014-08-16"}, {"excerpts": ["I don't appreciate ordering the shrimp dumpling noodle soup, but getting the shrimp & pork dumpling noodle soup.  ", "I'm a pescatarian, so I could not even eat what I ordered.  ", "If the dumpling is a pork and shrimp dumpling, state that on the menu, not shrimp dumpling.  ", "Maybe they didn't want to pay for the extra print?"], "author": "Sandy K.", "review": "I'm giving this place 1 star out of spite.  I don't appreciate ordering the shrimp dumpling noodle soup, but getting the shrimp & pork dumpling noodle soup.  I'm a pescatarian, so I could not even eat what I ordered.  If the dumpling is a pork and shrimp dumpling, state that on the menu, not shrimp dumpling.  Maybe they didn't want to pay for the extra print?", "rating": 1, "date": "2010-05-23"}, {"excerpts": ["my boyfriend had the shrimp dumpling noodle soup and i had the won ton noodle soup. ", "they tasted the same to me... both were a shrimp-pork combination. ", "the broth was just okay... ", "nothing spectacular. ", "the gailan was awesome but i'd pass on the pot stickers. since we ordered so much food, it was $22 after tax and tip for two noodle soups, pot stickers, gailan, and a soda."], "author": "Kimberly S.", "review": "the place is decently good and cheap and the service is quick. my boyfriend had the shrimp dumpling noodle soup and i had the won ton noodle soup. they tasted the same to me... both were a shrimp-pork combination. the broth was just okay... nothing spectacular. the gailan was awesome but i'd pass on the pot stickers. since we ordered so much food, it was $22 after tax and tip for two noodle soups, pot stickers, gailan, and a soda.", "rating": 3, "date": "2010-02-01"}, {"excerpts": ["My husband ordered the shrimp dumpling noodle soup. "], "author": "L C.", "review": "Horrible Horrible Horrible!!! My husband ordered the shrimp dumpling noodle soup. Since it's not normally enough, we order a side of shrimp dumpling soup on the side. When the dumplings arrived, they were TINY and filled with concrete pork, barely any shrimp. It tasted like it had been sitting in the sun to toughen for a few days. I ordered the beef stew noodle soup. My soup was tasteless and the beef stew was mediocre. Not returning, ever! Told all my friends about this too. There's a GREAT wonton place on 32nd and Noriega.", "rating": 1, "date": "2008-07-02"}], "shrimp dumpling soup": [{"excerpts": ["SHRIMP DUMPLING SOUP: 4/5. "], "author": "Nikki B.", "review": "WONTED SOME WONTONS~\n\nCUSTOMER SERVICE: 3/5. No check ups, but at least we got hot tea on the house, quick orders and food plus everything is super cheap!\n\nFOOD:\nROASTED DUCK NOODLES: 4/5. Small portion but the duck was delicious. Nice, chewy and about 4-5 big pieces in my soup. The soup was a bit bland but nothing black pepper and some sriracha can't fix. \n\nSHRIMP DUMPLING SOUP: 4/5. Big dumplings about 4-5 but still bland soup base. \n\nOVERALL: 4/5. Clean, plenty of tables and everything was cheap. Not the greatest food but it was okay.", "rating": 4, "date": "2017-03-31"}, {"excerpts": ["The shrimp dumpling noodle soup was good too - but next time i'd pass on the noodles and just get the shrimp dumpling soup!"], "author": "Michelle L.", "review": "Great place for late night greasy chinese food goodness.\nCame here after Outsidelands (we were starving) around 11:00 PM and were seated quickly.\n\nThe duck congee was delicious - perfect balance between creamy rice and savory duck.\nThe shrimp dumpling noodle soup was good too - but next time i'd pass on the noodles and just get the shrimp dumpling soup!", "rating": 3, "date": "2015-08-10"}, {"excerpts": ["Ordered the wonton soup and shrimp dumpling soup! ", "They both tasted exactly the same. ", "Not bad but nothing special. ", "Super cheap ", "so that's a plus! ", "I would come here again :)"], "author": "Michelle H.", "review": "Ordered the wonton soup and shrimp dumpling soup! They both tasted exactly the same. Not bad but nothing special. Super cheap so that's a plus! I would come here again :)", "rating": 4, "date": "2014-11-26"}, {"excerpts": ["sampling: shrimp dumpling soup (4.15)\n-10 very large dumplings, filling about 1/2 shrimp,  1/2 pork\nshrimp mushy, not crunchy, tasteless\npork was salty, tasteless.\n", "*freshness of meat/shrimp in question   2 stars\n-broth mixture of msg, beef taste (powdered?)\n"], "author": "Victor G.", "review": "Won Ton House has a simple menu: won ton, noodles, porridge,  items over rice or over noodles etc.\n\ndining room clean, modern look.\n\nsampling: shrimp dumpling soup (4.15)\n-10 very large dumplings, filling about 1/2 shrimp,  1/2 pork\nshrimp mushy, not crunchy, tasteless\npork was salty, tasteless.\n*freshness of meat/shrimp in question   2 stars\n-broth mixture of msg, beef taste (powdered?)\ncomped tea was very nice.\n\nleftovers:\n-entrees cheap, portions large,  good value. 4 stars\n-service reasonable.-\n-msg aftertaste later\n-wonder where the employee was wheeling open containers (not covered) of chopped char siu to? he headed out the front door.\n-cash only\n\nchinese lesson     mandarin\ndumplings             shui jiao", "rating": 3, "date": "2011-05-26"}, {"excerpts": ["I tries the shrimp dumpling soup and Szechuan beef noodle broth were really excellent. ", "Shrimp was in a light broth and the szechuan was made to perfection by adding a little garlic-chili paste. ", "Definitely a great place if you're feeling under the weather or a rainy day!"], "author": "John P.", "review": "Tasty, simple and delicious menu that is extremely reasonably priced. I tries the shrimp dumpling soup and Szechuan beef noodle broth were really excellent. Shrimp was in a light broth and the szechuan was made to perfection by adding a little garlic-chili paste. Definitely a great place if you're feeling under the weather or a rainy day!", "rating": 4, "date": "2012-04-02"}, {"excerpts": ["I had the roast duck, fatty, of course, as roast duck will be and the shrimp dumpling soup, while tasty, was not something for which I would make a special trip.  "], "author": "Carmen H.", "review": "I wasn't overly impressed with this restaurant.  Certainly, the service was fast but the dishes I chose were only so-so, not exceptional.  I had the roast duck, fatty, of course, as roast duck will be and the shrimp dumpling soup, while tasty, was not something for which I would make a special trip.  I even tried the spicy beef tripe ( since I am\na tripe fan ) but I found that only mediocre.\n\nTry to use the bathroom at home before dining here as the one at the Won Ton House is horrible.", "rating": 2, "date": "2007-04-09"}, {"excerpts": ["Since it's not normally enough, we order a side of shrimp dumpling soup on the side. ", "When the dumplings arrived, they were TINY and filled with concrete pork, barely any shrimp. ", "It tasted like it had been sitting in the sun to toughen for a few days. ", "I ordered the beef stew noodle soup. ", "My soup was tasteless and the beef stew was mediocre. ", "Not returning, ever! ", "Told all my friends about this too. ", "There's a GREAT wonton place on 32nd and Noriega."], "author": "L C.", "review": "Horrible Horrible Horrible!!! My husband ordered the shrimp dumpling noodle soup. Since it's not normally enough, we order a side of shrimp dumpling soup on the side. When the dumplings arrived, they were TINY and filled with concrete pork, barely any shrimp. It tasted like it had been sitting in the sun to toughen for a few days. I ordered the beef stew noodle soup. My soup was tasteless and the beef stew was mediocre. Not returning, ever! Told all my friends about this too. There's a GREAT wonton place on 32nd and Noriega.", "rating": 1, "date": "2008-07-02"}], "fish ball noodle soup": [{"excerpts": ["We got the won ton noodle soup ($5.75) and fish ball noodle soup ($6.15). ", "You can substitute the egg noodles for the flat white rice noodles at no additional charge. ", "The won tons didn't taste that great to me. ", "We also ordered the spicy beef tripe ($5.25) and the pig ears ($5.25). ", "There's never a wait, so this is a good option for fast and cheap food."], "author": "Nicole M.", "review": "I used to come here all the time with my friends on Thursday nights for a quick cheap bite, but I see that they raised their prices :/ They're definitely still reasonable though. We got the won ton noodle soup ($5.75) and fish ball noodle soup ($6.15). You can substitute the egg noodles for the flat white rice noodles at no additional charge. The won tons didn't taste that great to me. We also ordered the spicy beef tripe ($5.25) and the pig ears ($5.25). There's never a wait, so this is a good option for fast and cheap food.", "rating": 3, "date": "2018-01-05"}, {"excerpts": ["My friend ordered the Fish Ball Noodle Soup.\n\n"], "author": "Tyler C.", "review": "I finally went here a few days ago.  I've passed by a bunch of times and it's one of the few places that I haven't tried on Noriega.  My first impression...this place is dirt cheap!  Everything is under $7 and the wonton noodle soup is only $3.95. It's also kinda hard to find if you don't know where it is already, because it doesn't really have a sign.  It's located next to the restaurant with the Sun logo on it (I can't read the chinese characters).  I ordered the Wonton noodle soup and the Ngow Jaap (beef organ) a la carte. My friend ordered the Fish Ball Noodle Soup.\n\nTo be honest, I wasn't impressed with their wontons.  I've had much better wontons in NY and if you're gonna name your restaurant after wontons, I expect the best.  Their wontons are just ok, although it's not bad for the price.  One thing I didn't like was that I thought there was grains of sand or something in my wonton, but no one on yelp has mentioned it before, so it could have just been a one time thing.  \n\nI did like the beef organ dish.  It's the standard dish you'd get at dim sum, but it's missing the intestines and the daikon.  I don't care for intestines, so I don't mind being without that, but I would have loved some daikon in the dish.  I also don't like spleen, so I put all of that to the side.  Haha, the only organs I like in that dish are the different types of beef tripe....Mmm...Yummy.\n\nMy friend said that his fish ball soup was decent, so I'll take his word for it.  The reason why this place gets 4 stars rather than 3 is because the prices are so cheap.  I didn't order any congee, but I saw that they were all around $4.  That's a pretty good deal, so I know where I'll be going if I need congee.  I'm guessing that it's hard to mess up congee, but I'll update this review if it turns out to be bad.  Another plus is that they're open until midnight every day of the week.", "rating": 4, "date": "2010-06-22"}], "stew beef brisket noodle soup": [], "ngow jasp noodle soup beef organ": [], "bbq pork noodle soup": [], "curry beef tendon noodle soup": [{"excerpts": ["Curry Beef Tendon Noodle Soup -Served in a bowl with the same designs that you would find at your grandparent's house. ", "The portion was just enough (which is probably why it is cheap). "], "author": "Allie Y.", "review": "My friend from out of town was visiting me and he wanted to go to a  Won-Ton place in the city and we chose Won-Ton-House. We wanted to go somewhere with parking and boba/dessert places nearby after dinner.\n\n\nI ordered Curry Beef tendons noodle soup and turnip came for appetizers to share with my friend. \n\n*Turnip Cake - Small and it was not as good as I hoped it was. There are minimal pieces of turnip so  all you could taste was the flour\n*Curry Beef Tendon Noodle Soup -Served in a bowl with the same designs that you would find at your grandparent's house. The portion was just enough (which is probably why it is cheap). The broth was just bland and the tendons did not have any curry taste to it at all. \n\nAmbiance - Lots of seating and casual chinese restaurant with not much decor but still comfortable and cozy\n\nService - The waitress was attentive and kept refilling our cups with tea. Took our order quickly and food came out within 10 minutes.\n\nThe reviews saying that this place used to be much better is true. I haven't came here before buy my mom told me she use to come here all the time. However, the food isn't so great anymore so she stopped coming here.\n\nOverall, i wouldn't mind coming back if I am looking for a cheap quick meal to fill up my belly. Besides that, there are plenty of other restaurants nearby.", "rating": 3, "date": "2016-02-21"}], "stewod pork feet noodle soup": [], "szechuan spicy beef noodle soup": [{"excerpts": ["We got:\n\nSZECHUAN SPICY BEEF NOODLE SOUP, "], "author": "Steph L.", "review": "More often than not, a cheap Chinese restaurant is cheap because their dishes are heavy on the carbs and light on the protein. Not at Wonton House! Don't be fooled by their dirt-cheap prices (all their dishes are under $6) - they're very generous with their meat portions!\n\nI came here for dinner to catch up with an ex (AKA former eating partner). We're both food addicts and have a tendency to enable each other's eat-like-there's-no-tomorrow habit. (He even told me that breaking up probably added 10 years back to his life since he will no longer die from obesity!) When it came time to order, we had a hard time narrowing our choices down to 4 dishes because we wanted to try everything (old habits die hard!) Even then our server asked if we could eat all that food. (Well, *we* thought 4 dishes were reasonable for 2 people...) We got:\n\nSZECHUAN SPICY BEEF NOODLE SOUP, #13 (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=H7bBbjdubPDOKeD2k5jyng) - we added dumplings to this and were so glad we did! They were little pillows of perfection. The beef was also very tender, not to mention plentiful. The soup wasn't as spicy or flavourful as I would've liked though and the egg noodles got a little soggy later on after soaking in the soup.\n\nBBQ PORK & ROAST DUCK OVER BRAISED NOODLES, #23 (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=f52GIBtilK6UoarfF3qlQw) - The noodles were cooked to a perfect al dente and lightly dressed with soy sauce. The B.B.Q. pork was passable but I've had way better. The roast duck was really flavourful and tender though.\n\nFISH & LIVER CONGEE (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=bBYReYxQuDNTFPakvYlZhg) - so much fish and so much liver! The liver was a little overcooked but still tasted good. The congee base was OK - a little watery though.\n\nCURRY POTSTICKERS, #57 (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=tqAc_KHRIHtU9tNwW9IKeg) - LOVED these! They were filled with an ample amount of perfectly seasoned meat (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=gSCwB1Y0Yg-5SPDFxcfHTg). The curry flavour made dipping sauces unnecessary but it wasn't overpowering. The skin had just the right texture and wasn't too thick. Though they could've been crispier, I liked that they weren't greasy like at a lot of other restaurants.\n\nI was also very impressed with the service - super fast and friendly! My ex went to the bathroom right after we ordered and our food came out before he did! We stayed for a while just chatting after we finished eating but they never rushed us - didn't give us our bill till we asked for it and even kept refilling our teacups :)", "rating": 4, "date": "2010-05-11"}], "mustard green": [{"excerpts": ["I have ordered the mustard green pork noodle soup which I did not find very good. ", "The noodles were over cooked. ", "But the pig ear and turnip cake made up for it. ", "While the pig ear isn't sliced as thinly as most places, the flavor and texture is spot on. "], "author": "Tiffany L.", "review": "Cheap, fast, tasty Chinese food. I have ordered the mustard green pork noodle soup which I did not find very good. The noodles were over cooked. But the pig ear and turnip cake made up for it. While the pig ear isn't sliced as thinly as most places, the flavor and texture is spot on. The turnip cake is pan fried to order, fresh and piping hot! \n\nWent back today for iced Hong Kong milk tea, wonton noodles and pan-fried turnip. The milk tea tasted more like a mix of tea and ovaltine which I did not mind. The wonton noodles were very good. My husband ordered the dumpling soup, which was a generous portion. \n\n They have late hours and parking is normally plentiful.", "rating": 3, "date": "2013-09-27"}, {"excerpts": ["Third time: Had their shredded pork and preserved mustard green rice noodle.  ", "I was looking forward to this dish because at the time all I wanted was that.  ", "First bite into the veggie and tasted the nice salty goodness of the preserved veggie and then into the meat ", "and it tasted kind of funny sour ", "and I thought it was from the preserved greens as it its a tad bit sour.  ", "Before taking my third bite and as a force of habit, I started mixing the toppings around ", "so I can get even noodle to meat and veggie portion.  ", "Lo-and-behold some of  the meat was green.  ", "They served me rancid meat.  ", "That would explain the tartness of the meat. ", "Called the server lady over and told her about it ", "and she said that it looked fine, but willing to take it away then ", "asked if I want something else.  ", "I felt like puking and was no mood to eat and declined the offer.  ", "Then I waited for my friend to finish eating and asked for the bill.  "], "author": "Vanna S.", "review": "Had their food about three times.  \n\nFirst time: Had wonton thin egg noodle soup and for their name, it was a big disappointment.  Lack of flavor soup base and the wonton was nothing special.\n\nSecond time: Had their beef stew noodle, it was very good and also very greasy.  Yeah, had that coming, but still.\n\nThird time: Had their shredded pork and preserved mustard green rice noodle.  I was looking forward to this dish because at the time all I wanted was that.  First bite into the veggie and tasted the nice salty goodness of the preserved veggie and then into the meat and it tasted kind of funny sour and I thought it was from the preserved greens as it its a tad bit sour.  Before taking my third bite and as a force of habit, I started mixing the toppings around so I can get even noodle to meat and veggie portion.  Lo-and-behold some of  the meat was green.  They served me rancid meat.  That would explain the tartness of the meat. Called the server lady over and told her about it and she said that it looked fine, but willing to take it away then asked if I want something else.  I felt like puking and was no mood to eat and declined the offer.  Then I waited for my friend to finish eating and asked for the bill.  They charged me for the disgusting bowl they got back, which, by-the-way made me gagged followed by diarrhea. \n\nThat was the last experience with them, needless to mention...I haven't had shredded pork and preserved veggie rice noodle soup as Won-Ton House left a sour taste in my mouth (and mind).", "rating": 1, "date": "2009-04-26"}, {"excerpts": ["My heavy rotation there are the pork and mustard green soup with the thick Shanghai noodles...suet choy yuk cee mein, their turnip cakes... ", "lo bat go, their beef stew braised noodles...gnaw lam lo mein, their duck and preserved egg porridge... ", "pei dan sao yuk jook, and of course an order of chinese broccoli... ", "gai lan.  ", "Way possible for fat me and the wife to get seated famished and leave totally content for under twenty bucks.  ", "Product exceeds price here in my book.  ", "Four stars for taste that exceeds the value."], "author": "Barry A.", "review": "Another of my current neighborhood's winners.  Inexpensive, quick, and tasty.  My heavy rotation there are the pork and mustard green soup with the thick Shanghai noodles...suet choy yuk cee mein, their turnip cakes... lo bat go, their beef stew braised noodles...gnaw lam lo mein, their duck and preserved egg porridge... pei dan sao yuk jook, and of course an order of chinese broccoli... gai lan.  Way possible for fat me and the wife to get seated famished and leave totally content for under twenty bucks.  Product exceeds price here in my book.  Four stars for taste that exceeds the value.", "rating": 4, "date": "2007-05-28"}], "pork giblet porridge": [], "sampan porridge": [{"excerpts": ["I usually order the won ton noodle soup or the sampan porridge. "], "author": "Calvin P.", "review": "I usually order the won ton noodle soup or the sampan porridge. Very simple but very satisfying. \n\nBut the tastiest item on the menu are the curry pot stickers. I'd be fine if they decided to change the place's name to Curry Pot Sticker House.  I was bummed out one time when they told us the person who makes them was on vacation and they did not have curry pot stickers that night. \n\nGreat little place in the Sunset for a quick meal. Almost never a wait and it's a better deal than any of the nearby pho places.", "rating": 5, "date": "2011-08-01"}, {"excerpts": ["When I feel like I want something a little healthier, I go for some fish or sampan porridge ($4) ", "and when I'm just starving and carnivorous, I go for their braised beef brisket over noodles ($6). ", "Everything is enough for two, but it's so good that I always finish my own plate. ", "Along with a main dish, I always get the pork ears($4) ", "(I know it sounds really gross..and ", "I thought so too until I tried it)..."], "author": "Jessica h.", "review": "Mmmm...great for a typical chinese breakfast of porridge or won-ton noodle soup or late night dining of some chinese specialty snacks. I come here at least once a week (and I don't even live in SF anymore...) Everytime I come back on the weekends, I always have to head over here. When I feel like I want something a little healthier, I go for some fish or sampan porridge ($4) and when I'm just starving and carnivorous, I go for their braised beef brisket over noodles ($6). Everything is enough for two, but it's so good that I always finish my own plate. Along with a main dish, I always get the pork ears($4) (I know it sounds really gross..and I thought so too until I tried it)...yes, it's pig ears, marinated, cooked, then sliced...its semi-soft, semi-crunchy (due to the cartilage) and served cold with a drizzle of sesame oil on top. \n\nAlong with they really great, tasty food, the service is always FAST and really good here too....since I go here so much, one of the servers knows us and even gives us a bigger portion of pork ears without the oil (thats how we always ask for it, so I can eat it with chili oil instead of sesame oil). \n\nIt gets packed here on Saturday and Sunday afternoons, and also at the time when I usually go, 11 at night on weekdays.", "rating": 4, "date": "2007-05-13"}], "meat ball porridge": [], "liver porridge": [{"excerpts": ["Also had the liver porridge. ", "Loads of liver (in relation to porridge) ", "so it was a bit much. "], "author": "v w.", "review": "Good cheap eats! Won ton noodles were tasty, and smelled wonderful with the little drizzle of sesame oil.\n\nAlso had the liver porridge. Loads of liver (in relation to porridge) so it was a bit much. But my fault for ordering porridge at a Won Ton place.\n\nNot bad for a $3.95 bowl of noodles at 10.30pm. It's a little dingy and not totally inviting looking, but hey, it's a no-fuss $4 meal. I can live with it.", "rating": 3, "date": "2009-11-29"}, {"excerpts": ["It's time to find a new place for liver porridge...=", "("], "author": "Helen L.", "review": "I came here for the second time just a couple of days ago and was disappointed with the food. The food was bad this time. The porridge was tasteless and the liver was getting overcooked and chewy as it sat in my bowl while I was eating it. I would have had to eat all the liver first for that not to happen or eat a lot faster. The bowl of porridge was really hot though so I could really only eat so fast. I had to add some table seasoning to help it along. It's time to find a new place for liver porridge...=(", "rating": 2, "date": "2010-09-12"}], "kidney porridge": [], "pork tripe porridge": [], "shrimp porridge": [], "liver  kidney porridge": [], "oyster sauce over noodle": [], "stewod beef brisked over noodle": [], "bbq pork over noodle": [], "ngow jaap over noodle beef organ": [], "roast duck over noodle": [], "spicy minood pork over noodle shanghai noodle": [], "curry beef tendon over noodle": [], "stewod pok feet noodle": [], "bbq pork  roast duck over noodle": [], "szechuan spicy beef over noodle": [], "bbq pork over rice": [{"excerpts": ["Also, their duck and BBQ pork over rice is yummy too. ", "Definitely one of my go to spots! ", "Cash only!"], "author": "Elton N.", "review": "It cost me under $10 for extra noodles and 12 wontons!! HELL OF A DEAL! #1 is LEGIT. I've also had their chicken with ginger and chives over rice which is awesome. Also, their duck and BBQ pork over rice is yummy too. Definitely one of my go to spots! Cash only!", "rating": 5, "date": "2016-10-11"}, {"excerpts": ["Bbq pork over rice was my choice of meal, the pork was microwaved, half hot half cold,the lettuce was wilted like it was four years old. ", "My son had the duck over rice, the duck was stone cold and tasted awful. ", "My fiancé got the wonton soup, which smelled like sweaty socks and tasted just as bad. ", "Avoid this place at all costs, your stomach will thank you!!! ", "My ass won't in the morning"], "author": "Ken C.", "review": "If I could give no stars, I would. Bbq pork over rice was my choice of meal, the pork was microwaved, half hot half cold,the lettuce was wilted like it was four years old. My son had the duck over rice, the duck was stone cold and tasted awful. My fiancé got the wonton soup, which smelled like sweaty socks and tasted just as bad. Avoid this place at all costs, your stomach will thank you!!! My ass won't in the morning", "rating": 1, "date": "2015-06-19"}], "stewed brisket of beef over rice": [], "ngow jaap over rice beef organ": [], "ginger chicken over rice": [], "curry beef tendon over rice": [{"excerpts": ["The curry beef tendon over rice was fair, if you just like to chew on tendon and not really eat anything.  ", "There are ample tables around.  ", "Not the best Chinese food to be had but not the worse either.\n", "On a 2nd day, I stopped for take-out. ", "The stewed beef brisket noodle soup was too salty and the beef pieces were dry and tough.  ", "The Szechuan spicy beef over rice was flavorful and not too spicy with cooked pieces of lettuce, a lot of rice but ", "\"where's the beef?\"   ", "The won ton soup was fair.  ", "You get about 5 pieces of chunky won ton.  ", "I do like their won ton noodles which are thin and chewy.  ", "The roast duck won ton was same as above, just a rare few pieces of duck.  "], "author": "Ry T.", "review": "Not too many places where you can get inexpensive Chinese comfort food late at night. CASH ONLY, that's why.  They're opened until midnite daily except on Sundays.  We had just returned from Florida (can't find good Chinese food in Orlando) and wanted Chinese food but everywhere we called were closed except here.  5 orders ran us $25. Their congee is watered down but passable.  The won ton noodles are good and the beef stew noodles are very good with ample chunks of beef.  The curry beef tendon over rice was fair, if you just like to chew on tendon and not really eat anything.  There are ample tables around.  Not the best Chinese food to be had but not the worse either.\nOn a 2nd day, I stopped for take-out. The stewed beef brisket noodle soup was too salty and the beef pieces were dry and tough.  The Szechuan spicy beef over rice was flavorful and not too spicy with cooked pieces of lettuce, a lot of rice but \"where's the beef?\"   The won ton soup was fair.  You get about 5 pieces of chunky won ton.  I do like their won ton noodles which are thin and chewy.  The roast duck won ton was same as above, just a rare few pieces of duck.  If you want better won ton noodle soup with duck, then Win's on Taraval is the better place for this.", "rating": 3, "date": "2008-08-15"}], "stewed pork feet over rice": [], "bbq pork  roast duck over rice": [], "oyster sauce with fresh vegetable": [], "curry beef tendon": [{"excerpts": ["Curry Beef Tendon Noodle Soup -Served in a bowl with the same designs that you would find at your grandparent's house. ", "The portion was just enough (which is probably why it is cheap). "], "author": "Allie Y.", "review": "My friend from out of town was visiting me and he wanted to go to a  Won-Ton place in the city and we chose Won-Ton-House. We wanted to go somewhere with parking and boba/dessert places nearby after dinner.\n\n\nI ordered Curry Beef tendons noodle soup and turnip came for appetizers to share with my friend. \n\n*Turnip Cake - Small and it was not as good as I hoped it was. There are minimal pieces of turnip so  all you could taste was the flour\n*Curry Beef Tendon Noodle Soup -Served in a bowl with the same designs that you would find at your grandparent's house. The portion was just enough (which is probably why it is cheap). The broth was just bland and the tendons did not have any curry taste to it at all. \n\nAmbiance - Lots of seating and casual chinese restaurant with not much decor but still comfortable and cozy\n\nService - The waitress was attentive and kept refilling our cups with tea. Took our order quickly and food came out within 10 minutes.\n\nThe reviews saying that this place used to be much better is true. I haven't came here before buy my mom told me she use to come here all the time. However, the food isn't so great anymore so she stopped coming here.\n\nOverall, i wouldn't mind coming back if I am looking for a cheap quick meal to fill up my belly. Besides that, there are plenty of other restaurants nearby.", "rating": 3, "date": "2016-02-21"}, {"excerpts": ["we decided to come here because my friend got their curry beef tendon noodles and remembered it being delish ", "so he wanted to try it again. ", "when the noodles arrived, he realized he ordered the wrong dish. ", "what he really meant to order was the beef brisket noodles ", "so we ordered a side of it a la carte. ", "the curry beef noodles were simple and good. ", "it's chewy pieces of beef tendon in a curry sauce served over egg noodles. ", "the side of beef brisket is definitely ", "a must try! ", "it was cooked perfectly. ", "the meat was tender and the gravy was delicious. "], "author": "Bobbie W.", "review": "quaint little chinese place that's known for their noodles. this place doesn't take card or checks so bring cash money people!\n\nwe decided to come here because my friend got their curry beef tendon noodles and remembered it being delish so he wanted to try it again. when the noodles arrived, he realized he ordered the wrong dish. what he really meant to order was the beef brisket noodles so we ordered a side of it a la carte. the curry beef noodles were simple and good. it's chewy pieces of beef tendon in a curry sauce served over egg noodles. the side of beef brisket is definitely a must try! it was cooked perfectly. the meat was tender and the gravy was delicious. yummmmm.\n\nwe also ordered the wonton noodle soup and the curry potstickers. the wontons were good. they were filled with ground meat and shrimp and served over some more egg noodles in an abalone-tasting broth. the broth was delicious but i was all egg-noodled out! i suggest ordering a rice dish to mix it up. \n\nthe curry potstickers were interesting. i've never curry in my potstickers so it was different but good. it really reminded me of an indian samosa or something indian, not chinese because of the strong curry taste. the dough was really good and it was filled with meat and veggies. definitely homemade and worth trying if you love curry and potstickers.\n\neverything here is reasonably priced. don't expect anything fancy. just some good ole hearty chinese food that hits the spot.", "rating": 3, "date": "2011-08-22"}, {"excerpts": ["The curry beef tendon over rice was fair, if you just like to chew on tendon and not really eat anything.  ", "There are ample tables around.  ", "Not the best Chinese food to be had but not the worse either.\n", "On a 2nd day, I stopped for take-out. ", "The stewed beef brisket noodle soup was too salty and the beef pieces were dry and tough.  ", "The Szechuan spicy beef over rice was flavorful and not too spicy with cooked pieces of lettuce, a lot of rice but ", "\"where's the beef?\"   ", "The won ton soup was fair.  ", "You get about 5 pieces of chunky won ton.  ", "I do like their won ton noodles which are thin and chewy.  ", "The roast duck won ton was same as above, just a rare few pieces of duck.  "], "author": "Ry T.", "review": "Not too many places where you can get inexpensive Chinese comfort food late at night. CASH ONLY, that's why.  They're opened until midnite daily except on Sundays.  We had just returned from Florida (can't find good Chinese food in Orlando) and wanted Chinese food but everywhere we called were closed except here.  5 orders ran us $25. Their congee is watered down but passable.  The won ton noodles are good and the beef stew noodles are very good with ample chunks of beef.  The curry beef tendon over rice was fair, if you just like to chew on tendon and not really eat anything.  There are ample tables around.  Not the best Chinese food to be had but not the worse either.\nOn a 2nd day, I stopped for take-out. The stewed beef brisket noodle soup was too salty and the beef pieces were dry and tough.  The Szechuan spicy beef over rice was flavorful and not too spicy with cooked pieces of lettuce, a lot of rice but \"where's the beef?\"   The won ton soup was fair.  You get about 5 pieces of chunky won ton.  I do like their won ton noodles which are thin and chewy.  The roast duck won ton was same as above, just a rare few pieces of duck.  If you want better won ton noodle soup with duck, then Win's on Taraval is the better place for this.", "rating": 3, "date": "2008-08-15"}, {"excerpts": ["curry beef tendon & finally the turnip cake.  \n\n"], "author": "larry s.", "review": "the place is great, great cheap chinese comfort food & its open late night until 2 am in the morning.  my wife & i typically stick to the standards.  wonton soup, shrimp dumplings w/ noodles, szechuan beef &/or curry beef tendon & finally the turnip cake.  \n\nthis is one of those places that offer a few menu items but they do it good, so why mess with a good thing.  the service is quick, attentive & the food is good.  the restaurant is clean & the decor has been updated.  there is typically no wait to get a table & they open late night.  street parking is typically not too bad at night but during the day it can be a challenge.  they do not accept credit cards or checks, cash only.\n\ntypical meal for 2 people is about 15.00.  great place, great food & they open late, not much to complain about...", "rating": 4, "date": "2007-10-16"}], "stewed brisket of beef": [], "ngow jaap beef organ": [], "bbq pork": [{"excerpts": ["Porridge and bbq pork taste bad , I ate 1 piece of bbq pork , it smells stinky and taste likes moldy meat ! ", "Finally I leave the whole plate bbq pork on the table ! ", "I won't go there again !! ", "Never"], "author": "Bing L.", "review": "Porridge and bbq pork taste bad , I ate 1 piece of bbq pork , it smells stinky and taste likes moldy meat ! Finally I leave the whole plate bbq pork on the table ! I won't go there again !! Never", "rating": 1, "date": "2018-09-15"}, {"excerpts": ["My friend ordered the gnaw jap wonton noodle soup, I ordered the bbq pork (cha siew) wonton noodle soup, and my friend ordered noodles with bbq pork and duck. ", "The portions for everything was HUGE. ", "As for my dish, the bbq pork could be a little more fresh. ", "They were generous with the amount though. ", "The wonton was delicious and the broth was even better. "], "author": "Julian Y.", "review": "I never noticed this place despite always eating at the other restaurants on the same block. For the first time in a long time, this place caught my eye and we decided to try it. This place had plenty of seats late at night, so we sat down and looked at the menu right away. This place is cash only, but everything on the menu is cheap. Pretty much the whole menu is less than $10 per dish which is rare in SF.\n\nMy friend ordered the gnaw jap wonton noodle soup, I ordered the bbq pork (cha siew) wonton noodle soup, and my friend ordered noodles with bbq pork and duck. The portions for everything was HUGE. There's no way that one person can finish their dish and still be hungry.\n\nAs for my dish, the bbq pork could be a little more fresh. They were generous with the amount though. The wonton was delicious and the broth was even better. Next time I'd be satisfied with ordering a wonton noodle soup without any additional items.\n\nWill be here a little more often now when it is cold and gloomy.", "rating": 3, "date": "2017-12-15"}, {"excerpts": ["BBQ pork rice dish: very flavorful and rice was perfect. ", "One or two pieces that were a little too fatty but overall delicious. ", "It's also a gigantic plate. ", "The only reason we finished is my friend can eat A LOT. ", "4/5\nRoast duck porridge: perfect rice soup ratio and the duck is so deliciousssss. ", "When I eat something ", "I like I get really excited and ", "this soup makes me do a happy dance. ", "It always hits the spot and I could get fat eating these succulent pieces. ", "Also perfect amount of fresh green onion to offset the juicy duck. ", "5/5"], "author": "Anna N.", "review": "My favorite porridge I've had in the city so far . I crave the roasted duck porridge from time to time especially with the weather around here. I also like that this place is super affordable (always incredibly full with leftovers for under $10 / person). For some reason I've been finding it harder than I thought to find good, cheap food...\n\nService: I always go with my friend who speaks Cantonese so I don't know what they're saying but the lady always greets me and is smiley and nice. She's also very attentive to your tea / water and service is always quick. 5/5\n\nFood: I've liked pretty much everything I've had here and it's very consistent. The only thing I can say is there are noodle things a little over cooked and a fried flat noodle dish that wasn't really fried. But all their meats and side dishes are awesome. I'll just review our food from tonight..\nBBQ pork rice dish: very flavorful and rice was perfect. One or two pieces that were a little too fatty but overall delicious. It's also a gigantic plate. The only reason we finished is my friend can eat A LOT. 4/5\nRoast duck porridge: perfect rice soup ratio and the duck is so deliciousssss. When I eat something I like I get really excited and this soup makes me do a happy dance. It always hits the spot and I could get fat eating these succulent pieces. Also perfect amount of fresh green onion to offset the juicy duck. 5/5", "rating": 4, "date": "2017-11-08"}, {"excerpts": ["Bf had the BBQ pork pan fried noodles. "], "author": "Samantha C.", "review": "Cash only. Basically a no-frills Chinese restaurant, where the food is cheap (ish) and the cleanliness is questionable. \n\nHonestly, I was not impressed by the rice porridge. The fish rice porridge ($8!!) had just a few meager pieces of white fish and green onions. Also, there was a layer of glimmering oil on top, making this supposedly healthy dish not that clean tasting at all. The overall porridge had a faint yellow tint, rather than the signature white look of rice. The texture was also super watery with no hints of rice grains. Would not order again. \n\nBf had the BBQ pork pan fried noodles. EXTREMELY oily with very little pork. \n\nOverall three stars for now until I come back and try more dishes... maybe.", "rating": 3, "date": "2016-02-22"}, {"excerpts": ["My family usually gets the bbq pork wonton with noodles, porridge, duck/ bbq pork rice plates ,and \"Chinese tamales\"\n"], "author": "Ryan J.", "review": "This little gem is one of my favorites in the whole city.  I've been coming here since I was a kid. Parking around noriega can be tough at peak dinner hours during the week and all day during weekends, so if you are in a hurry I would highly recommend calling in for take out, dragging someone with you, and have them run in to pick up your food. This is a real no nonsense place to get cheap, pretty good comfort food. \n\n*Cash only\n\nFood - 4/5\nMy family usually gets the bbq pork wonton with noodles, porridge, duck/ bbq pork rice plates ,and \"Chinese tamales\"\nThe theme of all of the dishes is that they are simple, but good. \n\nService - 3/5\nThis place is usually never busy when I come, so service is pretty quick. Only real knock is that you need to flag someone down if you need something. You always get hot tea to start. \n\nAmbience - 3/5\nIt has a pretty homey feel and can accommodate  groups. Since it is usually not packed it is great to come in on a cold day and grab soup.", "rating": 4, "date": "2017-05-25"}, {"excerpts": ["My boyfriend ordered the wonton soup with bbq pork and it tasted a better and has more flavor. ", "This is a definitely a go to place if you're in a rush or just want something warm on a cold day. ", "Another plus is that they open late! ", "So if you got that late night munchie and don't want to eat fast food, you should check this place out!"], "author": "Monica W.", "review": "Came here on a week night with my boyfriend. It's never crowded here and the price is cheap. You can get a bowl of wonton soup for about $5+. The wonton soup is simple, it really just has the wonton in soup. I wish it had some veggies tho lol. My boyfriend ordered the wonton soup with bbq pork and it tasted a better and has more flavor. This is a definitely a go to place if you're in a rush or just want something warm on a cold day. Another plus is that they open late! So if you got that late night munchie and don't want to eat fast food, you should check this place out!", "rating": 4, "date": "2017-05-22"}, {"excerpts": ["At $9.95 the Won Ton Noodle with BBQ Pork and the addition of a vegetable was very good and still under $10. ", "The pork was thick and flavorful while their Won Ton was a mix of meat and shrimp nicely served over a bed of thin egg-noodles. "], "author": "Caesar A.", "review": "Check this out for yourselves. This is a clean space with a Health Safety score of 85 serving above average food. They are open late, the service is very good and for what they provide, the price being under $10 is inexpensive. \n\nAt $9.95 the Won Ton Noodle with BBQ Pork and the addition of a vegetable was very good and still under $10. The pork was thick and flavorful while their Won Ton was a mix of meat and shrimp nicely served over a bed of thin egg-noodles. I thought the broth was not at all too salty, a real plus for me.\n\nFor another $9.95 the Won Ton Noodle with Fish Ball plus and the addition of a vegetable is more than reasonable.", "rating": 4, "date": "2016-12-31"}, {"excerpts": ["BBQ pork rice plate , won ton noodles soup , veggies , porridge and their special red bean dessert is what I always get and they never disappoint ! ", "This place has been opened for over a few decades , so they obviously have something good going on in there ."], "author": "Carmen V.", "review": "This place is the hole in the wall restaurant you probably wouldn't notice in daylight but on a cold night , this place is your perfect getaway . They have hot steamy won ton and porridge to warm you up . They're opened pretty late and that's why it sticks out so much on a block of darkness when other businesses are closed . This place has a pretty small menu but there are truly some amazing staples . It's not super unique or any type of fusion that stands out but more like food how your grandma use to make. BBQ pork rice plate , won ton noodles soup , veggies , porridge and their special red bean dessert is what I always get and they never disappoint ! This place has been opened for over a few decades , so they obviously have something good going on in there .", "rating": 4, "date": "2016-07-07"}, {"excerpts": ["Roast Duck & BBQ Pork over Noodles (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#xa6sEzBFnVtxqz5a0NHwug) ", "- You can have this over rice too, but I'm always going to be a noodles kind of guy.  ", "As with mostly all Chinese BBQ the MSG is in the marinade.  ", "They use the same sturdy noodles on this as they use in their noodle soups.  "], "author": "Wilhelm Y.", "review": "MSG can kill or make some persons really, really sick, but some people are not the least bothered by consuming MSG.  Me?  I'm a bit in between.  While MSG can provide an irritating tingle in my mouth or on my tongue I've never become sick from consuming it.  Sometimes I enjoy living on the edge, and it's those times when I visit the Won Ton House on Noriega Street.\n\nDon't expect impeccable service here.  It's basically a sit where you want type of place and the waitress will wait until you are properly seated before bringing you a boiling cup of hot tea.  She'll take your order, bring you your food, occasionally glance at you to make sure you're not doing anything mischievous (taking photos of food is the exception) then she'll bring you your check.\n\nLiving on the edge isn't the reason I eat here though.  I eat here because the food is cheap and as much as I hate to admit it I do have some of those cheap-Chinesey genes in me.\n\nLet's take a look at what I've ordered on recent visits:\n\nWon Ton Noodle Soup (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#_o08CiG6XmYhflC8fhnn-w) - The won tons are nice and plump and pretty decent.  The noodles stay firm for the duration of your visit, and they don't get mushy.  The broth is where the MSG is really noticeable.  Don't finish the broth and I'm usually okay.\n\nPotstickers (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#0QLakvWbQuiqJmkBpM7jtg) - Sometimes five to an order and sometimes six!  Mixed with the coarsely ground pork is a bit of cabbage and sometimes a bit of ginger.  It's not bad and the MSG is minimal.\n\nStewed Beef Brisket Noodle Soup (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#kGkSDCM8wN7sEWGeDcTf3g) - The beef is usually tender and the tendons are properly chewy.  Like the won ton noodle soup the MSG is in its broth.  You'll know what to do.\n\nRoast Duck & BBQ Pork over Noodles (http://www.yelp.com/biz_photos/won-ton-house-san-francisco?select=xa6sEzBFnVtxqz5a0NHwug#xa6sEzBFnVtxqz5a0NHwug) - You can have this over rice too, but I'm always going to be a noodles kind of guy.  As with mostly all Chinese BBQ the MSG is in the marinade.  They use the same sturdy noodles on this as they use in their noodle soups.  They pour some of the fatty liquid from the BBQ meats into the noodle to give it some extra oomph and extra MSG.\n\nMake sure you drink a lot of liquids after eating here just to wash away the MSG.  \n\nSo if MSG and low health scores don't bother you so much, and you want hot, cheap food relatively fast this place is A-OK!", "rating": 3, "date": "2014-04-30"}, {"excerpts": ["The BBQ pork in our soup was a lttle dry and lean, but still very tasty.\n\n"], "author": "Terry T.", "review": "Solid place for a quick bite to eat.  The noodles were firm and the broth was light and flavorful.  The BBQ pork in our soup was a lttle dry and lean, but still very tasty.\n\nService was quick and friendly.  I would visit again the next time I am in the area.", "rating": 4, "date": "2016-08-08"}, {"excerpts": ["I ordered a dish of oyster sauce with vegetables, which was $5.95, and a bowl of wonton noodle soup with an additional topping of bbq pork, which was not on the menu. ", "So, I asked how much the dish would be with the additional topping. ", "I was quoted $7.95. ", "When I got my bill, the quoted price was correct, but my vegetable dish was added an additional $.20. ", "So, I asked why that was the case. ", "She then told me that she had misquoted me the pricing for the noodle soup. ", "It should have been $.20 more ($8.10). "], "author": "GR Z.", "review": "I ordered a dish of oyster sauce with vegetables, which was $5.95, and a bowl of wonton noodle soup with an additional topping of bbq pork, which was not on the menu. So, I asked how much the dish would be with the additional topping. I was quoted $7.95. When I got my bill, the quoted price was correct, but my vegetable dish was added an additional $.20. So, I asked why that was the case. She then told me that she had misquoted me the pricing for the noodle soup. It should have been $.20 more ($8.10). So, instead of letting me know that she had misquoted the dish,  she went ahead and decided to add an additional $.20 to my vegetable dish . \n\nOh dear.... I would have been fine if she would have verbally communicated with me for the misquoted dish. Now I just can't trust this place and won't come back at all. It is not the $.20. Dishonesty is not ok. Lack of communication on pricing is not ok. Charging extra without letting customers know is not ok. It is illegal. Last but not least, the entire conversation that I had with the waitress was in Cantonese. Language barrier was not the issue. Bad business conduct was.", "rating": 1, "date": "2016-02-19"}, {"excerpts": ["I ordered a bbq pork wonton noodle soup. ", "The bbq pork was underwhelming, and wasn't very good at all. ", "The wontons were okay, and they were very generous with the amount wontons in my soup. ", "The noodles were super filling, and I wasn't even able to finish half of them! ", "The soup was pretty good. "], "author": "Vivian L.", "review": "I came here with a friend because we were both craving noodle soup.\n\nI ordered a bbq pork wonton noodle soup. The bbq pork was underwhelming, and wasn't very good at all. The wontons were okay, and they were very generous with the amount wontons in my soup. The noodles were super filling, and I wasn't even able to finish half of them! The soup was pretty good. I kept mentioning to my friend how full I was, but somehow still ended up slurping on the soup as we talked.\n\nMy friend ordered the roast duck with wontons, without the noodles (smart choice!). And by the time he finished his meal, he was pretty full, even without the noodles.\n\nWe also shared an order of turnip cakes. They were surprisingly delicious! They were perfectly crispy on the outside, and soft on the inside. They weren't too oily either, unlike most places that serve turnip cake.\n\nDecent food and generous portions at cheap prices. I won't argue with that. Definitely coming back for more turnip cake!", "rating": 3, "date": "2015-06-17"}, {"excerpts": ["Also, their duck and BBQ pork over rice is yummy too. ", "Definitely one of my go to spots! ", "Cash only!"], "author": "Elton N.", "review": "It cost me under $10 for extra noodles and 12 wontons!! HELL OF A DEAL! #1 is LEGIT. I've also had their chicken with ginger and chives over rice which is awesome. Also, their duck and BBQ pork over rice is yummy too. Definitely one of my go to spots! Cash only!", "rating": 5, "date": "2016-10-11"}, {"excerpts": ["During our first visit, the bf's sister got a noodle dish topped with char siu bbq pork. ", "There was an incredible amount of pork; I was actually thinking about getting this to-go. ", ":p ", "Our second visit, the bf got the spicy Szechuan noodle soup. ", "The noodles looked good and the chunks of beef were lean. ", "I wish they were a *little* more tender than they were, but I'm thinking that this dish might not be a specialty of theirs so personally, I wouldn't pick it. "], "author": "Steph S.", "review": "I'm a fan of Won Ton House and have been here twice so far, both as \"real food\" stops before going across the street to Golden Island for dessert. :)\n\nWon Ton House reminds me of the restaurants we visited in Hong Kong... No frills in the decor or the presentation of the food, but really good flavors and extremely well-priced.\n\nWhen you sit down, the auntie lady acting as both server and cook will bring over two mugs of tea. The tea, while brewed in one of those diner-style coffee carafes, is actually quite good - warming on a chilly night and not over-steeped. \n\nSince this is \"Won Ton House,\" I've only ordered won ton noodle soup, which happens to be my #1 comfort food. It's a really simple dish, so the $4.75 price is fitting. You get a heap of egg noodles, about five wontons with shrimp and pork inside, and broth. No veggies, no meat - though maybe the other options on the menu include them... I'll have to check next time.\n\nThe won tons are very good and are full of meat. Every won ton seemed to have at least one shrimp in it. The broth (chicken-based) is light, but flavorful and I didn't really detect any MSG. That is, I didn't feel super thirsty after finishing my bowl, but I'm not really a stickler for MSG to begin with. Most Chinese restaurants use it, so it's not a big deal to me.\n\nDuring our first visit, the bf's sister got a noodle dish topped with char siu bbq pork. There was an incredible amount of pork; I was actually thinking about getting this to-go. :p Our second visit, the bf got the spicy Szechuan noodle soup. The noodles looked good and the chunks of beef were lean. I wish they were a *little* more tender than they were, but I'm thinking that this dish might not be a specialty of theirs so personally, I wouldn't pick it. Bf said that the broth was good though.\n\nThe best part of our meals here has been the turnip cake or \"law back gow\". SO GOOD. It's pan-fried so each piece is crispy on the outside, but once you bite into it, it's incredibly soft and pillowy and so smooth. You must order this no matter what.\n\nDinner for two was about $8 before tip and we left (for dessert at Golden Island) full and happy.", "rating": 5, "date": "2014-08-18"}, {"excerpts": ["We ordered BBQ Pork Lo Mein and 2 won ton noodle soup.  ", "You can chose thin or thick noodles for your noodle soup.  ", "That's a plus for me because  a lot of places only offer thin noodle "], "author": "Wendy H.", "review": "We wanted to go to Bakery & Cafe for lunch but they were crowded and there's a wait.  If you have two small children you know that won't do.  Checked out the restaurants adjacent to Bakery & Cafe (Icehouse & Won Ton House).  Icehouse looks like they are empty.  There were people in Won Ton House so we went in (that and the under $5 meals lured us in).\n\nThere is no one to seat you.  You pretty much seat yourself but the waitress does notice you and comes by with your tea and water in a jiffy.  My tea came in a cracked cup.  I was definitely worried that it would implode and spill all over me when I touch it -- luckily it didn't.\n\nWe ordered BBQ Pork Lo Mein and 2 won ton noodle soup.  You can chose thin or thick noodles for your noodle soup.  That's a plus for me because  a lot of places only offer thin noodle and it feels like you are chewing on wire.\n\nFood came fast.  There were about 8 won tons in the noodle soup.  No veggies.  I guess you would have to order that separately.  Come on, even some lettuce would be good.\n\nWon ton is good.  You can see medium whole shrimp and some pork.  No mushrooms - fine with me.  Noodles are cooked just right.  They are not undercooked like so many places do it (that makes them wiry!).\n\n3 dishes = $15.  Wow!  That's cheap!  Portions are just right.  Cash only.\n\nYes it's a hole in a wall and service is typical \"I don't care\" Chinese style but hey, this isn't a 5-star restaurant and we aren't paying 5-star prices so fine with me!", "rating": 4, "date": "2011-08-06"}, {"excerpts": ["I ordered wonton noodles and my sister got the bbq pork noodles. ", "Fast friendly service ", "so it was nice to get in and get out. ", "The soups contained too much MSG. ", "My sister said her pork was super salty. ", "My wontons were ok. ", "This place is ok though if you're out late and in the area but special."], "author": "Julie C.", "review": "I love how this place stays open late and their small portion of noodles. Came here with my sister after rocking out at the Matt and Kim concert. We weren't too hungry but soup sounded really good on a chilly night. I ordered wonton noodles and my sister got the bbq pork noodles. Fast friendly service so it was nice to get in and get out. The soups contained too much MSG. My sister said her pork was super salty. My wontons were ok. This place is ok though if you're out late and in the area but special.", "rating": 3, "date": "2015-05-03"}, {"excerpts": ["Bbq pork over rice was my choice of meal, the pork was microwaved, half hot half cold,the lettuce was wilted like it was four years old. ", "My son had the duck over rice, the duck was stone cold and tasted awful. ", "My fiancé got the wonton soup, which smelled like sweaty socks and tasted just as bad. ", "Avoid this place at all costs, your stomach will thank you!!! ", "My ass won't in the morning"], "author": "Ken C.", "review": "If I could give no stars, I would. Bbq pork over rice was my choice of meal, the pork was microwaved, half hot half cold,the lettuce was wilted like it was four years old. My son had the duck over rice, the duck was stone cold and tasted awful. My fiancé got the wonton soup, which smelled like sweaty socks and tasted just as bad. Avoid this place at all costs, your stomach will thank you!!! My ass won't in the morning", "rating": 1, "date": "2015-06-19"}, {"excerpts": ["BBQ PORK & ROAST DUCK OVER BRAISED NOODLES, #23 (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=f52GIBtilK6UoarfF3qlQw) ", "- The noodles were cooked to a perfect al dente and lightly dressed with soy sauce. ", "The B.B.Q. pork was passable ", "but I've had way better. "], "author": "Steph L.", "review": "More often than not, a cheap Chinese restaurant is cheap because their dishes are heavy on the carbs and light on the protein. Not at Wonton House! Don't be fooled by their dirt-cheap prices (all their dishes are under $6) - they're very generous with their meat portions!\n\nI came here for dinner to catch up with an ex (AKA former eating partner). We're both food addicts and have a tendency to enable each other's eat-like-there's-no-tomorrow habit. (He even told me that breaking up probably added 10 years back to his life since he will no longer die from obesity!) When it came time to order, we had a hard time narrowing our choices down to 4 dishes because we wanted to try everything (old habits die hard!) Even then our server asked if we could eat all that food. (Well, *we* thought 4 dishes were reasonable for 2 people...) We got:\n\nSZECHUAN SPICY BEEF NOODLE SOUP, #13 (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=H7bBbjdubPDOKeD2k5jyng) - we added dumplings to this and were so glad we did! They were little pillows of perfection. The beef was also very tender, not to mention plentiful. The soup wasn't as spicy or flavourful as I would've liked though and the egg noodles got a little soggy later on after soaking in the soup.\n\nBBQ PORK & ROAST DUCK OVER BRAISED NOODLES, #23 (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=f52GIBtilK6UoarfF3qlQw) - The noodles were cooked to a perfect al dente and lightly dressed with soy sauce. The B.B.Q. pork was passable but I've had way better. The roast duck was really flavourful and tender though.\n\nFISH & LIVER CONGEE (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=bBYReYxQuDNTFPakvYlZhg) - so much fish and so much liver! The liver was a little overcooked but still tasted good. The congee base was OK - a little watery though.\n\nCURRY POTSTICKERS, #57 (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=tqAc_KHRIHtU9tNwW9IKeg) - LOVED these! They were filled with an ample amount of perfectly seasoned meat (http://www.yelp.com/biz_photos/syIHvIqM4ON4FkK_lHcvGA?select=gSCwB1Y0Yg-5SPDFxcfHTg). The curry flavour made dipping sauces unnecessary but it wasn't overpowering. The skin had just the right texture and wasn't too thick. Though they could've been crispier, I liked that they weren't greasy like at a lot of other restaurants.\n\nI was also very impressed with the service - super fast and friendly! My ex went to the bathroom right after we ordered and our food came out before he did! We stayed for a while just chatting after we finished eating but they never rushed us - didn't give us our bill till we asked for it and even kept refilling our teacups :)", "rating": 4, "date": "2010-05-11"}, {"excerpts": ["I used to always get the BBQ Pork Braised noodle."], "author": "Lovetoeat A.", "review": "They open late until 12am, so it's convenience if you wanna get something late at night. One of the reasons I kept coming back to this place was their chili sauce, but I came here last week, and they changed the chili sauce!! What a disappointment. I'm not sure if I wanna come here anymore. I used to always get the BBQ Pork Braised noodle.", "rating": 3, "date": "2012-02-22"}, {"excerpts": ["My friend and I shared Shrimp Dumpling Noodle Soup, Turnip Cake, and BBQ Pork & Roasted Duck over noodles. ", "The Shrimp Dumpling was okay. ", "The soup was super bland for my taste ", "so I added loads of chili sauce in order to enhance the taste. ", "The turnip cake; however, was amazing! ", "It was definitely my favorite ", "and I'm super glad it was that cheap. ", "The BBQ Pork & Roasted Duck was pretty flavorful as well even though I wish they could have added some sort of vegetables to it. ", "I'm not tripping though since it was pretty cheap and the portion was just right. ", "The order came out to be $14 something which means my friend and I paid around $7 each. ", "NOT bad since we were both satisfied AND full. ", "4 star? "], "author": "Anna L.", "review": "I went here for dinner two days ago. I was starving after class around 9pm and wanted something cheap for dinner. \n\nI didn't even notice this place until my friend showed me the day before because it was super small. I could say it's one of those hole in the wall for me. One of the positives about this place is they open till 12am, not that late but still pretty good. \n\nMy friend and I shared Shrimp Dumpling Noodle Soup, Turnip Cake, and BBQ Pork & Roasted Duck over noodles. The Shrimp Dumpling was okay. The soup was super bland for my taste so I added loads of chili sauce in order to enhance the taste. The turnip cake; however, was amazing! It was definitely my favorite and I'm super glad it was that cheap. The BBQ Pork & Roasted Duck was pretty flavorful as well even though I wish they could have added some sort of vegetables to it. I'm not tripping though since it was pretty cheap and the portion was just right. The order came out to be $14 something which means my friend and I paid around $7 each. NOT bad since we were both satisfied AND full. 4 star? Yeah, why not. \n\nAs for service, I give it a 3. I think they are a lot better than other typical Asian restaurants I've been to. Nevertheless, my tea cup was not fully washed when it came out, so there goes a star for service. And since my water and tea didn't get refill so down another star. \n\nOverall, the waitress was nice to us and I was content with my meal so the service star didn't effect that much about my opinion of this place. I would definitely come back again no doubt!", "rating": 4, "date": "2012-07-21"}, {"excerpts": ["I always get the shrimp dumpling noodle soup with the bbq pork added. "], "author": "Krissel A.", "review": "Oh Won Ton House.\n\nI am a fan indeed. I come here every so often with my friends, but when it's summer time... goodness we're here a lot. It brings back so many memories. I always crave this place randomly and it always, always, always hits the spot. Yay for instant gratification! \n\nBut the food is good and cheap. I always get the shrimp dumpling noodle soup with the bbq pork added. I will never stray from that either. \n\nI LOVE THIS PLACE! :D", "rating": 4, "date": "2011-12-21"}, {"excerpts": ["I swore I would not come back again because the bbq pork gave me diarrhea. ", "But I did come back again because I missed the spicy shanghai noodles which is my favorite item here. ", "Favorite no more! ", "because the noodles really downgraded and the meat is still not fresh!! ", "I could clearly taste the pork is at the brink of spoiling. ", "So disappointed in this place. ", "Beware of the almost spoiled food here."], "author": "Carmen L.", "review": "The last time I was here I swore I would not come back again because the bbq pork gave me diarrhea. But I did come back again because I missed the spicy shanghai noodles which is my favorite item here. Favorite no more! because the noodles really downgraded and the meat is still not fresh!! I could clearly taste the pork is at the brink of spoiling. So disappointed in this place. Beware of the almost spoiled food here.", "rating": 2, "date": "2013-07-28"}, {"excerpts": ["The picture we took was of another tasty dish: bbq pork & duck over noodles. ", "Those two dishes totaled a whopping $11. ", "Wow. ", "If you're hungry for some good food, fast service, and you're on a starving students budget (or not) ", "I recommend them.  ", "P.s. if you didn't already know duck is naturally greasy so you may want to get it over a rice dish. ", "That will absorb some of the grease."], "author": "D M.", "review": "Yummie comfort food, especially the won ton soup on a cold autumn night! The picture we took was of another tasty dish: bbq pork & duck over noodles. Those two dishes totaled a whopping $11. Wow. If you're hungry for some good food, fast service, and you're on a starving students budget (or not) I recommend them.  P.s. if you didn't already know duck is naturally greasy so you may want to get it over a rice dish. That will absorb some of the grease.", "rating": 3, "date": "2010-12-14"}, {"excerpts": ["I had the wonton noodle soup with bbq pork, and UGH!!!!! ", "i give 1 star, because the waitress seemed nice and smiled. ", "Otherwise, I paid $8 (with tip) for something really BAD. ", "The noodles were passable. ", "They soon wilted to softness though. ", "The bbq pork was stale and all clumped together, because they were just taken out of the FREEZER. ", "You can just tell. ", "Same with the wontons - stale and the meat inside was a strange mushy texture. ", "God, chinese people can be so damn cheap! ", "THROW AWAY ", "OLD FOOD! ", "How do you serve this to people and sleep at night? ", "and the soup tasted like instant ramen MSG packet soup. ", "I'm sorry, ", "but no. ", "I left half of it untouched, and said no to a take-home container. ", "I never do that. ", "Now, I'm so thirsty."], "author": "Verna L.", "review": "Uh, really?? i feel gross from eating there. I had the wonton noodle soup with bbq pork, and UGH!!!!! i give 1 star, because the waitress seemed nice and smiled. Otherwise, I paid $8 (with tip) for something really BAD. The noodles were passable. They soon wilted to softness though. The bbq pork was stale and all clumped together, because they were just taken out of the FREEZER. You can just tell. Same with the wontons - stale and the meat inside was a strange mushy texture. God, chinese people can be so damn cheap! THROW AWAY OLD FOOD! How do you serve this to people and sleep at night? and the soup tasted like instant ramen MSG packet soup. I'm sorry, but no. I left half of it untouched, and said no to a take-home container. I never do that. Now, I'm so thirsty.", "rating": 1, "date": "2012-01-26"}, {"excerpts": ["I usually come here and get either the bbq pork won-ton soup or ngow jaap won-ton soup. "], "author": "Christina B.", "review": "If you're looking for a quick, cheap eat... come here! The won-ton soup is literally only $4-5  and is pretty tasty and filling. \n\nI usually come here and get either the bbq pork won-ton soup or ngow jaap won-ton soup. Both are awesome and their chinese broccoli is delicious too. \n\nAmbiance, service, and fellow patrons are your typical Chinese restaurant fare. Bathroom is like a closet. Overall, get in, eat and get out... and you're good! I tend to like their won ton soup better here than Just Won Ton, but at Just Won Ton they have a lot more variety that tastes better too. I'm conflicted.", "rating": 4, "date": "2010-01-31"}, {"excerpts": ["Do not go to this place, I ordered a Shrimp Dumping Noodle Soup and a BBQ Pork plate, the Shrimp Dumping Noodle Soup portion was so small that I could finish eating it in 2 mins or so, and the BBQ Pork tasted funny, now my stomach is feels weird, and when I was there, no one was in there, "], "author": "David C.", "review": "Do not go to this place, I ordered a Shrimp Dumping Noodle Soup and a BBQ Pork plate, the Shrimp Dumping Noodle Soup portion was so small that I could finish eating it in 2 mins or so, and the BBQ Pork tasted funny, now my stomach is feels weird, and when I was there, no one was in there, now I know why..\n\nI repeat do not I go to this place.", "rating": 1, "date": "2009-03-09"}, {"excerpts": ["Love the simple comforts of noodle soups and chinese BBQ pork. "], "author": "Jessie M.", "review": "Love the simple comforts of noodle soups and chinese BBQ pork. their congee is pretty good---given this was the third time I've had it. \n\nparking is a challenge but well worth it when you just want fast cooking.", "rating": 5, "date": "2008-08-26"}, {"excerpts": ["I ordered the wonton noodles with BBQ pork.  ", "The pork was tasty and the wontons not bad.  ", "The broth was pretty flavorless and a little disappointing.  "], "author": "Katie M.", "review": "I came here for lunch by my friend's suggestion.  I have been craving some good wonton noodles for a while, so I was interested in trying this place out.  I ordered the wonton noodles with BBQ pork.  The pork was tasty and the wontons not bad.  The broth was pretty flavorless and a little disappointing.  My friend ordered the jook with pork and 1000 yr-old egg which was also pretty good -- maybe even better than the noodles.\n\nBottom line: Cheap prices, so-so food.  Still looking for a wonton noodle place...", "rating": 3, "date": "2007-10-01"}, {"excerpts": ["finally came here again in ages, always order my #26 bbq pork and roast duck over dried noodle. ", "the price went up $6+ and the portion got smaller with lesser roast duck and bbq pork. ", "let's get down the taste, noodle and soup still the same... but the roast duck and bbq pork taste microwaved, the ends are kinda chewy ", "so ", "yeah... ", "even tho its still cheap for a quick lunch or dinner ", "but the qty has went down..."], "author": "JessePanda C.", "review": "finally came here again in ages, always order my #26 bbq pork and roast duck over dried noodle. the price went up $6+ and the portion got smaller with lesser roast duck and bbq pork. let's get down the taste, noodle and soup still the same... but the roast duck and bbq pork taste microwaved, the ends are kinda chewy so yeah... even tho its still cheap for a quick lunch or dinner but the qty has went down...", "rating": 2, "date": "2010-07-06"}, {"excerpts": ["My favorites are the BBQ pork won ton noodles, preserved egg porridge and the turnip cakes.  ", "Definitely a staple when I used to live in SF ", "- I miss it.  ", "Great for a quick, cheap dinner - especially on those cold nights in the Sunset."], "author": "Jamie W.", "review": "Excellent cheap food!  My favorites are the BBQ pork won ton noodles, preserved egg porridge and the turnip cakes.  Definitely a staple when I used to live in SF - I miss it.  Great for a quick, cheap dinner - especially on those cold nights in the Sunset.", "rating": 4, "date": "2006-12-10"}, {"excerpts": ["Change it up a little by adding different toppings such as roasted duck, bbq pork, or beef with your egg or rice flat noodles.  ", "Good side dishes include turnip cake (lor bat go), fried curly rice noodle rolls (jin cheung fun), and a small plate of greens with oyster sauce.  ", "Man, how do you translate all these dishes into simple english?"], "author": "Dave S.", "review": "Decent and reasonably priced wonton place with staples such as wonton noodle soup and an assortment of jook.  Change it up a little by adding different toppings such as roasted duck, bbq pork, or beef with your egg or rice flat noodles.  Good side dishes include turnip cake (lor bat go), fried curly rice noodle rolls (jin cheung fun), and a small plate of greens with oyster sauce.  Man, how do you translate all these dishes into simple english?", "rating": 3, "date": "2006-02-26"}, {"excerpts": ["The Won Ton House, Cafe Restaurant (correct name?), Cafe Bakery (best BBQ pork buns in SF), are all on the same block and owned by the same family, different siblings.  ", "Good people, great service and most of all, reasonable prices."], "author": "Dick T.", "review": "When we lived in the Parkside District, we used to come here at least once a week since 1991.  Won ton, shrimp dumplings (siu gow), spicy beef over rice, steamed chicken with ginger over rice, red bean drink, curry potstickers, white radish, jook, gailan, spicy pork noodle, noodle with soy sauce (simple but delicious!), duck noodle, joong -- ALL GOOD.  My daughter can't get enough of their joong - a bit pricier than other vendors but well worth it.  We usually buy and freeze at home - dump in hot boiling water for 15-mins. and you're good to go.  They make limited amount so get there early for joong!  Fat Wong's (San Bruno) joong is huge but not as tasty as Won Ton House's and way cheaper.  Service is super fast here; when they're busy, we get up and get our own forks, extra napkins, whatever to help out.  I give it 5 stars for the cheap eats.  You definitely get your money's worth here!  The Won Ton House, Cafe Restaurant (correct name?), Cafe Bakery (best BBQ pork buns in SF), are all on the same block and owned by the same family, different siblings.  Good people, great service and most of all, reasonable prices.", "rating": 5, "date": "2007-08-12"}], "stewed pork foot": [], "spicy beef tripes": [], "pork ears": [{"excerpts": ["stir noodle with bamboo shoots and pork\njook - rice porridge\nrice roll with chinese fried donuts inside with sweet plum sauce!\nred bean drink\npork ears (if you are really chinese lol)\n"], "author": "Mindy C.", "review": "Amazing comfort food and the best price in town! This is pretty close to what you can get in a wonton house in HK. \n\nWhat to order:\ncurry pot stickers - takes about 15 minutes\npot stickers\nwonton noodle soup \nShanghai low meen - dry stir noodle with bamboo shoots and pork\njook - rice porridge\nrice roll with chinese fried donuts inside with sweet plum sauce!\nred bean drink\npork ears (if you are really chinese lol)\nsteamed gai lan(veggies) with oyster sauce \n\nThe service is good! it's always the same lady day and night, she is very attentive and nice! You always get your food fast and it tastes amazing!\n\nEnjoy!", "rating": 4, "date": "2013-06-12"}, {"excerpts": ["Along with they really great, tasty food, the service is always FAST and really good here too....since I go here so much, one of the servers knows us and even gives us a bigger portion of pork ears without the oil (thats how we always ask for it, so I can eat it with chili oil instead of sesame oil). \n\n"], "author": "Jessica h.", "review": "Mmmm...great for a typical chinese breakfast of porridge or won-ton noodle soup or late night dining of some chinese specialty snacks. I come here at least once a week (and I don't even live in SF anymore...) Everytime I come back on the weekends, I always have to head over here. When I feel like I want something a little healthier, I go for some fish or sampan porridge ($4) and when I'm just starving and carnivorous, I go for their braised beef brisket over noodles ($6). Everything is enough for two, but it's so good that I always finish my own plate. Along with a main dish, I always get the pork ears($4) (I know it sounds really gross..and I thought so too until I tried it)...yes, it's pig ears, marinated, cooked, then sliced...its semi-soft, semi-crunchy (due to the cartilage) and served cold with a drizzle of sesame oil on top. \n\nAlong with they really great, tasty food, the service is always FAST and really good here too....since I go here so much, one of the servers knows us and even gives us a bigger portion of pork ears without the oil (thats how we always ask for it, so I can eat it with chili oil instead of sesame oil). \n\nIt gets packed here on Saturday and Sunday afternoons, and also at the time when I usually go, 11 at night on weekdays.", "rating": 4, "date": "2007-05-13"}], "boiled calamari": [], "boiled vegetable pork dumpling": [], "rollled hofun with plum sauce": [], "chinese tamale": [{"excerpts": ["- Chinese tamale\n- Chinese turnip cake\n\n"], "author": "Crystal G.", "review": "One of my favorite local spots in the Sunset. It's a cool hole-in-the-wall type of place that I have been coming to since I was a little kid. The food is CHEAP (ranging between $4-6), the food is FAST (comes out within minutes), and the food is DELICIOUS!!\n\nPersonal favorites:\n- Beef stew lo mein \n- Spicy minced pork over noodle\n- Porridge (of any kind)\n- Chinese tamale\n- Chinese turnip cake\n\n*CASH ONLY", "rating": 4, "date": "2015-02-08"}, {"excerpts": ["The Chinese tamale was good and filling. ", "Service was fast."], "author": "Hiroshi K.", "review": "Roast duck porridge is really good. The porridge was well made, it had the correct flavor and consistency (i.e., they did not simply add rice to boiling water, that is rice soup, not porridge). The Chinese tamale was good and filling. Service was fast.", "rating": 4, "date": "2012-08-19"}, {"excerpts": ["I have fond memories of coming here with my parents when I was in elementary school and ordering a Chinese tamale and a hung dao bing (red bean drink). \n\n"], "author": "Eric L.", "review": "This is chinaman's comfort food and being a chinaman, it's also my hangover cure if the wallet is looking a little thin. I have fond memories of coming here with my parents when I was in elementary school and ordering a Chinese tamale and a hung dao bing (red bean drink). \n\nThroughout the years I've lost my sweet tooth and ditched the hung dao bing for their scalding hot tea. For the n00bs out there to Won Ton House, here's a tip: let the tea cool before taking that first sip no matter how thirsty you may be. \n\nI can really say I've tried everything on the menu and everything is great. For a bowl of won ton noodle soup at $3.95, they're practically giving it away!", "rating": 4, "date": "2011-01-27"}, {"excerpts": ["BUT today i went and had a Chinese tamale... ", "and as i was flipping over the spoon on the table where my napkin and chopsticks were... you'll never guess what I saw!!! ", "A freaking cockroach!!", "! ", "scared the crap out of me ", "I jumped like a dork... ", "but yeah the lady came by and took it and gave me a new setting... ", "I should have left.. ", "but I expected it from a restaurant like this.. ", "it's like Sam Woh in Chinatown.. ", "you know what you're getting."], "author": "Kristina L.", "review": "Okay Soooo.. i'll still go here again because I know what to expect when coming here. BUT today i went and had a Chinese tamale... and as i was flipping over the spoon on the table where my napkin and chopsticks were... you'll never guess what I saw!!! A freaking cockroach!!! scared the crap out of me I jumped like a dork... but yeah the lady came by and took it and gave me a new setting... I should have left.. but I expected it from a restaurant like this.. it's like Sam Woh in Chinatown.. you know what you're getting.", "rating": 1, "date": "2008-11-26"}, {"excerpts": ["CHINESE TAMALE .. $4.25. \n\n", "what the heck is a chinese tamale? ", "beats me. ", "1st time i came here few months back ", "they were all out, but lucky me got one today... ", "basically, the only difference between a chinese and a mexican tamale is that the chinese one is basically sticky rice with sausage covered in this leaf thingie ... you get to dip it in the soysauce ...  ", "i know i tried something like this before, but it had mushroom and egg which was much better .. ", "i believe it was called jjong (?!?) "], "author": "Jennifer S.", "review": "a cheap, yet classical rainy day // night joint, opened m-sun. not only because they serve won ton soup but their teas can serve ya mighty justice -- i say this because this place has the hottest tea i've tried, so don't think you're gonna be sipping tea down cause prepare for it to boil up as it goes down your throat ... DAYAM, i literally had one tear roll down my left eye, and sucky me, had my eyeliner smudged .. don't chu hate that?\n\nmy 2nd time stumbling upon won ton..\n\ni must be outta my mind ... on a GORGEOUS sunny day, seriously, i'm going to cry because the weather keeps getting better and better, of course not like LA standards..i'm SO jealous, i SO miss the 80 weather... but SF is just fine with 63 ... \n\nanyways, it was just one of those monthly cravings when i wanted a soup ... not pho, not no jji gae, but just dumpling and soup ... \n\nwon ton house is not only cheap, but the people who work there are super friendly... everything was less than $5, give or take, and last time i came, i noticed on the menu ... CHINESE TAMALE .. $4.25. \n\nwhat the heck is a chinese tamale? beats me. 1st time i came here few months back they were all out, but lucky me got one today... basically, the only difference between a chinese and a mexican tamale is that the chinese one is basically sticky rice with sausage covered in this leaf thingie ... you get to dip it in the soysauce ...  i know i tried something like this before, but it had mushroom and egg which was much better .. i believe it was called jjong (?!?) for you chinese folks ...  BAHH~\n\ni like my messican tamale better ...", "rating": 3, "date": "2008-02-11"}, {"excerpts": ["Chinese tamale (joan) was mediocre - Joy Luck in Cupertino has better joan with better flavor ingredients such as the chinese sausage and duck egg.  ", "Overall, this place isn't what it used to be 15 years ago. ", "Sadly, the quality of their wontons and dumplings have gone downhill. ", "I guess you get what you pay for and their food is cheap. ", "I will just get the jook next time."], "author": "Nancy M.", "review": "The last time I came here was 15 years ago. I decided to come to this place after meeting with friends for old time sake. Won ton noodle soup was OK. Lots of noodles and about 6-8 won tons (didn't really count) in bland broth. The shrimp in the won ton is not as fresh as it once was (think they use frozen now) and they left the intestines in the shrimp, which I unfortunately had a few crunches of its sandy debris.  However, their preserved egg and pork jook was very good - quite smooth and tasty with lots of eggs and pork and it goes great with Chinese fried donut  (yau jap gwei.) Chinese tamale (joan) was mediocre - Joy Luck in Cupertino has better joan with better flavor ingredients such as the chinese sausage and duck egg.  Overall, this place isn't what it used to be 15 years ago. Sadly, the quality of their wontons and dumplings have gone downhill. I guess you get what you pay for and their food is cheap. I will just get the jook next time.", "rating": 2, "date": "2007-11-17"}], "chinese tumip cake": [], "ice coffee or iced hong kong milk tea": [], "chinese deep fried dough": []}