{"free sodas with purchase of  or more": [], "juice": [], "ramune drink": [], "ume soda": [], "yuzu soda": [], "takoyaki": [], "grilled broccoli": [], "yaki asparagus": [{"excerpts": ["The asparagus used in the yaki asparagus was made of stringy, barely edible stems - the parts I cut off when making any asparagus dish. ", "The kicker? ", "My $6 cheesecake was a SLIVER... ", "Like half the size of most restaurants. ", "Comically small but also sad because this used to be reliable delivery. ", "In total, the order had all the trappings of a struggling restaurant fighting to keep pace. ", "Adding an extra point (from absolute worst) because they've been better."], "author": "Jon P.", "review": "OK, this was bad. I've ordered delivery 8-9 times before because the menu is interesting and the location is close. Tonight's order was gross, and was final straw in orders of diminishing quality.\n\nShrimp tempura in Firebomb roll looked and tasted like it was deep-fried three days ago. Spicy tuna, also elderly. The asparagus used in the yaki asparagus was made of stringy, barely edible stems - the parts I cut off when making any asparagus dish. The kicker? My $6 cheesecake was a SLIVER... Like half the size of most restaurants. Comically small but also sad because this used to be reliable delivery. In total, the order had all the trappings of a struggling restaurant fighting to keep pace. Adding an extra point (from absolute worst) because they've been better.", "rating": 2, "date": "2016-11-16"}], "chili edamame": [], "gyoza": [{"excerpts": ["The sushi always arrives fresh and the gyoza is just how I like it. "], "author": "Emily E.", "review": "I live right down the street so this is my go to for ordering in sushi. \n\nThe sushi always arrives fresh and the gyoza is just how I like it. I usually have to throw it in the over for a few minutes to make it crispy again.\n\nHaven't had a bad roll yet!", "rating": 5, "date": "2017-08-11"}, {"excerpts": ["Gyoza was excellent and there was a sauce to accompany each dish. \n\n"], "author": "Brian M.", "review": "Had a late evening delivery that took 60 minutes but arrived warm and fresh. Tried the fried tofu which wasn't bad, the spices really brought good flavors into it. The chicken teryaki was a little greasy but I suppose that's to be expected. Sodas are canned and a little pricy at $2. Gyoza was excellent and there was a sauce to accompany each dish. \n\nAll in all, a nice and seemingly reliable source of Chinese food with a good variety of available dishes.", "rating": 4, "date": "2015-09-02"}, {"excerpts": ["Mixed Tempura was great, Gyoza were perfect, "], "author": "Andrew L.", "review": "Ordered delivery from GrubHub. Food arrived 45 minutes earlier than GH estimated. Mixed Tempura was great, Gyoza were perfect, Crunchy Spicy Tuna was good, Agedashi Tofu was terrible. They forgot to bring me the free Seaweed Salad that I was supposed to get for spending more than $25. I'll give them a second chance and update my review.", "rating": 3, "date": "2015-09-01"}, {"excerpts": ["Also had some gyoza which was tasty and my entree came with a delicious salad that was enough to share for 2 and miso soup, yum!\n\n"], "author": "Dip G.", "review": "BEST CHICKEN TERIYAKI EVER!!! (dine in better than takeout)\n\nI've been coming to this place for months. I ordered the chicken teriyaki as take out and it was delicious, but when I dined in this evening boy was I in for a treat. \n\nThe chicken had this crispness to it and the sesame seeds and teriyaki sauce was a perfect blend. \n\nAlso had some gyoza which was tasty and my entree came with a delicious salad that was enough to share for 2 and miso soup, yum!\n\nFor sushi we had the Spice Bazar and Spicy Tuna, also delicious and highly recommended. \n\nSUSHI SHOH FO SHO!!!", "rating": 5, "date": "2011-06-27"}, {"excerpts": ["We had gomae, agidashitofu, a couple of rolls and gyoza for the z-man, albacore, spicy tuna roll.  ", "I know all pretty pedestrian stuff, but that was really what this place offers. ", "They comped us "], "author": "Aaron N.", "review": "So it was parents of an only child night with our daughter off at a party, and that means Sushi night for the Z man and parents. I've been tracking Sushi Shou's reviews and generally positive responses and close proximity to Chez Moi make a trial at is place a must. \nSo rule one of a sushi bar is just that. Sushi is to be eaten at the bar allowing for interaction with the sushi chef and observation of the product for easy scrutiny. There are 5 slightly uncomfortable high seats at the bar, all vacant when we arrived so we saddled up. One chair was backless Nd mismatched, which would normally be a negative, but it also spun around, allowing for great mid course fun by the Z-man. \n\nSo we tried to say hello to the sushi chef and his assistant. Well unfortunately Mr. Grumpalicious wanted nothing of conversation or ordering from him directly. (immediate minus one star). His Asst. Was nice nice enough, but powerless under his fearless leader to bring any sushi joy our way. \n\nThe gals waiting tables took our order, brought us Asahi on draft in mismatched but chilled glasses and generally were very nice and provided very good service. \n\nWe had gomae, agidashitofu, a couple of rolls and gyoza for the z-man, albacore, spicy tuna roll.  I know all pretty pedestrian stuff, but that was really what this place offers. They comped us a couple of pork belly yakitori skewers since it \"came with the beer special\". which were fine if slightly under seasoned. \n\nEverything was ..... Fine.  Ok leaning toward Meh\n\nWould I come back.   I would be pretty hard pressed. \n\nIf it wasn't for the close locale and the friendly service, probably would have given fewer stars.", "rating": 3, "date": "2011-01-30"}], "agedash tofu": [], "gomo ae": [], "tempura mix": [], "soft shell crab": [], "ika karrage": [], "poki": [{"excerpts": ["The only other thing that was decent was the tuna poki.\n\n"], "author": "Irene C.", "review": "We had the omakase sushi and the only fish that was fresh was the salmon.  All the other fish was a bit mushy/watery and you can tell it's frozen fish that was defrosted.  \n\nThe only other thing that was decent was the tuna poki.\n\nThe hamachi kama tasted ok but the outside was burnt black and they left the label on the lemon that came with it.  I know, it doesn't affect the food, but then come on now, take the second to take the sticker off the lemon.  The rolls were not good.  The spicy scallop was not even a tad spicy.  The yakitori was nothing special.\n\nThe service was decent but the food was definitely below par.", "rating": 2, "date": "2010-10-02"}, {"excerpts": ["I would try next time, but we had the tonkatsu, rolls, and were going to order the poki. ", "But the chef gave us a complimentary one presented attractively in a martini glass.\n", "I will be sure to upgrade my review the more I visit the place. ", "So far, I am a fan and happy that it's within walking distance."], "author": "Eric C.", "review": "Very nice place. The place has a comfortable decor and the service was friendly and responsive. There's a lot of things on the menu I would try next time, but we had the tonkatsu, rolls, and were going to order the poki. But the chef gave us a complimentary one presented attractively in a martini glass.\nI will be sure to upgrade my review the more I visit the place. So far, I am a fan and happy that it's within walking distance.", "rating": 4, "date": "2010-04-24"}, {"excerpts": ["I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. ", "It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). "], "author": "Chun Him L.", "review": "I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). It was delicious, fresh and tasty.....even my friend who doesn't like eating raw fish loves it. \n\nAfter trying that, we got another appetizer, I forgot what the name is, but is like some squid with wasabi served on the ice, it's so great. I was kinda surprised that I would be able to have these dishes I have never tried before in this new Japanese restaurant. \nWe ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\nThey are good, especially the beef tarayaki and lamb rack it was amazingly  delicious, even better than some famous steak house.\n\nTamago is wrapped in a really fancy way....I love it. I guess the Sushi Chief is an expert. Just love their stuff\n\nNow they offer delivery, its even better\nJust ordered yesterday, they delivered in 15 mins which is way faster than what they have suggested (45 mins). Nice packing ......I love it!\nThey are the best!! :P", "rating": 5, "date": "2010-07-05"}], "izumi tai appetizer": [], "salmon poki": [], "white rice": [], "brown rice": [{"excerpts": ["They dont serve brown rice with the sushi... ", "but.. the dinner was worth it.  ", "We had Chicken katsu, or was it Tonkatsu? not sure but either way it was good tasting and a good portion.  ", "The service was decent and its a nice quaint place, I may have to come back and try again."], "author": "ed c.", "review": "GF and I tried this place out as we were in the neighborhood.  The sushi didnt really impress me and there wasnt anything different then the other sushi places.  They dont serve brown rice with the sushi... but.. the dinner was worth it.  We had Chicken katsu, or was it Tonkatsu? not sure but either way it was good tasting and a good portion.  The service was decent and its a nice quaint place, I may have to come back and try again.", "rating": 3, "date": "2011-02-28"}], "seared tuna tataki": [], "truffle edamame": [{"excerpts": [":\n- Truffle Edamame", "*", "Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\n"], "author": "Angela L.", "review": "I came here for dinner for my first time and the place was packed! However, my party did not have to wait too long because the staff was quick to clean up the table after the last party left. They seated us right away.\n\nFood - 5/5\nThe menu has a lot of variety, but not too overwhelming with choices.\n\nMy table of 4 ordered ( *** = our favorites ) :\n- Truffle Edamame***\n- Miso Soup\n- Grilled Whole Calamari***\n- Tuna Poke Nacho***\n- Fire Cracker\n- Seasonal Mixed Sashimi***\n- Uni Nigiri***\n- Spicy Bazzar Roll***\n- Yoji Kanro Roll***\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\nThe fish and seafood here is so fresh especially for its price! Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\nService - 5/5\nThe service was great and the staff was super friendly! The staff gave excellent recommendations on what to order for our first time here. They also checked up on us and refilled our tea often. Even the sushi chef asked how we liked everything.\n\nOverall -\nYoji Sushi House is my new go to sushi spot in SF with the freshest quality of fish with an affordable price! I will definitely come back for more. Especially since they told us about their Happy Hour menu on Mondays-Saturdays from 4pm-6pm. ;)", "rating": 5, "date": "2018-10-27"}], "tuna poke nacho": [{"excerpts": ["**\n- Tuna Poke Nacho", "*", "**\n- Fire Cracker\n- Seasonal Mixed Sashimi", "*", "**\n", "Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\n", "Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\n"], "author": "Angela L.", "review": "I came here for dinner for my first time and the place was packed! However, my party did not have to wait too long because the staff was quick to clean up the table after the last party left. They seated us right away.\n\nFood - 5/5\nThe menu has a lot of variety, but not too overwhelming with choices.\n\nMy table of 4 ordered ( *** = our favorites ) :\n- Truffle Edamame***\n- Miso Soup\n- Grilled Whole Calamari***\n- Tuna Poke Nacho***\n- Fire Cracker\n- Seasonal Mixed Sashimi***\n- Uni Nigiri***\n- Spicy Bazzar Roll***\n- Yoji Kanro Roll***\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\nThe fish and seafood here is so fresh especially for its price! Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\nService - 5/5\nThe service was great and the staff was super friendly! The staff gave excellent recommendations on what to order for our first time here. They also checked up on us and refilled our tea often. Even the sushi chef asked how we liked everything.\n\nOverall -\nYoji Sushi House is my new go to sushi spot in SF with the freshest quality of fish with an affordable price! I will definitely come back for more. Especially since they told us about their Happy Hour menu on Mondays-Saturdays from 4pm-6pm. ;)", "rating": 5, "date": "2018-10-27"}], "sake daikon": [], "nabeyaki": [], "chicken soup": [], "beef soup": [], "tempura soup": [], "vegetable soup": [], "wakame soup": [], "tonkotsu ramen": [], "miso ramen": [], "shoyu ramen": [], "tsukemen dipping ramen": [], "cold tofu salad": [], "sunomono": [{"excerpts": ["Instead I got the seafood sunomono salad and the chirashi dinner entree.  ", "Seafood sunomono - tart, delicious, correct cucumber usage.  ", "This salad should be made with persian cucumbers or english cucumbers, not the fat, bloated american things that have tough, waxy peels and warts.  ", "The seafood presented was plentiful, wide in variety and tender in texture.  "], "author": "Christina C.", "review": "I really hate it when my girlfriends are on a diet.  Not the same diet, unfortunately, but different diets with unique twists and turns that obliterate common sense.  I especially hate it when my girlfriends are on a diet and I'm on a fat.  Yes.  A fat.  Sometimes, I just eat too healthy and work out too efficiently.  Rippling abs and sculpted toosh are just part and parcel of this fine specimen.  Hench, I like to indulge in a little fried tempura every now and again.  \n\nAlright, I tend to like a little tempura with sashimi.  It's because these are two things that I generally cannot do at home.  I do not posses the skill necessary to slice sashimi.  Instead, my knife work rivals that of Jack the Ripper.  Or a bald eagle.  And I do not posses a fry-a-lator (and please stop offering to buy me one for your birthday).  \n\nOn a sunday night that was neither too cold nor warm, I met up with Val at this place.  And since one of us was on a diet, the other one felt bad about ordering tempura.  Instead I got the seafood sunomono salad and the chirashi dinner entree.  Val got the rainbow roll, miso soup and edamame.  \n\nSeafood sunomono - tart, delicious, correct cucumber usage.  This salad should be made with persian cucumbers or english cucumbers, not the fat, bloated american things that have tough, waxy peels and warts.  The seafood presented was plentiful, wide in variety and tender in texture.  It was $5.\n\nChirashi dinner - came with soup.  It had lots of fish.  I've started this stupid habit of eating before I go out for food.  I will eat an orange, a pear, a bell pepper.  And a liter of water.  Which means that when I arrived for dinner, I was not exactly hungry anymore.  The chirashi was no YuZen.  But the serving was large.  The fish was wide in variety.  There was a lot of tamago.  And the fish was sliced rather thick.  Sashimi style.  I brought it home for dinner the next day.  It was $14.  \n\nThe place did a lot more business in delivery, with many black-clad men scurrying in and out with plastic bags.  They had a plentiful yakitori menu but I was too unhungry to try it.", "rating": 3, "date": "2011-01-24"}], "sunomono seafood": [], "tuna poke": [{"excerpts": ["**\n- Tuna Poke Nacho", "*", "**\n- Fire Cracker\n- Seasonal Mixed Sashimi", "*", "**\n", "Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\n", "Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\n"], "author": "Angela L.", "review": "I came here for dinner for my first time and the place was packed! However, my party did not have to wait too long because the staff was quick to clean up the table after the last party left. They seated us right away.\n\nFood - 5/5\nThe menu has a lot of variety, but not too overwhelming with choices.\n\nMy table of 4 ordered ( *** = our favorites ) :\n- Truffle Edamame***\n- Miso Soup\n- Grilled Whole Calamari***\n- Tuna Poke Nacho***\n- Fire Cracker\n- Seasonal Mixed Sashimi***\n- Uni Nigiri***\n- Spicy Bazzar Roll***\n- Yoji Kanro Roll***\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\nThe fish and seafood here is so fresh especially for its price! Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\nService - 5/5\nThe service was great and the staff was super friendly! The staff gave excellent recommendations on what to order for our first time here. They also checked up on us and refilled our tea often. Even the sushi chef asked how we liked everything.\n\nOverall -\nYoji Sushi House is my new go to sushi spot in SF with the freshest quality of fish with an affordable price! I will definitely come back for more. Especially since they told us about their Happy Hour menu on Mondays-Saturdays from 4pm-6pm. ;)", "rating": 5, "date": "2018-10-27"}], "salmon poke": [], "ramu yaki": [], "butaniku yaki": [{"excerpts": ["Hire Yaki & Butaniku Yaki \n", "My Yaki's were cold ", "(*sad face) but SO flavourful w/slice of lemon. ", "Pork Yaki has some nice stripes of flavourful fat with green onions. ", "Steak was cooked to perfection, for me, nice and rare with a brilliant char. ", "I would think that the Yaki chef knows what they are doing so "], "author": "emma g.", "review": "Just order this: Delivery \nChirashi Sushi $14\nGyu Hire Yaki $6.95 \nNatural Vegetarian Anniversary Roll $8\nButaniku Yaki $ 4.50 \nFree Edamame with purchase of $25 or more\n\nOK. you prob want to know about the food, and delivery huh?\n\nDELIVERY\nwas about 20 minutes earlier than Grub Hub predicted which was great.\n \nFOOD\nGyu Hire Yaki & Butaniku Yaki \nMy Yaki's were cold (*sad face) but SO flavourful w/slice of lemon. Pork Yaki has some nice stripes of flavourful fat with green onions. Steak was cooked to perfection, for me, nice and rare with a brilliant char. I would think that the Yaki chef knows what they are doing so all Yakis may be good.\n\nNatural Vegetarian Anniversary Roll\nThis roll tastes so fresh and so green. Asparagus, avo and tomato & cucumber. The freshness of it was what was impressive. \n\nChirashi Sushi\nSO many delicious thick pieces of chef special Sashimi. Very fresh and each fish tasted like the freshest of its variety. \nBonus at delivery Sushi Shoh....Cute driver", "rating": 4, "date": "2014-11-06"}, {"excerpts": ["You get a free butaniku yaki "], "author": "Jenny L.", "review": "10.26.10\n\nIt's NBA season.  Two big whammy games were on (Heat/Celtics, Rockets/Lakers).  But I made dinner plans a week ago.  And can't cancel.\n\nSushi Shoh to the rescue.  Their TV was off, but she turned it on to the game just for me.  BONUS POINTS!\n\nYou get a free butaniku yaki [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=tDGKgGeWYSwKfCTanrPiiA] when you buy two draft beers or sake.  What better way to watch a game than with cold draft Sapporo?  SIgn me up.  The pork was juicy, tender and fatty.  The scallion was a nice balance.\n\nSince they're known for their yakitoris, we had to order another one.  My friend wasn't adventurous enough to try the beef tongue, so we had the gyu hire yaki [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=Fm-L-phSmNlBwPunX_WZyw] instead.  It was peppery, and a bit too salty for my taste.  I like a filet mignon on a plate, not on a stick.  Next time, beef tongue!\n\nOnto the rolls.  We had the Flaming Torch [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=VmW6cirUWvSf5ofDYFMOug] and the Ha-ma Ha-ma [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=90t7_d9PTdFnqXbwOWGkCw].  I highly recommend the latter.  Baked hamachi.  Yum.  Sliced jalapeno on top.  Double yum.\n\nTotal damage: less than $50.", "rating": 4, "date": "2010-10-27"}, {"excerpts": ["Butaniku Yaki, Gyu Hire Yaki, shishito, shitake, Namajake Sumiyaki, and Tebasaki. ", "They were all good but not great in comparison to a specialized yakitori restaurant. "], "author": "Empress C.", "review": "Sushi Shoh is located in a little shopping center that people walk by on the way home from Forest Hill Station. With the exception of Chouchou and Kathy's, which has a lot of regulars, it has always been tough for the third restaurant in this five store shopping center. There was a Mexican restaurant that seemed promising but I did not have a chance to try it before Sushi Shoh took its place. \n\nOne exciting thing about Sushi Shoh is that they offer yakitori, which is lacking in the bay area, even if you count the San Jose region. So I ordered the Yakitori Moriwase (combo) and my husband ordered the Chirashi dinner. The yakitori was six skewers chef's choice and they gave us: Butaniku Yaki, Gyu Hire Yaki, shishito, shitake, Namajake Sumiyaki, and Tebasaki. They were all good but not great in comparison to a specialized yakitori restaurant. It was mentioned on the menu that they use real Japanese charcoal, which is great, because it imparts a different flavor than regular American charcoal. \n\nWe knew right away when we walked in that this was a Chinese owned and operated Japanese restaurant and that was fine by us. We eat a lot of great Japanese food, from Japanese restaurants that are owned and operated by Japanese, to others that are Japanese owned but have a lot of Chinese cooks/staff, and this would fall into the third category, Japanese restaurants owned and operated by Chinese folk. It may seem petty if you do not eat Japanese food often but there are nuances. And of course, you really have to try it before you judge. Not all Japanese owned restaurants are great and Chinese owned places medicore. One thing you will find is that Japanese places tend to have a higher grade of fish, better knife execution, better tea and being Japanese, also smaller portions and higher prices. Sushi Shoh, like other good Chinese sushi joints we have been too, had good sushi quality and nice fat pieces. Everything was creamy, fresh, and cut well enough that you did not bite into ligaments that can make the fish chewy. Someone did mention they had a lot of \"fakesushi\" on the menu and that pretty much means rolls. Rolls are generally more emphasized at Chinese owned places than Japanese ones. We also ordered a salmon skin roll which was decent as well. \n\nSo the next time we feel like some good, decently affordable sushi near our house we will come here. If we want sashimi focused places there are other Japanese joints available in the city. Someone also wrote that the decor was sparse but I found it to be pretty nice for a casual spot.", "rating": 3, "date": "2010-07-21"}], "negima": [], "hotate bacon maki": [{"excerpts": ["I especially like the spice bazaar and the hotate bacon maki! ", "Looooove the scallops so much. ", "Will definitely be eating here again."], "author": "Jeannie H.", "review": "Fresh fish is the best fish! The food here is delicious. I especially like the spice bazaar and the hotate bacon maki! Looooove the scallops so much. Will definitely be eating here again.", "rating": 5, "date": "2017-01-09"}, {"excerpts": ["For starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). ", "The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. ", "Not many places do gyutan so this is worth it if you are into that. ", "so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. ", "All were just ok, not mind blowing like I had hoped. "], "author": "Mark M.", "review": "This review is for their other menu items, not for the sushi. Hehe.. I know, what? Its a sushi restaurant?? Well, let me explain.\n\nSo this \"Japanese\" restaurant should definitely change their name (yes, it is a Chinese run restaurant not Japanese). On a sushi rating, its just ok, maybe a 5 out of 10. However, for their other dishes, I'd rate it a 9. Of course we ordered some sushi since you'd think they have great sushi since its in their name. Its good that we ordered a variety including sushi. I'll elaborate.\n\nFor starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. Not many places do gyutan so this is worth it if you are into that. We also got the ankimo appetizer, but it could be a bit fresher.\n\nOur main meal planned to be sushi so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. All were just ok, not mind blowing like I had hoped. After that tasting, we didn't expand to more of the menu.\n\nInstead, we had the dinner combos - tempura udon and a tonkatsu dinner. Now talk about a deal! The tempura was loaded with 2 shrimp and a myriad of veggies. This was like a double load at other restaurants. Plus, the tempura coating was perfect, not too heavy. Double thumbs up! My tonkatsu dinner was just as loaded. instead of just a single pork cutlet, there were 2! Definitely worth the price. From these 2 items alone, we would ultimately be back for more.\n\nParking can be a walk, but way easier than your Richmond/Sunset restaurant parking situation.\n\nTo wrap up, If you want some great Japanese food at reasonable prices, go to Sushi Shoh. For sushi however, you might want to pass.", "rating": 4, "date": "2014-04-11"}], "tebasaki": [{"excerpts": ["I ordered a sashimi plate, rock-n-roll, tebasaki, and got a free seaweed salad. ", "I had scheduled the delivery for 6PM, and they arrived right on time! ", "I was impressed, since I wasn't sure what to expect after reading some of the reviews about their delivery. \n", "The presentation was also better than expected, and the food was not bad. ", "The chicken wasn't hot anymore, but I always expect that from delivery. ", "Sashimi was good, and the Rock-N-Roll was ", "just okay "], "author": "Florence A.", "review": "I ordered from Eat 24 with a coupon code. I ordered a sashimi plate, rock-n-roll, tebasaki, and got a free seaweed salad. I had scheduled the delivery for 6PM, and they arrived right on time! I was impressed, since I wasn't sure what to expect after reading some of the reviews about their delivery. \nThe presentation was also better than expected, and the food was not bad. The chicken wasn't hot anymore, but I always expect that from delivery. Sashimi was good, and the Rock-N-Roll was just okay (I had to get something with unagi!). The seaweed salad wasn't a huge portion, but it was free so I don't mind. \nWould order again.", "rating": 4, "date": "2014-05-01"}, {"excerpts": ["Butaniku Yaki, Gyu Hire Yaki, shishito, shitake, Namajake Sumiyaki, and Tebasaki. ", "They were all good but not great in comparison to a specialized yakitori restaurant. "], "author": "Empress C.", "review": "Sushi Shoh is located in a little shopping center that people walk by on the way home from Forest Hill Station. With the exception of Chouchou and Kathy's, which has a lot of regulars, it has always been tough for the third restaurant in this five store shopping center. There was a Mexican restaurant that seemed promising but I did not have a chance to try it before Sushi Shoh took its place. \n\nOne exciting thing about Sushi Shoh is that they offer yakitori, which is lacking in the bay area, even if you count the San Jose region. So I ordered the Yakitori Moriwase (combo) and my husband ordered the Chirashi dinner. The yakitori was six skewers chef's choice and they gave us: Butaniku Yaki, Gyu Hire Yaki, shishito, shitake, Namajake Sumiyaki, and Tebasaki. They were all good but not great in comparison to a specialized yakitori restaurant. It was mentioned on the menu that they use real Japanese charcoal, which is great, because it imparts a different flavor than regular American charcoal. \n\nWe knew right away when we walked in that this was a Chinese owned and operated Japanese restaurant and that was fine by us. We eat a lot of great Japanese food, from Japanese restaurants that are owned and operated by Japanese, to others that are Japanese owned but have a lot of Chinese cooks/staff, and this would fall into the third category, Japanese restaurants owned and operated by Chinese folk. It may seem petty if you do not eat Japanese food often but there are nuances. And of course, you really have to try it before you judge. Not all Japanese owned restaurants are great and Chinese owned places medicore. One thing you will find is that Japanese places tend to have a higher grade of fish, better knife execution, better tea and being Japanese, also smaller portions and higher prices. Sushi Shoh, like other good Chinese sushi joints we have been too, had good sushi quality and nice fat pieces. Everything was creamy, fresh, and cut well enough that you did not bite into ligaments that can make the fish chewy. Someone did mention they had a lot of \"fakesushi\" on the menu and that pretty much means rolls. Rolls are generally more emphasized at Chinese owned places than Japanese ones. We also ordered a salmon skin roll which was decent as well. \n\nSo the next time we feel like some good, decently affordable sushi near our house we will come here. If we want sashimi focused places there are other Japanese joints available in the city. Someone also wrote that the decor was sparse but I found it to be pretty nice for a casual spot.", "rating": 3, "date": "2010-07-21"}], "shiitake yaki": [], "shishito": [{"excerpts": ["Shishito, grill mushroom are my favorite , but they dun have it."], "author": "Kenny C.", "review": "I used to order from this place and I was upset by the new owner( I guess) coz I dun see the people I used to see , but I am glad that the chef that in the kitchen is still here, I tried to order couple things but they don't have it like gyu hire I believe is call like that. Shishito, grill mushroom are my favorite , but they dun have it.", "rating": 4, "date": "2016-11-01"}, {"excerpts": ["Butaniku Yaki, Gyu Hire Yaki, shishito, shitake, Namajake Sumiyaki, and Tebasaki. ", "They were all good but not great in comparison to a specialized yakitori restaurant. "], "author": "Empress C.", "review": "Sushi Shoh is located in a little shopping center that people walk by on the way home from Forest Hill Station. With the exception of Chouchou and Kathy's, which has a lot of regulars, it has always been tough for the third restaurant in this five store shopping center. There was a Mexican restaurant that seemed promising but I did not have a chance to try it before Sushi Shoh took its place. \n\nOne exciting thing about Sushi Shoh is that they offer yakitori, which is lacking in the bay area, even if you count the San Jose region. So I ordered the Yakitori Moriwase (combo) and my husband ordered the Chirashi dinner. The yakitori was six skewers chef's choice and they gave us: Butaniku Yaki, Gyu Hire Yaki, shishito, shitake, Namajake Sumiyaki, and Tebasaki. They were all good but not great in comparison to a specialized yakitori restaurant. It was mentioned on the menu that they use real Japanese charcoal, which is great, because it imparts a different flavor than regular American charcoal. \n\nWe knew right away when we walked in that this was a Chinese owned and operated Japanese restaurant and that was fine by us. We eat a lot of great Japanese food, from Japanese restaurants that are owned and operated by Japanese, to others that are Japanese owned but have a lot of Chinese cooks/staff, and this would fall into the third category, Japanese restaurants owned and operated by Chinese folk. It may seem petty if you do not eat Japanese food often but there are nuances. And of course, you really have to try it before you judge. Not all Japanese owned restaurants are great and Chinese owned places medicore. One thing you will find is that Japanese places tend to have a higher grade of fish, better knife execution, better tea and being Japanese, also smaller portions and higher prices. Sushi Shoh, like other good Chinese sushi joints we have been too, had good sushi quality and nice fat pieces. Everything was creamy, fresh, and cut well enough that you did not bite into ligaments that can make the fish chewy. Someone did mention they had a lot of \"fakesushi\" on the menu and that pretty much means rolls. Rolls are generally more emphasized at Chinese owned places than Japanese ones. We also ordered a salmon skin roll which was decent as well. \n\nSo the next time we feel like some good, decently affordable sushi near our house we will come here. If we want sashimi focused places there are other Japanese joints available in the city. Someone also wrote that the decor was sparse but I found it to be pretty nice for a casual spot.", "rating": 3, "date": "2010-07-21"}], "sake no bakon yaki": [], "grilled beef short ribs": [], "grilled whole calamari": [{"excerpts": ["**\n- Miso Soup\n- Grilled Whole Calamari", "*"], "author": "Angela L.", "review": "I came here for dinner for my first time and the place was packed! However, my party did not have to wait too long because the staff was quick to clean up the table after the last party left. They seated us right away.\n\nFood - 5/5\nThe menu has a lot of variety, but not too overwhelming with choices.\n\nMy table of 4 ordered ( *** = our favorites ) :\n- Truffle Edamame***\n- Miso Soup\n- Grilled Whole Calamari***\n- Tuna Poke Nacho***\n- Fire Cracker\n- Seasonal Mixed Sashimi***\n- Uni Nigiri***\n- Spicy Bazzar Roll***\n- Yoji Kanro Roll***\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\nThe fish and seafood here is so fresh especially for its price! Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\nService - 5/5\nThe service was great and the staff was super friendly! The staff gave excellent recommendations on what to order for our first time here. They also checked up on us and refilled our tea often. Even the sushi chef asked how we liked everything.\n\nOverall -\nYoji Sushi House is my new go to sushi spot in SF with the freshest quality of fish with an affordable price! I will definitely come back for more. Especially since they told us about their Happy Hour menu on Mondays-Saturdays from 4pm-6pm. ;)", "rating": 5, "date": "2018-10-27"}], "gyutan yaki": [], "oyako katsu don": [], "chicken teriyaki don": [], "chirashi bowl": [], "salmon don": [{"excerpts": ["Would recommend the Chirachi Don or Salmon Don if you like fresh Salmon."], "author": "Brian B.", "review": "This is a super solid spot for take out or delivery. I did dine in one time here and the atmosphere was very lacking, and we were the only customers in the small restaurant, plus parking is iffy. But if you do get delivery, they are usually very fast, the order is always accurate, and the quality of the the fish is surprisingly good! Would recommend the Chirachi Don or Salmon Don if you like fresh Salmon.", "rating": 4, "date": "2018-04-23"}], "deluxe chirashi bowl": [], "house special box": [], "spicy tuna hand roll": [], "shrimp tempura hand roll": [], "unagi hand roll": [], "salmon hand roll": [], "hamachi hand roll": [], "spider hand roll": [{"excerpts": ["Personal favorites include the spider hand roll and the lion king roll. ", "After my friend had gotten a little too ambitious at the beach and ended up wet, the owners here lent her a personal heater to keep next to her so she could dry and stay warm while we eat. ", "Highly recommend"], "author": "Jake C.", "review": "The service and food here are fantastic! All three times I have eaten here the sushi was some of the best I've had and brought out timely. Personal favorites include the spider hand roll and the lion king roll. After my friend had gotten a little too ambitious at the beach and ended up wet, the owners here lent her a personal heater to keep next to her so she could dry and stay warm while we eat. Highly recommend", "rating": 5, "date": "2018-03-20"}], "california real crab roll": [], "salmon and avocado roll": [{"excerpts": ["And a salmon and avocado roll, super mediocre. ", "I had a bite of everything and threw most of it out. ", "The salad that comes with the dinner special might be ok too, I got bored of eating totally subpar food so that's in the fridge. ", "meh."], "author": "Sara D.", "review": "Got delivery from eat24. Had to order $20 worth, the only thing worth eating was the miso soup. Got the pork katsu dinner special, huge portion. came with buncha rice and broccoli and carrots. The pork itself was terrible. Too much batter, dry meat, not any real flavour. Also got a salmon nigiri, bad farmed salmon, pretty warm which is pretty icky for sushi. And a salmon and avocado roll, super mediocre. I had a bite of everything and threw most of it out. The salad that comes with the dinner special might be ok too, I got bored of eating totally subpar food so that's in the fridge. meh.", "rating": 1, "date": "2014-04-02"}, {"excerpts": ["Their salmon and avocado roll in particular is one of my favorites.  ", "Their seaweed salad is also quite good.  ", "My husband and I get take out from Sushi Shoh at least once or twice a month, and it's always delicious.  ", "We ate in the restaurant once, which was a bit odd -- slow service.  ", "But, their take-out is always on time (whether it's pick up or delivery) and very fresh.  ", "I think it's the best sushi in the West Portal area."], "author": "Kate K.", "review": "Reliably good and affordable sushi.  Their salmon and avocado roll in particular is one of my favorites.  Their seaweed salad is also quite good.  My husband and I get take out from Sushi Shoh at least once or twice a month, and it's always delicious.  We ate in the restaurant once, which was a bit odd -- slow service.  But, their take-out is always on time (whether it's pick up or delivery) and very fresh.  I think it's the best sushi in the West Portal area.", "rating": 4, "date": "2013-06-18"}], "lion king": [{"excerpts": ["Personal favorites include the spider hand roll and the lion king roll. ", "After my friend had gotten a little too ambitious at the beach and ended up wet, the owners here lent her a personal heater to keep next to her so she could dry and stay warm while we eat. ", "Highly recommend"], "author": "Jake C.", "review": "The service and food here are fantastic! All three times I have eaten here the sushi was some of the best I've had and brought out timely. Personal favorites include the spider hand roll and the lion king roll. After my friend had gotten a little too ambitious at the beach and ended up wet, the owners here lent her a personal heater to keep next to her so she could dry and stay warm while we eat. Highly recommend", "rating": 5, "date": "2018-03-20"}, {"excerpts": ["The baked salmon on top the Lion King was way overcooked, dry and hard. "], "author": "Phil J.", "review": "First let me say this has been our go to sushi delivery for over two years, and it has always been great. The prices are good, and the quality was top notch. Saba sashimi, which is generally my test of a good sushi chef - always marinated just right, and never over \"cooked\". They let you customize and add extras to rolls. We love(d) all the Makimono rolls - all creative, unique and delicious... Tonight though? Something was unmistakably different. The baked salmon on top the Lion King was way overcooked, dry and hard. The unagi was chewy. Reminiscent to a badly rolled burrito, half the fillings of literally every roll were all the way at one end and missing from the opposite. This was not the sushi I knew and loved, but something far more inferior. So, because inquiring minds must know, I called the restaurant to ask what gives - Did someone call in sick? Is there a new apprentice? Is it take your kid to work day? Unfortunately, I was informed, it was something far worse - It turns out the chef has been replaced, permanently. So there's a new chef in town, who with carelessness or inexperience has taken my go to and made it boo boo. Bad move Sushi Shoh, bad move. The is the kind of stuff that can ruin restaurants.. I wish you the best, as you've been good to me, but for now our paths must part.", "rating": 1, "date": "2016-12-12"}, {"excerpts": ["We were debating between the Salmon or the Chicken Teriyaki, but we ended having the Chicken teriyaki ( the sauce wasn't thick and gooey but perfect), Lion king sushi (it was a tad small, but about 9 pieces of them) "], "author": "Kathleen C.", "review": "I had some craving for cooked sushi on MLK Day. Not many places were opened on that day.  So I dragged my husband out for dinner.\n\nThe parking was okay for us that nite, but it was a little difficult to figure out how to cross the street without getting hit by cars going 40mph instead of the usual 25 mph.  But we eventually got across safety.\n\nOn the outside, the place looks small, and can hardly see their sign cuz no light, but it was the only place open at that street.  When we walked in, we got to pick our own seats away from the cold door. The decor was very nice, and chairs were comfortable. \n\nI'm not sure about how fresh the fresh sushi was cuz we didn't have any.  I was only craving for some cooked dishes.\n\nWe were debating between the Salmon or the Chicken Teriyaki, but we ended having the Chicken teriyaki ( the sauce wasn't thick and gooey but perfect), Lion king sushi (it was a tad small, but about 9 pieces of them) The salmon was cooked all the through, Vegetarian Evergreen roll (it didn't sound pleasing with eggplant and zucchini in the same dish, but that was the best), and also the Hamachi Kama (perfectly cooked, very juicy).  \n\nWe were filled up. cuz the teriyaki had a bowl of rice (unlimited refills! and a large plate of mixed greens for salad)  \n\nAt the end of our meal,  what thought that was weird, since we normally have mochi ice-cream or ice-cream at the end of our Sushi dinners. The server gave us half an orange sliced up.  So we ended up having the orange than having an ice-cream dessert.  Overall, the food was good, filling, and the total price is not bad.  \n\nWe will be coming back here again on my next sushi cravings", "rating": 4, "date": "2011-01-19"}, {"excerpts": ["Lion King roll is awesome, Ice cream for desert.  ", "yummmm. ", "it's ALL GREAT,  ", "Thank Sushi Shoh for ALWAYS being the best."], "author": "Steve D.", "review": "This is going to be short and sweet!!!! This place is the bomb!!!!! Love it!!!!!!! Michelle talks of the great Yakatori but I LOVE the sushi, I have had good sushi and this place is def. up in my top 10 places. And the delivery rocks - quick and great packaged food hot if suppose to be and cold if a cold type of dish, serving sizes are great. Lion King roll is awesome, Ice cream for desert.  yummmm. it's ALL GREAT,  Thank Sushi Shoh for ALWAYS being the best.", "rating": 5, "date": "2013-06-04"}, {"excerpts": ["Ordered Ankimo, Crystal Water, Lion King, and Spice Bazaar.  ", "All rolls were delicious, especially the Crystal Water...very fresh. ", "Other two were warm rolls; a tastiness that that could appeal to many flavor palates. ", "Ankimo (the APPETIZER) came last...cold..in a margarita glass served with dipping sauce by side. "], "author": "Julie O.", "review": "Sushi was delicious! However, time was not on their side.  Apparently overrun with takeout orders at 6:30 on a Tuesday night, Sushi Shoh had a difficult time filling our order of 3 rolls and one appetizer. \nOrdered Ankimo, Crystal Water, Lion King, and Spice Bazaar.  All rolls were delicious, especially the Crystal Water...very fresh. Other two were warm rolls; a tastiness that that could appeal to many flavor palates. Ankimo (the APPETIZER) came last...cold..in a margarita glass served with dipping sauce by side. Good quality but have had better. \n\nIn short; they deny you yummy menu items and substitute roll components to give you the freshest fish available; can't hate on that. Time could be an issue, but also super courteous wait staff and food makes the wait a little easier. Definitely try, apparently popular for pick up.", "rating": 3, "date": "2011-01-05"}, {"excerpts": ["The Lion King roll is by far my favorite."], "author": "T M.", "review": "This is my go-to on Grubhub when I am looking for sushi. They have wonderful rolls, and their deliveries are always on time. The Lion King roll is by far my favorite.", "rating": 5, "date": "2012-05-24"}, {"excerpts": ["I love the Lion King roll and the crunchy California roll. ", "Sooooooo good!"], "author": "Nicole S.", "review": "Delivery always on time. Probably the best sushi place that delivers. I love the Lion King roll and the crunchy California roll. Sooooooo good!", "rating": 5, "date": "2012-01-12"}, {"excerpts": ["Have you tried the Lion King roll? ", "If you haven't, you really should."], "author": "Emily W.", "review": "Super fast and fresh delivery! Sushi Shoh has saved me from standing in those 2 hour lines at other sushi places. Have you tried the Lion King roll? If you haven't, you really should.", "rating": 5, "date": "2012-06-26"}], "crunchy california": [{"excerpts": ["I love the Lion King roll and the crunchy California roll. ", "Sooooooo good!"], "author": "Nicole S.", "review": "Delivery always on time. Probably the best sushi place that delivers. I love the Lion King roll and the crunchy California roll. Sooooooo good!", "rating": 5, "date": "2012-01-12"}], "crunchy spicy tuna": [{"excerpts": ["Crunchy Spicy Tuna was good, Agedashi Tofu was terrible. ", "They forgot to bring me the free Seaweed Salad that I was supposed to get for spending more than $25. ", "I'll give them a second chance and update my review."], "author": "Andrew L.", "review": "Ordered delivery from GrubHub. Food arrived 45 minutes earlier than GH estimated. Mixed Tempura was great, Gyoza were perfect, Crunchy Spicy Tuna was good, Agedashi Tofu was terrible. They forgot to bring me the free Seaweed Salad that I was supposed to get for spending more than $25. I'll give them a second chance and update my review.", "rating": 3, "date": "2015-09-01"}, {"excerpts": ["I ordered the crunchy spicy tuna and spice bazaar rolls.  ", "The rolls were okay but pretty soggy and not crunchy.  ", "For this price, I won't order delivery again.  ", "I will give them one more chance to see how the food is at dine in."], "author": "C L.", "review": "This order is for delivery.  I ordered the crunchy spicy tuna and spice bazaar rolls.  The rolls were okay but pretty soggy and not crunchy.  For this price, I won't order delivery again.  I will give them one more chance to see how the food is at dine in.", "rating": 3, "date": "2011-03-16"}], "negihama": [], "rocknroll": [], "unakyu": [], "ers roll": [], "philadelphia": [], "rainbow": [{"excerpts": ["Ordered the shrimp tempura roll, spicy tuna roll, and rainbow roll, and got a free order of edamame. ", "Took about 45-50 min for the delivery to arrive. ", "Everything was decent, nothing offensively bad but nothing mindblowing. ", "About what you'd expect for delivery sushi at this price"], "author": "Lucas V.", "review": "Was staying at a friend's place in the area and wanted some delivery. Wouldn't usually go for delivery sushi but the reviews seemed good enough. Ordered the shrimp tempura roll, spicy tuna roll, and rainbow roll, and got a free order of edamame. Took about 45-50 min for the delivery to arrive. Everything was decent, nothing offensively bad but nothing mindblowing. About what you'd expect for delivery sushi at this price", "rating": 3, "date": "2014-05-20"}, {"excerpts": ["Val got the rainbow roll, miso soup and edamame.  \n\n"], "author": "Christina C.", "review": "I really hate it when my girlfriends are on a diet.  Not the same diet, unfortunately, but different diets with unique twists and turns that obliterate common sense.  I especially hate it when my girlfriends are on a diet and I'm on a fat.  Yes.  A fat.  Sometimes, I just eat too healthy and work out too efficiently.  Rippling abs and sculpted toosh are just part and parcel of this fine specimen.  Hench, I like to indulge in a little fried tempura every now and again.  \n\nAlright, I tend to like a little tempura with sashimi.  It's because these are two things that I generally cannot do at home.  I do not posses the skill necessary to slice sashimi.  Instead, my knife work rivals that of Jack the Ripper.  Or a bald eagle.  And I do not posses a fry-a-lator (and please stop offering to buy me one for your birthday).  \n\nOn a sunday night that was neither too cold nor warm, I met up with Val at this place.  And since one of us was on a diet, the other one felt bad about ordering tempura.  Instead I got the seafood sunomono salad and the chirashi dinner entree.  Val got the rainbow roll, miso soup and edamame.  \n\nSeafood sunomono - tart, delicious, correct cucumber usage.  This salad should be made with persian cucumbers or english cucumbers, not the fat, bloated american things that have tough, waxy peels and warts.  The seafood presented was plentiful, wide in variety and tender in texture.  It was $5.\n\nChirashi dinner - came with soup.  It had lots of fish.  I've started this stupid habit of eating before I go out for food.  I will eat an orange, a pear, a bell pepper.  And a liter of water.  Which means that when I arrived for dinner, I was not exactly hungry anymore.  The chirashi was no YuZen.  But the serving was large.  The fish was wide in variety.  There was a lot of tamago.  And the fish was sliced rather thick.  Sashimi style.  I brought it home for dinner the next day.  It was $14.  \n\nThe place did a lot more business in delivery, with many black-clad men scurrying in and out with plastic bags.  They had a plentiful yakitori menu but I was too unhungry to try it.", "rating": 3, "date": "2011-01-24"}], "tekka": [{"excerpts": ["I hope that as a new restaurant they are working out their kinks and that when I try them again the rice will have improved but for now I'd rather wait outside Tekka or Okina for my sushi."], "author": "Jennifer T.", "review": "I want very much to like this restaurant: it's conveniently located down the street from my apartment, the decor is modern and fashionable and the service is very friendly. My boyfriend and I stopped in for a  quick bite before a movie and ended up waiting over an hour for one sashimi combi, one unagi nigiri and two rolls. We inquired about the order after we noticed that tables seated after us had already been served their food and the waitress apologized and promised to bring out the order quickly. The sushi rice was completely overcooked, soggy, condensed mush although the sashimi was fresh and tasted just fine. I hope that as a new restaurant they are working out their kinks and that when I try them again the rice will have improved but for now I'd rather wait outside Tekka or Okina for my sushi.", "rating": 3, "date": "2010-05-12"}], "agarlic roll": [], "tuna and avocado roll": [], "snow baked": [], "yoji signature handroll": [], "sushi shoh combo": [], "veggie sushi combo": [], "albacore tataki sashimi  pieces": [], "sashimi omakase for two": [], "sashimi omakase for four": [{"excerpts": ["I always ordered the \"Sashimi Omakase for Four\" and two orders of sushi rice (just for me).  ", "Their sushi rolls are also amazing and fresh.  ", "Best in San Francisco!!!"], "author": "Jack M.", "review": "This is the first time I've had sashimi that taste like high quality fish!  I've ordered food from them via GrubHub a few times now and I am amazed with the quality of sushi and sashimi delivered to my home.  I always ordered the \"Sashimi Omakase for Four\" and two orders of sushi rice (just for me).  Their sushi rolls are also amazing and fresh.  Best in San Francisco!!!", "rating": 5, "date": "2013-01-14"}], "sushi sashimi combo": [], "deluxe combo for two": [], "mixed pc sashimi": [], "seasonal  pcs": [], "deluxe toro bowl": [], "maguro": [{"excerpts": ["Had a salmon, ikura, sweet shrimp, and maguro nigiri! ", "All tasted fantastic! ", "Japanese approved:", "P \n", "Oh! ", "Gyu-tan(cow tongue) yakitori is great, too! \n", "Also, i liked friendly servers:)\n", "I'll be back soon:)"], "author": "Mii L.", "review": "Had a salmon, ikura, sweet shrimp, and maguro nigiri! All tasted fantastic! Japanese approved:P \nOh! Gyu-tan(cow tongue) yakitori is great, too! \nAlso, i liked friendly servers:)\nI'll be back soon:)", "rating": 4, "date": "2012-11-30"}, {"excerpts": ["Started my sashimi off with the maguro. ", "Immediately had to spit it back out into a napkin because it was RANCID. ", "WTF?", "? ", "I picked the remaining pieces of maguro up with my chopsticks and they STUNK. ", "How in the HELL could TWO guys with no other customers in the house cut and pack up and sell me fish that was clearly TOO OLD and NOT REFRIGERATED PROPERLY?? ", "I HAVE NEVER HAD AN EXPERIENCE LIKE THIS IN OVER FORTY YEARS OF EATING SUSHI/SASHIMI. ", "I carefully picked through the rest of my sashimi and it was just the maguro that was bad. ", "None of it was very flavorful but it was acceptable. ", "Won't be going back, needless to say."], "author": "C. S.", "review": "Driving by yesterday in the neighborhood, saw this little place and the \"open\" sign, pulled over to get a sashimi combo to go.\n\nServer/waitress who greeted me, very nice. No other customers in the place. Stood there while two guys prepared my dinner; neither one of them could have bothered to look up and acknowledge me even though it's a tiny place and there were no other customers. \n\nNice lady sitting at the end of the counter thanked me when I was handed my order/bag and I paid my check for $25. Tipped $2 for service.\n\nDrank the miso soup and it was good. Ate the green dinner salad next and it was good. Started my sashimi off with the maguro. Immediately had to spit it back out into a napkin because it was RANCID. WTF?? I picked the remaining pieces of maguro up with my chopsticks and they STUNK. How in the HELL could TWO guys with no other customers in the house cut and pack up and sell me fish that was clearly TOO OLD and NOT REFRIGERATED PROPERLY?? I HAVE NEVER HAD AN EXPERIENCE LIKE THIS IN OVER FORTY YEARS OF EATING SUSHI/SASHIMI. EVER.\n\nI carefully picked through the rest of my sashimi and it was just the maguro that was bad. None of it was very flavorful but it was acceptable. Won't be going back, needless to say.", "rating": 2, "date": "2015-08-17"}, {"excerpts": ["so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. ", "All were just ok, not mind blowing like I had hoped. "], "author": "Mark M.", "review": "This review is for their other menu items, not for the sushi. Hehe.. I know, what? Its a sushi restaurant?? Well, let me explain.\n\nSo this \"Japanese\" restaurant should definitely change their name (yes, it is a Chinese run restaurant not Japanese). On a sushi rating, its just ok, maybe a 5 out of 10. However, for their other dishes, I'd rate it a 9. Of course we ordered some sushi since you'd think they have great sushi since its in their name. Its good that we ordered a variety including sushi. I'll elaborate.\n\nFor starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. Not many places do gyutan so this is worth it if you are into that. We also got the ankimo appetizer, but it could be a bit fresher.\n\nOur main meal planned to be sushi so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. All were just ok, not mind blowing like I had hoped. After that tasting, we didn't expand to more of the menu.\n\nInstead, we had the dinner combos - tempura udon and a tonkatsu dinner. Now talk about a deal! The tempura was loaded with 2 shrimp and a myriad of veggies. This was like a double load at other restaurants. Plus, the tempura coating was perfect, not too heavy. Double thumbs up! My tonkatsu dinner was just as loaded. instead of just a single pork cutlet, there were 2! Definitely worth the price. From these 2 items alone, we would ultimately be back for more.\n\nParking can be a walk, but way easier than your Richmond/Sunset restaurant parking situation.\n\nTo wrap up, If you want some great Japanese food at reasonable prices, go to Sushi Shoh. For sushi however, you might want to pass.", "rating": 4, "date": "2014-04-11"}], "hamachi": [{"excerpts": ["Hamachi was fine.   ", "Rolls are large but again, the fish or lack of fish flavor is hidden under all the sauces."], "author": "Steinbeck H.", "review": "The folks are all nice enough but the fish is very mediocre.  If you want value Japanese this is fine.  If you want excellent sushi-  not so much.   Scallop nigiri tasted more of water (from freezer) as opposed to scallop.  Rice was no seasoned and had barely any taste of vinegar.  Hamachi was fine.   Rolls are large but again, the fish or lack of fish flavor is hidden under all the sauces.", "rating": 2, "date": "2018-05-18"}, {"excerpts": ["Also the hamachi and tuna nigiris. "], "author": "Stacey M.", "review": "This review is for delivery. I have to admit that this place is one of the best for sushi delivery. I was hesitant at first esp with the prior Yelp reviews about delivery service but I still went ahead and did it anyway. And I'm glad I did! Ordered the lemon drop, mango sp and spicy scallop rolls. Also the hamachi and tuna nigiris. We even got a spicy tuna roll for free! It was all delicious and soooo yummy! Everything arrived on time and was so fresh! Will definitely order delivery again!", "rating": 5, "date": "2017-06-06"}, {"excerpts": ["We ordered fresh hamachi, yakatori pork belly and tongue. ", "The service was also very good and attentive. ", "I loved being able to sit down and enjoy a good meal without feeling like we were rushed."], "author": "Serena L.", "review": "Loved the yakatori here! everything is fresh and very tasty. I love local small restaurants where its obvious if you dine enough, they'll remember you and your family by name. \n\nWe ordered fresh hamachi, yakatori pork belly and tongue. The service was also very good and attentive. I loved being able to sit down and enjoy a good meal without feeling like we were rushed.", "rating": 5, "date": "2013-06-10"}, {"excerpts": ["so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. ", "All were just ok, not mind blowing like I had hoped. "], "author": "Mark M.", "review": "This review is for their other menu items, not for the sushi. Hehe.. I know, what? Its a sushi restaurant?? Well, let me explain.\n\nSo this \"Japanese\" restaurant should definitely change their name (yes, it is a Chinese run restaurant not Japanese). On a sushi rating, its just ok, maybe a 5 out of 10. However, for their other dishes, I'd rate it a 9. Of course we ordered some sushi since you'd think they have great sushi since its in their name. Its good that we ordered a variety including sushi. I'll elaborate.\n\nFor starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. Not many places do gyutan so this is worth it if you are into that. We also got the ankimo appetizer, but it could be a bit fresher.\n\nOur main meal planned to be sushi so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. All were just ok, not mind blowing like I had hoped. After that tasting, we didn't expand to more of the menu.\n\nInstead, we had the dinner combos - tempura udon and a tonkatsu dinner. Now talk about a deal! The tempura was loaded with 2 shrimp and a myriad of veggies. This was like a double load at other restaurants. Plus, the tempura coating was perfect, not too heavy. Double thumbs up! My tonkatsu dinner was just as loaded. instead of just a single pork cutlet, there were 2! Definitely worth the price. From these 2 items alone, we would ultimately be back for more.\n\nParking can be a walk, but way easier than your Richmond/Sunset restaurant parking situation.\n\nTo wrap up, If you want some great Japanese food at reasonable prices, go to Sushi Shoh. For sushi however, you might want to pass.", "rating": 4, "date": "2014-04-11"}, {"excerpts": ["I also enjoyed the spicy hamachi roll I ordered, especially the sushi rice and the amount of vinegar taste coming from it.\n\n"], "author": "H K.", "review": "I finally came by this restaurant earlier this week about wanting to check it out for some time.  I've driven by a few times before and notice how empty it is, and therefore there was some hesitation.  However, after visiting there I realize they probably do much of their business as take out or delivery.\n\nFor $22 they serve a pretty good 15-piece sashimi dinner combo with rice and miso soup.  Their sushi selection is fairly ordinary and they taste pretty fresh.  I also enjoyed the spicy hamachi roll I ordered, especially the sushi rice and the amount of vinegar taste coming from it.\n\nThe young lady who was servicing the tables was pretty attentive and smiling also once you settle into the table.", "rating": 4, "date": "2013-07-18"}, {"excerpts": ["Baked hamachi.  ", "Yum.  ", "Sliced jalapeno on top.  "], "author": "Jenny L.", "review": "10.26.10\n\nIt's NBA season.  Two big whammy games were on (Heat/Celtics, Rockets/Lakers).  But I made dinner plans a week ago.  And can't cancel.\n\nSushi Shoh to the rescue.  Their TV was off, but she turned it on to the game just for me.  BONUS POINTS!\n\nYou get a free butaniku yaki [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=tDGKgGeWYSwKfCTanrPiiA] when you buy two draft beers or sake.  What better way to watch a game than with cold draft Sapporo?  SIgn me up.  The pork was juicy, tender and fatty.  The scallion was a nice balance.\n\nSince they're known for their yakitoris, we had to order another one.  My friend wasn't adventurous enough to try the beef tongue, so we had the gyu hire yaki [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=Fm-L-phSmNlBwPunX_WZyw] instead.  It was peppery, and a bit too salty for my taste.  I like a filet mignon on a plate, not on a stick.  Next time, beef tongue!\n\nOnto the rolls.  We had the Flaming Torch [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=VmW6cirUWvSf5ofDYFMOug] and the Ha-ma Ha-ma [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=90t7_d9PTdFnqXbwOWGkCw].  I highly recommend the latter.  Baked hamachi.  Yum.  Sliced jalapeno on top.  Double yum.\n\nTotal damage: less than $50.", "rating": 4, "date": "2010-10-27"}, {"excerpts": ["Hamachi Kama - Delicious roasted yellow tail fish. ", "I didn't use the lemon or sauce they provided. ", "Didn't feel it was necessary. "], "author": "Jonathan L.", "review": "After driving by this place for the bajillionth time, we have finally tried Sushi Shoh. It's a small restaurant hidden nearby the Forest Hill Station and is truly a gem in the neighborhood. \n\nI was pleased to find that they had tapa style dishes in addition to the \"usual\" Japanese things (e.g. rolls, teriyaki stuff, etc...). From the tapas section, we ordered:\n\n1. Agedashi Tofu - Very smooth tofu that was fried the right amount. Don't let it sit in the sauce too long or it gets a bit soggy.\n\n2. Gyu Kire Yaki - My favorite item of the item -- angus beef skewers. The meat is not tough and cooked just enough that you can tear the beef off with ease. I wish there were more than two pieces.\n\n3. Hamachi Kama - Delicious roasted yellow tail fish. I didn't use the lemon or sauce they provided. Didn't feel it was necessary. The meat next to the bone and fins are the best parts, of course. \n\nIn addition to these tapa items, we had the following:\n\n1. Chicken Teriyaki - This is a pretty great item to have in a meal by itself. The chicken skin is crispy but not burnt. The meat is juicy and the sauce is a great complement. It also comes with salad, rice, and miso soup.\n\n2. Caterpillar Roll - Tasty but pretty typical compared to other Japanese venues.\n\n3. Sashimi Omakase (for four people) - Very fresh fish! I enjoyed the salmon and tuna the most. \n\nService is great. Waitress smiles and provides a friendly atmosphere for her guest.  \n\nOverall, I'm very happy with this place. The food presentation is fantastic. I'd prefer sticking with their tapa dishes over their entrees. A very different experience for people who eat \"American Japanese\" cuisine. 4 stars.", "rating": 4, "date": "2010-05-11"}, {"excerpts": ["The hamachi kama tasted ok but the outside was burnt black ", "and they left the label on the lemon that came with it.  ", "I know, it doesn't affect the food, but then come on now, take the second to take the sticker off the lemon.  ", "The rolls were not good.  "], "author": "Irene C.", "review": "We had the omakase sushi and the only fish that was fresh was the salmon.  All the other fish was a bit mushy/watery and you can tell it's frozen fish that was defrosted.  \n\nThe only other thing that was decent was the tuna poki.\n\nThe hamachi kama tasted ok but the outside was burnt black and they left the label on the lemon that came with it.  I know, it doesn't affect the food, but then come on now, take the second to take the sticker off the lemon.  The rolls were not good.  The spicy scallop was not even a tad spicy.  The yakitori was nothing special.\n\nThe service was decent but the food was definitely below par.", "rating": 2, "date": "2010-10-02"}, {"excerpts": ["The hamachi tasted of nothing but iron-y protein. "], "author": "Michelle M.", "review": "This is NOT a place for sushi. This is a place for yakatori. The sushi is pretty terrible from the taste/texture of the rice to the quality of the fish. The hamachi tasted of nothing but iron-y protein. Edamame was even overcooked & mealy.\n\nI was ready to walk but the genius server asked if we'd like some free grilled pork? Oh Yes. I never turn down pork. But then I started to worry that it was off or something because it was free. \n\nThen it came and it was delicious. Then I took a close look at the menu and there is a good list of yakatori-they even made us chicken skin. The beef tongue was fantastic. Whole grilled squid was excellent too. The yakatori menu items were almost all perfectly grilled but the chicken skin. Not crispy enough. \n\nDont bother with sushi-let the yakatori chef in back take care of you.", "rating": 4, "date": "2013-03-20"}, {"excerpts": ["The salmon was cooked all the through, Vegetarian Evergreen roll (it didn't sound pleasing with eggplant and zucchini in the same dish, but that was the best), and also the Hamachi Kama (perfectly cooked, very juicy).  \n\n"], "author": "Kathleen C.", "review": "I had some craving for cooked sushi on MLK Day. Not many places were opened on that day.  So I dragged my husband out for dinner.\n\nThe parking was okay for us that nite, but it was a little difficult to figure out how to cross the street without getting hit by cars going 40mph instead of the usual 25 mph.  But we eventually got across safety.\n\nOn the outside, the place looks small, and can hardly see their sign cuz no light, but it was the only place open at that street.  When we walked in, we got to pick our own seats away from the cold door. The decor was very nice, and chairs were comfortable. \n\nI'm not sure about how fresh the fresh sushi was cuz we didn't have any.  I was only craving for some cooked dishes.\n\nWe were debating between the Salmon or the Chicken Teriyaki, but we ended having the Chicken teriyaki ( the sauce wasn't thick and gooey but perfect), Lion king sushi (it was a tad small, but about 9 pieces of them) The salmon was cooked all the through, Vegetarian Evergreen roll (it didn't sound pleasing with eggplant and zucchini in the same dish, but that was the best), and also the Hamachi Kama (perfectly cooked, very juicy).  \n\nWe were filled up. cuz the teriyaki had a bowl of rice (unlimited refills! and a large plate of mixed greens for salad)  \n\nAt the end of our meal,  what thought that was weird, since we normally have mochi ice-cream or ice-cream at the end of our Sushi dinners. The server gave us half an orange sliced up.  So we ended up having the orange than having an ice-cream dessert.  Overall, the food was good, filling, and the total price is not bad.  \n\nWe will be coming back here again on my next sushi cravings", "rating": 4, "date": "2011-01-19"}, {"excerpts": ["We had hamachi, hotate and snow crab nigiri.  ", "Rock n roll was delicious. ", "The highlight was the grilled hamachi collar. ", "A generous portion, grilled perfectly. ", "Juicy, tender, flavorful, and fresh. ", "I would get it again."], "author": "Candice B.", "review": "Having seen the crazy turnover  of restaurants that struggled in the same spot over the years, it's a little dubious how sushi shoh will do.  It wasn't until they started passing out advertisement in our neighborhood, when we decided to give a try because of its \"free delivery\".\n\nThe nice surprise is that you can order online. Anytime I don't have to \ndeal with a live human being, I am in bliss.  It seemed really easy: just add items to the cart, enter your credit card number, and supposedly food will arrive in 45 minutes.\n\nThe downside is that sometimes not all items on menu are available. They called us right after we placed the order and made some suggestions of substitute because they didn't have black cod or fluke nigiri.  D'oh! Still had to talk to a real person!\n\nAnd it took almost an hour for our food to come, which got us really hungry and antsy.\n\nFood was good.  We had hamachi, hotate and snow crab nigiri.  Rock n roll was delicious. Salmon skin roll and tuna roll were decent.\n\nThe highlight was the grilled hamachi collar. A generous portion, grilled perfectly. Juicy, tender, flavorful, and fresh. I would get it again.", "rating": 4, "date": "2010-08-22"}, {"excerpts": ["After perusing through the large selection of tapas, sushi, entrees and rolls, we decided on the hama hama roll (baked hamachi with gobo and spicy mayo), a spicy tuna roll, and the lobster flower.  \n\n", "I love a good spicy tuna, and Sushi Shoh did not disappoint. "], "author": "Julie S.", "review": "We've passed by Sushi Shoh a number of times now since it opened a few months ago and I've been curious to try it.  It was fairly empty when we got there, which was a little alarming, but it's probably because it just opened, it was a Sunday night, and in grand San Francisco tradition, it was DAMN cold.\n\nAfter perusing through the large selection of tapas, sushi, entrees and rolls, we decided on the hama hama roll (baked hamachi with gobo and spicy mayo), a spicy tuna roll, and the lobster flower.  \n\nWe were quite pleased with our selections.  They were each fresh,  flavorful, and pleasing to the palate.  The hama hama was perfectly crunchy and spicy, and the lobster flower had a nice balance of tuna and lobster such that neither flavor was overpowering.  I love a good spicy tuna, and Sushi Shoh did not disappoint. We were also pleasantly surprised by the free miso soup and edimame that we received before our meal - I didn't realize sushi restaurants still did this.\n\nWe ordered the fried banana and ice cream for dessert and loved it!  A word of caution: they use wasabi to stick the ice cream dish to the plate, so don't pull a Julie and curiously try some on a spoon.  That was not the best way to start dessert.  \n\nTakeaway: DO go expecting decent sushi at decent prices with great service.  Don't go expecting a wonderful ambiance and fine decor.  Sushi Shoh is a pretty standard sushi restaurant in that regard, so probably not the best first date spot.", "rating": 4, "date": "2010-06-21"}, {"excerpts": ["I ordered Hamachi Sashimi (5pcs) "], "author": "JustinE Y.", "review": "just finished my delivery dinner.\nI ordered Hamachi Sashimi (5pcs) + Chirashi Don + Sweet Gum (veggie tempura roll) \n\nPro: \ntimely. I ordered my delivery via Eat24hours. Clear and simple online order website.\nSweet Gum is delicious. I asked for special adding more avocado and tobiko on top.  Tempura veggie are fresh and crisp inside the roll.  lots of avocado and tobiko are also what I love.\n\nCon:\nLack of freshness. the salmon in chirashi is bad and chewy because the tendon or membrane?? anyway, it's hard to chew. I throw all salmon away :(\nShiso leaves are soft and saggy.  so not fresh.  \n\n\ndon't want to order any sashimi raw fish anymore.  If there is a next visit, I will only order cooked dishes.", "rating": 3, "date": "2011-04-05"}], "shiro maguro": [], "sake": [{"excerpts": ["As a salmon lover，Love their sake maki，the salmon is real fresh！！！lionking taste soooooooo good. ", "I will definitely order again."], "author": "Steven H.", "review": "I think this is the best sushi place in San Francisco. The red rocket roll is so yummy. As a salmon lover，Love their sake maki，the salmon is real fresh！！！lionking taste soooooooo good. I will definitely order again.", "rating": 5, "date": "2018-07-26"}, {"excerpts": ["They have a good selection of beer and sake to pair with the fish.  "], "author": "Ben Z.", "review": "Came here on a Friday night and it was a great experience! \n\nGot greeted instantly and sat down, ordered the dragon roll and the cherry blossom roll and a whole bunch of sashimi and everything was fresh! Small little cozy place perfect for date nights or family outings! They have a good selection of beer and sake to pair with the fish.  I was taking notes on this place all night and they have A LOT of ubereats and doordash orders as delivery drivers came by literally every 5 minutes so you can get it to go if you do not want to eat there.  \n\nParking there shouldn't be too hard to find as there are a lot of residential spots very closeby.  I definitely will be back and I will highly recommend this place for sushi!!", "rating": 5, "date": "2017-10-03"}, {"excerpts": ["For added entertainment, they have a TV and serve beer (Sapporo and Asahi on draft), sake, wine, and non-alcoholic beverages. ", "Their website has a menu."], "author": "Cathy K.", "review": "Sushi Shoh is my current favorite Japanese restaurant ~ I've had their Salmon Teriyaki dinner twice and was impressed by the portion size and quality. For $13.50 you get two generous slabs with rice and steamed vegetables with a nice crunch. On my initial visit, the teriyaki sauce came on the side which I preferred. If you want yours on the side, be sure to request it since it came on the fish on my 2nd visit. My entree also came with a salad (love their gingery dressing), miso soup, and edamame. All this food was enough for two meals! \n\nMy friend enjoyed her Unagi-don (grilled eel over rice with Japanese pickles) and another friend enjoyed the Chirashi-sushi. I tried a bite of the sashimi and it was delicious. As for dessert, the mango ice cream and NY cheesecake were hard to resist, so we indulged in those too.\n\nThe service is friendly and helpful, the ambiance comfortable to enjoy a relaxed conversation. It wasn't too busy, but I did see a bunch of orders headed out for delivery. For added entertainment, they have a TV and serve beer (Sapporo and Asahi on draft), sake, wine, and non-alcoholic beverages. Their website has a menu.", "rating": 5, "date": "2012-10-29"}, {"excerpts": ["My boyfriend is also a big fan of the Sake Nigiri."], "author": "Lauren D.", "review": "I love Sushi Shoh!  I've been here a few times (sit down and delivery) and it's been great for both of those options.  It's a nice little spot to go out for a quiet dinner near Forrest Hill station.  If you like sweet and salty, I'd recommend the Nemo roll.  It's my favorite!  My boyfriend is also a big fan of the Sake Nigiri.", "rating": 5, "date": "2016-01-11"}, {"excerpts": ["[http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=tDGKgGeWYSwKfCTanrPiiA] when you buy two draft beers or sake.  ", "What better way to watch a game than with cold draft Sapporo?  ", "SIgn me up.  ", "The pork was juicy, tender and fatty.  "], "author": "Jenny L.", "review": "10.26.10\n\nIt's NBA season.  Two big whammy games were on (Heat/Celtics, Rockets/Lakers).  But I made dinner plans a week ago.  And can't cancel.\n\nSushi Shoh to the rescue.  Their TV was off, but she turned it on to the game just for me.  BONUS POINTS!\n\nYou get a free butaniku yaki [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=tDGKgGeWYSwKfCTanrPiiA] when you buy two draft beers or sake.  What better way to watch a game than with cold draft Sapporo?  SIgn me up.  The pork was juicy, tender and fatty.  The scallion was a nice balance.\n\nSince they're known for their yakitoris, we had to order another one.  My friend wasn't adventurous enough to try the beef tongue, so we had the gyu hire yaki [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=Fm-L-phSmNlBwPunX_WZyw] instead.  It was peppery, and a bit too salty for my taste.  I like a filet mignon on a plate, not on a stick.  Next time, beef tongue!\n\nOnto the rolls.  We had the Flaming Torch [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=VmW6cirUWvSf5ofDYFMOug] and the Ha-ma Ha-ma [http://www.yelp.com/biz_photos/3cLA9tLm7zCfEpeRTAeVmw?select=90t7_d9PTdFnqXbwOWGkCw].  I highly recommend the latter.  Baked hamachi.  Yum.  Sliced jalapeno on top.  Double yum.\n\nTotal damage: less than $50.", "rating": 4, "date": "2010-10-27"}, {"excerpts": ["I would recommend it to people who have a lot of time and want to come here with friends to drink a lot of sake and chillax while they wait for their food to arrive."], "author": "Christine L.", "review": "Came here some time ago, but just getting a chance now to write the review.\n\nExtremely slow in getting my plate of a few slices of sashimi! We came here during off hours and there was practically no one here. The cuts of the fish were pretty stingy for the price. Sashimi for two is what I think they call it. Seriously? I was still hungry after my sashimi slices, so I ordered amaebi nigiri, saba nigiri and one salmon skin hand roll. Those took forever to arrive too! The quality was okay, but I've had worse elsewhere. Nice decorative interior though.\n\nI probably won't be going back there again. I would recommend it to people who have a lot of time and want to come here with friends to drink a lot of sake and chillax while they wait for their food to arrive.", "rating": 2, "date": "2010-08-18"}, {"excerpts": ["The first few times I thought it just may have been something else I ate that day because the food was so delicious, but after about 3 times ordering from here, I realized it couldn't be coincidental anymore-- particularly because this time my sake nigiri had a silvery worm underneath it. ", "I first thought it was daikon ", "but no, it was moving. ", "I know it sounds gross ", "and I should've asked for a refund ", "but I do understand mistakes happen, especially when the establishment has only been around for a little while. "], "author": "Lin L.", "review": "I've had several deliveries from this restaurant. I've gotten food poisoning every single time.\n\nThe first few times I thought it just may have been something else I ate that day because the food was so delicious, but after about 3 times ordering from here, I realized it couldn't be coincidental anymore-- particularly because this time my sake nigiri had a silvery worm underneath it. I first thought it was daikon but no, it was moving. I know it sounds gross and I should've asked for a refund but I do understand mistakes happen, especially when the establishment has only been around for a little while. Maybe they're still working things out.\n\nI don't know how to feel anymore. It sucks when something tastes really good, but makes you sick :(\n\nI probably won't be ordering from here for a while.", "rating": 1, "date": "2011-05-09"}], "tai": [], "walu": [{"excerpts": ["so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. ", "All were just ok, not mind blowing like I had hoped. "], "author": "Mark M.", "review": "This review is for their other menu items, not for the sushi. Hehe.. I know, what? Its a sushi restaurant?? Well, let me explain.\n\nSo this \"Japanese\" restaurant should definitely change their name (yes, it is a Chinese run restaurant not Japanese). On a sushi rating, its just ok, maybe a 5 out of 10. However, for their other dishes, I'd rate it a 9. Of course we ordered some sushi since you'd think they have great sushi since its in their name. Its good that we ordered a variety including sushi. I'll elaborate.\n\nFor starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. Not many places do gyutan so this is worth it if you are into that. We also got the ankimo appetizer, but it could be a bit fresher.\n\nOur main meal planned to be sushi so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. All were just ok, not mind blowing like I had hoped. After that tasting, we didn't expand to more of the menu.\n\nInstead, we had the dinner combos - tempura udon and a tonkatsu dinner. Now talk about a deal! The tempura was loaded with 2 shrimp and a myriad of veggies. This was like a double load at other restaurants. Plus, the tempura coating was perfect, not too heavy. Double thumbs up! My tonkatsu dinner was just as loaded. instead of just a single pork cutlet, there were 2! Definitely worth the price. From these 2 items alone, we would ultimately be back for more.\n\nParking can be a walk, but way easier than your Richmond/Sunset restaurant parking situation.\n\nTo wrap up, If you want some great Japanese food at reasonable prices, go to Sushi Shoh. For sushi however, you might want to pass.", "rating": 4, "date": "2014-04-11"}], "saba": [{"excerpts": ["Saba sashimi, which is generally my test of a good sushi chef - always marinated just right, and never over \"cooked\". ", "They let you customize and add extras to rolls. ", "We love(d) all the Makimono rolls - all creative, unique and delicious... ", "Tonight though? ", "Something was unmistakably different. "], "author": "Phil J.", "review": "First let me say this has been our go to sushi delivery for over two years, and it has always been great. The prices are good, and the quality was top notch. Saba sashimi, which is generally my test of a good sushi chef - always marinated just right, and never over \"cooked\". They let you customize and add extras to rolls. We love(d) all the Makimono rolls - all creative, unique and delicious... Tonight though? Something was unmistakably different. The baked salmon on top the Lion King was way overcooked, dry and hard. The unagi was chewy. Reminiscent to a badly rolled burrito, half the fillings of literally every roll were all the way at one end and missing from the opposite. This was not the sushi I knew and loved, but something far more inferior. So, because inquiring minds must know, I called the restaurant to ask what gives - Did someone call in sick? Is there a new apprentice? Is it take your kid to work day? Unfortunately, I was informed, it was something far worse - It turns out the chef has been replaced, permanently. So there's a new chef in town, who with carelessness or inexperience has taken my go to and made it boo boo. Bad move Sushi Shoh, bad move. The is the kind of stuff that can ruin restaurants.. I wish you the best, as you've been good to me, but for now our paths must part.", "rating": 1, "date": "2016-12-12"}, {"excerpts": ["so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. ", "All were just ok, not mind blowing like I had hoped. "], "author": "Mark M.", "review": "This review is for their other menu items, not for the sushi. Hehe.. I know, what? Its a sushi restaurant?? Well, let me explain.\n\nSo this \"Japanese\" restaurant should definitely change their name (yes, it is a Chinese run restaurant not Japanese). On a sushi rating, its just ok, maybe a 5 out of 10. However, for their other dishes, I'd rate it a 9. Of course we ordered some sushi since you'd think they have great sushi since its in their name. Its good that we ordered a variety including sushi. I'll elaborate.\n\nFor starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. Not many places do gyutan so this is worth it if you are into that. We also got the ankimo appetizer, but it could be a bit fresher.\n\nOur main meal planned to be sushi so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. All were just ok, not mind blowing like I had hoped. After that tasting, we didn't expand to more of the menu.\n\nInstead, we had the dinner combos - tempura udon and a tonkatsu dinner. Now talk about a deal! The tempura was loaded with 2 shrimp and a myriad of veggies. This was like a double load at other restaurants. Plus, the tempura coating was perfect, not too heavy. Double thumbs up! My tonkatsu dinner was just as loaded. instead of just a single pork cutlet, there were 2! Definitely worth the price. From these 2 items alone, we would ultimately be back for more.\n\nParking can be a walk, but way easier than your Richmond/Sunset restaurant parking situation.\n\nTo wrap up, If you want some great Japanese food at reasonable prices, go to Sushi Shoh. For sushi however, you might want to pass.", "rating": 4, "date": "2014-04-11"}, {"excerpts": ["I was still hungry after my sashimi slices, so I ordered amaebi nigiri, saba nigiri and one salmon skin hand roll. ", "Those took forever to arrive too! ", "The quality was okay, but I've had worse elsewhere. "], "author": "Christine L.", "review": "Came here some time ago, but just getting a chance now to write the review.\n\nExtremely slow in getting my plate of a few slices of sashimi! We came here during off hours and there was practically no one here. The cuts of the fish were pretty stingy for the price. Sashimi for two is what I think they call it. Seriously? I was still hungry after my sashimi slices, so I ordered amaebi nigiri, saba nigiri and one salmon skin hand roll. Those took forever to arrive too! The quality was okay, but I've had worse elsewhere. Nice decorative interior though.\n\nI probably won't be going back there again. I would recommend it to people who have a lot of time and want to come here with friends to drink a lot of sake and chillax while they wait for their food to arrive.", "rating": 2, "date": "2010-08-18"}], "smoked salmon": [], "ikura": [{"excerpts": ["Had a salmon, ikura, sweet shrimp, and maguro nigiri! ", "All tasted fantastic! ", "Japanese approved:", "P \n", "Oh! ", "Gyu-tan(cow tongue) yakitori is great, too! \n", "Also, i liked friendly servers:)\n", "I'll be back soon:)"], "author": "Mii L.", "review": "Had a salmon, ikura, sweet shrimp, and maguro nigiri! All tasted fantastic! Japanese approved:P \nOh! Gyu-tan(cow tongue) yakitori is great, too! \nAlso, i liked friendly servers:)\nI'll be back soon:)", "rating": 4, "date": "2012-11-30"}], "ika nigiri": [], "tako": [], "hotate": [{"excerpts": ["I especially like the spice bazaar and the hotate bacon maki! ", "Looooove the scallops so much. ", "Will definitely be eating here again."], "author": "Jeannie H.", "review": "Fresh fish is the best fish! The food here is delicious. I especially like the spice bazaar and the hotate bacon maki! Looooove the scallops so much. Will definitely be eating here again.", "rating": 5, "date": "2017-01-09"}, {"excerpts": ["For starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). ", "The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. ", "Not many places do gyutan so this is worth it if you are into that. ", "so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. ", "All were just ok, not mind blowing like I had hoped. "], "author": "Mark M.", "review": "This review is for their other menu items, not for the sushi. Hehe.. I know, what? Its a sushi restaurant?? Well, let me explain.\n\nSo this \"Japanese\" restaurant should definitely change their name (yes, it is a Chinese run restaurant not Japanese). On a sushi rating, its just ok, maybe a 5 out of 10. However, for their other dishes, I'd rate it a 9. Of course we ordered some sushi since you'd think they have great sushi since its in their name. Its good that we ordered a variety including sushi. I'll elaborate.\n\nFor starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. Not many places do gyutan so this is worth it if you are into that. We also got the ankimo appetizer, but it could be a bit fresher.\n\nOur main meal planned to be sushi so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. All were just ok, not mind blowing like I had hoped. After that tasting, we didn't expand to more of the menu.\n\nInstead, we had the dinner combos - tempura udon and a tonkatsu dinner. Now talk about a deal! The tempura was loaded with 2 shrimp and a myriad of veggies. This was like a double load at other restaurants. Plus, the tempura coating was perfect, not too heavy. Double thumbs up! My tonkatsu dinner was just as loaded. instead of just a single pork cutlet, there were 2! Definitely worth the price. From these 2 items alone, we would ultimately be back for more.\n\nParking can be a walk, but way easier than your Richmond/Sunset restaurant parking situation.\n\nTo wrap up, If you want some great Japanese food at reasonable prices, go to Sushi Shoh. For sushi however, you might want to pass.", "rating": 4, "date": "2014-04-11"}, {"excerpts": ["We had hamachi, hotate and snow crab nigiri.  ", "Rock n roll was delicious. ", "The highlight was the grilled hamachi collar. ", "A generous portion, grilled perfectly. ", "Juicy, tender, flavorful, and fresh. ", "I would get it again."], "author": "Candice B.", "review": "Having seen the crazy turnover  of restaurants that struggled in the same spot over the years, it's a little dubious how sushi shoh will do.  It wasn't until they started passing out advertisement in our neighborhood, when we decided to give a try because of its \"free delivery\".\n\nThe nice surprise is that you can order online. Anytime I don't have to \ndeal with a live human being, I am in bliss.  It seemed really easy: just add items to the cart, enter your credit card number, and supposedly food will arrive in 45 minutes.\n\nThe downside is that sometimes not all items on menu are available. They called us right after we placed the order and made some suggestions of substitute because they didn't have black cod or fluke nigiri.  D'oh! Still had to talk to a real person!\n\nAnd it took almost an hour for our food to come, which got us really hungry and antsy.\n\nFood was good.  We had hamachi, hotate and snow crab nigiri.  Rock n roll was delicious. Salmon skin roll and tuna roll were decent.\n\nThe highlight was the grilled hamachi collar. A generous portion, grilled perfectly. Juicy, tender, flavorful, and fresh. I would get it again.", "rating": 4, "date": "2010-08-22"}], "unagi": [{"excerpts": ["The unagi was chewy. ", "Reminiscent to a badly rolled burrito, half the fillings of literally every roll were all the way at one end and missing from the opposite. ", "This was not the sushi I knew and loved, but something far more inferior. ", "So, because inquiring minds must know, I called the restaurant to ask what gives - Did someone call in sick? ", "Is there a new apprentice? ", "Is it take your kid to work day? ", "Unfortunately, I was informed, it was something far worse - ", "It turns out the chef has been replaced, permanently. ", "So there's a new chef in town, who with carelessness or inexperience has taken my go to and made it boo boo. ", "Bad move Sushi Shoh, bad move. ", "The is the kind of stuff that can ruin restaurants.. ", "I wish you the best, as you've been good to me, but for now our paths must part."], "author": "Phil J.", "review": "First let me say this has been our go to sushi delivery for over two years, and it has always been great. The prices are good, and the quality was top notch. Saba sashimi, which is generally my test of a good sushi chef - always marinated just right, and never over \"cooked\". They let you customize and add extras to rolls. We love(d) all the Makimono rolls - all creative, unique and delicious... Tonight though? Something was unmistakably different. The baked salmon on top the Lion King was way overcooked, dry and hard. The unagi was chewy. Reminiscent to a badly rolled burrito, half the fillings of literally every roll were all the way at one end and missing from the opposite. This was not the sushi I knew and loved, but something far more inferior. So, because inquiring minds must know, I called the restaurant to ask what gives - Did someone call in sick? Is there a new apprentice? Is it take your kid to work day? Unfortunately, I was informed, it was something far worse - It turns out the chef has been replaced, permanently. So there's a new chef in town, who with carelessness or inexperience has taken my go to and made it boo boo. Bad move Sushi Shoh, bad move. The is the kind of stuff that can ruin restaurants.. I wish you the best, as you've been good to me, but for now our paths must part.", "rating": 1, "date": "2016-12-12"}, {"excerpts": ["My friend enjoyed her Unagi-don (grilled eel over rice with Japanese pickles) and another friend enjoyed the Chirashi-sushi. ", "I tried a bite of the sashimi and it was delicious. "], "author": "Cathy K.", "review": "Sushi Shoh is my current favorite Japanese restaurant ~ I've had their Salmon Teriyaki dinner twice and was impressed by the portion size and quality. For $13.50 you get two generous slabs with rice and steamed vegetables with a nice crunch. On my initial visit, the teriyaki sauce came on the side which I preferred. If you want yours on the side, be sure to request it since it came on the fish on my 2nd visit. My entree also came with a salad (love their gingery dressing), miso soup, and edamame. All this food was enough for two meals! \n\nMy friend enjoyed her Unagi-don (grilled eel over rice with Japanese pickles) and another friend enjoyed the Chirashi-sushi. I tried a bite of the sashimi and it was delicious. As for dessert, the mango ice cream and NY cheesecake were hard to resist, so we indulged in those too.\n\nThe service is friendly and helpful, the ambiance comfortable to enjoy a relaxed conversation. It wasn't too busy, but I did see a bunch of orders headed out for delivery. For added entertainment, they have a TV and serve beer (Sapporo and Asahi on draft), sake, wine, and non-alcoholic beverages. Their website has a menu.", "rating": 5, "date": "2012-10-29"}, {"excerpts": ["(I had to get something with unagi!). ", "The seaweed salad wasn't a huge portion, but it was free ", "so I don't mind. \n", "Would order again."], "author": "Florence A.", "review": "I ordered from Eat 24 with a coupon code. I ordered a sashimi plate, rock-n-roll, tebasaki, and got a free seaweed salad. I had scheduled the delivery for 6PM, and they arrived right on time! I was impressed, since I wasn't sure what to expect after reading some of the reviews about their delivery. \nThe presentation was also better than expected, and the food was not bad. The chicken wasn't hot anymore, but I always expect that from delivery. Sashimi was good, and the Rock-N-Roll was just okay (I had to get something with unagi!). The seaweed salad wasn't a huge portion, but it was free so I don't mind. \nWould order again.", "rating": 4, "date": "2014-05-01"}, {"excerpts": ["Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. ", "What the hell happened?!?! ", "We spent a lot of money on this order and now we fear for our health! ", "Our last and final order! ", "Sayonara Sushi Shoh!"], "author": "Denny L.", "review": "What happened tonight? We've ordered from here many times and tonight's order was the worst. Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. What the hell happened?!?! We spent a lot of money on this order and now we fear for our health! Our last and final order! Sayonara Sushi Shoh!", "rating": 1, "date": "2013-06-26"}, {"excerpts": ["We've ordered a couple times from S.S. and can say that their tempura, unagi-don and bentos are pretty darn good. ", "Add free delivery (for, I think $20 or more) and I'm all about this place."], "author": "Deann M.", "review": "I've never set foot in Sushi Shoh but can say something about their delivery.\n\nWe've ordered a couple times from S.S. and can say that their tempura, unagi-don and bentos are pretty darn good. Add free delivery (for, I think $20 or more) and I'm all about this place.", "rating": 4, "date": "2010-10-16"}, {"excerpts": ["My favorites are the unagi and salmon teriyaki entrees. ", "They come with miso and a salad."], "author": "Jennifer S.", "review": "Their delivery service rocks, especially if you call early. They usually arrive within 30 minutes. The dinner entrees are big portions, the sushi rolls are smaller. My favorites are the unagi and salmon teriyaki entrees. They come with miso and a salad.", "rating": 5, "date": "2014-04-25"}, {"excerpts": ["My boyfriend and I stopped in for a  quick bite before a movie and ended up waiting over an hour for one sashimi combi, one unagi nigiri and two rolls. ", "We inquired about the order after we noticed that tables seated after us had already been served their food and the waitress apologized and promised to bring out the order quickly. ", "The sushi rice was completely overcooked, soggy, condensed mush although the sashimi was fresh and tasted just fine. "], "author": "Jennifer T.", "review": "I want very much to like this restaurant: it's conveniently located down the street from my apartment, the decor is modern and fashionable and the service is very friendly. My boyfriend and I stopped in for a  quick bite before a movie and ended up waiting over an hour for one sashimi combi, one unagi nigiri and two rolls. We inquired about the order after we noticed that tables seated after us had already been served their food and the waitress apologized and promised to bring out the order quickly. The sushi rice was completely overcooked, soggy, condensed mush although the sashimi was fresh and tasted just fine. I hope that as a new restaurant they are working out their kinks and that when I try them again the rice will have improved but for now I'd rather wait outside Tekka or Okina for my sushi.", "rating": 3, "date": "2010-05-12"}], "tamago": [{"excerpts": ["Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. ", "What the hell happened?!?! ", "We spent a lot of money on this order and now we fear for our health! ", "Our last and final order! ", "Sayonara Sushi Shoh!"], "author": "Denny L.", "review": "What happened tonight? We've ordered from here many times and tonight's order was the worst. Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. What the hell happened?!?! We spent a lot of money on this order and now we fear for our health! Our last and final order! Sayonara Sushi Shoh!", "rating": 1, "date": "2013-06-26"}, {"excerpts": ["There was a lot of tamago.  ", "And the fish was sliced rather thick.  ", "Sashimi style.  ", "I brought it home for dinner the next day.  "], "author": "Christina C.", "review": "I really hate it when my girlfriends are on a diet.  Not the same diet, unfortunately, but different diets with unique twists and turns that obliterate common sense.  I especially hate it when my girlfriends are on a diet and I'm on a fat.  Yes.  A fat.  Sometimes, I just eat too healthy and work out too efficiently.  Rippling abs and sculpted toosh are just part and parcel of this fine specimen.  Hench, I like to indulge in a little fried tempura every now and again.  \n\nAlright, I tend to like a little tempura with sashimi.  It's because these are two things that I generally cannot do at home.  I do not posses the skill necessary to slice sashimi.  Instead, my knife work rivals that of Jack the Ripper.  Or a bald eagle.  And I do not posses a fry-a-lator (and please stop offering to buy me one for your birthday).  \n\nOn a sunday night that was neither too cold nor warm, I met up with Val at this place.  And since one of us was on a diet, the other one felt bad about ordering tempura.  Instead I got the seafood sunomono salad and the chirashi dinner entree.  Val got the rainbow roll, miso soup and edamame.  \n\nSeafood sunomono - tart, delicious, correct cucumber usage.  This salad should be made with persian cucumbers or english cucumbers, not the fat, bloated american things that have tough, waxy peels and warts.  The seafood presented was plentiful, wide in variety and tender in texture.  It was $5.\n\nChirashi dinner - came with soup.  It had lots of fish.  I've started this stupid habit of eating before I go out for food.  I will eat an orange, a pear, a bell pepper.  And a liter of water.  Which means that when I arrived for dinner, I was not exactly hungry anymore.  The chirashi was no YuZen.  But the serving was large.  The fish was wide in variety.  There was a lot of tamago.  And the fish was sliced rather thick.  Sashimi style.  I brought it home for dinner the next day.  It was $14.  \n\nThe place did a lot more business in delivery, with many black-clad men scurrying in and out with plastic bags.  They had a plentiful yakitori menu but I was too unhungry to try it.", "rating": 3, "date": "2011-01-24"}, {"excerpts": ["We ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\n", "Tamago is wrapped in a really fancy way....", "I love it. ", "I guess the Sushi Chief is an expert. "], "author": "Chun Him L.", "review": "I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). It was delicious, fresh and tasty.....even my friend who doesn't like eating raw fish loves it. \n\nAfter trying that, we got another appetizer, I forgot what the name is, but is like some squid with wasabi served on the ice, it's so great. I was kinda surprised that I would be able to have these dishes I have never tried before in this new Japanese restaurant. \nWe ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\nThey are good, especially the beef tarayaki and lamb rack it was amazingly  delicious, even better than some famous steak house.\n\nTamago is wrapped in a really fancy way....I love it. I guess the Sushi Chief is an expert. Just love their stuff\n\nNow they offer delivery, its even better\nJust ordered yesterday, they delivered in 15 mins which is way faster than what they have suggested (45 mins). Nice packing ......I love it!\nThey are the best!! :P", "rating": 5, "date": "2010-07-05"}], "tobiko": [{"excerpts": ["The star of the show was the Giants roll with the butterfish and tobiko... ", "It was delicious! ", "The service was decent and it helped that we had free pork skewers with our order of Sapporo. ", "Overall the food was three stars, but the service and free skewers boosted it to four stars. ", "It may not be a home run, but the restaurant is definitely ", "a must try at least once. ", "It also helped the fact that it was open later than other sushi restaurants."], "author": "Rosanna N.", "review": "My friend and I finally found time in our busy schedules to have dinner and catch up so we yelped a few places and decided to try out Sushi Shoh. We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. The deep fried spicy tuna roll was fairly scrumptious. The star of the show was the Giants roll with the butterfish and tobiko... It was delicious! The service was decent and it helped that we had free pork skewers with our order of Sapporo. Overall the food was three stars, but the service and free skewers boosted it to four stars. It may not be a home run, but the restaurant is definitely a must try at least once. It also helped the fact that it was open later than other sushi restaurants.", "rating": 4, "date": "2012-03-01"}, {"excerpts": ["I asked for special adding more avocado and tobiko on top.  ", "Tempura veggie are fresh and crisp inside the roll.  ", "lots of avocado and tobiko are also what I love.\n\n"], "author": "JustinE Y.", "review": "just finished my delivery dinner.\nI ordered Hamachi Sashimi (5pcs) + Chirashi Don + Sweet Gum (veggie tempura roll) \n\nPro: \ntimely. I ordered my delivery via Eat24hours. Clear and simple online order website.\nSweet Gum is delicious. I asked for special adding more avocado and tobiko on top.  Tempura veggie are fresh and crisp inside the roll.  lots of avocado and tobiko are also what I love.\n\nCon:\nLack of freshness. the salmon in chirashi is bad and chewy because the tendon or membrane?? anyway, it's hard to chew. I throw all salmon away :(\nShiso leaves are soft and saggy.  so not fresh.  \n\n\ndon't want to order any sashimi raw fish anymore.  If there is a next visit, I will only order cooked dishes.", "rating": 3, "date": "2011-04-05"}], "kani": [{"excerpts": ["Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. ", "What the hell happened?!?! ", "We spent a lot of money on this order and now we fear for our health! ", "Our last and final order! ", "Sayonara Sushi Shoh!"], "author": "Denny L.", "review": "What happened tonight? We've ordered from here many times and tonight's order was the worst. Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. What the hell happened?!?! We spent a lot of money on this order and now we fear for our health! Our last and final order! Sayonara Sushi Shoh!", "rating": 1, "date": "2013-06-26"}], "inari": [], "amaebi": [{"excerpts": ["I was still hungry after my sashimi slices, so I ordered amaebi nigiri, saba nigiri and one salmon skin hand roll. ", "Those took forever to arrive too! ", "The quality was okay, but I've had worse elsewhere. "], "author": "Christine L.", "review": "Came here some time ago, but just getting a chance now to write the review.\n\nExtremely slow in getting my plate of a few slices of sashimi! We came here during off hours and there was practically no one here. The cuts of the fish were pretty stingy for the price. Sashimi for two is what I think they call it. Seriously? I was still hungry after my sashimi slices, so I ordered amaebi nigiri, saba nigiri and one salmon skin hand roll. Those took forever to arrive too! The quality was okay, but I've had worse elsewhere. Nice decorative interior though.\n\nI probably won't be going back there again. I would recommend it to people who have a lot of time and want to come here with friends to drink a lot of sake and chillax while they wait for their food to arrive.", "rating": 2, "date": "2010-08-18"}], "sunazuri": [], "shime saba": [{"excerpts": ["so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. ", "All were just ok, not mind blowing like I had hoped. "], "author": "Mark M.", "review": "This review is for their other menu items, not for the sushi. Hehe.. I know, what? Its a sushi restaurant?? Well, let me explain.\n\nSo this \"Japanese\" restaurant should definitely change their name (yes, it is a Chinese run restaurant not Japanese). On a sushi rating, its just ok, maybe a 5 out of 10. However, for their other dishes, I'd rate it a 9. Of course we ordered some sushi since you'd think they have great sushi since its in their name. Its good that we ordered a variety including sushi. I'll elaborate.\n\nFor starters we had some yakitori appetizers including the gyutan (skewered beef tongue) and the hotate bacon maki (scallops with bacon wrapped around it). The gyutan was one of the best I've had here in the city, while the hotate wasn't bad too. Not many places do gyutan so this is worth it if you are into that. We also got the ankimo appetizer, but it could be a bit fresher.\n\nOur main meal planned to be sushi so we ordered the staple to judge by - maguro and hamachi, plus some others that sounded interesting like fresh hotate, walu and shime saba. All were just ok, not mind blowing like I had hoped. After that tasting, we didn't expand to more of the menu.\n\nInstead, we had the dinner combos - tempura udon and a tonkatsu dinner. Now talk about a deal! The tempura was loaded with 2 shrimp and a myriad of veggies. This was like a double load at other restaurants. Plus, the tempura coating was perfect, not too heavy. Double thumbs up! My tonkatsu dinner was just as loaded. instead of just a single pork cutlet, there were 2! Definitely worth the price. From these 2 items alone, we would ultimately be back for more.\n\nParking can be a walk, but way easier than your Richmond/Sunset restaurant parking situation.\n\nTo wrap up, If you want some great Japanese food at reasonable prices, go to Sushi Shoh. For sushi however, you might want to pass.", "rating": 4, "date": "2014-04-11"}], "scallop": [{"excerpts": ["Scallop nigiri tasted more of water (from freezer) as opposed to scallop.  ", "Rice was no seasoned and had barely any taste of vinegar.  "], "author": "Steinbeck H.", "review": "The folks are all nice enough but the fish is very mediocre.  If you want value Japanese this is fine.  If you want excellent sushi-  not so much.   Scallop nigiri tasted more of water (from freezer) as opposed to scallop.  Rice was no seasoned and had barely any taste of vinegar.  Hamachi was fine.   Rolls are large but again, the fish or lack of fish flavor is hidden under all the sauces.", "rating": 2, "date": "2018-05-18"}, {"excerpts": ["Ordered the lemon drop, mango sp and spicy scallop rolls. "], "author": "Stacey M.", "review": "This review is for delivery. I have to admit that this place is one of the best for sushi delivery. I was hesitant at first esp with the prior Yelp reviews about delivery service but I still went ahead and did it anyway. And I'm glad I did! Ordered the lemon drop, mango sp and spicy scallop rolls. Also the hamachi and tuna nigiris. We even got a spicy tuna roll for free! It was all delicious and soooo yummy! Everything arrived on time and was so fresh! Will definitely order delivery again!", "rating": 5, "date": "2017-06-06"}, {"excerpts": ["The spicy scallop was not even a tad spicy.  "], "author": "Irene C.", "review": "We had the omakase sushi and the only fish that was fresh was the salmon.  All the other fish was a bit mushy/watery and you can tell it's frozen fish that was defrosted.  \n\nThe only other thing that was decent was the tuna poki.\n\nThe hamachi kama tasted ok but the outside was burnt black and they left the label on the lemon that came with it.  I know, it doesn't affect the food, but then come on now, take the second to take the sticker off the lemon.  The rolls were not good.  The spicy scallop was not even a tad spicy.  The yakitori was nothing special.\n\nThe service was decent but the food was definitely below par.", "rating": 2, "date": "2010-10-02"}, {"excerpts": ["We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The deep fried spicy tuna roll was fairly scrumptious. ", "The deep fried spicy tuna roll was fairly scrumptious. "], "author": "Rosanna N.", "review": "My friend and I finally found time in our busy schedules to have dinner and catch up so we yelped a few places and decided to try out Sushi Shoh. We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. The deep fried spicy tuna roll was fairly scrumptious. The star of the show was the Giants roll with the butterfish and tobiko... It was delicious! The service was decent and it helped that we had free pork skewers with our order of Sapporo. Overall the food was three stars, but the service and free skewers boosted it to four stars. It may not be a home run, but the restaurant is definitely a must try at least once. It also helped the fact that it was open later than other sushi restaurants.", "rating": 4, "date": "2012-03-01"}, {"excerpts": ["Their spicy scallop is just right.\n\n"], "author": "Kylie K.", "review": "This place is a dream come true. I've been 3 times in 2 weeks - which is a lot. We aren't regulars anywhere.\n\nFirst time I ordered take out teriyaki chicken, just to be safe.  The salad was crisp with a very nice dressing.  The chicken was excellent.\n\nSecond and third time we got a combination of rolls and dinner plates (kobe beef teriyaki then tonkatsu.)  Each time the food has been excellent.  The rice is perfect.  The fish is fresh.  Their spicy scallop is just right.\n\nThe service is great.  Very nice people and very attentive waitress.  \n\nAnd oh yeah, $2 pints of Sapporo! \n\nWhile we never get a spot in the lot, we always find something on Dewey.  Worst case - keep going on Dewey, turn right on Pacheco, and then 1st right on Magellan. Park just after Sola Ave. There's a path down to the Forest Hill Muni station, which gets you very close to the restaurant.", "rating": 5, "date": "2010-05-09"}], "hon maguro": [], "otoro": [], "umi masu": [], "hamachi toro": [], "uni": [{"excerpts": ["- Uni Nigiri*", "**\n- Spicy Bazzar Roll***\n- "], "author": "Angela L.", "review": "I came here for dinner for my first time and the place was packed! However, my party did not have to wait too long because the staff was quick to clean up the table after the last party left. They seated us right away.\n\nFood - 5/5\nThe menu has a lot of variety, but not too overwhelming with choices.\n\nMy table of 4 ordered ( *** = our favorites ) :\n- Truffle Edamame***\n- Miso Soup\n- Grilled Whole Calamari***\n- Tuna Poke Nacho***\n- Fire Cracker\n- Seasonal Mixed Sashimi***\n- Uni Nigiri***\n- Spicy Bazzar Roll***\n- Yoji Kanro Roll***\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\nThe fish and seafood here is so fresh especially for its price! Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\nService - 5/5\nThe service was great and the staff was super friendly! The staff gave excellent recommendations on what to order for our first time here. They also checked up on us and refilled our tea often. Even the sushi chef asked how we liked everything.\n\nOverall -\nYoji Sushi House is my new go to sushi spot in SF with the freshest quality of fish with an affordable price! I will definitely come back for more. Especially since they told us about their Happy Hour menu on Mondays-Saturdays from 4pm-6pm. ;)", "rating": 5, "date": "2018-10-27"}, {"excerpts": ["We ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\n", "Tamago is wrapped in a really fancy way....", "I love it. ", "I guess the Sushi Chief is an expert. "], "author": "Chun Him L.", "review": "I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). It was delicious, fresh and tasty.....even my friend who doesn't like eating raw fish loves it. \n\nAfter trying that, we got another appetizer, I forgot what the name is, but is like some squid with wasabi served on the ice, it's so great. I was kinda surprised that I would be able to have these dishes I have never tried before in this new Japanese restaurant. \nWe ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\nThey are good, especially the beef tarayaki and lamb rack it was amazingly  delicious, even better than some famous steak house.\n\nTamago is wrapped in a really fancy way....I love it. I guess the Sushi Chief is an expert. Just love their stuff\n\nNow they offer delivery, its even better\nJust ordered yesterday, they delivered in 15 mins which is way faster than what they have suggested (45 mins). Nice packing ......I love it!\nThey are the best!! :P", "rating": 5, "date": "2010-07-05"}], "shiro toro": [], "kampachi": [], "spider roll": [{"excerpts": ["Had the salmon nigri, the grilled lamb, california, and spider roll.\n\n", "The salmon was fresh on the nigri, the california was good.\n"], "author": "Steph Q.", "review": "Had the salmon nigri, the grilled lamb, california, and spider roll.\n\nIt was all fairly done well.  The grilled lamb was done pretty good at a medium.  very flavorful and juicy.\nThe salmon was fresh on the nigri, the california was good.\nThe crab in the sprider was lightly breaded and was a good portion.\n\nThe server was nice and the place was very modern looking, just a odd location to find parking.  Also free edamame beans peas was a plus.\n\nwill be back!", "rating": 4, "date": "2012-09-19"}, {"excerpts": ["We ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\n", "Tamago is wrapped in a really fancy way....", "I love it. ", "I guess the Sushi Chief is an expert. "], "author": "Chun Him L.", "review": "I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). It was delicious, fresh and tasty.....even my friend who doesn't like eating raw fish loves it. \n\nAfter trying that, we got another appetizer, I forgot what the name is, but is like some squid with wasabi served on the ice, it's so great. I was kinda surprised that I would be able to have these dishes I have never tried before in this new Japanese restaurant. \nWe ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\nThey are good, especially the beef tarayaki and lamb rack it was amazingly  delicious, even better than some famous steak house.\n\nTamago is wrapped in a really fancy way....I love it. I guess the Sushi Chief is an expert. Just love their stuff\n\nNow they offer delivery, its even better\nJust ordered yesterday, they delivered in 15 mins which is way faster than what they have suggested (45 mins). Nice packing ......I love it!\nThey are the best!! :P", "rating": 5, "date": "2010-07-05"}], "tt roll": [], "dragon roll": [{"excerpts": ["Got greeted instantly and sat down, ordered the dragon roll and the cherry blossom roll and a whole bunch of sashimi and everything was fresh! ", "Small little cozy place perfect for date nights or family outings! "], "author": "Ben Z.", "review": "Came here on a Friday night and it was a great experience! \n\nGot greeted instantly and sat down, ordered the dragon roll and the cherry blossom roll and a whole bunch of sashimi and everything was fresh! Small little cozy place perfect for date nights or family outings! They have a good selection of beer and sake to pair with the fish.  I was taking notes on this place all night and they have A LOT of ubereats and doordash orders as delivery drivers came by literally every 5 minutes so you can get it to go if you do not want to eat there.  \n\nParking there shouldn't be too hard to find as there are a lot of residential spots very closeby.  I definitely will be back and I will highly recommend this place for sushi!!", "rating": 5, "date": "2017-10-03"}, {"excerpts": ["We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The deep fried spicy tuna roll was fairly scrumptious. ", "The deep fried spicy tuna roll was fairly scrumptious. "], "author": "Rosanna N.", "review": "My friend and I finally found time in our busy schedules to have dinner and catch up so we yelped a few places and decided to try out Sushi Shoh. We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. The deep fried spicy tuna roll was fairly scrumptious. The star of the show was the Giants roll with the butterfish and tobiko... It was delicious! The service was decent and it helped that we had free pork skewers with our order of Sapporo. Overall the food was three stars, but the service and free skewers boosted it to four stars. It may not be a home run, but the restaurant is definitely a must try at least once. It also helped the fact that it was open later than other sushi restaurants.", "rating": 4, "date": "2012-03-01"}, {"excerpts": ["The Dragon roll was good, but not special.  ", "We also tried a couple yakitori items.  ", "The bacon wrapped scallops you can't go wrong with.  ", "The bacon was a little soft and the scallops were not great,  but there were 6 for 7.50 so good enough.  ", "Now the great.  ", "The shiitake mushrooms were really good.  ", "Cheap,  but not at all what I expected,  and better than I would have imagined!  ", "The butaniku yakitori was listed simplyas grilled pork and scallions on a skewer, but the tender,  crispy,  salty,  lemony slices of amazingly prefect pork belly were one of the best things I have ever eaten!  ", "Maybe not on par with French laundry Oyster and pearls orthe crispy pork shank at Smith and wollensky in Chicago,  but it will be seated memory as a destination deliciousness."], "author": "Damian M.", "review": "The sashimi was just average.  The Dragon roll was good, but not special.  We also tried a couple yakitori items.  The bacon wrapped scallops you can't go wrong with.  The bacon was a little soft and the scallops were not great,  but there were 6 for 7.50 so good enough.  Now the great.  The shiitake mushrooms were really good.  Cheap,  but not at all what I expected,  and better than I would have imagined!  The butaniku yakitori was listed simplyas grilled pork and scallions on a skewer, but the tender,  crispy,  salty,  lemony slices of amazingly prefect pork belly were one of the best things I have ever eaten!  Maybe not on par with French laundry Oyster and pearls orthe crispy pork shank at Smith and wollensky in Chicago,  but it will be seated memory as a destination deliciousness.", "rating": 5, "date": "2014-03-24"}], "forty niner": [], "rainbow roll": [{"excerpts": ["Ordered the shrimp tempura roll, spicy tuna roll, and rainbow roll, and got a free order of edamame. ", "Took about 45-50 min for the delivery to arrive. ", "Everything was decent, nothing offensively bad but nothing mindblowing. ", "About what you'd expect for delivery sushi at this price"], "author": "Lucas V.", "review": "Was staying at a friend's place in the area and wanted some delivery. Wouldn't usually go for delivery sushi but the reviews seemed good enough. Ordered the shrimp tempura roll, spicy tuna roll, and rainbow roll, and got a free order of edamame. Took about 45-50 min for the delivery to arrive. Everything was decent, nothing offensively bad but nothing mindblowing. About what you'd expect for delivery sushi at this price", "rating": 3, "date": "2014-05-20"}, {"excerpts": ["Val got the rainbow roll, miso soup and edamame.  \n\n"], "author": "Christina C.", "review": "I really hate it when my girlfriends are on a diet.  Not the same diet, unfortunately, but different diets with unique twists and turns that obliterate common sense.  I especially hate it when my girlfriends are on a diet and I'm on a fat.  Yes.  A fat.  Sometimes, I just eat too healthy and work out too efficiently.  Rippling abs and sculpted toosh are just part and parcel of this fine specimen.  Hench, I like to indulge in a little fried tempura every now and again.  \n\nAlright, I tend to like a little tempura with sashimi.  It's because these are two things that I generally cannot do at home.  I do not posses the skill necessary to slice sashimi.  Instead, my knife work rivals that of Jack the Ripper.  Or a bald eagle.  And I do not posses a fry-a-lator (and please stop offering to buy me one for your birthday).  \n\nOn a sunday night that was neither too cold nor warm, I met up with Val at this place.  And since one of us was on a diet, the other one felt bad about ordering tempura.  Instead I got the seafood sunomono salad and the chirashi dinner entree.  Val got the rainbow roll, miso soup and edamame.  \n\nSeafood sunomono - tart, delicious, correct cucumber usage.  This salad should be made with persian cucumbers or english cucumbers, not the fat, bloated american things that have tough, waxy peels and warts.  The seafood presented was plentiful, wide in variety and tender in texture.  It was $5.\n\nChirashi dinner - came with soup.  It had lots of fish.  I've started this stupid habit of eating before I go out for food.  I will eat an orange, a pear, a bell pepper.  And a liter of water.  Which means that when I arrived for dinner, I was not exactly hungry anymore.  The chirashi was no YuZen.  But the serving was large.  The fish was wide in variety.  There was a lot of tamago.  And the fish was sliced rather thick.  Sashimi style.  I brought it home for dinner the next day.  It was $14.  \n\nThe place did a lot more business in delivery, with many black-clad men scurrying in and out with plastic bags.  They had a plentiful yakitori menu but I was too unhungry to try it.", "rating": 3, "date": "2011-01-24"}], "san francisco roll": [], "spicy bazaar": [], "crazy roll": [{"excerpts": ["We also order the Crazy roll, the Rainbox roll and the Rock n Roll - all really fresh, perfect temperature and carefully packaged.  ", "One of my pet peeves with sushi is when it comes to you slopped in the box and this is not the case for Sushi Shoh, they packaged my to-go order as neatly as I would expect to have for a dine in order.  ", "I'll definitely order again (but I will not use Postmates for it because we had to go on an Easter egg hunt to find our Postmate who didn't speak English and tried to pawn our order off on a neighbor -_-)"], "author": "Emma H.", "review": "These rolls are a bit pricier than your average sushi spot, but they are REALLY good.  The Lemon Drop roll is to die for and so is the Hot Night roll.  We also order the Crazy roll, the Rainbox roll and the Rock n Roll - all really fresh, perfect temperature and carefully packaged.  One of my pet peeves with sushi is when it comes to you slopped in the box and this is not the case for Sushi Shoh, they packaged my to-go order as neatly as I would expect to have for a dine in order.  I'll definitely order again (but I will not use Postmates for it because we had to go on an Easter egg hunt to find our Postmate who didn't speak English and tried to pawn our order off on a neighbor -_-)", "rating": 5, "date": "2018-01-17"}], "tiger roll": [], "ocean roll": [], "shoh good": [], "three some": [], "sunset roll": [], "golden gate": [], "hamago": [], "lemon drop": [{"excerpts": ["**\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\n"], "author": "Angela L.", "review": "I came here for dinner for my first time and the place was packed! However, my party did not have to wait too long because the staff was quick to clean up the table after the last party left. They seated us right away.\n\nFood - 5/5\nThe menu has a lot of variety, but not too overwhelming with choices.\n\nMy table of 4 ordered ( *** = our favorites ) :\n- Truffle Edamame***\n- Miso Soup\n- Grilled Whole Calamari***\n- Tuna Poke Nacho***\n- Fire Cracker\n- Seasonal Mixed Sashimi***\n- Uni Nigiri***\n- Spicy Bazzar Roll***\n- Yoji Kanro Roll***\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\nThe fish and seafood here is so fresh especially for its price! Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\nService - 5/5\nThe service was great and the staff was super friendly! The staff gave excellent recommendations on what to order for our first time here. They also checked up on us and refilled our tea often. Even the sushi chef asked how we liked everything.\n\nOverall -\nYoji Sushi House is my new go to sushi spot in SF with the freshest quality of fish with an affordable price! I will definitely come back for more. Especially since they told us about their Happy Hour menu on Mondays-Saturdays from 4pm-6pm. ;)", "rating": 5, "date": "2018-10-27"}, {"excerpts": ["The Lemon Drop roll is to die for and so is the Hot Night roll.  "], "author": "Emma H.", "review": "These rolls are a bit pricier than your average sushi spot, but they are REALLY good.  The Lemon Drop roll is to die for and so is the Hot Night roll.  We also order the Crazy roll, the Rainbox roll and the Rock n Roll - all really fresh, perfect temperature and carefully packaged.  One of my pet peeves with sushi is when it comes to you slopped in the box and this is not the case for Sushi Shoh, they packaged my to-go order as neatly as I would expect to have for a dine in order.  I'll definitely order again (but I will not use Postmates for it because we had to go on an Easter egg hunt to find our Postmate who didn't speak English and tried to pawn our order off on a neighbor -_-)", "rating": 5, "date": "2018-01-17"}, {"excerpts": ["I highly recommend the lemon drop roll and if you are feeling adventurous try the salmon skin roll."], "author": "Jesse W.", "review": "I love this place!! Every time I eat here my stomach is like \" three thumbs up!!\" All of the staff is amazing. Dorris takes great care of me and brings a surprise from the bar. Their specials are fantastic and the specialty rolls are creative and delicious!\n\nI highly recommend the lemon drop roll and if you are feeling adventurous try the salmon skin roll.", "rating": 5, "date": "2017-05-14"}, {"excerpts": ["Ordered the lemon drop, mango sp and spicy scallop rolls. "], "author": "Stacey M.", "review": "This review is for delivery. I have to admit that this place is one of the best for sushi delivery. I was hesitant at first esp with the prior Yelp reviews about delivery service but I still went ahead and did it anyway. And I'm glad I did! Ordered the lemon drop, mango sp and spicy scallop rolls. Also the hamachi and tuna nigiris. We even got a spicy tuna roll for free! It was all delicious and soooo yummy! Everything arrived on time and was so fresh! Will definitely order delivery again!", "rating": 5, "date": "2017-06-06"}], "cherry blossom": [{"excerpts": ["Got greeted instantly and sat down, ordered the dragon roll and the cherry blossom roll and a whole bunch of sashimi and everything was fresh! ", "Small little cozy place perfect for date nights or family outings! "], "author": "Ben Z.", "review": "Came here on a Friday night and it was a great experience! \n\nGot greeted instantly and sat down, ordered the dragon roll and the cherry blossom roll and a whole bunch of sashimi and everything was fresh! Small little cozy place perfect for date nights or family outings! They have a good selection of beer and sake to pair with the fish.  I was taking notes on this place all night and they have A LOT of ubereats and doordash orders as delivery drivers came by literally every 5 minutes so you can get it to go if you do not want to eat there.  \n\nParking there shouldn't be too hard to find as there are a lot of residential spots very closeby.  I definitely will be back and I will highly recommend this place for sushi!!", "rating": 5, "date": "2017-10-03"}], "treasure island roll": [], "king dragon": [], "mango special roll": [], "crunch shrimp roll": [], "crystal water makimono roll": [], "firebomb makimono roll": [], "flaming torch makimono roll": [], "giants makimono roll": [], "hama hama makimono roll": [], "lobster flower makimono roll": [], "nemo makimono roll": [], "ocean makimono roll": [], "orange melody makimono roll": [], "shoh good makimono roll": [], "snow cone": [], "spice bazaar makimono roll": [], "summer makimono roll": [], "red rocket roll": [{"excerpts": ["The red rocket roll is so yummy. "], "author": "Steven H.", "review": "I think this is the best sushi place in San Francisco. The red rocket roll is so yummy. As a salmon lover，Love their sake maki，the salmon is real fresh！！！lionking taste soooooooo good. I will definitely order again.", "rating": 5, "date": "2018-07-26"}], "flying kamikaze": [], "cache creek": [], "spicy dream": [], "toro heaven": [], "yoji kanro": [{"excerpts": ["Yoji Kanro Roll", "*"], "author": "Angela L.", "review": "I came here for dinner for my first time and the place was packed! However, my party did not have to wait too long because the staff was quick to clean up the table after the last party left. They seated us right away.\n\nFood - 5/5\nThe menu has a lot of variety, but not too overwhelming with choices.\n\nMy table of 4 ordered ( *** = our favorites ) :\n- Truffle Edamame***\n- Miso Soup\n- Grilled Whole Calamari***\n- Tuna Poke Nacho***\n- Fire Cracker\n- Seasonal Mixed Sashimi***\n- Uni Nigiri***\n- Spicy Bazzar Roll***\n- Yoji Kanro Roll***\n- Lemon Drop Roll\n- Green Tea Ice Cream\n\nThe fish and seafood here is so fresh especially for its price! Everything is flavorful and a lot of the dishes are so unique, like the Truffle Edamame and Tuna Poke Nacho to the House Rolls.\n\nService - 5/5\nThe service was great and the staff was super friendly! The staff gave excellent recommendations on what to order for our first time here. They also checked up on us and refilled our tea often. Even the sushi chef asked how we liked everything.\n\nOverall -\nYoji Sushi House is my new go to sushi spot in SF with the freshest quality of fish with an affordable price! I will definitely come back for more. Especially since they told us about their Happy Hour menu on Mondays-Saturdays from 4pm-6pm. ;)", "rating": 5, "date": "2018-10-27"}], "pink lady": [], "sake kale": [], "california": [{"excerpts": ["The California snd SF rolls were literally fake crab salad. ", "I've never eaten a roll with mayo in it. ", "The nigiri was super tiny. ", "I would rate this place a zero but yelp doesn't offer me that option."], "author": "Linda S.", "review": "This was the worst sushi I have ever eaten. I read the yelp reviews and being new to the neighborhood, thought I'd give it a go. Yuck. 82.00 worth of garbage. The spicy tuna roll was mush. The tuna was literally mashed, which I suspect was a cost saving measure in order to use all the little crappy bits. The California snd SF rolls were literally fake crab salad. I've never eaten a roll with mayo in it. The nigiri was super tiny. I would rate this place a zero but yelp doesn't offer me that option.", "rating": 1, "date": "2018-07-28"}, {"excerpts": ["I ordered the Firebomb roll, spicy tuna, California, and seaweed salad delivery. ", "The spicy tuna was definitely not my favorite. ", "It tasted like gochujang (spicy red pepper paste) with tuna instead of the standard Sriracha sauce flavor. ", "Maybe you're into that. ", "But I was not. ", "That said, the California roll and wakame salad were good. ", "Maybe their sashimi and/or other items on their menu are good, but as a \"standard\" spicy tuna fan, I'm not sure when I'll be back..."], "author": "Julia N.", "review": "{review from experience 3 months ago}\n\nI ordered the Firebomb roll, spicy tuna, California, and seaweed salad delivery. It took 35 min to arrive (for reference, I live ~15 minutes away).\n\nOverall, the food was OK but not great. The spicy tuna was definitely not my favorite. It tasted like gochujang (spicy red pepper paste) with tuna instead of the standard Sriracha sauce flavor. Maybe you're into that. But I was not. That said, the California roll and wakame salad were good. And the prices are low, so that was my initial draw. \n\nMaybe their sashimi and/or other items on their menu are good, but as a \"standard\" spicy tuna fan, I'm not sure when I'll be back...", "rating": 3, "date": "2015-06-02"}, {"excerpts": ["I ordered chicken and beef skewers, the spice bazaar roll, California rolls, and the cucumber and avocado roll. ", "Everything was delicious and I would definitely order from them again! ", "I also like how we can customize or sushi to our liking. ", "Love!"], "author": "Thanh V.", "review": "I ordered Togo and Really loved everything!!! I ordered chicken and beef skewers, the spice bazaar roll, California rolls, and the cucumber and avocado roll. Everything was delicious and I would definitely order from them again! I also like how we can customize or sushi to our liking. Love!", "rating": 5, "date": "2015-12-26"}, {"excerpts": ["Had the salmon nigri, the grilled lamb, california, and spider roll.\n\n", "The salmon was fresh on the nigri, the california was good.\n"], "author": "Steph Q.", "review": "Had the salmon nigri, the grilled lamb, california, and spider roll.\n\nIt was all fairly done well.  The grilled lamb was done pretty good at a medium.  very flavorful and juicy.\nThe salmon was fresh on the nigri, the california was good.\nThe crab in the sprider was lightly breaded and was a good portion.\n\nThe server was nice and the place was very modern looking, just a odd location to find parking.  Also free edamame beans peas was a plus.\n\nwill be back!", "rating": 4, "date": "2012-09-19"}, {"excerpts": ["Got the California roll with sliced lemon and sriracha on top (TRY IT) \n\n"], "author": "Emily F.", "review": "Got it for delivery tonight, pretty good! \n\nGot the California roll with sliced lemon and sriracha on top (TRY IT) \n\nThe 49er roll, \nAnd the tuna and salmon.\n\nAlso a side of rice.\n\nAll in all, with a 2$ coupon from eat24, it was 19.55 $$$ \nNot to bad!! It was a lot of food.\n\nFood was pretty fresh, they gave a lot of soy sauce and two chopstick sets, white ginger (always a good sign).\n\nWould order again! Came in about 30 minutes!", "rating": 4, "date": "2013-06-07"}, {"excerpts": ["Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. ", "What the hell happened?!?! ", "We spent a lot of money on this order and now we fear for our health! ", "Our last and final order! ", "Sayonara Sushi Shoh!"], "author": "Denny L.", "review": "What happened tonight? We've ordered from here many times and tonight's order was the worst. Kani Snow Crab, old crab meat; Tamago, old tasting rice; Ebi nigiri, old shrimp; Cucumber & Avocado, old avocado; Butaniki Yakima, cold, fatty pieces of pork; Unagi Nigiri, old rice; California Roll, old rice. What the hell happened?!?! We spent a lot of money on this order and now we fear for our health! Our last and final order! Sayonara Sushi Shoh!", "rating": 1, "date": "2013-06-26"}, {"excerpts": ["I saw a lot of fakesushi on the menu which kinda bugged me, but whatever, its California ", "and we eat lots of fake stuff ", ":)"], "author": "Tom S.", "review": "I'd been anxiously awaiting the arrival of a new sushi place in my neck of the woods and this was it.\n\nThe food was good, but not awesome. \n\nI will be back for sure, because the service was great and the pricing was reasonable.\n\nI saw a lot of fakesushi on the menu which kinda bugged me, but whatever, its California and we eat lots of fake stuff :)", "rating": 4, "date": "2010-05-09"}, {"excerpts": ["I was very disappointed, the California roll had hard rice, all my nigiri had wasabi holding the rice and fish together, I hate wasabi!! ", "Yuck. ", "The raw fishes tasted just ok not too fresh. ", "I wasn't impressed."], "author": "Karen T.", "review": "So I was in a huge rush for a meeting and this was the closest sushi place to my friends house. I ordered Togo and said please hurry up which they requested the chef to do. I was very disappointed, the California roll had hard rice, all my nigiri had wasabi holding the rice and fish together, I hate wasabi!! Yuck. The raw fishes tasted just ok not too fresh. I wasn't impressed.", "rating": 2, "date": "2011-02-01"}, {"excerpts": ["We got a online ordering deal for a freebie california rolls, and even though it was free it tasted like real crab instead of surimi. ", "The rolls were all delicious - our favourite was the flaming torch roll."], "author": "johnson c.", "review": "Ordered delivery, came to us quite promptly. Delicious rolls and sashimi. We got a online ordering deal for a freebie california rolls, and even though it was free it tasted like real crab instead of surimi. The rolls were all delicious - our favourite was the flaming torch roll.", "rating": 4, "date": "2014-05-06"}, {"excerpts": ["Originality: 3-4 STARS, they have the usual california rolls and spicy tuna rolls, but they have a couple that are unique and deliver on taste."], "author": "Nick C.", "review": "I'm always skeptical when a new place opens up, especially new sushi restaurants. As you all know there are TONS and TONS of sushi joints to go to, and a lot of them are not good to just okay. Despite preconceived negative notions of this place, it actually delivers pretty good sushi. When judging sushi I go based on 2 criteria, 1st: taste, and 2nd: originality.\n\nTaste: 3.5-4 STARS, crunchy rolls are crunchy and not oily. avocado is fresh, rice is pretty good.\n\nOriginality: 3-4 STARS, they have the usual california rolls and spicy tuna rolls, but they have a couple that are unique and deliver on taste.", "rating": 4, "date": "2010-07-26"}, {"excerpts": ["We ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\n", "Tamago is wrapped in a really fancy way....", "I love it. ", "I guess the Sushi Chief is an expert. "], "author": "Chun Him L.", "review": "I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). It was delicious, fresh and tasty.....even my friend who doesn't like eating raw fish loves it. \n\nAfter trying that, we got another appetizer, I forgot what the name is, but is like some squid with wasabi served on the ice, it's so great. I was kinda surprised that I would be able to have these dishes I have never tried before in this new Japanese restaurant. \nWe ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\nThey are good, especially the beef tarayaki and lamb rack it was amazingly  delicious, even better than some famous steak house.\n\nTamago is wrapped in a really fancy way....I love it. I guess the Sushi Chief is an expert. Just love their stuff\n\nNow they offer delivery, its even better\nJust ordered yesterday, they delivered in 15 mins which is way faster than what they have suggested (45 mins). Nice packing ......I love it!\nThey are the best!! :P", "rating": 5, "date": "2010-07-05"}, {"excerpts": ["I love the Lion King roll and the crunchy California roll. ", "Sooooooo good!"], "author": "Nicole S.", "review": "Delivery always on time. Probably the best sushi place that delivers. I love the Lion King roll and the crunchy California roll. Sooooooo good!", "rating": 5, "date": "2012-01-12"}], "ca snow crab roll": [], "spicy tuna": [{"excerpts": ["Spicy tuna, also elderly. "], "author": "Jon P.", "review": "OK, this was bad. I've ordered delivery 8-9 times before because the menu is interesting and the location is close. Tonight's order was gross, and was final straw in orders of diminishing quality.\n\nShrimp tempura in Firebomb roll looked and tasted like it was deep-fried three days ago. Spicy tuna, also elderly. The asparagus used in the yaki asparagus was made of stringy, barely edible stems - the parts I cut off when making any asparagus dish. The kicker? My $6 cheesecake was a SLIVER... Like half the size of most restaurants. Comically small but also sad because this used to be reliable delivery. In total, the order had all the trappings of a struggling restaurant fighting to keep pace. Adding an extra point (from absolute worst) because they've been better.", "rating": 2, "date": "2016-11-16"}, {"excerpts": ["The spicy tuna roll was mush. ", "The tuna was literally mashed, which I suspect was a cost saving measure in order to use all the little crappy bits. "], "author": "Linda S.", "review": "This was the worst sushi I have ever eaten. I read the yelp reviews and being new to the neighborhood, thought I'd give it a go. Yuck. 82.00 worth of garbage. The spicy tuna roll was mush. The tuna was literally mashed, which I suspect was a cost saving measure in order to use all the little crappy bits. The California snd SF rolls were literally fake crab salad. I've never eaten a roll with mayo in it. The nigiri was super tiny. I would rate this place a zero but yelp doesn't offer me that option.", "rating": 1, "date": "2018-07-28"}, {"excerpts": ["I ordered the Firebomb roll, spicy tuna, California, and seaweed salad delivery. ", "The spicy tuna was definitely not my favorite. ", "It tasted like gochujang (spicy red pepper paste) with tuna instead of the standard Sriracha sauce flavor. ", "Maybe you're into that. ", "But I was not. ", "That said, the California roll and wakame salad were good. ", "Maybe their sashimi and/or other items on their menu are good, but as a \"standard\" spicy tuna fan, I'm not sure when I'll be back..."], "author": "Julia N.", "review": "{review from experience 3 months ago}\n\nI ordered the Firebomb roll, spicy tuna, California, and seaweed salad delivery. It took 35 min to arrive (for reference, I live ~15 minutes away).\n\nOverall, the food was OK but not great. The spicy tuna was definitely not my favorite. It tasted like gochujang (spicy red pepper paste) with tuna instead of the standard Sriracha sauce flavor. Maybe you're into that. But I was not. That said, the California roll and wakame salad were good. And the prices are low, so that was my initial draw. \n\nMaybe their sashimi and/or other items on their menu are good, but as a \"standard\" spicy tuna fan, I'm not sure when I'll be back...", "rating": 3, "date": "2015-06-02"}, {"excerpts": ["We even got a spicy tuna roll for free! ", "It was all delicious and soooo yummy! ", "Everything arrived on time and was so fresh! ", "Will definitely order delivery again!"], "author": "Stacey M.", "review": "This review is for delivery. I have to admit that this place is one of the best for sushi delivery. I was hesitant at first esp with the prior Yelp reviews about delivery service but I still went ahead and did it anyway. And I'm glad I did! Ordered the lemon drop, mango sp and spicy scallop rolls. Also the hamachi and tuna nigiris. We even got a spicy tuna roll for free! It was all delicious and soooo yummy! Everything arrived on time and was so fresh! Will definitely order delivery again!", "rating": 5, "date": "2017-06-06"}, {"excerpts": ["We tried the yakitori sampler, deep fried spicy tuna roll, and the pokimon salad. \n\n", "My absolute fave though was the deep fried spicy tuna roll. ", "I don't like raw anything ", "so when I saw this, I jump at the chance. ", "It was soooooo good! ", "I can't even describe it. ", "They put this orange sauce all over it ", "and I could not stop eating. ", "My absolute fave though was the deep fried spicy tuna roll. ", "I don't like raw anything ", "so when I saw this, I jump at the chance. ", "It was soooooo good! ", "I can't even describe it. ", "They put this orange sauce all over it ", "and I could not stop eating. ", "Best deep fried spicy tuna roll ", "Best deep fried spicy tuna roll "], "author": "Hang T.", "review": "We went here for a friend's birthday and they were so accommodating for such a big party. \n\nThis place is pretty small and has limited parking, but I think it was worth it. \n\nWe tried the yakitori sampler, deep fried spicy tuna roll, and the pokimon salad. \n\nI like the yakitori sampler because it gave a great selection of skewers. There were so many on the menu that I had trouble picking. I like the beef tongue and the salmon with bacon the best. Order those if you want individual skewers. I would really waste my time with the vegetable skewers unless you are a vegetarian. \n\nThe pokimon salad is one of their most popular dishes, but I think it was okay. It was a little sour and not worth 6 dollars. It was made of raw salmon, seaweed, and other stuff. \n\nMy absolute fave though was the deep fried spicy tuna roll. I don't like raw anything so when I saw this, I jump at the chance. It was soooooo good! I can't even describe it. They put this orange sauce all over it and I could not stop eating. Best deep fried spicy tuna roll I've ever tried!\n\nYummy in my tummy! This place is really good, reasonable prices, and has great service!", "rating": 4, "date": "2010-12-27"}, {"excerpts": ["Crunchy Spicy Tuna was good, Agedashi Tofu was terrible. ", "They forgot to bring me the free Seaweed Salad that I was supposed to get for spending more than $25. ", "I'll give them a second chance and update my review."], "author": "Andrew L.", "review": "Ordered delivery from GrubHub. Food arrived 45 minutes earlier than GH estimated. Mixed Tempura was great, Gyoza were perfect, Crunchy Spicy Tuna was good, Agedashi Tofu was terrible. They forgot to bring me the free Seaweed Salad that I was supposed to get for spending more than $25. I'll give them a second chance and update my review.", "rating": 3, "date": "2015-09-01"}, {"excerpts": ["We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The deep fried spicy tuna roll was fairly scrumptious. ", "The deep fried spicy tuna roll was fairly scrumptious. "], "author": "Rosanna N.", "review": "My friend and I finally found time in our busy schedules to have dinner and catch up so we yelped a few places and decided to try out Sushi Shoh. We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. The deep fried spicy tuna roll was fairly scrumptious. The star of the show was the Giants roll with the butterfish and tobiko... It was delicious! The service was decent and it helped that we had free pork skewers with our order of Sapporo. Overall the food was three stars, but the service and free skewers boosted it to four stars. It may not be a home run, but the restaurant is definitely a must try at least once. It also helped the fact that it was open later than other sushi restaurants.", "rating": 4, "date": "2012-03-01"}, {"excerpts": ["The sushi is solid, they have both the classic rolls and some great variety on specialty rolls (Flaming Torch and Nemo rolls being 2 cult favorites from this spicy tuna loving household) and the veggie tempura and pot stickers are always cooked to perfection. ", "We've done both sit down and delivery. ", "Enjoy this neighborhood gem!"], "author": "Alexa J.", "review": "I never write reviews but I definitely use Yelp for every restaurant I go to so here's to paying it back! New to the neighborhood and I have to say- this place is great. The sushi is solid, they have both the classic rolls and some great variety on specialty rolls (Flaming Torch and Nemo rolls being 2 cult favorites from this spicy tuna loving household) and the veggie tempura and pot stickers are always cooked to perfection. We've done both sit down and delivery. Enjoy this neighborhood gem!", "rating": 5, "date": "2016-02-16"}, {"excerpts": ["For sushi we had the Spice Bazar and Spicy Tuna, also delicious and highly recommended. \n\n"], "author": "Dip G.", "review": "BEST CHICKEN TERIYAKI EVER!!! (dine in better than takeout)\n\nI've been coming to this place for months. I ordered the chicken teriyaki as take out and it was delicious, but when I dined in this evening boy was I in for a treat. \n\nThe chicken had this crispness to it and the sesame seeds and teriyaki sauce was a perfect blend. \n\nAlso had some gyoza which was tasty and my entree came with a delicious salad that was enough to share for 2 and miso soup, yum!\n\nFor sushi we had the Spice Bazar and Spicy Tuna, also delicious and highly recommended. \n\nSUSHI SHOH FO SHO!!!", "rating": 5, "date": "2011-06-27"}, {"excerpts": ["Ordered the shrimp tempura roll, spicy tuna roll, and rainbow roll, and got a free order of edamame. ", "Took about 45-50 min for the delivery to arrive. ", "Everything was decent, nothing offensively bad but nothing mindblowing. ", "About what you'd expect for delivery sushi at this price"], "author": "Lucas V.", "review": "Was staying at a friend's place in the area and wanted some delivery. Wouldn't usually go for delivery sushi but the reviews seemed good enough. Ordered the shrimp tempura roll, spicy tuna roll, and rainbow roll, and got a free order of edamame. Took about 45-50 min for the delivery to arrive. Everything was decent, nothing offensively bad but nothing mindblowing. About what you'd expect for delivery sushi at this price", "rating": 3, "date": "2014-05-20"}, {"excerpts": ["We had gomae, agidashitofu, a couple of rolls and gyoza for the z-man, albacore, spicy tuna roll.  ", "I know all pretty pedestrian stuff, but that was really what this place offers. ", "They comped us "], "author": "Aaron N.", "review": "So it was parents of an only child night with our daughter off at a party, and that means Sushi night for the Z man and parents. I've been tracking Sushi Shou's reviews and generally positive responses and close proximity to Chez Moi make a trial at is place a must. \nSo rule one of a sushi bar is just that. Sushi is to be eaten at the bar allowing for interaction with the sushi chef and observation of the product for easy scrutiny. There are 5 slightly uncomfortable high seats at the bar, all vacant when we arrived so we saddled up. One chair was backless Nd mismatched, which would normally be a negative, but it also spun around, allowing for great mid course fun by the Z-man. \n\nSo we tried to say hello to the sushi chef and his assistant. Well unfortunately Mr. Grumpalicious wanted nothing of conversation or ordering from him directly. (immediate minus one star). His Asst. Was nice nice enough, but powerless under his fearless leader to bring any sushi joy our way. \n\nThe gals waiting tables took our order, brought us Asahi on draft in mismatched but chilled glasses and generally were very nice and provided very good service. \n\nWe had gomae, agidashitofu, a couple of rolls and gyoza for the z-man, albacore, spicy tuna roll.  I know all pretty pedestrian stuff, but that was really what this place offers. They comped us a couple of pork belly yakitori skewers since it \"came with the beer special\". which were fine if slightly under seasoned. \n\nEverything was ..... Fine.  Ok leaning toward Meh\n\nWould I come back.   I would be pretty hard pressed. \n\nIf it wasn't for the close locale and the friendly service, probably would have given fewer stars.", "rating": 3, "date": "2011-01-30"}, {"excerpts": ["After perusing through the large selection of tapas, sushi, entrees and rolls, we decided on the hama hama roll (baked hamachi with gobo and spicy mayo), a spicy tuna roll, and the lobster flower.  \n\n", "I love a good spicy tuna, and Sushi Shoh did not disappoint. "], "author": "Julie S.", "review": "We've passed by Sushi Shoh a number of times now since it opened a few months ago and I've been curious to try it.  It was fairly empty when we got there, which was a little alarming, but it's probably because it just opened, it was a Sunday night, and in grand San Francisco tradition, it was DAMN cold.\n\nAfter perusing through the large selection of tapas, sushi, entrees and rolls, we decided on the hama hama roll (baked hamachi with gobo and spicy mayo), a spicy tuna roll, and the lobster flower.  \n\nWe were quite pleased with our selections.  They were each fresh,  flavorful, and pleasing to the palate.  The hama hama was perfectly crunchy and spicy, and the lobster flower had a nice balance of tuna and lobster such that neither flavor was overpowering.  I love a good spicy tuna, and Sushi Shoh did not disappoint. We were also pleasantly surprised by the free miso soup and edimame that we received before our meal - I didn't realize sushi restaurants still did this.\n\nWe ordered the fried banana and ice cream for dessert and loved it!  A word of caution: they use wasabi to stick the ice cream dish to the plate, so don't pull a Julie and curiously try some on a spoon.  That was not the best way to start dessert.  \n\nTakeaway: DO go expecting decent sushi at decent prices with great service.  Don't go expecting a wonderful ambiance and fine decor.  Sushi Shoh is a pretty standard sushi restaurant in that regard, so probably not the best first date spot.", "rating": 4, "date": "2010-06-21"}, {"excerpts": ["Originality: 3-4 STARS, they have the usual california rolls and spicy tuna rolls, but they have a couple that are unique and deliver on taste."], "author": "Nick C.", "review": "I'm always skeptical when a new place opens up, especially new sushi restaurants. As you all know there are TONS and TONS of sushi joints to go to, and a lot of them are not good to just okay. Despite preconceived negative notions of this place, it actually delivers pretty good sushi. When judging sushi I go based on 2 criteria, 1st: taste, and 2nd: originality.\n\nTaste: 3.5-4 STARS, crunchy rolls are crunchy and not oily. avocado is fresh, rice is pretty good.\n\nOriginality: 3-4 STARS, they have the usual california rolls and spicy tuna rolls, but they have a couple that are unique and deliver on taste.", "rating": 4, "date": "2010-07-26"}, {"excerpts": ["I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. ", "It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). "], "author": "Chun Him L.", "review": "I went to Sushi Shoh when it first opened, the waitress recommended the Tuna Poki, I was thinking what's the difference between Spicy Tuna roll and the Tuna Poki. It was our appetizer and it looks gorgeous and its cubic shape makes it look so cute actually (sound awkward when describing a dish,^^). It was delicious, fresh and tasty.....even my friend who doesn't like eating raw fish loves it. \n\nAfter trying that, we got another appetizer, I forgot what the name is, but is like some squid with wasabi served on the ice, it's so great. I was kinda surprised that I would be able to have these dishes I have never tried before in this new Japanese restaurant. \nWe ordered the spider roll, california roll, Tamago nigiri, Uni nigiri, Beef Tarayaki and lamb rack\n\nThey are good, especially the beef tarayaki and lamb rack it was amazingly  delicious, even better than some famous steak house.\n\nTamago is wrapped in a really fancy way....I love it. I guess the Sushi Chief is an expert. Just love their stuff\n\nNow they offer delivery, its even better\nJust ordered yesterday, they delivered in 15 mins which is way faster than what they have suggested (45 mins). Nice packing ......I love it!\nThey are the best!! :P", "rating": 5, "date": "2010-07-05"}, {"excerpts": ["I ordered the crunchy spicy tuna and spice bazaar rolls.  ", "The rolls were okay but pretty soggy and not crunchy.  ", "For this price, I won't order delivery again.  ", "I will give them one more chance to see how the food is at dine in."], "author": "C L.", "review": "This order is for delivery.  I ordered the crunchy spicy tuna and spice bazaar rolls.  The rolls were okay but pretty soggy and not crunchy.  For this price, I won't order delivery again.  I will give them one more chance to see how the food is at dine in.", "rating": 3, "date": "2011-03-16"}], "sake avocado roll": [], "hawaii roll": [], "philly roll": [], "rock  roll": [], "crispy salmon skin roll": [], "tempura shrimp roll": [], "tekka maki": [], "sake maki": [], "negihama maki": [], "spicy scallop roll": [{"excerpts": ["We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The deep fried spicy tuna roll was fairly scrumptious. ", "The deep fried spicy tuna roll was fairly scrumptious. "], "author": "Rosanna N.", "review": "My friend and I finally found time in our busy schedules to have dinner and catch up so we yelped a few places and decided to try out Sushi Shoh. We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. The deep fried spicy tuna roll was fairly scrumptious. The star of the show was the Giants roll with the butterfish and tobiko... It was delicious! The service was decent and it helped that we had free pork skewers with our order of Sapporo. Overall the food was three stars, but the service and free skewers boosted it to four stars. It may not be a home run, but the restaurant is definitely a must try at least once. It also helped the fact that it was open later than other sushi restaurants.", "rating": 4, "date": "2012-03-01"}], "new york roll": [], "deep fried california roll": [], "dynamite roll": [], "spam musubi": [], "chicken musubi": [], "hamachi lime": [], "crunchy snow white": [], "hamachi roll": [{"excerpts": ["I also enjoyed the spicy hamachi roll I ordered, especially the sushi rice and the amount of vinegar taste coming from it.\n\n"], "author": "H K.", "review": "I finally came by this restaurant earlier this week about wanting to check it out for some time.  I've driven by a few times before and notice how empty it is, and therefore there was some hesitation.  However, after visiting there I realize they probably do much of their business as take out or delivery.\n\nFor $22 they serve a pretty good 15-piece sashimi dinner combo with rice and miso soup.  Their sushi selection is fairly ordinary and they taste pretty fresh.  I also enjoyed the spicy hamachi roll I ordered, especially the sushi rice and the amount of vinegar taste coming from it.\n\nThe young lady who was servicing the tables was pretty attentive and smiling also once you settle into the table.", "rating": 4, "date": "2013-07-18"}], "deep fried spicy tuna": [{"excerpts": ["We tried the yakitori sampler, deep fried spicy tuna roll, and the pokimon salad. \n\n", "My absolute fave though was the deep fried spicy tuna roll. ", "I don't like raw anything ", "so when I saw this, I jump at the chance. ", "It was soooooo good! ", "I can't even describe it. ", "They put this orange sauce all over it ", "and I could not stop eating. ", "My absolute fave though was the deep fried spicy tuna roll. ", "I don't like raw anything ", "so when I saw this, I jump at the chance. ", "It was soooooo good! ", "I can't even describe it. ", "They put this orange sauce all over it ", "and I could not stop eating. ", "Best deep fried spicy tuna roll ", "Best deep fried spicy tuna roll "], "author": "Hang T.", "review": "We went here for a friend's birthday and they were so accommodating for such a big party. \n\nThis place is pretty small and has limited parking, but I think it was worth it. \n\nWe tried the yakitori sampler, deep fried spicy tuna roll, and the pokimon salad. \n\nI like the yakitori sampler because it gave a great selection of skewers. There were so many on the menu that I had trouble picking. I like the beef tongue and the salmon with bacon the best. Order those if you want individual skewers. I would really waste my time with the vegetable skewers unless you are a vegetarian. \n\nThe pokimon salad is one of their most popular dishes, but I think it was okay. It was a little sour and not worth 6 dollars. It was made of raw salmon, seaweed, and other stuff. \n\nMy absolute fave though was the deep fried spicy tuna roll. I don't like raw anything so when I saw this, I jump at the chance. It was soooooo good! I can't even describe it. They put this orange sauce all over it and I could not stop eating. Best deep fried spicy tuna roll I've ever tried!\n\nYummy in my tummy! This place is really good, reasonable prices, and has great service!", "rating": 4, "date": "2010-12-27"}, {"excerpts": ["We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. ", "The deep fried spicy tuna roll was fairly scrumptious. ", "The deep fried spicy tuna roll was fairly scrumptious. "], "author": "Rosanna N.", "review": "My friend and I finally found time in our busy schedules to have dinner and catch up so we yelped a few places and decided to try out Sushi Shoh. We ordered a spicy scallop roll, a dragon roll, a Giants roll, and a deep fried spicy tuna roll. The dragon roll was similar to any other restaurant's and the spicy scallop roll wasn't all that. The deep fried spicy tuna roll was fairly scrumptious. The star of the show was the Giants roll with the butterfish and tobiko... It was delicious! The service was decent and it helped that we had free pork skewers with our order of Sapporo. Overall the food was three stars, but the service and free skewers boosted it to four stars. It may not be a home run, but the restaurant is definitely a must try at least once. It also helped the fact that it was open later than other sushi restaurants.", "rating": 4, "date": "2012-03-01"}], "evergreen roll": [{"excerpts": ["The salmon was cooked all the through, Vegetarian Evergreen roll (it didn't sound pleasing with eggplant and zucchini in the same dish, but that was the best), and also the Hamachi Kama (perfectly cooked, very juicy).  \n\n"], "author": "Kathleen C.", "review": "I had some craving for cooked sushi on MLK Day. Not many places were opened on that day.  So I dragged my husband out for dinner.\n\nThe parking was okay for us that nite, but it was a little difficult to figure out how to cross the street without getting hit by cars going 40mph instead of the usual 25 mph.  But we eventually got across safety.\n\nOn the outside, the place looks small, and can hardly see their sign cuz no light, but it was the only place open at that street.  When we walked in, we got to pick our own seats away from the cold door. The decor was very nice, and chairs were comfortable. \n\nI'm not sure about how fresh the fresh sushi was cuz we didn't have any.  I was only craving for some cooked dishes.\n\nWe were debating between the Salmon or the Chicken Teriyaki, but we ended having the Chicken teriyaki ( the sauce wasn't thick and gooey but perfect), Lion king sushi (it was a tad small, but about 9 pieces of them) The salmon was cooked all the through, Vegetarian Evergreen roll (it didn't sound pleasing with eggplant and zucchini in the same dish, but that was the best), and also the Hamachi Kama (perfectly cooked, very juicy).  \n\nWe were filled up. cuz the teriyaki had a bowl of rice (unlimited refills! and a large plate of mixed greens for salad)  \n\nAt the end of our meal,  what thought that was weird, since we normally have mochi ice-cream or ice-cream at the end of our Sushi dinners. The server gave us half an orange sliced up.  So we ended up having the orange than having an ice-cream dessert.  Overall, the food was good, filling, and the total price is not bad.  \n\nWe will be coming back here again on my next sushi cravings", "rating": 4, "date": "2011-01-19"}, {"excerpts": ["I loved the Evergreen roll and my husband enjoyed the chicken meatballs and several other tapas dishes.", "The waitstaff is very nice, although a bit slow at time. ", "The restaurant is tiny but very comfortable and charming. ", "I am looking forward to coming back and trying some more things."], "author": "Keromi K.", "review": "My family and I came here for dinner recently and were pleasantly surprised by the quality of food here. I loved the Evergreen roll and my husband enjoyed the chicken meatballs and several other tapas dishes.The waitstaff is very nice, although a bit slow at time. The restaurant is tiny but very comfortable and charming. I am looking forward to coming back and trying some more things.", "rating": 4, "date": "2010-06-12"}], "forest roll": [], "futo maki": [], "sweet gum roll": [], "oshinko maki": [], "avocado maki": [], "cucumber and avocado roll": [{"excerpts": ["I ordered chicken and beef skewers, the spice bazaar roll, California rolls, and the cucumber and avocado roll. ", "Everything was delicious and I would definitely order from them again! ", "I also like how we can customize or sushi to our liking. ", "Love!"], "author": "Thanh V.", "review": "I ordered Togo and Really loved everything!!! I ordered chicken and beef skewers, the spice bazaar roll, California rolls, and the cucumber and avocado roll. Everything was delicious and I would definitely order from them again! I also like how we can customize or sushi to our liking. Love!", "rating": 5, "date": "2015-12-26"}], "mango maki": [], "garden": [], "crunchy ginger tofu": [], "chicken karaage dinner entre": [], "chicken teriyaki dinner entre": [], "beef teriyaki dinner entre": [], "salmon teriyaki dinner entre": [], "mackerel shioyaki dinner entre": [], "pork katsu dinner entre": [], "chicken katsu dinner entre": [], "fish katsu dinner entre": [], "shoh sushi combination": [], "veggie sushi combination": [], "chirashi sushi": [{"excerpts": ["Just order this: Delivery \nChirashi Sushi $14\n", "Gyu ", "Hire Yaki $6.95 \n", "Natural Vegetarian Anniversary Roll $8\n", "Butaniku ", "Chirashi Sushi\n", "SO many delicious thick pieces of chef special Sashimi. ", "Very fresh and each fish tasted like the freshest of its variety. \n", "Bonus at delivery Sushi Shoh....", "Cute driver"], "author": "emma g.", "review": "Just order this: Delivery \nChirashi Sushi $14\nGyu Hire Yaki $6.95 \nNatural Vegetarian Anniversary Roll $8\nButaniku Yaki $ 4.50 \nFree Edamame with purchase of $25 or more\n\nOK. you prob want to know about the food, and delivery huh?\n\nDELIVERY\nwas about 20 minutes earlier than Grub Hub predicted which was great.\n \nFOOD\nGyu Hire Yaki & Butaniku Yaki \nMy Yaki's were cold (*sad face) but SO flavourful w/slice of lemon. Pork Yaki has some nice stripes of flavourful fat with green onions. Steak was cooked to perfection, for me, nice and rare with a brilliant char. I would think that the Yaki chef knows what they are doing so all Yakis may be good.\n\nNatural Vegetarian Anniversary Roll\nThis roll tastes so fresh and so green. Asparagus, avo and tomato & cucumber. The freshness of it was what was impressive. \n\nChirashi Sushi\nSO many delicious thick pieces of chef special Sashimi. Very fresh and each fish tasted like the freshest of its variety. \nBonus at delivery Sushi Shoh....Cute driver", "rating": 4, "date": "2014-11-06"}], "shoh sashimi combination": [], "izumi tai": [], "tempura mix dinner entre": [], "happy lunch special a": [], "happy lunch special b": [], "happy lunch special c": [], "happy lunch special d": [], "happy lunch special e": [], "happy lunch special f": [], "mochi": [{"excerpts": ["At the end of our meal,  what thought that was weird, since we normally have mochi ice-cream or ice-cream at the end of our Sushi dinners. ", "The server gave us half an orange sliced up.  ", "So we ended up having the orange than having an ice-cream dessert.  "], "author": "Kathleen C.", "review": "I had some craving for cooked sushi on MLK Day. Not many places were opened on that day.  So I dragged my husband out for dinner.\n\nThe parking was okay for us that nite, but it was a little difficult to figure out how to cross the street without getting hit by cars going 40mph instead of the usual 25 mph.  But we eventually got across safety.\n\nOn the outside, the place looks small, and can hardly see their sign cuz no light, but it was the only place open at that street.  When we walked in, we got to pick our own seats away from the cold door. The decor was very nice, and chairs were comfortable. \n\nI'm not sure about how fresh the fresh sushi was cuz we didn't have any.  I was only craving for some cooked dishes.\n\nWe were debating between the Salmon or the Chicken Teriyaki, but we ended having the Chicken teriyaki ( the sauce wasn't thick and gooey but perfect), Lion king sushi (it was a tad small, but about 9 pieces of them) The salmon was cooked all the through, Vegetarian Evergreen roll (it didn't sound pleasing with eggplant and zucchini in the same dish, but that was the best), and also the Hamachi Kama (perfectly cooked, very juicy).  \n\nWe were filled up. cuz the teriyaki had a bowl of rice (unlimited refills! and a large plate of mixed greens for salad)  \n\nAt the end of our meal,  what thought that was weird, since we normally have mochi ice-cream or ice-cream at the end of our Sushi dinners. The server gave us half an orange sliced up.  So we ended up having the orange than having an ice-cream dessert.  Overall, the food was good, filling, and the total price is not bad.  \n\nWe will be coming back here again on my next sushi cravings", "rating": 4, "date": "2011-01-19"}]}