{"yoppi signature tart": [], "vanilla custard": [], "pineapple dole whip": [{"excerpts": ["A bit sweeter than I remembered (especially the vegan pineapple dole whip flavor?), but overall, fantastic. ", "The peanut butter remains my favorite. ", "I do with you ", "had some sort of loyalty card, though, Yoppi!"], "author": "Shendi X.", "review": "Oh, frozen yogurt establishment in the mall, how glad I am to see that you've maintained your existence throughout the years! A perfect spot for a refreshing, light snack amidst the ridiculousness that can be a typical mall shopping experience. A bit sweeter than I remembered (especially the vegan pineapple dole whip flavor?), but overall, fantastic. The peanut butter remains my favorite. I do with you had some sort of loyalty card, though, Yoppi!", "rating": 4, "date": "2016-07-05"}], "classic chocolate": [{"excerpts": ["but my fav is always the classic chocolate!"], "author": "Rita A.", "review": "So fresh and yummy! They have a great selection of fresh fruit and other toppings. They also have different flavours of yogurt each week but my fav is always the classic chocolate!", "rating": 5, "date": "2014-09-06"}, {"excerpts": ["Mango flavored and terrific with the classic chocolate fro yo"], "author": "Lara H.", "review": "Had my first bobba here. Mango flavored and terrific with the classic chocolate fro yo", "rating": 5, "date": "2015-04-12"}, {"excerpts": ["I tried their original tart, classic chocolate, and carmel, topped with graham cracker dust, orea bits, and maraschino cherries; it was delicious!  ", "I was hoping to find Taro flavored frozen yogurt, but carmel did the crave; I wanted seconds of carmel - not so much of the original tart or classic chocolate (but was still good).\n\n", "I was hoping to find Taro flavored frozen yogurt, but carmel did the crave; I wanted seconds of carmel - not so much of the original tart or classic chocolate (but was still good).\n\n"], "author": "Alex C.", "review": "I absolutely love Frozen Yogurt, and to my disappointment that there aren't any Pink Berry or Red Mango's out here in San Francisco; but stumbled upon Yoppi Yogurt.\n\nSmall, quaint, but cute, so can be somewhat packed with people looking in every direction for what flavor or simply waiting for one to give up a self serve spot.  I tried their original tart, classic chocolate, and carmel, topped with graham cracker dust, orea bits, and maraschino cherries; it was delicious!  I was hoping to find Taro flavored frozen yogurt, but carmel did the crave; I wanted seconds of carmel - not so much of the original tart or classic chocolate (but was still good).\n\nReally fixed my crave!", "rating": 5, "date": "2011-08-01"}], "french vanilla": [{"excerpts": ["They offer many kinds of frozen yogurt, such as strawberry, pumpkin pie, French vanilla, chocolate and so on. ", "You can choose whatever you want. ", "And you can add fruit, candies, nuts and many other things on the frozen yogurt. ", "It tastes so good. ", "It really deserves a try."], "author": "Nancy S.", "review": "The shop is very popular. A friend highly recommended this shop. The environment is nice and the staff are so kind.They offer many kinds of frozen yogurt, such as strawberry, pumpkin pie, French vanilla, chocolate and so on. You can choose whatever you want. And you can add fruit, candies, nuts and many other things on the frozen yogurt. It tastes so good. It really deserves a try.", "rating": 5, "date": "2015-09-27"}, {"excerpts": ["so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. ", "Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! "], "author": "Josephine B.", "review": "How many tubes of frozen yogurt can you eat in one week? I don't think it's wise to admit how many I had, but needless to say I made the most of it during my one week in San Francisco.\n\nThe only problem (well a problem for a little oink oink like me) was that the servings were charged by weight, so of course in my head that meant \"unlimited!\" Of course it isn't and although the smallest pot was the size of a babies head, I still played Krypton Factor and tried to cram as much as I could in (not that I needed to.)\n\nIt's a self-service so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\nMmmmmm! I miss you. xx", "rating": 5, "date": "2012-05-30"}, {"excerpts": ["so I had a few - French vanilla, cheesecake, strawberry and caramel.\n\n"], "author": "Katie B.", "review": "Why don't we have these in London? You would not believe my excitement at seeing this place!\n\nSo you pick your tub - small or large - and I'm telling you, the small is HUGE!! The small size tub is the equivalent of a large tub in London. You wander along all the different flavours of froyo and dispense however much you want into your tub. I was excited so I had a few - French vanilla, cheesecake, strawberry and caramel.\n\nYou then choose your toppings - now, I can't name everything that was there because there was SO much but as I was still excited (even more so in fact) I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. What? Don't look at me like that, I'm on holiday! Anyway, I skipped thousands of others so I'd say that was good self control. You can also have sauces but my tub was looking a bit mental and I didn't want to then throw in a load of other confused flavours so I held back.\n\nNext, you go to the counter where they weigh your pot and charge you. So for this humungous pot guess how much they charged... guess! $5!! Can you believe it? Cheap as chips! Then you grab a spoon and go! Simples!\n\nThe staff were a bit dull and lifeless to the point of moody but who cares? For all of this froyo deliciousness I'm really not bothered about their attitude!\n\nFive stars! Come open a joint in London (and charge San Fran prices!)", "rating": 5, "date": "2012-03-20"}, {"excerpts": ["Cookies and Cream, Tart flavors, French Vanilla...argh!\n\n"], "author": "Nick L.", "review": "4th Yoppi review?!\nCrazy fool.\nBeen having too much Yoppi lately. How can you not?\nCookies and Cream, Tart flavors, French Vanilla...argh!\n\nBring it on.", "rating": 5, "date": "2011-09-30"}, {"excerpts": ["I got the blueberry mixed with plain tart yogurt and a squirt of french vanilla! ", "They had some weird balls filled with liquid, it was not worth it. ", "Love the cereal selection, and the fruit looked fresh. ", "it was yummy, no complaint."], "author": "Karen T.", "review": "I had time to kill, I was craving froyo and remembered I passed by this place before. I got the blueberry mixed with plain tart yogurt and a squirt of french vanilla! They had some weird balls filled with liquid, it was not worth it. Love the cereal selection, and the fruit looked fresh. it was yummy, no complaint.", "rating": 3, "date": "2011-06-08"}, {"excerpts": ["Loved the original tart and the french vanilla.  "], "author": "Robin R.", "review": "Terrific yogurt in a sweet little shop.  Loved the original tart and the french vanilla.  Also the chocolate and the pomegranate and the mango - all the ones I've tried actually.  Esp. love the fresh fruit toppings and the great selection.  You can actually have a healthy snack here that is delicious.  The store is bright and clean and the staff has always been friendly and helpful.  A refreshing and energizing stop while shopping.", "rating": 5, "date": "2011-05-24"}], "açaí bowl": [], "strawberry shortcake": [], "cookies and cream": [{"excerpts": ["Had to, it was just a command in my brain to, get a cupful full of Irish mint and cookies and cream froyo even though I was planning to save my binge day for the weekend, but that didn't happen and it was all worth it(: \n\n", "I will recommend these flavors, Irish mint and cookies and cream, mixed together for you with the toppings of almonds, dark chocolate chips, waffle pieces and oreo crumbs!!!"], "author": "Wendy T.", "review": "Omg... First time I saw the Irish mint flavored froyo at this yoppi, and I think I'm in love with it! Just so minty and the right amount of sweetness. Personally I'm not even a fan of mint ice cream, and this Irish mint froyo blew my mind away when I sampled it. Had to, it was just a command in my brain to, get a cupful full of Irish mint and cookies and cream froyo even though I was planning to save my binge day for the weekend, but that didn't happen and it was all worth it(: \n\nI will recommend these flavors, Irish mint and cookies and cream, mixed together for you with the toppings of almonds, dark chocolate chips, waffle pieces and oreo crumbs!!!", "rating": 5, "date": "2015-08-04"}, {"excerpts": ["Cookies and cream is still declious.\n\n"], "author": "Jason B.", "review": "Froyoflation.\n\n4: http://www.yelp.com/biz/yoppi-yogurt-san-francisco-2#hrid:Afu3itOiHxlFk23O-9TQCw\n3: http://www.yelp.com/biz/yoppi-yogurt-san-francisco-6#hrid:vkreGqYHb3AFFayFXovdaQ\n2: http://www.yelp.com/biz/yoppi-yogurt-san-francisco-5#hrid:3_lz2kV23R_cHYvZQKJaMw\n\nStars are moving in the wrong direction.\n\nCookies and cream is still declious.\n\nKind of embarrassed I paid $3.65 for 8oz.\n\nAm I the froyo 1%?\n\nGoing forward Dreyer's will Occupy my freezer.", "rating": 2, "date": "2012-08-10"}, {"excerpts": ["Cookies and Cream, Tart flavors, French Vanilla...argh!\n\n"], "author": "Nick L.", "review": "4th Yoppi review?!\nCrazy fool.\nBeen having too much Yoppi lately. How can you not?\nCookies and Cream, Tart flavors, French Vanilla...argh!\n\nBring it on.", "rating": 5, "date": "2011-09-30"}], "irish mint": [{"excerpts": ["First time I saw the Irish mint flavored froyo at this yoppi, and I think I'm in love with it! ", "Just so minty and the right amount of sweetness. ", "Personally I'm not even a fan of mint ice cream, and this Irish mint froyo blew my mind away when I sampled it. ", "Had to, it was just a command in my brain to, get a cupful full of Irish mint and cookies and cream froyo even though I was planning to save my binge day for the weekend, but that didn't happen and it was all worth it(: \n\n", "I will recommend these flavors, Irish mint and cookies and cream, mixed together for you with the toppings of almonds, dark chocolate chips, waffle pieces and oreo crumbs!!!"], "author": "Wendy T.", "review": "Omg... First time I saw the Irish mint flavored froyo at this yoppi, and I think I'm in love with it! Just so minty and the right amount of sweetness. Personally I'm not even a fan of mint ice cream, and this Irish mint froyo blew my mind away when I sampled it. Had to, it was just a command in my brain to, get a cupful full of Irish mint and cookies and cream froyo even though I was planning to save my binge day for the weekend, but that didn't happen and it was all worth it(: \n\nI will recommend these flavors, Irish mint and cookies and cream, mixed together for you with the toppings of almonds, dark chocolate chips, waffle pieces and oreo crumbs!!!", "rating": 5, "date": "2015-08-04"}, {"excerpts": ["The Irish mint was not up to my code and the original tart tasted like Yogurtland's original tart. "], "author": "Dominic T.", "review": "There aren't many good frozen yogurt joints in the civic center area so I walked down Market from UN Plaza with a couple of friends just for Yoppi. The sample cups are always in a different place every single time I come here, this time I had to ask because it was between the wall and the cash register. I tried the pink grapefruit tart and it was stellar. I threw the sample cup away and asked for a new one to be courteous and hygienic. I also did the girl working a favor by pushing up the handles on every machine for her (I don't like my froyo all melted)! At $.45/oz, I value every bite of my frozen creation. The Irish mint was not up to my code and the original tart tasted like Yogurtland's original tart. So it makes sense that I dispensed mostly pink grapefruit tart and a little bit of original. \n\nI ran for the mango and green tea mochi before anyone else would dig in and ruin it. The green tea mochi was suprisingly easy to scoop and was not sticky at all. The mango mochi, however, was clumped together. I forgot to ask if the popping balls were from Taiwan (darn, hopefully I don't get poisoned) but I only like yogurt-filled balls since the other popping ball flavors are way too sweet and unhealthy. \n\nThe variety of fruits is great but the strawberries and blackberries looked disgusting and I had to call the girl out to replenish with fresh pieces that don't look like spit. I'm getting my berry mojo on now with everything: strawberries, blueberries, raspberries, and blackberries. Lastly, I can't forget the crushed graham cracker to top it all off. The total was $5.58 but it all goes into my frequent dining points so only so much closer to $50.", "rating": 4, "date": "2011-06-15"}, {"excerpts": ["I wish they had Irish Mint more frequently, but it's okay because the other flavors are usually really good. ", "I've fallen in love with the Cookies & Cream flavor ", "because even though it doesn't taste like actual Cookies & Cream (to me, at least) it has this indescribably delicious flavor that I can't resist! "], "author": "Ariele M.", "review": "I can't help but get Yoppi several times a week, it's so yummy. I wish they had Irish Mint more frequently, but it's okay because the other flavors are usually really good. I've fallen in love with the Cookies & Cream flavor because even though it doesn't taste like actual Cookies & Cream (to me, at least) it has this indescribably delicious flavor that I can't resist! Not a huge fan of their toppings, they could use more variety in fruits, but they've always got Almond Roca topping and I can't hate that!!!\n\nI've eaten so much Yoppi in my short life time. Mainly because they give a mall discount. Gotta love that discount.", "rating": 4, "date": "2013-08-30"}, {"excerpts": ["My faves include Irish Mint, Yellow Cake Batter, and Cookies n Cream. ", "Their cereal dispensers and toppings bar have always been refilled and cleaned really well, so perhaps the negative reviews beforehand were taken during a really busy rush of customers."], "author": "Elaine W.", "review": "Perfect place to satisfy my sweet tooth. I love being able to control the portions of the yogurt and toppings - don't forget they charge by the ounce! I like that the consistency of the frozen yogurt here is creamy instead of icy, and their selection of flavors - although small - are always yummy. My faves include Irish Mint, Yellow Cake Batter, and Cookies n Cream. Their cereal dispensers and toppings bar have always been refilled and cleaned really well, so perhaps the negative reviews beforehand were taken during a really busy rush of customers.", "rating": 4, "date": "2011-04-24"}], "fresh fruits": [{"excerpts": ["Along with different nuts, they have a good selection of fresh fruits, from kiwi to strawberry to mango to pineapples. ", "I love that they have mochi (a must for me) too!"], "author": "Nancy Z.", "review": "I think this place deserves 3.5 stars, but I went for the 4 on yelp so it is so conveniently located inside the Westfield mall, on the 3rd floor by Aveda. \nI like the tart flavors, not too sweet but not too sour either. Although the flavor selections are pretty limited. The main reason I come to this fro-yo place is for its toppings. Along with different nuts, they have a good selection of fresh fruits, from kiwi to strawberry to mango to pineapples. I love that they have mochi (a must for me) too!", "rating": 4, "date": "2014-01-22"}, {"excerpts": ["Love that Yoppi have fresh fruits and amazing toppings. ", "Their cheesecake flavor frozen yogurt was by far the best flavor I ever tried! \n", "Only down side is that it is kind of pricier than usual frozen yogurt place, but overall love it!"], "author": "Lisa B.", "review": "Love that Yoppi have fresh fruits and amazing toppings. Their cheesecake flavor frozen yogurt was by far the best flavor I ever tried! \nOnly down side is that it is kind of pricier than usual frozen yogurt place, but overall love it!", "rating": 4, "date": "2012-06-19"}, {"excerpts": ["Fresh fruits, mochi, cereal, gummy bears, exploding boba and other stuff. ", "The signature tart is probably the best flavor as their cookies n cream wasnt that great. ", "I", "d pass on this place unless someone else was craving frozen yogurt."], "author": "Robert Y.", "review": "Im not a big fan of frozen yogurt and this place did not change my opinion. Camer here after realizing Bloem 'n Sugar was closed. Nothing special here that you couldnt get at nubi. 45 cents/ounce, there was only 6 flavors when we went there. Props for the variety of toppings. Fresh fruits, mochi, cereal, gummy bears, exploding boba and other stuff. The signature tart is probably the best flavor as their cookies n cream wasnt that great. Id pass on this place unless someone else was craving frozen yogurt.", "rating": 3, "date": "2011-09-26"}, {"excerpts": ["they had fresh fruits (the mango was particularly yummy "], "author": "Whitne Y.", "review": "love! was here the other day after my friend and i grabbed lunch, and he had a craving for something sweet.\n\nthey had multiple flavors (6) you can try before you buy and best part is you can mix them too (well i did)\n\nand then a pretty good amount of toppings to choose from. they had fresh fruits (the mango was particularly yummy i think it is also in season..) and different color mochi, cheesecake crumbs, m&m, jelly beans, as well as more healthy stuff (for him) like almonds and nuts.\n\nbest part is they weigh it, so its based on how much you buy, regardless of the amount of flavors or toppings you mix..they don't limit you to three, so i tried a little of everything.\n\ndefinitely going back.\n\ncashier was friendly as well", "rating": 5, "date": "2011-01-20"}], "mango boba": [], "strawberry boba": [{"excerpts": ["I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. ", "What? ", "Don't look at me like that, I'm on holiday! ", "Anyway, I skipped thousands of others ", "so I'd say that was good self control. ", "You can also have sauces but my tub was looking a bit mental ", "and I didn't want to then throw in a load of other confused flavours "], "author": "Katie B.", "review": "Why don't we have these in London? You would not believe my excitement at seeing this place!\n\nSo you pick your tub - small or large - and I'm telling you, the small is HUGE!! The small size tub is the equivalent of a large tub in London. You wander along all the different flavours of froyo and dispense however much you want into your tub. I was excited so I had a few - French vanilla, cheesecake, strawberry and caramel.\n\nYou then choose your toppings - now, I can't name everything that was there because there was SO much but as I was still excited (even more so in fact) I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. What? Don't look at me like that, I'm on holiday! Anyway, I skipped thousands of others so I'd say that was good self control. You can also have sauces but my tub was looking a bit mental and I didn't want to then throw in a load of other confused flavours so I held back.\n\nNext, you go to the counter where they weigh your pot and charge you. So for this humungous pot guess how much they charged... guess! $5!! Can you believe it? Cheap as chips! Then you grab a spoon and go! Simples!\n\nThe staff were a bit dull and lifeless to the point of moody but who cares? For all of this froyo deliciousness I'm really not bothered about their attitude!\n\nFive stars! Come open a joint in London (and charge San Fran prices!)", "rating": 5, "date": "2012-03-20"}], "passion fruit boba": [], "lychee boba": [], "home made whip cream yum": [], "chews cake bites": [], "cookie dough": [{"excerpts": ["The cookie dough topping was good as well, better than at other places."], "author": "Rori V.", "review": "Got the salted caramel pretzel & the honey. Both were good! The cookie dough topping was good as well, better than at other places.", "rating": 5, "date": "2018-11-06"}, {"excerpts": ["For the toppings, there is A LOT to choose from: mandarin oranges, strawberries, mango, pineapple, Reese's, cookie dough, chopped almonds and other nuts, mochi, brownie pieces, chocolate chips, different cereals, gummy bears and syrups: chocolate, peanut butter, caramel...\n", "The cookie dough was yummy!\n\n"], "author": "Leslie S.", "review": "Was looking for this place inside the food court but it's on the second floor of the mall as the sign at the entrance says :-D\n\nThe yogurt flavors of the moment were: plain Yoppi, mango, cheesecake, chocolate, vanilla, tangerine sorbet and maybe another one I forgot.\n\nWe asked to have samples, the girl at the register was very friendly.\nI ended up getting a mix of cheesecake and mango (it's white not orange, like in other places). \n\nFor the toppings, there is A LOT to choose from: mandarin oranges, strawberries, mango, pineapple, Reese's, cookie dough, chopped almonds and other nuts, mochi, brownie pieces, chocolate chips, different cereals, gummy bears and syrups: chocolate, peanut butter, caramel...\nThe cookie dough was yummy!\n\nDidn't wanna go too crazy with yogurt and toppings, I probably had about 1 cup or a little more and it ended up being 8$ for 2 people! Not bad at all.\n\nI love that everything, yogurt and toppings are self-served!! So much better like this.\nWill come back if I'm in the area.", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["In terms of toppings they had the usual mochi (regular, green tea, and strawberry), mini boba balls, syrups, crushed oreos, cookie dough, sprinkles, nuts, crushed candy bars, chocolate chips, etc. "], "author": "Leana L.", "review": "For a froyo place, this location lacked variety in its flavors. My sister was disappointed, but luckily for me, I typically like to just stick to the original tart and add in mochi and those mini boba balls. There were six flavors including original tart, lychee tart, vanilla, chocolate, and a couple others. I tried the original tart and the lychee tart. The lychee tart was really good. Perfect hint of lychee and a refreshing tartness to it.\n\nIn terms of toppings they had the usual mochi (regular, green tea, and strawberry), mini boba balls, syrups, crushed oreos, cookie dough, sprinkles, nuts, crushed candy bars, chocolate chips, etc. For about 2/3C of froyo and toppings, I paid about $3.50.\n\nIt's a nice option to have when you're craving something sweet but don't want anything super heavy like Ghiradelli's ice cream downstairs.", "rating": 3, "date": "2013-02-07"}, {"excerpts": ["My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\n"], "author": "Josephine B.", "review": "How many tubes of frozen yogurt can you eat in one week? I don't think it's wise to admit how many I had, but needless to say I made the most of it during my one week in San Francisco.\n\nThe only problem (well a problem for a little oink oink like me) was that the servings were charged by weight, so of course in my head that meant \"unlimited!\" Of course it isn't and although the smallest pot was the size of a babies head, I still played Krypton Factor and tried to cram as much as I could in (not that I needed to.)\n\nIt's a self-service so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\nMmmmmm! I miss you. xx", "rating": 5, "date": "2012-05-30"}, {"excerpts": ["I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. ", "What? ", "Don't look at me like that, I'm on holiday! ", "Anyway, I skipped thousands of others ", "so I'd say that was good self control. ", "You can also have sauces but my tub was looking a bit mental ", "and I didn't want to then throw in a load of other confused flavours "], "author": "Katie B.", "review": "Why don't we have these in London? You would not believe my excitement at seeing this place!\n\nSo you pick your tub - small or large - and I'm telling you, the small is HUGE!! The small size tub is the equivalent of a large tub in London. You wander along all the different flavours of froyo and dispense however much you want into your tub. I was excited so I had a few - French vanilla, cheesecake, strawberry and caramel.\n\nYou then choose your toppings - now, I can't name everything that was there because there was SO much but as I was still excited (even more so in fact) I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. What? Don't look at me like that, I'm on holiday! Anyway, I skipped thousands of others so I'd say that was good self control. You can also have sauces but my tub was looking a bit mental and I didn't want to then throw in a load of other confused flavours so I held back.\n\nNext, you go to the counter where they weigh your pot and charge you. So for this humungous pot guess how much they charged... guess! $5!! Can you believe it? Cheap as chips! Then you grab a spoon and go! Simples!\n\nThe staff were a bit dull and lifeless to the point of moody but who cares? For all of this froyo deliciousness I'm really not bothered about their attitude!\n\nFive stars! Come open a joint in London (and charge San Fran prices!)", "rating": 5, "date": "2012-03-20"}, {"excerpts": ["There's a million ranging from assorted flavors of mochi (like green tea, strawberry and mango), lychee fruits, berries, kiwis, shredded coconut, the whole cereal aisle from safeway, cheesecake bites, brownie bites, cookie dough bites, nuts, granola, the whole candy aisle in safeway etc. \n\n"], "author": "Myrtle M.", "review": "Chong and I have our conversations revolve around this f&&&ing place TO THE POINT where we make plans to meet up just because we're so stoked about \"next weeks flavors\" coming to fruition. \n\nEvery week they have a great assortment of flavors to cater to tart & fruit lovers as well as flavors for the sweet tooth and the best part is these flavors are far from conventional. \n\nFor sweet tooths they always have Yellow Cake Batter (perfect for the various toppings they have) and double chocolate, caramel cream\n\nFor tart lovers they usually have mango tart, green apple tart, original tart, passion acai berry tart.\n\nTo the right is an adorable board showcasing possible flavors for next week and magnets you manipulate towards the flavors you do want. For future flavors they listed TARO, LYCHEE (THOSE HAVE MY VOTE FOR SURE) PEANUT BUTTER, COFFEE CREAM, TOFFEE CRUNCH\n\nI'm used to all the frozen yogurt places only having 4 flavors, usually the only 4 I don't want. I'm also used to frozen yogurt places having a lacking selection of toppings, another feat Yoppi nails in between the eyes. \n\nToppings are ridiculous! There's a million ranging from assorted flavors of mochi (like green tea, strawberry and mango), lychee fruits, berries, kiwis, shredded coconut, the whole cereal aisle from safeway, cheesecake bites, brownie bites, cookie dough bites, nuts, granola, the whole candy aisle in safeway etc. \n\nMy only complaint is this Yoppis never fails to aggravate my claustrophobia. These two gigantic amazons were giving me and chong such dirty looks implying we needed to hurry up and kept trying to squeeze in between us. Who practices such bad manners? we would never do that to anyone no matter how long they were taking. That's beside the point anyway since we weren't taking long at all. I ended up dumping way more toppings than I wanted because glamazon next to me was giving me Death from Snoo Snoo (futurama reference) threats. This caused me to mercilessly drop so many toppings far from their respective containers. YOPPIS DESERVES A BIGGER AND BETTER LOCATION IN THE MALL.", "rating": 5, "date": "2011-08-09"}, {"excerpts": ["my toppings, green mochi, oreo cookies, cookie dough, and strawberries (so i don't feel so guilty)"], "author": "Cnn F.", "review": "This is my favorite Yoppi location. The staff is always friendly and its the only place I find Red Velvet. Its always clean and the condiments are always stocked.\n\nMy favorite Yoppi - start off with a little bit of tart, then yellow cake batter, then if they have it, RED VELVET (sooo good)....my toppings, green mochi, oreo cookies, cookie dough, and strawberries (so i don't feel so guilty)", "rating": 5, "date": "2011-05-04"}, {"excerpts": ["cookie dough -- mochi?!  ", "What?"], "author": "Olivia L.", "review": "The yogurt is fine (but the yellow cake batter is too much like the real thing and was pee colored).  The mochi here is ridiculous though -- yogurt flavored, strawberry, mixed, orange (i think), and ... cookie dough -- mochi?!  What?", "rating": 3, "date": "2010-12-28"}], "brownie bites": [{"excerpts": ["My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\n"], "author": "Josephine B.", "review": "How many tubes of frozen yogurt can you eat in one week? I don't think it's wise to admit how many I had, but needless to say I made the most of it during my one week in San Francisco.\n\nThe only problem (well a problem for a little oink oink like me) was that the servings were charged by weight, so of course in my head that meant \"unlimited!\" Of course it isn't and although the smallest pot was the size of a babies head, I still played Krypton Factor and tried to cram as much as I could in (not that I needed to.)\n\nIt's a self-service so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\nMmmmmm! I miss you. xx", "rating": 5, "date": "2012-05-30"}, {"excerpts": ["I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. ", "What? ", "Don't look at me like that, I'm on holiday! ", "Anyway, I skipped thousands of others ", "so I'd say that was good self control. ", "You can also have sauces but my tub was looking a bit mental ", "and I didn't want to then throw in a load of other confused flavours "], "author": "Katie B.", "review": "Why don't we have these in London? You would not believe my excitement at seeing this place!\n\nSo you pick your tub - small or large - and I'm telling you, the small is HUGE!! The small size tub is the equivalent of a large tub in London. You wander along all the different flavours of froyo and dispense however much you want into your tub. I was excited so I had a few - French vanilla, cheesecake, strawberry and caramel.\n\nYou then choose your toppings - now, I can't name everything that was there because there was SO much but as I was still excited (even more so in fact) I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. What? Don't look at me like that, I'm on holiday! Anyway, I skipped thousands of others so I'd say that was good self control. You can also have sauces but my tub was looking a bit mental and I didn't want to then throw in a load of other confused flavours so I held back.\n\nNext, you go to the counter where they weigh your pot and charge you. So for this humungous pot guess how much they charged... guess! $5!! Can you believe it? Cheap as chips! Then you grab a spoon and go! Simples!\n\nThe staff were a bit dull and lifeless to the point of moody but who cares? For all of this froyo deliciousness I'm really not bothered about their attitude!\n\nFive stars! Come open a joint in London (and charge San Fran prices!)", "rating": 5, "date": "2012-03-20"}, {"excerpts": ["There's a million ranging from assorted flavors of mochi (like green tea, strawberry and mango), lychee fruits, berries, kiwis, shredded coconut, the whole cereal aisle from safeway, cheesecake bites, brownie bites, cookie dough bites, nuts, granola, the whole candy aisle in safeway etc. \n\n"], "author": "Myrtle M.", "review": "Chong and I have our conversations revolve around this f&&&ing place TO THE POINT where we make plans to meet up just because we're so stoked about \"next weeks flavors\" coming to fruition. \n\nEvery week they have a great assortment of flavors to cater to tart & fruit lovers as well as flavors for the sweet tooth and the best part is these flavors are far from conventional. \n\nFor sweet tooths they always have Yellow Cake Batter (perfect for the various toppings they have) and double chocolate, caramel cream\n\nFor tart lovers they usually have mango tart, green apple tart, original tart, passion acai berry tart.\n\nTo the right is an adorable board showcasing possible flavors for next week and magnets you manipulate towards the flavors you do want. For future flavors they listed TARO, LYCHEE (THOSE HAVE MY VOTE FOR SURE) PEANUT BUTTER, COFFEE CREAM, TOFFEE CRUNCH\n\nI'm used to all the frozen yogurt places only having 4 flavors, usually the only 4 I don't want. I'm also used to frozen yogurt places having a lacking selection of toppings, another feat Yoppi nails in between the eyes. \n\nToppings are ridiculous! There's a million ranging from assorted flavors of mochi (like green tea, strawberry and mango), lychee fruits, berries, kiwis, shredded coconut, the whole cereal aisle from safeway, cheesecake bites, brownie bites, cookie dough bites, nuts, granola, the whole candy aisle in safeway etc. \n\nMy only complaint is this Yoppis never fails to aggravate my claustrophobia. These two gigantic amazons were giving me and chong such dirty looks implying we needed to hurry up and kept trying to squeeze in between us. Who practices such bad manners? we would never do that to anyone no matter how long they were taking. That's beside the point anyway since we weren't taking long at all. I ended up dumping way more toppings than I wanted because glamazon next to me was giving me Death from Snoo Snoo (futurama reference) threats. This caused me to mercilessly drop so many toppings far from their respective containers. YOPPIS DESERVES A BIGGER AND BETTER LOCATION IN THE MALL.", "rating": 5, "date": "2011-08-09"}], "reeses peanut butter": [], "andes mint": [], "butter finger": [], "peanuts": [{"excerpts": ["The chopped peanuts and kiwi are the best. ", "Eat... ahhhhh!  ", "I only wish they delivered!   ", "Yum!!"], "author": "Robin K.", "review": "I'm addicted to their new Acai!! Best Acai in San Francisco! I can't believe it was only six months ago and I didn't even know what Acai was. I love to get it at Yoppi in the Westfield mall because I can add just what I want.  It's better than Cafe Basik (although, I'll go there in a pinch). The thing I love about Yoppi is that I can choose blended or scooped ( I like the texture of scooped, seems to take longer to eat and it's harder) and then I choose which toppings and how much so I'm left with toppings to the last bite!!! They have all the healthy toppings I like,  but if I want a bit of a treat I can add a few pieces of the cheesecake squares or some toffee chips with my almonds. The chopped peanuts and kiwi are the best. Eat... ahhhhh!  I only wish they delivered!   Yum!!", "rating": 5, "date": "2017-02-06"}, {"excerpts": ["I chose the signature tart(?), and I like it very much, with peanuts, strawberries, cheesecakes and Nutella. ", "I like the way how toppings were added by myself."], "author": "蕾蕾", "review": "I chose the signature tart(?), and I like it very much, with peanuts, strawberries, cheesecakes and Nutella. I like the way how toppings were added by myself.", "rating": 5, "date": "2016-11-27"}], "sliced almonds": [], "almond roca": [{"excerpts": ["Not a huge fan of their toppings, they could use more variety in fruits, but they've always got Almond Roca topping "], "author": "Ariele M.", "review": "I can't help but get Yoppi several times a week, it's so yummy. I wish they had Irish Mint more frequently, but it's okay because the other flavors are usually really good. I've fallen in love with the Cookies & Cream flavor because even though it doesn't taste like actual Cookies & Cream (to me, at least) it has this indescribably delicious flavor that I can't resist! Not a huge fan of their toppings, they could use more variety in fruits, but they've always got Almond Roca topping and I can't hate that!!!\n\nI've eaten so much Yoppi in my short life time. Mainly because they give a mall discount. Gotta love that discount.", "rating": 4, "date": "2013-08-30"}, {"excerpts": ["I very much appreciated the Almond Roca bits topping. ", "Thanks, Yoppi!"], "author": "Felicia G.", "review": "Convenient froyo spot in the mall. How can you go wrong with fresh fruit and your choice of toppings? Like, A LOT of toppings. I very much appreciated the Almond Roca bits topping. Thanks, Yoppi!", "rating": 4, "date": "2012-04-17"}, {"excerpts": ["i got the yellow cake with some candy-covered almonds and almond roca and a small tasting of blueberry tart with cheesecake bits. ", "the frozen yogurt had a nice flavor and there were many add-ins to choose from! ", "i love that they have so many flavors that they switch out every week to new things and give you a sneak peak for the week to come."], "author": "Marjie T.", "review": "this was yum! i got the yellow cake with some candy-covered almonds and almond roca and a small tasting of blueberry tart with cheesecake bits. the frozen yogurt had a nice flavor and there were many add-ins to choose from! i love that they have so many flavors that they switch out every week to new things and give you a sneak peak for the week to come.", "rating": 4, "date": "2011-06-17"}], "walnuts": [], "dark chocolate chips": [{"excerpts": ["I will recommend these flavors, Irish mint and cookies and cream, mixed together for you with the toppings of almonds, dark chocolate chips, waffle pieces and oreo crumbs!!!"], "author": "Wendy T.", "review": "Omg... First time I saw the Irish mint flavored froyo at this yoppi, and I think I'm in love with it! Just so minty and the right amount of sweetness. Personally I'm not even a fan of mint ice cream, and this Irish mint froyo blew my mind away when I sampled it. Had to, it was just a command in my brain to, get a cupful full of Irish mint and cookies and cream froyo even though I was planning to save my binge day for the weekend, but that didn't happen and it was all worth it(: \n\nI will recommend these flavors, Irish mint and cookies and cream, mixed together for you with the toppings of almonds, dark chocolate chips, waffle pieces and oreo crumbs!!!", "rating": 5, "date": "2015-08-04"}], "yogurt chips": [{"excerpts": ["My favorite combo is original tart yogurt with yogurt chips. ", "Can't be beat!"], "author": "Kelsey B.", "review": "I love Yoppi Yogurt and get something almost every time I'm in Westfield Mall. My favorite combo is original tart yogurt with yogurt chips. Can't be beat!", "rating": 5, "date": "2018-10-11"}], "heath bar": [], "coconut flakes": [], "graham crackers": [], "animal cookies": [], "wafer straws": [], "fizzy cotton candy": [], "nerds": [], "rainbow sprinkles": [], "chocolate sprinkles": [], "mini mms": [], "peanut mms": [], "oreo cookie crumbs": [], "waffle cone": [], "fruity peoples": [], "captain crunch": [{"excerpts": ["I love this cute store, fast, easy in & out, and not to mention choice of over 30 different toppings, plus Captain Crunch:) ", "Their Blueberry tart and Pomegranate tart are absolutely to die for....\n", "Did I mention comfy couches at Westfield mall? ", "Yogurt and comfy couches, you goto try it."], "author": "J T.", "review": "I'm a big fan of Yoppi Yogurt. Most of their locations aren't open over the weekend. Finally, there is a place where I can go get yogurt  pretty much any day of the week. I love this cute store, fast, easy in & out, and not to mention choice of over 30 different toppings, plus Captain Crunch:) Their Blueberry tart and Pomegranate tart are absolutely to die for....\nDid I mention comfy couches at Westfield mall? Yogurt and comfy couches, you goto try it.", "rating": 4, "date": "2010-12-09"}], "sour gummy poppers": [], "peach ring": [], "sour gummy worms": [], "gummy bears": [{"excerpts": ["If I have an extra sweet tooth, then baby gummy bears! "], "author": "Eva O.", "review": "Vanilla froyo with fruity pebbles! The end (mic drop).\n\nI mean occasionally, if I wanna go the \"healthy\" route, I'll add blueberries. If I have an extra sweet tooth, then baby gummy bears! Load em up! \n\nMy go to spot for a light pick me up!", "rating": 5, "date": "2016-02-18"}, {"excerpts": ["For the toppings, there is A LOT to choose from: mandarin oranges, strawberries, mango, pineapple, Reese's, cookie dough, chopped almonds and other nuts, mochi, brownie pieces, chocolate chips, different cereals, gummy bears and syrups: chocolate, peanut butter, caramel...\n", "The cookie dough was yummy!\n\n"], "author": "Leslie S.", "review": "Was looking for this place inside the food court but it's on the second floor of the mall as the sign at the entrance says :-D\n\nThe yogurt flavors of the moment were: plain Yoppi, mango, cheesecake, chocolate, vanilla, tangerine sorbet and maybe another one I forgot.\n\nWe asked to have samples, the girl at the register was very friendly.\nI ended up getting a mix of cheesecake and mango (it's white not orange, like in other places). \n\nFor the toppings, there is A LOT to choose from: mandarin oranges, strawberries, mango, pineapple, Reese's, cookie dough, chopped almonds and other nuts, mochi, brownie pieces, chocolate chips, different cereals, gummy bears and syrups: chocolate, peanut butter, caramel...\nThe cookie dough was yummy!\n\nDidn't wanna go too crazy with yogurt and toppings, I probably had about 1 cup or a little more and it ended up being 8$ for 2 people! Not bad at all.\n\nI love that everything, yogurt and toppings are self-served!! So much better like this.\nWill come back if I'm in the area.", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\n"], "author": "Josephine B.", "review": "How many tubes of frozen yogurt can you eat in one week? I don't think it's wise to admit how many I had, but needless to say I made the most of it during my one week in San Francisco.\n\nThe only problem (well a problem for a little oink oink like me) was that the servings were charged by weight, so of course in my head that meant \"unlimited!\" Of course it isn't and although the smallest pot was the size of a babies head, I still played Krypton Factor and tried to cram as much as I could in (not that I needed to.)\n\nIt's a self-service so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\nMmmmmm! I miss you. xx", "rating": 5, "date": "2012-05-30"}, {"excerpts": ["I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. ", "What? ", "Don't look at me like that, I'm on holiday! ", "Anyway, I skipped thousands of others ", "so I'd say that was good self control. ", "You can also have sauces but my tub was looking a bit mental ", "and I didn't want to then throw in a load of other confused flavours "], "author": "Katie B.", "review": "Why don't we have these in London? You would not believe my excitement at seeing this place!\n\nSo you pick your tub - small or large - and I'm telling you, the small is HUGE!! The small size tub is the equivalent of a large tub in London. You wander along all the different flavours of froyo and dispense however much you want into your tub. I was excited so I had a few - French vanilla, cheesecake, strawberry and caramel.\n\nYou then choose your toppings - now, I can't name everything that was there because there was SO much but as I was still excited (even more so in fact) I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. What? Don't look at me like that, I'm on holiday! Anyway, I skipped thousands of others so I'd say that was good self control. You can also have sauces but my tub was looking a bit mental and I didn't want to then throw in a load of other confused flavours so I held back.\n\nNext, you go to the counter where they weigh your pot and charge you. So for this humungous pot guess how much they charged... guess! $5!! Can you believe it? Cheap as chips! Then you grab a spoon and go! Simples!\n\nThe staff were a bit dull and lifeless to the point of moody but who cares? For all of this froyo deliciousness I'm really not bothered about their attitude!\n\nFive stars! Come open a joint in London (and charge San Fran prices!)", "rating": 5, "date": "2012-03-20"}, {"excerpts": ["Fresh fruits, mochi, cereal, gummy bears, exploding boba and other stuff. ", "The signature tart is probably the best flavor as their cookies n cream wasnt that great. ", "I", "d pass on this place unless someone else was craving frozen yogurt."], "author": "Robert Y.", "review": "Im not a big fan of frozen yogurt and this place did not change my opinion. Camer here after realizing Bloem 'n Sugar was closed. Nothing special here that you couldnt get at nubi. 45 cents/ounce, there was only 6 flavors when we went there. Props for the variety of toppings. Fresh fruits, mochi, cereal, gummy bears, exploding boba and other stuff. The signature tart is probably the best flavor as their cookies n cream wasnt that great. Id pass on this place unless someone else was craving frozen yogurt.", "rating": 3, "date": "2011-09-26"}], "nuttella": [], "chocolate": [{"excerpts": ["I love tart + fruity flavors, but I haven't tried their others, like chocolate or cheesecake."], "author": "Scott Z.", "review": "Yoppi's flavors are my favorite in SF. The tart flavors are perfect + I end up coming here 3 - 4 times a week. This may be a slight addiction..\n\nTake my review with a grain of salt - I love tart + fruity flavors, but I haven't tried their others, like chocolate or cheesecake.", "rating": 5, "date": "2018-05-14"}, {"excerpts": ["I ended up trying all 6 of the flavors and they were just fine, but my trough of fro-yo ended up being mostly chocolate-y, rich and non-fruit flavors until I got to the toppings where I loaded on both types of bursting boba (my favorite!!) "], "author": "Candice G.", "review": "The sample monitor man here must get paid a ton because he was really on top of regulating that ish. \n\nThey def foiled my plan of sampling until I was pretty much full when the guy walked away with all the sample cups in hand after my second sampling. Hrmph. Fine. I guess I'll go legit and pay for what I eat (only I didn't and instead Abby S was nice enough to foot the fro-yo bill for everyone), if you insist.\n\nThe joint is about the size of a nice, upper-middle class walk in closet so they only offer 6 flavors, but you can vote on their next 'seasonal' flavor on their magnet board in front. I didn't see anywhere to get a magnet dot to place my vote so I just mashed my hands on the board and moved like 30 of them off of one flavor I didn't like to the one I know should be the winner. I'd maybe feel if I didn't feel like everyone does the same thing. \n\nI ended up trying all 6 of the flavors and they were just fine, but my trough of fro-yo ended up being mostly chocolate-y, rich and non-fruit flavors until I got to the toppings where I loaded on both types of bursting boba (my favorite!!) and lychee (also my favorite). \n\nThe yogurt hit the spot after a gluttonous crab dinner/smorgasbord with friends. The flavors were pretty standard, nothing really stand out-y or too crazy, but the price for 3 pretty decent mounds of fro yo for 3 growing girls was around $11, which is way cheaper than any of the fro-yo places I've been to before.", "rating": 4, "date": "2014-11-30"}, {"excerpts": ["I will recommend these flavors, Irish mint and cookies and cream, mixed together for you with the toppings of almonds, dark chocolate chips, waffle pieces and oreo crumbs!!!"], "author": "Wendy T.", "review": "Omg... First time I saw the Irish mint flavored froyo at this yoppi, and I think I'm in love with it! Just so minty and the right amount of sweetness. Personally I'm not even a fan of mint ice cream, and this Irish mint froyo blew my mind away when I sampled it. Had to, it was just a command in my brain to, get a cupful full of Irish mint and cookies and cream froyo even though I was planning to save my binge day for the weekend, but that didn't happen and it was all worth it(: \n\nI will recommend these flavors, Irish mint and cookies and cream, mixed together for you with the toppings of almonds, dark chocolate chips, waffle pieces and oreo crumbs!!!", "rating": 5, "date": "2015-08-04"}, {"excerpts": ["The yogurt flavors of the moment were: plain Yoppi, mango, cheesecake, chocolate, vanilla, tangerine sorbet and maybe another one I forgot.\n\n", "For the toppings, there is A LOT to choose from: mandarin oranges, strawberries, mango, pineapple, Reese's, cookie dough, chopped almonds and other nuts, mochi, brownie pieces, chocolate chips, different cereals, gummy bears and syrups: chocolate, peanut butter, caramel...\n"], "author": "Leslie S.", "review": "Was looking for this place inside the food court but it's on the second floor of the mall as the sign at the entrance says :-D\n\nThe yogurt flavors of the moment were: plain Yoppi, mango, cheesecake, chocolate, vanilla, tangerine sorbet and maybe another one I forgot.\n\nWe asked to have samples, the girl at the register was very friendly.\nI ended up getting a mix of cheesecake and mango (it's white not orange, like in other places). \n\nFor the toppings, there is A LOT to choose from: mandarin oranges, strawberries, mango, pineapple, Reese's, cookie dough, chopped almonds and other nuts, mochi, brownie pieces, chocolate chips, different cereals, gummy bears and syrups: chocolate, peanut butter, caramel...\nThe cookie dough was yummy!\n\nDidn't wanna go too crazy with yogurt and toppings, I probably had about 1 cup or a little more and it ended up being 8$ for 2 people! Not bad at all.\n\nI love that everything, yogurt and toppings are self-served!! So much better like this.\nWill come back if I'm in the area.", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["There were six flavors including original tart, lychee tart, vanilla, chocolate, and a couple others. ", "I tried the original tart and the lychee tart. ", "The lychee tart was really good. ", "In terms of toppings they had the usual mochi (regular, green tea, and strawberry), mini boba balls, syrups, crushed oreos, cookie dough, sprinkles, nuts, crushed candy bars, chocolate chips, etc. "], "author": "Leana L.", "review": "For a froyo place, this location lacked variety in its flavors. My sister was disappointed, but luckily for me, I typically like to just stick to the original tart and add in mochi and those mini boba balls. There were six flavors including original tart, lychee tart, vanilla, chocolate, and a couple others. I tried the original tart and the lychee tart. The lychee tart was really good. Perfect hint of lychee and a refreshing tartness to it.\n\nIn terms of toppings they had the usual mochi (regular, green tea, and strawberry), mini boba balls, syrups, crushed oreos, cookie dough, sprinkles, nuts, crushed candy bars, chocolate chips, etc. For about 2/3C of froyo and toppings, I paid about $3.50.\n\nIt's a nice option to have when you're craving something sweet but don't want anything super heavy like Ghiradelli's ice cream downstairs.", "rating": 3, "date": "2013-02-07"}, {"excerpts": ["They offer many kinds of frozen yogurt, such as strawberry, pumpkin pie, French vanilla, chocolate and so on. ", "You can choose whatever you want. ", "And you can add fruit, candies, nuts and many other things on the frozen yogurt. ", "It tastes so good. ", "It really deserves a try."], "author": "Nancy S.", "review": "The shop is very popular. A friend highly recommended this shop. The environment is nice and the staff are so kind.They offer many kinds of frozen yogurt, such as strawberry, pumpkin pie, French vanilla, chocolate and so on. You can choose whatever you want. And you can add fruit, candies, nuts and many other things on the frozen yogurt. It tastes so good. It really deserves a try.", "rating": 5, "date": "2015-09-27"}, {"excerpts": ["They offer six different flavors which include original tart, vanilla, chocolate, blueberry, pomegranate, and yellow cake batter.  ", "I went with the original tart because it's sort of my litmus test for all froyo joints, plus it's one of my favorite flavors.  "], "author": "Daniel B.", "review": "Yoppi has a small little froyo store in Westfield shopping center.  Because it's so small, they have limited flavors and toppings and no seating.  It's definitely froyo to go.  They offer six different flavors which include original tart, vanilla, chocolate, blueberry, pomegranate, and yellow cake batter.  I went with the original tart because it's sort of my litmus test for all froyo joints, plus it's one of my favorite flavors.  Yoppi's froyo plus toppings are priced at 45 cents an ounce, making them a bit more expensive than the rest of their self-serve competition (typically 39 cents/ounce).\n\nMy first reaction to Yoppi's froyo is that it's very icy.  It's a personal preference, but it's too icy for me.  Tartness flavor was okay.  They do have some toppings I haven't seen anywhere else.  These include their \"boba poppers\" and different flavors of mochi.  The boba poppers are small soft balls that contain flavored liquid inside.  I tried their mango and yogurt boba poppers.  The mango (orange) boba poppers remind me of salmon roe you can get at sushi restaurants!  I also tried their multicolored mochi.  Pretty cool.  Check out my photos to see the boba poppers and rainbow-colored mochi.", "rating": 3, "date": "2010-12-25"}, {"excerpts": ["The chocolate and vanilla on the other hand, were SUPER RUNNY, similar to the low quality, melted \"ice cream\" at Asian buffets. "], "author": "Samantha C.", "review": "Overall, it is just like any other yogurt place.. that serves only 4 flavors at a time. It's definitely hit & miss with the flavors, in terms of consistency and richness of flavor. \n\nI really liked the plain tart and mango. Not overly tart-y or overly sweet. The chocolate and vanilla on the other hand, were SUPER RUNNY, similar to the low quality, melted \"ice cream\" at Asian buffets. That's the worst kind of \"frozen\" yogurt :( \n\nThe entire place is pretty cute. It's very small with no seating area. \n\nOne question though... where is the pricing info?? Maybe I just missed it, but there was no board or sign or any indication of how much it costs per ounce!", "rating": 3, "date": "2013-02-05"}, {"excerpts": ["but my fav is always the classic chocolate!"], "author": "Rita A.", "review": "So fresh and yummy! They have a great selection of fresh fruit and other toppings. They also have different flavours of yogurt each week but my fav is always the classic chocolate!", "rating": 5, "date": "2014-09-06"}, {"excerpts": ["I never been to a froyo spot that had chocolate covered raisins "], "author": "Jessica R.", "review": "I love froyo! I love Yoppi!\n\nI can consume so much original tart froyo, no joke. I come here at least 1-2 times week, it's that good! I can live off froyo if I had to, for real. Lol. \n\nI'm not a fan of flavored froyo, that's what ice cream is for! But I do love my tart. They do have a lot of toppings though I hate the twisting dispensers! One time, I turned the knob and got more than I want but it was ok. I never been to a froyo spot that had chocolate covered raisins so it was something new and actually good. \n\nThis location spot is pretty random, wish it were in the concourse of Westfield or a freestanding store on Market street. Usually when people ask me if I know any froyo spots nearby, I always direct them to Yoppi.\n\nYoppi DOES have a frequent customer program. You just have to always tell them your phone number. They print you a copy receipt of all the times you've visited and how much you've paid. Once you've hit $50, you get free froyo! They don't really advertise this, I didn't know of it until my friend told me when she worked near a Yoppi.", "rating": 4, "date": "2011-06-12"}, {"excerpts": ["so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. ", "Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! "], "author": "Josephine B.", "review": "How many tubes of frozen yogurt can you eat in one week? I don't think it's wise to admit how many I had, but needless to say I made the most of it during my one week in San Francisco.\n\nThe only problem (well a problem for a little oink oink like me) was that the servings were charged by weight, so of course in my head that meant \"unlimited!\" Of course it isn't and although the smallest pot was the size of a babies head, I still played Krypton Factor and tried to cram as much as I could in (not that I needed to.)\n\nIt's a self-service so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\nMmmmmm! I miss you. xx", "rating": 5, "date": "2012-05-30"}, {"excerpts": ["Mango flavored and terrific with the classic chocolate fro yo"], "author": "Lara H.", "review": "Had my first bobba here. Mango flavored and terrific with the classic chocolate fro yo", "rating": 5, "date": "2015-04-12"}, {"excerpts": ["so I piled my cup with a combination of flavours (chocolate, caramel and original \"tart\"), bypassing the toppings station to keep my fro-yo pure. ", "Next, my cup was weighed and the guy behind the register joked \"that will be a total of $3.26, if you feel like paying\". ", "I laughed and asked if there was an option not to,to which of course he said \"Well, you could not pay ", "but then I'd have to chase you down in the mall ", "and I guarantee my legs are longer than yours\". "], "author": "Tresna L.", "review": "My hunt for the best frozen treat in San Francisco took me to Yoppi. It's a DIY affair so I piled my cup with a combination of flavours (chocolate, caramel and original \"tart\"), bypassing the toppings station to keep my fro-yo pure. Next, my cup was weighed and the guy behind the register joked \"that will be a total of $3.26, if you feel like paying\". I laughed and asked if there was an option not to,to which of course he said \"Well, you could not pay but then I'd have to chase you down in the mall and I guarantee my legs are longer than yours\". It put a smile on my face, as did my cup of frozen awesomeness which lasted all of about 6 minutes.\n\nI really like that you can \"vote\" for the flavours that will be featured next week. Take a green sticker off the wall and put it next to the flavour that really takes your fancy. The flavour with the most votes then gets put in the machines the next week.", "rating": 4, "date": "2012-04-09"}, {"excerpts": ["Yellow Cake Batter (perfect for the various toppings they have) and double chocolate, caramel cream\n\nFor tart lovers they usually have mango tart, green apple tart, original tart, passion acai berry tart.\n\n"], "author": "Myrtle M.", "review": "Chong and I have our conversations revolve around this f&&&ing place TO THE POINT where we make plans to meet up just because we're so stoked about \"next weeks flavors\" coming to fruition. \n\nEvery week they have a great assortment of flavors to cater to tart & fruit lovers as well as flavors for the sweet tooth and the best part is these flavors are far from conventional. \n\nFor sweet tooths they always have Yellow Cake Batter (perfect for the various toppings they have) and double chocolate, caramel cream\n\nFor tart lovers they usually have mango tart, green apple tart, original tart, passion acai berry tart.\n\nTo the right is an adorable board showcasing possible flavors for next week and magnets you manipulate towards the flavors you do want. For future flavors they listed TARO, LYCHEE (THOSE HAVE MY VOTE FOR SURE) PEANUT BUTTER, COFFEE CREAM, TOFFEE CRUNCH\n\nI'm used to all the frozen yogurt places only having 4 flavors, usually the only 4 I don't want. I'm also used to frozen yogurt places having a lacking selection of toppings, another feat Yoppi nails in between the eyes. \n\nToppings are ridiculous! There's a million ranging from assorted flavors of mochi (like green tea, strawberry and mango), lychee fruits, berries, kiwis, shredded coconut, the whole cereal aisle from safeway, cheesecake bites, brownie bites, cookie dough bites, nuts, granola, the whole candy aisle in safeway etc. \n\nMy only complaint is this Yoppis never fails to aggravate my claustrophobia. These two gigantic amazons were giving me and chong such dirty looks implying we needed to hurry up and kept trying to squeeze in between us. Who practices such bad manners? we would never do that to anyone no matter how long they were taking. That's beside the point anyway since we weren't taking long at all. I ended up dumping way more toppings than I wanted because glamazon next to me was giving me Death from Snoo Snoo (futurama reference) threats. This caused me to mercilessly drop so many toppings far from their respective containers. YOPPIS DESERVES A BIGGER AND BETTER LOCATION IN THE MALL.", "rating": 5, "date": "2011-08-09"}, {"excerpts": ["Mix it with chocolate, it's heaven. ", "Also the yogurt at this location is put at right temperature, so it's thick as well ", "(Stonetown location failed on this). ", "Favorite spot for dinner"], "author": "Zisele N.", "review": "It is inside the mall, so it's super convenient for me to have some yogurt between classes. They have a lot of toppings, and the cheesecake flavor is so creamy. Mix it with chocolate, it's heaven. Also the yogurt at this location is put at right temperature, so it's thick as well (Stonetown location failed on this). Favorite spot for dinner", "rating": 5, "date": "2014-09-24"}, {"excerpts": ["and I've found my \"thing\" which is a small amount of original, with lots of strawberries, kiwis, and a tiny bit of chocolate chips. ", "Yum."], "author": "Shauna S.", "review": "Lately as it's slowly been warming up (lol), I've found myself craving frozen yogurt so I ended up wandering in here. It's definitely grown on me -- either that or the fruit section really did expand and I'm a happy camper. I definitely enjoy some the flavours that make a special appearance and I've found my \"thing\" which is a small amount of original, with lots of strawberries, kiwis, and a tiny bit of chocolate chips. Yum.", "rating": 4, "date": "2014-04-05"}, {"excerpts": ["Add your toppings of fresh fruit, sauces, chocolate bits and whatever strikes your fancy.  "], "author": "Cassandra J.", "review": "One of the two frozen yogurt places I like to go to, Yoppi's has yellow cake batter flavour!  Yum.  Topped with fruit and a bit of whipped topping, I was in heaven today.\n\nI like their voting board for what new flavours you want to see next week.  (of course, I only seem to get the cake batter, but for those who want to try something new, cast your vote!)  Add your toppings of fresh fruit, sauces, chocolate bits and whatever strikes your fancy.  A lot of good options!\n\nThere's only about 5 or 6 flavours of frozen yogurt, but I find the range of toppings to make up for it (Capt Crunch?  Seriously??)\n\nA great stop for a quick healthy snack.", "rating": 4, "date": "2011-05-28"}, {"excerpts": ["tart\n-classic chocolate\n- yellow cake batter\n-pomegrate ", "9 fruit toppings, 3 yogurt poppers, 4 mochi, 2 crumbled cookies, 20ish dry toppings (nuts, chocolate, nuts, candies)  in silos and jars.\n\n"], "author": "Victor G.", "review": "this yoppi  yogurt is in westfield mall. small little hole in the wall.\n\nfroyo availability:\n-french vanilla: sweet\n-blueberry tart :  blueberri.ness,  tartness\n-signature tart\n-classic chocolate\n- yellow cake batter\n-pomegrate tart : pom taste with tartness\n\npricing: self serve. .45 cents froyo & toppings. 9 fruit toppings, 3 yogurt poppers, 4 mochi, 2 crumbled cookies, 20ish dry toppings (nuts, chocolate, nuts, candies)  in silos and jars.\n\nfrodrips\n-taylor dispensing machines, customized apo laminated cups\n-froyo texture on soft side, creamy on edge of watery, not firm  (-.5)\n-no seating on site nor anywheres near in mall                            (-.5)\n-wacky wabbit wating: 2 stars, setup not kid friendly. no seating, pricey", "rating": 3, "date": "2010-12-24"}, {"excerpts": ["I tried their original tart, classic chocolate, and carmel, topped with graham cracker dust, orea bits, and maraschino cherries; it was delicious!  ", "I was hoping to find Taro flavored frozen yogurt, but carmel did the crave; I wanted seconds of carmel - not so much of the original tart or classic chocolate (but was still good).\n\n", "I was hoping to find Taro flavored frozen yogurt, but carmel did the crave; I wanted seconds of carmel - not so much of the original tart or classic chocolate (but was still good).\n\n"], "author": "Alex C.", "review": "I absolutely love Frozen Yogurt, and to my disappointment that there aren't any Pink Berry or Red Mango's out here in San Francisco; but stumbled upon Yoppi Yogurt.\n\nSmall, quaint, but cute, so can be somewhat packed with people looking in every direction for what flavor or simply waiting for one to give up a self serve spot.  I tried their original tart, classic chocolate, and carmel, topped with graham cracker dust, orea bits, and maraschino cherries; it was delicious!  I was hoping to find Taro flavored frozen yogurt, but carmel did the crave; I wanted seconds of carmel - not so much of the original tart or classic chocolate (but was still good).\n\nReally fixed my crave!", "rating": 5, "date": "2011-08-01"}, {"excerpts": ["All of the other flavors are the regular vanilla and chocolate variety.  ", "They have a huge selection of toppings though.  ", "I found this yellow caviar ball looking thing with juice in the middle.  ", "Very interesting...  "], "author": "Rosalind S.", "review": "Small little yogurt shop in the Bloomingdales side of the mall.  Perfect for a pop in and out when you're overheated from too much shopping.  We were here the day after Christmas and froyo totally hit the spot!\n\nThey don't have a large selection of flavors to choose from but they do have yellow cake batter.  It totally tasted like cake!  All of the other flavors are the regular vanilla and chocolate variety.  They have a huge selection of toppings though.  I found this yellow caviar ball looking thing with juice in the middle.  Very interesting...  It would be nice if their flavors matched their toppings in variety.\n\n.45 a oz.  I really don't know if that's expensive.  I never check.", "rating": 4, "date": "2010-12-27"}, {"excerpts": ["There was a good selection of other flavors, I also tried the chocolate and it was yummy as well. ", "It's amazing that they can make something that's only 120 calories and 0 grams of fat for a cup taste like it's about triple the calories. "], "author": "Jessica W.", "review": "The cake batter frozen yogurt was AHHHMAZING! I came here twice during my trip to the Bay area just for the cake batter frozen yogurt!\n\nThere was a good selection of other flavors, I also tried the chocolate and it was yummy as well. It's amazing that they can make something that's only 120 calories and 0 grams of fat for a cup taste like it's about triple the calories. Whatever, I'm not complaining!\n\nThe only drawback to the Westfield Shopping Center location is it's super tiny, so it can get a little bit cramped with everybody surveying the different flavors and adding their toppings. With that said, I would gladly brave the crowd anytime for more cake batter frozen yogurt. Mmmmm.", "rating": 4, "date": "2011-02-26"}, {"excerpts": ["The chocolate tastes very creamy and chocolatey! ", "I think the reason why I like the froyo here better is they taste very creamy, and doesn't taste like artificial flavorings. ", "The texture is rich and consistent. ", "The original is tart but not too sour, and tastes very much like Pinkberry. ", "Besides these two establishments, I am not a fan of any other froyo places.\n", "There's a huge selection in toppings too. ", "They have mango and green tea flavored mochis on top of the original. ", "Nom nom nom. \n", "It's cool how you can vote for the flavors you want the next week, but I saw some dumb girl rigging it by moving all the magnets from one flavor to another. ", "Bleh! \n", "I always stop by whenever I am at the Westfield now. ", "Can't wait for some lychee froyo yum!"], "author": "Jenny W.", "review": "Definitely my favorite yogurt spot in SF, since pinkberry is only available inside Virgin America T2 at SFO, unless you drive to the South Bay. I rarely travel down that way so Yoppi is a great substitute.\nThey have a great choice of flavors, the selection is rather large. Unlike other froyo places the flavors actually taste like what they are suppose to. I would say red velvet and lychee are my favorite flavors. The original and mango is quite good as well. The chocolate tastes very creamy and chocolatey! I think the reason why I like the froyo here better is they taste very creamy, and doesn't taste like artificial flavorings. The texture is rich and consistent. The original is tart but not too sour, and tastes very much like Pinkberry. Besides these two establishments, I am not a fan of any other froyo places.\nThere's a huge selection in toppings too. They have mango and green tea flavored mochis on top of the original. Nom nom nom. \nIt's cool how you can vote for the flavors you want the next week, but I saw some dumb girl rigging it by moving all the magnets from one flavor to another. Bleh! \nI always stop by whenever I am at the Westfield now. Can't wait for some lychee froyo yum!", "rating": 4, "date": "2011-06-02"}, {"excerpts": ["I felt like I was eating ice and chocolate chips. ", "Horrible. ", "How can they sell such crappy yogurt at such a high price? ", "Gross."], "author": "Fatima H.", "review": "Horrible frozen yogurt!\n\nI was shopping at the mall, and was really craving froyo when I encountered this joint.\n \n45 cents/oz sounded absolutely insanee to me, but I was desperate! I got a little bit of the plain tart, and the toppings were just pathetic. They were half empty, messy, and overall unappetizing. The girl at the register seemed like she would rather be anywhere else. \n\nThe yogurt pretty much tasted like ice. I felt like I was eating ice and chocolate chips. Horrible. How can they sell such crappy yogurt at such a high price? Gross.", "rating": 1, "date": "2011-01-02"}, {"excerpts": ["Also the chocolate and the pomegranate and the mango - all the ones I've tried actually.  ", "Esp. ", "love the fresh fruit toppings and the great selection.  ", "You can actually have a healthy snack here ", "that is delicious.  ", "The store is bright and clean and the staff has always been friendly and helpful.  ", "A refreshing and energizing stop while shopping."], "author": "Robin R.", "review": "Terrific yogurt in a sweet little shop.  Loved the original tart and the french vanilla.  Also the chocolate and the pomegranate and the mango - all the ones I've tried actually.  Esp. love the fresh fruit toppings and the great selection.  You can actually have a healthy snack here that is delicious.  The store is bright and clean and the staff has always been friendly and helpful.  A refreshing and energizing stop while shopping.", "rating": 5, "date": "2011-05-24"}], "marshmallow": [], "caramel": [{"excerpts": ["Got the salted caramel pretzel & the honey. ", "Both were good! "], "author": "Rori V.", "review": "Got the salted caramel pretzel & the honey. Both were good! The cookie dough topping was good as well, better than at other places.", "rating": 5, "date": "2018-11-06"}, {"excerpts": ["For the toppings, there is A LOT to choose from: mandarin oranges, strawberries, mango, pineapple, Reese's, cookie dough, chopped almonds and other nuts, mochi, brownie pieces, chocolate chips, different cereals, gummy bears and syrups: chocolate, peanut butter, caramel...\n", "The cookie dough was yummy!\n\n"], "author": "Leslie S.", "review": "Was looking for this place inside the food court but it's on the second floor of the mall as the sign at the entrance says :-D\n\nThe yogurt flavors of the moment were: plain Yoppi, mango, cheesecake, chocolate, vanilla, tangerine sorbet and maybe another one I forgot.\n\nWe asked to have samples, the girl at the register was very friendly.\nI ended up getting a mix of cheesecake and mango (it's white not orange, like in other places). \n\nFor the toppings, there is A LOT to choose from: mandarin oranges, strawberries, mango, pineapple, Reese's, cookie dough, chopped almonds and other nuts, mochi, brownie pieces, chocolate chips, different cereals, gummy bears and syrups: chocolate, peanut butter, caramel...\nThe cookie dough was yummy!\n\nDidn't wanna go too crazy with yogurt and toppings, I probably had about 1 cup or a little more and it ended up being 8$ for 2 people! Not bad at all.\n\nI love that everything, yogurt and toppings are self-served!! So much better like this.\nWill come back if I'm in the area.", "rating": 4, "date": "2015-06-14"}, {"excerpts": ["and I really like the Caramel cream flavor!! "], "author": "Leeann C.", "review": "I go to school near by and I really like the Caramel cream flavor!! =)\n\nWorkers are kind and always willing to let me try samples before I choose a fro yo flavor \n\n: )", "rating": 5, "date": "2016-04-14"}, {"excerpts": ["so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. ", "Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! "], "author": "Josephine B.", "review": "How many tubes of frozen yogurt can you eat in one week? I don't think it's wise to admit how many I had, but needless to say I made the most of it during my one week in San Francisco.\n\nThe only problem (well a problem for a little oink oink like me) was that the servings were charged by weight, so of course in my head that meant \"unlimited!\" Of course it isn't and although the smallest pot was the size of a babies head, I still played Krypton Factor and tried to cram as much as I could in (not that I needed to.)\n\nIt's a self-service so I was thrilled that I could try the mango tart, cheesecake, French vanilla, chocolate (just a tad, didn't much like it), strawberry and caramel. Sounds good so far right, but the next step is where it all goes wrong, because this was the, \"stacks of crap\" stage! My destroy your teeth selection included half a ton of gummy bears, M&M's, jelly sour worm things, cheesecake bits, cookie dough crumbs, brownie bites and a few pieces of fruit to make myself feel better. \n\n\nMmmmmm! I miss you. xx", "rating": 5, "date": "2012-05-30"}, {"excerpts": ["so I piled my cup with a combination of flavours (chocolate, caramel and original \"tart\"), bypassing the toppings station to keep my fro-yo pure. ", "Next, my cup was weighed and the guy behind the register joked \"that will be a total of $3.26, if you feel like paying\". ", "I laughed and asked if there was an option not to,to which of course he said \"Well, you could not pay ", "but then I'd have to chase you down in the mall ", "and I guarantee my legs are longer than yours\". "], "author": "Tresna L.", "review": "My hunt for the best frozen treat in San Francisco took me to Yoppi. It's a DIY affair so I piled my cup with a combination of flavours (chocolate, caramel and original \"tart\"), bypassing the toppings station to keep my fro-yo pure. Next, my cup was weighed and the guy behind the register joked \"that will be a total of $3.26, if you feel like paying\". I laughed and asked if there was an option not to,to which of course he said \"Well, you could not pay but then I'd have to chase you down in the mall and I guarantee my legs are longer than yours\". It put a smile on my face, as did my cup of frozen awesomeness which lasted all of about 6 minutes.\n\nI really like that you can \"vote\" for the flavours that will be featured next week. Take a green sticker off the wall and put it next to the flavour that really takes your fancy. The flavour with the most votes then gets put in the machines the next week.", "rating": 4, "date": "2012-04-09"}, {"excerpts": ["so I had a few - French vanilla, cheesecake, strawberry and caramel.\n\n"], "author": "Katie B.", "review": "Why don't we have these in London? You would not believe my excitement at seeing this place!\n\nSo you pick your tub - small or large - and I'm telling you, the small is HUGE!! The small size tub is the equivalent of a large tub in London. You wander along all the different flavours of froyo and dispense however much you want into your tub. I was excited so I had a few - French vanilla, cheesecake, strawberry and caramel.\n\nYou then choose your toppings - now, I can't name everything that was there because there was SO much but as I was still excited (even more so in fact) I had lots - cookie dough, brownie bites, strawberries, strawberry boba, mango, sour jelly worms, gummy bears, mini M&Ms, Reece's Pieces... and a few others. What? Don't look at me like that, I'm on holiday! Anyway, I skipped thousands of others so I'd say that was good self control. You can also have sauces but my tub was looking a bit mental and I didn't want to then throw in a load of other confused flavours so I held back.\n\nNext, you go to the counter where they weigh your pot and charge you. So for this humungous pot guess how much they charged... guess! $5!! Can you believe it? Cheap as chips! Then you grab a spoon and go! Simples!\n\nThe staff were a bit dull and lifeless to the point of moody but who cares? For all of this froyo deliciousness I'm really not bothered about their attitude!\n\nFive stars! Come open a joint in London (and charge San Fran prices!)", "rating": 5, "date": "2012-03-20"}, {"excerpts": ["My favorite flavors were cream caramel & red velvet; authentic flavors, thick smooth & creamy texture, and definitely on the sweeter taste. ", "At 45 cents per ounce it's not cheap, but average given the location. ", "Friendly service and ", "I like that you can see them prepping the fresh fruit toppings. ", "Everything looked very fresh. ", "Chipper service."], "author": "Debora L.", "review": "My favorite flavors were cream caramel & red velvet; authentic flavors, thick smooth & creamy texture, and definitely on the sweeter taste. At 45 cents per ounce it's not cheap, but average given the location. Friendly service and I like that you can see them prepping the fresh fruit toppings. Everything looked very fresh. Chipper service.", "rating": 4, "date": "2012-08-09"}, {"excerpts": ["Yellow Cake Batter (perfect for the various toppings they have) and double chocolate, caramel cream\n\nFor tart lovers they usually have mango tart, green apple tart, original tart, passion acai berry tart.\n\n"], "author": "Myrtle M.", "review": "Chong and I have our conversations revolve around this f&&&ing place TO THE POINT where we make plans to meet up just because we're so stoked about \"next weeks flavors\" coming to fruition. \n\nEvery week they have a great assortment of flavors to cater to tart & fruit lovers as well as flavors for the sweet tooth and the best part is these flavors are far from conventional. \n\nFor sweet tooths they always have Yellow Cake Batter (perfect for the various toppings they have) and double chocolate, caramel cream\n\nFor tart lovers they usually have mango tart, green apple tart, original tart, passion acai berry tart.\n\nTo the right is an adorable board showcasing possible flavors for next week and magnets you manipulate towards the flavors you do want. For future flavors they listed TARO, LYCHEE (THOSE HAVE MY VOTE FOR SURE) PEANUT BUTTER, COFFEE CREAM, TOFFEE CRUNCH\n\nI'm used to all the frozen yogurt places only having 4 flavors, usually the only 4 I don't want. I'm also used to frozen yogurt places having a lacking selection of toppings, another feat Yoppi nails in between the eyes. \n\nToppings are ridiculous! There's a million ranging from assorted flavors of mochi (like green tea, strawberry and mango), lychee fruits, berries, kiwis, shredded coconut, the whole cereal aisle from safeway, cheesecake bites, brownie bites, cookie dough bites, nuts, granola, the whole candy aisle in safeway etc. \n\nMy only complaint is this Yoppis never fails to aggravate my claustrophobia. These two gigantic amazons were giving me and chong such dirty looks implying we needed to hurry up and kept trying to squeeze in between us. Who practices such bad manners? we would never do that to anyone no matter how long they were taking. That's beside the point anyway since we weren't taking long at all. I ended up dumping way more toppings than I wanted because glamazon next to me was giving me Death from Snoo Snoo (futurama reference) threats. This caused me to mercilessly drop so many toppings far from their respective containers. YOPPIS DESERVES A BIGGER AND BETTER LOCATION IN THE MALL.", "rating": 5, "date": "2011-08-09"}], "honey": [{"excerpts": ["Got the salted caramel pretzel & the honey. ", "Both were good! "], "author": "Rori V.", "review": "Got the salted caramel pretzel & the honey. Both were good! The cookie dough topping was good as well, better than at other places.", "rating": 5, "date": "2018-11-06"}, {"excerpts": ["Recently I tried their honey and kind of loved it. ", "Great selection of toppings, from fresh fruit to the trendy things like popping boba. ", "It's pricey at $0.45/ounce, but if you're like me, you're only getting a small cup to tide you over as you wait for your significant other finish their shopping."], "author": "Tiffany H.", "review": "It's froyo at the mall but it's actually really good. Their tart flavors are always on point (e.g., original tart, peach tart, lychee tart, etc). Recently I tried their honey and kind of loved it. Great selection of toppings, from fresh fruit to the trendy things like popping boba. It's pricey at $0.45/ounce, but if you're like me, you're only getting a small cup to tide you over as you wait for your significant other finish their shopping.", "rating": 4, "date": "2014-11-09"}, {"excerpts": ["The fruit they had was really fresh too and the honey drizzle added sweetness to the tart yogurt flavors I chose. \n", "I didn't want to pay too much for it, so I got a little (only paid $3.52) ", "but now I regret it and am dying to go back there gain.\n", "Give this place a try!"], "author": "Constance S.", "review": "I saw a sign in this store that said it was \"best in the bay\"\n\nMy gosh, it was. \n\nWhen my friends and I finally found this place, (we kept walking around the mall for like 20 minutes trying to find it) we were skeptical to buy from it because it was really expensive. 49 cents an ounce. And at yogurt land it's 29 cents. So we contemplated for a while and then finally gave in because we really wanted some frozen yogurt\n\nI wish I took a picture of the yogurt I bought but it was just too good to wait. \nOne of the rarest things at the froyo places I go to is whipped cream but this place had it and it was homemade! It tasted so good with the thick and rich yogurt. I have to admit, the yogurt was nothing like I ever tasted before in my life. It was that good. The fruit they had was really fresh too and the honey drizzle added sweetness to the tart yogurt flavors I chose. \nI didn't want to pay too much for it, so I got a little (only paid $3.52) but now I regret it and am dying to go back there gain.\nGive this place a try!", "rating": 5, "date": "2014-12-23"}]}