{"chicken teriyaki salad": [], "hotategai": [], "karaino": [{"excerpts": ["We ended up going with Dragon and Rainbow rolls and various Maki rolls; California, New York, Tokyo, Karaino, Taekka and a few others.  "], "author": "Timothy C.", "review": "You See Sushi provides average quality sushi at exceptional prices!  I've noticed a growing trend of rising prices among bay area sushi restaurants.  From Koo to Taraval Okazuya to Tokyo Express, I've frequently found myself walking out spending over 60 dollars on dinner for two.  I swear every time we get sushi, it gets more and more expensive.  You See Sushi, on the other hand, offered a nice respite from high priced sushi. Additionally the quality of the sushi was better than expected for the price.\n\nWe called in our order so that we could take it home to eat and watch a movie.  My gf and I love sushi, so we usually order an obscene amount, usually 40 - 50 pieces (most likely the reason sushi dinners are always so expensive for us).  We ended up going with Dragon and Rainbow rolls and various Maki rolls; California, New York, Tokyo, Karaino, Taekka and a few others.  We ordered 7 rolls for the two of us, sounds good!\n\nWe drove over to restaurant and I picked up the Sushi and it was only $32!  7 rolls for $32 dollars!  Wow!  Koo was 4 rolls for $75. So I was already happy with that.  The quality of the sushi was decent, the sashimi on top of the Rainbow roll tasted surprisingly fresh.  The one problem is that the rolls were a little small compared to other sushi restaurants.  We knocked out all 7 rolls with ease; usually we're stuffed to the max with that amount.  The California and Dragon rolls were average, nothing spectacular.  My favorite roll and one I'd definitely recommend is the Grilled Salmon Teriyaki roll with Avocado.  The salmon was cooked well, hot with crispy edges and drizzled with teriyaki sauce.  And it was only 3.95!  \n\nI'm giving You See Sushi 3 stars because the price was there and the taste was decent.  However it was not at the level of other upscale sushi places in the city like Koo and Ebisu.  I'll definitely come back when I want a whole boat load of sushi and don't want to break the bank for it!", "rating": 2, "date": "2008-04-08"}], "shiro tekka": [], "sake negi maki": [{"excerpts": ["I ordered the sake negi maki, but I didn't taste any salmon at all. "], "author": "Jian G.", "review": "It's definitely a good and cheap place to get your sushi fill in.\n\nThe service here was very excellent. Shout out to the waitress that waited our food. I ordered the combo number 1 and 2 maki, and she told me that I couldn't finish it and should stop on that second maki. I loled because I'm a big eater. But that recommendation and friendliness was just definitely something to brighten up the dinner.\n\nThe sushi was decent for the price of $13. I had a good 5 pieces of Nigiri. The rice and the craftsmanship is nice. The miso soup had carrots in them, but it was savory and not as watered down as some other sushi diner. The maki is the part that I had confused. I ordered the sake negi maki, but I didn't taste any salmon at all. That was interesting.\n\nOverall, it was a nice diner with decent food and excellent customer service. If I had $20 in my pocket, and I want a nice sushi fill. I will definitely come back.", "rating": 4, "date": "2018-04-02"}], "ebi maki": [], "ham negi maki": [], "tobiko  avocado maki": [], "saba maki": [], "tako maki": [], "california maki with tobiko": [{"excerpts": ["*California Maki with Tobiko ($5.70)\n", "The classic California roll on steroids! "], "author": "Luke H.", "review": "Cute place, cute name.  Pretty good sushi for the price range.\n\nAMBIANCE: [****]\nClean, small, intimate. Nothing fancy, but it really doesn't need to be.\n\nFOOD: [****]\n*Miso Soup ($2.30) \nYUM. To me, one of You See Sushi's biggest standouts is actually their miso soup. It can be hard to find miso soup with the perfect balance of robust saltiness and subtle  underlying flavor, but this place nails it. Love the addition soft tofu and tender cabbage. This soup makes miso happy on a cold, foggy, Sunset night.\n\n*Spinach with Sesame ($4.05)\nSimple and delicious. Tender, nutty, sweet, salty, and ever-so-slightly bitter. Cold and refreshing.\n\n*California Maki with Tobiko ($5.70)\nThe classic California roll on steroids! It almost does not have to be said how good simple crab+avocado+rice+seaweed combo is, but I must mention that the addition of ocean-y tobiko (fish roe) on the outside brings this roll to a whole 'nother level.\n\n*Lady in Red Maki ($11.45)\nI seriously need to find out who this lady in red is, because the sure has something good going. Her sushi taste, I mean. The roll consists of spicy tuna, avocado, and green onion wrapped with the usual rice and seaweed and topped generously with tuna sashimi and a drizzle of spicy mayo. Bam! So good!\n\nOverall, this place is exceptional in the realm of weeknight sushi. However, don't expect the whole omakase, fish-flown-in-from-japan, bow-as-you-enter type of experience you get at a top-of-the-line sushi spot. You See isn't that, but it is damn good at what it does.", "rating": 4, "date": "2015-01-31"}], "new york maki": [], "tokyo maki": [], "philly": [{"excerpts": ["We both ordered lunch bentos accompanied with miso soup and one philly roll. ", "I liked the facts that my teriyaki chicken + tempura were crunchy, teriyaki sauce was slightly sweet, salad dressing was tasty, & the tea was piping hot! ", "The Philadelphia Roll tasted fresh while the rice to fish ratio was good. ", "Overall portion size & food quality exceeded my expectations for it's price. ", "I can't wait to go to lunch here again!"], "author": "Jenn C.", "review": "Lunch specials FTW! This place saves me from eating repetitive cafeteria food at work & is friendly to my wallet. I always seem to catch this place when it closes but luckily was able to grab a bite here during lunch with my coworker. We both ordered lunch bentos accompanied with miso soup and one philly roll. I liked the facts that my teriyaki chicken + tempura were crunchy, teriyaki sauce was slightly sweet, salad dressing was tasty, & the tea was piping hot! The Philadelphia Roll tasted fresh while the rice to fish ratio was good. Overall portion size & food quality exceeded my expectations for it's price. I can't wait to go to lunch here again!", "rating": 4, "date": "2017-07-26"}, {"excerpts": ["A few of my favorite rolls are the forty-niner roll (scallops and avocado, salmon on top with lemon), the philly roll (salmon, avocado, and cream cheese), and the samurai roll (seaweed salad with grilled salmon on the outside). "], "author": "Shawna T.", "review": "This place is a cute mom and pop restaurant hidden in the heart of Inner Sunset. Literally though, the owners are a married duo who has owned this place since 1991. The food is great and so are the prices like everyone says. The bento boxes are especially great because if you sit by the table closest to the kitchen, the hot tempura only has to travel 3 feet to get you so its fresh out of the oil! A few of my favorite rolls are the forty-niner roll (scallops and avocado, salmon on top with lemon), the philly roll (salmon, avocado, and cream cheese), and the samurai roll (seaweed salad with grilled salmon on the outside). Yum, I'm drooling just thinking about it~ \n\nI've been here for years and I love how cozy and welcoming they are. Its definitely worth braving the cold for.", "rating": 5, "date": "2017-02-08"}, {"excerpts": ["My friend let me sample some of their orders: tuna sashimi, salmon sashimi, uni sashimi, lady in red roll, philly roll, rock n' roll, and some other stuff that I forgot the name of. \n\n", "My personal favorite is the lady in red. \n\n"], "author": "Sofia R.", "review": "I stopped by You See Sushi for my friend's birthday dinner. It's a pretty small place so I thought it was strange that she decided to have her dinner there but after seeing the prices on the menu, I understood.\n\nThe scary thing about super cheap prices is worrying about quality. To see cheap prices on sushi is quite enticing regardless. I was still really full from lunch so I only ordered a small order of unagi (eel) sashimi in 3 pieces and a side order of miso soup. Everyone else ordered TONS of sushi.\n\nService was nice but it took them FOREVER to bring our order out. Initially, I figured it was because we had a big group and we ordered a lot but they forgot someone's 2nd order later on. \n\nMy eel was pretty good. The miso soup however, is really strange. It had carrots and cabbage which is something I'm not used to at all. Not bad, just different. I didn't actually like the taste though. I'm not sure what everyone else's thoughts were, but I didn't like it. Cheap though! \n\nMy friend let me sample some of their orders: tuna sashimi, salmon sashimi, uni sashimi, lady in red roll, philly roll, rock n' roll, and some other stuff that I forgot the name of. \n\nThe sashimi is good. No different from other places. The rolls were really good though and I'm impressed because they're cheap. My personal favorite is the lady in red. \n\nGood place.", "rating": 4, "date": "2011-10-08"}, {"excerpts": ["We ordered the Tamago Nigiri, California Roll (real crab) Nigiri, Tobiko Nigiri, Uni Nigiri, Rainbow Roll, Futo Maki, 49er Roll, Hawaiian Roll, Philly Roll and Grilled Salmon Teriyaki Roll. \n\n", "We originally got one order of Tamago, 49er roll, Philly Roll, Rainbow Roll, Tobiko, and the Hawaiian Roll. ", "[http://www.yelp.com/biz_photos/8ed5eduh4zdLGn_y4cCLWA?select=8lqjzL2Dv8vaXA-w3yZUeA]\n] I really enjoyed the Hawaiian roll which had avocado, and scallop topped with Salmon and a thinly sliced lemon. ", "This was a really refreshing sushi roll and delicious as well. ", "All the flavors blended in very nicely. ", "The Tobiko (fish eggs) was really good as well. ", "It tasted fresh and not packaged. ", "The Philly roll was my favorite. ", "The cream cheese wasn't overwhelming and it gave a nice separate flavor along with the avocado and salmon. ", "The Rainbow Roll was ok. ", "There wasn't anything extraordinary about it. ", "IT was basically a california roll with salmon, white tuna, and avocado on top. ", "Philly Roll again for Mona since she loves that cream cheese, the California Nigiri Roll because the couple next to us ordered it ", "and it looked kind of good, Futomaki, and the Grilled Salmon Teriyaki Roll. ", "[http://www.yelp.com/biz_photos/8ed5eduh4zdLGn_y4cCLWA?select=z-Dkab5w6Z3Kjcik5Ehbsg] ", "Everything was delicious once again other than that California Nigiri Roll. "], "author": "Mona C.", "review": "[M]ona: 4 Stars\n[W]ayne: 4 Stars\nAverage: 4 Stars\n\n+ Super Affordable!!! \n+ Accepts Credit Cards\n+ All Sushi are $8 and under\n\n- Slow Service\n- Lights were too low. Kept banging my head on it whenever I went to use the restroom.\n- Bathroom sign should be written in English (Bathroom) instead of Japanese (Otearai)\n\n[W] You See, this place is a pretty good spot for bargain sushi that's very tasty as well. You See is conveniently located close to a UC haha... lame joke... anyways we know I'm never going to aspire to be a comedian. Anyways, we always drive past here but never actually tried it until today and we were pleasantly surprised on how good the sushi tasted for its price. \n\n[M] Let's just say we had A LOT of choices to eat for $50 worth whereas if you were at the other sushi spot down a few blocks, you can only get around 4-5 rolls. Bleh~\n\nWe ordered the Tamago Nigiri, California Roll (real crab) Nigiri, Tobiko Nigiri, Uni Nigiri, Rainbow Roll, Futo Maki, 49er Roll, Hawaiian Roll, Philly Roll and Grilled Salmon Teriyaki Roll. \n\n[W] We originally got one order of Tamago, 49er roll, Philly Roll, Rainbow Roll, Tobiko, and the Hawaiian Roll. [http://www.yelp.com/biz_photos/8ed5eduh4zdLGn_y4cCLWA?select=8lqjzL2Dv8vaXA-w3yZUeA]\n] I really enjoyed the Hawaiian roll which had avocado, and scallop topped with Salmon and a thinly sliced lemon. This was a really refreshing sushi roll and delicious as well. All the flavors blended in very nicely. The Tobiko (fish eggs) was really good as well. It tasted fresh and not packaged. I could taste the sweetness of the eggs so that was good. \n\n[M] The Philly roll was my favorite. The cream cheese wasn't overwhelming and it gave a nice separate flavor along with the avocado and salmon. The Rainbow Roll was ok. There wasn't anything extraordinary about it. IT was basically a california roll with salmon, white tuna, and avocado on top. The Uni Nigiri was not the freshest, but for the price of $2.90 you can't it better anywhere else.\n\n[W] Last on our FIRST PLATE (haha yes we had TWO) was the Tamago. That one was a wow. We've tried Tamago at many places and not everyone can make it right. Rather it's just bland or they make it a little thicker to hide their piece that has no flavor BUT this place made it just right. It was sweet and yummy. It was actually so good that I had to order another one haha.\n\nAfter the first plate, we were still hungry so we went for round two. Normally I would just say F-it and leave it as that but this place had such good value that we couldn't pass up trying the other stuff. So on our second plate, we ordered another round of Tamago, Philly Roll again for Mona since she loves that cream cheese, the California Nigiri Roll because the couple next to us ordered it and it looked kind of good, Futomaki, and the Grilled Salmon Teriyaki Roll. [http://www.yelp.com/biz_photos/8ed5eduh4zdLGn_y4cCLWA?select=z-Dkab5w6Z3Kjcik5Ehbsg] Everything was delicious once again other than that California Nigiri Roll. The California Nigiri is one of those things that are better left to be looked at rather than eaten. \n\n[M] They could've used a tad more mayonnaise to give it some more tang in it because it tasted quite dry and flavorless in my opinion.\n\n[W] Other than the food, once again the service is quite slow. I needed more tea (which just basically tasted like hot water) but I could NOT get any of the servers to get some so I had a plan, put my dirty plates on the table next to me and when they come to clean it up, I'll ask them for more tea... and it worked haha. \n\nOverall the food was pretty good but the service was sub-par. The dining room is pretty small so I don't see why they can't attend to all their clients. Our bill at the end came up to be 50 dollars and change. But like I said earlier, it was a GREAT value. A lot of items on the menu were around 3-4 dollars from what I can recall. Most places only give you a couple of rolls for that price including tax and we had a lot of food to try out. I would definitely come back again because of that reason. Parking can be problem here also because it can get pretty busy sometimes but today we got lucky.\n\n[M] P.S. Thank you Jasmine for the super great recommendation for this place! : )", "rating": 4, "date": "2010-09-10"}, {"excerpts": ["Ordered a rainbow roll and philly crunch rainbow roll. \n\n", "Philly roll was not crunchy rather  fairly soggy. ", "Rainbow roll, oy vey!...where to begin. ", "Fish definitely not fresh, awful texture and an insult to fish. ", "Filling, yea it was a filling that was just bland. "], "author": "Josh V.", "review": "I'm really not a dick nor an avid reviewer but was very disappointed with their food. Ordered a rainbow roll and philly crunch rainbow roll. \n\nPhilly roll was not crunchy rather  fairly soggy. Rainbow roll, oy vey!...where to begin. Fish definitely not fresh, awful texture and an insult to fish. Filling, yea it was a filling that was just bland. Cost about $20 and order takeout.\n\nI live in the area and expected much better.", "rating": 2, "date": "2013-08-15"}, {"excerpts": ["Futomaki, Philly Roll, Takuan Maki and Inari. ", "I was so impressed with everything - what You See Sushi did was great. ", "Actually, what I got was perfect! ", "I was above satisfied with my order. "], "author": "Melissa L.", "review": "Layout: A small but cute place with a home-y vibe to it. \n\nWalls neatly decorated; nothing too distracting to the eye. The atmosphere was very relaxed and the music was at an enjoyable volume. I want to emphasize that this place is very clean and well kept. No broken furniture, no chipped cups or utensils, no peeling walls, nothing out of place, nothing too gross or sticky I wouldn't want to be around. Bathrooms were clean too. \n\nService: We were one of two tables this late Saturday night. Our party of 3 arrived half an hour before closing. Service was good and our orders came really fast! So did the bill. Even though we overstayed 20 minutes after closing they were not rude at all when they asked us to leave. Very nice staff tonight! \n\nFood: While waiting for our food, we were served Miso Soup with cabbage. I've never had cabbage as a substitute for seawood. Nonetheless still delicious. My order consisted of 3 rolls and a side. Futomaki, Philly Roll, Takuan Maki and Inari. I was so impressed with everything - what You See Sushi did was great. Actually, what I got was perfect! I was above satisfied with my order. All my rolls were cleanly cut and was made with such care! \n\nFinal thoughts: Cheap food, great quality. I highly recommend this place and I will be coming back!", "rating": 5, "date": "2011-04-24"}, {"excerpts": ["I can't speak for any of the the shellfish, but the Alaskan roll, Philly roll, and the other ones we got (can't remember the names, but boy they were good", "--they involved unagi) were great.  ", "Excellent prices, not too crowded, and you can get full without breaking the bank."], "author": "diana s.", "review": "A nice, quiet, inexpensive place for sushi and comforting miso soup.  I too am unused to having carrots and cabbage in my miso soup, but ate it anyway.  I do enjoy miso soup, especially on cold days, and the strange vegetables neither added nor detracted from my miso experience.\n\nI can't speak for any of the the shellfish, but the Alaskan roll, Philly roll, and the other ones we got (can't remember the names, but boy they were good--they involved unagi) were great.  Excellent prices, not too crowded, and you can get full without breaking the bank.", "rating": 4, "date": "2007-08-11"}, {"excerpts": ["I would really want to come back and try the Philly cheese roll.  ", "Why?  ", "because its 3.65 a roll and has cream cheese, avocado which is good for the heart and lower cholesterol, and salmon in it.   ", "I want to taste the combination of all three.  ", "It would explode in my mouth.  ", "The trolley bus number 6  take you here."], "author": "John F.", "review": "It really cheap and the minimum for the credit card is only 5.00.  The rolls are cheap.  I tried the chicken teriyaki which is 6.95 and a dollar cheaper at lunch.  I would really want to come back and try the Philly cheese roll.  Why?  because its 3.65 a roll and has cream cheese, avocado which is good for the heart and lower cholesterol, and salmon in it.   I want to taste the combination of all three.  It would explode in my mouth.  The trolley bus number 6  take you here.", "rating": 5, "date": "2009-07-23"}], "lady in red": [{"excerpts": ["My friend let me sample some of their orders: tuna sashimi, salmon sashimi, uni sashimi, lady in red roll, philly roll, rock n' roll, and some other stuff that I forgot the name of. \n\n", "My personal favorite is the lady in red. \n\n"], "author": "Sofia R.", "review": "I stopped by You See Sushi for my friend's birthday dinner. It's a pretty small place so I thought it was strange that she decided to have her dinner there but after seeing the prices on the menu, I understood.\n\nThe scary thing about super cheap prices is worrying about quality. To see cheap prices on sushi is quite enticing regardless. I was still really full from lunch so I only ordered a small order of unagi (eel) sashimi in 3 pieces and a side order of miso soup. Everyone else ordered TONS of sushi.\n\nService was nice but it took them FOREVER to bring our order out. Initially, I figured it was because we had a big group and we ordered a lot but they forgot someone's 2nd order later on. \n\nMy eel was pretty good. The miso soup however, is really strange. It had carrots and cabbage which is something I'm not used to at all. Not bad, just different. I didn't actually like the taste though. I'm not sure what everyone else's thoughts were, but I didn't like it. Cheap though! \n\nMy friend let me sample some of their orders: tuna sashimi, salmon sashimi, uni sashimi, lady in red roll, philly roll, rock n' roll, and some other stuff that I forgot the name of. \n\nThe sashimi is good. No different from other places. The rolls were really good though and I'm impressed because they're cheap. My personal favorite is the lady in red. \n\nGood place.", "rating": 4, "date": "2011-10-08"}, {"excerpts": ["Try the Lady in Red.  ", "It was yum!"], "author": "Kris L.", "review": "If you're on a budget, this is a decent place to go for sushi. \n\nBeing so close to UCSF, you wouldn't think the quality would be that great, but it's really pretty good.  The fish is relatively fresh and the price is right.\n\nI was craving sushi this past weekend and that always adds up, so we decided to try You See Sushi.  We didn't eat there, but called in our order and picked it up.  There was a ton of parking everywhere during prime weekend dinner hour, but it might have been because it was a rainy night.\n\nTry the Lady in Red.  It was yum!", "rating": 3, "date": "2012-11-30"}, {"excerpts": ["*Lady in Red Maki ($11.45)\nI seriously need to find out who this lady in red is, because the sure has something good going. ", "Her sushi taste, I mean. ", "The roll consists of spicy tuna, avocado, and green onion wrapped with the usual rice and seaweed and topped generously with tuna sashimi and a drizzle of spicy mayo. ", "Bam! "], "author": "Luke H.", "review": "Cute place, cute name.  Pretty good sushi for the price range.\n\nAMBIANCE: [****]\nClean, small, intimate. Nothing fancy, but it really doesn't need to be.\n\nFOOD: [****]\n*Miso Soup ($2.30) \nYUM. To me, one of You See Sushi's biggest standouts is actually their miso soup. It can be hard to find miso soup with the perfect balance of robust saltiness and subtle  underlying flavor, but this place nails it. Love the addition soft tofu and tender cabbage. This soup makes miso happy on a cold, foggy, Sunset night.\n\n*Spinach with Sesame ($4.05)\nSimple and delicious. Tender, nutty, sweet, salty, and ever-so-slightly bitter. Cold and refreshing.\n\n*California Maki with Tobiko ($5.70)\nThe classic California roll on steroids! It almost does not have to be said how good simple crab+avocado+rice+seaweed combo is, but I must mention that the addition of ocean-y tobiko (fish roe) on the outside brings this roll to a whole 'nother level.\n\n*Lady in Red Maki ($11.45)\nI seriously need to find out who this lady in red is, because the sure has something good going. Her sushi taste, I mean. The roll consists of spicy tuna, avocado, and green onion wrapped with the usual rice and seaweed and topped generously with tuna sashimi and a drizzle of spicy mayo. Bam! So good!\n\nOverall, this place is exceptional in the realm of weeknight sushi. However, don't expect the whole omakase, fish-flown-in-from-japan, bow-as-you-enter type of experience you get at a top-of-the-line sushi spot. You See isn't that, but it is damn good at what it does.", "rating": 4, "date": "2015-01-31"}, {"excerpts": ["I ordered seaweed salad, sake, and Lady in Red roll (spicy tuna/avocado wrap tuna and green onion).  ", "Yes, that's a snack for me.  ", "Don't judge.  ", "I must admit, pretty decent quality fish!  ", "It's no Koo ", "but it does the job"], "author": "Tammy N.", "review": "I am going to sound like such a fatty but whatever.  My fellow yelpers don't judge! (hopefully).  I came here as a pre-dinner snack because I was too hungry to wait for my friends to go to Pomelo (which is right next door).  The service is great.  Very attentive and quick.  And the restaurant itself is very small and quaint.  I ordered seaweed salad, sake, and Lady in Red roll (spicy tuna/avocado wrap tuna and green onion).  Yes, that's a snack for me.  Don't judge.  I must admit, pretty decent quality fish!  It's no Koo but it does the job", "rating": 3, "date": "2013-12-09"}, {"excerpts": ["lady in red is fantastic.  ", "give it a shot, you'll be glad."], "author": "Ryan H.", "review": "love it.  great sushi, amazing sushi for the price.  pretty sure the tuna was melting in our mouths.  we went in and were the only ones in there.  the environment isn't terribly stimulating, but we were hungry for sushi not stimulation and we fed ourselves in excess for rather cheap.  lady in red is fantastic.  give it a shot, you'll be glad.", "rating": 5, "date": "2009-05-07"}], "salmon tempura roll": [{"excerpts": ["I highly recommend the salmon tempura roll and asparagus tempura roll. "], "author": "Giordano G.", "review": "One of my favorite sushi spots in the city. It's Japanese owned (bonus) and the sushi isn't expensive and overrated like other spots in this hood. I feel like it took years to find a decent spot as most places over change for over filled mayonnaise rolls. \n\nI highly recommend the salmon tempura roll and asparagus tempura roll. Totally yummy. \n\n\nThe only negative is the seating isn't very comfortable (tables are really close) and the tables are always sticky. Families seem to enjoy this place, which is great but can sometimes mean bratty kids screaming next to you and I mean right next to you. The sushi makes up for that though.", "rating": 4, "date": "2014-06-08"}], "tai tempura roll  cucumber  spicy sauce": [], "asparagus tempura roll with eel": [], "california crunch": [], "philly crunch": [{"excerpts": ["Ordered a rainbow roll and philly crunch rainbow roll. \n\n", "Philly roll was not crunchy rather  fairly soggy. ", "Rainbow roll, oy vey!...where to begin. ", "Fish definitely not fresh, awful texture and an insult to fish. ", "Filling, yea it was a filling that was just bland. "], "author": "Josh V.", "review": "I'm really not a dick nor an avid reviewer but was very disappointed with their food. Ordered a rainbow roll and philly crunch rainbow roll. \n\nPhilly roll was not crunchy rather  fairly soggy. Rainbow roll, oy vey!...where to begin. Fish definitely not fresh, awful texture and an insult to fish. Filling, yea it was a filling that was just bland. Cost about $20 and order takeout.\n\nI live in the area and expected much better.", "rating": 2, "date": "2013-08-15"}], "kappa  cucumber roll": [], "shiitake  mushroom roll": [], "kampyo": [{"excerpts": ["Where else can you listen to the Bee Gees while dining on kampyo-maki?"], "author": "t k.", "review": "Although not the art and flavor of Koo, this is the most casual, comfortable, affordable sushi joint in the city.  Consistently decent food that's cheaper than just about any other restuarant in the Inner Sunset - and wait staff that learn all your quirks if you become regular customers.  Highly recommended.  Where else can you listen to the Bee Gees while dining on kampyo-maki?", "rating": 5, "date": "2007-05-29"}], "takuan": [{"excerpts": ["Futomaki, Philly Roll, Takuan Maki and Inari. ", "I was so impressed with everything - what You See Sushi did was great. ", "Actually, what I got was perfect! ", "I was above satisfied with my order. "], "author": "Melissa L.", "review": "Layout: A small but cute place with a home-y vibe to it. \n\nWalls neatly decorated; nothing too distracting to the eye. The atmosphere was very relaxed and the music was at an enjoyable volume. I want to emphasize that this place is very clean and well kept. No broken furniture, no chipped cups or utensils, no peeling walls, nothing out of place, nothing too gross or sticky I wouldn't want to be around. Bathrooms were clean too. \n\nService: We were one of two tables this late Saturday night. Our party of 3 arrived half an hour before closing. Service was good and our orders came really fast! So did the bill. Even though we overstayed 20 minutes after closing they were not rude at all when they asked us to leave. Very nice staff tonight! \n\nFood: While waiting for our food, we were served Miso Soup with cabbage. I've never had cabbage as a substitute for seawood. Nonetheless still delicious. My order consisted of 3 rolls and a side. Futomaki, Philly Roll, Takuan Maki and Inari. I was so impressed with everything - what You See Sushi did was great. Actually, what I got was perfect! I was above satisfied with my order. All my rolls were cleanly cut and was made with such care! \n\nFinal thoughts: Cheap food, great quality. I highly recommend this place and I will be coming back!", "rating": 5, "date": "2011-04-24"}], "ume plum  cucumber roll": [], "yam tempura roll": [], "mixed veggie roll": [], "prawn  veggies": [], "prawn  pieces": [], "mixed veggies": [], "plain rice": [{"excerpts": ["i ordered things that should be nearly impossible to screw up: edamame, miso soup, plain rice. ", "the rice was fine. ", "the edamame was way too salty and looked pretty beat-up. ", "what was really sad, though, was the miso soup: it was not miso soup, but watery flavorless broth with what appeared to be cabbage and no pieces of tofu at all! "], "author": "Cara F.", "review": "i had hoped this place would be ok-mediocre, because it's right near my house. i ordered things that should be nearly impossible to screw up: edamame, miso soup, plain rice. the rice was fine. the edamame was way too salty and looked pretty beat-up. what was really sad, though, was the miso soup: it was not miso soup, but watery flavorless broth with what appeared to be cabbage and no pieces of tofu at all! cheap miso soup mixes are thousands of times better than this crap.\n\nthe restaurant is also completely filthy with an open kitchen so you can see just how many health codes are being violated. it is disgusting and it boggles my mind that people would order sushi here - it seems like a suicide mission. \n\ni guess take-out is the big business, because there are never more than 4 people eating in the restaurant and i'm not sure how else it would stay in business for so long. it needs to shut down so that a halfway decent restaurant can move in.", "rating": 1, "date": "2011-03-15"}], "ponzu sauce": [], "extra wasabi": []}