{"calpico japanese drink": [], "asahi": [], "sapporo": [], "tempura shrimp and vegetables": [], "shrimp tempura": [{"excerpts": ["I had a beef teriyaki & shrimp tempura combination bento box that wasn't bad, but it wasn't full of flavor or spectacular either.  "], "author": "Cryss S.", "review": "The food was mediocre.  I had a beef teriyaki & shrimp tempura combination bento box that wasn't bad, but it wasn't full of flavor or spectacular either.  It would've been bland w/o the teriyaki sauce.  \n\nThe service was seriously slow & lacking. It took a really long time to get my order placed & then one of the cooks in the back had to tell my waitress I was waiting at the register to pay because her nose was buried in her cell phone.  o_O", "rating": 2, "date": "2015-10-27"}, {"excerpts": ["Again I ordered the lunch special with shrimp tempura. ", "I thought there was too much batter on it. ", "Though I often like fried food that way, I have to say it doesn't feel right for tempura.\n\n"], "author": "H K.", "review": "I returned here yesterday after not visiting here for some time because I was thinking about their lunch combo which I came for in the past. The price has gone up to $8.95 since my previous review. I notice the staff has changed, and service is not quite as good as before. I had to flag down the waitress to place an order even though she walked by many times and probably should've noticed I was waiting for devices. The food took a long time to come, probably at least 20 minutes. Though the restaurant was fairly full at the time, the time wait was noteworthy.\n\nAgain I ordered the lunch special with shrimp tempura. I thought there was too much batter on it. Though I often like fried food that way, I have to say it doesn't feel right for tempura.\n\nI'll probably still come back occasionally because it's convenient for me and there's normally ample parking since its part of Lakeshore Plaza. I just got to keep in mind not to expect a quick lunch if it's on a weekend and the service is different from when I came previously.", "rating": 2, "date": "2015-04-12"}, {"excerpts": ["My girlfriend and I had teriyaki with the all shrimp tempura combo along with California rolls. ", "The only downside of this place is the prices. ", "For average lunch of two people the bill was in the low $40s."], "author": "Jordan S.", "review": "Decided to check this place out because we always walked by it. We went here last week, and the place was pretty empty in the afternoon. We found parking easy and our waiter was very nice and checked on us regularly. We liked the booth seats because of the elevated walls. The entire place seemed very clean too. \n\nMy girlfriend and I had teriyaki with the all shrimp tempura combo along with California rolls. The only downside of this place is the prices. For average lunch of two people the bill was in the low $40s.", "rating": 4, "date": "2015-03-02"}, {"excerpts": ["The shrimp tempura tasted worst than the kind you can buy in a pack at Costco.\n\n"], "author": "Julia Q.", "review": "I was looking forward to some affordable Japanese place and unfortunately stumbled uptown this place.\n\nI got the Tempura soba and this was about the most bland soba I have had in my life.\nThe noodles were of the right texture and but Tempura was straight up disgusting.\nIt was thick and chewy. I had a piece of yam that was cut way to thick. The batter they used must have been the most low quality batter in the market. The shrimp tempura tasted worst than the kind you can buy in a pack at Costco.\n\nThe person I was eating with got the Sesame chicken lunch special. The salad dressing was a little too sour and the California rolls were okay. That's why I'm putting two stars instead of one.\n\nIn conclusion, I was very very disappointed in the food quality here.\n\nAlso, the service was alright. It seemed like the waiter would rather do anything but get me a cup of water! Sorry.\n\nI will not be coming back here again.", "rating": 2, "date": "2015-04-08"}, {"excerpts": ["They serve a lot of items that are in combination with shrimp tempura. ", "Don't get me wrong, I love a good crunchy roll, but it would be nice to see some of them replaced by non-fried items."], "author": "Jennifer P.", "review": "What was Toyo sushi is now Yuyu sushi. I think it's still the same place though. I don't think the menu has changed. That said it's an okay place. They serve a lot of items that are in combination with shrimp tempura. Don't get me wrong, I love a good crunchy roll, but it would be nice to see some of them replaced by non-fried items.", "rating": 3, "date": "2012-04-11"}], "onion rings tempura": [], "soft shell crab": [], "fried ika": [], "gyoza": [], "kaki fried": [], "hamachi kama": [], "salmon kama": [{"excerpts": ["The salmon kama. ", "Amazing! ", "Perfectly seasoned. ", "Sauce hit the spot. "], "author": "tony c.", "review": "The salmon kama. Amazing! Perfectly seasoned. Sauce hit the spot. Also had the sfpd roll. Good tasting. The rolls were just oversized. Needed two bites for each piece. Got messy.  Over all nice place. Busy. The seat backs are to stiff, straight, and huge. Blocks the view of everything.", "rating": 3, "date": "2014-03-30"}], "edamame soy bean": [], "vegetable spring roll": [], "miso clam soup": [], "seaweed salad": [], "shrimp tempura roll": [], "dragon roll": [], "caterpillar roll": [], "ichiban roll": [], "walnut creek roll": [], "sfpd roll": [{"excerpts": ["Also had the sfpd roll. ", "Good tasting. ", "The rolls were just oversized. ", "Needed two bites for each piece. ", "Got messy.  ", "Over all nice place. ", "Busy. ", "The seat backs are to stiff, straight, and huge. ", "Blocks the view of everything."], "author": "tony c.", "review": "The salmon kama. Amazing! Perfectly seasoned. Sauce hit the spot. Also had the sfpd roll. Good tasting. The rolls were just oversized. Needed two bites for each piece. Got messy.  Over all nice place. Busy. The seat backs are to stiff, straight, and huge. Blocks the view of everything.", "rating": 3, "date": "2014-03-30"}, {"excerpts": ["I ordered the Tempura Dinner Special and a SFPD Roll. ", "Bf had the Teriyaki Beef Dinner Special and a House Roll. ", "I am a huge fan of sushi and Japanese food ", "and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. ", "This place is by far the WORST! ", "My tempura dinner special was okay nothing special but who can mess up tempura right? ", "It came with a spicy tuna roll and the flavor was just not there. ", "It was not spicy and so tasteless. ", "The miso soup is bland and the salad is also lacking. ", "The Bf's teriyaki beef dinner was horrible. ", "It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! ", "He said it was burnt and dry. ", "Not enough for a man to be full! ", "I think I could have finished the whole thing and still be hungry. ", "My tempura dinner special was okay nothing special but who can mess up tempura right? ", "It came with a spicy tuna roll and the flavor was just not there. ", "It was not spicy and so tasteless. ", "The miso soup is bland and the salad is also lacking. ", "The Bf's teriyaki beef dinner was horrible. ", "It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! ", "He said it was burnt and dry. ", "Not enough for a man to be full! ", "I think I could have finished the whole thing and still be hungry. ", "The House Roll and SFPD Roll was even worst! ", "Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. ", "Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. ", "I tried to bring it to the attention of the waitress so that they could be more careful. ", "I mean there are kids that eat there! ", "Her reply was, \"oh... fish sometimes have bones.", "\" ", "Well no shit really?! ", "They do?! ", "Oh and they wanted to charge $1 to add cream cheese to my sfpd roll which was already pricey at $11.95. ", "NEVER AGAIN!"], "author": "Jeanette N.", "review": "This place is horrible! I ordered the Tempura Dinner Special and a SFPD Roll. Bf had the Teriyaki Beef Dinner Special and a House Roll. I am a huge fan of sushi and Japanese food and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. This place is by far the WORST! My tempura dinner special was okay nothing special but who can mess up tempura right? It came with a spicy tuna roll and the flavor was just not there. It was not spicy and so tasteless. The miso soup is bland and the salad is also lacking. The Bf's teriyaki beef dinner was horrible. It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! He said it was burnt and dry. Not enough for a man to be full! I think I could have finished the whole thing and still be hungry. The House Roll and SFPD Roll was even worst! Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. I tried to bring it to the attention of the waitress so that they could be more careful. I mean there are kids that eat there! Her reply was, \"oh... fish sometimes have bones.\" Well no shit really?! They do?! A simple apology would have sufficed!\n\nI will not be returning to this restaurant. I only came here out of convenience. Service was slow, even though the place wasn't even 1/2 full on a friday night and the food sucks. Total was $50 not including tip for tasteless food, bones included. Oh and they wanted to charge $1 to add cream cheese to my sfpd roll which was already pricey at $11.95. NEVER AGAIN!", "rating": 1, "date": "2012-03-12"}], "palm spring roll": [], "spicy crabmeat tempura roll": [], "island roll": [], "spicy tuna tempura roll": [], "king eel roll": [], "dynamite roll": [], "lover roll": [], "house roll": [{"excerpts": ["Bf had the Teriyaki Beef Dinner Special and a House Roll. ", "I am a huge fan of sushi and Japanese food ", "and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. ", "This place is by far the WORST! ", "The House Roll and SFPD Roll was even worst! ", "Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. ", "Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. ", "I tried to bring it to the attention of the waitress so that they could be more careful. ", "I mean there are kids that eat there! ", "Her reply was, \"oh... fish sometimes have bones.", "\" ", "Well no shit really?! ", "They do?! "], "author": "Jeanette N.", "review": "This place is horrible! I ordered the Tempura Dinner Special and a SFPD Roll. Bf had the Teriyaki Beef Dinner Special and a House Roll. I am a huge fan of sushi and Japanese food and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. This place is by far the WORST! My tempura dinner special was okay nothing special but who can mess up tempura right? It came with a spicy tuna roll and the flavor was just not there. It was not spicy and so tasteless. The miso soup is bland and the salad is also lacking. The Bf's teriyaki beef dinner was horrible. It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! He said it was burnt and dry. Not enough for a man to be full! I think I could have finished the whole thing and still be hungry. The House Roll and SFPD Roll was even worst! Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. I tried to bring it to the attention of the waitress so that they could be more careful. I mean there are kids that eat there! Her reply was, \"oh... fish sometimes have bones.\" Well no shit really?! They do?! A simple apology would have sufficed!\n\nI will not be returning to this restaurant. I only came here out of convenience. Service was slow, even though the place wasn't even 1/2 full on a friday night and the food sucks. Total was $50 not including tip for tasteless food, bones included. Oh and they wanted to charge $1 to add cream cheese to my sfpd roll which was already pricey at $11.95. NEVER AGAIN!", "rating": 1, "date": "2012-03-12"}], "cherry blossom roll": [], "sunset roll": [], "kami roll": [], "ers roll": [], "alaska roll": [], "amigo roll": [], "lion king roll": [{"excerpts": ["After finally receiving my order, I took a look at my Lion King Roll and the salmon was completely undercooked with no sauce, leaving the roll dry and partially raw. ", "For those familiar with Lion King roll, you'd know the two main things that make up this role are the baked salmon and house sauce glazed on top. \n\n"], "author": "Lauren J.", "review": "Waited an HOUR for my takeout order when I was told the wait would be 20min. Mind you there were only 3-4 other parties in the restaurant. The server continued to avoid me and did nothing to compensate for the delay in time with my order. After finally receiving my order, I took a look at my Lion King Roll and the salmon was completely undercooked with no sauce, leaving the roll dry and partially raw. For those familiar with Lion King roll, you'd know the two main things that make up this role are the baked salmon and house sauce glazed on top. \n\nMy mom also go tempura udon and they only have her 2 pieces of tempura. I'm not sure if they are just skimpy with to-go orders thinking no one would notice, but I'm definitely never coming back here. I should've looked at the poor ratings before eating from this place. I really wanted to like this place but I was so disappointed.", "rating": 1, "date": "2017-12-19"}], "snow roll": [{"excerpts": ["Ordered snow Roll , that was supposed to have scallops and butter fish. "], "author": "Masha M.", "review": "Why so tiny ????\nEven special rolls are super small , yet the price is regular.  \n\nOrdered snow Roll , that was supposed to have scallops and butter fish. Instead they brought cucumber roll with tobiko and spicy mayo on top. \n\nForgot our appetizers and every roll comes out in 15 min intervals. \n\n\nNot coming back. Ever ! Whoever wrote that this place works as a sushi fix was wrong.  Sorry", "rating": 2, "date": "2018-10-07"}], "lakeshore roll": [{"excerpts": ["I had the udon and wifey had the lakeshore roll and Fuji rolls. \n\n"], "author": "Bill M.", "review": "So we had dinner here tonight. I had the udon and wifey had the lakeshore roll and Fuji rolls. \n\nService was good, I don't understand the complaints. \n\nI was pleasantly surprised by the lychee soft drink. Food was tasty and well prepared. \n\nAmbiance is fine, certainly not hakkasan but you're in a strip mall. For a neighborhood sushi and tempura place its very good and we will be coming back!", "rating": 4, "date": "2014-11-22"}], "yummyyummy roll": [], "hokkaido roll": [], "mt fuji roll": [], "sushi combo alfredo": [], "sushi combo b": [], "dinner special": [{"excerpts": ["We liked their Spider rolls, Rainbow rolls, Oyakodon, Sukiyaki, and dinner special bento boxes."], "author": "TY H.", "review": "We liked this local Japanese place.  It has a good selection of items to choose from, and they taste very good, too..  This is our regular lunch or dinner spot if we don't want to cook.  \n\nWe liked their Spider rolls, Rainbow rolls, Oyakodon, Sukiyaki, and dinner special bento boxes.", "rating": 4, "date": "2017-05-10"}, {"excerpts": ["He also had the dinner special with sesame chicken and spicy tuna roll. ", "He was very disappointed in both. ", "Top that off with a $10 little bottle of sake that wouldn't be more than $6 elsewhere "], "author": "Jill M.", "review": "I wish we'd read the reviews on Yelp before going here on a whim. \n\nWhen we first walked in, we were greeted and seated and then she walked away. Didn't take our drink orders, bring us water, or anything. We waited at least 5 minutes to have our order taken and they were not at all busy. There was one other couple in there and that was it.\n\nMy husband had the 8 pc. sashimi with Albacore and Hamachi. He also had the dinner special with sesame chicken and spicy tuna roll. He was very disappointed in both. Top that off with a $10 little bottle of sake that wouldn't be more than $6 elsewhere and he was not pleased.\n\nI had steamed rice. That's it. I'm a vegetarian who doesn't like seaweed and they had no soy paper wrapper alternative like most other places. Even at that, the steamed rice left much to be desired. I don't know how you can not make good steamed rice, but they managed.\n\nOnce we were done, again, we had to wait at least 5 minutes to pay and leave and even then it was only because we asked for help. The waitress/hostess was in the back, out of sight. There was an employee at the front desk doing some type of accounting. My husband asked her if she worked there and she said she was, but she was on break. She did end up helping us, but made us feel like we were imposing.\n\nMy iced tea was ok.\n\nThey are off of our list for the future for sure.", "rating": 1, "date": "2012-06-21"}, {"excerpts": ["Grabbed a dinner special for $9.95  with the Chicken Katsu and some RocknRoll on the side.  ", "Chicken Katsu was alright, ", "the sauce that it came with didn't go very well with the Katsu. ", "The roll was tiny and mediocre. "], "author": "Harriet W.", "review": "Average to mediocre food.. I'd say its more of a 2.5 STARS, but I've definitely experienced better, as the yelp rating goes. \n\nGrabbed a dinner special for $9.95  with the Chicken Katsu and some RocknRoll on the side.  Chicken Katsu was alright, the sauce that it came with didn't go very well with the Katsu. The roll was tiny and mediocre. But hey, I really wasn't expecting much anyway, esp after seeing the reviews right after I ordered. \n\nI think I'll pass on this place the next time.", "rating": 2, "date": "2013-04-29"}, {"excerpts": ["The beef teriyaki dinner special at Yuyu ", "had maybe a fourth of the beef, 6 miniscule pieces of sushi, miso soup, salad, rice, [no ice cream] and tea for $9.95. \n", "I understand that you get less beef in a combo meal, but this was ridiculous. ", "It was about the size of a hockey puck (minus all the fat) but half the width. ", "The sushi had the barest minimum of eel and avocado needed to dub it a rock n' roll and not a sour rice cigar. ", "The miso soup had one piece of tofu and two wakame[s]. ", "The tea cup had something large and crusty stuck to it. \n", "At least if your food is only passable, give bigger portions like Kiki does, ok? ", "The two stars is because the food wasn't outright bad, and the service was decent. ", "I am never coming back."], "author": "Skye L.", "review": "Wow, this place is so meh only a dozen people have bothered to Yelp about it? New low! And how old is this place?\n\nAll snark aside, this place is so forgettable. Like many Chinese-run Japanese places, the food is edible if not authentic. HOWEVER. Living in SF, one gets to know a handful of really good Chinese-run Japanese restaurants, and this is not one of them. Compare Yuyu to Okazu Ya: Around $10.95 for a huge plate of perfectly cooked beef teriyaki, a big bowl of salad, rice, miso soup, tea, and ice cream at Okazu Ya. The beef teriyaki dinner special at Yuyu had maybe a fourth of the beef, 6 miniscule pieces of sushi, miso soup, salad, rice, [no ice cream] and tea for $9.95. \nI understand that you get less beef in a combo meal, but this was ridiculous. It was about the size of a hockey puck (minus all the fat) but half the width. The sushi had the barest minimum of eel and avocado needed to dub it a rock n' roll and not a sour rice cigar. The miso soup had one piece of tofu and two wakame[s]. The tea cup had something large and crusty stuck to it. \nAt least if your food is only passable, give bigger portions like Kiki does, ok? The two stars is because the food wasn't outright bad, and the service was decent. I am never coming back.", "rating": 2, "date": "2012-07-05"}, {"excerpts": ["I ordered the Tempura Dinner Special and a SFPD Roll. ", "Bf had the Teriyaki Beef Dinner Special and a House Roll. ", "I am a huge fan of sushi and Japanese food ", "and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. ", "This place is by far the WORST! ", "My tempura dinner special was okay nothing special but who can mess up tempura right? ", "It came with a spicy tuna roll and the flavor was just not there. ", "It was not spicy and so tasteless. ", "The miso soup is bland and the salad is also lacking. ", "The Bf's teriyaki beef dinner was horrible. ", "It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! ", "He said it was burnt and dry. ", "Not enough for a man to be full! ", "I think I could have finished the whole thing and still be hungry. ", "My tempura dinner special was okay nothing special but who can mess up tempura right? ", "It came with a spicy tuna roll and the flavor was just not there. ", "It was not spicy and so tasteless. ", "The miso soup is bland and the salad is also lacking. ", "The Bf's teriyaki beef dinner was horrible. ", "It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! ", "He said it was burnt and dry. ", "Not enough for a man to be full! ", "I think I could have finished the whole thing and still be hungry. ", "The House Roll and SFPD Roll was even worst! ", "Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. ", "Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. ", "I tried to bring it to the attention of the waitress so that they could be more careful. ", "I mean there are kids that eat there! ", "Her reply was, \"oh... fish sometimes have bones.", "\" ", "Well no shit really?! ", "They do?! ", "Oh and they wanted to charge $1 to add cream cheese to my sfpd roll which was already pricey at $11.95. ", "NEVER AGAIN!"], "author": "Jeanette N.", "review": "This place is horrible! I ordered the Tempura Dinner Special and a SFPD Roll. Bf had the Teriyaki Beef Dinner Special and a House Roll. I am a huge fan of sushi and Japanese food and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. This place is by far the WORST! My tempura dinner special was okay nothing special but who can mess up tempura right? It came with a spicy tuna roll and the flavor was just not there. It was not spicy and so tasteless. The miso soup is bland and the salad is also lacking. The Bf's teriyaki beef dinner was horrible. It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! He said it was burnt and dry. Not enough for a man to be full! I think I could have finished the whole thing and still be hungry. The House Roll and SFPD Roll was even worst! Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. I tried to bring it to the attention of the waitress so that they could be more careful. I mean there are kids that eat there! Her reply was, \"oh... fish sometimes have bones.\" Well no shit really?! They do?! A simple apology would have sufficed!\n\nI will not be returning to this restaurant. I only came here out of convenience. Service was slow, even though the place wasn't even 1/2 full on a friday night and the food sucks. Total was $50 not including tip for tasteless food, bones included. Oh and they wanted to charge $1 to add cream cheese to my sfpd roll which was already pricey at $11.95. NEVER AGAIN!", "rating": 1, "date": "2012-03-12"}], "gobo maki": [], "japanese vegetarian maki": [], "salmon avocado roll": [{"excerpts": ["Two with california roll and one with a raw salmon avocado roll. ", "At first glance the food looks like a decent portion. ", "The food I must say meets the eye, but the taste does not match up. ", "Very disappointed as it was our first time. ", "The teriyaki chicken was a bit cold in temperature, it was a bit dry for me, and the teriyaki sauce was too sweet. ", "The sesame chicken was on point with crunch texture, again same teriyaki sauce that was too sweet, and it was a hit or miss between dry and moist chicken pieces. ", "As for the california roll it wasn't bad, but it wasn't a \"WOW!", "\" either. ", "The house special roll wasn't anything special at all...", "I felt as if it was missing something I tried soy sauce ", "and it didn't help, but ", "when I dipped it into the salad dressing it immediately tasted better. ", "That's when I knew it was missing a vinegar taste in the sushi rice. ", "Also the demeanor of the waitress was lackluster. ", "When our order was taken we were never offered tea or water. ", "We had to ask for it. ", "Our miso soup never came with spoons, again we had to ask for it. ", "The last waitress that came was trying too hard to be nice, but came off rude. ", "We felt as if we were rushed out. ", "She cleared one plate and brought us our bill we set the money down ", "and she quickly swiped it off the table. ", "Our change was returned and we set down the tip and to our surprise the very same hand that brought us the bill and swiped the money the first time swiped the tip off the table yet again. ", "Seriously I've never went to a restaurant where they take the tip from you while you're still at the table finishing up. ", "Usually they will wait till the patrons left the restaurant before retrieving the tip. ", "Never again will my family be coming back. ", "We are better off buying sushi to go from Lucky's Supermarket across the way in the same plaza."], "author": "Tina L.", "review": "Came in on 8/16/2017 for dinner at around 6:30pm or so. We've always seen this sushi restaurant in the plaza, but never really mustered up the energy to try. On this particular day my family of 4 with one preteen and a tiny tot decided to give in and try, because my tot wanted sushi. Upon arrival we were greeted very swiftly and quickly. The restaurant was a bit empty only 3 tables being occupied. So we thought great we were going to get serviced fast. The waitress assisting our table gave us a substantial amount of time to choose our foods off the menu which I was thankful for as I can be a bit indecisive. My family ordered 3 bento boxes and a house special roll. Two of the bento boxes were teriyaki chicken and one was sesame chicken. Two with california roll and one with a raw salmon avocado roll. At first glance the food looks like a decent portion. The food I must say meets the eye, but the taste does not match up. Very disappointed as it was our first time. The teriyaki chicken was a bit cold in temperature, it was a bit dry for me, and the teriyaki sauce was too sweet. The sesame chicken was on point with crunch texture, again same teriyaki sauce that was too sweet, and it was a hit or miss between dry and moist chicken pieces. As for the california roll it wasn't bad, but it wasn't a \"WOW!\" either. The house special roll wasn't anything special at all...I felt as if it was missing something I tried soy sauce and it didn't help, but when I dipped it into the salad dressing it immediately tasted better. That's when I knew it was missing a vinegar taste in the sushi rice. Also the demeanor of the waitress was lackluster. When our order was taken we were never offered tea or water. We had to ask for it. Our miso soup never came with spoons, again we had to ask for it. The last waitress that came was trying too hard to be nice, but came off rude. We felt as if we were rushed out. She cleared one plate and brought us our bill we set the money down and she quickly swiped it off the table. Our change was returned and we set down the tip and to our surprise the very same hand that brought us the bill and swiped the money the first time swiped the tip off the table yet again. Seriously I've never went to a restaurant where they take the tip from you while you're still at the table finishing up. Usually they will wait till the patrons left the restaurant before retrieving the tip. Never again will my family be coming back. We are better off buying sushi to go from Lucky's Supermarket across the way in the same plaza.", "rating": 1, "date": "2017-08-17"}], "spicy white tuna roll": [], "spicy hamachi roll": [], "rockn roll": [], "spicy salmon roll": [], "spicy scallop roll": [], "negihama roll": [], "garlic white tuna roll": [], "tekka maki": [], "new york maki": [], "philadelphia roll": [], "piece sashimi": [{"excerpts": ["Always order their 10 piece sashimi and never fails to amaze me. ", "Fast and friendly service. ", "Food comes out in a timely manner. ", "Has many options for rolls and other foods. ", "Love coming here. ", "Take out service is good too"], "author": "Tiffany C.", "review": "Their sashimi is AMAZING. SUPER FRESH AND GOOD STUFF. Always order their 10 piece sashimi and never fails to amaze me. Fast and friendly service. Food comes out in a timely manner. Has many options for rolls and other foods. Love coming here. Take out service is good too", "rating": 5, "date": "2018-08-11"}], "piece combination sushi": [], "tempura": [{"excerpts": ["My mom also go tempura udon and they only have her 2 pieces of tempura. ", "I'm not sure if they are just skimpy with to-go orders thinking no one would notice, but I'm definitely never coming back here. ", "I should've looked at the poor ratings before eating from this place. ", "I really wanted to like this place ", "but I was so disappointed."], "author": "Lauren J.", "review": "Waited an HOUR for my takeout order when I was told the wait would be 20min. Mind you there were only 3-4 other parties in the restaurant. The server continued to avoid me and did nothing to compensate for the delay in time with my order. After finally receiving my order, I took a look at my Lion King Roll and the salmon was completely undercooked with no sauce, leaving the roll dry and partially raw. For those familiar with Lion King roll, you'd know the two main things that make up this role are the baked salmon and house sauce glazed on top. \n\nMy mom also go tempura udon and they only have her 2 pieces of tempura. I'm not sure if they are just skimpy with to-go orders thinking no one would notice, but I'm definitely never coming back here. I should've looked at the poor ratings before eating from this place. I really wanted to like this place but I was so disappointed.", "rating": 1, "date": "2017-12-19"}, {"excerpts": ["We also got the Salmon teriyaki plate which was cooked perfect with vegetable tempura that was super yummy. ", "Two thumbs up to the chefs!"], "author": "Lety C.", "review": "Had a great date night here last week! The rolls were very tasty. I ordered the heaven roll and was definitely in heaven. We also got the Salmon teriyaki plate which was cooked perfect with vegetable tempura that was super yummy. Two thumbs up to the chefs!", "rating": 5, "date": "2017-11-15"}, {"excerpts": ["They have delicious tempura and udon. ", "But the one thing that pushed me to rate it 3 stars and write this review is the unsatisfactory service of this young lady server. ", "I have had her as my server around 5 Times now & each time leaves me so bothered. ", "She blatantly MAKES FACES when she doesn't understand what you're asking for (like a saucer for the soy sauce) ", "or if you ask for too many things! ", "(Like some more water or an extra cup!), once she brings my food to my table-- she leaves immediately! ", "I can't even ask her for chopsticks or a napkin ", "because she just drops it off and leaves, doesn't even look at you nor does she say anything. ", "There have been NUMEROUS incidents with her that make me dread eating here because she will most likely be the server! ", "I had brought some friends with me before after praising the delicious food they serve here ", "and it's embarrassing when they have to point out the servers behavior."], "author": "Timmi C.", "review": "UPDATE REVIEW:\nI think they finally changed their servers because that rude lady wasn't there for the first time tonight. Instead were two very friendly servers! Great customer service and their beef udon and temptation shrimp did not disappoint \n\n\n\n\nI LOVE this place, been going twice a month for over two years now. They have delicious tempura and udon. But the one thing that pushed me to rate it 3 stars and write this review is the unsatisfactory service of this young lady server. I have had her as my server around 5 Times now & each time leaves me so bothered. She blatantly MAKES FACES when she doesn't understand what you're asking for (like a saucer for the soy sauce) or if you ask for too many things! (Like some more water or an extra cup!), once she brings my food to my table-- she leaves immediately! I can't even ask her for chopsticks or a napkin because she just drops it off and leaves, doesn't even look at you nor does she say anything. There have been NUMEROUS incidents with her that make me dread eating here because she will most likely be the server! I had brought some friends with me before after praising the delicious food they serve here and it's embarrassing when they have to point out the servers behavior.", "rating": 4, "date": "2018-02-25"}, {"excerpts": ["I came right when they opened on a Friday and ordered a bento box with California rolls and tempura for take-out. ", "I also got the Godzilla roll because my eyes were WAY bigger than my stomach. ", "The roll was made exactly how I like it (with the eel and avocado on top as opposed to inside the roll), and the box was pretty good ", "and I loved the fact that the salad is mixed greens instead of iceberg lettuce. "], "author": "Steph L.", "review": "This place is pretty good, especially for lunch, and the service is friendly. I came right when they opened on a Friday and ordered a bento box with California rolls and tempura for take-out. I also got the Godzilla roll because my eyes were WAY bigger than my stomach. The roll was made exactly how I like it (with the eel and avocado on top as opposed to inside the roll), and the box was pretty good and I loved the fact that the salad is mixed greens instead of iceberg lettuce. I wasn't sure I would like it because change can be scary, but trust me, every sushi place should adopt this. \n\nMy only two issues here are 1, the bento box does not come with miso soup if u order to-go. WHAT.THE.F***!!! Are you seriously telling me that it's too expensive to buy little to-go containers for soup?! Because that's the only reason I can think of that would cause them to not allow soups to-go. It's stupid and insulting and I don't like it one bit. I can't even remember my second issue because writing this review just reminded me how annoyed I was.\n\nMaybe I'm over reacting, and I'll be back, but I'll only dine in from now on. So there.", "rating": 3, "date": "2016-04-22"}, {"excerpts": ["Their tempura is some of the best you'll find. ", "I typically order the Chirashi - which is the perfect portion for a hungry sashimi addict - while my wife orders the 6 pc. ", "chef's choice sashimi ", "and we share the shrimp/veg tempura appetizer. ", "Sometimes we'll add on some nigiri or a roll. ", "Always fresh. ", "Always delicious. ", "My water glass was never empty. ", "The restaurant is very clean. ", "The prices are very reasonable."], "author": "Justin H.", "review": "This is definitely my new go-to local sushi spot! I've been 3 or 4 times and so far, and they are consistent in freshness, portion size, price, and friendly service. Their tempura is some of the best you'll find. I typically order the Chirashi - which is the perfect portion for a hungry sashimi addict - while my wife orders the 6 pc. chef's choice sashimi and we share the shrimp/veg tempura appetizer. Sometimes we'll add on some nigiri or a roll. Always fresh. Always delicious. My water glass was never empty. The restaurant is very clean. The prices are very reasonable.", "rating": 5, "date": "2017-01-27"}, {"excerpts": ["For $8.95 (lunch), you get a choice of either chicken, beef or salmon teriyaki, sesame chicken, saba, tonkatsu or tempura. ", "Included with that is 6 California rolls (very good), a big heap of rice, salad and a piece of fruit. ", "They're definitely very generous with their portions. ", "The salad is always fresh and the rice is always cooked to perfection. ", "Their bento boxes are good ", "but if you're looking at eating sashimi, then they're just mediocre. ", "We have our other favorite sushi places for sashimi but this place is great to have lunch and not have to break your piggy bank. ", "We love their sesame chicken, salmon teriyaki and tempura."], "author": "Mimi C.", "review": "We're regulars at this place for lunch on the weekends. We've been coming here for years, after the kids art classes. It's a great place for lunch. For $8.95 (lunch), you get a choice of either chicken, beef or salmon teriyaki, sesame chicken, saba, tonkatsu or tempura. Included with that is 6 California rolls (very good), a big heap of rice, salad and a piece of fruit. They're definitely very generous with their portions. The salad is always fresh and the rice is always cooked to perfection. Their bento boxes are good but if you're looking at eating sashimi, then they're just mediocre. We have our other favorite sushi places for sashimi but this place is great to have lunch and not have to break your piggy bank. We love their sesame chicken, salmon teriyaki and tempura.", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["I had a beef teriyaki & shrimp tempura combination bento box that wasn't bad, but it wasn't full of flavor or spectacular either.  "], "author": "Cryss S.", "review": "The food was mediocre.  I had a beef teriyaki & shrimp tempura combination bento box that wasn't bad, but it wasn't full of flavor or spectacular either.  It would've been bland w/o the teriyaki sauce.  \n\nThe service was seriously slow & lacking. It took a really long time to get my order placed & then one of the cooks in the back had to tell my waitress I was waiting at the register to pay because her nose was buried in her cell phone.  o_O", "rating": 2, "date": "2015-10-27"}, {"excerpts": ["I had the tempura lunch special (served with rice, 6pcs California maki, salad, and miso soup) for only $9.73 total (including tax) and it was decent. ", "They even served 3 tempura shrimp pieces with it, which usually doesn't happen at that price point. ", "It was of course not mind blowing or anything ", "but for that price, I felt I got more than my money's worth. ", "Server wasn't extremely friendly ", "but she got my order quickly, served me tea and miso soup right away, and everything else came within a short wait. ", "I was satisfied with my meal and would come back."], "author": "Trisha D.", "review": "To be honest, I had very low expectations  of this place because of the bad reviews on Yelp, but was pleasantly surprised to be served quickly (contrary to what the other reviewers have said) with good Japanese food. I had the tempura lunch special (served with rice, 6pcs California maki, salad, and miso soup) for only $9.73 total (including tax) and it was decent. They even served 3 tempura shrimp pieces with it, which usually doesn't happen at that price point. It was of course not mind blowing or anything but for that price, I felt I got more than my money's worth. Server wasn't extremely friendly but she got my order quickly, served me tea and miso soup right away, and everything else came within a short wait. I was satisfied with my meal and would come back.", "rating": 4, "date": "2016-05-31"}, {"excerpts": ["Again I ordered the lunch special with shrimp tempura. ", "I thought there was too much batter on it. ", "Though I often like fried food that way, I have to say it doesn't feel right for tempura.\n\n"], "author": "H K.", "review": "I returned here yesterday after not visiting here for some time because I was thinking about their lunch combo which I came for in the past. The price has gone up to $8.95 since my previous review. I notice the staff has changed, and service is not quite as good as before. I had to flag down the waitress to place an order even though she walked by many times and probably should've noticed I was waiting for devices. The food took a long time to come, probably at least 20 minutes. Though the restaurant was fairly full at the time, the time wait was noteworthy.\n\nAgain I ordered the lunch special with shrimp tempura. I thought there was too much batter on it. Though I often like fried food that way, I have to say it doesn't feel right for tempura.\n\nI'll probably still come back occasionally because it's convenient for me and there's normally ample parking since its part of Lakeshore Plaza. I just got to keep in mind not to expect a quick lunch if it's on a weekend and the service is different from when I came previously.", "rating": 2, "date": "2015-04-12"}, {"excerpts": ["My girlfriend and I had teriyaki with the all shrimp tempura combo along with California rolls. ", "The only downside of this place is the prices. ", "For average lunch of two people the bill was in the low $40s."], "author": "Jordan S.", "review": "Decided to check this place out because we always walked by it. We went here last week, and the place was pretty empty in the afternoon. We found parking easy and our waiter was very nice and checked on us regularly. We liked the booth seats because of the elevated walls. The entire place seemed very clean too. \n\nMy girlfriend and I had teriyaki with the all shrimp tempura combo along with California rolls. The only downside of this place is the prices. For average lunch of two people the bill was in the low $40s.", "rating": 4, "date": "2015-03-02"}, {"excerpts": ["I got the Tempura soba and this was about the most bland soba I have had in my life.\n", "The noodles were of the right texture ", "and ", "but Tempura was straight up disgusting.\n", "It was thick and chewy. ", "I had a piece of yam that was cut way to thick. ", "The batter they used must have been the most low quality batter in the market. ", "The shrimp tempura tasted worst than the kind you can buy in a pack at Costco.\n\n"], "author": "Julia Q.", "review": "I was looking forward to some affordable Japanese place and unfortunately stumbled uptown this place.\n\nI got the Tempura soba and this was about the most bland soba I have had in my life.\nThe noodles were of the right texture and but Tempura was straight up disgusting.\nIt was thick and chewy. I had a piece of yam that was cut way to thick. The batter they used must have been the most low quality batter in the market. The shrimp tempura tasted worst than the kind you can buy in a pack at Costco.\n\nThe person I was eating with got the Sesame chicken lunch special. The salad dressing was a little too sour and the California rolls were okay. That's why I'm putting two stars instead of one.\n\nIn conclusion, I was very very disappointed in the food quality here.\n\nAlso, the service was alright. It seemed like the waiter would rather do anything but get me a cup of water! Sorry.\n\nI will not be coming back here again.", "rating": 2, "date": "2015-04-08"}, {"excerpts": ["For a neighborhood sushi and tempura place its very good and we will be coming back!"], "author": "Bill M.", "review": "So we had dinner here tonight. I had the udon and wifey had the lakeshore roll and Fuji rolls. \n\nService was good, I don't understand the complaints. \n\nI was pleasantly surprised by the lychee soft drink. Food was tasty and well prepared. \n\nAmbiance is fine, certainly not hakkasan but you're in a strip mall. For a neighborhood sushi and tempura place its very good and we will be coming back!", "rating": 4, "date": "2014-11-22"}, {"excerpts": ["Had a tempura lunch special and it was awful! ", "The batter came out soggy and thick like bread and the tiny shrimps had no flavor. ", "The California rolls that came with it was heavily mayonnaised imitation crab with no avocados. ", "The best thing was the handful of salad leaves, luckily they were fresh so not much one can do to screw that up. ", "The service was extremely slow, crude, and inattentive. ", "The bento box was brought to me and placed on the table over my napkin and chop sticks!  ", "This is not a real Japanese restaurant but a mall joint run by Cantonese owners with very low standards. ", "They are lucky to be in a busy shopping center catering to walk in traffic. ", "Customers here must either not have much expectations or are new walk ins like myself. ", "Very disappointed that I passed by Chipotles for this poser."], "author": "Giovani T.", "review": "Avoid this place. Had a tempura lunch special and it was awful! The batter came out soggy and thick like bread and the tiny shrimps had no flavor. The California rolls that came with it was heavily mayonnaised imitation crab with no avocados. The best thing was the handful of salad leaves, luckily they were fresh so not much one can do to screw that up. The service was extremely slow, crude, and inattentive. The bento box was brought to me and placed on the table over my napkin and chop sticks!  This is not a real Japanese restaurant but a mall joint run by Cantonese owners with very low standards. They are lucky to be in a busy shopping center catering to walk in traffic. Customers here must either not have much expectations or are new walk ins like myself. Very disappointed that I passed by Chipotles for this poser.", "rating": 1, "date": "2015-07-28"}, {"excerpts": ["The miso is a little salty, the tempura was heated up after having been fried earlier in the day ( I saw the toaster oven). ", "Considering the surrounding eateries, it's okay. ", "I know ", "I said okay twice. ", "Okay."], "author": "Rene C.", "review": "It is okay. The miso is a little salty, the tempura was heated up after having been fried earlier in the day ( I saw the toaster oven). Considering the surrounding eateries, it's okay. I know I said okay twice. Okay.", "rating": 3, "date": "2014-03-15"}, {"excerpts": ["They serve a lot of items that are in combination with shrimp tempura. ", "Don't get me wrong, I love a good crunchy roll, but it would be nice to see some of them replaced by non-fried items."], "author": "Jennifer P.", "review": "What was Toyo sushi is now Yuyu sushi. I think it's still the same place though. I don't think the menu has changed. That said it's an okay place. They serve a lot of items that are in combination with shrimp tempura. Don't get me wrong, I love a good crunchy roll, but it would be nice to see some of them replaced by non-fried items.", "rating": 3, "date": "2012-04-11"}, {"excerpts": ["Make the side tempura, if you really want to win some points. \n\n"], "author": "Roy L.", "review": "This is my neighborhood sushi place. Have eaten here 3 times so far, and will be back, but I wish they could just improve just a bit more. \n\nThey have inexpensive sushi (plus) a great selection (plus) but below average quality (minus) and not always fresh (big minus). I was here yesterday and ordered 4 orders of nigiri: salmon, hamachi, scallop, and halibut. Each one is $2.50 for 2 pieces.\n\nThe cuts were pretty good, but the flavors on the salmon/scallop/halibut were so-so. I mean, we aren't in Japan, so I can live with so-so quality fish. But the minuses were that the hamachi was not fresh, with a pretty strong fishy flavor that really ruined my appetite, and there was a fish bone in the halibut. \n\nTO THE RESTAURANT OWNERS: I want to recommend steps for improving the restaurant. The prices are good, you can bring a lot of people in the door with those. But to keep them coming back, you CANNOT serve unfresh fish. I understand if the traffic is not as high as other restaurants, so you cannot turn over your inventory as fast. If that is the case, drop all of the exotic types of sushi that you carry. Get rid of the halibut, get rid of the scallop, and focus on selling the sake, the maguro, the hamachi, fresh. If you are turning over your inventory fast enough, then expand back to more exotic things like butter fish. \n\nThe rolls and cooked dishes were fine. I really don't mind those. Don't serve a lump of rice with your nigiri lunch combo - if I just ate a bunch of fish and rice, I don't need more rice. Exchange it for a fruit or more salad, or something. Make the side tempura, if you really want to win some points. \n\nYou guys already have the staff, the restaurant built out, a great location. Just take care of some of these small details, and I will certainly be back for more!", "rating": 3, "date": "2012-10-19"}, {"excerpts": ["I ordered the Tempura Dinner Special and a SFPD Roll. ", "Bf had the Teriyaki Beef Dinner Special and a House Roll. ", "I am a huge fan of sushi and Japanese food ", "and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. ", "This place is by far the WORST! ", "My tempura dinner special was okay nothing special but who can mess up tempura right? ", "It came with a spicy tuna roll and the flavor was just not there. ", "It was not spicy and so tasteless. ", "The miso soup is bland and the salad is also lacking. ", "The Bf's teriyaki beef dinner was horrible. ", "It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! ", "He said it was burnt and dry. ", "Not enough for a man to be full! ", "I think I could have finished the whole thing and still be hungry. ", "My tempura dinner special was okay nothing special but who can mess up tempura right? ", "It came with a spicy tuna roll and the flavor was just not there. ", "It was not spicy and so tasteless. ", "The miso soup is bland and the salad is also lacking. ", "The Bf's teriyaki beef dinner was horrible. ", "It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! ", "He said it was burnt and dry. ", "Not enough for a man to be full! ", "I think I could have finished the whole thing and still be hungry. ", "The House Roll and SFPD Roll was even worst! ", "Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. ", "Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. ", "I tried to bring it to the attention of the waitress so that they could be more careful. ", "I mean there are kids that eat there! ", "Her reply was, \"oh... fish sometimes have bones.", "\" ", "Well no shit really?! ", "They do?! ", "Oh and they wanted to charge $1 to add cream cheese to my sfpd roll which was already pricey at $11.95. ", "NEVER AGAIN!"], "author": "Jeanette N.", "review": "This place is horrible! I ordered the Tempura Dinner Special and a SFPD Roll. Bf had the Teriyaki Beef Dinner Special and a House Roll. I am a huge fan of sushi and Japanese food and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. This place is by far the WORST! My tempura dinner special was okay nothing special but who can mess up tempura right? It came with a spicy tuna roll and the flavor was just not there. It was not spicy and so tasteless. The miso soup is bland and the salad is also lacking. The Bf's teriyaki beef dinner was horrible. It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! He said it was burnt and dry. Not enough for a man to be full! I think I could have finished the whole thing and still be hungry. The House Roll and SFPD Roll was even worst! Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. I tried to bring it to the attention of the waitress so that they could be more careful. I mean there are kids that eat there! Her reply was, \"oh... fish sometimes have bones.\" Well no shit really?! They do?! A simple apology would have sufficed!\n\nI will not be returning to this restaurant. I only came here out of convenience. Service was slow, even though the place wasn't even 1/2 full on a friday night and the food sucks. Total was $50 not including tip for tasteless food, bones included. Oh and they wanted to charge $1 to add cream cheese to my sfpd roll which was already pricey at $11.95. NEVER AGAIN!", "rating": 1, "date": "2012-03-12"}], "oyako don": [], "katsu don": [], "unagi don": [{"excerpts": ["I decided to get the Unagi don and California rolls, which came with miso soup and salad. \n\n", "It took a while for the Unagi don to come out, which was a bit awkward since I was with someone who get their meal a lot quicker than I did. "], "author": "Jei C.", "review": "This cat walked into yuyu on a rainy SF day. I had been craving some Japanese food and this little place happened to be right by the area I was shopping. Time to try something new! \n\nUpon being seated, I noted that Yuyus prices are very much on the low side. That's always a pleasant surprise, but hopefully that's not at the cost of quality! The menu was pretty diverse and there are a variety of promising sushi rolls. \n\nI decided to get the Unagi don and California rolls, which came with miso soup and salad. \n\nIt took a while for the Unagi don to come out, which was a bit awkward since I was with someone who get their meal a lot quicker than I did. That's always a pet peeve of mine when places to that, but it happens. \n\nThe Unagi was wonderfully cooked, and I was enjoying it quite a bit. I bit into something very hard though that I never exactly could pinpoint what it was. It kind of felt like plastic though u.u. \nThe roll didn't taste quite right. The quality of crab wasn't very flavorful and it kind of tasted like mayonnaise. \n\nThat said, service was very nice and friendly, and the atmosphere was pleasant as well. If only the food had been a bit better. \n\nOverall I guess you get what you pay for. Very cheap pricing, but not really up to par with what I would have liked. \n\n*chirp*", "rating": 2, "date": "2016-03-15"}, {"excerpts": ["The unagi don was served with huge mounds of wasabi & pickled sushi ginger, & 2 triangles of industrial tamagoyaki. ", "Um, what? ", "Passable flavor on the eel itself, but I wouldn't go again."], "author": "Deb H.", "review": "Poor service with my having finished my entire meal before my son's unagi donburi was ever brought out. Asked multiple times about it to no avail or explanation.  Once it was brought out you could tell no one there is Japanese.  The unagi don was served with huge mounds of wasabi & pickled sushi ginger, & 2 triangles of industrial tamagoyaki. Um, what? Passable flavor on the eel itself, but I wouldn't go again.", "rating": 2, "date": "2016-11-19"}, {"excerpts": ["Love the unagi don and chairashi bowl. ", "Food is always consistently good."], "author": "D A.", "review": "Always my default sushi place in the area. Love the unagi don and chairashi bowl. Food is always consistently good.", "rating": 4, "date": "2014-04-29"}], "chirashi sushi": [], "salmon ikura don": [], "saba shioyaki": [{"excerpts": ["I ordered the saba shioyaki lunch special. ", "The saba shioyaki looked rock solid and unappetizing. ", "The salad had little to no dressing as well. ", "However, the california roll that came with it was pretty good. ", "I also ordered a spider roll which wasn't good at all. "], "author": "Joshua M.", "review": "This place used to be called Toyo sushi, and it was good. I would've given them a solid four stars.\n\nNow that it has changed ownership, it has begun to deteriorate in food and service. When I went here last week, I had to wait quite a while to get seated even though the seating area was half empty. There was only one waitress here, and she was quite rude.\n\nThe service was poor and so was the food. I ordered the saba shioyaki lunch special. The saba shioyaki looked rock solid and unappetizing. The salad had little to no dressing as well. However, the california roll that came with it was pretty good. I also ordered a spider roll which wasn't good at all. The quality of it just wasn't that good.\n\nYuyu sushi has definitely seen it's better days back when it was Toyo sushi.", "rating": 2, "date": "2015-08-29"}], "ten zaru soba": [], "zaru soba": [], "mushroom and vegetable udon": [], "mushroom and vegetable soba": [], "seafood udon": [], "seafood soba": [], "nabeyaki udon": [], "nabeyaki soba": [], "tempura soba": [{"excerpts": ["I got the Tempura soba and this was about the most bland soba I have had in my life.\n", "The noodles were of the right texture ", "and ", "but Tempura was straight up disgusting.\n", "It was thick and chewy. ", "I had a piece of yam that was cut way to thick. ", "The batter they used must have been the most low quality batter in the market. ", "The shrimp tempura tasted worst than the kind you can buy in a pack at Costco.\n\n"], "author": "Julia Q.", "review": "I was looking forward to some affordable Japanese place and unfortunately stumbled uptown this place.\n\nI got the Tempura soba and this was about the most bland soba I have had in my life.\nThe noodles were of the right texture and but Tempura was straight up disgusting.\nIt was thick and chewy. I had a piece of yam that was cut way to thick. The batter they used must have been the most low quality batter in the market. The shrimp tempura tasted worst than the kind you can buy in a pack at Costco.\n\nThe person I was eating with got the Sesame chicken lunch special. The salad dressing was a little too sour and the California rolls were okay. That's why I'm putting two stars instead of one.\n\nIn conclusion, I was very very disappointed in the food quality here.\n\nAlso, the service was alright. It seemed like the waiter would rather do anything but get me a cup of water! Sorry.\n\nI will not be coming back here again.", "rating": 2, "date": "2015-04-08"}], "beef and mushroom udon": [], "beef and mushroom soba": [], "chicken and mushroom udon": [], "chicken and mushroom soba": [], "plain udon": [], "plain soba": [], "piece maguro": [], "piece hamachi": [], "piece sake": [], "piece smoke salmon": [], "piece albacore": [], "piece escolar": [], "piece ebi": [], "piece saba": [], "piece ika": [], "piece tako": [], "piece unagi": [], "piece tamago": [], "piece inari": [], "piece ikura": [], "piece tobiko": [], "piece kani": [], "piece hotate": [], "piece amaebi": [], "piece uni": [], "piece tobiko with quail egg": [], "piece ikura with quail egg": [], "piece spicy tuna hand roll": [], "piece salmon hand roll": [], "piece unagi hand roll": [], "piece california hand roll": [], "piece garlic white tuna hand roll": [], "piece spicy scallop hand roll": [], "piece spicy hamachi hand roll": [], "piece mochi ice cream": []}