{"vegetable pakora": [{"excerpts": ["We ordered an extra large Indian pizza, some curry that was supposed to be just like chicken tikka masala, chicken tandoori, samosas, naan, chicken and vegetable Pakora.  ", "The Pakoras were a hit!  ", "The samosas and chicken tandoori were only ", "okay unfortunately because I LOVE samosas ", "but by far the most disappointing item was the chicken tikka-like curry.  ", "It was pretty darn bad is all I can say.  ", "That teaches us to order curry when the restaurant is famous for its pizza.  ", "Now for the pizza.  ", "The first words to fly out of my mouth were that is ", "was interestingly GREAT!  ", "I don't even know what was all in the pizza because there were so many toppings ", "but it was great ", "and all the ingredients all worked well together.  ", "I remembered the shopped shrimp being a delightful surprise.  ", "Well worth all the other obstacles (bad curry) to get there.  ", "One thing to note was that I did not feel too great when I got home.  ", "One of the girls I spoke with later told me that when she went to the bathroom during dinner she saw mouse droppings all over the staircase!  ", "I personally didn't see it ", "but that would explain my queasiness.  ", "That being said, what I didn't see didn't really hurt me so I would still go back to try out the pizza again and see if it is still as good as I remembered!"], "author": "Susan L.", "review": "These reviews are part of a series where my Vancouverite friend wanted to try a bunch of food carts all weekend.  We ended up deviating to some other cheap eats.\n\nThe contestants:  Lers Ros Thai, Fritzj, Adobo Hobo, Pizza Hacker, Gumbo Cart, Lumpia Cart, Bi-Rite Creamery, El Farolito, Bacon Dog Cart, Pho Garden, Zante's Indian Pizza\n\nThis review is about Zante's Indian Pizza.  It was somewhat interesting how we got to eating at this restaurant.  When we were talking with all the food cart guys and swapping good eats, one guy mentioned that a place called Zante's was incredible for Indian pizza.  Of course this piqued my interest as I love Indian food AND pizza so I made a mental note of it.  Then towards the end of our weekend of cheap eats, we were going to finish off the night at a place called the Limon Rotisserie but apparently it was too far out of the way for a friend so she recommended a place called the Front Porch in case we didn't have enough grease.  When I called in to make a reservation for 8pm, they weren't able to accommodate us right away so I hunkered down for the wait.  That's when a completely different friend mentioned that there was a supposedly great Indian pizza restaurant nearby called Zante's!  Apparently this place always had a wait but we figured we might as well wait for it and if our rezos at Front Porch came along first, we could just walk over.  Well, lucky us the manager was willing to seat us right away!  \n\nWe ordered an extra large Indian pizza, some curry that was supposed to be just like chicken tikka masala, chicken tandoori, samosas, naan, chicken and vegetable Pakora.  The Pakoras were a hit!  The samosas and chicken tandoori were only okay unfortunately because I LOVE samosas but by far the most disappointing item was the chicken tikka-like curry.  It was pretty darn bad is all I can say.  That teaches us to order curry when the restaurant is famous for its pizza.  Now for the pizza.  The first words to fly out of my mouth were that is was interestingly GREAT!  I don't even know what was all in the pizza because there were so many toppings but it was great and all the ingredients all worked well together.  I remembered the shopped shrimp being a delightful surprise.  Well worth all the other obstacles (bad curry) to get there.  One thing to note was that I did not feel too great when I got home.  One of the girls I spoke with later told me that when she went to the bathroom during dinner she saw mouse droppings all over the staircase!  I personally didn't see it but that would explain my queasiness.  That being said, what I didn't see didn't really hurt me so I would still go back to try out the pizza again and see if it is still as good as I remembered!", "rating": 3, "date": "2009-11-04"}], "vegetable samosa": [{"excerpts": ["The vegetable samosa was a little too doughy,  ", "but still ok, I definitely ate it as quickly as its temperature would allow.  ", "The place was really warm inside (really really) but it had been a very hot day, so I can only hope on a pleasant day it would stay a little cooler in there.  ", "Also, they were playing what seemed to be Indian dance music louder than should be played in a restaurant with tablecloths.  ", "That said, if you want to avoid the simmering disco of a dining room, order take out and I think you will be satisfied"], "author": "Garrett C.", "review": "The Indian Pizza I had was pretty good.  I will say, it is the first Indian pizza I have ever had, so I really have nothing to compare it too.  The toppings were fresh, the lamb was juicy, the prawns were a little scarce, but overall, the pizza tasted very good and a small pizza was just the right amount for 2 moderately hungry people.  The vegetable samosa was a little too doughy,  but still ok, I definitely ate it as quickly as its temperature would allow.  The place was really warm inside (really really) but it had been a very hot day, so I can only hope on a pleasant day it would stay a little cooler in there.  Also, they were playing what seemed to be Indian dance music louder than should be played in a restaurant with tablecloths.  That said, if you want to avoid the simmering disco of a dining room, order take out and I think you will be satisfied", "rating": 3, "date": "2008-10-19"}], "lamb samosa": [{"excerpts": ["Lamb Samosa had a nice crunchy exterior, unfortunely the filling was pretty flavorless.\n\n"], "author": "Richard H.", "review": "This place is pretty mediocre.  Delivery took an hour and twenty minutes. \n\nLamb Samosa had a nice crunchy exterior, unfortunely the filling was pretty flavorless.\n\nCould barely taste the difference between the Chicken Curry and Chicken Vindaloo. \nI didn't think it was possible for curry to be flavorless, but i was wrong.   Imagine making curry at home and the recipe calls for 1 cup of water but you put 3 cups of water.  \n\nI have not tried the pizza and dont plan to.  There are too many good indian places in the mission to try this again.", "rating": 2, "date": "2013-01-29"}, {"excerpts": ["got chicken tikka masala, garlic nan, and lamb samosa.  ", "tasted good but an hour after eating had a upset stomach.  ", "next day was puking out both ends all day.  ", "only thing i ate that day.  ", "so im pretty sure it was their food.  ", "wont be returning."], "author": "Jb H.", "review": "rude on phone.  hung up on me after i stated my order and phone number.  nice in person while picking up food.  place looked clean in dining room.  got chicken tikka masala, garlic nan, and lamb samosa.  tasted good but an hour after eating had a upset stomach.  next day was puking out both ends all day.  only thing i ate that day.  so im pretty sure it was their food.  wont be returning.", "rating": 1, "date": "2015-05-15"}, {"excerpts": ["After a few minutes we decide on, The Best Indian Pizza, lamb samosa and 2 Lassai drinks.\n\n\n"], "author": "Trisha C.", "review": "As my little cousin would say, DEEWISHOUS! \n\nI heard so much about this place I had to give it a try. Lets see, nothing to fancy inside but the dining area, Indian music that was a little too loud and a few folks behind the counter. A nice man greets us and seats us. \n\nAfter a few minutes we decide on, The Best Indian Pizza, lamb samosa and 2 Lassai drinks.\n\n\nMango Lassi-Personally, I didnt like the drink., reminded me of a GoGurt. \n\nLamb samosa- YUMO \n\nFor all you people who like Indian food and love dipping your naan into every sauce you could dip it into, this pizza is the perfect creation. You no longer have to dip! The pizza contains so many flavors and so many toppings, its like a party in your mouth.", "rating": 4, "date": "2009-03-07"}, {"excerpts": ["The lamb samosa, on the other hand, came out cold and were obviously gracing the unfrozen life for the first time (no I didn't experience freezer burn, but the hint of ice taste is always a little shocking). \n\n"], "author": "Alexandra M.", "review": "Yeah yeah yeah this place isn't that great, but fuck the concept is genius! I mean, Indian pizza? Whoever thought of that must have been getting laid a lot - don't we all love happy people who have put on that handsome twenty after falling in sweet sweet love? \n\nI like to get me some pizza, dose it with salt and chutneys and umm. Sure I keep wishing for more flavor upon each bite but at least I can taste cilantro. Then there are the curries. I just had the korma the other day. It had almonds or coconut in it and this little tid bit made it much more glorious than I would have imagined curry at this let's not try to impress anyone pizza joint. The lamb samosa, on the other hand, came out cold and were obviously gracing the unfrozen life for the first time (no I didn't experience freezer burn, but the hint of ice taste is always a little shocking). \n\nRegardless, I'll probably go back. Why? Because it's Indian pizza and it's near my house.", "rating": 3, "date": "2008-09-03"}], "assorted mix appetizers": [], "onions bhaji": [], "muill igatawny soup": [{"excerpts": ["I LOVE the Muill Igatawny soup! ", "Perfectly spiced, with ginger and shredded chicken. "], "author": "Keri V.", "review": "I have to say that I love Zante for many reasons.\n\nYou can pop in most anytime and get a table. \n\nThe food is amazing. If you want it spicy, just tell them! They adjust each dish individually. I LOVE the Muill Igatawny soup! Perfectly spiced, with ginger and shredded chicken. Sooo good. \n\nThe Chicken Korma is my other favorite. Not spicy, just creamy and delicious. The lamb Somosa's were perfect appetizers. \n\nWe have eaten there many times and always have enjoyed our food and the waiter is always friendly and helpful. \n\nMy son ordered the pizza once and wasn't totally impressed, but it is to be expected from a 12 year old wanting regular pizza. It worked well enough for all of us to eat at the same place and have what we wanted. \n\n\n I will admit that the one time we had delivery, it took forever, but since then, we just pop in. In my opinion, regardless of the restaurant  delivery is never as good as eating in the restaurant, so I still give them 5 stars!", "rating": 5, "date": "2009-07-27"}], "dal soup": [{"excerpts": ["I also started with an order of Dal Soup, which was tasty as well with nice bits of fresh ginger, of which, I am a fan. ", "I noticed that most people in the restaurant were ordering Indian food, so maybe I'll go back and try just the regualr food, and not the pizza sometime...maybe. "], "author": "Eamon M.", "review": "Really, I would like to give this place 3.5 stars. \n\nI went here tonight and aside from what I think may have been a dead dude getting picked up in an ambulance from the bench across the street, it was good. The look of the place could use some help, as well as some more lighting and an update to the old decor. \n\nI went with a friend and we ordered the Indian Vegetarian Pizza that comes with Spinach, Eggplant, Cauliflower, Ginger, Garlic, Green Onions & Cilantro. 'Twas quite tasty, and I ate wayyy too much of it. I also started with an order of Dal Soup, which was tasty as well with nice bits of fresh ginger, of which, I am a fan. I noticed that most people in the restaurant were ordering Indian food, so maybe I'll go back and try just the regualr food, and not the pizza sometime...maybe. I live in the East Bay, and I probably wouldn't make the $4, $5, or $6 trek across the bridge just for this place, but if I was out and about, and in Bernal Heights, I would. \n\nAlso, ask for the mint sauce, it goes great with the pizza and serves as a great dip to the crust as well. \n\nPros:\nGood, and different pizza\nOpen relatively late\nServer was pretty attentive and served us rather promptly\n\nCons:\nZero Ambiance\n\"Candle Dinner\" as advertised on the menu = very poor lighting sans the candles.\nCan be tough to find parking.\nWe tried to split the bill via credit card, but couldn't because the minimum had to be $15 (our bill was $27, probably could have let that one slide)", "rating": 4, "date": "2011-01-24"}], "spinach soup": [], "butter nan": [], "onion kulcha": [{"excerpts": ["For $40 I got a pint of chicken Tikka Sag, a pint of chicken Tikka Masala, a mini container of basmati rice (about 1 cup of cooked rice) and one large piece of onion kulcha (naan). ", "Oh, and a coke because i was jonesing.  ", "What the heck man? ", "The Sag was OK, nothing to write home about and the tikka was the most bland I have ever had.  ", "Both dishes included 4 chunks of chicken in them.  ", "4. ", "If that's not bad enough - the tikka was the weirdest I have ever had.  ", "It was super thick and really pale in color and tasted REALLY bland.  ", "My guess is that they LOAD it with cream, but that wouldn't be cost effective, and it also didn't congeal the same way creamy sauces do when refrigerated, rather, ", "it became the texture of peanut butter.  ", "When I reheated it, the oil leeched out of the sauce and it was SO GROSS, in a 1/4 cup portion of sauce, HALF of that was oil!  ", "My guess is that they are using some sort of stable oil emulsified into the sauce to give it body - maybe this helps it stand up to baking it on a pizza or something. ", "I don't know ", "but it was gross to know I had eaten that much straight up fat in the form of emulsified oil.  ", "The food was not horrible and the delivery service was friendly, but I don't think I would order from them again because of the oily-ness and blandness of the tikka masala."], "author": "Emma H.", "review": "Why is Indian food so expensive?  For $40 I got a pint of chicken Tikka Sag, a pint of chicken Tikka Masala, a mini container of basmati rice (about 1 cup of cooked rice) and one large piece of onion kulcha (naan). Oh, and a coke because i was jonesing.  What the heck man? The Sag was OK, nothing to write home about and the tikka was the most bland I have ever had.  Both dishes included 4 chunks of chicken in them.  4. If that's not bad enough - the tikka was the weirdest I have ever had.  It was super thick and really pale in color and tasted REALLY bland.  My guess is that they LOAD it with cream, but that wouldn't be cost effective, and it also didn't congeal the same way creamy sauces do when refrigerated, rather, it became the texture of peanut butter.  When I reheated it, the oil leeched out of the sauce and it was SO GROSS, in a 1/4 cup portion of sauce, HALF of that was oil!  My guess is that they are using some sort of stable oil emulsified into the sauce to give it body - maybe this helps it stand up to baking it on a pizza or something. I don't know but it was gross to know I had eaten that much straight up fat in the form of emulsified oil.  The food was not horrible and the delivery service was friendly, but I don't think I would order from them again because of the oily-ness and blandness of the tikka masala.", "rating": 3, "date": "2017-02-23"}, {"excerpts": ["Zante has the best naan in the city- order the onion kulcha, which is buttery, lightly crispy, and has a dusting of green onions on the top. "], "author": "aunt t.", "review": "Zante has the best naan in the city- order the onion kulcha, which is buttery, lightly crispy, and has a dusting of green onions on the top. Also, the chicken tikka masala is significantly less greasy and heavy and more delicious than at many Indian restaurants in the city- notably, Naan and Curry. The chicken pekora does vary depending I guess if they just deep-fried it for you, but if they did, it's one of the best things ever, particularly with the spicy mint green and sweet tamarind dipping sauce. Perhaps the pizza isn't that great, and the atmosphere could be classed up, but the people are very nice and the Indian food, for the money, is consistently very good. It has a nice, homey vibe and it's usually not hard to get a table. Plus the delivery has gotten a LOT faster lately. I've been to a lot of Indian restaurants in the city, and I always go back to Zante for an tasty, affordable and dependable meal. For dinner, main entrees usually run about $10.", "rating": 4, "date": "2007-04-02"}], "garlic kulcha": [{"excerpts": ["i ordered the CTM (which they advertised as zante's best) as hot as they allow--and chicken mushroom mild with garlic kulcha (garlic naan).\n\n", "when i dipped my garlic kulcha in it the liquid just runs off the bread and back into the container leaving the bread simply wet.\n\n", "the CTM was not spicy at all\n\nand the garlic kulcha was very dry and bland. ", "11.99$ for the chicken tikka masala\n2.99$ for the garlic kulcha\n10.99$ for the chicken mushroom (which was also runny in curry", "11.99$ for the chicken tikka masala\n2.99$ for the garlic kulcha\n10.99$ for the chicken mushroom (which was also runny in curry"], "author": "Whitne Y.", "review": "hungry for some spicy CTM i decided to check out nearby indian restaurants and see what's out there, straying from my usual joint (little delhi). i ordered over the internet (fun!) and was given a call as promised within the ten minutes of placing the order, as a confirmation. great start!\n\ni ordered the CTM (which they advertised as zante's best) as hot as they allow--and chicken mushroom mild with garlic kulcha (garlic naan).\n\nthere was a hiccup with delivery and but despite the confusion as to where my address was exactly, the food arrived faster then the 45 minutes the man over the phone promised and was still piping hot.\n\nall of this, saves them from getting a star--stellar service for sure.\n\nthe food?\n\nNOT\n\nthe chicken tikka masala (CTM) is not hot at all. the color is a light yellow/orange color and very very watery. curries are suppose to be thick! this was so watery when i dipped my garlic kulcha in it the liquid just runs off the bread and back into the container leaving the bread simply wet.\n\nthe chicken itself was okay. \n\nthe CTM was not spicy at all\n\nand the garlic kulcha was very dry and bland. no taste to it despite the show of color and all the seasoning on it, it appears to be tasty but when you bite into it there is no flavor at all.\n\nreally disappointed with this, as naan and curry can do better then them tenfold and the cost is not as high.\n\n11.99$ for the chicken tikka masala\n2.99$ for the garlic kulcha\n10.99$ for the chicken mushroom (which was also runny in curry, i only sampled a bit as it was my sister's order)\n\nhorrible taste. but excellent service", "rating": 2, "date": "2010-05-18"}], "palak paratha": [], "murg nan": [], "keema nan": [], "kabuli nan": [], "poori": [], "cheese chili nan": [], "aloo methi pratha": [], "paneer garlic nan": [], "tandoori onion roti": [], "aloo paratha": [], "nan": [{"excerpts": ["Nan: too thick and spongy."], "author": "Tata X.", "review": "I know of 2 Indian pizza joint in the Bay Area. Between golden gate indian and Zante, I definitely prefer the former better. Reason being:\n\nPizza: we tried tikka masala pizza and everything Indian pizza. The dough is way too spongy and thick. Instead of a crispy crust, it was more like really thick soft naan. The ingredients are abundant and fresh, but without a crust, can you really call it pizza?\nOther Indian dishes: baigain bhartha, malai kofta, and aloo Gobi: the spice and flavor is strong(its Indian food after all) but flatter(one note?) than what I usually prefer. I got big chunks of ginger that wasn't properly zested or chopped. \nNan: too thick and spongy.", "rating": 3, "date": "2017-10-22"}, {"excerpts": ["The nan tasted like someone put dish soap in it. ", "Some of the food was salty past being edible. ", "Plus, everything was cold. ", "Sadly, we've placed our last order."], "author": "Michael S.", "review": "We've been going to Zantes for years. However, tonight's dinner was just disgusting. The nan tasted like someone put dish soap in it. Some of the food was salty past being edible. Plus, everything was cold. Sadly, we've placed our last order.", "rating": 1, "date": "2015-02-18"}, {"excerpts": ["The key is remember that the nan is ten times better than the pizza, so order the traditional Indian food and forget the pizza! ", "On our most recent visit we had garlic nan, the eggplant bharta and tofu masala, probably our two favorites here. "], "author": "David S.", "review": "I really misjudged this place after our first visit, but thankfully I kept good on my word to try it again. After the second visit, my perspective began to change, and by now it is my favorite dive restaurant in the city! \n\nThe key is remember that the nan is ten times better than the pizza, so order the traditional Indian food and forget the pizza! On our most recent visit we had garlic nan, the eggplant bharta and tofu masala, probably our two favorites here. So yummy!\n\nI will save this note from my previous review: Other reviews have described the decor as poor to fair. That is one way of describing it, but I enjoy the ambiance, especially the low-fi AM radio station that the waiter occasionally sings along with. \n\nBut as must be the case for the place to qualify as a dive, the best part is the price!", "rating": 4, "date": "2013-05-19"}, {"excerpts": ["Otherwise, the rest of the food is not very good,\ndoughy nan and under seasoned dishes."], "author": "Antoine P.", "review": "4 stars for the indian pizza. It is delicious!\nOtherwise, the rest of the food is not very good,\ndoughy nan and under seasoned dishes.", "rating": 4, "date": "2013-03-10"}, {"excerpts": ["got chicken tikka masala, garlic nan, and lamb samosa.  ", "tasted good but an hour after eating had a upset stomach.  ", "next day was puking out both ends all day.  ", "only thing i ate that day.  ", "so im pretty sure it was their food.  ", "wont be returning."], "author": "Jb H.", "review": "rude on phone.  hung up on me after i stated my order and phone number.  nice in person while picking up food.  place looked clean in dining room.  got chicken tikka masala, garlic nan, and lamb samosa.  tasted good but an hour after eating had a upset stomach.  next day was puking out both ends all day.  only thing i ate that day.  so im pretty sure it was their food.  wont be returning.", "rating": 1, "date": "2015-05-15"}, {"excerpts": ["Lamb Korma, Nan, a drink and Kheer.\r\n", "The guy who took my order had some severe A.D.D. and once he had eventually gotten my order down he hangs up. ", "I call up and ask that I would like to pay with credit card upon which he replies, and I quote", ";\r\n\"Come on man, it's only twenty dollars..\"\r\n\r\n", "I found some cash and went with that.\r\n\r\n", "Food arrived 40-45 minutes later.\r\n", "Naan: Soggy and cold.\r\n", "Lamb: ", "Bland and the pieces of meat were not well cut.\r\n", "Kheer: ", "Frigg'n weird - more like wallpaper glue meets porridge.\r\n", "Drink", ": It was a coke. ", "It tasted like coke. ", "They did a good job on that one at least.\r\n\r\n", "Will I order again? ", "Well I do want to figure out if the Indian Pizza is any good but the bad experience I had tonight will most likely prevent me from trying it out.\r\n\r\n", "Two stars and three 'yucks'.\r\n\r\n", "---\r\n\r\nUpdate: Tried the Indian Pizza. ", "The flavour was good but as with anything you order from these guys it's LATE and COLD and served up with some shitty attitude.\r\n\r\n", "No more business from me. ", "(And they dropped from two stars to one)..."], "author": "Rich S.", "review": "Hmm...worked late from home and ended up being hungry at a very late hour. Searched through the various found-on-the-door-step menues and decided I wanted Indian food. Zante Pizza won.\r\nDidn't end up ordering the pizza from there (which I now understand may be pretty damn good based on the reviews below here - then again you people also liked the supperclub and Luna Park so what do you know? ;-)).\r\n\r\nAnyway...I ordered....Lamb Korma, Nan, a drink and Kheer.\r\nThe guy who took my order had some severe A.D.D. and once he had eventually gotten my order down he hangs up. I call up and ask that I would like to pay with credit card upon which he replies, and I quote;\r\n\"Come on man, it's only twenty dollars..\"\r\n\r\nI found some cash and went with that.\r\n\r\nFood arrived 40-45 minutes later.\r\nNaan: Soggy and cold.\r\nLamb: Bland and the pieces of meat were not well cut.\r\nKheer: Frigg'n weird - more like wallpaper glue meets porridge.\r\nDrink: It was a coke. It tasted like coke. They did a good job on that one at least.\r\n\r\nWill I order again? Well I do want to figure out if the Indian Pizza is any good but the bad experience I had tonight will most likely prevent me from trying it out.\r\n\r\nTwo stars and three 'yucks'.\r\n\r\n---\r\n\r\nUpdate: Tried the Indian Pizza. The flavour was good but as with anything you order from these guys it's LATE and COLD and served up with some shitty attitude.\r\n\r\nNo more business from me. (And they dropped from two stars to one)...", "rating": 1, "date": "2006-03-14"}, {"excerpts": ["Also hot and  right out of the oven: plain and onion nan. ", "Asked about their \"Indian pizza\" and was provided a large free slice, which had the lightest crust and a tasty spinach sauce instead of tomato. ", "So good that though I'm stuffed, I ordered a medium pizza to go. ", "I live in Reno, but I'll be back to Zante's for sure."], "author": "Scott D.", "review": "First time here and I am VERY impressed with the quality of the cuisine. Ordered veg samosas, lamb korma, chicken vindaloo and sag paneer. All delicious. Also hot and  right out of the oven: plain and onion nan. Asked about their \"Indian pizza\" and was provided a large free slice, which had the lightest crust and a tasty spinach sauce instead of tomato. So good that though I'm stuffed, I ordered a medium pizza to go. I live in Reno, but I'll be back to Zante's for sure.", "rating": 5, "date": "2012-03-24"}, {"excerpts": ["We also got the chili-cheese nan with some sexy tasting dipping sauces.  ", "I'm crrraaavving it.  ", "Plus the waiters are so cute, shy, and quiet, you just want to pinch their little cheeks."], "author": "Rachelle P.", "review": "Indian. Pizza.  Curry paste on spiced pizza dough.  Seriously good veggie pizza, good cheese, good toppings, it was just so good.  We also got the chili-cheese nan with some sexy tasting dipping sauces.  I'm crrraaavving it.  Plus the waiters are so cute, shy, and quiet, you just want to pinch their little cheeks.", "rating": 5, "date": "2010-03-02"}, {"excerpts": ["It is a bit more expensive than the nan & curries of town, and very rich - as in probably full of butter - but it still gets 4 stars for good veggie curries and wonderful Indian pizzas.  ", "I don't order meat here, so don't know how that is.  "], "author": "Carlos V.", "review": "I like this place a lot.  It is a bit more expensive than the nan & curries of town, and very rich - as in probably full of butter - but it still gets 4 stars for good veggie curries and wonderful Indian pizzas.  I don't order meat here, so don't know how that is.  But the veggie curries tend to be chunky and fresh - which is refreshingly different.\n\nThe back room is a little messy?  I've seen much worse.  The food here has never made me sick.  AND they deliver all over town.  Even to the foggy Sunset.", "rating": 4, "date": "2008-07-23"}, {"excerpts": ["but it wasn't the orgasm on nan that I expected after I reading the other reviews.  ", "I ordered a vegetarian pizza add lamb and a side of raita for dipping.  ", "The dough is great, no doubt, and the curry sauce is really good too.  ", "Something felt off about the cheese though and there were barely any veggies or lamb except for lots of green onions.  ", "I liked being able to order online though and they delivered in around 30 min.  ", "I think its hit and miss with this place but its always good to try new flavor combinations."], "author": "Stacy R.", "review": "Pretty good pizza but it wasn't the orgasm on nan that I expected after I reading the other reviews.  I ordered a vegetarian pizza add lamb and a side of raita for dipping.  The dough is great, no doubt, and the curry sauce is really good too.  Something felt off about the cheese though and there were barely any veggies or lamb except for lots of green onions.  I liked being able to order online though and they delivered in around 30 min.  I think its hit and miss with this place but its always good to try new flavor combinations.", "rating": 3, "date": "2007-06-26"}, {"excerpts": ["The nan was rubbery, the saag paneer was bland and watery, the food did not come with rice, and was definitely too expensive for the quality. ", "I will never order from there again, especially since there is way better Indian food in the neighborhood (e.g. Udupi Palace)."], "author": "Laura S.", "review": "I am giving this place one star, but I should say that if the food hadn't arrived late and cold it probably would have been better than one star. The Indian pizza was the best of what I ordered. The nan was rubbery, the saag paneer was bland and watery, the food did not come with rice, and was definitely too expensive for the quality. I will never order from there again, especially since there is way better Indian food in the neighborhood (e.g. Udupi Palace).", "rating": 1, "date": "2008-11-21"}], "sag lamb": [{"excerpts": ["we ordered (by phone) veggie pakoras, sag lamb, okra, half order of tandoori chicken, onion and garlic naan.  ", "the tandoori chicken was tasty and a good value for how much you get.  ", "the onion naan was my favorite, as was the mint chutney.   ", "food arrived in 45 mins, as promised.  ", "yay."], "author": "Erick A.", "review": "Awesome, definitely will order delivery here again.  we ordered (by phone) veggie pakoras, sag lamb, okra, half order of tandoori chicken, onion and garlic naan.  the tandoori chicken was tasty and a good value for how much you get.  the onion naan was my favorite, as was the mint chutney.   food arrived in 45 mins, as promised.  yay.", "rating": 5, "date": "2007-04-08"}], "lamb bhuna": [], "lamb korma": [{"excerpts": ["Thier Lamb Korma is classic signature dish!\n\n"], "author": "Jorge S.", "review": "Wer have been eating here for almost 10 years.  The quality is excellent, the food is delicious and the prices are very reasonable. They even deliver. Thier Lamb Korma is classic signature dish!\n\nYou wont go wrong if you are looking for a local dive that does not have any elegance but has great food.", "rating": 4, "date": "2017-11-06"}, {"excerpts": ["Wanted the lamb tikka masala, but they make it with almonds, so I got the lamb korma instead. ", "I told them I really love the coconut milk in the tikka masala, so they added some to the korma and it came out sooooo delicious. ", "It was a decent portion size for the price. ", "I also got the rice, which was very fragrant and delicious. "], "author": "Lindsey G.", "review": "Placed an order for pickup. Wanted the lamb tikka masala, but they make it with almonds, so I got the lamb korma instead. I told them I really love the coconut milk in the tikka masala, so they added some to the korma and it came out sooooo delicious. It was a decent portion size for the price. I also got the rice, which was very fragrant and delicious. My boyfriend got the chicken tikka masala and he loved it. We also got garlic and plain naan. Only 2 pieces per order so kinda a small portion size. total price came to 35- for 2 people so not bad. Took about 10 minutes for them to make, so it was very fast. Overall, very delicious and glad I was able to find this so close to home!", "rating": 5, "date": "2014-06-17"}, {"excerpts": ["Lamb Korma, Nan, a drink and Kheer.\r\n", "The guy who took my order had some severe A.D.D. and once he had eventually gotten my order down he hangs up. ", "I call up and ask that I would like to pay with credit card upon which he replies, and I quote", ";\r\n\"Come on man, it's only twenty dollars..\"\r\n\r\n", "I found some cash and went with that.\r\n\r\n", "Food arrived 40-45 minutes later.\r\n", "Naan: Soggy and cold.\r\n", "Lamb: ", "Bland and the pieces of meat were not well cut.\r\n", "Kheer: ", "Frigg'n weird - more like wallpaper glue meets porridge.\r\n", "Drink", ": It was a coke. ", "It tasted like coke. ", "They did a good job on that one at least.\r\n\r\n", "Will I order again? ", "Well I do want to figure out if the Indian Pizza is any good but the bad experience I had tonight will most likely prevent me from trying it out.\r\n\r\n", "Two stars and three 'yucks'.\r\n\r\n", "---\r\n\r\nUpdate: Tried the Indian Pizza. ", "The flavour was good but as with anything you order from these guys it's LATE and COLD and served up with some shitty attitude.\r\n\r\n", "No more business from me. ", "(And they dropped from two stars to one)..."], "author": "Rich S.", "review": "Hmm...worked late from home and ended up being hungry at a very late hour. Searched through the various found-on-the-door-step menues and decided I wanted Indian food. Zante Pizza won.\r\nDidn't end up ordering the pizza from there (which I now understand may be pretty damn good based on the reviews below here - then again you people also liked the supperclub and Luna Park so what do you know? ;-)).\r\n\r\nAnyway...I ordered....Lamb Korma, Nan, a drink and Kheer.\r\nThe guy who took my order had some severe A.D.D. and once he had eventually gotten my order down he hangs up. I call up and ask that I would like to pay with credit card upon which he replies, and I quote;\r\n\"Come on man, it's only twenty dollars..\"\r\n\r\nI found some cash and went with that.\r\n\r\nFood arrived 40-45 minutes later.\r\nNaan: Soggy and cold.\r\nLamb: Bland and the pieces of meat were not well cut.\r\nKheer: Frigg'n weird - more like wallpaper glue meets porridge.\r\nDrink: It was a coke. It tasted like coke. They did a good job on that one at least.\r\n\r\nWill I order again? Well I do want to figure out if the Indian Pizza is any good but the bad experience I had tonight will most likely prevent me from trying it out.\r\n\r\nTwo stars and three 'yucks'.\r\n\r\n---\r\n\r\nUpdate: Tried the Indian Pizza. The flavour was good but as with anything you order from these guys it's LATE and COLD and served up with some shitty attitude.\r\n\r\nNo more business from me. (And they dropped from two stars to one)...", "rating": 1, "date": "2006-03-14"}, {"excerpts": ["Ordered veg samosas, lamb korma, chicken vindaloo and sag paneer. ", "All delicious. "], "author": "Scott D.", "review": "First time here and I am VERY impressed with the quality of the cuisine. Ordered veg samosas, lamb korma, chicken vindaloo and sag paneer. All delicious. Also hot and  right out of the oven: plain and onion nan. Asked about their \"Indian pizza\" and was provided a large free slice, which had the lightest crust and a tasty spinach sauce instead of tomato. So good that though I'm stuffed, I ordered a medium pizza to go. I live in Reno, but I'll be back to Zante's for sure.", "rating": 5, "date": "2012-03-24"}, {"excerpts": ["Lamb korma + paratha + saffron rice = ", "$20 with tip, which you'd feel terrible about in the Tenderloin, but for this, I did not have to put on a coat or earphones or a steely-eyed stare. ", "I'll consider that the San Francisco Indian equivalent of a convenience tax. ", "And it was yummy."], "author": "Melissa G.", "review": "I haven't managed to re-calibrate my \"Indian, now!\" impulse since moving off the Lower Snob. And \"delivery Indian\" isn't exactly ever worth it. Really, I'd rather hop on BART in the cold and shove through Union Square and sit at a table at Chutney or Lahori by my lonesome.\n\nExcept Zante delivers everywhere in the City. And I'd been in once three years ago for a pizza, and forgot that. Lamb korma + paratha + saffron rice = $20 with tip, which you'd feel terrible about in the Tenderloin, but for this, I did not have to put on a coat or earphones or a steely-eyed stare. I'll consider that the San Francisco Indian equivalent of a convenience tax. And it was yummy.", "rating": 4, "date": "2008-12-28"}], "gosht vindaloo": [], "keema mattar": [], "lamb jalfrezi": [], "lamb tikka masala": [{"excerpts": ["Wanted the lamb tikka masala, but they make it with almonds, so I got the lamb korma instead. ", "I told them I really love the coconut milk in the tikka masala, so they added some to the korma and it came out sooooo delicious. ", "It was a decent portion size for the price. ", "I also got the rice, which was very fragrant and delicious. "], "author": "Lindsey G.", "review": "Placed an order for pickup. Wanted the lamb tikka masala, but they make it with almonds, so I got the lamb korma instead. I told them I really love the coconut milk in the tikka masala, so they added some to the korma and it came out sooooo delicious. It was a decent portion size for the price. I also got the rice, which was very fragrant and delicious. My boyfriend got the chicken tikka masala and he loved it. We also got garlic and plain naan. Only 2 pieces per order so kinda a small portion size. total price came to 35- for 2 people so not bad. Took about 10 minutes for them to make, so it was very fast. Overall, very delicious and glad I was able to find this so close to home!", "rating": 5, "date": "2014-06-17"}], "gosht bhuna": [], "prawn currie": [], "prawn sagwala": [{"excerpts": ["I was really impressed by the Prawn Sagwala. ", "The prawns were tender not chewy and the spinach sauce was spot on.  "], "author": "Mingus R.", "review": "I have yet to go wrong the vegetarian pizza. I didn't even feel the urge to pull the cauliflower off. Last night a friend and I ordered in.  Their veggie samosas are probably my favorite around town. I was really impressed by the Prawn Sagwala. The prawns were tender not chewy and the spinach sauce was spot on.  The Chicken Tikka Masala  was memorable as well. The entree portions were a bit small for the prices but over all another good experience at Zantes.", "rating": 4, "date": "2006-01-04"}], "prawn pepper masala": [], "prawn tikka masala": [{"excerpts": ["Loved chicken tikka masala and prawn tikka masala let alone the delicious pizza.  ", "We have yet to try all other dishes. ", "Highly recommend to anyone who enjoys authentic Indian food. ", "Huge plus for opening late at night."], "author": "kazue w.", "review": "This is our local favorite and can even say the best Indian restaurant in the city.  Great service, reasonable price and unpretentious atmosphere. We felt we were in India once we stepped into the restaurant.  We felt very comfortable. Loved chicken tikka masala and prawn tikka masala let alone the delicious pizza.  We have yet to try all other dishes. Highly recommend to anyone who enjoys authentic Indian food. Huge plus for opening late at night.", "rating": 5, "date": "2016-08-29"}], "prawn vindaloo": [{"excerpts": ["he was charging me a dollar more on the prawn vindaloo. ", "i told him that the flier said it was a dollar cheaper and he abided. ", "the sag panner and prawn vindaloo were severly watered down and underseasoned. ", "the vindaloo was not spicy as requested. ", "you could tell they could've been good if they weren't so diluted. ", "i have a high suspicion that the 'prawns' were actually shrimp. ", "they were tiny and mangled. ", "they did give a generous portion of each in their own pint containers full to the brim. ", "i am very full, but am i satisfied? ", "that's a hell ", "no. ", "maybe i should've gotten the pizza. ", "doesn't matter they've lost a couple customers here. ", "there is no reason you should ever, EVER yell at a customer, especially a patient, kind-hearted girl like MY GIRLFRIEND! ", "you're in the wrong industry buddy!"], "author": "Eugene H.", "review": "ok so i get a flier on the door for this place. we tried calling in and ordering. first call, my girlfriend couldn't understand his accent so told him to hold on while she adjusted the volume on her phone. she tried to put it on speaker phone and soon found out it wasn't. the guy on the phone was so impatient that when she did get it on speaker phone he had hung up. second call, she was ordering the items and told him which ones she wanted medium and which spicy. then the guy presumably repeats the order back but did so in such a incoherent mumble that she asked him to repeat himself. HE BLEW UP AT HER! yelling, yes, yelling that he was very busy and asked her what she wanted. so she calmly repeated the order then he asked for our address and she slowly enunciated each letter of our street and the guy wasn't getting it. after 3 times i jumped in as it was all on speaker phone and had to have a stern almost yelling tone for him to understand. i asked for the total while already knowing how much it should be. he told me it and it didn't seem right. so i asked him to break it down for me dish by dish. he was charging me a dollar more on the prawn vindaloo. i told him that the flier said it was a dollar cheaper and he abided. the website had the wrong price for the vindaloo as well as a dollar higher on the sag panner. this is why we didn't order it online. bad customer service man, i mean bad\n\nwe got our food in the quoted time. the naan was, in fact, rubbery as noted by another yelper. the sag panner and prawn vindaloo were severly watered down and underseasoned. the vindaloo was not spicy as requested. you could tell they could've been good if they weren't so diluted. i have a high suspicion that the 'prawns' were actually shrimp. they were tiny and mangled. they did give a generous portion of each in their own pint containers full to the brim. i am very full, but am i satisfied? that's a hell no. maybe i should've gotten the pizza. doesn't matter they've lost a couple customers here. there is no reason you should ever, EVER yell at a customer, especially a patient, kind-hearted girl like MY GIRLFRIEND! you're in the wrong industry buddy!", "rating": 2, "date": "2012-07-11"}, {"excerpts": ["My favorite order there: Veggie Samosa, Chicken Makanwala, Prawn Vindaloo and Bhinde Masala, plus a glass of Mango Lassi. ", "- Oh my lord, I have to go there tonight!"], "author": "Yina M.", "review": "This is the BEST indian restaurant in the city. Frankly, I tried most of them. My favorite order there: Veggie Samosa, Chicken Makanwala, Prawn Vindaloo and Bhinde Masala, plus a glass of Mango Lassi. - Oh my lord, I have to go there tonight!", "rating": 4, "date": "2005-06-17"}], "bhuna prawn": [], "jheenga korma": [], "chicken tikka": [{"excerpts": ["The chicken tikka masala pizza is absolutely amazing and i highly recommend as it's their classic. ", "There's a nice vibe inside the restaurant or fun as takeout as well."], "author": "Drew F.", "review": "This is one of my *favorite* pizza places. Indian flavored pizza may not be the first thing that comes to mind when you think of great pizza but this place is. The chicken tikka masala pizza is absolutely amazing and i highly recommend as it's their classic. There's a nice vibe inside the restaurant or fun as takeout as well.", "rating": 5, "date": "2018-07-14"}, {"excerpts": ["They advertise as the Best Indian Pizza with Chicken Tikka Masala Sauce.\n\n"], "author": "Carmen P.", "review": "They advertise as the Best Indian Pizza with Chicken Tikka Masala Sauce.\n\nGotta say it is the only Indian pizza I've had so perhaps it is the best albeit not the best pizza I've had to date. The bread was very doughy and not enough filling. I drenched it in their hot sauce and that saved it. Their green hot sauce is the bomb diggity. \n\nMango lassi was a tad too sweet and it was lukewarm by the time we got it (despite me asking for it to be extra icy). \n\nPizza was OK the next day too but I was super hungry.", "rating": 3, "date": "2018-06-23"}, {"excerpts": ["I'd have to say the Chicken Tikka Masala pizza is my favorite, accompanied by the garlic & chili cheese naans. "], "author": "Michael M.", "review": "Zante! I order from this place frequently when we have friends visiting from out of town because Indian Pizza is a pretty unique experience! Staff is super friendly and welcoming when you choose to eat in. Its a pretty aged dining room that's not fancy in any way, but the pizza is AWESOME. I'd have to say the Chicken Tikka Masala pizza is my favorite, accompanied by the garlic & chili cheese naans. If you live in SF, but haven't tried this place, you're missing out!\n\nNote: We had some trouble with timing on deliveries from these guys in the past. They get busy and don't accurately estimate their delivery times, so skip the hassle and just eat in or pick it up. We haven't had an issue since.", "rating": 4, "date": "2018-05-16"}, {"excerpts": ["Ordered a chicken tikka masala pizza, came on time and super delicious. ", "The crust isn't like a normal pizza -- it's naan like and more fluffy! ", "It goes really well with the masala sauce, cheese and toppings. ", "Super great fusion experience in my mouth :)"], "author": "Hana S.", "review": "Ordered a chicken tikka masala pizza, came on time and super delicious. The crust isn't like a normal pizza -- it's naan like and more fluffy! It goes really well with the masala sauce, cheese and toppings. Super great fusion experience in my mouth :)", "rating": 4, "date": "2018-01-27"}, {"excerpts": ["The chicken tikka masala pizza is truly a unique and wonderful item. ", "I've traveled all over and have never had one as wonderful. ", "The downside is the large is $30 ", "so it's pricy. ", "Also, the person who takes the orders is very short with you on the phone and does come off as rude. ", "I'm not sure if it's a lost in translation moment ", "but it's annoying how annoyed he seems. ", "Also expect your order to get to you 15-20 minutes later than they say it will. ", "I've ordered delivery from them 15-20 times. ", "Great pizza."], "author": "Justin M.", "review": "The chicken tikka masala pizza is truly a unique and wonderful item. I've traveled all over and have never had one as wonderful. The downside is the large is $30 so it's pricy. Also, the person who takes the orders is very short with you on the phone and does come off as rude. I'm not sure if it's a lost in translation moment but it's annoying how annoyed he seems. Also expect your order to get to you 15-20 minutes later than they say it will. I've ordered delivery from them 15-20 times. Great pizza.", "rating": 4, "date": "2018-04-18"}, {"excerpts": ["You have to order the Chicken Tikka Masala pizza, it's amazing Indian food with an Italian twist! ", "Tangy curry-like masala sauce as the base topped with cauliflower, eggplant, and tandoori chicken. ", "It comes with two different sauces, sweet & spicy. ", "So good!!!"], "author": "Brandon B.", "review": "First time trying Indian pizza and I was blown away!\n\nYou have to order the Chicken Tikka Masala pizza, it's amazing Indian food with an Italian twist! Tangy curry-like masala sauce as the base topped with cauliflower, eggplant, and tandoori chicken. It comes with two different sauces, sweet & spicy. So good!!!", "rating": 5, "date": "2017-08-01"}, {"excerpts": ["My favorites are  the Indian-inspired pizzas: chicken tikka, tandoori, and vegetarian which come on a flavored naan/pizza-type dough and side of mint chutney.  ", "Their other pizza specials are also pretty tasty and prices are reasonable."], "author": "Vinh T.", "review": "Zante's Pizza has delivered lunch to my workplace several times in the past, so my colleagues and I have had a chance to try pretty much all their different pizza varieties and appetizers. My favorites are  the Indian-inspired pizzas: chicken tikka, tandoori, and vegetarian which come on a flavored naan/pizza-type dough and side of mint chutney.  Their other pizza specials are also pretty tasty and prices are reasonable.", "rating": 4, "date": "2018-01-11"}, {"excerpts": ["My favorites are the chicken tikka sag and the aloo ghobi muttar. ", "We don't live close by, so I allow ample time to order and the delivery guy is so nice- ", "we really love this place!"], "author": "CAKE E.", "review": "Great Indian food! My hubby loves the pizza but I stick mostly to the traditional dishes. My favorites are the chicken tikka sag and the aloo ghobi muttar. We don't live close by, so I allow ample time to order and the delivery guy is so nice- we really love this place!", "rating": 5, "date": "2018-01-25"}, {"excerpts": ["I say I would like I try a chicken tikka masala slice ", "(I became white for a second y'all!) ", "to see if I wanted to buy the whole pizza. ", "So he prepared a slice for me. ", "He said it was complimentary, which was very nice of him because Indian people never do that. ", "I took the slice and sat down to eat. ", "The place was empty. ", "Apparently folks never sit down to eat. ", "They might as well cut out the sit down part of their restaurant and just do pizza take out and delivery. ", "Just sayin. ", "Anyways I continue. ", "And Indian pizza from India (like Chicken tikka chili cheese pizza from Pizza Hut) will crush this place like Godzilla sitting on San Francisco. ", "But we still love you Mr. Zante ^_^"], "author": "Bhavi A.", "review": "Dear Mr. Zante,\n\nFor starved Indian pizza wanderers everywhere, thank you for opening this restaurant.  There's nothing like this in NYC where I came from. Let me tell you how the experience replayed in my head.\n\nI walk in on a Friday afternoon wearing my famous little red backpack, owner looking guy (I'll call him Zante uncle) looks and me and says %*+#£&@\"... I look at him confused. He repeats it again and then asks,\n\n\"Are you indian?\" \n\"Yes I am..\" \n\"Where from in India?\" (Note the ordering of the words hehe)\n\"I'm from the South..\"\n\nZante uncle sighs and walks away without a word. In a stern tone he asks \"what pizza you vant?\" I say I would like I try a chicken tikka masala slice (I became white for a second y'all!) to see if I wanted to buy the whole pizza. So he prepared a slice for me. He said it was complimentary, which was very nice of him because Indian people never do that. I took the slice and sat down to eat. The place was empty. Apparently folks never sit down to eat. They might as well cut out the sit down part of their restaurant and just do pizza take out and delivery. Just sayin. Anyways I continue. I call a waiter uncle to ask him what the difference between the paneer and chicken masala pizza is... \n\n\"Excuse me-\"\n\"Hindi @*&#^$...\"\n\"huh?\"\n\"You please say it in Hindi..\"\n\"I don't speak Hindi...\"\n\nHe gave me that LOOK like \"you younger generation peoples are fucked up, don't know your language, don't have indian identity, just all whitewashed!!!\"\n\nSo I gave him this LOOK back like \"listen uncle, Hindi is NOT my native language, never was, never will be. I am a Tamil girl and I speak MY language, Tamil. Fluently. For the record, not all brown people are indian and not all Indians speak Hindi. There's a reason why my people rebelled and rioted against this language, which is why most of us don't speak it. If you uncles come to my state with that Hindi, racist terms like \"Madrasi,\" and bogus stereotypes from Bollywood propaganda movies like Chennai Express, y'all would get your asses kicked. Figuratively of course. We are a peaceful species :) \n\nIf you have seen indian soap operas, you know that one LOOK and a flash of thunder and lightning can communicate quite a lot. Hehe\n\nSO. The chicken one was not horrible except for the chicken part (had no flavor), so I asked to order the paneer one instead. Waiter uncle suggested a half and half of saag paneer based veggie and the paneer tikka masala pizza. So the pizza overall was ok but NOTHING like CanAm Indian pizza from Seattle. CanAm is in a different league. They set the bar way too high for Mr. Zante to jump over. I am giving this place 4 stars because I strongly support the concept of Indian Pizza. And I took off one star because it's always that annoying kid who gets an A++ in everything that ruins the bell curve for everyone else. And Indian pizza from India (like Chicken tikka chili cheese pizza from Pizza Hut) will crush this place like Godzilla sitting on San Francisco. But we still love you Mr. Zante ^_^", "rating": 4, "date": "2015-04-04"}, {"excerpts": ["While the unique chicken tikka and veggie delight pizzas certainly lived up to the hype, the musical choice of this restaurant was mindboggling. ", "A 16-count melody was repeated over and over again for about 20 minutes to the point of insanity before switching to another equally bizarre 8-count melody that repeated for the next 20 minutes. ", "To add to the confusion, an additional Bollywood song began playing at a lower volume that was barely audible but just loud enough to make my party and me scratch our heads. ", "Great food, strange and slightly hilarious overall experience."], "author": "Aasim N.", "review": "The cuisine here is great but the environment was bizarre. While the unique chicken tikka and veggie delight pizzas certainly lived up to the hype, the musical choice of this restaurant was mindboggling. A 16-count melody was repeated over and over again for about 20 minutes to the point of insanity before switching to another equally bizarre 8-count melody that repeated for the next 20 minutes. To add to the confusion, an additional Bollywood song began playing at a lower volume that was barely audible but just loud enough to make my party and me scratch our heads. Great food, strange and slightly hilarious overall experience.", "rating": 4, "date": "2017-08-01"}, {"excerpts": ["We did a half and half of the Chicken Tikka Masala and the meat pizza. ", "Comes with 2 different sauces that compliment the pizza very well."], "author": "Eileen G.", "review": "I never even knew that Indian Pizza existed!! I'm so glad it does though because they just put my two favorite things together. First off the costumer service was great. They were very friendly and it seemed like a family owned restaurant. My boyfriend and I followed all their recommendations from their beer to the pizza and it was all good. We did a half and half of the Chicken Tikka Masala and the meat pizza. Comes with 2 different sauces that compliment the pizza very well.", "rating": 5, "date": "2017-08-09"}, {"excerpts": ["Chicken tikka masala with naan that poses as pizza bread is genius! ", "This was a restaurant we had to come to because I'm not even sure if we have anything that's close to this in NY. ", "I'd come here again if I was to go to SF."], "author": "Dennis K.", "review": "Two of my girlfriend's favorite foods put into one! How can you not enjoy that? They're not my favorite foods but it's definitely a great combination! Chicken tikka masala with naan that poses as pizza bread is genius! This was a restaurant we had to come to because I'm not even sure if we have anything that's close to this in NY. I'd come here again if I was to go to SF.", "rating": 4, "date": "2017-09-26"}, {"excerpts": ["I was excited to try their chicken tikka masala pizza, and wanted to try the spinach (vegetarian) as well. ", "I ordered over the phone for pick up, verified I wanted chicken tikka masala and vegetarian spinach pizza, half and half. ", "When I picked up my pizza, I was shocked a large was 34 dollars, but that's San Francisco ", "I guess. ", "I figured I'm paying for quality. ", "Get in the car, and find out the whole damn pizza is vegetarian, and it had BIG areas missing cheese and sauce. ", "So, I paid 34 dollars for lightly seasoned dough. ", "I got paneer chunks instead  of chicken on the tikka side, which was so very dry of sauce.  ", "What the hell is going on? ", "What a slap in the face. ", "Bummed, I ate two pieces, one of each side on our long drive home, and regretted my decision that I should have ate somewhere else. ", "At least the dipping sauces were good. ", "But, I didn't pay 34+ tax for freaking naan and dip."], "author": "Raquel A.", "review": "My order got messed up when I came here, and it ended up being a huge disappointment. This was our last stop in my most recent trip to San Francisco, and found out about this place from a you tube food critic. I was excited to try their chicken tikka masala pizza, and wanted to try the spinach (vegetarian) as well. I ordered over the phone for pick up, verified I wanted chicken tikka masala and vegetarian spinach pizza, half and half. When I picked up my pizza, I was shocked a large was 34 dollars, but that's San Francisco I guess. I figured I'm paying for quality. Get in the car, and find out the whole damn pizza is vegetarian, and it had BIG areas missing cheese and sauce. So, I paid 34 dollars for lightly seasoned dough. I got paneer chunks instead  of chicken on the tikka side, which was so very dry of sauce.  What the hell is going on? What a slap in the face. Bummed, I ate two pieces, one of each side on our long drive home, and regretted my decision that I should have ate somewhere else. At least the dipping sauces were good. But, I didn't pay 34+ tax for freaking naan and dip.", "rating": 2, "date": "2017-07-21"}, {"excerpts": ["The chicken tikka masala was small proportions the yogurt was separating from the oil ", "and I've had to run to the toilet twice now since eating the dinner. ", "The vegetable fritters were overly crispy borderline of being burnt. ", "The prawns Biryani rice was the best part of the meal because there was tons of veggies and herbs inside of it ", "but it had some spice that was lacking. ", "I will never be eating Indian food here again. ", "Mind you ", "I just had Indian food last night from Spicy Bite and it was so good which made me want to have another Indian dinner from a different restaurant tonight."], "author": "Leslie C.", "review": "I really wanted to like this place but it was disgusting. The chicken tikka masala was small proportions the yogurt was separating from the oil and I've had to run to the toilet twice now since eating the dinner. The vegetable fritters were overly crispy borderline of being burnt. The prawns Biryani rice was the best part of the meal because there was tons of veggies and herbs inside of it but it had some spice that was lacking. I will never be eating Indian food here again. Mind you I just had Indian food last night from Spicy Bite and it was so good which made me want to have another Indian dinner from a different restaurant tonight.", "rating": 1, "date": "2017-10-16"}, {"excerpts": ["They have paneer or chicken tikka masala. ", "IN PIZZA FORM.  ", "Yes, really.  ", "Somehow I wouldn't expect this to work, but it does: they use a slightly greasy naan crust, plus just the right balance of sauce and cheese.  ", "Oh, they also have \"regular,\" i.e. not-a-pizza style Indian food, and the paneer (or shrimp) tikka masala and palak paneer are both awesome.  "], "author": "Aaron M.", "review": "What, I haven't reviewed this place yet?  OK, let me remedy that asap.  They have paneer or chicken tikka masala. IN PIZZA FORM.  Yes, really.  Somehow I wouldn't expect this to work, but it does: they use a slightly greasy naan crust, plus just the right balance of sauce and cheese.  Oh, they also have \"regular,\" i.e. not-a-pizza style Indian food, and the paneer (or shrimp) tikka masala and palak paneer are both awesome.  So is the pilau rice but watch out for the spices!\n\nAlso in their pizza department, they have a delicious \"best Indian pizza\" that is not CTM or PTM.  If you build your own, the \"standard\" non-Indian toppings are pretty great too, but I recommend the seasoned lamb and onions.  \n\nIf you do pick up or delivery, I suggest using the phone rather than the web - seems faster.", "rating": 5, "date": "2016-02-28"}, {"excerpts": ["For $40 I got a pint of chicken Tikka Sag, a pint of chicken Tikka Masala, a mini container of basmati rice (about 1 cup of cooked rice) and one large piece of onion kulcha (naan). ", "Oh, and a coke because i was jonesing.  ", "What the heck man? ", "The Sag was OK, nothing to write home about and the tikka was the most bland I have ever had.  ", "Both dishes included 4 chunks of chicken in them.  ", "4. ", "If that's not bad enough - the tikka was the weirdest I have ever had.  ", "It was super thick and really pale in color and tasted REALLY bland.  ", "My guess is that they LOAD it with cream, but that wouldn't be cost effective, and it also didn't congeal the same way creamy sauces do when refrigerated, rather, ", "it became the texture of peanut butter.  ", "When I reheated it, the oil leeched out of the sauce and it was SO GROSS, in a 1/4 cup portion of sauce, HALF of that was oil!  ", "My guess is that they are using some sort of stable oil emulsified into the sauce to give it body - maybe this helps it stand up to baking it on a pizza or something. ", "I don't know ", "but it was gross to know I had eaten that much straight up fat in the form of emulsified oil.  ", "The food was not horrible and the delivery service was friendly, but I don't think I would order from them again because of the oily-ness and blandness of the tikka masala."], "author": "Emma H.", "review": "Why is Indian food so expensive?  For $40 I got a pint of chicken Tikka Sag, a pint of chicken Tikka Masala, a mini container of basmati rice (about 1 cup of cooked rice) and one large piece of onion kulcha (naan). Oh, and a coke because i was jonesing.  What the heck man? The Sag was OK, nothing to write home about and the tikka was the most bland I have ever had.  Both dishes included 4 chunks of chicken in them.  4. If that's not bad enough - the tikka was the weirdest I have ever had.  It was super thick and really pale in color and tasted REALLY bland.  My guess is that they LOAD it with cream, but that wouldn't be cost effective, and it also didn't congeal the same way creamy sauces do when refrigerated, rather, it became the texture of peanut butter.  When I reheated it, the oil leeched out of the sauce and it was SO GROSS, in a 1/4 cup portion of sauce, HALF of that was oil!  My guess is that they are using some sort of stable oil emulsified into the sauce to give it body - maybe this helps it stand up to baking it on a pizza or something. I don't know but it was gross to know I had eaten that much straight up fat in the form of emulsified oil.  The food was not horrible and the delivery service was friendly, but I don't think I would order from them again because of the oily-ness and blandness of the tikka masala.", "rating": 3, "date": "2017-02-23"}, {"excerpts": ["Chicken tikka masala pizza, tandori wings = great combo!"], "author": "Ed S.", "review": "Best Indian pizza I have ever had. Waiter was very friendly, pizza was great and the sauces made them even better. \n\nChicken tikka masala pizza, tandori wings = great combo!", "rating": 4, "date": "2016-05-09"}, {"excerpts": ["We had chicken Korma and chicken tikka masala and Chana masala ", "all were great."], "author": "Monica T.", "review": "Clean. Friendly. I took the kids and We stayed with the Indian food menu. I found the curries tasty. We had chicken Korma and chicken tikka masala and Chana masala all were great.", "rating": 4, "date": "2016-07-11"}, {"excerpts": ["The best version of Chicken Tikka Masala I've had in SF.  ", "So so good!  ", "You won't be disappointed.  "], "author": "Rachel B.", "review": "Get the chicken Makenwala!  The best version of Chicken Tikka Masala I've had in SF.  So so good!  You won't be disappointed.  I also love the mango lassi!  Yum!", "rating": 5, "date": "2016-11-26"}, {"excerpts": ["Regarding the food, chicken tikka masala pizza is boss. ", "I however always order the Indian food. ", "I love the vindaloo extra spicy. ", "Not crazy about the naan, it's a bit Costco in my opinion. ", "But everything else I've had here are choice!"], "author": "Stanley J.", "review": "The pizza here is the novelty. It's the best Indian pizza of the few I've tried in SanFran. I love the waiter. Always the same guy. Amazingly he always remembers me and seats me at the same table from my first visit in 2011. He always asks you to tip in cash haha. His audacity endears him to me :-) I love the Taj and Flying Horse in the big bottles. Regarding the food, chicken tikka masala pizza is boss. I however always order the Indian food. I love the vindaloo extra spicy. Not crazy about the naan, it's a bit Costco in my opinion. But everything else I've had here are choice!", "rating": 4, "date": "2015-09-22"}, {"excerpts": ["I ordered chicken tikka masala and it's just blah."], "author": "Emcy G.", "review": "I just ordered $80.95 worth of food to be delivered at 12:15 pm. I called three times to see where our order is and every time, the answer is 10 to15 mins. The food arrived past 1PM. after a very late lunch, I called to ask for compensation for this out of the world service and they said they will comp me $10! That's the tip i left for the delivery! Never again. \n\nPS. I ordered chicken tikka masala and it's just blah.", "rating": 1, "date": "2015-05-05"}, {"excerpts": ["We got an extra large half paneer masala and half chicken tikka masala.  ", "Very tasty but not worth over $30 for an extra large."], "author": "Phil D.", "review": "It's good and very unique.  A bit pricey for the pizza and the crust isn't naan as I thought from other reviews.  We got an extra large half paneer masala and half chicken tikka masala.  Very tasty but not worth over $30 for an extra large.", "rating": 3, "date": "2015-11-16"}, {"excerpts": ["I would recommend the\n- chicken tikka masala pizza\n   "], "author": "Josh E.", "review": "The Indian pizza here is awesome!\nAnd the other indian dishes I've had here are pretty good too!\n\nI would recommend the\n- chicken tikka masala pizza\n   it is very filling, but very tasty\n\n- saag anything\n   their spinach is well seasoned, and not too soupy or solid\n\n- raita & naan\n  its decent, not the best ive ever had, but it gets the job done\n\nDid i mention the pizza is really good?", "rating": 4, "date": "2014-03-10"}, {"excerpts": ["I ordered the chicken tikka masala sauce pizza (it's called the Best Indian Pizza with Chicken Tikka Masala sauce).  ", "Like every beginner Indian food eater, I love chicken tikka masala.  ", "On the pizza, the sauce was thin, the chicken was tiny (think bacon bits) and the crust could have been cooked a little longer.  ", "It didn't satisfy the Indian food craving nor the chicken craving.  ", "Darn!  "], "author": "Jeff H.", "review": "I went here with a vegan and we shared a Bengan Bhartha (eggplant) pizza with no cheese.  I didn't enjoy the pizza, but the vegan loved it.  Hey, the place is really clean and the staff is super nice.\n\nThe second time I tried the place was via delivery to my house.  I ordered the chicken tikka masala sauce pizza (it's called the Best Indian Pizza with Chicken Tikka Masala sauce).  Like every beginner Indian food eater, I love chicken tikka masala.  On the pizza, the sauce was thin, the chicken was tiny (think bacon bits) and the crust could have been cooked a little longer.  It didn't satisfy the Indian food craving nor the chicken craving.  Darn!  I really wanted this to be better!\n\nNote:  I'm a thin crust pizza lover and have not found a good one in SF (let me know).", "rating": 2, "date": "2013-06-25"}, {"excerpts": ["Loved chicken tikka masala and prawn tikka masala let alone the delicious pizza.  ", "We have yet to try all other dishes. ", "Highly recommend to anyone who enjoys authentic Indian food. ", "Huge plus for opening late at night."], "author": "kazue w.", "review": "This is our local favorite and can even say the best Indian restaurant in the city.  Great service, reasonable price and unpretentious atmosphere. We felt we were in India once we stepped into the restaurant.  We felt very comfortable. Loved chicken tikka masala and prawn tikka masala let alone the delicious pizza.  We have yet to try all other dishes. Highly recommend to anyone who enjoys authentic Indian food. Huge plus for opening late at night.", "rating": 5, "date": "2016-08-29"}, {"excerpts": ["Indian Pizza and Chicken Tikka Masala Sauce!!!!  ", "I order the Indian pizza, the meat version, and then I dip that heavenly slice into their tikka masala sauce.  ", "It is pure bliss!   ", "Again, it's only the sauce (aka, without the chicken) because the pizza is enough.  ", "Really good stuff ", "and would always go back to get this combo.  ", "Add along chai tea"], "author": "Nerinna V.", "review": "This is my secret combo that I always love putting together when I'm at Zante's.......................Indian Pizza and Chicken Tikka Masala Sauce!!!!  I order the Indian pizza, the meat version, and then I dip that heavenly slice into their tikka masala sauce.  It is pure bliss!   Again, it's only the sauce (aka, without the chicken) because the pizza is enough.  Really good stuff and would always go back to get this combo.  Add along chai tea.....yum!!!!\n\nNote:  you may have to run several miles just to shed the pounds off after downing this wonderful combo.", "rating": 4, "date": "2013-02-04"}, {"excerpts": ["The chicken tikka masala is REALLY good but a little too THICK. ", "The naan is really good when fresh but on some days it doesn't taste fresh- ", "like it was made hours before eating it."], "author": "Jessie A.", "review": "This place is great on some days and eh, good on others. \n\nThe chicken tikka masala is REALLY good but a little too THICK. The naan is really good when fresh but on some days it doesn't taste fresh- like it was made hours before eating it.", "rating": 4, "date": "2015-02-07"}, {"excerpts": ["Try the Chicken Tikka pizza!"], "author": "Philip N.", "review": "Went here with 6 people and sat right down.  Food was great and server was very helpful.  Try the Chicken Tikka pizza!", "rating": 5, "date": "2015-07-03"}, {"excerpts": ["My boyfriend got the chicken tikka masala and he loved it. ", "We also got garlic and plain naan. ", "Only 2 pieces per order so kinda a small portion size. ", "total price came to 35- for 2 people so not bad. ", "Took about 10 minutes for them to make, so it was very fast. ", "Overall, very delicious and glad ", "I was able to find this so close to home!"], "author": "Lindsey G.", "review": "Placed an order for pickup. Wanted the lamb tikka masala, but they make it with almonds, so I got the lamb korma instead. I told them I really love the coconut milk in the tikka masala, so they added some to the korma and it came out sooooo delicious. It was a decent portion size for the price. I also got the rice, which was very fragrant and delicious. My boyfriend got the chicken tikka masala and he loved it. We also got garlic and plain naan. Only 2 pieces per order so kinda a small portion size. total price came to 35- for 2 people so not bad. Took about 10 minutes for them to make, so it was very fast. Overall, very delicious and glad I was able to find this so close to home!", "rating": 5, "date": "2014-06-17"}, {"excerpts": ["Also try the chicken tikka masala and the saag paneer, very good as well."], "author": "A M.", "review": "Best Indian pizza!!  I love this place.  Been a fan for many years.  I have never encountered a long wait time for delivery as other reviewers mentioned.  Also try the chicken tikka masala and the saag paneer, very good as well.", "rating": 4, "date": "2013-03-31"}, {"excerpts": ["The chicken tikka masala is uber creamy.  ", "Its sauce makes an amazing dipping sauce for the pizza or naan.  ", "A culinary highlight of indian cuisine.  ", "Yes, the decor ain't fancy, but that's the charm.  ", "I think it used to be a Greek restuarant and maintained its former Ionian name.  ", "If you want honest food with no wait including on a friday night give them a try!"], "author": "Armen Z.", "review": "I don't like seeing bad reviews of Zante's. If delivery is taking a long time just call and see what's up.  Back in the day, they would deliver all the way to the financial district for free.  But irrespective of how good their delivery is, their food rocks.  The chicken tikka masala is uber creamy.  Its sauce makes an amazing dipping sauce for the pizza or naan.  A culinary highlight of indian cuisine.  Yes, the decor ain't fancy, but that's the charm.  I think it used to be a Greek restuarant and maintained its former Ionian name.  If you want honest food with no wait including on a friday night give them a try!", "rating": 5, "date": "2013-11-10"}, {"excerpts": ["got chicken tikka masala, garlic nan, and lamb samosa.  ", "tasted good but an hour after eating had a upset stomach.  ", "next day was puking out both ends all day.  ", "only thing i ate that day.  ", "so im pretty sure it was their food.  ", "wont be returning."], "author": "Jb H.", "review": "rude on phone.  hung up on me after i stated my order and phone number.  nice in person while picking up food.  place looked clean in dining room.  got chicken tikka masala, garlic nan, and lamb samosa.  tasted good but an hour after eating had a upset stomach.  next day was puking out both ends all day.  only thing i ate that day.  so im pretty sure it was their food.  wont be returning.", "rating": 1, "date": "2015-05-15"}, {"excerpts": ["Four of us ordered an extra large Chicken Tikka Masala Pizza, chai, and I had kheer for dessert.  ", "(I haven't passed-up kheer since I had wheat kheer for breakfast in a Gujarati village).  ", "The Indian Pizza was quite good and Zante executed it well.  ", "The basic structure is pizza.  ", "The spices and toppings are Indian, other than the cheese - which was typical of pizza (a rich mozzarella it seemed).  ", "The service at Zante was prompt and the pizza was delivered in less than 15 minutes.  ", "It comes with the traditional mint and tamarind chutneys, which are essential.  ", "The chai was average and the kheer was the type that is more like rice pudding and less like sweet porridge.  ", "I'm a sucker for rice pudding, though, so if someone tries to make another dish but ends up with rice pudding, I still like it.  ", "I'll need to have more Indian Pizza to comment on the subtleties.  ", "For now, I'll leave it at this:  ", "Indian Pizza has a future and Zante does it well.  ", "I look forward to this culinary art being perfected and to avoid the difficult choice between \"Indian\" or \"pizza.", "\""], "author": "Jeff M.", "review": "Indian Pizza:  The entire concept was intriguing to me. The notion that East and West could successfully be combined in a single pizza seems obvious - but has been elusive for millenia.  Even today, the serious Indian Pizza places are few and far between.  I couldn't find it in Contra Costa.  Once the buzz got to me, the only question was \"Where?\"  Zante in Bernal Heights comes up over and over when inquiries are made and searches executed for the best of bay Indian Pizza.  Tonight, for my birthday dinner after the Giants game, we went to Zante.  Four of us ordered an extra large Chicken Tikka Masala Pizza, chai, and I had kheer for dessert.  (I haven't passed-up kheer since I had wheat kheer for breakfast in a Gujarati village).  The Indian Pizza was quite good and Zante executed it well.  The basic structure is pizza.  The spices and toppings are Indian, other than the cheese - which was typical of pizza (a rich mozzarella it seemed).  The service at Zante was prompt and the pizza was delivered in less than 15 minutes.  It comes with the traditional mint and tamarind chutneys, which are essential.  The chai was average and the kheer was the type that is more like rice pudding and less like sweet porridge.  I'm a sucker for rice pudding, though, so if someone tries to make another dish but ends up with rice pudding, I still like it.  I'll need to have more Indian Pizza to comment on the subtleties.  For now, I'll leave it at this:  Indian Pizza has a future and Zante does it well.  I look forward to this culinary art being perfected and to avoid the difficult choice between \"Indian\" or \"pizza.\"", "rating": 4, "date": "2014-04-27"}, {"excerpts": ["It's delicious, especially if you dip it in the sauce of the Chicken Tikka Masala...\n\n", "BUT:\n-the Chicken Tikka masala comes with 4 tiny pieces of chicken (not even worth it for the sauce)\n\nAND:\n"], "author": "julia h.", "review": "Yes the pizza is good, really really good. We get the Vegan Indian pizza. It's delicious, especially if you dip it in the sauce of the Chicken Tikka Masala...\n\nBUT:\n-the Chicken Tikka masala comes with 4 tiny pieces of chicken (not even worth it for the sauce)\n\nAND:\n-The pizza takes FOREVER to get there...Like 2 hours...\n\nSo pick it up, or skip it, the delivery is hit and miss and mostly miss :(", "rating": 3, "date": "2010-03-13"}, {"excerpts": ["You might not see the cost effectiveness of ordering a case at 2.99 a bottle, but getting a couple of Kingfishers with your chicken tikka masala and naan wouldn't be the worst proposition in the world, would it?\n\n"], "author": "Nelson W.", "review": "Let me spill the beans right up front:  Zante delivers beer!  You might not see the cost effectiveness of ordering a case at 2.99 a bottle, but getting a couple of Kingfishers with your chicken tikka masala and naan wouldn't be the worst proposition in the world, would it?\n\nFurthermore, the website is set up to let you order delivery without picking up the phone.  You get some pictures, and then you can click to order.  Not bad, not bad at all.  They usually call to confirm the order, so if you're a strange-number-so-I-won't-answer kinda person, you should be anticipating an important call about your food after ordering.\n\nThe food is pretty good.  Not super exciting, but I'd give it a solid 3.  I have no idea as to how far they will deliver to, but if you live in the Bernal Heights, Outer Mission, Glen Park, Noe Valley region, you should check it out.  The restaurant itself is pretty low budget, but not shabby. The Indian Pizza is decent as well.   \n\nOf COURSE I'm giving an extra star for the beer.", "rating": 4, "date": "2007-05-18"}, {"excerpts": ["I love their chicken tikka masala because of the sauce. "], "author": "Chris P.", "review": "The Indian food is decent, the pizza is definitely more spicy than \"normal\" pizza. It's interesting enough to warrant a \"order it at least once in your life\" and different enough for me to say \"don't blame me if you don't like it.\" \n\nThe good: I like the vege pizza and have ordered it many times. I love their chicken tikka masala because of the sauce. The vege samosas are good, especially with their side of sweet sauce.\n\nThe bad: Chicken can be a bit dry- which is why the sauces really help.  Pray you don't get a big chunk of ginger with your pizza slice, as it can be a rude taste sensation.\n\nThe awful: Their delivery is the worst I've ever experienced. Order early, like, WAY before you are hungry. They've come HOURS late (yes, HOURS late) on at least two occasions. The rest of the time they are just horribly late. I always say \"never again\" and then after a while I get the hankerin for that damn tikka masala (they must put heroin in it or something). Anyway, tonight the delivery guy called me from his cell and refused to come into my condo building and sat in his car. I explained that if he used the front panel I would buzz him in. No go. Never has any food delivery been such a pain in the ass. Next time I get the tikka massala craving, I'm just going to go straight to the heroin.\n\n***July 2013 Update*** \nI'm upgrading the Stars from 'Meh' to 'A-OK' because A) the heroin alternative was becoming a problem, and B) they've really turned their delivery around. And the food has always been good.", "rating": 3, "date": "2009-02-20"}, {"excerpts": ["Its like having chicken tikka overcooked naan ", "so I can't complain, its edible and enjoyable. ", "The vegetarian pizza is okay.. but not great. ", "I'd never order it again unless I was with a vegetarian. ", "The vegan pizza.. don't even bother unless you're actually vegan. ", "And if you're a friend of a vegan, don't try and be polite and split it, you will regret it."], "author": "Analisa S.", "review": "So the chicken pizza is okay. Its like having chicken tikka overcooked naan so I can't complain, its edible and enjoyable. The vegetarian pizza is okay.. but not great. I'd never order it again unless I was with a vegetarian. The vegan pizza.. don't even bother unless you're actually vegan. And if you're a friend of a vegan, don't try and be polite and split it, you will regret it.", "rating": 3, "date": "2011-07-14"}, {"excerpts": ["I just recently tried the indian food, the chicken tikka massala and curry with some naan was SLAMMING...", "all this time i was just satisfy with their combo pizza."], "author": "Angelisimo G.", "review": "I've been coming to Zante since i was a kid and I always ordered the combo pizza because is soooo damn good, whatever you do DON'T order the indian pizza unless you like a whole bunch of spices on your pizza,,,i made that mistake long time ago. \nThe people at Zante are freaking cool as hell, the owner is a great guy he would give me a free slice once in a while when i was a kid (he doesn't  do that any more...bastard lol)\nI just recently tried the indian food, the chicken tikka massala and curry with some naan was SLAMMING...all this time i was just satisfy with their combo pizza.", "rating": 5, "date": "2008-10-11"}, {"excerpts": ["we ordered the indian pizzas, chicken tikka masala, paneer, 4 different types of naan bread and a bunch of other food that i can't even remember. ", "everything was super yummy and really hit the spot. ", "the only thing that was not so good were the samosas. ", "but i am probably really biased because i've had authentic home-made samosas and the ones we ordered "], "author": "Linda N.", "review": "be advised i'm only reviewing the take-out, i've never actually eaten at the restaurant. my friends and i ordered a bunch of food for a friend's going away dinner. we ordered the indian pizzas, chicken tikka masala, paneer, 4 different types of naan bread and a bunch of other food that i can't even remember. everything was super yummy and really hit the spot. the only thing that was not so good were the samosas. but i am probably really biased because i've had authentic home-made samosas and the ones we ordered don't even come close to how good those were. \n\nthey delivered the food quickly and the food was really affordable. super yummy if you get a craving for indian food. it is really rich though so definitely not something you want to eat everyday. but its worth it to splurge every once in awhile. =)", "rating": 4, "date": "2011-07-18"}, {"excerpts": ["The trick to making it EVEN BETTER is to get an order of Chicken Tikka Masala and use the left over \"jesus juice\" as pizza topping.... "], "author": "Simon S.", "review": "Don't listen to the Ben guy... he's on crack!\n\nThis place serves the most original and tasty pizza in town. The trick to making it EVEN BETTER is to get an order of Chicken Tikka Masala and use the left over \"jesus juice\" as pizza topping.... YUMMY!\n\nEnjoy!\n\nMinus 1 star for shitty customer service and slow ass delivery!", "rating": 4, "date": "2007-08-08"}, {"excerpts": ["I ordered the Chicken Tikka Masala pizza expecting it to come with Chicken and Tikka Masala sauce but instead it just came with tandoori chicken on it. ", "Just call it a tandoori chicken pizza or just stop denying me my carnal pleasures and sauce it up with some masala curry! ", "Uber expensive and slowish too, but I'll be back."], "author": "Jackie S.", "review": "Pizza is Pizza, it's always gonna be good. These guys do it pretty good, the crust is nice and chewy and the flavors work pretty well. I just wish they had a bit more pizzaz to it. I ordered the Chicken Tikka Masala pizza expecting it to come with Chicken and Tikka Masala sauce but instead it just came with tandoori chicken on it. Just call it a tandoori chicken pizza or just stop denying me my carnal pleasures and sauce it up with some masala curry! Uber expensive and slowish too, but I'll be back.", "rating": 3, "date": "2013-11-29"}, {"excerpts": ["also, back when i first tried this place i ate meat, \nand ugh the chicken tikka masala is to die for.\n", "the sauce is so creamy and delicious. \n", "it sort of tastes like it may have some maple in it? or something? \n", "i have no idea. "], "author": "Jena R.", "review": "there is a god people.\ntheir name is zante.\n\nseriously, if you haven't tried the vegetarian indian pizza you haven't lived.\nalso, back when i first tried this place i ate meat, \nand ugh the chicken tikka masala is to die for.\nthe sauce is so creamy and delicious. \nit sort of tastes like it may have some maple in it? or something? \ni have no idea. it's just fabulous.\n\nthe saag paneer is amazing.\nit's spicy, but not too spicy.\nchana masala is awesome.\nEVERYTHING ROOLZ.\n\nonly downside is that it's a tad bit expensive and if you order delivery, chances are yr gonna be waiting awhile.\nusually an hour, sometimes 45 minutes if yr lucky.\nit's definitely best to just walk yr little self on in, \nride yr bike or hop on the 14 or 49.\n\nGO GO GO.", "rating": 4, "date": "2011-01-19"}, {"excerpts": ["NOT\n\nthe chicken tikka masala (CTM) is not hot at all. ", "11.99$ for the chicken tikka masala\n2.99$ for the garlic kulcha\n10.99$ for the chicken mushroom (which was also runny in curry"], "author": "Whitne Y.", "review": "hungry for some spicy CTM i decided to check out nearby indian restaurants and see what's out there, straying from my usual joint (little delhi). i ordered over the internet (fun!) and was given a call as promised within the ten minutes of placing the order, as a confirmation. great start!\n\ni ordered the CTM (which they advertised as zante's best) as hot as they allow--and chicken mushroom mild with garlic kulcha (garlic naan).\n\nthere was a hiccup with delivery and but despite the confusion as to where my address was exactly, the food arrived faster then the 45 minutes the man over the phone promised and was still piping hot.\n\nall of this, saves them from getting a star--stellar service for sure.\n\nthe food?\n\nNOT\n\nthe chicken tikka masala (CTM) is not hot at all. the color is a light yellow/orange color and very very watery. curries are suppose to be thick! this was so watery when i dipped my garlic kulcha in it the liquid just runs off the bread and back into the container leaving the bread simply wet.\n\nthe chicken itself was okay. \n\nthe CTM was not spicy at all\n\nand the garlic kulcha was very dry and bland. no taste to it despite the show of color and all the seasoning on it, it appears to be tasty but when you bite into it there is no flavor at all.\n\nreally disappointed with this, as naan and curry can do better then them tenfold and the cost is not as high.\n\n11.99$ for the chicken tikka masala\n2.99$ for the garlic kulcha\n10.99$ for the chicken mushroom (which was also runny in curry, i only sampled a bit as it was my sister's order)\n\nhorrible taste. but excellent service", "rating": 2, "date": "2010-05-18"}, {"excerpts": ["Our party ordered an extra large The Best Indian Pizza - which includes all 10 toppings - as well as some traditional Indian fares such as the chicken tikka masala, sag paneer, and plain & garlic nann; and we cleanly polished it all off.\n", "The Indian Pizza was definitely the main attraction of the night, especially for its uniqueness.  ", "It was good to have 10 ingredients, but the quality got lost in the quantity.  ", "Each bit was a different flavor (a little too much of garlic in my bites...) and I wish the ingredients were better evenly spread out and in bigger pieces for better taste recognition.\n", "The rest of the dishes were ok.  ", "Not bad, but the dishes were rather bland and lacked certain flavors/spices.\n", "Enjoyed the novelty and recommend it as a place to try.  ", "Also a good price point and good place for groups; came out to ~$13/person."], "author": "Carol K.", "review": "Indian Pizza?  Yes, that's right, Indian Pizza.\nA group of 7 headed down to this part of Mission with Indian Pizza as our objective.  \nOur party ordered an extra large The Best Indian Pizza - which includes all 10 toppings - as well as some traditional Indian fares such as the chicken tikka masala, sag paneer, and plain & garlic nann; and we cleanly polished it all off.\nThe Indian Pizza was definitely the main attraction of the night, especially for its uniqueness.  It was good to have 10 ingredients, but the quality got lost in the quantity.  Each bit was a different flavor (a little too much of garlic in my bites...) and I wish the ingredients were better evenly spread out and in bigger pieces for better taste recognition.\nThe rest of the dishes were ok.  Not bad, but the dishes were rather bland and lacked certain flavors/spices.\nEnjoyed the novelty and recommend it as a place to try.  Also a good price point and good place for groups; came out to ~$13/person.", "rating": 3, "date": "2010-09-05"}, {"excerpts": ["I went to Zante the other night after work, and on my way out I noticed a couple who had ordered a small Indian pizza and an order of chicken tikka masala ... and were DIPPING the pizza in the tikka masala sauce.  ", "Sweet Jesus ", "how did I never think of doing that???  ", "Next time, I swear, next time."], "author": "Matthew M.", "review": "When they were on 16th st. I sometimes used to stop and get a slice on my walk home from work.  Indian pizza is surprisingly tasty, let me tell you.  Like some of the other reviewers, I'm really not interested in their non-indian-pizza offerings such as the \"normal\" pizza or the non-pizza Indian food, as such things are surely far better elsewhere.  Really the whole point of going to Zante is to get the combination of the two.  4 stars for novelty and creativity: Yum!\n\nUpdate:  I went to Zante the other night after work, and on my way out I noticed a couple who had ordered a small Indian pizza and an order of chicken tikka masala ... and were DIPPING the pizza in the tikka masala sauce.  Sweet Jesus how did I never think of doing that???  Next time, I swear, next time.", "rating": 4, "date": "2006-04-24"}, {"excerpts": ["We had like 7 chicken tikka masalas, and at least that many saag paneers--slices of pizza, lassis, samosas, plain naan, cheese naan, garlic naan, and naan were messed up (drum roll please), and everything was delish as usual. ", "The total cost per person for a feast fit for a Raji? "], "author": "Aishe B.", "review": "Last night I ate zante's for like the gazillion(th) time. This particular eating extravaganza was for a birthday. Usually I do delivery (in which they arrive lickety split).  For this event we took up a big portion of the dining room, and as only a big group can be, were highly disorganized, confused, particular, and demanding when it came to ordering. Our unfortunate waiter was SO patient--so accomodating--so accurate. He was not only a waiter, he was a magician.  We had like 7 chicken tikka masalas, and at least that many saag paneers--slices of pizza, lassis, samosas, plain naan, cheese naan, garlic naan, and naan were messed up (drum roll please), and everything was delish as usual. The total cost per person for a feast fit for a Raji? 25.00\n\nI could go on and on, but i'll just be repeating all the other 4 and 5 star reviews.  I just have to say that this place is a local treasure.  I feel so lucky to live around the corner.  \nps. Did I mention the mango chutney?", "rating": 4, "date": "2007-08-30"}, {"excerpts": ["When I ordered spicy chicken tikka, I imagined it would taste a little bit spicy, and not just like orange butter sauce! ", "I found a much better Indian place already, so I'm not going back to Zante's ever."], "author": "Jessica R.", "review": "This is so sad, but, since I wrote that review the food has gone downhill by A LOT! Everytime I've had it in the last 6 months or so it either has 1) made me ill or 2) lacked any flavor whatsoever! When I ordered spicy chicken tikka, I imagined it would taste a little bit spicy, and not just like orange butter sauce! I found a much better Indian place already, so I'm not going back to Zante's ever.", "rating": 1, "date": "2010-03-07"}, {"excerpts": ["Chicken Tikka Masala--- comfort food. ", "The only problem I have with this place is the phone orders for delivery. ", "A little communication gap and orders can get messed up and resolved.  \n", "The Indian pizza has such an intense flavor of ginger and saffron, but not overwhelming. ", "Prices are VERY good too! ", "Don't be scared"], "author": "Ashley J.", "review": "The Indian pizza makes me dance. As dumb as that sounds, you know when you ate something that you liked as a kid, you did the same damn thing. Everything is pretty good. Chicken Tikka Masala--- comfort food. The only problem I have with this place is the phone orders for delivery. A little communication gap and orders can get messed up and resolved.  \nThe Indian pizza has such an intense flavor of ginger and saffron, but not overwhelming. Prices are VERY good too! Don't be scared", "rating": 4, "date": "2007-09-21"}, {"excerpts": ["The chicken tikka masala is dangerous. ", "I caught myself licking the sauce off the weeny little piece aluminum foil they use to protect the rest of the world from the cardboard Chinese take-out tikka masala ", "BOMB ", "they send you. ", "Seriously guys, can't you spring for plastic containers? ", "Maybe even... with lids? ", "But that's part of Zante's charm. ", "Half-ass containers, incidental deliveries. ", "And if they actually get their act together and feed us Indian pizza as regularly as we want, San Francisco will be sinking into the bay even more than it already is. "], "author": "Marie A.", "review": "Oh Zante. You know you're awesome, don't you? You can show up an hour late, but who cares? Am I gonna call that OTHER Indian pizza joint? Nooooo. So, all four stars are for the food, not the service. In-house service could be great for all I know, but the delivery service is truly awe inspiring. Which dishes will show up? Which won't? Will I even get my food before they close? (\"Our driver couldn't find your place and he went home cuz we're closing. If you get here in 5 minutes you can pick it up...\") As for that food, \"The World's Most Fantastical Indian Pizza\" or whatever they call it is in fact just that. Not that I've had any other Indian pizzas to compare it to but still. Damn good. The chicken tikka masala is dangerous. I caught myself licking the sauce off the weeny little piece aluminum foil they use to protect the rest of the world from the cardboard Chinese take-out tikka masala BOMB they send you. Seriously guys, can't you spring for plastic containers? Maybe even... with lids? But that's part of Zante's charm. Half-ass containers, incidental deliveries. And if they actually get their act together and feed us Indian pizza as regularly as we want, San Francisco will be sinking into the bay even more than it already is. Better leave well enough alone.\n\nUPDATE:\nSo, they forget my pizza one evening. Guess who's ringing my doorbell the next morning? That's right. The delivery guy. In the same clothes. With my pizza. That was in his car overnight. \n\nIs there any other pizza place that delivers breakfast? I think not. Way to be, Zante. Way to be.", "rating": 4, "date": "2009-05-21"}, {"excerpts": ["And saag paneer, chicken tikka masala, garlic naan and rice. ", "Yum! ", "I never had Indian pizza in conjunction with Indian food. ", "It was great! dipping the pizza in some saag paneer was perfect! \n", "The pizza was perfect too! ", "All the veggies, cheese, and Indian spices. \n", "The service was fine, nothing spectacular, but they got nothing wrong and were pretty prompt with the food. ", "No frills, no nonsense. ", "I like that. \n", "So for an evening of catching up with friends on our latest travels, this place was perfect. ", "We went home feeling full, caught up and didn't have to break the bank! \n", "Large pizza, inidan food, wine, beer, tax and tip: $70 for 4 people."], "author": "Caroline C.", "review": "A solid 3 stars. I was trying to figure out a place that a small group of friends could go to for dinner.  We all wanted a place that was near us, no crowds or a scene, no need to yell to hear each other, no paying crazy prices, and most importantly, good food. We decided Zante's would be the place. I've never actually sat down in this place to eat. I've often ordered pizzas for delivery(and have had no issues with them) or pick up and have consistently loved their pizzas. \nSo we arrive on a Friday night, and it's very quiet, maybe two or three other tables. We all decided on a large Indian pizza, half veggie, half tandoori chicken. And saag paneer, chicken tikka masala, garlic naan and rice. Yum! I never had Indian pizza in conjunction with Indian food. It was great! dipping the pizza in some saag paneer was perfect! \nThe pizza was perfect too! All the veggies, cheese, and Indian spices. \nThe service was fine, nothing spectacular, but they got nothing wrong and were pretty prompt with the food. No frills, no nonsense. I like that. \nSo for an evening of catching up with friends on our latest travels, this place was perfect. We went home feeling full, caught up and didn't have to break the bank! \nLarge pizza, inidan food, wine, beer, tax and tip: $70 for 4 people.", "rating": 3, "date": "2006-12-26"}, {"excerpts": ["We ordered an extra large Indian pizza, some curry that was supposed to be just like chicken tikka masala, chicken tandoori, samosas, naan, chicken and vegetable Pakora.  ", "The Pakoras were a hit!  ", "The samosas and chicken tandoori were only ", "okay unfortunately because I LOVE samosas ", "but by far the most disappointing item was the chicken tikka-like curry.  ", "It was pretty darn bad is all I can say.  ", "That teaches us to order curry when the restaurant is famous for its pizza.  ", "Now for the pizza.  ", "The first words to fly out of my mouth were that is ", "was interestingly GREAT!  ", "I don't even know what was all in the pizza because there were so many toppings ", "but it was great ", "and all the ingredients all worked well together.  ", "I remembered the shopped shrimp being a delightful surprise.  ", "Well worth all the other obstacles (bad curry) to get there.  ", "One thing to note was that I did not feel too great when I got home.  ", "One of the girls I spoke with later told me that when she went to the bathroom during dinner she saw mouse droppings all over the staircase!  ", "I personally didn't see it ", "but that would explain my queasiness.  ", "That being said, what I didn't see didn't really hurt me so I would still go back to try out the pizza again and see if it is still as good as I remembered!"], "author": "Susan L.", "review": "These reviews are part of a series where my Vancouverite friend wanted to try a bunch of food carts all weekend.  We ended up deviating to some other cheap eats.\n\nThe contestants:  Lers Ros Thai, Fritzj, Adobo Hobo, Pizza Hacker, Gumbo Cart, Lumpia Cart, Bi-Rite Creamery, El Farolito, Bacon Dog Cart, Pho Garden, Zante's Indian Pizza\n\nThis review is about Zante's Indian Pizza.  It was somewhat interesting how we got to eating at this restaurant.  When we were talking with all the food cart guys and swapping good eats, one guy mentioned that a place called Zante's was incredible for Indian pizza.  Of course this piqued my interest as I love Indian food AND pizza so I made a mental note of it.  Then towards the end of our weekend of cheap eats, we were going to finish off the night at a place called the Limon Rotisserie but apparently it was too far out of the way for a friend so she recommended a place called the Front Porch in case we didn't have enough grease.  When I called in to make a reservation for 8pm, they weren't able to accommodate us right away so I hunkered down for the wait.  That's when a completely different friend mentioned that there was a supposedly great Indian pizza restaurant nearby called Zante's!  Apparently this place always had a wait but we figured we might as well wait for it and if our rezos at Front Porch came along first, we could just walk over.  Well, lucky us the manager was willing to seat us right away!  \n\nWe ordered an extra large Indian pizza, some curry that was supposed to be just like chicken tikka masala, chicken tandoori, samosas, naan, chicken and vegetable Pakora.  The Pakoras were a hit!  The samosas and chicken tandoori were only okay unfortunately because I LOVE samosas but by far the most disappointing item was the chicken tikka-like curry.  It was pretty darn bad is all I can say.  That teaches us to order curry when the restaurant is famous for its pizza.  Now for the pizza.  The first words to fly out of my mouth were that is was interestingly GREAT!  I don't even know what was all in the pizza because there were so many toppings but it was great and all the ingredients all worked well together.  I remembered the shopped shrimp being a delightful surprise.  Well worth all the other obstacles (bad curry) to get there.  One thing to note was that I did not feel too great when I got home.  One of the girls I spoke with later told me that when she went to the bathroom during dinner she saw mouse droppings all over the staircase!  I personally didn't see it but that would explain my queasiness.  That being said, what I didn't see didn't really hurt me so I would still go back to try out the pizza again and see if it is still as good as I remembered!", "rating": 3, "date": "2009-11-04"}, {"excerpts": ["slather chicken tikka masala all over garlic naan, add deliciously seasoned & slow roasted vege Moussakaa (eggplant, chickpeas, onions, tomatoes, chard, and a cauliflower garlic melange), PRESTO,  \"PIZZA\" PERFECTION!  ", "always been easy to order & accurate, quick delivery.  ", "I dunno after 9 years what else they serve, i've never had a reason to stray.  ", "Last time I ate @ ", "Tasty Bite on the other Cortland corner", ", all i could do was compare & stare sadly across the street @ the Zante's awning.  ", "If I was a kid in the city, I'd stay home \"sick\" just to get this order all to myself!"], "author": "Heiress K.", "review": "slather chicken tikka masala all over garlic naan, add deliciously seasoned & slow roasted vege Moussakaa (eggplant, chickpeas, onions, tomatoes, chard, and a cauliflower garlic melange), PRESTO,  \"PIZZA\" PERFECTION!  always been easy to order & accurate, quick delivery.  I dunno after 9 years what else they serve, i've never had a reason to stray.  Last time I ate @ Tasty Bite on the other Cortland corner, all i could do was compare & stare sadly across the street @ the Zante's awning.  If I was a kid in the city, I'd stay home \"sick\" just to get this order all to myself!", "rating": 5, "date": "2009-08-21"}, {"excerpts": ["After my negative encounter with the pizza that this establishment is touted for, I didn't even touch the Chicken Tikka that our party ordered.  ", "If you want good Indian pizza, go to Mirchi's in Fremont.  ", "If you want better Indian food, go to just about any other Indian restaurant."], "author": "Momo R.", "review": "Lamb, Beef, and shrimp sitting on top of a thick, gooey curry paste?  What kind of \"Indian\" pizza is that?  Gag me with a frickin' spoon.  After my negative encounter with the pizza that this establishment is touted for, I didn't even touch the Chicken Tikka that our party ordered.  If you want good Indian pizza, go to Mirchi's in Fremont.  If you want better Indian food, go to just about any other Indian restaurant.", "rating": 2, "date": "2008-07-19"}, {"excerpts": ["The Chicken Tikka Masala  was memorable as well. ", "The entree portions were a bit small for the prices but over all another good experience at Zantes."], "author": "Mingus R.", "review": "I have yet to go wrong the vegetarian pizza. I didn't even feel the urge to pull the cauliflower off. Last night a friend and I ordered in.  Their veggie samosas are probably my favorite around town. I was really impressed by the Prawn Sagwala. The prawns were tender not chewy and the spinach sauce was spot on.  The Chicken Tikka Masala  was memorable as well. The entree portions were a bit small for the prices but over all another good experience at Zantes.", "rating": 4, "date": "2006-01-04"}, {"excerpts": ["and i've tasted much better Chicken Tikka Masala, even at the indian slash chinese slash burger joint down the street from me."], "author": "Marie B.", "review": "Ok Ok so admittedly I'm a bit biased because my introduction to Indian food was Naan N' Curry and Star of India. And according to my Indian friends those places don't count as indian food, but I love them so there. But as for me Zante's is no comparison.  The food was alright, the pizza was pretty good with some veggie curry on top but other than that I was rather unimpressed.  Service came from a nice man but he charged for food we didn't order and paying the bill was a big old hassle. So I say if your in the neighborhood sure go check it out, but don't go out of your way to try this place it ain't that great and i've tasted much better Chicken Tikka Masala, even at the indian slash chinese slash burger joint down the street from me.", "rating": 2, "date": "2007-03-27"}, {"excerpts": ["You get only about two pieces of chicken in the chicken tikka masala - pretty chintzy."], "author": "Linda G.", "review": "I like the Indian pizza, but the standard Indian fare is nothing special.  You get only about two pieces of chicken in the chicken tikka masala - pretty chintzy.", "rating": 2, "date": "2010-01-01"}, {"excerpts": ["The chicken tikka masala, not that good. ", "The naan not that good that good as well. ", "A little dry. ", "Not flaky. ", "Oh well, not going to make the trip back here."], "author": "Andrew Y.", "review": "Pizza was good. Had the Best Indian Pizza. A nice flavour. Tasted like Indian food less the sauces. We also had a regular pizza with pepperoni, mushroom, garlic and olives. Nice garlic flavour. My problem with thisis that the toppings stopped too far from the crust. We also got some Indian food.This is where the food takes a turn. The chicken tikka masala, not that good. The naan not that good that good as well. A little dry. Not flaky. Oh well, not going to make the trip back here.", "rating": 3, "date": "2008-06-15"}, {"excerpts": ["DO try the chicken tikka masala, and the veggie pakora. ", "Oh, and the word on the street is that you can order paneer tikka masala, too, even though it doesn't appear on the menu. ", "If you go the paneer route, though, be very explicit about wanting to sub paneer for chicken, because I've encountered some pretty heavy language barriers with the Zantes folks before, as nice as they are. ", "My overall theory is that Indian pizza places have great regular Indian food, too, since I also happen to love Raja in the lower haight. ", "But Zante can definitely throw together some SERIOUS tikka masala sauce every now and then, so just a little something to consider as a \"side\" to your pizza..."], "author": "Shannon R.", "review": "I say skip the pizza--it's def. not the standout item, contrary to popular belief. DO try the chicken tikka masala, and the veggie pakora. Oh, and the word on the street is that you can order paneer tikka masala, too, even though it doesn't appear on the menu. If you go the paneer route, though, be very explicit about wanting to sub paneer for chicken, because I've encountered some pretty heavy language barriers with the Zantes folks before, as nice as they are. My overall theory is that Indian pizza places have great regular Indian food, too, since I also happen to love Raja in the lower haight. But Zante can definitely throw together some SERIOUS tikka masala sauce every now and then, so just a little something to consider as a \"side\" to your pizza...", "rating": 4, "date": "2007-03-01"}, {"excerpts": ["If you try to eat there or get some dry chicken tikka masala, you only have yourself to blame."], "author": "S S.", "review": "I get the indian pizza without lamb or prawns every time.  It's amazing.  The five stars is for the pizza only and not for the atmosphere or the indian food, because that's terrible.  Just order an indian pizza for pick-up - that's what's five star about this place.  If you try to eat there or get some dry chicken tikka masala, you only have yourself to blame.", "rating": 5, "date": "2010-08-15"}, {"excerpts": ["Also, the chicken tikka masala is significantly less greasy and heavy and more delicious than at many Indian restaurants in the city- notably, Naan and Curry. ", "The chicken pekora does vary depending I guess if they just deep-fried it for you, but if they did, it's one of the best things ever, particularly with the spicy mint green and sweet tamarind dipping sauce. ", "Perhaps the pizza isn't that great, and the atmosphere could be classed up, but the people are very nice and the Indian food, for the money, is consistently very good. ", "It has a nice, homey vibe and it's usually not hard to get a table. ", "Plus the delivery has gotten a LOT faster lately. ", "I've been to a lot of Indian restaurants in the city, and I always go back to Zante for an tasty, affordable and dependable meal. ", "For dinner, main entrees usually run about $10."], "author": "aunt t.", "review": "Zante has the best naan in the city- order the onion kulcha, which is buttery, lightly crispy, and has a dusting of green onions on the top. Also, the chicken tikka masala is significantly less greasy and heavy and more delicious than at many Indian restaurants in the city- notably, Naan and Curry. The chicken pekora does vary depending I guess if they just deep-fried it for you, but if they did, it's one of the best things ever, particularly with the spicy mint green and sweet tamarind dipping sauce. Perhaps the pizza isn't that great, and the atmosphere could be classed up, but the people are very nice and the Indian food, for the money, is consistently very good. It has a nice, homey vibe and it's usually not hard to get a table. Plus the delivery has gotten a LOT faster lately. I've been to a lot of Indian restaurants in the city, and I always go back to Zante for an tasty, affordable and dependable meal. For dinner, main entrees usually run about $10.", "rating": 4, "date": "2007-04-02"}, {"excerpts": ["I've never gotten this because I don't like pizza too much but the chicken tikka marsala is great and the other Indian dishes are authentic and cheap.  ", "Drawback?  ", "The interior is dark and unappealing and the peeps there aren't the friendliest --- not a place to impress a date, that is for sure."], "author": "David M.", "review": "Indian place with supposedly delicious Indian pizza --- pizza with Indian vegetables and spices and stuff.  I've never gotten this because I don't like pizza too much but the chicken tikka marsala is great and the other Indian dishes are authentic and cheap.  Drawback?  The interior is dark and unappealing and the peeps there aren't the friendliest --- not a place to impress a date, that is for sure.", "rating": 3, "date": "2006-06-19"}], "boti kabab": [], "seekh kabab": [], "tandoori mixed grill": [], "pieces tandoori chicken wings": [], "chicken makanwala": [{"excerpts": ["Dine-in Highlights: chicken makanwala and mango lassi - maybe the best in the city."], "author": "Jaime Y.", "review": "Ever since I moved from the Mission, I haven't been able to find anything like Zante's. Their pizza was culinary crack fuel for so many starving-student all-nighters. Tender dough crusted with cornmeal and generously slathered with an Indian masala-cheese sauce, heaped with moist bits of chicken, red onions and garlic. Oh heavenly aroma. My friends would wonder why there was always a slice or two missing when I arrived at their house a few blocks away.\n\nOn more than one occasion, I've ordered a slice to-go and opened the box to find two slices or even a quarter slab of pizza. They take care of their regulars is what I'm saying. \n\nDine-in Highlights: chicken makanwala and mango lassi - maybe the best in the city.", "rating": 5, "date": "2011-06-25"}, {"excerpts": ["My favorite order there: Veggie Samosa, Chicken Makanwala, Prawn Vindaloo and Bhinde Masala, plus a glass of Mango Lassi. ", "- Oh my lord, I have to go there tonight!"], "author": "Yina M.", "review": "This is the BEST indian restaurant in the city. Frankly, I tried most of them. My favorite order there: Veggie Samosa, Chicken Makanwala, Prawn Vindaloo and Bhinde Masala, plus a glass of Mango Lassi. - Oh my lord, I have to go there tonight!", "rating": 4, "date": "2005-06-17"}], "chicken korma": [{"excerpts": [", their chicken korma is unreal. ", "But worth getting at least an extra large cheese, because less wont be enough."], "author": "Simon R.", "review": "The best pizza in\nSan francisco hands down. Really good indian food as well, their chicken korma is unreal. But worth getting at least an extra large cheese, because less wont be enough.", "rating": 5, "date": "2018-03-17"}, {"excerpts": ["I always order the chicken korma (too die for!) . ", "They infuse the spices so well. ", "They make the pizza with the same dough as the naan ", "and it's so ", "so so good! ", "I really hope this place gets more recognition because I thoroughly enjoy it. ", "If you don't like Indian food- ", "the pizza here is great either way !"], "author": "Jocelyn R.", "review": "Love this place. Only Indian place I go to in the city and it's excellent. I always order the chicken korma (too die for!) . They infuse the spices so well. They make the pizza with the same dough as the naan and it's so so so good! I really hope this place gets more recognition because I thoroughly enjoy it. If you don't like Indian food- the pizza here is great either way !", "rating": 4, "date": "2016-09-22"}, {"excerpts": ["We had chicken Korma and chicken tikka masala and Chana masala ", "all were great."], "author": "Monica T.", "review": "Clean. Friendly. I took the kids and We stayed with the Indian food menu. I found the curries tasty. We had chicken Korma and chicken tikka masala and Chana masala all were great.", "rating": 4, "date": "2016-07-11"}, {"excerpts": ["i love the chicken korma and their naan!!!  "], "author": "faye b.", "review": "i love the chicken korma and their naan!!!  but i absolutely HATE their service.  \n\nwhen i dine in, they are super rude and tell me that i've ordered too much food and that i should take something off my order.  excuse me, but i know what i want to eat, and i know how much i can eat.  don't tell me to limit my order, especially if i am PAYING you to make it!  and then when i'm done, the waiter then points at the empty dishes and motions with his finger to hand them to him instead of just picking up the dishes himself!  come on! really?  did you just do that?  don't do that, i'm not a dog.\n\nand it's not just their dine-in service that sucks.  their over-the-phone service is rude too!  i called to place an order and they were so quick to hang up on me!  i wanted to pay by card, so i had to call them back to give them my card number.  then they hung up on me as soon as i finished reading them the last digits!  so rude!\n\nif it wasn't for my love of the korma and naan, i would never, ever, EVER eat food from this place.  you've all been warned!  but seriously, their korma is hella good =)", "rating": 3, "date": "2010-12-12"}, {"excerpts": ["The Chicken Korma is my other favorite. ", "Not spicy, just creamy and delicious. "], "author": "Keri V.", "review": "I have to say that I love Zante for many reasons.\n\nYou can pop in most anytime and get a table. \n\nThe food is amazing. If you want it spicy, just tell them! They adjust each dish individually. I LOVE the Muill Igatawny soup! Perfectly spiced, with ginger and shredded chicken. Sooo good. \n\nThe Chicken Korma is my other favorite. Not spicy, just creamy and delicious. The lamb Somosa's were perfect appetizers. \n\nWe have eaten there many times and always have enjoyed our food and the waiter is always friendly and helpful. \n\nMy son ordered the pizza once and wasn't totally impressed, but it is to be expected from a 12 year old wanting regular pizza. It worked well enough for all of us to eat at the same place and have what we wanted. \n\n\n I will admit that the one time we had delivery, it took forever, but since then, we just pop in. In my opinion, regardless of the restaurant  delivery is never as good as eating in the restaurant, so I still give them 5 stars!", "rating": 5, "date": "2009-07-27"}, {"excerpts": ["I love love LOVE their Chicken Korma! ", "Creamy, slightly spicy sauce, tender, white meat hunks of chicken...", "I'm salivating as I type this!  ", "Also try their Veggie Samosas, and their Saag Prawn...basically lovely creamed spinach with spices and nuts and PRAWNS!! ", "For instance, a really divine meal involves ordering a cheese pizza and then an order of Chicken Korma and then dipping said pizza slices into the sauce!  ", "It's a departure from the Naan bread you would normally use to sop up the yummy sauces (though this place has GREAT naan.."], "author": "Karen S.", "review": "I love this place!  The only reason I \"4' star'd it vs \"5\" starrin' it was because of price and parking IF you decide to dine in.\nAhem...now then...the reasons I love this place?\n\nYUMMY pizza...and I mean, your typical pizza pie, with everything on it...very yummy crust and generous with the toppings!  Also, they make INDIAN pizza with spinach and tandoori chicken and other yummy seasonings! Definitely worth a try yelpsters! Even if you order a regular pizza and then a slice of the Indian pizza! You will not be disappointed!\n\nREALLY YUMMY Indian food! I love love LOVE their Chicken Korma! Creamy, slightly spicy sauce, tender, white meat hunks of chicken...I'm salivating as I type this!  Also try their Veggie Samosas, and their Saag Prawn...basically lovely creamed spinach with spices and nuts and PRAWNS!! DEE-lish!!!\n\nYou know what else I like to do?? MIX it UP!!! For instance, a really divine meal involves ordering a cheese pizza and then an order of Chicken Korma and then dipping said pizza slices into the sauce!  It's a departure from the Naan bread you would normally use to sop up the yummy sauces (though this place has GREAT naan..I recommend Plain or Garlic Naan)\n\nI have had no problems with ordering over the phone...in fact, one of the owners, Tony, who is totally hot by the way, knows my VOICE now! and my favorites!    Hot! Hotter! Hottest!! (~_~)   Yes, sometimes when I call and Tony's not there, you might get someone who speaks with an accent, but we can understand each other enough to give/receive a dinner order!   I agree with other posters who mentioned, this place surely is NOT the Four Seasons in terms of decor..it's a Pizza-Indian place in the Mission, are you that surprised this place isn't like a scene from a dinner party in \"Brideshead Revisited?\" BUT..they have cheap pitchers of good  beer, (TAJ Mahal? KingFisher anyone?)  plenty of room if you have a big group or someone has a kid in a stroller or someone's in a wheel chair (I run with a wild crowd (~_~) I dunno, all around this place is a winner,  I wish the prices were a tad cheaper AND I do wish they had parking!  It's a very busy area, the nearby corners are almost ALL bus stops, you may circle 5-10 times before finding a space 3 blocks away!  You could \"bus\" it there if you're into that sort of thing...they do have a parking lot in the back  (Enter on Cortland Ave) but it's kinda dark and narrow and scary...always filled with cars (of the workers) or delivery guys...so it's almost a \"why bother\" shrug type thing...oh well.  Still love this place for dine in or delivery, yum pizza and Indian food, cute Tony on the phones or handing you your take out...Git along lil doggies...over to Zante's!", "rating": 4, "date": "2009-12-01"}, {"excerpts": ["I've never had any trouble, but today was especially easy -- received my order 35 minutes after placing my order, delivery guy was especially friendly and feisty, and my chicken korma and pizza were especially tasty. ", "Bravo, Zante!"], "author": "MB T.", "review": "This is my go-to Indian delivery. I've never had any trouble, but today was especially easy -- received my order 35 minutes after placing my order, delivery guy was especially friendly and feisty, and my chicken korma and pizza were especially tasty. Bravo, Zante!", "rating": 4, "date": "2012-06-03"}, {"excerpts": ["The chicken korma, aloo gobi, and garlic naan are pretty scrumtious though.  ", "And they will deliver anywhere in the city."], "author": "Melissa G.", "review": "I've ordered from here tons of times, and still havn't tried the pizza.  Hmm.  The chicken korma, aloo gobi, and garlic naan are pretty scrumtious though.  And they will deliver anywhere in the city.", "rating": 4, "date": "2006-05-20"}], "chicken sagwala": [{"excerpts": ["Their Indian pizza is terrific, as is their chicken sagwala.  ", "But their customer service SUCKS and if you are ordering for delivery be prepared 1) for at least a 75 minute wait, 2) to be brushed off/treated rudely when you call asking about it, and 3) for the order to be magically \"on its way\" when you call and ask (for the 2nd or 3rd time) why it's taking so long."], "author": "maggie r.", "review": "We've been ordering from Zante for years.  Their Indian pizza is terrific, as is their chicken sagwala.  But their customer service SUCKS and if you are ordering for delivery be prepared 1) for at least a 75 minute wait, 2) to be brushed off/treated rudely when you call asking about it, and 3) for the order to be magically \"on its way\" when you call and ask (for the 2nd or 3rd time) why it's taking so long.", "rating": 3, "date": "2017-03-26"}, {"excerpts": ["I tasted their Chicken curry (Chicken Sagwala) and their small Indian Pizza. \n\n"], "author": "Alberto L.", "review": "Another gem I have discovered in the fair city of San Francisco I tasted their Chicken curry (Chicken Sagwala) and their small Indian Pizza. \n\nNot completely overrun by hipsters of course! \n\nI recommended the place to my friends such as Captain, and Rastrillo\n\nGreat service! Raj is one of the servers who has photographic memory so he actually remembered one of my friends and me.\n\nSince then I've been to this place on separate occasions with friends, definitely a great place for a first date.\n\nLove this place!", "rating": 5, "date": "2008-09-13"}], "chicken mushroom": [{"excerpts": ["The pizza is quite good, and the rest (saag paneer, chicken mushroom, salad, raita, samosas) is pretty good too.  ", "Lots of food for the price - enough for 3 full meals for the two of us.  ", "We're both happy and very full!  ", "Maybe I was just lucky?  ", "Who knows.  ", "I'd definitely order again."], "author": "Mai-Sie C.", "review": "I'd heard about this Indian pizza a while ago but never tried it till tonight.  My husband and I decided to make this a lazy Monday order-in night, and the plan was to have the delivery around 8pm, when he was planning on getting back home.  Since I got home first, I went onto GrubHub to browse for a new place to try.  I saw Zante and remembered I had wanted to try it before.  I checked quickly on Yelp and saw it had 4 stars and the first few reviews sounded reassuring, so since it was already 7:30pm, I quickly ordered several things, including an Indian pizza, of course.\n\nIt wasn't until AFTER I placed the order that I kept browsing the rest of the Yelp reviews out of curiosity.  And to my dismay, I saw the numerous reviews describing poor service, horrible delivery times of 2 hours, cold pizza, and mixed up or lost orders.  I get a sinking feeling in my stomach.  Our late dinner was going to become a very very late dinner....\n\nOr so I thought.\n\n7:33pm - GrubHub order entered.  Estimated delivery time 8:23pm.\n\n7:35pm - GrubHub confirmation email received.  Updated estimated delivery time is 8:25pm.\n\n7:51pm - I call Zante to make sure the have at least received my online order.  The guy who answers the phone asks for my address, then quickly says \"Yeah, we got your order.  It's leaving now.\"  short pause. \"It's almost ready, it will leave in a few minutes.\"  Since it has only been 18 minutes since I put in my order, and since I've seen all the other Yelp reviews, I think to myself he must automatically say that for every phone call.  I ask him to read my my order.  He reads the items.  At least they really got the order.\n\n7:56pm - Husband arrives home.  I tell him I ordered food but warn him we might have to wait a while, really worried that I ordered too quickly before doing thorough Yelp research....\n\n8:04pm - Cell phone rings.  It's the delivery man.  He says he's downstairs.  I'm suspicious, thinking this is too fast to be real.  Is he calling before he's really here?\n\n8:07pm - Delivery man arrives at our door with the food.  I'm in disbelief.  He's 18 minutes ahead of schedule, and barely half an hour after the order placed.\n\nAnd the food?  It's all hot.  Normal take-out containers.  No soggy gooey cardboard boxes.  The pizza is quite good, and the rest (saag paneer, chicken mushroom, salad, raita, samosas) is pretty good too.  Lots of food for the price - enough for 3 full meals for the two of us.  We're both happy and very full!  Maybe I was just lucky?  Who knows.  I'd definitely order again.", "rating": 4, "date": "2011-07-18"}, {"excerpts": ["i ordered the CTM (which they advertised as zante's best) as hot as they allow--and chicken mushroom mild with garlic kulcha (garlic naan).\n\n", "when i dipped my garlic kulcha in it the liquid just runs off the bread and back into the container leaving the bread simply wet.\n\n", "the CTM was not spicy at all\n\nand the garlic kulcha was very dry and bland. ", "11.99$ for the chicken tikka masala\n2.99$ for the garlic kulcha\n10.99$ for the chicken mushroom (which was also runny in curry", "11.99$ for the chicken tikka masala\n2.99$ for the garlic kulcha\n10.99$ for the chicken mushroom (which was also runny in curry"], "author": "Whitne Y.", "review": "hungry for some spicy CTM i decided to check out nearby indian restaurants and see what's out there, straying from my usual joint (little delhi). i ordered over the internet (fun!) and was given a call as promised within the ten minutes of placing the order, as a confirmation. great start!\n\ni ordered the CTM (which they advertised as zante's best) as hot as they allow--and chicken mushroom mild with garlic kulcha (garlic naan).\n\nthere was a hiccup with delivery and but despite the confusion as to where my address was exactly, the food arrived faster then the 45 minutes the man over the phone promised and was still piping hot.\n\nall of this, saves them from getting a star--stellar service for sure.\n\nthe food?\n\nNOT\n\nthe chicken tikka masala (CTM) is not hot at all. the color is a light yellow/orange color and very very watery. curries are suppose to be thick! this was so watery when i dipped my garlic kulcha in it the liquid just runs off the bread and back into the container leaving the bread simply wet.\n\nthe chicken itself was okay. \n\nthe CTM was not spicy at all\n\nand the garlic kulcha was very dry and bland. no taste to it despite the show of color and all the seasoning on it, it appears to be tasty but when you bite into it there is no flavor at all.\n\nreally disappointed with this, as naan and curry can do better then them tenfold and the cost is not as high.\n\n11.99$ for the chicken tikka masala\n2.99$ for the garlic kulcha\n10.99$ for the chicken mushroom (which was also runny in curry, i only sampled a bit as it was my sister's order)\n\nhorrible taste. but excellent service", "rating": 2, "date": "2010-05-18"}], "chicken vindaloo": [{"excerpts": ["Could barely taste the difference between the Chicken Curry and Chicken Vindaloo. \n", "I didn't think it was possible for curry to be flavorless, but i was wrong.   ", "Imagine making curry at home and the recipe calls for 1 cup of water "], "author": "Richard H.", "review": "This place is pretty mediocre.  Delivery took an hour and twenty minutes. \n\nLamb Samosa had a nice crunchy exterior, unfortunely the filling was pretty flavorless.\n\nCould barely taste the difference between the Chicken Curry and Chicken Vindaloo. \nI didn't think it was possible for curry to be flavorless, but i was wrong.   Imagine making curry at home and the recipe calls for 1 cup of water but you put 3 cups of water.  \n\nI have not tried the pizza and dont plan to.  There are too many good indian places in the mission to try this again.", "rating": 2, "date": "2013-01-29"}, {"excerpts": ["Ordered veg samosas, lamb korma, chicken vindaloo and sag paneer. ", "All delicious. "], "author": "Scott D.", "review": "First time here and I am VERY impressed with the quality of the cuisine. Ordered veg samosas, lamb korma, chicken vindaloo and sag paneer. All delicious. Also hot and  right out of the oven: plain and onion nan. Asked about their \"Indian pizza\" and was provided a large free slice, which had the lightest crust and a tasty spinach sauce instead of tomato. So good that though I'm stuffed, I ordered a medium pizza to go. I live in Reno, but I'll be back to Zante's for sure.", "rating": 5, "date": "2012-03-24"}], "chicken bhuna": [], "chicken curry": [{"excerpts": ["Could barely taste the difference between the Chicken Curry and Chicken Vindaloo. \n", "I didn't think it was possible for curry to be flavorless, but i was wrong.   ", "Imagine making curry at home and the recipe calls for 1 cup of water "], "author": "Richard H.", "review": "This place is pretty mediocre.  Delivery took an hour and twenty minutes. \n\nLamb Samosa had a nice crunchy exterior, unfortunely the filling was pretty flavorless.\n\nCould barely taste the difference between the Chicken Curry and Chicken Vindaloo. \nI didn't think it was possible for curry to be flavorless, but i was wrong.   Imagine making curry at home and the recipe calls for 1 cup of water but you put 3 cups of water.  \n\nI have not tried the pizza and dont plan to.  There are too many good indian places in the mission to try this again.", "rating": 2, "date": "2013-01-29"}, {"excerpts": ["And my friends had the foresight to order the chicken curry for dipping.\n\n"], "author": "John Z.", "review": "AWESOME INDIAN PIZZA.\n\nMe, Friday get-together in SF 7pm, several months back, as my friends said they were gonna get delivery from Zante:  \"what's Indian pizza?\"\n\nMe, Friday get-together in SF 8pm, same evening:  \"oh my lord, this is incredible pizza.\"  \n\nFlavorful. Different. Wonderful. Addictive.  Ask me though what the toppings are from the taste, and I'd be hard-pressed to rattle off the ingredients without seeing their menu -- but the orchestra of flavors creates a symphony in your mouth.  Nice chewy dough as well.  And my friends had the foresight to order the chicken curry for dipping.\n\nThe rest of the food ordered was good -- but dear lord, that pizza. Since that evening we ordered twice again, all three times delivery was within an hour.  I've only done delivery so cannot speak to the in-dining experience.\n\nZante, one suggestion: Open an East bay location or deliver to Oakland?  Pleeeeeeze??", "rating": 5, "date": "2009-04-12"}, {"excerpts": ["We tried both Indian pizzas, 2 chicken curry dishes, 2 vegetarian curries, 2 lamb curries, 4 types of naan bread and the kheer when I ordered for our office lunch.\n\n"], "author": "Carmel U.", "review": "Everything...seriously...EVERYTHING we ordered was delicious.  We tried both Indian pizzas, 2 chicken curry dishes, 2 vegetarian curries, 2 lamb curries, 4 types of naan bread and the kheer when I ordered for our office lunch.\n\nThe food was rich, delicious and had just enough spice!  They delivered to our office promptly and were friendly when they called to confirm our office address.\n\nMy mouth starts to salivate when I think about their food - it has def made it to our office's top 5 lunchtime spots.", "rating": 5, "date": "2011-07-14"}, {"excerpts": ["I tasted their Chicken curry (Chicken Sagwala) and their small Indian Pizza. \n\n"], "author": "Alberto L.", "review": "Another gem I have discovered in the fair city of San Francisco I tasted their Chicken curry (Chicken Sagwala) and their small Indian Pizza. \n\nNot completely overrun by hipsters of course! \n\nI recommended the place to my friends such as Captain, and Rastrillo\n\nGreat service! Raj is one of the servers who has photographic memory so he actually remembered one of my friends and me.\n\nSince then I've been to this place on separate occasions with friends, definitely a great place for a first date.\n\nLove this place!", "rating": 5, "date": "2008-09-13"}], "chicken tikka sag white meat": [], "chili murg curry": [], "murg madras": [], "murg makhni": [], "mattar panner": [], "aloo gobhi": [{"excerpts": ["It was like the flavors and ingredients of aloo gobhi (the potato cauliflower dish) with tons of garlic and a perfect amount of cheese, on a nice thin'ish crust. "], "author": "Wen-fai F.", "review": "Come to Boston, please?!?!?!\n\nThey fuse Indian and American (technically, Italian?) together so beautifully! I sampled 2 heavenly slices of their Indian pizza and I was blown away. It was like the flavors and ingredients of aloo gobhi (the potato cauliflower dish) with tons of garlic and a perfect amount of cheese, on a nice thin'ish crust. Not spicy at all, perfect texture, I will get some again on my way out of the city!\n\nThey are $3 per slice but each \"slice\" is really two mini-slices, so it's a perfect, cheap lunch option. They have a nice sit-down area but we opted to take-out and sit in a nearby park.", "rating": 4, "date": "2010-12-07"}], "bengen bhartha": [], "sag panner": [{"excerpts": ["the website had the wrong price for the vindaloo as well as a dollar higher on the sag panner. ", "this is why we didn't order it online. ", "bad customer service man", ", i mean ", "the sag panner and prawn vindaloo were severly watered down and underseasoned. ", "the vindaloo was not spicy as requested. ", "you could tell they could've been good if they weren't so diluted. ", "i have a high suspicion that the 'prawns' were actually shrimp. ", "they were tiny and mangled. ", "they did give a generous portion of each in their own pint containers full to the brim. ", "i am very full, but am i satisfied? ", "that's a hell ", "no. ", "maybe i should've gotten the pizza. ", "doesn't matter they've lost a couple customers here. ", "there is no reason you should ever, EVER yell at a customer, especially a patient, kind-hearted girl like MY GIRLFRIEND! ", "you're in the wrong industry buddy!"], "author": "Eugene H.", "review": "ok so i get a flier on the door for this place. we tried calling in and ordering. first call, my girlfriend couldn't understand his accent so told him to hold on while she adjusted the volume on her phone. she tried to put it on speaker phone and soon found out it wasn't. the guy on the phone was so impatient that when she did get it on speaker phone he had hung up. second call, she was ordering the items and told him which ones she wanted medium and which spicy. then the guy presumably repeats the order back but did so in such a incoherent mumble that she asked him to repeat himself. HE BLEW UP AT HER! yelling, yes, yelling that he was very busy and asked her what she wanted. so she calmly repeated the order then he asked for our address and she slowly enunciated each letter of our street and the guy wasn't getting it. after 3 times i jumped in as it was all on speaker phone and had to have a stern almost yelling tone for him to understand. i asked for the total while already knowing how much it should be. he told me it and it didn't seem right. so i asked him to break it down for me dish by dish. he was charging me a dollar more on the prawn vindaloo. i told him that the flier said it was a dollar cheaper and he abided. the website had the wrong price for the vindaloo as well as a dollar higher on the sag panner. this is why we didn't order it online. bad customer service man, i mean bad\n\nwe got our food in the quoted time. the naan was, in fact, rubbery as noted by another yelper. the sag panner and prawn vindaloo were severly watered down and underseasoned. the vindaloo was not spicy as requested. you could tell they could've been good if they weren't so diluted. i have a high suspicion that the 'prawns' were actually shrimp. they were tiny and mangled. they did give a generous portion of each in their own pint containers full to the brim. i am very full, but am i satisfied? that's a hell no. maybe i should've gotten the pizza. doesn't matter they've lost a couple customers here. there is no reason you should ever, EVER yell at a customer, especially a patient, kind-hearted girl like MY GIRLFRIEND! you're in the wrong industry buddy!", "rating": 2, "date": "2012-07-11"}], "navrattan korma": [], "malai kofta": [{"excerpts": ["We got Sami, malai kofta (my favorite) and gulab jaman as well as the tikka masala pizza. ", "Though I would modify the pizza slightly to have no cauliflower and add garlic, it was well made and fresh. ", "I really enjoyed the other dishes as well and would order from them again."], "author": "Disco B.", "review": "Finally tried it after years of curiosity. Thought it was just pizza but there is a full Indian menu as well! We got Sami, malai kofta (my favorite) and gulab jaman as well as the tikka masala pizza. Though I would modify the pizza slightly to have no cauliflower and add garlic, it was well made and fresh. I really enjoyed the other dishes as well and would order from them again.", "rating": 5, "date": "2018-10-14"}, {"excerpts": ["Other Indian dishes: baigain bhartha, malai kofta, and aloo Gobi: the spice and flavor is strong(its Indian food after all) but flatter(one note?) than what I usually prefer. ", "I got big chunks of ginger that wasn't properly zested or chopped. \n"], "author": "Tata X.", "review": "I know of 2 Indian pizza joint in the Bay Area. Between golden gate indian and Zante, I definitely prefer the former better. Reason being:\n\nPizza: we tried tikka masala pizza and everything Indian pizza. The dough is way too spongy and thick. Instead of a crispy crust, it was more like really thick soft naan. The ingredients are abundant and fresh, but without a crust, can you really call it pizza?\nOther Indian dishes: baigain bhartha, malai kofta, and aloo Gobi: the spice and flavor is strong(its Indian food after all) but flatter(one note?) than what I usually prefer. I got big chunks of ginger that wasn't properly zested or chopped. \nNan: too thick and spongy.", "rating": 3, "date": "2017-10-22"}, {"excerpts": ["I had malai kofta which was the most runny Indian food I've ever had... ", "and I've eaten A LOT of Indian food.  ", "The taste was OK but oily to the extreme", ", I still feel a little off hours later.... ", "I asked for Indian spicy and it wasn't even gringo spicy.  ", "The veg curry was $10 and the garlic naan was $3 and was just dry, crusty flatbread with a little garlic and butter.  ", "I would not have been happy but ", "merely content had I paid the deserving $7 for this instead of almost $15."], "author": "Bigfrog W.", "review": "Ummmm... Mediocre Indian food at gourmet prices.  I had malai kofta which was the most runny Indian food I've ever had... and I've eaten A LOT of Indian food.  The taste was OK but oily to the extreme, I still feel a little off hours later.... I asked for Indian spicy and it wasn't even gringo spicy.  The veg curry was $10 and the garlic naan was $3 and was just dry, crusty flatbread with a little garlic and butter.  I would not have been happy but merely content had I paid the deserving $7 for this instead of almost $15.", "rating": 2, "date": "2010-05-30"}], "mushroom mattar": [{"excerpts": ["I got the mushroom mattar, yogurt, garlic naan and basmati rice. ", "They were super attentive (although I was the only customer, not surprising) and everything tasted great. ", "I didn't have the pizza, but I definitely got enough food. ", ":) ", "I like the kinda fancy setup they have with the napkins, candle etc. ", "I honestly wasn't expecting it from the outside ", "but you get in there ", "and it has potential! ", "Next time... pizza. ", "(Mmm, indian pizza.)"], "author": "Ash G.", "review": "I'm giving it five stars because it was actually that good! I got the mushroom mattar, yogurt, garlic naan and basmati rice. They were super attentive (although I was the only customer, not surprising) and everything tasted great. I didn't have the pizza, but I definitely got enough food. :) I like the kinda fancy setup they have with the napkins, candle etc. I honestly wasn't expecting it from the outside but you get in there and it has potential! Next time... pizza. (Mmm, indian pizza.)", "rating": 5, "date": "2009-03-14"}], "daal makhni": [{"excerpts": ["I have had the best vegetarian Indian pizza and Daal Makhni numerous times. ", "I LOVE their pizza as well as the sauces that come with it--", "I've never had a naan crust before ", "and it's a game changer (especially with the eggplant and cauliflower toppings, too). "], "author": "Zoe H.", "review": "Zante's offers a funky, tasty take on Indian food with their killer Indian pizzas! I have had the best vegetarian Indian pizza and Daal Makhni numerous times. I LOVE their pizza as well as the sauces that come with it--I've never had a naan crust before and it's a game changer (especially with the eggplant and cauliflower toppings, too). The Daal is tasty tasty, but be sure to order it extra mild unless you want your mouth (and tummy) to dial the fire department. \n\nI'd recommend Zante's to anyone looking to try something a little different, but with reliable/ traditional Indian flavors.", "rating": 4, "date": "2017-08-30"}], "bombay aloo": [], "chana sag": [], "sag aloo": [{"excerpts": ["We also tried one of their veggie curries, the Sag Aloo, which was delicious. ", "Good naan too. "], "author": "Jennifer C.", "review": "After 4 years of skepticism, I decided to try it, and was not disappointed! When I first moved to San Francisco I heard about the Indian Pizza place and was afraid, very afraid. Over the past 4 years my culinary tastes have broadened and become more creative, and decided it was time to give the Indian Pizza a try!\n\nSo the bonuses are (1) the taste and (2) the price. Make sure that you request an \"indian style pizza though\", because they also serve a lot of regular pizza that isn't any different than any other place. We also tried one of their veggie curries, the Sag Aloo, which was delicious. Good naan too. Perhaps the most exciting was the $3.00 glass of wine that was more than just drinkable :)\n\nThe only negative was that there were fruit flies buzzing around, which was kind of gross....Ok, it was really gross. But I tried to ignore them :)", "rating": 4, "date": "2008-07-21"}], "aloo bengan": [], "aloo gobhi muttar": [], "aloo muttar": [], "paneer masala": [{"excerpts": ["And ordered half chicken masala sauce and the other half paneer masala. ", "To be honest, it seemed like just an ordinary pizza, and couldn't differentiate much of the Indian flavor on the pizza. ", "And there wasn't enough chicken and paneer on either half of the pizza. "], "author": "Jackie C.", "review": "This lovely place is located in Bernal Heights. A few friends and I decided to try some place new and heard good things of Zante's so we decided to make the drive down. It's on a busy street, but there is plenty of neighborhood parking if you're okay doing a few minutes of walking. \n\nThe people who work at the restaurant are kind and helpful. There is pizza ready to go for those who want a quick grab, and on the other side of the restaurant are seated areas. We decided to go for the Indian style pizza since that seems to be the thing here. We did extra large pizza for 5 of us, and it was the perfect amount. And ordered half chicken masala sauce and the other half paneer masala. To be honest, it seemed like just an ordinary pizza, and couldn't differentiate much of the Indian flavor on the pizza. And there wasn't enough chicken and paneer on either half of the pizza. But the bread on the pizza was delicious! \n\nCost was very affordable for the 5 of us..only $8 each (for the extra-large pizza)! Overall, I would suggest it for a one time try, but if you're a pizza snob, would probably be best to get your pizza fix elsewhere.", "rating": 3, "date": "2017-11-17"}, {"excerpts": ["Their paneer masala pizza was pretty good although it could be spicier.\n\n"], "author": "Shriya B.", "review": "Their pizza is pretty decent, the Masala chicken pizza was a little dry and could use more chutney! Their paneer masala pizza was pretty good although it could be spicier.\n\nCustomer service is a little rude and so you do need to deal with that but oh well", "rating": 3, "date": "2018-06-26"}, {"excerpts": ["Order of the Gods - 1 Best Indian Pizza, 1/2 Chicken Masala, 1/2 Paneer Masala. ", "Extra garlic. ", "Extra side sauces. "], "author": "Grayson K.", "review": "Zante's Pizza has become an SF staple - it's unique, ridiculously good, and there's nothing quite like it. I only ever order one thing; the Order of the Gods.\n\nOrder of the Gods - 1 Best Indian Pizza, 1/2 Chicken Masala, 1/2 Paneer Masala. Extra garlic. Extra side sauces. You're welcome.\n\nPlease note that that is not an actual name; it's just a custom order :)", "rating": 4, "date": "2015-08-03"}, {"excerpts": ["I order The Best Indian Pizza with Paneer Masala. ", "Everyone is always happy; even steak and potato type people, which is pretty impressive, I think. ", "Sometimes they are even raving happy, like calling me a few months later to talk about the pizza."], "author": "Christopher L.", "review": "I have been coming here for years. It is among my favorite places to bring friends who are visiting me on their way to the airport or out of town. \nI have a pretty wide palate, and love spices on everything. Some of my friends, not as much. I generally don't get excited about regular pizza, but I think most everyone else I ever met does, so when I suggest we do pizza, they are usually all for it, not realizing I'm about to trick them into eating something they've never had before. I order The Best Indian Pizza with Paneer Masala. Everyone is always happy; even steak and potato type people, which is pretty impressive, I think. Sometimes they are even raving happy, like calling me a few months later to talk about the pizza.", "rating": 4, "date": "2016-02-03"}, {"excerpts": ["I don't mind going vegetarian for a meal and ordering a half-half pizza of best Indian pizza with paneer masala (my favorite) and best Indian vegetarian pizza.  "], "author": "Kathleen W.", "review": "Do I want Indian food or do I want pizza?\n\nHOW ABOUT BOTH?  Zante's Indian Pizza is fusion at its finest and one of my favorite SF finds.  \n\nI don't mind going vegetarian for a meal and ordering a half-half pizza of best Indian pizza with paneer masala (my favorite) and best Indian vegetarian pizza.  Don't forget to ask for the extra sauce containers of chutney and tamarind - perfect for dipping your naan-like pizza crust in!\n\nI always call-in and order for pick-up - haven't had any trouble.  Love this place!", "rating": 5, "date": "2015-03-04"}, {"excerpts": ["We got an extra large half paneer masala and half chicken tikka masala.  ", "Very tasty but not worth over $30 for an extra large."], "author": "Phil D.", "review": "It's good and very unique.  A bit pricey for the pizza and the crust isn't naan as I thought from other reviews.  We got an extra large half paneer masala and half chicken tikka masala.  Very tasty but not worth over $30 for an extra large.", "rating": 3, "date": "2015-11-16"}, {"excerpts": ["Served fresh out of the oven, the half chicken masala and half paneer masala was amazing. ", "Thanks yelper recommendation! ", "Three of us walked in at 8:30, were seated immediately, and the service was nice. ", "Our server was so funny! ", "I will be back."], "author": "John D.", "review": "Pizza was great. Served fresh out of the oven, the half chicken masala and half paneer masala was amazing. Thanks yelper recommendation! Three of us walked in at 8:30, were seated immediately, and the service was nice. Our server was so funny! I will be back.", "rating": 5, "date": "2015-08-30"}, {"excerpts": ["The other pizza we got was a Medium Best Indian Pizza with Paneer Masala .The ", "pizzas tasted pretty good. "], "author": "Jason P.", "review": "This is a very interesting pizza place. They have lunch and a \"candlelight dinner\". Although they state it is a candlelight dinner, they were any candles. Instead, there dim lights hanging from the ceiling fans. Nevertheless, they try to pull off a intimate, romantic vibe. There is no outdoor seating. There's enough room for about 40-60 people. The restrooms are small but are clean.\n\nWe decided to get two pizzas. We got a large pizza, half of it being the  Best Indian Pizza with Chicken Masala Sauce and the other half being Best Indian Pizza Vegetarian. The other pizza we got was a Medium Best Indian Pizza with Paneer Masala .The pizzas tasted pretty good. The included Masala sauces went great with the crust as well as with the rest of the pizza. \n\nThe service here is okay. While we were deciding on what to get, I think the server tricked us into getting a larger size and even another pizza by using reverse psychology. I did not like that very much. Nevertheless, the other waiters did a good job keeping our cups filled with water and gave us our pitchers of beers in a timely fashion. Never really thought of trying Indian pizza but will definitely will try it again!", "rating": 3, "date": "2014-04-06"}, {"excerpts": ["old-school local pizzeria crust but the paneer masala and Indian veggie split pizza was excellent.  "], "author": "Craig T.", "review": "Really good pizza....old-school local pizzeria crust but the paneer masala and Indian veggie split pizza was excellent.  Strong flavors all around....fits well with the doughy crust.  \n\nPicked up...no comment about the delivery.  People really expect delivery to work in SF?", "rating": 4, "date": "2015-05-25"}], "vegetable biriyani": [], "chicken biriyani": [], "prawns biriyani": [], "pillav": [], "mughlai biriyani": [], "paneer biryani": [], "papadum": [{"excerpts": ["*Tips: (1) Order papadum; it is spicy and good, and you will get chutneys with it that you can put on your pizza.  ", "(2) "], "author": "Josh C.", "review": "I have eaten and enjoyed Zante's Indian pizza many times over a number of years now, so thought I should finally add my yelp of approval.  I always get the vegetarian Indian pizza, of which you can find a photo and ingredients on Zante's website.  \n\nI think the idea of Indian pizza kind of speaks for itself.  It's brilliant.  Often when it comes up, people assume that this must be a pizza made on naan bread, which it is not, but this turns out to be a good thing in my mind, because who wants to fill up on a thick crust?  I also appreciate that even though Zante serves Indian pizza - an obvious signature dish - they don't let themselves slack on the other more conventional Indian food on the menu.  I mean, it's not the best Indian food you've ever had, but it's solid, and some dishes are legitimately spicy.  \n*Tips: (1) Order papadum; it is spicy and good, and you will get chutneys with it that you can put on your pizza.  (2) Most importantly, order saag, dip your Indian pizza in it.  \n\nI have actually never been inside Zante and, despite having always gotten it delivered, have never been the one in charge of placing the order, so I can't really speak to other folks' complaints about that process.  My friend who always takes care of the ordering says that it is best to do it online.  It's true that it can take a hell of a long time for your food to show up, but if you know that, you can plan around it.  I still think Indian pizza is worth it.", "rating": 4, "date": "2012-08-05"}], "mixed pickle": [], "mango chutney": [{"excerpts": ["Try the Indian pizza with a side of mango chutney.  ", "No joke, slathering the chutney on the pizza makes it taste pretty freaking fabulous!"], "author": "Marisa D.", "review": "Don't say anything mean about my Zante's!  \n\nThis place has been a favorite of mine for YEARS!\n\nMeat-adorned Indian Pizza is my absolute FAVoRITE- sometimes I find myself daydreaming about it.  I always order enough to take home leftovers- because cold Indian pizza is pretty amazing, too.\n\nLately I've been sitting down to enjoy my piping hot awesome pizza-fix, and I've found the restaurant as a whole to be very pleasing!  The decor is lovely, the seating is comfortable, everything is spotlessly clean- frankly, even the bathrooms are pretty nice!  And my sweetheart and I refer affectionately to the host as our \"Best friend\"- because he never lets my water glass go empty, and he is just absolutely wonderful overall.  I really appreciate good service at a place (Yes, I am that crazy lady who gets annoyed if I wait too long for food, or if my host or hostess is pretty terrible.  But, of course, I'm a Yelper, what did y'all expect?).\n\nGo to Zante's next time you are in the mood for pizza and adventure.  Try the Indian pizza with a side of mango chutney.  No joke, slathering the chutney on the pizza makes it taste pretty freaking fabulous!", "rating": 5, "date": "2014-01-26"}, {"excerpts": ["The Indian Pizza with mango chutney is really good but not good enough to make up for the overpriced pizzas, rude delivery drivers, delivery distance of 5 blocks taking literally hours. ", "I was a regular customer and now I am thinking- never again."], "author": "Shannon Z.", "review": "The Indian Pizza with mango chutney is really good but not good enough to make up for the overpriced pizzas, rude delivery drivers, delivery distance of 5 blocks taking literally hours. I was a regular customer and now I am thinking- never again.", "rating": 1, "date": "2013-07-19"}, {"excerpts": ["and I LOVE eating their \"vegetarian Indian pizza\" with spices and vegetables and all sorts of loveliness, especially when having it with mango chutney and raita. "], "author": "Abi W.", "review": "Sure, the spices and oil sometimes make me ill on an already unhappy tummy but it fills my home with luscious Indian spices and I LOVE eating their \"vegetarian Indian pizza\" with spices and vegetables and all sorts of loveliness, especially when having it with mango chutney and raita. Yum!!\n\nReally hard to park in the area. Delivery can take a loooong time and delivery people can be frustrating. However, co-hosted a group of 20+ vegetarian gay, lesbian, and bisexual adults and had a blast!", "rating": 4, "date": "2010-07-26"}, {"excerpts": ["We had a medium Indian pizza, spicy daal, mango chutney and samosas. ", "All yummy and devoured in a very short period of time. ", "No doubt we'll be order again soon, next time laziness sets in."], "author": "Dima A.", "review": "What to do...what to do...Pizza or Indian? Pizza or Indian? Hmm...let's see what Yelp has to say. OMG Indian Pizza?! SOLD!\nSo that's what we did one lazy ass afternoon when we couldn't even get up to the kitchen to check out what was in the fridge. We ordered Indian Pizza from Zante's and this is how it went:\n\nOnline ordering system with enticing pictures? check.\nA quick confirmation call and delivery faster than promised? check.\nFriendly Indian guy telling us that he made us a great dinner? check.\nOpening up the boxes and unwrapping tin foil to find delicious, steaming food that looks just like the enticing pictures? CHECK CHECK CHECK\n\nWe had a medium Indian pizza, spicy daal, mango chutney and samosas. All yummy and devoured in a very short period of time. No doubt we'll be order again soon, next time laziness sets in.", "rating": 4, "date": "2009-06-22"}, {"excerpts": ["Do yourself a favor and order a couple sides of the mango chutney and raita, they make for great crust dipping.  "], "author": "Molasses C.", "review": "**Review for dine-in, not delivery**\n\nThe manager/owner was super friendly and helpful in accomodating a last minute reservation for 14 people on a busy night.  When we arrived a long table was nicely set up for us and the service that night was quite simply fantastic for a pizza joint.  While it took a while for all 14 of us to agree on what to order, once we did the pizzas and beers came out punctually.  I needed to be at the airport to pick up someone directly after dinner and was sure I would have to leave mid-meal, but I was able to make it on time thanks to the prompt service.  \n\nThe restaurant itself is not pretty but the Bollywood tunes were bangin!  The pizza was wonderfully spiced and toppings perfectly distributed.  We ordered larges of the veggie Indian, the Special and a tandoori chicken pizza and it was a copious amount of food even for a big group.  Do yourself a favor and order a couple sides of the mango chutney and raita, they make for great crust dipping.  The combo of ingredients -- a Top 20 Greatest Hits of Indian cuisine nicely baked onto an almost naan-like crust -- will leave you craving for more, so order a large and take home the leftovers!\n\nThe best thing about this place is the screaming value -- total including beers, tax, tip and a couple salads (tip: avoid the salad unless you are ok with iceberg lettuce, tomato & garbanzos dressed in Kraft Italian) = twelve meager bucks per person!!", "rating": 4, "date": "2008-01-14"}, {"excerpts": ["HINT: get mango chutney to dip your crust in."], "author": "Jared Z.", "review": "zante's rocked my face off, i mean seriously this was good, i'd had it before yes, but there was something special this time, and i really loved eating it. HINT: get mango chutney to dip your crust in.", "rating": 5, "date": "2009-07-28"}, {"excerpts": ["Did I mention the mango chutney?"], "author": "Aishe B.", "review": "Last night I ate zante's for like the gazillion(th) time. This particular eating extravaganza was for a birthday. Usually I do delivery (in which they arrive lickety split).  For this event we took up a big portion of the dining room, and as only a big group can be, were highly disorganized, confused, particular, and demanding when it came to ordering. Our unfortunate waiter was SO patient--so accomodating--so accurate. He was not only a waiter, he was a magician.  We had like 7 chicken tikka masalas, and at least that many saag paneers--slices of pizza, lassis, samosas, plain naan, cheese naan, garlic naan, and naan were messed up (drum roll please), and everything was delish as usual. The total cost per person for a feast fit for a Raji? 25.00\n\nI could go on and on, but i'll just be repeating all the other 4 and 5 star reviews.  I just have to say that this place is a local treasure.  I feel so lucky to live around the corner.  \nps. Did I mention the mango chutney?", "rating": 4, "date": "2007-08-30"}, {"excerpts": ["It's all about the veggie pizza with the mango chutney sauce people!! ", "Who cares what your breath smells like afterwards, some things are worth it and this is one of them. ", "It's so good that once you've had your fill you have to have just one more slice. ", "Then, you sneakily unbutton your pant button and have another slice on top of that......", "it's that good."], "author": "Sandy P.", "review": "It's all about the veggie pizza with the mango chutney sauce people!! Who cares what your breath smells like afterwards, some things are worth it and this is one of them. It's so good that once you've had your fill you have to have just one more slice. Then, you sneakily unbutton your pant button and have another slice on top of that......it's that good.", "rating": 5, "date": "2009-10-12"}, {"excerpts": ["I love the vegan indian pizza with a side of mango chutney, but WHY does Zante hate it's customers??? ", "the staff who answer the phone are always rude and get the order wrong.  ", "Delivery takes FOREVER and the order often has to be returned because it is wrong (which means another frustrating conversation with the rude phone staff).  ", "The last time we ordered, my friend started vomiting a couple hours after consuming her shrimp tikka masala.  ", "Does Zante have a plan to kill their customers? ", "2 stars only because of my addiction to the indian pizza."], "author": "elena t.", "review": "I love the vegan indian pizza with a side of mango chutney, but WHY does Zante hate it's customers??? the staff who answer the phone are always rude and get the order wrong.  Delivery takes FOREVER and the order often has to be returned because it is wrong (which means another frustrating conversation with the rude phone staff).  The last time we ordered, my friend started vomiting a couple hours after consuming her shrimp tikka masala.  Does Zante have a plan to kill their customers? 2 stars only because of my addiction to the indian pizza.", "rating": 2, "date": "2010-11-05"}, {"excerpts": ["$1 for a tiny container of mango chutney! ", "I love me some mango chutney, so if I've got to pay for it separately, at least give me enough ", "so I don't have to ration it for each bite."], "author": "Meg K.", "review": "Indian Pizza - so yummy.  One slice is enough to fill me up and at $3 bucks a slice (for the veg, $4 for meat) it's the cheapest dinner out I've found. Plus, they are super nice every time I go in. Only one thing bugs me- $1 for a tiny container of mango chutney! I love me some mango chutney, so if I've got to pay for it separately, at least give me enough so I don't have to ration it for each bite.", "rating": 4, "date": "2010-04-23"}], "kheer": [{"excerpts": ["Their Kheer was an excellent end to the evening, and I got to eat most of it because everyone else was stuffed. \n\n"], "author": "Aaron Y.", "review": "I didn't come here for years because the cynical part of me dismissed Zante's as nothing more than a gimmick. It took my friends twisting my arm to give it a chance, and that chance was granted reluctantly and with a bit of sulking. I am so, so happy I took them up on this place, though: Zante's is awesome! There's a lot to love about traditional pizza and traditional (if Americanized) Indian food, and the combination is something that really does work quite well. \n\nI came here with three friends, and we ordered the a medium indian pizza and the Pure Vegetarian Thali. For about $12 each plus tax and tip we got a metric asston of food. That's four standard buttloads. The pizza was wonderfully aromatic. The crust reminded me more of naan than of the Sicilian style crispy goodness that I grew up with, but the toppings balanced that out with a fiery yet mellow flavor profile. \n\nOn the non-pizza side of things, their Samosas are excellent. It had that crispy, almost crunchy texture that I felt was missing from the pizza. I enjoyed their Raita over the salad they provided; I felt its mellow coolness really complemented the pizza's zip. The stand out to me was their Chana Masala, though: chickpeas, spice, and pure unadulterated comfort. Their Kheer was an excellent end to the evening, and I got to eat most of it because everyone else was stuffed. \n\nThe moral for me is \"don't be so cynical\" and for anyone reading this? \"Go try some Indian pizza, 'cause you won't be sorry.\"", "rating": 4, "date": "2012-11-16"}, {"excerpts": ["although, it just makes me want basmati rice and finish the meal with kheer...lol \n\n"], "author": "Fannie S.", "review": "I'm only rating on their delivery, for the Indian pizza.\n\nPizza...doughy.  It had lamb (which one cannot even taste.)  Plenty of tandoori chicken, curries, and veggies.  (I wonder if they should just use naan hybrid dough instead of what they currently use...)   Good flavors though.  It is a bit addicting...although, it just makes me want basmati rice and finish the meal with kheer...lol \n\nIt was $27.99 for the XL which fed five of us.  We asked for a certain time, and they came nearly an hour before then...(early is not bad, except if...we hadn't been home! duh!)\n\nI'll try this place again, maybe...", "rating": 3, "date": "2009-04-27"}, {"excerpts": ["We tried both Indian pizzas, 2 chicken curry dishes, 2 vegetarian curries, 2 lamb curries, 4 types of naan bread and the kheer when I ordered for our office lunch.\n\n"], "author": "Carmel U.", "review": "Everything...seriously...EVERYTHING we ordered was delicious.  We tried both Indian pizzas, 2 chicken curry dishes, 2 vegetarian curries, 2 lamb curries, 4 types of naan bread and the kheer when I ordered for our office lunch.\n\nThe food was rich, delicious and had just enough spice!  They delivered to our office promptly and were friendly when they called to confirm our office address.\n\nMy mouth starts to salivate when I think about their food - it has def made it to our office's top 5 lunchtime spots.", "rating": 5, "date": "2011-07-14"}, {"excerpts": ["Four of us ordered an extra large Chicken Tikka Masala Pizza, chai, and I had kheer for dessert.  ", "(I haven't passed-up kheer since I had wheat kheer for breakfast in a Gujarati village).  ", "The Indian Pizza was quite good and Zante executed it well.  ", "The basic structure is pizza.  ", "The spices and toppings are Indian, other than the cheese - which was typical of pizza (a rich mozzarella it seemed).  ", "The service at Zante was prompt and the pizza was delivered in less than 15 minutes.  ", "It comes with the traditional mint and tamarind chutneys, which are essential.  ", "The chai was average and the kheer was the type that is more like rice pudding and less like sweet porridge.  ", "I'm a sucker for rice pudding, though, so if someone tries to make another dish but ends up with rice pudding, I still like it.  ", "I'll need to have more Indian Pizza to comment on the subtleties.  ", "For now, I'll leave it at this:  ", "Indian Pizza has a future and Zante does it well.  ", "I look forward to this culinary art being perfected and to avoid the difficult choice between \"Indian\" or \"pizza.", "\""], "author": "Jeff M.", "review": "Indian Pizza:  The entire concept was intriguing to me. The notion that East and West could successfully be combined in a single pizza seems obvious - but has been elusive for millenia.  Even today, the serious Indian Pizza places are few and far between.  I couldn't find it in Contra Costa.  Once the buzz got to me, the only question was \"Where?\"  Zante in Bernal Heights comes up over and over when inquiries are made and searches executed for the best of bay Indian Pizza.  Tonight, for my birthday dinner after the Giants game, we went to Zante.  Four of us ordered an extra large Chicken Tikka Masala Pizza, chai, and I had kheer for dessert.  (I haven't passed-up kheer since I had wheat kheer for breakfast in a Gujarati village).  The Indian Pizza was quite good and Zante executed it well.  The basic structure is pizza.  The spices and toppings are Indian, other than the cheese - which was typical of pizza (a rich mozzarella it seemed).  The service at Zante was prompt and the pizza was delivered in less than 15 minutes.  It comes with the traditional mint and tamarind chutneys, which are essential.  The chai was average and the kheer was the type that is more like rice pudding and less like sweet porridge.  I'm a sucker for rice pudding, though, so if someone tries to make another dish but ends up with rice pudding, I still like it.  I'll need to have more Indian Pizza to comment on the subtleties.  For now, I'll leave it at this:  Indian Pizza has a future and Zante does it well.  I look forward to this culinary art being perfected and to avoid the difficult choice between \"Indian\" or \"pizza.\"", "rating": 4, "date": "2014-04-27"}, {"excerpts": ["Lamb Korma, Nan, a drink and Kheer.\r\n", "The guy who took my order had some severe A.D.D. and once he had eventually gotten my order down he hangs up. ", "I call up and ask that I would like to pay with credit card upon which he replies, and I quote", ";\r\n\"Come on man, it's only twenty dollars..\"\r\n\r\n", "I found some cash and went with that.\r\n\r\n", "Food arrived 40-45 minutes later.\r\n", "Naan: Soggy and cold.\r\n", "Lamb: ", "Bland and the pieces of meat were not well cut.\r\n", "Kheer: ", "Frigg'n weird - more like wallpaper glue meets porridge.\r\n", "Drink", ": It was a coke. ", "It tasted like coke. ", "They did a good job on that one at least.\r\n\r\n", "Will I order again? ", "Well I do want to figure out if the Indian Pizza is any good but the bad experience I had tonight will most likely prevent me from trying it out.\r\n\r\n", "Two stars and three 'yucks'.\r\n\r\n", "---\r\n\r\nUpdate: Tried the Indian Pizza. ", "The flavour was good but as with anything you order from these guys it's LATE and COLD and served up with some shitty attitude.\r\n\r\n", "No more business from me. ", "(And they dropped from two stars to one)..."], "author": "Rich S.", "review": "Hmm...worked late from home and ended up being hungry at a very late hour. Searched through the various found-on-the-door-step menues and decided I wanted Indian food. Zante Pizza won.\r\nDidn't end up ordering the pizza from there (which I now understand may be pretty damn good based on the reviews below here - then again you people also liked the supperclub and Luna Park so what do you know? ;-)).\r\n\r\nAnyway...I ordered....Lamb Korma, Nan, a drink and Kheer.\r\nThe guy who took my order had some severe A.D.D. and once he had eventually gotten my order down he hangs up. I call up and ask that I would like to pay with credit card upon which he replies, and I quote;\r\n\"Come on man, it's only twenty dollars..\"\r\n\r\nI found some cash and went with that.\r\n\r\nFood arrived 40-45 minutes later.\r\nNaan: Soggy and cold.\r\nLamb: Bland and the pieces of meat were not well cut.\r\nKheer: Frigg'n weird - more like wallpaper glue meets porridge.\r\nDrink: It was a coke. It tasted like coke. They did a good job on that one at least.\r\n\r\nWill I order again? Well I do want to figure out if the Indian Pizza is any good but the bad experience I had tonight will most likely prevent me from trying it out.\r\n\r\nTwo stars and three 'yucks'.\r\n\r\n---\r\n\r\nUpdate: Tried the Indian Pizza. The flavour was good but as with anything you order from these guys it's LATE and COLD and served up with some shitty attitude.\r\n\r\nNo more business from me. (And they dropped from two stars to one)...", "rating": 1, "date": "2006-03-14"}], "kulfi": [{"excerpts": ["And once they subsequently forgot the dessert--the Kulfi. \n\n"], "author": "Carlton W.", "review": "The pizza is delicious--really unique to mix Indian flavors in a pizza, and it works. I've had both vegetarian options, and they are both very, very good. \n\nDelivery isn't the greatest--be aware that if you order through Yelp App (which is powered by Eat24, I believe) you may need to call to confirm they got it, because both times I've called 10 minutes later and they hadn't received yet or started the order. And once they subsequently forgot the dessert--the Kulfi. \n\nAgain, the food is truly excellent, very delicious. The delivery service could use some work.", "rating": 4, "date": "2015-02-25"}], "gullab jamun": [], "rasmalai": [], "masala tea": [], "lassi": [{"excerpts": ["Mango lassi was a tad too sweet and it was lukewarm by the time we got it (despite me asking for it to be extra icy). \n\n"], "author": "Carmen P.", "review": "They advertise as the Best Indian Pizza with Chicken Tikka Masala Sauce.\n\nGotta say it is the only Indian pizza I've had so perhaps it is the best albeit not the best pizza I've had to date. The bread was very doughy and not enough filling. I drenched it in their hot sauce and that saved it. Their green hot sauce is the bomb diggity. \n\nMango lassi was a tad too sweet and it was lukewarm by the time we got it (despite me asking for it to be extra icy). \n\nPizza was OK the next day too but I was super hungry.", "rating": 3, "date": "2018-06-23"}, {"excerpts": [", the mango lassi was warm. ", "To wait 2 hours for food, the food better be worth the wait and the cost, and it wasn't."], "author": "Theresa C.", "review": "I use yelp all the time, but I rarely write reviews anymore, but this delivery experience is making me write this one.  \nI ordered at 7:30PM today, Sunday, on eat24 and estimate was 60 min to 75 min.  Nope, it took 2 hours and 10 minutes! I called, When the food arrived it was cold and the chicken tika had about 4 chunks of chicken, and the container it came in was open.  Honestly, it looks like someone ate half and left us the other half. I'm sure that's not what happened, but I do wonder where the other half of the meal is. So everything was cold, the naan, everything  . . . oh wait, not everything, the mango lassi was warm. To wait 2 hours for food, the food better be worth the wait and the cost, and it wasn't.", "rating": 1, "date": "2017-10-30"}, {"excerpts": ["I also love the mango lassi!  ", "Yum!"], "author": "Rachel B.", "review": "Get the chicken Makenwala!  The best version of Chicken Tikka Masala I've had in SF.  So so good!  You won't be disappointed.  I also love the mango lassi!  Yum!", "rating": 5, "date": "2016-11-26"}, {"excerpts": ["Thankfully I also had ordered a mango lassi to tame the saltiness. ", "The lassi was good, creamy and a decent size... ", "but, I was so overtaken by the pakora that I ended up not even finishing my little meal and saved the mango lassi for the following morning (yes, it was still tasty even after sitting overnight in the fridge). \n\n"], "author": "Littany W.", "review": "Decent local place with quick delivery but I didn't think it was anything special. \n\nHusband ordered a custom pizza with a few types of meat, he ate it all but the man will eat just about anything in pizza or burrito form. I didn't have any of the pizza but it looked a little under-topped for ordering something with 4 different topping items. \n\nI ordered the veggie pakora and it was crazy salty and overcooked, chewy and just not appealing. Thankfully I also had ordered a mango lassi to tame the saltiness. The lassi was good, creamy and a decent size... but, I was so overtaken by the pakora that I ended up not even finishing my little meal and saved the mango lassi for the following morning (yes, it was still tasty even after sitting overnight in the fridge). \n\nI'm not sure what those who gave Zante's 4 stars had... must have been a much better night for them.", "rating": 2, "date": "2012-11-26"}, {"excerpts": ["Mango Lassi - a must order if you like anything mango. ", "Pretty much an indian mango shake. ", "Its similar to Mango Calpico, but thicker and more yogurty. "], "author": "Marc T.", "review": "For the Pizza only. Janette and I finally got to try this after seeing Michelle and Eddie check in here a bunch of times.\n\nMango Lassi - a must order if you like anything mango. Pretty much an indian mango shake. Its similar to Mango Calpico, but thicker and more yogurty. This thing absolutely wrecks any mango shake (boba, ice cream, calpico, etc ), and its such a great order to cool down any spicy foods.\n\nIndian Pizza - insanely addicting. I swear, Zante's tricks you into eating veggies with how good this pizza is. Stand a lone, you're getting a spinach, cauliflower, chicken tandoori, some shrimp, mozarella over a spinacy sauce and curry sauce layer. The pizza dough seems to be doughy, yet light (maybe Roti dough is thrown in), and have a yellow color, probably from tumeric. It is amazing. If you like a garlic pizza (similar to garlic clam pizzas), this is the pizza to get. While there is a lot of masking of flavor (the garlic is over powering at times, the tandoori is chopped so that there aren't many large chicken chunks or huge tandoori flavor), it just tastes freaking good (then again I can eat a ton of garlic).\n\nThe key to the pizza - ASK for spicy and sweet sauce. The spicy sauce is a cilantro/pepper cream based sauce... that is seriously crack. While hot stand alone, the heat actually goes away when mixed with the pizza and adds another layer of flavor, though it also heavily emphasizes the garlic. The sweet sauce appears to be a tamarind based vinegar/sugar sauce, which also adds a layer of complexity when combined with the pizza.\n\nI can't emphasize how ridiculously addicting this pizza was. It really is so different.", "rating": 5, "date": "2011-12-30"}, {"excerpts": ["Dine-in Highlights: chicken makanwala and mango lassi - maybe the best in the city."], "author": "Jaime Y.", "review": "Ever since I moved from the Mission, I haven't been able to find anything like Zante's. Their pizza was culinary crack fuel for so many starving-student all-nighters. Tender dough crusted with cornmeal and generously slathered with an Indian masala-cheese sauce, heaped with moist bits of chicken, red onions and garlic. Oh heavenly aroma. My friends would wonder why there was always a slice or two missing when I arrived at their house a few blocks away.\n\nOn more than one occasion, I've ordered a slice to-go and opened the box to find two slices or even a quarter slab of pizza. They take care of their regulars is what I'm saying. \n\nDine-in Highlights: chicken makanwala and mango lassi - maybe the best in the city.", "rating": 5, "date": "2011-06-25"}, {"excerpts": ["Our waiter brought out a mango lassi and a cheese slice for our little girl free of charge, without us even asking for anything. ", "Moreover, he brought them right away, so she didn't have to wait, and never even got a chance to think about losing it. ", "A great place!"], "author": "Estevan M.", "review": "The food is original and delicious, the atmosphere is inviting, and the service is friendly and efficient. We went here with our toddler recently and were thrilled at how welcome we were made to feel. Our waiter brought out a mango lassi and a cheese slice for our little girl free of charge, without us even asking for anything. Moreover, he brought them right away, so she didn't have to wait, and never even got a chance to think about losing it. A great place!", "rating": 5, "date": "2015-07-21"}, {"excerpts": ["Mango Lassi-Personally, I didnt like the drink."], "author": "Trisha C.", "review": "As my little cousin would say, DEEWISHOUS! \n\nI heard so much about this place I had to give it a try. Lets see, nothing to fancy inside but the dining area, Indian music that was a little too loud and a few folks behind the counter. A nice man greets us and seats us. \n\nAfter a few minutes we decide on, The Best Indian Pizza, lamb samosa and 2 Lassai drinks.\n\n\nMango Lassi-Personally, I didnt like the drink., reminded me of a GoGurt. \n\nLamb samosa- YUMO \n\nFor all you people who like Indian food and love dipping your naan into every sauce you could dip it into, this pizza is the perfect creation. You no longer have to dip! The pizza contains so many flavors and so many toppings, its like a party in your mouth.", "rating": 4, "date": "2009-03-07"}, {"excerpts": ["The Mango Lassi had so much mango that it seemed like a mango smoothie.  "], "author": "Dan W.", "review": "Those of you who have checked my review know that I seldom review anything that isnt great (or horrible).  If I havent rated it it is probably average!\n So, What is Zante's?  GREAT or horrible?\n\nThe answer is GREEAAATTT?\n\nThe only time I have had Indian pizza this good was when I was in Mumbai.  The Mango Lassi had so much mango that it seemed like a mango smoothie.  GET ONE!\n\nThe menu beyond pizza looked great, but I seriously doubt I will ever try any of it.  The pizza is too danged good!\n\nNow, shut down your computer, get of you butt and get over to Zante's  (btw parking is not easy, but it is worth the work if the walk it too far)", "rating": 5, "date": "2009-08-19"}, {"excerpts": ["Just make sure your mango lassi made it from the driver's car to your house. ", "It didn't, and you need to call them to have them call the driver and tell him to turn around and bring it to you. "], "author": "jason l.", "review": "I love that they call themselves \"The Best Indian Pizza in San Francisco.\" For the record, I make \"The Best Texan Matzoh Ball Soup in San Francisco.\"\n\nZante's is good so long as you keep a few things in mind:\n\n1. Don't order online. I'm not sure why they have this feature on their website. They don't check it. If you forget that you ordered it online, then so will they and you will be hungry.\n\n2. All versions of their Indian Pizza taste exactly the same. Extra sauce? Tikka Masala? All the same. Don't think too hard.\n\n3. Ask for extra red & green side sauces. They won't remember to bring them, but that's cool. If you don't order them you'll wish you had, and at least now you know you tried.\n\n4. Be high when you order. It's fun. Not just from the usual \"it's fun to be high\" perspective, but because you have people offering you Indian Pizza on the other end of the phone, a proposition who's full impact can only truly be appreciated when you're three millimeters of impulse control away from deep-frying batter-dipped chocolate chip cookies. \n\n5. Get at least a double order of pakora. Small servings, and the part of you that is demanding deep-fried food will be satisfied. \n\n6. Put on a movie. No matter how long the movie is, the food will arrive exactly at the midway point, ten minutes after you start wondering just where the fuck your food is.\n\n7. Double check your order when it shows up. Like I said, they won't have the green & red sauces you ordered, but let it go, let it go. Just make sure your mango lassi made it from the driver's car to your house. It didn't, and you need to call them to have them call the driver and tell him to turn around and bring it to you. This conversation will take a little while, because they won't initially believe you.\n\n8. This is a superimportant one: don't eat the whole pizza. Stick what's left in the fridge. In the morning, scramble & soft-cook a few eggs with whatever's left of the green & red sauces that you hopefully didn't actually drink, and then bake the remaining pizza with the eggs on top.\n\nKeep these things in mind, and you will have a fantastic experience. I promise.\n\nUPDATE:\nI'm totally deep-frying batter-coated chocolate chip cookies.", "rating": 4, "date": "2007-11-13"}, {"excerpts": ["I didn't think that a mango lassi could ever be bad, but Zante's proved me wrong.  ", "The only exception is the samosas.  ", "They're pretty good, although I've had better. ", "So, go there for the pizza.  ", "But don't go there for the Indian food."], "author": "Cassidy P.", "review": "Okay, so I would definitely recommend the veggie Indian pizza, but I've got to say that Zante's regular Indian food is not the best.  I didn't think that a mango lassi could ever be bad, but Zante's proved me wrong.  The only exception is the samosas.  They're pretty good, although I've had better. So, go there for the pizza.  But don't go there for the Indian food.", "rating": 3, "date": "2006-06-25"}, {"excerpts": ["The mango lassi was an unnerving and highly unnatural shade of neon orange which even the super dim lighting could not hide. ", "The veg side was alright, but the meat side was...questionable...to say the least. ", "All of the meats were pulverized into little bits, so I had trouble telling what was what. ", "The tandoori chicken shards were an unearthly shade of red, as if they'd been soaking in maraschino cherry dye for a couple years. ", "Having eaten at many [better] Indian places in the past, I know that those technicolor foods were not just \"a result of the spices.", "\" ", "Maybe I should have asked them to forgo the dimmer and just shut off the lights? ", "Not worth the price -_-"], "author": "Skye L.", "review": "We waited about forty five minutes for a half veg/half meat XL Indian pizza. The mango lassi was an unnerving and highly unnatural shade of neon orange which even the super dim lighting could not hide. The veg side was alright, but the meat side was...questionable...to say the least. All of the meats were pulverized into little bits, so I had trouble telling what was what. The tandoori chicken shards were an unearthly shade of red, as if they'd been soaking in maraschino cherry dye for a couple years. Having eaten at many [better] Indian places in the past, I know that those technicolor foods were not just \"a result of the spices.\" Maybe I should have asked them to forgo the dimmer and just shut off the lights? Not worth the price -_-", "rating": 2, "date": "2010-11-27"}, {"excerpts": ["My favorite order there: Veggie Samosa, Chicken Makanwala, Prawn Vindaloo and Bhinde Masala, plus a glass of Mango Lassi. ", "- Oh my lord, I have to go there tonight!"], "author": "Yina M.", "review": "This is the BEST indian restaurant in the city. Frankly, I tried most of them. My favorite order there: Veggie Samosa, Chicken Makanwala, Prawn Vindaloo and Bhinde Masala, plus a glass of Mango Lassi. - Oh my lord, I have to go there tonight!", "rating": 4, "date": "2005-06-17"}, {"excerpts": ["And if you happen to be in the vicinity and do not feel like eating, get yourself a mango lassi - perfect refreshment for a hectic day."], "author": "ray e.", "review": "First of all, Zante delivers. Second of all, it IS the BEST INDIAN pizza in the whole wide world. When I first moved to San Francisco a couple of years ago, I ended up conspiring with a housemate to order in at least once a week. Yes, we ate indian pizza for dinner - no we INHALED indian pizza for dinner. And in the morning, when I woke up, I would walk to the fridge and eat cold indian pizza for breakfast. Yes, that is how good the tandoori chicken, lamb, cauliflower and other secret spices are. Oh, and it's a breeze to order online so I'd go that route instead of phoning it in. And if you happen to be in the vicinity and do not feel like eating, get yourself a mango lassi - perfect refreshment for a hectic day.", "rating": 5, "date": "2008-02-07"}, {"excerpts": ["The mango lassi was pretty thick and chunky -- and a radioactive orange color -- and the saag paneer was pretty standard, with a huge chunk of paneer in the middle.  ", "Huge samosas too!"], "author": "Josh E.", "review": "There were no Indian people eating at Zante Pizza.  Normally, I don't even go into \"ethnic\" restaurants that only serve crackers, and that method has been pretty accurate from what I hear.  But if you eat Indian food fusion, I guarantee you'll love the Indian pizza.  Just don't overdo it, or you'll be feeling hyderabad the next day.  The mango lassi was pretty thick and chunky -- and a radioactive orange color -- and the saag paneer was pretty standard, with a huge chunk of paneer in the middle.  Huge samosas too!", "rating": 4, "date": "2008-06-28"}, {"excerpts": ["and they didn't give me a straw for my lassi.  ", "BUT the pizza was huge (i got a small), and it was cheap (~20$ for a pizza + lassi + tip).  ", "and it was pretty good.  ", "not what i expected--or hoped--it would taste like, but i'm glad i tried it out.  ", "though i probably wouldn't get it again."], "author": "Janice C.", "review": "i had to find out if what every other reviewer said was true, and it was: no one called to confirm my online order, delivery took an hour and 15 minutes, and the toppings were totally unevenly distributed (there was only spinach on one slice, and i don't know where the eggplant was).  the toppings were all pureed or something; you could probably eat it without any teeth.  and they didn't give me a straw for my lassi.  BUT the pizza was huge (i got a small), and it was cheap (~20$ for a pizza + lassi + tip).  and it was pretty good.  not what i expected--or hoped--it would taste like, but i'm glad i tried it out.  though i probably wouldn't get it again.", "rating": 3, "date": "2007-02-16"}, {"excerpts": ["We would have given it 5 stars, but we had Mango lassi's that I'm sure were made from powder mix with a really bizarre orange food coloring."], "author": "Art-Suzanne R.", "review": "Indian Pizza, Kingfisher Beer and great Indian dance music, what more can you ask for.  We didn't have to wait to long and the kids loved the Hawaiian pizza. We would have given it 5 stars, but we had Mango lassi's that I'm sure were made from powder mix with a really bizarre orange food coloring.", "rating": 4, "date": "2008-03-27"}], "chefs special thali": [], "pure vegetarian thali": [{"excerpts": ["I came here with three friends, and we ordered the a medium indian pizza and the Pure Vegetarian Thali. ", "For about $12 each plus tax and tip we got a metric asston of food. ", "That's four standard buttloads. ", "The pizza was wonderfully aromatic. "], "author": "Aaron Y.", "review": "I didn't come here for years because the cynical part of me dismissed Zante's as nothing more than a gimmick. It took my friends twisting my arm to give it a chance, and that chance was granted reluctantly and with a bit of sulking. I am so, so happy I took them up on this place, though: Zante's is awesome! There's a lot to love about traditional pizza and traditional (if Americanized) Indian food, and the combination is something that really does work quite well. \n\nI came here with three friends, and we ordered the a medium indian pizza and the Pure Vegetarian Thali. For about $12 each plus tax and tip we got a metric asston of food. That's four standard buttloads. The pizza was wonderfully aromatic. The crust reminded me more of naan than of the Sicilian style crispy goodness that I grew up with, but the toppings balanced that out with a fiery yet mellow flavor profile. \n\nOn the non-pizza side of things, their Samosas are excellent. It had that crispy, almost crunchy texture that I felt was missing from the pizza. I enjoyed their Raita over the salad they provided; I felt its mellow coolness really complemented the pizza's zip. The stand out to me was their Chana Masala, though: chickpeas, spice, and pure unadulterated comfort. Their Kheer was an excellent end to the evening, and I got to eat most of it because everyone else was stuffed. \n\nThe moral for me is \"don't be so cynical\" and for anyone reading this? \"Go try some Indian pizza, 'cause you won't be sorry.\"", "rating": 4, "date": "2012-11-16"}], "create your own pizza": [], "create your own calzone": [], "the best indian pizza with chicken tikka masala sauce": [{"excerpts": ["They advertise as the Best Indian Pizza with Chicken Tikka Masala Sauce.\n\n"], "author": "Carmen P.", "review": "They advertise as the Best Indian Pizza with Chicken Tikka Masala Sauce.\n\nGotta say it is the only Indian pizza I've had so perhaps it is the best albeit not the best pizza I've had to date. The bread was very doughy and not enough filling. I drenched it in their hot sauce and that saved it. Their green hot sauce is the bomb diggity. \n\nMango lassi was a tad too sweet and it was lukewarm by the time we got it (despite me asking for it to be extra icy). \n\nPizza was OK the next day too but I was super hungry.", "rating": 3, "date": "2018-06-23"}, {"excerpts": ["I ordered the chicken tikka masala sauce pizza (it's called the Best Indian Pizza with Chicken Tikka Masala sauce).  ", "Like every beginner Indian food eater, I love chicken tikka masala.  ", "On the pizza, the sauce was thin, the chicken was tiny (think bacon bits) and the crust could have been cooked a little longer.  ", "It didn't satisfy the Indian food craving nor the chicken craving.  ", "Darn!  "], "author": "Jeff H.", "review": "I went here with a vegan and we shared a Bengan Bhartha (eggplant) pizza with no cheese.  I didn't enjoy the pizza, but the vegan loved it.  Hey, the place is really clean and the staff is super nice.\n\nThe second time I tried the place was via delivery to my house.  I ordered the chicken tikka masala sauce pizza (it's called the Best Indian Pizza with Chicken Tikka Masala sauce).  Like every beginner Indian food eater, I love chicken tikka masala.  On the pizza, the sauce was thin, the chicken was tiny (think bacon bits) and the crust could have been cooked a little longer.  It didn't satisfy the Indian food craving nor the chicken craving.  Darn!  I really wanted this to be better!\n\nNote:  I'm a thin crust pizza lover and have not found a good one in SF (let me know).", "rating": 2, "date": "2013-06-25"}], "the best indian pizza with paneer tikka masala": [], "the best indian pizza": [{"excerpts": ["They advertise as the Best Indian Pizza with Chicken Tikka Masala Sauce.\n\n"], "author": "Carmen P.", "review": "They advertise as the Best Indian Pizza with Chicken Tikka Masala Sauce.\n\nGotta say it is the only Indian pizza I've had so perhaps it is the best albeit not the best pizza I've had to date. The bread was very doughy and not enough filling. I drenched it in their hot sauce and that saved it. Their green hot sauce is the bomb diggity. \n\nMango lassi was a tad too sweet and it was lukewarm by the time we got it (despite me asking for it to be extra icy). \n\nPizza was OK the next day too but I was super hungry.", "rating": 3, "date": "2018-06-23"}, {"excerpts": ["The Best Indian pizza and the Best Indian pizza with chicken masala sauce are the best. ", "Good tandoori grill for appetizers with drinks. ", "They have many other options."], "author": "Mike L.", "review": "If you are a fan of authentic Indian food and pizza. This place is great for both. They serve authentic savory North Indian food. They also have Indian style pizza as well as regular pizza styles. The Best Indian pizza and the Best Indian pizza with chicken masala sauce are the best. Good tandoori grill for appetizers with drinks. They have many other options.", "rating": 5, "date": "2018-09-01"}, {"excerpts": ["I ordered \" The Best Indian Pizza With Chicken Masala Sauce \".\n", "It came with two sauces. ", "A green cilantro which was a terrific compliment.  ", "As well as a sweet tamarind sauce. \n.\n", "For me, the best part is the dough n crust. \n", "Not soggy, excellent chew. ", "Great for dipping in the sauces provided.\n", "Sauce n flavor is good amount. ", "Not overpowering. ", "I've had better chicken n Cheese on the pizza but still amazing. ", "Definitely ate more than usual.\n", "Two Thumbs up  !\nWinner."], "author": "Pure M.", "review": "Most exceeded expectation. \nDelivery was fast n driver very friendly.  \nI ordered \" The Best Indian Pizza With Chicken Masala Sauce \".\nIt came with two sauces. A green cilantro which was a terrific compliment.  As well as a sweet tamarind sauce. \n.\nFor me, the best part is the dough n crust. \nNot soggy, excellent chew. Great for dipping in the sauces provided.\nSauce n flavor is good amount. Not overpowering. I've had better chicken n Cheese on the pizza but still amazing. Definitely ate more than usual.\nTwo Thumbs up  !\nWinner.", "rating": 5, "date": "2017-02-10"}, {"excerpts": ["Let me preface this by saying I heard this place had the best Indian pizza around. ", "After having Half Tandoori/Half Paneer pizza, I was disappointed by the lack of flavor. ", "I can honestly say I barely tasted the tandoori chicken at all. ", "The paneer side wasn't too flavorful either."], "author": "Wayne C.", "review": "Let me preface this by saying I heard this place had the best Indian pizza around. After having Half Tandoori/Half Paneer pizza, I was disappointed by the lack of flavor. I can honestly say I barely tasted the tandoori chicken at all. The paneer side wasn't too flavorful either.", "rating": 3, "date": "2017-07-29"}, {"excerpts": ["I usually order the Best Indian Pizza without prawns (I'm allergic) ", "but I got my pizza twice with prawns on it. ", "When I called about it, they sent a new pizza ", "but I was left with a whole pie ", "I couldn't eat. ", "#firstworldproblems ", "However, one time there were tiny bits of prawns that I didn't notice until I tasted something fishy. ", "My friend confirmed it was seafood "], "author": "Yuri K.", "review": "I love the pizza here and it usually arrives quickly but there have been several mishaps that makes me give them three stars. Twice I ordered a pizza with extra lamb and received no lamb on the pizza. No biggie- told Eat24 and they reimbursed me. \n\nI usually order the Best Indian Pizza without prawns (I'm allergic) but I got my pizza twice with prawns on it. When I called about it, they sent a new pizza but I was left with a whole pie I couldn't eat. #firstworldproblems However, one time there were tiny bits of prawns that I didn't notice until I tasted something fishy. My friend confirmed it was seafood and I ended up with hives. \n\nBut this has been the third time that my order was over 90 minutes late. When I call in, I get the feeling that they missed my order or forgot it because suddenly I have my pizza in 20 minutes.\n\nAgain, I love Zantes and will always order here but definitely not ordering anything with prawns and will place my order way ahead of time just in case.", "rating": 3, "date": "2018-01-12"}, {"excerpts": ["The Best Indian Pizza with Chicken Masala Sauce: tasty, slightly spicy, and flavorful. ", "Really different from traditional pizza. "], "author": "Susan G.", "review": "(This review is only for delivery)\n\nFood:\nThe Best Indian Pizza with Chicken Masala Sauce: tasty, slightly spicy, and flavorful. Really different from traditional pizza. We enjoyed all the toppings and the sauce.\n\nService:\nOn this occasion, the pizza actually came, but after a very long wait. We ordered after the 1st quarter of the Super Bowl and it came at the end of the game. My friends though have experienced even worse service though where the pizza never comes. Order at your own risk!", "rating": 3, "date": "2016-03-01"}, {"excerpts": ["We ordered The Best Indian Pizza with chicken masala sauce and the only reason I'm not giving them 5 stars is because there was hardly any tandoori chicken on the pizza. ", "The chicken was very good ", "so I was really hoping there would have been more of it! ", "The crust is amazing!! ", "Truly enjoyed my practically veggie pizza!"], "author": "Maira S.", "review": "Pizza was delicious! We ordered The Best Indian Pizza with chicken masala sauce and the only reason I'm not giving them 5 stars is because there was hardly any tandoori chicken on the pizza. The chicken was very good so I was really hoping there would have been more of it! The crust is amazing!! Truly enjoyed my practically veggie pizza!", "rating": 4, "date": "2017-05-24"}, {"excerpts": ["THE BEST INDIAN PIZZA w/ Tandoori Chicken, Lamb, Spinach, Eggplant, Cauliflower, Garlic & Ginger (requested NO prawns) \nhttp://www.yelp.com/biz_photos/WIg_d_GJzk-2SDRGp4W9MQ?select=e3q0Brl99L7gKKie84OMDA\n", "Not as pictured online, the pizza was rimmed with a monstrous pale crust. ", "It tasted exactly as it looked: bland and excessively doughy (good for pigeon feeding though). ", "The Indian gene wasn't as apparent as the toppings got lost in the dough. ", "The very little tandoori chicken was dry while the lamb was mia. "], "author": "Cherylynn N.", "review": "Nothing arouses the senses like FOOD. \n\nThe fragrant and robust spices of coriander, cumin, turmeric, and cardamom awakening my taste buds immediately comes to mind when I think about Indian food. Oh yah, and so does tandoori, curry, and tikka masala. YUMS! \n\nWith Italian food, I think of carbolicious simplicity: crisp Neapolitan pizzas and al-dente pasta lightly dressed in mouth-watering sauces. MANGIA! MANGIA!\n\nCombining the two? PURE. EPICUREAN. GENIUS. \n\nZante's birthed this culinary genius in the late 80's calling it: The Indian Pizza. Like some babies, however, the Indian Pizza is problematic...\n\nTHE BEST INDIAN PIZZA w/ Tandoori Chicken, Lamb, Spinach, Eggplant, Cauliflower, Garlic & Ginger (requested NO prawns) \nhttp://www.yelp.com/biz_photos/WIg_d_GJzk-2SDRGp4W9MQ?select=e3q0Brl99L7gKKie84OMDA\nNot as pictured online, the pizza was rimmed with a monstrous pale crust. It tasted exactly as it looked: bland and excessively doughy (good for pigeon feeding though). The Indian gene wasn't as apparent as the toppings got lost in the dough. The very little tandoori chicken was dry while the lamb was mia. The bharta (eggplant), aloo palak (spinach), garlic, and ginger infused some savory spice but wasn't evenly distributed; neither awakening the taste buds nor redeeming the bland pizza. \n\nLike most babies, the Indian pizza left a surprise in my mouth: nice, crunchy prawn tail shells. MmMmMm, FERTILIZER! Yeup, they use prawn shells for potato fertilizer in Norway. NOW, I just gotta bag me a Mr. Potato Head!\n\nOTHER NOTES: \n*Friendly service\n*Quoted pick-up time: 20 minutes but was ready in 15 minutes \n*Wooden railing divides the divey pizza oven area and the more formal crisp white linen table dining room \n*Small parking lot (entrance on Cortland) otherwise difficult street parking\n*$15 min for CC's", "rating": 3, "date": "2012-04-03"}, {"excerpts": ["I order The Best Indian Pizza with Paneer Masala. ", "Everyone is always happy; even steak and potato type people, which is pretty impressive, I think. ", "Sometimes they are even raving happy, like calling me a few months later to talk about the pizza."], "author": "Christopher L.", "review": "I have been coming here for years. It is among my favorite places to bring friends who are visiting me on their way to the airport or out of town. \nI have a pretty wide palate, and love spices on everything. Some of my friends, not as much. I generally don't get excited about regular pizza, but I think most everyone else I ever met does, so when I suggest we do pizza, they are usually all for it, not realizing I'm about to trick them into eating something they've never had before. I order The Best Indian Pizza with Paneer Masala. Everyone is always happy; even steak and potato type people, which is pretty impressive, I think. Sometimes they are even raving happy, like calling me a few months later to talk about the pizza.", "rating": 4, "date": "2016-02-03"}, {"excerpts": ["It's the best Indian pizza of the few I've tried in SanFran. ", "I love the waiter. ", "Always the same guy. ", "Amazingly he always remembers me and seats me at the same table from my first visit in 2011. ", "He always asks you to tip in cash haha. ", "His audacity endears him to me :-) ", "I love the Taj and ", "Flying Horse in the big bottles. "], "author": "Stanley J.", "review": "The pizza here is the novelty. It's the best Indian pizza of the few I've tried in SanFran. I love the waiter. Always the same guy. Amazingly he always remembers me and seats me at the same table from my first visit in 2011. He always asks you to tip in cash haha. His audacity endears him to me :-) I love the Taj and Flying Horse in the big bottles. Regarding the food, chicken tikka masala pizza is boss. I however always order the Indian food. I love the vindaloo extra spicy. Not crazy about the naan, it's a bit Costco in my opinion. But everything else I've had here are choice!", "rating": 4, "date": "2015-09-22"}, {"excerpts": ["I've ordered the best Indian pizza and the chicken masala pizza several times. "], "author": "Hope A.", "review": "This is a great concept - Indian pizza. I've ordered the best Indian pizza and the chicken masala pizza several times. Quite tasty and unique. \n\nTheir website has one of the worst user interfaces I've experienced... it wasn't even state of the art in 1995. It says they have a mobile friendly menu... I've never braved looking at their site on a phone. It's already hard enough on a lap top. If you can be patient enough to deal with the clunky interface to find the section on ordering an Indian pizza its not too bad. \n\nTip - after you submit the order you will get a message that says \"Call us to confirm your order if we don't call you within 10-15 minutes\". I've ordered from them more than 10 times, I think maybe once they actually called and confirmed the order, maybe I'm not sure. So just plan on calling them in 10 minutes and make sure they are working on your order. Also no matter what they will ALWAYS tell you that your pizza will be delivered in about 45 minutes. Sometimes it has arrived 15 minutes after I called, sometimes an hour but the one thing that is certain is they will tell you its going to be 45 minutes. \n\nLook, delivery generally sucks in this city, especially at any decent pizza place if you place an order during peak hours like I always do. So Zantes is like everyone else. What it gets down to is the food tastes good and it's a fair price. What more do you expect in this town? You are hungry, you type on your computer and a while later a dude shows up with tasty hot food in exchange for cash. That seems pretty damn good for thirty bucks.", "rating": 4, "date": "2015-05-17"}, {"excerpts": ["I ordered the chicken tikka masala sauce pizza (it's called the Best Indian Pizza with Chicken Tikka Masala sauce).  ", "Like every beginner Indian food eater, I love chicken tikka masala.  ", "On the pizza, the sauce was thin, the chicken was tiny (think bacon bits) and the crust could have been cooked a little longer.  ", "It didn't satisfy the Indian food craving nor the chicken craving.  ", "Darn!  "], "author": "Jeff H.", "review": "I went here with a vegan and we shared a Bengan Bhartha (eggplant) pizza with no cheese.  I didn't enjoy the pizza, but the vegan loved it.  Hey, the place is really clean and the staff is super nice.\n\nThe second time I tried the place was via delivery to my house.  I ordered the chicken tikka masala sauce pizza (it's called the Best Indian Pizza with Chicken Tikka Masala sauce).  Like every beginner Indian food eater, I love chicken tikka masala.  On the pizza, the sauce was thin, the chicken was tiny (think bacon bits) and the crust could have been cooked a little longer.  It didn't satisfy the Indian food craving nor the chicken craving.  Darn!  I really wanted this to be better!\n\nNote:  I'm a thin crust pizza lover and have not found a good one in SF (let me know).", "rating": 2, "date": "2013-06-25"}, {"excerpts": ["\"The Best Indian Pizza\" - I smell of curry and couldn't be happier.\n\n"], "author": "Briana F.", "review": "Let's be honest. \n\nIt's Friday night, you're drunk, pizza is easy, and you don't even have to pick up the phone (thanks to fancy cell phones you can get what you want without even asking anyone for it!) - Indian pizza? For real? YES. So, I can't speak for the other food. Or the quality of the pizza when un-intoxicated, but I DO recommend Zante's for these particular wine-induced occasions.\n\n\"The Best Indian Pizza\" - I smell of curry and couldn't be happier.\n\nThey deliver all over SF so a bit of a wait is to be expected.", "rating": 5, "date": "2013-03-09"}, {"excerpts": ["Yes, of course, you HAVE to get the Best Indian Pizza (with meat, sister! ", "with M-E-A-T)  "], "author": "Janice C.", "review": "On a lazy Saturday, wake up late. Really late, like 12 noon or 1 pm. \n\nDon't even bother to get out of bed. Grab your phone (or go online) and place your order. \n\nYes, of course, you HAVE to get the Best Indian Pizza (with meat, sister! with M-E-A-T)  and you might even get Veggie Samosas on the side. \n\nSo, the voice on the other end of the line says \"ok, about 40 minutes\"\n\nWell, 1 hour later.... (yes, it is true what everybody says here about the delivery time)\n\nMy pizza wasn't piping hot, but not cold either.  Warm pizza, yeah, I can live with that.  I take a bite.\n\nAnd then....\n\nThere was a MYRIAD of tasty explosion in my mouth! Is it the tandoori chicken? the prawns? the lamb? curry sauce? spinach, eggplant, cauliflower, ginger, garlic, green onions or cilantro?  The folks at Zante's pizza were wise enough to put this on a thick crust.  It just makes it all the more filling. \n\nBTW, our order came up to a total of $24.65  (I don't know how that came to be, because the medium pizza costs $19.99 and the samosas were $4.99)\n\nGuess we got a discount!", "rating": 4, "date": "2009-01-28"}, {"excerpts": ["The best Indian Pizza that I've ever tasted.  ", "Otherwise this would be a * ", "* ", "* ", "three-star ", "* ", "* * review.  ", "The service when eating in the restaurant is extremely slow.  "], "author": "Smiley D.", "review": "The best Indian Pizza that I've ever tasted.  Otherwise this would be a * * * three-star * * * review.  The service when eating in the restaurant is extremely slow.  The regular Indian food dishes that I've tried here are above average but not show stopping.\n\nMust try:  Vegetarian Indian pizza\n\nPerfect combination of spices, veggies, and cheese.  Cooked in a doughy pie....yes please!!", "rating": 4, "date": "2010-11-15"}, {"excerpts": ["MMMMMmmmmmm we got the best Indian pizza with no prawns and it was TASTY! ", "A terrific blend of spices, nothing was over powering and not greasy at all. ", "The extra oven time crisped up the crust nicely. "], "author": "Allegra F.", "review": "So you know what? the slow delivery did not bother me because I was warned. Also, my other Indian Pizza place in lower haight takes over an hour to deliver as well.\n\nOur pizza arrived warm and I threw a few slices into a waiting hot oven to crisp up for a few moments. MMMMMmmmmmm we got the best Indian pizza with no prawns and it was TASTY! A terrific blend of spices, nothing was over powering and not greasy at all. The extra oven time crisped up the crust nicely. I also like the chewiness of the crust. \n\nThe Medium will feed us for 2 meals and yeah over $20 for a med pizza isn't cheap. But 2 meals for 2 for $20 isn't too bad....\n\nMy advice, plan ahead. Order your order online before you are hungry and have a hot oven waiting. Ask for some extra spicy sauce and you are set to go!\n\nWe will be ordering this again.", "rating": 4, "date": "2009-12-15"}, {"excerpts": ["I always get The Best Indian Pizza off their specialty menu.  ", "I mean really, \"Topped with Spinach, Egg Plant, Cauliflower, Ginger, Garlic, Green Onions, Cilantro, Lamb, Tandoori Chicken & Prawns\" what more could you possibly want??  ", "Oh you want to put ham and pepperonis on it?  ", "Ok you can do that too.  ", "Srsly.  ", "The first time we tried it, we were being open-minded.  "], "author": "Christie C.", "review": "ZOMGWTFBBQ Zante Pizza, you complete me.\n\nI always get The Best Indian Pizza off their specialty menu.  I mean really, \"Topped with Spinach, Egg Plant, Cauliflower, Ginger, Garlic, Green Onions, Cilantro, Lamb, Tandoori Chicken & Prawns\" what more could you possibly want??  Oh you want to put ham and pepperonis on it?  Ok you can do that too.  Srsly.  The first time we tried it, we were being open-minded.  Little did I know that it would change my life FOREVER.\n\nIn all seriousness, the pizza is flippin' amazing.  At first I wasn't sure if it would blend.. Indian food on a pizza?  But it's delish.  The crust is like a pizza dough/naan hybrid that's so tasty.  And I love that you can also order regular (boring) pizza or regular Indian food.  They really have it all.\n\nPer previous Yelper recommendation, dip the crust in tikka masala sauce and it will rock your world.  You'll never look at Papa John's garlic sauce dip the same way again.\n\nCan't say anything about their delivery b/c we always do take-out.  Def call it in ahead of time b/c it takes time to whip up some magic.", "rating": 5, "date": "2010-04-29"}, {"excerpts": ["No bullshit, when someone asks me what the best Indian pizza is I will not pause or meander. ", "ZANTE!"], "author": "Steve A.", "review": "Da-da-da-damn. As a virgin to Indian pizza I had no expectations, but during a recent trip to visit my sister and her bf I'm officially down for the cause. I was told that no one really eats there as everyone gets pizza to go and my trip there enforced this point. For pizza you get the choices of either meat (chicken) or vegetarian. I opted for the chicken with is topped with with Spinach, Egg Plant, Cauliflower, Ginger, Garlic, Green Onions, Cilantro, Lamb, Tandoori Chicken & Prawns. These are all capitalized because I want you to get the full sense of what you are ordering. Wow, wow, wow, wow, wow. Five wows means this is a life changing experience. This pizza is from whomever built the pyramids because it is so beyond anything I've tasted before. No bullshit, when someone asks me what the best Indian pizza is I will not pause or meander. ZANTE!", "rating": 5, "date": "2012-05-05"}, {"excerpts": ["After a few minutes we decide on, The Best Indian Pizza, lamb samosa and 2 Lassai drinks.\n\n\n"], "author": "Trisha C.", "review": "As my little cousin would say, DEEWISHOUS! \n\nI heard so much about this place I had to give it a try. Lets see, nothing to fancy inside but the dining area, Indian music that was a little too loud and a few folks behind the counter. A nice man greets us and seats us. \n\nAfter a few minutes we decide on, The Best Indian Pizza, lamb samosa and 2 Lassai drinks.\n\n\nMango Lassi-Personally, I didnt like the drink., reminded me of a GoGurt. \n\nLamb samosa- YUMO \n\nFor all you people who like Indian food and love dipping your naan into every sauce you could dip it into, this pizza is the perfect creation. You no longer have to dip! The pizza contains so many flavors and so many toppings, its like a party in your mouth.", "rating": 4, "date": "2009-03-07"}, {"excerpts": ["I love that they call themselves \"The Best Indian Pizza in San Francisco.", "\" ", "For the record, I make \"The Best Texan Matzoh Ball Soup in San Francisco."], "author": "jason l.", "review": "I love that they call themselves \"The Best Indian Pizza in San Francisco.\" For the record, I make \"The Best Texan Matzoh Ball Soup in San Francisco.\"\n\nZante's is good so long as you keep a few things in mind:\n\n1. Don't order online. I'm not sure why they have this feature on their website. They don't check it. If you forget that you ordered it online, then so will they and you will be hungry.\n\n2. All versions of their Indian Pizza taste exactly the same. Extra sauce? Tikka Masala? All the same. Don't think too hard.\n\n3. Ask for extra red & green side sauces. They won't remember to bring them, but that's cool. If you don't order them you'll wish you had, and at least now you know you tried.\n\n4. Be high when you order. It's fun. Not just from the usual \"it's fun to be high\" perspective, but because you have people offering you Indian Pizza on the other end of the phone, a proposition who's full impact can only truly be appreciated when you're three millimeters of impulse control away from deep-frying batter-dipped chocolate chip cookies. \n\n5. Get at least a double order of pakora. Small servings, and the part of you that is demanding deep-fried food will be satisfied. \n\n6. Put on a movie. No matter how long the movie is, the food will arrive exactly at the midway point, ten minutes after you start wondering just where the fuck your food is.\n\n7. Double check your order when it shows up. Like I said, they won't have the green & red sauces you ordered, but let it go, let it go. Just make sure your mango lassi made it from the driver's car to your house. It didn't, and you need to call them to have them call the driver and tell him to turn around and bring it to you. This conversation will take a little while, because they won't initially believe you.\n\n8. This is a superimportant one: don't eat the whole pizza. Stick what's left in the fridge. In the morning, scramble & soft-cook a few eggs with whatever's left of the green & red sauces that you hopefully didn't actually drink, and then bake the remaining pizza with the eggs on top.\n\nKeep these things in mind, and you will have a fantastic experience. I promise.\n\nUPDATE:\nI'm totally deep-frying batter-coated chocolate chip cookies.", "rating": 4, "date": "2007-11-13"}, {"excerpts": ["They advertise as \"The Best Indian Pizza in SF.", "\" ", "Of course motherfucker, you're the ONLY Indian pizza in SF that I know of (in the eastern half of the city.) ", "I guess that allows them to make any outrageous claims they want. ", "\"", "Sexiest Indian Pizza Delivery Guy in SF,\" \"Fastest Indian Pizza in SF.", "\" \r\n\r\n\r\n", "Which brings up an issue I have with Zante. ", "The pizza is delicious but if you get it delivered you'd better be prepared to wait. ", "An hour and forty-five minutes for a pizza?\r\n\r\n", "\"", "Hello, we ordered a pizza about an hour ago.", "\"\r\n\r\n", "\"", "Yes, the driver already left. ", "Be there in 5 minutes.", "\"\r\n\r\n15 minutes pass.\r\n\r\n", "\"", "Yeah, it's still not here.", "\"\r\n\r\n", "\"Be there in 10 minutes.", "\"\r\n\r\nWhaaa? ", "Well, the pizza finally arrived and it was tasty. ", "Actually, the last time I ordered from them it came in a record 45 minutes but the driver spilled the riata. ", "That was a huge bummer. ", "It's still \"The Best Indian Pizza in SF.", "\""], "author": "Josua P.", "review": "You ever get a craving for pizza AND Indian food. Yeah, I thought so, stoner. Well Zante makes a pretty sweet version of Indian pizza. They advertise as \"The Best Indian Pizza in SF.\" Of course motherfucker, you're the ONLY Indian pizza in SF that I know of (in the eastern half of the city.) I guess that allows them to make any outrageous claims they want. \"Sexiest Indian Pizza Delivery Guy in SF,\" \"Fastest Indian Pizza in SF.\" \r\n\r\n\r\nWhich brings up an issue I have with Zante. The pizza is delicious but if you get it delivered you'd better be prepared to wait. An hour and forty-five minutes for a pizza?\r\n\r\n\"Hello, we ordered a pizza about an hour ago.\"\r\n\r\n\"Yes, the driver already left. Be there in 5 minutes.\"\r\n\r\n15 minutes pass.\r\n\r\n\"Yeah, it's still not here.\"\r\n\r\n\"Be there in 10 minutes.\"\r\n\r\nWhaaa? Well, the pizza finally arrived and it was tasty. Actually, the last time I ordered from them it came in a record 45 minutes but the driver spilled the riata. That was a huge bummer. It's still \"The Best Indian Pizza in SF.\"", "rating": 4, "date": "2006-08-03"}, {"excerpts": ["As for the Best Indian Pizza...is something I would want to eat every so often? ", "more than likely no ", "but as far as coming back? ", "I can say I would just to try the other things on the menu and compare them  to better rate Zante's Pizza."], "author": "Mike L.", "review": "Its 10pm and most of the eateries are closed that I usually walk to, I've decided to go home to order some food and had thought about what I wanted to eat. After 15 minutes of debate between the growling tummy to the over-thinking mind, the craving of pizza and Indian cuisine will be both satisfied.\n\nAfter a long wait of an hour, my thoughts were damn this pizza must  be damn worth an hours wait.\n\nThe delivery guy was pretty friendly and polite, which is a plus because I have a few rude ones. The guy seemed really genuine when he told me to enjoy the pizza.\n\nWhen brought inside the house the aroma of coriander, turmeric, cumin and other Indian spices  filled the air  with the scents of familiar Indian cuisine.  \n\nThe opened pizza box contained a pizza crusted that is naan like, topped with green onions, cauliflower, chicken Tandori, prawns, lamb, a sauce made of spinach, garlic, cilantro,  and  eggplant cooked in blend of Italian/Indian spices topped with melted mozzarella cheese on top.\n\nWhen I first took a bite of the first slice I could feel the oils of the pizza squish in my mouth but the crunch and the taste of the crust was like eating a flat crispy naan.  \n\nThe chicken tandoori, lamb  and prawns in the pizza must have been minced because I could not see nor taste it on the pizza. What I would recommend is to shred the meat instead to where you can see and taste more of the flavors of the meats.\n\nThe cheese on the pizza was not  stringy unlike the freshly hot pizzas on the Teenage Mutant Ninja Turtles or anywhere else. May I suggest that Zante's Pizza use a thermal bag or some type of heating devie to keep the pizza from getting cold, especially since mine had to take a journey from Mission and Cortland to the Excelsior.\n\nAs for the Best Indian Pizza...is something I would want to eat every so often? more than likely no but as far as coming back? I can say I would just to try the other things on the menu and compare them  to better rate Zante's Pizza.", "rating": 3, "date": "2010-08-14"}, {"excerpts": ["Zante's specialty, \"The Best Indian Pizza\" is described as being \"Topped with Spinach, Egg Plant, Cauliflower, Ginger, Garlic, Green Onions, Cilantro, Lamb, Tandoori Chicken & Prawns.", "\"  ", "I was hoping for a pie that tasted like the tandoori over threw up all over it.  ", "What I got was something much milder", ", much more chopped up and unidentifiable, and a pizza that lacked a point of view.  ", "There was little about the pizza that was Indian (except maybe the color of it) and it wasn't quite good enough to compete as a regular pie.  "], "author": "Monica T.", "review": "The novelty of Indian pizza and the lure of being only ten minutes away from work drew me here on a weekday lunch with the interns.  \n\nAlthough we were intrigued by the promise of surprise  \n\nI was expecting a cumin-scented curry sauce, exotic pungent cheese, and a clay-oven naan crust.  \n\nZante's specialty, \"The Best Indian Pizza\" is described as being \"Topped with Spinach, Egg Plant, Cauliflower, Ginger, Garlic, Green Onions, Cilantro, Lamb, Tandoori Chicken & Prawns.\"  I was hoping for a pie that tasted like the tandoori over threw up all over it.  What I got was something much milder, much more chopped up and unidentifiable, and a pizza that lacked a point of view.  There was little about the pizza that was Indian (except maybe the color of it) and it wasn't quite good enough to compete as a regular pie.  I have no reason to check back unless they were just having a really off day when I visited.\n\nI'm assuming they do a brisk delivery business since there was no one else in the restaurant that Wednesday afternoon.  The location probably nabs them better dinner traffic, though.", "rating": 2, "date": "2006-10-05"}, {"excerpts": ["The Best Indian Pizza, topped with spinach, eggplant, cauliflower, ginger, garlic, green onions, cilantro and tandoori chicken was really, really tasty.  ", "I loved the spiciness of the toppings and the way the flavors complimented each other.  "], "author": "Chris S.", "review": "This review has a very specific scope: the so called \"Best Indian Pizza\".  I haven't had any of their other food yet, so I have nothing to say about anything but their pizza.\n\nFirst I'll say that I like Indian food, and I also like pizza.  This doesn't necessarily mean that I'd like them together, though.  (For example - I like dry diced chicken from San Tung on Irving, and I like pearl milk tea, but although I've never had it, I suspect that I would not like milk tea with diced chicken bits in it, if you know what I mean).\n\nSo when the idea of getting an Indian pizza was put out there, I wasn't sure whether to be excited or nervous.  \n\nAfter watching a PBS special, though,  where two guys out ice climbing on a glacier somewhere in South America got separated from one another, one of them falling 150 feet down onto the ice, crashing through it and falling 50 more feet into an icy crevasse, getting stuck there for a day or so and finally crawling his way out of there and pulling himself across 5 miles of treacherous ice, over boulders and back to the camp with a compound fracture in his leg, to rejoin his buddies who had already been mourning his certain death for the previous 4 days, I figured it would be rather wimpy to avoid trying a pizza just because it seemed like the toppings might be outside my normal comfort zone.  \n\nAnd I'm really happy to say that like those ice climbing guys, but very likely with a good amount less bravery, I went for it, living on the edge.  The Best Indian Pizza, topped with spinach, eggplant, cauliflower, ginger, garlic, green onions, cilantro and tandoori chicken was really, really tasty.  I loved the spiciness of the toppings and the way the flavors complimented each other.  I'll definitely have the pizza again, and even though it seems that other yelpers have had less than stellar experiences with the other food here, I'll probably give it a go next time just because I liked this pizza so much.  \n\nAlso, I took the pizza out so have no opinion about the service or decor.  More on that at a later date . . .", "rating": 4, "date": "2008-06-19"}, {"excerpts": ["We phoned in an order for \"the best indian pizza with tandoori meats\" and an order of veggie samosa.\n\n"], "author": "Miss Information X.", "review": "Its entirely possible that I just don't like Indian pizza.  I've had it before and wasn't too crazy about it.  I thought it would be a good idea to to give it another try and see if my tastes had changed.  Word on the street is Zante's might be the best IP in the universe so the husband and I placed an order on a lazy Sunday afternoon.\n\nWe phoned in an order for \"the best indian pizza with tandoori meats\" and an order of veggie samosa.\n\nIt took an hour and a half to deliver our order.  When it finally arrived, it was cold.  It was the wrong order.  We were hungry so we shrugged, re-heated everything and joked about the poor vegetarians who got our meat pizza by mistake.\n\n(If I had read the yelp reviews first, I would have known that it would take almost two hours for delivery.  However, I don't think that its acceptable to offer delivery service in the first place if its going to be soooooooo sloooooooooow.   ...and we only live a few blocks away.  But I digress...)\n\nAnyway, bottom line is, the pizza just wasn't that good.  I failed to find any real flavor other than green onions and bread and cheese.  (...and I actually prefer vegetarian pizza most of the time.)  Where were the spices?  The delicious melding of East/West?  The Indian-ness didn't really emerge for me.  Or the pizza-ness.  It was just odd and poorly balanced.\n\nSamosas were good though.\n\nI wanted to like it, I really did.  I have given up on Indian pizza for good, I think.  \n\n+ 2 stars for yummy samosa\n- 3 stars for late, cold, wrong order", "rating": 2, "date": "2008-02-19"}, {"excerpts": ["Get this, \"The Best Indian Pizza\" is \"Topped with Spinach, Egg Plant, Cauliflower, Ginger, Garlic, Green Onions, Cilantro, Lamb, Tandoori Chicken & Prawns.", "\"  (For the record, I detected no prawns on the pizza, but with all the other awesome stuff that was covering the pizza, this was not a loss).  ", "I cannot wait to go to the restaurant itself for a pitcher or two of beer."], "author": "Katina M.", "review": "Dear friends of mine had me over for mystery take-out dinner after my marital property left me solo in SF while he's in Italy on a six-week work trip.  Imagine my delight when it turned out they ordered from Zante's, a place I had been meaning to try for ever.\n\nSo, like other reviewers, I thought the traditional Indian entrees were rather greasy and meh.  Same for the stand-alone naan - it seemed soggy yet simultaneously dry to me.  \n\nOn the other hand, the pizza was BOMB.  Get this, \"The Best Indian Pizza\" is \"Topped with Spinach, Egg Plant, Cauliflower, Ginger, Garlic, Green Onions, Cilantro, Lamb, Tandoori Chicken & Prawns.\"  (For the record, I detected no prawns on the pizza, but with all the other awesome stuff that was covering the pizza, this was not a loss).  I cannot wait to go to the restaurant itself for a pitcher or two of beer.", "rating": 4, "date": "2008-02-21"}, {"excerpts": ["I placed my order for \"The Best Indian Pizza\" online at 8:33 PM.  ", "There's a note to call them if you haven't received a confirmation call from them within 15 minutes, so I did.  ", "The guy who picked up the phone made me feel like I was bothering them by calling.  ", "He confirmed that they had my order and said the pizza would arrive within 45 minutes of when I placed it.  "], "author": "Jake T.", "review": "I was really looking forward to trying out Zante Pizza, since it came highly recommended from a good friend.  I placed my order for \"The Best Indian Pizza\" online at 8:33 PM.  There's a note to call them if you haven't received a confirmation call from them within 15 minutes, so I did.  The guy who picked up the phone made me feel like I was bothering them by calling.  He confirmed that they had my order and said the pizza would arrive within 45 minutes of when I placed it.  Ok, no problem. \n\nI called back at 9:30 PM when my pizza still hadn't arrived.  They said it would be 10 minutes.\n\nI called back again 15 minutes later.  Still no pizza.\n\nThe delivery guy finally arrived an hour and a half after I'd placed the order.  The pizza was cold and tasted kind of meh.  I had three pieces and lost interest.\n\nZante Pizza was a big disappointment.", "rating": 2, "date": "2008-06-25"}, {"excerpts": ["The Best Indian Pizza.\n", "Totally called.\n", "Who doesn't love a pizza with tandoori chicken, shrimp, cilantro, garlic and love?\n", "I really was full after having just a slice, but lived large and the second slice was like a little piece of heaven."], "author": "Valarie A.", "review": "I think I'm in love!\nYup, love is a big word. \nAnd yes, I'm ready to use it for my relationship with Zante. \nI love Zante!\nThe pizza was fabulous.\nThey are so right. \nThe Best Indian Pizza.\nTotally called.\nWho doesn't love a pizza with tandoori chicken, shrimp, cilantro, garlic and love?\nI really was full after having just a slice, but lived large and the second slice was like a little piece of heaven.", "rating": 5, "date": "2007-05-07"}, {"excerpts": ["The Best Indian Pizza (vegetarian) makes me want to revisit my prior statement for more thorough evaluation.\n\n"], "author": "Jen I.", "review": "I don't like indian food.\n\nThe Best Indian Pizza (vegetarian) makes me want to revisit my prior statement for more thorough evaluation.\n\nIt doesn't matter that the garlic and the green onions will make me a veritable fart box for the next 2 days.  \n\nI guess this is why we gather and scarf down the pizza...then scatter to different corners of the apartment all of a sudden needing \"alone time\".\n\nCue Coldplay.  \"Nobody said it was easy...\"\n\nGood food sometimes does equal payback...and isolation.\n\n------------------\nUpdate 10.04.07\n\nPlease also order the veggie samosa's and proceed to stuff your face with it.  \n\nYou will not regret it.", "rating": 5, "date": "2007-08-21"}, {"excerpts": ["To me, the fact that the owners decided to carry both Indian and Italian cuisine is pretty funny since they are on opposite sides of the food spectrum, but if it were not for this strange combination, we wouldn't get the Best Indian Pizza!  \n\n"], "author": "Genoa H.", "review": "Since moving to the city, I heard tales of an Indian pizza joint, and lo and behold, I ended up moving only blocks away from said establishment.  \n\nTo me, the fact that the owners decided to carry both Indian and Italian cuisine is pretty funny since they are on opposite sides of the food spectrum, but if it were not for this strange combination, we wouldn't get the Best Indian Pizza!  \n\nI'm surprised they haven't explored any other types of Indian Pizza, but I gladly eat up the stuff as is probably every two weeks.  I especially love it because I'm lactose intolerant and I get to eat \"pizza\" that's not a pathetic sprinkling of toppings and tomato sauce....Oh, and I can't speak for any other food of theirs as I haven't felt the need to venture into other territory; it's Indian pizza or nothing for me at Zante's.", "rating": 4, "date": "2008-09-19"}, {"excerpts": ["\"The Best Indian Pizza\" is actually the name of one of their pies, and it was pretty good. ", "I think I tried some sort of Tikka Masala pizza thing which was also good. ", "I don't know if I would get it again since there are both better pizzas and better indian restaurants in town. ", "Maybe if I am in the neighborhood."], "author": "Zac H.", "review": "Its certainly worth a try. If you love pizza and you love indian food, this will be entertaining to say the least. The other food isn't half bad. Pretty standard SF indian fare. But its all about the indian pizza which, if you have an open mind, is pretty good.\n\nThe service on the other hand, is kooky.\n\n\"The Best Indian Pizza\" is actually the name of one of their pies, and it was pretty good. I think I tried some sort of Tikka Masala pizza thing which was also good. I don't know if I would get it again since there are both better pizzas and better indian restaurants in town. Maybe if I am in the neighborhood.", "rating": 3, "date": "2009-02-12"}, {"excerpts": ["The Best Indian Pizza is truly the best, but if you have too many slices of greasy cheesy buttery goodness, you and your tummy may pay the next day. "], "author": "Nima K.", "review": "I would give this place 5 stars, except you gotta watch out for your belly and the bathrooms are totally gross. \n\nThe Best Indian Pizza is truly the best, but if you have too many slices of greasy cheesy buttery goodness, you and your tummy may pay the next day. Pace yourself, if you can....\n\nI ate it in, so waiting for my 'za was a breeze.", "rating": 4, "date": "2007-11-14"}, {"excerpts": ["Our party ordered an extra large The Best Indian Pizza - which includes all 10 toppings - as well as some traditional Indian fares such as the chicken tikka masala, sag paneer, and plain & garlic nann; and we cleanly polished it all off.\n", "The Indian Pizza was definitely the main attraction of the night, especially for its uniqueness.  ", "It was good to have 10 ingredients, but the quality got lost in the quantity.  ", "Each bit was a different flavor (a little too much of garlic in my bites...) and I wish the ingredients were better evenly spread out and in bigger pieces for better taste recognition.\n", "The rest of the dishes were ok.  ", "Not bad, but the dishes were rather bland and lacked certain flavors/spices.\n", "Enjoyed the novelty and recommend it as a place to try.  ", "Also a good price point and good place for groups; came out to ~$13/person."], "author": "Carol K.", "review": "Indian Pizza?  Yes, that's right, Indian Pizza.\nA group of 7 headed down to this part of Mission with Indian Pizza as our objective.  \nOur party ordered an extra large The Best Indian Pizza - which includes all 10 toppings - as well as some traditional Indian fares such as the chicken tikka masala, sag paneer, and plain & garlic nann; and we cleanly polished it all off.\nThe Indian Pizza was definitely the main attraction of the night, especially for its uniqueness.  It was good to have 10 ingredients, but the quality got lost in the quantity.  Each bit was a different flavor (a little too much of garlic in my bites...) and I wish the ingredients were better evenly spread out and in bigger pieces for better taste recognition.\nThe rest of the dishes were ok.  Not bad, but the dishes were rather bland and lacked certain flavors/spices.\nEnjoyed the novelty and recommend it as a place to try.  Also a good price point and good place for groups; came out to ~$13/person.", "rating": 3, "date": "2010-09-05"}, {"excerpts": ["Second of all, it IS the BEST INDIAN pizza in the whole wide world. ", "When I first moved to San Francisco a couple of years ago, I ended up conspiring with a housemate to order in at least once a week. ", "Yes, we ate indian pizza for dinner - ", "no we INHALED indian pizza for dinner. ", "And in the morning, when I woke up, I would walk to the fridge and eat cold indian pizza for breakfast. ", "Yes, that is how good the tandoori chicken, lamb, cauliflower and other secret spices are. ", "Oh, and it's a breeze to order online ", "so I'd go that route instead of phoning it in. "], "author": "ray e.", "review": "First of all, Zante delivers. Second of all, it IS the BEST INDIAN pizza in the whole wide world. When I first moved to San Francisco a couple of years ago, I ended up conspiring with a housemate to order in at least once a week. Yes, we ate indian pizza for dinner - no we INHALED indian pizza for dinner. And in the morning, when I woke up, I would walk to the fridge and eat cold indian pizza for breakfast. Yes, that is how good the tandoori chicken, lamb, cauliflower and other secret spices are. Oh, and it's a breeze to order online so I'd go that route instead of phoning it in. And if you happen to be in the vicinity and do not feel like eating, get yourself a mango lassi - perfect refreshment for a hectic day.", "rating": 5, "date": "2008-02-07"}, {"excerpts": ["Get The Best Indian Pizza. ", "Do it. ", "Get the hot sauce with it. ", "Listen to the excellent Indian music. ", "Drink some Kingfisher beer too. ", "Do it."], "author": "Melinda K.", "review": "Get The Best Indian Pizza. Do it. Get the hot sauce with it. Listen to the excellent Indian music. Drink some Kingfisher beer too. Do it.", "rating": 4, "date": "2008-03-15"}, {"excerpts": ["Had the Best Indian Pizza. ", "A nice flavour. ", "Tasted like Indian food less the sauces. ", "We also had a regular pizza with pepperoni, mushroom, garlic and olives. ", "Nice garlic flavour. ", "My problem with thisis that the toppings stopped too far from the crust. ", "We also got some Indian food.", "This is where the food takes a turn. "], "author": "Andrew Y.", "review": "Pizza was good. Had the Best Indian Pizza. A nice flavour. Tasted like Indian food less the sauces. We also had a regular pizza with pepperoni, mushroom, garlic and olives. Nice garlic flavour. My problem with thisis that the toppings stopped too far from the crust. We also got some Indian food.This is where the food takes a turn. The chicken tikka masala, not that good. The naan not that good that good as well. A little dry. Not flaky. Oh well, not going to make the trip back here.", "rating": 3, "date": "2008-06-15"}, {"excerpts": ["Also, I ordered the Best Indian Pizza and there was not a prawn to be found anywhere.  ", "In general, they were pretty stingy with the meat toppings.  ", "The sauce was decent, and just about the only good thing about the pizza.  ", "On another occasion, I ordered the Chef's Special Thali.  ", "The idea is better than the execution.  ", "It's cool to be able to sample so many dishes in one meal, but not when half of them suck.  ", "Free delivery is nice and all, but both times I ordered from here, it must have taken over an hour to get my food.  ", "Additionally, a lot of stuff was spilling and the cartons were smushed.  ", "I'm never ordering from here again.  ", "And it sounds like the place is kind of a dump, so ", "I'll probably never eat there in person either.  ", "One of the delivery guys was also pretty rude to my door-person."], "author": "Saw T.", "review": "I'm Indian and I like pizza.  So I thought Indian pizza would be right up my alley.  Wrong!  First of all, the crust sucks.  It's closer to pita bread than a pizza crust.  Also, I ordered the Best Indian Pizza and there was not a prawn to be found anywhere.  In general, they were pretty stingy with the meat toppings.  The sauce was decent, and just about the only good thing about the pizza.  On another occasion, I ordered the Chef's Special Thali.  The idea is better than the execution.  It's cool to be able to sample so many dishes in one meal, but not when half of them suck.  Free delivery is nice and all, but both times I ordered from here, it must have taken over an hour to get my food.  Additionally, a lot of stuff was spilling and the cartons were smushed.  I'm never ordering from here again.  And it sounds like the place is kind of a dump, so I'll probably never eat there in person either.  One of the delivery guys was also pretty rude to my door-person.", "rating": 2, "date": "2006-12-15"}], "the best indian pizzavegetarian": [], "the best indian pizzavegan": [], "zante veggie pizza": [], "zante special pizza": [], "hawaiian pizza": [{"excerpts": ["We didn't have to wait to long and the kids loved the Hawaiian pizza. "], "author": "Art-Suzanne R.", "review": "Indian Pizza, Kingfisher Beer and great Indian dance music, what more can you ask for.  We didn't have to wait to long and the kids loved the Hawaiian pizza. We would have given it 5 stars, but we had Mango lassi's that I'm sure were made from powder mix with a really bizarre orange food coloring.", "rating": 4, "date": "2008-03-27"}], "nan rice dal makhani n korma sag panger salad and raita": [], "tandoori chicken lamb curry dal makhni sag paneer rice nan salad and raita": []}